{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 560,
        "data": [
            {
                "id": 14264,
                "hadithNumber": "6701",
                "englishNarrator": "Abu Hassan reported:",
                "hadithEnglish": "I said to Abu Huraira رضی اللہ عنہ that my two children had died. Would you narrate to me anything from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) a hadith which would soothe our hearts in our bereavements? He said: Yes. Small children are the fowls of Paradise. If one of them meets his father (or he said his parents) he would take hold of his cloth, or he said with his hand as I take hold of the hem of your cloth (with my hand). And he (the child) would not take off (his hand) from it until Allah causes his father to enter Paradise.",
                "hadithUrdu": "میں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہا : میرے وہ بچے فوت ہو گئے ہیں ، آپ ہمیں رسول اللہ صلی اللہ علیہ وسلم کی کون سی حدیث سنا سکتے ہیں جس سے آپ ہمیں ہمارے فوت ہونے والوں کے متعلق ہمارے دلوں کی تسلی دلا سکیں؟ ( ابوحسان نے ) کہا : ( حضرت ابوہریرہ رضی اللہ عنہ نے ) کہا : ہاں ۔ ( آپ صلی اللہ علیہ وسلم نے فرمایا : ) \" چھوٹے بچے جنت کے پانی کے کیڑے ہیں ( وہ جنت کے اندر ہی رہتے ہیں ) ان میں سے کوئی اپنے باپ ۔ ۔ یا فرمایا : اپنے ماں باپ ۔ ۔ کو ملے گا تو وہ اسے اس کے کپڑے سے پکڑ لے گا ۔ ۔ یا کہا : اس کے ہاتھ سے ۔ ۔ جس طرح میں نے تمہارے اس کپڑے کے کنارے سے پکڑا ہوا ہے ، پھر اس وقت تک نہیں ہٹے گا ۔ ۔ یا کہا : نہیں رکے گا ۔ ۔ یہاں تک کہ اللہ اسے اور اس کے والد کو جنت میں داخل کر دے گا ۔ \" اور سوید کی روایت میں ( ابوسلیل سے روایت ہے کے بجائے یوں ) ہے : ہمیں ابوسلیل نے حدیث سنائی ۔",
                "urduNarrator": "ہمیں سوید بن سعید اور محمد بن عبدالاعلیٰ نے حدیث بیان کی ۔ ۔ دونوں کے الفاظ ملتے جلتے ہیں ۔ ۔ دونوں نے کہا : ہمیں معتمر ( بن سلیمان تیمی ) نے اپنے والد سے روایت کی ، انہوں نے ابوسلیل سے اور انہوں نے ابوحسان سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ وَمُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى وَتَقَارَبَا فِي اللَّفْظِ قَالَا حَدَّثَنَا الْمُعْتَمِرُ عَنْ أَبِيهِ عَنْ أَبِي السَّلِيلِ عَنْ أَبِي حَسَّانَ قَالَ قُلْتُ لِأَبِي هُرَيْرَةَ إِنَّهُ قَدْ مَاتَ لِيَ ابْنَانِ فَمَا أَنْتَ مُحَدِّثِي عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِحَدِيثٍ تُطَيِّبُ بِهِ أَنْفُسَنَا عَنْ مَوْتَانَا قَالَ قَالَ نَعَمْ صِغَارُهُمْ دَعَامِيصُ الْجَنَّةِ يَتَلَقَّى أَحَدُهُمْ أَبَاهُ أَوْ قَالَ أَبَوَيْهِ فَيَأْخُذُ بِثَوْبِهِ أَوْ قَالَ بِيَدِهِ كَمَا آخُذُ أَنَا بِصَنِفَةِ ثَوْبِكَ هَذَا فَلَا يَتَنَاهَى أَوْ قَالَ فَلَا يَنْتَهِي حَتَّى يُدْخِلَهُ اللَّهُ وَأَبَاهُ الْجَنَّةَ وَفِي رِوَايَةِ سُوَيْدٍ قَالَ حَدَّثَنَا أَبُو السَّلِيلِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14265,
                "hadithNumber": "6702",
                "englishNarrator": "It was narrated from At-Taimi with this chain of narrators and he said:",
                "hadithEnglish": "\"Did you her anything from the Messenger of Allah ﷺ which will console us for our lose?\" He said: \"yes.\"",
                "hadithUrdu": "آپ نے رسول اللہ صلی اللہ علیہ وسلم سے کوئی ایسی بات سنی ہے جس سے آپ ہمارے فوت ہو جانے والوں کے حوالے سے ہمارے دلوں کو تسلی دلا سکیں؟ ( حضرت ابوہریرہ رضی اللہ عنہ نے ) کہا : ہاں ۔",
                "urduNarrator": "مجھ سے عبید اللہ بن سعید نے بیان کیا, یحییٰ بن سعید نے تیمی سے اسی سند کے ساتھ روایت کی اور کہا",
                "hadithArabic": "و حَدَّثَنِيهِ عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا يَحْيَى يَعْنِي ابْنَ سَعِيدٍ عَنْ التَّيْمِيِّ بِهَذَا الْإِسْنَادِ وَقَالَ فَهَلْ سَمِعْتَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْئًا تُطَيِّبُ بِهِ أَنْفُسَنَا عَنْ مَوْتَانَا قَالَ نَعَمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14266,
                "hadithNumber": "6703",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "A woman came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) with her child and said: Allah's Apostle, invoke Allah's blessing upon him for I have already buried three. He said: You have buried three! She said: Yes. Thereupon he (the Holy Prophet) said: You have, indeed, safeguarded yourself against the torment of Hell with a strong safeguard. 'Umar has made a mention of his father, whereas others have not made a mention of his father.",
                "hadithUrdu": "ایک عورت نبی صلی اللہ علیہ وسلم کے پاس اپنے بچے کو لے کر آئی اور کہا : اللہ کے نبی! اللہ تعالیٰ سے اس کے حق میں دعا فرمائیے ، میں تین بچے دفن کر چکی ہوں ۔ آپ نے فرمایا : \"\" تم نے تین ( بچوں ) کو دفن کیا ہے؟ \"\" اس نے کہا : جی ہاں ، آپ نے فرمایا : \"\" تم نے دوزخ سے بچنے کے لیے ایک مضبوط باڑ لگا دی ہے ۔ \"\" عمر ( بن حفص ) نے کہا : انہوں نے اپنے دادا ( طلق ) سے روایت کی اور باقیوں نے کہا : طلق سے روایت ہے اور دادا کا ذکر نہیں کیا ۔",
                "urduNarrator": "ابوبکر بن ابی شیبہ ، محمد بن عبداللہ بن نمیر اور ابوسعید اشج نے ہمیں حدیث بیان کی ۔ ۔ الفاظ ابوبکر کے ہیں ۔ ۔ انہوں نے کہا : ہمیں حفص بن غیاث نے حدیث بیان کی ، نیز ہمیں عمر بن حفص بن غیاث نے حدیث بیان کی ۔ انہوں نے کہا؛ ہمیں میرے والد نے اپنے دادا طلق بن معاویہ سے حدیث بیان کی ، انہوں نے ابوزرعہ بن عمرو بن جریر سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ وَأَبُو سَعِيدٍ الْأَشَجُّ وَاللَّفْظُ لِأَبِي بَكْرٍ قَالُوا حَدَّثَنَا حَفْصٌ يَعْنُونَ ابْنَ غِيَاثٍ ح و حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ حَدَّثَنَا أَبِي عَنْ جَدِّهِ طَلْقِ بْنِ مُعَاوِيَةَ عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ عَنْ أَبِي هُرَيْرَةَ قَالَ أَتَتْ امْرَأَةٌ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِصَبِيٍّ لَهَا فَقَالَتْ يَا نَبِيَّ اللَّهِ ادْعُ اللَّهَ لَهُ فَلَقَدْ دَفَنْتُ ثَلَاثَةً قَالَ دَفَنْتِ ثَلَاثَةً قَالَتْ نَعَمْ قَالَ لَقَدْ احْتَظَرْتِ بِحِظَارٍ شَدِيدٍ مِنْ النَّارِ قَالَ عُمَرُ مِنْ بَيْنِهِمْ عَنْ جَدِّهِ و قَالَ الْبَاقُونَ عَنْ طَلْقٍ وَلَمْ يَذْكُرُوا الْجَدَّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14267,
                "hadithNumber": "6704",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "A woman came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) with her child and said: Allah's Messenger, he is ailing, and I am afraid (that he may die), as I have already buried three. Thereupon he said: It (their sad demise) would be a protection against Hell-Fire for you. Zuhair has not mentioned the kunya of Abu Ghiyath; he has mentioned his name.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم کے پاس ایک عورت اپنے بیٹے کو لے کر آئی تو اس نے کہا : اللہ کے رسول! یہ بیمار ہے اور میں اس کے بارے میں ( سخت ) خوف کا شکار ہوں ، میں ( اپنے ) تین بچے دفن کر چکی ہوں ، آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" تم نے دوزخ سے بچنے کے لیے مضبوط باڑ بنا لی ہے ۔ \"\" زہیر نے کہا : طلق سے روایت ہے اور کنیت ( ابوغیاث ) کا ذکر نہیں کیا ۔",
                "urduNarrator": "قتیبہ بن سعید اور زہیر بن حرب نے کہا : ہمیں جریر نے طلق بن معاویہ نخعی ابوغیاث سے حدیث بیان کی ، انہوں نے ابوزرعہ بن عمرو بن جریر سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَزُهَيْرُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا جَرِيرٌ عَنْ طَلْقِ بْنِ مُعَاوِيَةَ النَّخَعِيِّ أَبِي غِيَاثٍ عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ عَنْ أَبِي هُرَيْرَةَ قَالَ جَاءَتْ امْرَأَةٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِابْنٍ لَهَا فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّهُ يَشْتَكِي وَإِنِّي أَخَافُ عَلَيْهِ قَدْ دَفَنْتُ ثَلَاثَةً قَالَ لَقَدْ احْتَظَرْتِ بِحِظَارٍ شَدِيدٍ مِنْ النَّارِ قَالَ زُهَيْرٌ عَنْ طَلْقٍ وَلَمْ يَذْكُرْ الْكُنْيَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14268,
                "hadithNumber": "6705",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: When Allah loves a servant, He calls Gabriel and says: Verily, I so and so; you should also love him, and then Gabriel begins to love him. Then he makes an announcement in the heaven saying: Allah loves so and so and you also love him, and then the inhabitants of the Heaven (the Angels) also begin to love him and then there is conferred honour upon him in the earth; and when Allah is angry with any servant He calls Gabriel and says: I am angry with such and such and you also become angry with him, and then Gabriel also becomes angry and then makes an announcement amongst the inhabitants of heaven: Verily Allah is angry with so-and so, so you also become angry with him, and thus they also become angry with him. Then he becomes the object of wrath on the earth also.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب اللہ تعالیٰ کسی بندے سے محبت کرتا ہے تو جبریل علیہ السلام کو بلاتا ہے اور فرماتا ہے : میں فلاں سے محبت کرتا ہوں تم بھی اس سے محبت کرو ، کہا : تو جبرئیل اس سے محبت کرتے ہیں ، پھر وہ آسمان میں آواز دیتے ہیں ، کہتے ہیں : اللہ تعالیٰ فلاں شخص سے محبت کرتاہے ، تم بھی اس سے محبت کرو ، چنانچہ آسمان والے اس سے محبت کرتے ہیں ، کہا : پھر اس کے لیے زمین میں مقبولیت رکھ دی جاتی ہے ، اور جب اللہ تعالیٰ کسی بندے سے بغض رکھتا ہے تو جبرئیل کو بُلا کر فرماتا ہے : میں فلاں شخص سے بغج رکھتا ہوں ، تم بھی اس سے بغض رکھو ، تو جبرئیل اس سے بغض رکھتے ہیں ، پھر وہ آسمان والوں میں اعلان کرتے ہیں کہ اللہ تعالیٰ فلاں سے بغض رکھتا ے ، تم بھی اس سے بغض رکھو ، کہا : تو وہ ( سب ) اس سے بغض رکھتے ہیں ، پھر اس کے لیے زمین میں بھی بغض رکھ دیا جاتا ہے ۔ \"",
                "urduNarrator": "ہم سے زہیر بن حرب نے بیان کیا, جریر نے سہیل سے ، انہوں نے اپنے والد ( ابوصالح ) سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ إِذَا أَحَبَّ عَبْدًا دَعَا جِبْرِيلَ فَقَالَ إِنِّي أُحِبُّ فُلَانًا فَأَحِبَّهُ قَالَ فَيُحِبُّهُ جِبْرِيلُ ثُمَّ يُنَادِي فِي السَّمَاءِ فَيَقُولُ إِنَّ اللَّهَ يُحِبُّ فُلَانًا فَأَحِبُّوهُ فَيُحِبُّهُ أَهْلُ السَّمَاءِ قَالَ ثُمَّ يُوضَعُ لَهُ الْقَبُولُ فِي الْأَرْضِ وَإِذَا أَبْغَضَ عَبْدًا دَعَا جِبْرِيلَ فَيَقُولُ إِنِّي أُبْغِضُ فُلَانًا فَأَبْغِضْهُ قَالَ فَيُبْغِضُهُ جِبْرِيلُ ثُمَّ يُنَادِي فِي أَهْلِ السَّمَاءِ إِنَّ اللَّهَ يُبْغِضُ فُلَانًا فَأَبْغِضُوهُ قَالَ فَيُبْغِضُونَهُ ثُمَّ تُوضَعُ لَهُ الْبَغْضَاءُ فِي الْأَرْضِ.",
                "headingArabic": "إِذَا أَحبّ اللّه عبدا، أمر جبرئيل فاحبّه وأحبّه أهل اسماء، ثم يوضع له القبول في الأرض",
                "headingUrdu": "جب اللہ کسی شخص سے محبت کرتا ہے۔ وہ جبرائیل کو اس سے محبت کرنے کا حکم دیتا ہے، اور وہ اس سے محبت کرتا ہے، اور اہل آسمان اس سے محبت کرتے ہیں، پھر وہ زمین پر قبولیت پاتا ہے۔",
                "headingEnglish": "When Allah Loves A Person. He Commands Jibril To Love Him, And He Loves Him, And The People Of Heaven Love Him, Then He Finds Acceptance On Earth",
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14269,
                "hadithNumber": "6706",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been reported on the authority of Suhail with the same chain of transmitters except with this variation that in the hadith transmitted on the authority of 'Ali' bin Musayyib, there is no mention of (the word) Anger .",
                "hadithUrdu": "ہم سے قتیبہ بن سعید نے بیان کیا، ہم سے یعقوب نے بیان کیا، یعنی ابن عبدالرحمٰن قاری نے اور قتیبہ نے کہا,  عبدالعزیز دراوردی ، علاء بن مسیب اور امام مالک بن انس سب نے سہیل سے اسی سند کے ساتھ روایت کی ، البتہ علاء بن مسیب کی حدیث میں بغض کا ذکر نہیں ہے ( صرف محبت کرنے کی بات ہے ۔ )",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا يَعْقُوبُ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْقَارِيَّ وَقَالَ قُتَيْبَةُ حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي الدَّرَاوَرْدِيَّ ح و حَدَّثَنَاه سَعِيدُ بْنُ عَمْرٍو الْأَشْعَثِيُّ أَخْبَرَنَا عَبْثَرٌ عَنْ الْعَلَاءِ بْنِ الْمُسَيَّبِ ح و حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ حَدَّثَنَا ابْنُ وَهْبٍ حَدَّثَنِي مَالِكٌ وَهُوَ ابْنُ أَنَسٍ كُلُّهُمْ عَنْ سُهَيْلٍ بِهَذَا الْإِسْنَادِ غَيْرَ أَنَّ حَدِيثَ الْعَلَاءِ بْنِ الْمُسَيَّبِ لَيْسَ فِيهِ ذِكْرُ الْبُغْضِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14270,
                "hadithNumber": "6707",
                "englishNarrator": "Suhail bin Abi Salih, reported:",
                "hadithEnglish": "We were in Arafa that there happened to pass Umar bin Abdul-'Aziz and he was the Amir of Hajj. People stood up in order to catch a glimpse of him. I said to my father: Father, I think that Allah loves Umar bin Abdul-'Aziz. He said: How is it? I said: It is because of the love in people's heart for him. Thereupon he said: By One Who created your father, I heard Abu Huraira رضی اللہ عنہ narrating from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) a hadith like one transmitted on the authority of Suhail.",
                "hadithUrdu": "ہم عرفہ میں تھے کہ حضرت عمر بن عبدالعزیز کا وہاں سے گذر ہوا اور وہ حج کے امیر تھے ، لوگ کھڑے ہو کر انہیں دیکھنے لگے ، میں نے اپنے والد سے کہا : ابا جان! میں یہ دیکھ رہا ہوں کہ اللہ تعالیٰ عمر بن عبدالعزیز سے محبت کرتا ہے ، انہوں نے پوچھا : اس کا کیا سبب ہے؟ میں نے کہا : اس لیے کہ لوگوں کے دلوں میں ان کی محبت پائی جاتی ہے ، انہوں ( ابوصالح ) نے کہا : تیرا باپ قربان ہو! تم نے حضرت ابوہریرہ رضی اللہ عنہ سے رسول اللہ صلی اللہ علیہ وسلم کی حدیث سنی ہے ۔ اس کے بعد انہوں نے سہیل سے جریر کی روایت کردہ حدیث بیان کی ۔",
                "urduNarrator": "مجھ سے عمرو الناقد نے بیان کیا، کہا ہم سے یزید بن ہارون نے بیان کیا، انہوں نے بیان کیا:عبدالعزیز بن عبداللہ بن ابی سلمی ماجثون نے سہیل سے ، انہوں نے ابوصالح سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي عَمْرٌو النَّاقِدُ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي سَلَمَةَ الْمَاجِشُونُ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ قَالَ كُنَّا بِعَرَفَةَ فَمَرَّ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ وَهُوَ عَلَى الْمَوْسِمِ فَقَامَ النَّاسُ يَنْظُرُونَ إِلَيْهِ فَقُلْتُ لِأَبِي يَا أَبَتِ إِنِّي أَرَى اللَّهَ يُحِبُّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ قَالَ وَمَا ذَاكَ قُلْتُ لِمَا لَهُ مِنْ الْحُبِّ فِي قُلُوبِ النَّاسِ فَقَالَ بِأَبِيكَ أَنْتَ سَمِعْتُ أَبَا هُرَيْرَةَ يُحَدِّثُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ جَرِيرٍ عَنْ سُهَيْلٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14271,
                "hadithNumber": "6708",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) Saying: Souls are troops collected together and those who familiarised with each other (in the heaven from where these come) would have affinity, with one another (in the world) and those amongst them who opposed each other (in the Heaven) would also be divergent (in the world).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" روحیں ایک دوسرے کے ساتھ رہنے والی جماعتیں ہیں ۔ اور جو لوگ ایک دوسرے سے واقف ہوں گے (جہاں سے یہ آئیں گے) ایک دوسرے سے (دنیا میں) وابستگی ہوں گی اور ان میں سے جو ایک دوسرے کے مخالف ہوں گے وہ بھی (جنت میں) اختلاف کریں گے۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے عبدالعزیز نے بیان کیا، انہوں نے کہا کہ ہم سے سہیل نے بیان کیا،  انہوں نے اپنے والد سے، وہ حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُحَمَّدٍ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْأَرْوَاحُ جُنُودٌ مُجَنَّدَةٌ فَمَا تَعَارَفَ مِنْهَا ائْتَلَفَ وَمَا تَنَاكَرَ مِنْهَا اخْتَلَفَ.",
                "headingArabic": "الأَرْوَاحِ جُنُودٌ مُجَنَّدَةٌ ‏ ‏",
                "headingUrdu": "روحیں بھرتی فوجیوں کی طرح ہوتی ہیں۔",
                "headingEnglish": "Souls Are Like Conscripted Soldiers",
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14272,
                "hadithNumber": "6709",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ narrated directly from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), He said:",
                "hadithEnglish": "People are like mines of gold and silver; those who were excellent in Jahiliya (during the days of ignorance) are excellent In Islam, when they have, an understanding, and the souls are troops collected together and those who had a mutual familiarity amongst themselves in the store of prenatal existence would have affinity amongst them, (in this world also) and those who opposed one of them, would be at variance with one another.",
                "hadithUrdu": "\" لوگ سونے چاندی کی کانوں کی طرح معدنیات کی کانیں ہیں ، جو زمانہ جاہلیت میں اچھے تھے وہ اگر دین کو سمجھ لیں تو زمانہ اسلام میں بھی اچھے ہیں ۔ اور روحیں ایک ساتھ رہنے والی جماعتیں ہیں جو آپس میں ( ایک جیسی صفات کی بنا پر ) ایک دوسرے کو پہنچاننے لگیں ان میں یکجائی پیدا ہو گئی اور جو ( صفات کے اختلاف کی بنا پر ) ایک دوسرے سے گریزاں رہیں ، وہ باہم مختلف ہو گئیں ۔ \"",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے کثیر بن ہشام نے بیان کیا، ہم سے جعفر بن برقان نے بیان کیا, یزید بن اصم نے حضرت ابوہریرہ رضی اللہ عنہ سے مرفوعا ایک حدیث بیان کی ، کہا",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا كَثِيرُ بْنُ هِشَامٍ حَدَّثَنَا جَعْفَرُ بْنُ بُرْقَانَ حَدَّثَنَا يَزِيدُ بْنُ الْأَصَمِّ عَنْ أَبِي هُرَيْرَةَ بِحَدِيثٍ يَرْفَعُهُ قَالَ النَّاسُ مَعَادِنُ كَمَعَادِنِ الْفِضَّةِ وَالذَّهَبِ خِيَارُهُمْ فِي الْجَاهِلِيَّةِ خِيَارُهُمْ فِي الْإِسْلَامِ إِذَا فَقُهُوا وَالْأَرْوَاحُ جُنُودٌ مُجَنَّدَةٌ فَمَا تَعَارَفَ مِنْهَا ائْتَلَفَ وَمَا تَنَاكَرَ مِنْهَا اخْتَلَفَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14273,
                "hadithNumber": "6710",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "A desert Arab said to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌): When would be the Last Hour? Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: What preparation have you made for that? Thereupon he said: The love of Allah and of His Messenger (that is my preparation for the Last Hour) (for the Day of Resurrection). Thereupon he (the Holy Prophet) said: You would be along with one whom you love.",
                "hadithUrdu": "ایک اعرابی نے رسول اللہ صلی اللہ علیہ وسلم سے پوچھا : قیامت کب آئے گی؟ رسول اللہ صلی اللہ علیہ وسلم نے اس سے فرمایا : \" تم نے اس کے لیے کیا تیار کر رکھا ہے؟ \" اس نے کہا : اللہ اور اس کے رسول کی محبت ۔ آپ نے فرمایا : \" تم اسی کے ساتھ ہو گے جس سے تم کو محبت ہے ۔ \"",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ بن قعنب نے بیان کیا، ہم سے مالک نے بیان کیا, اسحاق بن عبداللہ بن ابی طلحہ نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ حَدَّثَنَا مَالِكٌ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ أَعْرَابِيًّا قَالَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَتَى السَّاعَةُ قَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أَعْدَدْتَ لَهَا قَالَ حُبَّ اللَّهِ وَرَسُولِهِ قَالَ أَنْتَ مَعَ مَنْ أَحْبَبْتَ.",
                "headingArabic": "الْمَرْءُ مَعَ مَنْ أَحَبَّ ‏ ‏",
                "headingUrdu": "انسان ان کے ساتھ ہوگا جن سے وہ محبت کرتا ہے۔",
                "headingEnglish": "A Man Will Be With Those Whom He Loves",
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14274,
                "hadithNumber": "6711",
                "englishNarrator": "Anas رضی اللہ عنہ reported:",
                "hadithEnglish": "A person said to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ): When would be the Last Hour? He (the Holy Prophet) said: What preparation have you made for that? And he gave no details, but said: I love Allah and His Messenger. Thereupon he (the Holy Prophet) said: You would be along with one whom you love.",
                "hadithUrdu": "ایک شخص نے پوچھا : اللہ کے رسول! قیامت کب ہو گی؟ آپ نے فرمایا : تم نے اس کے لیے کیا تیار کی ہے؟ \" اس نے زیادہ چیزوں کا ذکر نہیں کیا ، ( چند ایک کاموں کا ذکر کر سکا ) اس نے کہا : اور لیکن میں اللہ اور اس کے رسول صلی اللہ علیہ وسلم سے محبت کرتا ہوں ، آپ نے فرمایا : \" تم اس کے ساتھ ہو گے جس سے تمہیں محبت ہے ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، عمرو ناقد، زہیر بن حرب اور محمد بن عبداللہ بن نمیر ابی عمر نے بیان کیا۔ اور تلفظ زہیر کے لیے ہے, سفیان نے زہری سے ، انہوں نے حضرت انس رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ وَابْنُ أَبِي عُمَرَ وَاللَّفْظُ لِزُهَيْرٍ قَالُوا حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ أَنَسٍ قَالَ قَالَ رَجُلٌ يَا رَسُولَ اللَّهِ مَتَى السَّاعَةُ قَالَ وَمَا أَعْدَدْتَ لَهَا فَلَمْ يَذْكُرْ كَبِيرًا قَالَ وَلَكِنِّي أُحِبُّ اللَّهَ وَرَسُولَهُ قَالَ فَأَنْتَ مَعَ مَنْ أَحْبَبْتَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14275,
                "hadithNumber": "6712",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported through another chain of transmitters:",
                "hadithEnglish": "A desert Arab came to Allah's Messenger (may peace be upon, him), the rest of the hadith is the same but with this variation that he said: I have not made much preparations which merit appreciation for myself.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے پاس ایک اعرابی آیا ، اسی ( سابقہ حدیث ) کے مانند مگر ( اس میں ہے کہ ) اس نے کہا : میں نے اس کے لیے کچھ زیادہ تیار نہیں کی جس پر میں اپنی تعریف کر سکوں ( لیکن میں اللہ اور اس کے رسول صلی اللہ علیہ وسلم سے محبت کرتا ہوں ۔ )",
                "urduNarrator": "مجھ سے محمد بن رافع اور عبد بن حمید نے بیان کیا۔ ہم سے عبد نے بیان کیا، اور ابن رافع نے کہا: ہم سے عبد الرزاق نے بیان کیا, معمر نے زہری سے روایت کی ، انہوں نے کہا : مجھے حضرت انس بن مالک رضی اللہ عنہ نے حدیث سنائی کہ",
                "hadithArabic": "حَدَّثَنِيهِ مُحَمَّدُ بْنُ رَافِعٍ وَعَبْدُ بْنُ حُمَيْدٍ قَالَ عَبْدٌ أَخْبَرَنَا وَقَالَ ابْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ أَنَّ رَجُلًا مِنْ الْأَعْرَابِ أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ مَا أَعْدَدْتُ لَهَا مِنْ كَثِيرٍ أَحْمَدُ عَلَيْهِ نَفْسِي.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14276,
                "hadithNumber": "6713",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "A person came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and said to Allah's Messenger: When would be the Last Hour? Thereupon he (the Holy Prophet) said: What preparation have you made for the Last Hour? He said: The love of Allah and of His Messenger (is my only preparation). Thereupon he (the Holy Prophet) said: You would be along with one whom you love. Anas رضی اللہ عنہ said: Nothing pleased us more after accepting Islam than the words of Allah's Apostle: You would be along with one whom you love. And Anas رضی اللہ عنہ said. I love Allah and His Messenger and Abu Bakr and Umar رضی اللہ عنہما , and I hope that I would be along with them although I have not acted like them.",
                "hadithUrdu": "ایک شخص رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کی : اللہ کے رسول! قیامت کب ہو گی؟ آپ نے فرمایا : \"\" تم نے اس کے لیے کیا تیار کیا ہے؟ \"\" اس نے کہا : اللہ اور اس کے رسول صلی اللہ علیہ وسلم کی محبت ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" تم اسی کے ساتھ ہو گے جس سے تم کو محبت ہو گی ۔ \"\" حضرت انس رضی اللہ عنہ نے کہا : اسلام قبول کرنے کے بعد ہمیں نبی صلی اللہ علیہ وسلم کے اس ارشاد سے بڑھ کر اور کسی بات سے اتنی خوشی نہیں ہوئی : \"\" تم اس کے ساتھ ہو گے جس سے تم کو محبت ہو گی ۔ \"\" حضرت انس رضی اللہ عنہ نے کہا : میں اللہ اور اس کے رسول صلی اللہ علیہ وسلم اور ابوبکر اور عمر رضی اللہ عنہما سے محبت کرتا ہوں اور مجھے امید ہے کہ میں ان کے ساتھ ہوں گا ، ہر چند کہ میں نے ان کی طرح عمل نہیں کیے ۔",
                "urduNarrator": "مجھے ابو الربیع العتکی نے بتایا, حماد بن زید نے کہا : ہمیں ثابت بنانی نے حضرت انس بن مالک رضی اللہ عنہ سے حدیث بیان کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنِي أَبُو الرَّبِيعِ الْعَتَكِيُّ حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ حَدَّثَنَا ثَابِتٌ الْبُنَانِيُّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ مَتَى السَّاعَةُ قَالَ وَمَا أَعْدَدْتَ لِلسَّاعَةِ قَالَ حُبَّ اللَّهِ وَرَسُولِهِ قَالَ فَإِنَّكَ مَعَ مَنْ أَحْبَبْتَ قَالَ أَنَسٌ فَمَا فَرِحْنَا بَعْدَ الْإِسْلَامِ فَرَحًا أَشَدَّ مِنْ قَوْلِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِنَّكَ مَعَ مَنْ أَحْبَبْتَ قَالَ أَنَسٌ فَأَنَا أُحِبُّ اللَّهَ وَرَسُولَهُ وَأَبَا بَكْرٍ وَعُمَرَ فَأَرْجُو أَنْ أَكُونَ مَعَهُمْ وَإِنْ لَمْ أَعْمَلْ بِأَعْمَالِهِمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14277,
                "hadithNumber": "6714",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported: Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) this hadith through another chain of transmitters but he did not make mention of the words of Anas رضی اللہ عنہ :",
                "hadithEnglish": "I love, and what follows subsequently.",
                "hadithUrdu": "میں ( اللہ اور اس کے رسول صلی اللہ علیہ وسلم ) سے محبت کرتا ہوں ، اور اس کے بعد والی بات بیان نہیں کی ۔",
                "urduNarrator": "ہم سے محمد بن عبید الغبری نے بیان کیا, جعفر بن سلیمان نے ہمیں حدیث سنائی ، کہا : ہمیں ثابت بنانی نے حضرت انس بن مالک رضی اللہ عنہ سے حدیث سنائی ، انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی اور انہوں نے حضرت انس رضی اللہ عنہ کا یہ قول کہ",
                "hadithArabic": "حَدَّثَنَاه مُحَمَّدُ بْنُ عُبَيْدٍ الْغُبَرِيُّ حَدَّثَنَا جَعْفَرُ بْنُ سُلَيْمَانَ حَدَّثَنَا ثَابِتٌ الْبُنَانِيُّ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يَذْكُرْ قَوْلَ أَنَسٍ فَأَنَا أُحِبُّ وَمَا بَعْدَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14278,
                "hadithNumber": "6715",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and I were coming out of the mosque that we met a person on the threshold of the mosque and he said to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ): When would be the Last Hour? Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: What preparation have you made for that? The man became silent and then said: Allah's Messenger, I have made no significant preparation with prayer and fasting and charity but I, however, love Allah and His Messenger. Thereupon (the Holy Prophet) said: You would be along with one whom you love.",
                "hadithUrdu": "ایک بار جب میں اور رسول اللہ صلی اللہ علیہ وسلم مسجد سے نکل رہے تھے تو مسجد کی چوکھٹ کے پاس ہماری ایک شخص سے ملاقات ہوئی ، اس نے کہا : اللہ کے رسول! قیامت کب ہے؟ آپ نے فرمایا : \" تم نے اس کے لیے کیا تیار کیا ہے؟ تو جیسے وہ ٹھٹھک گیا ، پھر اس نے کہا : اللہ کے رسول! میں نے اس کے لیے بہت زیادہ نمازیں ، بہت زیادہ روزے اور بہت زیادہ صدقات تو تیار نہیں کیے ، لیکن میں اللہ اور اس کے رسول صلی اللہ علیہ وسلم سے محبت رکھتا ہوں ، آپ نے فرمایا : \" تم اسی کے ساتھ ہو گے جس سے تمہیں محبت ہو گی ۔ \"",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ نے بیان کیا اور ہم سے اسحاق بن ابراہیم نے بیان کیا اور ہم سے عثمان نے جریر نے بیان کیا, منصور نے سالم بن ابی جعد سے روایت کی ، انہوں نے کہا : ہمیں حضرت انس بن مالک رضی اللہ عنہ نے حدیث بیان کی ، کہا",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ إِسْحَقُ أَخْبَرَنَا و قَالَ عُثْمَانُ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ قَالَ بَيْنَمَا أَنَا وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَارِجَيْنِ مِنْ الْمَسْجِدِ فَلَقِينَا رَجُلًا عِنْدَ سُدَّةِ الْمَسْجِدِ فَقَالَ يَا رَسُولَ اللَّهِ مَتَى السَّاعَةُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أَعْدَدْتَ لَهَا قَالَ فَكَأَنَّ الرَّجُلَ اسْتَكَانَ ثُمَّ قَالَ يَا رَسُولَ اللَّهِ مَا أَعْدَدْتُ لَهَا كَبِيرَ صَلَاةٍ وَلَا صِيَامٍ وَلَا صَدَقَةٍ وَلَكِنِّي أُحِبُّ اللَّهَ وَرَسُولَهُ قَالَ فَأَنْتَ مَعَ مَنْ أَحْبَبْتَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14279,
                "hadithNumber": "6716",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Anas رضی اللہ عنہ through another chain of transmitters.",
                "hadithUrdu": "مجھ سے محمد بن یحییٰ بن عبدالعزیز یشکری نے بیان کیا، کہا ہم سے عبداللہ بن عثمان بن جبلہ نے بیان کیا، مجھ سے میرے والد نے شعبہ کے بارے میں بیان کیا, عمرو بن مرہ نے سالم بن ابی جعد سے ، انہوں نے حضرت انس رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ يَحْيَى بْنِ عَبْدِ الْعَزِيزِ الْيَشْكُرِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُثْمَانَ بْنِ جَبَلَةَ أَخْبَرَنِي أَبِي عَنْ شُعْبَةَ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ أَنَسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14280,
                "hadithNumber": "6717",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been reported on the authority of Anas رضی اللہ عنہ with different chains of transmitters.",
                "hadithUrdu": "ہمیں قتیبہ نے بتایا, ابوعوانہ ، شعبہ اور ہشام نے قتادہ سے ، انہوں نے حضرت انس رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے یہی حدیث روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ أَنَسٍ ح و حَدَّثَنَا ابْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ سَمِعْتُ أَنَسًا ح و حَدَّثَنَا أَبُو غَسَّانَ الْمِسْمَعِيُّ وَمُحَمَّدُ بْنُ الْمُثَنَّى قَالَا حَدَّثَنَا مُعَاذٌ يَعْنِي ابْنَ هِشَامٍ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ أَنَسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْحَدِيثِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14281,
                "hadithNumber": "6718",
                "englishNarrator": "Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "A person came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and said to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌): What is your opinion about the person who loves the people but his (acts or deeds are not identical to theirs)? Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: A person would be along with one whom he loves.",
                "hadithUrdu": "ایک شخص رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا ، اس نے کہا : اللہ کے رسول! آپ اس شخص کو کیسے دیکھتے ہیں جو کسی قوم سے محبت کرتا ہے مگر ابھی تک اس کے ساتھ نہیں ملا؟ ( اعمال میں ان سے بہت پیچھے ہے ) رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" آدمی اسی کے ساتھ ہو گا جس سے وہ محبت کرتا ہے ۔ \"",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ نے بیان کیا اور ہم سے اسحاق بن ابراہیم نے بیان کیا اور عثمان نے کہا, جریر نے ( سلیمان ) اعمش سے ، انہوں نے ابووائل سے ، انہوں نے حضرت عبداللہ ( بن مسعود رضی اللہ عنہ ) سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ إِسْحَقُ أَخْبَرَنَا و قَالَ عُثْمَانُ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي وَائِلٍ عَنْ عَبْدِ اللَّهِ قَالَ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ كَيْفَ تَرَى فِي رَجُلٍ أَحَبَّ قَوْمًا وَلَمَّا يَلْحَقْ بِهِمْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَرْءُ مَعَ مَنْ أَحَبَّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14282,
                "hadithNumber": "6719",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been transmitted on the authority of 'Abdullah رضی اللہ عنہ .",
                "hadithUrdu": "ہم سے محمد بن المثنیٰ اور ابن بشر نے بیان کیا، انہوں نے کہا: ہم سے ابن ابی عدی نے بیان کیا، اور ہم سے بشر بن خالد نے بیان کیا، کہا: ہم سے محمد یعنی ابن جعفر نے بیان کیا۔ ان دونوں شعبہ اور سلیمان بن قرم نے سلیمان ( اعمش ) سے ، انہوں نے ابووائل سے ، انہوں نے عبداللہ ( بن مسعود رضی اللہ عنہ ) سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ ح و حَدَّثَنِيهِ بِشْرُ بْنُ خَالِدٍ أَخْبَرَنَا مُحَمَّدٌ يَعْنِي ابْنَ جَعْفَرٍ كِلَاهُمَا عَنْ شُعْبَةَ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبُو الْجَوَّابِ حَدَّثَنَا سُلَيْمَانُ بْنُ قَرْمٍ جَمِيعًا عَنْ سُلَيْمَانَ عَنْ أَبِي وَائِلٍ عَنْ عَبْدِ اللَّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14283,
                "hadithNumber": "6720",
                "englishNarrator": null,
                "hadithEnglish": "Abu Musa رضی اللہ عنہ, reported that a person came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) ; the rest of the hadith is the same.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، کہا: ابومعاویہ اور محمد بن عبید نے اعمش سے ، انہوں نے ( ابووائل ) شقیق سے اور انہوں نے ابوموسیٰ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : نبی صلی اللہ علیہ وسلم کے پاس ایک شخص آیا ، پھر اعمش سے جریر کی روایت کے مانند حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ وَمُحَمَّدُ بْنُ عُبَيْدٍ عَنْ الْأَعْمَشِ عَنْ شَقِيقٍ عَنْ أَبِي مُوسَى قَالَ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلٌ فَذَكَرَ بِمِثْلِ حَدِيثِ جَرِيرٍ عَنْ الْأَعْمَشِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14284,
                "hadithNumber": "6721",
                "englishNarrator": "Abu Dharr رضی اللہ عنہ reported:",
                "hadithEnglish": "It was said to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ): What is your opinion about the person who has done good deeds and the people praise him? He said: It is glad tidings for a believer (which he has received in this mortal world).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم سے عرض کی گئی : آپ کا کیا خیال ہے کہ ایک شخص اچھے کام کرتا ہے اور لوگ اس کی تعریف کرتے ہیں؟ آپ نے فرمایا : \" یہ مومن کے لیے فوری بشارت ہے ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ التمیمی، ابو الربیع اور ابو کامل فضیل بن حسین نے بیان کیا اور یحییٰ کا قول ہے کہ یحییٰ نے ہمیں خبر دی اور کہا۔ باقی دوحماد بن زید نے ابوعمران جونی سے ، انہوں نے عبداللہ بن صامت سے ، انہوں نے حضرت ابوذر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ وَأَبُو الرَّبِيعِ وَأَبُو كَامِلٍ فُضَيْلُ بْنُ حُسَيْنٍ وَاللَّفْظُ لِيَحْيَى قَالَ يَحْيَى أَخْبَرَنَا و قَالَ الْآخَرَانِ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ عَنْ أَبِي ذَرٍّ قَالَ قِيلَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرَأَيْتَ الرَّجُلَ يَعْمَلُ الْعَمَلَ مِنْ الْخَيْرِ وَيَحْمَدُهُ النَّاسُ عَلَيْهِ قَالَ تِلْكَ عَاجِلُ بُشْرَى الْمُؤْمِنِ.",
                "headingArabic": "إِذَا أُثْنِيَ عَلَى الصَّالِحِ فَهِيَ بُشْرَى وَلاَ تَضُرُّهُ ‏ ‏",
                "headingUrdu": "اگر کسی نیک آدمی کی تعریف کی جائے تو یہ اس کے لیے خوشخبری ہے اور اسے نقصان نہیں پہنچائے گی۔",
                "headingEnglish": "If A Righteous Man Is Praised, It Is Glad Tidings For Him And Will Not Harm Him",
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14285,
                "hadithNumber": "6722",
                "englishNarrator": "This hadith has been narrated through another chain of transmitters also and the one transmitted on the authority of Shu'ba (the words are):",
                "hadithEnglish": "People love him. In the hadith transmitted on the authority of 'Abd-us-Samad (the words are): People praise him as stated by Hammad.",
                "hadithUrdu": "\" اور لوگ اس کی وجہ سے اس کے ساتھ محبت کرتے ہیں ۔ \" اور عبدالصمد کی حدیث میں ہے : \" اور لوگ اس کی تعریف کرتے ہیں \" جس طرح حماد نے کہا ہے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور اسحاق بن ابراہیم نے بیان کیا, وکیع ، محمد بن جعفر ، عبدالصمد اور نضر سب نے شعبہ سے ، انہوں نے ابوعمران جونی سے حماد بن زید کی سند کے ساتھ ، اسی کی حدیث کے مانند روایت کی ، مگر شعبہ سے عبدالصمد کے سوا ( باقی ) سب کی حدیث میں ہے",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ عَنْ وَكِيعٍ ح و حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنِي عَبْدُ الصَّمَدِ ح و حَدَّثَنَا إِسْحَقُ أَخْبَرَنَا النَّضْرُ كُلُّهُمْ عَنْ شُعْبَةَ عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ بِإِسْنَادِ حَمَّادِ بْنِ زَيْدٍ بِمِثْلِ حَدِيثِهِ غَيْرَ أَنَّ فِي حَدِيثِهِمْ عَنْ شُعْبَةَ غَيْرَ عَبْدِ الصَّمَدِ وَيُحِبُّهُ النَّاسُ عَلَيْهِ وَفِي حَدِيثِ عَبْدِ الصَّمَدِ وَيَحْمَدُهُ النَّاسُ كَمَا قَالَ حَمَّادٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14286,
                "hadithNumber": "6723",
                "englishNarrator": "Abdullah (bin Mas'ud) رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) who is the most truthful (of the human beings) and his being truthful (is a fact) said: Verily your creation is on this wise. The constituents of one of you are collected for forty days in his mother's womb in the form of blood, after which it becomes a clot of blood in another period of forty days. Then it becomes a lump of flesh and forty days later Allah sends His angel to it with instructions concerning four things, so the angel writes down his livelihood, his death, his deeds, his fortune and misfortune. By Him, besides Whom there is no god, that one amongst you acts like the people deserving Paradise until between him and Paradise there remains but the distance of a cubit, when suddenly the writing of destiny overcomes him and he begins to act like the denizens of Hell and thus enters Hell, and another one acts in the way of the denizens of Hell, until there remains between him and Hell a distance of a cubit that the writing of destiny overcomes him and then he begins to act like the people of Paradise and enters Paradise.",
                "hadithUrdu": "اللہ کے رسول صلی اللہ علیہ وسلم اور وہ سچ بتاتے ہیں اور انہیں ( وحی کے ذریعے سے ) سچ بتایا جاتا ہے نے فرمایا : \" تم میں سے ہر ایک شخص کا مادہ تخلیق چالیس دن تک اس کی ماں کے پیٹ میں اکٹھا کیا جاتا ہے ، پھر وہ اتنی مدت ( چالیس دن ) کے لیے علقہ ( جونک کی طرح رحم کی دیوار کے ساتھ چپکا ہوا ) رہتا ہے ، پھر اتنی ہی مدت کے لیے مُضغہ کی شکل میں رہتا ہے ( جس میں ریڑھ کی ہڈی کے نشانات دانت سے چبائے جانے کے نشانات سے مشابہ ہوتے ہیں ۔ ) پھر اللہ تعالیٰ فرشتے کو بھیجتا ہے جو ( پانچویں مہینے نیوروسیل ، یعنی دماغ کی تخلیق ہو جانے کے بعد ) اس میں روح پھونکتا ہے ۔ اور اسے چار باتوں کا حکم دیا جاتا ہے کہ اس کا رزق ، اس کی عمر ، اس کا عمل اور یہ کہ وہ خوش نصیب ہو گا یا بدنصیب ، لکھ لیا جائے ۔ مجھے اس ذات کی قسم جس کے سوا کوئی عبادت کے لائق نہیں! تم میں سے کوئی ایک شخص اہل جنت کے سے عمل کرتا رہتا ہے ، یہاں تک کہ جب اس کے اور جنت کے درمیان ایک بالشت کا فاصلہ رہ جاتا ہے تو ( اللہ کے علم کے مطابق ) لکھا ہوا اس پر غالب آ جاتا ہے تو وہ اہل جہنم کا عمل کر لیتا ہے اور اس ( جہنم ) میں داخل ہو جاتا ہے ۔ اور تم میں سے ایک شخص اہل جہنم کے سے عمل کرتا رہتا ہے حتی کہ اس کے اور جہنم کے درمیان ایک بالشت کا فاصلہ رہ جاتا ہے تو ( اللہ کے علم کے مطابق ) لکھا ہوا اس پر غالب آ جاتا ہے اور وہ اہل جنت کا عمل کر لیتا ہے اور اس ( جنت ) میں داخل ہو جاتا ہے ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے ابو معاویہ اور وکیع نے بیان کیا، اور ہم سے محمد بن عبداللہ بن نمیر ہمدانی ، ابومعاویہ اور وکیع نے ہمیں حدیث بیان کی ، انہوں نے کہا : ہمیں اعمش نے زید بن وہب سے حدیث بیان کی ، انہوں نے حضرت عبداللہ ( بن مسعود ) رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو مُعَاوِيَةَ وَوَكِيعٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ الْهَمْدَانِيُّ وَاللَّفْظُ لَهُ حَدَّثَنَا أَبِي وَأَبُو مُعَاوِيَةَ وَوَكِيعٌ قَالُوا حَدَّثَنَا الْأَعْمَشُ عَنْ زَيْدِ بْنِ وَهْبٍ عَنْ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ الصَّادِقُ الْمَصْدُوقُ إِنَّ أَحَدَكُمْ يُجْمَعُ خَلْقُهُ فِي بَطْنِ أُمِّهِ أَرْبَعِينَ يَوْمًا ثُمَّ يَكُونُ فِي ذَلِكَ عَلَقَةً مِثْلَ ذَلِكَ ثُمَّ يَكُونُ فِي ذَلِكَ مُضْغَةً مِثْلَ ذَلِكَ ثُمَّ يُرْسَلُ الْمَلَكُ فَيَنْفُخُ فِيهِ الرُّوحَ وَيُؤْمَرُ بِأَرْبَعِ كَلِمَاتٍ بِكَتْبِ رِزْقِهِ وَأَجَلِهِ وَعَمَلِهِ وَشَقِيٌّ أَوْ سَعِيدٌ فَوَالَّذِي لَا إِلَهَ غَيْرُهُ إِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ حَتَّى مَا يَكُونُ بَيْنَهُ وَبَيْنَهَا إِلَّا ذِرَاعٌ فَيَسْبِقُ عَلَيْهِ الْكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ فَيَدْخُلُهَا وَإِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ حَتَّى مَا يَكُونُ بَيْنَهُ وَبَيْنَهَا إِلَّا ذِرَاعٌ فَيَسْبِقُ عَلَيْهِ الْكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ فَيَدْخُلُهَا.",
                "headingArabic": "كَيْفِيَّةِ خَلْقِ الْآدَمِيِّ فِي بَطْنِ أُمِّهِ وَكِتَابَةِ رِزْقِهِ وَأَجَلِهِ وَعَمَلِهِ وَشَقَاوَتِهِ وَسَعَادَتِهِ",
                "headingUrdu": "ماں کے پیٹ میں انسان کی تخلیق کیسے کی جاتی ہے اور اس کا رزق، عمر اور اعمال لکھے جاتے ہیں، اور اس کے مصائب اور خوشی",
                "headingEnglish": "How The Human Being Is Created, In His Mother's Womb, And His Provision, Lifespan And Deeds Are Written Down, And His Misery and Happiness",
                "chapterId": "47",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 147,
                    "chapterNumber": "47",
                    "chapterEnglish": "The Book of Destiny",
                    "chapterUrdu": "تقدیر کا بیان",
                    "chapterArabic": "كتاب الْقَدَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14287,
                "hadithNumber": "6724",
                "englishNarrator": "This hadith has been reported on the authority of A'mash with the same chain of transmitters and in the hadith transmitted on the authority of Waki' (the words are):",
                "hadithEnglish": "The creation of any one of you is like this that (semen) is collected in the womb of the mother for forty nights, and in the hadith transmitted on the authority of Shu'ba (the words are): Forty nights and forty days. And in the hadith transmitted on the authority of Jarir and 'Isa (the words are): Forty days.",
                "hadithUrdu": "\" تم میں سے ایک انسان کا مادہ تخلیق چالیس راتوں تک اپنی ماں کے پیٹ میں اکٹھا ( ہونے کے مرحلے میں ) ہوتا ہے ۔ \" اور شعبہ سے معاذ کی حدیث میں \" چالیس راتیں یا چالیس دن \" اور جریر اور عیسیٰ کی حدیث میں \" چالیس دن \" ہے ۔",
                "urduNarrator": "عثمان بن ابی شیبہ اور اسحٰق بن ابراہیم نے ہمیں حدیث بیان کی ، دونوں نے جریر بن عبدالحمید سے روایت کی ، نیز ہمیں اسحق بن ابراہیم نے عیسیٰ بن یونس سے خبر دی ۔ اور ابوسعید اشج نے مجھے بیان کیا ، کہا : ہمیں وکیع نے حدیث بیان کی کہ عبیداللہ بن معاذ نے کہا : ہمیں میرے والد نے حدیث بیان کی ، انہوں نے کہا : ہمیں شعبہ بن حجاج نے حدیث بیان کی ، ان سب ( جریر ، عیسیٰ ، وکیع اور شعبہ ) نے اعمش سے ، اسی سند کے ساتھ روایت کی ۔ وکیع کی حدیث میں کہا",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ كِلَاهُمَا عَنْ جَرِيرِ بْنِ عَبْدِ الْحَمِيدِ ح و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ ح و حَدَّثَنِي أَبُو سَعِيدٍ الْأَشَجُّ حَدَّثَنَا وَكِيعٌ ح و حَدَّثَنَاه عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ بْنُ الْحَجَّاجِ كُلُّهُمْ عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ قَالَ فِي حَدِيثِ وَكِيعٍ إِنَّ خَلْقَ أَحَدِكُمْ يُجْمَعُ فِي بَطْنِ أُمِّهِ أَرْبَعِينَ لَيْلَةً و قَالَ فِي حَدِيثِ مُعَاذٍ عَنْ شُعْبَةَ أَرْبَعِينَ لَيْلَةً أَرْبَعِينَ يَوْمًا وَأَمَّا فِي حَدِيثِ جَرِيرٍ وَعِيسَى أَرْبَعِينَ يَوْمًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "47",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 147,
                    "chapterNumber": "47",
                    "chapterEnglish": "The Book of Destiny",
                    "chapterUrdu": "تقدیر کا بیان",
                    "chapterArabic": "كتاب الْقَدَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14288,
                "hadithNumber": "6725",
                "englishNarrator": "Hudhaifa bin Usaid رضی اللہ عنہ reported directly from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌):",
                "hadithEnglish": "He ﷺ said: When the drop of (semen) remains in the womb for forty or fifty (days) or forty nights, the angel comes and says: My Lord, will he be good or evil? And both these things would be written. Then the angel says: My Lord, would he be male or female? And both these things are written. And his deeds and actions, his death, his livelihood; these are also recorded. Then his document of destiny is rolled and there is no addition to nor subtraction from it.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" جب نطفہ ( چالیس چالیس دنوں کے دو مرحلوں کے بعد تیسرے مرحلے میں ) چالیس یا پینتالیس راتیں رحم میں ٹھہرا رہتا ہے تو ( اللہ کا مقرر کیا ہوا ) فرشتہ اس کے پاس جاتا ہے اور کہتا ہے : اے رب! یہ خوش نصیب ہو گا یا بدنصیب ہو گا؟ تو دونوں ( باتوں میں سے اللہ کو بتائے اس ) کو لکھ لیا جاتا ہے ، پھر کہتا ہے : اے رب! یہ مرد ہے یا عورت؟ پھر دونوں ( میں سے جو اللہ بتائے اس ) کو لکھ لیا جاتا ہے ، پھر اس کا عمل ، اس کے قدموں کے نشانات ، اس کی مدت عمر اور اس کا رزق لکھ لیا جاتا ہے ، پھر ( اندراج کے ) صحیفے لپیٹ دیے جاتے ہیں ، پھر ان میں کوئی چیز بڑھائی جاتی ہے ، نہ کم کی جاتی ہے ۔ \"",
                "urduNarrator": "ہم سے محمد بن عبداللہ بن نمیر اور زہیر بن حرب نے بیان کیا، اور یہ قول ابن نمیر نے بیان کیا، انہوں نے کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا, عمرو بن دینار نے ابوطفیل ( عامر بن واثلہ رضی اللہ عنہ ) سے ، انہوں نے حذیفہ بن اسید رضی اللہ عنہ سے روایت کی, جو انہوں نے نبی صلی اللہ علیہ وسلم تک پہنچائی ( مرفوع بیان کی )",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ وَزُهَيْرُ بْنُ حَرْبٍ وَاللَّفْظُ لِابْنِ نُمَيْرٍ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ أَبِي الطُّفَيْلِ عَنْ حُذَيْفَةَ بْنِ أَسِيدٍ يَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَدْخُلُ الْمَلَكُ عَلَى النُّطْفَةِ بَعْدَ مَا تَسْتَقِرُّ فِي الرَّحِمِ بِأَرْبَعِينَ أَوْ خَمْسَةٍ وَأَرْبَعِينَ لَيْلَةً فَيَقُولُ يَا رَبِّ أَشَقِيٌّ أَوْ سَعِيدٌ فَيُكْتَبَانِ فَيَقُولُ أَيْ رَبِّ أَذَكَرٌ أَوْ أُنْثَى فَيُكْتَبَانِ وَيُكْتَبُ عَمَلُهُ وَأَثَرُهُ وَأَجَلُهُ وَرِزْقُهُ ثُمَّ تُطْوَى الصُّحُفُ فَلَا يُزَادُ فِيهَا وَلَا يُنْقَصُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "47",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 147,
                    "chapterNumber": "47",
                    "chapterEnglish": "The Book of Destiny",
                    "chapterUrdu": "تقدیر کا بیان",
                    "chapterArabic": "كتاب الْقَدَرِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 13976,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=559",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=557",
                "label": "557",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=558",
                "label": "558",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=559",
                "label": "559",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=560",
                "label": "560",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=561",
                "label": "561",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=562",
                "label": "562",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=563",
                "label": "563",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=561",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=561",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=559",
        "to": 14000,
        "total": 40465
    }
}