{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 524,
        "data": [
            {
                "id": 13364,
                "hadithNumber": "5801",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: There is no transitive disease, no divination, but good omen pleases me. It was said: What is good omen? He said: Sacred words.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے فرما یا : \" کسی سے کو ئی مرض خود بخود نہیں لگتا براشگون کی کو ئی چیز نہیں اور مجھے نیک فال اچھی لگتی ہے ۔ \" کہا آپ سے عرض کی گئی : نیک فال کیا ہے ؟فر ما یا : \" پاکیزہ کلمہ ( دعایا حوصلہ افزائی یا دا نا ئی پر مبنی کو ئی جملہ ۔ )",
                "urduNarrator": "ہم سے محمد بن المثنیٰ اور ابن بشار نے بیان کیا، کہا: ہمیں محمد بن جعفر نے خبر دی، شعبہ نے کہا , میں قتادہ سے سنا ، وہ حضرت انس بن مالک رضی اللہ عنہ سے حدیث روایت کر رہے تھے کہ",
                "hadithArabic": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، سَمِعْتُ قَتَادَةَ، يُحَدِّثُ عَنْ أَنَسِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا عَدْوَى، وَلَا طِيَرَةَ، وَيُعْجِبُنِي الْفَأْلُ» قَالَ قِيلَ: وَمَا الْفَأْلُ؟ قَالَ: «الْكَلِمَةُ الطَّيِّبَةُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13365,
                "hadithNumber": "5802",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: There is no transitive disease, no divination, but I like good words.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" کسی پر لازمی طور پر بیمار ی لگ جا نے کی کو ئی حقیقت نہیں بد شگونی کو ئی شے نہیں اور میں اچھی فال کو پسند کرتا ہوں ۔ \"",
                "urduNarrator": "مجھ سے حجاج بن الشاعر نے بیان کیا، مجھ سے مولا بن اسد نے بیان کیا، ہم سے عبدالعزیز بن مختار نے بیان کیا, یحییٰ بن عتیق نے کہا : ہمیں محمد بن سیرین نے حضرت ابوہریرہ رضی اللہ عنہ سے حدیث بیان کی ، کہا",
                "hadithArabic": "وحَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنِي مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُخْتَارٍ، حَدَّثَنَا يَحْيَى بْنُ عَتِيقٍ، حَدَّثَنَا مُحَمَّدُ بْنُ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا عَدْوَى، وَلَا طِيَرَةَ، وَأُحِبُّ الْفَأْلَ الصَّالِحَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13366,
                "hadithNumber": "5803",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: There is no transitive disease, no hama, no divination, but I like good omen.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" لا زمی طور پر خود بخود کسی سے بیمار ی لگ جا نے کی کو ئی حقیقت نہیں ، کھوپڑی سے الونکلنا کو ئی چیز نہیں ، بد شگونی کچھ نہیں اور میں نیک فا ل کو پسند کرتا ہوں ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے یزید بن ہارون نے بیان کیا, ہشام بن حسان نے محمد بن سیرین سے انھوں نے ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا هِشَامُ بْنُ حَسَّانٍ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا عَدْوَى، وَلَا هَامَةَ، وَلَا طِيَرَةَ، وَأُحِبُّ الْفَأْلَ الصَّالِحَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13367,
                "hadithNumber": "5804",
                "englishNarrator": "Abdullah bin 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: If there be bad luck, it is in the house, and the wife, and the horse.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : عدم موافقت ( ناسزاداری ) گھری ، عورت اور گھوڑے میں ہو سکتی ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ بن قعنب نے بیان کیا، کہا ہم سے مالک بن انس نے بیان کیا اور ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا : امام مالک نے ابن شہاب سے ، انھوں نے عبد اللہ بن عمر رضی اللہ عنہ کے دو بیٹوں حمزہ اور سالم سے ، انھوں نے حضرت عبد اللہ بن عمر رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنَا عَبْدُ اللهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ حَمْزَةَ، وَسَالِمٍ، ابْنَيْ عَبْدِ اللهِ بْنِ عُمَرَ، عَنْ عَبْدِ اللهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الشُّؤْمُ فِي الدَّارِ، وَالْمَرْأَةِ، وَالْفَرَسِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13368,
                "hadithNumber": "5805",
                "englishNarrator": "Abdullah bin 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying. There is no transitive disease, no ill omen, and bad luck is lound in the house, or wife or horse.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" کسی سے خود بخود مرض کا لگ جا نا اور بد شگونی کی کو ئی حقیقت نہیں ۔ ناموافقت تین چیزوں میں ہو تی ہے ۔ عورت گھوڑے اور گھر میں ۔ \"",
                "urduNarrator": "ہم سے ابو الطاہر اور حرملہ بن یحییٰ نے بیان کیا، کہا کہ ہم سے ابن وہب نے بیان کیا, یو نس نے ابن شہاب سے ، انھوں نے بن عمر رضی اللہ عنہ کے دوبیٹوں حمزہ اور سالم سے ، انھوں نے حضرت عبد اللہ بن عمر رضی اللہ عنہ سے روایت کی",
                "hadithArabic": "وَحَدَّثَنَا أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، قَالَا: أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ حَمْزَةَ، وَسَالِمٍ، ابْنَيْ عَبْدِ اللهِ بْنِ عُمَرَ، عَنْ عَبْدِ اللهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: لَا عَدْوَى وَلَا طِيَرَةَ وَإِنَّمَا الشُّؤْمُ فِي ثَلَاثَةٍ: الْمَرْأَةِ، وَالْفَرَسِ، وَالدَّارِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13369,
                "hadithNumber": "5806",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like that of Malik (no. 5805) was narrated from Salim, from his father, from the Messenger of Allah ﷺ concerning Ash-Shum. None of them mentioned 'Adwa and Tiyarah in the hadith of Ibn 'Umar رضی اللہ عنہ , except Yunus bin Yazid.",
                "hadithUrdu": "ہم سے ابن ابی عمر نے بیان کیا, سفیان ، صالح ، عقیل ، بن خا لد ، عبد الرحمٰن بن اسحٰق اور شعیب ، ان سب نے زہری سے ، انھوں نے سالم سے ، انھوں نے اپنے والد ( ابن معر رضی اللہ عنہ ) سے انھوں نے ناموافقت کے بارے میں نبی صلی اللہ علیہ وسلم سے امام مالک کی حدیث کے مانند بیان کیا ، یو نس بن یزید کے علاوہ ان میں سے کسی نے ابن عمر رضی اللہ عنہ کی حدیث میں \"\" کسی بیماری کے خو د بخود کسی دوسرے کو لگ جا نے اور بد شگونی \"\" کا ذکر نہیں کیا ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، وَحَمْزَةَ، ابْنَيْ عَبْدِ اللهِ، عَنْ أَبِيهِمَا، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، ح وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، عَنْ سُفْيَانَ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، ح وحَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمٍ وَحَمْزَةَ، ابْنَيْ عَبْدِ اللهِ بْنِ عُمَرَ، عَنْ عَبْدِ اللهِ بْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، ح وحَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ بْنِ سَعْدٍ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي عُقَيْلُ بْنُ خَالِدٍ، ح وَحَدَّثَنَاهُ يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا بِشْرُ بْنُ الْمُفَضَّلِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ إِسْحَاقَ، ح وحَدَّثَنِي عَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ كُلُّهُمْ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فِي الشُّؤْمِ، بِمِثْلِ حَدِيثِ مَالِكٍ لَا يَذْكُرُ أَحَدٌ مِنْهُمْ فِي حَدِيثِ ابْنِ عُمَرَ الْعَدْوَى وَالطِّيَرَةَ، غَيْرُ يُونُسَ بْنِ يَزِيدَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13370,
                "hadithNumber": "5807",
                "englishNarrator": "Umar bin Muhammad bin Zaid رضی اللہ عنہ reported:",
                "hadithEnglish": "He heard his father narrating from Ibn 'Umar رضی اللہ عنہ that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had said. If bad luck is a fact, then it is in the horse, the woman and the house.",
                "hadithUrdu": "وہ حضرت ابن عمر رضی اللہ عنہ سے حدیث بیان کر رہے تھے کہ انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ، آپ صلی اللہ علیہ وسلم نے فر ما یا : \" اگر کسی چیز میں کسی ناموافقت کا ہو نا بر حق ہو سکتا ہے تو وہ گھوڑے عورت اور مکان میں ہے ۔ \"",
                "urduNarrator": "ہم سے احمد بن عبداللہ بن الحکم نے بیان کیا, محمد بن جعفر نے کہا , ہمیں شعبہ نے عمر بن محمد بن یزید سے حدیث بیان کی انھوں نے اپنے والد سے سنا",
                "hadithArabic": "وَحَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللهِ بْنِ الْحَكَمِ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عُمَرَ بْنِ مُحَمَّدِ بْنِ زَيْدٍ، أَنَّهُ سَمِعَ أَبَاهُ، يُحَدِّثُ عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: «إِنْ يَكُنْ مِنَ الشُّؤْمِ شَيْءٌ حَقٌّ، فَفِي الْفَرَسِ، وَالْمَرْأَةِ، وَالدَّارِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13371,
                "hadithNumber": "5808",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters but there is no mention of the word Haqq (fact).",
                "hadithUrdu": "ہارون بن عبداللہ نے مجھ سے کہا, روح بن عبادہ نے کہا ,  شعبہ نے ہمیں اسی سند کے ساتھ اسی کے مانند حدیث سنائی لیکن انوھں نے \" برحق \" نہیں کہا : ( امکان یہی ہے کہ وہ حدیث روایت بالمعنی ہے .)",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللهِ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا شُعْبَةُ، بِهَذَا الْإِسْنَادِ مِثْلَهُ، وَلَمْ يَقُلْ: حَقٌّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13372,
                "hadithNumber": "5809",
                "englishNarrator": "Abdullah bin 'Umar رضی اللہ عنہ reported on the authority of his father:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: If there is bad luck in anything, it is the horse, the abode and the woman.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" اگر کسی چیز میں عدم موافقت ہو تو گھوڑے ، مکان اور عورت میں ہو گی ۔ \"",
                "urduNarrator": "مجھ سے ابوبکر بن اسحاق نے بیان کیا، کہا ہم سے ابن ابی مریم نے بیان کیا، کہا ہم سے سلیمان بن بلال نے بیان کیا، کہا کہ مجھ سے عتبہ بن مسلمہ نے بیان کیا, حمزہ بن عبد اللہ بن عمر نے اپنے والد ( حضرت عبد اللہ بن عمر رضی اللہ عنہ ) سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنِي أَبُو بَكْرِ بْنُ إِسْحَاقَ، حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا سُلَيْمَانُ بْنُ بِلَالٍ، حَدَّثَنِي عُتْبَةُ بْنُ مُسْلِمٍ، عَنْ حَمْزَةَ بْنِ عَبْدِ اللهِ بْنِ عُمَرَ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنْ كَانَ الشُّؤْمُ فِي شَيْءٍ فَفِي الْفَرَسِ، وَالْمَسْكَنِ، وَالْمَرْأَةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13373,
                "hadithNumber": "5810",
                "englishNarrator": "Sahl bin Sa'd رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: If bad luck were to be in anything, it is found in the woman, the horse and the abode.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے فر ما یا : \" اگر یہ بات ہو تو عورت ، گھوڑے اور گھر میں ہو گی ۔ \" آپ کی مراد عدم موافقت سے تھی ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ بن قعنب نے بیان کیا, امام مالک نے ابو حازم سے ، انھوں نے حضرت سہل بن سعد رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنَا عَبْدُ اللهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا مَالِكٌ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنْ كَانَ، فَفِي الْمَرْأَةِ وَالْفَرَسِ وَالْمَسْكَنِ» - يَعْنِي الشُّؤْمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13374,
                "hadithNumber": "5811",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Sahl bin Sa'd رضی اللہ عنہ with a different chain of transmitters.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے الفضل بن دکین نے بیان کیا, ہشام بن سعد نے ابو حازم سے ، انھوں نے حضرت سہل بن سعد رضی اللہ عنہ سے ، انھوں نے نبی صلی اللہ علیہ وسلم سے اس کے مانند حدیث روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ، حَدَّثَنَا هِشَامُ بْنُ سَعْدٍ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13375,
                "hadithNumber": "5812",
                "englishNarrator": "Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: If bad luck were to be in anything, it is found in the land, in the servant and in the horse.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : اگر کسی چیز میں یہ بات ہو گی تو گھر ، کادم اور گھوڑےمیں ہو گی ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم الحنظلی نے بیان کیا، کہا ہم سے عبداللہ بن حارث نے بیان کیا, ابن جریج نے کہا : مجھے ابو زبیر نے بتا یا کہ انھوں نے حضرت جابر رضی اللہ عنہ سے سنا ، وہ رسول اللہ صلی اللہ علیہ وسلم سے خبردے رہے تھے کہ",
                "hadithArabic": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظلِيُّ، أَخْبَرَنَا عَبْدُ اللهِ بْنُ الْحَارِثِ، عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرًا، يُخْبِرُ عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنْ كَانَ فِي شَيْءٍ فَفِي الرَّبْعِ، وَالْخَادِمِ، وَالْفَرَسِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13376,
                "hadithNumber": "5813",
                "englishNarrator": "Mu'awiya bin al-Hakam as-Sulami رضی اللہ عنہ reported:",
                "hadithEnglish": "I said: Messenger of Allah, there were things we used to do in the pre-Islamic days. We used to visit Kahins, whereupon he said: Don't visit Kahins. I said: We used to take omens. He said: That is a sort of personal whim of yours, so let it not prevent you (from doing a thing).",
                "hadithUrdu": "میں نے عرض کی : اللہ کے رسول اللہ صلی اللہ علیہ وسلم !کچھ کا م ایسے تھے جو ہم زمانے جاہلیت میں کیا کرتے تھے ہم کا ہنوں کے پاس جا تے تھے آپ صلی اللہ علیہ وسلم نے فر ما یا \" تم کا ہنوں کے پاس نہ جا یا کرو ۔ \" میں نے عرض کی : ہم بد شگونی لیتے تھے ، آپ نے فر ما یا : \" یہ ( بدشگونی ) محض ایک خیال ہے جو کو ئی انسان اپنے دل میں محسوس کرتا ہے ، یہ تمھیں ( کسی کام سے ) نہ روکے ۔ \"",
                "urduNarrator": "مجھ سے ابو الطاہر اور حرملہ بن یحییٰ نے بیان کیا، کہا کہ ہم سے ابن وہب نے بیان کیا, یو نس نے ابن شہاب سے ، انھوں نے ابو سلمہ بن عبد الرحمٰن بن عوف سے ، انھوں نے حضرت معاویہ بن حکم سلمی رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، قَالَا: أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، عَنْ مُعَاوِيَةَ بْنِ الْحَكَمِ السُّلَمِيِّ، قَالَ: قُلْتُ: يَا رَسُولَ اللهِ أُمُورًا كُنَّا نَصْنَعُهَا فِي الْجَاهِلِيَّةِ، كُنَّا نَأْتِي الْكُهَّانَ، قَالَ: «فَلَا تَأْتُوا الْكُهَّانَ» قَالَ قُلْتُ: كُنَّا نَتَطَيَّرُ قَالَ: «ذَاكَ شَيْءٌ يَجِدُهُ أَحَدُكُمْ فِي نَفْسِهِ، فَلَا يَصُدَّنَّكُمْ».",
                "headingArabic": "تَحْرِيمِ الْكِهَانَةِ وَإِتْيَانِ الْكُهَّانِ ‏‏",
                "headingUrdu": "کاہن کہنے اور کاہن کے پاس جانے کی ممانعت",
                "headingEnglish": "The Prohibition Of Soothsaying And Going To Soothsayers",
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13377,
                "hadithNumber": "5814",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been transmitted on the authority of Zuhri with a slight variation of wording.",
                "hadithUrdu": "مجھ سے محمد بن رافع نے بیان کیا، کہا کہ حوزین نے، یعنی ابن المثنیٰ نے، کہا کہ ہم سے لیث نے بیان کیا, عقیل معمر ، ابن ابی ذئب اور مالک ، ان سب نے زہری سے اسی سند کے ساتھ یو نس کی حدیث کے ہم معنی روایت کی ، مگر مالک نے اپنی حدیث میں بدشگونی کا نام لیا ہے ، اس میں کا ہنوں کا ذکر نہیں ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنِي حُجَيْنٌ يَعْنِي ابْنَ الْمُثَنَّى، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَا: أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، ح وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا شَبَابَةُ بْنُ سَوَّارٍ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، أَخْبَرَنَا إِسْحَاقُ بْنُ عِيسَى، أَخْبَرَنَا مَالِكٌ كُلُّهُمْ، عَنِ الزُّهْرِيِّ بِهَذَا الْإِسْنَادِ، مِثْلَ مَعْنَى حَدِيثِ يُونُسَ، غَيْرَ أَنَّ مَالِكًا فِي حَدِيثِهِ ذَكَرَ الطِّيَرَةَ، وَلَيْسَ فِيهِ ذِكْرُ الْكُهَّانِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13378,
                "hadithNumber": "5815",
                "englishNarrator": "This hadith has been narrated on the authority of Mu'awiya bin Hakam as-Sulami through another chain of transmitters. The hadith transmitted on the authority of Yahya bin Abu Kathir (there is an addition of these words):",
                "hadithEnglish": "I said: Among us there are men who draw lines and thus make divination. What about this? Thereupon he (the Holy Prophet) said: There was a Prophet who drew lines, so whose lines agree with his line for him it is allowable.",
                "hadithUrdu": "میں نے عرض کی : ہم میں ایسے لو گ ہیں جو ( مستقبل کا حال بتا نے کے لیے ) لکیریں کھینچتے ہیں ۔ آپ صلی اللہ علیہ وسلم نے فر ما یا : \" انبیاء علیہ السلام میں سے ایک نبی تھے جو لکیریں کھینچتے تھے ، جو ان کی لکیروں سے موافقت کرگیا تو وہ ٹھیک ہے ۔ \"",
                "urduNarrator": "ہم سے محمد بن الصباح اور ابوبکر بن ابی شیبہ نے بیان کیا، کہا: ہم سے اسماعیل جو کہ ابن اولیاء نے بیان کیا,حجاج صواف اور اوزاعی ، دونوں نے یحییٰ بن ابی کثیر سے ، انھوں نے ہلال بن ابی میمونہ سے ، انھوں نے عطا ء بن یسار سے ، انھوں نے معاویہ بن حکم سلمہ رضی اللہ تعالیٰ عنہ سے ، انھوں نے نبی صلی اللہ علیہ وسلم سے زہری کی ابو سلمہ سے اور ان کی معاویہ سے روایت کردہ حدیث کے مانند روایت کی ، اور یحییٰ بن ابی کثیر کی حدیث میں یہ الفا ظ زائد بیان کیے ، کہا",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، قَالَا: حَدَّثَنَا إِسْمَاعِيلُ وَهُوَ ابْنُ عُلَيَّةَ، عَنْ حَجَّاجٍ الصَّوَّافِ،\r\nوَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا الْأَوْزَاعِيُّ، كِلَاهُمَا عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ هِلَالِ بْنِ أَبِي مَيْمُونَةَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ مُعَاوِيَةَ بْنِ الْحَكَمِ السُّلَمِيِّ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، بِمَعْنَى حَدِيثِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ مُعَاوِيَةَ، وَزَادَ فِي حَدِيثِ يَحْيَى بْنِ أَبِي كَثِيرٍ قَالَ: قُلْتُ: وَمِنَّا رِجَالٌ يَخُطُّونَ قَالَ: «كَانَ نَبِيٌّ مِنَ الْأَنْبِيَاءِ يَخُطُّ، فَمَنْ وَافَقَ خَطَّهُ فَذَاكَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13379,
                "hadithNumber": "5816",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "I said: Allah's Messenger, the kahins used to tell us about things (unseen) and we found them to be true. Thereupon he said: That is a word pertaining to truth which a jinn snatches and throws into the ear of his friend, and makes an addition of one hundred lies to it.",
                "hadithUrdu": "میں نے عرض کی : اللہ کے رسول اللہ صلی اللہ علیہ وسلم !کا ہن کسی چیز کے بارے میں جو ہمیں بتا یا کرتے تھے ( ان میں سےکچھ ) ہم درست پاتے تھے ۔ آپ صلی اللہ علیہ وسلم نے فر ما یا : \" وہ سچی بات ہو تی ہے جسے کو ئی جن اچک لیتا ہے اور وہ اس کو اپنے دوست ( کا ہن ) کے کا ن میں پھونک دیتا ہے اور اس ایک سچ میں سوجھوٹ ملا دیتا ہے ۔ \"",
                "urduNarrator": "ہم سے عبد بن حمید نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا, معمر نے زہر ی سے ، انھوں نے یحییٰ بن عروہ بن زبیر سے ، انھوں نے اپنے والد سے ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ يَحْيَى بْنِ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ: قُلْتُ: يَا رَسُولَ اللهِ إِنَّ الْكُهَّانَ كَانُوا يُحَدِّثُونَنَا بِالشَّيْءِ فَنَجِدُهُ حَقًّا قَالَ: «تِلْكَ الْكَلِمَةُ الْحَقُّ، يَخْطَفُهَا الْجِنِّيُّ فَيَقْذِفُهَا فِي أُذُنِ وَلِيِّهِ، وَيَزِيدُ فِيهَا مِائَةَ كَذْبَةٍ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13380,
                "hadithNumber": "5817",
                "englishNarrator": "Urwa reported from 'A'isha رضی اللہ عنہا :",
                "hadithEnglish": "She said that people asked Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) about the kahins. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to them: It is nothing (i. e. it is a mere superstition). They said: Allah's Messenger, they at times narrate to us things which we find true. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: That is a word pertaining to truth which a jinn snatches away and then cackles into the ear of his friend as the hen does. And then they mix in it more than one hundred lies.",
                "hadithUrdu": "لو گوں نے رسول اللہ صلی اللہ علیہ وسلم سے کا ہنوں کے متعلق سوال کیا تو رسول اللہ صلی اللہ علیہ وسلم نے فر مایا : \"\" وہ کچھ نہیں ہیں ۔ \"\" صحابہ کرام رضوان اللہ عنھم اجمعین نے عرض کی : اللہ کے رسول اللہ صلی اللہ علیہ وسلم !وہ لو گ بعض اوقات ایسی چیز بتاتے ہیں جو سچ نکلتی ہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : وہ جنوں کی بات ہو تی ہے ، ایک جن اسے ( آسمان کے نیچے سے ) اچک لیتا تھا پھر وہ اسے اپنے دوست ( کا ہن ) کے کان میں مرغی کی کٹ کٹ کی طرح کٹکٹاتا رہتا ہے ۔ اور وہ اس ( ایک ) بات میں سو زیادہ جھوٹ ملا دیتا ہے ۔ \"\"",
                "urduNarrator": "مجھ سے سلمہ بن شبیب نے بیان کیا، کہا ہم سے حسن بن عیان نے بیان کیا, معقل بن عبید اللہ نے زہری سے روایت کی ، کہا : مجھے یحییٰ بن عروہ نے بتا یا کہ انھوں نے عروہ سے سنا ، وہ کہہ رہے تھے کہ حضرت عائشہ رضی اللہ عنہا نے کہا",
                "hadithArabic": "حَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ وَهُوَ ابْنُ عُبَيْدِ اللهِ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي يَحْيَى بْنُ عُرْوَةَ، أَنَّهُ سَمِعَ عُرْوَةَ، يَقُولُ: قَالَتْ عَائِشَةُ: سَأَلَ أُنَاسٌ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ الْكُهَّانِ؟ فَقَالَ لَهُمْ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَيْسُوا بِشَيْءٍ» قَالُوا: يَا رَسُولَ اللهِ فَإِنَّهُمْ يُحَدِّثُونَ أَحْيَانًا الشَّيْءَ يَكُونُ حَقًّا، قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «تِلْكَ الْكَلِمَةُ مِنَ الْجِنِّ يَخْطَفُهَا الْجِنِّيُّ، فَيَقُرُّهَا فِي أُذُنِ وَلِيِّهِ قَرَّ الدَّجَاجَةِ، فَيَخْلِطُونَ فِيهَا أَكْثَرَ مِنْ مِائَةِ كَذْبَةٍ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13381,
                "hadithNumber": "5818",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Zuhri with the same chain of transmitters.",
                "hadithUrdu": "مجھ سے ابو الطاہر نے بیان کیا، کہا ہم سے عبداللہ بن وہب نے بیان کیا، مجھ سے محمد بن عمرو نے بیان کیا, ابن جریج نے ابن شہاب سے اسی سند کے ساتھ معقل کی زہری سے روایت کردہ حدیث کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، أَخْبَرَنِي مُحَمَّدُ بْنُ عَمْرٍو، عَنِ ابْنِ جُرَيْجٍ، عَنِ ابْنِ شِهَابٍ، بِهَذَا الْإِسْنَادِ، نَحْوَ رِوَايَةِ مَعْقِلٍ، عَنِ الزُّهْرِيِّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13382,
                "hadithNumber": "5819",
                "englishNarrator": "Abdullah Ibn 'Abbas رضی اللہ عنہ reported:",
                "hadithEnglish": "A person from the Ansar who was amongst the Companions of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) reported to me: As we were sitting during the night with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), a meteor shot gave a dazzling light. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: What did you say in the pre-Islamic days when there was such a shot (of meteor)? They said: Allah and His Messenger know best (the actual position), but we, however, used to say that that very night a great man had been born and a great man had died, whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: (These meteors) are shot neither at the death of anyone nor on the birth of anyone. Allah, the Exalted and Glorious, issues Command when He decides to do a thing. Then (the Angels) supporting the Throne sing His glory, then sing the dwellers of heaven who are near to them until this glory of God reaches them who are in the heaven of this world. Then those who are near the supporters of the Throne ask these supporters of the Throne: What your Lord has said? And they accordingly inform them what He says. Then the dwellers of heaven seek information from them until this information reaches the heaven of the world. In this process of transmission (the jinn snatches) what he manages to overhear and he carries it to his friends. And when the Angels see the jinn they attack them with meteors. If they narrate only which they manage to snatch that is correct but they alloy it with lies and make additions to it.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے ساتھیوں میں سے ایک انصاری نے مجھے بتا یا کہ ایک بار وہ لو گ رات کے وقت رسول اللہ صلی اللہ علیہ وسلم کے ساتھ بیٹھے ہو ئے تھے ۔ کہ ایک ستا رے سے کسی چیز کو نشانہ بنایا گیا اور وہ روشن ہو گیا تو رسول اللہ صلی اللہ علیہ وسلم نے ان سے فر ما یا : \" جب جاہلیت میں اس طرح ستارے سے نشانہ لگا یا جا تا تھا ۔ تو تم لوگ کیا کہا کرتے تھے؟لوگوں نے کہا : اللہ اور اس کا رسول زیادہ جا ننے والے ہیں ہم یہی کہا : کرتے تھے ۔ کہ آج رات کسی عظیم انسان کی ولادت ہو ئی ہے اور کو ئی عظیم انسان فوت ہوا ہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" اسے کسی کی زندگی یا موت کی بنا پر نشانے کی طرف نہیں چھوڑا جا تا ، بلکہ ہمارا رب ، اس کا نام برکت والا اور اونچا ہے ، جب کسی کام کا فیصلہ فر ما تا ہے تو حاملین عرش ( زورسے ) تسبیح کرتے ہیں ، پھر ان سے نیچے والے آسمان کے فرشتے تسبیح کا ورد کرتے ہیں ۔ یہاں تک کہ تسبیح کا ورد ( دنیا کے ) اس آسمان تک پہنچ جا تا ہے ، پھر حاملین عرش کے قریب کے فرشتے حاملین عرش سے پو چھتے ہیں تمھا رے پروردیگا ر نے کیا فرمایا؟وہ انھیں بتا تے ہیں کہ اس نے کیا فر ما یا پھر ( مختلف ) آسمانوں والے ایک دوسرے سے پو چھتے ہیں ، یہاں تک کہ وہ خبر دنیا کے اس آسمان تک پہنچ جا تی ہے تو جن بھی جلدی سے اس کی کچھ سماعت اچکتے ہیں اور اپنے دوستوں ( کا ہنوں ) تک دے چھینکتے ہیں ( اس خبر کو پہنچادیتے ہیں ) خبروہ صحیح طور پر لا تے ہیں وہ سچ تو ہو تی ہے لیکن وہ اس میں جھوٹ ملا تے اور اضافہ کردیتے ہیں ۔",
                "urduNarrator": "ہم سے حسن بن علی الحلوانی اور عبد بن حمید نے بیان کیا، حسن نے کہا ,ہم سے یعقوب نے بیان کیا، اور عبد نے کہا: یعقوب بن ابراہیم بن سعد، میرے والد نے ہمیں بتایا، صالح نے ابن شہا ب سے ، روایت کی : کہا مجھے علی بن حسین ( زین العابدین ) نے حدیث سنا ئی کہ حضرت عبد اللہ بن عباس رضی اللہ عنہ نے کہا",
                "hadithArabic": "حَدَّثَنَا حَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ حَسَنٌ: حَدَّثَنَا يَعْقُوبُ، وَقَالَ عَبْدٌ: حَدَّثَنِي يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي عَلِيُّ بْنُ حُسَيْنٍ، أَنَّ عَبْدَ اللهِ بْنَ عَبَّاسٍ، قَالَ: أَخْبَرَنِي رَجُلٌ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنَ الْأَنْصَارِ، أَنَّهُمْ بَيْنَمَا هُمْ جُلُوسٌ لَيْلَةً مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ رُمِيَ بِنَجْمٍ فَاسْتَنَارَ، فَقَالَ لَهُمْ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَاذَا كُنْتُمْ تَقُولُونَ فِي الْجَاهِلِيَّةِ، إِذَا رُمِيَ بِمِثْلِ هَذَا؟» قَالُوا: اللهُ وَرَسُولُهُ أَعْلَمُ، كُنَّا نَقُولُ وُلِدَ اللَّيْلَةَ رَجُلٌ عَظِيمٌ، وَمَاتَ رَجُلٌ عَظِيمٌ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «فَإِنَّهَا لَا يُرْمَى بِهَا لِمَوْتِ أَحَدٍ وَلَا لِحَيَاتِهِ، وَلَكِنْ رَبُّنَا تَبَارَكَ وَتَعَالَى اسْمُهُ، إِذَا قَضَى أَمْرًا سَبَّحَ حَمَلَةُ الْعَرْشِ، ثُمَّ سَبَّحَ أَهْلُ السَّمَاءِ الَّذِينَ يَلُونَهُمْ، حَتَّى يَبْلُغَ التَّسْبِيحُ أَهْلَ هَذِهِ السَّمَاءِ الدُّنْيَا» ثُمَّ قَالَ: الَّذِينَ يَلُونَ حَمَلَةَ الْعَرْشِ لِحَمَلَةِ الْعَرْشِ: مَاذَا قَالَ رَبُّكُمْ؟ فَيُخْبِرُونَهُمْ مَاذَا قَالَ: قَالَ فَيَسْتَخْبِرُ بَعْضُ أَهْلِ السَّمَاوَاتِ بَعْضًا، حَتَّى يَبْلُغَ الْخَبَرُ هَذِهِ السَّمَاءَ الدُّنْيَا، فَتَخْطَفُ الْجِنُّ السَّمْعَ فَيَقْذِفُونَ إِلَى أَوْلِيَائِهِمْ، وَيُرْمَوْنَ بِهِ، فَمَا جَاءُوا بِهِ عَلَى وَجْهِهِ فَهُوَ حَقٌّ، وَلَكِنَّهُمْ يَقْرِفُونَ فِيهِ وَيَزِيدُونَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13383,
                "hadithNumber": "5820",
                "englishNarrator": null,
                "hadithEnglish": "It was narrate from Az-Zuhri with this chain of narrators (a similar hadith to no. 5819). In the Hadith of Yunus it adds: \"Allah says: 'So much so that when fear is banished from there (angle) hearts, they (angle) say: \"What is that of your lord has said?\" They say: \"The truth\". \" In the Hadith of Maqil it says the same as Al-Awza'i said: \"But they add lies to it.",
                "hadithUrdu": "ہم سے زہیر بن حرب نے بیان کیا، کہا ہم سے ولید بن مسلم نے بیان کیا، کہا ہم سے ابو عمرو نے بیان کیا ,اوزاعی ، یونس اور معقل بن عبید اللہ سب نے زہری سے ، اسی سند کے ساتھ حدیث بیان کی ، مگر یونس نے کہا : عبد اللہ بن عباس رضی اللہ عنہ سے روایت ہے : مجھے انصار میں سے رسول اللہ صلی اللہ علیہ وسلم کے صحابہ کرام رضوان اللہ عنھم اجمعین نے خبر دی اور اوزاعی کی حدیث میں ہے ۔ لیکن وہ اس میں جھوٹ ملا تے ہیں اور بڑھا تے ہیں ۔ \" اور یونس کی حدیث میں ہے : \" لیکن وہ اونچا لے جا تے ہیں ( مبا لغہ کرتے ہیں ) اور بڑھاتے ہیں ۔ \" یونس کی حدیث میں مزید یہ ہے : اللہ تعا لیٰ نے فر ما یا : یہاں تک کہ جب ان کے دلوں سے ہیبت اور ڈر کو ہٹا لیا جا تا ہے تو وہ کہتے ہیں ۔ تمھا رے رب نے کیا کہا ؟ وہ کہتے ہیں ۔ حق کہا ۔ اور معقل کی حدیث میں اسی کی طرح ہے جس طرح اوزاعی نے کہا : \" لیکن وہ اس میں جھوٹ ملا تے ہیں ۔ اور اضافہ کرتے ہیں ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا أَبُو عَمْرٍو الْأَوْزَاعِيُّ،وَحَدَّثَنَا أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، قَالَا: أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، وحَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ يَعْنِي ابْنَ عُبَيْدِ اللهِ كُلُّهُمْ، عَنِ الزُّهْرِيِّ بِهَذَا الْإِسْنَادِ، غَيْرَ أَنَّ يُونُسَ قَالَ: عَنْ عَبْدِ اللهِ بْنِ عَبَّاسٍ، أَخْبَرَنِي رِجَالٌ مِنْ أَصْحَابِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنَ الْأَنْصَارِ وَفِي حَدِيثِ الْأَوْزَاعِيِّ «وَلَكِنْ يَقْرِفُونَ فِيهِ وَيَزِيدُونَ» وَفِي حَدِيثِ يُونُسَ «وَلَكِنَّهُمْ يَرْقَوْنَ فِيهِ وَيَزِيدُونَ» وَزَادَ فِي حَدِيثِ يُونُسَ وَقَالَ اللهُ: {حَتَّى إِذَا فُزِّعَ عَنْ قُلُوبِهِمْ قَالُوا مَاذَا قَالَ رَبُّكُمْ قَالُوا الْحَقَّ} [سبأ: 23] وَفِي حَدِيثِ مَعْقِلٍ كَمَا قَالَ الْأَوْزَاعِيُّ: وَلَكِنَّهُمْ يَقْرِفُونَ فِيهِ وَيَزِيدُونَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13384,
                "hadithNumber": "5821",
                "englishNarrator": "Safiyya reported from some of the wives of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ):",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) having said: He who visits a diviner ('Arraf) and asks him about anything, his prayers extending to forty nights will not be accepted.",
                "hadithUrdu": "آپ نے فرما یا : \" جو شخص کسی غیب کی خبر یں سنا نے والے کے پاس آئے اور اس سے کسی چیز کے بارے میں پوچھے تو چالیس راتوں تک اس شخص کی نماز قبول نہیں ہوتی ۔",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا، کہا ہم سے یحییٰ نے بیان کیا، یعنی ابن سعید نے عبید اللہ کی سند سے، نافع کی سند سے, ( حضرت عبد اللہ بن عمر رضی اللہ عنہ کی اہلیہ ) صفیہ نے نبی صلی اللہ علیہ وسلم کی ایک اہلیہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ، کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى الْعَنَزِيُّ، حَدَّثَنَا يَحْيَى يَعْنِي ابْنَ سَعِيدٍ، عَنْ عُبَيْدِ اللهِ، عَنْ نَافِعٍ، عَنْ صَفِيَّةَ، عَنْ بَعْضِ أَزْوَاجِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ أَتَى عَرَّافًا فَسَأَلَهُ عَنْ شَيْءٍ، لَمْ تُقْبَلْ لَهُ صَلَاةٌ أَرْبَعِينَ لَيْلَةً».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13385,
                "hadithNumber": "5822",
                "englishNarrator": "Amr bin Sharid reported on the authority of his father:",
                "hadithEnglish": "There was in the delegation of Thaqif a leper. Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) sent a message to him: We have accepted your allegiance, so you may go.",
                "hadithUrdu": "ثقیف کے وفد میں کو ڑھ کا یک مریض بھی تھا رسول اللہ صلی اللہ علیہ وسلم نے اس کو پیغام بھیجا : \" ہم نے ( بالواسطہ ) تمھا ری بیعت لے لی ہے ، اس لیے تم ( اپنے گھر ) لوٹ جاؤ ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا ہم سے ہشیم نے بیان کیا، کہا ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے شریک بن عبداللہ نے اور ہم سے ہشیم بن عبداللہ نے بیان کیا۔ بشیر، علی بن عطا کی طرف سے،عمرو بن شرید نے اپنے والد سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا شَرِيكُ بْنُ عَبْدِ اللهِ، وَهُشَيْمُ بْنُ بَشِيرٍ، عَنْ يَعْلَى بْنِ عَطَاءٍ، عَنْ عَمْرِو بْنِ الشَّرِيدِ، عَنْ أَبِيهِ، قَالَ: كَانَ فِي وَفْدِ ثَقِيفٍ رَجُلٌ مَجْذُومٌ، فَأَرْسَلَ إِلَيْهِ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «إِنَّا قَدْ بَايَعْنَاكَ فَارْجِعْ».",
                "headingArabic": "اجْتِنَابِ الْمَجْذُومِ وَنَحْوِهِ ‏‏",
                "headingUrdu": "کوڑھی وغیرہ سے بچنا۔",
                "headingEnglish": "Avoiding Lepers Etc.",
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13386,
                "hadithNumber": "5823",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) commanded the killing of a snake having stripes over it, for it affects eyesight and miscarries pregnancy.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے پیٹھ پر دوسفید لکیروں والے سانپ کو قتل کرنے کا حکم دیا ، کیونکہ وہ بصارت چھین لیتا ہے ۔ اور حمل کو نقصان پہنچاتا ہے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, عبد ہ بن سلیمان اور ابن نمیر نے ہشام سے ، انھوں نے اپنے والد سے ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، وَابْنُ نُمَيْرٍ، عَنْ هِشَامٍ، وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا عَبْدَةُ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ: «أَمَرَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِقَتْلِ ذِي الطُّفْيَتَيْنِ، فَإِنَّهُ يَلْتَمِسُ الْبَصَرَ وَيُصِيبُ الْحَبَلَ».",
                "headingArabic": "قَتْلِ الْحَيَّاتِ وَغَيْرِهَا ‏‏",
                "headingUrdu": "سانپوں کو مارنا وغیرہ",
                "headingEnglish": "Killing Snakes Etc.",
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13387,
                "hadithNumber": "5824",
                "englishNarrator": "This hadith has been transmitted on the authority of Hisham. He said:",
                "hadithEnglish": "The short-tailed snake and the snake having stripes over it should be killed.",
                "hadithUrdu": "بے دم کا سانپ اور پشت پر دو سفیدلکیروں والا سانپ ( ماردیا جا ئے ۔ )",
                "urduNarrator": "اور ہم سے اسحاق بن ابراہیم نے بیان کیا,  ابو معاویہ نے کہا : ہمیں ہشام نے اس سند کے ساتھ حدیث سنا ئی اور کہا",
                "hadithArabic": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، أَخْبَرَنَا هِشَامٌ، بِهَذَا الْإِسْنَادِ، وَقَالَ: الْأَبْتَرُ وَذُو الطُّفْيَتَيْنِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13388,
                "hadithNumber": "5825",
                "englishNarrator": "Salim on the authority of his father reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Kill the snakes having stripes over them and short-tailed snakes, for these two types cause miscarriage (of a pregnant woman) and they affect the eyesight adversely. So Ibn 'Umar used to kill every snake that he found. Abu Lubaba bin 'Abd al-Mundhir and Zaid bin Khattab saw him pursuing a snake, whereupon he said: They were forbidden (to kill) those snakes who live in houses.",
                "hadithUrdu": "\"\" سانپوں کو قتل کردو اور ( خصوصاً ) دو سفید لکیروں والے اور دم بریدہ کو ، کیونکہ یہ حمل گرا دیتے ہیں اور بصارت زائل کردیتے ہیں ۔ \"\" ( سالم نے ) کہا : حضرت ابن عمر رضی اللہ عنہ کو جو بھی سانپ ملتا وہ اسے مار ڈالتے ، ایک بارابولبابہ بن عبدالمنذر یا زید بن خطاب رضی اللہ تعالیٰ عنہ نے ان کو دیکھا کہ وہ ایک سانپ کا پیچھا کر رہے تھے تو انھوں نے کہا : لمبی مدت سے گھروں میں رہنے والے سانپوں کو ( فوری طور پر ) ماردینے سے منع کیا گیا ہے ۔",
                "urduNarrator": "عمرو بن محمد الناقد نے مجھ سے کہا, سفیان بن عیینہ نے زہری سے ، انھوں نے سالم سے ، انھوں نے اپنے والد ( حضرت ابن عمر رضی اللہ تعالیٰ عنہ ) سے ، انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی",
                "hadithArabic": "وحَدَّثَنِي عَمْرُو بْنُ مُحَمَّدٍ النَّاقِدُ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «اقْتُلُوا الْحَيَّاتِ وَذَا الطُّفْيَتَيْنِ وَالْأَبْتَرَ، فَإِنَّهُمَا يَسْتَسْقِطَانِ الْحَبَلَ وَيَلْتَمِسَانِ الْبَصَرَ» قَالَ: فَكَانَ ابْنُ عُمَرَ: «يَقْتُلُ كُلَّ حَيَّةٍ وَجَدَهَا» فَأَبْصَرَهُ أَبُو لُبَابَةَ بْنُ عَبْدِ الْمُنْذِرِ، أَوْ زَيْدُ بْنُ الْخَطَّابِ وَهُوَ يُطَارِدُ حَيَّةً فَقَالَ: «إِنَّهُ قَدْ نُهِيَ عَنْ ذَوَاتِ الْبُيُوتِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 13076,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=523",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=521",
                "label": "521",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=522",
                "label": "522",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=523",
                "label": "523",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=524",
                "label": "524",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=525",
                "label": "525",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=526",
                "label": "526",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=527",
                "label": "527",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=525",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=525",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=523",
        "to": 13100,
        "total": 40465
    }
}