{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 575,
        "data": [
            {
                "id": 14639,
                "hadithNumber": "7078",
                "englishNarrator": "Anas رضی اللہ عنہ reported:",
                "hadithEnglish": "The moon was split up in two parts and in the hadith recorded in Abu Dawud, the words are: The moon was split up into two parts during the life of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ).",
                "hadithUrdu": "چاند دو ٹکڑوں میں پھٹ گیا ۔ اور ابو داود ( طیالسی ) کی حدیث میں ہے رسول اللہ صلی اللہ علیہ وسلم کے عہد مبارک میں چاند پھٹ گیا ۔",
                "urduNarrator": "ہم سے محمد بن المثنیٰ نے بیان کیا، ہم سے محمد بن جعفر اور ابوداؤد نے بیان کیا اور ہم سے ابن بشار نے بیان کیا, یحییٰ بن سعید ، محمد بن جعفر اور ابو داود سب نے شعبہ سے ، انھوں نے قتادہ سے اور انھوں نے حضرت انس رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ وَأَبُو دَاوُدَ و حَدَّثَنَا ابْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ وَمُحَمَّدُ بْنُ جَعْفَرٍ وَأَبُو دَاوُدَ كُلُّهُمْ عَنْ شُعْبَةَ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَ انْشَقَّ الْقَمَرُ فِرْقَتَيْنِ وَفِي حَدِيثِ أَبِي دَاوُدَ انْشَقَّ الْقَمَرُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14640,
                "hadithNumber": "7079",
                "englishNarrator": "Ibn 'Abbas رضی اللہ عنہ reported:",
                "hadithEnglish": "The moon was split up during the lifetime of Allah's Messenger (ﷺ).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں چاند پھٹ گیا ۔",
                "urduNarrator": "ہم سے موسیٰ بن قریش التمیمی نے بیان کیا، ہم سے اسحاق بن بکر بن مدر نے بیان کیا، مجھ سے میرے والد نے بیان کیا، ان سے جعفر بن ربیعہ نے بیان کیا، ان سے عرق بن مالک نے، وہ عبید اللہ بن عبداللہ بن عتبہ بن مسعود رضی اللہ عنہ سے, حضرت ابن عباس رضی اللہ عنہ سے روایت ہے ، کہا",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ قُرَيْشٍ التَّمِيمِيُّ حَدَّثَنَا إِسْحَقُ بْنُ بَكْرِ بْنِ مُضَرَ حَدَّثَنِي أَبِي حَدَّثَنَا جَعْفَرُ بْنُ رَبِيعَةَ عَنْ عِرَاكِ بْنِ مَالِكٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ عَنْ ابْنِ عَبَّاسٍ قَالَ إِنَّ الْقَمَرَ انْشَقَّ عَلَى زَمَانِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14641,
                "hadithNumber": "7080",
                "englishNarrator": "Abu Musa رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: There is none to show more patience at listening to the most irksome things than Allah, the Exalted and Glorious. 'Partnership is associated to Him (polytheism), and (fatherhood) of a child is attributed to Him, but in spite of this He protects them (people) and provides them sustenance.'",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تکلیف دل باتیں سن کر اللہ سے زیادہ صبر کرنے والا کوئی نہیں ، ا س کے ساتھ دوسروں کو شریک ٹھہرایا جاتا ہے اور اس کی اولاد بنائی جاتی ہے پھر بھی وہ انھیں عافیت میں رکھتا ہے اور انھیں رزق عطا کرتا ہے ۔ \"",
                "urduNarrator": "ابو بکر بن ابی شیبہ نے ہمیں حدیث بیان کی ، کہا : ہمیں ابو معاویہ اور ابو اسامہ نے اعمش سے حدیث بیان کی ، انھوں نے سعید بن جبیر سے ، انھوں نے ابو عبدالرحمن سلمی سے اور انھوں نے حضرت ابو موسیٰ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو مُعَاوِيَةَ وَأَبُو أُسَامَةَ عَنْ الْأَعْمَشِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ عَنْ أَبِي مُوسَى قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا أَحَدَ أَصْبَرُ عَلَى أَذًى يَسْمَعُهُ مِنْ اللَّهِ عَزَّ وَجَلَّ إِنَّهُ يُشْرَكُ بِهِ وَيُجْعَلُ لَهُ الْوَلَدُ ثُمَّ هُوَ يُعَافِيهِمْ وَيَرْزُقُهُمْ.",
                "headingArabic": "في الكفار",
                "headingUrdu": "کافر",
                "headingEnglish": "The Disbelievers",
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14642,
                "hadithNumber": "7081",
                "englishNarrator": null,
                "hadithEnglish": "A similar report (as Hadith no. 7080) was narrated from Abu Musa رضی اللہ عنہ from the prophet ﷺ, except the words, \"a son is attributed to him,\" which he did not mention.",
                "hadithUrdu": "ہم سے محمد بن عبداللہ بن نمیر اور ابو سعید اشجع نے بیان کیا, وکیع نے کہا : ہمیں اعمش نے حدیث بیان کی ، انھوں نے کہا : ہمیں سعید بن جبیر نے ابو عبدالرحمن سلمی سے ، انھوں نے حضرت ابو موسیٰ رضی اللہ عنہ سے اور انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ، سوائے آپ صلی اللہ علیہ وسلم کے اس قول کے : \" اور اس کی اولاد بنائی جاتی ہے \" انھوں نے اس ( قول ) کو بیان نہیں کیا ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ وَأَبُو سَعِيدٍ الْأَشَجُّ قَالَا حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الْأَعْمَشُ حَدَّثَنَا سَعِيدُ بْنُ جُبَيْرٍ عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ عَنْ أَبِي مُوسَى عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ إِلَّا قَوْلَهُ وَيُجْعَلُ لَهُ الْوَلَدُ فَإِنَّهُ لَمْ يَذْكُرْهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14643,
                "hadithNumber": "7082",
                "englishNarrator": "Abdullah bin Qais رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) that none is more forbearing in listening to the most irksome things than Allah, the Exalted. They associate rivals with him, attribute sonhood to Him, but in spite of this He provides them sustenance, grants them safety, confers upon them so many things.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کوئی نہیں جو تکلیف دہ باتوں پر جنھیں وہ سنتا ہے اللہ تعالیٰ سے زیادہ صبر کرنے والا ہو ، لوگ ( دوسروں کو ) اس کاشریک ٹھہراتے ہیں ، اس کی اولاد بناتے ہیں اور وہ اس ( سب کچھ ) ک باوجود انھیں رزق دیتا ہے ، عافیت بخشتا ہے اور ( جو مانگتے ہیں ) عطا کرتا ہے ۔ \"",
                "urduNarrator": "عبیداللہ بن سعید نے مجھے حدیث بیان کی ، کہا : ہمیں ابو اسامہ نے اعمش سے حدیث بیان کی ، انھوں نے کہا : ہمیں سعید بن جبیر نے ابو عبدالرحمان سلمی سے روایت کی ، انھوں نے کہا : حضرت عبداللہ بن قیس ( ابو موسیٰ اشعری ) رضی اللہ عنہ نے کہا کہ",
                "hadithArabic": "و حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ الْأَعْمَشِ حَدَّثَنَا سَعِيدُ بْنُ جُبَيْرٍ عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ قَالَ قَالَ عَبْدُ اللَّهِ بْنُ قَيْسٍ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أَحَدٌ أَصْبَرَ عَلَى أَذًى يَسْمَعُهُ مِنْ اللَّهِ تَعَالَى إِنَّهُمْ يَجْعَلُونَ لَهُ نِدًّا وَيَجْعَلُونَ لَهُ وَلَدًا وَهُوَ مَعَ ذَلِكَ يَرْزُقُهُمْ وَيُعَافِيهِمْ وَيُعْطِيهِمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14644,
                "hadithNumber": "7083",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Allah, the Exalted and High, would say to one who shall have to undergo the least torture (on the Day of Resurrection): Would you like to go as ransom if you had all worldly riches; he would say: Yes. Allah would say to him: When you were in the loins of Adam, I demanded from you something easier than this that you should not associate anything with Me. (The narrator says): I think He also said: I would not cause you to enter Hell-Fire but you defied and attributed Divinity (to others besides Me).",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا؛ \" اللہ تبارک وتعالیٰ اس شخص سے ، جسے اہل جہنم میں سب سے کم عذاب ہوگا ، فرمائے گا : اگر پوری دنیا اور جو کچھ اس میں ہے ۔ تمہارے پاس ہوتو ( عذاب سے چھوٹ جانے کے لئے ) اسے بطور فدیہ دے دو گے؟وہ کہے گا : ہاں ، تو وہ ( اللہ تعالیٰ ) فرمائے گا : میں نے تم سے اس وقت جب تم آدم علیہ السلام کی پشت میں تھے ، اس کی نسبت بہت کم کا مطالبہ کیا تھا کہ تم شرک نہ کرنا ۔ میرا خیال ہے کہ آپ صلی اللہ علیہ وسلم نے ( آگے یہ ) فرمایا ۔ ۔ ۔ اور میں تمھیں آگ میں نہیں ڈالوں گا ، مگر تم نے شرک ( کرنے ) کے سوا ہر چیز سے انکارکردیا ۔ \"",
                "urduNarrator": "عبید اللہ بن معاذ عنبری نے کہا : ہمیں شعبہ نے ابو عوان جونی سے ، انھوں نے حضرت انس بن مالک رضی اللہ عنہ سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَقُولُ اللَّهُ تَبَارَكَ وَتَعَالَى لِأَهْوَنِ أَهْلِ النَّارِ عَذَابًا لَوْ كَانَتْ لَكَ الدُّنْيَا وَمَا فِيهَا أَكُنْتَ مُفْتَدِيًا بِهَا فَيَقُولُ نَعَمْ فَيَقُولُ قَدْ أَرَدْتُ مِنْكَ أَهْوَنَ مِنْ هَذَا وَأَنْتَ فِي صُلْبِ آدَمَ أَنْ لَا تُشْرِكَ أَحْسِبُهُ قَالَ وَلَا أُدْخِلَكَ النَّارَ فَأَبَيْتَ إِلَّا الشِّرْكَ.",
                "headingArabic": "طَلَبِ الْكَافِرِ الْفِدَاءَ بِمِلْءِ الأَرْضِ ذَهَبًا ‏‏",
                "headingUrdu": "زمین بھر سونا لے کر تاوان مانگنے والا کافر",
                "headingEnglish": "The Disbeliever Seeking Ransom With An Earthful Of Gold",
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14645,
                "hadithNumber": "7084",
                "englishNarrator": "This hadith has been narrated on the authority of Anas bin Malik رضی اللہ عنہ through another chain of transmitters, but with a slight variation of wording (and the words are):",
                "hadithEnglish": "I shall not cause him to enter Hell. (The words subsequent to these) have not been mentioned.",
                "hadithUrdu": "\" اور میں تمھیں آگ میں نہیں ڈالوں گا \" انھوں نے اسے بیان نہیں کیا ۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا, محمد بن جعفر نے کہا ,  ہمیں شعبہ نے ابو عمران سے حدیث بیان کی ، کہا : میں نے حضرت انس بن مالک رضی اللہ عنہ سے سنا ، وہ نبی اکرم صلی اللہ علیہ وسلم سے حدیث بیان کررہے تھے ، اسی کے مانند ، سوائے ( اللہ تعالیٰ کے ) اس قول کے",
                "hadithArabic": "حَدَّثَنَاه مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدٌ يَعْنِي ابْنَ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي عِمْرَانَ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يُحَدِّثُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ إِلَّا قَوْلَهُ وَلَا أُدْخِلَكَ النَّارَ فَإِنَّهُ لَمْ يَذْكُرْهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14646,
                "hadithNumber": "7085",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger (ﷺ) said: It would be said to the non-believers on the Day of Resurrection: If you were to possess gold, filling the whole earth, would you like to secure your freedom by paying that? He would say: Yes. Thereupon it would be said to him: Something easier (than this) was demanded from you (but you paid no heed to it).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا \" قیامت کے دن کافر سے کہا جائے گا : تمہارا کیا خیال ہے ، اگر تمہارے پاس زمین ( کی مقدار ) بھر سونا موجود ہوتو کیا تم ( جہنم کے عذاب سے بچنے کے لئے ) اس کو بطور فدیہ دے دو گے؟وہ کہے گا : ہاں ، تو اس سے کہا جائے گا : تم سے تو اس سے بہت آسان مطالبہ کیاگیا تھا ۔ \"",
                "urduNarrator": "ہم سے عبید اللہ بن عمر القواری، اسحاق بن ابراہیم، محمد بن المثنیٰ اور ابن بشار نے بیان کیا۔ اسحاق نے کہا: اس نے ہمیں خبر دی، اور دوسروں نے کہا: معاذ بن ہشام ( دستوائی ) نے قتادہ سےروایت کی ، کہا : ہمیں حضرت انس بن مالک رضی اللہ عنہ نے حدیث بیان کی کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ وَمُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَ إِسْحَقُ أَخْبَرَنَا و قَالَ الْآخَرُونَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنَا أَبِي عَنْ قَتَادَةَ حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يُقَالُ لِلْكَافِرِ يَوْمَ الْقِيَامَةِ أَرَأَيْتَ لَوْ كَانَ لَكَ مِلْءُ الْأَرْضِ ذَهَبًا أَكُنْتَ تَفْتَدِي بِهِ فَيَقُولُ نَعَمْ فَيُقَالُ لَهُ قَدْ سُئِلْتَ أَيْسَرَ مِنْ ذَلِكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14647,
                "hadithNumber": "7086",
                "englishNarrator": "Anas رضی اللہ عنہ reported this hadith through another chain of transmitters and the words are:",
                "hadithEnglish": "It would be said to him: You have told a lie; what had been demanded from you was quite easier than this (the belief in the Oneness of Allah).",
                "hadithUrdu": "\" تو اس سے کہاجائے گا :تم جھوٹ بولتے ہو ، تم سے تو اس سے بہت آسان ( بات کا ) مطالبہ کیاگیا تھا ۔ \"",
                "urduNarrator": "اور ہم سے عبد بن حمید نے بیان کیا، کہا ہم سے روح بن عبادہ نے بیان کیا، اور ہم سے عمرو بن زرارہ نے بیان کیا، کہا ہم سے عبد الوہاب نے بیان کیا، یعنی ابن عطاء نے, سعید بن ابی عرو بہ نے قتادہ سے ، انھوں نے حضرت انس رضی اللہ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ، مگر انھوں نے ( اس طرح ) کہا",
                "hadithArabic": "و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ و حَدَّثَنِي عَمْرُو بْنُ زُرَارَةَ أَخْبَرَنَا عَبْدُ الْوَهَّابِ يَعْنِي ابْنَ عَطَاءٍ كِلَاهُمَا عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ أَنَسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ فَيُقَالُ لَهُ كَذَبْتَ قَدْ سُئِلْتَ مَا هُوَ أَيْسَرُ مِنْ ذَلِكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14648,
                "hadithNumber": "7087",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "A person said: Allah's Messenger, how the non-believers be made to assemble on the Day of Resurrection (by crawling) on their faces? Thereupon he said: Is He Who is powerful to make them walk on their feet not powerful enough to make them (crawl) upon their faces on the Day of Resurrection? Qatada said: Of course, it is so. (He adjured): By the might of our Lord.",
                "hadithUrdu": "ایک شخص نے کہا : اللہ کے رسول صلی اللہ علیہ وسلم ! قیامت کے روز کافر کو کس طرح منہ کے بل میدان حشر میں لایا جائے گا؟آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" کہ جس نے دنیا میں پاؤں کے بل چلایا ہےوہ اس بات پر قادر نہیں کہ قیامت کے دن اسے منہ کے بل چلائے؟ \"\" قتادہ نے ( حدیث سنانے کے بعد ) کہا : کیوں نہیں ، ہمارے رب کی عزت کی قسم! ( وہ قادر ہے )",
                "urduNarrator": "مجھ سے زہیر بن حرب اور عبد بن حمید نے بیان کیا اور لفظ زہیر کا ہے۔ انہوں نے کہا: ہم سے یونس بن محمد نے بیان کیا, شیبان نے ہمیں قتادہ سے حدیث بیان کی ، کہا : ہمیں حضرت انس بن مالک رضی اللہ عنہ نے حدیث بیان کی کہ",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ وَعَبْدُ بْنُ حُمَيْدٍ وَاللَّفْظُ لِزُهَيْرٍ قَالَا حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ حَدَّثَنَا شَيْبَانُ عَنْ قَتَادَةَ حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ أَنَّ رَجُلًا قَالَ يَا رَسُولَ اللَّهِ كَيْفَ يُحْشَرُ الْكَافِرُ عَلَى وَجْهِهِ يَوْمَ الْقِيَامَةِ قَالَ أَلَيْسَ الَّذِي أَمْشَاهُ عَلَى رِجْلَيْهِ فِي الدُّنْيَا قَادِرًا عَلَى أَنْ يُمْشِيَهُ عَلَى وَجْهِهِ يَوْمَ الْقِيَامَةِ قَالَ قَتَادَةُ بَلَى وَعِزَّةِ رَبِّنَا.",
                "headingArabic": "يُحْشَرُ الْكَافِرُ عَلَى وَجْهِهِ ‏‏",
                "headingUrdu": "کافر کو اس کے چہرے پر ہانک دیا جائے گا۔",
                "headingEnglish": "The Disbeliever Will Be Driven Upon His Face",
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14649,
                "hadithNumber": "7088",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said that one amongst the denizens of Hell who had led a life of ease and plenty amongst the people of the world would be made to dip in Fire only once on the Day of Resurrection and then it would be said to him: O, son of Adam, did you find any comfort, did you happen to get any material blessing? He would say: By Allah, no, my Lord. And then that person from amongst the persons of the world be brought who had led the most miserable life (in the world) from amongst the inmates of Paradise. and he would be made to dip once in Paradise and it would be said to him. O, son of Adam, did you face, any hardship? Or had any distress fallen to your lot? And he would say: By Allah, no, O my Lord, never did I face any hardship or experience any distress.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : قیامت کے دن اہل دوزخ میں سے اس شخص کو لایا جائے گا جو دنیا میں سب سے زیادہ آسودہ تر اور خوشحال تھا ، پس دوزخ میں ایک بار غوطہ دیا جائے گا ، پھر اس سے پوچھا جائے گا کہ اے آدم کے بیٹے! کیا تو نے دنیا میں کبھی آرام دیکھا تھا؟ کیا تجھ پر کبھی چین بھی گزرا تھا؟ وہ کہے گا کہ اللہ کی قسم! اے میرے رب! کبھی نہیں اور اہل جنت میں سے ایک ایسا شخص لایا جائے گا جو دنیا میں سب لوگوں سے سخت تر تکلیف میں رہا تھا ، جنت میں ایک بار غوطہ دیا جائے گا ، پھر اس سے پوچھا جائے گا کہ اے آدم کے بیٹے! تو نے کبھی تکلیف بھی دیکھی ہے؟ کیا تجھ پر شدت اور رنج بھی گزرا تھا؟ وہ کہے گا کہ اللہ کی قسم! مجھ پر تو کبھی تکلیف نہیں گزری اور میں نے تو کبھی شدت اور سختی نہیں دیکھی ۔",
                "urduNarrator": "ہم سے عمرو الناقد نے بیان کیا، ہم سے یزید بن ہارون نے بیان کیا، انہیں حماد بن سلمہ نے ثابت البنانی کی سند سے خبر دی, سیدنا انس بن مالک رضی اللہ عنہ کہتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرٌو النَّاقِدُ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُؤْتَى بِأَنْعَمِ أَهْلِ الدُّنْيَا مِنْ أَهْلِ النَّارِ يَوْمَ الْقِيَامَةِ فَيُصْبَغُ فِي النَّارِ صَبْغَةً ثُمَّ يُقَالُ يَا ابْنَ آدَمَ هَلْ رَأَيْتَ خَيْرًا قَطُّ هَلْ مَرَّ بِكَ نَعِيمٌ قَطُّ فَيَقُولُ لَا وَاللَّهِ يَا رَبِّ وَيُؤْتَى بِأَشَدِّ النَّاسِ بُؤْسًا فِي الدُّنْيَا مِنْ أَهْلِ الْجَنَّةِ فَيُصْبَغُ صَبْغَةً فِي الْجَنَّةِ فَيُقَالُ لَهُ يَا ابْنَ آدَمَ هَلْ رَأَيْتَ بُؤْسًا قَطُّ هَلْ مَرَّ بِكَ شِدَّةٌ قَطُّ فَيَقُولُ لَا وَاللَّهِ يَا رَبِّ مَا مَرَّ بِي بُؤْسٌ قَطُّ وَلَا رَأَيْتُ شِدَّةً قَطُّ.",
                "headingArabic": "صَبْغِ أَنْعَمِ أَهْلِ الدُّنْيَا فِي النَّارِ وَصَبْغِ أَشَدِّهِمْ بُؤْسًا فِي الْجَنَّةِ ‏‏",
                "headingUrdu": "اس دنیا میں سب سے زیادہ مالدار لوگ آگ میں ڈبوئے جائیں گے اور سب سے زیادہ غریب جنت میں ڈبوئے جائیں گے",
                "headingEnglish": "The Most Affluent Of People In This World Will Be Dipped In The Fire, And The Most Destitute Will Be Dipped In Paradise",
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14650,
                "hadithNumber": "7089",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Verily, Allah does not treat a believer unjustly in regard to his virtues. He would confer upon him (His blessing) in this world and would give him reward in the Hereafter. And as regards a non-believer, he would be made to taste the reward (of virtue in this world) what he has done for himself so much that when it would be the Hereafter, he would find no virtue for which he should be rewarded.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" بے شک اللہ تعالیٰ کسی مومن کے ساتھ ایک نیکی کے معاملے میں بھی ظلم نہیں فرماتا ۔ اس کے بدلے اسے دنیا میں بھی عطا کرتا ہے اور آخرت میں بھی اس کی جزا دی جاتی ہے ۔ رہا کافر ، اسے نیکیوں کے بدلے میں جو اس نے دنیا میں اللہ کے لئے کی ہوتی ہیں ، اسی دنیا میں کھلا ( پلا ) دیا جاتاہے حتیٰ کہ جب وہ آخرت میں پہنچتا ہے تو اس کے پاس کوئی نیکی باقی نہیں ہوتی جس کی اسے جزا دی جائے ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور زہیر بن حرب نے بیان کیا - اور لفظ زہیر کا ہے - انہوں نے کہا : ہم سے یزید بن ہارون نے بیان کیا , ہمام بن یحییٰ نے قتادہ سے ، انھوں نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ وَاللَّفْظُ لِزُهَيْرٍ قَالَا حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا هَمَّامُ بْنُ يَحْيَى عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ لَا يَظْلِمُ مُؤْمِنًا حَسَنَةً يُعْطَى بِهَا فِي الدُّنْيَا وَيُجْزَى بِهَا فِي الْآخِرَةِ وَأَمَّا الْكَافِرُ فَيُطْعَمُ بِحَسَنَاتِ مَا عَمِلَ بِهَا لِلَّهِ فِي الدُّنْيَا حَتَّى إِذَا أَفْضَى إِلَى الْآخِرَةِ لَمْ تَكُنْ لَهُ حَسَنَةٌ يُجْزَى بِهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14651,
                "hadithNumber": "7090",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) thus told him: When a non-believer does good he is made to taste Its reward in this world. And so far as the believer is concerned, Allah stores (the reward) of his virtues for the Hereafter and provides him sustenance in accordance with his obedience to Him.",
                "hadithUrdu": "\" بلاشبہ ایک کافر جب کوئی نیک کام کر تا ہے ۔ تو اس کے بدلے اسے دنیاکے کھانوں ( نعمتوں ) میں سے ایک لقمہ ( نعمت کی صورت میں ) کھلادیتاہے اور مومن اللہ تعالیٰ اس کی نیکیوں کا ذخیرہ آخرت میں کرتا جاتا ہے ۔ اور اس کی اطاعت شعاری پر دنیا میں ( بھی ) اسے رزق عطا فرماتا ہے ۔ \"",
                "urduNarrator": "ہم سے عاصم بن نضر تیمی نے بیان کیا, معتمر کے والد ( سلیمان ) نے کہا : ہمیں قتادہ نے انس بن مالک رضی اللہ عنہ سے روایت کی کہ انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے حدیث بیان کی",
                "hadithArabic": "حَدَّثَنَا عَاصِمُ بْنُ النَّضْرِ التَّيْمِيُّ حَدَّثَنَا مُعْتَمِرٌ قَالَ سَمِعْتُ أَبِي حَدَّثَنَا قَتَادَةُ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّهُ حَدَّثَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الْكَافِرَ إِذَا عَمِلَ حَسَنَةً أُطْعِمَ بِهَا طُعْمَةً مِنْ الدُّنْيَا وَأَمَّا الْمُؤْمِنُ فَإِنَّ اللَّهَ يَدَّخِرُ لَهُ حَسَنَاتِهِ فِي الْآخِرَةِ وَيُعْقِبُهُ رِزْقًا فِي الدُّنْيَا عَلَى طَاعَتِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14652,
                "hadithNumber": "7091",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Anas bin Malik رضی اللہ عنہ through another chain of transmitters.",
                "hadithUrdu": "ہم سے محمد بن عبداللہ الرزی نے بیان کیا، کہا ہم سے عبد الوہاب بن عطا نے بیان کیا, سعید ( بن ابی عروبہ ) نے قتادہ سے ، انہوں نے حضرت انس رضی اللہ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے ان دونوں ( ہمام اور سلیمان ) کی حدیث کے ہم معنی حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرُّزِّيُّ أَخْبَرَنَا عَبْدُ الْوَهَّابِ بْنُ عَطَاءٍ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ أَنَسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَى حَدِيثِهِمَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14653,
                "hadithNumber": "7092",
                "englishNarrator": "Abu Huraira رضی اللہ  عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The Similitude of a believer is that of (a standing) crop which the air continues to toss from one side to another; in the same way a believer always (receives the strokes) of misfortune. The similitude of a hypocrite is that of a cypress tree which does not move until it is uprooted.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" مومن کی مثال کھیتی کی طرح ہے ۔ ہوا مسلسل اس کو ( ایک یا دوسری طرف ) جھکاتی رہتی ہے اور مومن پر مسلسل مصیبتیں آتی رہتی ہیں ، اور منافق کی مثال ودیوار درخت کی طرح ہے ( جس کا تناؤ ہوا میں بھی تن کرکھڑا رہتا ہے ) ۔ بلتا نہیں حتیٰ کہ ( ایک ہی بار ) اسے کاٹ کر گرادیاجاتا ہے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, عبدالاعلیٰ نے ہمیں معمر سے حدیث بیان کی ، انھوں نے زہری سے ، انہوں نے سعید سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ  عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الْأَعْلَى عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَثَلُ الْمُؤْمِنِ كَمَثَلِ الزَّرْعِ لَا تَزَالُ الرِّيحُ تُمِيلُهُ وَلَا يَزَالُ الْمُؤْمِنُ يُصِيبُهُ الْبَلَاءُ وَمَثَلُ الْمُنَافِقِ كَمَثَلِ شَجَرَةِ الْأَرْزِ لَا تَهْتَزُّ حَتَّى تَسْتَحْصِدَ.",
                "headingArabic": "مَثَلُ الْمُؤْمِنِ كَالزَّرْعِ وَمَثَلُ الْكَافِرِ كَشَجَرِ الأَرْزِ ‏‏",
                "headingUrdu": "مومن پودے کی طرح ہے اور منافق اور کافر دیودار کی طرح ہے۔",
                "headingEnglish": "The Believer Is Like A Plant And The Hypocrite And The Disbeliever Are Like Cedars",
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14654,
                "hadithNumber": "7093",
                "englishNarrator": null,
                "hadithEnglish": "It was narrated from Az-Zuhri with this chin of narrators (a Hadith similar to no. 7092).",
                "hadithUrdu": "ہم سے محمد بن رافع اور عبد بن حمید نے بیان کیا, عبدالرزاق نے کہا : ہمیں معمر نے زہری سے اسی سند کے ساتھ خبر دی مگر عبدالرزاق کی حدیث میں آپ صلی اللہ علیہ وسلم کے فرمان : \" اسے جھکاتی رہتی ہے \" کے بجائے \" اسے موڑتی رہتی ہے \" کے الفاظ ہیں ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ وَعَبْدُ بْنُ حُمَيْدٍ عَنْ عَبْدِ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ بِهَذَا الْإِسْنَادِ غَيْرَ أَنَّ فِي حَدِيثِ عَبْدِ الرَّزَّاقِ مَكَانَ قَوْلِهِ تُمِيلُهُ تُفِيئُهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14655,
                "hadithNumber": "7094",
                "englishNarrator": "Ka'b رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said that the similitude of a believer is that of a standing crop in a field which is shaken by wind and then it comes to its original position but it stands at its roots. The similitude of a non-believer is that of a cypress tree which stands on its roots and nothing shakes it but it is uprooted (with) one (violent stroke).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" مومن کی مثال کھیتی کے باریک تیلی جیسے تنے کی ہے ۔ ہوا اسے موڑ دیتی ، ایک مرتبہ زمین پر لٹادیتی ہے اور دوسری مرتبہ اسے سیدھا کریتی ہے ، یہاں تک کہ وہ پیلا ہوکر خشک ہوجاتا ہے اور کافر کی مثال ویودار درخت کی سی ہے جو اپنی جڑوں پر تن کر کھڑا ہوتا ہے ، اسے کوئی چیز موڑ نہیں سکتی ، یہاں تک کہ اس کا اکھڑ کاگرنا ایک ہی بار ہوتا ہے ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے عبداللہ بن نمیر اور محمد بن بشر نے بیان کیا, زکریا بن ابی زائدہ نے سعد بن ابراہیم سے روایت کی ، انھوں نے کہا : مجھے کعب بن مالک رضی اللہ عنہ کے بیٹے نے اپنے والد کعب بن مالک رضی اللہ عنہ سے حدیث بیان کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ وَمُحَمَّدُ بْنُ بِشْرٍ قَالَا حَدَّثَنَا زَكَرِيَّاءُ بْنُ أَبِي زَائِدَةَ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ حَدَّثَنِي ابْنُ كَعْبِ بْنِ مَالِكٍ عَنْ أَبِيهِ كَعْبٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَثَلُ الْمُؤْمِنِ كَمَثَلِ الْخَامَةِ مِنْ الزَّرْعِ تُفِيئُهَا الرِّيحُ تَصْرَعُهَا مَرَّةً وَتَعْدِلُهَا أُخْرَى حَتَّى تَهِيجَ وَمَثَلُ الْكَافِرِ كَمَثَلِ الْأَرْزَةِ الْمُجْذِيَةِ عَلَى أَصْلِهَا لَا يُفِيئُهَا شَيْءٌ حَتَّى يَكُونَ انْجِعَافُهَا مَرَّةً وَاحِدَةً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14656,
                "hadithNumber": "7095",
                "englishNarrator": "Ka'b bin Malik reported on the authority of his father:",
                "hadithEnglish": "The Messenger of Allah ﷺ said: The similitude of a believer is that of a standing crop. The wind sometimes shakes it and sometimes raises it up and then it comes to its destined end. And the similitude of a hypocrite is that of a cypress tree which is not affected by anything but is uprooted once for all.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \" مومن کی مثال کھیتی کے تیلی نمانرم تنے کی سی ہے جس کو ہوا موڑتی رہتی ہے ، کبھی اس کو لٹا دیتی ہے اور کبھی کھڑا کردیتی ہے ، حتیٰ کہ اس ( کے پک کرکٹنے ) کا وقت آجاتا ہے ، اور منافق کی مثال ویودار کے مضبوط جڑوں والے درخت کی طرح ہے ، اس پر ( ایسی ) کوئی مشکل نہیں آتی ، حتیٰ کہ ایک ہی دفعہ وہ جڑوں سے اکھڑ ( کرگر ) جاتا ہے ۔ \"",
                "urduNarrator": "زہیر بن حرب نے مجھے حدیث بیان کی ، کہا : ہمیں بشر بن سری اور عبدالرحمن بن مہدی نے حدیث بیان کی ، دونوں نے کہا : ہمیں سفیان بن عینیہ نے سعد بن ابراہیم سے ، انھوں نے عبدالرحمن بن کعب بن مالک سے ، انھوں نے اپنے والد سے حدیث بیان کی ، کہا",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبِ بْنِ مَالِكٍ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَثَلُ الْمُؤْمِنِ كَمَثَلِ الْخَامَةِ مِنْ الزَّرْعِ تُفِيئُهَا الرِّيَاحُ تَصْرَعُهَا مَرَّةً وَتَعْدِلُهَا حَتَّى يَأْتِيَهُ أَجَلُهُ وَمَثَلُ الْمُنَافِقِ مَثَلُ الْأَرْزَةِ الْمُجْذِيَةِ الَّتِي لَا يُصِيبُهَا شَيْءٌ حَتَّى يَكُونَ انْجِعَافُهَا مَرَّةً وَاحِدَةً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14657,
                "hadithNumber": "7096",
                "englishNarrator": "It was narrated from 'Abdullah bin K'ab bin Malik from his father from the prophet ﷺ (a Hadith similar to no. 7095), except that Mahmud said in his report from Bishr:",
                "hadithEnglish": "\"The likeness of the disbelievers is that of a cedar,\" and Ibn Hatim said: \"The likeness of the Hypocrites,\" the Zuhair said.",
                "hadithUrdu": "\" کافر کی مثال ویودار کے درخت کی طرح ہے ۔ \" اور ابن حاتم نے \" منافق کی مثال \" کہا ، جس طرح زہیر نے کہا ہے ۔",
                "urduNarrator": "محمد بن حاتم اور محمود بن غیلان نے مجھے یہی حدیث بیان کی ، دونوں نے کہا : ہمیں بشر بن سری نے حدیث بیان کی ، انھوں نے کہا : ہمیں سفیان نے سعد بن ابراہیم سے حدیث بیان کی ، انھوں نے عبداللہ بن کعب بن مالک سے ، انھوں نے ا پنے والد سے ، اورانھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی ، مگر محمود نے بشر سے اپنی روایت میں کہا",
                "hadithArabic": "وَحَدَّثَنِيهِ مُحَمَّدُ بْنُ حَاتِمٍ، وَمَحْمُودُ بْنُ غَيْلاَنَ، قَالاَ حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ، حَدَّثَنَا سُفْيَانُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم غَيْرَ أَنَّ مَحْمُودًا قَالَ فِي رِوَايَتِهِ عَنْ بِشْرٍ ‏\"‏ وَمَثَلُ الْكَافِرِ كَمَثَلِ الأَرْزَةِ ‏\"‏ ‏.‏ وَأَمَّا ابْنُ حَاتِمٍ فَقَالَ ‏\"‏ مَثَلُ الْمُنَافِقِ ‏\"‏ ‏.‏ كَمَا قَالَ زُهَيْرٌ ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14658,
                "hadithNumber": "7097",
                "englishNarrator": "It was narrated from Abdullah bin K'ab bin Malik, and Ibn Bash-shar: It was narrated from the son of K'ab bin Malik, from his father, from the prophet ﷺ\" -a similar Hadith (as no. 7095). They both said in their hadith from Yahya:",
                "hadithEnglish": "\"The likeness of the disbeliever is that of a cedar.",
                "hadithUrdu": "\" اورکافر کی مثال دیودار کے درخت جیسی ہے ۔ \"",
                "urduNarrator": "محمد بن بشار اور عبداللہ بن ہاشم نے ہمیں حدیث بیان کی ، دونوں نے کہا : ہمیں یحییٰ قطان نے سفیان سے ، انھوں نے سعد بن ابراہیم سے حدیث بیان کی ۔ ابن ہاشم نے کہا : عبداللہ بن کعب بن مالک رضی اللہ عنہ سے روایت ہے ، انھوں نے اپنے والد سے روایت کی اور ابن بشار نے کہا : ابن کعب بن مالک رضی اللہ تعالیٰ عنہ سے ر وایت ہے انھوں نے اپنے والد سے ۔ انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ، جیسے ان سب کی حدیث ہے ۔ اور ان دونوں نے اپنی حدیث میں کہا : یحییٰ سے روایت ہے",
                "hadithArabic": "و حَدَّثَنَاه مُحَمَّدُ بْنُ بَشَّارٍ وَعَبْدُ اللَّهِ بْنُ هَاشِمٍ قَالَا حَدَّثَنَا يَحْيَى وَهُوَ الْقَطَّانُ عَنْ سُفْيَانَ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ قَالَ ابْنُ هَاشِمٍ عَنْ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ عَنْ أَبِيهِ و قَالَ ابْنُ بَشَّارٍ عَنْ ابْنِ كَعْبِ بْنِ مَالِكٍ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِ حَدِيثِهِمْ وَقَالَا جَمِيعًا فِي حَدِيثِهِمَا عَنْ يَحْيَى وَمَثَلُ الْكَافِرِ مَثَلُ الْأَرْزَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14659,
                "hadithNumber": "7098",
                "englishNarrator": "Abdullah bin Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: There is a tree amongst trees, the leaves of which do not wither and that is like a Muslim; tell me which that (tree) can be? The people began to think of the trees of the forest. Abdullah said: I thought that it could be the date-palm tree, but I felt hesitant (to say that). They (the Companions) then said: Allah's Messenger, (kindly) tell us which that can be? Thereupon he said: It is the date-palm tree. I made a mention of that to 'Umar رضی اللہ عنہ , whereupon he said: Had you said that it meant the date-palm tree, this statement of yours (would have been dearer to me) than such and such things.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \"\" درختوں میں سے ایک درخت ہے جس کے پتے نہیں جھڑتے اور وہ درخت مسلمان کی طرح ہے ۔ لہذا مجھے بتاؤ کہ وہ کون سادرخت ہے؟ \"\" تو لوگوں کا دھیان جنگل کے مختلف درختوں کی طرف کیا ۔ حضرت عبداللہ بن عمر رضی اللہ عنہ نے کہا : میرے دل میں یہ خیال آیا کہ وہ کھجور کا درخت ہے ۔ لیکن میں جھجک گیا پھر وہ ( لوگ ) کہنے لگے : اللہ کے رسول صلی اللہ علیہ وسلم ! آ پ بتائیے کہ وہ کون سا ( درخت ) ہے؟ کہا : تو آپ صلی اللہ علیہ وسلم نے فرمایا؛ \"\" وہ کھجور کا درخت ہے ۔ \"\" ( عبداللہ بن عمر رضی اللہ عنہ نے ) کہا : تو میں نے یہ ( بات اپنے والد ) حضرت عمر رضی اللہ عنہ کوبتائی تو انھوں نے کہا : اگر تم نے کہہ دیا ہوتا کہ وہ کھجور کا درخت ہے تو میرے نزدیک یہ ( جواب ) فلاں فلاں ( سرخ اونٹوں ) سے بھی زیادہ پسندیدہ ہوتا ۔",
                "urduNarrator": "ہم سے یحییٰ بن ایوب، قتیبہ بن سعید اور علی بن حجر السعدی نے بیان کیا، اور لفظ یحییٰ کا ہے۔ انہوں نے کہا: ہم سے اسماعیل نے بیان کیا، یعنی ابن جعفر نے، عبداللہ بن دینار نے کہا کہ انہوں نے حضرت عبداللہ بن عمر رضی اللہ عنہ کو یہ کہتے ہوئےسنا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ بْنُ سَعِيدٍ وَعَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ وَاللَّفْظُ لِيَحْيَى قَالُوا حَدَّثَنَا إِسْمَعِيلُ يَعْنُونَ ابْنَ جَعْفَرٍ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ دِينَارٍ أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عُمَرَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ مِنْ الشَّجَرِ شَجَرَةً لَا يَسْقُطُ وَرَقُهَا وَإِنَّهَا مَثَلُ الْمُسْلِمِ فَحَدِّثُونِي مَا هِيَ فَوَقَعَ النَّاسُ فِي شَجَرِ الْبَوَادِي قَالَ عَبْدُ اللَّهِ وَوَقَعَ فِي نَفْسِي أَنَّهَا النَّخْلَةُ فَاسْتَحْيَيْتُ ثُمَّ قَالُوا حَدِّثْنَا مَا هِيَ يَا رَسُولَ اللَّهِ قَالَ فَقَالَ هِيَ النَّخْلَةُ قَالَ فَذَكَرْتُ ذَلِكَ لِعُمَرَ قَالَ لَأَنْ تَكُونَ قُلْتَ هِيَ النَّخْلَةُ أَحَبُّ إِلَيَّ مِنْ كَذَا وَكَذَا.",
                "headingArabic": "مَثَلُ الْمُؤْمِنِ مَثَلُ النَّخْلَةِ ‏‏",
                "headingUrdu": "مومن کی مثال کھجور کی طرح ہے۔",
                "headingEnglish": "The Likeness Of The Believer Is That Of A Date Palm",
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14660,
                "hadithNumber": "7099",
                "englishNarrator": "Ibn Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) one day said to his Companions: Tell me about a tree which has resemblance with a believer. The people began to mention (different) trees of the forest. Ibn 'Umar رضی اللہ عنہ said: It was instilled in my mind or in my heart and it stuck therein that it implied the date- palm tree. I made up my mind to make a mention of that but could not do that because of the presence of the elderly people there. When there was a hush amongst them (after they had expressed their views), Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: It Is the date-palm tree.",
                "hadithUrdu": "ایک دن رسول اللہ صلی اللہ علیہ وسلم نے ا پنے صحابہ سے فرمایا؛ \"\" مجھے اس درخت کے بارے میں بتاؤ جس کی مثال مومن جیسی ہے ۔ \"\" تو لوگ جنگلوں کے درختوں میں سے کوئی ( نہ کوئی ) درخت بتانے لگے ۔ ابن عمر رضی اللہ عنہ نے کہا : اور میرے دل میں یا ( کہا : ) میرے ذہن میں یہ بات ڈالی گئی کہ وہ کھجور کا د رخت ہے میں ارادہ کرنے لگا کہ بتادوں ، لیکن ( وہاں ) قوم کے معمر لوگ موجود تھے تو میں ان کی ہیبت سے متاثر ہوکر بولنے سے رک گیا ۔ جب وہ سب خاموش ہوگئے تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \"\" وہ کھجور کا درخت ہے ۔ \"\"",
                "urduNarrator": "مجھ سے محمد بن عبید الغبری نے بیان کیا، کہا ہم سے حماد بن زید نے بیان کیا، ہم سے ایوب نے بیان کیا, ابوخلیل الضبعی نے مجاہد سے اور انھوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ عُبَيْدٍ الْغُبَرِيُّ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ حَدَّثَنَا أَيُّوبُ عَنْ أَبِي الْخَلِيلِ الضُّبَعِيِّ عَنْ مُجَاهِدٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا لِأَصْحَابِهِ أَخْبِرُونِي عَنْ شَجَرَةٍ مَثَلُهَا مَثَلُ الْمُؤْمِنِ فَجَعَلَ الْقَوْمُ يَذْكُرُونَ شَجَرًا مِنْ شَجَرِ الْبَوَادِي قَالَ ابْنُ عُمَرَ وَأُلْقِيَ فِي نَفْسِي أَوْ رُوعِيَ أَنَّهَا النَّخْلَةُ فَجَعَلْتُ أُرِيدُ أَنْ أَقُولَهَا فَإِذَا أَسْنَانُ الْقَوْمِ فَأَهَابُ أَنْ أَتَكَلَّمَ فَلَمَّا سَكَتُوا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هِيَ النَّخْلَةُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14661,
                "hadithNumber": "7100",
                "englishNarrator": "Mujahid said:",
                "hadithEnglish": "(I have had the privilege) of accompanying Ibn 'Umar رضی اللہ عنہ up to Medina but I did not hear him narrate anything from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) except one hadith. And he said: We were in the presence of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) that there was brought to him the kernel of a date. The rest of the hadith is the same.",
                "hadithUrdu": "میں مدینہ تک حضرت ابن عمر رضی اللہ عنہ کے ساتھ رہا ، میں نے انھیں ایک حدیث کے سوا رسول اللہ صلی اللہ علیہ وسلم سے کوئی حدیث بیان کرتے ہوئے نہیں سنا ۔ انھوں نے کہا : ہم رسول اللہ صلی اللہ علیہ وسلم کے پاس تھے تو آپ کے پاس کھجور کے تنے کانرم گودا لایا گیا ۔ پھر ان دونوں ( ابوخلیل ضبعی اورعبداللہ بن دینار ) کی حدیث کی طرح بیان کیا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابن ابی عمر نے بیان کیا، ہم سے سفیان بن عیینہ نے بیان کیا , ابن ابی نجیح نے مجاہد سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَابْنُ أَبِي عُمَرَ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ ابْنِ أَبِي نَجِيحٍ عَنْ مُجَاهِدٍ قَالَ صَحِبْتُ ابْنَ عُمَرَ إِلَى الْمَدِينَةِ فَمَا سَمِعْتُهُ يُحَدِّثُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا حَدِيثًا وَاحِدًا قَالَ كُنَّا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأُتِيَ بِجُمَّارٍ فَذَكَرَ بِنَحْوِ حَدِيثِهِمَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14662,
                "hadithNumber": "7101",
                "englishNarrator": "Mujahid reported:",
                "hadithEnglish": "I heard Ibn 'Umar رضی اللہ عنہ as saying: There was brought to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) the kernel. The rest of the hadith is tile same.",
                "hadithUrdu": "میں نے حضرت ابن عمر رضی اللہ عنہ کو بیان کرتے ہوئے سنا کہ رسول اللہ صلی اللہ علیہ وسلم کے پا س کھجور کے تنے کا نرم گودا لایا کیا ، پھر ان کی حدیث کی طرح بیان کیا ۔",
                "urduNarrator": "ہمیں ابن نمیر نے بیان کیا, سیف نے ہمیں حدیث بیان کی ، انھوں نے کہا : میں نے مجاہد کو سنا ، وہ کہہ رہے تھے",
                "hadithArabic": "و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا سَيْفٌ قَالَ سَمِعْتُ مُجَاهِدًا يَقُولُ سَمِعْتُ ابْنَ عُمَرَ يَقُولُ أُتِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِجُمَّارٍ فَذَكَرَ نَحْوَ حَدِيثِهِمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14663,
                "hadithNumber": "7102",
                "englishNarrator": "Ibn Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "We were in the company of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) that he said: Tell me of a tree which has resemblance to a Muslim and the leaves of which do not wither. Ibrahim said that perhaps Imam Muslim had stated like this: It constantly bears fruit but I have, however, seen [It does not bear fruit constantly]. Ibn Umar  رضی اللہ عنہ said: It crossed my mind that it could be the date-palm tree, but as I saw Aba Bakr and Umar رضی اللہ عنہ observe silence, I did not deem it fit that I should speak or I should say something. 'Umar رضی اللہ عنہ said: Had you said so, it would have been dearer to me than such and such thing.",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر تھے ، آپ نے فرمایا : \"\" مجھے اس درخت کے متعلق بتاؤ جو ایک مسلمان آدمی سے مشابہ یا ( فرمایا : ) کی طرح ہے ، اس کے پتے نہیں جھڑتے ۔ \"\" ( امام مسلم رحمۃ اللہ علیہ کےشاگرد ) ابراہیم ( بن سفیان ) نے کہا : غالباً ( ہمارے شیخ ) امام مسلم نے \"\" اور وہ ( درخت ) اپنا پھل دیتاہے \"\" کہا ہوگا ( لیکن میرے پاس \"\" نہیں دیتا \"\" لکھا ہے ) اور میں نے اپنے دوسرے ساتھیوں کے ہاں بھی ( ان کے نسخوں میں ) یہی پایا ہے : اور وہ ہر وقت اپنا پھل نہیں دیتا ۔ حضرت ابن عمر رضی اللہ عنہ نے کہا : تو میرے دل میں آیا کہ وہ کھجور کا درخت ہے ۔ مگر میں نے حضرت ابو بکر وعمر رضی اللہ عنہ کو دیکھاکہ وہ نہیں بول رہے تھے تو میں نے یہ بات ناپسندی کہ میں بولوں اور کچھ کہوں ، چنانچہ ( میری بات سن کر حضرت عمر رضی اللہ عنہ نے کہا : اگر تم یہ بات کہہ دیتے تو مجھے یہ فلاں فلاں ( سرخ اونٹوں ) سے زیادہ پسندہوتا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے ابو اسامہ نے بیان کیا، ہم سے عبید اللہ بن عمر نے بیان کیا, نافع نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ كُنَّا عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَخْبِرُونِي بِشَجَرَةٍ شِبْهِ أَوْ كَالرَّجُلِ الْمُسْلِمِ لَا يَتَحَاتُّ وَرَقُهَا قَالَ إِبْرَاهِيمُ لَعَلَّ مُسْلِمًا قَالَ وَتُؤْتِي أُكُلَهَا وَكَذَا وَجَدْتُ عِنْدَ غَيْرِي أَيْضًا وَلَا تُؤْتِي أُكُلَهَا كُلَّ حِينٍ قَالَ ابْنُ عُمَرَ فَوَقَعَ فِي نَفْسِي أَنَّهَا النَّخْلَةُ وَرَأَيْتُ أَبَا بَكْرٍ وَعُمَرَ لَا يَتَكَلَّمَانِ فَكَرِهْتُ أَنْ أَتَكَلَّمَ أَوْ أَقُولَ شَيْئًا فَقَالَ عُمَرُ لَأَنْ تَكُونَ قُلْتَهَا أَحَبُّ إِلَيَّ مِنْ كَذَا وَكَذَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 14351,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=574",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=572",
                "label": "572",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=573",
                "label": "573",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=574",
                "label": "574",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=575",
                "label": "575",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=576",
                "label": "576",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=577",
                "label": "577",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=578",
                "label": "578",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=576",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=576",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=574",
        "to": 14375,
        "total": 40465
    }
}