{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 427,
        "data": [
            {
                "id": 10939,
                "hadithNumber": "3375",
                "englishNarrator": "Abu Huraira ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Prayer in my mosque is more excellent than a thousand prayers observed in other mosques except the Masjid al-Haram.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" میریاس مسجد میں ایک نماز کسی بھی اور مسجد کی ایک ہزار نمازوں سے بہتر ہے سوائے مسجد حرا م ( کی نماز ) کے ۔",
                "urduNarrator": "مجھ سے محمد بن رافع اور عبد بن حمید نے بیان کیا کہ انہوں نے ہمیں خبر دی اور ابن رافع نے ہمیں خبر دی , معمر نے ہمیں زہری سے خبر دی انھوں نے سعید بن مسیب سے انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ عَبْدٌ: أَخْبَرَنَا، وَقَالَ: ابْنُ رَافِعٍ: حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «صَلَاةٌ فِي مَسْجِدِي هَذَا خَيْرٌ مِنْ أَلْفِ صَلَاةٍ فِي غَيْرِهِ مِنَ الْمَسَاجِدِ، إِلَّا الْمَسْجِدَ الْحَرَامَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10940,
                "hadithNumber": "3376",
                "englishNarrator": "Abu Huraira (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Prayer in the mosque of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) is more excellent than a thousand prayers in other mosques except the Masjid al-Haram, for Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) is the last of the Apostles, and his mosque is the last of the mosques. Abu Salama and Abu Abdullah (two of the narrators in this chain of narrations said: We had no doubt that what Abu Haraira (رضی اللہ تعالیٰ عنہ) had said was from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ), and so we did not like to get an attestation from Abu Huraira رضی اللہ تعالیٰ عنہ about this hadith until Abu Huraira (رضی اللہ تعالیٰ عنہ) died. We discussed it (the issue of getting attestation from Abu Huraira رضی اللہ تعالیٰ عنہ) amongst ourselves and blamed one another as to why we did not talk about it to Abu Huraira رضی اللہ تعالیٰ عنہ regarding it so that he could attribute its transmission to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) in case he had heard It from him. While we were discussing it as we sat with 'Abdullah bin Ibrahim bin Qariz; we made a mention of this hadith, and our omission (in getting its attestation) about its direct transmission by Abu Huraira رضی اللہ تعالیٰ عنہ from him (the Holy Prophet); thereupon Abdullah bin Ibrahim said to us: I bear witness to the fact that I heard Abu Huraira (رضی اللہ تعالیٰ عنہ) say that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: I am the last of the Apostles and my mosque is the last of the mosques.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کی مسجدمیں ایک نماز مسجد حرا م کوچھوڑ کر دوسری مساجد میں ایک ہزار نمازوں سے افضل ہے ۔ بلا شبہ رسول اللہ صلی اللہ علیہ وسلم تمام انبیاءؑمیں سے آخری ہیں ، اور آپ کی مسجد ( بھی کسی نبی کی تعمیر کردہ ) آخری مسجد ہے ۔ ابو سلمہ اور ابو عبد اللہ نے کہا : ہمیں اس بارے میں شک نہ تھا کہ ابوہریرہ رضی اللہ تعالیٰ عنہ یہ بات رسول اللہ صلی اللہ علیہ وسلم کی حدیث سے بیان کر رہے ہیں چنانچہ اسی بات نے ہمیں رو کے رکھا کہ ہم ابو ہریرہ رضی اللہ تعالیٰ عنہ سے اس حدیث کے بارے میں ( رسول اللہ صلی اللہ علیہ وسلم سے سماع کا ) اثبات کرائیں حتی کہ جب ابوہریرہ رضی اللہ تعالیٰ عنہ فوت ہو گئے تو ہم نے آپس میں اس بات کا تذکرہ کیا اور ایک دوسرے کو ملا مت کی کہ ہم نے ابو ہریرہ رضی اللہ تعالیٰ عنہ سے اس بارے میں گفتگو کیوں نہیں کی ، تا کہ اگر انھوں نے یہ حدیث رسول اللہ صلی اللہ علیہ وسلم سے سنی تھی تو اس کی نسبت آپ صلی اللہ علیہ وسلم کی طرف کردیتے ۔ ہم اسی کیفیت میں تھے کہ عبد اللہ بن ابراہیم بن قارظ ہمارے ساتھ مجلس میں آبیٹھے تو ہم نے اس حدیث کا اور جس بات کے بارے میں ابو ہریرہ رضی اللہ تعالیٰ عنہ سے صراحت کرانے میں ہم نے کو تا ہی کی تھی کا تذکرہ کیا تو عبد اللہ بن ابرا ہیم بن قارظ نے ہمیں کہا : میں گو اہی دیتا ہوں کہ میں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے سنا وہ کہہ رہے تھے : رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" بلا شبہ میں تمام انبیاءؑمیں سے آخری نبی ہوں ۔ اور میری مسجد آخری مسجد ہے ( جسے کسی نبی نے تعمیر کیا ).",
                "urduNarrator": "مجھ سے اسحاق بن منصور نے بیان کیا، ہم سے عیسیٰ بن المنذر الحمصی نے بیان کیا، ہم سے محمد بن حرب نے بیان کیا، ہم سے الزبیدی نے بیان کیا، وہ الزہری کی سند سے, ابو سلمہ بن عبدالرحمٰن اور جہینہ والوں کے آزاد کردہ غلام ابو عبداللہ اغر سے روایت ہے ۔ ۔ ۔ اور یہ حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ کے ساتھیوں ( شاگردوں ) میں سے تھے ۔ ۔ ۔ ان دونوں نے ابو ہریرہ رضی اللہ تعالیٰ عنہ سے سنا ، وہ کہہ رہے تھے",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا عِيسَى بْنُ الْمُنْذِرِ الْحِمْصِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ، حَدَّثَنَا الزُّبَيْدِيُّ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، وَأَبِي عَبْدِ اللهِ الْأَغَرِّ، مَوْلَى الْجُهَنِيِّينَ - وَكَانَ مِنْ أَصْحَابِ أَبِي هُرَيْرَةَ - أَنَّهُمَا سَمِعَا أَبَا هُرَيْرَةَ يَقُولُ: صَلَاةٌ فِي مَسْجِدِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَفْضَلُ مِنْ أَلْفِ صَلَاةٍ فِيمَا سِوَاهُ مِنَ الْمَسَاجِدِ، إِلَّا الْمَسْجِدَ الْحَرَامَ، فَإِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ آخِرُ الْأَنْبِيَاءِ، وَإِنَّ مَسْجِدَهُ آخِرُ الْمَسَاجِدِ، قَالَ أَبُو سَلَمَةَ، وَأَبُو عَبْدِ اللهِ: لَمْ نَشُكَّ أَنَّ أَبَا هُرَيْرَةَ كَانَ يَقُولُ عَنْ حَدِيثِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَمَنَعَنَا ذَلِكَ أَنْ نَسْتَثْبِتَ أَبَا هُرَيْرَةَ عَنْ ذَلِكَ الْحَدِيثِ، حَتَّى إِذَا تُوُفِّيَ أَبُو هُرَيْرَةَ، تَذَاكَرْنَا ذَلِكَ، وَتَلَاوَمْنَا أَنْ لَا نَكُونَ كَلَّمْنَا أَبَا هُرَيْرَةَ فِي ذَلِكَ حَتَّى يُسْنِدَهُ إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، إِنْ كَانَ سَمِعَهُ مِنْهُ، فَبَيْنَا نَحْنُ عَلَى ذَلِكَ، جَالَسَنَا عَبْدُ اللهِ بْنُ إِبْرَاهِيمَ بْنِ قَارِظٍ، فَذَكَرْنَا ذَلِكَ الْحَدِيثَ، وَالَّذِي فَرَّطْنَا فِيهِ مِنْ نَصِّ أَبِي هُرَيْرَةَ عَنْهُ، فَقَالَ لَنَا عَبْدُ اللهِ بْنُ إِبْرَاهِيمَ: أَشْهَدُ أَنِّي سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «فَإِنِّي آخِرُ الْأَنْبِيَاءِ، وَإِنَّ مَسْجِدِي آخِرُ الْمَسَاجِدِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10941,
                "hadithNumber": "3377",
                "englishNarrator": "Yahya bin Sa'id reported:",
                "hadithEnglish": "I said to Abu Salih: Did you hear Abu Huraira (رضی اللہ تعالیٰ عنہ) making a mention of the excellence of prayer in the mosque of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌)? He said: No (I did not hear directly from Abu Huraira رضی اللہ تعالیٰ عنہ), but I heard Abdullah bin Ibrahim bin Qariz; say that' he had heard from Abu Huraira (رضی اللہ تعالیٰ عنہ) that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had said: Prayer in this mosque of mine is better than a thousand prayers. or. is like one thousand prayers observed in other mosques besides It, except that it be in al-Masjid al-Haram.",
                "hadithUrdu": "میں نے ابو صا لح سے پوچھا : کیا آپ نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ کو رسول اللہ صلی اللہ علیہ وسلم کی مسجد میں نماز پڑھنے کی فضیلت بیان کرتے ہو ئے سنا ہے؟ انھوں نے کہا : نہیں البتہ مجھے عبد اللہ بن ابرا ہیم بن قارظ نے بتا یا کہ انھوں نے حضرت ابوہریرہ رضی اللہ تعالیٰ عنہ سے سنا ، وہ حدیث بیان کر رہے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : میری اس مسجد میں ایک نماز اس کے سوا ( دوسری ) مسجدوں کی ایک ہزار نمازوں سے بہتر ۔ ۔ ۔ یا فر ما یا : ایک ہزار نمازوں کی طرح ہے ۔ ۔ ۔ الایہ کہ وہ مسجد حرا م ہو.",
                "urduNarrator": "ہم سے محمد بن المثنی اور ابن ابی عمر نے ثقفی کی سند سے بیان کیا، ابن المثنی نے کہا: انہوں نے ہم سے بیان کیا عبد الوہاب نے ہمیں حدیث بیان کی کہا ، میں نے یحییٰ بن سعید کو کہتے ہو ئے سنا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ أَبِي عُمَرَ، جَمِيعًا عَنِ الثَّقَفِيِّ، قَالَ ابْنُ الْمُثَنَّى: حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ: سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ، يَقُولُ: سَأَلْتُ أَبَا صَالِح، هَلْ سَمِعْتَ أَبَا هُرَيْرَةَ يَذْكُرُ فَضْلَ الصَّلَاةِ فِي مَسْجِدِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ؟ فَقَالَ: لَا، وَلَكِنْ أَخْبَرَنِي عَبْدُ اللهِ بْنُ إِبْرَاهِيمَ بْنِ قَارِظٍ؛ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يُحَدِّثُ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «صَلَاةٌ فِي مَسْجِدِي هَذَا خَيْرٌ مِنْ أَلْفِ صَلَاةٍ - أَوْ كَأَلْفِ صَلَاةٍ - فِيمَا سِوَاهُ مِنَ الْمَسَاجِدِ، إِلَّا أَنْ يَكُونَ الْمَسْجِدَ الْحَرَامَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10942,
                "hadithNumber": "3378",
                "englishNarrator": null,
                "hadithEnglish": "It was narrated from Yabya bin Sa'id with this chain of transmitters.",
                "hadithUrdu": "مجھ سے زہیر بن حرب، عبید اللہ بن سعید اور محمد بن حاتم نے بیان کیا، انہوں نے کہا: یحییٰ قطان نے یحییٰ بن سعید سے اسی سند کے ساتھ ( یہی ) حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، وَعُبَيْدُ اللهِ بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ حَاتِمٍ، قَالُوا: حَدَّثَنَا يَحْيَى الْقَطَّانُ، عَنْ يَحْيَى بْنِ سَعِيدٍ، بِهَذَا الْإِسْنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10943,
                "hadithNumber": "3379",
                "englishNarrator": "Ibn 'Umar (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Prayer in this mosque of mine is better than a thousand prayers (observed in other mosque.) besides it, except that of Masjid al-Haram.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فر ما یا : \" میریاس مسجد میں ایک نماز اس کے سوا ( دوسری مسجدوں میں ) ایک ہزار نمازیں ادا کرنے سے افضل ہے سوائےمسجد حرام کے ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب اور محمد بن المثنیٰ نے بیان کیا، کہا: انہوں نے ہم سے بیان کیا یحییٰ قطان نے ہمیں عبید اللہ ( بن عمر ) سے حدیث بیان کی ، انھوں نے کہا : مجھے نافع نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے خبر دی انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی",
                "hadithArabic": "وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالَا: حَدَّثَنَا يَحْيَى وَهُوَ الْقَطَّانُ، عَنْ عُبَيْدِ اللهِ، قَالَ: أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «صَلَاةٌ فِي مَسْجِدِي هَذَا أَفْضَلُ مِنْ أَلْفِ صَلَاةٍ فِيمَا سِوَاهُ، إِلَّا الْمَسْجِدَ الْحَرَامَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10944,
                "hadithNumber": "3380",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been narrated on the authority of Ubaidullah with the same chain of transmitters.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے ابن نمیر نے بیان کیا, ابو اسامہ عبد اللہ بن نمیر اور عبد الوہاب سب نے عبید اللہ سے اسی سند کے ساتھ ( یہ ) حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ نُمَيْرٍ، وَأَبُو أُسَامَةَ، ح وَحَدَّثَنَاهُ ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، ح وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، كُلُّهُمْ عَنْ عُبَيْدِ اللهِ بِهَذَا الْإِسْنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10945,
                "hadithNumber": "3381",
                "englishNarrator": null,
                "hadithEnglish": "Ibn 'Umar reported: I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saying like this.",
                "hadithUrdu": "مجھ سے ابراہیم بن موسیٰ نے بیان کیا، کہا ہم سے ابن ابی زیدہ نے بیان کیا, موسیٰ جہنی نے نافع سے انھوں نے ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ فر ما رہے تھے ۔ ۔ ۔ ( آگے ) اسی کے مانند ہے ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِي إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا ابْنُ أَبِي زَائِدَةَ، عَنْ مُوسَى الْجُهَنِيِّ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10946,
                "hadithNumber": "3382",
                "englishNarrator": null,
                "hadithEnglish": "Ibn Umar رضی اللہ تعالیٰ عنہ narrated from Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) a hadith like this.",
                "hadithUrdu": "ہم سے ابن ابی عمر نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، کہا ہم سے معمر نے بیان کیا, ایوب نے نافع سے انھوں نے ابن عمر رضی اللہ تعالیٰ عنہ سے انھوں نے نبی صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَاهُ ابْنُ أَبِي عُمَرَ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10947,
                "hadithNumber": "3383",
                "englishNarrator": "Ibn Abbas (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "A woman fell ill and she said: In case Allah cures me I will certainly go and observe prayer in Bait al-Maqdis. She recovered and so she made preparations to go out (to that place). She came to Maimuna رضی اللہ تعالیٰ عنہا the wife of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). and after greeting her she informed her about it, whereupon she said: Stay here. and eat the provision (which you had made) and observe prayer In the mosque of the Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) for I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) say: Prayer In it is better than a thousand prayers observed in other mosques except the mosque of the Ka'ba.",
                "hadithUrdu": "ایک عورت بیمار ہو گئی اس نے کہا : اگر اللہ نے مجھے شفا دی تو میں بیت المقدس میں جا کر ضرور نماز ادا کروں گی ۔ وہ صحت یا ب ہو گئی ، پھر سفر کے ارادے سے تیاری کی ( سفر سے پہلے ) وہ نبی صلی اللہ علیہ وسلم کی زوجہ حضرت میمونہ رضی اللہ تعالیٰ عنہا کی خدمت میں سلام کہنے کے لیے حا ضر ہوئی اور انھیں یہ سب بتا یا تو حضرت میمونہ رضی اللہ تعالیٰ عنہا نے اس سے کہا : بیٹھ جاؤ اور جو ( زادراہ ) تم نے تیار کیا ہے وہ کھا لو اور رسول اللہ صلی اللہ علیہ وسلم کی مسجد میں نماز پڑھ لو ۔ بلا شبہ !میں رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ فر ما رہے تھے : اس ( مسجد ) میں ایک نماز پڑھنا اس کے سوا ( باقی ) تمام مساجد میں ایک ہزار نمازیں ادا کر نے سے افضل ہے سوائے مسجد کعبہ کے ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید اور محمد بن رحم نے بیان کیا, لیث نے نافع سے روایت کی ، انھوں نے ابرا ہیم بن عبد اللہ بن معبد ( بن عباس ) سے روایت کی ، ( کہا : ) حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت ہے کہ انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ رُمْح، جَمِيعًا عَنِ اللَّيْثِ بْنِ سَعْدٍ، قَالَ قُتَيْبَةُ: حَدَّثَنَا لَيْثٌ، عَنْ نَافِعٍ، عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللهِ بْنِ مَعْبَدٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ قَالَ: إِنَّ امْرَأَةً اشْتَكَتْ شَكْوَى، فَقَالَتْ: إِنْ شَفَانِي اللهُ لَأَخْرُجَنَّ فَلَأُصَلِّيَنَّ فِي بَيْتِ الْمَقْدِسِ، فَبَرَأَتْ، ثُمَّ تَجَهَّزَتْ تُرِيدُ الْخُرُوجَ، فَجَاءَتْ مَيْمُونَةَ زَوْجَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ تُسَلِّمُ عَلَيْهَا، فَأَخْبَرَتْهَا ذَلِكَ، فَقَالَتْ: اجْلِسِي فَكُلِي مَا صَنَعْتِ، وَصَلِّي فِي مَسْجِدِ الرَّسُولِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ. فَإِنِّي سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: «صَلَاةٌ فِيهِ أَفْضَلُ مِنْ أَلْفِ صَلَاةٍ فِيمَا سِوَاهُ مِنَ الْمَسَاجِدِ، إِلَّا مَسْجِدَ الْكَعْبَةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10948,
                "hadithNumber": "3384",
                "englishNarrator": "Abu Hurairah ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "It directly from Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) that he said: Do not undertake a journey to visit any Mosque, but three: this Mosque of mine, the Mosque of al-Haram and the Mosque of Aqsa (Bait al-Maqdis).",
                "hadithUrdu": "وہ اس ( سلسلہ روایت ) کو نبی صلی اللہ علیہ وسلم تک پہنچاتے تھے کہ ( عبادت کے لیے ) تین مسجدوں کے سوا رخت سفر نہ باندھا جائے : میری یہ مسجد ، مسجد حرا م اور مسجد اقصیٰ ۔ \"",
                "urduNarrator": "عمرو  اقد اور زہیر بن حرب نے ابن عیینہ کی سند سے کہا, سفیان نے زہری سے انھوں نے سعید ( بن مسیب ) سے انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی",
                "hadithArabic": "حَدَّثَنِي عَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، قَالَ عَمْرٌو: حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، يَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: لَا تُشَدُّ الرِّحَالُ إِلَّا إِلَى ثَلَاثَةِ مَسَاجِدَ: مَسْجِدِي هَذَا، وَمَسْجِدِ الْحَرَامِ، وَمَسْجِدِ الْأَقْصَى.",
                "headingArabic": "فضل المساجد الثلاثة",
                "headingUrdu": "تین مسجدوں کی فضیلت",
                "headingEnglish": "The virtue of the Three Masajid",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10949,
                "hadithNumber": "3385",
                "englishNarrator": "This hadith has been narrated on the authority of Zuhri (but with this change of words) that he (Allah's Apostle ﷺ) said:",
                "hadithEnglish": "\"Undertake journey to three mosques.\"",
                "hadithUrdu": "\" ( عبادت کے لیے ) تین مسجدوں کی طرف رخت سفر باندھا جا سکتا ہے ۔\"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے عبد الاعلٰی نے بیان کیا, معمر نے زہری سے اسی سند کے ساتھ روایت کی ، البتہ انھوں نے کہا",
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الْأَعْلَى، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، بِهَذَا الْإِسْنَادِ، غَيْرَ أَنَّهُ قَالَ: «تُشَدُّ الرِّحَالُ إِلَى ثَلَاثَةِ مَسَاجِدَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10950,
                "hadithNumber": "3386",
                "englishNarrator": "Abu Haraira (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger (ﷺ) as saying: One should undertake journey to three mosques: the mosque of the Ka'ba, my mosque, and the mosque of Elia (Bait al-Maqdis).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا صرف تین مسجدوں کی طرف ہی ( عبادت کے لیے ) سفر کیا جا سکتا ہے ۔ کعبہ کی مسجد میری مسجد اور ایلیاءکی مسجد ( مسجد اقصیٰ ).",
                "urduNarrator": "ہم سے ہارون بن سعید الایلی نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، ان سے عبد الحمید بن جعفر نے بیان کیا، ان سے عمران بن ابی انس نے بیان کیا کہ,سلمان اغر نے حدیث بیان کی انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے سنا ، وہ بتا رہے تھے کہ",
                "hadithArabic": "وحَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، حَدَّثَنِي عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ، أَنَّ عِمْرَانَ بْنَ أَبِي أَنَسٍ، حَدَّثَهُ، أَنَّ سَلْمَانَ الْأَغَرَّ، حَدَّثَهُ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يُخْبِرُ أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: إِنَّمَا يُسَافَرُ إِلَى ثَلَاثَةِ مَسَاجِدَ: مَسْجِدِ الْكَعْبَةِ، وَمَسْجِدِي، وَمَسْجِدِ إِيلِيَاءَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10951,
                "hadithNumber": "3387",
                "englishNarrator": "Abu Salama bin Abdul-Rahman reported:",
                "hadithEnglish": "'Abdul-Rabman bin Abu Sa'id al-Khudri (Allah be pleased with him) happened to pass by me and I said to him. How did you hear your father making mention of the mosque founded on Piety? He said: My father said: I went to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as he was in the house of one of his wives, and said: Messenger of Allah ﷺ, which of the two mosques is founded on piety? Thereupon he took a handful of pebbles and threw them on the ground and then said: This is the very mosque of yours (mosque at Medina). He (the narrator) said: I bear witness that I heard your father making mention of it.",
                "hadithUrdu": "عبد الرحمٰن بن ابی سعید خدری میرے ہاں سے گزرے تو میں نے ان سے کہا : آپ نے اپنے والد کو اس مسجد کے بارے میں جس کی بنیا د تقویٰ پر رکھی گئی ، کس طرح ذکر کرتے ہو ئے سنا؟ انھوں نے کہا : میرے والد نے کہا :ا می رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں آپ کی ایک اہلیہ محترمہ کے گھر میں حا ضر ہوا اور عرض کی : اے اللہ کے رسول !دونوں مسجدوں میں سے کو ن سی ( مسجد ) ہے جس کی بنیا د تقوی پر رکھی گئی ہے؟ کہا : آپ نے مٹھی بھر کنکریاں لیں اور انھیں زمین پر مارا پھر فرما یا : \" وہ تمھا ری یہی مسجد ہے ۔ مدینہ کی مسجد کے بارے میں ( ابو سلمہ نے ) کہا : تو میں نے کہا : میں گو اہی دیتا ہوں کہ میں نے بھی تمھا رے والد سے سنا ، وہ اسی طرح بیان کر رہے تھے ۔",
                "urduNarrator": "مجھ سے محمد بن حاتم نے بیان کیا، کہا ہم سے یحییٰ بن سعید نے بیان کیا, حمید خراط سے روایت ہے کہا : میں نے ابو سلمہ بن عبد الرحمٰن سے سنا انھوں نے کہا",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ حُمَيْدٍ الْخَرَّاطِ، قَالَ: سَمِعْتُ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ، قَالَ: مَرَّ بِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ: قُلْتُ لَهُ: كَيْفَ سَمِعْتَ أَبَاكَ يَذْكُرُ فِي الْمَسْجِدِ الَّذِي أُسِّسَ عَلَى التَّقْوَى؟ قَالَ: قَالَ أَبِي: دَخَلْتُ عَلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي بَيْتِ بَعْضِ نِسَائِهِ، فَقُلْتُ: يَا رَسُولَ اللهِ، أَيُّ الْمَسْجِدَيْنِ الَّذِي أُسِّسَ عَلَى التَّقْوَى؟ قَالَ: فَأَخَذَ كَفًّا مِنْ حَصْبَاءَ، فَضَرَبَ بِهِ الْأَرْضَ، ثُمَّ قَالَ: «هُوَ مَسْجِدُكُمْ هَذَا» لِمَسْجِدِ الْمَدِينَةِ، قَالَ: فَقُلْتُ: أَشْهَدُ أَنِّي سَمِعْتُ أَبَاكَ هَكَذَا يَذْكُرُهُ.",
                "headingArabic": "بَيَانِ أَنَّ الْمَسْجِدَ الَّذِي أُسِّسَ عَلَى التَّقْوَى هُوَ مَسْجِدُ النَّبِيِّ صلى الله عليه وسلم بِالْمَدِينَةِ",
                "headingUrdu": "وہ مسجد جس کی بنیاد تقویٰ پر رکھی گئی وہ مسجد نبوی صلی اللہ علیہ وسلم مدینہ منورہ ہے۔",
                "headingEnglish": "The Masjid whose foundation was founded upon piety is the Masjid of the Prophet saws in Al-Madinah",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10952,
                "hadithNumber": "3388",
                "englishNarrator": null,
                "hadithEnglish": "Abu Sa'id رضی اللہ تعالیٰ عنہ reported from Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) a hadlth like this, but in the chain of transmitters no mention was made of Abdul-Rahman bin Abu Sa'id رضی اللہ تعالیٰ عنہ .",
                "hadithUrdu": "حمید ( طویل ) نے ابو سلمہ سے انھوں نے ابو سعید خدی رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے اسی مانند روایت کی ۔ ۔ ۔ اور انھوں نے سند میں عبد الرحمٰن بن ابو سعید کا ذکر نہیں کیا ( برا ہ راست حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ سے روایت کی )",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَسَعِيدُ بْنُ عَمْرٍو الْأَشْعَثِيُّ، قَالَ سَعِيدٌ: أَخْبَرَنَا، وَقَالَ أَبُو بَكْرٍ: حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، عَنْ حُمَيْدٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي سَعِيدٍ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ، وَلَمْ يَذْكُرْ عَبْدَ الرَّحْمَنِ بْنَ أَبِي سَعِيدٍ فِي الْإِسْنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10953,
                "hadithNumber": "3389",
                "englishNarrator": "Ibn Umar رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) visited (the mosque) at Quba' riding and on foot.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم سوار ہو کر اور ( کبھی ) پیدل قباء کی زیارت فرماتے تھے ۔",
                "urduNarrator": "ہم سے ابو جعفر احمد بن منیٰع نے بیان کیا، ہم سے اسماعیل بن ابراہیم نے بیان کیا، ہم سے ایوب نے ہمیں نافع سے حدیث بیان کی ، انھوں نے ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو جَعْفَرٍ أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَيُّوبُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ يَزُورُ قُبَاءً رَاكِبًا وَمَاشِيًا»",
                "headingArabic": "فَضْلِ مَسْجِدِ قُبَاءٍ وَفَضْلِ الصَّلاَةِ فِيهِ وَزِيَارَتِهِ ‏‏",
                "headingUrdu": "مسجد قبا کی فضیلت اور اس میں نماز پڑھنے اور اس کی زیارت کی فضیلت",
                "headingEnglish": "The virtue of the Masjid of Quba', and the virtue of praying therein and visiting it",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10954,
                "hadithNumber": "3390",
                "englishNarrator": "Ibn Umar (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) came to the mosque at Quba' riding and on foot, and he observed two rak'ahs of (Nafl prayer) in it.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم سوار ہو کر اور ( پیدل دونوں طرح سے ) قباء تشریف لاتے اور وہاں دو رکعتیں ادا فر ما تے ۔ ابو بکر نے اپنی روایت میں کہا : ( یہ ابو اسامہ نے نہیں بلکہ ) ابن نمیرنے کہا : اور آپ صلی اللہ علیہ وسلم وہاں دو رکعتیں نماز ادا کرتے ۔",
                "urduNarrator": "ابو بکر ابی شیبہ نے حدیث بیان کی ، ( کہا ) ہمیں عبد اللہ بن نمیر اور ابو اسامہ نے عبید اللہ سے حدیث سنا ئی ۔ اسی طرح محمد بن نمیر نے ہمیں حدیث سنا ئی ( کہا : ) میرے والد نے ہمیں حدیث سنا ئی ( کہا : ) ہمیں عبید اللہ نے نافع سے انھوں نے ابن عمر رضی اللہ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللهِ بْنُ نُمَيْرٍ، وَأَبُو أُسَامَةَ، عَنْ عُبَيْدِ اللهِ ح، وحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ: «كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَأْتِي مَسْجِدَ قُبَاءٍ رَاكِبًا وَمَاشِيًا، فَيُصَلِّي فِيهِ رَكْعَتَيْنِ»، قَالَ أَبُو بَكْرٍ فِي رِوَايَتِهِ: قَالَ ابْنُ نُمَيْرٍ: فَيُصَلِّي فِيهِ رَكْعَتَيْنِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10955,
                "hadithNumber": "3391",
                "englishNarrator": "Ibn 'Umar reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came to Quba' riding as well as on foot.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم سوار ہو کر اور پیدل قباء تشریف لا یا کرتے تھے ۔",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا, ہمیں یحییٰ نےحدیث بیان کی ، ( کہا : ) ہمیں عبید اللہ نے حدیث بیان کی ، ( کہا : ) مجھے نافع نے ابن عمر رضی اللہ تعالیٰ عنہ سے خبر دی کہ",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، حَدَّثَنَا عُبَيْدُ اللهِ، أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْتِي قُبَاءً رَاكِبًا وَمَاشِيًا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10956,
                "hadithNumber": "3392",
                "englishNarrator": null,
                "hadithEnglish": "A Hadith like that of Yahya Al-Qattan (as no. 3391) was narrated from Nafi,  from Ibn Umar رضی اللہ تعالیٰ عنہ , from the prophet ﷺ.",
                "hadithUrdu": "مجھ سے ابو معن الرقاشی نے بیان کیا: زید بن یزید ثقفی، بصری، ثقہ، ہم سے روایت کرتے ہیں, خالد بن حارث نے ہمیں ابن عجلا ن سے حدیث بیان کی ، انھوں نے نافع سے ، انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے یحییٰ قطان کی حدیث کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِي أَبُو مَعْنٍ الرَّقَاشِيُّ زَيْدُ بْنُ يَزِيدَ الثّقَفِيُّ بَصْرِيٌّ ثِقَةٌ، حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ، عَنِ ابْنِ عَجْلَانَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، بِمِثْلِ حَدِيثِ يَحْيَى الْقَطَّانِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10957,
                "hadithNumber": "3393",
                "englishNarrator": "Abdullah bin Umar (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to come to Quba' riding and on foot",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم سوار ہو کر اور پیدل قباء تشریف لا یا کرتے تھے ۔",
                "urduNarrator": "یحییٰ بن یحییٰ نے کہا : میں نے امام مالک کے سامنے قراءت کی کہ عبد اللہ بن دینار سے روایت ہے ، انھوں نے حضرت عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ عَبْدِ اللهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللهِ بْنِ عُمَرَ، «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْتِي قُبَاءً رَاكِبًا وَمَاشِيًا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10958,
                "hadithNumber": "3394",
                "englishNarrator": "Abdullah bin 'Umar رضی اللہ تعالیٰ عنہ said:",
                "hadithEnglish": "The Messenger of Allah ﷺ used to go to Quba, riding and walking.",
                "hadithUrdu": "رسول صلی اللہ علیہ وسلم سوار ہو کراور پیدل قباء تشریف لا یا کرتے تھے ۔",
                "urduNarrator": "ہم سے یحییٰ بن ایوب، قتیبہ اور ابن حجر نے بیان کیا، کہا: ہم سے انہوں نے بیان کیا ہمیں اسماعیل بن جعفر نے حدیث بیان کی ، ( کہا : ) مجھے عبد اللہ بن دینار نے خبر دی کہ انھوں نے حضرت عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ کو کہتے ہو ئے سنا",
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ حُجْرٍ، قَالَ ابْنُ أَيُّوبَ: حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، أَخْبَرَنِي عَبْدُ اللهِ بْنُ دِينَارٍ، أَنَّهُ سَمِعَ عَبْدَ اللهِ بْنَ عُمَرَ، يَقُولُ: «كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَأْتِي قُبَاءً رَاكِبًا وَمَاشِيًا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10959,
                "hadithNumber": "3395",
                "englishNarrator": "It was narrated from Abdullah bin Dinar:",
                "hadithEnglish": "Ibn Umar رضی اللہ تعالیٰ عنہ used to come to Quba' on every Saturday and he said: I saw Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم) coming (to this place) on every Saturday.",
                "hadithUrdu": "حضرت ابن عمر رضی اللہ تعالیٰ عنہ ہر ہفتے کے روز قباء آتے تھے وہ کہا کرتے تھے : میں نے نبی صلی اللہ علیہ وسلم کو دیکھا آپ ہر ہفتے کے روز یہاں تشریف لا تے تھے ۔",
                "urduNarrator": "مجھے زہیر بن حرب نے حدیث بیان کی کہا : ہمیں سفیان بن عیینہ نے حدیث سنا ئی ۔ انھوں نے عبد اللہ بن دینارسے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَبْدِ اللهِ بْنِ دِينَارٍ، أَنَّ ابْنَ عُمَرَ كَانَ يَأْتِي قُبَاءً كُلَّ سَبْتٍ، وَكَانَ يَقُولُ: «رَأَيْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَأْتِيهِ كُلَّ سَبْتٍ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10960,
                "hadithNumber": "3396",
                "englishNarrator": "Abdullah bin 'Umar رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) used to come to Quba', i.e. (he came) on every Saturday, and he used to come riding or on foot. Ibn Dinar (another narrator) said that Ibn Umar رضی اللہ تعالیٰ عنہ used to do like this.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ہر ہفتے کے روز قباء آتے آپ وہاں سوار ہو کر اور ( کبھی ) پیدل تشریف لا تے تھے ابن دینار نے کہا : حضرت ابن عمر رضی اللہ تعالیٰ عنہ ( بھی ) ایسا ہی کرتے تھے ۔",
                "urduNarrator": "ہم سے ابن ابی عمر نے بیان کیا، کہا ہم سے سفیان نے بیان کیا، انہوں نے عبداللہ بن دینار سے، انہوں نے عبداللہ بن عمر رضی اللہ عنہما سے",
                "hadithArabic": "وَحَدَّثَنَاهُ ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ اللهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللهِ بْنِ عُمَرَ، «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْتِي قُبَاءً - يَعْنِي - كُلَّ سَبْتٍ،، كَانَ يَأْتِيهِ رَاكِبًا وَمَاشِيًا»، قَالَ ابْنُ دِينَارٍ: «وَكَانَ ابْنُ عُمَرَ يَفْعَلُهُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10961,
                "hadithNumber": "3397",
                "englishNarrator": "This hadith has been narrated on the authority of Ibn Dinar:",
                "hadithEnglish": "But he made no mention of: Every Saturday.",
                "hadithUrdu": "مگر ہر ہفتے کے روز کا ذکر نہیں کیا ۔",
                "urduNarrator": "مجھ سے عبداللہ بن ہاشم نے بیان کیا، ہم سے وکیع نے بیان کیا،سفیان ثوری نے ابن دینار سے اسی سند کے ساتھ روایت کی",
                "hadithArabic": "وحَدَّثَنِيهِ عَبْدُ اللهِ بْنُ هَاشِمٍ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنِ ابْنِ دِينَارٍ، بِهَذَا الْإِسْنَادِ، وَلَمْ يَذْكُرْ كُلَّ سَبْتٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10962,
                "hadithNumber": "3398",
                "englishNarrator": "Alqama reported:",
                "hadithEnglish": "While I was walking with 'Abdullah at Mina, 'Uthman رضی اللہ عنہ happened to meet him. He stopped there and began to talk with him. Uthman said to him: Abu 'Abdul-Rahman, should we not marry you to a young girl who may recall to you some of the past of your bygone days; thereupon he said: If you say so, Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم) said: O young men, those among you who can support a wife should marry, for it restrains eyes from casting (evil glances). and preserves one from immorality; but those who cannot should devote themselves to fasting for it is a means of controlling sexual desire.",
                "hadithUrdu": "میں منیٰ میں حضرت عبداللہ بن مسعود رضی اللہ عنہ کے ساتھ پیدل چل رہا تا کہ حضرت عثمان رضی اللہ عنہ سے ان کی ملاقات ہوئی ، وہ کھڑے ہو کر ان سے باتیں کرنے لگے ۔ سیدنا عثمان رضی اللہ عنہ نے اِن سے کہا : ابوعبدالرحمٰن! کیا ہم کسی نوجوان لڑکی سے آپ کی شادی نہ کرا دیں ، شاید وہ آپ کو آپ کا وہی زمانہ یاد کرا دے جو گزر چکا ہے؟ کہا : تو حضرت عبداللہ بن مسعود رضی اللہ عنہ نے کہا : اگر آپ نے یہ بات کہی ہے تو ( اس سے پہلے ) رسول اللہ صلی اللہ علیہ وسلم نے ہم سے فرمایا تھا : \" اے جوانوں کے گروہ! تم میں سے جو کوئی شادی کی استطاعت رکھتا ہو وہ شادی کر لے ، یہ نگاہ کو زیادہ جھکانے والی اور شرمگاہ کی زیادہ حفاظت کرنے والی ہے اور جو استطاعت نہیں رکھتا تو وہ روزے کو لازم کر لے ، یہ اس کے لیے خواہش کو قابو میں کرنے کا ذریعہ ہے.",
                "urduNarrator": "یحییٰ بن یحییٰ التمیمی، ابوبکر بن ابی شیبہ اور محمد بن علاء الحمدانی نے ہم سے روایت کی ہے, ابو معاویہ نے ہمیں اعمش سے خبر دی ، انہوں نے ابراہیم سے ، انہوں نے علقمہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ الْعَلَاءِ الْهَمْدَانِيُّ، جَمِيعًا عَنْ أَبِي مُعَاوِيَةَ، وَاللَّفْظُ لِيَحْيَى، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، قَالَ: كُنْتُ أَمْشِي مَعَ عَبْدِ اللهِ بِمِنًى، فَلَقِيَهُ عُثْمَانُ، فَقَامَ مَعَهُ يُحَدِّثُهُ، فَقَالَ لَهُ عُثْمَانُ: يَا أَبَا عَبْدِ الرَّحْمَنِ، أَلَا نُزَوِّجُكَ جَارِيَةً شَابَّةً، لَعَلَّهَا تُذَكِّرُكَ بَعْضَ مَا مَضَى مِنْ زَمَانِكَ، قَالَ: فَقَالَ عَبْدُ اللهِ: لَئِنْ قُلْتَ ذَاكَ، لَقَدْ قَالَ لَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «يَا مَعْشَرَ الشَّبَابِ، مَنِ اسْتَطَاعَ مِنْكُمُ الْبَاءَةَ فَلْيَتَزَوَّجْ، فَإِنَّهُ أَغَضُّ لِلْبَصَرِ، وَأَحْصَنُ لِلْفَرْجِ، وَمَنْ لَمْ يَسْتَطِعْ فَعَلَيْهِ بِالصَّوْمِ، فَإِنَّهُ لَهُ وِجَا.",
                "headingArabic": "اسْتِحْبَابِ النِّكَاحِ لِمَنْ تَاقَتْ نَفْسُهُ إِلَيْهِ وَوَجَدَ مُؤْنَةً وَاشْتِغَالِ مَنْ عَجَزَ عَنِ الْمُؤَنِ بِالصَّوْمِ",
                "headingUrdu": "نکاح اس کے لیے مستحب ہے جو اس کی خواہش رکھتا ہو اور اس کی استطاعت رکھتا ہو اور جو اس کی استطاعت نہ رکھتا ہو اسے چاہیے کہ وہ روزے سے مشغول ہو جائے۔",
                "headingEnglish": "Marriage is recommended for the one who desires it and can afford it, and the one who cannot afford it should distract himself by fasting",
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10963,
                "hadithNumber": "3399",
                "englishNarrator": "Alqama reported:",
                "hadithEnglish": "While I was going along with 'Abdullah bin Ma'sud (رضی اللہ عنہ) in Mina, 'Uthman bin 'Affan (رضی اللہ عنہ) happened to meet him and said: Come here, Abu 'Abdul-Rahman (kunya of Abdullah bin Mas'ud), and he isolated him (from me), and when 'Abdullah (bin Mas'ud) رضی اللہ عنہ saw that there was no need (for this privacy), he said to me: 'Alqama, come on, and so I went there. (Then) 'Uthman رضی اللہ عنہ said to him: Abu Abdul-Rahman, should we not marry you to a virgin girl that your past may be recalled to your mind? 'Abdullah رضی اللہ عنہ said: If you say so, the rest of the hadith is the same as narrated above.",
                "hadithUrdu": "میں منیٰ میں حضرت عبداللہ بن مسعود رضی اللہ عنہ کے ساتھ پیدل چل رہا تھا کہ حضرت عثمان رضی اللہ عنہ ان سے ملے تو انہوں نے کہا : ابوعبدالرحمٰن! ( میرے ساتھ ) آئیں ۔ کہا : وہ انہیں تنہائی میں لے گئے ۔ جب عبداللہ ( بن مسعود ) رضی اللہ عنہ نے دیکھا کہ انہیں اس ( تنہائی ) کی ضرورت نہیں ، تو انہوں نے مجھے بلا لیا ۔ ( کہا : ) علقمہ آ جاؤ! میں آ گیا ، تو سیدنا عثمان رضی اللہ عنہ نے ان سے کہا : ابوعبدالرحمٰن! کیا ہم کسی کنواری لڑکی سے آپ کی شادی نہ کرا دیں ، شاید یہ آپ کے دل کی اسی کیفیت کو لوٹا دے جو آپ ( عہد جوانی ) میں محسوس کرتے تھے؟ تو عبداللہ رضی اللہ عنہ نے جواب دیا : اگر آپ نے یہ بات کہی ہے ۔ ۔ ۔ پھر ابومعاویہ کی حدیث کے مانند بیان کیا ۔",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ نے بیان کیا، انہوں نے کہا جریر نے ہمیں اعمش سے حدیث بیان کی ، انہوں نے ابراہیم سے ، انہوں نے علقمہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنِ الْأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، قَالَ: إِنِّي لَأَمْشِي مَعَ عَبْدِ اللهِ بْنِ مَسْعُودٍ بِمِنًى، إِذْ لَقِيَهُ عُثْمَانُ بْنُ عَفَّانَ، فَقَالَ: هَلُمَّ يَا أَبَا عَبْدِ الرَّحْمَنِ، قَالَ: فَاسْتَخْلَاهُ، فَلَمَّا رَأَى عَبْدُ اللهِ أَنْ لَيْسَتْ لَهُ حَاجَةٌ، قَالَ: قَالَ لِي: تَعَالَ يَا عَلْقَمَةُ، قَالَ: فَجِئْتُ، فَقَالَ لَهُ عُثْمَانُ: أَلَا نُزَوِّجُكَ يَا أَبَا عَبْدِ الرَّحْمَنِ جَارِيَةً بِكْرًا، لَعَلَّهُ يَرْجِعُ إِلَيْكَ مِنْ نَفْسِكَ مَا كُنْتَ تَعْهَدُ؟ فَقَالَ عَبْدُ اللهِ: لَئِنْ قُلْتَ ذَاكَ، فَذَكَرَ بِمِثْلِ حَدِيثِ أَبِي مُعَاوِيَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 10651,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=426",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=424",
                "label": "424",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=425",
                "label": "425",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=426",
                "label": "426",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=427",
                "label": "427",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=428",
                "label": "428",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=429",
                "label": "429",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=430",
                "label": "430",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=428",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=428",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=426",
        "to": 10675,
        "total": 40465
    }
}