{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 407,
        "data": [
            {
                "id": 10439,
                "hadithNumber": "2875",
                "englishNarrator": "It was narrated that Ibn Umar رضی اللہ تعالیٰ عنہ said: I heard the prophet ﷺ say:",
                "hadithEnglish": "Five (are the beasts) in killing which or their being killed in the precinct of the Ka'ba there is no sin. The rest of the hadith is the same.",
                "hadithUrdu": "میں ان میں سے جو بھی حرم میں قتل کر دیا جا ئے اس کے قتل پر کو ئی گنا ہ نہیں ۔ پھر مذکورہ بالا حدیث بیان کی ۔",
                "urduNarrator": "محمد بن اسحا ق نے نافع اور عبید اللہ بن عبد اللہ سے خبر دی انھوں نے ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا",
                "hadithArabic": "وحَدَّثَنِيهِ فَضْلُ بْنُ سَهْلٍ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْحَاقَ، عَنْ نَافِعٍ، وَعُبَيْدِ اللهِ بْنِ عَبْدِ اللهِ، عَنِ ابْنِ عُمَرَ رَضِيَ اللهُ عَنْهُمَا، قَالَ: سَمِعْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: خَمْسٌ لَا جُنَاحَ فِي قَتْلِ مَا قُتِلَ مِنْهُنَّ فِي الْحَرَمِ فَذَكَرَ بِمِثْلِهِ.",
                "headingArabic": "جَوَازِ حَلْقِ الرَّأْسِ لِلْمُحْرِمِ إِذَا كَانَ بِهِ أَذًى وَوُجُوبِ الْفِدْيَةِ لِحَلْقِهِ وَبَيَانِ قَدْرِهَا",
                "headingUrdu": "محرم کے لیے اگر کوئی مسئلہ ہو تو سر منڈوانا جائز ہے، لیکن اس کے منڈوانے کے لیے فدیہ دینا واجب ہے، اور یہ واضح کرنا کہ فدیہ کیا ہے؟",
                "headingEnglish": "It is permissible for a Muhrim to shave his head if there is a problem, but it is obligatory to offer a Fidyah for shaving it, and Clarifying what the Fidyah is",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10440,
                "hadithNumber": "2876",
                "englishNarrator": "Abdullah bin Umar (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Five (are the animals) which, it one kills them In the state of Ihram, entail no sin for one (who does it): scorpion, rat, voracious dog, crow and kite.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \"\" پانچ ( موذی جا نور ) ہیں جو انھیں احرا م کی حالت میں مار دے اس پر کو ئی گناہ نہیں ۔ چو ہا ، بچھو ، کوا چیل اور کا ٹنے والا کتا ۔ الفاظ یحییٰ بن یحییٰ کے ہیں.",
                "urduNarrator": "یحییٰ بن یحییٰ ، یحییٰ بن ایو ب قتیبہ اور ابن حجر نے اسما عیل بن جعفر سے حدیث بیان کی کہا : عبد اللہ بن دینا ر سے روایت ہے کہ انھوں نے عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ سے سنا وہ کہہ رہے تھے",
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَيَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ حُجْرٍ، - قَالَ يَحْيَى بْنُ يَحْيَى: أَخْبَرَنَا، وقَالَ الْآخَرُونَ: - حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ عَبْدِ اللهِ بْنِ دِينَارٍ، أَنَّهُ سَمِعَ عَبْدَ اللهِ بْنَ عُمَرَ رَضِيَ اللهُ عَنْهُمَا، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: خَمْسٌ مَنْ قَتَلَهُنَّ وَهُوَ حَرَامٌ فَلَا جُنَاحَ عَلَيْهِ فِيهِنَّ: الْعَقْرَبُ، وَالْفَأْرَةُ، وَالْكَلْبُ الْعَقُورُ، وَالْغُرَابُ، وَالْحُدَيَّا - وَاللَّفْظُ لِيَحْيَى بْنِ يَحْيَى.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10441,
                "hadithNumber": "2877",
                "englishNarrator": "Ka'b bin 'Ujra (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came to me on the occasion of Hudaibiya and I was kindling fire under my cooking pot and lice were creeping on my face. Thereupon he (the Holy Prophet) said: Do the vermins harm your head? I said: Yes. He said: Get your head shaved and (in lieu of it) observe fasts for three days or feed six needy persons, or offer sacrifice (of an animal). Ayyub said: I do not know with what (type of expiation) did he commence (the statement).",
                "hadithUrdu": "حدیبیہ کے د نوں میں نبی صلی اللہ علیہ وسلم میرے پاس تشر یف لا ئے میں ۔ ۔ ۔ قواریری کے بقول اپنی ہنڈیا کے نیچے اور ابو ربیع کے بقول ۔ ۔ ۔ اپنی پتھر کی دیگ کے نیچے آگ جلا رہا تھا اور ( میرے سر کی ) جو ئیں میرے چہرے پر گر رہی تھیں آپ نے فر ما یا : \" کیا تمھا رے سر کی مخلوق ( جوئیں رضی اللہ تعالیٰ عنہ تمھا رے لیے با عث اذیت ہیں؟کہا : میں نے جواب دیا جی ہاں ، آپ نے فر ما یا : \" تو اپنا سر منڈوادو ( اور فدیے کے طور پر ) تین دن کے روزےرکھو ۔ یا چھ مسکینوں کو کھا نا کھلا ؤ یا ( ایک ) قربا نی دے دو ۔ ایو ب نے کہا : مجھے علم نہیں ان ( فدیے کی صورتوں میں ) سے آپ صلی اللہ علیہ وسلم نے کس چیز کا پہلے ذکر کیا ۔",
                "urduNarrator": "مجھے عبید اللہ بن عمر قواریری اور ابو ربیع نے حدیث بیان کی ( دونوں نے کہا ) ہمیں حما د بن زید نے حدیث سنائی ( حماد بن زید نے کہا ) ہمیں ایو ب نے حدیث بیا ن کی ، کہا : میں نے مجا ہد سے سنا ، وہ عبد الرحمٰن بن ابی لیلیٰ سے حدیث بیان کر رہے تھے انھوں نے کعب بن عجرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وحَدَّثَنِي عُبَيْدُ اللهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ، عَنْ أَيُّوبَ، ح وحَدَّثَنِي أَبُو الرَّبِيعِ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا أَيُّوبُ، قَالَ: سَمِعْتُ مُجَاهِدًا، يُحَدِّثُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ كَعْبِ بْنِ عُجْرَةَ رَضِيَ اللهُ عَنْهُ، قَالَ: أَتَى عَلَيَّ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ زَمَنَ الْحُدَيْبِيَةِ وَأَنَا أُوقِدُ تَحْتَ - قَالَ الْقَوَارِيرِيُّ: قِدْرٍ لِي، وقَالَ أَبُو الرَّبِيعِ: بُرْمَةٍ لِي - وَالْقَمْلُ يَتَنَاثَرُ عَلَى وَجْهِي، فَقَالَ: «أَيُؤْذِيكَ هَوَامُّ رَأْسِكَ؟» قَالَ قُلْتُ: نَعَمْ، قَالَ: «فَاحْلِقْ، وَصُمْ ثَلَاثَةَ أَيَّامٍ، أَوْ أَطْعِمْ سِتَّةَ مَسَاكِينَ، أَوْ انْسُكْ نَسِيكَةً» قَالَ أَيُّوبُ: فَلَا أَدْرِي بِأَيِّ ذَلِكَ بَدَأَ.",
                "headingArabic": "جَوَازِ حَلْقِ الرَّأْسِ لِلْمُحْرِمِ إِذَا كَانَ بِهِ أَذًى وَوُجُوبِ الْفِدْيَةِ لِحَلْقِهِ وَبَيَانِ قَدْرِهَا",
                "headingUrdu": "محرم کے لیے اگر کوئی مسئلہ ہو تو سر منڈوانا جائز ہے، لیکن اس کے منڈوانے کے لیے فدیہ دینا واجب ہے، اور یہ واضح کرنا کہ فدیہ کیا ہے؟",
                "headingEnglish": "It is permissible for a Muhrim to shave his head if there is a problem, but it is obligatory to offer a Fidyah for shaving it, and Clarifying what the Fidyah is",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10442,
                "hadithNumber": "2878",
                "englishNarrator": null,
                "hadithEnglish": "This hadith is narrated on the authority of Ayyub.",
                "hadithUrdu": "علی بن حجر الساعدی، زہیر بن حرب، اور یعقوب بن ابراہیم نے مجھےابن علیہ نے ایوب سے اسی سند کے ساتھ اسی کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، وَزُهَيْرُ بْنُ حَرْبٍ، وَيَعْقُوبُ بْنُ إِبْرَاهِيمَ، جَمِيعًا عَنِ ابْنِ عُلَيَّةَ، عَنْ أَيُّوبَ، فِي هَذَا الْإِسْنَادِ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10443,
                "hadithNumber": "2879",
                "englishNarrator": "Kalb bin Ujra (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "It was I for whom this verse was revealed (to the Holy Prophet): Whoever among you is sick or has an ail- ment of the head, he (may effect) a compensation by lasting or alms or a sacrifice He said: I came to him (the Holy Prophet) and he said: Come Dear. So I went near. He (again) said: Come near. So I went near. Thereupon the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Do the vermins trouble you? Ibn Aun (one of the narrators) said: I think he (Ka'b bin Ujra) replied in the affirmative. He (the Holy Prophet) then commanded to do compensation by fasting or by giving sadaqa (feeding six needy persons) or by sacrifice (of a animal) that is available.",
                "hadithUrdu": "یہ آیت میرے بارے میں نا زل ہوئی : پھر اگر تم میں سے کو ئی شخص بیمار ہو یا اس کے سر میں تکلیف ہو ( اور وہ سر منڈوالے ) تو فدیے میں روزے رکھے یا صدقہ دے یا قربانی کرے ۔ کہا میں آپ کی خدمت میں حا ضر ہوا آپ نے فر ما یا : \"\" ذرا قریب آؤ ۔ میں آپ کے ( کچھ ) قیریب ہو گیا آپ نے فر ما یا : \"\" اور قریب آؤ ۔ تو میں آپ کے اور قریب ہو گیا آپ صلی اللہ علیہ وسلم نے پو چھا : کیا تمھا ری جو ئیں تمھیں ایذا دیتی ہیں ؟ ابن عون نے کہا : میرا خیال ہے کہ انھوں ( کعب رضی اللہ تعالیٰ عنہ ) نے کہا جی ہاں ( کعب رضی اللہ تعالیٰ عنہ نے ) کہا : تو آپ نے مجھے حکم دیا کے روزے صدقے یا قر بانی میں سے جو آسان ہو بطور فدیہ دوں ۔",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا، انہوں نے کہا ابن عون نے مجا ہد سے انھوں نے عبد الرحمٰن بن ابی لیلیٰ سے انھوں نے کعب بن عجرہ رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنِ ابْنِ عَوْنٍ، عَنْ مُجَاهِدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ كَعْبِ بْنِ عُجْرَةَ رَضِيَ اللهُ عَنْهُ، قَالَ: فِيَّ أُنْزِلَتْ هَذِهِ الْآيَةُ: {فَمَنْ كَانَ مِنْكُمْ مَرِيضًا أَوْ بِهِ أَذًى مِنْ رَأْسِهِ فَفِدْيَةٌ مِنْ صِيَامٍ أَوْ صَدَقَةٍ أَوْ نُسُكٍ} [البقرة: 196] قَالَ: فَأَتَيْتُهُ، فَقَالَ: «ادْنُهْ» فَدَنَوْتُ، فَقَالَ: ادْنُهْ فَدَنَوْتُ، فَقَالَ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَيُؤْذِيكَ هَوَامُّكَ؟» - قَالَ ابْنُ عَوْنٍ: وَأَظُنُّهُ -، قَالَ: نَعَمْ، قَالَ: «فَأَمَرَنِي بِفِدْيَةٍ مِنْ صِيَامٍ أَوْ صَدَقَةٍ أَوْ نُسُكٍ، مَا تَيَسَّرَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10444,
                "hadithNumber": "2880",
                "englishNarrator": "Ka'b bin 'Ujra (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "The Messenger of Allah (ﷺ) stood near him and lice were falling from his head. Thereupon he (the Holy Prophet) said: Do these vermins trouble you? I said: Yes. Thereupon he said: Then shave your head; and it was in connection with me that this verse was revealed: Whoever among you is sick or has an ailment of the head, he (may effect) a compensation by fasting or alms or a sacrifice . He (the Holy Prophet, therefore) said to me: Observe fast for three days or give a quantity of alms enough to feed six needy persons or offer sacrifice (of an animal) that is available.",
                "hadithUrdu": "اللہ کے رسول اللہ صلی اللہ علیہ وسلم ان کے اوپر ( کی طرف ) کھڑے ہو ئے اور ان کےسر سے جو ئیں گر رہی تھیں آپ نے فر ما یا \" کیا تمھا ری جو ئیں تمھیں اذیت دیتی ہیں ؟ میں نے کہا جی ہاں ، آپ نے فر ما یا : \" تو اپنا سر منڈوا لو ۔ ( کعب رضی اللہ تعالیٰ عنہ نے ) کہا : تو میرے بارے میں یہ آیت نازل ہو ئی پھر اگر کو ئی شخص بیما رہو یا اس کے سر میں تکلیف ہو ( اور وہ سر منڈوا لے ) تو فدیے میں رو زے رکھے یا صدقہ دے یا قر بانی کرے ۔ اس پر رسول اللہ صلی اللہ علیہ وسلم نے مجھے فر ما یا : \" تین دن کے روزے رکھویا ( کسی بھی جنس کا ) ایک فرق ( تین صاع ) چھ مسکینوں میں صدقہ کر و یا قر بانی میسر ہو کرو ۔",
                "urduNarrator": "ہم سے ابن نمیر نے بیان کیا، کہا ہم سے میرے والد نے بیان کیا، انہوں نے کہاسیف ( بن سلیمان ) نے کہا : میں نے مجا ہد سے سنا وہ کہہ رہے تھے کہ مجھے عبد الرحمٰن بن ابی لیلیٰ نے حدیث سنا ئی کہا مجھے کعب بن عجرہ رضی اللہ تعالیٰ عنہ نے حدیث بیان کی کہ",
                "hadithArabic": "وحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا سَيْفٌ، قَالَ: سَمِعْتُ مُجَاهِدًا، يَقُولُ: حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي لَيْلَى، حَدَّثَنِي كَعْبُ بْنُ عُجْرَةَ رَضِيَ اللهُ عَنْهُ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَقَفَ عَلَيْهِ وَرَأْسُهُ يَتَهَافَتُ قَمْلًا، فَقَالَ: «أَيُؤْذِيكَ هَوَامُّكَ؟» قُلْتُ: نَعَمْ، قَالَ: «فَاحْلِقْ رَأْسَكَ» قَالَ: فَفِيَّ نَزَلَتْ هَذِهِ الْآيَةُ: {فَمَنْ كَانَ مِنْكُمْ مَرِيضًا أَوْ بِهِ أَذًى مِنْ رَأْسِهِ فَفِدْيَةٌ مِنْ صِيَامٍ أَوْ صَدَقَةٍ أَوْ نُسُكٍ} [البقرة: 196] فَقَالَ لِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «صُمْ ثَلَاثَةَ أَيَّامٍ، أَوْ تَصَدَّقْ بِفَرَقٍ بَيْنَ سِتَّةِ مَسَاكِينَ، أَوْ انْسُكْ مَا تَيَسَّرَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10445,
                "hadithNumber": "2881",
                "englishNarrator": "Ka`b bin 'Ujra (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) happened to pass by him at Hudaibiya before entering Mecca in a state of Ihram and he (Ka'b) was kindling fire under the cooking pot and vermin were creeping on his (Ka`b's) face. Thereupon (the Holy Prophet) said: Do these vermin trouble you? He (Ka'b) said: Yes. The Messenger of Allah (way peace be upon him) said: Shave your head and give some quantity of food enough to feed six needy persons (faraq is equal to three sa's), or observe fast for three days or offer sacrifice of a sacrificial animal. Ibn Najih (one of the narrators) said: Or sacrifice a goat.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم مکہ میں دا خل ہو نے سے پہلے جب حدیبیہ میں تھے ان کے پاس سے گزرے جبکہ وہ کعب رضی اللہ تعالیٰ عنہ ) احرا م کی حالت میں تھے اور ایک ہنڈیا کے نیچے آگ جلا نے میں لگے ہو ئے تھے جو ئیں ان کے چہرے پر گر رہی تھیں آپ نے فر ما یا : \" کیا تمھا ری سر کی جوئیں تمھیں اذیت دے رہی ہیں؟ انھوں نے عرض کی جی ہاں ، آپ نے فر ما یا : \" تو اپنا سر منڈوالو اور ایک فرق کھا نا چھ مسکینوں کو کھلا دو ۔ ۔ ۔ ایک فرق تین صاع کا ہو تا ہے ۔ ۔ ۔ یا تین دن کے روزے رکھو یا قربانی کے ایک جا نور کی قر با نی کر دو ۔ ۔",
                "urduNarrator": "ہم سے محمد بن ابی عمر نے بیان کیا، کہا ہم سے سفیان نے بیان کیا, ابن ابی نجیح ایوب حمید اور عبد الکریم نے مجا ہد سے انھوں نے ابن ابی لیلیٰ سے انھوں نے کعب بن عجرہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ أَبِي نَجِيحٍ، وَأَيُّوبَ، وَحُمَيْدٍ، وَعَبْدِ الْكَرِيمِ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ أَبِي لَيْلَى، عَنْ كَعْبِ بْنِ عُجْرَةَ رَضِيَ اللهُ عَنْهُ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِهِ وَهُوَ بِالْحُدَيْبِيَةِ، قَبْلَ أَنْ يَدْخُلَ مَكَّةَ، وَهُوَ مُحْرِمٌ، وَهُوَ يُوقِدُ تَحْتَ قِدْرٍ، وَالْقَمْلُ يَتَهَافَتُ عَلَى وَجْهِهِ، فَقَالَ: «أَيُؤْذِيكَ هَوَامُّكَ هَذِهِ؟» قَالَ: نَعَمْ، قَالَ: «فَاحْلِقْ رَأْسَكَ، وَأَطْعِمْ فَرَقًا بَيْنَ سِتَّةِ مَسَاكِينَ، - وَالْفَرَقُ ثَلَاثَةُ آصُعٍ -، أَوْ صُمْ ثَلَاثَةَ أَيَّامٍ، أَوْ انْسُكْ نَسِيكَةً» قَالَ ابْنُ أَبِي نَجِيحٍ: «أَوِ اذْبَحْ شَاةً».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10446,
                "hadithNumber": "2882",
                "englishNarrator": "Ka'b bin Ujra (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) happened to pass by him during the period of Hudaibiya. Thereupon he (the Holy Prophet) said to him (Ka'b bin Ujra): Do these vermins trouble your head? He said: Yes. Thereupon he (the Holy Prophet) said: Shave your head. Then sacrifice a goat or observe fasts for three days or give three sits of dates to feed six needy persons.",
                "hadithUrdu": "اللہ کے رسول اللہ صلی اللہ علیہ وسلم حدیبیہ کے دنو میں ان کے پاس گزرے اور ان سے پو چھا تمھا رے سر کی جوؤں نے تمھیں اذیت دی ہے ؟انھوں نے کہا : جی ہاں تو نبی صلی اللہ علیہ وسلم نے ان سے فر ما یا : \" سر منڈوادو ۔ پھر ایک بکری بطور قر بانی ذبح کرو یا تین دن کے روزے رکھو یا کھجوروں کے تین صاع چھ مسکینوں کو کھلا دو ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا ہم سے خالد بن عبداللہ نے بیان کیا، ان سے خالد کی سند سے, ابو قلا بہ نے عبد الرحمٰن بن ابی لیلیٰ سے انھوں نے کعب بن عجرہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللهِ، عَنْ خَالِدٍ، عَنْ أَبِي قِلَابَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ كَعْبِ بْنِ عُجْرَةَ رَضِيَ اللهُ عَنْهُ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِهِ زَمَنَ الْحُدَيْبِيَةِ، فَقَالَ لَهُ: «آذَاكَ هَوَامُّ رَأْسِكَ؟» قَالَ: نَعَمْ، فَقَالَ لَهُ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «احْلِقْ رَأْسَكَ، ثُمَّ اذْبَحْ شَاةً نُسُكًا، أَوْ صُمْ ثَلَاثَةَ أَيَّامٍ، أَوْ أَطْعِمْ ثَلَاثَةَ آصُعٍ مِنْ تَمْرٍ، عَلَى سِتَّةِ مَسَاكِينَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10447,
                "hadithNumber": "2883",
                "englishNarrator": "Abdullah bin Ma'qil said:",
                "hadithEnglish": "I sat with Ka'b (رضی اللہ تعالیٰ عنہ) and he was in the mosque. I asked him about this verse: Compensation in (the form of) fasting, or Sadaqa or sacrifice. Ka'b (رضی اللہ تعالیٰ عنہ) said: It was revealed In my case. There was some trouble in my head. I was taken to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and lice were creeping upon my face. Thereupon he said: I did not think that your trouble had become so unbearable as I see. Would you be able to afford (the sacrificing) of a goat? I (Ka'b رضی اللہ تعالیٰ عنہ ) said: Then this verse was revealed: Compensation (in the form of) fasting or alms or a sacrifice. He (the Holy Prophet) said: (It Implies) fasting for three days, or feeding six needy perscins, half sa' of food for every needy person. This verse was revealed particularly for me and (now) Its application is general for all of you.",
                "hadithUrdu": "میں کعب ( بن عجرہ ) رضی اللہ تعالیٰ عنہ کے پاس جا بیٹھا وہ اس وقت ( کو فہ کی ایک ) مسجد میں تشریف فر ما تھے میں نے ان سے اس آیت کے متعلق سوال کیا : فَفِدْيَةٌ مِّن صِيَامٍ أَوْ صَدَقَةٍ أَوْ نُسُكٍ ۚ \" تو روزوں یا صدقہ یا قر بانی سے فدیہ دے ۔ حضرت کعب رضی اللہ تعالیٰ عنہ نے جواب دیا کہ یہ آیت میرے بارے میں نازل ہو ئی تھی ۔ میرے سر میں تکلیف تھی مجھے اس حال میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں لے جا یا گیا کہ جو ئیں میرے چہرے پر پڑرہی تھیں تو آپ نے فر ما یا : \" میرا خیال نہیں تھا کہ تمھا ری تکلیف اس حد تک پہنچ گئی ہے جیسے میں دیکھ رہا ہوں ۔ کیا تمھارے پاس کو ئی بکری ہے ؟میں نے عرض کی نہیں اس پر یہ آیت نازل ہو ئی ۔ فَفِدْيَةٌ مِّن صِيَامٍ أَوْ صَدَقَةٍ أَوْ نُسُكٍ ۚ \" ( نبی صلی اللہ علیہ وسلم نے ) فر ما یا : \" ( تمھا رے ذمے ) تین دنوں کے روزے ہیں یا چھ مسکینوں کا کھا نا ہر مسکین کے لیے آدھا صاع کھا نا ۔ ( پھر کعب رضی اللہ تعالیٰ عنہ نے ) کہا : یہ آیت خصوصی طور پر میرے لیے اتری اور عمومی طور پر یہ تمھا رے لیے بھی ہے ۔",
                "urduNarrator": "ہم سے محمد بن المثنی اور ابن بشار نے بیان کیا، انہوں نے کہا: ہم سے محمد بن جعفر نے بیان کیا, شعبہ نے عبد الرحمٰن بن اصبہانی سے حدیث بیان کی انھوں نے عبد اللہ بن معقل سے انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَ ابْنُ الْمُثَنَّى: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَصْبَهَانِيِّ، عَنْ عَبْدِ اللهِ بْنِ مَعْقِلٍ، قَالَ: قَعَدْتُ إِلَى كَعْبٍ رَضِيَ اللهُ عَنْهُ وَهُوَ فِي الْمَسْجِدِ، فَسَأَلْتُهُ عَنْ هَذِهِ الْآيَةِ: {فَفِدْيَةٌ مِنْ صِيَامٍ أَوْ صَدَقَةٍ أَوْ نُسُكٍ} [البقرة: 196]؟ فَقَالَ كَعْبٌ رَضِيَ اللهُ عَنْهُ: نَزَلَتْ فِيَّ، كَانَ بِي أَذًى مِنْ رَأْسِي، فَحُمِلْتُ إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَالْقَمْلُ يَتَنَاثَرُ عَلَى وَجْهِي، فَقَالَ: «مَا كُنْتُ أُرَى أَنَّ الْجَهْدَ بَلَغَ مِنْكَ مَا أَرَى أَتَجِدُ شَاةً؟» فَقُلْتُ: لَا، فَنَزَلَتْ هَذِهِ الْآيَةُ: فَفِدْيَةٌ مِنْ صِيَامٍ أَوْ صَدَقَةٍ أَوْ نُسُكٍ، قَالَ: «صَوْمُ ثَلَاثَةِ أَيَّامٍ، أَوْ إِطْعَامُ سِتَّةِ مَسَاكِينَ نِصْفَ صَاعٍ، طَعَامًا لِكُلِّ مِسْكِينٍ»، قَالَ: فَنَزَلَتْ فِيَّ خَاصَّةً، وَهِيَ لَكُمْ عَامَّةً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10448,
                "hadithNumber": "2884",
                "englishNarrator": "Ka'b bin Ujra (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "He went out with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) in the state of Ihram, and his (Ka'b's) head and beard were infested with lice. This was conveyed to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). He sent for him (Ka'b) and called a barber (who) shaved his head. He (the Holy Prophet) said. Is there any sacrificial animal with you? He (Kalb) said: I cannot afford it. He then commanded him to observe fasts for three days or feed six needy persons, one sa' for every two needy persons. And Allah the Exalted and Majestic revealed this (verse) particular with regard to him: So whosoever among you is sick and has an ailment of the head.. ; then (its application) became general for the Muslims.",
                "hadithUrdu": "وہ احرا م باندھ کر نبی صلی اللہ علیہ وسلم کے ساتھ نکلے ان کے سر اور داڑھی میں ( کثرت سے ) جو ئیں پڑ گئیں ۔ اس ( بات ) کی خبر نبی صلی اللہ علیہ وسلم کو پہنچی تو آپ نے انھیں بلا بھیجا اور ھجا م کو بلا کر ان کا سر مونڈ دیا پھر ان سے پو چھا : \" کیا تمھا رے پاس کو ئی قربانی ہے ؟ انھوں نے جواب دیا : ( اے اللہ کے رسول ) میں اس کی استطاعت نہیں رکھتا آپ نے انھیں حکم دیا : تین دن کے روزے عکھ لو یا چھ مسکینوں کو کھا نا مہیا کر دو مسکینو ں کے لیے ایک صاعہو اللہ عزوجل نے خاص ان کے بارے میں یہ آیت نازل فر ما ئی : \" جو شخص تم میں سے مریض ہو یا اس کے سر میں تکلیف ہو ، اس کے بعد یہ ( اجازت ) عمومی طور پر تمام مسلمانوں کے لیے ہے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے عبداللہ بن نمیر نے بیان کیا، زکریا بن ابی زائد ہ سے روایت ہے کہا : ہمیں عبدالرحٰمن بن اصبہانی نے حدیث بیان کی انھوں نے کہا مجھے عبد اللہ بن معقل نے انھوں نے کہا : مجھے کعب بن عجرہ رضی اللہ تعالیٰ عنہ نے حدیث سنا ئی کہ",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللهِ بْنُ نُمَيْرٍ، عَنْ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْأَصْبَهَانِيِّ، حَدَّثَنِي عَبْدُ اللهِ بْنُ مَعْقِلٍ، حَدَّثَنِي كَعْبُ بْنُ عُجْرَةَ رَضِيَ اللهُ عَنْهُ، أَنَّهُ خَرَجَ مَعَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مُحْرِمًا، فَقَمِلَ رَأْسُهُ وَلِحْيَتُهُ، فَبَلَغَ ذَلِكَ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَأَرْسَلَ إِلَيْهِ فَدَعَا الْحَلَّاقَ، فَحَلَقَ رَأْسَهُ، ثُمَّ قَالَ لَهُ: «هَلْ عِنْدَكَ نُسُكٌ؟» قَالَ: مَا أَقْدِرُ عَلَيْهِ، «فَأَمَرَهُ أَنْ يَصُومَ ثَلَاثَةَ أَيَّامٍ، أَوْ يُطْعِمَ سِتَّةَ مَسَاكِينَ، لِكُلِّ مِسْكِينَيْنِ صَاعٌ»، فَأَنْزَلَ اللهُ عَزَّ وَجَلَّ فِيهِ خَاصَّةً: {فَمَنْ كَانَ مِنْكُمْ مَرِيضًا أَوْ بِهِ أَذًى مِنْ رَأْسِهِ} [البقرة: 196] ثُمَّ كَانَتْ لِلْمُسْلِمِينَ عَامَّةً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10449,
                "hadithNumber": "2885",
                "englishNarrator": "Ibn 'Abbas (رضی اللہ تعالیٰ عنہما) reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) got himself cupped in the state of lhrim.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے احرام کی حا لت میں سینگی لگوائی ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، زہیر بن حرب اور اسحاق بن ابراہیم نے بیان کیا، کہا: ہم سے اسحاق نے بیان کیا، اور باقی دو نے کہا: ہم سے اس نے بیان کیا۔ سفیان بن عیینہ، عمرو کی سند سے، طاؤس کی سند سے، اور عطاء کی سند سے, حضرت ابن عباس رضی اللہ تعالیٰ عنہما سے روا یت ہے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، - قَالَ إِسْحَاقُ: أَخْبَرَنَا، وقَالَ الْآخَرَانِ: - حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، عَنْ طَاوُسٍ، وَعَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا: «أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ احْتَجَمَ وَهُوَ مُحْرِمٌ».",
                "headingArabic": "جَوَازِ الْحِجَامَةِ لِلْمُحْرِمِ ‏",
                "headingUrdu": "محرم کے لیے سنگی لگانا جائز ہے",
                "headingEnglish": "Cupping is permissible for the Muhrim (pilgrim in Ihram)",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10450,
                "hadithNumber": "2886",
                "englishNarrator": "Ibn Buhaina رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) got himself cupped in the middle of his head on his way to Mecca.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے مکہ کے را ستے ہیں احرا م کی حالت میں اپنے سر کے در میان کے حصے پر سینگی لگوائی ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے معلی بن منصور نے بیان کیا، ہم سے سلیمان بن بلال نے بیان کیا، وہ علقمہ بن ابی علقمہ کی سند سے۔ عبدالرحمن العرج، حضرت ابن بحسینہ رضی اللہ تعالیٰ عنہ سے روایت ہے کہ",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا الْمُعَلَّى بْنُ مَنْصُورٍ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ، عَنْ عَلْقَمَةَ بْنِ أَبِي عَلْقَمَةَ، عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ، عَنِ ابْنِ بُحَيْنَةَ: «أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ احْتَجَمَ بِطَرِيقِ مَكَّةَ، وَهُوَ مُحْرِمٌ، وَسَطَ رَأْسِهِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10451,
                "hadithNumber": "2887",
                "englishNarrator": "Nubaih bin Wabb reported:",
                "hadithEnglish": "We went with Aban bin Uthman (in a state of lhram). When we were at Malal the eyes of Umar bin Ubaidullah became sore and, when we reached Rauba' the pain grew intense. He (Nubaib bin Wahb) sent (one) to Aban bin Uthman to ask him (what to do). He sent him (the message) to apply aloes to them, for 'Uthman (رضی اللہ تعالیٰ عنہ) reported that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) applied aloes to the person whose eyes were sore and he was in the state of Ihram.",
                "hadithUrdu": "ہم ابان بن عثمان کے ساتھ ( حج کے لیے ) نکلے جب ہم ملل کے مقام پر پہنچے تو عمر بن عبید اللہ کی انکھوں میں تکلیف شروع ہو گئی ، جب ہم رَرحا ء میں تھے تو ان کی تکلیف شدت اختیار کر گئی انھوں نے مسئلہ پو چھنے کے لیے ابان بن عثمان کی طرف قاصد بھیجا ، انھوں نے ان کی طرف جواب بھیجا کہ دو نوں ( آنکھوں ) پر ایلوے کا لیپ کرو ۔ حضرت عثمان رضی اللہ تعالیٰ عنہ نے رسول اللہ صلی اللہ علیہ وسلم کے واسطے سے اس شخص کے متعلق حدیث بیان کی تھی جو احرا م کی حا لت میں تھا جب اس کی آنکھوں میں تکلیف شروع ہو گئی تو آپ نے ( اس کی آنکھوں پر ) ایلوے کا لیپ کرا یا تھا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، عمرو ناقد اور زہیر بن حرب نے ابن عیینہ کی سند سے بیان کیا، ابوبکر نے کہا: ہم سے بیان کیا سفیان بن عیینہ نے حدیث بیان کی ( کہا ) ہمیں ایوب بن مو سیٰ نے نبیہ بن وہب سے حدیث بیان کی انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ - قَالَ أَبُو بَكْرٍ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ - حَدَّثَنَا أَيُّوبُ بْنُ مُوسَى، عَنْ نُبَيْهِ بْنِ وَهْبٍ، قَالَ: خَرَجْنَا مَعَ أَبَانَ بْنِ عُثْمَانَ حَتَّى إِذَا كُنَّا بِمَلَلٍ، اشْتَكَى عُمَرُ بْنُ عُبَيْدِ اللهِ عَيْنَيْهِ، فَلَمَّا كُنَّا بِالرَّوْحَاءِ اشْتَدَّ وَجَعُهُ فَأَرْسَلَ إِلَى أَبَانَ بْنِ عُثْمَانَ يَسْأَلُهُ، فَأَرْسَلَ إِلَيْهِ أَنِ اضْمِدْهُمَا بِالصَّبِرِ، فَإِنَّ عُثْمَانَ رَضِيَ اللهُ عَنْهُ، حَدَّثَ عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي الرَّجُلِ «إِذَا اشْتَكَى عَيْنَيْهِ، وَهُوَ مُحْرِمٌ ضَمَّدَهُمَا بِالصَّبِرِ».",
                "headingArabic": "جَوَازِ مُدَاوَاةِ الْمُحْرِمِ عَيْنَيْهِ ‏",
                "headingUrdu": "محرم کے لیے اپنی آنکھوں کا علاج جائز ہے۔",
                "headingEnglish": "It is permissible for a Muhrim to treat his eyes",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10452,
                "hadithNumber": "2888",
                "englishNarrator": "Nubaih bin Wahb reported:",
                "hadithEnglish": "The eyes of Umar bin Ubaidullah bin Ma'mar were swollen, and he decided to use antimony. Aban bin 'Uthman forbade him to do so and commanded him to apply aloes on them, and reported on the authority of 'Uthman bin Affan رضی اللہ تعالیٰ عنہ that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had done that.",
                "hadithUrdu": "( ایک بار احرا م کی حالت میں ) عمر بن عبید اللہ بن معمر کی آنکھیں دکھنے لگیں انھوں نے ان میں سر مہ لگا نے کا ارادہ فر ما یا تو ابان بن عثمان نے انھیں روکا اور کہا کہ اس پر ایلوے کا پیپ کر لیں ۔ اور عثمان بن عفان رضی اللہ تعالیٰ عنہ کے واسطے سے نبی صلی اللہ علیہ وسلم سے حدیث بیان کی کہ آپ نے ایسا ہی کیا تھا ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم الحنظَلی نے بیان کیا، انہوں نے کہا ہمیں عبد الصمد بن عبد الوارث نے خبر دی کہا : مجھ سے میرے والد نے حدیث بیان کی کہا : ہم سے ایوب بن موسیٰ نے حدیث بیان کی کہا : مجھ سے نبیہ بن وہب نے حدیث بیان کی کہ ہمیں عبد الصمد بن عبد الوارث نے خبر دی کہا : مجھ سے میرے والد نے حدیث بیان کی کہا : ہم سے ایوب بن موسیٰ نے حدیث بیان کی کہا : مجھ سے نبیہ بن وہب نے حدیث بیان کی کہ",
                "hadithArabic": "وحَدَّثَنَاه إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ، حَدَّثَنِي أَبِي، حَدَّثَنَا أَيُّوبُ بْنُ مُوسَى، حَدَّثَنِي نُبَيْهُ بْنُ وَهْبٍ، أَنَّ عُمَرَ بْنَ عُبَيْدِ اللهِ بْنِ مَعْمَرٍ، رَمِدَتْ عَيْنُهُ، فَأَرَادَ أَنْ يَكْحُلَهَا، فَنَهَاهُ أَبَانُ بْنُ عُثْمَانَ «وَأَمَرَهُ أَنْ يُضَمِّدَهَا بِالصَّبِرِ» وَحَدَّثَ عَنْ عُثْمَانَ بْنِ عَفَّانَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ فَعَلَ ذَلِكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10453,
                "hadithNumber": "2889",
                "englishNarrator": "Ibrahim bin 'Abdullah narrated on the authority of his father:",
                "hadithEnglish": "There cropped up a difference of opinion between Abdullah bin 'Abbas رضی اللہ تعالیٰ عنہ and al-Miswar bin Makhrama رضی اللہ تعالیٰ عنہ at a place (called) Abwa'. Abdullah bin 'Abbas رضی اللہ تعالیٰ عنہ contended that a Muhrim (is permitted) to wash his head, whereas Miswar contended that a Muhrim is not (permit- fed) to wash his head. So Ibn Abbas رضی اللہ تعالیٰ عنہ sent me (the father of Ibrabim) to Abu Ayyub al-Ansirl to ask him about it. (So I went to him) and found him taking bath behind two poles covered by a cloth. I gave him salutation, whereupon be asked: Who is this? I said: I am 'Abdullah bin Hunain. 'Abdullah bin 'Abbas رضی اللہ تعالیٰ عنہ has sent me to you to find out how the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) washed his head in the state of Ihram. Abu Ayyub (رضی اللہ تعالیٰ عنہ) placed his hand on the cloth and lowered it (a little) till his head became visible to me; and he said to the man who was pouring water upon him to pour water. He poured water on his head. He then moved his head with the help of his hands and moved them (the hands) forward and backward and then said: This is how I saw him (the Messenger of Allah) doing.",
                "hadithUrdu": "انھوں نے عبد اللہ بن عباس اور مسور بن مخرمہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ ابو اء کے مقام پر ان دونوں کے در میان اختلا ف ہوا ۔ عبد اللہ بن عباس رضی اللہ تعالیٰ عنہ نے کہا : محرم شخص اپنا سر دھو سکتا ہے اور مسور رضی اللہ تعالیٰ عنہ نے کہا : محرم اپنا سر نہیں دھو سکتا ۔ ابن عباس رضی اللہ تعالیٰ عنہ نے مجھے ( عبد اللہ بن حنین کو ) ابو ایوب انصاری رضی اللہ تعالیٰ عنہ کی طرف بھیجا کہ میں ان سے ( اس کے بارے میں ) مسئلہ پوچھوں ( جب میں ان کے پاس پہنچا تو ) انھیں ایک کپڑے سے پردہ کر کے کنویں کی دو لکڑیوں کے در میان ( جو کنویں سے فاصلے پر لگا ئی جا تی تھیں اور ان پر لگی ہو ئی چرخی پر سے اونٹ وغیرہ کے ذریعے ڈول کا رسہ کھینچا جا تا تھا ) غسل کرتے ہو ئے پایا ۔ ( عبد اللہ بن حنین نے ) کہا : میں نے انھیں سلام کہا : وہ بو لے : یہ کون ( آیا ) ہے؟میں نے عرض کی : میں عبد اللہ بن حنین ہوں مجھے حضرت عبد اللہ بن عباس رضی اللہ تعالیٰ عنہ نے آپ کی طرف بھیجا ہے کہ میں اپ سے پو چھوں : اللہ کے رسول اللہ صلی اللہ علیہ وسلم احرا م کی حا لت میں اپنا سر کیسے دھو یا کرتے تھے ؟ ( میری بات سن کر ) حضرت ابو اءایوب رضی اللہ تعالیٰ عنہ نے اپنا ہاتھ کپڑے پر رکھ کر اسے نیچے کیا حتی کہ مجھے ان کا سر نظر آنے لگا پھر اس شخص سے جو آپ پر پانی انڈیل رہا تھا کہا : پانی ڈا لو ۔ اس نے آپ کے سر پر پا نی انڈیلا پھر آپ نے اپنے دونوں ہاتھوں سے اپنے سر کو خوب حرکت دی اپنے دونوں ہاتھوں کو آگے لے آئے اور پیچھے لے گئے ۔ پھر کہا : میں نے آپ صلی اللہ علیہ وسلم کو اس طرح کرتے ہو ئے دیکھا تھا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، عمرو ناقد، زہیر بن حرب اور قتیبہ بن سعید نے بیان کیا، کہا: ہم سے انہوں نے بیان کیا سفیان بن عیینہ اور مالک بن انس نے زید بن اسلم سے انھوں نے ابرا ہیم بن عبد اللہ بن حنین سے انھوں نے اپنے والد ( عبد اللہ بن حنین ) سے",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، قَالُوا: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ زَيْدِ بْنِ أَسْلَمَ، ح وحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَهَذَا حَدِيثُهُ عَنْ مَالِكِ بْنِ أَنَسٍ، فِيمَا قُرِئَ عَلَيْهِ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللهِ بْنِ حُنَيْنٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللهِ بْنِ عَبَّاسٍ، وَالْمِسْوَرِ بْنِ مَخْرَمَةَ، أَنَّهُمَا اخْتَلَفَا بِالْأَبْوَاءِ، فَقَالَ عَبْدُ اللهِ بْنُ عَبَّاسٍ: يَغْسِلُ الْمُحْرِمُ رَأْسَهُ، وَقَالَ الْمِسْوَرُ: لَا يَغْسِلُ الْمُحْرِمُ رَأْسَهُ، فَأَرْسَلَنِي ابْنُ عَبَّاسٍ إِلَى أَبِي أَيُّوبَ الْأَنْصَارِيِّ أَسْأَلُهُ عَنْ ذَلِكَ، فَوَجَدْتُهُ يَغْتَسِلُ بَيْنَ الْقَرْنَيْنِ وَهُوَ يَسْتَتِرُ بِثَوْبٍ، قَالَ: فَسَلَّمْتُ عَلَيْهِ، فَقَالَ: مَنْ هَذَا؟ فَقُلْتُ: أَنَا عَبْدُ اللهِ بْنُ حُنَيْنٍ، أَرْسَلَنِي إِلَيْكَ عَبْدُ اللهِ بْنُ عَبَّاسٍ، أَسْأَلُكَ كَيْفَ كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «يَغْسِلُ رَأْسَهُ وَهُوَ مُحْرِمٌ؟» فَوَضَعَ أَبُو أَيُّوبَ رَضِيَ اللهُ عَنْهُ يَدَهُ عَلَى الثَّوْبِ فَطَأْطَأَهُ، حَتَّى بَدَا لِي رَأْسُهُ، ثُمَّ قَالَ: لِإِنْسَانٍ يَصُبُّ: «اصْبُبْ فَصَبَّ عَلَى رَأْسِهِ، ثُمَّ حَرَّكَ رَأْسَهُ بِيَدَيْهِ، فَأَقْبَلَ بِهِمَا وَأَدْبَرَ» ثُمَّ قَالَ: «هَكَذَا رَأَيْتُهُ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَفْعَلُ».",
                "headingArabic": "جَوَازِ غَسْلِ الْمُحْرِمِ بَدَنَهُ وَرَأْسَهُ ‏",
                "headingUrdu": "محرم کے لیے بدن اور سر کو دھونا جائز ہے۔",
                "headingEnglish": "It is permissible for the Muhrim to wash his body and head",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10454,
                "hadithNumber": "2890",
                "englishNarrator": "Zaid bin Aslam narrated it with this chain (a Hadith similar to no. 2889) and said:",
                "hadithEnglish": "Abu Ayyub rubbed his whole head with his hands and then moved them forward and backward. Miswar رضی اللہ تعالیٰ عنہ said to Ibn 'Abbas رضی اللہ تعالیٰ عنہ : I would never dispute with you (in future).",
                "hadithUrdu": "ابواء ایوب نے اپنے دو نوں ہاتھوں کو اپنے پورے سر پر پھیر اانھیں آگے اور پیچھے لے گئے اس کے بعد حضرت مسور رضی اللہ تعالیٰ عنہ نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے کہا : میں آپ سے کبھی بحث نہیں کیا کروں گا ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم اور علی بن خشرم نے بیان کیا، انہوں نے کہا: ہم سے عیسیٰ بن یونس نے بیان کیا، انہوں نے کہا ہم سے ابن جریج نے حدیث بیان کی کہا مجھے زید بن اسلم نے اسی سند کے ساتھ خبر دی اور کہا کہ",
                "hadithArabic": "وحَدَّثَنَاه إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَلِيُّ بْنُ خَشْرَمٍ، قَالَا: أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي زَيْدُ بْنُ أَسْلَمَ، بِهَذَا الْإِسْنَادِ، وَقَالَ: فَأَمَرَّ أَبُو أَيُّوبَ بِيَدَيْهِ عَلَى رَأْسِهِ جَمِيعًا عَلَى جَمِيعِ رَأْسِهِ، فَأَقْبَلَ بِهِمَا وَأَدْبَرَ، فَقَالَ الْمِسْوَرُ لِابْنِ عَبَّاسٍ: لَا أُمَارِيكَ أَبَدًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10455,
                "hadithNumber": "2891",
                "englishNarrator": "Ibn Abbas ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "A person fell down from his camel (in a state of Ihram) and his neck was broken and he died. Thereupon Allah's Apostle. ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Bathe him with water mixed with the leaves of the lote tree and shroud him in his two (pieces of) cloth (Ihbram), and do not cover his head for Allah will raise him on the Day of Resurrection Pronouncing Talbiya.",
                "hadithUrdu": "ایک شخص اپنے اونٹ سے گر گیا ۔ اس کی گردن ٹوٹ گئی اور وہ فو ت ہو گیا ۔ آپ صلی اللہ علیہ وسلم نے فر ما یا : \" اسے پانی اور بیری کے پتوں سے غسل دو اسی کے دونوں کپڑوں ( احرا م کی دو نوں چادروں ) میں اسے کفن دو اس کا سر نہ ڈھانپو ۔ بلا شبہ اللہ تعا لیٰ اسے قیامت کے دن اس حال میں اٹھا ئے گا کہ وہ تلبیہ پکار رہا ہو گا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، انہوں نے کہا سفیان بن عیینہ نے عمرو ( بن دینا ر ) سے ( انھوں نے ) سعید بن جبیر سے انھوں نے ابن عباس رضی اللہ تعالیٰ عنہ سے انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، خَرَّ رَجُلٌ مِنْ بَعِيرِهِ، فَوُقِصَ فَمَاتَ، فَقَالَ: «اغْسِلُوهُ بِمَاءٍ وَسِدْرٍ، وَكَفِّنُوهُ فِي ثَوْبَيْهِ، وَلَا تُخَمِّرُوا رَأْسَهُ، فَإِنَّ اللهَ يَبْعَثُهُ يَوْمَ الْقِيَامَةِ مُلَبِّيًا».",
                "headingArabic": "مَا يُفْعَلُ بِالْمُحْرِمِ إِذَا مَاتَ ‏",
                "headingUrdu": "اگر محرم مر جائے تو اس کے ساتھ کیا کیا جائے؟",
                "headingEnglish": "What should be done with a Muhrim if he dies?",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10456,
                "hadithNumber": "2892",
                "englishNarrator": "Ibn Abbas (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "While a person was standing in 'Arafat with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) he fell down from his camel and broke his neck. This was mentioned to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), whereupon he said: Bathe him with water mixed with the leaves of the lote tree and shroud him in two (pieces of) cloth and neither perfume him nor cover his head; (Ayyub said) for Allah would raise him on the Day of Resurrection in the state of pronouncing Talbiya. ('Amr. however, said): Verily Allah would raise him on the Day of Resurrection pronouncing Talbiya. Sa'id bin Jubair narrated this hadith on the authority of Ibn 'Abbas (Allah be pleased with them) that a person was standing with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as he was in the state of Ihram. The rest of the hadith is the same.",
                "hadithUrdu": "ایک شخص عرفات میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ وقف میں تھا کہ اپنی سواری سے گرگیا ایوب نے کہا اس کی سوری نے اس کی گردن تو ڈالی ۔ ۔ ۔ یا کہا : اسے اسی وقت مار ڈالا ۔ ۔ ۔ اور عمرو نے فوقصته کہا ( اس کی گردن کا منکا توڑ دیا ۔ ) رسول اللہ صلی اللہ علیہ وسلم کو یہ بات بتا ئی گئی تو فر مایا : \" اسے پانی اور بیری کے پتوں سے غسل دو اسے کپڑوں میں کفن دو اسے خوشبو لگا ؤ نہ اس کا سر ڈھا نپو ۔ ایوب نے کہا : \" بلا شبہ اللہ تعا لیٰ قیامت کے دن اسے اسی حالت میں تلبیہ کہتا ہوا اٹھا ئے گا ۔ اور عمرو نے کہا : \" بلا شبہ اللہ تعا لیٰ اسے قیامت کے دن اٹھا ئے گا ۔ وہ تلبیہ پکار رہا ہو گا ۔",
                "urduNarrator": "ہم سے ابو الربیع الزہرانی نے بیان کیا، انہوں نے کہا حماد نے عمرو بن دینا ر اور ایوب سے انھوں نے سعید بن جبیر سے انھوں نے ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی ( ابن عباس رضی اللہ تعالیٰ عنہ نے ) کہا",
                "hadithArabic": "وحَدَّثَنَا أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، حَدَّثَنَا حَمَّادٌ، عَنْ عَمْرِو بْنِ دِينَارٍ، وَأَيُّوبَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا، قَالَ: بَيْنَمَا رَجُلٌ وَاقِفٌ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِعَرَفَةَ، إِذْ وَقَعَ مِنْ رَاحِلَتِهِ، قَالَ أَيُّوبُ: فَأَوْقَصَتْهُ - أَوْ قَالَ فَأَقْعَصَتْهُ - وقَالَ عَمْرٌو: فَوَقَصَتْهُ، فَذُكِرَ ذَلِكَ لِلنَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «اغْسِلُوهُ بِمَاءٍ وَسِدْرٍ، وَكَفِّنُوهُ فِي ثَوْبَيْنِ، وَلَا تُحَنِّطُوهُ، وَلَا تُخَمِّرُوا رَأْسَهُ، - قَالَ أَيُّوبُ - فَإِنَّ اللهَ يَبْعَثُهُ يَوْمَ الْقِيَامَةِ مُلَبِّيًا - وَقَالَ عَمْرٌو - فَإِنَّ اللهَ يَبْعَثُهُ يَوْمَ الْقِيَامَةِ يُلَبِّي».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10457,
                "hadithNumber": "2893",
                "englishNarrator": "It was narrated that Ibn Abbas رضی اللہ تعالیٰ عنہ said:",
                "hadithEnglish": "While a man was standing with the prophet ﷺ while he was Ihram... and he mentioned a report similar to that of Hammad from Ayyub (no. 2892).",
                "hadithUrdu": "ایک شخص نبی صلی اللہ علیہ وسلم کے ساتھ وقوف کر رہا تھا اور احرا م کی حا لت میں تھا ( آگے ) ایو ب سے حماد کی روایت کی مانند حدیث ذکر کی ۔",
                "urduNarrator": "یہ مجھ سے عمرو ناقد نے بیان کیا اس نے ہم سے بیان کیا, اسماعیل بن ابرا ہیم نے ایوب سے حدیث بیان کی ۔ کہا مجھے سعید بن جبیر سے خبر دی گئی ، انھوں نے ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنِيهِ عَمْرٌو النَّاقِدُ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ أَيُّوبَ، قَالَ: نُبِّئْتُ عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا، أَنَّ رَجُلًا كَانَ وَاقِفًا مَعَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مُحْرِمٌ، فَذَكَرَ نَحْوَ مَا ذَكَرَ حَمَّادٌ عَنْ أَيُّوبَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10458,
                "hadithNumber": "2894",
                "englishNarrator": "Ibn Abbas (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "A person proceeded along with the Messenger of Allah (ﷺ) in the state of Ihram and fell down from his camel and his neck was broken, and he died. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Bathe him with water mixed with lote (leaves) and shroud him in two (pieces of) cloth and do'not cover his head for he would come on the Day of Resurrection pronouncing Talbiya.",
                "hadithUrdu": "ایک شخص احرا م کی حا لت میں نبی صلی اللہ علیہ وسلم کے ساتھ آیا وہ اپنے اونٹ سے گر گیا ( اس سے ) اس کی گردن ٹوٹ گئی اور وہ فوت ہو گیا تو رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" اسے پانی اور بیری کے پتوں سے غسل دو ۔ اس کے اپنے ( احرام کے ) دو کپڑے پہنا ؤ اس کا سر نہ ڈھانپو بلا شبہ وہ قیامت کے روز آئے گا ۔ تلبیہ پکار رہا ہو گا ۔",
                "urduNarrator": "ہم سے علی بن خشرم نے بیان کیا، انہوں نے بیان کیا ہمیں عیسیٰ بن یو نس نے خبر دی کہا : ابن جریج نے کہا : مجھے عمرو بن دینا ر نے سعید بن جبیر سے خبر دی انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی ، فر ما یا",
                "hadithArabic": "وحَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ، أَخْبَرَنَا عِيسَى يَعْنِي ابْنَ يُونُسَ، عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا، قَالَ: أَقْبَلَ رَجُلٌ حَرَامًا مَعَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَخَرَّ مِنْ بَعِيرِهِ، فَوُقِصَ وَقْصًا، فَمَاتَ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «اغْسِلُوهُ بِمَاءٍ وَسِدْرٍ وَأَلْبِسُوهُ ثَوْبَيْهِ، وَلَا تُخَمِّرُوا رَأْسَهُ، فَإِنَّهُ يَأْتِي يَوْمَ الْقِيَامَةِ يُلَبِّي».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10459,
                "hadithNumber": "2895",
                "englishNarrator": "Sa'id bin Jubair reported on the authority of Ibn Abbas ( رضی اللہ تعالیٰ عنہ):",
                "hadithEnglish": "A person proceeded with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) in the state of Ihram. The rest of the hadith th is the same except that he (the Holy Prophet) (is reported to have) said: He would be raised on the Day of Resurrection pronouncing Talbiya. Sa'id bin Jubair did not name the place where he fell down.",
                "hadithUrdu": "ایک شخص احرا م کی حا لت میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ آیا ۔ ( آگے اسی کے مانند ہے مگر ( محمد بن بکر نے ) کہا بلا شبہ اسے قیامت کے روز تلبیہ کہتا ہوا اٹھا یا جا ئے گا ۔ اس میں یہ اضافہ کیا کہ سعید بن جبیر نے گرنے کی جگہ کا نام نہیں لیا ۔",
                "urduNarrator": "ہم سے عبد بن حمید نے بیان کیا، انہوں نے بیان کیا محمد بن بکر برسانی نے کہا : ہمیں ابن جریج نے عمرو بن دینار سے خبر دی کہ انھیں سعید بن جبیر نے ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کرتے ہو ئے خبر دی ۔ کہا",
                "hadithArabic": "وحَدَّثَنَاه عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ الْبُرْسَانِيُّ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ، أَنَّ سَعِيدَ بْنَ جُبَيْرٍ، أَخْبَرَهُ عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا، قَالَ: أَقْبَلَ رَجُلٌ حَرَامٌ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ، غَيْرَ أَنَّهُ، قَالَ: «فَإِنَّهُ يُبْعَثُ يَوْمَ الْقِيَامَةِ مُلَبِّيًا» وَزَادَ: لَمْ يُسَمِّ سَعِيدُ بْنُ جُبَيْرٍ حَيْثُ خَرَّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10460,
                "hadithNumber": "2896",
                "englishNarrator": "Ibn Abbas ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "There was a person in the state of Ihram whose camel broke his neck and he died. Thereupon the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Bathe him with water mixed (with the leaves of) lote tree and shroud him In his two (pieces of) cloth and cover neither his head nor his face, for he would be raised on the Day of Resurrection pronouncing Talbiya.",
                "hadithUrdu": "ایک شخص کو اس کی سواری نے گرا کر مار دیا وہ احرا م کی حا لت میں تھا تو رسول اللہ صلی اللہ علیہ وسلم نے ارشاد فر ما یا : \" اسے پانی اور بیری کے پتوں سے غسل دو اسی کے ( احرا م کے ) دو کپڑوں میں کفنا دو اس کاسر اور چہرہ نہ ڈھانپو ۔ بلا شبہ اسے قیامت کے دن تلبیہ پکار تا ہوا اٹھا یا جا ئے گا ۔",
                "urduNarrator": "ہم سے ابو کریب نے بیان کیا، ہم سے وکیع نے بیان کیا, سفیان ثوری نے عمرو بن دینار سے انھوں نے سعید بن جبیر سے انھوں نے ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا، أَنَّ رَجُلًا أَوْقَصَتْهُ رَاحِلَتُهُ وَهُوَ مُحْرِمٌ فَمَاتَ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «اغْسِلُوهُ بِمَاءٍ وَسِدْرٍ وَكَفِّنُوهُ فِي ثَوْبَيْهِ، وَلَا تُخَمِّرُوا رَأْسَهُ وَلَا وَجْهَهُ، فَإِنَّهُ يُبْعَثُ يَوْمَ الْقِيَامَةِ مُلَبِّيًا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10461,
                "hadithNumber": "2897",
                "englishNarrator": "Ibn 'Abbas (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "A person who was in the state of Ihram was in the company of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), his camel broke his neckand he died. Upon this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Bathe him with water (mixed with the leaves) of the lute tree and shroud him in his two (pieces of) cloth and, neither perfume him nor cover his head, for he would be raised on the Day of Resurrection pronouncing Talbiya.",
                "hadithUrdu": "ایک شخص احرا م کی حا لت میں نبی صلی اللہ علیہ وسلم کے ساتھ تھا اونٹنی نے گرا کر اس کی گردن تو ڑدی اور وہ فوت ہو گیا ۔ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" اسے پانی اور بیری کے پتوں سے غسل دو اسے اس کے دو کپڑوں ( احرا م کی دو چادروں ) میں کفن دو نہ اسے خوشبو لگا ؤ نہ اس کا سر ڈھانپو بلا شبہ یہ قیامت کے دن اس حالت میں اٹھا یا جا ئے گا کہ اس کے بال چپکے ہو ئے ہوں گے ۔ ( جس طرح موت کے وقت احرام کی حا لت میں تھے )",
                "urduNarrator": "ہم سے محمد بن صباح نے بیان کیا، کہا ہم سے ہشیم نے بیان کیا، انہوں نے کہا ہمیں ابو بشر نے حدیث سنائی کہا : ہمیں سعید بن جبیر نے حدیث بیان کی انھوں نے حضر ت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا أَبُو بِشْرٍ، حَدَّثَنَا سَعِيدُ بْنُ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا، ح وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى - وَاللَّفْظُ لَهُ - أَخْبَرَنَا هُشَيْمٌ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا، أَنَّ رَجُلًا كَانَ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مُحْرِمًا، فَوَقَصَتْهُ نَاقَتُهُ فَمَاتَ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «اغْسِلُوهُ بِمَاءٍ وَسِدْرٍ، وَكَفِّنُوهُ فِي ثَوْبَيْهِ، وَلَا تَمَسُّوهُ بِطِيبٍ، وَلَا تُخَمِّرُوا رَأْسَهُ، فَإِنَّهُ يُبْعَثُ يَوْمَ الْقِيَامَةِ مُلَبِّدًا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10462,
                "hadithNumber": "2898",
                "englishNarrator": "Sa'id bin Jubair reported on the authority of Ibn 'Abbas ( رضی اللہ تعالیٰ عنہ):",
                "hadithEnglish": "A camel broke the neck of its owner while he was in the state of lhram and he was at that time in the company of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) commanded that he should be bathed with water mixed with (leaves of the) lote (tree) and no perfume should be applied to him and his head should not be covered, for he would be raised on the Day of Resurrection pronouncing Talblya.",
                "hadithUrdu": "ایک شخص کو اس کے اونٹ نے ( گرا کر ) اس ( کی گردن ) کا منکا توڑ دیا جبکہ وہ ( شخص ) احرا م کی حا لت میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ( سفر حج میں شر یک ) تھا رسول اللہ صلی اللہ علیہ وسلم نے اس کے متعلق حکم دیا کہ اسے پانی اور بیری کے پتوں سے غسل دیا جا ئے خوشبو نہ لگا ئی جا ئے نہ ہی اس کا سر ڈھانپا جا ئے ۔ بلا شبہ اسے قیامت کے روز ( احرا م کی حا لت میں ) چپکے ہو ئے بالوں کے ساتھ اٹھا یا جا ئے گا ۔",
                "urduNarrator": "مجھ سے ابو کامل فضیل بن حسین الجہدری نے بیان کیا، انہوں نے ہم سے بیان کیا ابو عوانہ نے ابو بشر سے حدیث سنائی انھوں نے سعید بن جبیر سے انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنِي أَبُو كَامِلٍ فُضَيْلُ بْنُ حُسَيْنٍ الْجَحْدَرِيُّ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا، أَنَّ رَجُلًا وَقَصَهُ بَعِيرُهُ وَهُوَ مُحْرِمٌ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «فَأَمَرَ بِهِ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ يُغْسَلَ بِمَاءٍ وَسِدْرٍ وَلَا يُمَسَّ طِيبًا وَلَا يُخَمَّرَ رَأْسُهُ، فَإِنَّهُ يُبْعَثُ يَوْمَ الْقِيَامَةِ مُلَبِّدًا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10463,
                "hadithNumber": "2899",
                "englishNarrator": "Sa'id bin Jubair heard Ibn 'Abbas (رضی اللہ تعالیٰ عنہ) as saying:",
                "hadithEnglish": "A person came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) while he was in the state of lhram. He fell down from his camel and broke his neck. Thereupon Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) commanded to bathe him with water (mixed with the leaves of) the lote (tree), and shroud him in two (pieces of) cloth and not to apply perfume (to him), keeping his head out (of the shroud). Shu'ba said: He then narrated to me after this (the words) keeping his head out, his face out, for he would be raised on the Day of Resurrection pronouncing Talbiya.",
                "hadithUrdu": "ایک شخص رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حا ضر ہوا جبکہ وہ احرا م کی حا لت میں تھا ( اسی دورا ن میں ) وہ اپنی اونٹنی سے گر گیا تو اس نے اسی وقت اسے مار دیا نبی صلی اللہ علیہ وسلم نے حکم دیا کہ اسے پانی اور بیر ی کے پتوں سے غسل دیا جا ئے اور اسے دو کپڑوں میں کفن دیا جا ئے خوشبو نہ لگا ئی جا ئے اور اس کا سر ( کفن سے ) با ہر نکلا ہوا ہو ۔ شعبہ نے کہا مجھے بعد میں انھوں نے یہی حدیث ( اس طرح ) بیان کیا کہ اس کا سر اور چہرہ باہر ہو ۔ بلا شبہ اسے قیامت کے دن ( احرا م میں ) چپکے بالوں کے ساتھ اٹھایا جائےگا ۔ .",
                "urduNarrator": "ہم سے محمد بن بشار اور ابوبکر بن نافع نے بیان کیا، کہا: ہم کو غندر نے خبر دی، انہوں نے بیان کیا شعبہ نے کہا : میں نے ابو بشر سے سنا وہ سعید بن جبیر سے حدیث بیان کر رہے تھے انھوں نے ابن عباس رضی اللہ تعالیٰ عنہ کو حدیث بیان کرتے ہو ئے سنا کہ",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، وَأَبُو بَكْرِ بْنُ نَافعٍ، قَالَ ابْنُ نَافِعٍ: أَخْبَرَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، قَالَ: سَمِعْتُ أَبَا بِشْرٍ، يُحَدِّثُ عَنْ سَعِيدِ بْنِ جُبَيْرٍ، أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا يُحَدِّثُ، أَنَّ رَجُلًا أَتَى النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مُحْرِمٌ، فَوَقَعَ مِنْ نَاقَتِهِ فَأَقْعَصَتْهُ: «فَأَمَرَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ يُغْسَلَ بِمَاءٍ وَسِدْرٍ، وَأَنْ يُكَفَّنَ فِي ثَوْبَيْنِ، وَلَا يُمَسَّ طِيبًا، خَارِجٌ رَأْسُهُ» قَالَ شُعْبَةُ: ثُمَّ حَدَّثَنِي بِهِ بَعْدَ ذَلِكَ: خَارِجٌ رَأْسُهُ وَوَجْهُهُ، فَإِنَّهُ يُبْعَثُ يَوْمَ الْقِيَامَةِ مُلَبِّدًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 10151,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=406",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=404",
                "label": "404",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=405",
                "label": "405",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=406",
                "label": "406",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=407",
                "label": "407",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=408",
                "label": "408",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=409",
                "label": "409",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=410",
                "label": "410",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=408",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=408",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=406",
        "to": 10175,
        "total": 40465
    }
}