{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 531,
        "data": [
            {
                "id": 13539,
                "hadithNumber": "5976",
                "englishNarrator": "Uqba bin 'Amir رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) one day went out and he offered prayer over the martyrs of Uhud just as prayer is offered over the dead. He then came back and sat on pulpit and said: I shall be present there (at the Cistern) before you. I shall be your witness and, by Allah, I perceive as if I am seeing with my own eyes my Cistern at this very state and I have been given the keys of the treasures of the earth or the keys of the earth and, by Allah, I am not afraid concerning you that you would associate anything (with Allah after me), but I am afraid that you would be vying with one another (for the possession of) the treasures of the earth.",
                "hadithUrdu": "ایک دن رسول اللہ صلی اللہ علیہ وسلم باہر تشریف لے گئے اور اہل احد پر اسی طرح نماز جنازہ پڑھی جس طرح میت پر پڑھی جاتی ہے ، پھر آپ پلٹ کر منبر پر تشریف فرما ہو ئے اور فرما یا : \" میں حوض پر تمھا را پیش رو ہو ں گا اور میں تم پر گواہی دینے والا ہوں گا اور میں ، اللہ کی قسم !جیسے اب بھی اپنے حوض کو دیکھ رہا ہو ں گا ۔ مجھے زمین کے خزانوں کی چابیاں یا ( فرمایا : ) زمین کی چابیاں عطا کی گئیں اور اللہ کی قسم!میں تمھا رے بارے میں اس بات سے نہیں ڈرتا کہ میرے بعد تم شرک کرو گے ۔ لیکن میں اس بات سے ڈرتا ہوں کہ تم ان ( خزانوں کے معاملے ) میں ایک دوسرے کے ساتھ مقابلہ کرو گے ( کہ ان میں سے کو ن زیادہ فائدہ اٹھا تا اور زیادہ دولت مندی کا مظاہرہ کرتا ہے ۔ ) \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, لیث نے یزید بن ابی حبیب سے ، انھوں نے ابو الخیر سے ، انھوں نے حضرت عقبہ بن عامر رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ خَرَجَ يَوْمًا فَصَلَّى عَلَى أَهْلِ أُحُدٍ صَلَاتَهُ عَلَى الْمَيِّتِ، ثُمَّ انْصَرَفَ إِلَى الْمِنْبَرِ فَقَالَ: «إِنِّي فَرَطٌ لَكُمْ، وَأَنَا شَهِيدٌ عَلَيْكُمْ، وَإِنِّي وَاللهِ لَأَنْظُرُ إِلَى حَوْضِي الْآنَ، وَإِنِّي قَدْ أُعْطِيتُ مَفَاتِيحَ خَزَائِنِ الْأَرْضِ، أَوْ مَفَاتِيحَ الْأَرْضِ، وَإِنِّي، وَاللهِ مَا أَخَافُ عَلَيْكُمْ أَنْ تُشْرِكُوا بَعْدِي، وَلَكِنْ أَخَافُ عَلَيْكُمْ أَنْ تَتَنَافَسُوا فِيهَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13540,
                "hadithNumber": "5977",
                "englishNarrator": "Uqba bin 'Amir reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Allah's Messenger offered prayer over those who had fallen matyrs at Uhud. He then climbed the pulpit as if someone is saying good-bye to the living and the dead, and then said: I shall be there as your predecesor on the Cistern before you, and it is as wide as the distance between Aila and Juhfa (Aila is at the top of the gulf of 'Aqaba). I am not afraid that you would associate anything with Allah after me, but I am afraid that you may be (allured) by the world and (vie) with one another (in possessing material wealth) and begin killing one another, and you would be destroyed as were destroyed those who had gone before you. 'Uqba said that that was the last occasion that he saw Allah's Messenger on the pulpit.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: رسول اللہ صلی اللہ علیہ وسلم نے احد میں شہید ہونے والوں پر نماز پڑھی۔ پھر منبر پر اس طرح چڑھے جیسے کوئی زندہ اور مردہ کو الوداع کہہ رہا ہو، اور پھر فرمایا: میں تم سے پہلے حوض پر تمہارے پیش رو کے طور پر موجود ہوں گا اور یہ عائلہ اور جحفہ کے درمیان اتنا ہی فاصلہ ہے جتنا عائلہ خلیج عقبہ کی چوٹی پر ہے۔ میں اس بات سے نہیں ڈرتا کہ تم میرے بعد اللہ کے ساتھ کسی کو شریک ٹھہراؤ گے، لیکن مجھے ڈر ہے کہ تم دنیا کی طرف متوجہ ہو جاؤ اور (مال کے حصول میں) آپس میں ایک دوسرے کو قتل کرنے لگو اور تم اسی طرح ہلاک ہو جاؤ جس طرح تم سے پہلے لوگ ہلاک ہوئے تھے۔ عقبہ نے کہا کہ یہ آخری موقع تھا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو منبر پر دیکھا۔",
                "urduNarrator": "ہم سے محمد بن مثنیٰ نے بیان کیا، ہم سے ابن جریر نے بیان کیا، انہوں نے کہا کہ میں نے یحییٰ بن ایوب کو یزید بن کی سند سے بیان کرتے ہوئے سنا۔ ابی حبیب، مرثد کی سند سے، عقبہ بن عامر کی سند سے، کہتے ہیں",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا وَهْبٌ يَعْنِي ابْنَ جَرِيرٍ، حَدَّثَنَا أَبِي، قَالَ:، سَمِعْتُ يَحْيَى بْنَ أَيُّوبَ، يُحَدِّثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ مَرْثَدٍ، عَنْ عُقْبَةَ بْنِ عَامِرٍ، قَالَ صَلَّى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: عَلَى قَتْلَى أُحُدٍ، ثُمَّ صَعِدَ الْمِنْبَرَ كَالْمُوَدِّعِ لِلْأَحْيَاءِ وَالْأَمْوَاتِ، فَقَالَ: «إِنِّي فَرَطُكُمْ عَلَى الْحَوْضِ، وَإِنَّ عَرْضَهُ كَمَا بَيْنَ أَيْلَةَ إِلَى الْجُحْفَةِ، إِنِّي لَسْتُ أَخْشَى عَلَيْكُمْ أَنْ تُشْرِكُوا بَعْدِي، وَلَكِنِّي أَخْشَى عَلَيْكُمُ الدُّنْيَا أَنْ تَنَافَسُوا فِيهَا، وَتَقْتَتِلُوا، فَتَهْلِكُوا، كَمَا هَلَكَ مَنْ كَانَ قَبْلَكُمْ» قَالَ عُقْبَةُ: «فَكَانَتْ آخِرَ مَا رَأَيْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13541,
                "hadithNumber": "5978",
                "englishNarrator": "Abdullah reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying; I shall be there at the Cistern before you, and I shall have to contend for some people, but I shall have to yield. I would be saying: My Lord, they are my friends, they are my friends, and it would be said: You don't know what innovations they made after you.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" میں حوض پر تمھا را پیش رو ہوں گا ۔ میں کچھ اقوام ( لو گوں ) کے بارے میں ( فرشتوں سے ) جھگڑوں گا ، پھر ان کے حوالے سے ( فرشتوں کو ) مجھ پر غلبہ عطا کر دیا جا ئے گا ، میں کہوں گا : اے میرے رب ! ( یہ ) میرے ساتھی ہیں ۔ میرے ساتھی ہیں ، تو مجھ سے کہا جا ئے گا : بلا شبہ آپ نہیں جا نتے کہ انھوں نے آپ کے بعد ( دین میں ) کیا نئی باتیں ( بدعات ) نکا لی تھیں ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، ابو کریب اور ابن نمیر نے بیان کیا، انہوں نے کہا: ہمیں ابو معاویہ نے اعمش سے حدیث سنائی ، انھوں نے شقیق ( بن سلمہ اسدی ) سے ، انھوں نے حضرت عبد اللہ سے روایت بیان کی  کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، وَابْنُ نُمَيْرٍ، قَالُوا: حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ عَبْدِ اللهِ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: أَنَا فَرَطُكُمْ عَلَى الْحَوْضِ، وَلَأُنَازِعَنَّ أَقْوَامًا ثُمَّ لَأُغْلَبَنَّ عَلَيْهِمْ، فَأَقُولُ: يَا رَبِّ أَصْحَابِي، أَصْحَابِي، فَيُقَالُ: إِنَّكَ لَا تَدْرِي مَا أَحْدَثُوا بَعْدَكَ .",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13542,
                "hadithNumber": "5979",
                "englishNarrator": null,
                "hadithEnglish": "The hadith has been narrated on the authority ot al-A'mash with the same chain of transmitters but no mention is made of: They are my companions; they are my companions.",
                "hadithUrdu": "ہم سے عثمان بن ابی شیبہ اور اسحاق بن ابراہیم نے بیان کیا، جریر اعمش سے اسی سند کے ساتھ روایت کی اور \" میرے ساتھی ہیں ۔ میرے ساتھی ہیں ، کے الفاظ بیان نہیں کیے ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَاهُ عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، عَنْ جَرِيرٍ، عَنِ الْأَعْمَشِ، بِهَذَا الْإِسْنَادِ، وَلَمْ يَذْكُرْ» أَصْحَابِي، أَصْحَابِي.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13543,
                "hadithNumber": "5980",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of 'Abdullah رضی اللہ عنہ through another chain of transmitters.",
                "hadithUrdu": "ہم سے عثمان بن ابی شیبہ اور اسحاق بن ابراہیم دونوں نے بیان کیا, جریر اور شعبہ نے مغیرہ سے ، انھوں نے ابو وائل سے ، انھوں نے حضرت عبد اللہ ( بن مسعود رضی اللہ عنہ ) سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے اعمش کی حدیث کے مانند روایت کی ۔ شعبہ کی مغیرہ سے روایت ( کی سند ) میں یہ الفا ظ ہیں : میں نے ابو وائل سے سنا ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ كِلَاهُمَا، عَنْ جَرِيرٍ، وَحَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ جَمِيعًا، عَنْ مُغِيرَةَ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللهِ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، بِنَحْوِ حَدِيثِ الْأَعْمَشِ، وَفِي حَدِيثِ شُعْبَةَ، عَنْ مُغِيرَةَ: سَمِعْتُ أَبَا وَائِلٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13544,
                "hadithNumber": "5981",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Hudhaifa رضی اللہ عنہ through another chain of transmitters.",
                "hadithUrdu": "ہم سے سعید بن عمرو اشعثی نے بیان کیا, عبثراور ابن فضیل دونوں نے حصین سے انھوں نے ابو وائل سے ، انھوں  نے حضرت حذیفہ رضی اللہ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ، جس طرح اعمش اور مغیرہ کی روایت ہے ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَاهُ سَعِيدُ بْنُ عَمْرٍو الْأَشْعَثِيُّ، أَخْبَرَنَا عَبْثَرٌ، وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ فُضَيْلٍ كِلَاهُمَا، عَنْ حُصَيْنٍ، عَنْ أَبِي وَائِلٍ، عَنْ حُذَيْفَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَحْوَ حَدِيثِ الْأَعْمَشِ، وَمُغِيرَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13545,
                "hadithNumber": "5982",
                "englishNarrator": "Haritha رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: His Cistern would be as extensive as the distance between San'a' and Medina. Mustaurid رضی اللہ عنہ (one of the narrators) said: Did you not hear anything about the utensils? Thereupon he said. No. Mustaurid رضی اللہ عنہ said: You would find that the utensils would be like stars.",
                "hadithUrdu": "آپ نے فر ما یا : \" آپ صلی اللہ علیہ وسلم کا حوض ( اتنا چوڑا ہے ) جتنا صنعاءاور مدینہ کے درمیان ( کا فاصلہ ) ہے ۔ مستورد ( ابن شداد ) رضی اللہ عنہ نے ان ( حضرت حارثہ رضی اللہ عنہ ) سے کہا : آپ نے رسول اللہ صلی اللہ علیہ وسلم سے نہیں سنا ، کہ آپ نے فرما یا : \" برتن \" ؟انھوں نے کہا : نہیں تو مستورد رضی اللہ عنہ نے کہا : \" اس میں برتن ستاروں کی طرح نظر آئیں گے ۔ \"",
                "urduNarrator": "محمد بن عبداللہ بن باز یع نے مجھ سے کہا, ابن ابی عدی نے شعبہ سے ، انھوں نے معبد بن خالد سے ، انھوں نے حضرت حارثہ ( بن وہب خزاعی ) رضی اللہ عنہ سے روایت کی ، کہ انھوں نے نبی صلی اللہ علیہ وسلم سے سنا",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ بَزِيعٍ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ شُعْبَةَ، عَنْ مَعْبَدِ بْنِ خَالِدٍ، عَنْ حَارِثَةَ، أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «حَوْضُهُ مَا بَيْنَ صَنْعَاءَ وَالْمَدِينَةِ» فَقَالَ لَهُ الْمُسْتَوْرِدُ: أَلَمْ تَسْمَعْهُ قَالَ: «الْأَوَانِي»؟ قَالَ: لَا، فَقَالَ الْمُسْتَوْرِدُ: «تُرَى فِيهِ الْآنِيَةُ مِثْلَ الْكَوَاكِبِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13546,
                "hadithNumber": "5983",
                "englishNarrator": "Haritha bin Wahb al-Khuza'i رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger's ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) words concerning the Cistern like it, but he made no mention of the words of Mustaurid.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو فر ما تے ہو ئے سنا اور انھوں نے ( حرمی بن عمارہ ) نے حوض کا ذکر کیا ، اسی ( سابقہ حدیث ) کے مانند ۔ انھوں نے حضرت مستورد اور ان ( حضرت حارثہ رضی اللہ عنہ ) کا قول ذکر نہیں کیا ۔",
                "urduNarrator": "مجھ سے ابراہیم بن محمد بن عرعرہ نے بیان کیا, حرمی بن عمارہ نے کہا : ہمیں شعبہ نے معبد بن خالد سے حدیث بیان کی کہ انھوں نے حضرت حارثہ بن وہب خزاعی رضی اللہ عنہ کو سنا وہ کہہ رہے تھے کہ",
                "hadithArabic": "وحَدَّثَنِي إِبْرَاهِيمُ بْنُ مُحَمَّدِ بْنِ عَرْعَرَةَ، حَدَّثَنَا حَرَمِيُّ بْنُ عُمَارَةَ، حَدَّثَنَا شُعْبَةُ، عَنْ مَعْبَدِ بْنِ خَالِدٍ، أَنَّهُ سَمِعَ حَارِثَةَ بْنَ وَهْبٍ الْخُزَاعِيَّ، يَقُولُ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: وَذَكَرَ الْحَوْضَ بِمِثْلِهِ، وَلَمْ يَذْكُرْ قَوْلَ الْمُسْتَوْرِدِ وَقَوْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13547,
                "hadithNumber": "5984",
                "englishNarrator": "Ibn 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: There is before you a Cistern and the distance between its two sides is as it is between Jarba' and Adhruh.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" تمھا رے آگے ( جس منزل کی طرف تم جا رہے ہو ) حوض ہے اس کے دو کناروں کے درمیان جرباء اور اذرح ( شام اور فلسطین کے دو مقام ) کے درمیان جتنا فاصلہ ہے ۔",
                "urduNarrator": "ہم سے ابو الربیع الزہرانی اور ابو کامل الجہدری نے بیان کیا، کہا: ہم سے حماد نے جو ابن زید ہیں، بیان کیا, ایوب نے نافع سے ، انھوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، وَأَبُو كَامِلٍ الْجَحْدَرِيُّ، قَالَا: حَدَّثَنَا حَمَّادٌ وَهُوَ ابْنُ زَيْدٍ، حَدَّثَنَا أَيُّوبُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ أَمَامَكُمْ حَوْضًا، مَا بَيْنَ نَاحِيَتَيْهِ كَمَا بَيْنَ جَرْبَاءَ وَأَذْرُحَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13548,
                "hadithNumber": "5985",
                "englishNarrator": "This hadith has been transmitted on the authority of Ibn 'Umar رضی اللہ عنہ and the words are:",
                "hadithEnglish": "He said: There would be before you a Cistern extending from jarba' and Adhruh and the same has been transmitted on the authority of Ibn Muthanna and the wording is: My Cistern.",
                "hadithUrdu": "آپ نے فر ما یا : \" تمھا رے آگے حوض ہے ( اس کی وسعت اتنی ہے جتنا ) جرباء اور اذرح کے درمیان کا فاصلہ ہے ۔ \" اور ابن مثنیٰ کی روایت میں \" میرا حوض \" کے الفا ظ ہیں ۔",
                "urduNarrator": "زہیر بن حرب محمد بن مثنیٰ اور عبید اللہ بن سعید نے کہا , ہمیں یحییٰ قطان نے عبید اللہ سے حدیث بیان کی ، انھوں نے کہا : مجھے نافع نے حضرت ابن عمر رضی اللہ عنہ سے خبر دی انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَعُبَيْدُ اللهِ بْنُ سَعِيدٍ، قَالُوا: حَدَّثَنَا يَحْيَى وَهُوَ الْقَطَّانُ، عَنْ عُبَيْدِ اللهِ، أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ أَمَامَكُمْ حَوْضًا كَمَا بَيْنَ جَرْبَاءَ وَأَذْرُحَ» وَفِي رِوَايَةِ ابْنِ الْمُثَنَّى «حَوْضِي».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13549,
                "hadithNumber": "5986",
                "englishNarrator": "A hadith like this has been transmitted on the authority, of 'Ubaidullah with this addition: Ubaidullah was asked (about these two names, i.e. Jarba' and Adhruh). He said:",
                "hadithEnglish": "These are the two towns of Syria and there is between them the distance which can be covered in three nights, and the hadith transmitted on the authority of Ibn Bishr (the words are). Three days.",
                "hadithUrdu": "شام کی دوبستیاں ہیں ان کے درمیان تین راتوں کی مسافت ہے ۔ ابن بشر کی روایت میں تین دن ( کا ذکر ) ہے ۔",
                "urduNarrator": "عبد اللہ بن نمیر اور محمد بن بشر نے کہا : ہمیں عبید اللہ نے اسی سند کے ساتھ اسی کی مانند روایت کی اور مزید بیان کیا کہ عبید اللہ نے کہا , میں نے ان ( نافع ) سے پو چھا تو انھوں نے کہا",
                "hadithArabic": "وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي،وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، قَالَا: حَدَّثَنَا عُبَيْدُ اللهِ، بِهَذَا الْإِسْنَادِ مِثْلَهُ وَزَادَ: قَالَ عُبَيْدُ اللهِ: فَسَأَلْتُهُ فَقَالَ قَرْيَتَيْنِ بِالشَّأْمِ، بَيْنَهُمَا مَسِيرَةُ ثَلَاثِ لَيَالٍ، وَفِي حَدِيثِ ابْنِ بِشْرٍ: ثَلَاثَةِ أَيَّامٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13550,
                "hadithNumber": "5987",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been narrated on the authority of Ibn Umar رضی اللہ عنہ through another chain of transmitters.",
                "hadithUrdu": "مجھ سے سوید بن سعید نے بیان کیا، کہا ہم سے حفص بن میسرہ نے بیان کیا, موسیٰ بن عقبہ نے نافع سے ، انھوں نے حضرت ابن عمر رضی اللہ عنہ سے ، انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے عبیداللہ کی حدیث کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِي سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا حَفْصُ بْنُ مَيْسَرَةَ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ عُبَيْدِ اللهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13551,
                "hadithNumber": "5988",
                "englishNarrator": "Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: There would be before you a Cistern (as extensive) as there is the distance between Jarba' and Adhruh and there would be jugs like stars in the sky; he who would come to that and drink from it would never feel thirsty after that.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" تمھا رے سامنے ایسا حوض ہے جتنا جرباء اور اذرح کے درمیان کی مسافت ہے اس میں آسمان کے ستاروں جتنے کو زے ہیں جو اس تک پہنچے گا اور اس میں سے پیے گا وہ اس کے بعد کبھی پیاسا نہیں ہو گا ۔",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے عبداللہ بن وہب نے بیان کیا, عمر بن نافع سے ، انھوں نے حضرت عبد اللہ ( بن عمر رضی اللہ عنہ ) سے روایت کی",
                "hadithArabic": "وحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، حَدَّثَنِي عُمَرُ بْنُ مُحَمَّدٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللهِ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ أَمَامَكُمْ حَوْضًا كَمَا بَيْنَ جَرْبَاءَ وَأَذْرُحَ، فِيهِ أَبَارِيقُ كَنُجُومِ السَّمَاءِ مَنْ وَرَدَهُ فَشَرِبَ مِنْهُ لَمْ يَظْمَأْ بَعْدَهَا أَبَدًا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13552,
                "hadithNumber": "5989",
                "englishNarrator": "Abu Dharr رضی اللہ عنہ said:",
                "hadithEnglish": "Allah's Messenger, what about the vessels of that Cistern? He said: By Him in Whose Hand is the life of Muhammad, the vessels would outnumber the stars in the sky and its planets shining on a dark cloudless night. These would be the vessels of Paradise. He who drinks out of it (the Cistern) would never feel thirsty. There would flow in it two spouts from Paradise and he who would drink out of it would not feel thirsty; and the distance between its (two corners) is that between 'Amman and Aila, and its water is whiter than milk and sweeter than honey.",
                "hadithUrdu": "اللہ کے رسول صلی اللہ علیہ وسلم !حوض کے برتن کیسے ہیں ؟ آپ صلی اللہ علیہ وسلم نے فر ما یا : \" اس ذات کی قسم ! جس کے ہاتھ میں محمد صلی اللہ علیہ وسلم کی جان ہے!اس حوض کے برتن آسمان کے چھوٹے اور بڑے ( تمام ستاروں کی تعداد سے زیادہ ہیں ۔ یاد رکھو!جو اندھیری صاف مطلع کی رات میں ہو تے ہیں وہ جنت کے برتن ہیں کہ جوان سے ( شراب کو ثر ) پی لے گا وہ اپنے ذمے ( جنت میں جا نے کے دورانیے ) کے اخر تک کبھی پیا سا نہیں ہو گا ۔ اس میں جنت ( کی باران رحمت ) کے دو پر نالے آکر گرتے ہیں جو اس میں سے پی لے گا وہ کبھی پیاسا نہیں ہو گا ۔ اس کی چوڑائی اس کی لمبا ئی کے برابر ہے جیسے عمان سے ایلہ تک ( کا فاصلہ ) ہے ۔ اس کا پا نی دودھ سے زیادہ سفید اور شہد سے زیادہ میٹھا ہے ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، اسحاق بن ابراہیم اور ابن ابی عمر مکی نے بیان کیا اور یہ قول ابن ابی شیبہ سے ہے: ہم سے انہوں نے بیان کیا اور باقی دو نے کہا - ہم سے عبد العزیز بن عبد الصمد العمی نے ابو عمران الجنی کی سند سے بیان کیا, عبد اللہ بن صامت نے حضرت ابو ذر رضی اللہ عنہ سے روایت کی کہا : میں نے پو چھا",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ أَبِي عُمَرَ الْمَكِّيُّ - وَاللَّفْظُ لِابْنِ أَبِي شَيْبَةَ قَالَ إِسْحَاقُ: أَخْبَرَنَا، وقَالَ الْآخَرَانِ - حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ الصَّمَدِ الْعَمِّيُّ، عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ، عَنْ عَبْدِ اللهِ بْنِ الصَّامِتِ، عَنْ أَبِي ذَرٍّ، قَالَ: قُلْتُ: يَا رَسُولَ اللهِ مَا آنِيَةُ الْحَوْضِ قَالَ: «وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَآنِيَتُهُ أَكْثَرُ مِنْ عَدَدِ نُجُومِ السَّمَاءِ وَكَوَاكِبِهَا، أَلَا فِي اللَّيْلَةِ الْمُظْلِمَةِ الْمُصْحِيَةِ، آنِيَةُ الْجَنَّةِ مَنْ شَرِبَ مِنْهَا لَمْ يَظْمَأْ آخِرَ مَا عَلَيْهِ، يَشْخَبُ فِيهِ مِيزَابَانِ مِنَ الْجَنَّةِ، مَنْ شَرِبَ مِنْهُ لَمْ يَظْمَأْ، عَرْضُهُ مِثْلُ طُولِهِ، مَا بَيْنَ عَمَّانَ إِلَى أَيْلَةَ، مَاؤُهُ أَشَدُّ بَيَاضًا مِنَ اللَّبَنِ، وَأَحْلَى مِنَ الْعَسَلِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13553,
                "hadithNumber": "5990",
                "englishNarrator": "Thauban رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: I would be pushing back from my Cistern the crowd of people. I would strike away from it (the Cistern) with my staff the people of Yemen until the water (of the Haud) would spout forth upon them. He was asked about its breadth. He said: From this place of mine to 'Amman, and he was asked about the drink and he said: It is whiter than milk and sweeter than honey. There would spout into it two streamlets having their sources in Paradise. the one is from gold and the other is from silver.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے فر ما یا : \" میں اپنے حوض پر پینے کی جگہ سے اہل یمن ( انصاراصلاًیمن سے تھے ) کے لیے لو گوں کو ہٹاؤں گا ۔ میں ( اپنے حوض کے پانی پر ) اپنی لا ٹھی ماروں گا تو وہ ان پر بہنے لگے گا ۔ \" آپ سے اس ( حوض ) کی چوڑائی کے بارے میں پو چھا گیاتو آپ صلی اللہ علیہ وسلم نے فرما یا : \" میرے کھڑے ہو نے کی ( اس ) جگہ سے عمان تک ۔ \" اور آپ صلی اللہ علیہ وسلم سے اس ( حوض ) کے مشروب کے بارے میں پو چھا گیا تو فرما یا : \" وہ دودھ سے زیادہ سفید اور شہد سے زیادہ میٹھا ہے جنت سے دو پر نالے اس میں تیز سے شامل ہو کر اس میں اضافہ کرتے رہتے ہیں ۔ ان میں سے ایک پرنالہ سونے کا ہے اور ایک چاندی کا ۔ \"",
                "urduNarrator": "ہم سے ابو غسان المسمعی، محمد بن المثنیٰ اور ابن بشار نے بیان کیا - اور ان کا قول بھی اسی طرح ہے - انہوں نے کہا: ہم سے معاذ نے بیان کیا ہے, ہشام نے قتادہ سے ، انھوں نے سالم بن ابی جعد سے ، انھوں نے معدان بن ابی طلحہ یعمری سے ، انھوں نے حضرت ثوبان رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو غَسَّانَ الْمِسْمَعِيُّ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ - وَأَلْفَاظُهُمْ مُتَقَارِبَةٌ - قَالُوا: حَدَّثَنَا مُعَاذٌ وَهُوَ ابْنُ هِشَامٍ، حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ مَعْدَانَ بْنِ أَبِي طَلْحَةَ الْيَعْمَرِيِّ، عَنْ ثَوْبَانَ، أَنَّ نَبِيَّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنِّي لَبِعُقْرِ حَوْضِي أَذُودُ النَّاسَ لِأَهْلِ الْيَمَنِ أَضْرِبُ بِعَصَايَ حَتَّى يَرْفَضَّ عَلَيْهِمْ». فَسُئِلَ عَنْ عَرْضِهِ فَقَالَ: «مِنْ مَقَامِي إِلَى عَمَّانَ» وَسُئِلَ عَنْ شَرَابِهِ فَقَالَ: «أَشَدُّ بَيَاضًا مِنَ اللَّبَنِ، وَأَحْلَى مِنَ الْعَسَلِ، يَغُتُّ فِيهِ مِيزَابَانِ يَمُدَّانِهِ مِنَ الْجَنَّةِ، أَحَدُهُمَا مِنْ ذَهَبٍ، وَالْآخَرُ مِنْ وَرِقٍ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13554,
                "hadithNumber": "5991",
                "englishNarrator": "This hadith has been narrated on the authority of Hisham with the same chain of transmitters and the words are:",
                "hadithEnglish": "I would be on the Day of Resurrection near the bank of the Cistern.",
                "hadithUrdu": "\" میں قیامت کے دن حوض کے پانی پینے کی جگہ پر ہوں گا ۔ \"",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، ہم سے حسن بن موسیٰ نے بیان کیا، شیبان نے قتادہ سے ہشام کی سند کے ساتھ اس کی حدیث کے مانند حدیث بیان کی ، مگر اس نے اس طرح کہا",
                "hadithArabic": "وحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى، حَدَّثَنَا شَيْبَانُ، عَنْ قَتَادَةَ، بِإِسْنَادِ هِشَامٍ بِمِثْلِ حَدِيثِهِ، غَيْرَ أَنَّهُ قَالَ: «أَنَا، يَوْمَ الْقِيَامَةِ، عِنْدَ عُقْرِ الْحَوْضِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13555,
                "hadithNumber": "5992",
                "englishNarrator": null,
                "hadithEnglish": "Thaubin reported this hadith pertaining to the Cistern. Muhammad bin Bashshar said: I said to Yahya bin Hammad: This is the hadith that I heard from Abu 'Awana and he said: I also heard it from Shu'ba. I said: Narrate that to me and he narrated that to me.",
                "hadithUrdu": "محمد بن بشار نے کہا : ہمیں یحییٰ بن حماد نے حدیث بیان کی ، کہا : ہمیں شعبہ نے قتادہ سے حدیث بیان کی ، انھوں نے سالم بن ابی جعد سے ، انھوں نے معدان سے ، انھوں نے حضرت ثوبان رضی اللہ تعالیٰ عنہ سے ، انھوں نے نبی صلی اللہ علیہ وسلم سے حوض کی حدیث روایت کی ، میں نے یحییٰ بن حماد سےکہا : یہ حدیث آپ نے ابو عوانہ سے سنی ہے؟ تو انھوں نے کہا : اور شعبہ سے بھی سنی ہے ۔ میں نے کہا : میری خاطر اس میں نگاہ ( بھی ) ڈالیں ۔ ( آپ کے صحیفے میں جہا ں لکھی ہو ئی ہے اسے بھی پڑھ لیں ) انھوں نے میری خاطر اس میں نظر کی ( اسے پڑھا ) اور مجھے وہ حدیث بیان کی ، ( ان کی روایت میں کسی بھول چوک کا بھی امکا ن نہیں ۔ )",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ حَمَّادٍ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ مَعْدَانَ، عَنْ ثَوْبَانَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حَدِيثَ الْحَوْضِ فَقُلْتُ: لِيَحْيَى بْنِ حَمَّادٍ: هَذَا حَدِيثٌ سَمِعْتَهُ مِنْ أَبِي عَوَانَةَ، فَقَالَ: وَسَمِعْتُهُ أَيْضًا مِنْ شُعْبَةَ فَقُلْتُ: انْظُرْ لِي فِيهِ، فَنَظَرَ لِي فِيهِ فَحَدَّثَنِي بِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13556,
                "hadithNumber": "5993",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: I will drive away from my Cistern people just as the stray camels are driven away.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے فر ما یا : \" میں حوض سے لوگوں کو اس طرح ہٹاؤں گا جس طرح اجنبی اونٹوں کو ( اپنے گھاٹ سے ) ہٹا یا جا تا ہے ۔ \"",
                "urduNarrator": "ہم سے عبدالرحمٰن بن سلام الجمحی نے بیان کیا, ربیع بن مسلم نے محمد بن زیاد سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَلَّامٍ الْجُمَحِيُّ، حَدَّثَنَا الرَّبِيعُ يَعْنِي ابْنَ مُسْلِمٍ، عَنْ مُحَمَّدِ بْنِ زِيَادٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَأَذُودَنَّ عَنْ حَوْضِي رِجَالًا كَمَا تُذَادُ الْغَرِيبَةُ مِنَ الْإِبِلِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13557,
                "hadithNumber": "5994",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Abu Huraira رضی اللہ عنہ through another chain of transmitters.",
                "hadithUrdu": "مجھ سے عبید اللہ بن معاذ نے بیان کیا، ہم سے میرے والد نے بیان کیا، شعبہ نے محمد بن زیاد سےروایت کی ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے ، نبی صلی اللہ علیہ وسلم نے فر ما یا ، اسی کے مانند ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِيهِ عُبَيْدُ اللهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ زِيَادٍ، سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13558,
                "hadithNumber": "5995",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: My Cistern would be as extensive as the distance between Aila and San'a, of Yemen, and there would be in it jugs like stars in the sky.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" میرے حوض کی مقدار اتنی ہے جتنی ایلہ اور یمن کے صنعاء کے درمیان مسافت ہے اور اس کے برتنوں کی تعدادآسمان کے ستاروں کی طرح ہے ۔ \"",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، مجھ سے یونس نے بیان کیا, ابن شہاب سے روایت ہے کہ حضرت انس بن مالک رضی اللہ عنہ نے انھیں حدیث بیان کی کہ",
                "hadithArabic": "وحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَنَّ أَنَسَ بْنَ مَالِكٍ، حَدَّثَهُ أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «قَدْرُ حَوْضِي كَمَا بَيْنَ أَيْلَةَ وَصَنْعَاءَ مِنَ الْيَمَنِ، وَإِنَّ فِيهِ مِنَ الْأَبَارِيقِ كَعَدَدِ نُجُومِ السَّمَاءِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13559,
                "hadithNumber": "5996",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Some persons from amongst my associates would turn to my Cistern; when I would see them and they would be presented to me, they would be detained in the way while coming to me. I would say: My Lord, they are my companions, they are my companions, and it would be said to me: You don't know what innovations they made after you.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے فر ما یا \" حوض پر میرے ساتھیوں میں سے کچھ آدمی آئیں گےحتی کہ جب میں انھیں دیکھوں گا اور ان کو میرے سامنے کیا جا ئے گا تو انھیں مجھ ( تک پہنچنے ) سے پہلے اٹھا لیا جا ئے ، میں زور دے کر کہوں گا : اے میرے رب! ( یہ ) میرے ساتھی ہیں میرے ساتھی ہیں تو مجھ سے کہا جا ئے گا ۔ آپ نہیں جانتے کہ انھوں نے آپ کےبعد کیا نئی باتیں نکا لیں ۔ \"",
                "urduNarrator": "مجھ سے محمد بن حاتم نے بیان کیا، ہم سے عفان بن مسلم الصفار نے بیان کیا، ہم سے وہیب نے بیان کیا،عبد العزیز بن صہیب نے کہا : ہمیں حضرت انس بن مالک رضی اللہ عنہ نے حدیث بیان کی کہ",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ الصَّفَّارُ، حَدَّثَنَا وُهَيْبٌ، قَالَ: سَمِعْتُ عَبْدَ الْعَزِيزِ بْنَ صُهَيْبٍ، يُحَدِّثُ قَالَ: حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: لَيَرِدَنَّ عَلَيَّ الْحَوْضَ رِجَالٌ مِمَّنْ صَاحَبَنِي، حَتَّى إِذَا رَأَيْتُهُمْ وَرُفِعُوا إِلَيَّ اخْتُلِجُوا دُونِي، فَلَأَقُولَنَّ: أَيْ رَبِّ أُصَيْحَابِي، أُصَيْحَابِي، فَلَيُقَالَنَّ لِي: إِنَّكَ لَا تَدْرِي مَا أَحْدَثُوا بَعْدَك.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13560,
                "hadithNumber": "5997",
                "englishNarrator": "Anas reported:",
                "hadithEnglish": "A hadith like this from Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and he made this addition: The vessels would be as numerous as the number of stars.",
                "hadithUrdu": "انھوں نے نبی صلی اللہ علیہ وسلم سے اسی مفہوم میں روایت کی اور اس میں مزید یہ کہا : اس کےبرتن ستاروں کی تعداد میں ہیں ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور علی بن حجر نے بیان کیا، کہا کہ ہم سے علی بن مسسر نے بیان کیا، ہم سے ابو کریب نے بیان کیا، ہم سے ابن فضیل نے بیان کیا, مختار بن فلفل نے حضرت انس رضی اللہ عنہ سے",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ حُجْرٍ قَالَا: حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا ابْنُ فُضَيْلٍ جَمِيعًا، عَنِ الْمُخْتَارِ بْنِ فُلْفُلٍ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْمَعْنَى وَزَادَ «آنِيَتُهُ عَدَدُ النُّجُومِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13561,
                "hadithNumber": "5998",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: There would be such a vast distance between the sides of my Cistern as it is between Sana' and Medina.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فر ما یا : \" میرے حوض کی دوطرفوں ( دونوں کناروں ) کے درمیان اتنافاصلہ ہے جتنا صنعاء اور مدینہ کے درمیان ہے ۔ \"",
                "urduNarrator": "ہم سے عاصم بن نضر تیمی اور حریم بن عبد الاعلٰی نے بیان کیا  اور لفظ عاصم کا ہے, معتمر کے والد سلیمان نے کہا : ہمیں قتادہ نے حضرت انس بن مالک رضی اللہ عنہ نے حدیث بیان کی ، انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ، کہ",
                "hadithArabic": "وَحَدَّثَنَا عَاصِمُ بْنُ النَّضْرِ التَّيْمِيُّ، وَهُرَيْمُ بْنُ عَبْدِ الْأَعْلَى - وَاللَّفْظُ لِعَاصِمٍ - حَدَّثَنَا مُعْتَمِرٌ، سَمِعْتُ أَبِي، حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَا بَيْنَ نَاحِيَتَيْ حَوْضِي كَمَا بَيْنَ صَنْعَاءَ وَالْمَدِينَةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13562,
                "hadithNumber": "5999",
                "englishNarrator": "Anas رضی اللہ عنہ reported:",
                "hadithEnglish": "They were not sure and they said: \"Or like the distance between Al-Madinah nd Amman.\" In the Hadith of Abu Awanah it says: \"The distance between two the sides of my Cistern.\"",
                "hadithUrdu": "مگر ان دونوں نے شک سے کام لیتے ہو ئے کہا : یا ( آپ صلی اللہ علیہ وسلم نے فر ما یا : ) \" مدینہ اور عمان کے درمیان کی مسافت کے مانند ( فاصلہ ہے ) \" اور ابو عوانہ کی حدیث میں یہ الفا ظ ہیں ۔ \" میرے حوض کے دونوں کناروں کے درمیان ۔",
                "urduNarrator": "ہم سے ہارون بن عبداللہ نے بیان کیا، ہم سے عبدالصمد نے بیان کیا، ہشام اور ابو عوانہ دونوں نے قتادہ نے حضرت انس رضی اللہ عنہ سے انھوں نے نبی صلی اللہ علیہ وسلم سے اسی کے مانندروایت کی",
                "hadithArabic": "وَحَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللهِ، حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا هِشَامٌ، وَحَدَّثَنَا حَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ، حَدَّثَنَا أَبُو عَوَانَةَ كِلَاهُمَا، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ، غَيْرَ أَنَّهُمَا شَكَّا فَقَالَا: أَوْ مِثْلَ مَا بَيْنَ الْمَدِينَةِ وَعَمَّانَ وَفِي حَدِيثِ أَبِي عَوَانَةَ «مَا بَيْنَ لَابَتَيْ حَوْضِي».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13563,
                "hadithNumber": "6000",
                "englishNarrator": "Anas رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) as saying: You would be shown in it jugs of gold and silver (as numerous) as the number of stars in the sky.",
                "hadithUrdu": "اللہ کے نبی صلی اللہ علیہ وسلم نے فر ما یا : \" اس میں آسمان کے ستاروں جتنی تعداد میں سونے چاندی کے کو زے ہیں ۔",
                "urduNarrator": "مجھ سے یحییٰ بن حبیب الحارثی  اور محمد بن عبداللہ الرزی نے بیان کیا، کہا: ہم سے خالد بن حارث نے بیان کیا، سعید نے قتادہ سے روایت کی ، انھوں نےکہا : حضرت انس رضی اللہ عنہ نے کہا کہ",
                "hadithArabic": "وحَدَّثَنِي يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، وَمُحَمَّدُ بْنُ عَبْدِ اللهِ الرُّزِّيُّ، قَالَا: حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، قَالَ: قَالَ أَنَسٌ: قَالَ نَبِيُّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «تُرَى فِيهِ أَبَارِيقُ الذَّهَبِ وَالْفِضَّةِ كَعَدَدِ نُجُومِ السَّمَاءِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 13251,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=530",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=528",
                "label": "528",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=529",
                "label": "529",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=530",
                "label": "530",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=531",
                "label": "531",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=532",
                "label": "532",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=533",
                "label": "533",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=534",
                "label": "534",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=532",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=532",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=530",
        "to": 13275,
        "total": 40465
    }
}