{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 526,
        "data": [
            {
                "id": 13414,
                "hadithNumber": "5851",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah' Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: When an Apostle from amongst the Apostles of Allah came to sit under a tree an ant bit him. He commanded his luggage to be removed from under the tree and he commanded it to be burnt in the fire and Allah revealed to him: Why one ant (which had bitten you) was not killed (and why did you burn the others)?",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" ( پہلے ) انبیاء علیہ السلام میں سے ایک نبی ایک درخت نیچے فروکش ہو ئے انھیں ایک چیونٹی نے کا ٹ لیا ، انھوں نے ان کی پوری آبادی کے بارے میں حکم دیا ، اسے نیچے سے ( کھودکر ) نکا ل لیا گیا ، پھر اس کے بارے میں حکم دیا تو اس ( پوریآبادی ) کو آگ سے جلا دیا گیا ۔ تو اللہ تعا لیٰ نے ان کی طرف وحی کی ، ( اس ایک ہی کو کیوں ( سزا ) نہ ( دی؟ ) \"",
                "urduNarrator": "ہم سے محمد بن رافع نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، کہا ہم سے معمر نے بیان کیا, ہمام بن منبہ نے کہا ,  یہ احادیث ہیں جو ہمیں حضرت ابو ہریرہ رضی اللہ عنہ نے نبی صلی اللہ علیہ وسلم سے بیان کیں ، پھر انھوں نے کچھ احادیث ذکر کیں ، ان میں سے ایک یہ ہے کہ",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ: هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَذَكَرَ أَحَادِيثَ مِنْهَا، وَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: نَزَلَ نَبِيٌّ مِنَ الْأَنْبِيَاءِ تَحْتَ شَجَرَةٍ، فَلَدَغَتْهُ نَمْلَةٌ، فَأَمَرَ بِجِهَازِهِ فَأُخْرِجَ مِنْ تَحْتِهَا، وَأَمَرَ بِهَا فَأُحْرِقَتْ فِي النَّارِ، قَالَ فَأَوْحَى اللهُ إِلَيْهِ: فَهَلَّا نَمْلَةً وَاحِدَةً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13415,
                "hadithNumber": "5852",
                "englishNarrator": "Nafi' reported from 'Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: A woman was punished because she had kept a cat tied until it died, and (as a punishment of this offence) she was thrown into the Hell. She had not provided it with food, or drink, and had not freed her so that she could eat the insects of the earth.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" ایک عورت کو بلی کے سبب سے عذاب دیا گیا ، اس نے بلی کو قید کر کے رکھا یہاں تک کہ وہ مر گئی ۔ وہ عورت اس کی وجہ سے جہنم میں چلی گئی ، اس عورت نے جب بلی کو قید کیا تو نہ اس کو کھلا یا پلا یا اور نہ اس کو چھوڑا ہی کہ وہ زمین کے اندر اور اوپر رہنے والے چھوٹے چھوٹے جانور کھا لیتی ۔",
                "urduNarrator": "مجھ سے عبداللہ بن محمد بن اسماء الضبعی نے بیان کیا, جویریہ بن اسماءنے نافع سے ، انھوں نے حضرت عبد اللہ ( بن عمر رضی اللہ عنہ ) سے روایت کی ، کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ الضُّبَعِيُّ، حَدَّثَنَا جُوَيْرِيَةُ بْنُ أَسْمَاءَ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللهِ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «عُذِّبَتِ امْرَأَةٌ فِي هِرَّةٍ سَجَنَتْهَا حَتَّى مَاتَتْ فَدَخَلَتْ فِيهَا النَّارَ، لَا هِيَ أَطْعَمَتْهَا وَسَقَتْهَا، إِذْ حَبَسَتْهَا، وَلَا هِيَ تَرَكَتْهَا تَأْكُلُ مِنْ خَشَاشِ الْأَرْضِ».",
                "headingArabic": "تَحْرِيمِ قَتْلِ الْهِرَّةِ ‏‏",
                "headingUrdu": "بلیوں کو مارنے کی ممانعت",
                "headingEnglish": "The Prohibition Of Killing Cats",
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13416,
                "hadithNumber": "5853",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Abu Huraira رضی اللہ عنہ through another chain of transmitters.",
                "hadithUrdu": "مجھ سے نصر بن علی الجہدمی نے بیان کیا، ہم سے عبد العلا نے بیان کیا، عبید اللہ بن عمر نے نافع سے اور انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی ، اسی طرح ( عبید اللہ بن عمر رضی اللہ تعالیٰ عنہ نے ) سعید مقبری سے اور انھوں نےحضرت ابو ہریرہ رضی اللہ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے اس حدیث کے ہم معنی حدیث روایت کی .",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِي نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا عَبْدُ الْأَعْلَى، عَنْ عُبَيْدِ اللهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، وَعَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ مَعْنَاهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13417,
                "hadithNumber": "5854",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been transmitted on the authority of Ibn 'Umar رضی اللہ عنہ also.",
                "hadithUrdu": "ہم سے ہارون بن عبداللہ اور عبداللہ بن جعفر نے معن بن عیسیٰ کی سند سے بیان کیا, مالک نے نافع سے ، انھوں نے حضرت ابن عمر رضی اللہ عنہ سے ، انھوں نے نبی صلی اللہ علیہ وسلم سے یہی روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَاهُ هَارُونُ بْنُ عَبْدِ اللهِ، وَعَبْدُ اللهِ بْنُ جَعْفَرٍ، عَنْ مَعْنِ بْنِ عِيسَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِذَلِكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13418,
                "hadithNumber": "5855",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: A woman was punished because of a cat. She had neither provided her with food nor drink, nor set her free so that she might eat the insects of the earth.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے فر ما یا : \" ایک عورت کو بلی کے معاملے میں عذاب دیا گیا ۔ اس عورت نے نہ اسے کھلا یا نہ پلا یا اور نہ اس کو چھوڑا کہ وہ زمین کے چھوٹے جا نور کھا لیتی ۔ \"",
                "urduNarrator": "ابو کریب نے ہم سے کہا, عبد ہ نے ہشام ( بن عروہ ) سے ، انھوں نے اپنےوالد سے ، انھوں نےحضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا عَبْدَةُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «عُذِّبَتِ امْرَأَةٌ فِي هِرَّةٍ، لَمْ تُطْعِمْهَا، وَلَمْ تَسْقِهَا، وَلَمْ تَتْرُكْهَا تَأْكُلُ مِنْ خَشَاشِ الْأَرْضِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13419,
                "hadithNumber": "5856",
                "englishNarrator": "Hisham narrated it with this chain narrators. In their Hadith it say, \"She tied it up\" . In the Hadith of Abu Mu'awiyah it says:",
                "hadithEnglish": "\"The insects of the earth.\"",
                "hadithUrdu": "\" حشرات الارض ( کھالیتی ) \".",
                "urduNarrator": "ابو کریب نے ہم سے کہا, ابو معاویہ اور خالد بن حارث نے ہمیں حدیث سنا ئی کہا : ہمیں ہشام نے اسی سند کے ساتھ حدیث بیان کی ، ان دونوں کی حدیث میں ہے : \" اس عورت نے اسےباندھ دیا ۔ \" اور ابومعاویہ کی حدیث میں ہے",
                "hadithArabic": "وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا هِشَامٌ، بِهَذَا الْإِسْنَادِ، وَفِي حَدِيثِهِمَا «رَبَطَتْهَا» وَفِي حَدِيثِ أَبِي مُعَاوِيَةَ «حَشَرَاتِ الْأَرْضِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13420,
                "hadithNumber": "5857",
                "englishNarrator": null,
                "hadithEnglish": "Abu Huraira رضی اللہ عنہ reported this hadith through another chain of transmitters.",
                "hadithUrdu": "مجھ سے محمد بن رافع نے کہا, حمید بن عبد الرحمٰن نے حضرت ابو ہریرہ رضی اللہ عنہ سے ، انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے ہشام کی اس حدیث کے ہم معنی روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ - قَالَ: عَبْدٌ أَخْبَرَنَا، وَقَالَ ابْنُ رَافِعٍ - حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، قَالَ: قَالَ الزُّهْرِيُّ: وَحَدَّثَنِي حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَى حَدِيثِ هِشَامِ بْنِ عُرْوَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13421,
                "hadithNumber": "5858",
                "englishNarrator": null,
                "hadithEnglish": "Hammam bin Manabbih reported this hadith on the authority of Abu Huraira رضی اللہ عنہ .",
                "hadithUrdu": "ہم سے محمد بن رافع نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، کہا ہم سے معمر نے بیان کیا , ہمام بن منبہ نے حضرت ابو ہریرہ رضی اللہ عنہ سے ، انھوں نے نبی صلی اللہ علیہ وسلم سے ، ان کی حدیث کی طرح روایت کی .",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَحْوَ حَدِيثِهِمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13422,
                "hadithNumber": "5859",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as sayings: A person suffered from intense thirst while on a journey, when he found a well. He climbed down into it and drank (water) and then came out and saw a dog lolling its tongue on account of thirst and eating the moistened earth. The person said: This dog has suffered from thirst as I had suffered from it. He climbed down into the well, filled his shoe with water, then caught it in his mouth until he climbed up and made the dog drink it. So Allah appreciated this act of his and pardoned him. Then (the Companions around him) said: Allah's Messenger, is there for us a reward even for (serving) such animals? He said: Yes, there is a reward for service to every living animal.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" ایک بار ایک شخص راستے میں چلا جا رہا تھا اس کو شدید پیاس لگی ، اسے ایک کنواں ملا وہ اس کنویں میں اترااورپانی پیا ، پھر وہ کنویں سے نکلا تو اس کے سامنے ایک کتا زور زور ہانپ رہا تھا پیاس کی وجہ سے کیچڑ چاٹ رہا تھا ، اس شخص نے ( دل میں ) کہا : یہ کتابھی پیاس سے اسی حالت کو پہنچا ہے جو میری ہو ئی تھی ۔ وہ کنویں میں اترا اور اپنے موزے کو پانی سے بھرا پھر اس کو منہ سے پکڑا یہاں تک کہ اوپر چڑھ آیا ، پھر اس نے کتے کو پانی پلا یا ۔ اللہ تعا لیٰ نے اسے اس نیکی کا بدلہ دیا اس کو بخش دیا ۔ \" لوگوں نے کہا : اللہ کے رسول صلی اللہ علیہ وسلم ! ہمارے لیے ان جانوروں میں اجرہے؟ تو آپ صلی اللہ علیہ وسلم نےفرمایا : \" نمی رکھنے والے ہر جگرمیں ( کسی بھی جاندار کا ہو ۔ ) اجرہے ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے مالک بن انس کی سند سے بیان کیا جو انہیں ابوبکر کی موکلہ سمیی رضی اللہ عنہا سے پڑھ کر سنایا گیا, ابو صالح سمان نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، فِيمَا قُرِئَ عَلَيْهِ عَنْ سُمَيٍّ، مَوْلَى أَبِي بَكْرٍ، عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «بَيْنَمَا رَجُلٌ يَمْشِي بِطَرِيقٍ اشْتَدَّ عَلَيْهِ الْعَطَشُ، فَوَجَدَ بِئْرًا، فَنَزَلَ فِيهَا فَشَرِبَ، ثُمَّ خَرَجَ فَإِذَا كَلْبٌ يَلْهَثُ يَأْكُلُ الثَّرَى مِنَ الْعَطَشِ، فَقَالَ الرَّجُلُ لَقَدْ بَلَغَ هَذَا الْكَلْبَ مِنَ الْعَطَشِ مِثْلُ الَّذِي كَانَ بَلَغَ مِنِّي، فَنَزَلَ الْبِئْرَ فَمَلَأَ خُفَّهُ مَاءً، ثُمَّ أَمْسَكَهُ بِفِيهِ حَتَّى رَقِيَ فَسَقَى الْكَلْبَ فَشَكَرَ اللهُ لَهُ فَغَفَرَ لَهُ» قَالُوا: يَا رَسُولَ اللهِ وَإِنَّ لَنَا فِي هَذِهِ الْبَهَائِمِ لَأَجْرًا؟ فَقَالَ: «فِي كُلِّ كَبِدٍ رَطْبَةٍ أَجْرٌ».",
                "headingArabic": "فَضْلِ سَاقِي الْبَهَائِمِ الْمُحْتَرَمَةِ وَإِطْعَامِهَا ‏‏",
                "headingUrdu": "ان جانوروں کو کھانا اور پانی دینے کی فضیلت جو کھانا حرام ہیں۔",
                "headingEnglish": "The Virtue Of Giving Food And Water To Animals Which Are Unlawful To Eat",
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13423,
                "hadithNumber": "5860",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger (ﷺ) as saying: A prostitute saw a dog moving around a well on a hot day and hanging out its tongue because of thirst. She drew water for it in her shoe and she was pardoned (for this act of hers).",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فر ما یا : \" ایک فاحشہ عورت نے ایک سخت گرم دن میں ایک کتا دیکھا جو ایک کنویں کے گردچکر لگا رہا تھا ۔ پیاس کی وجہ سے اس نے زبان باہر نکا لی ہو ئی تھی اس عورت نے اس کی خاطر اپنا موزہ اتارہ ( اور اس کے ذریعے پانی نکا ل کر اس کتے کو پلایا ) تو اس کو بخش دیا گیا ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے ابو خالد الاحمر نے بیان کیا, ہشام نے محمد ( بن سیرین ) سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے ، انھوں نےنبی صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ، عَنْ هِشَامٍ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَنَّ امْرَأَةً بَغِيًّا رَأَتْ كَلْبًا فِي يَوْمٍ حَارٍّ يُطِيفُ بِبِئْرٍ، قَدْ أَدْلَعَ لِسَانَهُ مِنَ الْعَطَشِ، فَنَزَعَتْ لَهُ بِمُوقِهَا فَغُفِرَ لَهَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13424,
                "hadithNumber": "5861",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: There was a dog moving around a well whom thirst would have killed. Suddenly a prostitute from the prostitutes of Bani Isra'il happened to see it and she drew water in her shoe and made it drink, and she was pardoned because of this.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" ایک کتا ایک ( گہرے ، کچے ) کنویں کے گرد چکر لگا رہا تھا اور پیاس کی شدت سے مرنے کے قریب تھا کہ بنی اسرا ئیل کی فاحشہ عورتوں میں سے ایک فاحشہ نے اس کو دیکھا تو اس نے اپنا موٹا موزاہ اتارا اور اس کے ذریعے سے اس ( کتے ) کے لیے پانی نکا لا اور وہ پانی اسے پلا یا تو اس بنا پر اس کو بخش دیا گیا ۔",
                "urduNarrator": "مجھ سے ابو الطاہر نے بیان کیا، کہا ہم سے عبداللہ بن وہب نے بیان کیا، مجھ سے جریر بن حازم نے بیان کیا, ایوب سختیانی نے محمد بن سیرین سے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، أَخْبَرَنِي جَرِيرُ بْنُ حَازِمٍ، عَنْ أَيُّوبَ السَّخْتِيَانِيِّ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «بَيْنَمَا كَلْبٌ يُطِيفُ بِرَكِيَّةٍ قَدْ كَادَ يَقْتُلُهُ الْعَطَشُ، إِذْ رَأَتْهُ بَغِيٌّ مِنْ بَغَايَا بَنِي إِسْرَائِيلَ فَنَزَعَتْ مُوقَهَا، فَاسْتَقَتْ لَهُ بِهِ، فَسَقَتْهُ إِيَّاهُ، فَغُفِرَ لَهَا بِهِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13425,
                "hadithNumber": "5862",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Allah, the Exalted and Glorious, said: The son of Adam abuses Dahr (the time), whereas I am Dahr since in My hand are the day and the night.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو کہتے ہو ئے سنا : \" اللہ تعالیٰ فر ما تا ہے ۔ ۔ ابن آدم دہر ( وقت ، زمانے ) کو برا کہتا ہے جبکہ ( رب ) دہر میں ہی ہوں ۔ رات اور دن ( جنھیں انسان وقت کہتا ہے ) میرے ہاتھ میں ہیں ۔ \"",
                "urduNarrator": "مجھ سے ابو الطاہر احمد بن عمرو بن سرح اور حرملہ بن یحییٰ نے بیان کیا، کہا کہ ہم سے ابن وہب نے بیان کیا، مجھ سے یونس نے بیان کیا، ابن کی سند سے, ابو سلمہ بن عبد الرحمٰن نے بتا یا کہ حضرت ابو ہریرہ رضی اللہ عنہ نے کہا",
                "hadithArabic": "وحَدَّثَنِي أَبُو الطَّاهِرِ أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ، وَحَرْمَلَةُ بْنُ يَحْيَى، قَالَا: أَخْبَرَنَا ابْنُ وَهْبٍ، حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ: قَالَ أَبُو هُرَيْرَةَ سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: قَالَ اللهُ عَزَّ وَجَلَّ: «يَسُبُّ ابْنُ آدَمَ الدَّهْرَ، وَأَنَا الدَّهْرُ بِيَدِيَ اللَّيْلُ وَالنَّهَارُ».",
                "headingArabic": "النَّهْىِ عَنْ سَبِّ الدَّهْرِ",
                "headingUrdu": "لعنت وقت کی ممانعت",
                "headingEnglish": "The Prohibition Of Cursing Time",
                "chapterId": "41",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 141,
                    "chapterNumber": "41",
                    "chapterEnglish": "The Book Concerning the use of Correct Words",
                    "chapterUrdu": "ادب اور دوسری باتوں (عقیدے اور انسانی رویوں) سے متعلق الفاظ",
                    "chapterArabic": "كتاب الْأَلْفَاظِ مِنْ الْأَدَبِ وَغَيْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13426,
                "hadithNumber": "5863",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Allah, the Exalted and Glorious, said: The son of Adam displeases Me by abusing Dahr (time), whereas I am Dahr--I alternate the night and the day.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" اللہ تعا لیٰ فر ما تا ہے ۔ ابن آدم مجھے ایذادیتا ہے ( نارا ض کرتا ہے ) وہ زمانے کو برا کہتا ہے جبکہ میں ہی ( رب ) دہرہوں ، را ت اور دن کو پلٹتا ہوں ۔ \"",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم اور ابن ابی عمر نے بیان کیا اور یہ قول ابن ابی عمر نے بیان کیا، انہوں نے ہمیں خبر دی اور ابن ابی عمر نے کہا, سفیان نے زہری سے حدیث بیان کی انھوں نے ابن مسیب سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سےروایت کی کہ",
                "hadithArabic": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ أَبِي عُمَرَ - وَاللَّفْظُ لِابْنِ أَبِي عُمَرَ، قَالَ إِسْحَاقُ، أَخْبَرَنَا وقَالَ ابْنُ أَبِي عُمَرَ - حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنِ ابْنِ الْمُسَيِّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: قَالَ اللهُ عَزَّ وَجَلَّ: «يُؤْذِينِي ابْنُ آدَمَ، يَسُبُّ الدَّهْرَ وَأَنَا الدَّهْرُ، أُقَلِّبُ اللَّيْلَ وَالنَّهَارَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "41",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 141,
                    "chapterNumber": "41",
                    "chapterEnglish": "The Book Concerning the use of Correct Words",
                    "chapterUrdu": "ادب اور دوسری باتوں (عقیدے اور انسانی رویوں) سے متعلق الفاظ",
                    "chapterArabic": "كتاب الْأَلْفَاظِ مِنْ الْأَدَبِ وَغَيْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13427,
                "hadithNumber": "5864",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Allah, the Exalted and Glorious, said: The son of Adam causes Me pain as he says: Woe be upon the Time. None of you should say this: Woe be upon the Time, as I am the Time (because) I alternate the day and the night, and when I wish I can finish them up.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" اللہ عزوجل نے ارشاد فر ما یا : ابن آدم مجھے ایذا دیتا ہے وہ کہتا ہے ۔ \" ہائے زمانے ( وقت ) کی نامرادی ! \" تم میں سے کو ئی \" ہائے زمانے کی نامرادی! \" ( جیسا جملہ ) نہ کہے ، کیونکہ دہر ( کا مالک ) میں ہوں ۔ رات اور دن کو پلٹتا ہوں اور میں جب چا ہوں گا ان کی بساط لپیٹ دو گا ۔ \"",
                "urduNarrator": "ہم سے عبد بن حمید نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا, معمرنے ہمیں زہری سے خبر دی انھوں نے ابن مسیب سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی ، : کہا",
                "hadithArabic": "وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنِ ابْنِ الْمُسَيِّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: قَالَ اللهُ عَزَّ وَجَلَّ: يُؤْذِينِي ابْنُ آدَمَ يَقُولُ: يَا خَيْبَةَ الدَّهْرِ فَلَا يَقُولَنَّ أَحَدُكُمْ: يَا خَيْبَةَ الدَّهْرِ فَإِنِّي أَنَا الدَّهْرُ، أُقَلِّبُ لَيْلَهُ وَنَهَارَهُ، فَإِذَا شِئْتُ قَبَضْتُهُمَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "41",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 141,
                    "chapterNumber": "41",
                    "chapterEnglish": "The Book Concerning the use of Correct Words",
                    "chapterUrdu": "ادب اور دوسری باتوں (عقیدے اور انسانی رویوں) سے متعلق الفاظ",
                    "chapterArabic": "كتاب الْأَلْفَاظِ مِنْ الْأَدَبِ وَغَيْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13428,
                "hadithNumber": "5865",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: None of you should say: Woe be upon the Time, for verily Allah is the Time.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" تم میں سے کو ئی شخص یہ نہ کہے کہ \" ہائے زمانے کی نامرادی! \" کیونکہ اللہ تعا لیٰ ہی زمانے ( کا مالک ) ہے ۔",
                "urduNarrator": "ہم سے قتیبہ نے بیان کیا، ہم سے المغیرہ بن عبدالرحمٰن نے بیان کیا، ابو الزناد سے, اعرج نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَقُولَنَّ أَحَدُكُمْ يَا خَيْبَةَ الدَّهْرِ، فَإِنَّ اللهَ هُوَ الدَّهْرُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "41",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 141,
                    "chapterNumber": "41",
                    "chapterEnglish": "The Book Concerning the use of Correct Words",
                    "chapterUrdu": "ادب اور دوسری باتوں (عقیدے اور انسانی رویوں) سے متعلق الفاظ",
                    "chapterArabic": "كتاب الْأَلْفَاظِ مِنْ الْأَدَبِ وَغَيْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13429,
                "hadithNumber": "5866",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Do not abuse Time, for it is Allah Who is the Time.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فر ما یا : \" زمانے کو برا مت کہو کیونکہ اللہ تعا لیٰ ہی زمانہ ( کا مالک ) ہے ۔ \"",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، ہم سے جریر نے ہشام کی سند سے بیان کیا, ابن سیرین نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی ، انھوں نے نبی صلی اللہ علیہ وسلم سے کہ",
                "hadithArabic": "وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ هِشَامٍ، عَنِ ابْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تَسُبُّوا الدَّهْرَ، فَإِنَّ اللهَ هُوَ الدَّهْرُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "41",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 141,
                    "chapterNumber": "41",
                    "chapterEnglish": "The Book Concerning the use of Correct Words",
                    "chapterUrdu": "ادب اور دوسری باتوں (عقیدے اور انسانی رویوں) سے متعلق الفاظ",
                    "chapterArabic": "كتاب الْأَلْفَاظِ مِنْ الْأَدَبِ وَغَيْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13430,
                "hadithNumber": "5867",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: None of you should abuse Time for it is Allah Who is the Time, and none of you should call 'Inab (grape) as al-karm, for karm is a Muslim person.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" تم میں سے کوئی شخص زمانے کو برا نہ کہے ، کیونکہ اللہ تعا لیٰ ہی زمانے ( کا مالک ) ہے اور تم میں سے کو ئی شخص عنب ( انگور اور اس کی بیل ) کو کرم نہ کہے ، کیونکہ کرم ( اصل ) میں مسلمان آدمی ہو تا ہے ۔ \"",
                "urduNarrator": "ہم سے حجاج بن الشاعر نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، کہا ہم سے معمر نے بیان کیا, ایوب نے ابن سیرین سے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ أَيُّوبَ، عَنِ ابْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يَسُبُّ أَحَدُكُمُ الدَّهْرَ، فَإِنَّ اللهَ هُوَ الدَّهْرُ وَلَا يَقُولَنَّ أَحَدُكُمْ لِلْعِنَبِ الْكَرْمَ، فَإِنَّ الْكَرْمَ الرَّجُلُ الْمُسْلِمُ».",
                "headingArabic": "كَرَاهَةِ تَسْمِيَةِ الْعِنَبِ كَرْمًا ‏‏",
                "headingUrdu": "انگور کو کرم کہنا ناپسندیدہ ہے۔",
                "headingEnglish": "It Is Disliked To Call Grapes Karm",
                "chapterId": "41",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 141,
                    "chapterNumber": "41",
                    "chapterEnglish": "The Book Concerning the use of Correct Words",
                    "chapterUrdu": "ادب اور دوسری باتوں (عقیدے اور انسانی رویوں) سے متعلق الفاظ",
                    "chapterArabic": "كتاب الْأَلْفَاظِ مِنْ الْأَدَبِ وَغَيْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13431,
                "hadithNumber": "5868",
                "englishNarrator": "Abu Huraira reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Do not use the word karm (for wine) for worthy of respect is the heart of a believer.",
                "hadithUrdu": "آپ نے فر ما یا : \" ( انگور اور اس کی بیل کو ) کرم نہ کہو ، کیونکہ ( حقیقت میں ) کرم مو من کا دل ہو تا ہے ۔ \"",
                "urduNarrator": "ہم سے عمروا لناقد اور ابن ابی عمر نے بیان کیا، کہا: ہم سے سفیان نے زہری کی سند سے بیان کیا، سعید نے حضرت ابو ہریرہ رضی اللہ عنہ سے ، انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ، کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، وَابْنُ أَبِي عُمَرَ، قَالَا: حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تَقُولُوا كَرْمٌ فَإِنَّ الْكَرْمَ، قَلْبُ الْمُؤْمِنِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "41",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 141,
                    "chapterNumber": "41",
                    "chapterEnglish": "The Book Concerning the use of Correct Words",
                    "chapterUrdu": "ادب اور دوسری باتوں (عقیدے اور انسانی رویوں) سے متعلق الفاظ",
                    "chapterArabic": "كتاب الْأَلْفَاظِ مِنْ الْأَدَبِ وَغَيْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13432,
                "hadithNumber": "5869",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Do not name grape as karm, for worthy of respect is a Muslim.",
                "hadithUrdu": "آپ نے فر مایا : \" ( ا انگور اور اس کی بیل ) کو کرم نہ کہو ، کیونکہ کرم ( اصل میں ) مسلمان آدمی ہو تا ہے ۔ \"",
                "urduNarrator": "ہم سے زہیر بن حرب نے بیان کیا، کہا ہم سے جریر نے بیان کیا, ہشا م نے ابن سیرین سے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ هِشَامٍ، عَنِ ابْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تُسَمُّوا الْعِنَبَ الْكَرْمَ، فَإِنَّ الْكَرْمَ الرَّجُلُ الْمُسْلِمُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "41",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 141,
                    "chapterNumber": "41",
                    "chapterEnglish": "The Book Concerning the use of Correct Words",
                    "chapterUrdu": "ادب اور دوسری باتوں (عقیدے اور انسانی رویوں) سے متعلق الفاظ",
                    "chapterArabic": "كتاب الْأَلْفَاظِ مِنْ الْأَدَبِ وَغَيْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13433,
                "hadithNumber": "5870",
                "englishNarrator": "Abu Huraira  رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: None of you should use the word al-harin (for grape) for the heart of a believer is karm (worthy of respect).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" تم میں سے کو ئی شخص ( انگور اور اس کی بیل کو ) کرم نہ کہے کیونکہ کرم تو مو من کا دل ہے ۔ \"",
                "urduNarrator": "ہم سے زہیر بن حرب نے بیان کیا، کہا ہم سے علی بن حفص نے بیان کیا، کہا ہم سے ورقہ نے بیان کیا، ابو الزناد سے, اعرج نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَلِيُّ بْنُ حَفْصٍ، حَدَّثَنَا وَرْقَاءُ، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يَقُولَنَّ أَحَدُكُمُ الْكَرْمُ، فَإِنَّمَا الْكَرْمُ قَلْبُ الْمُؤْمِنِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "41",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 141,
                    "chapterNumber": "41",
                    "chapterEnglish": "The Book Concerning the use of Correct Words",
                    "chapterUrdu": "ادب اور دوسری باتوں (عقیدے اور انسانی رویوں) سے متعلق الفاظ",
                    "chapterArabic": "كتاب الْأَلْفَاظِ مِنْ الْأَدَبِ وَغَيْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13434,
                "hadithNumber": "5871",
                "englishNarrator": "It was narrated that Hammam bin Munabbih said:",
                "hadithEnglish": "That is what Abu Hurairah رضی اللہ عنہ narrated to us from the Messenger of Allah ﷺ, and he mention a number of Ahadith, including the following: \"The Messenger of Allah ﷺ said: 'None of you should call grapes al-karm for 'Inab, for karm (worthy of respect) is a Muslim person.",
                "hadithUrdu": "یہ احا دیث ہیں جو ابو ہریرہ رضی اللہ عنہ نے ہمیں رسول اللہ صلی اللہ علیہ وسلم سے سنا ئیں ۔ انھوں نے کئی احادیث بیان کیں ان میں یہ بھی تھی  اور  رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : تم میں سے کو ئی شخص انگور اور اس کی بیل کو کرم نہ کہے ، کیونکہ کرم تو مسلمان آدمی ہو تا ہے ۔ \"",
                "urduNarrator": "ہم سے ابن رافع نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، ہم سے معمر نے بیان کیا, ہمام بن منبہ نے کہا",
                "hadithArabic": "وَحَدَّثَنَا ابْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ: هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ أَحَادِيثَ مِنْهَا، وَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يَقُولَنَّ أَحَدُكُمْ، لِلْعِنَبِ الْكَرْمَ، إِنَّمَا الْكَرْمُ الرَّجُلُ الْمُسْلِمُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "41",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 141,
                    "chapterNumber": "41",
                    "chapterEnglish": "The Book Concerning the use of Correct Words",
                    "chapterUrdu": "ادب اور دوسری باتوں (عقیدے اور انسانی رویوں) سے متعلق الفاظ",
                    "chapterArabic": "كتاب الْأَلْفَاظِ مِنْ الْأَدَبِ وَغَيْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13435,
                "hadithNumber": "5872",
                "englishNarrator": "Alqama bin Wa'il reported, from his father:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) having said: Do not say al-karm (for the word vine) but say al-habala (that is grape).",
                "hadithUrdu": "آپ نے فر ما یا : \" ( انگور اور اس کی بیل کو ) کرم نہ کہا کرو ۔ لیکن حبلہ کہہ لو ۔ \" آپ کی مراد انگور سے تھی ۔",
                "urduNarrator": "ہم سے علی بن خشرم نے بیان کیا, عیسیٰ بن یو نس نے شعبہ سے ، انھوں نے سماک بن حرب سے ، انھوں نے علقمہ بن وائل سے ، انھوں نے اپنے والد سے ، انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ، أَخْبَرَنَا عِيسَى يَعْنِي ابْنَ يُونُسَ، عَنْ شُعْبَةَ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ عَلْقَمَةَ بْنِ وَائِلٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: لَا تَقُولُوا: الْكَرْمُ، وَلَكِنْ قُولُوا الْحَبْلَةُ يَعْنِي الْعِنَبَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "41",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 141,
                    "chapterNumber": "41",
                    "chapterEnglish": "The Book Concerning the use of Correct Words",
                    "chapterUrdu": "ادب اور دوسری باتوں (عقیدے اور انسانی رویوں) سے متعلق الفاظ",
                    "chapterArabic": "كتاب الْأَلْفَاظِ مِنْ الْأَدَبِ وَغَيْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13436,
                "hadithNumber": "5873",
                "englishNarrator": "This hadith has been reported by Alqama bin Wa'il narrated from his father that the prophet ﷺ said:",
                "hadithEnglish": "\"Do not say Karm, rather say 'Inab and Hablah.",
                "hadithUrdu": "آپ نے فر ما یا : \" کرم نہ کہو عنب اور حبلہ ( انگور کی بیل ) کہہ لو ۔ \"",
                "urduNarrator": "مجھ سے زہیر بن حرب نے کہا,عثمان بن عمر نے کہا , ہمیں شعبہ نے سماک سے حدیث بیان کی ، انھوں نے کہا : میں نے علمقہ بن وائل سے سنا ، انھوں نے اپنے والد سے ، انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ، کہ",
                "hadithArabic": "وحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ سِمَاكٍ، قَالَ: سَمِعْتُ عَلْقَمَةَ بْنَ وَائِلٍ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تَقُولُوا الْكَرْمُ وَلَكِنْ قُولُوا الْعِنَبُ وَالْحَبْلَةُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "41",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 141,
                    "chapterNumber": "41",
                    "chapterEnglish": "The Book Concerning the use of Correct Words",
                    "chapterUrdu": "ادب اور دوسری باتوں (عقیدے اور انسانی رویوں) سے متعلق الفاظ",
                    "chapterArabic": "كتاب الْأَلْفَاظِ مِنْ الْأَدَبِ وَغَيْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13437,
                "hadithNumber": "5874",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: None of you should say: My bondman and my slave-girl, for all of you are the bondmen of Allah, and all your women are the slave-girls of Allah; but say: My servant, my girl, and my young man and my young girl.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" تم میں سے کو ئی شخص ( کسی کو ) میرا بندہ اور میری بندی نہ کہے ، تم سب اللہ کے بندے ہواور تمھا ری تمام عورتیں اللہ کی بندیاں ہیں ۔ البتہ یو ں کہہ سکتا ہے ۔ میرا لڑکا میری لڑکی ، میرا جوان ، خادم ، مری خادمہ \".",
                "urduNarrator": "ہم سے یحییٰ بن ایوب، قتیبہ اور ابن حجر نے بیان کیا، انہوں نے کہا: ہم سے اسماعیل نے جو ابن جعفر ہیں، انہوں نے العلا کی سند سے بیان کیا,لا ء کے والد نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ حُجْرٍ، قَالُوا: حَدَّثَنَا إِسْمَاعِيلُ وَهُوَ ابْنُ جَعْفَرٍ، عَنِ الْعَلَاءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَقُولَنَّ أَحَدُكُمْ عَبْدِي وَأَمَتِي كُلُّكُمْ عَبِيدُ اللهِ، وَكُلُّ نِسَائِكُمْ إِمَاءُ اللهِ، وَلَكِنْ لِيَقُلْ غُلَامِي وَجَارِيَتِي وَفَتَايَ وَفَتَاتِي».",
                "headingArabic": "حُكْمِ إِطْلاَقِ لَفْظَةِ الْعَبْدِ وَالأَمَةِ وَالْمَوْلَى وَالسَّيِّدِ ‏‏",
                "headingUrdu": "عبد اور امہ (غلاموں کے لیے) اور مولا اور سید (آقا کے لیے) کے الفاظ استعمال کرنے کا حکم",
                "headingEnglish": "Ruling On Using The Words 'Abd And Amah (For Slaves) And Mawla And Sayyid (For Masters)",
                "chapterId": "41",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 141,
                    "chapterNumber": "41",
                    "chapterEnglish": "The Book Concerning the use of Correct Words",
                    "chapterUrdu": "ادب اور دوسری باتوں (عقیدے اور انسانی رویوں) سے متعلق الفاظ",
                    "chapterArabic": "كتاب الْأَلْفَاظِ مِنْ الْأَدَبِ وَغَيْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13438,
                "hadithNumber": "5875",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: None of you should say: My bondman, for all of you are the bondmen of Allah, but say: My young man, and the servant should not say: My Lord, but should say: My chief.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \"\" تم میں سے کو ئی شخص ( کسی غلام کو ) میرا بندہ نہ کہے ، پس تم سب اللہ کے بندےہو ، البتہ یہ کہہ سکتا ہے ۔ میرا جوان اور نہ غلام یہ کہے : میرارب ( پالنے والا ) البتہ میرا سید ( آقا کہہ سکتا ہے )۔ \"\"",
                "urduNarrator": "مجھ سے زہیر بن حرب نے کہا, جریر اعمش سے ، انھوں نے ابو صالح سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنِ الْأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: لَا يَقُولَنَّ أَحَدُكُمْ: عَبْدِي، فَكُلُّكُمْ عَبِيدُ اللهِ، وَلَكِنْ لِيَقُلْ: فَتَايَ، وَلَا يَقُلِ الْعَبْدُ: رَبِّي، وَلَكِنْ لِيَقُلْ: سَيِّدِي.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "41",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 141,
                    "chapterNumber": "41",
                    "chapterEnglish": "The Book Concerning the use of Correct Words",
                    "chapterUrdu": "ادب اور دوسری باتوں (عقیدے اور انسانی رویوں) سے متعلق الفاظ",
                    "chapterArabic": "كتاب الْأَلْفَاظِ مِنْ الْأَدَبِ وَغَيْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 13126,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=525",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=523",
                "label": "523",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=524",
                "label": "524",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=525",
                "label": "525",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=526",
                "label": "526",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=527",
                "label": "527",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=528",
                "label": "528",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=529",
                "label": "529",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=527",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=527",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=525",
        "to": 13150,
        "total": 40465
    }
}