{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 576,
        "data": [
            {
                "id": 14664,
                "hadithNumber": "7103",
                "englishNarrator": "Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "I heard Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Verily, the Satan has lost all hopes that the worshippers would ever worship (him) in the peninsula of Arabia, but he (is hopeful) that he would sow the seed of dissension amongst them.",
                "hadithUrdu": "میں نے نبی صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : \" شیطان اس بات سے ناامید ہوگیا ہے کہ جزیر ہ عرب میں نماز پڑھنے والے اس کی عبادت کریں گے لیکن وہ ان کے درمیان لڑائی جھگڑے کرانے سے ( مایوس نہیں ہوا ۔ )",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ اور اسحاق بن ابراہیم نے بیان کیا۔ ہم سے اسحاق نے بیان کیا، اور عثمان نے کہا, جریر نےاعمش سے ، انھوں نے ابو سفیان سے اور انھوں نے حضرت جابر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ إِسْحَقُ أَخْبَرَنَا و قَالَ عُثْمَانُ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ الشَّيْطَانَ قَدْ أَيِسَ أَنْ يَعْبُدَهُ الْمُصَلُّونَ فِي جَزِيرَةِ الْعَرَبِ وَلَكِنْ فِي التَّحْرِيشِ بَيْنَهُمْ.",
                "headingArabic": "تَحْرِيشِ الشَّيْطَانِ وَبَعْثِهِ سَرَايَاهُ لِفِتْنَةِ النَّاسِ وَأَنَّ مَعَ كُلِّ إِنْسَانٍ قَرِينًا",
                "headingUrdu": "شیطان کی شرارت اور وہ کس طرح لوگوں کو فتنہ میں ڈالنے کے لیے اپنے لشکر بھیجتا ہے اور ہر شخص کے ساتھ ایک قارین ہوتا ہے (جنوں میں سے ایک ساتھی)",
                "headingEnglish": "The Mischief Of The Shaitan And How He Sends His Troops To Tempt People, And With Every Person There Is A Qarin (Companion From Among The Jinn)",
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14665,
                "hadithNumber": "7104",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of A'mash with the same chain of transmitters.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, وکیع اور ابو معاویہ دونوں نے اعمش سے اسی سند کے ساتھ حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ  و حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ كِلَاهُمَا عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14666,
                "hadithNumber": "7105",
                "englishNarrator": "Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "I heard Allah's Messenger (ﷺ) as saying: The throne of Iblis is upon the ocean and he sends detachments (to different parts) in order to put people to trial and the most important figure in his eyes is one who is most notorious in sowing the seed of dissension.",
                "hadithUrdu": "میں نے نبی صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : \" ابلیس کا تخت سمندرپر ہے ۔ وہ اپنے لشکر روانہ کرتا رہتا ہے تاکہ وہ فتنے برپا کریں ۔ اس کے نزدیک ( شیطنت کے ) درجے میں سب سے بڑا وہ ہے جو زیادہ بڑا فتنہ برپا کرے ۔ \"",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ اور اسحاق بن ابراہیم نے بیان کیا۔ ہم سے اسحاق نے بیان کیا، اور عثمان نے کہا, جریر اعمش سے ، انھوں نے ابو سفیان سے اور انھوں نے حضرت جابر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ إِسْحَقُ أَخْبَرَنَا و قَالَ عُثْمَانُ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ عَرْشَ إِبْلِيسَ عَلَى الْبَحْرِ فَيَبْعَثُ سَرَايَاهُ فَيَفْتِنُونَ النَّاسَ فَأَعْظَمُهُمْ عِنْدَهُ أَعْظَمُهُمْ فِتْنَةً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14667,
                "hadithNumber": "7106",
                "englishNarrator": "Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Iblis places his throne upon water; he then sends detachments (for creating dissension) ; the nearer to him in rank are those who are most notorious in creating dissension. One of them comes and says: I did so and so. And he says: You have done nothing. Then one amongst them comes and says: I did not spare so and so until I sowed the seed of discord between a husband and a wife. The Satan goes near him and says: You have done well. A'mash said: He then embraces him.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" ابلیس اپنا تخت پانی پر بچھاتا ہے پھر وہ اپنے لشکر روانہ کرتا ہے اس کے سب سے زیادہ قریب وہ ہوتا ہے جو سب سے بڑا فتنہ ڈالتا ہے ان میں سے ایک آکر کہتا ہے میں نے فلاں فلاں کا م کیا ہے ، وہ کہتا ہے ۔ تم نے کچھ نہیں کیا ، پھر ان میں سے ایک آکر کہتا ہے : میں نے اس شخص کو ( جس کے ساتھ میں تھا ) اس وقت تک نہیں چھوڑا ، یہاں تک کہ اس کے اور اس کی بیوی کے درمیان تفریق کرادی کہا : کہا : وہ اس کو اپنے قریب کرتا ہے اور کہتا ہے تم سب سے بہتر ہو ۔ \"\" اعمش نے کہا میراخیال ہے اس ( ابو سفیان طلحہ بن نافع ) نے کہا : \"\" پھر وہ اسے اپنے ساتھ لگالیتا ہے ۔ \"\"",
                "urduNarrator": "ہم سے ابو کریب محمد بن العلاء اور اسحاق بن ابراہیم نے بیان کیا، اور لفظ ابو کریب کا ہے۔ کہنے لگےابو معاویہ نے کہا ,  ہمیں اعمش نے ابو سفیان سے حدیث بیان کی ، انھوں نے حضرت جابر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ وَاللَّفْظُ لِأَبِي كُرَيْبٍ قَالَا أَخْبَرَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ إِبْلِيسَ يَضَعُ عَرْشَهُ عَلَى الْمَاءِ ثُمَّ يَبْعَثُ سَرَايَاهُ فَأَدْنَاهُمْ مِنْهُ مَنْزِلَةً أَعْظَمُهُمْ فِتْنَةً يَجِيءُ أَحَدُهُمْ فَيَقُولُ فَعَلْتُ كَذَا وَكَذَا فَيَقُولُ مَا صَنَعْتَ شَيْئًا قَالَ ثُمَّ يَجِيءُ أَحَدُهُمْ فَيَقُولُ مَا تَرَكْتُهُ حَتَّى فَرَّقْتُ بَيْنَهُ وَبَيْنَ امْرَأَتِهِ قَالَ فَيُدْنِيهِ مِنْهُ وَيَقُولُ نِعْمَ أَنْتَ قَالَ الْأَعْمَشُ أُرَاهُ قَالَ فَيَلْتَزِمُهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14668,
                "hadithNumber": "7107",
                "englishNarrator": "Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle (ﷺ) said: The Satan sends detachments of his own in order to put people to trial and the highest in rank, in his eyes, is one who is most notorious in sowing the seed of dissension.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \" شیطان اپنے لشکروں کو بھیجتا ہے اور وہ لوگوں کو فتنوں میں ڈالتے ہیں اس کے نزدیک ان میں سے بڑے مرتبے والا وہ ہو تا ہے جو زیادہ بڑا فتنہ ڈالتا ہے ۔ \"",
                "urduNarrator": "مجھ سے سلمہ بن شبیب نے بیان کیا، کہا ہم سے حسن بن عیان نے بیان کیا، ہم سے معقل نے بیان کیا, ابو زبیر نے حضرت جابر رضی اللہ عنہ سے روایت کی کہ انھوں نے نبی صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا",
                "hadithArabic": "حَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ حَدَّثَنَا مَعْقِلٌ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يَبْعَثُ الشَّيْطَانُ سَرَايَاهُ فَيَفْتِنُونَ النَّاسَ فَأَعْظَمُهُمْ عِنْدَهُ مَنْزِلَةً أَعْظَمُهُمْ فِتْنَةً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14669,
                "hadithNumber": "7108",
                "englishNarrator": "Abdullah bin Mas'ud رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: There is none amongst you with whom is not an attach from amongst the jinn (devil). They (the Companions) said: Allah's Messenger, with you too? Thereupon he said: Yes, but Allah helps me against him and so I am safe from his hand and he does not command me but for good.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم میں سے کو ئی شخص بھی نہیں مگر اللہ نے اس کے ساتھ جنوں میں سے اس کا ایک ساتھی مقرر کردیا ہے ( جو اسے برائی کی طرف مائل رہتا ہے ۔ ) \" انھوں ( صحابہ کرام رضوان اللہ عنھم اجمعین ) نے کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! آپ کے ساتھ بھی؟ آپ صلی اللہ علیہ وسلم نے فرمایا : \" اور میرے ساتھ بھی لیکن اللہ تعالیٰ نے اس کے مقابلے میں میری مدد فرمائی ہے اور وہ مسلمان ہوگیا ، اس لیے ( اب ) وہ مجھے خیر کے سواکوئی بات نہیں کہتا ۔ \"",
                "urduNarrator": "عثمان بن ابی شیبہ اور اسحٰق بن ابراہیم نے کہا : ہمیں جریر نے منصور سے حدیث بیان کی ، انھوں نے سالم بن ابی جعد سے ، انھوں نےاپنے والد سے اور انھوں نےحضرت عبد اللہ بن مسعود رضی اللہ عنہ سے روایت کی کہا",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ إِسْحَقُ أَخْبَرَنَا و قَالَ عُثْمَانُ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْكُمْ مِنْ أَحَدٍ إِلَّا وَقَدْ وُكِّلَ بِهِ قَرِينُهُ مِنْ الْجِنِّ قَالُوا وَإِيَّاكَ يَا رَسُولَ اللَّهِ قَالَ وَإِيَّايَ إِلَّا أَنَّ اللَّهَ أَعَانَنِي عَلَيْهِ فَأَسْلَمَ فَلَا يَأْمُرُنِي إِلَّا بِخَيْرٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14670,
                "hadithNumber": "7109",
                "englishNarrator": "A similar Hadith (as no. 7108) was narrated from Mansur with this chin of Jarir, but in the Hadith of Sufyan it says:",
                "hadithEnglish": "\"There is appointed over him his companion from among the jinn nd his companion from among the angels.",
                "hadithUrdu": "\" ہر شخص کے لیے ایک ساتھی جنوں میں سے اور ایک ساتھی فرشتوں میں سے مقرر کر دیاہے ۔ ( جن اسے برائی کی طرف مائل کرتا ہے اور فرشتہ نیکی کی طرف ۔ فیصلہ خود اسی کو کرنا ہوتا ہے ۔ )",
                "urduNarrator": "ہم سے ابن المثنیٰ اور ابن بشار نے بیان کیا: ہم سے عبدالرحمٰن یعنی ابن مہدی نے بیان کیا, سفیان اور عمار بن رزیق دونوں نے منصور سے جریر کی سند کے ساتھ انھی کی حدیث کے مانند روایت کی ، مگر سفیان کی حدیث میں ہے",
                "hadithArabic": "حَدَّثَنَا ابْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا عَبْدُ الرَّحْمَنِ يَعْنِيَانِ ابْنَ مَهْدِيٍّ عَنْ سُفْيَانَ و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ عَنْ عَمَّارِ بْنِ رُزَيْقٍ كِلَاهُمَا عَنْ مَنْصُورٍ بِإِسْنَادِ جَرِيرٍ مِثْلَ حَدِيثِهِ غَيْرَ أَنَّ فِي حَدِيثِ سُفْيَانَ وَقَدْ وُكِّلَ بِهِ قَرِينُهُ مِنْ الْجِنِّ وَقَرِينُهُ مِنْ الْمَلَائِكَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14671,
                "hadithNumber": "7110",
                "englishNarrator": "A'isha رضی اللہ عنہا the wife of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) reported:",
                "hadithEnglish": "One day Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came out of her (apartment) during the night and she felt jealous. Then he came and he saw me (in what agitated state of mind) I was. He said: A'isha رضی اللہ عنہا , what has happened to you? Do you feel jealous? Thereupon she said: How can it be (that a woman like me) should not feel jealous in regard to a husband like you. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: It was your devil who had come to you, and she said: Allah's Messenger, is there along with me a devil? He said: Yes. I said: Is a devil attached to everyone? He said: Yes. I (Aisha) again said: Allah's Messenger, is it with you also? He said: Yes, but my Lord has helped me against him and as such I am absolutely safe from his mischief.",
                "hadithUrdu": "مجھے آپ کے معاملے میں شدید غیرت محسوس ہوئی ، پھر آپ واپس آئے اور دیکھا کہ میں کیا کر رہی ہوں ( شدید غصے کے عالم میں ہوں ) تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" عائشہ رضی اللہ تعالیٰ عنہا !تمھیں کیاہوا ہے کیا تم غیرت میں مبتلا ہو گئی ہو؟ \" میں نے کہا : مجھے کیا ہوا ہے کہ مجھ جیسی عورت کو ( جس کی کئی سو کنیں ہوں ) آپ جیسے مرد پر ( جو ایک کو ایک سے بڑھ کر محبوب ہو ) غیرت نہ آئے \" تورسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کیا تمھارے پاس تمھارا شیطان آیا تھا ( اور اس نے تمھیں شک میں مبتلا کیا؟ ) \" ( حضرت عائشہ رضی اللہ عنہ نے ) کہا : اللہ کے رسول صلی اللہ علیہ وسلم !کیا میرے ساتھ شیطان بھی ہے؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" ہاں ۔ \" میں نے کہا : ہر انسان کے ساتھ شیطان ہوتا ہے؟ آپ نے فرمایا : \" ہاں ۔ \" میں نے کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم !آپ کے ساتھ بھی ہے؟آپ نے فرمایا : \" ہاں لیکن میرے رب نے اس پر ( قابو پانے میں ) میری مددفرمائی اور وہ اسلام لے آیا ہے ۔ \"",
                "urduNarrator": "مجھ سے ہارون بن سعید الایلی نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، مجھ سے ابو صخر نے، ابن قصیط کی سند سے، انہوں نے ان سے بیان کیا, عروہ نے کہا : نبی صلی اللہ علیہ وسلم کی اہلیہ حضرت عائشہ رضی اللہ عنہا نے انھیں حدیث بیان کی کہ رسول اللہ صلی اللہ علیہ وسلم ایک رات ان کے پاس سے اٹھ کر باہر نکل گئے ۔ ( حضرت عائشہ رضی اللہ تعالیٰ عنہا نے ) کہا",
                "hadithArabic": "حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي أَبُو صَخْرٍ عَنْ ابْنِ قُسَيْطٍ حَدَّثَهُ أَنَّ عُرْوَةَ حَدَّثَهُ أَنَّ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَتْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ مِنْ عِنْدِهَا لَيْلًا قَالَتْ فَغِرْتُ عَلَيْهِ فَجَاءَ فَرَأَى مَا أَصْنَعُ فَقَالَ مَا لَكِ يَا عَائِشَةُ أَغِرْتِ فَقُلْتُ وَمَا لِي لَا يَغَارُ مِثْلِي عَلَى مِثْلِكَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقَدْ جَاءَكِ شَيْطَانُكِ قَالَتْ يَا رَسُولَ اللَّهِ أَوْ مَعِيَ شَيْطَانٌ قَالَ نَعَمْ قُلْتُ وَمَعَ كُلِّ إِنْسَانٍ قَالَ نَعَمْ قُلْتُ وَمَعَكَ يَا رَسُولَ اللَّهِ قَالَ نَعَمْ وَلَكِنْ رَبِّي أَعَانَنِي عَلَيْهِ حَتَّى أَسْلَمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14672,
                "hadithNumber": "7111",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: None amongst you would attain salvation purely because of his deeds. A person said: Allah's Messenger, even you? Thereupon he said: Yes, not even I except that Allah wraps me in Mercy, but you should act with moderation.",
                "hadithUrdu": "آپ نے فرمایا : \" تم میں سے کسی شخص کو محض اس کا عمل نجات نہیں دلائے گا ۔ \" ایک شخص نے کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم !آپ کو بھی نہیں؟آپ نے فرمایا : \" مجھے بھی نہیں مگر یہ کہ اللہ تعالیٰ اپنی طرف سے مجھے اپنی رحمت سے چھپالے ، لیکن تم سیدھے راستے پر چلو ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, لیث نے بکیر سے انھوں نے بسربن سعید سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے اور انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ عَنْ بُكَيْرٍ عَنْ بُسْرِ بْنِ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ لَنْ يُنْجِيَ أَحَدًا مِنْكُمْ عَمَلُهُ قَالَ رَجُلٌ وَلَا إِيَّاكَ يَا رَسُولَ اللَّهِ قَالَ وَلَا إِيَّايَ إِلَّا أَنْ يَتَغَمَّدَنِيَ اللَّهُ مِنْهُ بِرَحْمَةٍ وَلَكِنْ سَدِّدُوا.",
                "headingArabic": "لَنْ يَدْخُلَ أَحَدٌ الْجَنَّةَ بِعَمَلِهِ بَلْ بِرَحْمَةِ اللَّهِ تَعَالَى ‏‏",
                "headingUrdu": "جنت میں کوئی اپنے عمل کی وجہ سے نہیں جائے گا، بلکہ اللہ کی رحمت سے، وہ بہت بلند ہے۔",
                "headingEnglish": "No One Will Enter Paradise By Virtue Of His Deeds, Rather By The Mercy Of Allah, Exalted Is He",
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14673,
                "hadithNumber": "7112",
                "englishNarrator": "It was narrated from Bukair bin al-Ashajj with this chain (a Hadith similar to no. 7111), except that he said:",
                "hadithEnglish": "\"... with his mercy and grace.\" And he did not mention (the words): \"But aims to do good.\"",
                "hadithUrdu": "\" اور لیکن تم سیدھے راستے پر چلو ۔ \" بیان نہیں کیا ۔",
                "urduNarrator": "مجھ سے یونس بن عبد الا علی الصدفی نے بیان کیا، ہم سے عبداللہ بن وہب نے بیان کیا, عمرو بن حارث نے بکیر بن اشج سے اسی سند کے ساتھ روایت کی مگر ( اس میں ) کہا : \" اپنی رحمت اور فضل سے \" اور انھوں نے",
                "hadithArabic": "و حَدَّثَنِيهِ يُونُسُ بْنُ عَبْدِ الْأَعْلَى الصَّدَفِيُّ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ عَنْ بُكَيْرِ بْنِ الْأَشَجِّ بِهَذَا الْإِسْنَادِ غَيْرَ أَنَّهُ قَالَ بِرَحْمَةٍ مِنْهُ وَفَضْلٍ وَلَمْ يَذْكُرْ وَلَكِنْ سَدِّدُوا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14674,
                "hadithNumber": "7113",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: There is none whose deeds alone would entitle him to get into Paradise. It was said to him: And, Allah's Messenger, not even you? Thereupon he said: Not even I, but that my Lord wraps me in Mercy.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے فرمایا : \" تم میں سے کسی شخص کو اس کا عمل جنت میں نہیں لے جائے گا ۔ \" پوچھا گیا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! آپ کو بھی نہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا : \" مجھے بھی نہیں مگر یہ کہ میرا رب مجھے اپنی رحمت میں چھپالے ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا,  ہم سے حماد نے بیان کیا، یعنی ہم سے ابن زید نے بیان کیا, ایوب نے محمد ( بن سیرین ) اسے اور انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی  کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ عَنْ أَيُّوبَ عَنْ مُحَمَّدٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا مِنْ أَحَدٍ يُدْخِلُهُ عَمَلُهُ الْجَنَّةَ فَقِيلَ وَلَا أَنْتَ يَا رَسُولَ اللَّهِ قَالَ وَلَا أَنَا إِلَّا أَنْ يَتَغَمَّدَنِي رَبِّي بِرَحْمَةٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14675,
                "hadithNumber": "7114",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: There is none amongst you whose deeds alone would attain salvation for him. They (the Companions) said: Allah's Messenger, not even you? He (the Holy Prophet) said: Not even I, but that Allah wraps me in Mercy and He grants me pardon. Ibn 'Aun pointed towards his head with his hand saying: Not even I, but that Allah wraps me in His Forgiveness and Mercy.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے فرمایا : \" تم میں سے کسی شخص کو اس کا عمل نجات نہیں دلائے گا ۔ \" صحابہ کرام رضوان اللہ عنھم اجمعین نے عرض کی ، اللہ کے رسول اللہ صلی اللہ علیہ وسلم !آپ کو بھی نہیں؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" مجھے بھی نہیں مگر یہ کہ اللہ تعالیٰ مجھے اپنی رحمت اور مغفرت میں چھپالے ۔ \" اور ابن عون نے اس طرح اپنے ہاتھ سے بتایا اور اپنے سرکی طرف ( رحمت سے ڈھانپ لینےکا ) اشارہ کیا ( فرمایا ) \" اور مجھے بھی نہیں مگر یہ کہ اللہ مجھے ( اس طرح ) اپنی رحمت اور مغفرت سے ڈھانپ لے ۔ \"",
                "urduNarrator": "ہم سے محمد بن مثنیٰ نے بیان کیا, ابن عون نے محمد ( بن سیرین ) سے اور انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ ابْنِ عَوْنٍ عَنْ مُحَمَّدٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ أَحَدٌ مِنْكُمْ يُنْجِيهِ عَمَلُهُ قَالُوا وَلَا أَنْتَ يَا رَسُولَ اللَّهِ قَالَ وَلَا أَنَا إِلَّا أَنْ يَتَغَمَّدَنِيَ اللَّهُ مِنْهُ بِمَغْفِرَةٍ وَرَحْمَةٍ وَقَالَ ابْنُ عَوْنٍ بِيَدِهِ هَكَذَا وَأَشَارَ عَلَى رَأْسِهِ وَلَا أَنَا إِلَّا أَنْ يَتَغَمَّدَنِيَ اللَّهُ مِنْهُ بِمَغْفِرَةٍ وَرَحْمَةٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14676,
                "hadithNumber": "7115",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: There is none whose deeds alone can'secure salvation for him. They said: Allah's Messenger, not even you? Thereupon he said: Not even I, but that, the Mercy of Allah should take hold of me.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کسی کو اس کا عمل نجات نہیں دلائے گا ۔ \" انھوں ( صحابہ کرام رضوان اللہ عنھم اجمعین ) نے کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم !آپ کو بھی نہیں ؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" مجھے بھی نہیں مگر یہ کہ اللہ تعالیٰ مجھے اپنی رحمت میں لے لے ۔ \"",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے جریر نے بیان کیا, سہیل کے والد ( ابو صالح ) نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ أَحَدٌ يُنْجِيهِ عَمَلُهُ قَالُوا وَلَا أَنْتَ يَا رَسُولَ اللَّهِ قَالَ وَلَا أَنَا إِلَّا أَنْ يَتَدَارَكَنِيَ اللَّهُ مِنْهُ بِرَحْمَةٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14677,
                "hadithNumber": "7116",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: None amongst you can get. into Paradise by virtue of his deeds alone. They said: Allah's Messenger, not even you? Thereupon he said: Not even I, but that Allah should wrap me in His Grace and Mercy.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم میں سے کسی شخص کو اس کا عمل جنت میں نہیں لے جائے گا ۔ \" انھوں ( صحابہ کرام رضوان اللہ عنھم اجمعین نے عرض کی ، اللہ کے رسول اللہ صلی اللہ علیہ وسلم !آپ کو بھی نہیں؟ آپ نے فرمایا : \" مجھے بھی نہیں مگر یہ کہ اللہ تعالیٰ مجھے اپنے فضل اور رحمت سے ڈھانپ لے ۔ \"",
                "urduNarrator": "مجھ سے محمد بن حاتم نے بیان کیا، کہا ہم سے ابو عباد یحییٰ بن عباد نے بیان کیا، کہا ہم سے ابراہیم بن سعد نے بیان کیا، کہا ہم سے ابن شہاب نے بیان کیا، وہ ابو عبید کی سند سے جو حضرت عبدالرحمٰن بن عوف رضی اللہ عنہ کے آزاد کردہ غلام ابو عبید نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا أَبُو عَبَّادٍ يَحْيَى بْنُ عَبَّادٍ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ حَدَّثَنَا ابْنُ شِهَابٍ عَنْ أَبِي عُبَيْدٍ مَوْلَى عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَنْ يُدْخِلَ أَحَدًا مِنْكُمْ عَمَلُهُ الْجَنَّةَ قَالُوا وَلَا أَنْتَ يَا رَسُولَ اللَّهِ قَالَ وَلَا أَنَا إِلَّا أَنْ يَتَغَمَّدَنِيَ اللَّهُ مِنْهُ بِفَضْلٍ وَرَحْمَةٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14678,
                "hadithNumber": "7117",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Observe moderation in deeds (and if it is not possible, try to be near moderation) and understand that none amongst you can attain salvation because of his deeds alone. They said: Allah's Messenger, not even you? Thereupon he said: Not even I, but that Allah should wrap me in His Mercy and Grace.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ( عمل کے اعلیٰ ترین معیار کے ) قریب تر رہنے کی کوشش کرو ۔ صحیح راستہ اختیار کرو اور یقین رکھو کہ تم میں سے کسی شخص کو اس کا عمل نجات نہیں دے گا ۔ \" انھوں نے ( صحابہ کرام رضوان اللہ عنھم اجمعین ) نے عرض کی ، اللہ کے رسول اللہ صلی اللہ علیہ وسلم !آپ کو بھی نہیں؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" مجھے بھی نہیں مگر یہ کہ اللہ تعالیٰ مجھے اپنی رحمت اور فضل سے ڈھانپ لے ۔ \"",
                "urduNarrator": "محمد بن عبد اللہ بن نمیر نے ہمیں حدیث بیان کی ، کہا : ہمیں میرے والد نے حدیث بیان کی ، کہا : ہمیں اعمش نے ابو صالح سے حدیث بیان کی ، انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَارِبُوا وَسَدِّدُوا وَاعْلَمُوا أَنَّهُ لَنْ يَنْجُوَ أَحَدٌ مِنْكُمْ بِعَمَلِهِ قَالُوا يَا رَسُولَ اللَّهِ وَلَا أَنْتَ قَالَ وَلَا أَنَا إِلَّا أَنْ يَتَغَمَّدَنِيَ اللَّهُ بِرَحْمَةٍ مِنْهُ وَفَضْلٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14679,
                "hadithNumber": "7118",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Jabir رضی اللہ عنہ through another chain of transmitters.",
                "hadithUrdu": "ابن نمیر نے ہمیں حدیث بیان کی ، انھوں نے کہا : ہمیں میرے والد نے حدیث سنائی ، انھوں نے کہا : ہمیں اعمش نے ابو سفیان سے ، انھوں نے حضرت جابر رضی اللہ عنہ سے روایت کی ، انھوں نے نبی صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14680,
                "hadithNumber": "7119",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been narrated on the authority of A'mash through two other chains of transmitters. The wording is, however, the same.",
                "hadithUrdu": "ہم سے اسحاق بن ابراہیم نے بیان کیا, جریر نے اعمش سے گزشتہ دونوں سندوں کے ساتھ ابن نمیر کی روایت کی طرح بیان کیا ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ بِالْإِسْنَادَيْنِ جَمِيعًا كَرِوَايَةِ ابْنِ نُمَيْرٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14681,
                "hadithNumber": "7120",
                "englishNarrator": "This hadith has been narrated on the authority of Abu Huraira رضی اللہ عنہ through another chain of transmitters with this addition:",
                "hadithEnglish": "Give them glad tidings .",
                "hadithUrdu": "\" اور خوش خبری لو ۔ \" ( کہ اس کی رحمت بہت وسیع ہے ، اچھے عمل قبول ہو جائیں گے ۔ ) \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا, ابو معاویہ نے اعمش سے انھوں نے ابو صالح سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی اور اس میں مزید کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ وَزَادَ وَأَبْشِرُوا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14682,
                "hadithNumber": "7121",
                "englishNarrator": "Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "I heard Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: None of you would get into Paradise because of his good deeds alone, and he would not be rescued from Fire, not even I, but because of the Mercy of Allah.",
                "hadithUrdu": "میں نےنبی صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : \" تم میں سے کسی شخص کو اس کا عمل نہ جنت میں لے جائے گا ۔ نہ دوزخ سے محفوظ رکھے گا اور نہ مجھے سوائے اللہ کی طرف سے رحمت کے ( جو نجات کا سبب بنے گی ۔ ) \"",
                "urduNarrator": "مجھ سے سلمہ بن شبیب نے بیان کیا، کہا ہم سے حسن بن اعین نے بیان کیا، ہم سے معقل نے بیان کیا, ابو زبیر نے حضرت جابر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ حَدَّثَنَا مَعْقِلٌ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يُدْخِلُ أَحَدًا مِنْكُمْ عَمَلُهُ الْجَنَّةَ وَلَا يُجِيرُهُ مِنْ النَّارِ وَلَا أَنَا إِلَّا بِرَحْمَةٍ مِنْ اللَّهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14683,
                "hadithNumber": "7122",
                "englishNarrator": "A'isha رضی اللہ عنہا the wife of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) used to say: Observe moderation (in doing deeds), and if you fail to observe it perfectly, try to do as much as you can do (to live up to this ideal of moderation) and be happy for none would be able to get into Paradise because of his deeds alone. They (the Companions of the Holy Prophet) said: Allah's Messenger, not even you? Thereupon he said: Not even I, but that Allah wraps me in His Mercy, and bear this in mind that the deed loved most by Allah is one which is done constantly even though it is small.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" صحیح عمل کرو ( اعلی ترین معیار کے ) قریب تر رہواور ( اللہ کی رحمت کی ) خوش خبری ( کی امید ) رکھو ۔ حقیقت یہی ہے کہ کسی کو اس کا عمل ہر گز جنت میں داخل نہیں کرے گا ۔ \" صحابہ کرام رضوان اللہ عنھم اجمعین نے کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم !آپ کو بھی نہیں؟فرمایا : \" مجھے بھی نہیں الایہ کہ اللہ مجھے اپنی رحمت سے ڈھانپ لے اور جان رکھو کہ اللہ کے نزدیک محبوب ترین عمل وہ ہے جو ہمیشہ کیا جائے چاہے کم ہو ۔ \"",
                "urduNarrator": "اور ہم سے اسحاق بن ابراہیم نے بیان کیا, عبد العزیزبن محمد اور وہیب نے کہا : ہمیں موسیٰ بن عقبہ نے حدیث بیان کی انھوں نے کہا : میں نے ابو سلمہ بن عبد الرحمٰن بن عوف کو حضرت عائشہ رضی اللہ عنہا سے حدیث بیان کرتے ہوئے سنا ، وہ کہا کرتی تھیں کہ",
                "hadithArabic": "و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ أَخْبَرَنَا مُوسَى بْنُ عُقْبَةَ و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ وَاللَّفْظُ لَهُ حَدَّثَنَا بَهْزٌ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ قَالَ سَمِعْتُ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ يُحَدِّثُ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهَا كَانَتْ تَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَدِّدُوا وَقَارِبُوا وَأَبْشِرُوا فَإِنَّهُ لَنْ يُدْخِلَ الْجَنَّةَ أَحَدًا عَمَلُهُ قَالُوا وَلَا أَنْتَ يَا رَسُولَ اللَّهِ قَالَ وَلَا أَنَا إِلَّا أَنْ يَتَغَمَّدَنِيَ اللَّهُ مِنْهُ بِرَحْمَةٍ وَاعْلَمُوا أَنَّ أَحَبَّ الْعَمَلِ إِلَى اللَّهِ أَدْوَمُهُ وَإِنْ قَلَّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14684,
                "hadithNumber": "7123",
                "englishNarrator": "This hadith has been narrated on the authority of Musa bin `Uqba with the same chain of transmitters and he did not make a mention of:",
                "hadithEnglish": "\"Be happy.\"",
                "hadithUrdu": "\" خوش خبری ( کی امید ) رکھو \" ذکر نہیں کیا ۔",
                "urduNarrator": "اور ہم سے حسن الحلوانی نے بیان کیا : ہم سے یعقوب بن ابراہیم بن سعد نے بیان کیا ,عبد العزیز بن مطلب نے ہمیں موسیٰ بن عقبہ سے اسی سند کے ساتھ حدیث بیان کی اور",
                "hadithArabic": "و حَدَّثَنَاه حَسَنٌ الْحُلْوَانِيُّ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْمُطَّلِبِ عَنْ مُوسَى بْنِ عُقْبَةَ بِهَذَا الْإِسْنَادِ وَلَمْ يَذْكُرْ وَأَبْشِرُوا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14685,
                "hadithNumber": "7124",
                "englishNarrator": "Mughira bin Shu'ba رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) worshipped so much that his feet were swollen. It was said to him: (Why do you undergo so much hardship despite the fact that) Allah has pardoned for you your earlier and later sins? Thereupon he said: May I not (prove myself) to be a grateful servant (of Allah)?",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے اتنی ( اتنی لمبی ) نمازیں پڑھیں کہ آپ کے قدم مبارک سوج گئے ۔ آپ سے کہاگیا کہ آپ اس قدر تکلیف اٹھاتے ہیں؟حالانکہ اللہ تعالیٰ نے آپ کے اگلے اور پچھلےگناہوں کی مغفرت فرمادی ہے ، آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" کیا میں اللہ تعالیٰ کا شکرگزار بندہ نہ بنوں ؟ \"\"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, ابو عوانہ نے زیاد بن علاقہ سے اور انھوں نے حضرت مغیرہ بن شعبہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ زِيَادِ بْنِ عِلَاقَةَ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى حَتَّى انْتَفَخَتْ قَدَمَاهُ فَقِيلَ لَهُ أَتَكَلَّفُ هَذَا وَقَدْ غَفَرَ اللَّهُ لَكَ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ فَقَالَ أَفَلَا أَكُونُ عَبْدًا شَكُورًا.",
                "headingArabic": "إِكْثَارِ الأَعْمَالِ وَالاِجْتِهَادِ فِي الْعِبَادَةِ ‏‏",
                "headingUrdu": "بہت زیادہ نیک اعمال کرنا اور عبادت میں سخت محنت کرنا",
                "headingEnglish": "Doing A Lot Of Good Deeds And Striving Hard In Worship",
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14686,
                "hadithNumber": "7125",
                "englishNarrator": "This hadith has been transmitted on the authority of Mughira bin Shu'ba رضی اللہ عنہ and the words are:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) kept standing in prayer (for such long hours) that his feet were swollen. They (his Companions) said: Verily, Allah has pardoned for thee the earlier and the later of thine sins. Thereupon he said: Should I not prove myself to be a grateful servant (of Allah)?",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے اتنا ( اتنا لمبا ) قیام کیا کہ آپ کے قدم مبارک سوج گئے ۔ انھوں ( صحابہ کرام رضوان اللہ عنھم اجمعین ) نے کہا : اللہ تعالیٰ نے آپ کے اگلے پچھلےتمام گناہ معافکردیے ہیں ( پھر اس قدر مشقت کیوں؟ ) تو آپ نے فرمایا : \" کیا میں اللہ کا شکرگزار بندہ نہ بنوں؟",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابن نمیر نے بیان کیا, سفیان نے ہمیں زیاد بن علاقہ سے حدیث بیان کی ، انھوں نے حضرت مغیرہ بن شعبہ رضی اللہ عنہ کو کہتے ہوئے سنا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَابْنُ نُمَيْرٍ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ زِيَادِ بْنِ عِلَاقَةَ سَمِعَ الْمُغِيرَةَ بْنَ شُعْبَةَ يَقُولُ قَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى وَرِمَتْ قَدَمَاهُ قَالُوا قَدْ غَفَرَ اللَّهُ لَكَ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ قَالَ أَفَلَا أَكُونُ عَبْدًا شَكُورًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14687,
                "hadithNumber": "7126",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "When Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) occupied himself in prayer, he observed such a (long) qiyam (posture of standing in prayer) that his feet were swollen. A'isha رضی اللہ عنہا said: Allah's Messenger you do this (in spite of the fact) that your earlier and later sins have been pardoned for you? Thereupon, he said. A'isha رضی اللہ عنہا should I not prove myself to be a thanksgiving servant (of Allah)?",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم جب نماز پڑھتے تو ( بہت لمبا ) قیام کرتے یہاں تک کہ آپ کے قدم مبارک سوج جاتے ، حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم !آپ ایسا کرتے ہیں ۔ حالانکہ آپ کے اگلےپچھلے تمام گناہوں کی مغفرت کی ( یقین دہانی کرائی ) جاچکی ہے؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" اے عائشہ رضی اللہ تعالیٰ عنہا !کیا میں ( اللہ تعالیٰ کا ) شکرگزار بندہ نہ بنوں؟ \"",
                "urduNarrator": "ہم سے ہارون بن معروف اور ہارون بن سعیدا لا یلی نے بیان کیا، کہا کہ ہم سے ابن وہب نے بیان کیا، کہا: مجھے ابو صخر نے ابن قصیط کی سند سے خبر دی, عروہ بن زبیر نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ وَهَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ قَالَا حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي أَبُو صَخْرٍ عَنْ ابْنِ قُسَيْطٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى قَامَ حَتَّى تَفَطَّرَ رِجْلَاهُ قَالَتْ عَائِشَةُ يَا رَسُولَ اللَّهِ أَتَصْنَعُ هَذَا وَقَدْ غُفِرَ لَكَ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ فَقَالَ يَا عَائِشَةُ أَفَلَا أَكُونُ عَبْدًا شَكُورًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14688,
                "hadithNumber": "7127",
                "englishNarrator": "Shaqiq reported:",
                "hadithEnglish": "We were sitting at the door of Abdullah (bin Mas'ud) رضی اللہ عنہ waiting for him (to come out and deliver a sermon to us). It was at this time that there happened to pass by us Yazid b. Mu'awiya an-Nakha'i. We said: Inform him ('Abdullah b. Mas'ud) of our presence here. He went in and Abdullah b. Mas'ud lost no time in coming out to us and said: I was informed of your presence here but nothing hindered me to come out to you but the fact that I did not like to bore you (by stuffing your minds with sermons) as Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) did not deliver us sermon on certain days fearing that it might prove to be boring for us.",
                "hadithUrdu": "ہم حضرت عبد اللہ بن مسعود رضی اللہ عنہ کے انتظار میں ان کے گھر کے دروازےپربیٹھےہوئے تھے کہ اتنے میں یزید بن معاویہ نخعی ہمارے پاس سے گزرے تو ہم نے کہا : ان ( عبداللہ بن مسعود رضی اللہ تعالیٰ عنہ ) کو ہمارے آنے کی اطلاع کردیں وہ ان کے پاس گئے تو تھوڑی ہی دیر میں حضرت عبد اللہ ( بن مسعود رضی اللہ تعالیٰ عنہ ) آگئے ۔ اور فرمایا : \" مجھے تمھارے آنے کی اطلاع کردی گئی تھی اور مجھے تمھارے پاس آنے سے صرف یہ ناپسندیدگی مانع تھی کہ میں تمھاری اکتاہٹ کا سبب نہ بن جاؤں ۔ بلاشبہ رسول اللہ صلی اللہ علیہ وسلم بھی ہمارے اکتا جانے کے ڈرسے صرف بعض دنوں میں ہی وعظو نصیحت سے نوازاکرتے تھے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے وکیع نے بیان کیا اور ہم سے ابو معاویہ نے بیان کیا اور ہم سے ابن نمیر نے بیان کیا اور قول ان کا ہے, ابو معاویہ نے اعمش سے اور انھوں نے شقیق سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ وَأَبُو مُعَاوِيَةَ و حَدَّثَنَا ابْنُ نُمَيْرٍ وَاللَّفْظُ لَهُ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ شَقِيقٍ قَالَ كُنَّا جُلُوسًا عِنْدَ بَابِ عَبْدِ اللَّهِ نَنْتَظِرُهُ فَمَرَّ بِنَا يَزِيدُ بْنُ مُعَاوِيَةَ النَّخَعِيُّ فَقُلْنَا أَعْلِمْهُ بِمَكَانِنَا فَدَخَلَ عَلَيْهِ فَلَمْ يَلْبَثْ أَنْ خَرَجَ عَلَيْنَا عَبْدُ اللَّهِ فَقَالَ إِنِّي أُخْبَرُ بِمَكَانِكُمْ فَمَا يَمْنَعُنِي أَنْ أَخْرُجَ إِلَيْكُمْ إِلَّا كَرَاهِيَةُ أَنْ أُمِلَّكُمْ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَتَخَوَّلُنَا بِالْمَوْعِظَةِ فِي الْأَيَّامِ مَخَافَةَ السَّآمَةِ عَلَيْنَا.",
                "headingArabic": "الاِقْتِصَادِ فِي الْمَوْعِظَةِ ‏‏",
                "headingUrdu": "تبلیغ میں اعتدال",
                "headingEnglish": "Moderation In Preaching",
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 14376,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=575",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=573",
                "label": "573",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=574",
                "label": "574",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=575",
                "label": "575",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=576",
                "label": "576",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=577",
                "label": "577",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=578",
                "label": "578",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=579",
                "label": "579",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=577",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=577",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=575",
        "to": 14400,
        "total": 40465
    }
}