{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 462,
        "data": [
            {
                "id": 11814,
                "hadithNumber": "4250",
                "englishNarrator": "Uqba bin Amir رضی اللہ عنہ reported:",
                "hadithEnglish": "My sister took a vow that she would walk bare foot to the house of Allah (Ka'ba). She asked me to inquire from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) about it. I sought his decision and he said: She should walk on foot and ride also.",
                "hadithUrdu": "میری بہن نے ننگے پاؤں پیدل چل کر بیت اللہ جانے کی نذر مانی اور مجھ سے کہا کہ میں رسول اللہ صلی اللہ علیہ وسلم سے اس کے لیے فتویٰ لوں ، میں نے آپ سے فتویٰ پوچھا تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" وہ ( بقدر استطاعت ) پیدل چلے اور سوار ہو.",
                "urduNarrator": "ہم سے زکریا بن یحییٰ بن صالح المصری نے بیان کیا,مفضل بن فضالہ نے ہمیں حدیث بیان کی ، ( کہا : ) مجھے عبداللہ بن عیاش نے یزید بن ابی حبیب سے حدیث بیان کی ، انہوں نے ابوالخیر سے اور انہوں نے حضرت عقبہ بن عامر رضی اللہ عنہ سے روایت کی کہ انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا زَكَرِيَّا بْنُ يَحْيَى بْنِ صَالِحٍ الْمِصْرِيُّ، حَدَّثَنَا الْمُفَضَّلُ يَعْنِي ابْنَ فَضَالَةَ، حَدَّثَنِي عَبْدُ اللهِ بْنُ عَيَّاشٍ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ، أَنَّهُ قَالَ: نَذَرَتْ أُخْتِي أَنْ تَمْشِيَ إِلَى بَيْتِ اللهِ حَافِيَةً، فَأَمَرَتْنِي أَنْ أَسْتَفْتِيَ لَهَا رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَاسْتَفْتَيْتُهُ، فَقَالَ: «لِتَمْشِ، وَلْتَرْكَبْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "27",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 127,
                    "chapterNumber": "27",
                    "chapterEnglish": "The Book Of Vows",
                    "chapterUrdu": "نذر(منت ماننے )کے احکام و مسائل",
                    "chapterArabic": "كتاب النَّذْرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11815,
                "hadithNumber": "4251",
                "englishNarrator": "It was narrated from Yazid bin Abi Habib, Abul Khair narrated to him from 'Uqbah bin 'Amir Al-Juhani, that he said:",
                "hadithEnglish": "\"My sister made a vow...\" and he mentioned a Hadith like that of Mufaddal (no. 4250), but he did not mention in the Hadith: \"barefoot,\" and he added: \"Abdul -Khair did not leave 'Uqbah.\"",
                "hadithUrdu": "میں نے اپنی بہن سے نذر مانی تو انہوں نے ایک پسندیدہ حدیث کی مثال بیان کی لیکن انہوں نے ایسا نہیں کیا۔ انہوں نے حدیث میں ایک ننگے پاؤں عورت کا ذکر کیا ہے اور ابو الخیر عقبہ کو نہیں چھوڑا۔",
                "urduNarrator": "مجھ سے محمد بن رافع نے بیان کیا، کہا ہم سے عبد الرزاق نے بیان کیا، کہا ہم سے ابن جریج نے بیان کیا، کہا ہم سے سعید بن ابی ایوب نے بیان کیا کہ یزید بن ابی حبیب نے۔ انہوں نے کہا کہ ابو الخیر نے ان سے عقبہ بن عامر الجہنی کی روایت سے بیان کیا کہ انہوں نے کہا کہ",
                "hadithArabic": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنَا سَعِيدُ، بْنُ أَبِي أَيُّوبَ أَنَّ يَزِيدَ بْنَ أَبِي حَبِيبٍ، أَخْبَرَهُ أَنَّ أَبَا الْخَيْرِ حَدَّثَهُ عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ، أَنَّهُ قَالَ نَذَرَتْ أُخْتِي ‏.‏ فَذَكَرَ بِمِثْلِ حَدِيثِ مُفَضَّلٍ وَلَمْ يَذْكُرْ فِي الْحَدِيثِ حَافِيَةً ‏.‏ وَزَادَ وَكَانَ أَبُو الْخَيْرِ لاَ يُفَارِقُ عُقْبَةَ.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "27",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 127,
                    "chapterNumber": "27",
                    "chapterEnglish": "The Book Of Vows",
                    "chapterUrdu": "نذر(منت ماننے )کے احکام و مسائل",
                    "chapterArabic": "كتاب النَّذْرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11816,
                "hadithNumber": "4252",
                "englishNarrator": null,
                "hadithEnglish": "Yazid bin Abi Habib narrated a Hadith like that of 'Abdur'Razaq with this chain.",
                "hadithUrdu": "مجھ سے محمد بن حاتم اور ابن ابی خلف نے بیان کیا، کہا, رَوح بن عبادہ نے ہمیں حدیث بیان کی ، ( کہا : ) ہمیں ابن جریج نے حدیث سنائی ، ( کہا : ) مجھے یحییٰ بن ایوب نے خبر دی کہ انہیں یزید بن ابی حبیب نے اسی سند سے خبر دی ۔ ۔ عبدالرزاق کی حدیث کے مانند.",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِيهِ مُحَمَّدُ بْنُ حَاتِمٍ، وَابْنُ أَبِي خَلَفٍ، قَالَا: حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي يَحْيَى بْنُ أَيُّوبَ، أَنَّ يَزِيدَ بْنَ أَبِي حَبِيبٍ، أَخْبَرَهُ بِهَذَا الْإِسْنَادِ مِثْلَ حَدِيثِ عَبْدِ الرَّزَّاقِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "27",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 127,
                    "chapterNumber": "27",
                    "chapterEnglish": "The Book Of Vows",
                    "chapterUrdu": "نذر(منت ماننے )کے احکام و مسائل",
                    "chapterArabic": "كتاب النَّذْرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11817,
                "hadithNumber": "4253",
                "englishNarrator": "Uqba bin Amir رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The expiation of the (breach of) a vow is the same as that of the (breach of an oath).",
                "hadithUrdu": "آپ نے فرمایا : \" نذر کا کفارہ ( وہی ہے جو ) قسم کا کفارہ ہے.",
                "urduNarrator": "مجھ سے ہارون بن سعید الایلی، یونس بن عبد الاعلی اور احمد بن عیسیٰ نے بیان کیا، کہا: ہم سے اس نے بیان کیا، اور باقی دو نے کہا: ہم سے بیان کیا۔ مجھ سے ابن وہب، عمرو بن الحارث نے کعب بن علقمہ کی سند سے، عبدالرحمٰن بن شماسہ کی سند سے، ابو الخیر کی سند سے بیان کیا,حضرت عقبہ بن عامر رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی",
                "hadithArabic": "وحَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ، وَيُونُسُ بْنُ عَبْدِ الْأَعْلَى، وَأَحْمَدُ بْنُ عِيسَى، قَالَ يُونُسُ: أَخْبَرَنَا، وقَالَ الْآخَرَانِ: حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ كَعْبِ بْنِ عَلْقَمَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ شِمَاسَةَ، عَنْ أَبِي الْخَيْرِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «كَفَّارَةُ النَّذْرِ كَفَّارَةُ الْيَمِينِ.",
                "headingArabic": "فِي كَفَّارَةِ النَّذْرِ ‏‏",
                "headingUrdu": "نذر توڑنے کا کفارہ",
                "headingEnglish": "Expiation For Breaking A Vow",
                "chapterId": "27",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 127,
                    "chapterNumber": "27",
                    "chapterEnglish": "The Book Of Vows",
                    "chapterUrdu": "نذر(منت ماننے )کے احکام و مسائل",
                    "chapterArabic": "كتاب النَّذْرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11818,
                "hadithNumber": "4254",
                "englishNarrator": "Umar bin al-Khattib رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Allah, the Great and Majestic, forbids you to swear by your fathers. Umar رضی اللہ عنہ said: By Allah. I have never sworn (by my father) since I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbidding it mentioning them on my behalf nor on behalf of someone else.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" بلاشبہ اللہ تعالیٰ تمہیں اپنے آباء و اجداد کی قسم کھانے سے منع کرتا ہے ۔ \"\" حضرت عمر رضی اللہ عنہ نے کہا : اللہ کی قسم! جب سے میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا کہ آپ نے اس سے منع فرمایا ہے ، میں نے نہ ( اپنی طرف سے ) نہ ( کسی کی ) پیروی کرتے ہوئے کبھی ان ( آباء و اجداد کی ) قسم کھائی ۔ ( آباء و اجداد کی قسم کے الفاظ ہی زبان سے ادا نہیں کیے.",
                "urduNarrator": "مجھ سے ابو الطاہر احمد بن عمرو بن سرح نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا, یونس نے ابن شہاب سے ، انہوں نے سالم بن عبداللہ سے اور انہوں نے اپنے والد سے روایت کی ، انہوں نے کہا : میں نے حضرت عمر بن خطاب رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے",
                "hadithArabic": "وحَدَّثَنِي أَبُو الطَّاهِرِ أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ، حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ، ح وحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللهِ، عَنْ أَبِيهِ، قَالَ: سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللهَ عَزَّ وَجَلَّ يَنْهَاكُمْ أَنْ تَحْلِفُوا بِآبَائِكُمْ»، قَالَ عُمَرُ: «فَوَاللهِ مَا حَلَفْتُ بِهَا مُنْذُ سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْهَا ذَاكِرًا، وَلَا آثِرًا.",
                "headingArabic": "النَّهْىِ عَنِ الْحَلِفِ بِغَيْرِ اللَّهِ تَعَالَى ‏‏",
                "headingUrdu": "اللہ کے سوا کسی اور چیز کی قسم کھانے کی ممانعت",
                "headingEnglish": "The prohibition of swearing by something other than Allah",
                "chapterId": "28",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 128,
                    "chapterNumber": "28",
                    "chapterEnglish": "The Book Of Oaths",
                    "chapterUrdu": "قسموں کا بیان",
                    "chapterArabic": "كتاب الْأَيْمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11819,
                "hadithNumber": "4255",
                "englishNarrator": "This hadith has been transmitted on the authority of Zuhri except that in the hadith narrated on the authority of Uqail the words are",
                "hadithEnglish": "I did not take oath by (anyone else except Allah) since I heard Allah's Messenger forbidding it. nor did I speak in such terms, and the narrator did not say, on my own behalf or on behalf of someone else .",
                "hadithUrdu": "میں نے جب سے رسول اللہ صلی اللہ علیہ وسلم کو اس سے منع کرتے ہوئے سنا ، نہ ان کی قسم کھائی اور نہ ایسی قسم کے الفاظ بولے ۔ انہوں نے \" نہ اپنی طرف سے نہ کسی کی پیروی کرتے ہوئے \" کے الفاظ نہیں کہے.",
                "urduNarrator": "مجھ سے عبد الملک بن شعیب بن لیث نے بیان کیا، میرے والد نے مجھ سے میرے دادا کی سند سے بیان کیا,عقیل بن خالد اور معمر دونوں نے زہری سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ، البتہ عقیل کی حدیث میں ہے",
                "hadithArabic": "وحَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي عُقَيْلُ بْنُ خَالِدٍ، ح وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَا: حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، كِلَاهُمَا عَنِ الزُّهْرِيِّ بِهَذَا الْإِسْنَادِ مِثْلَهُ، غَيْرَ أَنَّ فِي حَدِيثِ عُقَيْلٍ: مَا حَلَفْتُ بِهَا مُنْذُ سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَنْهَى عَنْهَا، وَلَا تَكَلَّمْتُ بِهَا، وَلَمْ يَقُلْ ذَاكِرًا، وَلَا آثِرًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "28",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 128,
                    "chapterNumber": "28",
                    "chapterEnglish": "The Book Of Oaths",
                    "chapterUrdu": "قسموں کا بیان",
                    "chapterArabic": "كتاب الْأَيْمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11820,
                "hadithNumber": "4256",
                "englishNarrator": "Salim reported on the authority of his father:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) heard 'Umar رضی اللہ عنہ while he was taking oath by his father. The rest of the hadith is the same.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے حضرت عمر رضی اللہ عنہ کو سنا ، وہ اپنے والد کی قسم کھا رہے تھے ۔ ۔ ( آگے ) یونس اور معمر کی روایت کے مانند ہے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، عمرو ناقد اور زہیر بن حرب نے بیان کیا، انہوں نے کہا سفیان بن عیینہ نے زہری سے ، انہوں نے سالم سے اور انہوں نے اپنے والد سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالُوا: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، قَالَ: سَمِعَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عُمَرَ وَهُوَ يَحْلِفُ بِأَبِيهِ بِمِثْلِ رِوَايَةِ يُونُسَ، وَمَعْمَرٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "28",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 128,
                    "chapterNumber": "28",
                    "chapterEnglish": "The Book Of Oaths",
                    "chapterUrdu": "قسموں کا بیان",
                    "chapterArabic": "كتاب الْأَيْمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11821,
                "hadithNumber": "4257",
                "englishNarrator": "Abdullah (bin Umar) رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) found, Umar bin al-Khattab رضی اللہ عنہ amongst the riders and he was taking oath by his father Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) called them (saying); Our Allah, the Exated and Majestic, has forbidden you that you take oath by your father. He who bag to take an oath, he must take it by Allah or keep quiet.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے عمر بن خطاب رضی اللہ عنہ کو ایک قافلے میں پایا اور عمر رضی اللہ عنہ اپنے والد کی قسم کھا رہے تھے تو رسول اللہ صلی اللہ علیہ وسلم نے انہیں پکار کر فرمایا : \" سن رکھو! بلاشبہ اللہ تمہیں منع کرتا ہے کہ تم اپنے آباء و اجداد کی قسم کھاؤ ، جس نے قسم کھانی ہے وہ اللہ کی قسم کھائے یا خاموش رہے.",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ہم سے لیث نے بیان کیا اور ہم سے محمد بن رومہ نے بیان کیا، اور تلفظ ان کا ہے, لیث نے نافع سے ، انہوں نے حضرت عبداللہ رضی اللہ عنہ سے اور انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، وَاللَّفْظُ لَهُ، أَخْبَرَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللهِ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ أَدْرَكَ عُمَرَ بْنَ الْخَطَّابِ فِي رَكْبٍ، وَعُمَرُ يَحْلِفُ بِأَبِيهِ، فَنَادَاهُمْ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَلَا إِنَّ اللهَ عَزَّ وَجَلَّ يَنْهَاكُمْ أَنْ تَحْلِفُوا بِآبَائِكُمْ، فَمَنْ كَانَ حَالِفًا فَلْيَحْلِفْ بِاللهِ أَوْ لِيَصْمُتْ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "28",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 128,
                    "chapterNumber": "28",
                    "chapterEnglish": "The Book Of Oaths",
                    "chapterUrdu": "قسموں کا بیان",
                    "chapterArabic": "كتاب الْأَيْمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11822,
                "hadithNumber": "4258",
                "englishNarrator": null,
                "hadithEnglish": "This hadith is narrated on the authority of Ibn Umar رضی اللہ عنہ through another chain of transmitters.",
                "hadithUrdu": "عبداللہ بن نمیر ، عبیداللہ ، ایوب ، ولید بن کثیر ، اسماعیل بن امیہ ، ضحاک ، ابن ابی ذئب اور عبدالکریم ، ان سب کے شاگردوں نے ان سے اور انہوں نے نافع سے ، انہوں نے حضرت ابن عمر رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے اسی قصے کے مانند بیان کیا.",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، ح وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى وَهُوَ الْقَطَّانُ، عَنْ عُبَيْدِ اللهِ، ح وحَدَّثَنِي بِشْرُ بْنُ هِلَالٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا أَيُّوبُ، ح وحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنِ الْوَلِيدِ بْنِ كَثِيرٍ، ح وحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ إِسْمَاعِيلَ بْنِ أُمَيَّةَ، ح وحَدَّثَنَا ابْنُ رَافِعٍ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، أَخْبَرَنَا الضَّحَّاكُ، وَابْنُ أَبِي ذِئْبٍ، ح وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ رَافِعٍ، عَنْ عَبْدِ الرَّزَّاقِ، عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي عَبْدُ الْكَرِيمِ، كُلُّ هَؤُلَاءِ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ بِمِثْلِ هَذِهِ الْقِصَّةِ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّم.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "28",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 128,
                    "chapterNumber": "28",
                    "chapterEnglish": "The Book Of Oaths",
                    "chapterUrdu": "قسموں کا بیان",
                    "chapterArabic": "كتاب الْأَيْمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11823,
                "hadithNumber": "4259",
                "englishNarrator": "Ibn 'Umar رضی اللہ عنہ heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying:",
                "hadithEnglish": "He who has to take an oath, he must not take oath but by Allah. The Quraish used to take oath by their fathers. So he (the Holy Prophet ﷺ) said: Do not take oath by your fathers.",
                "hadithUrdu": "\" جس نے قسم کھانی ہے وہ اللہ کے سوا کسی کی قسم نہ کھائے ۔ \" اور قریش اپنے آباء و اجداد کی قسم کھاتے تھے تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" اپنے آباء و اجداد کی قسم نہ کھاؤ.",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ، یحییٰ بن ایوب، قتیبہ اور ابن حجر نے بیان کیا کہ ہم کو یحییٰ بن یحییٰ نے خبر دی اور دوسروں نے کہا: اسماعیل، جو ابن جعفر ہیں، نے ہم سے کہا:عبداللہ بن دینار سے روایت ہے کہ انہوں نے حضرت ابن عمر رضی اللہ عنہ سے سنا ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا",
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَيَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ حُجْرٍ، قَالَ يَحْيَى بْنُ يَحْيَى: أَخْبَرَنَا، وقَالَ الْآخَرُونَ: حَدَّثَنَا إِسْمَاعِيلُ وَهُوَ ابْنُ جَعْفَرٍ، عَنْ عَبْدِ اللهِ بْنِ دِينَارٍ، أَنَّهُ سَمِعَ ابْنَ عُمَرَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ كَانَ حَالِفًا فَلَا يَحْلِفْ إِلَّا بِاللهِ»، وَكَانَتْ قُرَيْشٌ تَحْلِفُ بِآبَائِهَا، فَقَالَ: «لَا تَحْلِفُوا بِآبَائِكُمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "28",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 128,
                    "chapterNumber": "28",
                    "chapterEnglish": "The Book Of Oaths",
                    "chapterUrdu": "قسموں کا بیان",
                    "chapterArabic": "كتاب الْأَيْمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11824,
                "hadithNumber": "4260",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who takes an oath in the course of which he says: By Lat (and al-'Uzza), he should say: There is no god but Allah; and that if anyone says to his friend: Come and I will gamble with you, he should pay sadaqa.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم میں سے جس نے حلف اٹھایا اور اپنے حلف میں کہا : لات کی قسم! تو وہ لا اله الا الله کہے اور جس نے اپنے ساتھی سے کہا : آؤ ، جوا کھیلیں تو وہ صدقہ کرے.",
                "urduNarrator": "مجھ سے ابو الطاہر نے بیان کیا، ہم سے ابن وہب نے بیان کیا, یونس نے ابن شہاب سے روایت کی ، کہا : مجھے حمید بن عبدالرحمن بن عوف نے بتایا کہ حضرت ابوہریرہ رضی اللہ عنہ نے کہا",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ، حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ، ح وحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: مَنْ حَلَفَ مِنْكُمْ، فَقَالَ فِي حَلِفِهِ: بِاللَّاتِ، فَلْيَقُلْ: لَا إِلَهَ إِلَّا اللهُ، وَمَنْ قَالَ لِصَاحِبِهِ: تَعَالَ أُقَامِرْكَ، فَلْيَتَصَدَّقْ.",
                "headingArabic": "مَنْ حَلَفَ بِاللاَّتِ وَالْعُزَّى فَلْيَقُلْ لاَ إِلَهَ إِلاَّ اللَّهُ ‏‏",
                "headingUrdu": "جس نے لات اور عزی کی قسم کھائی وہ لا الہ الا اللہ کہے۔",
                "headingEnglish": "Whoever swears by Al-Lat and Al-Uzza, let him say La Ilaha Illallah",
                "chapterId": "28",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 128,
                    "chapterNumber": "28",
                    "chapterEnglish": "The Book Of Oaths",
                    "chapterUrdu": "قسموں کا بیان",
                    "chapterArabic": "كتاب الْأَيْمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11825,
                "hadithNumber": "4261",
                "englishNarrator": null,
                "hadithEnglish": "It was narrated from Az-zuhri with this chain (a hadith similar to no. 4260), and the hadith of Ma'mar is like the Hadith of Yunus, except that he said: \"Let him give something in charity.\" In the hadith of Al-Awza'iit say: \"Whoever swears by al-Lat aand -Uzza.\"\r\nAbu Al-Hussain Muslim said: This phrase meaning: \"Come, I will gamble with you\" - was  not narrated by anyone except Az-Zuhri had approximately ninety phrases which he narrated from prophet ﷺ and no one else narrated them with any reliable chaain of narrators.",
                "hadithUrdu": "مجھ سے سوید بن سعید نے بیان کیا، کہا ہم سے ولید بن مسلم نے بیان کیا، اوزاعی اور معمر دونوں نے زہری سے اسی سند کے ساتھ حدیث بیان کی اور معمر کی حدیث یونس کی حدیث کے مانند ہے ، البتہ انہوں نے کہا : \"\" تو وہ کچھ صدقہ کرے ۔ \"\" اور اوزاعی کی حدیث میں ہے : \"\" جس نے لات اور عزیٰ کی قسم کھائی ۔ \"\" ابوحسین مسلم ( مؤلف کتاب ) نے کہا : یہ کلمہ ، آپ کے فرمان : \"\" ( جو کہے ) آؤ ، میں تمہارے ساتھ جوا کھیلوں تو وہ صدقہ کرے ۔ \"\" اسے امام زہری کے علاوہ اور کوئی روایت نہیں کرتا ۔ انہوں نے کہا : اور زہری رحمۃ اللہ علیہ کے تقریبا نوے کلمات ( جملے ) ہیں جو وہ نبی صلی اللہ علیہ وسلم سے جید سندوں کے ساتھ روایت کرتے ہیں ، جن ( کے بیان کرنے ) میں اور کوئی ان کا شریک نہیں ہے.",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِي سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، عَنِ الْأَوْزَاعِيِّ، ح وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَا: حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، كِلَاهُمَا عَنِ الزُّهْرِيِّ، بِهَذَا الْإِسْنَادِ، وَحَدِيثُ مَعْمَرٍ مِثْلُ حَدِيثِ يُونُسَ غَيْرَ أَنَّهُ قَالَ: فَلْيَتَصَدَّقْ بِشَيْءٍ، وَفِي حَدِيثِ الْأَوْزَاعِيِّ: «مَنْ حَلَفَ بِاللَّاتِ وَالْعُزَّى»، قَالَ أَبُو الْحُسَيْنِ مُسْلِمٌ: هَذَا الْحَرْفُ يَعْنِي قَوْلَهُ تَعَالَى أُقَامِرْكَ فَلْيَتَصَدَّقْ، لَا يَرْوِيهِ أَحَدٌ غَيْرُ الزُّهْرِيِّ، قَالَ: وَلِلزُّهْرِيِّ نَحْوٌ مِنْ تِسْعِينَ حَدِيثًا يَرْوِيهِ عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، لَا يُشَارِكُهُ فِيهِ أَحَدٌ بِأَسَانِيدَ جِيَادٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "28",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 128,
                    "chapterNumber": "28",
                    "chapterEnglish": "The Book Of Oaths",
                    "chapterUrdu": "قسموں کا بیان",
                    "chapterArabic": "كتاب الْأَيْمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11826,
                "hadithNumber": "4262",
                "englishNarrator": "Abdul-Rahman bin Samura رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Do not swear by idols, nor by your fathers.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم بتوں کی قسم نہ کھاؤ ، نہ ہی اپنے آباء و اجداد کی.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا کہ ہم سے عبد الاعلٰی نے بیان کیا، انہوں نے ہشام سے اور حسن رضی اللہ عنہ سے, حضرت عبدالرحمان بن سمرہ رضی اللہ عنہ سے روایت ہے ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الْأَعْلَى، عَنْ هِشَامٍ، عَنِ الْحَسَنِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تَحْلِفُوا بِالطَّوَاغِي، وَلَا بِآبَائِكُمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "28",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 128,
                    "chapterNumber": "28",
                    "chapterEnglish": "The Book Of Oaths",
                    "chapterUrdu": "قسموں کا بیان",
                    "chapterArabic": "كتاب الْأَيْمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11827,
                "hadithNumber": "4263",
                "englishNarrator": "Abu Musa al-Ash'ari رضی اللہ عنہ reported:",
                "hadithEnglish": "I came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) along with a group of Ash'arites requesting to give us a mount. He (the Holy Prophet ﷺ) said: By Allah, I cannot provide you with a mount, and there is nothing with me which I should give you as a ride. He (the narrator) said: We stayed there as long as Allah willed. Then there were brought to him (to the Holy Prophet ﷺ) camels. He (the Holy Prophet ﷺ) then ordered to give us three white humped camels, We started and said (or some of us said to the others): Allah will not bless us. We came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) begging him to provide us with riding camels. He swore that he could not provide us with a mount, but later on he provided us with that. They (some of the Prophet's Companions) came and informed him about this (rankling of theirs), whereupon he said: It was not I who provided you with a mount, but Allah has provided you with that. So far as I am concerned, by Allah, if He so wills, I would not swear, but if, later on, I would see better than it, I (would break the vow) and expiate it and do that which is better.",
                "hadithUrdu": "میں نبی صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا ، میں اشعریوں کی ایک جماعت کے ساتھ تھا ۔ ہم آپ سے سواری کے طلبگار تھے ۔ تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ کی قسم! میں تمہیں سواری مہیا نہیں کروں گا اور نہ میرے پاس ( کوئی سواری ) ہے جس پر میں تمہیں سوار کروں ۔ \" کہا : جتنی دیر اللہ نے چاہا ہم ٹھہرے ، پھر ( آپ کے پاس ) اونٹ لائے گئے تو آپ نے ہمیں سفید کوہان والے تین ( جوڑے ) اونٹ دینے کا حکم دیا ، جب ہم چلے ، ہم نے کہا : یا ہم نے ایک دوسرے سے کہا ۔ ۔ اللہ ہمیں برکت نہیں دے گا ، ہم رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں سواری حاصل کرنے کے لیے حاضر ہوئے تھے تو آپ نے ہمیں سواری نہ دینے کی قسم کھائی ، پھر آپ نے ہمیں سواری دے دی ، چنانچہ وہ لوگ آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور آپ صلی اللہ علیہ وسلم سے یہ بات عرض کی تو آپ نے فرمایا : \" میں نے تمہیں سوار نہیں کیا ، بلکہ اللہ نے تمہیں سواری مہیا کی ہے اور اللہ کی قسم! اگر اللہ چاہے ، میں کسی چیز پر قسم نہیں کھاتا اور پھر ( کسی دوسرے کام کو ) اس سے بہتر خیال کرتا ہوں ، تو میں اپنی قسم کا کفارہ دیتا ہوں اور وہی کام کرتا ہوں جو بہتر ہے.",
                "urduNarrator": "ہم سے خلف بن ہشام، قتیبہ بن سعید اور یحییٰ بن حبیب الحارثی نے بیان کیا اور ہم سے لفظ \"خلف\" روایت کیا، انہوں نے کہا: ہم سے حماد بن زید نے بیان کیا,غیلان بن جریر نے ابو بردہ سے اور انہوں نے حضرت ابوموسیٰ اشعری رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا خَلَفُ بْنُ هِشَامٍ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَيَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، وَاللَّفْظُ لِخَلَفٍ، قَالُوا: حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ غَيْلَانَ بْنِ جَرِيرٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ، قَالَ: أَتَيْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي رَهْطٍ مِنَ الْأَشْعَرِيِّينَ نَسْتَحْمِلُهُ، فَقَالَ: «وَاللهِ لَا أَحْمِلُكُمْ، وَمَا عِنْدِي مَا أَحْمِلُكُمْ عَلَيْهِ»، قَالَ: فَلَبِثْنَا مَا شَاءَ اللهُ، ثُمَّ أُتِيَ بِإِبِلٍ، فَأَمَرَ لَنَا بِثَلَاثِ ذَوْدٍ غُرِّ الذُّرَى، فَلَمَّا انْطَلَقْنَا قُلْنَا: - أَوْ قَالَ بَعْضُنَا لِبَعْضٍ: - لَا يُبَارِكُ اللهُ لَنَا، أَتَيْنَا رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَسْتَحْمِلُهُ، فَحَلَفَ أَنْ لَا يَحْمِلَنَا، ثُمَّ حَمَلَنَا، فَأَتَوْهُ فَأَخْبَرُوهُ، فَقَالَ: «مَا أَنَا حَمَلْتُكُمْ وَلَكِنَّ اللهَ حَمَلَكُمْ، وَإِنِّي وَاللهِ إِنْ شَاءَ اللهُ لَا أَحْلِفُ عَلَى يَمِينٍ، ثُمَّ أَرَى خَيْرًا مِنْهَا، إِلَّا كَفَّرْتُ عَنْ يَمِينِي، وَأَتَيْتُ الَّذِي هُوَ خَيْرٌ.",
                "headingArabic": "نَدْبِ مَنْ حَلَفَ يَمِينًا فَرَأَى غَيْرَهَا خَيْرًا مِنْهَا أَنْ يَأْتِيَ الَّذِي هُوَ خَيْرٌ وَيُكَفِّرَ عَنْ يَمِينِهِ",
                "headingUrdu": "اس کے لیے مستحب ہے جو قسم کھائے پھر دیکھے کہ اس سے بہتر کوئی چیز ہے۔ وہ کرنا جو بہتر ہو اور اپنی قسم کا کفارہ ادا کرے۔",
                "headingEnglish": "It is recommended for the one who swears an oath then sees that something else is better than it; To do that which is better and offer expiation for his oath",
                "chapterId": "28",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 128,
                    "chapterNumber": "28",
                    "chapterEnglish": "The Book Of Oaths",
                    "chapterUrdu": "قسموں کا بیان",
                    "chapterArabic": "كتاب الْأَيْمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11828,
                "hadithNumber": "4264",
                "englishNarrator": "Abu Musa رضی اللہ عنہ reported:",
                "hadithEnglish": "My friends sent me to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) asking him to provide them with mounts as they were going along with him in jaish al-'Usrah (the army of destitutes or of meagre means or army setting out during the hard times and that is the occasion of the expedition of Tabuk) I said: Apostle of Allah, my friends have sent me to you so that you may provide them with mounts. He (the Holy Prophet ﷺ) said: By Allah, I cannot provide you with anything to ride. And it so happened that he was at that time much perturbed. I little knew of it, so I came back with a heavy heart on account of the refusal of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), and the fear that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) might have some feelings against me. I returned to my friends and informed them about what Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had said. I had hardly stayed for a little that I heard Bilal رضی اللہ عنہ calling: 'Abdullah bin Qais. I responded to his call. He said: Hasten to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), he is calling you, When I came to the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) he said: Take this pair, this pair, and this pair (i.e. six camels which he had bought from Sa'd رضی اللہ عنہ), and take them to y, our friends and say: Verily Allah (or he said: Verily Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) has provided you with these animals. So ride upon them. Abu Musa رضی اللہ عنہ said: I went along with them to my friends and said: Verily Allah's messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) has provided you with these animals for riding; but by Allah, I shall not leave you until some of you go along with me to him who had heard the talk of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) then I asked him for you, and his refusal for the first time, and then his granting them to me subsequently; so you should not think that I narrated to you something which he did not say. They said to me: By Allah, in our opinion you are certainly truthful, and we would do as you like. So Abu Musa رضی اللہ عنہ  went along with some of the men from them until they came to those who had heard the words of Allah's Messenger (ﷺ) and his refusal to (provide) them with (animals) ; and subsequently his granting (the animals) to them; and they narrated to them exactly as Abu Masa رضی اللہ عنہ had narrated to them.",
                "hadithUrdu": "میرے ساتھیوں نے مجھے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں بھیجا تاکہ میں آپ سے ان کے لیے سواریاں مانگوں ، ( یہ اس موقع کی بات ہے ) جب وہ آپ کے ساتھ جیش العسرۃ میں تھے ۔ ۔ اور اس سے مراد غزوہ تبوک ہے ۔ ۔ تو میں نے عرض کی : اللہ کے نبی! میرے ساتھیوں نے مجھے آپ کے پاس بھیجا ہے تاکہ آپ انہیں سواریاں دیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" اللہ کی قسم! میں تمہیں کسی چیز پر سوار نہیں کروں گا ۔ \"\" اور میں ایسے وقت آپ کے پاس گیا تھا کہ آپ غصے میں تھے اور مجھے معلوم نہ تھا ۔ میں رسول اللہ صلی اللہ علیہ وسلم کے انکار کی وجہ سے اور اس ڈر سے کہ آپ اپنے دل میں مجھ سے ناراض ہو گئے ہیں ، غمگین واپس ہوا ۔ میں اپنے ساتھیوں کے پاس واپس آیا اور جو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا ، انہیں بتایا ۔ میں نے ایک چھوٹی سی گھڑی ہی گزاری ہو گی کہ اچانک میں نے بلال رضی اللہ عنہ کو سنا ، وہ پکار رہے تھے : اے عبداللہ بن قیس! میں نے انہیں جواب دیا تو انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو جاؤ ، وہ تمہیں بلا رہے ہیں ۔ جب میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا تو آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" یہ دو اکٹھے بندھے ہوئے اونٹ لے لو ، یہ جوڑا اور یہ جوڑا بھی لے لو ۔ ۔ چھ اونٹوں کی طرف اشارہ کیا جو آپ نے اسی وقت حضرت سعد رضی اللہ عنہ سے خریدے تھے ۔ ۔ اور انہیں اپنے ساتھیوں کے پاس لے جاؤ اور کہو : اللہ تعالیٰ ۔ ۔ یا فرمایا : رسول اللہ صلی اللہ علیہ وسلم ۔ ۔ تمہیں یہ سواریاں مہیا کر رہے ہیں ، ان پر سواری کرو ۔ \"\" حضرت ابو موسیٰ رضی اللہ عنہ نے کہا : میں انہیں لے کر اپنے ساتھیوں کے پاس گیا اور کہا : بلاشبہ رسول اللہ صلی اللہ علیہ وسلم تمہیں ان پر سوار کر رہے ہیں لیکن اللہ کی قسم! میں اس وقت تک تمہیں نہیں چھوڑوں گا یہاں تک کہ تم میں سے کوئی میرے ساتھ اس آدمی کے پاس جائے جس نے اس وقت رسول اللہ صلی اللہ علیہ وسلم کی بات سنی تھی جب میں نے آپ سے تمہارے لیے سوال کیا تھا ، اور پہلی مرتبہ آپ کے منع کرنے اور اس کے بعد مجھے عطا کرنے کی بات بھی سنی تھی ، مبادا تم سمجھو کہ میں نے تمہیں ایسی بات بتائی ہے جو آپ نے نہیں فرمائی ۔ تو انہوں نے مجھ سے کہا : اللہ کی قسم! آپ ہمارے نزدیک سچے ہیں اور جو آپ کو پسند ہے وہ بھی ہم ضرور کریں گے ، چنانچہ حضرت ابو موسیٰ رضی اللہ عنہ ان میں سے چند لوگوں کو ساتھ لے کر چل پڑے یہاں تک کہ ان لوگوں کے پاس آئے جنہوں نے رسول اللہ صلی اللہ علیہ وسلم کی بات اور آپ کے انکار کرنے کے بعد عطا کرنے کے بارے میں خود سنا تھا ۔ انہوں نے بالکل وہی بات کی جو حضرت ابو موسیٰ رضی اللہ عنہ نے ( اپنے ) لوگوں کو بتائی تھی ۔\r\n فائدہ : اس حدیث میں واقعے کے پہلے حصے کی زیادہ تفصیل بیان کی گئی ہے جبکہ آخری حصے کی تفصیل پچھلی حدیث میں ہے ۔ حضرت ابوموسیٰ رضی اللہ عنہ کو ساتھیوں نے بھیجا ، رسول اللہ صلی اللہ علیہ وسلم نے انہیں جواب دیا ، پھر بلا کر اونٹ عطا فرمائے ، پھر یہ لوگ ان لوگوں کے پاس گئے جو سارے واقعے کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے سامنے موجود تھے ، پھر یہ حضرات رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور قسم والی بات بتائی ۔ اس پر آپ نے وہی جواب دیا جو پہلی حدیث میں مذکور ہے",
                "urduNarrator": "ہم سے عبداللہ بن براد اشعری اور محمد بن الاعلٰی ہمدانی نے بیان کیا، اور وہ الفاظ میں ایک جیسے تھے، انہوں نے کہا: ہم سے ابو اسامہ نے بیان کیا, بُرید نے ابوبردہ سے اور انہوں نے حضرت ابوموسیٰ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللهِ بْنُ بَرَّادٍ الْأَشْعَرِيُّ، وَمُحَمَّدُ بْنُ الْعَلَاءِ الْهَمْدَانِيُّ، وَتَقَارَبَا فِي اللَّفْظِ، قَالَا: حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ: أَرْسَلَنِي أَصْحَابِي إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَسْأَلُهُ لَهُمُ الْحُمْلَانَ، إِذْ هُمْ مَعَهُ فِي جَيْشِ الْعُسْرَةِ، وَهِيَ غَزْوَةُ تَبُوكَ، فَقُلْتُ: يَا نَبِيَّ اللهِ، إِنَّ أَصْحَابِي أَرْسَلُونِي إِلَيْكَ لِتَحْمِلَهُمْ، فَقَالَ: «وَاللهِ لَا أَحْمِلُكُمْ عَلَى شَيْءٍ»، وَوَافَقْتُهُ وَهُوَ غَضْبَانُ وَلَا أَشْعُرُ، فَرَجَعْتُ حَزِينًا مِنْ مَنْعِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَمِنْ مَخَافَةِ أَنْ يَكُونَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَدْ وَجَدَ فِي نَفْسِهِ عَلَيَّ، فَرَجَعْتُ إِلَى أَصْحَابِي، فَأَخْبَرْتُهُمُ الَّذِي قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَلَمْ أَلْبَثْ إِلَّا سُوَيْعَةً إِذْ سَمِعْتُ بِلَالًا يُنَادِي: أَيْ عَبْدَ اللهِ بْنَ قَيْسٍ فَأَجَبْتُهُ، فَقَالَ: أَجِبْ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَدْعُوكَ، فَلَمَّا أَتَيْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: خُذْ هَذَيْنِ الْقَرِينَيْنِ، وَهَذَيْنِ الْقَرِينَيْنِ، وَهَذَيْنِ الْقَرِينَيْنِ، لِسِتَّةِ أَبْعِرَةٍ ابْتَاعَهُنَّ حِينَئِذٍ مِنْ سَعْدٍ، فَانْطَلِقْ بِهِنَّ إِلَى أَصْحَابِكَ، فَقُلْ: إِنَّ اللهَ - أَوْ قَالَ: إِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - يَحْمِلُكُمْ عَلَى هَؤُلَاءِ فَارْكَبُوهُنَّ ، قَالَ أَبُو مُوسَى: فَانْطَلَقْتُ إِلَى أَصْحَابِي بِهِنَّ، فَقُلْتُ: إِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَحْمِلُكُمْ عَلَى هَؤُلَاءِ، وَلَكِنْ وَاللهِ لَا أَدَعُكُمْ حَتَّى يَنْطَلِقَ مَعِي بَعْضُكُمْ إِلَى مَنْ سَمِعَ مَقَالَةَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حِينَ سَأَلْتُهُ لَكُمْ، وَمَنْعَهُ فِي أَوَّلِ مَرَّةٍ، ثُمَّ إِعْطَاءَهُ إِيَّايَ بَعْدَ ذَلِكَ، لَا تَظُنُّوا أَنِّي حَدَّثْتُكُمْ شَيْئًا لَمْ يَقُلْهُ، فَقَالُوا لِي: وَاللهِ إِنَّكَ عِنْدَنَا لَمُصَدَّقٌ، وَلَنَفْعَلَنَّ مَا أَحْبَبْتَ، فَانْطَلَقَ أَبُو مُوسَى بِنَفَرٍ مِنْهُمْ، حَتَّى أَتَوُا الَّذِينَ سَمِعُوا قَوْلَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَمَنْعَهُ إِيَّاهُمْ، ثُمَّ إِعْطَاءَهُمْ بَعْدُ، فَحَدَّثُوهُمْ بِمَا حَدَّثَهُمْ بِهِ أَبُو مُوسَى سَوَاءً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "28",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 128,
                    "chapterNumber": "28",
                    "chapterEnglish": "The Book Of Oaths",
                    "chapterUrdu": "قسموں کا بیان",
                    "chapterArabic": "كتاب الْأَيْمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11829,
                "hadithNumber": "4265",
                "englishNarrator": "Ayyub said: \"The Hadith of Al-Qasim is better known to me than the Hadith of Abu Qilabah. He said:",
                "hadithEnglish": "We were sitting in the company of Abu Musa رضی اللہ عنہ that he called for food and it consisted of flesh of fowl. It was then that a person from Banu Tamim visited him. His complexion was red having the resemblance of a slave. He said to him: Come and (join me in food). He showed reluctance. He (Abu Masa رضی اللہ عنہ) said: Come on, for I saw Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) eating it (fowl's meat), whereupon that person said: I saw it eating something (of filth and rubbish) and I found it repugnant and took an oath that I would never eat that. He (Abu Muds) said: Come, so that I would narrate to you about that (the incident pertaining to vow). (And he narrated thus): I came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) along with a group of people belonging to the tribe of Ash'ari, asking him to provide us with riding camels. He (the Holy Prophet ﷺ) said: By Allah, I cannot provide you with riding animals. And there is nothing with me with which I can provide you a mount. We stayed (for some time) there as Allah willed, and there was brought to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) booty of camels. He called us and commanded that we should be given five white humped camels. As we were about to go back, some of us said to the other: As we made Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forget oath, there would be no blessing for us (in his gift). We went back to him and said: Allah's Messenger ﷺ, we came to you to provide us with riding animals and you took an oath that you would never equip us with mounts and then you have provided us with the riding beasts Allah's Messenger ﷺ, have you forgotten? Thereupon he said: I swear by Allah that if Allah so wills, I shall not swear an oath, and then consider something else to be better than it without making atonement for my oath and doing the thing that is better. So you go; Allah, the Exalted and Glorious, has given you riding animals.",
                "hadithUrdu": "ہم حضرت ابو موسیٰ رضی اللہ عنہ کے پاس تھے ، انہوں نے اپنا دسترخوان منگوایا جس پر مرغی کا گوشت تھا ، اتنے میں بنو تیمِ اللہ میں سے ایک آدمی اندر داخل ہوا ، وہ سرخ رنگ کا موالی جیسا شخص تھا ، تو انہوں نے اس سے کہا : آؤ ۔ وہ ہچکچایا تو انہوں نے کہا : آؤ ، میں نے رسول اللہ صلی اللہ علیہ وسلم کو اس ( مرغی کے گوشت ) میں سے کھاتے ہوئے دیکھا ہے ۔ اس آدمی نے کہا : میں نے اسے کوئی ایسی چیز کھاتے ہوئے دیکھا تھا جس سے مجھے اس سے گھن آئی تو میں نے قسم کھائی تھی کہ میں اس ( کے گوشت ) کو کبھی نہیں کھاؤں گا ۔ اس پر انہوں نے کہا : آؤ ، میں تمہیں اس کے بارے میں حدیث سناتا ہوں ، میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا ، میں اشعریوں کے ایک گروہ کے ساتھ تھا ، ہم آپ سے سواریوں کے طلبگار تھے ، تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ کی قسم! میں تمہیں سواری مہیا نہیں کروں گا اور نہ میرے پاس کوئی ایسی چیز ہے جس پر میں تمہیں سوار کروں ۔ \" جتنا اللہ نے چاہا ہم رکے ، پھر رسول اللہ صلی اللہ علیہ وسلم کے پاس ( کافروں سے ) چھینے ہوئے اونٹ ( جو آپ نے سعد رضی اللہ عنہ سے خرید لیے تھے ) لائے گئے تو آپ نے ہمیں بلوایا ، آپ نے ہمیں سفید کوہان والے پانچ ( یا چھ ، حدیث : 4264 ) اونٹ دینے کا حکم دیا ۔ کہا : جب ہم چلے ، تو ہم میں سے کچھ لوگوں نے دوسروں سے کہا : ( غالبا ) ہم نے رسول اللہ صلی اللہ علیہ وسلم کو اپنی قسم سے غافل کر دیا ، ہمیں برکت نہ دی جائے گی ، چنانچہ ہم واپس آپ کی خدمت میں حاضر ہوئے اور عرض کی : اے اللہ کے رسول! ہم آپ کی خدمت میں سواریاں لینے کے لیے حاضر ہوئے تھے اور آپ نے ہمیں سواری نہ دینے کی قسم کھائی تھی ، پھر آپ نے ہمیں سواریاں دے دی ہیں تو اللہ کے رسول! کیا آپ بھول گئے ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ کی قسم! اللہ کی مشیت سے میں جب بھی کسی چیز پر قسم کھاتا ہوں ، پھر اس کے علاوہ کسی اور کام کو اس سے بہتر خیال کرتا ہوں تو وہی کام کرتا ہوں جو بہتر ہے اور ( قسم کا کفارہ ادا کر کے ) اس کا بندھن کھول دیتا ہوں ۔ تم جاؤ ، تمہیں اللہ عزوجل نے سوار کیا ہے.",
                "urduNarrator": "ابو الربیع العتکی نے مجھ سے کہا, حماد بن زید نے ہمیں ایوب سے حدیث بیان کی ، انہوں نے ابوقلابہ اور قاسم بن عاصم سے اور انہوں نے زَہدم جرمی سے روایت کی ۔ ۔ ایوب نے کہا, ابوقلابہ کی حدیث کی نسبت مجھے قاسم کی حدیث زیادہ یاد ہے ۔ ۔ انہوں ( زہدم ) نے کہا",
                "hadithArabic": "حَدَّثَنِي أَبُو الرَّبِيعِ الْعَتَكِيُّ، حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلَابَةَ، وَعَنِ الْقَاسِمِ بْنِ عَاصِمٍ، عَنْ زَهْدَمٍ الْجَرْمِيِّ، قَالَ أَيُّوبُ: وَأَنَا لِحَدِيثِ الْقَاسِمِ، أَحْفَظُ مِنِّي لِحَدِيثِ أَبِي قِلَابَةَ، قَالَ: كُنَّا عِنْدَ أَبِي مُوسَى فَدَعَا بِمَائِدَتِهِ وَعَلَيْهَا لَحْمُ دَجَاجٍ، فَدَخَلَ رَجُلٌ مِنْ بَنِي تَيْمِ اللهِ، أَحْمَرُ شَبِيهٌ بِالْمَوَالِي، فَقَالَ لَهُ: هَلُمَّ، فَتَلَكَّأَ، فَقَالَ: هَلُمَّ، فَإِنِّي قَدْ رَأَيْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَأْكُلُ مِنْهُ، فَقَالَ الرَّجُلُ: إِنِّي رَأَيْتُهُ يَأْكُلُ شَيْئًا، فَقَذِرْتُهُ، فَحَلَفْتُ أَنْ لَا أَطْعَمَهُ، فَقَالَ: هَلُمَّ أُحَدِّثْكَ عَنْ ذَلِكَ، إِنِّي أَتَيْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي رَهْطٍ مِنَ الْأَشْعَرِيِّينَ نَسْتَحْمِلُهُ، فَقَالَ: «وَاللهِ لَا أَحْمِلُكُمْ وَمَا عِنْدِي مَا أَحْمِلُكُمْ عَلَيْهِ»، فَلَبِثْنَا مَا شَاءَ اللهُ، فَأُتِيَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِنَهْبِ إِبِلٍ، فَدَعَا بِنَا، فَأَمَرَ لَنَا بِخَمْسِ ذَوْدٍ غُرِّ الذُّرَى، قَالَ: فَلَمَّا انْطَلَقْنَا، قَالَ بَعْضُنَا لِبَعْضٍ: أَغْفَلْنَا رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَمِينَهُ، لَا يُبَارَكُ لَنَا، فَرَجَعْنَا إِلَيْهِ، فَقُلْنَا: يَا رَسُولَ اللهِ، إِنَّا أَتَيْنَاكَ نَسْتَحْمِلُكَ، وَإِنَّكَ حَلَفْتَ أَنْ لَا تَحْمِلَنَا، ثُمَّ حَمَلْتَنَا أَفَنَسِيتَ يَا رَسُولَ اللهِ؟ قَالَ: «إِنِّي وَاللهِ إِنْ شَاءَ اللهُ، لَا أَحْلِفُ عَلَى يَمِينٍ، فَأَرَى غَيْرَهَا خَيْرًا مِنْهَا، إِلَّا أَتَيْتُ الَّذِي هُوَ خَيْرٌ وَتَحَلَّلْتُهَا، فَانْطَلِقُوا فَإِنَّمَا حَمَلَكُمُ اللهُ عَزَّ وَجَلَّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "28",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 128,
                    "chapterNumber": "28",
                    "chapterEnglish": "The Book Of Oaths",
                    "chapterUrdu": "قسموں کا بیان",
                    "chapterArabic": "كتاب الْأَيْمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11830,
                "hadithNumber": "4266",
                "englishNarrator": "It was narrated that Zahdam Al-Jarmi said:",
                "hadithEnglish": "\"There was love and brotherhood between this clan of Jarm and the Ash'ari رضی اللہ عنہ and some food containing chicken was brought to him... and he narrated some similar (as Hadith no. 4265).",
                "hadithUrdu": "جَرم کے قبیلے اور اشعریوں کے درمیان محبت و اخوت کا رشتہ تھا ، ہم حضرت ابو موسیٰ اشعری رضی اللہ عنہ کے پاس تھے ، انہیں کھانا پیش کیا گیا جس میں مرغی کا گوشت تھا ۔ ۔ آگے اسی کے ہم معنی بیان کیا.",
                "urduNarrator": "ہم سے ابن ابی عمر نے بیان کیا,عبدالوہاب ثقفی نے ہمیں ایوب سے حدیث بیان کی ، انہوں نے ابوقلابہ اور قاسم تمیمی سے اور انہوں نے زہدم جرمی سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلَابَةَ، وَالْقَاسِمِ التَّمِيمِيِّ، عَنْ زَهْدَمٍ الْجَرْمِيِّ، قَالَ: كَانَ بَيْنَ هَذَا الْحَيِّ مِنْ جَرْمٍ وَبَيْنَ الْأَشْعَرِيِّينَ وُدٌّ وَإِخَاءٌ، فَكُنَّا عِنْدَ أَبِي مُوسَى الْأَشْعَرِيِّ، فَقُرِّبَ إِلَيْهِ طَعَامٌ فِيهِ لَحْمُ دَجَاجٍ، فَذَكَرَ نَحْوَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "28",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 128,
                    "chapterNumber": "28",
                    "chapterEnglish": "The Book Of Oaths",
                    "chapterUrdu": "قسموں کا بیان",
                    "chapterArabic": "كتاب الْأَيْمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11831,
                "hadithNumber": "4267",
                "englishNarrator": null,
                "hadithEnglish": "Zahdam al-Jarmi reported: We were in the company of Abu Musa. The rest of the hadith is the same.",
                "hadithUrdu": "مجھ سے علی بن حجر السعدی، اسحاق بن ابراہیم اور ابن نمیر نے بیان کیا, اسماعیل بن علیہ ، سفیان اور وہیب ، سب نے ایوب سے حدیث بیان کی ، انہوں نے ابوقلابہ اور قاسم سے اور انہوں نے زہدم جرمی سے روایت کی ، انہوں نے کہا : ہم حضرت ابو موسیٰ رضی اللہ عنہ کے پاس تھے ۔ ۔ ان سب نے حماد بن زید کی حدیث کے ہم معنی حدیث بیان کی.",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ نُمَيْرٍ، عَنْ إِسْمَاعِيلَ ابْنِ عُلَيَّةَ، عَنْ أَيُّوبَ، عَنِ الْقَاسِمِ التَّمِيمِيِّ، عَنْ زَهْدَمٍ الْجَرْمِيِّ، ح وحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلَابَةَ، عَنْ زَهْدَمٍ الْجَرْمِيِّ، ح وحَدَّثَنِي أَبُو بَكْرِ بْنُ إِسْحَاقَ، حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي قِلَابَةَ، وَالْقَاسِمِ، عَنْ زَهْدَمٍ الْجَرْمِيِّ، قَالَ: كُنَّا عِنْدَ أَبِي مُوسَى وَاقْتَصُّوا جَمِيعًا الْحَدِيثَ بِمَعْنَى حَدِيثِ حَمَّادِ بْنِ زَيْدٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "28",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 128,
                    "chapterNumber": "28",
                    "chapterEnglish": "The Book Of Oaths",
                    "chapterUrdu": "قسموں کا بیان",
                    "chapterArabic": "كتاب الْأَيْمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11832,
                "hadithNumber": "4268",
                "englishNarrator": "Zahdam al-Jarmi reported:",
                "hadithEnglish": "I visited Abu Musa رضی اللہ عنہ and lie was eating fowl's meat. The rest of the hadith is the same with this addition that he (the Holy Prophet) said: By Allah, I did not forget it.",
                "hadithUrdu": "میں حضرت ابو موسیٰ رضی اللہ عنہ کے ہاں گیا ، وہ مرغی کا گوشت کھا رہے تھے ۔ ۔ انہوں نے ان سب کی حدیث کی طرح حدیث بیان کی اور اس میں یہ اضافہ کیا ، آپ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ کی قسم! میں اس ( اپنی قسم ) کو نہیں بھولا.",
                "urduNarrator": "ہم سے شیبان بن فروخ نے بیان کیا، ہم سے الصاق نے، یعنی ہم سے ابن حزن نے بیان کیا,مطروراق نے ہمیں حدیث بیان کی ، کہا : ہمیں زہدم جرمی نے حدیث بیان کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا الصَّعْقُ يَعْنِي ابْنَ حَزْنٍ، حَدَّثَنَا مَطَرٌ الْوَرَّاقُ، حَدَّثَنَا زَهْدَمٌ الْجَرْمِيُّ، قَالَ: دَخَلْتُ عَلَى أَبِي مُوسَى وَهُوَ يَأْكُلُ لَحْمَ دَجَاجٍ، وَسَاقَ الْحَدِيثَ بِنَحْوِ حَدِيثِهِمْ وَزَادَ فِيهِ، قَالَ: «إِنِّي وَاللهِ مَا نَسِيتُهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "28",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 128,
                    "chapterNumber": "28",
                    "chapterEnglish": "The Book Of Oaths",
                    "chapterUrdu": "قسموں کا بیان",
                    "chapterArabic": "كتاب الْأَيْمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11833,
                "hadithNumber": "4269",
                "englishNarrator": "Abu Musa al-Ash'ari رضی اللہ عنہ reported:",
                "hadithEnglish": "We came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) requesting him to provide us with riding camels. He (the Holy Prophet ﷺ) said: There is nothing with me with which I should equip you. By Allah, I would not provide you with (riding camels). Then Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sent to us three camels with spotted bumps. We said: We came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) asking him to equip us with riding animals. He took an oath that he could not equip us. We came to him and informed him. He said: By Allah, I do not take an oath, but when I find the other thing better than that, I do that which is better.",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں سواریاں حاصل کرنے کے لیے حاضر ہوئے تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" میرے پاس کوئی چیز نہیں ہے جس پر میں تمہیں سوار کروں ، اللہ کی قسم! میں تمہیں سوار نہیں کروں گا ۔ \" پھر رسول اللہ صلی اللہ علیہ وسلم نے ہماری طرف سفید کوہان والے تین ( جوڑے ) اونٹ بھیجے تو ہم نے کہا : ہم رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں آپ سے سواریاں حاصل کرنے کے لیے حاضر ہوئے تو آپ نے ہمیں سواری نہ دینے کی قسم کھائی تھی ، چنانچہ ہم آپ کی خدمت میں حاضر ہوئے اور آپ کو ( آپ کی قسم ) کے بارے میں ) خبر دی تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" میں کسی چیز پر قسم نہیں کھاتا ، پھر اس کے علاوہ کسی دوسرے کام کو اس سے بہتر خیال کرتا ہوں تو وہی کرتا ہوں جو بہتر ہو.",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا, جریر نے ہمیں سلیمان تیمی سے خبر دی ، انہوں نے ضرب بن نقیر قیسی سے ، انہوں نے زہدم سے اور انہوں نے حضرت ابو موسیٰ اشعری رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، عَنْ ضُرَيْبِ بْنِ نُقَيْرٍ الْقَيْسِيِّ، عَنْ زَهْدَمٍ، عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ، قَالَ: أَتَيْنَا رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَسْتَحْمِلُهُ، فَقَالَ: «مَا عِنْدِي مَا أَحْمِلُكُمْ، وَاللهِ مَا أَحْمِلُكُمْ»، ثُمَّ بَعَثَ إِلَيْنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِثَلَاثَةِ ذَوْدٍ بُقْعِ الذُّرَى، فَقُلْنَا: إِنَّا أَتَيْنَا رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَسْتَحْمِلُهُ، فَحَلَفَ أَنْ لَا يَحْمِلَنَا، فَأَتَيْنَاهُ فَأَخْبَرْنَاهُ، فَقَالَ: «إِنِّي لَا أَحْلِفُ عَلَى يَمِينٍ، أَرَى غَيْرَهَا خَيْرًا مِنْهَا، إِلَّا أَتَيْتُ الَّذِي هُوَ خَيْرٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "28",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 128,
                    "chapterNumber": "28",
                    "chapterEnglish": "The Book Of Oaths",
                    "chapterUrdu": "قسموں کا بیان",
                    "chapterArabic": "كتاب الْأَيْمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11834,
                "hadithNumber": "4270",
                "englishNarrator": "Abu Musa رضی اللہ عنہ reported:",
                "hadithEnglish": "We walked on foot and came to Allah's Apostle (may peace he upon him) asking him to provide us with mounts. The rest of the hadith is the same.",
                "hadithUrdu": "ہم پیدل تھے تو ہم نبی صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے ، ہم آپ سے سواریاں حاصل کرنا چاہتے تھے ، ( آگے اسی طرح ہے ) جس طرح جریر کی حدیث ہے.",
                "urduNarrator": "ہم سے محمد بن عبد العلٰی تیمی نے بیان کیا,معتمر نے اپنے والد سے روایت کی ، کہا : ہمیں ابو سلیل ( ضریب ) نے زہدم سے حدیث بیان کی ، وہ حضرت ابو موسیٰ رضی اللہ عنہ سے حدیث بیان کر رہے تھے ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى التَّيْمِيُّ، حَدَّثَنَا الْمُعْتَمِرُ، عَنْ أَبِيهِ، حَدَّثَنَا أَبُو السَّلِيلِ، عَنْ زَهْدَمٍ، يُحَدِّثُهُ عَنْ أَبِي مُوسَى، قَالَ: كُنَّا مُشَاةً فَأَتَيْنَا نَبِيَّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَسْتَحْمِلُهُ بِنَحْوِ حَدِيثِ جَرِيرٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "28",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 128,
                    "chapterNumber": "28",
                    "chapterEnglish": "The Book Of Oaths",
                    "chapterUrdu": "قسموں کا بیان",
                    "chapterArabic": "كتاب الْأَيْمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11835,
                "hadithNumber": "4271",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "A person sat late in the night with Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), and then came to his family and found that his children had gone to sleep. His wife brought food for him. but he took an oath that he would not eat because of his children (having gone to sleep without food) He then gave precedence (of breaking the vow and then expiating it) and ate the food He then came to Allah s Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and made mention of that to him, whereupon Allah's Messenger (ﷺ) said: He who took an oath and (later on) found something better than that should do that, and expiate for (breaking) his vow.",
                "hadithUrdu": "ایک آدمی رات کی تاریکی گہری ہونے تک نبی صلی اللہ علیہ وسلم کے پاس رہا ، پھر اپنے گھر لوٹا تو اس نے بچوں کو سویا ہوا پایا ، اس کی بیوی اس کے پاس کھانا لائی تو اس نے قسم کھائی کہ وہ بچوں ( کے سو جانے ) کی وجہ سے کھانا نہیں کھائے گا ، پھر اسے ( دوسرا ) خیال آیا تو اس نے کھانا کھا لیا ، اس کے بعد وہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور آپ سے اس بات کا تذکرہ کیا تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جس نے کوئی قسم کھائی ، پھر اس نے کسی دوسرے کام کو اس سے بہتر سمجھا تو وہ وہی کام کر لے اور اپنی قسم کا کفارہ ادا کر دے.",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے مروان بن معاویہ نے بیان کیا، کہا ہم سے یزید بن کیسان نے بیان کیا, ابو حازم نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ الْفَزَارِيُّ، أَخْبَرَنَا يَزِيدُ بْنُ كَيْسَانَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: أَعْتَمَ رَجُلٌ عِنْدَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، ثُمَّ رَجَعَ إِلَى أَهْلِهِ فَوَجَدَ الصِّبْيَةَ قَدْ نَامُوا، فَأَتَاهُ أَهْلُهُ بِطَعَامِهِ، فَحَلَفَ لَا يَأْكُلُ مِنْ أَجْلِ صِبْيَتِهِ، ثُمَّ بَدَا لَهُ فَأَكَلَ، فَأَتَى رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ ذَلِكَ لَهُ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ حَلَفَ عَلَى يَمِينٍ، فَرَأَى غَيْرَهَا خَيْرًا مِنْهَا، فَلْيَأْتِهَا، وَلْيُكَفِّرْ عَنْ يَمِينِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "28",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 128,
                    "chapterNumber": "28",
                    "chapterEnglish": "The Book Of Oaths",
                    "chapterUrdu": "قسموں کا بیان",
                    "chapterArabic": "كتاب الْأَيْمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11836,
                "hadithNumber": "4272",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: He who took an oath and then found another thing better than (this) should expiate for the oath (broken) by him and do (the better thing).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جس نے کوئی قسم کھائی ، پھر اس کے بجائے کسی دوسرے کام کو اس سے بہتر خیال کیا تو وہ اپنی قسم کا کفارہ دے اور وہ کام کر لے.",
                "urduNarrator": "مجھ سے ابو الطاہر نے بیان کیا، کہا ہم سے عبداللہ بن وہب نے بیان کیا، کہا کہ امام مالک نے سہیل بن ابی صالح سے خبر دی ، انہوں نے اپنے والد سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي مَالِكٌ، عَنْ سُهَيْلِ بْنِ أَبِي، صَالِحٍ عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ حَلَفَ عَلَى يَمِينٍ فَرَأَى غَيْرَهَا خَيْرًا مِنْهَا فَلْيُكَفِّرْ عَنْ يَمِينِهِ وَلْيَفْعَلْ ‏\"‏ ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "28",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 128,
                    "chapterNumber": "28",
                    "chapterEnglish": "The Book Of Oaths",
                    "chapterUrdu": "قسموں کا بیان",
                    "chapterArabic": "كتاب الْأَيْمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11837,
                "hadithNumber": "4273",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who took an oath and (later on) found another thing better than that, he should do that which is better, and expiate for the vow (broken by him).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جس نے کوئی قسم کھائی ، پھر اس کے بجائے دوسرے کام کو اس سے بہتر خیال کیا تو وہ وہی کام کرے جو بہتر ہے اور اپنی قسم کا کفارہ ادا کرے.",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے ابن ابی اویس نے بیان کیا, عبدالعزیز بن مطلب نے سہیل بن ابی صالح سے روایت کی ، انہوں نے اپنے والد سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا ابْنُ أَبِي أُوَيْسٍ، حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ الْمُطَّلِبِ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ حَلَفَ عَلَى يَمِينٍ، فَرَأَى غَيْرَهَا خَيْرًا مِنْهَا، فَلْيَأْتِ الَّذِي هُوَ خَيْرٌ، وَلْيُكَفِّرْ عَنْ يَمِينِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "28",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 128,
                    "chapterNumber": "28",
                    "chapterEnglish": "The Book Of Oaths",
                    "chapterUrdu": "قسموں کا بیان",
                    "chapterArabic": "كتاب الْأَيْمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11838,
                "hadithNumber": "4274",
                "englishNarrator": "This hadith is narrated on the authority of Suhail with the same chain of transmitters (with these words):",
                "hadithEnglish": "He should expiate for (breaking) the vow and do that which is better.",
                "hadithUrdu": "\" اسے چاہئے کہ اپنی قسم کا کفارہ دے اور وہ کام کرے جو بہتر ہے.",
                "urduNarrator": "مجھ سے القاسم بن زکریا نے بیان کیا، کہا ہم سے خالد بن مخلد نے بیان کیا,سلیمان بن بلال نے مجھے سہیل سے اسی سند کے ساتھ امام مالک کی حدیث کے ہم معنی حدیث ( ان الفاظ میں ) بیان کی",
                "hadithArabic": "وحَدَّثَنِي الْقَاسِمُ بْنُ زَكَرِيَّا، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنِي سُلَيْمَانُ يَعْنِي ابْنَ بِلَالٍ، حَدَّثَنِي سُهَيْلٌ، فِي هَذَا الْإِسْنَادِ بِمَعْنَى حَدِيثِ مَالِكٍ: «فَلْيُكَفِّرْ يَمِينَهُ، وَلْيَفْعَلِ الَّذِي هُوَ خَيْرٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "28",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 128,
                    "chapterNumber": "28",
                    "chapterEnglish": "The Book Of Oaths",
                    "chapterUrdu": "قسموں کا بیان",
                    "chapterArabic": "كتاب الْأَيْمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 11526,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=461",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=459",
                "label": "459",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=460",
                "label": "460",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=461",
                "label": "461",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=462",
                "label": "462",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=463",
                "label": "463",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=464",
                "label": "464",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=465",
                "label": "465",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=463",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=463",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=461",
        "to": 11550,
        "total": 40465
    }
}