{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 454,
        "data": [
            {
                "id": 11614,
                "hadithNumber": "4050",
                "englishNarrator": "Ibn Abbas ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "This news reached 'Umar رضی اللہ عنہ that Samura رضی اللہ عنہ had sold wine, whereupon he said: May Allah destroy Samura; does he not know that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Let there be the curse of Allah upon the Jews that fat was declared forbidden for them, but they melted it and then sold it ?",
                "hadithUrdu": "حضرت عمر رضی اللہ عنہ کو اطلاع ملی کہ حضرت سمرہ رضی اللہ عنہ نے شراب فروخت کی ہے تو انہوں نے کہا : اللہ سمرہ کو ہلاک کرے! کیا وہ نہیں جانتا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ یہود پر لعنت کرے! ( کہ ) ان پر چربی حرام کی گئی تو انہوں نے اسے پھگلایا اور فروخت کیا \" ؟",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، زہیر بن حرب اور اسحاق بن ابراہیم نے بیان کیا، اور انہوں نے کہا: سفیان بن عیینہ نے ہمیں عمرو سے حدیث بیان کی ، انہوں نے طاوس سے اور انہوں نے حضرت ابن عباس رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَاللَّفْظُ لِأَبِي بَكْرٍ، قَالُوا: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ: بَلَغَ عُمَرَ أَنَّ سَمُرَةَ بَاعَ خَمْرًا، فَقَالَ: قَاتَلَ اللهُ سَمُرَةَ، أَلَمْ يَعْلَمْ أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَعَنَ اللهُ الْيَهُودَ، حُرِّمَتْ عَلَيْهِمُ الشُّحُومُ، فَجَمَلُوهَا، فَبَاعُوهَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11615,
                "hadithNumber": "4051",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of 'Amr bin Dinar with the same chain of transmitters.",
                "hadithUrdu": "ہم سے امیہ بن بسطام نے بیان کیا، کہا ہم سے یزید بن زرعی نے بیان کیا، انہوں نے بیان کیا, روح بن قاسم نے عمرو بن دینار سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا أُمَيَّةُ بْنُ بِسْطَامَ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا رَوْحٌ يَعْنِي ابْنَ الْقَاسِمِ، عَنْ عَمْرِو بْنِ دِينَارٍ بِهَذَا الْإِسْنَادِ مِثْلَهُ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11616,
                "hadithNumber": "4052",
                "englishNarrator": "Abu Huraira (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: May Allah destroy the Jews for Allah forbade the use of fats for them, but they sold them and made use of their price.",
                "hadithUrdu": "آپ نے فرمایا : \" اللہ یہود کو ہلاک کرے! اللہ نے ان پر چربی حرام کی تو انہوں نے اسے بیچا اور اس کی قیمت کھائی ۔ \"",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم الحنظَلی نے بیان کیا، کہا ہم سے روح بن عبادہ نے بیان کیا, ابن جریج نے ہمیں حدیث بیان کی ، کہا : مجھے ابن شہاب نے سعید بن مسیب سے خبر دی کہ انہوں نے انہیں ( ابن شہاب کو ) حضرت ابوہریرہ رضی اللہ عنہ کے واسطے سے رسول اللہ صلی اللہ علیہ وسلم سے حدیث بیان کی",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي ابْنُ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، أَنَّهُ حَدَّثَهُ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «قَاتَلَ اللهُ الْيَهُودَ، حَرَّمَ اللهُ عَلَيْهِمُ الشُّحُومَ، فَبَاعُوهَا وَأَكَلُوا أَثْمَانَهَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11617,
                "hadithNumber": "4053",
                "englishNarrator": "Abu Huraira (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: May Allah destroy the Jews for Allah forbade the use of fat for them, but they sold it and made use of its price.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ یہود کو ہلاک کرے! ان پر چربی حرام کی گئی تو انہوں نے اسے بیچا اور اس کی قیمت کھائی ۔ \"",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا,یونس نے مجھے ابن شہاب سے خبر دی ، انہوں نے سعید بن مسیب سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «قَاتَلَ اللهُ الْيَهُودَ، حُرِّمَ عَلَيْهِمُ الشَّحْمُ، فَبَاعُوهُ وَأَكَلُوا ثَمَنَهُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11618,
                "hadithNumber": "4054",
                "englishNarrator": "Abu Salid al-Khudri رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Do not sell gold for gold, except like for like, and don't increase something of it upon something; and don't sell silver unless like for like, and don't increase some thing of it upon something, and do not sell for ready money something to be given later.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم سونے کے عوض سونے کی بیع نہ کرو ، الا یہ کہ برابر برابر ہو اور اسے ایک دوسرے سے کم زیادہ نہ کرو اور نہ تم چاندی کی بیع چاندی کے عوض کرو ، الا یہ کہ مثل بمثل ( یکساں ) ہو اور اسے ایک دوسرے سے کم زیادہ نہ کرو اور اس میں سے جو غیر موجود ہو اس کی بیع موجود کے عوض نہ کرو ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے پڑھا امام مالک نے نافع سے اور انہوں نے حضرت ابوسعید خدری رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ نَافِعٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تَبِيعُوا الذَّهَبَ بِالذَّهَبِ، إِلَّا مِثْلًا بِمِثْلٍ، وَلَا تُشِفُّوا بَعْضَهَا عَلَى بَعْضٍ، وَلَا تَبِيعُوا الْوَرِقَ بِالْوَرِقِ، إِلَّا مِثْلًا بِمِثْلٍ، وَلَا تُشِفُّوا بَعْضَهَا عَلَى بَعْضٍ، وَلَا تَبِيعُوا مِنْهَا غَائِبًا بِنَاجِزٍ».",
                "headingArabic": "الرِّبَا ‏‏",
                "headingUrdu": "ربا (سود، سود)",
                "headingEnglish": "Riba (Usury, Interest)",
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11619,
                "hadithNumber": "4055",
                "englishNarrator": "Nafi' reported that Ibn 'Umar رضی اللہ عنہ told him:",
                "hadithEnglish": "A person of the tribe of Laith said that Abu Sa'id al-Kludri رضی اللہ عنہ narrated it (the above-mentioned hadith) from tile Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) in a narration of Qutaiba. So 'Abdulah رضی اللہ عنہ and Nafi' went along with him, and in the hadith transmitted by Ibn Rumh (the words are) that Nafi' said: 'Abdullah (bin 'Umar) رضی اللہ عنہ went and I along with the person belonging to Banu Laith entered (the house) of Sa'id al-Khudri رضی اللہ عنہ , and he ('Abdullah bin Umar رضی اللہ عنہ) said: I have been informed that you say that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) forbade the sale of silver with silver except in case of like for like, and sale of gold for gold except in case of like for like. Abu Sa'id رضی اللہ عنہ pointed towards this eyes and his ears with his fingers and said: My eyes saw, and my ears listened to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) saying: Do not sell gold for gold, and do not sell silver for silver except in case of like for like, and do not increase something of it upon something, and do not sell for ready money something, not present, but hand to hand.",
                "hadithUrdu": "حضرت ابوسعید خدری رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم سے یہ بات بیان کرتے ہیں ۔ قتیبہ کی روایت میں ہے : حضرت عبداللہ رضی اللہ عنہ چلے اور نافع بھی ساتھ تھے ۔ ۔ اور ابن رمح کی حدیث میں ہے : نافع نے کہا : حضرت عبداللہ رضی اللہ عنہ چلے ، میں اور لیثی بھی ان کے ساتھ تھے ۔ ۔ حتی کہ وہ حضرت ابوسعید خدری رضی اللہ عنہ کے ہاں آئے اور کہا : اس آدمی نے مجھے بتایا ہے کہ آپ حدیث بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے چاندی کی چاندی کے عوض بیع سے منع فرمایا ہے مگر یہ کہ برابر برابر ہو اور سونے کی سونے کے عوض بیع سے ( منع فرمایا ) الا یہ کہ برابر برابر ہو؟ حضرت ابوسعید رضی اللہ عنہ نے اپنی دو انگلیوں سے اپنی دونوں آنکھوں اور دونوں کانوں کی طرف اشارہ کیا اور کہا : میری دونوں آنکھوں نے دیکھا اور میرے دونوں کانوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ فرما رہے تھے : \" تم سونے کے عوض سونے کی اور چاندی کے عوض چاندی کی بیع نہ کرو مگر یہ کہ یکساں اور اسے ایک دوسرےسے کم زیادہ نہ کرو اور اس میں سے کسی غیر موجود چیز کی موجود کے ساتھ بیع نہ کرو ، الا یہ کہ دست بدست ہو ۔ \"",
                "urduNarrator": "قتیبہ بن سعید اور محمد بن رمح نے لیث سے حدیث بیان کی اور انہوں نے نافع سے روایت کی کہ بنو لیث کے ایک شخص نے حجرت ابن عمر رضی اللہ عنہ سے کہا",
                "hadithArabic": "دَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ، قَالَ لَهُ رَجُلٌ مِنْ بَنِي لَيْثٍ: إِنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَأْثُرُ هَذَا عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي رِوَايَةِ قُتَيْبَةَ، فَذَهَبَ عَبْدُ اللهِ، وَنَافِعٌ مَعَهُ، وَفِي حَدِيثِ ابْنِ رُمْحٍ: قَالَ نَافِعٌ: فَذَهَبَ عَبْدُ اللهِ وَأَنَا مَعَهُ وَاللَّيْثِيُّ، حَتَّى دَخَلَ عَلَى أَبِي سَعِيدٍ الْخُدْرِيِّ، فَقَالَ: إِنَّ هَذَا أَخْبَرَنِي أَنَّكَ تُخْبِرُ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الْوَرِقِ بِالْوَرِقِ إِلَّا مِثْلًا بِمِثْلٍ، وَعَنْ بَيْعِ الذَّهَبِ بِالذَّهَبِ إِلَّا مِثْلًا بِمِثْلٍ ، فَأَشَارَ أَبُو سَعِيدٍ بِإِصْبَعَيْهِ إِلَى عَيْنَيْهِ وَأُذُنَيْهِ، فَقَالَ: أَبْصَرَتْ عَيْنَايَ، وَسَمِعَتْ أُذُنَايَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا تَبِيعُوا الذَّهَبَ بِالذَّهَبِ، وَلَا تَبِيعُوا الْوَرِقَ بِالْوَرِقِ، إِلَّا مِثْلًا بِمِثْلٍ، وَلَا تُشِفُّوا بَعْضَهُ عَلَى بَعْضٍ، وَلَا تَبِيعُوا شَيْئًا غَائِبًا مِنْهُ بِنَاجِزٍ، إِلَّا يَدًا بِيَدٍ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11620,
                "hadithNumber": "4056",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Abu Sa'id al-Khudri رضی اللہ عنہ through another chain of transmitters.",
                "hadithUrdu": "ہم سے شیبان بن فرخ نے بیان کیا، انہوں نے بیان کیا جریر بن حازم ، یحییٰ بن سعید اور ابن عون ، سب نے نافع سے روایت کی ، لیث کے نافع سے ، ان کی حضرت ابوسعید خدری رضی اللہ عنہ سے اور ان کی نبی صلی اللہ علیہ وسلم سے روایت کی طرح ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا جَرِيرٌ يَعْنِي ابْنَ حَازِمٍ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ: سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنِ ابْنِ عَوْنٍ، كُلُّهُمْ عَنْ نَافِعٍ، بِنَحْوِ حَدِيثِ اللَّيْثِ، عَنْ نَافِعٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11621,
                "hadithNumber": "4057",
                "englishNarrator": "Abu Sa'id al-Khudri ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Do not sell gold for gold and silver for silver weight for weight or of the same quality.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم سونے کی سونے کے عوض اور چاندی کی چاندی کے عوض بیع نہ کرو مگر یہ کہ وزن بوزن مثل بمثل ( معیار میں یکساں ) برابر برابر ہو ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے یعقوب نے، یعنی ابن عبدالرحمٰن القاری نے، ہم سے سہیل کے واسطہ سے، وہ اپنے والد سے,حضرت ابوسعید خدری رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْقَارِيَّ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تَبِيعُوا الذَّهَبَ بِالذَّهَبِ، وَلَا الْوَرِقَ بِالْوَرِقِ، إِلَّا وَزْنًا بِوَزْنٍ، مِثْلًا بِمِثْلٍ، سَوَاءً بِسَوَاءٍ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11622,
                "hadithNumber": "4058",
                "englishNarrator": "Uthman bin 'Affan رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Do not sell a dinar for two dinars and one dirham for two dirhams.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم ایک دینار کی دو دیناروں کے عوض اور ایک درہم کی دو درہموں کے عوض بیع نہ کرو ۔ \"",
                "urduNarrator": "ہم سے ابو الطاہر، ہارون بن سعید الایلی اور احمد بن عیسیٰ نے بیان کیا، انہوں نے کہا: ہم سے ابن وہب نے بیان کیا، مجھ سے مخرمہ نے اپنے والد سے بیان کیا۔ انہوں نے کہا: میں نے سلیمان بن یسار کو کہتے سنا: انہوں نے مالک بن ابی عامر کو بیان کرتے ہوئے سنا, حضرت عثمان بن عفان رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الطَّاهِرِ، وَهَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ، وَأَحْمَدُ بْنُ عِيسَى، قَالُوا: حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي مَخْرَمَةُ، عَنْ أَبِيهِ، قَالَ: سَمِعْتُ سُلَيْمَانَ بْنَ يَسَارٍ، يَقُولُ: إِنَّهُ سَمِعَ مَالِكَ بْنَ أَبِي عَامِرٍ، يُحَدِّثُ عَنْ عُثْمَانَ بْنِ عَفَّانَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تَبِيعُوا الدِّينَارَ بِالدِّينَارَيْنِ، وَلَا الدِّرْهَمَ بِالدِّرْهَمَيْنِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11623,
                "hadithNumber": "4059",
                "englishNarrator": "Malik bin Aus bin al-Hadathan reported:",
                "hadithEnglish": "I came saying who was prepared toexchange dirhams (for my gold), whereupon Talha bin Ubaidullah (رضی اللہ عنہ) (as he was sitting with 'Umar bin Khattib رضی اللہ عنہ) said: Show us your gold and then come to us (at a later time). When our servant would come we would give you your silver (dirhams due to you). Thereupon 'Umar bin al-Khattib (رضی اللہ عنہ) said: Not at all. By Allah, either give him his silver (coins). or return his gold to him, for Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Exchange of silver for gold (has an element of) interest in it. except when (it is exchanged) on the spot; and wheat for wheat is an interest unless both are handed over on the spot: barley for barley is interest unless both are handed over on the spot; dates for dates is interest unless both are handed over on the Spot",
                "hadithUrdu": "میں ( لوگوں کے سامنے ) یہ کہتا ہوا آیا : ( سونے کے عوض ) درہموں کا تبادلہ کون کرے گا؟ تو حجرت طلحہ بن عبیداللہ رضی اللہ عنہ نے کہا ۔ ۔ اور وہ حضرت عمر بن خطاب رضی اللہ عنہ کے پاس تھے ۔ ۔ ہمیں اپنا سونا دکھاؤ ، پھر ( ذرا ٹھہر کے ) ہمارے پاس آنا ، جب ہمارا خادم آئے گا تو ہم تمہیں تمہاری چاندی ( کے درہم ) دے دیں گے ۔ اس پر عمر بن خطاب رضی اللہ عنہ نے کہا : ہرگز نہیں ، اللہ کی قسم! تم انہیں چاندی دو یا ان کا سونا انہیں واپس کرو کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے : \" سونے کے عوض چاندی ( کی بیع ) سود ہے ، الا یہ کہ ہاتھوں ہاتھ ( دست بدست ) ہو اور گندم کے عوض گندم سود ہے ، الا یہ کہ ہاتھوں ہاتھ ہو اور جو کے عوض جو سود ہے ، الا یہ کہ ہاتھوں ہاتھ ہو اور کھجور کے عوض کھجور سود ہے ، الا یہ کہ ہاتھوں ہاتھ ہو ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے لیث نے بیان کیا، اور ہم سے محمد بن رومح نے بیان کیا,لیث نے ہمیں ابن شہاب سے خبر دی اور انہوں نے مالک بن اوس بن حدثان سے روایت کی کہ انہوں نے کہا",
                "hadithArabic": "دَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ مَالِكِ بْنِ أَوْسِ بْنِ الْحَدَثَانِ، أَنَّهُ قَالَ: أَقْبَلْتُ أَقُولُ مَنْ يَصْطَرِفُ الدَّرَاهِمَ؟ فَقَالَ طَلْحَةُ بْنُ عُبَيْدِ اللهِ - وَهُوَ عِنْدَ عُمَرَ بْنِ الْخَطَّابِ -: أَرِنَا ذَهَبَكَ، ثُمَّ ائْتِنَا، إِذَا جَاءَ خَادِمُنَا، نُعْطِكَ وَرِقَكَ، فَقَالَ عُمَرُ بْنُ الْخَطَّابِ: كَلَّا، وَاللهِ لَتُعْطِيَنَّهُ وَرِقَهُ، أَوْ لَتَرُدَّنَّ إِلَيْهِ ذَهَبَهُ، فَإِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْوَرِقُ بِالذَّهَبِ رِبًا، إِلَّا هَاءَ وَهَاءَ، وَالْبُرُّ بِالْبُرِّ رِبًا، إِلَّا هَاءَ وَهَاءَ، وَالشَّعِيرُ بِالشَّعِيرِ رِبًا، إِلَّا هَاءَ وَهَاءَ، وَالتَّمْرُ بِالتَّمْرِ رِبًا، إِلَّا هَاءَ وَهَاءَ».",
                "headingArabic": "الصَّرْفِ وَبَيْعِ الذَّهَبِ بِالْوَرِقِ نَقْدًا ‏‏",
                "headingUrdu": "موقع پر چاندی کے بدلے سونے کا تبادلہ اور فروخت",
                "headingEnglish": "Exchange and Selling Gold for Silver on the spot",
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11624,
                "hadithNumber": "4060",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Zuhri with the same chain of transmitters.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ، زہیر بن حرب اور اسحاق نے بیان کیا، ابن عیینہ نے زہری سے اسی سند کے ساتھ ( یہی ) روایت بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ، عَنِ ابْنِ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ بِهَذَا الْإِسْنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11625,
                "hadithNumber": "4061",
                "englishNarrator": "Abi Qilabah reported:",
                "hadithEnglish": "I was in Syria (having) a circle (of friends). in which was Muslim b. Yasir. There came Abu'l-Ash'ath. He (the narrator) said that they (the friends) called him: Abu'l-Ash'ath, Abu'l-Ash'ath, and he sat down. I said to him: Narrate to our brother the hadith of Ubada bin Samit رضی اللہ عنہ . He said: Yes. We went out on an expedition, Mu'awiya  رضی اللہ عنہ being the leader of the people, and we gained a lot of spoils of war. And there was one silver utensil in what we took as spoils. Mu'awiya رضی اللہ عنہ ordered a person to sell it for payment to the people (soldiers). The people made haste in getting that. The news of (this state of affairs) reached 'Ubada bin Samit رضی اللہ عنہ , and he stood up and said: I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbidding the sale of gold by gold, and silver by silver, and wheat by wheat, and barley by barley, and dates by dates, and salt by salt, except like for like and equal for equal. So he who made an addition or who accepted an addition (committed the sin of taking) interest. So the people returned what they had got. This reached Mu'awiya رضی اللہ عنہ . and he stood up to deliver an address. He said: What is the matter with people that they narrate from the Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) such tradition which we did not hear though we saw him (the Holy Prophet) and lived in his company? Thereupon, Ubida bin Samit رضی اللہ عنہ stood up and repeated that narration, and then said: We will definitely narrate what we heard from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) though it may be unpleasant to Mu'awiya رضی اللہ عنہ (or he said: Even if it is against his will). I do not mind if I do not remain in his troop in the dark night. Hammad said this or something like this.",
                "hadithUrdu": "میں شام میں ایک مجلس میں تھا جس میں مسلم بن یسار بھی تھے ، اتنے میں ابواشعث آئے تو لوگوں نے کہا : ابواشعث ، ( آگئے ) میں نے کہا : ( اچھا ) ابو اشعث! وہ بیٹھ گئے تو میں نے ان سے کہا : ہمارے بھائی! ہمیں حضرت عبادہ بن صامت رضی اللہ عنہ کی حدیث بیان کیجیے ۔ انہوں نے کہا : ہاں ، ہم نے ایک غزوہ لڑا اور لوگوں کے امیر حضرت معاویہ رضی اللہ عنہ نے ایک آدمی کو حکم دیا کہ وہ انہیں لوگوں کو ملنے والے عطیات ( کے بدلے ) میں فروخت کر دے ۔ ( جب عطیات ملیں گے تو قیمت اس وقت دراہم کی صورت میں لے لی جائے گی ) لوگوں نے ان ( کو خریدنے ) میں جلدی کی ۔ یہ بات حضرت عبادہ بن صامت رضی اللہ عنہ کو پہنچی تو وہ کھڑے ہوئے اور کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ سونے کے عوض سونے کی ، چاندی کے عوض چاندی کی ، گندم کے عوض گندم کی ، جو کے عوض جو کی ، کھجور کے عوض کھجور کی اور نمک کے عوض نمک کی بیع سے منع فرما رہے تھے ، الا یہ کہ برابر برابر ، نقد بنقد ہو ۔ جس نے زیادہ دیا یا زیادہ لیا تو اس نے سود کا لین دین کیا ۔ ( یہ سن کر ) لوگوں نے جو لیا تھا واپس کر دیا ۔ حضرت معاویہ رضی اللہ عنہ کو یہ بات پہنچی تو وہ خطبہ دینے کے لیے کھڑے ہوئے اور کہا : سنو! لوگوں کا حال کیا ہے! وہ رسول اللہ صلی اللہ علیہ وسلم سے احادیث بیان کرتے ہیں ، ہم بھی آپ کے پاس حاضر ہوتے اور آپ کے ساتھ رہتے تھے لیکن ہم نے آپ سے وہ ( احادیث ) نہیں سنیں ۔ اس پر حضرت عبادہ بن صامت رضی اللہ عنہ کھڑے ہو گئے ، ( رسول اللہ صلی اللہ علیہ وسلم سے سنا ہوا ) سارا واقعہ دہرایا اور کہا : ہم وہ احادیث ضرور بیان کریں گے جو ہم نے رسول اللہ صلی اللہ علیہ وسلم سے سنیں ، خواہ معاویہ رضی اللہ عنہ ناپسند کریں ۔ ۔ یا کہا : خواہ ان کی ناک خاک آلود ہو ۔ ۔ مجھے پروا نہیں کہ میں ان کے لشکر میں ان کے ساتھ ایک سیاہ رات بھی نہ رہوں ۔ حماد نے کہا : یہ ( کہا : ) یا اس کے ہم معنی ۔",
                "urduNarrator": "ہم سے عبید اللہ بن عمر القواری نے بیان کیا, حماد بن زید نے ہمیں ایوب سے حدیث بیان کی اور انہوں نے ابوقلابہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلَابَةَ، قَالَ: كُنْتُ بِالشَّامِ فِي حَلْقَةٍ فِيهَا مُسْلِمُ بْنُ يَسَارٍ، فَجَاءَ أَبُو الْأَشْعَثِ، قَالَ: قَالُوا: أَبُو الْأَشْعَثِ، أَبُو الْأَشْعَثِ، فَجَلَسَ، فَقُلْتُ لَهُ: حَدِّثْ أَخَانَا حَدِيثَ عُبَادَةَ بْنِ الصَّامِتِ، قَالَ: نَعَمْ، غَزَوْنَا غَزَاةً وَعَلَى النَّاسِ مُعَاوِيَةُ، فَغَنِمْنَا غَنَائِمَ كَثِيرَةً، فَكَانَ فِيمَا غَنِمْنَا آنِيَةٌ مِنْ فِضَّةٍ، فَأَمَرَ مُعَاوِيَةُ رَجُلًا أَنْ يَبِيعَهَا فِي أَعْطِيَاتِ النَّاسِ، فَتَسَارَعَ النَّاسُ فِي ذَلِكَ، فَبَلَغَ عُبَادَةَ بْنَ الصَّامِتِ، فَقَامَ، فَقَالَ: إِنِّي سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «يَنْهَى عَنْ بَيْعِ الذَّهَبِ بِالذَّهَبِ، وَالْفِضَّةِ بِالْفِضَّةِ، وَالْبُرِّ بِالْبُرِّ، وَالشَّعِيرِ بِالشَّعِيرِ، وَالتَّمْرِ بِالتَّمْرِ، وَالْمِلْحِ بِالْمِلْحِ، إِلَّا سَوَاءً بِسَوَاءٍ، عَيْنًا بِعَيْنٍ، فَمَنْ زَادَ، أَوِ ازْدَادَ، فَقَدْ أَرْبَى»، فَرَدَّ النَّاسُ مَا أَخَذُوا، فَبَلَغَ ذَلِكَ مُعَاوِيَةَ فَقَامَ خَطِيبًا، فَقَالَ: أَلَا مَا بَالُ رِجَالٍ يَتَحَدَّثُونَ عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَحَادِيثَ قَدْ كُنَّا نَشْهَدُهُ وَنَصْحَبُهُ فَلَمْ نَسْمَعْهَا مِنْهُ، فَقَامَ عُبَادَةُ بْنُ الصَّامِتِ فَأَعَادَ الْقِصَّةَ، ثُمَّ قَالَ: لَنُحَدِّثَنَّ بِمَا سَمِعْنَا مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَإِنْ كَرِهَ مُعَاوِيَةُ - أَوْ قَالَ: وَإِنْ رَغِمَ - مَا أُبَالِي أَنْ لَا أَصْحَبَهُ فِي جُنْدِهِ لَيْلَةً سَوْدَاءَ ، قَالَ حَمَّادٌ هَذَا أَوْ نَحْوَه.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11626,
                "hadithNumber": "4062",
                "englishNarrator": null,
                "hadithEnglish": "The above hadith is likewise narrated through another chain of transmission on the authority of Abi Qilabah.",
                "hadithUrdu": "ہم سے اسحاق بن ابراہیم اور ابن ابی عمر نے بیان کیا, عبدالوہاب ثقفی نے ایوب سے اسی سند کے ساتھ اسی کی طرح روایت بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ أَبِي عُمَرَ، جَمِيعًا عَنْ عَبْدِ الْوَهَّابِ الثَّقَفِيِّ، عَنْ أَيُّوبَ بِهَذَا الْإِسْنَادِ نَحْوَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11627,
                "hadithNumber": "4063",
                "englishNarrator": "Ubida bin al-Simit ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Gold is to be paid for by gold, silver by silver, wheat by wheat, barley by barley, dates by dates, and salt by salt, like for like and equal for equal, payment being made hand to hand. If these classes differ, then sell as you wish if payment is made hand to hand.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" سونے کے عوض سونا ، چاندی کے عوض چاندی ، گندم کے عوض گندم ، جو کے عوض جو ، کھجور کے عوض کھجور اور نمک کے عوض نمک ( کا لین دین ) مثل بمثل ، یکساں ، برابر برابر اور نقد بنقد ہے ۔ جب اصناف مختلف ہوں تو جیسے چاہو بیع کرو بشرطیکہ وہ دست بدست ہو ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، عمرو الناقد اور اسحاق بن ابراہیم نے بیان کیا اور یہ قول ابن ابی شیبہ نے کہا,خالد حذاء نے ابوقلابہ سے ، انہوں نے ابواشعث سے اور انہوں نے حضرت عبادہ بن صامت رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَاللَّفْظُ لِابْنِ أَبِي شَيْبَةَ، قَالَ إِسْحَاقُ: أَخْبَرَنَا، وَقَالَ الْآخَرَانِ: حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ أَبِي قِلَابَةَ، عَنْ أَبِي الْأَشْعَثِ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الذَّهَبُ بِالذَّهَبِ، وَالْفِضَّةُ بِالْفِضَّةِ، وَالْبُرُّ بِالْبُرِّ، وَالشَّعِيرُ بِالشَّعِيرِ، وَالتَّمْرُ بِالتَّمْرِ، وَالْمِلْحُ بِالْمِلْحِ، مِثْلًا بِمِثْلٍ، سَوَاءً بِسَوَاءٍ، يَدًا بِيَدٍ، فَإِذَا اخْتَلَفَتْ هَذِهِ الْأَصْنَافُ، فَبِيعُوا كَيْفَ شِئْتُمْ، إِذَا كَانَ يَدًا بِيَدٍ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11628,
                "hadithNumber": "4064",
                "englishNarrator": "Abu Sa'id al-Khudri (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Gold is to be paid for by gold, silver by silver, wheat by wheat, barley by barley, dates by dates, salt by salt, like by like, payment being made hand to hand. He who made an addition to it, or asked for an addition, in fact dealt in usury. The receiver and the giver are equally guilty.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" سونے کے عوض سونا ، چاندی کے عوض چاندی ، گندم کے عوض گندم ، جو کے عوض جو ، کھجور کے عوض کھجور اور نمک کے عوض نمک ( کی بیع ) مثل بمثل ( ایک جیسی ) ہاتھوں ہاتھ ہو ۔ جس نے زیادہ دیا یا زیادہ لیا اس نے سود کا لین دین کیا ، اس میں لینے والا اور دینے والا برابر ہیں ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے وکیع نے بیان کیا,اسماعیل بن مسلم عبدی نے ہمیں حدیث بیان کی ، کہا : ہمیں ابومتوکل ناجی نے حضرت ابوسعید خدری رضی اللہ عنہ سے حدیث بیان کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ مُسْلِمٍ الْعَبْدِيُّ، حَدَّثَنَا أَبُو الْمُتَوَكِّلِ النَّاجِيُّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الذَّهَبُ بِالذَّهَبِ، وَالْفِضَّةُ بِالْفِضَّةِ، وَالْبُرُّ بِالْبُرِّ، وَالشَّعِيرُ بِالشَّعِيرِ، وَالتَّمْرُ بِالتَّمْرِ، وَالْمِلْحُ بِالْمِلْحِ، مِثْلًا بِمِثْلٍ، يَدًا بِيَدٍ، فَمَنْ زَادَ، أَوِ اسْتَزَادَ، فَقَدْ أَرْبَى، الْآخِذُ وَالْمُعْطِي فِيهِ سَوَاءٌ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11629,
                "hadithNumber": "4065",
                "englishNarrator": "It was narrated that Abu Saeed al-Khudri (رضی اللہ عنہ) said:",
                "hadithEnglish": "\"The Messenger of Allah ﷺ said: 'Gold for gold, like for like....\" a similar hadith (as no. 4064).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" سونے کے عوض سونے ( کی بیع ) برابر مثل بمثل ( ایک جیسی ) ہے ۔ ۔ ۔ \" ( آگے ) سابقہ حدیث کے مانند بیان کیا ۔",
                "urduNarrator": "ہم سے عمرو الناقد نے بیان کیا، کہا ہم سے یزید بن ہارون نے بیان کیا،سلیمان ربعی نے ہمیں خبر دی ، کہا : ہمیں ابومتوکل ناجی نے حضترت ابوسعید خدری رضی اللہ عنہ سے حدیث بیان کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا سُلَيْمَانُ الرَّبَعِيُّ، حَدَّثَنَا أَبُو الْمُتَوَكِّلِ النَّاجِيُّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الذَّهَبُ بِالذَّهَبِ، مِثْلًا بِمِثْلٍ» فَذَكَرَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11630,
                "hadithNumber": "4066",
                "englishNarrator": "Abu Huraira (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Dates are to be paid for by dates, wheat by wheat, barley by barley, salt by salt, like for like, payment being made on the spot. He who made an addition or demanded an addition, in fact, dealt in usury except in case where their classes differ.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کھجور کے عوض کھجور ، گندم کے عوض گندم ، جو کے عوض جو اور نمک کے عوض نمک ( کی بیع ) مثل بمثل ( ایک جیسی ) دست بدست ہو ۔ جس نے زیادہ دیا یا زیادہ لیا اس نے سود کا ( لین دین ) کیا ، الا یہ کہ ان کی اجناس الگ الگ ہوں ۔ \"",
                "urduNarrator": "ہم سے ابو کریب محمد بن العلاء اور واصل بن عبد العلا نے بیان کیا، انہوں نے کہا: فضیل کے بیٹے ( محمد ) نے ہمیں اپنے والد سے حدیث بیان کی ، انہوں نے ابوزرعہ سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ، وَوَاصِلُ بْنُ عَبْدِ الْأَعْلَى، قَالَا: حَدَّثَنَا ابْنُ فُضَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «التَّمْرُ بِالتَّمْرِ، وَالْحِنْطَةُ بِالْحِنْطَةِ، وَالشَّعِيرُ بِالشَّعِيرِ، وَالْمِلْحُ بِالْمِلْحِ، مِثْلًا بِمِثْلٍ، يَدًا بِيَدٍ، فَمَنْ زَادَ، أَوِ اسْتَزَادَ، فَقَدْ أَرْبَى، إِلَّا مَا اخْتَلَفَتْ أَلْوَانُهُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11631,
                "hadithNumber": "4067",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Fudail bin Ghazwan with the same chain of transmitters, but he made no mention of (payment being) made on the spot.",
                "hadithUrdu": "ابو سعید اشج نے مجھ سے کہا,محاربی نے فضیل بن گزوان سے اسی سند کے ساتھ حدیث بیان کی اور انہوں نے \" دست بدست \" کے الفاظ بیان نہیں کیے ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِيهِ أَبُو سَعِيدٍ الْأَشَجُّ، حَدَّثَنَا الْمُحَارِبِيُّ، عَنْ فُضَيْلِ بْنِ غَزْوَانَ، بِهَذَا الْإِسْنَادِ، وَلَمْ يَذْكُرْ يَدًا بِيَدٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11632,
                "hadithNumber": "4068",
                "englishNarrator": "Abu Huraira ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Gold is to be paid for by gold with equal weight, like for like, and silver is to be paid for by silver with equal weight, like for like. He who made an addition to it or demanded an addition dealt in usury.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" سونے کے عوض سونے کی بیع ہم وزن اور مثل بمثل ( ایک جیسی ) ہے اور چاندی کے عوض چاندی ہم وزن اور مثل بمثل ہے ۔ جس نے زیادہ دیا یا زیادہ لیا تو وہ سود ہے ۔ \"",
                "urduNarrator": "ہم سے ابو کریب اور واصل بن عبد الاعلٰی نے بیان کیا، کہا: ہم سے ابن فضیل نے اپنے والد سے بیان کیا،ابن ابی نُعیم نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو كُرَيْبٍ، وَوَاصِلُ بْنُ عَبْدِ الْأَعْلَى، قَالَا: حَدَّثَنَا ابْنُ فُضَيْلٍ، عَنْ أَبِيهِ، عَنِ ابْنِ أَبِي نُعْمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الذَّهَبُ بِالذَّهَبِ وَزْنًا بِوَزْنٍ، مِثْلًا بِمِثْلٍ، وَالْفِضَّةُ بِالْفِضَّةِ وَزْنًا بِوَزْنٍ، مِثْلًا بِمِثْلٍ، فَمَنْ زَادَ أَوِ اسْتَزَادَ فَهُوَ رِبًا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11633,
                "hadithNumber": "4069",
                "englishNarrator": "Abu Huraira (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Let dinar be exchanged for dinar, with no addition on either side and dirham be exchanged for dirham with no addition on either side.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" دینار سے دینار کی بیع میں ان کے درمیان اضافہ ( جائز ) نہیں اور درہم سے درہم کے تبادلے میں ان کے درمیان اضافہ ( جائز ) نہیں ۔ \"",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ القنبی نے بیان کیا, سلیمان بن ہلال نے ہمیں موسیٰ بن ابی تمیم سے حدیث بیان کی ، انہوں نے سعید بن یسار سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ، حَدَّثَنَا سُلَيْمَانُ يَعْنِي ابْنَ بِلَالٍ، عَنْ مُوسَى بْنِ أَبِي تَمِيمٍ، عَنْ سَعِيدِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الدِّينَارُ بِالدِّينَارِ لَا فَضْلَ بَيْنَهُمَا، وَالدِّرْهَمُ بِالدِّرْهَمِ لَا فَضْلَ بَيْنَهُمَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11634,
                "hadithNumber": "4070",
                "englishNarrator": null,
                "hadithEnglish": "Musa bin Abi Tamim narrated a similar report (as Hadith no. 4069) with this chain.",
                "hadithUrdu": "مجھ سے ابو الطاہر نے بیان کیا، کہا ہم سے عبداللہ بن وہب نے بیان کیا، انہوں نے کہا: امام مالک بن انس رضی اللہ عنہ نے کہا : مجھے موسیٰ بن ابی تمیم نے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "دَّثَنِيهِ أَبُو الطَّاهِرِ، أَخْبَرَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، قَالَ: سَمِعْتُ مَالِكَ بْنَ أَنَسٍ، يَقُولُ: حَدَّثَنِي مُوسَى بْنُ أَبِي تَمِيمٍ، بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11635,
                "hadithNumber": "4071",
                "englishNarrator": "Abu Minhal reported:",
                "hadithEnglish": "My partner sold silver to be paid in the (Hajj) season or (in the days of) Hajj. He (my partner) came to me and informed me, and I said to him: Such transaction is not desirable. He said: I sold it in the market (on loan) but nobody objected to this. I went to al-Bara' bin 'Azib رضی اللہ عنہ and asked him, and he said: Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came to Medina and we made such transaction, whereupon he said: In case the payment is made on the spot, there is no harm in it, and in case (it is 'sold) on loan, it is usury. You better go to Zaid bin Arqam رضی اللہ عنہ , for he is a greater trader than I; so I went to him and asked him, and he said like it.",
                "hadithUrdu": "میرے ایک شریک نے موسم ( حج کے موسم ) تک یا حج تک چاندی ادھار فروخت کی ، وہ میرے پاس آیا اور مجھے بتایا تو میں نے کہا : یہ معاملہ درست نہیں ۔ اس نے کہا : میں نے وہ بازار میں فروخت کی ہے اور اسے کسی نے میرے سامنے ناقابل قبول قرار نہیں دیا ۔ اس پر میں حضرت براء بن عازب رضی اللہ عنہ کے پاس آیا اور ان سے پوچھا تو انہوں نے کہا : نبی صلی اللہ علیہ وسلم مدینہ تشریف لائے اور ہم یہ بیع کیا کرتے تھے تو آپ نے فرمایا : \" جو دست بدست ہے اس میں کوئی حرج نہیں اور جو ادھار ہے وہ سود ہے ۔ \" زید بن ارقم رضی اللہ عنہ کے پاس جاؤ اور ان کا کاروبار مجھ سے وسیع ہے ، چنانچہ میں ان کے پاس آیا اور ان سے پوچھا تو انہوں نے بھی اسی کے مانند کہا ۔",
                "urduNarrator": "ہم سے محمد بن حاتم بن میمون نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا,عمرو ( بن دینار ) نے ابومنہال سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ مَيْمُونٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، عَنْ أَبِي الْمِنْهَالِ، قَالَ: بَاعَ شَرِيكٌ لِي وَرِقًا بِنَسِيئَةٍ إِلَى الْمَوْسِمِ، أَوْ إِلَى الْحَجِّ، فَجَاءَ إِلَيَّ فَأَخْبَرَنِي، فَقُلْتُ: هَذَا أَمْرٌ لَا يَصْلُحُ، قَالَ: قَدْ بِعْتُهُ فِي السُّوقِ، فَلَمْ يُنْكِرْ ذَلِكَ عَلَيَّ أَحَدٌ، فَأَتَيْتُ الْبَرَاءَ بْنَ عَازِبٍ، فَسَأَلْتُهُ، فَقَالَ: قَدِمَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ وَنَحْنُ نَبِيعُ هَذَا الْبَيْعَ، فَقَالَ: «مَا كَانَ يَدًا بِيَدٍ فَلَا بَأْسَ بِهِ، وَمَا كَانَ نَسِيئَةً فَهُوَ رِبًا»، وَائْتِ زَيْدَ بْنَ أَرْقَمَ، فَإِنَّهُ أَعْظَمُ تِجَارَةً مِنِّي، فَأَتَيْتُهُ فَسَأَلْتُهُ، فَقَالَ: مِثْلَ ذَلِكَ.",
                "headingArabic": "النَّهْىِ عَنْ بَيْعِ الْوَرِقِ، بِالذَّهَبِ دَيْنًا ‏‏",
                "headingUrdu": "سونے کے بدلے چاندی بیچنے کی ممانعت بعد کی تاریخ میں ادا کی جائے۔",
                "headingEnglish": "The Prohibition of selling silver for gold to be paid at a later date",
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11636,
                "hadithNumber": "4072",
                "englishNarrator": "Habib reported that he heard Abu Minhal as saying:",
                "hadithEnglish": "I asked al-Bara' bin Azib رضی اللہ عنہ about the exchange of (gold for silver or vice versa), whereupon he said: you better ask Zaid bin Arqam رضی اللہ عنہ for he knows more than I. So I asked Zaid but he said: You better ask al-Bara' for he knows more than I. Then both of them said: Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade the sale of silver for gold when payment is to be made in future.",
                "hadithUrdu": "میں نے حضرت براء بن عازب رضی اللہ عنہ سے دینار کی درہم سے یا سونے کی چاندی سے بیع کے بارے میں پوچھا تو انہوں نے کہا : زید بن ارقم سے پوچھو ، وہ زیادہ جاننے والے ہیں ، چنانچہ میں نے حضرت زید رضی اللہ عنہ سے پوچھا تو انہوں نے کہا : براء سے پوچھو ، وہ زیادہ جاننے والے ہیں ، پھر دونوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے سونے کے عوض چاندی کی ادھار بیع سے منع فرمایا ۔",
                "urduNarrator": "ہم سے عبید اللہ بن معاذ الانبری نے بیان کیا، کہا ہم سے میرے والد نے بیان کیا، ہم سے شعبہ رضی اللہ عنہ نے بیان کیا, حبیب سے روایت ہے کہ انہوں نے ابومنہال سے سنا ، وہ کہہ رہے تھے",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ حَبِيبٍ، أَنَّهُ سَمِعَ أَبَا الْمِنْهَالِ، يَقُولُ: سَأَلْتُ الْبَرَاءَ بْنَ عَازِبٍ عَنِ الصَّرْفِ، فَقَالَ: سَلْ زَيْدَ بْنَ أَرْقَمَ، فَهُوَ أَعْلَمُ، فَسَأَلْتُ زَيْدًا، فَقَالَ: سَلِ الْبَرَاءَ، فَإِنَّهُ أَعْلَمُ، ثُمَّ قَالَا: «نَهَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الْوَرِقِ بِالذَّهَبِ دَيْنًا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11637,
                "hadithNumber": "4073",
                "englishNarrator": "Abdul-Rahman bin Abi Bakra reported on the authority of his father:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade the sale of gold for gold, and silver for silver except equal for equal, and commanded us to buy silver for gold as we desired and buy gold for silver as we desired. A person asked him (about the nature of payment), whereupon he said: It is to be made on the spot. This is what I heard (from Allah's Messenger (ﷺ).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے چاندی کے عوض چاندی اور سونے کے عوض سونے کی بیع سے منع فرمایا ، الا یہ کہ برابر برابر ہو اور آپ نے ہمیں حکم دیا کہ ہم سونے کے عوض چاندی جیسے چاہیں خریدیں اور چاندی کے عوض سونا جیسے چاہیں خریدیں ۔ کہا : اس پر ایک آدمی نے ان سے سوال کیا اور کہا : دست بدست؟ تو انہوں نے کہا : میں نے اسی طرح سنا ہے ۔",
                "urduNarrator": "ابو الربیع العتکی نے ہمیں بتایا, عباد بن عوام نے کہا : یحییٰ بن ابی اسحاق نے ہمیں خبر دی ، انہوں نے کہا : ہمیں عبدالرحمٰن بن ابی بکرہ نے اپنے والد سے حدیث بیان کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو الرَّبِيعِ الْعَتَكِيُّ، حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ، أَخْبَرَنَا يَحْيَى بْنُ أَبِي إِسْحَاقَ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرَةَ، عَنْ أَبِيهِ، قَالَ: «نَهَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، عَنِ الْفِضَّةِ بِالْفِضَّةِ، وَالذَّهَبِ بِالذَّهَبِ، إِلَّا سَوَاءً بِسَوَاءٍ، وَأَمَرَنَا أَنْ نَشْتَرِيَ الْفِضَّةَ بِالذَّهَبِ كَيْفَ شِئْنَا، وَنَشْتَرِيَ الذَّهَبَ بِالْفِضَّةِ كَيْفَ شِئْنَا»، قَالَ: فَسَأَلَهُ رَجُلٌ، فَقَالَ: يَدًا بِيَدٍ؟ فَقَالَ: «هَكَذَا سَمِعْتُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11638,
                "hadithNumber": "4074",
                "englishNarrator": null,
                "hadithEnglish": "same as above Abdul-Rahman bin Abu Bakra رضی اللہ عنہ said: Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) prohibited us. The rest of the hadith is the same.",
                "hadithUrdu": "مجھ سے اسحاق بن منصور نے بیان کیا، کہا ہم سے یحییٰ بن صالح نے بیان کیا، ہم سے معاویہ نے بیان کیا, یحییٰ بن ابی کثیر نے یحییٰ بن ابی اسحاق سے روایت کی کہ انہیں عبدالرحمن بن ابی بکرہ نے بتایا کہ حضرت ابوبکرہ رضی اللہ عنہ نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے ہمیں منع فرمایا ۔ ۔ ( آگے ) اسی کے مانند ہے ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا يَحْيَى بْنُ صَالِحٍ، حَدَّثَنَا مُعَاوِيَةُ، عَنْ يَحْيَى وَهُوَ ابْنُ أَبِي كَثِيرٍ، عَنْ يَحْيَى بْنِ أَبِي إِسْحَاقَ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرَةَ، أَخْبَرَهُ أَنَّ أَبَا بَكْرَةَ، قَالَ: نَهَانَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 11326,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=453",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=451",
                "label": "451",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=452",
                "label": "452",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=453",
                "label": "453",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=454",
                "label": "454",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=455",
                "label": "455",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=456",
                "label": "456",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=457",
                "label": "457",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=455",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=455",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=453",
        "to": 11350,
        "total": 40465
    }
}