{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 507,
        "data": [
            {
                "id": 12939,
                "hadithNumber": "5376",
                "englishNarrator": null,
                "hadithEnglish": "A similar report was narrated from Jabir, but he did not mention Ibn Umar رضی اللہ عنہ .",
                "hadithUrdu": "ابن نمیر نے ہمیں حدیث بیان کی کہا : ہمیں میرے والد نے حدیث بیان کی ، کہا : ہمیں سفیان نے ابو زبیر سےحدیث بیان کی ، انھوں نے حضرت جابر سے انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ، انھوں ( ابن نمیر ) نے حضرت ابن عمر رضی اللہ عنہ کا ذکر نہیں کیا ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا سُفْيَانُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ وَلَمْ يَذْكُرْ ابْنَ عُمَرَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12940,
                "hadithNumber": "5377",
                "englishNarrator": "Abu Musa رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: A believer eats in one intestine, whereas a non-believer eats in seven intestines.",
                "hadithUrdu": "آپ نے فرما یا : \" مومن ایک آنت میں کھا تا ہے جبکہ کا فر سات آنتوں میں کھا تا ہے ۔ \"",
                "urduNarrator": "ہم سے ابو کریب محمد بن الاعلٰی نے بیان کیا، کہا ہم سے ابو اسامہ نے بیان کیا، کہا ہم سے برید نے اپنے دادا کی سند سے بیان کیا, حضرت ابو موسیٰ رضی اللہ عنہ نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنَا بُرَيْدٌ عَنْ جَدِّهِ عَنْ أَبِي مُوسَى عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمُؤْمِنُ يَأْكُلُ فِي مِعًى وَاحِدٍ وَالْكَافِرُ يَأْكُلُ فِي سَبْعَةِ أَمْعَاءٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12941,
                "hadithNumber": "5378",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Abu Huraira رضی اللہ عنہ with a different chain of transmitters.",
                "hadithUrdu": "ہم سے قتیبہ بن سعید نے بیان کیا, عبد العز یز بن محمد نے ابو علاء سے انھوں نے اپنے والد سےانھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے انھوں نے نبی صلی اللہ علیہ وسلم سے ان سب کی حدیث کے مانند روایت کی .",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُحَمَّدٍ عَنْ الْعَلَاءِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِهِمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12942,
                "hadithNumber": "5379",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) invited a non-Muslim. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) commanded that a goat be milked for him. It was milked and he drank its milk. Then the second one was milked and he drank its milk, and then the other one was milked and he drank its milk. till he drank the milk of seven goats. On the next morning he embraced Islam. And Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) commanded that a goat should be milked for him and he drank its milk and then another was milked but he did not finish it, whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: A believer drinks In one intestine whereas a non-believer drinks in seven intestines.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم کے پاس ایک مہمان آیا وہ شخص کا فر تھا رسول اللہ صلی اللہ علیہ وسلم نے اس کے لیے ایک بکری کا دودھ دوہنے کا حکم دیا اس نے دودھ پی لیا پھر دوسری بکری کا دودھ دوہنے کا حکم دیا اس نے اس کو بھی پی لیا ، پھر ایک اور ( بکری کا دودھ دوہنے ) کا حکم دیا اس نے اس کا بھی پی لیا ، حتی کہ اس نے اسی طرح سات بکریوں کا دودھ پی لیا پھر اس نے صبح کی توسلام لے آیا رسول اللہ صلی اللہ علیہ وسلم نے اس کے لیے ایک بکری کا دودھ دوہنے کا حکم دیا اس نے وہ دودھ پی لیا پھر دوسری بکری کا دودھ دوہنے کا حکم دیا ، وہ اس کا سارا دودھ نہ پی سکا تو رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" مسلمان ایک آنت میں پیتا ہے جبکہ کافر سات آنتوں میں پیتا ہے ۔",
                "urduNarrator": "اور مجھ سے محمد بن رافع نے بیان کیا، ہم سے اسحاق بن عیسیٰ نے بیان کیا، ہم سے مالک نے بیان کیا, سہیل بن ابو صالح نے اپنے والد سے انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہ",
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا إِسْحَقُ بْنُ عِيسَى أَخْبَرَنَا مَالِكٌ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَافَهُ ضَيْفٌ وَهُوَ كَافِرٌ فَأَمَرَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشَاةٍ فَحُلِبَتْ فَشَرِبَ حِلَابَهَا ثُمَّ أُخْرَى فَشَرِبَهُ ثُمَّ أُخْرَى فَشَرِبَهُ حَتَّى شَرِبَ حِلَابَ سَبْعِ شِيَاهٍ ثُمَّ إِنَّهُ أَصْبَحَ فَأَسْلَمَ فَأَمَرَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشَاةٍ فَشَرِبَ حِلَابَهَا ثُمَّ أَمَرَ بِأُخْرَى فَلَمْ يَسْتَتِمَّهَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُؤْمِنُ يَشْرَبُ فِي مِعًى وَاحِدٍ وَالْكَافِرُ يَشْرَبُ فِي سَبْعَةِ أَمْعَاءٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12943,
                "hadithNumber": "5380",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) never found fault with food (served to him). If he liked anything, he ate it and if he did not like it he left it.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے کبھی کسی کھانے میں عیب نہیں نکا لا اگرکو ئی چیز آپ کو پسند آتی تو آپ اس کو کھا لیتے اور اگر ناپسند ہو تی تو اسے چھوڑ دیتے ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ، زہیر بن حرب اور اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے انہوں نے بیان کیا اور باقی دو نے کہا, جریر نے اعمش سےانھوں نے ابو حازم سے انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَزُهَيْرُ بْنُ حَرْبٍ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ زُهَيْرٌ حَدَّثَنَا و قَالَ الْآخَرَانِ أَخْبَرَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَ مَا عَابَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَعَامًا قَطُّ كَانَ إِذَا اشْتَهَى شَيْئًا أَكَلَهُ وَإِنْ كَرِهَهُ تَرَكَهُ.",
                "headingArabic": "لاَ يَعِيبُ الطَّعَامَ",
                "headingUrdu": "کھانے پر تنقید نہ کریں ۔",
                "headingEnglish": "Do not criticize food",
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12944,
                "hadithNumber": "5381",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of A'mash with the same chain of transmitters.",
                "hadithUrdu": "ہم سے احمد بن یونس نے بیان کیا, زہیر نے ہمیں سلیمان اعمش سے اسی سند کے ساتھ اسی کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا سُلَيْمَانُ الْأَعْمَشُ بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12945,
                "hadithNumber": "5382",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been narrated on the authority of A'mash.",
                "hadithUrdu": "اورہم سے عبد بن حمید نے بیان کیا,  ہم سے عبد الرزاق، عبد الملک بن عمرو اور عمر بن سعد ابوداؤد حفری نے بیان کیا, سفیان نے اعمش سے اسی سند کے ساتھ اسی کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ وَعَبْدُ الْمَلِكِ بْنُ عَمْرٍو وَعُمَرُ بْنُ سَعْدٍ أَبُو دَاوُدَ الْحَفَرِيُّ كُلُّهُمْ عَنْ سُفْيَانَ عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ نَحْوَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12946,
                "hadithNumber": "5383",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "I never saw Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) finding fault with food (served to him) ; if he liked it he ate it, and if did not like it he kept silent.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو نہیں دیکھا کہ آپ نے کبھی کسی کھا نے میں عیب نکا لا ہو ۔ اگر آپ کو کوئی کھا نا مرغوب ہوتا ( اچھالگتا ) تو اسے کھا لیتے اور اچھا نہ لگتا تو خاموش رہتے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، ابو کریب، محمد بن المثنی، عمرو ناقد اور تلفظ ابو کریب نے بیان کیا، انہوں نے کہا: ہمیں ابو کریب نے خبر دی۔ ہم سے معاویہ الاعمش نے ابو یحییٰ کی سند سے بیان کیا, آل جعدہ کے آزاد کردہ غلام ابو یحییٰ نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ وَمُحَمَّدُ بْنُ الْمُثَنَّى وَعَمْرٌو النَّاقِدُ وَاللَّفْظُ لِأَبِي كُرَيْبٍ قَالُوا أَخْبَرَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي يَحْيَى مَوْلَى آلِ جَعْدَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ مَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَابَ طَعَامًا قَطُّ كَانَ إِذَا اشْتَهَاهُ أَكَلَهُ وَإِنْ لَمْ يَشْتَهِهِ سَكَتَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12947,
                "hadithNumber": "5384",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Abu Huraira رضی اللہ عنہ through a different chain of transmitters.",
                "hadithUrdu": "ہم سے ابو کریب اور محمد بن المثنی نے بیان کیا، کہا: ہم سے ابو معاویہ نے العمش کی سند سے بیان کیا, ابو حازم نے حضرت ابو ہریرہ رضی اللہ عنہ سے انھوں نے نبی صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَاه أَبُو كُرَيْبٍ وَمُحَمَّدُ بْنُ الْمُثَنَّى قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12948,
                "hadithNumber": "5385",
                "englishNarrator": "Umm Salama رضی اللہ عنہا the wife of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), said:",
                "hadithEnglish": "He who drinks in the vessel of silver in fact drinks down in his belly the fire of Hell.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" جو شخص چاندی کے برتن میں پیتا ہے وہ اپنے پیٹ میں غٹاغٹ جہنم کی آگ بھر رہا ہے ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا, امام مالک نے نافع سے ، انھوں نے زید بن عبد اللہ سے ، انھوں نے عبد اللہ بن عبد الرحمٰن بن ابوبکرصدیق سے ، انھوں نے نبی صلی اللہ علیہ وسلم کی اہلیہ حضرت ام سلمہ رضی اللہ عنہا سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ عَنْ زَيْدِ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ الصِّدِّيقِ عَنْ أُمِّ سَلَمَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الَّذِي يَشْرَبُ فِي آنِيَةِ الْفِضَّةِ إِنَّمَا يُجَرْجِرُ فِي بَطْنِهِ نَارَ جَهَنَّمَ.",
                "headingArabic": "تَحْرِيمِ أَوَانِي الذَّهَبِ وَالْفِضَّةِ فِي الشُّرْبِ وَغَيْرِهِ عَلَى الرِّجَالِ وَالنِّسَاءِ ‏‏",
                "headingUrdu": "سونے اور چاندی کے برتنوں کو پینے وغیرہ کے لیے مردوں اور عورتوں کے لیے استعمال کرنے کی ممانعت",
                "headingEnglish": "The Prohibition Of Using Vessels Of Gold And Silver For Drinking Etc., For Men And Women",
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12949,
                "hadithNumber": "5386",
                "englishNarrator": "This hadith has been narrated through other chains of transmitters. The hadith of Ibn Mushir on the authority of 'Ubaidullah it is as:",
                "hadithEnglish": "He who eats or drinks in the vessel of silver and gold, - but there is no mention in any one of the other chains of the words pertaining to eating and gold.",
                "hadithUrdu": "\" بلا شبہ جو شخص چاندی یا سونے کے برتن میں کھا تا یا پیتا ہے ۔ \" ان میں سے اور کسی کی حدیث میں کھانے اور سونے ( کےبرتن ) کا ذکر نہیں ۔ صرف ابن مسہرکی حدیث میں ہے ۔",
                "urduNarrator": "قتیبہ اور محمد بن رمح نے ہمیں لیث بن سعد سے یہی حدیث بیان کی ۔ یہی حدیث مجھے علی بن حجر سعدی نے بیان کی ، کہا : ہمیں اسماعیل بن علیہ نے ایوب سے حدیث بیان کی ، اور ہمیں ابن نمیر نے حدیث بیان کی ، کہا : ہمیں محمد بشر نے حدیث سنا ئی ۔ محمد بن مثنیٰ نے کہا : ہمیں یحییٰ بن سعید نے حدیث بیان کی ، ابو بکر بن ابی شیبہ اور ولید بن شجاع نے کہا : ہمیں علی بن مسہر نے عبید اللہ سے حدیث بیان کی محمد بن ابی بکر مقدمی نے کہا : ہمیں فضیل بن سلیمان نے حدیث بیان کی ، کہا : ہمیں مو سیٰ بن عقبہ نے حدیث سنا ئی ۔ شیبان بن فروخ نے کہا : ہمیں جریر بن حازم نے عبدالرحمٰن سراج سے ان سب ( لیث بن سعد ایوب محمد بن بشر یحییٰ بن سعید عبید اللہ موسیٰ بن عقبہ اور عبد الرحمٰن سراج ) نے نافع سے امام مالک بن انس کی حدیث کے مانند اور نافع سے ( اوپر ) انھی کی سند کے ساتھ روایت بیان کی اور عبید اللہ سے علی بن مسہر کی روایت میں اضافہ کیا",
                "hadithArabic": "و حَدَّثَنَاه قُتَيْبَةُ وَمُحَمَّدُ بْنُ رُمْحٍ عَنْ اللَّيْثِ بْنِ سَعْدٍ ح و حَدَّثَنِيهِ عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ حَدَّثَنَا إِسْمَعِيلُ يَعْنِي ابْنَ عُلَيَّةَ عَنْ أَيُّوبَ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَالْوَلِيدُ بْنُ شُجَاعٍ قَالَا حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ عُبَيْدِ اللَّهِ ح و حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ حَدَّثَنَا الْفُضَيْلُ بْنُ سُلَيْمَانَ حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ ح و حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا جَرِيرٌ يَعْنِي ابْنَ حَازِمٍ عَنْ عَبْدِ الرَّحْمَنِ السَّرَّاجِ كُلُّ هَؤُلَاءِ عَنْ نَافِعٍ بِمِثْلِ حَدِيثِ مَالِكِ بْنِ أَنَسٍ بِإِسْنَادِهِ عَنْ نَافِعٍ وَزَادَ فِي حَدِيثِ عَلِيِّ بْنِ مُسْهِرٍ عَنْ عُبَيْدِ اللَّهِ أَنَّ الَّذِي يَأْكُلُ أَوْ يَشْرَبُ فِي آنِيَةِ الْفِضَّةِ وَالذَّهَبِ وَلَيْسَ فِي حَدِيثِ أَحَدٍ مِنْهُمْ ذِكْرُ الْأَكْلِ وَالذَّهَبِ إِلَّا فِي حَدِيثِ ابْنِ مُسْهِرٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12950,
                "hadithNumber": "5387",
                "englishNarrator": "Abdul-Rahman reported on the authority of his mother's sister Umm Salama رضی اللہ عنہا who said:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: He who drank in vessels of gold or silver he in fact drank down in his belly the fire of Hell.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" جو شخص سونے یا چا ندی کے برتن میں پیتا ہے وہ اپنے پیٹ میں غٹاغٹ جہنم کی آگ بھر رہا ہے ۔",
                "urduNarrator": "مجھ سے زید بن یزید، ابو معن الرقاشی نے بیان کیا، ہم سے ابو عاصم نے بیان کیا, عثمان بن مرہ نے کہا : ہمیں عبد اللہ بن عبد الرحمٰن نے اپنی خالہ حضرت ام سلمہ رضی اللہ عنہا سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنِي زَيْدُ بْنُ يَزِيدَ أَبُو مَعْنٍ الرَّقَّاشِيُّ حَدَّثَنَا أَبُو عَاصِمٍ عَنْ عُثْمَانَ يَعْنِي ابْنَ مُرَّةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ عَنْ خَالَتِهِ أُمِّ سَلَمَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ شَرِبَ فِي إِنَاءٍ مِنْ ذَهَبٍ أَوْ فِضَّةٍ فَإِنَّمَا يُجَرْجِرُ فِي بَطْنِهِ نَارًا مِنْ جَهَنَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12951,
                "hadithNumber": "5388",
                "englishNarrator": "Mu'awiya bin Suwaid bin Muqarrin reported:",
                "hadithEnglish": "I visited al-Bara' bin 'Azib رضی اللہ عنہ and heard him say: Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) commanded us to do seven things and forbade us to do seven (things). He commanded us to visit the sick, to follow the funeral procession, to answer the sneezer, to fulfil the vow, to help the poor, to accept the invitation and to greet everybody, and he forbade us to wear rings or gold rings, to drink in silver (vessels), and to use the saddle cloth made of red silk, and to wear garments made of Qassi material, or garments made of silk or brocade and velvet.",
                "hadithUrdu": "میں حضرت براء بن عازب رضی اللہ عنہ کے پاس گیا تو ان کو یہ کہتے ہو ئے سنا کہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں سات چیزوں کا حکم دیا ہے اورسات چیزوں سے روکا میریض کی عیادت کرنے جنازے کے ساتھ شریک ہو نے چھنیک کا جواب دینے ( اپنی ) قسم یا قسم دینے والے ( کی قسم پو ری کرنے مظلوم کی مددکرنے دعوت قبول کرنے انگوٹھی پہننے سے چاندی کے برتن میں ( کھا نے ) پینے ارغوانی ( سرخ ) گدوں سے ( اگر وہ ریشم کے ہوں ) مصر کے علاقے قس کے بنے ہوئے کپڑوں ( جو ریشم کے ہو تے تھے ۔ ) اور ( کسی بھی قسم کے ) ریشم استبرق اور دیباج کو پہننے سے روکا ( استبراق ریشم کا مو ٹا کپڑا تھا اور دیباج باریک ۔ )",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ التمیمی نے بیان کیا، کہا ہم سے ابو خیثمہ نے بیان کیا، ان سے اشعث بن ابی الشاعث نے اور ہم سے احمد بن عبداللہ بن یونس نے بیان کیا, (ابو خیثمہ ) زہیر نے کہا : ہمیں اشعث نے حدیث بیان کی ، کہا : مجھے معاویہ بن سوید بن مقرن نے حدیث بیان کی ، کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ أَخْبَرَنَا أَبُو خَيْثَمَةَ عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ ح و حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا أَشْعَثُ حَدَّثَنِي مُعَاوِيَةُ بْنُ سُوَيْدِ بْنِ مُقَرِّنٍ قَالَ دَخَلْتُ عَلَى الْبَرَاءِ بْنِ عَازِبٍ فَسَمِعْتُهُ يَقُولُ أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِسَبْعٍ وَنَهَانَا عَنْ سَبْعٍ أَمَرَنَا بِعِيَادَةِ الْمَرِيضِ وَاتِّبَاعِ الْجَنَازَةِ وَتَشْمِيتِ الْعَاطِسِ وَإِبْرَارِ الْقَسَمِ أَوْ الْمُقْسِمِ وَنَصْرِ الْمَظْلُومِ وَإِجَابَةِ الدَّاعِي وَإِفْشَاءِ السَّلَامِ وَنَهَانَا عَنْ خَوَاتِيمَ أَوْ عَنْ تَخَتُّمٍ بِالذَّهَبِ وَعَنْ شُرْبٍ بِالْفِضَّةِ وَعَنْ الْمَيَاثِرِ وَعَنْ الْقَسِّيِّ وَعَنْ لُبْسِ الْحَرِيرِ وَالْإِسْتَبْرَقِ وَالدِّيبَاجِ.",
                "headingArabic": "تَحْرِيمِ اسْتِعْمَالِ إِنَاءِ الذَّهَبِ وَالْفِضَّةِ عَلَى الرِّجَالِ وَالنِّسَاءِ وَخَاتَمِ الذَّهَبِ وَالْحَرِيرِ عَلَى الرَّجُلِ وَإِبَاحَتِهِ لِلنِّسَاءِ وَإِبَاحَةِ الْعَلَمِ وَنَحْوِهِ لِلرَّجُلِ مَا لَمْ يَزِدْ عَلَى أَرْبَعِ أَصَابِعَ",
                "headingUrdu": "مردوں اور عورتوں کے لیے سونے اور چاندی کے برتنوں کے استعمال کی ممانعت اور مردوں کے لیے سونے کی انگوٹھیاں اور ریشم، لیکن یہ عورتوں کے لیے جائز ہیں۔ مردوں کے لیے لباس پر ریشمی سرحدوں کی اجازت، لیکن یہ چار انگلیوں سے زیادہ چوڑی نہیں ہونی چاہیے۔",
                "headingEnglish": "The Prohibition Of Using Vessels Of Gold And Silver For Men And Women, And Gold Rings And Silk For Men, But They Are Permissible For Women. Permissibility Of Silken Borders On Garments For Men, But It Should Not Be More Than Four Fingers Wide",
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12952,
                "hadithNumber": "5389",
                "englishNarrator": null,
                "hadithEnglish": "A similar report was narrated from Ash'ath bin Sulaiman with this chain of narrators, except the phrase to fulfill oaths or help fulfill an oaths made by another, instead of which he said: To give a description of a lost item.",
                "hadithUrdu": "ابو عوانہ نے ہمیں اشعث بن سلیم سے اسی سند کے ساتھ اسی کے مانند حدیث سنا ئی ، سوائے \" اپنی قسم یا قسم دینے والے ( کی قسم ) \" کے الفاظ کے ، انھوں نے حدیث میں یہ فقرہ نہیں کہا : اور اس کے بجا ئے گمشدہ چیز کا اعلا ن کرنے کا ذکر کیا ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا أَبُو الرَّبِيعِ الْعَتَكِيُّ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ أَشْعَثَ بْنِ سُلَيْمٍ بِهَذَا الْإِسْنَادِ مِثْلَهُ إِلَّا قَوْلَهُ وَإِبْرَارِ الْقَسَمِ أَوْ الْمُقْسِمِ فَإِنَّهُ لَمْ يَذْكُرْ هَذَا الْحَرْفَ فِي الْحَدِيثِ وَجَعَلَ مَكَانَهُ وَإِنْشَادِ الضَّالِّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12953,
                "hadithNumber": "5390",
                "englishNarrator": "This hadith has been narrated on the authority of Ash'ath bin Abu ash-Sha'tha' with the same chain of transmitters (and with these words):",
                "hadithEnglish": "There is no doubt about the words: To fulfil the vows were mentioned and this addition had been made in the. hadith: (The Holy Prophet) forbade drinking in silver vessels, for one who drinks (in them) in this world would not drink (in them) in the Hereafter.",
                "hadithUrdu": "اور بغیر شک کے قسم دینے والے ( کی قسم ) پو ری کرنے کے الفاظ کہے اور حدیث میں مزید بیان کیا \" اور چاندی ( کے برتن ) میں پینے سے ( منع کیا ) کیونکہ جو شخص دنیا میں اس میں پیے گا ۔ وہ آخرت میں اس میں نہیں پیے گا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, علی مسہر اور جریر دونوں نے شیبانی سے انھوں نے اشعث بن ابی شعثاء سے اسی سندکے ساتھ زہیر کی حدیث کے مانند روایت کی",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ ح و حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ كِلَاهُمَا عَنْ الشَّيْبَانِيِّ عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ بِهَذَا الْإِسْنَادِ مِثْلَ حَدِيثِ زُهَيْرٍ وَقَالَ إِبْرَارِ الْقَسَمِ مِنْ غَيْرِ شَكٍّ وَزَادَ فِي الْحَدِيثِ وَعَنْ الشُّرْبِ فِي الْفِضَّةِ فَإِنَّهُ مَنْ شَرِبَ فِيهَا فِي الدُّنْيَا لَمْ يَشْرَبْ فِيهَا فِي الْآخِرَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12954,
                "hadithNumber": "5391",
                "englishNarrator": null,
                "hadithEnglish": "It was narrated from Ash'ath bin Abi Ash-sha'tha' with this chain of narrators, but he did not mentioned by jarir and Ibn Mus-hir(no. 5391).",
                "hadithUrdu": "ہم سے ابو کریب نے بیان کیا, ابن ادریس نے کہا : ہمیں ابو اسحٰق شیبانی اور لیث بن ابی سلیم نے اشعث بن ابی شعثاء سے ان سب کی سند کے ساتھ حدیث بیان کی اور جریر اور ابن مسہر کے اضافے کا ذکر نہیں کیا ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَاه أَبُو كُرَيْبٍ حَدَّثَنَا ابْنُ إِدْرِيسَ أَخْبَرَنَا أَبُو إِسْحَقَ الشَّيْبَانِيُّ وَلَيْثُ بْنُ أَبِي سُلَيْمٍ عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ بِإِسْنَادِهِمْ وَلَمْ يَذْكُرْ زِيَادَةَ جَرِيرٍ وَابْنِ مُسْهِرٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12955,
                "hadithNumber": "5392",
                "englishNarrator": "It was narrated from Ash'ath bin Sulaim with their chin of narrators, except the words:",
                "hadithEnglish": "Spreading the greeting of Salam, instead of which he said: If sha as-Salam (spreading the salutations), he substituted the words Radd as-Saldm (i.e. responding to the words of salutation) and he said: He forbade (the use of) gold ring.",
                "hadithUrdu": "\" سلام عام کرنے \" کے بجا ئے کہا : \" اور سلام کا جواب دینے \" اور کہا : آپ صلی اللہ علیہ وسلم نے ہمیں سونے کی انگوٹھی سے منع فرما یا ۔",
                "urduNarrator": "اور ہم سے محمد بن المثنیٰ اور ابن بشار نے بیان کیا، کہا: ہم سے محمد بن جعفر نے بیان کیا، اور ہم سے عبید اللہ بن معاذ نے بیان کیا، ہم سے ابی  نے بیان کیا اور ہم سے اسحاق نے بیان کیا,  ہم سے ابن ابراہیم نے بیان کیا، ہم سے ابو عامر عقدی نے بیان کیا اور ہم سے عبدالرحمٰن بن بشر نے بیان کیا، کہا کہ مجھ سے بہز نے بیان کیا، ان سب نے کہا۔شعبہ نے اشعث بن سلیم سے ان سب کی سند کے ساتھ ان کی حدیث کے ہم معنی حدیث بیان کی ، سوائے ان کے روایت کردہ الفا ظ",
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ ح و حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي  و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا أَبُو عَامِرٍ الْعَقَدِيُّ ح و حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ بِشْرٍ حَدَّثَنِي بَهْزٌ قَالُوا جَمِيعًا حَدَّثَنَا شُعْبَةُ عَنْ أَشْعَثَ بْنِ سُلَيْمٍ بِإِسْنَادِهِمْ وَمَعْنَى حَدِيثِهِمْ إِلَّا قَوْلَهُ وَإِفْشَاءِ السَّلَامِ فَإِنَّهُ قَالَ بَدَلَهَا وَرَدِّ السَّلَامِ وَقَالَ نَهَانَا عَنْ خَاتَمِ الذَّهَبِ أَوْ حَلْقَةِ الذَّهَبِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12956,
                "hadithNumber": "5393",
                "englishNarrator": "It was narrated from Ash'ath bin Abi Ash-Sha'tha' with their chain narrators, and he said:",
                "hadithEnglish": "\"Spreading the greeting of Islam\" and \"gold rings.\"",
                "hadithUrdu": "\" سلام عام کرنے اور سونے کی انگوٹھی \" کہا ۔",
                "urduNarrator": "اور ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے یحییٰ بن آدم اور عمرو بن محمد نے بیان کیا، انہوں نے کہا: ہمیں سفیان نے اشعث بن ابی شعثاء سے ان سب کی سند کے ساتھ حدیث بیان کی اور شک کے بغیر",
                "hadithArabic": "و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ وَعَمْرُو بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ بِإِسْنَادِهِمْ وَقَالَ وَإِفْشَاءِ السَّلَامِ وَخَاتَمِ الذَّهَبِ مِنْ غَيْرِ شَكٍّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12957,
                "hadithNumber": "5394",
                "englishNarrator": "Abdullah bin Ukaim رضی اللہ عنہ reported:",
                "hadithEnglish": "While we were with Hudhaifa رضی اللہ عنہ in Mada'in he asked for water. A villager brought a drink for him in a silver vessel. He (Hudhaifa رضی اللہ عنہ ) threw it away saying: I inform you that I have already conveyed to him that he should not serve me drink in it (silver vessel) for Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had said: Do not drink in gold and silver vessels, and do not wear brocade or silk, for these are meant for them (the non-believers) in this world, but they are meant for you in the Hereafter on the Day, of Resurrection.",
                "hadithUrdu": "ہم ( ایران کے سابقہ دارالحکومت ) مدائن میں حضرت خذیفہ رضی اللہ عنہ کے ساتھ تھے ۔ حضرت حذیفہ رضی اللہ عنہ نے پانی ما نگا تو ایک زمیندار چاندی کے برتن میں مشروب لے آیا ، حضرت حذیفہ رضی اللہ عنہ نے اس ( مشروب ) کے سمیت وہ برتن پھینک دیا اور کہا : میں تم لوگوں کو بتا رہا ہوں کہ میں پہلے اس سے کہہ چکا ہو ں کہ وہ مجھے اس ( چاندی کے برتن ) میں نہ پلا ئے کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے فرما یا ہے ۔ \" سونے اور چاندی کے برتن میں نہ پیو اور دیباج اور حریرنہ پہنو کیونکہ یہ چیز یں دنیا میں ان ( کا فروں ) کے لیے ہیں اور آخرت میں قیامت کے دن تمھا رے لیےہیں ۔ \"",
                "urduNarrator": "سعید بن عمرو بن سہل بن اسحٰق بن محمد بن اشعث بن قیس نے کہا : ہمیں سفیان بن عیینہ نے حدیث بیان کی ، کہا : میں نے انھیں ابو فروہ سے ذکر کرتے ہو ئے سنا کہ انھوں نے عبد اللہ بن عکیم رضی اللہ عنہ سے سنا ، کہا",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ عَمْرِو بْنِ سَهْلِ بْنِ إِسْحَقَ بْنِ مُحَمَّدِ بْنِ الْأَشْعَثِ بْنِ قَيْسٍ قَالَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ سَمِعْتُهُ يَذْكُرُهُ عَنْ أَبِي فَرْوَةَ أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عُكَيْمٍ قَالَ كُنَّا مَعَ حُذَيْفَةَ بِالْمَدَائِنِ فَاسْتَسْقَى حُذَيْفَةُ فَجَاءَهُ دِهْقَانٌ بِشَرَابٍ فِي إِنَاءٍ مِنْ فِضَّةٍ فَرَمَاهُ بِهِ وَقَالَ إِنِّي أُخْبِرُكُمْ أَنِّي قَدْ أَمَرْتُهُ أَنْ لَا يَسْقِيَنِي فِيهِ فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَشْرَبُوا فِي إِنَاءِ الذَّهَبِ وَالْفِضَّةِ وَلَا تَلْبَسُوا الدِّيبَاجَ وَالْحَرِيرَ فَإِنَّهُ لَهُمْ فِي الدُّنْيَا وَهُوَ لَكُمْ فِي الْآخِرَةِ يَوْمَ الْقِيَامَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12958,
                "hadithNumber": "5395",
                "englishNarrator": null,
                "hadithEnglish": "It was narrated that Abu Farwah Al-Juhani said: \"I heard Abdullah bin `Ukaim رضی اللہ عنہ say: 'We were with Hudhaifah in Al-Made in....'\" ans he mentioned something similar but he did not mention in his Hadith \"....the Day of Resurrection.\"",
                "hadithUrdu": "ابن ابی عمر نے ہمیں یہی حدیث بیان کی کہا : ہمیں سفیان نے ابو فروہ جہنی سے حدیث سنائی ، کہا : میں نے عکیم رضی اللہ عنہ سے سنا ، کہہ رہے تھے ۔ ہم مدا ئن میں حضرت حذیفہ رضی اللہ عنہ کے پاس تھے پھر اس کی طرح بیان کیا اور اس حدیث میں \" قیامت کے دن \" ( کے الفاظ ) ذکر نہیں کیے ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَاه ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي فَرْوَةَ الْجُهَنِيِّ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عُكَيْمٍ يَقُولُ كُنَّا عِنْدَ حُذَيْفَةَ بِالْمَدَائِنِ فَذَكَرَ نَحْوَهُ وَلَمْ يَذْكُرْ فِي الْحَدِيثِ يَوْمَ الْقِيَامَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12959,
                "hadithNumber": "5396",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of lbn `Ukaim رضی اللہ عنہ through another chain of transmitters, but in this hadith no mention is made of the words: On the Day of Resurrection",
                "hadithUrdu": "اور مجھ سے عبدالجبار بن علاء نے بیان کیا، ہم سے سفیان نے بیان کیا, ابن ابی نجح نے پہلے ہمیں مجا ہد سے ، انھوں نے ابن ابی لیلیٰ سے ، انھوں نے حضرت حذیفہ سے روایت کی ۔ پھر ہمیں یزید نے حدیث بیان کی ، انھوں نے یہ حدیث ابن ابی لیلیٰ سے سنی ، انھوں نے حضرت حذیفہ رضی اللہ عنہ سے ، پھر ہمیں ابو فروہ نے حدیث بیان کی کہا : میں نے ابن عکیم رضی اللہ عنہ سے سنی اور میرا خیال یہ ہے کہ ابن ابی لیلیٰ نے بھی یہ حدیث ابن عکیم رضی اللہ عنہ سے سنی ، انھوں نے کہا : ہم مدا ئن میں حضرت حذیفہ رضی اللہ عنہ کے ساتھ ( انکے دستے میں ) تھے ۔ پھر اسی کے مانند بیان کیا اور \" قیامت کے دن \" کے الفاظ نہیں کہے ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنِي عَبْدُ الْجَبَّارِ بْنُ الْعَلَاءِ حَدَّثَنَا سُفْيَانُ حَدَّثَنَا ابْنُ أَبِي نَجِيحٍ أَوَّلًا عَنْ مُجَاهِدٍ عَنْ ابْنِ أَبِي لَيْلَى عَنْ حُذَيْفَةَ ثُمَّ حَدَّثَنَا يَزِيدُ سَمِعَهُ مِنْ ابْنِ أَبِي لَيْلَى عَنْ حُذَيْفَةَ ثُمَّ حَدَّثَنَا أَبُو فَرْوَةَ قَالَ سَمِعْتُ ابْنَ عُكَيْمٍ فَظَنَنْتُ أَنَّ ابْنَ أَبِي لَيْلَى إِنَّمَا سَمِعَهُ مِنْ ابْنِ عُكَيْمٍ قَالَ كُنَّا مَعَ حُذَيْفَةَ بِالْمَدَائِنِ فَذَكَرَ نَحْوَهُ وَلَمْ يَقُلْ يَوْمَ الْقِيَامَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12960,
                "hadithNumber": "5397",
                "englishNarrator": "Shu'ba reported from al-Hakam that he heard 'Abdul-Rahmin (i.e. Ibn Abu Laila) as saying:",
                "hadithEnglish": "I personally saw Hudhaifa رضی اللہ عنہ asking for water in Mada'in and a man giving it to him in a silver vessel. And he mentioned a hadith like that of Ibn Ukaim from Hudhaifa رضی اللہ عنہ .",
                "hadithUrdu": "مدا ئن میں حضرت حذیفہ رضی اللہ عنہ نے پا نی مانگا تو ایک شخص ان کے پاس چاندی کا برتن لے کر آیا پھر انھوں نے حضرت حذیفہ رضی اللہ عنہ سے ابن عکیم رضی اللہ عنہ کی روا یت کے مانند بیان کیا ۔",
                "urduNarrator": "عبید اللہ کے والد معاذ عنبری نے کہا : ہمیں شعبہ نے حکم سے حدیث بیان کی انھوں نے عبد الرحمٰن بن ابی لیلیٰ سے سنا ، انھوں نے کہا : میں نے دیکھا کہ",
                "hadithArabic": "و حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ أَنَّهُ سَمِعَ عَبْدَ الرَّحْمَنِ يَعْنِي ابْنَ أَبِي لَيْلَى قَالَ شَهِدْتُ حُذَيْفَةَ اسْتَسْقَى بِالْمَدَائِنِ فَأَتَاهُ إِنْسَانٌ بِإِنَاءٍ مِنْ فِضَّةٍ فَذَكَرَهُ بِمَعْنَى حَدِيثِ ابْنِ عُكَيْمٍ عَنْ حُذَيْفَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12961,
                "hadithNumber": "5398",
                "englishNarrator": null,
                "hadithEnglish": "A Hadith like that of Mu'adh was narrated from Shu'bah with the same chain narrators, but non of them mentioned the words: \"I saw Hudhaifah رضی اللہ عنہ\" except Mu'adh only. Rather they said: \"Hudhaifah asked for a drink.\"",
                "hadithUrdu": "وکیع محمد بن جعفر ابن ابی عدی اور بہز ، ان سب نے شعبہ سے معاذ کی حدیث کے مانند انھی کی سند کے ساتھ حدیث روایت کی اور اکیلے معاذ کے سوا ، ان میں سے کسی نے حدیث میں \" میں نے حذیفہ رضی اللہ عنہ کو دیکھا \" کے الفا ظ نہیں کہے ۔ سب نے یہی کیا : حضرت حذیفہ رضی اللہ عنہ نے پانی مانگا ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ ح و حَدَّثَنَا ابْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ ح و حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ بِشْرٍ حَدَّثَنَا بَهْزٌ كُلُّهُمْ عَنْ شُعْبَةَ بِمِثْلِ حَدِيثِ مُعَاذٍ وَإِسْنَادِهِ وَلَمْ يَذْكُرْ أَحَدٌ مِنْهُمْ فِي الْحَدِيثِ شَهِدْتُ حُذَيْفَةَ غَيْرُ مُعَاذٍ وَحْدَهُ إِنَّمَا قَالُوا إِنَّ حُذَيْفَةَ اسْتَسْقَى.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12962,
                "hadithNumber": "5399",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been reported on the authority of Hudhaila رضی اللہ عنہ with the same chain of transmitters.",
                "hadithUrdu": "اور ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے جریر نے بیان کیا, منصور اور ابن عون دونوں نے مجا ہد سے ، انھوں نے عبد الرحمٰن بن ابی لیلیٰ سے ، انھوں نے حضرت حذیفہ رضی اللہ عنہ سے انھوں نے نبی صلی اللہ علیہ وسلم سے ان لوگوں کی روایت کے ہم معنی حدیث بیان کی جن کا ہم نے ذکر کیا ہے ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا جَرِيرٌ عَنْ مَنْصُورٍ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ ابْنِ عَوْنٍ كِلَاهُمَا عَنْ مُجَاهِدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ حُذَيْفَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَى حَدِيثِ مَنْ ذَكَرْنَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12963,
                "hadithNumber": "5400",
                "englishNarrator": "Abdul-Rahmin bin Abu Laili reported that",
                "hadithEnglish": "Hudhaifa رضی اللہ عنہ asked for water and a Magian gave him water in a silver vessel, whereupon he said: I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Do not wear silk or brocade and do not drink from vessels of gold and silver, and do not eat in the dishes made of them (i.e. gold and silver), for these are for them (the non-believers) in this world.",
                "hadithUrdu": "حضرت حذیفہ رضی اللہ عنہ نے پانی مانگا تو ایک مجوسی ان کے پاس چاندی کے برتن میں پانی لا یا تو انھوں ( حضرت حذیفہ رضی اللہ تعالیٰ عنہ ) نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتےہو ئے سناہے ۔ \" ریشم پہنو دیباج پہنو اور نہ سونے اور چاندی کے برتن میں پیو اور نہ ان ( قیمتی دھاتوں ) کی رکابیوں ( پلیٹوں ) میں کھا ؤکیونکہ یہ برتن دنیا میں ان ( کفار ) کے لیے ہیں ۔",
                "urduNarrator": "ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا، کہا ہم سے میرے والد نے بیان کیا, ‏سیف نے کہا کہ میں نے مجا ہد کو کہتے و ئے سنا ، عبد اللہ الرحمن بن ابی لیلیٰ سے سنا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا سَيْفٌ قَالَ سَمِعْتُ مُجَاهِدًا يَقُولُ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ أَبِي لَيْلَى قَالَ اسْتَسْقَى حُذَيْفَةُ فَسَقَاهُ مَجُوسِيٌّ فِي إِنَاءٍ مِنْ فِضَّةٍ فَقَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تَلْبَسُوا الْحَرِيرَ وَلَا الدِّيبَاجَ وَلَا تَشْرَبُوا فِي آنِيَةِ الذَّهَبِ وَالْفِضَّةِ وَلَا تَأْكُلُوا فِي صِحَافِهَا فَإِنَّهَا لَهُمْ فِي الدُّنْيَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 12651,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=506",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=504",
                "label": "504",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=505",
                "label": "505",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=506",
                "label": "506",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=507",
                "label": "507",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=508",
                "label": "508",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=509",
                "label": "509",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=510",
                "label": "510",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=508",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=508",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=506",
        "to": 12675,
        "total": 40465
    }
}