{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 500,
        "data": [
            {
                "id": 12764,
                "hadithNumber": "5201",
                "englishNarrator": "Sa'id bin Musayyib reported:",
                "hadithEnglish": "I heard 'Abdullah bin 'Umar رضی اللہ عنہ saying this near the pulpit while pointing towards the pulpit of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌): A group of the tribe of 'Abdul-Qais came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and asked him about (vessels) which might (be used for preparing Nabidh and) drinking in them. He (the Holy Prophet ﷺ) forbade them (to use) gourd, hollow stump, vessel besmeared with pitch. I said to him: Abu Muhammad, (what about) varnished jar? and we think he had forgotten to mention the word 'varnished jar . Thereupon he said: I did not hear it from him on that day, i.e. from 'Abdullah bin 'Umar رضی اللہ عنہ , and he hated that (i.e. preparation of Nabidh in gourd).",
                "hadithUrdu": "میں نے عبد اللہ بن عمر رضی اللہ عنہ کو اس منبر کے پاس کہتے ہو ئے سنا اور انھوں نے رسول اللہ صلی اللہ علیہ وسلم کے منبر کی طرف اشارہ کیا : قبیلہ عبد القیس کا وفد رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور آپ سے پینے کی چیزوں کے حوالے سے سوال کیا تو آپ صلی اللہ علیہ وسلم نے انھیں کدو سے بنے ہو ئے برتن اندر سے کرید ی ہو ئی لکڑی کے برتن اور سبز گھڑے سے منع فرما یا ۔ ( عبد الخالق بن سلمہ نے کہا ) میں نے عرض کی : ابو محمد ! اور روغن زفت ملا ہوا برتن ؟ہم نے سمجھا تھا کہ وہ اس کا ذکر کرنا بھول گئے ہیں ۔ تو انھوں ( سعید بن مسیب ) نے کہا : میں نے اس دن عبد اللہ بن عمر رضی اللہ عنہ سے یہ ( مزفت کا ذکر ) نہیں سنا تھا ۔ وہ اس کو ( بھی ) ناپسند کرتے تھے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے یزید بن ہارون نے بیان کیا, عبد الخالق بن سلمہ نے کہا : میں نے سعید بن مسیب کو کہتے ہو ئے سنا کہ",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا عَبْدُ الْخَالِقِ بْنُ سَلَمَةَ، قَالَ: سَمِعْتُ سَعِيدَ بْنَ الْمُسَيِّبِ، يَقُولُ: سَمِعْتُ عَبْدَ اللهِ بْنَ عُمَرَ، يَقُولُ عِنْدَ هَذَا الْمِنْبَرِ، وَأَشَارَ إِلَى مِنْبَرِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: قَدِمَ وَفْدُ عَبْدِ الْقَيْسِ عَلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَسَأَلُوهُ عَنِ الْأَشْرِبَةِ، «فَنَهَاهُمْ عَنِ الدُّبَّاءِ وَالنَّقِيرِ وَالْحَنْتَمِ»، فَقُلْتُ لَهُ: يَا أَبَا مُحَمَّدٍ، وَالْمُزَفَّتِ؟ وَظَنَنَّا أَنَّهُ نَسِيَهُ، فَقَالَ: «لَمْ أَسْمَعْهُ يَوْمَئِذٍ مِنْ عَبْدِ اللهِ بْنِ عُمَرَ، وَقَدْ كَانَ يَكْرَهُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12765,
                "hadithNumber": "5202",
                "englishNarrator": "It is reported on the authority of Jabir and Ibn Umar رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade (the preparation) of Nabidh in hollow stump and varnished jar and gourd.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے لکڑی کے برتن روغن زفت ملے ہو ئے برتن اور کدو کے برتن سے منع فرما یا ۔",
                "urduNarrator": "ہم سے احمد بن یونس نے بیان کیا، ہم سے زہیر نے بیان کیا، ہم سے ابو الزبیر نے بیان کیا اور ہم سے یحییٰ بن یحییٰ نے بیان کیا, ابو خیثمہ ( زہیر ) نے ابو زبیر سے انھوں نے حضرت جا بر اور حضرت عبد اللہ بن عمر رضی اللہ عنہ سے روایت کی ، کہ",
                "hadithArabic": "و حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا أَبُو الزُّبَيْرِ ح و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو خَيْثَمَةَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ وَابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ النَّقِيرِ وَالْمُزَفَّتِ وَالدُّبَّاءِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12766,
                "hadithNumber": "5203",
                "englishNarrator": "It is reported on the authority of Ibn Umar رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade (the preparation of Nabidh in) a green pitcher (besmeared with pitch) and gourd and varnished jar.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا : آپ گھڑوں کدو اور روغن زفت ملے ہو ئے برتنوں سے منع فر ما رہے تھے ۔",
                "urduNarrator": "مجھ سے محمد بن رافع نے بیان کیا، ہم سے عبدالرزاق نے بیان کیا, ابن جریج نے کہا : مجھے ابو زبیر نے بتا یا کہ انھوں نے حضرت ابن عمر رضی اللہ عنہ کو کہتے ہو ئے سنا",
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ ابْنَ عُمَرَ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَى عَنْ الْجَرِّ وَالدُّبَّاءِ وَالْمُزَفَّتِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12767,
                "hadithNumber": "5204",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade (the preparation) of Nabidh in green pitcher, in varnished jar, in hollow stump, and when Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) did not find anything to prepare Nabidh in that (i.e. water skin), it was prepared for him in a big bowl made of stone.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے گھڑوں روغن زفت ملے ہو ئے برتن اور لکڑی کے برتن سے منع فرما یا ۔ ( اور ) جب رسول اللہ صلی اللہ علیہ وسلم کے ہاں نبیذ بنا نے کے لیے کو ئی اور برتن نہ ملتا تو پتھروں سے بنے ہو ئے بڑے برتن میں آپ کے لیے نبیذ بنائی جا تی ۔",
                "urduNarrator": "ابو زبیر نے کہا ,  میں نے حضرت جا بر بن عبد اللہ رضی اللہ عنہ کو کہتے ہو ئے سنا",
                "hadithArabic": "قَالَ أَبُو الزُّبَيْرِ وَسَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْجَرِّ وَالْمُزَفَّتِ وَالنَّقِيرِ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا لَمْ يَجِدْ شَيْئًا يُنْتَبَذُ لَهُ فِيهِ نُبِذَ لَهُ فِي تَوْرٍ مِنْ حِجَارَةٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12768,
                "hadithNumber": "5205",
                "englishNarrator": "This hadith is reported on the authority of Jabir bin Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "Nabidh was prepared for him in a big bowl of stone.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم کے لیے پتھروں سے بنے ہو ئے ایک بڑے برتن میں نبیذ بنا ئی جا تی تھی ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا, ابو عوانہ نے ابو زبیر سے ، انھوں نے حضرت جا بر رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو عَوَانَةَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُنْبَذُ لَهُ فِي تَوْرٍ مِنْ حِجَارَةٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12769,
                "hadithNumber": "5206",
                "englishNarrator": "Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "Nabidh was prepared for Allan's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) in a water skin, but if they did not find water skin it was prepared in a big bowl of stone. One of the persons and I had heard from Abu Zubair that it was Biram (a vessel made of stone).",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم کے لیے ایک مشکیز ے میں نبیذ بنا ئی جا تی تھی ۔ اور جب مشکیزہ نہ ملتا تو پتھروں سے بنے ہو ئے ایک بڑے برتن میں نبیذ بنا ئی جاتی تھی ۔ لوگوں میں سے ایک شخص نے ابو زبیر سے کہا : ۔ ۔ ۔ اور میں سن رہا تھا ۔ ۔ ۔ مضبوط پتھر سے بنا ہوا ؟ کہا : ( ہاں ) مضبوط پتھر سے بنا ہوا ۔",
                "urduNarrator": "ہم سے احمد بن یونس نے بیان کیا، ہم سے زہیر نے بیان کیا، ہم سے ابو الزبیر نے بیان کیا اور ہم سے یحییٰ بن یحییٰ نے بیان کیا, ہمیں ابو خیثمہ ( زہیر ) نے ابو زبیر سے خبر دی انھوں نے حضرت جا بر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا أَبُو الزُّبَيْرِ ح و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو خَيْثَمَةَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ كَانَ يُنْتَبَذُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سِقَاءٍ فَإِذَا لَمْ يَجِدُوا سِقَاءً نُبِذَ لَهُ فِي تَوْرٍ مِنْ حِجَارَةٍ فَقَالَ بَعْضُ الْقَوْمِ وَأَنَا أَسْمَعُ لِأَبِي الزُّبَيْرِ مِنْ بِرَامٍ قَالَ مِنْ بِرَامٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12770,
                "hadithNumber": "5207",
                "englishNarrator": "Abdullah bin Buraida, on the authority of his father reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: I had forbidden you from the preparation of Nabidh except in a water skin. But now you may drink in all vessels, but do not drink what is intoxicant.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" میں نے تم لو گوں کو مشک کے سوا دوسرے برتنوں میں نبیذ بنا نے سے منع کیا تھا ( اب تم لوگ ) سب برتنوں میں پیو لیکن کو ئی نشہ آور چیز نہ پیو ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور محمد بن المثنیٰ نے بیان کیا، کہا کہ ہم سے محمد بن فضیل نے بیان کیا، ان سے ابوبکر نے ابو سنان کی سند سے بیان کیا اور ان سے ابن ابی سنان نے بیان کیا,  ضرار بن مرہ ابو سنان نے محارب بن دثار سے ، انھوں نے عبد اللہ بن بریدہ سے ، انھوں نے اپنے والد سے روایت کی",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ الْمُثَنَّى قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ قَالَ أَبُو بَكْرٍ عَنْ أَبِي سِنَانٍ و قَالَ ابْنُ الْمُثَنَّى عَنْ ضِرَارِ بْنِ مُرَّةَ عَنْ مُحَارِبٍ عَنْ ابْنِ بُرَيْدَةَ عَنْ أَبِيهِ ح و حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ حَدَّثَنَا ضِرَارُ بْنُ مُرَّةَ أَبُو سِنَانٍ عَنْ مُحَارِبِ بْنِ دِثَارٍ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَيْتُكُمْ عَنْ النَّبِيذِ إِلَّا فِي سِقَاءٍ فَاشْرَبُوا فِي الْأَسْقِيَةِ كُلِّهَا وَلَا تَشْرَبُوا مُسْكِرًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12771,
                "hadithNumber": "5208",
                "englishNarrator": "Ibn Buraida, on the authority of his father reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: I had forbidden you (from the preparation of Nabidh) and drinking it in certain vessels, (but now you may do so if you like) for it is not vessels or a vessel that makes a thing lawful or unlawful. It is every intoxicant that is unlawful.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" میں نے تم کو کچھ برتنوں سے منع کیا تھا برتن کسی چیز کو حلال کرتے ہیں نہ حرام البتہ ہر نشہ آور چیز حرام ہے ۔",
                "urduNarrator": "ہم سے حجاج بن الشاعر نے بیان کیا، ہم سے ضحاک بن مخلد نے سفیان کی سند سے بیان کیا, علقمہ بن مرثد نے ابن بریدہ سے انھوں نے اپنے والد سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنَا حَجَّاجُ بْنُ الشَّاعِرِ حَدَّثَنَا ضَحَّاكُ بْنُ مَخْلَدٍ عَنْ سُفْيَانَ عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ عَنْ ابْنِ بُرَيْدَةَ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نَهَيْتُكُمْ عَنْ الظُّرُوفِ وَإِنَّ الظُّرُوفَ أَوْ ظَرْفًا لَا يُحِلُّ شَيْئًا وَلَا يُحَرِّمُهُ وَكُلُّ مُسْكِرٍ حَرَامٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12772,
                "hadithNumber": "5209",
                "englishNarrator": "Ibn Buraida, on the authority of his father reported:",
                "hadithEnglish": "Allah's Messenger (ﷺ) as saying: I had forbidden you from the drinking (and preparation of) Nabidh in the vessels made out of leather, but (now) you may drink in all vessels, but you do not drink an intoxicant",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" میں  تم کو چمڑے کے برتنوں میں مشروبات ( پینے ) سے منع کیا تھا ۔ ( اب ) ہر برتن میں پیو مگر کو ئی نشہ آور چیزنہ پیو ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے وکیع نے بیان کیا, معرف بن واصل نے محارب بن دثار سے انھوں نے ابن بریدہ سے انھوں نے اپنے والد سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ مُعَرِّفِ بْنِ وَاصِلٍ عَنْ مُحَارِبِ بْنِ دِثَارٍ عَنْ ابْنِ بُرَيْدَةَ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُنْتُ نَهَيْتُكُمْ عَنْ الْأَشْرِبَةِ فِي ظُرُوفِ الْأَدَمِ فَاشْرَبُوا فِي كُلِّ وِعَاءٍ غَيْرَ أَنْ لَا تَشْرَبُوا مُسْكِرًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12773,
                "hadithNumber": "5210",
                "englishNarrator": "Abdullah bin 'Amr رضی اللہ عنہ reported:",
                "hadithEnglish": "When Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade (the preparation) of Nabidh in vessels, they said all the people cannot (afford to have) them. He (the Holy Prophet) then granted them permission (to prepare) Nabidh in a green pitcher, but not in those besmeared with pitch.",
                "hadithUrdu": "جب رسول اللہ صلی اللہ علیہ وسلم نے ( بعض خاص ) برتنوں میں نبیذ ( بنانے ) سے منع فرما یا ( اور مشکیزوں میں مشروب بنا نے اور پینے کا حکم دیا ) تو لو گو ں نے کہا : ہر شخص کو ( مشکیزے یا دوسرے برتن ) میسر نہیں ہو تے اس پر آپ صلی اللہ علیہ وسلم نے مٹی کے ایسے گھڑوں کی اجازت دی جس میں روغن زفت ملا ہوا نہ ہو ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابن ابی عمر نے بیان کیا، اور یہ قول ابن ابی عمر سے ہے، انہوں نے کہا: ہم سے سفیان نے سلیمان الاہوال کی سند سے، مجاہد کی سند سے بیان کیا,  ابو عیاد کی طرف سے, حضرت عبد اللہ بن عمرو رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَابْنُ أَبِي عُمَرَ وَاللَّفْظُ لِابْنِ أَبِي عُمَرَ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ سُلَيْمَانَ الْأَحْوَلِ عَنْ مُجَاهِدٍ عَنْ أَبِي عِيَاضٍ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ لَمَّا نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ النَّبِيذِ فِي الْأَوْعِيَةِ قَالُوا لَيْسَ كُلُّ النَّاسِ يَجِدُ فَأَرْخَصَ لَهُمْ فِي الْجَرِّ غَيْرِ الْمُزَفَّتِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12774,
                "hadithNumber": "5211",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was asked about Bit'i, whereupon he said: Every drink that causes intoxication is forbidden.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم سے شہد کی بنی ہو ئی شراب کے متعلق سوال کیا گیا آپ نے فرمایا : \" ہر مشروب جو نشہ آور ہو وہ حرام ہے ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا: میں نے پڑھا, امام مالک نے ابن شہاب ( زہری ) سے انھوں نے ابو سلمہ بن عبد الرحمٰن سے انھوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ قَالَتْ سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْبِتْعِ فَقَالَ كُلُّ شَرَابٍ أَسْكَرَ فَهُوَ حَرَامٌ.",
                "headingArabic": "بَيَانِ أَنَّ كُلَّ مُسْكِرٍ خَمْرٌ وَأَنَّ كُلَّ خَمْرٍ حَرَامٌ ‏‏",
                "headingUrdu": "ہر نشہ آور چیز خمر ہے اور تمام خمر حرام ہے۔",
                "headingEnglish": "Every intoxicant is Khamr and all Khamr is Haram",
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12775,
                "hadithNumber": "5212",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was asked about it, whereupon he said that everything that causes intoxication is forbidden.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم سے شہد کی بنی ہو ئی شراب کے متعلق سوال کیا گیا تو آپ نے فر ما یا : \" ہر مشروب جو نشہ آور ہو وہ حرام ہے ۔ \"",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ التجیبی نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا, یو نس نے ابن شہا ب سے انھوں نے ابو سلمہ بن عبد الرحمٰن سے روایت کی ، انھوں نے حضرت عائشہ رضی اللہ عنہا کو کہتے ہو ئے سنا",
                "hadithArabic": "و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى التُّجِيبِيُّ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ أَنَّهُ سَمِعَ عَائِشَةَ تَقُولُ سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْبِتْعِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُّ شَرَابٍ أَسْكَرَ فَهُوَ حَرَامٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12776,
                "hadithNumber": "5213",
                "englishNarrator": "This hadith has been reported on the authority of Zuhri with this chain of transmitters but in the hadith transmitted on the authority of Sufyan and Salih (these words are not found) she was asked about Bit . (These words are found in the hadith) transmitted on the authority of Ma'mar and in the hadith transmitted on the authority of Salih (only these words are found):",
                "hadithEnglish": "She (Hadrat 'A'isha رضی اللہ عنہا) had heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) say: Every intoxicating drink is forbidden.",
                "hadithUrdu": "( حضرت عائشہ رضی اللہ عنہا نے رسول اللہ صلی اللہ علیہ وسلم کو فرما تے ہو ئے سنا : \" ہر نشہ آور مشروب حرام ہے ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ، سعید بن منصور، ابوبکر بن ابی شیبہ، عمرو ناقد اور زہیر بن حرب نے بیان کیا, ( سفیان ) ابن عیینہ صالح اور معمر سب نے زہری سے اسی سند کے ساتھ روایت کی سفیان اور صالح کی حدیث میں یہ ( الفاظ ) نہیں کہ \" آپ سے شہد کی بنی ہو ئی شراب کے بارے میں پو چھا گیا \" یہ الفا ظ معمر کی حدیث میں ہیں ۔ صالح کی حدیث میں ہے انھوں نے",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَسَعِيدُ بْنُ مَنْصُورٍ وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ كُلُّهُمْ عَنْ ابْنِ عُيَيْنَةَ ح و حَدَّثَنَا حَسَنٌ الْحُلْوَانِيُّ وَعَبْدُ بْنُ حُمَيْدٍ عَنْ يَعْقُوبَ بْنِ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنَا أَبِي عَنْ صَالِحٍ ح و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَعَبْدُ بْنُ حُمَيْدٍ قَالَا أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ كُلُّهُمْ عَنْ الزُّهْرِيِّ بِهَذَا الْإِسْنَادِ وَلَيْسَ فِي حَدِيثِ سُفْيَانَ وَصَالِحٍ سُئِلَ عَنْ الْبِتْعِ وَهُوَ فِي حَدِيثِ مَعْمَرٍ وَفِي حَدِيثِ صَالِحٍ أَنَّهَا سَمِعَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ كُلُّ شَرَابٍ مُسْكِرٍ حَرَامٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12777,
                "hadithNumber": "5214",
                "englishNarrator": "Abu Musa رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sent me and Mu'adh bin Jabal رضی اللہ عنہ to Yemen. I said: Allah's Messenger, there is prepared in our land a wine out of barley which is known as Mizr (beer of our times) and a wine from honey which is known as Bit, (are these also forbidden? ), whereupon he said: Every intoxicant is forbidden.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے مجھے اور حضرت معاذ بن جبل رضی اللہ عنہ کو یمن کی طرف بھیجا میں نے عرض کی یا رسول اللہ صلی اللہ علیہ وسلم !ہمارے علاقے میں جو سے ایک مشروب بنا یا جا تا ہے اس کو مزرکہتے ہیں اور ایک مشروب شہد سے بنا یا جا تا ہے اس کو بتع کہتے ہیں ۔ آپ صلی اللہ علیہ وسلم نے فرما یا : \" ہر نشہ آور چیز حرام ہے ۔ \"",
                "urduNarrator": "شعبہ نے سعید بن ابی بردہ سے انھوں نے اپنے والد سے انھوں نے حضرت ابو موسیٰ اشعری رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ وَاللَّفْظُ لِقُتَيْبَةَ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ شُعْبَةَ عَنْ سَعِيدِ بْنِ أَبِي بُرْدَةَ عَنْ أَبِيهِ عَنْ أَبِي مُوسَى قَالَ بَعَثَنِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَا وَمُعَاذَ بْنَ جَبَلٍ إِلَى الْيَمَنِ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّ شَرَابًا يُصْنَعُ بِأَرْضِنَا يُقَالُ لَهُ الْمِزْرُ مِنْ الشَّعِيرِ وَشَرَابٌ يُقَالُ لَهُ الْبِتْعُ مِنْ الْعَسَلِ فَقَالَ كُلُّ مُسْكِرٍ حَرَامٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12778,
                "hadithNumber": "5215",
                "englishNarrator": "Abu Burda reported on the authority of his grandfather:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sent him and Mu'adh bin Jabal رضی اللہ عنہ to Yemen and said to them: Give good tidings to the (people). and make things easy (for them), teach (them), and do not repel (them) ; and I think he also said: Cooperate cheerfully with each other. When he (the Holy Prophet ﷺ) turned his back, Abu Musa رضی اللہ عنہ  returned to him and said: Allah's Messenger, they (the people of Yemen) have a drink which is (made) from honey and which is prepared by cooking it until it coagulates, and Mizr is prepared from barley, whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Every intoxicant that detains you from prayer is forbidden.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ان کو اور حضرت معاذ رضی اللہ عنہ کو یمن بھیجا اور فرما یا : \" تم دونوں لوگوں کو ( اچھے اعمال کے انعام کی ) خوش خبری سنانا اور ( معاملا ت کو ) آسان بنا نا ( دین ) سیکھانا اور متنفر نہ کرنا \" میرا خیال ہے کہ انھوں نے یہ بھی روایت کیا آپ نے فرما یا : \" دونوں ایک دوسرے سے موافقت سے رہنا ۔ \" جب ( اجازت لے کر ) ابو موسیٰ رضی اللہ عنہ پیچھے کی طرف مڑے تو کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم !ان کا شہد سے بنا یا ہو ایک مشروب ہے جسے پکا یا جا تا ہے یہاں تک کہ وہ گا ڑھا ہو جا تا ہے اور ( ایک مشروب ) مزرہے جسے جوسے تیار کیا جا تا ہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" ہر وہ چیز جو نماز سے مد ہوش کردے وہ حرام ہے ۔ \"",
                "urduNarrator": "ہم سے محمد بن عباد نے بیان کیا، کہا ہم سے سفیان نے بیان کیا، انہوں نے عمرو رضی اللہ عنہ سے سنا, عمرو نے سعد بن ابی بردہ سے سنا انھوں نے اپنے والد ( ابو بردہ عامر بن ابی موسیٰ ) کے واسطے سے اپنے دادا سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبَّادٍ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو سَمِعَهُ مِنْ سَعِيدِ بْنِ أَبِي بُرْدَةَ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَهُ وَمُعَاذًا إِلَى الْيَمَنِ فَقَالَ لَهُمَا بَشِّرَا وَيَسِّرَا وَعَلِّمَا وَلَا تُنَفِّرَا وَأُرَاهُ قَالَ وَتَطَاوَعَا قَالَ فَلَمَّا وَلَّى رَجَعَ أَبُو مُوسَى فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ لَهُمْ شَرَابًا مِنْ الْعَسَلِ يُطْبَخُ حَتَّى يَعْقِدَ وَالْمِزْرُ يُصْنَعُ مِنْ الشَّعِيرِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُّ مَا أَسْكَرَ عَنْ الصَّلَاةِ فَهُوَ حَرَامٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12779,
                "hadithNumber": "5216",
                "englishNarrator": "Abu Burda reported on the authority of his father:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sent me and Mu'adh رضی اللہ عنہ to Yemen saying: Call people (to the path of righteousness) and give good tidings to the (people), and do not repel them, make things easy for them and do not make things difficult. I (Burda) said: Allah's Messenger, give us a religious verdict about two kinds of drinks which we prepare in Yemen. One is Bit' which is prepared from honey; it is a fermented Nabidh and is strong and turns into wine, and (the second is) Mizr which is prepared from millet and barley. Thereupon, Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), who had been gifted with the most eloquent and pithy expressions, said: I forbid you from every intoxicant that keeps you away from prayer.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے مجھے اور حضرت معاذ رضی اللہ عنہ کو یمن کی جانب بھیجا آپ نے فرما یا : \" لوگوں کو ( اسلام کی ) دعوت دینا ان کو خوشخبری دینا اور متنفر نہ کرنا ۔ معاملا ت کو آسان بنا نا اور لوگوں کو مشکل میں نہ ڈالنا ۔ انھوں نے کہا : میں نے عرض کی : اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! ہم کو دومشروبوں کے بارے میں شریعت کا حکم بتا ئیے جنھیں ہم یمن میں تیار کرتے تھے ۔ ایک بتع ہے جو شہد سے تیار کیا جا تا ہے ۔ اسے برتنوں میں ڈالا جا تا ہے حتی کی وہ گاڑھا ہو جا تا ہے اور ایک مزرہے وہ مکئی اور جو سے تیار کیا جا تا ہےاسے برتنوں میں ڈالا جا تا ہے حتی کہ اس میں شدت پیدا ہو جا تی ہے ۔ انھوں نے کہا : اور رسول اللہ صلی اللہ علیہ وسلم کو بات کے خبصورت خاتمے سمیت جامع کلمات عطا کیے گئے تھے ۔ آپ نے فرما یا : \" میں ہر اس نشہ آور چیز سے منع کرتا ہوں جو نماز سے مدہوش کردے ۔ ( جس کی زیادہ مقدار مدہوش کردے اس کی قلیل ترین مقدار بھی حرام ہے ۔ )",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم اور محمد بن احمد بن ابی خلف نے بیان کیا، اور یہ قول ابن ابی خلف کا ہے، انہوں نے کہا: ہم سے زکریا بن عدی نے بیان کیا۔ عبید اللہ جو ابن عمرو ہیں, زید بن ابی انیسہ نے سعید بن ابی بردہ سے روایت کی ، کہا : ہمیں حضرت ابو بردہ نے اپنے والد سے روایت کی کہا",
                "hadithArabic": "و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَمُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ وَاللَّفْظُ لِابْنِ أَبِي خَلَفٍ قَالَا حَدَّثَنَا زَكَرِيَّاءُ بْنُ عَدِيٍّ حَدَّثَنَا عُبَيْدُ اللَّهِ وَهُوَ ابْنُ عَمْرٍو عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ عَنْ سَعِيدِ بْنِ أَبِي بُرْدَةَ حَدَّثَنَا أَبُو بُرْدَةَ عَنْ أَبِيهِ قَالَ بَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمُعَاذًا إِلَى الْيَمَنِ فَقَالَ ادْعُوَا النَّاسَ وَبَشِّرَا وَلَا تُنَفِّرَا وَيَسِّرَا وَلَا تُعَسِّرَا قَالَ فَقُلْتُ يَا رَسُولَ اللَّهِ أَفْتِنَا فِي شَرَابَيْنِ كُنَّا نَصْنَعُهُمَا بِالْيَمَنِ الْبِتْعُ وَهُوَ مِنْ الْعَسَلِ يُنْبَذُ حَتَّى يَشْتَدَّ وَالْمِزْرُ وَهُوَ مِنْ الذُّرَةِ وَالشَّعِيرِ يُنْبَذُ حَتَّى يَشْتَدَّ قَالَ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ أُعْطِيَ جَوَامِعَ الْكَلِمِ بِخَوَاتِمِهِ فَقَالَ أَنْهَى عَنْ كُلِّ مُسْكِرٍ أَسْكَرَ عَنْ الصَّلَاةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12780,
                "hadithNumber": "5217",
                "englishNarrator": "Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "A person came from Jaishan, a town of Yemen, and he asked Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) about the wine which was drunk in their land and which was prepared from millet and was called Mizr. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) asked whether that was intoxicating. He said: Yes. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Every intoxicant is forbidden. Verily Allah the Exalted and Majestic, made a covenant to those who drank intoxicants to make their drink Tinat al-Khabal. They said: Allah's Messenger, what is Tinat a]-Khabal? He said: It is the sweat of the denizens of Hell or the discharge of the denizens of Hell.",
                "hadithUrdu": "ایک شخص جیشان سے آیا جیشان یمن میں ہے اس نے نبی صلی اللہ علیہ وسلم سے اپنی سر زمین کے ایک مشروب کے متعلق سوال کیا جس کو مکئی سے بنا یا جا تا تھا اس کا نام مزر تھا نبی صلی اللہ علیہ وسلم نے پو چھا : کیا وہ نشہ آور ہے؟ اس نے کہا : جی ہاں رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" ہرنشہ آور چیز حرام ہے بلا شبہ اللہ عزوجل کا ( اپنے اوپر یہ ) عہد ہے کہ جو شخص نشہ آور مشروب پیے گا وہ اس کو طینۃ الخبال کیا ہے؟ آپ نے فرما یا : \" جہنمیوں کا پسینہ یا ( فرمایا : ) جہنمیوں کا نچوڑ ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ان سے عبد العزیز نے، یعنی الدراوردی نے، ہم سے عمارہ بن غزیہ نے بیان کیا, ابو زبیر نے حضرت جا بر رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي الدَّرَاوَرْدِيَّ عَنْ عُمَارَةَ بْنِ غَزِيَّةَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ أَنَّ رَجُلًا قَدِمَ مِنْ جَيْشَانَ وَجَيْشَانُ مِنْ الْيَمَنِ فَسَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ شَرَابٍ يَشْرَبُونَهُ بِأَرْضِهِمْ مِنْ الذُّرَةِ يُقَالُ لَهُ الْمِزْرُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوَ مُسْكِرٌ هُوَ قَالَ نَعَمْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُّ مُسْكِرٍ حَرَامٌ إِنَّ عَلَى اللَّهِ عَزَّ وَجَلَّ عَهْدًا لِمَنْ يَشْرَبُ الْمُسْكِرَ أَنْ يَسْقِيَهُ مِنْ طِينَةِ الْخَبَالِ قَالُوا يَا رَسُولَ اللَّهِ وَمَا طِينَةُ الْخَبَالِ قَالَ عَرَقُ أَهْلِ النَّارِ أَوْ عُصَارَةُ أَهْلِ النَّارِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12781,
                "hadithNumber": "5218",
                "englishNarrator": "Ibn 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Every intoxicant is Khamr and every intoxicant is forbidden. He who drinks wine in this world and dies while he is addicted to it, not having repented, will not be given a drink in the Hereafter.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" ہر نشہ آور چیز خمرہے اور ہر نشہ آور چیز حرام ہے اور جس شخص نے دنیا میں شراب پی اور اس حالت میں مر گیا کہ وہ شراب کا عادی ہو گیا تھا اور اس نے تو بہ نہیں کی تھی تو وہ آخرت میں اسے نہیں پیے گا ۔",
                "urduNarrator": "ہم سے ابو الربیع العتکی اور ابو کامل نے بیان کیا، کہا کہ ہم سے حماد بن زید نے بیان کیا, ایوب نے نافع سے اور انھوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی : کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو الرَّبِيعِ الْعَتَكِيُّ وَأَبُو كَامِلٍ قَالَا حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ حَدَّثَنَا أَيُّوبُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُّ مُسْكِرٍ خَمْرٌ وَكُلُّ مُسْكِرٍ حَرَامٌ وَمَنْ شَرِبَ الْخَمْرَ فِي الدُّنْيَا فَمَاتَ وَهُوَ يُدْمِنُهَا لَمْ يَتُبْ لَمْ يَشْرَبْهَا فِي الْآخِرَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12782,
                "hadithNumber": "5219",
                "englishNarrator": "Ibn 'Umar رضی اللہ عنہ through another chain of transmitters reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) having said this: Every intoxicant is Khamr and every intoxicant is forbidden.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" ہر نشہ آور چیز خمر ہے اور نشہ آور چیز حرا م ہے ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم اور ابوبکر بن اسحاق دونوں نے روح بن عبادہ کی سند سے بیان کیا, ابن جریج نے کہا : مجھے مو سیٰ بن عقبہ نے نافع سے خبردی انھوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَأَبُو بَكْرِ بْنُ إِسْحَقَ كِلَاهُمَا عَنْ رَوْحِ بْنِ عُبَادَةَ حَدَّثَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي مُوسَى بْنُ عُقْبَةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كُلُّ مُسْكِرٍ خَمْرٌ وَكُلُّ مُسْكِرٍ حَرَامٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12783,
                "hadithNumber": "5220",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Musa bin Uqba with the same chain of transmitters.",
                "hadithUrdu": "ہم سے صالح بن مسمار السلمی نے بیان کیا، ہم سے معان نے بیان کیا, عبد العزیز بن مطلب نے مو سیٰ بن عقبہ سے اسی سند کے ساتھ اسی کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا صَالِحُ بْنُ مِسْمَارٍ السُّلَمِيُّ حَدَّثَنَا مَعْنٌ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْمُطَّلِبِ عَنْ مُوسَى بْنِ عُقْبَةَ بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12784,
                "hadithNumber": "5221",
                "englishNarrator": "Nafi' reported Ibn 'Umar رضی اللہ عنہ as saying:",
                "hadithEnglish": "I do not know this but from Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) who said: Every intoxicant is Khamr and every Khamr is forbidden.",
                "hadithUrdu": "اس بات کا علم مجھ کو رسول اللہ صلی اللہ علیہ وسلم ہی کی طرف سے ہے کہ آپ نے فرما یا : \" ہر نشہ آور چیز خمر ہے اور ہر خمر حرام ہے ۔ \"",
                "urduNarrator": "اور ہم سے محمد بن المثنیٰ اور محمد بن حاتم نے بیان کیا، کہا: ہم سے یحییٰ نے جو القطان ہیں، بیان کیا, عبید اللہ نے کہا : ہمیں نافع نے حضرت ابن عمر رضی اللہ عنہ سے خبر دی کہا",
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ حَاتِمٍ قَالَا حَدَّثَنَا يَحْيَى وَهُوَ الْقَطَّانُ عَنْ عُبَيْدِ اللَّهِ أَخْبَرَنَا نَافِعٌ عَنْ ابْنِ عُمَرَ قَالَ وَلَا أَعْلَمُهُ إِلَّا عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كُلُّ مُسْكِرٍ خَمْرٌ وَكُلُّ خَمْرٍ حَرَامٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12785,
                "hadithNumber": "5222",
                "englishNarrator": "Ibn 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who drank (wine) in this world would be deprived of it in the Hereafter.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" جس شخص نے دنیا میں شراب پی وہ آخرت میں اس سے محروم رہے گا ۔ \"",
                "urduNarrator": "یحییٰ بن یحییٰ نے کہا : میں نے امام مالک کے سامنے قراءت کی کہ نافع سے روایت ہے انھوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ شَرِبَ الْخَمْرَ فِي الدُّنْيَا حُرِمَهَا فِي الْآخِرَةِ.",
                "headingArabic": "عُقُوبَةِ مَنْ شَرِبَ الْخَمْرَ إِذَا لَمْ يَتُبْ مِنْهَا بِمَنْعِهِ إِيَّاهَا فِي الآخِرَةِ ‏‏",
                "headingUrdu": "خمر پینے والے کی سزا اگر وہ اس سے توبہ نہ کرے: آخرت میں اس سے انکار کیا جائے گا۔",
                "headingEnglish": "The punishment of one who drinks Khamr if he does not repent from it: he will be denied it in the hereafter",
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12786,
                "hadithNumber": "5223",
                "englishNarrator": "Ibn 'Umar رضی اللہ عنہ said:",
                "hadithEnglish": "He who drank wine in the world and did not repent would be deprived of it (the pure drink) in the Hereafter. It was said to Malik: Is this hadith Marfu'? He said: Yes.",
                "hadithUrdu": "\" جس شخص نے دنیا میں شراب پی اور اس سے تو بہ نہیں کیا اسے آخرت میں اس سے محروم کردیا جائے گا وہ اسے نہیں پلا ئی جا ئے گی ۔ \" امام مالک سے پوچھا گیا : کیا انھوں نے ( حضرت ابن عمر رضی اللہ عنہ ) نے اسے رسول اللہ صلی اللہ علیہ وسلم سے بیان کیا ؟ انھوں نے کہا : ہاں ۔",
                "urduNarrator": "عبد اللہ بن مسلمہ بن قعنب نے کہا : ہمیں مالک نے نافع سے حدیث بیان کی ، ( انھوں نے ) حضرت ابن عمر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ حَدَّثَنَا مَالِكٌ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ مَنْ شَرِبَ الْخَمْرَ فِي الدُّنْيَا فَلَمْ يَتُبْ مِنْهَا حُرِمَهَا فِي الْآخِرَةِ فَلَمْ يُسْقَهَا قِيلَ لِمَالِكٍ رَفَعَهُ قَالَ نَعَمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12787,
                "hadithNumber": "5224",
                "englishNarrator": "Ibn 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who drank wine in this world will not be provided with pure drink in the Hereafter, except in case he repents.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" جس شخص نے دنیا میں شراب پی وہ آخرت میں نہیں پیے گا ۔ الا یہ کہ وہ توبہ کرلے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے عبداللہ بن نمیر  نے بیان کیا، ہم سے ابن نمیر نے بیان کیا، ہم سے میرے والد نے بیان کیا, عبید اللہ نے نافع سے ، انھوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی ، کہ",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ شَرِبَ الْخَمْرَ فِي الدُّنْيَا لَمْ يَشْرَبْهَا فِي الْآخِرَةِ إِلَّا أَنْ يَتُوبَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12788,
                "hadithNumber": "5225",
                "englishNarrator": null,
                "hadithEnglish": "Ibn 'Umar رضی اللہ عنہ reported this hadith from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) through another chain of transmitters.",
                "hadithUrdu": "ہم سے ابن ابی عمر نے بیان کیا، ہشام نے، یعنی ہم سے ابن سلیمان المخزومی نے، ابن جریج کی سند سے بیان کیا, موسیٰ بن عقبہ نے نافع سے ، انھوں نے حضرت ابن عمر رضی اللہ عنہ سے ، انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے عبید اللہ کی حدیث کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا هِشَامٌ يَعْنِي ابْنَ سُلَيْمَانَ الْمَخْزُومِيَّ عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنِي مُوسَى بْنُ عُقْبَةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ عُبَيْدِ اللَّهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 12476,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=499",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=497",
                "label": "497",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=498",
                "label": "498",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=499",
                "label": "499",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=500",
                "label": "500",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=501",
                "label": "501",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=502",
                "label": "502",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=503",
                "label": "503",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=501",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=501",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=499",
        "to": 12500,
        "total": 40465
    }
}