{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 406,
        "data": [
            {
                "id": 10414,
                "hadithNumber": "2850",
                "englishNarrator": "Tawus reported on the authority of Ibn 'Abbas ( رضی اللہ تعالیٰ عنہ) that Zaid bin Arqam  رضی اللہ تعالیٰ عنہ went to him (Ibn 'Abbas رضی اللہ تعالیٰ عنہ) and said:",
                "hadithEnglish": "Narrate how you informed me about the meat of the game presented to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as he was in the state of Ihram. Thereupon he said: He was presented with a slice of the meat of game, but he returned it to him (who presented it) saying: We are not going to eat it, as we are in the state of Ihram.",
                "hadithUrdu": "آپ نے مجھے اس شکار کے گو شت کے متعلق کس طرح بتا یا تھا جو رسول اللہ صلی اللہ علیہ وسلم کو احرا م کی حالت میں ہدیتاً پیش کیا گیا تھا ؟ ( طاوس نے ) کہا ( زید بن ارقم رضی اللہ تعالیٰ عنہ نے ) بتا یا ) آپ صلی اللہ علیہ وسلم کو شکار کے گو شت کا ایک ٹکڑا پیش کیا گیا تو آپ نے اسے واپس کر دیا اور فر ما یا : ہم اسے نہیں کھا سکتے ( کیونکہ ) ہم احرا م میں ہیں ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے یحییٰ بن سعید نے بیان کیا، انہوں نے ابن جریج کی سند سے، کہا: مجھ سے حسن بن مسلم نے بیان کیا، طاوس نے ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی کہا : ( ایک بار ) زید بن ارقم رضی اللہ تعالیٰ عنہ تشریف لا ئے تو ابن عباس رضی اللہ تعالیٰ عنہ نے انھیں یاد کراتے ہو ئے کہا",
                "hadithArabic": "وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنِ ابْنِ جُرَيْجٍ، قَالَ: أَخْبَرَنِي الْحَسَنُ بْنُ مُسْلِمٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا، قَالَ: قَدِمَ زَيْدُ بْنُ أَرْقَمَ، فَقَالَ لَهُ عَبْدُ اللهِ بْنُ عَبَّاسٍ يَسْتَذْكِرُهُ: كَيْفَ أَخْبَرْتَنِي عَنْ لَحْمِ صَيْدٍ أُهْدِيَ إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَهُوَ حَرَامٌ؟ قَالَ: قَالَ: أُهْدِيَ لَهُ عُضْوٌ مِنْ لَحْمِ صَيْدٍ فَرَدَّهُ، فَقَالَ: «إِنَّا لَا نَأْكُلُهُ إِنَّا حُرُمٌ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10415,
                "hadithNumber": "2851",
                "englishNarrator": "Abu Qatada رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "We went with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) till we reached al-Qaha (a place three stages away from Medina). Some of us were in the state of Ihram and some of us were not. I saw my companions looking towards something, and as I saw I found It to be a wild ass. I saddled my horse and took up my spear and then mounted upon (the horse) and my whip, fell down. I said to my companions as they were in the state of Ihram to pick up the whip for me but they said: By Allah, we cannot help you in any (such) thing (i. e. hunting). So i dismounted (the horse) and picked it (whip) up and mounted again and caught the wild ass after chasing it. It was behind a hillock and I attacked it with my spear and killed it. Then I brought it to my companions. Some of them said: Eat it, while others said: Do not eat it. The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was in front of us. I moved my horse and came to him (and asked him), whereupon he said: It is permissible, so eat it.",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نکلے حتی کہ جب ہم ( مدینہ سے تین منزل دو ر وادی ) قاحہ میں تھے تو ہم میں سے بعض احرا م کی حا لت میں تھے اور کوئی بغیر احرام کے تھا ۔ اچا نک میری نگا ہ اپنے ساتھیوں پر پڑی تو وہ ایک دوسرے کو کچھ دکھا رہے تھے میں نے دیکھا تو ایک زیبرا تھا میں نے ( فوراً ) اپنے گھوڑے پر زین کسی اپنا نیز ہ تھا مااور سوار ہو گیا ۔ ( جلدی میں ) مجھ سے میرا کو ڑا گر گیا میں نے اپنے ساتھیوں سے جو احرا م باند ھے ہو ئے تھے کہا : مجھے کو ڑا پکڑا دو انھوں نے کہا : اللہ کی قسم !ہم اس ( شکار ) میں تمھاری کوئی مدد نہیں کریں گے ۔ بالآخر میں اترا اسے پکڑا ۔ پھر سوار ہوا اور زیبرے کو اس کے پیچھے سے جا لیا اور وہ ایک ٹیلے کے پیچھے تھا ۔ میں نے اسے اپنے نیزے کا نشانہ بنا یا اور اسے گرا لیا ۔ پھر میں اسے ساتھیوں کے پاس لے آیا ۔ ان میں سے کچھ نے کہا : اسے کھا لو اور کچھ نے کہا : اسے مت کھانا نبی صلی اللہ علیہ وسلم ( کچھ فاصلے پر ) ہم سے آگے تھے ۔ میں نے اپنے گھوڑے کو حرکت دی اور آپ کے پاس پہنچ گیا ( اور اس کے بارے میں پوچھا ) آپ نے فر ما یا : \"\" وہ حلال ہے اسے کھا لو ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ہم سے سفیان نے بیان کیا، ان سے صالح بن کیسان نے بیان کیا، اور ہم سے ابن ابی عمر نے بیان کیا - اور ہم سے سفیان نے بیان کیا، صالح بن کیسان نے کہا : میں نے ابو قتادہ رضی اللہ تعالیٰ عنہ کے مولیٰ ابو محمد سے سنا ، وہ کہہ رہے تھے کہ میں ابو قتادہ رضی اللہ تعالیٰ عنہ کو کہتے ہو ئے سنا",
                "hadithArabic": "وحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ صَالِحِ بْنِ كَيْسَانَ، ح وحَدَّثَنَا ابْنُ أَبِي عُمَرَ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا صَالِحُ بْنُ كَيْسَانَ، قَالَ: سَمِعْتُ أَبَا مُحَمَّدٍ، مَوْلَى أَبِي قَتَادَةَ، يَقُولُ: سَمِعْتُ أَبَا قَتَادَةَ، يَقُولُ: خَرَجْنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، حَتَّى إِذَا كُنَّا بِالْقَاحَةِ، فَمِنَّا الْمُحْرِمُ وَمِنَّا غَيْرُ الْمُحْرِمِ، إِذْ بَصُرْتُ بِأَصْحَابِي يَتَرَاءَوْنَ شَيْئًا، فَنَظَرْتُ فَإِذَا حِمَارُ وَحْشٍ، فَأَسْرَجْتُ فَرَسِي وَأَخَذْتُ رُمْحِي، ثُمَّ رَكِبْتُ فَسَقَطَ مِنِّي سَوْطِي، فَقُلْتُ لِأَصْحَابِي: وَكَانُوا مُحْرِمِينَ: نَاوِلُونِي السَّوْطَ، فَقَالُوا: وَاللهِ، لَا نُعِينُكَ عَلَيْهِ بِشَيْءٍ، فَنَزَلْتُ فَتَنَاوَلْتُهُ، ثُمَّ رَكِبْتُ، فَأَدْرَكْتُ الْحِمَارَ مِنْ خَلْفِهِ وَهُوَ وَرَاءَ أَكَمَةٍ، فَطَعَنْتُهُ بِرُمْحِي فَعَقَرْتُهُ، فَأَتَيْتُ بِهِ أَصْحَابِي، فَقَالَ بَعْضُهُمْ: كُلُوهُ، وَقَالَ بَعْضُهُمْ: لَا تَأْكُلُوهُ، وَكَانَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَمَامَنَا فَحَرَّكْتُ فَرَسِي فَأَدْرَكْتُهُ فَقَالَ: «هُوَ حَلَالٌ، فَكُلُوهُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10416,
                "hadithNumber": "2852",
                "englishNarrator": "Abu Qatada (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "While he was with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) on one of the highways of Mecca, he lagged behind him (the Holy Prophet ﷺ) along with companions who were in the state of Ihram, whereas he was himself not Muhrim. He saw a wild ass. As he was mounting his horse he asked his companions to pick up for him his whip (which had dropped) but they refused to do so. He asked them to hand him over the spear, but they refused. He then himself took hold of it and chased the wild ass and killed it. Some of the Companions of the Messenger of Allah (ﷺ) ate (its meat), but some of them refused to do so. They overtook the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) and asked him about it, and he said: It is a food which Allah provided you (so eat it).",
                "hadithUrdu": "وہ ( عمرہ حدیبیہ میں ) رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے حتی کہ جب وہ مکہ کے راستے کے ایک حصے میں تھے ، وہ اپنے چند احرا م والے ساتھیوں کی معیت میں پیچھے رہ گئے وہ خود احرا م کے بغیر تھے ۔ تو ( اچا نک ) انھوں نے زبیرا دیکھا وہ اپنے گھوڑے کی پشت پر سیدھے ہو ئے اور اپنے ساتھیوں سے اپنا کو ڑا پکڑا نے کو کہا انھوں نے انکا ر کر دیا پھر ان سے اپنا نیزہ مانگا ( کہ ان کو ہاتھ میں تھما دیں ) انھوں نے ( اس سے بھی ) انکا ر کر دیقا ۔ انھوں نے خود ہی نیزہ اٹھا یا پھر زیبرے پر حملہ کر کے اسے مار لیا نبی صلی اللہ علیہ وسلم کے بعض ساتھیوں نے اس میں سے کھا یا اور بعض نے ( کھانے سے ) انکا ر کر دیا ۔ جب وہ رسول اللہ صلی اللہ علیہ وسلم کے پا س پہنچے تو آپ سے اس ( شکار ) کے بارے میں پو چھا : آپ نے فر ما یا : \" یہ کھا نا ہی ہے جو اللہ تعا لیٰ نے تمھیں کھلا یا ہے ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا: میں نے مالک رضی اللہ عنہ سے، ہم سے قتیبہ نے بیان کیا، انہوں نے مالک رضی اللہ عنہ سے جو کچھ ان کے پاس پڑھا گیا تھا ,  ابو نضر نے ابو قتادہ رضی اللہ تعالیٰ عنہ کے مولیٰ نافع سے انھوں نے ابو قتادہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، ح وحَدَّثَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، فِيمَا قُرِئَ عَلَيْهِ عَنْ أَبِي النَّضْرِ، عَنْ نَافِعٍ مَوْلَى أَبِي قَتَادَةَ، عَنْ أَبِي قَتَادَةَ رَضِيَ اللهُ عَنْهُ، أَنَّهُ كَانَ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، حَتَّى إِذَا كَانَ بِبَعْضِ طَرِيقِ مَكَّةَ تَخَلَّفَ مَعَ أَصْحَابٍ لَهُ مُحْرِمِينَ، وَهُوَ غَيْرُ مُحْرِمٍ فَرَأَى حِمَارًا وَحْشِيًّا، فَاسْتَوَى عَلَى فَرَسِهِ، فَسَأَلَ أَصْحَابَهُ أَنْ يُنَاوِلُوهُ سَوْطَهُ فَأَبَوْا عَلَيْهِ، فَسَأَلَهُمْ رُمْحَهُ فَأَبَوْا عَلَيْهِ، فَأَخَذَهُ ثُمَّ شَدَّ عَلَى الْحِمَارِ فَقَتَلَهُ، فَأَكَلَ مِنْهُ بَعْضُ أَصْحَابِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَأَبَى بَعْضُهُمْ، فَأَدْرَكُوا رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَسَأَلُوهُ عَنْ ذَلِكَ، فَقَالَ: «إِنَّمَا هِيَ طُعْمَةٌ أَطْعَمَكُمُوهَا اللهُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10417,
                "hadithNumber": "2853",
                "englishNarrator": "This hadith pertaining to the wild ass is reported on the authority of Abu Qatada رضی اللہ تعالیٰ عنہ . The rest of the hadith is the same but with this (variation of words):",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Is there with you some of its flesh?",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" کیا تمھا رے پاس اس کے گو شت میں سے کچھ باقی ہے؟",
                "urduNarrator": "ہم سے قتیبہ نے مالک کی سند سے بیان کیا, زید بن اسلم نے عطا ء بن یسار سے انھوں نے سے ابو قتادہ رضی اللہ تعالیٰ عنہ سے ابو نضر کی حدیث کے مانند حدیث بیان کی البتہ زید بن اسلم کی حدیث میں ہے کہ",
                "hadithArabic": "وحَدَّثَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي قَتَادَةَ رَضِيَ اللهُ عَنْهُ فِي حِمَارِ الْوَحْشِ مِثْلَ حَدِيثِ أَبِي النَّضْرِ، غَيْرَ أَنَّ فِي حَدِيثِ زَيْدِ بْنِ أَسْلَمَ أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «هَلْ مَعَكُمْ مِنْ لَحْمِهِ شَيْءٌ؟».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10418,
                "hadithNumber": "2854",
                "englishNarrator": "Abdullah bin Abu Qatada رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "My father went with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) in the year of Hudaibiya. His Companions entered upon the state of Ihram whereas he did not, for it was conveyed to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) that the enemy (was hiding at) Ghaiqa. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) went forward. He (Abu Qatada رضی اللہ تعالیٰ عنہ ) said: Meanwhile I was along with his Companions, some of them smiled (to one another) As I cast a glance I saw a wild ass. I attacked It with a spear and held it, and begged for their (i. e. of his companions) assistance, but they refused to help me and we ate its meat. But we were afraid lest we should be separated (from the Messenger of Allah). So I proceeded on (with a view to) seeking the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). Some- times I'dashed my horse and sometimes I made it run at a leisurely pace (keeping pace with others). (In the meanwhile) I met a person from Banfu Ghifar in the middle of the night. I said to him: Where did you meet the messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌)? He said: I left him at Ta'bin and he intended to halt at Suqya to spend the afternoon. I met him and said: Messenger of Allah. your Companions convey salutations and benedictions of Allah to you and they fear that they may not be separated from you (and the enemy may do harm to you), so wait for them, and he (the Holy Prophet) waited for them. I said: Messenger of Allah, I killed a game and there is left with me (some of the meat). The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to his people: Eat it. And they were in the state of Ihram.",
                "hadithUrdu": "میرے والد حدیبیہ کے سال رسول اللہ صلی اللہ علیہ وسلم کے ساتھ روانہ ہو ئے ان کے ساتھیوں نے ( عمرے ) کا احرام باندھا لیکن انھوں نے نہ باندھا ۔ اور رسول اللہ صلی اللہ علیہ وسلم کو بتا یا گیا کہ غیقہ مقام پر دشمن ( گھا ت میں ) ہے ( مگر ) رسول اللہ صلی اللہ علیہ وسلم چل پڑے ۔ ابو قتادہ رضی اللہ تعالیٰ عنہ نے ) کہا : میں آپ کے صحابہ کرام رضوان اللہ عنھم اجمعین کے ہمرا ہ تھا وہ ایک دوسرے کے ساتھ مل کر ہنس رہے تھے ۔ اتنے میں میں نے دیکھا تو میری نظر زیبرے پر پڑی میں نے اس پر حملہ کر دیا اور اسے نیزہ مار کر بے حرکت کر دیا پھر میں نے ان سے مدد چا ہی تو انھوں نے میری مدد کرنے سے انکا ر کر دیا ۔ پھر ہم نے اس کا گو شت تناول کیا ۔ اور ہمیں اندیشہ ہوا کہ ہم ( آپ سے ) کاٹ ( کر الگ کر ) دیے جا ئیں گے ۔ تو میں رسول اللہ صلی اللہ علیہ وسلم کی تلا ش میں روانہ ہوا کبھی میں گھوڑے کو بہت تیز تیز دوڑاتا تو کبھی ( آرام سے ) چلا تا آدھی را ت کے وقت مجھے بنو غفار کا ایک شخص ملا میں نے اس سے پو چھا تم رسول اللہ صلی اللہ علیہ وسلم سے کہا ں ملے تھے؟ اس نے کہا : میں نے آپ صلی اللہ علیہ وسلم کو تعهن کے مقام پر چھورا ہے آپ فر ما رہے تھے سُقیا ( پہنچو ) چنانچہ میں آپ سے جا ملا اور عرض کی : اے اللہ کے رسول اللہ صلی اللہ علیہ وسلم !آپ کے صحابہ کرا م رضوان اللہ عنھم اجمعین آپ کو سلام عرض کرتے ہیں اور انھیں ڈر ہے کہ انھیں آپ سے کا ٹ ( کر الگ کر ) دیا جا ئے گا ۔ آپ ان کا انتظار فر ما لیجیے ۔ تو آپ نے ( وہاں ) انکا انتظار فر ما یا ۔ پھر میں نے عرض کی : اے اللہ کے رسول اللہ صلی اللہ علیہ وسلم !میں نے شکار کیا تھا اور اس کا بچا ہوا کچھ ( حصہ ) میرے پاس باقی ہے نبی صلی اللہ علیہ وسلم نے لوگوں سے فر ما یا ۔ \" کھا لو \" جبکہ وہ سب احرا م کی حا لت میں تھے ۔",
                "urduNarrator": "ہم سے صالح بن مسمار السلمی نے بیان کیا، ہم سے معاذ بن ہشام نے بیان کیا، مجھ سے میرے والد نے بیان کیا، یحییٰ بن ابی کثیر سے روایت ہے انھوں نے کہا : ) مجھ سے عبد اللہ بن ابی قتادہ رضی اللہ تعالیٰ عنہ نے حدیث بیان کی کہا",
                "hadithArabic": "وحَدَّثَنَا صَالِحُ بْنُ مِسْمَارٍ السُّلَمِيُّ، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنِي أَبِي، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، حَدَّثَنِي عَبْدُ اللهِ بْنُ أَبِي قَتَادَةَ، قَالَ: انْطَلَقَ أَبِي مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَامَ الْحُدَيْبِيَةِ، فَأَحْرَمَ أَصْحَابُهُ وَلَمْ يُحْرِمْ، وَحُدِّثَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، أَنَّ عَدُوًّا بِغَيْقَةَ، فَانْطَلَقَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: فَبَيْنَمَا أَنَا مَعَ أَصْحَابِهِ، يَضْحَكُ بَعْضُهُمْ إِلَى بَعْضٍ، إِذْ نَظَرْتُ فَإِذَا أَنَا بِحِمَارِ وَحْشٍ، فَحَمَلْتُ عَلَيْهِ، فَطَعَنْتُهُ فَأَثْبَتُّهُ، فَاسْتَعَنْتُهُمْ فَأَبَوْا أَنْ يُعِينُونِي، فَأَكَلْنَا مِنْ لَحْمِهِ، وَخَشِينَا أَنْ نُقْتَطَعَ، فَانْطَلَقْتُ أَطْلُبُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَرْفَعُ فَرَسِي شَأْوًا وَأَسِيرُ شَأْوًا، فَلَقِيتُ رَجُلًا مِنْ بَنِي غِفَارٍ فِي جَوْفِ اللَّيْلِ، فَقُلْتُ: أَيْنَ لَقِيتَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ؟ قَالَ: تَرَكْتُهُ بِتَعْهِنَ وَهُوَ قَائِلٌ السُّقْيَا، فَلَحِقْتُهُ، فَقُلْتُ: يَا رَسُولَ اللهِ، إِنَّ أَصْحَابَكَ يَقْرَءُونَ عَلَيْكَ السَّلَامَ وَرَحْمَةَ اللهِ، وَإِنَّهُمْ قَدْ خَشُوا أَنْ يُقْتَطَعُوا دُونَكَ، انْتَظِرْهُمْ، فَانْتَظَرَهُمْ، فَقُلْتُ: يَا رَسُولَ اللهِ، إِنِّي أَصَدْتُ وَمَعِي مِنْهُ فَاضِلَةٌ، فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: لِلْقَوْمِ: «كُلُوا» وَهُمْ مُحْرِمُونَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10419,
                "hadithNumber": "2855",
                "englishNarrator": "Abdullah bin Abu Qatada رضی اللہ تعالیٰ عنہ reported on the authority of his father:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) set out for Pilgrimage and we also set out along with him. He (Abu Qatada رضی اللہ تعالیٰ عنہ) said: There proceeded on some of his Companions and Abu Qatada رضی اللہ تعالیٰ عنہ was (one of them). He (the Prophet) said: You proceed along the coastline till you meet me. He (Abu Qatada) said: So they proceeded ahead of the Prophet of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), all of them had entered upon the state of Ihram, except Abu Qatada رضی اللہ تعالیٰ عنہ ; he had not put on ihram. As they went on they saw a wild ass, and Abu Qatada رضی اللہ تعالیٰ عنہ attacked it and cut off its hind legs. They got down and ate its meat. They said: We ate meat In the state of Ihram. They carried the meat that was left of it. As they came to the Messenger of Allah (way peace be upon him) they said: Messenger of Allah, we were in the state of Ihram whereas Abu Qatada رضی اللہ تعالیٰ عنہ was not. We saw a wild ass and Abu Qatada رضی اللہ تعالیٰ عنہ attacked it and cut off its hind legs. We got down and ate its meat and we thus ate the meat of a game while we were In the state of Ihram. We have (carried to you) what was left out of its meat. Thereupon he (the holy Prophet) said: Did anyone among you command him (to hunt) or point to him with anything (to do so)? They said: No. Thereupon he said: Then eat what is left out of its meat.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم حج کے لیے نکلے ۔ ہم بھی آپ کے ساتھ نکلے ، کہا آپ نے اپنے صحابہ کرا م رضوان اللہ عنھم اجمعین میں کچھ لوگوں کو جن میں ابو قتادہ رضی اللہ تعالیٰ عنہ بھی شامل تھے ہٹا ( کر ایک سمت بھیج دیا اور فر ما یا \"\" ساحل سمندر لے لے کے چلو حتی کہ مجھ سے آملو ۔ \"\" کہا : انھوں نے ساھل سمندر کا را ستہ اختیار کیا ۔ جب انھوں نے رسول اللہ صلی اللہ علیہ وسلم کی طرف رخ کیا تو ابو قتادہ رضی اللہ تعالیٰ عنہ کے علاوہ سب نے احرا م باندھ لیا ( بس ) انھوں نے احرا م نہیں باندھا تھا ۔ اسی اثنا میں جب وہ چل رہے تھے انھوں نے زبیرے دیکھے ابو قتادہ رضی اللہ تعالیٰ عنہ نے ان پر حملہ کر دیا اور ان میں سے ایک مادہزیبرا کوگرا لیا ۔ وہ ( لو گ ) اترے اور اس کا گو شت تناول کیا ۔ کہا وہ ( صحا بہ کرا م رضوان اللہ عنھم اجمعین ) کہنے لگے ۔ ہم نے ( تو شکار کا گو شت کھا لیا جبکہ ہم احرا م کی حا لت میں ہیں ۔ ( راوی نے ) کہا : انھوں نے مادہ زیبرے کا بچا ہوا گو شت اٹھا لیا ( اور چل پڑے ) جب رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں پہنچے کہنے لگے ۔ ہم سب نے احرا م باند ھ لیا تھا جبکہ ابو قتادہ رضی اللہ تعالیٰ عنہ نے ان پر حملہ کر دیا اور ان میں سے ایک مادہ زیبرا مار لیا ۔ پس ہم اترے اور اس کا گو شت کھایا ۔ بعد میں ہم نے کہا : ہم احرا م باندھے ہو ئے ہیں اور شکار کا گو شت کھا رہے ہیں ! پھر ہم نے اس کا باقی گو شت اٹھا یا ( اور آگئے ) آپ صلی اللہ علیہ وسلم نے فر ما یا : \"\" کیا تم میں سے کسی نے ابو قتادہ رضی اللہ تعالیٰ عنہ سے ( شکار کرنے کو ) کہا تھا ۔ ؟یا کسی چیز سے اس ( شکار ) کی طرف اشارہ کیا تھا ؟انھوں نے کہا نہیں آپ نے فر ما یا : \"\" اس کا باقی گو شت بھی تم کھا لو ۔",
                "urduNarrator": "مجھ سے ابو کامل الجہدری نے بیان کیا، ہم سے ابو عونہ نے بیان کیا, عثمان بن عبد اللہ بن مو ہب نے عبد اللہ بن ابی قتادہ رضی اللہ تعالیٰ عنہ سے انھوں نے اپنے والد سے روایت کی کہا",
                "hadithArabic": "حَدَّثَنِي أَبُو كَامِلٍ الْجَحْدَرِيُّ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عُثْمَانَ بْنِ عَبْدِ اللهِ بْنِ مَوْهَبٍ، عَنْ عَبْدِ اللهِ بْنِ أَبِي قَتَادَةَ، عَنْ أَبِيهِ رَضِيَ اللهُ عَنْهُ، قَالَ: خَرَجَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حَاجًّا، وَخَرَجْنَا مَعَهُ، قَالَ: فَصَرَفَ مِنْ أَصْحَابِهِ فِيهِمْ أَبُو قَتَادَةَ، فَقَالَ: «خُذُوا سَاحِلَ الْبَحْرِ حَتَّى تَلْقَوْنِي» قَالَ: فَأَخَذُوا سَاحِلَ الْبَحْرِ، فَلَمَّا انْصَرَفُوا قِبَلَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، أَحْرَمُوا كُلُّهُمْ، إِلَّا أَبَا قَتَادَةَ، فَإِنَّهُ لَمْ يُحْرِمْ، فَبَيْنَمَا هُمْ يَسِيرُونَ إِذْ رَأَوْا حُمُرَ وَحْشٍ، فَحَمَلَ عَلَيْهَا أَبُو قَتَادَةَ، فَعَقَرَ مِنْهَا أَتَانًا، فَنَزَلُوا فَأَكَلُوا مِنْ لَحْمِهَا، قَالَ فَقَالُوا: أَكَلْنَا لَحْمًا وَنَحْنُ مُحْرِمُونَ، قَالَ: فَحَمَلُوا مَا بَقِيَ مِنْ لَحْمِ الْأَتَانِ، فَلَمَّا أَتَوْا رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالُوا: يَا رَسُولَ اللهِ، إِنَّا كُنَّا أَحْرَمْنَا، وَكَانَ أَبُو قَتَادَةَ لَمْ يُحْرِمْ، فَرَأَيْنَا حُمُرَ وَحْشٍ، فَحَمَلَ عَلَيْهَا أَبُو قَتَادَةَ، فَعَقَرَ مِنْهَا أَتَانًا، فَنَزَلْنَا فَأَكَلْنَا مِنْ لَحْمِهَا، فَقُلْنَا: نَأْكُلُ لَحْمَ صَيْدٍ وَنَحْنُ مُحْرِمُونَ، فَحَمَلْنَا مَا بَقِيَ مِنْ لَحْمِهَا، فَقَالَ: «هَلْ مِنْكُمْ أَحَدٌ أَمَرَهُ أَوْ أَشَارَ إِلَيْهِ بِشَيْءٍ؟» قَالَ قَالُوا: لَا، قَالَ: «فَكُلُوا مَا بَقِيَ مِنْ لَحْمِهَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10420,
                "hadithNumber": "2856",
                "englishNarrator": "This hadith is narrated'on the authority of 'Uthman bin 'Abdullah bin Mauhab with the same chain of transmitters. And in the narration transmitted on the authority of Shaiban (the words are):",
                "hadithEnglish": "The Messenoer of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Did any one of you command him to attack it or point towards it? And in the narration transmitted by Shu'ba (the words are): Did you point out or did you help or did you hunt? Shu'ba said: I do not know whether he said: Did you help or did you hunt?",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \"\" کیا تم میں سے کسی نے ان سے کہا تھا کہ وہ اس پر حملہ کریں یا اس کی طرف اشارہ کیا تھا ؟ شعبہ کی روایت میں ہے کہ ( آپ صلی اللہ علیہ وسلم نے ) فر ما یا : کیا تم لوگوں نے اشارہ کیا یا مدد کی شکار کرا یا ؟ شعبہ نے کہا : میں نہیں جا نتا کہ آپ نے کہا : تم لوگوں نے مدد کی \"\" یا کہا : \"\" تم لو گوں نے شکار کرا یا ۔",
                "urduNarrator": "ہم سے محمد بن المثنیٰ نے بیان کیا، ہم سے محمد بن جعفر نے بیان کیا، انہوں نے ہم سے بیان کیا شعبہ اور شیبان دو نوں نے عثمان بن عبد اللہ بن مو ہب سے اسی سند کے ساتھ روایت کی ۔ شیبان کی روایت میں ہے کہ",
                "hadithArabic": "وحَدَّثَنَاه مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، ح وحَدَّثَنِي الْقَاسِمُ بْنُ زَكَرِيَّا، حَدَّثَنَا عُبَيْدُ اللهِ، عَنْ شَيْبَانَ، جَمِيعًا عَنْ عُثْمَانَ بْنِ عَبْدِ اللهِ بْنِ مَوْهَبٍ، بِهَذَا الْإِسْنَادِ فِي رِوَايَةِ شَيْبَانَ، فَقَالَ: رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «أَمِنْكُمْ أَحَدٌ أَمَرَهُ أَنْ يَحْمِلَ عَلَيْهَا أَوْ أَشَارَ إِلَيْهَا؟» وَفِي رِوَايَةِ شُعْبَةَ قَالَ: «أَشَرْتُمْ أَوْ أَعَنْتُمْ أَوْ أَصَدْتُمْ؟» قَالَ شُعْبَةُ: لَا أَدْرِي، قَالَ: «أَعَنْتُمْ» أَوْ «أَصَدْتُمْ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10421,
                "hadithNumber": "2857",
                "englishNarrator": "Abdullah bin Abu Qatada رضی اللہ تعالیٰ عنہ narrated on the authority of his father:",
                "hadithEnglish": "They went with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) on an expedition to Hudaibiya. He (further) said: They had entered upon the state of Ihram except I for 'Umra. He (again) said: I (Abu Qatada) hunted a wild ass and fed my companions in the state of their being Muhrim. 1 then came to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and informed him that we had with us the meat that was left out of it. Thereupon he said: Eat it, while they were in the state of Ihram.",
                "hadithUrdu": "انھوں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ غزوہ حدیبیہ میں شر کت کی ، کہا : میرے علاوہ سب نے عمرے کا ( احرا م باند ھ لیا اور ) تلبیہ شروع کر دیا ۔ کہا : میں نے ایک زیبرا شکار کیا اور اپنے ساتھیوں کو کھلا یا جبکہ وہ سب احرا م کی حالت میں تھے ۔ پھر میں رسول اللہ صلی اللہ علیہ وسلم کے پاس حاضر ہوا انھیں بتا یا کہ ہما رے پاس اس ( شکار ) کا کچھ گو شت بچا ہوا ہے ۔ آپ نے ( ساتھیوں سے رضی اللہ تعالیٰ عنہ فر ما یا : \" اسے کھا ؤ \" حالا نکہ وہ سب احرا م میں تھے ،",
                "urduNarrator": "ہم سے عبداللہ بن عبدالرحمٰن دارمی نے بیان کیا، انہوں نے بیان کیا یحییٰ ( بن ابی کثیر ) نے خبر دی کہا : مجھے عبد اللہ بن ابی قتادہ رضی اللہ تعالیٰ عنہ نے خبر دی کہ ان کے والدنے اللہ ان سے را ضی ہو  انھیں خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا يَحْيَى بْنُ حَسَّانَ، حَدَّثَنَا مُعَاوِيَةُ وَهُوَ ابْنُ سَلَّامٍ، أَخْبَرَنِي يَحْيَى، أَخْبَرَنِي عَبْدُ اللهِ بْنُ أَبِي قَتَادَةَ، أَنَّ أَبَاهُ رَضِيَ اللهُ عَنْهُ، أَخْبَرَهُ، أَنَّهُ غَزَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ غَزْوَةَ الْحُدَيْبِيَةِ قَالَ: فَأَهَلُّوا بِعُمْرَةٍ، غَيْرِي، قَالَ: فَاصْطَدْتُ حِمَارَ وَحْشٍ، فَأَطْعَمْتُ أَصْحَابِي وَهُمْ مُحْرِمُونَ، ثُمَّ أَتَيْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَأَنْبَأْتُهُ أَنَّ عِنْدَنَا مِنْ لَحْمِهِ فَاضِلَةً فَقَالَ: «كُلُوهُ» وَهُمْ مُحْرِمُونَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10422,
                "hadithNumber": "2858",
                "englishNarrator": "Abdullah bin Abu Qatada رضی اللہ تعالیٰ عنہ reported on the authority of his father:",
                "hadithEnglish": "They went out with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and they were Muhrim except Abu Qatada رضی اللہ تعالیٰ عنہ . The rest of the hadith Is the same (but with the exception of these words): He (the Holy Prophet) said: 15 there any- thing out of it? They said: We have its leg with us. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) took it and ate it.",
                "hadithUrdu": "وہ لو گ ( مدینہ سے ) رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نکلے وہ احرام میں تھے اور ابو قتادہ رضی اللہ تعالیٰ عنہ بغیر احرا م کے تھے ۔ اور ( مذکورہبا لا ) حدیث بیان کی اور اس میں ہے کہ آپ صلی اللہ علیہ وسلم نے فر ما یا : کیا تمھا رے پاس اس میں سے کچھ ( بچا ہوا ) ہے ؟انھوں نے عرض کی ، اس کی ایک ران ہمارے پاس موجو د ہے تو رسول اللہ صلی اللہ علیہ وسلم نے وہ لے لی اور اسے تنا ول فر ما یا ۔",
                "urduNarrator": "ہم سے احمد بن عبدہ الضبی نے بیان کیا، کہا ہم سے فضیل بن سلیمان النمیری نے بیان کیا، انہوں نے کہا ہمیں ابو حا زم نے عبد اللہ بن ابی قتادہ رضی اللہ تعالیٰ عنہ سے انھوں نے اپنے والد ( ابو قتادہ رضی اللہ تعالیٰ عنہ ) سے حدیث سنا ئی کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ، حَدَّثَنَا فُضَيْلُ بْنُ سُلَيْمَانَ النُّمَيْرِيُّ، حَدَّثَنَا أَبُو حَازِمٍ، عَنْ عَبْدِ اللهِ بْنِ أَبِي قَتَادَةَ، عَنْ أَبِيهِ رَضِيَ اللهُ عَنْهُ، أَنَّهُمْ خَرَجُوا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَهُمْ مُحْرِمُونَ، وَأَبُو قَتَادَةَ مُحِلٌّ، وَسَاقَ الْحَدِيثَ، وَفِيهِ فَقَالَ: «هَلْ مَعَكُمْ مِنْهُ شَيْءٌ؟» قَالُوا مَعَنَا رِجْلُهُ، قَالَ: فَأَخَذَهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَأَكَلَهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10423,
                "hadithNumber": "2859",
                "englishNarrator": "Abdullah bin Abi Qatada رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Abu Qatada رضی اللہ تعالیٰ عنہ was among the party of those who had entered upon the state of Ihram whereas he was not. The rest of the hadith is the same (and herein it is also narrated): He (the Holy Prophet) said: Did any person among you point to him (to hunt) or command him (in any form)? They said: Messenger of Allah, not at all. Thereupon he said: Then eat it.",
                "hadithUrdu": "ابو قتادہ رضی اللہ تعالیٰ عنہ صحا بہ کرا م رضوان اللہ عنھم اجمعین کی نفری میں تھے انھوں نے احرا م باندھا ہوا تھا اور وہ خود احرا م کے بغیر تھے اورحدیث بیان کی اور اس میں ہے کہ آپ صلی اللہ علیہ وسلم نے فر ما یا : \" کیا تم میں سے کسی انسا ن نے اس ( شکار ) کی طرف اشارہ کیا تھا یا انھیں ( ابو قتادہ رضی اللہ تعالیٰ عنہ کو ) کچھ کرنے کو کہا تھا ؟ انھوں نے کہا : نہیں اے اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! آپ نے فر ما یا : \" تو پھر تم اسے کھا ؤ ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے ابو الاحوص نے بیان کیا، ان سے قتیبہ نے اور ہم سے اسحاق نے جریر کی سند سے بیان کیا, عبد العزیز بن رفیع نے عبد اللہ بن ابی قتادہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وحَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو الْأَحْوَصِ، ح وحَدَّثَنَا قُتَيْبَةُ، وَإِسْحَاقُ، عَنْ جَرِيرٍ، كِلَاهُمَا عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ، عَنْ عَبْدِ اللهِ بْنِ أَبِي قَتَادَةَ، قَالَ: كَانَ أَبُو قَتَادَةَ فِي نَفَرٍ مُحْرِمِينَ، وَأَبُو قَتَادَةَ مُحِلٌّ، وَاقْتَصَّ الْحَدِيثَ، وَفِيهِ: قَالَ: «هَلْ أَشَارَ إِلَيْهِ إِنْسَانٌ مِنْكُمْ أَوْ أَمَرَهُ بِشَيْءٍ؟» قَالُوا: لَا، يَا رَسُولَ اللهِ، قَالَ: «فَكُلُوا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10424,
                "hadithNumber": "2860",
                "englishNarrator": "`Abdul-Rahman bin `Uthman Taimi reported on the authority of his father:",
                "hadithEnglish": "While we were with Talha bin Ubaidullah رضی اللہ تعالیٰ عنہ and were in the state of Ihram we were presented a (cooked) bird. Talha رضی اللہ تعالیٰ عنہ was sleeping. Some of us ate it and some of us refrained from (eating) it. When Talha رضی اللہ تعالیٰ عنہ awoke he agreed with him who ate it, and said: We ate it along with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ).",
                "hadithUrdu": "کہا ہم احرام کی حا لت میں طلحہ بن عبید اللہ رضی اللہ تعالیٰ عنہ کے ساتھ تھے ۔ ایک ( شکار شدہ ) پرندہ بطور ہدیہ ان کے لیے لا یا گیا ۔ طلحہ ( اس وقت ) سورہے تھے ۔ ہم میں سے بعض نے ( اس کا گو شت ) کھا یا اور بعض نے احتیاط برتی ۔ جب حضرت طلحہ رضی اللہ تعالیٰ عنہ بیدار ہو ئے تو آپ نے ان کی تا ئید کی جنھوں اسے کھا یا تھا اور کہا ہم نے اسے ( شکار کے گو شت کو حا لت احرا م میں ) رسول اللہ صلی اللہ علیہ وسلم کے ساتھ کھا یا تھا ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے یحییٰ بن سعید نے بیان کیا، وہ ابن جریج کی سند سے، مجھ سے محمد بن المنکدر نے بیان کیا, معاذ بن عبد الرحمٰن بن عثمان تیمی نے اپنے والد سے روایت کی",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي مُحَمَّدُ بْنُ الْمُنْكَدِرِ، عَنْ مُعَاذِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عُثْمَانَ التَّيْمِيِّ، عَنْ أَبِيهِ، قَالَ: كُنَّا مَعَ طَلْحَةَ بْنِ عُبَيْدِ اللهِ وَنَحْنُ حُرُمٌ فَأُهْدِيَ لَهُ طَيْرٌ، وَطَلْحَةُ رَاقِدٌ، فَمِنَّا مَنْ أَكَلَ، وَمِنَّا مَنْ تَوَرَّعَ، فَلَمَّا اسْتَيْقَظَ طَلْحَةُ وَفَّقَ مَنْ أَكَلَهُ، وَقَالَ: «أَكَلْنَاهُ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10425,
                "hadithNumber": "2861",
                "englishNarrator": "`A'isha, the wife of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said:",
                "hadithEnglish": "I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Four are the vicious (birds, beasts and reptiles) which should be killed in the state of Ihram or otherwise: kite (and vulture), crow, rat, and the voracious dog. I (one of the narrators, `Ubaidullah bin Miqsam) said to Qasim (the other narrator who heard it from `A'isha): What about the snake? He said: Let it be killed with disgrace.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو فر ما تے ہو ئے سنا : \"\" چار جانور ہیں سبھی ایذا دینے والے ہیں ۔ وہ حدود حرم سے باہر اورحرم میں ( جہاںپائے جا ئیں ) قتل کر دیے جا ئیں ، چیل کوا چوہا اور کا ٹنے والا کتا ( عبید اللہ بن مقسم نے ) کہا : میں نے قاسم سے کہا آپ کا سانپ کے بارے میں کہا خیال ہے ؟انھوں نے جواب دیا : اسے اس کے چھوٹے پن ( گھٹیا رویے ) کی بنا پر قتل کیا جا ئے گا ( جو اس میں ہے )",
                "urduNarrator": "ہم سے ہارون بن سعید الایلی اور احمد بن عیسیٰ نے بیان کیا، کہا کہ ہم سے ابن وہب نے بیان کیا، مجھ سے مخرمہ بن بکیر نے اپنے والد سے بیان کیا۔ انہوں نے کہا: میں نے عبید اللہ بن مقسم کو کہتے سنا: میں نے سنا قاسم بن محمد کہتے ہیں میں نے نبی صلی اللہ علیہ وسلم کی اہلیہ حضرت عائشہ رضی اللہ تعالیٰ عنہا سے سنا وہ کہہ رہی تھیں",
                "hadithArabic": "حَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ، وَأَحْمَدُ بْنُ عِيسَى، قَالَا: أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي مَخْرَمَةُ بْنُ بُكَيْرٍ، عَنْ أَبِيهِ، قَالَ: سَمِعْتُ عُبَيْدَ اللهِ بْنَ مِقْسَمٍ، يَقُولُ: سَمِعْتُ الْقَاسِمَ بْنَ مُحَمَّدٍ، يَقُولُ: سَمِعْتُ عَائِشَةَ، زَوْجَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ تَقُولُ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: أَرْبَعٌ كُلُّهُنَّ فَاسِقٌ، يُقْتَلْنَ فِي الْحِلِّ وَالْحَرَمِ: الْحِدَأَةُ، وَالْغُرَابُ، وَالْفَأْرَةُ، وَالْكَلْبُ الْعَقُورُ قَالَ: فَقُلْتُ لِلْقَاسِمِ: أَفَرَأَيْتَ الْحَيَّةَ؟ قَالَ: «تُقْتَلُ بِصُغْرٍ لَهَا».",
                "headingArabic": "مَا يُنْدَبُ لِلْمُحْرِمِ وَغَيْرِهِ قَتْلُهُ مِنَ الدَّوَابِّ فِي الْحِلِّ وَالْحَرَمِ ‏",
                "headingUrdu": "محرم اور دوسروں کے لیے حرم کے اندر اور باہر کن جانوروں کو مارنے کی سفارش کی گئی ہے۔",
                "headingEnglish": "What animals it is recommended for the Muhrim and others to kill inside and outside the Sanctuary",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10426,
                "hadithNumber": "2862",
                "englishNarrator": "A'isha ( رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "Allah 'Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Five are the harmful things which should be killed in the state of Ihram or otherwise: snake, speckled crow. rat. voracious dog, and kite.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فر ما یا : \"\" پانچ موذی ( جا ندار ) ہیں ۔ حل وحرم میں ( جہاں بھی مل جا ئیں ) مار دیے جا ئیں سانپ ، کوا ، جس کے سر پر سفید نشان ہو تا ہے چوہا ، کٹنا کتا اور چیل ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے گندر نے بیان کیا، شعبہ کی سند سے، ہم سے ایچ ابن المثنیٰ نے اور ان سے ابن بشار نے بیان کیا، انہوں نے کہا: ہم سے محمد بن جعفر نے بیان کیا، ہم سے شعبہ نے بیان کیا۔ کہا: میں نے قتادہ کے بارے میں سنا ہے, سعید بن مسیب نے حضر ت عائشہ رضی اللہ تعالیٰ عنہا سے انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا غُنْدَرٌ، عَنْ شُعْبَةَ، ح وحَدَّثَنَا ابْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ: سَمِعْتُ قَتَادَةَ، يُحَدِّثُ عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، عَنْ عَائِشَةَ رَضِيَ اللهُ عَنْهَا، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: خَمْسٌ فَوَاسِقُ، يُقْتَلْنَ فِي الْحِلِّ وَالْحَرَمِ: الْحَيَّةُ، وَالْغُرَابُ الْأَبْقَعُ، وَالْفَأْرَةُ، وَالْكَلْبُ الْعَقُورُ، وَالْحُدَيَّا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10427,
                "hadithNumber": "2863",
                "englishNarrator": "A'isha (رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Five are the vicious beasts which should be killed even in the state of Ihram: scorpion, rat, kite, crow and voracious dog.",
                "hadithUrdu": "اللہ کے رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" پانچ ( جاندار ) موذی ہیں ۔ حرم میں بھی قتل کر دیے جا ئیں ۔ بچھو ، چو ہا ، چیل ، دھبوں والا کوا اور کا ٹنے والا کتا ۔ ( چار یا پانچ کہنے کا مقصد تحدید نہیں تھا ۔ آگے جتنے نام لیے گئے ان کا بیان تھا )",
                "urduNarrator": "ہم سے ابو الربیع الزہرانی نے بیان کیا، انہوں نے کہا حماد بن یزید نے ہشام بن عروہ سے انھوں نے اپنے والد ( عروہ ) کے واسطے سے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روا یت کی انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، حَدَّثَنَا حَمَّادٌ وَهُوَ ابْنُ زَيْدٍ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ رَضِيَ اللهُ عَنْهَا، قَالَتْ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: خَمْسٌ فَوَاسِقُ، يُقْتَلْنَ فِي الْحَرَمِ: الْعَقْرَبُ، وَالْفَأْرَةُ، وَالْحُدَيَّا، وَالْغُرَابُ، وَالْكَلْبُ الْعَقُورُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10428,
                "hadithNumber": "2864",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Hisham with the same chain of transmitters.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، کہا: ہم سے انہوں نے بیان کیا ابن نمیر نے کہا : ہمیں ہشام نے مذکورہ بالا سند سے بھی حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، قَالَا: حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا هِشَامٌ، بِهَذَا الْإِسْنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10429,
                "hadithNumber": "2865",
                "englishNarrator": "A'isha رضی اللہ تعالیٰ عنہا reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) having said this: Five are the vicious and harmful things which should be killed even within the precincts of Haram: rat, scorpion, crow. kite and voracious dog.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" پانچ ( جا ندار موذی ہیں حرم میں بھی مار ڈا لے جا ئیں ۔ چو ہا ، بچھو ، کوا چیل اور کا ٹنے والا کتا ۔",
                "urduNarrator": "ہم سے عبید اللہ بن عمر القواریری نے بیان کیا، انہوں نے ہم سے یزید بن زریع نے حدیث بیا ن کی ، ( کہا ) ہمیں معمر نے زہری سے انھوں نے عروہ سے انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے حدیث بیان کی ، انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا عُبَيْدُ اللهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ رَضِيَ اللهُ عَنْهَا، قَالَتْ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: خَمْسٌ فَوَاسِقُ، يُقْتَلْنَ فِي الْحَرَمِ: الْفَأْرَةُ، وَالْعَقْرَبُ، وَالْغُرَابُ، وَالْحُدَيَّا، وَالْكَلْبُ الْعَقُورُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10430,
                "hadithNumber": "2866",
                "englishNarrator": "This hadith has been narrated on the authority Zuhri with the same chain of transmitters that she (A'isha رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) commanded to kill five harmful things in the state of lhram or otherwise. The rest of the hadith is the same.",
                "hadithUrdu": "اللہ کے رسول اللہ صلی اللہ علیہ وسلم نے حل و حر م میں پانچ موذی ( جانوروں ) کو قتل کرنے کا حکم دیا ۔ پھر ( عبد الرزاق ) نے یزید بن زریع کے مانند حدیث بیان کی ۔",
                "urduNarrator": "ہم سے عبد بن حمید نے بیان کیا، انہوں نے بیان کیا ہمیں عبد الرزاق نے خبر دی ( کہا ) ہمیں معمر نے زہری سے اسی سند کے ساتھ حدیث بیان کی کہ حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا",
                "hadithArabic": "وحَدَّثَنَاه عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، بِهَذَا الْإِسْنَادِ، قَالَتْ: «أَمَرَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِقَتْلِ خَمْسِ فَوَاسِقَ فِي الْحِلِّ وَالْحَرَمِ» ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ يَزِيدَ بْنِ زُرَيْعٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10431,
                "hadithNumber": "2867",
                "englishNarrator": "A'isha (رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Five are the beasts 1618 harmful and vicious and these must be killed even within the precincts of the Ka'ba: crow, kite, [email protected] dog, kcorpion and rat.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" پانچ جا نور ہیں سب کہ سب مو ذی ہیں انھیں حرم میں بھی مار دیا جا ئے ۔ کوا ، چیل ، کا ٹنے والا کتا ، بچھو ، اور چوہا ۔",
                "urduNarrator": "مجھ سے ابو الطاہر اور حرملہ نے بیان کیا، کہا: ہم سے ابن وہب نے بیان کیا، انہوں نے مجھ سے بیان کیا یو نس نے ابن شہاب سے انھوں نے عروہ بن زبیر سے انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، ( انھوں نے ) کہا",
                "hadithArabic": "وحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، قَالَا: أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ رَضِيَ اللهُ عَنْهَا، قَالَتْ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: خَمْسٌ مِنَ الدَّوَابِّ كُلُّهَا فَوَاسِقُ تُقْتَلُ فِي الْحَرَمِ: الْغُرَابُ، وَالْحِدَأَةُ، وَالْكَلْبُ الْعَقُورُ، وَالْعَقْرَبُ، وَالْفَأْرَةُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10432,
                "hadithNumber": "2868",
                "englishNarrator": "Salim reported on the authority of his father رضی اللہ تعالیٰ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Five are the (beasts) which if one kills them in the precincts of the Ka'ba or in the state of lhram entail no sin: rat, scorpion, crow, kite and voracious dog. In another version the words are: as a Muhrim and in the state of lhram.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فر ما یا : \"\" پانچ ( موذی جا نور ) ہیں جو انھیں حرم میں اور احرا م کی حالت میں مار دے اس پر کو ئی گناہ نہیں ۔ چو ہا ، بچھو ، کوا چیل اور کا ٹنے والا کتا ۔ ابن ابی عمر نے اپنی روایت میں کہا : حرمت والے مقامات میں اور احرا م کی حا لت میں ۔",
                "urduNarrator": "زہیر بن حرب اور ابن ابی عمر نے سفیان بن عیینہ سے انھوں نے زہری سے انھوں نے سالم سے انھوں نے اپنے والد ( ابن عمر رضی اللہ تعالیٰ عنہ ) سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی",
                "hadithArabic": "وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَابْنُ أَبِي عُمَرَ، جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، قَالَ زُهَيْرٌ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ رَضِيَ اللهُ عَنْهُ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: خَمْسٌ لَا جُنَاحَ عَلَى مَنْ قَتَلَهُنَّ فِي الْحَرَمِ وَالْإِحْرَامِ: الْفَأْرَةُ، وَالْعَقْرَبُ، وَالْغُرَابُ، وَالْحِدَأَةُ وَالْكَلْبُ الْعَقُورُ وقَالَ ابْنُ أَبِي عُمَرَ فِي رِوَايَتِهِ: «فِي الْحُرُمِ وَالْإِحْرَامِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10433,
                "hadithNumber": "2869",
                "englishNarrator": "Hafsa رضی اللہ تعالیٰ عنہا the wife of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) having said this: There are five beasts, all of them are vicious and harmful and there is no tin for one who kills them (and these are): scorpion, crow. kite, rat and voracious dog.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" جانوروں میں سے پانچ ہیں جو سب کے سب مو ذی ہیں انھیں قتل کرنے والے پر کو ئی گنا ہ نہیں ۔ بچھو ، کوا ، چیل چو ہا اور کا ٹنے والا کتا ۔",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، انہوں نے کہا یو نس نے ابن شہاب کے واسطے سے خبر دی کہا : مجھے سالم بن عبد اللہ نے خبر دی کہ عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ نے کہا ؒ نبی صلی اللہ علیہ وسلم کی اہلیہ حضرت حفصہ رضی اللہ تعالیٰ عنہا نے کہا کہ",
                "hadithArabic": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللهِ، أَنَّ عَبْدَ اللهِ بْنَ عُمَرَ رَضِيَ اللهُ عَنْهُمَا، قَالَ: قَالَتْ حَفْصَةُ زَوْجُ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: خَمْسٌ مِنَ الدَّوَابِّ كُلُّهَا فَاسِقٌ لَا حَرَجَ عَلَى مَنْ قَتَلَهُنَّ: الْعَقْرَبُ، وَالْغُرَابُ، وَالْحِدَأَةُ، وَالْفَأْرَةُ، وَالْكَلْبُ الْعَقُورُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10434,
                "hadithNumber": "2870",
                "englishNarrator": "Zaid bin Jubair reported:",
                "hadithEnglish": "A person asked Ibn Umar رضی اللہ تعالیٰ عنہ which beast a Muhrim could kill. Thereupon he said: One of the wives of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) told me: He (the Holy Prophet) commanded to kill rat, scorpion, kite, voracious dog and crow.",
                "hadithUrdu": "ایک شخص نے ابن عمر رضی اللہ تعالیٰ عنہ سے سوال کیا : احرا م والا کس جانور کو مار سکتا ہے ؟ انھوں نے فر ما یا : مجھے رسول اللہ صلی اللہ علیہ وسلم کی ایک اہلیہ نے خبر دی کہ آپ نے حکم دیا یا آپ کو ( اللہ کی طرف سے ) حکم دیا گیا کہ چو ہا ، بچھو ، چیل ، کا ٹنے والا کتا اور کوا قتل کر دیے جا ئیں ۔",
                "urduNarrator": "ہم سے احمد بن یونس نے بیان کیا, ہم سے زہیر نے بیان کیا ( کہا ) ہمیں زید بن جبیر نے حدیث سنا ئی کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا زَيْدُ بْنُ جُبَيْرٍ، أَنَّ رَجُلًا سَأَلَ ابْنَ عُمَرَ، مَا يَقْتُلُ الْمُحْرِمُ مِنَ الدَّوَابِّ؟ فَقَالَ: أَخْبَرَتْنِي إِحْدَى نِسْوَةِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ أَمَرَ أَوْ «أُمِرَ أَنْ يَقْتُلَ الْفَأْرَةَ، وَالْعَقْرَبَ، وَالْحِدَأَةَ، وَالْكَلْبَ الْعَقُورَ، وَالْغُرَابَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10435,
                "hadithNumber": "2871",
                "englishNarrator": "Zaid bin Jubair reported:",
                "hadithEnglish": "A person asked Ibn 'Umar رضی اللہ تعالیٰ عنہ which beast a Muhrim could kill, whereupon he said: One of the wives of Allahs Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) told me: He (the Holy Prophet) commanded to kill voracious dog, rat, scorpion, kite, crow, and snake (and this is allowed) likewise in prayer.",
                "hadithUrdu": "ایک شخص نے ابن عمر رضی اللہ تعالیٰ عنہ سے پو چھا : ایک آدمی احرا م کی حا لت میں کو ن سے جا نور کو قتل کر سکتا ہے ؟انھوں نے کہا : مجھے نبی صلی اللہ علیہ وسلم کی ایک اہلیہ نے بتا یا کہ آپ صلی اللہ علیہ وسلم ( احرا م کی ھا لت میں ) باولے کتے ، چوہے ، بچھو ، چیل ، کوے اور سانپ کو مارنے کا حکم دیتے تھے ۔ ( ابن عمر رضی اللہ تعالیٰ عنہ نے ) فر ما یا : اور نماز میں بھی ۔",
                "urduNarrator": "ہم سے شیبان بن فروخ نے بیان کیا، انہوں نے بیان کیا ابو عوانہ نے زید بن جبیر سے حدیث سنا ئی کہا",
                "hadithArabic": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ زَيْدِ بْنِ جُبَيْرٍ، قَالَ: سَأَلَ رَجُلٌ ابْنَ عُمَرَ مَا يَقْتُلُ الرَّجُلُ مِنَ الدَّوَابِّ وَهُوَ مُحْرِمٌ؟ قَالَ: حَدَّثَتْنِي إِحْدَى نِسْوَةِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، أَنَّهُ: «كَانَ يَأْمُرُ بِقَتْلِ الْكَلْبِ الْعَقُورِ، وَالْفَأْرَةِ، وَالْعَقْرَبِ، وَالْحُدَيَّا، وَالْغُرَابِ، وَالْحَيَّةِ» قَالَ: «وَفِي الصَّلَاةِ أَيْضًا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10436,
                "hadithNumber": "2872",
                "englishNarrator": "Ibn 'Umar (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Five are the beasts for killing which there is no sin for the Muhrim: crows, kites, scorpions, rats and wild dogs.",
                "hadithUrdu": "اللہ کے رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" پانچ ( موذی جا نور ایسے ) ہیں کہ احرا م باندھنے والے پر انھیں قتل کر دینے میں کو ئی گنا ہ نہیں ہے کہ کوا ، چیل ، چوہا اور کاٹنے والا کتا ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا: میں نے مالک رضی اللہ عنہ سے پڑھا, مالک نے نافع سے انھوں نے ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ رَضِيَ اللهُ عَنْهُمَا، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: خَمْسٌ مِنَ الدَّوَابِّ لَيْسَ عَلَى الْمُحْرِمِ فِي قَتْلِهِنَّ جُنَاحٌ: الْغُرَابُ، وَالْحِدَأَةُ، وَالْعَقْرَبُ، وَالْفَأْرَةُ، وَالْكَلْبُ الْعَقُورُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10437,
                "hadithNumber": "2873",
                "englishNarrator": "Ibn Juraij reported: I said to Nafi:",
                "hadithEnglish": "What is that which you heard Ibn Umar رضی اللہ تعالیٰ عنہ declaring permissible for a Muhrim to kill some of the beasts? Nafi, said to me that 'Abdullah رضی اللہ تعالیٰ عنہ had reported: I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Five are the beasts in killing which or their being killed, there is no sin: crow, kite, scorpion, rat and voracious dog.",
                "hadithUrdu": "آپ نے ابن عمر رضی اللہ تعالیٰ عنہ سے کیا سنا وہ احرا م والے شخص کے لیے کن جا نوروں کو مارنا حلال قرار دیتے تھے؟نافع نے مجھ سے کہا : حضرت عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ نے کہا کہ میں نبی صلی اللہ علیہ وسلم کو فر ما تے سنا : \" پانچ ( موذی ) جا نور ہیں انھیں مارنے میں ان کے مارنے والے پر کو ئی گنا ہ نہیں ۔ کوا ، چیل بچھو ، چوہا اور کا ٹنے والا کتا.",
                "urduNarrator": "ہم سے ہارون بن عبداللہ نے بیان کیا، کہا ہم سے محمد بن بکر نے بیان کیا، انہوں نے بیان کیا ابن جریج نے کہا : میں نے نافع سے پو چھا",
                "hadithArabic": "وحَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللهِ، حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، حَدَّثَنَا ابْنُ جُرَيْجٍ، قَالَ: قُلْتُ لِنَافِعٍ: مَاذَا سَمِعْتَ ابْنَ عُمَرَ، يُحِلُّ لِلْحَرَامِ قَتْلَهُ مِنَ الدَّوَابِّ؟ فَقَالَ لِي نَافِعٌ: قَالَ عَبْدُ اللهِ سَمِعْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: خَمْسٌ مِنَ الدَّوَابِّ لَا جُنَاحَ عَلَى مَنْ قَتَلَهُنَّ، فِي قَتْلِهِنَّ: الْغُرَابُ، وَالْحِدَأَةُ، وَالْعَقْرَبُ، وَالْفَأْرَةُ، وَالْكَلْبُ الْعَقُورُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10438,
                "hadithNumber": "2874",
                "englishNarrator": null,
                "hadithEnglish": "The above hadith was reported with other chains from Nafi' on the authority of Ibn 'Umar رضی اللہ تعالیٰ عنہ , but there was difference in the wording in how the attributed the chain.",
                "hadithUrdu": "ہم سے قتیبہ اور ابن رومح نے روایت کی ہے , لیث بن سعد اور جریر یعنی ابن حا زم نے نا فع سے اسی طرح عبید اللہ ایوب اور یحییٰ بن سعید ان تینوں نے بھی نافع سے انھوں نے ابن عمر رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے اسی طرح مالک اور ابن جریج کی طرح ہی حدیث بیان کی ان میں سے کسی ایک نے بھی نافع نے ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی کہ میں نبی صلی اللہ علیہ وسلم سے سنا کے الفا ظ نہیں کہے ۔ سوائے اکیلےابن جریج کے ( البتہ ) ابن اسھاق نے ان الفا ظ میں ابن جریج کی متا بعت کی ہے ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَاه قُتَيْبَةُ، وَابْنُ رُمْحٍ، عَنِ اللَّيْثِ بْنِ سَعْدٍ، ح وحَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا جَرِيرٌ يَعْنِي ابْنَ حَازِمٍ، جَمِيعًا عَنْ نَافِعٍ، ح وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، ح وحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، جَمِيعًا عَنْ عُبَيْدِ اللهِ، ح وحَدَّثَنِي أَبُو كَامِلٍ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا أَيُّوبُ، ح وحَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا يَحْيَى بْنُ سَعِيدٍ، كُلُّ هَؤُلَاءِ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ رَضِيَ اللهُ عَنْهُمَا، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، بِمِثْلِ حَدِيثِ مَالِكٍ، وَابْنِ جُرَيْجٍ وَلَمْ يَقُلْ أَحَدٌ مِنْهُمْ عَنْ نَافعٍ، عَنِ ابْنِ عُمَرَ، رَضِيَ اللهُ عَنْهُمَا، سَمِعْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِلَّا ابْنُ جُرَيْجٍ وَحْدَهُ، وَقَدْ تَابَعَ ابْنَ جُرَيْجٍ عَلَى ذَلِكَ ابْنُ إِسْحَاقَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 10126,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=405",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=403",
                "label": "403",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=404",
                "label": "404",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=405",
                "label": "405",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=406",
                "label": "406",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=407",
                "label": "407",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=408",
                "label": "408",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=409",
                "label": "409",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=407",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=407",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=405",
        "to": 10150,
        "total": 40465
    }
}