{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 505,
        "data": [
            {
                "id": 12889,
                "hadithNumber": "5326",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "A person invited Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) to a meal. I also went along with him. He brought soup containing pumpkin. Allah's 'messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) ate that pumpkin with relish. He (Anas رضی اللہ عنہ) said: When I saw that I began to place it before him, and did not eat it (myself). Anas رضی اللہ عنہ said: It was since then that pumpkin was always my favourite (food).",
                "hadithUrdu": "ایک شخص نے رسول اللہ صلی اللہ علیہ وسلم کو کھا نے کی دعوت دی میں بھی آپ کے ساتھ گیا ۔ آپ کے لیے شوربہ لا یا گیا اس میں کدو ( بھی ) تھا رسول اللہ صلی اللہ علیہ وسلم اس میں سے کدو کھا نے لگے وہ آُ کو اچھا لگ رہا تھا ۔ جب میں نے یہ بات دیکھی تو میں کدو ( کے ٹکڑے ) آپ کے سامنے کرنے لگا اور خود نہ کھا ئے ۔ حضرت انس رضی اللہ عنہ نے کہا : اس دن کے بعد سے مجھے کدو بہت اچھا لگتا ہے ۔",
                "urduNarrator": "ہم سے محمد بن العلاء نے بیان کیا، کہا ہم سے ابو اسامہ نے بیان کیا, سلیمان بن مغیرہ نے ثابت سے ، انھوں نے حضرت انس رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ سُلَيْمَانَ بْنِ الْمُغِيرَةِ عَنْ ثَابِتٍ عَنْ أَنَسٍ قَالَ دَعَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلٌ فَانْطَلَقْتُ مَعَهُ فَجِيءَ بِمَرَقَةٍ فِيهَا دُبَّاءٌ فَجَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْكُلُ مِنْ ذَلِكَ الدُّبَّاءِ وَيُعْجِبُهُ قَالَ فَلَمَّا رَأَيْتُ ذَلِكَ جَعَلْتُ أُلْقِيهِ إِلَيْهِ وَلَا أَطْعَمُهُ قَالَ فَقَالَ أَنَسٌ فَمَا زِلْتُ بَعْدُ يُعْجِبُنِي الدُّبَّاءُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12890,
                "hadithNumber": "5327",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "A tailor invited Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) to a feast. There has been an addition to this that Thabit said: I heard Anas رضی اللہ عنہ saying that any meal that was prepared for me after that I tried that it should contain pumpkin.",
                "hadithUrdu": "ایک شخص نے جو درزی تھا رسول اللہ صلی اللہ علیہ وسلم کو دعوت دی اور یہ اضافہ کیا کہ ثابت نے کہا , میں نے حضرت انس رضی اللہ عنہ سے سنا ، کہہ رہے تھے : اس کے بعد جب بھی میرے لیے کھانا بنتا ہے اور میں ایسا کرسکتا ہوں کہ اس میں کدو ڈالا جا ئے تو ڈالا جا تا ہے ۔",
                "urduNarrator": "مجھے حجاج بن الشاعر اور عبد بن حمید نے عبد الرزاق کی سند سے بیان کیا, معمر نے ثابت بنا نی اور عاصم احول سے ، انھوں نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ وَعَبْدُ بْنُ حُمَيْدٍ جَمِيعًا عَنْ عَبْدِ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ ثَابِتٍ الْبُنَانِيِّ وَعَاصِمٍ الْأَحْوَلِ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ رَجُلًا خَيَّاطًا دَعَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَزَادَ قَالَ ثَابِتٌ فَسَمِعْتُ أَنَسًا يَقُولُ فَمَا صُنِعَ لِي طَعَامٌ بَعْدُ أَقْدِرُ عَلَى أَنْ يُصْنَعَ فِيهِ دُبَّاءٌ إِلَّا صُنِعَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12891,
                "hadithNumber": "5328",
                "englishNarrator": "Abdullah bin Busr رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came to my father and we brought to him a meal and a preparation from dates, cheese and butter. He ate out of that. He was then given dates which he ate, putting the stones between his fingers and holding his forefinger and middle finger together-Shu'bah said: I think we learn from this that one may hold the date stones between two fingers, InshaAllah. Then a drink was brought for him and he drank it, and then gave it to one who was on his right side. He (the narrator) said: My father took hold of the rein of his riding animal and requested him to supplicate for us. Thereupon he said: O Allah. bless them in what You have provided them as a sustenance; and forgive them and have mercy upon them.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم میرے والد کے ہاں مہمان ہو ئے ہم نے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں کھجور پنیر اور گھی سے تیار کیا ہوا حلوہ پیش کیا ، آپ نے اس میں سے تناول فرما یا ، پھر آپ کے سامنے کھجور یں پیش کی گئیں تو آپ کھجوریں کھا رہے تھے ۔ اور گٹھلیاں اپنی دو انگلیوں کے درمیان ڈالتے جا رہے تھے ۔ ( کھا نے کے لیے ) آپ صلی اللہ علیہ وسلم نے شہادت کی اور درمیانی انگلی اکٹھی کی ہوئی تھیں ۔ شعبہ نے کہا : میر اگمان ( غالب ) ہے اور ان شاء اللہ یہ بات یعنی گٹھلیوں کو دوانگلیوں کے درمیان ڈالنا اس ( حدیث ) میں ہے ۔ پھر ( آپ کےسامنے ) مشروب لا یا گیا ۔ آپ نے اسے پیا ، پھر اپنی دائیں جا نب والے کو دے دیا ۔ ( عبد اللہ بن بسر رضی اللہ عنہ نے ) کہا : تو میرے والد نے جب انھوں نے آپ صلی اللہ علیہ وسلم کی سواری کی لگا م پکڑی ہو ئی تھی عرض کی : ہمارے لیے اللہ سے دعا فرما ئیے ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے ( دعا کرتے ہو ئے ) فرما یا \" اے اللہ !تونے انھیں جو رزق دیا ہے اس میں ان کے لیے برکت ڈال دے اور ان کے گناہ بخش دے اور ان پر رحم فرما ۔",
                "urduNarrator": "مجھ سے محمد بن المثنیٰ نے بیان کیا، انہوں نے ہم سے بیان کیا: محمد بن جعفر نے کہا : ہمیں شعبہ نے یزید بن خمیر سے ، انھوں نے حضرت عبد اللہ بن بسر رضی اللہ عنہ سے روایت کی کہا",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى الْعَنَزِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ يَزِيدَ بْنِ خُمَيْرٍ عَنْ عَبْدِ اللَّهِ بْنِ بُسْرٍ قَالَ نَزَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى أَبِي قَالَ فَقَرَّبْنَا إِلَيْهِ طَعَامًا وَوَطْبَةً فَأَكَلَ مِنْهَا ثُمَّ أُتِيَ بِتَمْرٍ فَكَانَ يَأْكُلُهُ وَيُلْقِي النَّوَى بَيْنَ إِصْبَعَيْهِ وَيَجْمَعُ السَّبَّابَةَ وَالْوُسْطَى قَالَ شُعْبَةُ هُوَ ظَنِّي وَهُوَ فِيهِ إِنْ شَاءَ اللَّهُ إِلْقَاءُ النَّوَى بَيْنَ الْإِصْبَعَيْنِ ثُمَّ أُتِيَ بِشَرَابٍ فَشَرِبَهُ ثُمَّ نَاوَلَهُ الَّذِي عَنْ يَمِينِهِ قَالَ فَقَالَ أَبِي وَأَخَذَ بِلِجَامِ دَابَّتِهِ ادْعُ اللَّهَ لَنَا فَقَالَ اللَّهُمَّ بَارِكْ لَهُمْ فِي مَا رَزَقْتَهُمْ وَاغْفِرْ لَهُمْ وَارْحَمْهُمْ.",
                "headingArabic": "اسْتِحْبَابِ وَضْعِ النَّوَى خَارِجَ التَّمْرِ وَاسْتِحْبَابِ دُعَاءِ الضَّيْفِ لأَهْلِ الطَّعَامِ وَطَلَبِ الدُّعَاءِ مِنَ الضَّيْفِ الصَّالِحِ وَإِجَابَتِهِ لِذَلِكَ",
                "headingUrdu": "کھجور سے پتھر نکالنا مستحب ہے، اور مہمان کے لیے مستحب ہے کہ وہ میزبان کے لیے دعا کرے اور نیک مہمان سے دعا مانگے، اور وہ اس درخواست کا جواب دے۔",
                "headingEnglish": "It is recommended to take the stones out of dates, and it is recommended for the guest to pray for the host and to ask a righteous guest to supplicate, and he should respond to that request",
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12892,
                "hadithNumber": "5329",
                "englishNarrator": "It was narrated from Shu'ba with this chain of narrators (a similar to no. 5328):",
                "hadithEnglish": "But he did not express any doubt about holding the date stones between the fingers.",
                "hadithUrdu": "گٹھلیوں کو دو انگلیوں کے درمیان ڈالنے کے بارے میں شک ( کا اظہار ) نہیں کیا ۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا, ابن ابی عدی اور یحییٰ بن حماد دونوں نے شعبہ سے اسی سند کے ساتھ حدیث بیان کی",
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ ح و حَدَّثَنِيهِ مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا يَحْيَى بْنُ حَمَّادٍ كِلَاهُمَا عَنْ شُعْبَةَ بِهَذَا الْإِسْنَادِ وَلَمْ يَشُكَّا فِي إِلْقَاءِ النَّوَى بَيْنَ الْإِصْبَعَيْنِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12893,
                "hadithNumber": "5330",
                "englishNarrator": "Abdullah bin Ja'far رضی اللہ عنہ reported:",
                "hadithEnglish": "I saw Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) eating cucumber with fresh dates.",
                "hadithUrdu": "میں رسول اللہ صلی اللہ علیہ وسلم کو تازہ کھجور کے ساتھ ککڑی کھا تے ہو ئے دیکھا ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ تمیمی اور عبداللہ بن عون ہلالی نے بیان کیا، اور کہا کہ ہم سے ابراہیم بن عون نے بیان کیا۔ سعد , حضرت عبد اللہ بن جعفر رضی اللہ عنہ سے روایت ہے ، کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ وَعَبْدُ اللَّهِ بْنُ عَوْنٍ الْهِلَالِيُّ قَالَ يَحْيَى أَخْبَرَنَا و قَالَ ابْنُ عَوْنٍ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْكُلُ الْقِثَّاءَ بِالرُّطَبِ.",
                "headingArabic": "أَكْلِ الْقِثَّاءِ بِالرُّطَبِ ‏‏",
                "headingUrdu": "کھیرے کو تازہ کھجور کے ساتھ کھانا",
                "headingEnglish": "Eating cucumbers with fresh dates",
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12894,
                "hadithNumber": "5331",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "I saw Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) squatting and eating dates.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم دونوں گھٹنے کھڑےکر کے تھوڑے سے زمین پر لگ کر بیٹھے تھے ۔ کھجوریں کھا رہے تھے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابو سعید الاشجع نے حفص کی سند سے بیان کیا, حفص بن غیاث نے مصعب بن سلیم سے روایت کی ، کہا : ہمیں حضرت انس بن ما لک رضی اللہ عنہ نے حدیث بیان کی ، کہا : میں نے دیکھا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو سَعِيدٍ الْأَشَجُّ كِلَاهُمَا عَنْ حَفْصٍ قَالَ أَبُو بَكْرٍ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ عَنْ مُصْعَبِ بْنِ سُلَيْمٍ حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ قَالَ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُقْعِيًا يَأْكُلُ تَمْرًا.",
                "headingArabic": "اسْتِحْبَابِ تَوَاضُعِ الآكِلِ وَصِفَةِ قُعُودِهِ ‏‏",
                "headingUrdu": "کھانا کھاتے وقت عاجزی اختیار کرنے کی سفارش کی جاتی ہے، اور بیٹھنے کا طریقہ",
                "headingEnglish": "It is recommended to be humble when eating, and how to sit",
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12895,
                "hadithNumber": "5332",
                "englishNarrator": "Anas رضی اللہ عنہ reported:",
                "hadithEnglish": "There were brought to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) dates. He distributed them in the state that he had been sitting upright (in an easy posture) and he had also been eating them a (bit) quickly.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں کھجوریں پیش کی گئیں ۔ نبی صلی اللہ علیہ وسلم اس طرح بیٹھےہو ئے ان کو تقسیم فرما نے لگے جیسے آپ ابھی اٹھنےلگے ہوں ( بیٹھنےکی وہی کیفیت جو پچھلی حدیث میں بیان ہو ئی دوسرے لفظوں میں بتا ئی گئی ہے ) اور آپ اس میں سے جلدی جلدی چند دانے کھارہے تھے ۔ زہیر کی ۔ روایت میں ذَريعاً کے بجائے حَثِيثًا کا لفظ ہے یعنی بغیر کسی اہتمام کے جلدی جلدی ۔",
                "urduNarrator": "زہیر بن حرب اور ابن ابی عمر نے سفیان بن عیینہ سے حدیث بیان کی ، انھوں نے مصعب بن سلیم سے انھوں نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی : کہا",
                "hadithArabic": "و حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَابْنُ أَبِي عُمَرَ جَمِيعًا عَنْ سُفْيَانَ قَالَ ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ مُصْعَبِ بْنِ سُلَيْمٍ عَنْ أَنَسٍ قَالَ أُتِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِتَمْرٍ فَجَعَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْسِمُهُ وَهُوَ مُحْتَفِزٌ يَأْكُلُ مِنْهُ أَكْلًا ذَرِيعًا وَفِي رِوَايَةِ زُهَيْرٍ أَكْلًا حَثِيثًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12896,
                "hadithNumber": "5333",
                "englishNarrator": "Jabala bin Suhaim reported:",
                "hadithEnglish": "Ibn Zubair رضی اللہ عنہ used to provide us with dates during the time that the people were hard pressed because of famine (Once) as we were busy in eating there happened to appear before us Ibn 'Umar رضی اللہ عنہ . He said: Don't eat two dates together, for Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade eating them together but only after seeking permission from his brother (partner). Shu'ba said: I do not think these words pertaining to seeking permission but from the words of Ibn 'Umar رضی اللہ عنہ .",
                "hadithUrdu": "عبد اللہ بن زبیر رضی اللہ عنہ ہمیں کھجوروں کا راشن دیتے تھے ان دنوں لوگ قحط سالی کا شکار تھے ۔ اور ہم ( کھجوریں ) کھاتے تھے ۔ ہم کھا رہے ہو تے تو حضرت ابن عمر رضی اللہ عنہ ہمارے قریب سے گزرتے اور فرما تے : اکٹھی دودوکھجوریں مت کھاؤ رسول اللہ صلی اللہ علیہ وسلم نے اکٹھی دودو کھجوریں کھانے سے منع فرما یا ہے ، سوائے اس کے کہ آدمی اپنے ( ساتھ کھانے والے ) بھا ئی سے اجازت لے ۔ شعبہ نے کہا : میرا یہی خیال ہے کہ یہ جملہ یعنی اجازت لینا حضرت ابن عمر رضی اللہ عنہ کا اپنا قول ہے ۔ ( انھوں نے اسے رسول اللہ صلی اللہ علیہ وسلم سے روایت نہیں کیا ۔ )",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا, محمد بن جعفر نے کہا : ہمیں شعبہ نے حدیث بیان کی کہا , میں نے جبلہ بن سحیم سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ جَبَلَةَ بْنَ سُحَيْمٍ قَالَ كَانَ ابْنُ الزُّبَيْرِ يَرْزُقُنَا التَّمْرَ قَالَ وَقَدْ كَانَ أَصَابَ النَّاسَ يَوْمَئِذٍ جَهْدٌ وَكُنَّا نَأْكُلُ فَيَمُرُّ عَلَيْنَا ابْنُ عُمَرَ وَنَحْنُ نَأْكُلُ فَيَقُولُ لَا تُقَارِنُوا فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْإِقْرَانِ إِلَّا أَنْ يَسْتَأْذِنَ الرَّجُلُ أَخَاهُ قَالَ شُعْبَةُ لَا أُرَى هَذِهِ الْكَلِمَةَ إِلَّا مِنْ كَلِمَةِ ابْنِ عُمَرَ يَعْنِي الِاسْتِئْذَانَ.",
                "headingArabic": "نَهْيِ الآكِلِ مَعَ جَمَاعَةٍ عَنْ قِرَانِ تَمْرَتَيْنِ وَنَحْوِهِمَا فِي لُقْمَةٍ إِلاَّ بِإِذْنِ أَصْحَابِهِ",
                "headingUrdu": "دو کھجوریں کھانے کی ممانعت، ایک وقت میں جب کسی جماعت کے ساتھ کھانا کھایا جائے، سوائے ساتھی کی اجازت کے۔",
                "headingEnglish": "The prohibition of eating two dates etc., at a time when eating with a group, except with the permission of one's companions",
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12897,
                "hadithNumber": "5334",
                "englishNarrator": "This hadith has been reported on the authority of Shu'ba with the same chain of transmitters but these words of his (are not found):",
                "hadithEnglish": "The people were hard pressed because of the famine during those days.",
                "hadithUrdu": "\" ان دنوں لوگ قحط سالی کا شکار تھے ۔ \"",
                "urduNarrator": "عبید اللہ کے والد معاذ اور عبدالرحمٰن بن مہدی دونوں نے شعبہ سے اسی سند کے ساتھ حدیث بیان کی ۔ ان دونوں کی روایت میں شعبہ کا اور ان ( جبلہ بن سحیم ) کا یہ قول موجود نہیں ،",
                "hadithArabic": "و حَدَّثَنَاه عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي ح و حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ كِلَاهُمَا عَنْ شُعْبَةَ بِهَذَا الْإِسْنَادِ وَلَيْسَ فِي حَدِيثِهِمَا قَوْلُ شُعْبَةَ وَلَا قَوْلُهُ وَقَدْ كَانَ أَصَابَ النَّاسَ يَوْمَئِذٍ جَهْدٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12898,
                "hadithNumber": "5335",
                "englishNarrator": "Jabala bin Suhaim reported:",
                "hadithEnglish": "I heard Ibn 'Umar رضی اللہ عنہ as saying that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) forbade anyone taking two dates together without seeking the consent of his companions.",
                "hadithUrdu": "میں نے حضرت ابن عمر رضی اللہ عنہ سے سنا ، کہہ رہے تھے رسول اللہ صلی اللہ علیہ وسلم نے اس سے منع فرمایا ہے کہ کو ئی شخص ساتھیوں سے اجازت لیے بغیر اکٹھی دودوکھجوریں کھائے ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب اور محمد بن المثنیٰ نے بیان کیا، کہا: ہم سے عبدالرحمٰن نے بیان کیا, سفیان نے جبلہ بن سحیم سے روایت کی کہا",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ وَمُحَمَّدُ بْنُ الْمُثَنَّى قَالَا حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ سُفْيَانَ عَنْ جَبَلَةَ بْنِ سُحَيْمٍ قَالَ سَمِعْتُ ابْنَ عُمَرَ يَقُولُ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَقْرِنَ الرَّجُلُ بَيْنَ التَّمْرَتَيْنِ حَتَّى يَسْتَأْذِنَ أَصْحَابَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12899,
                "hadithNumber": "5336",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: A family which has dates will not be hungry.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے فرمایا : \" ایسے گھر کے لوگ بھوکے نہیں رہتے جن کے پاس کھجوریں ہوں ۔ \"",
                "urduNarrator": "مجھ سے عبداللہ بن عبدالرحمٰن دارمی نے بیان کیا، کہا ہم سے یحییٰ بن حسن نے بیان کیا، ہم سے سلیمان بن بلال نے، ہشام کی سند سے, عروہ نے حضرت عائشہ رضی اللہ عنہا سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ أَخْبَرَنَا يَحْيَى بْنُ حَسَّانَ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَجُوعُ أَهْلُ بَيْتٍ عِنْدَهُمْ التَّمْرُ.",
                "headingArabic": "فِي ادْخَالِ التَّمْرِ وَنَحْوِهِ مِنَ الأَقْوَاتِ لِلْعِيَالِ ‏‏",
                "headingUrdu": "کسی کے بچوں کے لیے تاریخیں اور دیگر چیزیں ذخیرہ کرنا",
                "headingEnglish": "Storing dates and other provisions for one's children",
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12900,
                "hadithNumber": "5337",
                "englishNarrator": "A'isha رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: 'A'isha رضی اللہ عنہ a family which has no dates (in their house) its members will be hungry; (or) 'A'isha رضی اللہ عنہ the family which has no dates its members may be hungry. He said this twice or thrice.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نےفرما یا : \" عائشہ رضی اللہ عنہا ! جس گھر میں کھجوریں نہ ہو ں اس میں رہنے والے بھوکے ہیں عائشہ! جس گھر میں کھجوریں نہ ہو ں اس میں رہنے والے بھوکے ہیں ۔ جس گھر میں کھجوریں نہ ہو ں اس میں رہنے والے بھوکے ہیں ۔ یا فرما یا ) اس گھر کے لو گ بھوکے رہ جا تے ہیں ۔ آپ نے یہ کلمات دویا تین بار فرما ئے ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ بن قعنب نے بیان کیا، ہم سے یعقوب بن محمد بن طہلہ نے بیان کیا, ابوالرجال محمد بن عبد الرحمٰن نے اپنی والدہ ( عمرہ منت عبد الرحمن انصاریہ ) سے انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ حَدَّثَنَا يَعْقُوبُ بْنُ مُحَمَّدِ بْنِ طَحْلَاءَ عَنْ أَبِي الرِّجَالِ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أُمِّهِ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا عَائِشَةُ بَيْتٌ لَا تَمْرَ فِيهِ جِيَاعٌ أَهْلُهُ يَا عَائِشَةُ بَيْتٌ لَا تَمْرَ فِيهِ جِيَاعٌ أَهْلُهُ أَوْ جَاعَ أَهْلُهُ قَالَهَا مَرَّتَيْنِ أَوْ ثَلَاثًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12901,
                "hadithNumber": "5338",
                "englishNarrator": "Amir bin Sa'd bin Abu Waqqas, on the authority of his father, reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) having said: He who ate seven dates (of the land situated) between these two lava plains in the morning, no poison will harm him until it is evening.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نےفرما یا : جس شخص نے صبح کے وقت مدینہ کے دوپتھریلے میدانوں کے درمیان کی ساتھ کھجوریں کھا لیں ، اس کو شام تک کو ئی زہر نقصان نہیں پہنچا ئے گا ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ بن قعنب نے بیان کیا، کہا ہم سے سلیمان نے بیان کیا، یعنی ابن بلال نے, عبد اللہ بن عبد الرحمٰن نے عامر سعد بن ابی وقاص سے ، انھوں نے اپنے والد سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ حَدَّثَنَا سُلَيْمَانُ يَعْنِي ابْنَ بِلَالٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَامِرِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَكَلَ سَبْعَ تَمَرَاتٍ مِمَّا بَيْنَ لَابَتَيْهَا حِينَ يُصْبِحُ لَمْ يَضُرَّهُ سُمٌّ حَتَّى يُمْسِيَ.",
                "headingArabic": "فَضْلِ تَمْرِ الْمَدِينَةِ ‏‏",
                "headingUrdu": "المدینہ کی تاریخوں کی فضیلت",
                "headingEnglish": "The virtue of the dates of Al-Madinah",
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12902,
                "hadithNumber": "5339",
                "englishNarrator": "Amir bin Sa'd bin Abu Waqqas رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who ate seven 'ajwa' dates in the morning, poison and magic will not harm him on that day.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کو یہ فرما تے ہو ئے سنا ، \" جس نے صبح کو سات عجوہ کھجوریں کھالیں اس دن اسے زہر نقصان پہنچا سکے گا نہ جا دو ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, ابو اسامہ نے ہا شم بن ہاشم سے روایت کی ، کہا : میں نے عامر بن سعد بن ابی وقاص سے سنا ، کہہ رہے تھے میں نے ( اپنے والد ) حضرت سعد رضی اللہ عنہ سے سنا ، کہہ رہے تھے , میں نے",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ هَاشِمِ بْنِ هَاشِمٍ قَالَ سَمِعْتُ عَامِرَ بْنَ سَعْدِ بْنِ أَبِي وَقَّاصٍ يَقُولُ سَمِعْتُ سَعْدًا يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ تَصَبَّحَ بِسَبْعِ تَمَرَاتٍ عَجْوَةً لَمْ يَضُرَّهُ ذَلِكَ الْيَوْمَ سُمٌّ وَلَا سِحْرٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12903,
                "hadithNumber": "5340",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been reported on the authority of Ibn Hashim with the same chain of transmitters but with a slight variation of wording.",
                "hadithUrdu": "ہم سے ابن ابی عمر نے بیان کیا, مروان بن معاویہ فرازی اور ابو بدر شجاع بن ولید دونوں نے ہاشم بن ہاشم سے ، اسی سند کے ساتھ رسول اللہ صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ۔ وہ دونوں یہ نہیں کہتے : میں نے نبی کرم صلی اللہ علیہ وسلم سے سنا ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَاه ابْنُ أَبِي عُمَرَ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ الْفَزَارِيُّ ح و حَدَّثَنَاه إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا أَبُو بَدْرٍ شُجَاعُ بْنُ الْوَلِيدِ كِلَاهُمَا عَنْ هَاشِمِ بْنِ هَاشِمٍ بِهَذَا الْإِسْنَادِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ وَلَا يَقُولَانِ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12904,
                "hadithNumber": "5341",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: The 'ajwa' dates of 'Aliya' contain heating effects and these are antidote in the early morning.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" ( مدینہ کے ) بالائی حصے کی عجوہ کھجوروں میں شفاہے یا ( فرما یا : ) صبح کے اول وقت میں ان کا استعمال تریا ق ہے ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ، یحییٰ بن ایوب نے بیان کیا اور ہم سے یحییٰ بن یحییٰ نے بیان کیا اور ہم سے اسماعیل نے بیان کیا,  وہ ایک ساتھی کی سند پر ابن جعفر ہیں اور وہ ابن ابی نمر ہیں , عبد اللہ بن ابی عتیق نے حضرت عائشہ رضی اللہ عنہا سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَيَحْيَى بْنُ أَيُّوبَ وَابْنُ حُجْرٍ قَالَ يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا و قَالَ الْآخَرَانِ حَدَّثَنَا إِسْمَعِيلُ وَهُوَ ابْنُ جَعْفَرٍ عَنْ شَرِيكٍ وَهُوَ ابْنُ أَبِي نَمِرٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي عَتِيقٍ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ فِي عَجْوَةِ الْعَالِيَةِ شِفَاءً أَوْ إِنَّهَا تِرْيَاقٌ أَوَّلَ الْبُكْرَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12905,
                "hadithNumber": "5342",
                "englishNarrator": "Sa'id bin Zaid bin 'Amr bin Nufail reported:",
                "hadithEnglish": "I heard Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Truffles are a kind of 'Manna' and their juice is a medicine for the eyes.",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم کو فرما تے ہو ئے سنا \" کھمبی من ( وہ کھانا جو سلویٰ کے ساتھ بنی اسرا ئیل کے لیے آسمان کی جانب سے اتراتھا ) کی ایک قسم ہے اور اس کا پانی آنکھوں کے لیے شفا ہے ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, جریر اور عمر بن عبید نے عبدالملک بن عمیر سے انھوں نے عمرو بن حریث سے ، انھوں نے سعید بن زید بن عمرو بن نفیل سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا جَرِيرٌ ح و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا جَرِيرٌ وَعَمْرُ بْنُ عُبَيْدٍ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ عَمْرِو بْنِ حُرَيْثٍ عَنْ سَعِيدِ بْنِ زَيْدِ بْنِ عَمْرِو بْنِ نُفَيْلٍ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْكَمْأَةُ مِنْ الْمَنِّ وَمَاؤُهَا شِفَاءٌ لِلْعَيْنِ.",
                "headingArabic": "فَضْلِ الْكَمْأَةِ وَمُدَاوَاةِ الْعَيْنِ بِهَا ‏‏",
                "headingUrdu": "کھمبی کی فضیلت، اور ان سے آنکھوں کا علاج کرنا",
                "headingEnglish": "The virtue of truffles, and treating the eyes with them",
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12906,
                "hadithNumber": "5343",
                "englishNarrator": "Through another chain of transmitters, Sa'id bin Zaid bin 'Amr رضی اللہ عنہ reported:",
                "hadithEnglish": "I heard Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Truffles are a kind of 'Manna' and their juice is a medicine for the eyes.",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا کہ فرما رہے تھے \" کھمبی من کی ایک قسم ہے اور اس کا پا نی آنکھوں کے لیے شفاہے ۔",
                "urduNarrator": "ہم سے محمد بن مثنیٰ نے بیان کیا، ہم سے محمد بن جعفر نے بیان کیا, شعبہ نے عبدالملک بن عمیر سے روایت کی کہا ,  عمرو بن حریث سےسنا ، انھوں نے کہا : میں نے حضرت سعید بن زید رضی اللہ عنہ سے سنا ، کہا",
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ قَالَ سَمِعْتُ عَمْرَو بْنَ حُرَيْثٍ قَالَ سَمِعْتُ سَعِيدَ بْنَ زَيْدٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْكَمْأَةُ مِنْ الْمَنِّ وَمَاؤُهَا شِفَاءٌ لِلْعَيْنِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12907,
                "hadithNumber": "5344",
                "englishNarrator": null,
                "hadithEnglish": "Sa'id bin Zaid رضی اللہ عنہ reported: I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Truffles are a kind of blessing and their juice is a medicine for the eyes. Shu'ba said: When Hakam narrated this hadith to me, I did not deem it as a Munkar hadith because of the narration of Abdul-Malik.",
                "hadithUrdu": "اور مجھ سے محمد بن المثنیٰ نے بیان کیا، مجھ سے محمد بن جعفر نے بیان کیا، ہم سے شعبہ نے بیان کیا، انہوں نے کہا کہ مجھے الحکم نے خبر دی , شعبہ نے کہا : مجھے بن عتیبہ نے حسن عرنی سے خبر دی انھوں نے عمرو بن حریث سے ، انھوں نے حضرت سعید بن زید رضی اللہ عنہ سے روایت کی ، انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ۔ شعبہ نے کہا : جب مجھ سے حکم نے یہ روایت کی تو میں نے عبد الملک کی روایت کی وجہ سے اس کو منکر قرارنہ دیا ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَاه مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنِي مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ وَأَخْبَرَنِي الْحَكَمُ بْنُ عُتَيْبَةَ عَنْ الْحَسَنِ الْعُرَنِيِّ عَنْ عَمْرِو بْنِ حُرَيْثٍ عَنْ سَعِيدِ بْنِ زَيْدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ شُعْبَةُ لَمَّا حَدَّثَنِي بِهِ الْحَكَمُ لَمْ أُنْكِرْهُ مِنْ حَدِيثِ عَبْدِ الْمَلِكِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12908,
                "hadithNumber": "5345",
                "englishNarrator": "Sa'id bin Zaid bin 'Amr bin Nufail رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Truffles are a kind of 'Manna' which Allah the Glorious and Exalted, sent down upon the people of Israil, and its juice is a medicine for the eyes.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" کھمبی اس من میں سے ہے جسے اللہ تعا لیٰ نے بنی اسرا ئیل کے لیے نازل کیا تھا اور اس کا پانی آنکھوں کے لیے شفا ہے ۔ \"",
                "urduNarrator": "ہم سے سعید بن عمرو اشعثی نے بیان کیا, عبثر نے مطرف سے ، انھوں نے حسن سے ، انھوں نے عمرو بن حریث سے انھوں نے سعید بن زید بن عمرو بن نفیل رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ عَمْرٍو الْأَشْعَثِيُّ أَخْبَرَنَا عَبْثَرٌ عَنْ مُطَرِّفٍ عَنْ الْحَكَمِ عَنْ الْحَسَنِ عَنْ عَمْرِو بْنِ حُرَيْثٍ عَنْ سَعِيدِ بْنِ زَيْدِ بْنِ عَمْرِو بْنِ نُفَيْلٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْكَمْأَةُ مِنْ الْمَنِّ الَّذِي أَنْزَلَ اللَّهُ تَبَارَكَ وَتَعَالَى عَلَى بَنِي إِسْرَائِيلَ وَمَاؤُهَا شِفَاءٌ لِلْعَيْنِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12909,
                "hadithNumber": "5346",
                "englishNarrator": "Sa'id bin Zaid رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Truffles are a kind of 'Manna' which Allah sent down upon Moses and their juice is a medicine for the eyes.",
                "hadithUrdu": "آپ نے فر ما یا : \" کھمبی اس من میں سے ہے جسے اللہ تعا لیٰ نے حضرت مو سیٰ علیہ السلام کو ( آسمان سے ) اتار کر عطا کیا تھا اور اس کا پانی آنکھوں کے لیے شفا ہے ۔ \"",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا, جریر نے مطرف سے انھوں نے حکم بن عتیبہ سے انھوں نے حسن عرنی سے انھوں نے عمرو بن حریث سے ، انھوں نے حضرت سعید بن زید رضی اللہ عنہ انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ، کہ",
                "hadithArabic": "و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا جَرِيرٌ عَنْ مُطَرِّفٍ عَنْ الْحَكَمِ بْنِ عُتَيْبَةَ عَنْ الْحَسَنِ الْعُرَنِيِّ عَنْ عَمْرِو بْنِ حُرَيْثٍ عَنْ سَعِيدِ بْنِ زَيْدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْكَمْأَةُ مِنْ الْمَنِّ الَّذِي أَنْزَلَ اللَّهُ عَلَى مُوسَى وَمَاؤُهَا شِفَاءٌ لِلْعَيْنِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12910,
                "hadithNumber": "5347",
                "englishNarrator": "Sa'id bin Zaid رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Truffles are 'Manna' which Allah, the Exalted the Majestic, sent to the people of Israil, and its juice is a medicine for the eyes.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" کھمبی اس من میں سے ہے جسے اللہ عزوجل نے بنی اسرئیل پر ( آسمان سے ) اتارا تھا اور اس کا پانی آنکھوں کے لیے شفاہے ۔",
                "urduNarrator": "ہم سے ابن ابی عمر نے بیان کیا, سفیا ن نے عبد الملک بن عمیر سے روایت کی ، کہا : میں نے عمرو بن حریث سے سنا ، انھوں نے کہا : میں نے حضرت سعید بن زید رضی اللہ عنہ سے سنا تھا کہہ رہے تھے",
                "hadithArabic": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ قَالَ سَمِعْتُ عَمْرَو بْنَ حُرَيْثٍ يَقُولُ قَالَ سَمِعْتُ سَعِيدَ بْنَ زَيْدٍ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْكَمْأَةُ مِنْ الْمَنِّ الَّذِي أَنْزَلَ اللَّهُ عَزَّ وَجَلَّ عَلَى بَنِي إِسْرَائِيلَ وَمَاؤُهَا شِفَاءٌ لِلْعَيْنِ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12911,
                "hadithNumber": "5348",
                "englishNarrator": "Sa'id bin Zaid رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Truffles are 'Manna' and its juice is the medicine for the eyes.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \"\" کھمبی اس من میں سے ہے اور اس کا پانی آنکھوں کے لیے شفا ہے ۔",
                "urduNarrator": "ہم سے یحییٰ بن حبیب الحارثی نے بیان کیا، ہم سے حماد بن زید نے بیان کیا، ہم سے محمد بن شبیب نے بیان کیا، انہوں نے کہا کہ میں نے ان سے سنا, شہر بن حوشب نے کہا : میں نے عبد الملک بن عمیر سےسنا ، انھوں نے کہا : میں عبد الملک سے ملا تو انھوں نے مجھے عمرو بن حریث سے حدیث بیان کی ، انھوں نے کہا : میں نے حضرت سعید بن زید رضی اللہ عنہ سے روایت کی کہا",
                "hadithArabic": "و حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ حَدَّثَنَا مُحَمَّدُ بْنُ شَبِيبٍ قَالَ سَمِعْتُهُ مِنْ شَهْرِ بْنِ حَوْشَبٍ فَسَأَلْتُهُ فَقَالَ سَمِعْتُهُ مِنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ قَالَ فَلَقِيتُ عَبْدَ الْمَلِكِ فَحَدَّثَنِي عَنْ عَمْرِو بْنِ حُرَيْثٍ عَنْ سَعِيدِ بْنِ زَيْدٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْكَمْأَةُ مِنْ الْمَنِّ وَمَاؤُهَا شِفَاءٌ لِلْعَيْنِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12912,
                "hadithNumber": "5349",
                "englishNarrator": "Jabir bin Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "We were with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) at Marr az-Zahran, and we were plucking the fruit of the Arak tree, whereupon Allah's Messenger (may peace he upon him) said: Pluck only its black ones (for they are the most pleasant). We said: Allah's Messenger, it seems you shepherded the flock. He said: Yes. Has there been a prophet who did not shepherd it (or some words like it)?",
                "hadithUrdu": "ہم مرالظہرا ن ( کے مقام ) پر رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے اور ہم پیلو چن رہے تھے رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" ان میں سے سیاہ پیلو چنو ۔ \" ہم نے عرض کی ، اللہ کے رسول اللہ صلی اللہ علیہ وسلم !یوں لگتا ہے جیسے آپ نے بکریاں چرا ئی ہو ں آپ صلی اللہ علیہ وسلم نے فرما یا : \" ہاں کو ئی نبی نہیں جس نے بکریاں نہ چرا ئی ہوں ۔ \" یا اسی طرح کی بات ارشاد فرما ئی ۔",
                "urduNarrator": "مجھ سے ابو الطاہر نے بیان کیا، کہا ہم سے عبداللہ بن وہب نے بیان کیا، یونس کی سند سے اور ابن شہاب کی سند سے, ابو سلمہ عبد الرحمٰن نے حضرت جا بر بن عبد اللہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ عَنْ يُونُسَ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ كُنَّا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَرِّ الظَّهْرَانِ وَنَحْنُ نَجْنِي الْكَبَاثَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَيْكُمْ بِالْأَسْوَدِ مِنْهُ قَالَ فَقُلْنَا يَا رَسُولَ اللَّهِ كَأَنَّكَ رَعَيْتَ الْغَنَمَ قَالَ نَعَمْ وَهَلْ مِنْ نَبِيٍّ إِلَّا وَقَدْ رَعَاهَا أَوْ نَحْوَ هَذَا مِنْ الْقَوْلِ",
                "headingArabic": "فَضِيلَةِ الأَسْوَدِ مِنَ الْكَبَاثِ ‏‏",
                "headingUrdu": "عرق کے درخت سے کالے پھل کی فضیلت",
                "headingEnglish": "The virtue of the black fruit from the Arak tree",
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12913,
                "hadithNumber": "5350",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The best of condiments or condiment is vinegar.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" سالنوں میں سے عمدہ یا ( فرمایا ) عمدہ سالن سرکہ ہے ۔ \"",
                "urduNarrator": "مجھ سے عبداللہ بن عبدالرحمٰن دارمی نے بیان کیا, یحییٰ بن حسان نے کہا کہ ہمیں سلیمان بن بلال نے ہشام بن عروہ سے حدیث بیان کی ، انھوں نے اپنے والد سے ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ أَخْبَرَنَا يَحْيَى بْنُ حَسَّانَ أَخْبَرَنَا سُلَيْمَانُ بْنُ بِلَالٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نِعْمَ الْأُدُمُ أَوْ الْإِدَامُ الْخَلُّ.",
                "headingArabic": "فَضِيلَةِ الْخَلِّ وَالتَّأَدُّمِ بِهِ ‏‏",
                "headingUrdu": "سرکہ کی فضیلت اور اسے بطور مصالحہ استعمال کرنا",
                "headingEnglish": "The virtue of vinegar and using it as a condiment",
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 12601,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=504",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=502",
                "label": "502",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=503",
                "label": "503",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=504",
                "label": "504",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=505",
                "label": "505",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=506",
                "label": "506",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=507",
                "label": "507",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=508",
                "label": "508",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=506",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=506",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=504",
        "to": 12625,
        "total": 40465
    }
}