{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 586,
        "data": [
            {
                "id": 14914,
                "hadithNumber": "7353",
                "englishNarrator": "Muhammad bin Munkadir reported:",
                "hadithEnglish": "As I saw Jabir bin 'Abdullah رضی اللہ عنہ taking an oath in the name of Allah that it was Ibn Sa'id who was the Dajjal I said: Do you take an oath in the name of Allah? Thereupon he said: I heard 'Umar رضی اللہ عنہ taking an oath in the presence of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) to this effect but Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) did not disapprove of it.",
                "hadithUrdu": "میں نے حضرت جابر بن عبداللہ رضی اللہ عنہ کو دیکھا ، وہ اللہ کی قسم کھاکر کہہ رہے تھے کہ ابن صائد دجال ہے ۔ میں نے کہا : آپ ( اس بات پر ) اللہ کی قسم کھا رہے ہیں؟انھوں نے کہا : میں نے نبی کریم صلی اللہ علیہ وسلم کے پاس حضرت عمر رضی اللہ عنہ کو اس بات پر قسم کھاتے ہوئے دیکھا تھا اور نبی کریم صلی اللہ علیہ وسلم نے اس پر انکار نہیں فرمایا تھا ۔",
                "urduNarrator": "ہم سے عبیداللہ بن معاذ العنبری نے بیان کیا، ہم سے میرے والد نے بیان کیا، ہم سے شعبہ نے بیان کیا، سعد بن ابراہیم سے, محمد بن منکدرسے روایت ہے ، کہا",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ قَالَ رَأَيْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَحْلِفُ بِاللَّهِ أَنَّ ابْنَ صَائِدٍ الدَّجَّالُ فَقُلْتُ أَتَحْلِفُ بِاللَّهِ قَالَ إِنِّي سَمِعْتُ عُمَرَ يَحْلِفُ عَلَى ذَلِكَ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يُنْكِرْهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14915,
                "hadithNumber": "7354",
                "englishNarrator": "Abdullah bin Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "'Umar bin Khattab رضی اللہ عنہ went along with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) in the company of some persons to Ibn Sayyad that he found him playing with children near the battlement of Bani Maghala and Ibn Sayyad was at that time just at the threshold of adolescence and he did not perceive (the presence of Holy Prophet) until Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) struck his back with his hands. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Ibn Sayyad, don't you bear witness that I am the messenger of Allah? Ibn Sayyad looked toward him and he said: I bear witness to the fact that you the messenger of the unlettered. Ibn Sayyad said to the Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ): Do you bear witness to the fact that I am the messenger of Allah? Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) rejected this and said: I affirm my faith in Allah and in His messengers. Then Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said to him: What do you see? Ibn Sayyad said: It is a Dukh. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: May you be disgraced and dishonoured, you would not not be able to go beyond your rank. 'Umar bin Khattab رضی اللہ عنہ said: Allah's Messenger, permit me that I should strike his neck. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: If he is the same (Dajjal) who would appear near the Last Hour, you would not be able to overpower him, and if he is not that there is no good for you to kill him.",
                "hadithUrdu": "سیدنا عمر رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ چند لوگوں میں ابن صیاد کے پاس گئے حتیٰ کہ اسے بنی مغالہ کے قلعے کے پاس لڑکوں کے ساتھ کھیلتے ہوئے دیکھا ان دنوں ابن صیاد جوانی کے قریب تھا ۔ اس کو خبر نہ ہوئی یہاں تک کہ رسول اللہ صلی اللہ علیہ وسلم نے اس کی پیٹھ پر اپنا ہاتھ مارا ۔ پھر آپ صلی اللہ علیہ وسلم نے اس سے پوچھا کہ کیا تو اس بات کی گواہی دیتا ہے کہ میں اللہ تعالیٰ کا رسول ہوں؟ ابن صیاد نے آپ صلی اللہ علیہ وسلم کی طرف دیکھا اور کہا کہ میں گواہی دیتا ہوں کہ تم امییّن کے رسول ہو ( امی کہتے ہیں ان پڑھ اور بے تعلیم کو ) ۔ پھر ابن صیاد نے رسول اللہ صلی اللہ علیہ وسلم سے کہا کہ تم اس بات کی گواہی دیتے ہو کہ میں اللہ تعالیٰ کا رسول ہوں؟ رسول اللہ صلی اللہ علیہ وسلم نے اس بات کا کچھ جواب نہ دیا؟ ( اور اس سے مسلمان ہونے کی درخواست نہ کی کیونکہ آپ صلی اللہ علیہ وسلم اس کے مسلمان ہونے سے مایوس ہو گئے اور ایک روایت میں صاد مہملہ سے یعنی آپ صلی اللہ علیہ وسلم نے اس کو لات سے مارا ) اور فرمایا کہ میں اللہ پر اور اس کے رسولوں پر ایمان لایا ۔ پھر رسول اللہ صلی اللہ علیہ وسلم نے اس سے پوچھا کہ تجھے کیا دکھائی دیتا ہے؟ وہ بولا کہ میرے پاس کبھی سچا آتا ہے اور کبھی جھوٹا ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ تیرا کام گڑبڑ ہو گیا ( یعنی مخلوط حق و باطل دونوں سے ) پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں نے تجھ سے پوچھنے کے لئے ایک بات دل میں چھپائی ہے ۔ ابن صیاد نے کہا کہ وہ دخ ( دھواں ) ہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ذلیل ہو ، تو اپنی قدر سے کہاں بڑھ سکتا ہے؟ سیدنا عمر رضی اللہ عنہ نے کہا کہ یا رسول اللہ! مجھے چھوڑئیے میں اس کی گردن مارتا ہوں ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اگر یہ وہی ( یعنی دجال ) ہے تو تو اس کو مار نہ سکے گا اور اگر یہ وہ ( دجال ) نہیں ہے تو تجھے اس کا مارنا بہتر نہیں ہے ۔",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ بن عبداللہ بن حرملہ بن عمران التجیبی نے بیان کیا, مجھ سے ابن وہب نے کہا, یونس نے ابن شہاب سے ر وایت کی کہ سالم بن عبداللہ نے انھیں بتایا ، انھیں حضرت عبداللہ بن عمر رضی اللہ عنہ نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ حَرْمَلَةَ بْنِ عِمْرَانَ التُّجِيبِيُّ أَخْبَرَنِي ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ أَخْبَرَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ انْطَلَقَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي رَهْطٍ قِبَلَ ابْنِ صَيَّادٍ حَتَّى وَجَدَهُ يَلْعَبُ مَعَ الصِّبْيَانِ عِنْدَ أُطُمِ بَنِي مَغَالَةَ وَقَدْ قَارَبَ ابْنُ صَيَّادٍ يَوْمَئِذٍ الْحُلُمَ فَلَمْ يَشْعُرْ حَتَّى ضَرَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ظَهْرَهُ بِيَدِهِ ثُمَّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِابْنِ صَيَّادٍ أَتَشْهَدُ أَنِّي رَسُولُ اللَّهِ فَنَظَرَ إِلَيْهِ ابْنُ صَيَّادٍ فَقَالَ أَشْهَدُ أَنَّكَ رَسُولُ الْأُمِّيِّينَ فَقَالَ ابْنُ صَيَّادٍ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَشْهَدُ أَنِّي رَسُولُ اللَّهِ فَرَفَضَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ آمَنْتُ بِاللَّهِ وَبِرُسُلِهِ ثُمَّ قَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَاذَا تَرَى قَالَ ابْنُ صَيَّادٍ يَأْتِينِي صَادِقٌ وَكَاذِبٌ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُلِّطَ عَلَيْكَ الْأَمْرُ ثُمَّ قَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي قَدْ خَبَأْتُ لَكَ خَبِيئًا فَقَالَ ابْنُ صَيَّادٍ هُوَ الدُّخُّ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اخْسَأْ فَلَنْ تَعْدُوَ قَدْرَكَ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ ذَرْنِي يَا رَسُولَ اللَّهِ أَضْرِبْ عُنُقَهُ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنْ يَكُنْهُ فَلَنْ تُسَلَّطَ عَلَيْهِ وَإِنْ لَمْ يَكُنْهُ فَلَا خَيْرَ لَكَ فِي قَتْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14916,
                "hadithNumber": "7355",
                "englishNarrator": "Abdullah bin 'Umar رضی اللہ عنہ further narrated:",
                "hadithEnglish": "After some time Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and Ubayy bin Ka'b رضی اللہ عنہ went towards the palm trees where Ibn Sayyad was. When Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) went near the tree he hid himself behind a tree with the intention of hearing something from Ibn sayyad before Ibn Sayyad could see him, but Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) saw him on a bed with a blanket around him from which a murmuring sound was being heard and Ibn Sayyad's mother saw Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) behind the trunk of the palm tree. She said to Ibn Sayyad: Saf (that being his name), here is Muhammad. Thereupon Ibn Sayyad jumped up murmuring and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: If she had left him alone he would have made things clear.",
                "hadithUrdu": "اس ( سابقہ واقعے ) کے بعد رسول اللہ صلی اللہ علیہ وسلم اورحضرت ابی ابن کعب انصاری رضی اللہ عنہ کھجوروں کے اس باغ میں گئے جس میں ابن صیاد تھا ، باغ میں داخل ہونے کے بعد رسول اللہ صلی اللہ علیہ وسلم کھجوروں کے تنوں کی آڑ میں ہونے لگے تاکہ اس سے پہلے کہ ابن صیاد آپ کو دیکھے آ پ اس کی کوئی بات سن لیں ، وہ بستر پر ایک نرم چادر میں ( اسے اوڑھ کر لیٹا ) ہوا تھا ، اس کے اندر سے اس کی گنگاہٹ کی آوازآرہی تھی ۔ جب رسول اللہ صلی اللہ علیہ وسلم کھجور کے درختوں کی آڑلے رہے تھے تو ابن صیاد کی ماں نے آپ صلی اللہ علیہ وسلم کو دیکھ لیا اور وہ ابن صیاد سے کہنے لگی صاف! ۔ ۔ ۔ اور یہ ابن صیاد کا نام تھا ۔ یہ محمد صلی اللہ علیہ وسلم ( آئے ) ہیں ۔ ابن صیاد اچھل کرکھڑا ہوگیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" اگر وہ اس کو ( اُسی حالت میں ) چھوڑ دیتی تو وہ ( اپنا معاملہ ) واضح کردیتا ۔ \"",
                "urduNarrator": "سالم بن عبداللہ نے کہا : میں نے حضرت عبداللہ بن عمر رضی اللہ عنہ سے سنا ، وہ کہتے ہیں",
                "hadithArabic": "وَقَالَ سَالِمُ بْنُ عَبْدِ اللَّهِ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ يَقُولُ انْطَلَقَ بَعْدَ ذَلِكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأُبَيُّ بْنُ كَعْبٍ الْأَنْصَارِيُّ إِلَى النَّخْلِ الَّتِي فِيهَا ابْنُ صَيَّادٍ حَتَّى إِذَا دَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ النَّخْلَ طَفِقَ يَتَّقِي بِجُذُوعِ النَّخْلِ وَهُوَ يَخْتِلُ أَنْ يَسْمَعَ مِنْ ابْنِ صَيَّادٍ شَيْئًا قَبْلَ أَنْ يَرَاهُ ابْنُ صَيَّادٍ فَرَآهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مُضْطَجِعٌ عَلَى فِرَاشٍ فِي قَطِيفَةٍ لَهُ فِيهَا زَمْزَمَةٌ فَرَأَتْ أُمُّ ابْنِ صَيَّادٍ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَتَّقِي بِجُذُوعِ النَّخْلِ فَقَالَتْ لِابْنِ صَيَّادٍ يَا صَافِ وَهُوَ اسْمُ ابْنِ صَيَّادٍ هَذَا مُحَمَّدٌ فَثَارَ ابْنُ صَيَّادٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ تَرَكَتْهُ بَيَّنَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14917,
                "hadithNumber": "7356",
                "englishNarrator": "Abdullah bin Umar رضی اللہ عنہ said:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) stood up amongst the people and lauded Allah as He deserved, then he made a mention of the Dajjal and said: I warn you of him and there is no Prophet who has not warned his people against the Dajjal. Even Noah warned (against him) but I am going to tell you a thing which no Prophet told his people. You must know that he (the Dajjal) is one-eyed and Allah, the Exalted and Glorious, is not one-eyed. Ibn Shihab said: 'Umar b. Thabit al-Ansari informed me that some of the Companions of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) informed him that the day when Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) warned people against the Dajjal, he also said: There would be written between his two eyes (the word) Kafir (infidel) and everyone who would resent his deeds would be able to read or every Muslim would be about to read, and he also said: Bear this thing in mind that none amongst you would be able to see Allah, the Exalted and Glorious, until he dies.",
                "hadithUrdu": "پھر رسول اللہ صلی اللہ علیہ وسلم لوگوں میں ( خطبہ دینے کے لیے ) کھڑے ہوئے اور اللہ تعالیٰ کی ایسی تعریف کی جس کا وہ اہل ہے ، پھر آپ نے دجال کاذکر کیا اور فرمایا : \"\" میں تمھیں اس سےخبردار کررہا ہوں ، اور ہر نبی نے ا پنی قوم کو اس سے خبر دار کیا ہے ، بے شک حضرت نوح علیہ السلام نے بھی اپنی قوم کو اس سے خبر دار کیا ، لیکن میں تمھیں اس کے متعلق ایک ایسی بات بتاتاہوں جو کسی نبی نے اپنی قوم کو نہیں بتائی ، اچھی طرح جان لو کہ وہ کانا ہےاور اللہ تبارک وتعالیٰ کانا نہیں ہے ۔ \"\" ابن شہاب نے کہا : مجھے عمر بن ثابت انصاری نے رسول اللہ صلی اللہ علیہ وسلم کے ایک صحابی سے ( روایت کرتے ہوئے ) خبر دی کہ آپ صلی اللہ علیہ وسلم نے جس روز لوگوں کو دجال کے بارے میں خبر دار کیا توفرمایا : \"\" اس کی دونوں آنکھوں کے درمیان لکھا ہوا ہے : \"\" کافر \"\" ہر وہ آدمی جو اس کے عمل کو ناپسند کرے گا اسے پڑھ لے گا یا ( فرمایا : ) ہر مومن اسے پڑھ لے گا ۔ \"\" اور آ پ صلی اللہ علیہ وسلم نے فرمایا کہ اس بات کو اچھی طرح جان لو کہ تم میں سے کوئی بھی مرنے تک اپنے رب وعزوجل کو ہرگز نہیں دیکھ سکے گا ۔ \"\" ( جبکہ دجال کو سب لوگ دیکھ رہے ہوں گے ۔ )",
                "urduNarrator": "سالم نے کہا : حضرت عبداللہ بن عمر رضی اللہ عنہ نے کہا",
                "hadithArabic": "قَالَ سَالِمٌ قَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي النَّاسِ فَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ ثُمَّ ذَكَرَ الدَّجَّالَ فَقَالَ إِنِّي لَأُنْذِرُكُمُوهُ مَا مِنْ نَبِيٍّ إِلَّا وَقَدْ أَنْذَرَهُ قَوْمَهُ لَقَدْ أَنْذَرَهُ نُوحٌ قَوْمَهُ وَلَكِنْ أَقُولُ لَكُمْ فِيهِ قَوْلًا لَمْ يَقُلْهُ نَبِيٌّ لِقَوْمِهِ تَعَلَّمُوا أَنَّهُ أَعْوَرُ وَأَنَّ اللَّهَ تَبَارَكَ وَتَعَالَى لَيْسَ بِأَعْوَرَ قَالَ ابْنُ شِهَابٍ وَأَخْبَرَنِي عُمَرُ بْنُ ثَابِتٍ الْأَنْصَارِيُّ أَنَّهُ أَخْبَرَهُ بَعْضُ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَوْمَ حَذَّرَ النَّاسَ الدَّجَّالَ إِنَّهُ مَكْتُوبٌ بَيْنَ عَيْنَيْهِ كَافِرٌ يَقْرَؤُهُ مَنْ كَرِهَ عَمَلَهُ أَوْ يَقْرَؤُهُ كُلُّ مُؤْمِنٍ وَقَالَ تَعَلَّمُوا أَنَّهُ لَنْ يَرَى أَحَدٌ مِنْكُمْ رَبَّهُ عَزَّ وَجَلَّ حَتَّى يَمُوتَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14918,
                "hadithNumber": "7357",
                "englishNarrator": "Abdullah bin Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) went along with him in the company of some persons and there was Umar bin Khattab رضی اللہ عنہ also amongst them till they saw Ibn Sayyad as a young boy just on the threshold of adolescence playing with children near the battlement of Bani Mu'awiya; the rest of the hadith is the same but with these concluding words: Had his mother left him (to murmur) his matter would have become clear.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ا پنے صحابہ رضوان اللہ عنھم اجمعین کی جماعت کے ساتھ جس میں حضرت عمر بن خطاب رضی اللہ عنہ بھی تھے ، تشریف لے گئے ، یہاں تک کہ آپ صلی اللہ علیہ وسلم نے ابن صیاد کو دیکھا ۔ وہ اس وقت بلوغت کی عمر کوپہنچنے کے قریب ایک لڑکا تھا ، وہ بنو معاویہ کے مکانوں کے پاس لڑکوں کے ساتھ کھیل رہاتھا ۔ اور عمر بن ثابت کی حدیث کے اختتام تک یونس کی حدیث کے مانند بیان کیا ۔ اور یعقوب سے روایت کردہ حدیث میں کہا : ابی ( ابن کعب رضی اللہ عنہ ) نے آپ صلی اللہ علیہ وسلم کے فرمان : \" اگر وہ اسے چھوڑ دیتی تو واضح کردیتا ۔ \" کے بارے میں کہا ، اگر اس کی ماں اسے چھوڑ دیتی تو ا پنا معاملہ وہ واضح کردیتا ۔",
                "urduNarrator": "ہم سے حسن بن علی الحلوانی اور عبد بن حمید نے بیان کیا : ہم سے یعقوب نے جو ابراہیم بن سعد کے بیٹے ہیں بیان کیا : ہم سے میرے والد نے کہا :صالح نے ابن شہاب سےروایت کی ، انھوں نے کہا : مجھے سالم بن عبداللہ نے بتایا کہ حضرت عبداللہ بن عمر رضی اللہ عنہ نے کہا",
                "hadithArabic": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ وَعَبْدُ بْنُ حُمَيْدٍ قَالَا حَدَّثَنَا يَعْقُوبُ وَهُوَ ابْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنَا أَبِي عَنْ صَالِحٍ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ قَالَ انْطَلَقَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعَهُ رَهْطٌ مِنْ أَصْحَابِهِ فِيهِمْ عُمَرُ بْنُ الْخَطَّابِ حَتَّى وَجَدَ ابْنَ صَيَّادٍ غُلَامًا قَدْ نَاهَزَ الْحُلُمَ يَلْعَبُ مَعَ الْغِلْمَانِ عِنْدَ أُطُمِ بَنِي مُعَاوِيَةَ وَسَاقَ الْحَدِيثَ بِمِثْلِ حَدِيثِ يُونُسَ إِلَى مُنْتَهَى حَدِيثِ عُمَرَ بْنِ ثَابِتٍ وَفِي الْحَدِيثِ عَنْ يَعْقُوبَ قَالَ قَالَ أُبَيٌّ يَعْنِي فِي قَوْلِهِ لَوْ تَرَكَتْهُ بَيَّنَ قَالَ لَوْ تَرَكَتْهُ أُمُّهُ بَيَّنَ أَمْرَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14919,
                "hadithNumber": "7358",
                "englishNarrator": "Ibn 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) happened to pass by Ibn Sayyad along with his Companions including 'Umar bin Khattab رضی اللہ عنہ as he was playing with children near the battlement of Bani Maghala and he was also a child by that time. The rest of the hadith is the same as narrated by Ibn Umar رضی اللہ عنہ (in which there is a mention of) setting out of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) along with Ubayy bin Ka'b رضی اللہ عنہ towards the date-palm trees.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم اپنے صحابہ رضوان اللہ عنھم اجمعین میں سے چند لوگوں کے ساتھ ، جن میں حضرت عمر بن خطاب رضی اللہ عنہ بھی تھے ، ابن صیاد کے قریب سے گزرے ، وہ اس وقت لڑکاتھا اور بنومقالہ کے مکانوں کے قریب لڑکوں کے ساتھ کھیل رہا تھا ۔ ( آگے ) جس طرح یونس اور صالح کی حدیث ہے مگر عبد حمید نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ کی حدیث میں نبی کریم صلی اللہ علیہ وسلم کے حضرت ابی بن کعب رضی اللہ تعالیٰ عنہ کے ساتھ کھجوروں کے باغ میں جانے کا ذکر نہیں کیا ۔",
                "urduNarrator": "عبد بن حمید اور سلمہ بن ثویب دونوں نے ہمیں عبدالرزاق سے حدیث بیان کی ، ( انھوں نے کہا : ) ہمیں معمر نے زہری سے خبر دی ا ، انھوں نے سالم سے اور انھوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ وَسَلَمَةُ بْنُ شَبِيبٍ جَمِيعًا عَنْ عَبْدِ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِابْنِ صَيَّادٍ فِي نَفَرٍ مِنْ أَصْحَابِهِ فِيهِمْ عُمَرُ بْنُ الْخَطَّابِ وَهُوَ يَلْعَبُ مَعَ الْغِلْمَانِ عِنْدَ أُطُمِ بَنِي مَغَالَةَ وَهُوَ غُلَامٌ بِمَعْنَى حَدِيثِ يُونُسَ وَصَالِحٍ غَيْرَ أَنَّ عَبْدَ بْنَ حُمَيْدٍ لَمْ يَذْكُرْ حَدِيثَ ابْنِ عُمَرَ فِي انْطِلَاقِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَعَ أُبَيِّ بْنِ كَعْبٍ إِلَى النَّخْلِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14920,
                "hadithNumber": "7359",
                "englishNarrator": "Nafi' reported:",
                "hadithEnglish": "Ibn 'Umar رضی اللہ عنہ met Ibn Si'id on some of the paths of Medina and he said to him a word which enraged him and he was so much swollen with anger that the way was blocked. Ibn 'Umar went to Hafsa and informed her about this. Thereupon she said: May Allah have mercy upon you, why did you incite Ibn Sayyad in spite of the fact that you knew it would be the extreme anger which would make Dajjal appear in the world?",
                "hadithUrdu": "حضرت ابن عمر رضی اللہ عنہ نے ایک راستے میں ابن صیاد سے ملے ۔ حضرت ابن عمر رضی اللہ تعالیٰ عنہ نے اس سے کوئی ایسی بات کہی جس نے اسے غصہ دلادیا تو وہ اتنا پھول گیا کہ اس نے ( پوری ) گلی کوبھر دیا ، پھر حضرت ابن عمر رضی اللہ تعالیٰ عنہ حضرت حفصہ رضی اللہ تعالیٰ عنہا کے پاس گئے ان کو یہ خبر مل چکی تھی ، انھوں نے ان سے فرمایا ، اللہ تعالیٰ تم پر رحم فرمائے!تم ابن صیاد سے کیاچاہتے تھے؟کیا تمھیں معلوم نہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا : \" دجال غصہ آجانے کی وجہ سے ہی ( اپنی حقیقی صورت میں ) برآمد ہوگا ۔ \"",
                "urduNarrator": "ہم سے عبد بن حمید نے بیان کیا، ہم سے راو بن عبادہ نے بیان کیا، ہم سے ہشام نے بیان کیا, ایوب نے نافع سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ حَدَّثَنَا هِشَامٌ عَنْ أَيُّوبَ عَنْ نَافِعٍ قَالَ لَقِيَ ابْنُ عُمَرَ ابْنَ صَائِدٍ فِي بَعْضِ طُرُقِ الْمَدِينَةِ فَقَالَ لَهُ قَوْلًا أَغْضَبَهُ فَانْتَفَخَ حَتَّى مَلَأَ السِّكَّةَ فَدَخَلَ ابْنُ عُمَرَ عَلَى حَفْصَةَ وَقَدْ بَلَغَهَا فَقَالَتْ لَهُ رَحِمَكَ اللَّهُ مَا أَرَدْتَ مِنْ ابْنِ صَائِدٍ أَمَا عَلِمْتَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّمَا يَخْرُجُ مِنْ غَضْبَةٍ يَغْضَبُهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14921,
                "hadithNumber": "7360",
                "englishNarrator": "Nafi' reported:",
                "hadithEnglish": "Ibn 'Umar رضی اللہ  عنہ said: I met lbn Sayyad twice and said to some of them (his friends): You state that it was he (the Dajjal). He said: By Allah, it is not so. I said: You have not told me the truth; by Allah some of you informed me that he would not die until he would have the largest number of offspring and huge wealth and it is he about whom it is thought so. Then Ibn Sayyad talked to us. I then departed and met him again for the second time and his eye had been swollen. I said: What has happened to your eye? He said: I do not know. I said: This is in your head and you do not know about it? He said: If Allah so wills He can create it (eye) in your staff. He then produced a sound like the braying of a donkey. Some of my companions thought that I had struck him with the staff as he was with me that the staff broke into pieces, but, by Allah, I was not conscious of it. He then came to the Mother of the Faithful (Hafsa) and narrated it to her and she said: What concern you have with him? Don't you know that Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said that the first thing (by the incitement of which) he would come out before the public would be his anger?",
                "hadithUrdu": "( اسکے بارے میں ) حضرت ابن عمر رضی اللہ  عنہ نے کہا : ۔ میں اس سے دوبارہ ملاہوں ۔ ایک بار ملا تو میں نے لوگوں سے کہا کہ تم کہتے تھے کہ ابن صیاد دجال ہے؟ ۔ انہوں نے کہا کہ نہیں اللہ کی قسم ۔ میں نے کہا کہ اللہ کی قسم! تم نے مجھے جھوٹا کیا ۔ تم میں سے بعض لوگوں نے مجھ سے بیان کیا کہ وہ نہیں مرے گا ، یہاں تک کہ تم سب میں زیادہ مالدار اور صاحب اولاد ہو گا ، تو وہ آج کے دن ایسا ہی ہے ۔ وہ کہتے ہیں پھر ابن صیاد نے ہم سے باتیں کیں ۔ پھر میں ابن صیاد سے جدا ہوا ۔ کہتے ہیں کہ جب دوبارہ ملا تو اس کی آنکھ پھولی ہوئی تھی ۔ میں نے کہا کہ یہ تیری آنکھ کب سے ایسے ہے جو میں دیکھ رہا ہوں؟ وہ بولا کہ مجھے معلوم نہیں ۔ میں نے کہا کہ آنکھ تیرے سر میں ہے اور تجھے معلوم نہیں؟ وہ بولا کہ اگر اللہ چاہے تو تیری اس لکڑی میں آنکھ پیدا کر دے ۔ پھر ایسی آواز نکالی جیسے گدھا زور سے کرتا ہے ۔ انھوں نے کہا : میرےساتھیوں میں سے ایک سمجھتا ہے کہ میرے پاس جو ڈنڈا تھا میں نے اسے اس کے ساتھ اتنا مارا کہ وہ ڈنڈا ٹوٹ گیا لیکن میں ، واللہ!مجھے کچھ پتہ نہ چلا ۔ نافع نے کہا کہ سیدنا عبداللہ بن عمر ام المؤمنین ( حفصہ رضی اللہ عنہا ) کے پاس گئے اور ان سے یہ حال بیان کیا تو انہوں نے کہا کہ ابن صیاد سے تیرا کیا کام تھا؟ کیا تو نہیں جانتا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اول چیز جو دجال کو لوگوں پر بھیجے گی ، وہ اس کا غصہ ہے ۔",
                "urduNarrator": "ہم سے محمد بن مثنیٰ نے بیان کیا,  ہم سے حسین، یعنی ابن حسن بن یسار نے بیان کیا, ابن عون نے ہمیں نافع سے حدیث بیان کی ، کہا : نافع کہاکرتے تھے کہ ابن صیاد",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا حُسَيْنٌ يَعْنِي ابْنَ حَسَنِ بْنِ يَسَارٍ حَدَّثَنَا ابْنُ عَوْنٍ عَنْ نَافِعٍ قَالَ كَانَ نَافِعٌ يَقُولُ ابْنُ صَيَّادٍ قَالَ قَالَ ابْنُ عُمَرَ لَقِيتُهُ مَرَّتَيْنِ قَالَ فَلَقِيتُهُ فَقُلْتُ لِبَعْضِهِمْ هَلْ تَحَدَّثُونَ أَنَّهُ هُوَ قَالَ لَا وَاللَّهِ قَالَ قُلْتُ كَذَبْتَنِي وَاللَّهِ لَقَدْ أَخْبَرَنِي بَعْضُكُمْ أَنَّهُ لَنْ يَمُوتَ حَتَّى يَكُونَ أَكْثَرَكُمْ مَالًا وَوَلَدًا فَكَذَلِكَ هُوَ زَعَمُوا الْيَوْمَ قَالَ فَتَحَدَّثْنَا ثُمَّ فَارَقْتُهُ قَالَ فَلَقِيتُهُ لَقْيَةً أُخْرَى وَقَدْ نَفَرَتْ عَيْنُهُ قَالَ فَقُلْتُ مَتَى فَعَلَتْ عَيْنُكَ مَا أَرَى قَالَ لَا أَدْرِي قَالَ قُلْتُ لَا تَدْرِي وَهِيَ فِي رَأْسِكَ قَالَ إِنْ شَاءَ اللَّهُ خَلَقَهَا فِي عَصَاكَ هَذِهِ قَالَ فَنَخَرَ كَأَشَدِّ نَخِيرِ حِمَارٍ سَمِعْتُ قَالَ فَزَعَمَ بَعْضُ أَصْحَابِي أَنِّي ضَرَبْتُهُ بِعَصًا كَانَتْ مَعِيَ حَتَّى تَكَسَّرَتْ وَأَمَّا أَنَا فَوَاللَّهِ مَا شَعَرْتُ قَالَ وَجَاءَ حَتَّى دَخَلَ عَلَى أُمِّ الْمُؤْمِنِينَ فَحَدَّثَهَا فَقَالَتْ مَا تُرِيدُ إِلَيْهِ أَلَمْ تَعْلَمْ أَنَّهُ قَدْ قَالَ إِنَّ أَوَّلَ مَا يَبْعَثُهُ عَلَى النَّاسِ غَضَبٌ يَغْضَبُهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14922,
                "hadithNumber": "7361",
                "englishNarrator": "Ibn Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) made a mention of Dajjal in the presence of the people and said: Allah is not one-eyed and behold that Dajjal is blind of the right eye and his eye would be like a floating grape.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے لوگوں کے سامنے دجال کا ذکر کیا تو آپ نے فرمایا : \" اللہ تبارک وتعالیٰ کانانہیں ہے سن رکھو!بلاشبہ مسیح دجال داہنی آنکھ سے کاناہے ۔ اس کی آنکھ اس طرح ہے جیسے ابھراہواانگورکادانہ ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے ابو اسامہ اور محمد بن بشر نے بیان کیا, عبید اللہ نے ہمیں نافع سے حدیث بیان کی ، انھوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ وَمُحَمَّدُ بْنُ بِشْرٍ قَالَا حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ وَاللَّفْظُ لَهُ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَكَرَ الدَّجَّالَ بَيْنَ ظَهْرَانَيْ النَّاسِ فَقَالَ إِنَّ اللَّهَ تَعَالَى لَيْسَ بِأَعْوَرَ أَلَا وَإِنَّ الْمَسِيحَ الدَّجَّالَ أَعْوَرُ الْعَيْنِ الْيُمْنَى كَأَنَّ عَيْنَهُ عِنَبَةٌ طَافِئَةٌ.",
                "headingArabic": "ذِكْرِ الدَّجَّالِ",
                "headingUrdu": "دجال",
                "headingEnglish": "Ad-Dajjal",
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14923,
                "hadithNumber": "7362",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Ibn 'Umar رضی اللہ عنہ through another chain of transmitters.",
                "hadithUrdu": "مجھ سے ابو الربیع اور ابو کامل نے بیان کیا: حماد نے جو ابن زید ہیں، بیان کیا: ایوب اور موسیٰ بن عقبہ دونوں نے نافع سے انھوں نے ابن عمر رضی اللہ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنِي أَبُو الرَّبِيعِ وَأَبُو كَامِلٍ قَالَا حَدَّثَنَا حَمَّادٌ وَهُوَ ابْنُ زَيْدٍ عَنْ أَيُّوبَ و حَدَّثَنَا مُحَمَّدُ بْنُ عَبَّادٍ حَدَّثَنَا حَاتِمٌ يَعْنِي ابْنَ إِسْمَعِيلَ عَنْ مُوسَى بْنِ عُقْبَةَ كِلَاهُمَا عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14924,
                "hadithNumber": "7363",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: There is never a prophet who has not warned the Ummah of that one-eyed liar; behold he is one-eyed and your Lord is not one-eyed. On his forehead are the letters k f. r. (Kafir).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کوئی نبی نہیں ( گزرا مگر اس نے اپنی امت کوکانے کذاب سے ڈرایا ہے ۔ یاد رکھو ، وہ کا نا ہے جبکہ تمھارا عزت اور جلال والا رب کانا نہیں اس ( دجال ) کی دونوں آنکھوں کے درمیان \" ک ف ر \" لکھا ہوا ہے ۔ \"",
                "urduNarrator": "ہم سے محمد بن المثنیٰ اور محمد بن بشار نے بیان کیا، ہم سے محمد بن جعفر نے بیان کیا, شعبہ نے ہمیں قتادہ سے حدیث بیان کی انھوں نے کہا : میں نے حضرت انس بن مالک رضی اللہ عنہ سے سنا ، انھوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ نَبِيٍّ إِلَّا وَقَدْ أَنْذَرَ أُمَّتَهُ الْأَعْوَرَ الْكَذَّابَ أَلَا إِنَّهُ أَعْوَرُ وَإِنَّ رَبَّكُمْ لَيْسَ بِأَعْوَرَ وَمَكْتُوبٌ بَيْنَ عَيْنَيْهِ ك ف ر.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14925,
                "hadithNumber": "7364",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: There would be written three letters k. f. r., i. e. Kafir, between the eyes of the Dajjal.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے فرمایا : \" دجال کی دونوں آنکھوں کے درمیان ک ف ریعنی کافر لکھا ہوا ہو گا ۔ \"",
                "urduNarrator": "ہم سے ابن المثنیٰ اور ابن بشار نے بیان کیا اور قول ابن المثنیٰ کا ہے۔ انہوں نے کہا: معاذ بن ہشام نے قتادہ سے روایت کی ، انھوں نے کہا : حضرت انس بن مالک رضی اللہ عنہ نے حدیث بیان کی کہ",
                "hadithArabic": "حَدَّثَنَا ابْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ وَاللَّفْظُ لِابْنِ الْمُثَنَّى قَالَا حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الدَّجَّالُ مَكْتُوبٌ بَيْنَ عَيْنَيْهِ ك ف ر أَيْ كَافِرٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14926,
                "hadithNumber": "7365",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Dajjal is blind of one eye and there is written between his eyes the word Kafir . He then spelled the word as k. f. r., which every Muslim would be able to read.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" دجال بے نورآنکھ والاہے اور اس کی دونوں آنکھوں کے درمیان لکھا ہوا ہےکافر ۔ \" پھر آپ صلی اللہ علیہ وسلم نے اس کے ہجے کیے ۔ ک ف ر ۔ \" اس کو ہر مسلمان پڑھ لے گا ۔ \"",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے عفان نے بیان کیا، کہا ہم سے عبدالوارث نے بیان کیا, شعیب بن جنحاب نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی کہا",
                "hadithArabic": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا عَفَّانُ حَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ شُعَيْبِ بْنِ الْحَبْحَابِ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الدَّجَّالُ مَمْسُوحُ الْعَيْنِ مَكْتُوبٌ بَيْنَ عَيْنَيْهِ كَافِرٌ ثُمَّ تَهَجَّاهَا ك ف ر يَقْرَؤُهُ كُلُّ مُسْلِمٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14927,
                "hadithNumber": "7366",
                "englishNarrator": "Hudhaifa رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Dajjal is blind of left eye with thick hair and there would be a garden and fire with him and his fire would be a garden and his garden would be fire.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" دجال کی بائیں آنکھ ( بھی ) عیب دار ہوگی اور بال گھنے گچھے دارہوں گے اس کے ہمراہ ایک جنت ہوگی اور ایک دوزخ ہوگی ۔ اس کی دوزخ ( حقیقت میں ) جنت ہو گی اور اس کی جنت اصل میں دوزخ ہو گی ۔",
                "urduNarrator": "ہم سے محمد بن عبداللہ بن نمیر، محمد بن العلاء اور اسحاق بن ابراہیم نے بیان کیا۔ اسحاق نے کہا: اس نے ہمیں خبر دی، اور باقی دو نے کہا: ہم سے ابو معاویہ نے الاعمش کی سند سے بیان کیا, شقیق نے حضرت حذیفہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ وَمُحَمَّدُ بْنُ الْعَلَاءِ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ إِسْحَقُ أَخْبَرَنَا و قَالَ الْآخَرَانِ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ شَقِيقٍ عَنْ حُذَيْفَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الدَّجَّالُ أَعْوَرُ الْعَيْنِ الْيُسْرَى جُفَالُ الشَّعَرِ مَعَهُ جَنَّةٌ وَنَارٌ فَنَارُهُ جَنَّةٌ وَجَنَّتُهُ نَارٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14928,
                "hadithNumber": "7367",
                "englishNarrator": "It was narrated that Hudhaifah رضی اللہ عنہ said:",
                "hadithEnglish": "The Messenger of Allah said: 'I know what the Dajjal will have with him. He will have two flowing rivers, one that appears to the eye to be clear water, and one that appears to the eye to be flaming fire. If anyone sees that, let him go to the river which he thinks is fire and close his eyes, then lower his head and drink from it, for it is cool water. The Dajjal has one blind eye, with a layer of thick skin over it, and between his eyes is written disbeliever, which every believer will read, whether he is literate or illiterate.'",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جوکچھ دجال کے ساتھ ہو گا اسے میں خود اس کی نسبت بھی زیادہ اچھی طرح جانتاہوں ۔ اس کے ساتھ دوچلتے ہوئے دریا ہوں گے ۔ دونوں میں سے ایک بظاہر سفید رنگ کاپانی ہوگا اور دوسرا بظاہربھڑکتی ہوئی آگ ہوگی ۔ اگر کوئی شخص اس کو پالے تو اس دریا کی طرف آئے جسے وہ آگ ( کی طرح ) دیکھ رہا ہے اور اپنی آنکھ بند کرے ۔ پھر اپنا سر جھکا ئے اور اس میں سے پیے تو وہ ٹھنڈا پانی ہو گا ۔ اور دجال بے نور آنکھ والا ہے اس کے اوپر موٹاناخونہ ( گوشت کاٹکڑا جو آنکھ میں پیدا ہوجاتاہے ) ہوگا ۔ اس کی دونوں آنکھوں کے درمیان لکھا ہو گا ۔ : کافر ۔ اسےہر مومن لکھنے ( پڑھنے ) والاہویا نہ لکھنے ( پڑھنے ) والاپڑھ لے گا ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے یزید بن ہارون نے بیان کیا, ابو مالک اشجعی نے ربعی بن حراش سے اور انھوں نے حضرت حذیفہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ عَنْ أَبِي مَالِكٍ الْأَشْجَعِيِّ عَنْ رِبْعِيِّ بْنِ حِرَاشٍ عَنْ حُذَيْفَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَأَنَا أَعْلَمُ بِمَا مَعَ الدَّجَّالِ مِنْهُ مَعَهُ نَهْرَانِ يَجْرِيَانِ أَحَدُهُمَا رَأْيَ الْعَيْنِ مَاءٌ أَبْيَضُ وَالْآخَرُ رَأْيَ الْعَيْنِ نَارٌ تَأَجَّجُ فَإِمَّا أَدْرَكَنَّ أَحَدٌ فَلْيَأْتِ النَّهْرَ الَّذِي يَرَاهُ نَارًا وَلْيُغَمِّضْ ثُمَّ لْيُطَأْطِئْ رَأْسَهُ فَيَشْرَبَ مِنْهُ فَإِنَّهُ مَاءٌ بَارِدٌ وَإِنَّ الدَّجَّالَ مَمْسُوحُ الْعَيْنِ عَلَيْهَا ظَفَرَةٌ غَلِيظَةٌ مَكْتُوبٌ بَيْنَ عَيْنَيْهِ كَافِرٌ يَقْرَؤُهُ كُلُّ مُؤْمِنٍ كَاتِبٍ وَغَيْرِ كَاتِبٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14929,
                "hadithNumber": "7368",
                "englishNarrator": "Hudhaifa رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: the Dajjal would have with him water and fire and his fire would have the effect of cold water and his water would have the effect of fire, so don't put yourself to ruin. Abu Mas'ud reported: I also heard it from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌).",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے دجال کے بارے میں ، ( فرمایا ) \" بےشک اس کے ہمراپانی ہوگااور آگ ہوگی اس کی آگ ( اصل میں ) ٹھنڈا پانی ہوگا اور اس کا پانی آگ ہوگی توتم لوگ ( دھوکے میں ) ہلاک نہ ہوجانا ۔ \"",
                "urduNarrator": "ہم سے عبیداللہ بن معاذ نے بیان کیا، ہم سے میرے والد نے بیان کیا، ہم سے شعبہ نے بیان کیا اور ہم سے محمد بن المثنیٰ نے بیان کیا، محمد بن جعفرنے ہمیں حدیث بیان کی کہا : ہمیں شعبہ نے عبدالملک بن عمیر سے حدیث بیان کی ، انھوں نےربعی بن حراش سے انھوں نے حضرت حذیفہ رضی اللہ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَاللَّفْظُ لَهُ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ رِبْعِيِّ بْنِ حِرَاشٍ عَنْ حُذَيْفَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ فِي الدَّجَّالِ إِنَّ مَعَهُ مَاءً وَنَارًا فَنَارُهُ مَاءٌ بَارِدٌ وَمَاؤُهُ نَارٌ فَلَا تَهْلِكُوا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14930,
                "hadithNumber": "7369",
                "englishNarrator": null,
                "hadithEnglish": "Abu Ma'sud رضی اللہ عنہ said: \"I heard the Messenger of Allah ﷺ.",
                "hadithUrdu": "حضرت ابو مسعود رضی اللہ عنہ نے کہا : میں نے بھی یہ حدیث رسول اللہ صلی اللہ علیہ وسلم سے سنی تھی ۔",
                "urduNarrator": null,
                "hadithArabic": "قَالَ أَبُو مَسْعُودٍ وَأَنَا سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14931,
                "hadithNumber": "7370",
                "englishNarrator": "It was narrated that Rabi bin Hirash said:",
                "hadithEnglish": "Uqba bin 'Amr Abu Mas'ud al-Ansari رضی اللہ عنہ reported: I went to Hudhaifa bin Yaman رضی اللہ  عنہ and said to him: Narrate what you have heard from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) pertaining to the Dajjal. He said that the Dajjal would appear and there would be along with him water and fire and what the people would see as water that would be fire and that would burn and what would appear as fire that would be water and any one of you who would see that should plunge in that which he sees as fire for it would be sweet, pure water, and 'Uqba رضی اللہ عنہ said: I also heard it, testifying Hudhaifa رضی اللہ عنہ.",
                "hadithUrdu": "میں ان ( عقبہ بن عمرو رضی اللہ عنہ ) کے ہمراہ حضرت حذیفہ بن یمان رضی اللہ  عنہ کے پاس گیا عقبہ رضی اللہ عنہ نے ان سے کہا : آپ نے دجال کے متعلق رسول اللہ صلی اللہ علیہ وسلم سے جو حدیث سنی ہے وہ مجھے بیان کریے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" دجال نکلے گااس کے ساتھ پانی ہوگا اور آگ ہوگی ۔ جو لوگوں کو پانی نظر آرہا ہو گا ( وہ ) آگ ہوگی ۔ اور جو لوگوں کو آگ نظر آرہی ہو گی ۔ وہ ٹھنڈا میٹھا پانی ہو گا تم میں سے جو شخص اس کو پائے وہ اس میں کودجائے جو اسے آگ نظر آرہی ہو ۔ بلاشبہ وہ میٹھا پاکیزہ پانی ہو گا ۔ حضرت عقبہ رضی اللہ عنہ نے ۔ حضرت حذیفہ رضی اللہ عنہ کی تصدیق کرتے ہوئے کہا ۔ اور میں نے ( بھی ) یہ حدیث سنی تھی ۔",
                "urduNarrator": "ہم سے علی بن حجر نے بیان کیا, شعیب بن صفوان نے ہمیں عبد الملک بن عمیرسے انھوں نے ربعی بن حراش سے انھوں نے  عقبہ بن عمرو ابو مسعود انصاری رضی اللہ عنہ سے روایت کی ، ( ربعی نے ) کہا",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ حَدَّثَنَا شُعَيْبُ بْنُ صَفْوَانَ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ رِبْعِيِّ بْنِ حِرَاشٍ عَنْ عُقْبَةَ بْنِ عَمْرٍو أَبِي مَسْعُودٍ الْأَنْصَارِيِّ قَالَ انْطَلَقْتُ مَعَهُ إِلَى حُذَيْفَةَ بْنِ الْيَمَانِ فَقَالَ لَهُ عُقْبَةُ حَدِّثْنِي مَا سَمِعْتَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الدَّجَّالِ قَالَ إِنَّ الدَّجَّالَ يَخْرُجُ وَإِنَّ مَعَهُ مَاءً وَنَارًا فَأَمَّا الَّذِي يَرَاهُ النَّاسُ مَاءً فَنَارٌ تُحْرِقُ وَأَمَّا الَّذِي يَرَاهُ النَّاسُ نَارًا فَمَاءٌ بَارِدٌ عَذْبٌ فَمَنْ أَدْرَكَ ذَلِكَ مِنْكُمْ فَلْيَقَعْ فِي الَّذِي يَرَاهُ نَارًا فَإِنَّهُ مَاءٌ عَذْبٌ طَيِّبٌ فَقَالَ عُقْبَةُ وَأَنَا قَدْ سَمِعْتُهُ تَصْدِيقًا لِحُذَيْفَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14932,
                "hadithNumber": "7371",
                "englishNarrator": "\"Hudhaifah رضی اللہ عنہ and Abu Ma'sud met' and Hudaifah said:",
                "hadithEnglish": "'I am more knowledgeable bout what the Dhajjal will have with him. He will have a river of water and a river of fire, but that which you think is water is fire. Whoever among you sees that and wants the water , let him drink from that which he thinks is fire, for he will find it to be water.'\"\r\nAbu Masud رضی اللہ عنہ said: \"This is what I heard the Messenger of Allah (ﷺ) say.\"",
                "hadithUrdu": "دجال کے ہمراہ جو کچھ ہو گا اس مجھے خود اس کی نسبت زیادہ علم ہے اس کے ہمراہ ایک دریا پانی کا ہو گا اور ایک دریا آگ کا ہوگا ، جوتمھیں نظرآئے گا ۔ کہ وہ آگ ہے وہ پانی ہو گا اور جو تمھیں نظر آئے گا کہ وہ پانی ہے وہ آگ ہو گی ۔ تم میں سے جو شخص اس کو پائے اور پانی پینا چاہے وہ اس دریا سے پیے جو اسے نظر آتا ہے کہ وہ آگ ہے ۔ بلاشبہ وہ اسے پانی پائے گا ۔\r\n حضرت ابو مسعود رضی اللہ عنہ نے کہا : میں نے بھی نبی صلی اللہ علیہ وسلم کو اسی طرح فرماتے ہوئے سناتھا ۔",
                "urduNarrator": "ہم سے علی بن حجر السعدی اور اسحاق بن ابراہیم نے بیان کیا اور قول ابن حجر کا ہے۔ اسحاق نے کہا: انہوں نے ہمیں خبر دی، اور ابن حجر نے کہا: ہم سے جریر نے مغیرہ کی سند سے بیان کیا, نعیم بن ابی ہند نے ربعی حراش سے روایت کی کہا ,  انہوں نے کہا: حذیفہ اور ابو مسعود کی ملاقات ہوئی، اور حذیفہ نے کہا",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ وَاللَّفْظُ لِابْنِ حُجْرٍ قَالَ إِسْحَقُ أَخْبَرَنَا و قَالَ ابْنُ حُجْرٍ حَدَّثَنَا جَرِيرٌ عَنْ الْمُغِيرَةِ عَنْ نُعَيْمِ بْنِ أَبِي هِنْدٍ عَنْ رِبْعِيِّ بْنِ حِرَاشٍ قَالَ اجْتَمَعَ حُذَيْفَةُ وَأَبُو مَسْعُودٍ فَقَالَ حُذَيْفَةُ لَأَنَا بِمَا مَعَ الدَّجَّالِ أَعْلَمُ مِنْهُ إِنَّ مَعَهُ نَهْرًا مِنْ مَاءٍ وَنَهْرًا مِنْ نَارٍ فَأَمَّا الَّذِي تَرَوْنَ أَنَّهُ نَارٌ مَاءٌ وَأَمَّا الَّذِي تَرَوْنَ أَنَّهُ مَاءٌ نَارٌ فَمَنْ أَدْرَكَ ذَلِكَ مِنْكُمْ فَأَرَادَ الْمَاءَ فَلْيَشْرَبْ مِنْ الَّذِي يَرَاهُ أَنَّهُ نَارٌ فَإِنَّهُ سَيَجِدُهُ مَاءً قَالَ أَبُو مَسْعُودٍ هَكَذَا سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14933,
                "hadithNumber": "7372",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: May I not inform you about the Dajjal what no Apostle of Allah narrated to his people? He would be blind and he would bring along with him an Image of Paradise and Hell-Fire and what he would call as Paradise that would be Hell-Fire and I warn you as Noah warned his people.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کیا میں تمھیں دجال کے متعلق ایسی بات نہ بتاؤں جو کسی نبی نے اپنی امت کو نہیں بتائی ۔ وہ یقینی طور پر کانا ہو گا ۔ اس کے ساتھ جنت اور جہنم کے مانند ( وہ جگہیں سامنے ) آئیں گی ۔ جس کے بارے میں وہ ہے ۔ کہ جنت ہے وہ ( اصل میں ) جہنم ہوگی ۔ میں نے اسی طرح تمھیں اس سے خبر دار کر دیا ہے ۔ جس طرح حضرت نوح علیہ السلام نے اس کے بارے میں اپنی قوم کو خبردار کیاتھا ۔",
                "urduNarrator": "مجھ سے محمد بن رافع نے بیان کیا، ہم سے حسین بن محمد نے بیان کیا، ہم سے شیبان نے بیان کیا، یحییٰ کی سند سے, ابو سلمہ سے روایت ہے انھوں نے کہا : میں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا ، انھوں نے کہا : کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا حُسَيْنُ بْنُ مُحَمَّدٍ حَدَّثَنَا شَيْبَانُ عَنْ يَحْيَى عَنْ أَبِي سَلَمَةَ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا أُخْبِرُكُمْ عَنْ الدَّجَّالِ حَدِيثًا مَا حَدَّثَهُ نَبِيٌّ قَوْمَهُ إِنَّهُ أَعْوَرُ وَإِنَّهُ يَجِيءُ مَعَهُ مِثْلُ الْجَنَّةِ وَالنَّارِ فَالَّتِي يَقُولُ إِنَّهَا الْجَنَّةُ هِيَ النَّارُ وَإِنِّي أَنْذَرْتُكُمْ بِهِ كَمَا أَنْذَرَ بِهِ نُوحٌ قَوْمَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14934,
                "hadithNumber": "7373",
                "englishNarrator": "An-Nawwas bin Sam`an رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) made a mention of the Dajjal one day in the morning. He ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sometimes described him to be insignificant and sometimes described (his turmoil) as very significant (and we felt) as if he were in the cluster of the date-palm trees. When we went to him (to the Holy Prophet) in the evening and he read (the signs of fear) in our faces, he ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: What is the matter with you? We said: Allah's Messenger, you made a mention of the Dajjal in the morning (sometimes describing him) to be insignificant and sometimes very important, until we began to think as if he were present in some (near) part of the cluster of the date-palm trees. Thereupon he ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: I harbor fear in regard to you in so many other things besides the Dajjal. If he comes forth while I am among you, I shall contend with him on your behalf, but if he comes forth while I am not amongst you, a man must contend on his own behalf and Allah would take care of every Muslim on my behalf (and safeguard him against his evil). He (Dajjal) would be a young man with twisted, contracted hair, and a blind eye. I compare him to `Abd-ul-`Uzza b. Qatan. He who amongst you would survive to see him should recite over him the opening verses of Sura Kahf (xviii). He would appear on the way between Syria and Iraq and would spread mischief right and left. O servant of Allah! adhere (to the path of Truth). We said: Allah's Messenger, how long would he stay on the earth? He ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: For forty days, one day like a year and one day like a month and one day like a week and the rest of the days would be like your days. We said: Allah's Messenger, would one day's prayer suffice for the prayers of day equal to one year? Thereupon he ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: No, but you must make an estimate of time (and then observe prayer). We said: Allah's Messenger, how quickly would he walk upon the earth? Thereupon he ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Like cloud driven by the wind. He would come to the people and invite them (to a wrong religion) and they would affirm their faith in him and respond to him. He would then give command to the sky and there would be rainfall upon the earth and it would grow crops. Then in the evening, their pasturing animals would come to them with their humps very high and their udders full of milk and their flanks stretched. He would then come to another people and invite them. But they would reject him and he would go away from them and there would be drought for them and nothing would be left with them in the form of wealth. He would then walk through the waste land and say to it: Bring forth your treasures, and the treasures would come out and collect (themselves) before him like the swarm of bees. He would then call a person brimming with youth and strike him with the sword and cut him into two pieces and (make these pieces lie at a distance which is generally) between the archer and his target. He would then call (that young man) and he will come forward laughing with his face gleaming (with happiness) and it would be at this very time that Allah would send Jesus, son of Mary, and he will descend at the white minaret in the eastern side of Damascus wearing two garments lightly dyed with saffron and placing his hands on the wings of two Angels. When he would lower his head, there would fall beads of perspiration from his head, and when he would raise it up, beads like pearls would scatter from it. Every non-believer who would smell the odor of his self would die and his breath would reach as far as he would be able to see. He would then search for him (Dajjal) until he would catch hold of him at the gate of Ludd and would kill him. Then a people whom Allah had protected would come to Jesus, son of Mary, and he would wipe their faces and would inform them of their ranks in Paradise and it would be under such conditions that Allah would reveal to Jesus these words: I have brought forth from amongst My servants such people against whom none would be able to fight; you take these people safely to Tur. And then Allah would send Gog and Magog and they would swarm down from every slope. The first of them would pass the lake of Tiberias and drink out of it. And when the last of them would pass, he would say: There was once water there. Jesus and his companions would then be besieged here (at Tur, and they would be so much hard pressed) that the head of the ox would be dearer to them than one hundred dinars and Allah's Apostle, Jesus, and his companions would supplicate Allah, Who would send to them insects (which would attack their necks) and in the morning they would perish like one single person. Allah's Apostle, Jesus, and his companions would then come down to the earth and they would not find in the earth as much space as a single span which is not filled with their putrefaction and stench. Allah's Apostle, Jesus, and his companions would then again beseech Allah, Who would send birds whose necks would be like those of Bactrian camels and they would carry them and throw them where God would will. Then Allah would send rain which no house of clay or (the tent of) camels' hairs would keep out and it would wash away the earth until it could appear to be a mirror. Then the earth would be told to bring forth its fruit and restore its blessing and, as a result thereof, there would grow (such a big) pomegranate that a group of persons would be able to eat that, and seek shelter under its skin and milch cow would give so much milk that a whole party would be able to drink it. And the milch camel would give such (a large quantity of) milk that the whole tribe would be able to drink out of that and the milch sheep would give so much milk that the whole family would be able to drink out of that and at that time Allah would send a pleasant wind which would soothe (people) even under their armpits, and would take the life of every Muslim and only the wicked would survive who would commit adultery like asses and the Last Hour would come to them.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ایک صبح دجال کا ذکر کیا ۔ آپ نے اس ( کے ذکر کے دوران ) میں کبھی آواز دھیمی کی کبھی اونچی کی ۔ یہاں تک کہ ہمیں ایسے لگا جیسے وہ کھجوروں کے جھنڈمیں موجود ہے ۔ جب شام کو ہم آپ کے پاس ( دوبارہ ) آئے تو آپ نے ہم میں اس ( شدید تاثر ) کو بھانپ لیا ۔ آپ نے ہم سے پوچھا \" تم لوگوں کو کیا ہواہے؟ \" ہم نے عرض کی اللہ کے کے رسول اللہ صلی اللہ علیہ وسلم !صبح کے وقت آپ نے دجال کا ذکر فرمایاتو آپ کی آوازمیں ( ایسا ) اتارچڑھاؤتھا کہ ہم نے سمجھاکہ وہ کھجوروں کے جھنڈ میں موجود ہے ۔ اس پر آپ صلی اللہ علیہ وسلم نے ارشاد فرمایا : \" مجھے تم لوگوں ( حاضرین ) پر دجال کے علاوہ دیگر ( جہنم کی طرف بلانے والوں ) کا زیادہ خوف ہےاگر وہ نکلتا ہے اور میں تمھارے درمیان موجود ہوں تو تمھاری طرف سے اس کے خلاف ( اس کی تکذیب کے لیے ) دلائل دینے والا میں ہوں گااور اگر وہ نکلا اور میں موجودنہ ہوا تو ہر آدمی اپنی طرف سے حجت قائم کرنے والاخود ہو گا اور اللہ ہر مسلمان پر میرا خلیفہ ( خود نگہبان ) ہوگا ۔ وہ گچھے دار بالوں والاایک جوان شخص ہے اس کی ایک آنکھ بے نور ہے ۔ میں ایک طرح سے اس کو عبد العزیٰ بن قطن سے تشبیہ دیتا ہوں تم میں سے جو اسے پائے تو اس کے سامنے سورہ کہف کی ابتدائی آیات پڑھے وہ عراق اور شام کے درمیان ایک رستے سے نکل کر آئے گا ۔ وہ دائیں طرف بھی تباہی مچانے والا ہو گا اور بائیں طرف بھی ۔ اے اللہ کے بندو!تم ثابت قدم رہنا ۔ \" ہم نے عرض ۔ اللہ کے رسول اللہ صلی اللہ علیہ وسلم !زمین میں اس کی سرعت رفتار کیا ہو گی؟آپ نے فرمایا : \" بادل کی طرح جس کے پیچھے ہوا ہو ۔ وہ ایک قوم کے پاس آئے گا انھیں دعوت دے گا وہ اس پر ایمان لائیں گے اور اس کی باتیں مانیں گے ۔ تو وہ آسمان ( کے بادل ) کو حکم دے گا ۔ وہ بارش برسائے گا اور وہ زمین کو حکم دے گا تو وہ فصلیں اگائےگی ۔ شام کے اوقات میں ان کے جانور ( چراگاہوں سے ) واپس آئیں گے تو ان کے کوہان سب سے زیادہ اونچےاور تھن انتہائی زیادہ بھرے ہوئے اور کوکھیں پھیلی ہوئی ہوں گی ۔ پھر ایک ( اور ) قوم کے پاس آئے گا اور انھیں ( بھی ) دعوت دے گا ۔ وہ اس کی بات ٹھکرادیں گے ۔ وہ انھیں چھوڑ کر چلا جائے گا تووہ قحط کا شکار ہو جائیں گے ۔ ان کے مال مویشی میں سے کوئی چیز ان کےہاتھ میں نہیں ہوگی ۔ وہ ( دجال ) بنجر زمین میں سے گزرے گا تو اس سے کہےگا اپنے خزانے نکال تو اس ( بنجر زمین ) کے خزانے اس طرح ( نکل کر ) اس کے پیچھےلگ جائیں گے ۔ جس طرح شہد کی مکھیوں کی رانیاں ہیں پھر وہ ایک بھر پور جوان کو بلائے گا اور اسے تلوار ۔ مار کر ( یکبارگی ) دوحصوں میں تقسیم کردے گا جیسے نشانہ بنایا جانے والا ہدف ( یکدم ٹکڑے ہوگیا ) ہو ۔ پھر وہ اسے بلائے گا تو وہ ( زندہ ہوکر دیکھتےہوئے چہرے کے ساتھ ہنستا ہوا آئے گا ۔ وہ ( دجال ) اسی عالم میں ہو گا جب اللہ تعالیٰ مسیح بن مریم علیہ السلام کو معبوث فرمادے گا ۔ وہ دمشق کے حصے میں ایک سفید مینار کے قریب دوکیسری کپڑوں میں دوفرشتوں کے کندھوں پر ہاتھ رکھے ہوئے اتریں گے ۔ جب وہ اپنا سر جھکا ئیں گے تو قطرے گریں گے ۔ اور سر اٹھائیں گے تو اس سے چمکتے موتیوں کی طرح پانی کی بوندیں گریں گی ۔ کسی کافر کے لیے جو آپ کی سانس کی خوشبو پائے گا مرنے کے سوا کوئی چارہ نہیں ہو گا ۔ اس کی سانس ( کی خوشبو ) وہاں تک پہنچے گی جہاں تک ان کی نظر جائے گی ۔ آپ علیہ السلام اسے ڈھونڈیں گے تو اسے لُد ( Lyudia ) کےدروازے پر پائیں گے اور اسے قتل کر دیں گے ۔ پھر عیسیٰ بن مریم علیہ السلام کے پاس وہ لوگ آئیں گے جنھیں اللہ نے اس ( دجال کےدام میں آنے ) سے محفوظ رکھا ہو گاتووہ اپنے ہاتھ ان کے چہروں پر پھیریں گے ۔ اور انھیں جنت میں ان کے درجات کی خبردیں گے ۔ وہ اسی عالم میں ہوں گے کہ اللہ تعالیٰ عیسیٰ علیہ السلام کی طرف وحی فرمائےگا میں نے اپنے ( پیدا کیے ہوئے ) بندوں کو باہر نکال دیا ہے ان سے جنگ کرنے کی طاقت کسی میں نہیں ۔ آپ میری بندگی کرنے والوں کو اکٹھا کر کے طور کی طرف لے جائیں اور اللہ یاجوج ماجوج کو بھیج دے گا ، وہ ہر اونچی جگہ سے امڈتے ہوئے آئیں گے ۔ ان کے پہلے لوگ ( میٹھے پانی کی بہت بڑی جھیل ) بحیرہ طبریہ سے گزریں گے اور اس میں جو ( پانی ) ہوگا اسے پی جائیں گے پھر آخری لوگ گزریں گے تو کہیں گے ۔ \" کبھی اس ( بحیرہ ) میں ( بھی ) پانی ہوگا ۔ اللہ کے نبی حضرت عیسیٰ علیہ السلام اور ان کے ساتھی محصورہوکر رہ جائیں گے ۔ حتیٰ کہ ان میں سے کسی ایک کے لیے بیل کا سراس سے بہتر ( قیمتی ) ہوگا جتنےآج تمھارے لیے سودینارہیں ۔ اللہ کے نبی عیسیٰ علیہ السلام اور ان کے ساتھی گڑ گڑاکر دعائیں کریں گے تو اللہ تعالیٰ ان ( یاجوج ماجوج ) پر ان کی گردنوں میں کپڑوں کا عذاب نازل کر دے گا تو وہ ایک انسان کے مرنے کی طرح ( یکبارگی ) اس کا شکار ہوجائیں گے ۔ پھر اللہ کے نبی عیسیٰ علیہ السلام اور ان کے ساتھی اترکر ( میدانی ) زمین پر آئیں گے تو انھیں زمین میں بالشت بھر بھی جگہ نہیں ملے گی ۔ جوان کی گندگی اور بد بو سے بھری ہوئی نہ ہو ۔ اس پرحضرت عیسیٰ علیہ السلام اور ان کے ساتھی اللہ کے سامنے گڑگڑائیں گے تو اللہ تعالیٰ بختی اونٹوں کے جیسی لمبی گردنوں کی طرح ( کی گردنوں والے ) پرندے بھیجے گا جو انھیں اٹھائیں گے اور جہاں اللہ چاہے گا جاپھینکیں گے ۔ پھر اللہ تعالیٰ ایسی بارش بھیجے گا جس سے کو ئی گھر اینٹوں کا ہو یا اون کا ( خیمہ ) اوٹ مہیا نہیں کر سکے گا ۔ وہ زمین کو دھوکر شیشےکی طرح ( صاف ) کر چھوڑےگی ۔ پھر زمین سے کہاجائے گا ۔ اپنے پھل اگاؤاوراپنی برکت لوٹالاؤ تو اس وقت ایک انار کو پوری جماعت کھائےگی اور اس کے چھلکے سے سایہ حاصل کرے گی اور دودھ میں ( اتنی ) برکت ڈالی جائے گی کہ اونٹنی کا ایک دفعہ کا دودھ لوگوں کی ایک بڑی جماعت کو کافی ہو گا اور گائے کاایک دفعہ کا دودھ لوگوں کے قبیلےکو کافی ہو گا اور بکری کا ایک دفعہ کا دودھ قبیلے کی ایک شاخ کو کافی ہوگا ۔ وہ اسی عالم میں رہ رہے ہوں گے ۔ کہ اللہ تعالیٰ ایک عمدہ ہوا بھیجے گا وہ لوگوں کو ان کی بغلوں کے نیچے سے پکڑے گی ۔ اور ہر مومن اور ہر مسلمان کی روح قبض کر لے گی اور بد ترین لوگ باقی رہ جائیں گے وہ وہ گدھوں کی طرح ( برسرعام ) آپس میں اختلاط کریں گےتو انھی پر قیامت قائم ہوگی ۔ \"",
                "urduNarrator": "ابو خیثمہ زہیر بن حرب اور محمد بن مہران رازی نے مجھے حدیث بیان کی ۔ الفاظ رازی کے ہیں ۔ کہا : ہمیں ولید بن مسلم نے حدیث بیان کی ، انھوں نے کہا : ہمیں عبد الرحمٰن بن یزید بن جابر نے یحییٰ بن جابرقاضی حمص سے انھوں نے عبدالرحمٰن بن جبیر بن نفیر ہے ۔ انھوں نےاپنے والد جبیر بن نفیرسے اور انھوں نے حضرت نواس بن سمعان رضی اللہ عنہ سے روایت کی ، انھوں نے کہا : کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو خَيْثَمَةَ زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ يَزِيدَ بْنِ جَابِرٍ حَدَّثَنِي يَحْيَى بْنُ جَابِرٍ الطَّائِيُّ قَاضِي حِمْصَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ جُبَيْرٍ عَنْ أَبِيهِ جُبَيْرِ بْنِ نُفَيْرٍ الْحَضْرَمِيِّ أَنَّهُ سَمِعَ النَّوَّاسَ بْنَ سَمْعَانَ الْكِلَابِيَّ ح و حَدَّثَنِي مُحَمَّدُ بْنُ مِهْرَانَ الرَّازِيُّ وَاللَّفْظُ لَهُ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ يَزِيدَ بْنِ جَابِرٍ عَنْ يَحْيَى بْنِ جَابِرٍ الطَّائِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ أَبِيهِ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ النَّوَّاسِ بْنِ سَمْعَانَ قَالَ ذَكَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الدَّجَّالَ ذَاتَ غَدَاةٍ فَخَفَّضَ فِيهِ وَرَفَّعَ حَتَّى ظَنَنَّاهُ فِي طَائِفَةِ النَّخْلِ فَلَمَّا رُحْنَا إِلَيْهِ عَرَفَ ذَلِكَ فِينَا فَقَالَ مَا شَأْنُكُمْ قُلْنَا يَا رَسُولَ اللَّهِ ذَكَرْتَ الدَّجَّالَ غَدَاةً فَخَفَّضْتَ فِيهِ وَرَفَّعْتَ حَتَّى ظَنَنَّاهُ فِي طَائِفَةِ النَّخْلِ فَقَالَ غَيْرُ الدَّجَّالِ أَخْوَفُنِي عَلَيْكُمْ إِنْ يَخْرُجْ وَأَنَا فِيكُمْ فَأَنَا حَجِيجُهُ دُونَكُمْ وَإِنْ يَخْرُجْ وَلَسْتُ فِيكُمْ فَامْرُؤٌ حَجِيجُ نَفْسِهِ وَاللَّهُ خَلِيفَتِي عَلَى كُلِّ مُسْلِمٍ إِنَّهُ شَابٌّ قَطَطٌ عَيْنُهُ طَافِئَةٌ كَأَنِّي أُشَبِّهُهُ بِعَبْدِ الْعُزَّى بْنِ قَطَنٍ فَمَنْ أَدْرَكَهُ مِنْكُمْ فَلْيَقْرَأْ عَلَيْهِ فَوَاتِحَ سُورَةِ الْكَهْفِ إِنَّهُ خَارِجٌ خَلَّةً بَيْنَ الشَّأْمِ وَالْعِرَاقِ فَعَاثَ يَمِينًا وَعَاثَ شِمَالًا يَا عِبَادَ اللَّهِ فَاثْبُتُوا قُلْنَا يَا رَسُولَ اللَّهِ وَمَا لَبْثُهُ فِي الْأَرْضِ قَالَ أَرْبَعُونَ يَوْمًا يَوْمٌ كَسَنَةٍ وَيَوْمٌ كَشَهْرٍ وَيَوْمٌ كَجُمُعَةٍ وَسَائِرُ أَيَّامِهِ كَأَيَّامِكُمْ قُلْنَا يَا رَسُولَ اللَّهِ فَذَلِكَ الْيَوْمُ الَّذِي كَسَنَةٍ أَتَكْفِينَا فِيهِ صَلَاةُ يَوْمٍ قَالَ لَا اقْدُرُوا لَهُ قَدْرَهُ قُلْنَا يَا رَسُولَ اللَّهِ وَمَا إِسْرَاعُهُ فِي الْأَرْضِ قَالَ كَالْغَيْثِ اسْتَدْبَرَتْهُ الرِّيحُ فَيَأْتِي عَلَى الْقَوْمِ فَيَدْعُوهُمْ فَيُؤْمِنُونَ بِهِ وَيَسْتَجِيبُونَ لَهُ فَيَأْمُرُ السَّمَاءَ فَتُمْطِرُ وَالْأَرْضَ فَتُنْبِتُ فَتَرُوحُ عَلَيْهِمْ سَارِحَتُهُمْ أَطْوَلَ مَا كَانَتْ ذُرًا وَأَسْبَغَهُ ضُرُوعًا وَأَمَدَّهُ خَوَاصِرَ ثُمَّ يَأْتِي الْقَوْمَ فَيَدْعُوهُمْ فَيَرُدُّونَ عَلَيْهِ قَوْلَهُ فَيَنْصَرِفُ عَنْهُمْ فَيُصْبِحُونَ مُمْحِلِينَ لَيْسَ بِأَيْدِيهِمْ شَيْءٌ مِنْ أَمْوَالِهِمْ وَيَمُرُّ بِالْخَرِبَةِ فَيَقُولُ لَهَا أَخْرِجِي كُنُوزَكِ فَتَتْبَعُهُ كُنُوزُهَا كَيَعَاسِيبِ النَّحْلِ ثُمَّ يَدْعُو رَجُلًا مُمْتَلِئًا شَبَابًا فَيَضْرِبُهُ بِالسَّيْفِ فَيَقْطَعُهُ جَزْلَتَيْنِ رَمْيَةَ الْغَرَضِ ثُمَّ يَدْعُوهُ فَيُقْبِلُ وَيَتَهَلَّلُ وَجْهُهُ يَضْحَكُ فَبَيْنَمَا هُوَ كَذَلِكَ إِذْ بَعَثَ اللَّهُ الْمَسِيحَ ابْنَ مَرْيَمَ فَيَنْزِلُ عِنْدَ الْمَنَارَةِ الْبَيْضَاءِ شَرْقِيَّ دِمَشْقَ بَيْنَ مَهْرُودَتَيْنِ وَاضِعًا كَفَّيْهِ عَلَى أَجْنِحَةِ مَلَكَيْنِ إِذَا طَأْطَأَ رَأْسَهُ قَطَرَ وَإِذَا رَفَعَهُ تَحَدَّرَ مِنْهُ جُمَانٌ كَاللُّؤْلُؤِ فَلَا يَحِلُّ لِكَافِرٍ يَجِدُ رِيحَ نَفَسِهِ إِلَّا مَاتَ وَنَفَسُهُ يَنْتَهِي حَيْثُ يَنْتَهِي طَرْفُهُ فَيَطْلُبُهُ حَتَّى يُدْرِكَهُ بِبَابِ لُدٍّ فَيَقْتُلُهُ ثُمَّ يَأْتِي عِيسَى ابْنَ مَرْيَمَ قَوْمٌ قَدْ عَصَمَهُمْ اللَّهُ مِنْهُ فَيَمْسَحُ عَنْ وُجُوهِهِمْ وَيُحَدِّثُهُمْ بِدَرَجَاتِهِمْ فِي الْجَنَّةِ فَبَيْنَمَا هُوَ كَذَلِكَ إِذْ أَوْحَى اللَّهُ إِلَى عِيسَى إِنِّي قَدْ أَخْرَجْتُ عِبَادًا لِي لَا يَدَانِ لِأَحَدٍ بِقِتَالِهِمْ فَحَرِّزْ عِبَادِي إِلَى الطُّورِ وَيَبْعَثُ اللَّهُ يَأْجُوجَ وَمَأْجُوجَ وَهُمْ مِنْ كُلِّ حَدَبٍ يَنْسِلُونَ فَيَمُرُّ أَوَائِلُهُمْ عَلَى بُحَيْرَةِ طَبَرِيَّةَ فَيَشْرَبُونَ مَا فِيهَا وَيَمُرُّ آخِرُهُمْ فَيَقُولُونَ لَقَدْ كَانَ بِهَذِهِ مَرَّةً مَاءٌ وَيُحْصَرُ نَبِيُّ اللَّهِ عِيسَى وَأَصْحَابُهُ حَتَّى يَكُونَ رَأْسُ الثَّوْرِ لِأَحَدِهِمْ خَيْرًا مِنْ مِائَةِ دِينَارٍ لِأَحَدِكُمْ الْيَوْمَ فَيَرْغَبُ نَبِيُّ اللَّهِ عِيسَى وَأَصْحَابُهُ فَيُرْسِلُ اللَّهُ عَلَيْهِمْ النَّغَفَ فِي رِقَابِهِمْ فَيُصْبِحُونَ فَرْسَى كَمَوْتِ نَفْسٍ وَاحِدَةٍ ثُمَّ يَهْبِطُ نَبِيُّ اللَّهِ عِيسَى وَأَصْحَابُهُ إِلَى الْأَرْضِ فَلَا يَجِدُونَ فِي الْأَرْضِ مَوْضِعَ شِبْرٍ إِلَّا مَلَأَهُ زَهَمُهُمْ وَنَتْنُهُمْ فَيَرْغَبُ نَبِيُّ اللَّهِ عِيسَى وَأَصْحَابُهُ إِلَى اللَّهِ فَيُرْسِلُ اللَّهُ طَيْرًا كَأَعْنَاقِ الْبُخْتِ فَتَحْمِلُهُمْ فَتَطْرَحُهُمْ حَيْثُ شَاءَ اللَّهُ ثُمَّ يُرْسِلُ اللَّهُ مَطَرًا لَا يَكُنُّ مِنْهُ بَيْتُ مَدَرٍ وَلَا وَبَرٍ فَيَغْسِلُ الْأَرْضَ حَتَّى يَتْرُكَهَا كَالزَّلَفَةِ ثُمَّ يُقَالُ لِلْأَرْضِ أَنْبِتِي ثَمَرَتَكِ وَرُدِّي بَرَكَتَكِ فَيَوْمَئِذٍ تَأْكُلُ الْعِصَابَةُ مِنْ الرُّمَّانَةِ وَيَسْتَظِلُّونَ بِقِحْفِهَا وَيُبَارَكُ فِي الرِّسْلِ حَتَّى أَنَّ اللِّقْحَةَ مِنْ الْإِبِلِ لَتَكْفِي الْفِئَامَ مِنْ النَّاسِ وَاللِّقْحَةَ مِنْ الْبَقَرِ لَتَكْفِي الْقَبِيلَةَ مِنْ النَّاسِ وَاللِّقْحَةَ مِنْ الْغَنَمِ لَتَكْفِي الْفَخِذَ مِنْ النَّاسِ فَبَيْنَمَا هُمْ كَذَلِكَ إِذْ بَعَثَ اللَّهُ رِيحًا طَيِّبَةً فَتَأْخُذُهُمْ تَحْتَ آبَاطِهِمْ فَتَقْبِضُ رُوحَ كُلِّ مُؤْمِنٍ وَكُلِّ مُسْلِمٍ وَيَبْقَى شِرَارُ النَّاسِ يَتَهَارَجُونَ فِيهَا تَهَارُجَ الْحُمُرِ فَعَلَيْهِمْ تَقُومُ السَّاعَةُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14935,
                "hadithNumber": "7374",
                "englishNarrator": "This hadith has been narrated on the authority of Abdur Rahman bin Yazid binJabir with the same chain of transmitters but with this addition:",
                "hadithEnglish": "Gog and Magog would walk until they would reach the mountain of al-Khamar and it is a mountain of Bait-ul-Maqdis and they would say: We have killed those who are upon the earth. Let us now kill those who are In the sky and they would throw their arrows towards the sky and the arrows would return to them besmeared with blood. And in the narration of Ibn Hujr (the words are): I have sent such persons (Gog and Magog) that none would dare fight against them.",
                "hadithUrdu": "وہ جبل خمرتک پہنچیں گےاور وہ بیت المقدس کا پہاڑ ہے تو جو کوئی بھی زمین میں تھا ہم نے اسے قتل کردیا آؤ!اب اسے قتل کریں جو آسمان میں ہے پھر وہ اپنے تیروں ( جیسے ہتھیاروں ) کو آسمان کی طرف چاہیں گے ۔ تو اللہ تعالیٰ ان کے ہتھیاروں کو خون آلود کرکے انھی کی طرف واپس بھیج دے گا ۔ اور ابن حجر کی روایت میں ہے \" میں نے اپنے ( پیدا کیے ہوئے ) بندوں کو اتاراہے کسی ایک کے پاس بھی ان سے جنگ کرنے کی طاقت نہیں ۔ \"",
                "urduNarrator": "علی بن حجر سعدی نے ہمیں حدیث بیان کی کہا , ہمیں عبد اللہ بن عبد الرحمٰن بن یزید بن جابر اور ولید بن مسلم نے حدیث بیان کی ( علی ) ابن حجر نے کہا : ایک کی حدیث دوسرے کی حدیث میں شامل ہو گئی ہے ۔ انھوں نے عبد الرحمن بن یزید بن جابر سے اسی کی سندکے ساتھ جس طرح ہم نے ذکر کیااسی کے مطابق بیان کیا ۔ اور اس جملے کے بعد \" اس میں کبھی پانی تھا \" مزید بیان کیا \" پھر وہ ( آگے ) چلیں گے ) یہاں تک کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ بْنِ جَابِرٍ وَالْوَلِيدُ بْنُ مُسْلِمٍ قَالَ ابْنُ حُجْرٍ دَخَلَ حَدِيثُ أَحَدِهِمَا فِي حَدِيثِ الْآخَرِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ بْنِ جَابِرٍ بِهَذَا الْإِسْنَادِ نَحْوَ مَا ذَكَرْنَا وَزَادَ بَعْدَ قَوْلِهِ لَقَدْ كَانَ بِهَذِهِ مَرَّةً مَاءٌ ثُمَّ يَسِيرُونَ حَتَّى يَنْتَهُوا إِلَى جَبَلِ الْخَمَرِ وَهُوَ جَبَلُ بَيْتِ الْمَقْدِسِ فَيَقُولُونَ لَقَدْ قَتَلْنَا مَنْ فِي الْأَرْضِ هَلُمَّ فَلْنَقْتُلْ مَنْ فِي السَّمَاءِ فَيَرْمُونَ بِنُشَّابِهِمْ إِلَى السَّمَاءِ فَيَرُدُّ اللَّهُ عَلَيْهِمْ نُشَّابَهُمْ مَخْضُوبَةً دَمًا وَفِي رِوَايَةِ ابْنِ حُجْرٍ فَإِنِّي قَدْ أَنْزَلْتُ عِبَادًا لِي لَا يَدَيْ لِأَحَدٍ بِقِتَالِهِمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14936,
                "hadithNumber": "7375",
                "englishNarrator": "Abu Sa'id al-Khudri رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) one day gave a detailed account of the Dajjal and in that it was also included: He would come but would not be allowed to enter the mountain passes to Medina. So he will alight at some of the barren tracts near Medina, and a person who would be the best of men or one from amongst the best of men would say to him: I bear testimony to the fact that you are Dajjal about whom Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had informed us. The Dajjal would say: What is your opinion if I kill this (person), then I bring him back to life; even then will you harbour doubt in this matter? They would say: No. He would then kill (the man) and then bring him back to life. When he would bring that person to life, he would say: By Allah, I had no better proof of the fact (that you are a Dajjal) than at the present time (that you are actually so). The Dajjal would then make an attempt to kill him (again) but he would not be able to do that.",
                "hadithUrdu": "ایک دن رسول اللہ صلی اللہ علیہ وسلم نے ہمارے ساتھ دجال کے بارے میں لمبی گفتگو فرمائی ۔ اس میں آپ نے ہمارے سامنے جو بیان کیا اس میں ( یہ بھی ) تھا کہ آپ نے فرمایا : \" وہ آئے گا اس پرمدینہ کے راستے حرام کردیےگئے ہوں گے ۔ وہ مدینہ سے متصل ایک نرم شوریلی زمین تک پہنچے گا اس کے پاس ایک آدمی ( مدینہ سے ) نکل کر جائے گا ۔ جولوگوں میں سے بہترین یا بہترین لوگوں میں سے ایک ہو گا اور اس سے کہے گا ۔ میں گواہی دیتا ہوں کہ تو وہی دجال ہے جس کے بارے میں رسول اللہ صلی اللہ علیہ وسلم نے اپنی گفتگو میں ہمیں بتایا تھا ۔ تودجال ( اپنے ساتھ موجود لوگوں سے ) کہے ) گا تم لوگوں کا کیا خیال ہے کہ اگر میں اس شخص کو قتل کردوں اور پھر اسے زندہ کردوں تو کیا اس معاملے میں تمھیں کوئی شک ( باقی ) رہے گا؟وہ کہیں گے نہیں ۔ وہ اس شخص کو قتل کرے گا اور دوبارہ زندہ کردے گا ۔ جب وہ اس شخص کو زندہ کرے گاتو وہ اس سے کہے گا ۔ اللہ کی قسم!تمھارے بارے میں مجھے اب سے پہلے اس سے زیادہ بصیرت کبھی حاصل نہیں تھی ۔ فرمایا : دجال اسے قتل کرنا چاہے گا لیکن اسے اس شخص پر تسلط حاصل نہیں ہو سکے گا ۔",
                "urduNarrator": "مجھ سے عمرو ناقد، حسن الحلوانی اور عبد بن حمید نے بیان کیا اور ان کا قول بھی اسی طرح ہے۔ سیاق عبد سے ہے، انہوں نے کہا: اس نے مجھ سے بیان کیا۔ باقی دونوں نے کہا: یعقوب نے جو ابراہیم بن سعد کے بیٹے ہیں، ہم سے بیان کیا:صالح نے ابن شہاب سے روایت کی کہا : مجھے عبید اللہ بن عبداللہ بن عتبہ نے بتایا کہ حضرت ابو سعید خدری رضی اللہ عنہ نے کہا",
                "hadithArabic": "حَدَّثَنِي عَمْرٌو النَّاقِدُ وَالْحَسَنُ الْحُلْوَانِيُّ وَعَبْدُ بْنُ حُمَيْدٍ وَأَلْفَاظُهُمْ مُتَقَارِبَةٌ وَالسِّيَاقُ لِعَبْدٍ قَالَ حَدَّثَنِي و قَالَ الْآخَرَانِ حَدَّثَنَا يَعْقُوبُ وَهُوَ ابْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنَا أَبِي عَنْ صَالِحٍ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ قَالَ حَدَّثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا حَدِيثًا طَوِيلًا عَنْ الدَّجَّالِ فَكَانَ فِيمَا حَدَّثَنَا قَالَ يَأْتِي وَهُوَ مُحَرَّمٌ عَلَيْهِ أَنْ يَدْخُلَ نِقَابَ الْمَدِينَةِ فَيَنْتَهِي إِلَى بَعْضِ السِّبَاخِ الَّتِي تَلِي الْمَدِينَةَ فَيَخْرُجُ إِلَيْهِ يَوْمَئِذٍ رَجُلٌ هُوَ خَيْرُ النَّاسِ أَوْ مِنْ خَيْرِ النَّاسِ فَيَقُولُ لَهُ أَشْهَدُ أَنَّكَ الدَّجَّالُ الَّذِي حَدَّثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدِيثَهُ فَيَقُولُ الدَّجَّالُ أَرَأَيْتُمْ إِنْ قَتَلْتُ هَذَا ثُمَّ أَحْيَيْتُهُ أَتَشُكُّونَ فِي الْأَمْرِ فَيَقُولُونَ لَا قَالَ فَيَقْتُلُهُ ثُمَّ يُحْيِيهِ فَيَقُولُ حِينَ يُحْيِيهِ وَاللَّهِ مَا كُنْتُ فِيكَ قَطُّ أَشَدَّ بَصِيرَةً مِنِّي الْآنَ قَالَ فَيُرِيدُ الدَّجَّالُ أَنْ يَقْتُلَهُ فَلَا يُسَلَّطُ عَلَيْهِ.",
                "headingArabic": "فِي صِفَةِ الدَّجَّالِ وَتَحْرِيمِ الْمَدِينَةِ عَلَيْهِ وَقَتْلِهِ الْمُؤْمِنَ وَإِحْيَائِهِ",
                "headingUrdu": "دجال کی تفصیل اس پر مدینہ حرام ہے۔ وہ ایک مومن کو مار ڈالے گا اور اسے دوبارہ زندہ کرے گا۔",
                "headingEnglish": "Description Of Ad-Dajjal; Al-Madinah Is Forbidden To Him; He Will Kill A Believer And Bring Him Back To Life",
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14937,
                "hadithNumber": "7376",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated by Zuhri with the same chain of transmitters.",
                "hadithUrdu": "ابو اسحاق نے کہا: کہا جاتا ہے کہ یہ شخص خضر علیہ السلام ہے, مجھ سے عبداللہ بن عبدالرحمٰن الدارمی نے بیان کیا، ہم سے ابو الایمان نے بیان کیا, شعیب نے زہری سے اسی سند کے ساتھ اسی کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "قَالَ أَبُو إِسْحَقَ يُقَالُ إِنَّ هَذَا الرَّجُلَ هُوَ الْخَضِرُ عَلَيْهِ السَّلَام و حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ أَخْبَرَنَا أَبُو الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ فِي هَذَا الْإِسْنَادِ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14938,
                "hadithNumber": "7377",
                "englishNarrator": "Abu Sa'id al-Khudri رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: The Dajjal would come forth and a person from amongst the believers would go towards him and the armed men of the Dajjal would meet him and they would say to him: Where do you intend to go? He would say: I intend to go to this one who is coming forth. They would say to him: Don't you believe in our Lord? He would say: There is nothing hidden about our Lord. They would say: Kill him. Then some amongst them would say: Has your master (Dajjal) not forbidden you to kill anyone without (his consent)? And so they would take him to the Dajjal and when the believer would see him, he would say: O people. he is the Dajjil about whom Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) has informed (us). The Dajjal would then order for breaking his head and utter (these words): Catch hold of him and break his head. He would be struck even on his back and on his stomach. Then the Dajjal would ask him: Don't you believe in me? He would say: You are a false Masih. He would then order him to be torn (into pieces) with a saw from the parting of his hair up to his legs. After that the Dajjal would walk between the two pieces. He would then say to him: Stand, and he would stand erect. He would then say to him: Don't you believe in me? And the person would say: It has only added to my insight concerning you (that you are really the Dajjal). He would then say: O people, he would not behave with anyone amongst people (in such a manner) after me. The Dajjal would try to catch hold of him so that he should kill him (again). The space between his neck and collar bone would be turned into copper and he would find no means to kill him. So he would catch hold of him by his hand and feet and throw him (into the air) and the people would think as if he had been thrown in the Hell-Fire whereas he would be thrown in Paradise. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: He would be the most eminent amongst persons in regard to martyrdom in the eye of the Lord of the world.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" دجال نکلےگا تو مومنوں میں سے ایک شخص اس کا رخ کرے گااسے اسلحہ بردارمحافظ یعنی دجال کے اسلحہ بردارمحافظ ملیں گے اور اس سے پوچھیں گے ۔ کہا : جانا چاہتے ہو؟وہ کہے گا ۔ میں اس شخص کی طرف جانا چاہتا ہوں جو ( اب ) نمودار ہوا ہے وہ اس سے کہیں گے ۔ کیا تم ہمارے رب پر ایمان نہیں رکھتے ؟وہ کہے گا ، ہمارے رب ( کی ربوبیت اور صفات ) میں کوئی پوشیدگی نہیں وہ ( اس کی بات پر مطمئن نہ ہوتے ہوئے ) کہیں گے ۔ اس کو قتل کردو ۔ پھر وہ ایک دوسرے سے کہیں گے ۔ کیا ہمارے رب نے ہمیں منع نہیں کیا تھا کہ اس ( کے سامنے پیش کرنے ) سےپہلے کسی کو قتل نہ کرو ۔ وہ اسے دجال کے پاس لے جائیں گے ۔ وہ مومن جب اسے دیکھے گا تو کہے گا لوگو!یہ وہی دجال ہے جس کا ذکر رسول اللہ صلی اللہ علیہ وسلم نے فرمایاتھا ۔ فرمایا : تودجال اس کے بارے میں حکم دے گا تو اس ( کے اعضاء ) کو کھینچ کر باندھ دیا جا ئے گا پھر وہ کہے گا ۔ اسے پکڑواور اس کاسر اور منہ توڑ دو ، تو ( مارمارکر ) اس کا پیٹ اور اس کی کمر چوڑی کردی جائے گی ۔ فرمایا : پھر وہ ( دجال ) کہے گا ۔ کیا تم مجھ پر ایمان نہیں لاؤگے؟فرمایا : \" تو وہ کہے گا تم جھوٹے ( بناوٹی ) مسیح ہو ۔ فرمایا : \" پھر اس کے بارے میں حکم دیا جا ئے گا ۔ تو اس کی پیشانی سے اسے آری کے ساتھ چیرا جائے گا ۔ یہاں تک کے اس کے دونوں پاؤں الگ الگ کر دیے جائیں گے ۔ فرمایا : \" پھر دجال دونوں ٹکڑوں کے درمیان چلے گا ۔ پھر اس سےکہے گا ۔ کھڑے ہوجاؤچنانچہ وہ سید ھا کھڑا ہو جا ئے گا ۔ فرمایا : وہ پھر اس سے کہے گا کیا مجھ پر ایمان لاتے ہو؟وہ کہے گا ۔ ( اس سب کچھ سے ) تمھارے بارے میں میری بصیرت میں اضافے کے سوا اور کچھ نہیں ہوا ۔ فرمایا : پھر وہ شخص کہے گا لوگو!یہ ( دجال ) اب میرے بعد لوگوں میں کسی کے ساتھ ایسا نہیں کر سکے گا ۔ فرمایا : دجال اسے ذبح کرنے کے لیے پکڑے گا تو اس کی گردن سے اس کی ہنسلی کی ہڈیوں تک ( کاحصہ ) تانبے کا بنایا جا ئے گا وہ کسی طریقے سے ( اسے ذبح ) نہ کر سکے گا ۔ فرمایا ۔ تو وہ اس کے دونوں پاؤں اور دونوں ہاتھوں سے پکڑ کراسے پھینکےگا ۔ لوگ سمجھیں گےاس ( دجال ) نے اسے آگ میں پھینک دیا ہے جبکہ ( اصل میں وہ ) جنت میں ڈال دیا جائے گا ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" شہادت میں رب العالمین کے سامنے یہ شخص سب لوگوں سے بڑا ہے ۔",
                "urduNarrator": "مجھ سے محمد بن عبداللہ بن قحزاد نے اہل مرو سے بیان کیا: ہم سے عبداللہ بن عثمان نے ابوحمزہ کی سند سے، قیس بن وہب کی سند سے اور  ابو وداک نے حضرت ابو سعید خدری رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ قُهْزَاذَ مِنْ أَهْلِ مَرْوَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُثْمَانَ عَنْ أَبِي حَمْزَةَ عَنْ قَيْسِ بْنِ وَهْبٍ عَنْ أَبِي الْوَدَّاكِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْرُجُ الدَّجَّالُ فَيَتَوَجَّهُ قِبَلَهُ رَجُلٌ مِنْ الْمُؤْمِنِينَ فَتَلْقَاهُ الْمَسَالِحُ مَسَالِحُ الدَّجَّالِ فَيَقُولُونَ لَهُ أَيْنَ تَعْمِدُ فَيَقُولُ أَعْمِدُ إِلَى هَذَا الَّذِي خَرَجَ قَالَ فَيَقُولُونَ لَهُ أَوَ مَا تُؤْمِنُ بِرَبِّنَا فَيَقُولُ مَا بِرَبِّنَا خَفَاءٌ فَيَقُولُونَ اقْتُلُوهُ فَيَقُولُ بَعْضُهُمْ لِبَعْضٍ أَلَيْسَ قَدْ نَهَاكُمْ رَبُّكُمْ أَنْ تَقْتُلُوا أَحَدًا دُونَهُ قَالَ فَيَنْطَلِقُونَ بِهِ إِلَى الدَّجَّالِ فَإِذَا رَآهُ الْمُؤْمِنُ قَالَ يَا أَيُّهَا النَّاسُ هَذَا الدَّجَّالُ الَّذِي ذَكَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَيَأْمُرُ الدَّجَّالُ بِهِ فَيُشَبَّحُ فَيَقُولُ خُذُوهُ وَشُجُّوهُ فَيُوسَعُ ظَهْرُهُ وَبَطْنُهُ ضَرْبًا قَالَ فَيَقُولُ أَوَ مَا تُؤْمِنُ بِي قَالَ فَيَقُولُ أَنْتَ الْمَسِيحُ الْكَذَّابُ قَالَ فَيُؤْمَرُ بِهِ فَيُؤْشَرُ بِالْمِئْشَارِ مِنْ مَفْرِقِهِ حَتَّى يُفَرَّقَ بَيْنَ رِجْلَيْهِ قَالَ ثُمَّ يَمْشِي الدَّجَّالُ بَيْنَ الْقِطْعَتَيْنِ ثُمَّ يَقُولُ لَهُ قُمْ فَيَسْتَوِي قَائِمًا قَالَ ثُمَّ يَقُولُ لَهُ أَتُؤْمِنُ بِي فَيَقُولُ مَا ازْدَدْتُ فِيكَ إِلَّا بَصِيرَةً قَالَ ثُمَّ يَقُولُ يَا أَيُّهَا النَّاسُ إِنَّهُ لَا يَفْعَلُ بَعْدِي بِأَحَدٍ مِنْ النَّاسِ قَالَ فَيَأْخُذُهُ الدَّجَّالُ لِيَذْبَحَهُ فَيُجْعَلَ مَا بَيْنَ رَقَبَتِهِ إِلَى تَرْقُوَتِهِ نُحَاسًا فَلَا يَسْتَطِيعُ إِلَيْهِ سَبِيلًا قَالَ فَيَأْخُذُ بِيَدَيْهِ وَرِجْلَيْهِ فَيَقْذِفُ بِهِ فَيَحْسِبُ النَّاسُ أَنَّمَا قَذَفَهُ إِلَى النَّارِ وَإِنَّمَا أُلْقِيَ فِي الْجَنَّةِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَذَا أَعْظَمُ النَّاسِ شَهَادَةً عِنْدَ رَبِّ الْعَالَمِينَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 14626,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=585",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=583",
                "label": "583",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=584",
                "label": "584",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=585",
                "label": "585",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=586",
                "label": "586",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=587",
                "label": "587",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=588",
                "label": "588",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=589",
                "label": "589",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=587",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=587",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=585",
        "to": 14650,
        "total": 40465
    }
}