{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 456,
        "data": [
            {
                "id": 11664,
                "hadithNumber": "4100",
                "englishNarrator": "Jabir bin 'Abdullah (رضی اﷲ عنہ) reported:",
                "hadithEnglish": "I went on an expedition with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). He overtook me and I was on a water-carrying camel who had grown tired and did not walk (trot). He (the Holy Prophet) said to me: What is the matter with your camel? I said: It is sick. He (the Holy Prophet) stepped behind and drove it and prayed for it, and then it always moved ahead of other camels. He (then) said: How do you find your camel? I said: It is, by the grace of your prayer, all right. He said: Would you sell this (camel) to me? I felt shy (to say him, No ) as we had no other camel for carrying water, but (later on) I said: Yes, and to I sold it to him on the condition that (I would be permitted) to ride it until I reached Madina. I said to him: Allah's Messenger, I am newly married, so I asked his permission (to go ahead of the caravan). He permitted me, and I reached Medina well in advance of other people, until I reached my destination. There my maternal uncle met me and asked me about the camel, and I told him what I had done with regard to it. He reproved me in this connection. He (Jabir) said: When I asked his permission (to go ahead of the caravan) Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) inquired of me whether I had married a virgin or a non-virgin. I said to him: I have married a non-virgin. He said: Why did you not marry a virgin who would have played with you and you would have played with her? I said to him: Allah's Messenger, my father died (or he fell as a martyr), and I have small sisters to (look after), so I did not like the idea that I should marry a woman who is like them and thus be not able to teach them manners and look after them properly. So I have married a non-virgin so that she should be able to look after them and teach them manners, When Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came to Medina, I went to him in the morning with the camel. He paid me its price and returned that (the camel) to me.",
                "hadithUrdu": "میں نے جہاد کیا رسول اﷲ ﷺ کے ساتھ تو آپ مجھ سے ملے ( راہ میں ) اور میری سواری میں ایک اونٹ تھا پانی کا وہ تھک گیا تھا اور بالکل چل نہ سکتا تھا ۔ آپ نے پوچھا تیرے اونٹ کو کیا ہوا ہے؟ میں نے عرض کیا وہ بیمار ہے ۔ یہ سن کر جناب رسول اﷲ ﷺ پیچھے ہٹے اور اونٹ کو ڈانٹا اور اس کے لیے دعا کی پھر وہ ہمیشہ سب اونٹوں کے آگے ہی چلتا رہا ۔ آپ نے فرمایا اب تیرا اونٹ کیسا ہے؟ میں نے کا اچھا ہے آپ کی دعا کی برکت سے آپ نے فرمایا میرے ہاتھ بیچتا ہے مجھے شرم آئی اور ہمارے پاس او رکوئی اونٹ پانی لانے کے لیے نہ تھا آخر میں نے کہا ہاں بیچتا ہوں پھر میں نے اس اونٹ کو آپ ہاتھ بیچ ڈالا اس شرط سے کہ میں اس پر سواری کروں گا مدینے تک پھر میں نے عرض کیا یا رسول اﷲ ﷺ میں نوشہ ہوں ( یعنی ابھی میرا نکاح ہوا ہے ) مجھے اجازت دیجیے ( لوگوں سے پہلے مدینہ جانے کی ) ۔ آپ نے اجازت دی میں لوگوں سے آگے برھ کر مدینہ آپہنچا وہاں میرے ماموں ملے اور اونٹ کا حال پوچھا ۔ میں نے سب حال بیان کیا ۔ انہوں نے مجھ کو ملامت کی ( کہ ایک ہی اونٹ تھا تیرے پاس اور گھر والے بہت ہیں اس کو بھی تونے بیچ ڈالا اور اس کو یہ معلوم نہ تھا کہ خداوند کریم کو جابرؓ کا فائدہ منظور ہے ) ۔ جابرؓ نے کہاجب میں نے آپ سے اجازت مانگی تو آپ نے فرمایا تونے کنواری سے شادی کی ہے یا نکاحی سے؟ میں نے کہا نکاحی سے ۔ آپ نے فرمایا کنواری سے کیوں نے کی وہ تجھ سے کھیلتی اور تو اس سے کھیلتا؟ میں نے عرض کی یا رسول اﷲ! میرا باپ مرگیا یا شہید ہوگیا میری کئی بہنہیں چھوڑ کر چھوٹی چھوٹی تو مجھے برا معلوم ہوا کہ میں شادی کرکے ایک اور لڑکی لاؤں ان کے برابر جو نہ ان کو ادب سکھائے اور نہ ان کو دبائے ۔ اس لیے میں نے ایک نکاحی سے شادی کی تاکہ ان کو دابے اور تمیز سکھائے ۔ جابرؓ نے کہا پھر جب رسول اﷲ ﷺ مدینہ میں تشریف لائے میں اونٹ صبح ہی لے گیا آپ نے اس کی قیمت مجھ کو دی اور اونٹ بھی پھیر دیا ۔",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ اور اسحاق بن ابراہیم نے بیان کیا - اور یہ لفظ عثمان کے لیے ہے - ہم سے اسحاق نے بیان کیا اور کہا کہ ہم سے عثمان جریر نے بیان کیا مغیرہ کی سند پر، شعبی کی سند پر، جابر بن عبداﷲ رضی اﷲ عنہ سے روایت ہے",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لِعُثْمَانَ - قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ، عُثْمَانُ حَدَّثَنَا جَرِيرٌ، عَنْ مُغِيرَةَ، عَنِ الشَّعْبِيِّ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ غَزَوْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَتَلاَحَقَ بِي وَتَحْتِي نَاضِحٌ لِي قَدْ أَعْيَا وَلاَ يَكَادُ يَسِيرُ قَالَ فَقَالَ لِي ‏ ‏ مَا لِبَعِيرِكَ ‏ ‏ ‏.‏ قَالَ قُلْتُ عَلِيلٌ - قَالَ - فَتَخَلَّفَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَزَجَرَهُ وَدَعَا لَهُ فَمَازَالَ بَيْنَ يَدَىِ الإِبِلِ قُدَّامَهَا يَسِيرُ ‏.‏ قَالَ فَقَالَ لِي ‏ ‏ كَيْفَ تَرَى بَعِيرَكَ ‏ ‏ ‏.‏ قَالَ قُلْتُ بِخَيْرٍ قَدْ أَصَابَتْهُ بَرَكَتُكَ ‏.‏ قَالَ ‏ ‏ أَفَتَبِيعُنِيهِ ‏ ‏ ‏.‏ فَاسْتَحْيَيْتُ وَلَمْ يَكُنْ لَنَا نَاضِحٌ غَيْرُهُ قَالَ فَقُلْتُ نَعَمْ ‏.‏ فَبِعْتُهُ إِيَّاهُ عَلَى أَنَّ لِي فَقَارَ ظَهْرِهِ حَتَّى أَبْلُغَ الْمَدِينَةَ - قَالَ - فَقُلْتُ لَهُ يَا رَسُولَ اللَّهِ إِنِّي عَرُوسٌ فَاسْتَأْذَنْتُهُ فَأَذِنَ لِي فَتَقَدَّمْتُ النَّاسَ إِلَى الْمَدِينَةِ حَتَّى انْتَهَيْتُ فَلَقِيَنِي خَالِي فَسَأَلَنِي عَنِ الْبَعِيرِ فَأَخْبَرْتُهُ بِمَا صَنَعْتُ فِيهِ فَلاَمَنِي فِيهِ - قَالَ - وَقَدْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ لِي حِينَ اسْتَأْذَنْتُهُ ‏ ‏ مَا تَزَوَّجْتَ أَبِكْرًا أَمْ ثَيِّبًا ‏ ‏ ‏.‏ فَقُلْتُ لَهُ تَزَوَّجْتُ ثَيِّبًا ‏.‏ قَالَ ‏ ‏ أَفَلاَ تَزَوَّجْتَ بِكْرًا تُلاَعِبُكَ وَتُلاَعِبُهَا ‏ ‏ ‏.‏ فَقُلْتُ لَهُ يَا رَسُولَ اللَّهِ تُوُفِّيَ وَالِدِي - أَوِ اسْتُشْهِدَ - وَلِي أَخَوَاتٌ صِغَارٌ فَكَرِهْتُ أَنْ أَتَزَوَّجَ إِلَيْهِنَّ مِثْلَهُنَّ فَلاَ تُؤَدِّبُهُنَّ وَلاَ تَقُومُ عَلَيْهِنَّ فَتَزَوَّجْتُ ثَيِّبًا لِتَقُومَ عَلَيْهِنَّ وَتُؤَدِّبَهُنَّ - قَالَ - فَلَمَّا قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ غَدَوْتُ إِلَيْهِ بِالْبَعِيرِ فَأَعْطَانِي ثَمَنَهُ وَرَدَّهُ عَلَىَّ ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11665,
                "hadithNumber": "4101",
                "englishNarrator": "Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "We went from Mecca to Medina with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) when my camel fell ill, and the rest of the hadith is the same. (But it in also narrated in it: ) He (the Holy Prophet) said to me: Sell your camel to me. I said: No, but it is yours. He said: No. (it can't be), but sell it to me. I said: No, but, Allah's Messenger, it is yours. He said: No, it can't be, but sell it to me. I said: Then give me an 'uqaya of gold for I owe that to a person and then it would be yours. He (the Holy Prophet) said: I take it (for an 'uqiya of gold) and you reach Medina on it. As I reached Medina, Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said to Bilal رضی اللہ عنہ : Give him an 'uqiya of gold and make some extra payment too. He (Jabir) said: He gave me an 'uqiya of gold and made an addition of a qirat. He (Jabir) said: The addition made by Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was with me (as a sacred trust for belssing) and lay with me in a pocket until the people of Syria took it on the Day of Harra.",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کی معیت میں مکہ ( کی جانب ) سے مدینہ آئے ، تو میرا اونٹ بیمار ہو گیا ۔ ۔ ۔ اور انہوں نے ( ان سے ) مکمل قصے سمیت حدیث بیان کی ، اس میں ہے : پھر آپ نے مجھ سے فرمایا : \" مجھے اپنا یہ اونٹ فروخت کر دو ۔ \" میں نے کہا : نہیں ، بلکہ وہ ( ویسے ہی ) آپ ہی کا ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" نہیں ، بلکہ وہ مجھے فروخت کر دو ۔ \" میں نے کہا : نہیں ، اے اللہ کے رسول! وہ آپ ہی کا ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" نہیں ، بلکہ اسے میرے یاتھ فروخت کر دو ۔ \" میں نے کہا : ایک آدمی کا میرے ذمے سونے کا ایک اوقیہ ( تقریبا 29 گرام ) ہے ، اس کے عوض یہ آپ کا ہوا ۔ آپ نے فرمایا : \" میں نے لے لیا ، تم اس پر مدینہ تک پہنچ جاؤ ۔ \" کہا : جب میں مدینہ پہنچا ، رسول اللہ صلی اللہ علیہ وسلم نے بلال رضی اللہ عنہ سے فرمایا : \" انہیں ایک اوقیہ سونا اور کچھ زیادہ بھی دو ۔ \" کہا : انہوں نے مجھے ایک اوقیہ سونا دیا اور ایک قیراط زائد دیا ۔ کہا : میں نے ( دل میں ) کہا : رسول اللہ صلی اللہ علیہ وسلم کا یہ زائد عطیہ مجھ سے کبھی الگ نہ ہو گا ۔ کہا : تو وہ میری تھیلی میں رہا حتی کہ حرہ کی جنگ کے دن اہل شام نے اسے ( مجھ سے ) چھین لیا ۔",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ نے بیان کیا، کہا ہم سے جریر نے بیان کیا، الاعمش کی سند سے, سالم بن ابی جعد نے حضرت جابر رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنِ الْأَعْمَشِ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ جَابِرٍ، قَالَ: أَقْبَلْنَا مِنْ مَكَّةَ إِلَى الْمَدِينَةِ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَاعْتَلَّ جَمَلِي، وَسَاقَ الْحَدِيثَ بِقِصَّتِهِ، وَفِيهِ ثُمَّ قَالَ لِي: «بِعْنِي جَمَلَكَ هَذَا»، قَالَ: قُلْتُ: لَا، بَلْ هُوَ لَكَ، قَالَ: «لَا، بَلْ بِعْنِيهِ» قَالَ: قُلْتُ: لَا، بَلْ هُوَ لَكَ يَا رَسُولَ اللهِ، قَالَ: «لَا، بَلْ بِعْنِيهِ»، قَالَ: قُلْتُ: فَإِنَّ لِرَجُلٍ عَلَيَّ أُوقِيَّةَ ذَهَبٍ، فَهُوَ لَكَ بِهَا، قَالَ: «قَدْ أَخَذْتُهُ، فَتَبَلَّغْ عَلَيْهِ إِلَى الْمَدِينَةِ»، قَالَ: فَلَمَّا قَدِمْتُ الْمَدِينَةَ، قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِبِلَالٍ: «أَعْطِهِ أُوقِيَّةً مِنْ ذَهَبٍ وَزِدْهُ»، قَالَ: فَأَعْطَانِي أُوقِيَّةً مِنْ ذَهَبٍ، وَزَادَنِي قِيرَاطًا، قَالَ: فَقُلْتُ: لَا تُفَارِقُنِي زِيَادَةُ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: فَكَانَ فِي كِيسٍ لِي فَأَخَذَهُ أَهْلُ الشَّامِ يَوْمَ الْحَرَّةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11666,
                "hadithNumber": "4102",
                "englishNarrator": "Jabir bin 'Abdullah (رضی اللہ عنہ) reported:",
                "hadithEnglish": "We were with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) in a journey and my camel meant for carrying water lagged behind. The rest of the hadith is the same and it is mentioned also: Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) pricked it and then said to me: Ride in the name of Allah. He constantly made addition (in prayers for me) and went on saying. May Allah forgive you!",
                "hadithUrdu": "ایک سفر میں ہم نبی صلی اللہ علیہ وسلم کے ساتھ تھے ، میرا اونٹ پیچھے رہ گیا ۔ ۔ اور ( پوری ) حدیث بیان کی اور اس میں کہا : رسول اللہ صلی اللہ علیہ وسلم نے اسے کچوکا لگایا ، پھر مجھ سے فرمایا : \" اللہ کا نام لے کر سوار ہو جاؤ ۔ \" اور یہ اضافہ بھی کیا ، کہا : آپ مسلسل مجھے زیادہ کی پیشکش کرتے اور فرماتے رہے : \" اللہ تمہیں معاف فرمائے ۔ \"",
                "urduNarrator": "ہم سے ابو کامل الجہدری نے بیان کیا، کہا ہم سے عبد الواحد بن زیاد نے بیان کیا، کہا ہم سے الجریری نے بیان کیا, ابونضرہ نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، حَدَّثَنَا الْجُرَيْرِيُّ، عَنْ أَبِي نَضْرَةَ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، قَالَ: كُنَّا مَعَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَتَخَلَّفَ نَاضِحِي وَسَاقَ الْحَدِيثَ، وَقَالَ فِيهِ: فَنَخَسَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، ثُمَّ قَالَ لِي: «ارْكَبْ بِاسْمِ اللهِ»، وَزَادَ أَيْضًا قَالَ: فَمَا زَالَ يَزِيدُنِي وَيَقُولُ: «وَاللهُ يَغْفِرُ لَكَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11667,
                "hadithNumber": "4103",
                "englishNarrator": "Jabir ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "My camel had grown tired as Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came to me. He goaded it and it began to jump. After that I tried to restrain its rein so that I could listen to his (Prophet's) words, but I could not do that. Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) met me and said: Sell it to me, and I sold it for five 'uqiyas. I said: On the condition that I may use it as a ride (for going back) to Medina. He (the Holy Prophet) said: Well, you may use it as a ride up till Medina. When I came to Medina I handed over that to him and he made an addition of an uqiya (to that amount which had been agreed upon) and then presented that (camel) to me.",
                "hadithUrdu": "جب نبی صلی اللہ علیہ وسلم میرے پاس آئے اور میرا اونٹ تھک چکا تھا تو آپ نے اسے کچوکا لگایا ، وہ اچھل پڑا ۔ اس کے بعد میں اس کی لگام کھینچتا تاکہ آپ کی بات سنوں لیکن میں اس پر قابو نہ پا رہا تھا ، نبی صلی اللہ علیہ وسلم مجھے ملے تو فرمایا : \" یہ مجھے بیچ دو ۔ \" میں نے وہ ( اونٹ ) آپ کو پانچ اوقیہ ( چاندی جو ایک اوقیہ سونے کے برابر تھی ) کے عوض فروخت کر دیا ۔ میں نے کہا : اس شرط پر کہ مدینہ تک اس کی پیٹھ ( پر سواری ) میرے لیے ہو گی ۔ آپ نے فرمایا : \" مدینہ تک اس کی پیٹھ ( پر سواری ) تمہاری ہو گی ۔ \" کہا : جب میں مدینہ پہنچا ، اس ( اونٹ ) کو آپ کے پاس لایا تو آپ نے مجھے ایک اوقیہ ( طے شدہ قیمت کا چوتھا حصہ ) زائد دیا ، پھر آپ نے مجھے ( اونٹ بھی ) ہبہ کر دیا ۔",
                "urduNarrator": "مجھ سے ابو الربیع العتکی نے بیان کیا، ہم سے حماد نے بیان کیا، ہم سے ایوب نے بیان کیا, ابوزبیر نے حضرت جابر رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي أَبُو الرَّبِيعِ الْعَتَكِيُّ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ: لَمَّا أَتَى عَلَيَّ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَقَدْ أَعْيَا بَعِيرِي، قَالَ: فَنَخَسَهُ، فَوَثَبَ، فَكُنْتُ بَعْدَ ذَلِكَ أَحْبِسُ خِطَامَهُ لِأَسْمَعَ حَدِيثَهُ، فَمَا أَقْدِرُ عَلَيْهِ، فَلَحِقَنِي النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «بِعْنِيهِ»، فَبِعْتُهُ مِنْهُ بِخَمْسِ أَوَاقٍ، قَالَ: قُلْتُ: عَلَى أَنَّ لِي ظَهْرَهُ إِلَى الْمَدِينَةِ، قَالَ: «وَلَكَ ظَهْرُهُ إِلَى الْمَدِينَةِ»، قَالَ: فَلَمَّا قَدِمْتُ الْمَدِينَةَ أَتَيْتُهُ بِهِ، فَزَادَنِي وُقِيَّةً، ثُمَّ وَهَبَهُ لِي.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11668,
                "hadithNumber": "4104",
                "englishNarrator": "Abd Mutawakkil al-Najl reported from Jabir bin 'Abdullah ( رضی اللہ عنہ) who said:",
                "hadithEnglish": "I accompanied Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) in one of his journeys (the narrator says, he said in Jihad), and he narrated the rest of the hadith, and made this addition: He (the Holy Prophet ﷺ) said: Jabir, have you received the price? I said: Yes, whereupon he said: Yours is the price as well as the camel; yours is the price as well as the camel.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک سفر کیا ۔ ۔ میرا خیال ہے کہ انہوں نے جنگی سفر کہا ۔ ۔ اور حدیث بیان کی اور اس میں یہ اضافہ کیا ، آپ صلی اللہ علیہ وسلم نے فرمایا : \" جابر! کیا تم نے پوری قیمت لے لی ہے؟ \" میں نے کہا : جی ہاں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" قیمت بھی تمہاری ، اونٹ بھی تمہارا ، ( پھر فرمایا : ) قیمت بھی تمہاری ، اونٹ بھی تمہارا ۔ \"",
                "urduNarrator": "ہم سے عقبہ بن مکرم العمی نے بیان کیا، کہا ہم سے یعقوب بن اسحاق نے بیان کیا، کہا ہم سے بشیر بن عقبہ نے بیان کیا, ابومتوکل ناجی نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ الْعَمِّيُّ، حَدَّثَنَا يَعْقُوبُ بْنُ إِسْحَاقَ، حَدَّثَنَا بَشِيرُ بْنُ عُقْبَةَ، عَنْ أَبِي الْمُتَوَكِّلِ النَّاجِيِّ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، قَالَ: سَافَرْتُ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي بَعْضِ أَسْفَارِهِ - أَظُنُّهُ قَالَ: غَازِيًا -، وَاقْتَصَّ الْحَدِيثَ، وَزَادَ فِيهِ قَالَ: «يَا جَابِرُ، أَتَوَفَّيْتَ الثَّمَنَ؟» قُلْتُ: نَعَمْ، قَالَ: لَكَ الثَّمَنُ، وَلَكَ الْجَمَلُ، لَكَ الثَّمَنُ، وَلَكَ الْجَمَلُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11669,
                "hadithNumber": "4105",
                "englishNarrator": "Jabir bin 'Abdullah (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bought a camel from me for two 'uqiyas and a dirham or two dirhams. As he reached Sirar (a village near Medina), he commanded a cow to be slaughtered and it was slaughtered, and they ate of that, and as he (the Holy Prophet ﷺ) reached Medina he ordered me to go to the mosque and offer two rak'ahs of prayer, and he measured for me the price of the camel and even made an excess payment to me.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے دو اوقیہ اور ایک یا دو درہموں میں اونٹ خریدا ۔ جب آپ صرار ( کے مقام پر ) آئے تو آپ نے گائے ( ذبح کرنے ) کا حکم دیا ، وہ ذبح کی گئی ، لوگوں نے اسے کھایا ، جب آپ مدینہ تشریف لائے تو آپ نے مجھے حکم دیا کہ میں مسجد آؤں اور دو رکعتیں پڑھوں ۔ آپ نے میرے لیے اونٹ کی قیمت ( کے برابر سونے یا چاندی ) کا وزن کیا اور میرے لیے پلڑا جھکا دیا ۔ فائدہ : قیمت کے حوالے سے حضرت جابر رضی اللہ عنہ سے اس حدیث کے راوی محارب ( بن وثار ) کو وہم ہوا ہے جس طرح اگلی حدیث سے ثابت ہوتا ہے ، وہ اصل قیمت کو صحیح طور پر یاد نہیں رکھ سکے ۔ حضرت جابر رضی اللہ عنہ نے جب چاندی کے حساب سے اونٹ کی قیمت بتائی تو اس وقت چاندی کا ایک اوقیہ زائد دیے جانے کی بات کی ہے ۔ ( دیکھیے ، حدیث : 4103 ) چاندی کے اس اوقیے کو غلطی سے سونے کے ایک اوقیے کے ساتھ ملا کر دو اوقیے کر دیا گیا ہے ، ان احادیث میں قیمت یا سونے میں بیان کی گئی ہے یا اس کی قیمت کے برابر چاندی میں یا اسی کے برابر دیناروں میں ۔ بعض نے اضافے کو قیمت کے ساتھ شامل کر دیا ہے جس سے التباس پیدا ہوا ہے ۔ البتہ سب احادیث اصل مسئلہ میں ایک دوسرے کی تائید کرتی ہیں ۔",
                "urduNarrator": "معاذ عنبری نے ہمیں حدیث بیان کی ، کہا : ہمیں شعبہ نے محارب سے حدیث بیان کی کہ انہوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَارِبٍ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ، يَقُولُ: «اشْتَرَى مِنِّي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَعِيرًا بِوُقِيَّتَيْنِ، وَدِرْهَمٍ أَوْ دِرْهَمَيْنِ»، قَالَ: «فَلَمَّا قَدِمَ صِرَارًا أَمَرَ بِبَقَرَةٍ، فَذُبِحَتْ فَأَكَلُوا مِنْهَا، فَلَمَّا قَدِمَ الْمَدِينَةَ أَمَرَنِي أَنْ آتِيَ الْمَسْجِدَ، فَأُصَلِّيَ رَكْعَتَيْنِ، وَوَزَنَ لِي ثَمَنَ الْبَعِيرِ، فَأَرْجَحَ لِي.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11670,
                "hadithNumber": "4106",
                "englishNarrator": "Jabir bin 'Abdullah ( رضی اللہ عنہ) reported this narration from Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) but with this variation that he said:",
                "hadithEnglish": "He (the Holy Prophet) bought the camel from me on a stipulated price. And he did not mention two 'uqiyas and a dirham or two dirhams, and he comanded a cow (to be slaughtered) and it was slaughtered, and he then distributed its flesh.",
                "hadithUrdu": "آپ نے مجھ سے اونٹ قیمتا خرید لیا جس کی انہوں ( جابر رضی اللہ عنہ ) نے تعیین بھی کی ، ( اس روایت میں ) انہوں نے دو اوقیہ ، ایک درہم اور دو درہموں کا تذکرہ نہیں کیا اور کہا : آپ نے گائے کا حکم دیا تو اسے ذبح کیا گیا ، پھر آپ نے اس کا گوشت تقسیم کر دیا ۔",
                "urduNarrator": "مجھ سے یحییٰ بن حبیب الحارثی نے بیان کیا, خالد بن حارث نے ہمیں حدیث بیان کی ، کہا : ہمیں شعبہ نے حدیث بیان کی ، انہوں نے کہا : مجھے محارب نے حضرت جابر رضی اللہ عنہ سے خبر دی اور انہوں نے نبی صلی اللہ علیہ وسلم سے یہی قصہ بیان کیا ، مگر انہوں نے کہا",
                "hadithArabic": "حَدَّثَنِي يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا شُعْبَةُ، أَخْبَرَنَا مُحَارِبٌ، عَنْ جَابِرٍ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِهَذِهِ الْقِصَّةِ، غَيْرَ أَنَّهُ قَالَ: فَاشْتَرَاهُ مِنِّي بِثَمَنٍ قَدْ سَمَّاهُ، وَلَمْ يَذْكُرِ الْوُقِيَّتَيْنِ، وَالدِّرْهَمَ وَالدِّرْهَمَيْنِ، وَقَالَ: أَمَرَ بِبَقَرَةٍ فَنُحِرَتْ، ثُمَّ قَسَمَ لَحْمَهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11671,
                "hadithNumber": "4107",
                "englishNarrator": "Jabir (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to him: I have taken your camel for four dinars, and you may ride upon it to Medina.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے ان سے فرمایا : \" میں نے تمہارا اونٹ چار دینار ( جو سونے کے ایک اوقیہ کے برابر ہے ) میں لیا اور مدینہ تک اس کی پیٹھ ( پر سواری ) کا حق تمہارا ہے ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے ابن ابی ز ایدہ نے بیان کیا، انہوں نے ابن جریج سے,عطاء نے حضرت جابر رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهُ: «قَدْ أَخَذْتُ جَمَلَكَ بِأَرْبَعَةِ دَنَانِيرَ، وَلَكَ ظَهْرُهُ إِلَى الْمَدِينَةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11672,
                "hadithNumber": "4108",
                "englishNarrator": "Abu Rafi' رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) took from a man as a loan a young camel (below six years). Then the camels of Sadaqa were brought to him. He ordered Abu Rafi' رضی اللہ عنہ to return to that person the young camel (as a return of the loan). Abu Rafi' رضی اللہ عنہ returned to him and said: I did not find among them but better camels above the age of six. He (the Holy Prophet ﷺ) said: Give that to him for the best men are those who are best in paying off the debt.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ایک آدمی سے بعد میں ادائیگی ( سلف ) کے عوض ایک نو عمر اونٹ لیا ، آپ کے پاس زکاۃ کے اونٹ آئے تو آپ نے حضرت ابورافع رضی اللہ عنہ کو حکم دیا کہ وہ اس آدمی کو اس کے نو عمر اونٹ کی ادائیگی کر دیں ۔ حضرت ابورافع رضی اللہ عنہ لوٹ کر آپ کے پاس آئے اور عرض کی : میں نے تو ( آئے ہوئے ) ان اونٹوں میں ساتویں سال کا بہت اچھا اونٹ ہی پایا ہے ۔ تو آپ نے فرمایا : \" اسے وہی دے دو ، لوگوں میں سے بہترین وہ ہے جو ادا کرنے میں بہترین ہو ۔ \"",
                "urduNarrator": "ہم سے ابو الطاہر احمد بن عمرو بن سرح نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا, امام مالک بن انس نے زید بن اسلم سے ، انہوں نے عطاء بن یسار سے اور انہوں نے حضرت ابورافع رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الطَّاهِرِ أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ، أَخْبَرَنَا ابْنُ وَهْبٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي رَافِعٍ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ اسْتَسْلَفَ مِنْ رَجُلٍ بَكْرًا، فَقَدِمَتْ عَلَيْهِ إِبِلٌ مِنْ إِبِلِ الصَّدَقَةِ، فَأَمَرَ أَبَا رَافِعٍ أَنْ يَقْضِيَ الرَّجُلَ بَكْرَهُ، فَرَجَعَ إِلَيْهِ أَبُو رَافِعٍ، فَقَالَ: لَمْ أَجِدْ فِيهَا إِلَّا خِيَارًا رَبَاعِيًا، فَقَالَ: «أَعْطِهِ إِيَّاهُ، إِنَّ خِيَارَ النَّاسِ أَحْسَنُهُمْ قَضَاءً».",
                "headingArabic": "مَنِ اسْتَسْلَفَ شَيْئًا فَقَضَى خَيْرًا مِنْهُ وَ ‏\"‏ خَيْرُكُمْ أَحْسَنُكُمْ قَضَاءً ‏\"‏ ‏‏",
                "headingUrdu": "جانور ادھار دینا جائز ہے اور مستحب ہے کہ پورا ادا کرے، اس سے بہتر چیز دے جو اس پر واجب ہے۔",
                "headingEnglish": "It is permissible to lend animals and it is recommended to pay in full, giving something better than that which ts owed",
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11673,
                "hadithNumber": "4109",
                "englishNarrator": "Abu Rafi' رضی اللہ عنہ , the freed slave of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), said:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) took as a loan (the rest of the hadith is the same), but with this variation that he (the Holy Prophet) said: Good amongst the servants of Allah is he who is best in paying off the debt.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ایک نو عمر اونٹ بعد کی ادائیگی پر لیا ۔ ۔ ۔ اسی کے مانند ، مگر انہوں نے کہا : \" اللہ کے بندوں میں سے بہترین وہ ہے جو ان میں سے ادائیگی میں بہترین ہے ۔ \"",
                "urduNarrator": "ہم سے ابو کریب نے بیان کیا، کہا ہم سے خالد بن مخلد نے بیان کیا, محمد بن جعفر سے روایت ہے ، میں نے زید بن اسلم سے سنا ، انہوں نے کہا : ہمیں عطاء بن یسار نے رسول اللہ صلی اللہ علیہ وسلم کے آزاد کردہ غلام ابورافع رضی اللہ عنہ سے خبر دی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ، سَمِعْتُ زَيْدَ بْنَ أَسْلَمَ، أَخْبَرَنَا عَطَاءُ بْنُ يَسَارٍ، عَنْ أَبِي رَافِعٍ، مَوْلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: اسْتَسْلَفَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَكْرًا بِمِثْلِهِ، غَيْرَ أَنَّهُ قَالَ: «فَإِنَّ خَيْرَ عِبَادِ اللهِ أَحْسَنُهُمْ قَضَاءً».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11674,
                "hadithNumber": "4110",
                "englishNarrator": "Abu Huraira (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) owed (something) to a person. He behaved in an uncivil manner with him. This vexed the Companions of the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), whereupon Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: He who has a right is entitled to speak, and said to them (his Companions): Buy a camel for him and give that to him. They said: We do not find a camel (of that age) but one with better age than that. He said: Buy that and give that to him, for best of you or best amongst you are those who are best in paying off debt.",
                "hadithUrdu": "ایک آدمی کا رسول اللہ صلی اللہ علیہ وسلم پر حق ( قرض ) تھا ، اس نے آپ کے ساتھ سخت کلامی کی تو نبی صلی اللہ علیہ وسلم کے ساتھیوں نے ( اسے جواب دینے کا ) ارادہ کیا تو نبی صلی اللہ علیہ وسلم نے فرمایا : \" جس شخص کا حق ہو ، وہ بات کرتا ہے ۔ \" اور آپ نے انہیں فرمایا : \" اس کے لیے ( اس کے اونٹ کا ) ہم عمر اونٹ خریدو اور وہ اسے دے دو ۔ \" انہوں نے عرض کی : ہمیں اس سے بہتر عمر کا اونٹ ہی ملتا ہے ۔ تو آپ نے فرمایا : \" وہی خریدو اور اسے دے دو ، بلاشبہ تم میں سے بہترین وہ ہے جو ادائیگی میں بہترین ہے ۔",
                "urduNarrator": "ہم سے محمد بن بشار بن عثمان العبدی نے بیان کیا، کہا ہم سے محمد بن جعفر نے بیان کیا, شعبہ نے ہمیں سلمہ بن کہیل سے حدیث بیان کی ، انہوں نے ابوسلمہ سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارِ بْنِ عُثْمَانَ الْعَبْدِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: كَانَ لِرَجُلٍ عَلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حَقٌّ، فَأَغْلَظَ لَهُ، فَهَمَّ بِهِ أَصْحَابُ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ لِصَاحِبِ الْحَقِّ مَقَالًا»، فَقَالَ لَهُمْ: «اشْتَرُوا لَهُ سِنًّا، فَأَعْطُوهُ إِيَّاهُ»، فَقَالُوا: إِنَّا لَا نَجِدُ إِلَّا سِنًّا هُوَ خَيْرٌ مِنْ سِنِّهِ، قَالَ: «فَاشْتَرُوهُ، فَأَعْطُوهُ إِيَّاهُ، فَإِنَّ مِنْ خَيْرِكُمْ، أَوْ خَيْرَكُمْ أَحْسَنُكُمْ قَضَاءً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11675,
                "hadithNumber": "4111",
                "englishNarrator": "Abu Huraira (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) took a camel on loan, and then returned him (the lender) the camel of a more mature age and said: Good among you are those who are good in clearing off the debt.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ایک نو عمر اونٹ ادھار لیا تو آپ نے اس سے بہتر جوان اونٹ دیا اور فرمایا : \" تم میں سے بہترین وہ ہے جو ادئیگی میں بہترین ہے.",
                "urduNarrator": "ہم سے ابو کریب نے بیان کیا، ہم سے وکیع نے بیان کیا, علی بن صالح نے سلمہ بن کہیل سے ، انہوں نے ابوسلمہ سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا وَكِيعٌ، عَنْ عَلِيِّ بْنِ صَالِحٍ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: اسْتَقْرَضَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ سِنًّا، فَأَعْطَى سِنًّا فَوْقَهُ، وَقَالَ: «خِيَارُكُمْ مَحَاسِنُكُمْ قَضَاءً».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11676,
                "hadithNumber": "4112",
                "englishNarrator": "Abu Huraira ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "There came a person demanding a camel from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). He (the Holy Prophet) said: Give him (the camel) of that age or of more mature age, and said: Best among you is one who is best in clearing off the debt.",
                "hadithUrdu": "ایک آدمی آیا ، وہ رسول اللہ صلی اللہ علیہ وسلم سے اونٹ کا مطالبہ کر رہا تھا تو آپ نے فرمایا : \" اسے اس کے اونٹ سے بہتر عمر کا اونٹ دے دو ۔ \" اور فرمایا : \" تم میں سے بہتر وہ ہے جو ادائیگی میں بہتر ہو ۔ \"",
                "urduNarrator": "ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا، کہا ہم سے میرے والد نے بیان کیا,سفیان نے ہمیں سلمہ بن کہیل سے حدیث بیان کی ، انہوں نے ابوسلمہ سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا سُفْيَانُ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: جَاءَ رَجُلٌ يَتَقَاضَى رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَعِيرًا، فَقَالَ: أَعْطُوهُ سِنًّا فَوْقَ سِنِّهِ، وَقَالَ: «خَيْرُكُمْ أَحْسَنُكُمْ قَضَاءً».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11677,
                "hadithNumber": "4113",
                "englishNarrator": "Jabir ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "There came a slave and pledged allegiance to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) on migration; he (the Holy Prophet) did not know that he was a slave. Then there came his master and demanded him back, whereupon Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Sell him to me. And he bought him for two black slaves, and he did not afterwards take allegiance from anyone until he had asked him whether he was a slave (or a free man)",
                "hadithUrdu": "ایک غلام آیا ، اس نے ہجرت پر نبی صلی اللہ علیہ وسلم کے ساتھ بیعت کی جبکہ آپ کو پتہ نہیں چلا کہ وہ غلام ہے ۔ اس کا آقا اسے لینے کے لیے آیا تو نبی صلی اللہ علیہ وسلم نے اس سے فرمایا : \" یہ مجھے فروخت کر دو ۔ \" چنانچہ آپ نے دو سیاہ غلاموں کے عوض اسے خرید لیا ، پھر اس کے بعد آپ کسی سے بیعت نہ لیتے تھے یہاں تک کہ ( پہلے ) پوچھ لیتے : \" کیا وہ غلام ہے؟ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ التمیمی اور ابن روم نے بیان کیا، انہوں نے کہا: ہم سے لیث نے بیان کیا، ہم سے قتیبہ بن سعید نے بیان کیا، ہم سے لیث نے بیان کیا، انہوں نے ابو کے واسطہ سے الزبیر , حضرت جابر رضی اللہ عنہ سے روایت ہے ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَابْنُ رُمْحٍ، قَالَا: أَخْبَرَنَا اللَّيْثُ، ح وحَدَّثَنِيهِ قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ: جَاءَ عَبْدٌ فَبَايَعَ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى الْهِجْرَةِ، وَلَمْ يَشْعُرْ أَنَّهُ عَبْدٌ، فَجَاءَ سَيِّدُهُ يُرِيدُهُ، فَقَالَ لَهُ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «بِعْنِيهِ»، فَاشْتَرَاهُ بِعَبْدَيْنِ أَسْوَدَيْنِ، ثُمَّ لَمْ يُبَايِعْ أَحَدًا بَعْدُ حَتَّى يَسْأَلَهُ: «أَعَبْدٌ هُوَ.",
                "headingArabic": "جَوَازِ بَيْعِ الْحَيَوَانِ بِالْحَيَوَانِ مِنْ جِنْسِهِ مُتَفَاضِلاً",
                "headingUrdu": "ایک ہی قسم کے اور مختلف معیار کے جانوروں کے لیے جانور بیچنے کی اجازت",
                "headingEnglish": "The permissibility of selling animals for animals of the same kind and of different quality",
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11678,
                "hadithNumber": "4114",
                "englishNarrator": "A'isha (رضی اللہ عنہا) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bought some grain from a Jew on credit and gave him a coat-of-mail of his as a pledge.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ایک یہودی سے ادھار غلہ خریدا اور آپ نے اسے اپنی زرہ بطور رہن دی ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ، ابوبکر بن ابی شیبہ اور محمد بن علاء نے بیان کیا، اور تلفظ یحییٰ نے کہا: ہمیں خبر دی، اور انہوں نے کہا دوسرے دو: اس نے ہمیں بتایا, ابومعاویہ نے اعمش سے ، انہوں نے ابراہیم سے ، انہوں نے اسود سے اور انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ الْعَلَاءِ، وَاللَّفْظُ لِيَحْيَى، قَالَ يَحْيَى: أَخْبَرَنَا، وَقَالَ الْآخَرَانِ: حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الْأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ: «اشْتَرَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنْ يَهُودِيٍّ طَعَامًا بِنَسِيئَةٍ، فَأَعْطَاهُ دِرْعًا لَهُ رَهْنًا».",
                "headingArabic": "الرَّهْنِ وَجَوَازِهِ فِي الْحَضَرِ وَالسَّفَرِ ‏‏",
                "headingUrdu": "گھومنا اور اس کی اجازت خواہ سفر میں ہو یا نہ ہو۔",
                "headingEnglish": "Pawning (Rahn) and its permissibility whether one is travelling or not",
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11679,
                "hadithNumber": "4115",
                "englishNarrator": "A'isha ( رضی اللہ عنہا) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bought from a Jew grain (as loan) and pledged him his iron coat-of-mail.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ایک یہودی سے غلہ خریدا اور آپ نے لوہے کی زرہ اس کے ہاں گروی رکھی ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم الحنظَلی اور علی بن خشرم نے بیان کیا، انہوں نے کہا:عیسیٰ بن یونس نے ہمیں اعمش سے خبر دی ، انہوں نے ابراہیم سے ، انہوں نے اسود سے اور انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، وَعَلِيُّ بْنُ خَشْرَمٍ، قَالَا: أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، عَنِ الْأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الْأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ: «اشْتَرَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنْ يَهُودِيٍّ طَعَامًا، وَرَهَنَهُ دِرْعًا مِنْ حَدِيدٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11680,
                "hadithNumber": "4116",
                "englishNarrator": "A'isha (رضی اللہ عنہا) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bought from a Jew grain for a specified time; and gave him iron coat-of-mail of his as a pledge.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ایک یہودی سے آئندہ مقررہ وقت تک ادائیگی پر غلہ خریدا اور اپنی لوہے کی زرہ اس کے ہاں گروی رکھی ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم الحنظَلی نے بیان کیا، کہا ہم سے المخزومی نے بیان کیا, عبدالواحد بن زیاد نے ہمیں اعمش سے حدیث بیان کی ، انہوں نے کہا : ہم نے ابراہیم نخعی کے پاس بیع سلم میں رہن کی بات کی تو انہوں نے کہا : ہمیں اسود بن یزید نے حضرت عائشہ رضی اللہ عنہا سے حدیث بیان کی کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا الْمَخْزُومِيُّ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، عَنِ الْأَعْمَشِ، قَالَ: ذَكَرْنَا الرَّهْنَ فِي السَّلَمِ عِنْدَ إِبْرَاهِيمَ النَّخَعِيِّ، فَقَالَ: حَدَّثَنَا الْأَسْوَدُ بْنُ يَزِيدَ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «اشْتَرَى مِنْ يَهُودِيٍّ طَعَامًا إِلَى أَجَلٍ، وَرَهَنَهُ دِرْعًا لَهُ مِنْ حَدِيدٍ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11681,
                "hadithNumber": "4117",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of 'A'isha (رضی اللہ عنہا), through another chain at transmitters, but no mention was made of (its being made) of iron.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, حفص بن غیاث نے ہمیں اعمش سے حدیث بیان کی ، انہوں نے ابراہیم سے روایت کی ، انہوں نے کہا : مجھے اسود نے حضرت عائشہ رضی اللہ عنہا سے حدیث بیان کی اور انہوں نے نبی صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ۔ ۔ ۔ اور انہوں نے \" لوہے کی زرہ \" کے الفاظ بیان کیے ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنِ الْأَعْمَشِ، عَنْ إِبْرَاهِيمَ، قَالَ: حَدَّثَنِي الْأَسْوَدُ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ، وَلَمْ يَذْكُرْ مِنْ حَدِيدٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11682,
                "hadithNumber": "4118",
                "englishNarrator": "Ibn 'Abbas ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "When Allah's Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came to Medina, they were paying one and two years in advance for fruits, so he said: Those who pay in advance for anything must do so for a specified weight and for a definite time.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم مدینہ تشریف لائے اور وہ لوگ پھلوں میں ایک دو سال تک کے لیے بیع سلف کرتے تھے تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" جو کھجور میں بیع سلف کرے تو وہ معلوم ماپ اور معلوم وزن میں معلوم مدت تک کے لیے کرے ۔ \"",
                "urduNarrator": "یحییٰ بن یحییٰ اور عمرو ناقد نے ہمیں حدیث بیان کی ۔ ۔ الفاظ یحییٰ کے ہیں ، عمرو نے کہا : ہمیں حدیث بیان کی اور یحییٰ نے کہا : ہمیں خبر دی ۔ ۔ سفیان بن عیینہ نے ہمیں ابن ابی نجیح سے خبر دی ، انہوں نے عبداللہ بن کثیر سے ، انہوں نے ابومنہال سے اور انہوں نے حضرت ابن عباس رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَعَمْرٌو النَّاقِدُ، وَاللَّفْظُ لِيَحْيَى، قَالَ عَمْرٌو: حَدَّثَنَا، وَقَالَ يَحْيَى: أَخْبَرَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ عَبْدِ اللهِ بْنِ كَثِيرٍ، عَنْ أَبِي الْمِنْهَالِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ: قَدِمَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ، وَهُمْ يُسْلِفُونَ فِي الثِّمَارِ السَّنَةَ وَالسَّنَتَيْنِ، فَقَالَ: «مَنْ أَسْلَفَ فِي تَمْرٍ، فَلْيُسْلِفْ فِي كَيْلٍ مَعْلُومٍ، وَوَزْنٍ مَعْلُومٍ، إِلَى أَجَلٍ مَعْلُومٍ».",
                "headingArabic": "السَّلَمِ ‏‏",
                "headingUrdu": "سلام (پیشگی ادائیگی)",
                "headingEnglish": "Salam (Payment in Advance)",
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11683,
                "hadithNumber": "4119",
                "englishNarrator": "Ibn 'Abbas ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "When Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came to (Medina) and the people were paying in advance (for the fruits, etc.), he said to them: He who makes an advance payment should not make advance payment except for a specified measure and weight (and for a specified period).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ( مدینہ ) تشریف لائے اور لوگ بیع سلف کرتے تھے تو رسول اللہ صلی اللہ علیہ وسلم نے ان سے فرمایا : \" جو بیع سلف کرے ، وہ معین ماپ اور معین وزن کے بغیر نہ کرے ۔ \"",
                "urduNarrator": "ہم سے شیبان بن فروخ نے بیان کیا,عبدالوارث نے ہمیں ابن ابی نجیح سے حدیث بیان کی ، کہا : ہمیں عبداللہ بن کثیر نے ابومنہال سے حدیث بیان کی ، انہوں نے حضرت ابن عباس رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنِ ابْنِ أَبِي نَجِيحٍ، حَدَّثَنِي عَبْدُ اللهِ بْنُ كَثِيرٍ، عَنْ أَبِي الْمِنْهَالِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ: قَدِمَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَالنَّاسُ يُسْلِفُونَ، فَقَالَ لَهُمْ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَسْلَفَ فَلَا يُسْلِفْ إِلَّا فِي كَيْلٍ مَعْلُومٍ، وَوَزْنٍ مَعْلُومٍ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11684,
                "hadithNumber": "4120",
                "englishNarrator": null,
                "hadithEnglish": "Ibn Abu Najih has narrated a hadith like this with the same chain of transmitters, but he has not mentioned: for a definite period .",
                "hadithUrdu": "یحییٰ بن یحییٰ ، ابوبکر بن ابی شیبہ اور اسماعیل سالم سب نے ( سفیان ) بن عیینہ سے ، انہوں نے ابن ابی نجیح سے اسی سند کے ساتھ عبدالوارث کی حدیث کی طرح روایت بیان کی اور انہوں نے بھی \" معین مدت تک \" کے الفاظ ذکر نہیں کیے ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَإِسْمَاعِيلُ بْنُ سَالِمٍ، جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، عَنِ ابْنِ أَبِي نَجِيحٍ، بِهَذَا الْإِسْنَادِ مِثْلَ حَدِيثِ عَبْدِ الْوَارِثِ، وَلَمْ يَذْكُرْ: «إِلَى أَجَلٍ مَعْلُومٍ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11685,
                "hadithNumber": "4121",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated by Ibn Abu Najih through another chain of transmitters mentioning in it for a specified period.",
                "hadithUrdu": "ہم سے ابو کریب اور ابن ابی عمر نے بیان کیا، انہوں نے کہا وکیع اور عبدالرحمن بن مہدی دونوں نے سفیان ( ثوری ) سے ، انہوں نے ابن ابی نجیح سے انہی کی سند کے ساتھ ابن عیینہ کی حدیث کی طرح روایت بیان کی اور انہوں نے اس میں \" معین مدت تک \" کے الفاظ ( بھی ) بیان کیے ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا أَبُو كُرَيْبٍ، وَابْنُ أَبِي عُمَرَ، قَالَا: حَدَّثَنَا وَكِيعٌ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، كِلَاهُمَا عَنْ سُفْيَانَ، عَنِ ابْنِ أَبِي نَجِيحٍ، بِإِسْنَادِهِمْ مِثْلَ حَدِيثِ ابْنِ عُيَيْنَةَ، يَذْكُرُ فِيهِ إِلَى أَجَلٍ مَعْلُومٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11686,
                "hadithNumber": "4122",
                "englishNarrator": "Ma`mar (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who hoards is a sinner. It was said to Sa`id (bin al-Musayyib): You also hoard. Sa`id said: Ma`mar رضی اللہ عنہ who narrated this hadith also hoarded.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جس نے ذخیرہ اندوزی کی وہ گناہ گار ہے ۔ \" سعید سے کہا گیا : آپ خود ( کھانے کی بنیادی چیزوں کے سوا دوسری اشیاء میں ) ذخیرہ اندوزی کرتے ہیں؟ سعید نے کہا : حضرت معمر رضی اللہ عنہ جو یہ حدیث بیان کرتے تھے ، وہ بھی ( اس طرح کی ) ذخیرہ اندوزی کرتے تھے ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ بن  قعنب نے بیان کیا,سلیمان بن بلال نے ہمیں یحییٰ بن سعید سے حدیث بیان کی ، انہوں نے کہا : سعید بن مسیب حدیث بیان کرتے تھے کہ حضرت معمر رضی اللہ عنہ نے کہا",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا سُلَيْمَانُ يَعْنِي ابْنَ بِلَالٍ، عَنْ يَحْيَى وَهُوَ ابْنُ سَعِيدٍ، قَالَ: كَانَ سَعِيدُ بْنُ الْمُسَيِّبِ، يُحَدِّثُ أَنَّ مَعْمَرًا، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنِ احْتَكَرَ فَهُوَ خَاطِئٌ»، فَقِيلَ لِسَعِيدٍ: فَإِنَّكَ تَحْتَكِرُ، قَالَ سَعِيدٌ: إِنَّ مَعْمَرًا الَّذِي كَانَ يُحَدِّثُ هَذَا الْحَدِيثَ، كَانَ يَحْتَكِرُ.",
                "headingArabic": "تَحْرِيمِ الاِحْتِكَارِ فِي الأَقْوَاتِ ‏‏",
                "headingUrdu": "اہم کھانے کی اشیاء ذخیرہ کرنے کی ممانعت",
                "headingEnglish": "The prohibition of hoarding staple foods",
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11687,
                "hadithNumber": "4123",
                "englishNarrator": "Ma'mar bin Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: No one hoards but the sinner.",
                "hadithUrdu": "آپ نے فرمایا : \" گناہ گار کے سوا کوئی اور شخص ذخیرہ اندوزی نہیں کرتا ۔ \"",
                "urduNarrator": "ہم سے سعید بن عمرو اشعثی نے بیان کیا، کہا ہم سے حاتم بن اسماعیل نے بیان کیا,محمد بن عجلان نے محمد بن عمرو بن عطاء سے ، انہوں نے سعید بن مسیب سے ، انہوں نے حضرت معمر بن عبداللہ رضی اللہ عنہ سے اور انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ عَمْرٍو الْأَشْعَثِيُّ، حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، عَنْ مُحَمَّدِ بْنِ عَجْلَانَ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، عَنْ مَعْمَرِ بْنِ عَبْدِ اللهِ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «لَا يَحْتَكِرُ إِلَّا خَاطِئٌ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11688,
                "hadithNumber": "4124",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been transmitted on the authority of Sulaiman bin Bilal from Yahya.",
                "hadithUrdu": "ابراہیم نے کہا: مسلم نے کہا: مجھ سے ہمارے بعض اصحاب نے عمرو بن عون سے بیان کیا، خالد بن عبداللہ نے کہا , عمرو بن یحییٰ نے محمد بن عمرو سے ، انہوں نے سعید بن مسیب سے اور انہوں نے بنو عدی بن کعب کے ایک فرد حضرت معمر بن ابی معمر سے روایت کی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ۔ ۔ آگے یحییٰ سے سلیمان بن بلال کی روایت کردہ حدیث کی طرح بیان کیا ۔",
                "urduNarrator": null,
                "hadithArabic": "قَالَ إِبْرَاهِيمُ: قَالَ مُسْلِمٌ: وحَدَّثَنِي بَعْضُ أَصْحَابِنَا، عَنْ عَمْرِو بْنِ عَوْنٍ، أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللهِ، عَنْ عَمْرِو بْنِ يَحْيَى، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، عَنْ مَعْمَرِ بْنِ أَبِي مَعْمَرٍ أَحَدِ بَنِي عَدِيِّ بْنِ كَعْبٍ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: فَذَكَرَ بِمِثْلِ حَدِيثِ سُلَيْمَانَ بْنِ بِلَالٍ، عَنْ يَحْيَى.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 11376,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=455",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=453",
                "label": "453",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=454",
                "label": "454",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=455",
                "label": "455",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=456",
                "label": "456",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=457",
                "label": "457",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=458",
                "label": "458",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=459",
                "label": "459",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=457",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=457",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=455",
        "to": 11400,
        "total": 40465
    }
}