{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 350,
        "data": [
            {
                "id": 9014,
                "hadithNumber": "1450",
                "englishNarrator": "This hadith has been narrated by Qurra with the same chain of transmitters, but therein he did not mention:",
                "hadithEnglish": "He turned his face towards us.",
                "hadithUrdu": "’’پھر آپ نے ہمار ی طرف رخ فرمایا ۔ ‘ ‘",
                "urduNarrator": "عبداللہ بن الصباح العطار نے مجھ سے کہا, عبیداللہ بن عبدالمجید حنفی نے قرہ سے اسی سند کے ساتھ ( یہی ) حدیث بیان کی اور یہ بیان نہ کیا",
                "hadithArabic": "وَحَدَّثَنِي عَبْدُ اللهِ بْنُ الصَّبَّاحِ الْعَطَّارُ، حَدَّثَنَا عُبَيْدُ اللهِ بْنُ عَبْدِ الْمَجِيدِ الْحَنَفِيُّ، حَدَّثَنَا قُرَّةُ، بِهَذَا الْإِسْنَادِ، وَلَمْ يَذْكُرْ، ثُمَّ أَقْبَلَ عَلَيْنَا بِوَجْهِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9015,
                "hadithNumber": "1451",
                "englishNarrator": "Abu Musa ‌رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "I and my companions who had sailed along with me in the boat landed with me in the valley of Buthan while the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was staying in Medina. A party of people amongst them went to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) every night at the time of the 'Isya' prayer turn by turn. Abu Musa ‌رضی ‌اللہ ‌عنہ said: (One night) we (I and my companions) went to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and he was occupied in some matter till there was a delay in prayer so much so that it was the middle of the night. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) then came out and led them (Musa's companions) in prayer. And when he had observed his prayer he said to the audience present: Take it easy, I am going to give you information and glad tidings that it is the blessing of Allah upon you for there is none among the people, except you, who prays at this hour (of the night), or he said: None except you observed prayer at this. (late) hour. He (i. e. the narrator) said: I am not sure which of these two sentences he actually uttered. Abu Musa ‌رضی ‌اللہ ‌عنہ , said: We came back happy for what we heard from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌).",
                "hadithUrdu": "میں اور میرے ( وہ ) ساتھ ۔ جو میرے ساتھ بڑی کشتی میں ( حبشہ سے واپس ) آئے تھے ۔ بطحان کے نشیبی میدان میں اترے ہوئے تھے ، رسول اللہ ﷺ مدینہ میں تھے اور ہر رات ان میں سے ایک جماعت باری باری عشاء کی نمازمیں رسول اللہ ﷺ کی خدمت میں حاضر ہوتی تھی ۔ ابو موسیٰ ‌رضی ‌اللہ ‌عنہ ‌ نے کہا کہ مجھے اور میرے ساتھیوں کو رسول اللہ ﷺ کے ساتھ یوں اتفاق پیش آیا کہ آپ اپنے کسی معاملے میں ( اتنے ) مشغول ہو گئے کہ آپ نے نماز کو مؤخر کر دیا حتی کہ آدھی رات ہو گئی ۔ اس کے بعد رسول اللہ ﷺ تشریف لائے اور لوگوں کو نماز پڑھائی ۔ جب آپ نے ناز مکمل کر لی تو ان لوگوں سے جو آپ کے سامنے حاضر تھے ، فرمایا : ’’ذرا ٹھہر و میں تمھیں بتاتا ہوں اور تم خوش ہو جاؤ یہ تم پر اللہ تعالیٰ کی ایک نعمت ہے کہ لوگوں میں اس وقت ، تمھارے سوا ، کوئی بھی نماز نہیں پڑھ رہا ۔ ‘ ‘ یا آپ نے فرمایا : ’’اس وقت تمھارے سوا کسی نے نماز نہیں پڑھی ۔ ‘ ‘ ہمیں یاد نہیں کہ آپ ﷺ نے کون سا جملہ کہا تھا ۔ ابو موسیٰ ‌رضی ‌اللہ ‌عنہ ‌ نے بتایا : ہم رسول اللہ ﷺ کی بات سن کر خوش خوش واپس آئے ۔",
                "urduNarrator": "641) ہم سے ابوعامر اشعری اور ابو کریب نے بیان کیا، کہا: ہم سے ابو اسامہ نے بریدہ سے اور ابو بردہ سے,حضرت ابو موسیٰ اشعری ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے ، انھوں نے کہا",
                "hadithArabic": "641) وَحَدَّثَنَا أَبُو عَامِرٍ الْأَشْعَرِيُّ، وَأَبُو كُرَيْبٍ، قَالَا: حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ: كُنْتُ أَنَا وَأَصْحَابِي الَّذِينَ قَدِمُوا مَعِي فِي السَّفِينَةِ نُزُولًا فِي بَقِيعِ بُطْحَانَ، وَرَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِالْمَدِينَةِ، فَكَانَ يَتَنَاوَبُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عِنْدَ صَلَاةِ الْعِشَاءِ كُلَّ لَيْلَةٍ نَفَرٌ مِنْهُمْ، قَالَ أَبُو مُوسَى: فَوَافَقْنَا رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَا وَأَصْحَابِي وَلَهُ بَعْضُ الشُّغْلِ فِي أَمْرِهِ، حَتَّى أَعْتَمَ بِالصَّلَاةِ حَتَّى ابْهَارَّ اللَّيْلُ، ثُمَّ خَرَجَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَصَلَّى بِهِمْ، فَلَمَّا قَضَى صَلَاتَهُ، قَالَ لِمَنْ حَضَرَهُ: «عَلَى رِسْلِكُمْ، أُعْلِمُكُمْ وَأَبْشِرُوا أَنَّ مِنْ نِعْمَةِ اللهِ عَلَيْكُمْ أَنَّهُ لَيْسَ مِنَ النَّاسِ أَحَدٌ يُصَلِّي هَذِهِ السَّاعَةَ غَيْرُكُمْ»، أَوْ قَالَ: «مَا صَلَّى هَذِهِ السَّاعَةَ أَحَدٌ غَيْرُكُمْ» - لَا نَدْرِي أَيَّ الْكَلِمَتَيْنِ قَالَ -، قَالَ أَبُو مُوسَى: «فَرَجَعْنَا فَرِحِينَ بِمَا سَمِعْنَا مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9016,
                "hadithNumber": "1452",
                "englishNarrator": "Ibn Juraij reported:",
                "hadithEnglish": "I said to Ata': Which time do you deem fit for me to say the 'Isya' prayer, -as an Imam or alone, -that time which is called by people 'Atama? He said: I heard Ibn 'Abbas رضی ‌اللہ ‌عنہ saying: The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) one night delayed the 'Isya' prayer till the people went to sleep. They woke up and again went to sleep and again woke up. Then 'Umar bin Khattab رضی ‌اللہ ‌عنہ stood up and said (loudly) Prayer. Ata' further reported that Ibn 'Abbas رضی ‌اللہ ‌عنہ said: The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came out, and as if I am still seeing him with water trickling from his head, and with his hand placed on one side of the head, and he said: Were it not hard for my Ummah, I would have ordered them to observe this prayer like this (i. e. at late hours). I inquired from 'Ata' how the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) placed his hand upon his head as Ibn Abbas had informed. So Ata' spread his fingers a little and then placed the ends of his fingers on the side of his head. He then moved them like this over his head till the thumb touched that part of the ear which is near the face and then it (went) to the earlock and the part of the heard. It (the bind) neither held nor caught anything but this is how (it moved oil). I said to Ata': Was it mentioned to you (by Ibn Abbas) how long did the Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) delay it (the prayer) during that eight? He said: I do not know (I cannot give you the exact time). Ali' said: I love that I should say prayer, whether as an Imam or alone at delayed hours as the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said that night, but if It is hard upon you in your individual capacity or upon people in the congregation and you are their Imam, then say prayer ('Isha') at the middle hours neither too early nor too late.",
                "hadithUrdu": "میں نے عطاء سے پوچھا : آپ کے نزدیک کون سی گھڑی زیادہ پسندیدہ ہے کہ میں اس میں عشاء کی نماز ، جسے لوگ عتمہ کہتے ہیں ، امام کے ساتھ یا انفرادی طور پر پڑھوں ؟ انھوں نے جواب دیا : میں نے ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ کویہ فرماتے ہوئےسنا : ایک رات نبی ﷺ نے عشاء کی نماز میں دیر کر دی حتی کہ لوگ سوئے ، پھر بیدار ہوئے ، پھر سوئے اور بیدار ہوئے تو حضرت عمر بن خطاب ‌رضی ‌اللہ ‌عنہ ‌ ‌ کھڑے ہوئے اور بلند آواز سے کہا : نماز ! عطاء نے کہا : ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے بتایا : تو نبی اکرمﷺ نکلے ، ایسا لگتا ہے کہ میں اب بھی آپ کو دیکھ رہا ہوں ، آپ کے سر مبارک سے قطرہ قطرہ پانی ٹپک رہا تھا اور ( بالوں میں سے پانی نکالنے کے لیے ) آپ نے اپنا ہاتھ سر کے آدھے حصے پر رکھا ہوا تھا ، آپ ﷺ نے فرمایا : ’’اگر یہ بات نہ ہوتی کہ میری امت کےلیے مشقت ہو گی تو میں انھیں حکم دیتا کہ وہ اس نماز کو اسی وقت پڑھا کریں ۔ ‘ ‘ ( ابن جریج نے ) کہا : میں نے عطاء سے اچھی طرح چوچھا کہ ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے انھیں کس طرح بتایا کہ نبی ﷺ نے اپنا ہاتھ کس انداز سے اپنے سر پر رکھا تھا ؟ تو عطاء نے میرے سامنے اپنی انگلیاں کسی قدر کھولیں ، پھر اپنی انگلیوں کے کنارے سر کی ایک جانب رکھے ، پھر ان کو دباتے ہوئے اسطرح ان کو سر پر پھیرا یہا ں تک کہ ان کا انگوٹھا کان کے اس کنارے کو چھونے لگا جو چہرے کے قریب ہوتا ہے ، پھر کنپٹی اور داڑھی کے کنارے کو ( چھوا ) بس اس طرح کیا نہ ( دباؤ میں ) کمی کی نہ کسی چیز کو پکڑا ( اور نچوڑا ۔ ) میں نے عطاء سے پوچھا : آب کو کیا بتایا گیا کہ اس رات نبی اکرم ﷺ نے کتنی تخیر کی ؟ انھوں نے کہا : مجھے معلوم نہیں ۔ عطاء نے کہا : میرے نزدیک زیادہ پسندیدہ یہی ہےکہ میں امام ہوں یا اکیلا ، یہ نماز تاخیر سے پڑھوں ، جس طرح نبی اکرم ﷺ نے اس رات پڑھی تھی ۔ اگر یہ بات تمھارے لیے انفرادی طور پر با جماعت کی صورت میں لوگوں کےلیے جب تم ان کے امام ہو ، دشواری کا باعث ہو تو اس کو درمیان وقت میں پڑھو ، نہ جلد ی اور نہ مؤخر کرکے ۔",
                "urduNarrator": "ہم سے محمد بن رافع نے بیان کیا، ہم سے عبدالرزاق نے بیان کیا، ابن جریج نے ہمیں خبر دی ، کہا",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ: قُلْتُ لِعَطَاءٍ: أَيُّ حِينٍ أَحَبُّ إِلَيْكَ أَنْ أُصَلِّيَ الْعِشَاءَ، الَّتِي يَقُولُهَا النَّاسُ الْعَتَمَةَ، إِمَامًا وَخِلْوًا؟ قَالَ: سَمِعْتُ ابْنَ عَبَّاسٍ، يَقُولُ: أَعْتَمَ نَبِيُّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ذَاتَ لَيْلَةٍ الْعِشَاءَ، قَالَ: حَتَّى رَقَدَ نَاسٌ وَاسْتَيْقَظُوا، وَرَقَدُوا وَاسْتَيْقَظُوا، فَقَامَ عُمَرُ بْنُ الْخَطَّابِ، فَقَالَ: الصَّلَاةَ، فَقَالَ عَطَاءٌ: قَالَ ابْنُ عَبَّاسٍ: فَخَرَجَ نَبِيُّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَأَنِّي أَنْظُرُ إِلَيْهِ الْآنَ، يَقْطُرُ رَأْسُهُ مَاءً، وَاضِعًا يَدَهُ عَلَى شِقِّ رَأْسِهِ، قَالَ: «لَوْلَا أَنْ يَشُقَّ عَلَى أُمَّتِي لَأَمَرْتُهُمْ أَنْ يُصَلُّوهَا كَذَلِكَ»، قَالَ: فَاسْتَثْبَتُّ عَطَاءً، كَيْفَ وَضَعَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَدَهُ عَلَى رَأْسِهِ كَمَا أَنْبَأَهُ ابْنُ عَبَّاسٍ، فَبَدَّدَ لِي عَطَاءٌ بَيْنَ أَصَابِعِهِ شَيْئًا مِنْ تَبْدِيدٍ، ثُمَّ وَضَعَ أَطْرَافَ أَصَابِعِهِ عَلَى قَرْنِ الرَّأْسِ، ثُمَّ صَبَّهَا، يُمِرُّهَا كَذَلِكَ عَلَى الرَّأْسِ، حَتَّى مَسَّتْ إِبْهَامُهُ طَرَفَ الْأُذُنِ مِمَّا يَلِي الْوَجْهَ، ثُمَّ عَلَى الصُّدْغِ وَنَاحِيَةِ اللِّحْيَةِ، لَا يُقَصِّرُ وَلَا يَبْطِشُ بِشَيْءٍ، إِلَّا كَذَلِكَ، قُلْتُ لِعَطَاءٍ: كَمْ ذُكِرَ لَكَ أَخَّرَهَا النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لَيْلَتَئِذٍ؟ قَالَ: لَا أَدْرِي، قَالَ عَطَاءٌ: أَحَبُّ إِلَيَّ أَنْ أُصَلِّيَهَا إِمَامًا وَخِلْوًا مُؤَخَّرَةً كَمَا صَلَّاهَا النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لَيْلَتَئِذٍ، فَإِنْ شَقَّ عَلَيْكَ ذَلِكَ خِلْوًا أَوْ عَلَى النَّاسِ فِي الْجَمَاعَةِ، وَأَنْتَ إِمَامُهُمْ، فَصَلِّهَا وَسَطًا، لَا مُعَجَّلَةً، وَلَا مُؤَخَّرَةً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9017,
                "hadithNumber": "1453",
                "englishNarrator": "Jabir bin Samura ‌رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) postponed the last 'Isha' prayer.",
                "hadithUrdu": "رسول اللہ ﷺ رات کی دوسری نماز تاخیر سے پڑھتے تھے.",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ، قتیبہ بن سعید اور ابوبکر بن ابی شیبہ نے بیان کیا، کہا: ہم سے انہوں نے بیان کیا، اور باقی دو نے کہا, ابواحوص نے سماک سے ، انھوں نے حضرت جابر بن سمرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ ، کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، قَالَ يَحْيَى: أَخْبَرَنَا، وَقَالَ الْآخَرَانِ: حَدَّثَنَا أَبُو الْأَحْوَصِ، عَنْ سِمَاكٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ: «كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُؤَخِّرُ صَلَاةَ الْعِشَاءِ الْآخِرَةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9018,
                "hadithNumber": "1454",
                "englishNarrator": "Jabir bin Samura رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to observe prayers like your prayers, but he would delay the prayer after nightfall to a little after the time you observed it, and he would shorten the prayer.",
                "hadithUrdu": "رسول اللہ ﷺ نمازیں تمھاری طرح ( اوقات میں ) پڑھتے تھے ، البتہ عشاء مؤخر کرکے تمھاری نماز سے کچھ دیر بعد پڑھتے تھے اور نماز میں تخفیف کرتےتھے ۔ اور ابو کامل کی روایت میں ( یخف فی الصلاۃ کے بجائے ) ’’ یخفف کے الفاظ ہیں ۔ ( مفہوم ایک ہی ہے ۔ )",
                "urduNarrator": "قتیبہ بن سعید اور ابو کامل جحدری نے کہا : ہمیں ابو عوانہ نے سماک سے حدیث سنائی ، انھوں نے حضرت جابر بن سمرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو كَامِلٍ الْجَحْدَرِيُّ، قَالَا: حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ سِمَاكٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ: «كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي الصَّلَوَاتِ نَحْوًا مِنْ صَلَاتِكُمْ، وَكَانَ يُؤَخِّرُ الْعَتَمَةَ بَعْدَ صَلَاتِكُمْ شَيْئًا، وَكَانَ يُخِفُّ الصَّلَاةَ» وَفِي رِوَايَةِ أَبِي كَامِلٍ يُخَفِّفُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9019,
                "hadithNumber": "1455",
                "englishNarrator": "Abdullah bin 'Umar رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "I heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Let the bedouin not gain upper hand over you in regard to the name of your prayer. See I (The night prayer should be called) 'Isya' (and the bedouins call it Atama (because) they milk their camels late.",
                "hadithUrdu": "میں نے رسول اللہ ﷺ کو یہ فرماتے ہوئے سنا : ’’تمھاری نماز کے نام پر تمھارے گنوار لوگ غالب نہ آجائیں ، خبردار !یہ عشاء ہے ، وہ اونٹنیوں کا دودھ دوہنے کی وجہ سے اندھیرا کر دیتے ہیں ( اور اندھیرے ( عتمہ ) کی بنا پر اس وقت پڑھی جانے والی نماز کو صلاۃ العتمہ ، یعنی اندھیرے کی نماز کہتےہیں.",
                "urduNarrator": "زہیر نے کہا : ہم سے سفیان بن عینہ نے ابو لبید سے ، انھوں نے ابو سلمہ سے اورانھوں نے حضرت عبداللہ بن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَابْنُ أَبِي عُمَرَ، قَالَ زُهَيْرٌ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ ابْنِ أَبِي لَبِيدٍ، عَنْ أَبِي سَلَمَةَ، عَنْ عَبْدِ اللهِ بْنِ عُمَرَ، قَالَ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: «لَا تَغْلِبَنَّكُمُ الْأَعْرَابُ عَلَى اسْمِ صَلَاتِكُمْ، أَلَا إِنَّهَا الْعِشَاءُ، وَهُمْ يُعْتِمُونَ بِالْإِبِلِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9020,
                "hadithNumber": "1456",
                "englishNarrator": "Ibn 'Umar رضی ‌اللہ ‌عنہ said:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Let the bedouin not gain upper band over you In regard to the name of your prayer, i. e. night prayer, for it is mentioned 'Isya' in the Book of Allah (i. e. the Qur'an). (The bedouin call it 'Atama because) they make delay in milling their she-camels.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’تمھاری صلاۃ عشاء کے نام پر بدوتم پر غالب نہ آجائیں کیونکہ اللہ کی کتاب میں ا س کا نام عشاء ہے : اور بدو اونٹنیوں کا دودھ دوہنے میں اندھیرا کر دیتے ہیں ۔ ‘ ‘",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، انہوں نے کہا, وکیع نے سفیان سے باقی ماندہ سابقہ سند کے ساتھ حضرت ابن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ اللهِ بْنِ أَبِي لَبِيدٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنِ ابْنِ عُمَرَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تَغْلِبَنَّكُمُ الْأَعْرَابُ عَلَى اسْمِ صَلَاتِكُمُ الْعِشَاءِ، فَإِنَّهَا فِي كِتَابِ اللهِ الْعِشَاءُ، وَإِنَّهَا تُعْتِمُ بِحِلَابِ الْإِبِلِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9021,
                "hadithNumber": "1457",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "The believing women used to pray the morning prayer with the Messenger of Allah and then return wrapped in their mantles. No one could recognize them.",
                "hadithUrdu": "مومن عورتیں صبح کی نماز نبی اکرم ﷺ کے ساتھ پڑھتی تھیں ، پھر اپنی چادریں اوڑھے ہوئے واپس آتیں اور ( اندھیرے کی وجہ سے ) کوئی انھیں پہچان نہیں سکتا تھا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، عمرو ناقد اور زہیر بن حرب نے بیان کیا, سفیان بین عیینہ نے زہری سے ، انھوں نے عروہ سےاور انھوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، كُلُّهُمْ عَنْ سُفْيَانَ بْنِ عُيَيْنَةَ، قَالَ عَمْرٌو: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ: «أَنَّ نِسَاءَ الْمُؤْمِنَاتِ كُنَّ يُصَلِّينَ الصُّبْحَ مَعَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، ثُمَّ يَرْجِعْنَ مُتَلَفِّعَاتٍ بِمُرُوطِهِنَّ لَا يَعْرِفُهُنَّ أَحَدٌ».",
                "headingArabic": "اسْتِحْبَابِ التَّبْكِيرِ بِالصُّبْحِ فِي أَوَّلِ وَقْتِهَا وَهُوَ التَّغْلِيسُ وَبَيَانِ قَدْرِ الْقِرَاءَةِ فِيهَا",
                "headingUrdu": "یہ مستحب ہے کہ صبح سویرے، اس کے وقت کے شروع میں، جب ابھی اندھیرا ہو۔ اور اس میں تلاوت کی لمبائی",
                "headingEnglish": "It is recommended to pray Subh early, at the beginning of its time, when it is still dark; and the length of recitation therein",
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9022,
                "hadithNumber": "1458",
                "englishNarrator": "A'isha رضی اللہ عنہا , the wife of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), reported:",
                "hadithEnglish": "The believing women observed the morning prayer with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) wrapped in their mantles. They then went back to their houses and were unrecognizable, because of the Messenger of Allah's ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) praying in the darkness before dawn.",
                "hadithUrdu": "کچھ مومن عورتیں فجر کی نماز میں اپنی چادریں اوڑھے ہوئے رسول اللہ ﷺ کے ساتھ شریک ہوتی تھیں ، پھر وہ اپنے گھروں کو لوٹتیں تو رسول اللہ ﷺ کے اندھیرے میں نماز پڑھنے کی بنا پر وپہچانی نہ جا سکتی تھیں.",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا, یونس نے ابن شہاب سے باقی ماندہ سابقہ سند کے ساتھ نبی اکرم ﷺ کی زوجہ حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انھوں نےکہا",
                "hadithArabic": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، أَنَّ ابْنَ شِهَابٍ، أَخْبَرَهُ قَالَ: أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَتْ: «لَقَدْ كَانَ نِسَاءٌ مِنَ الْمُؤْمِنَاتِ يَشْهَدْنَ الْفَجْرَ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مُتَلَفِّعَاتٍ بِمُرُوطِهِنَّ، ثُمَّ يَنْقَلِبْنَ إِلَى بُيُوتِهِنَّ، وَمَا يُعْرَفْنَ مِنْ تَغْلِيسِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِالصَّلَاةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9023,
                "hadithNumber": "1459",
                "englishNarrator": "A'isha ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to observe the morning prayer, and the women would go back wrapped in their mantles being unrecognisable because of the darkness before dawn. (Ishaq bin Musa) al-Ansari (one of the transmitters in this chain of narration) narrated wrapped (only) in his narration. (No mention was made of mantles.)",
                "hadithUrdu": "رسول اللہ ﷺ صبح کی نماز پڑھتے تو عورتیں اپنی چادریں اوڑھے ہوئے گھروں کو لوٹتیں ، ( اور ) اندھیرےکی وجہ سے پہچانی نہیں جاتی تھیں ۔ انصاری کی روایت میں ( متلفعات کے بجائے ) متلففات ( چادروں میں لپٹی ہوئی ) کے الفاظ ہیں ۔",
                "urduNarrator": "نصر بن علی جہضمی اور اسحاق بن موسیٰ انصاری نے کہا : ہمیں معن نے مالک سے حدیث بیان کی ، انھوں نے یحییٰ بن سعید سے ، انھوں نے عمرہ سے اور انھوں نے حضرت عائشہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا  ایسا تھا کہ",
                "hadithArabic": "وَحَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، وَإِسْحَاقُ بْنُ مُوسَى الْأَنْصَارِيُّ، قَالَا: حَدَّثَنَا مَعْنٌ، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، قَالَتْ: «إِنْ كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لَيُصَلِّي الصُّبْحَ، فَيَنْصَرِفُ النِّسَاءُ مُتَلَفِّعَاتٍ بِمُرُوطِهِنَّ، مَا يُعْرَفْنَ مِنَ الْغَلَسِ» وقَالَ الْأَنْصَارِيُّ فِي رِوَايَتِهِ: مُتَلَفِّفَاتٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9024,
                "hadithNumber": "1460",
                "englishNarrator": "Muhammad bin 'Amr bin al-Hasan bin 'Ali رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "When Hajjaj came to Medina we asked Jabir bin Abdullah رضی ‌اللہ ‌عنہ (about the timings of prayer as observed by the Holy Prophet). He said: The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to pray afternoon prayer in the midday heat; the afternoon prayer when the sun was bright; the evening prayer when the sun had completely set; and as for the night prayer, he sometimes delayed and sometimes (observed it) at earlier hours. When he found them (his Companions) assembled (at earlier hours) he (prayed) early. and when he saw them coming late, he delayed the (prayer). and the morning prayer the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) observed in the darkness before dawn.",
                "hadithUrdu": "جب حجاج مدینہ منورہ آیا ( اور تاخیر سے نمازیں پڑھنے لگا ) تو ہم نے ( نماز کےاوقات کے بارے میں ) جابر بن عبداللہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے پوچھا ، انھوں نے بتایا کہ رسول اللہ ﷺ ظہر کی نما دوپہر کو ( زوال کے فورا بعد ) پڑھتے تھے اور عصر ایسے وقت میں پڑھتے تھے کہ سورج بالکل صاف ( اور روشن ہوتا ) تھا اور مغرب کی نماز سورج غروب ہوتے ہی پڑھتے اور عشاء کی نماز کو کبھی مؤخر کرتے اور کبھی جلدی ادا کرتے ، جب آپ دیکھتے کہ لوگ جمع ہو گے ہیں تو جلدی پڑھ لیتے ارو جب انھیں دیکھتے کہ دیر کر دی ہے تو تاخیر کر دیتے ۔ اور صبح ( کی نماز ) یہ لوگ ۔ ۔ یا کہا : نبی ﷺ اندھیرے میں پڑھتے تھے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, محمد بن جعفر غندر نے ہمیں حدیث بیان کی ، کہا : ہمیں شعبہ نے حدیث سنائی ، انھوں نے سعد بن ابراہیم سے اور انھوں نے محمد بن عمرو بن حسن بن علی ( بن ابی طالب ) ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا غُنْدَرٌ، عَنْ شُعْبَةَ، ح قَالَ: وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ الْحَسَنِ بْنِ عَلِيٍّ، قَالَ: لَمَّا قَدِمَ الْحَجَّاجُ الْمَدِينَةَ، فَسَأَلْنَا جَابِرَ بْنَ عَبْدِ اللهِ، فَقَالَ: كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي الظُّهْرَ بِالْهَاجِرَةِ، وَالْعَصْرَ وَالشَّمْسُ نَقِيَّةٌ، وَالْمَغْرِبَ إِذَا وَجَبَتْ، وَالْعِشَاءَ أَحْيَانًا يُؤَخِّرُهَا، وَأَحْيَانًا يُعَجِّلُ، كَانَ إِذَا رَآهُمْ قَدِ اجْتَمَعُوا عَجَّلَ، وَإِذَا رَآهُمْ قَدْ أَبْطَئُوا أَخَّرَ، وَالصُّبْحَ كَانُوا - أَوْ قَالَ: كَانَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - يُصَلِّيهَا بِغَلَسٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9025,
                "hadithNumber": "1461",
                "englishNarrator": "Muhammad bin 'Amr al-Hasan bin 'Ali رضی اللہ عنہما reported:",
                "hadithEnglish": "Hajjaj used to delay the prayers, and so we asked Jabir bin 'Abdullah رضی ‌اللہ ‌عنہ ‌, and the rest of the hadith is the same.",
                "hadithUrdu": "حجاج نمازوں میں تاخیر کر دیتا تھا تو ہم نے جابر بن عبداللہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے پوچھا ۔ ۔ ۔ ( آگے ) غندر کی روایت کی طرح ہے ۔",
                "urduNarrator": "ہم سے عبید اللہ بن معاذ نے بیان کیا، ہم سے میرے والد نے بیان کیا، ہم سے شعبہ نے بیان کیا، وہ سعد رضی اللہ عنہ سے، انہوں نے محمد بن عمرو بن الحسن بن علی رضی اللہ عنہما سے سنا، انہوں نے کہا",
                "hadithArabic": "وَحَدَّثَنَاهُ عُبَيْدُ اللهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ سَعْدٍ، سَمِعَ مُحَمَّدَ بْنَ عَمْرِو بْنِ الْحَسَنِ بْنِ عَلِيٍّ، قَالَ: كَانَ الْحَجَّاجُ يُؤَخِّرُ الصَّلَوَاتِ، فَسَأَلْنَا جَابِرَ بْنَ عَبْدِ اللهِ بِمِثْلِ حَدِيثِ غُنْدَرٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9026,
                "hadithNumber": "1462",
                "englishNarrator": "Sayyar bin Salama reported:",
                "hadithEnglish": "I heard my father asking Abu Barza (al- Aslami) رضی ‌اللہ ‌عنہ ‌about the prayer of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) I (Shu'ba, one of the narrators) said: Did you hear it (from Abu Barza رضی ‌اللہ ‌عنہ )? He said: 1 feel as if I am bearing you at this very time. He said: I heard my father asking about the prayer of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and he (Abu Barza رضی ‌اللہ ‌عنہ ) making this reply: He (the Holy Prophet) did not mind delaying-some (prayer) i. e. 'Isya' prayer, even up to the midnight and did not like sleeping before observing it, and talking after it. Shu'ba said: I met him subsequently and asked him (about the prayers of the Holy Prophet) and he said: He observed the noon prayer when the sun was past the meridian, he would pray the afternoon prayer, after which a person would o to the outskirts of Medina and the sun was still bright; (I forgot what he said about the evening prayer) ; I then met him on a subsequent occasion and asked him (about the prayers of the Holy Prophet; and he said: He would observe the morning prayer (at such a time) so that a man would go back and would recognize his neighbour by casting a glance at his face, and he would recite from sixty to one hundred verses in it.",
                "hadithUrdu": "میں نے سنا کہ میرے والد ، حضرت ابو برزہ اسلمی ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے رسول اللہ ﷺ کی نماز کے بارے میں پوچھ رہے تھے ۔ ( شعبہ نے ) کہا : میں نے پوچھا : کیا آپ نے خود انھیں سنا ؟ انھوں نے کہا : ( اسی طرح ) جیسے میں ابھی تمھیں سن رہا ہوں ، کہا : میں نے سنا ، میرے والد ان سے رسول اللہ ﷺ کی نماز کے بارے میں سوال کر رہے تھے ، انھوں نے بتایا کہ آپ اس ، یعنی عشاء کی نماز کو کچھ ( تقریباً ) آدھی رات تک مؤخر کرنے میں مضائقہ نہ سمجھتے تھے اور اس نماز سے پہلے سونے اور اس کے بات چیت کرنے کو نا پسند فرماتے تھے ۔ شعبہ نے کہا : میں بعد ازاں ( دوبارہ ) ان سے ملاتو میں نے ان سے ( پھر ) پوچھا تو انھوں ( سیار ) نے کہا : آپ ظہر کی نماز سورج ڈھلنے کے وقت پڑھتے تھے اور عصر ایسے وقت میں پڑھتے کہ انسان نماز پڑھ کر مدینہ کے دور ترین حصے تک پہنچ جاتا اور سورج ( اسی طرح ) زندہ ( روشن اور گرم ) ہوتا تھا اور انھوں نے کہا : مغرب کے لیے میں نہیں جانتا ، انھوں نے کون سا وقت بتایا تھا ۔ ( شعبہ نے ) کہا : میں اس کے بعد ( پھر ) سیار سے ملا اور ان سے پوچھا تو انھوں نے بتایا : ( آپ ﷺ ) صبح کی نماز ایسے وقت میں پڑھتے کہ انسان سلام پھیرتا اور اپنے ساتھ بیٹھے ہوئے انسان کے چہرے کو ، جسے وہ جانتا ہوتا ، دیکھتا تو اسے پہچان لیتا اور آپ اس ( نماز ) میں ساٹھ سے سو تک آیتیں تلاوت فرماتے تھے ۔",
                "urduNarrator": "ہم سے یحییٰ بن حبیب الحارثی نے بیان کیا، انہوں نے بیان کیا, خالد بن حارث نے ہمیں حدیث سنائی ، کہا : شعبہ نے ہمیں حدیث بیان کی ، کہا : مجھے سیار بن سلامہ نے خبر دی ، کہا",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا شُعْبَةُ، أَخْبَرَنِي سَيَّارُ بْنُ سَلَامَةَ، قَالَ: سَمِعْتُ أَبِي، يَسْأَلُ أَبَا بَرْزَةَ، عَنْ صَلَاةِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: قُلْتُ: آنْتَ سَمِعْتَهُ؟ قَالَ: فَقَالَ: كَأَنَّمَا أَسْمَعُكَ السَّاعَةَ، قَالَ: سَمِعْتُ أَبِي يَسْأَلُهُ عَنْ صَلَاةِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: كَانَ لَا يُبَالِي بَعْضَ تَأْخِيرِهَا - قَالَ: يَعْنِي الْعِشَاءَ - إِلَى نِصْفِ اللَّيْلِ، وَلَا يُحِبُّ النَّوْمَ قَبْلَهَا، وَلَا الْحَدِيثَ بَعْدَهَا ، قَالَ شُعْبَةُ: ثُمَّ لَقِيتُهُ بَعْدُ فَسَأَلْتُهُ، فَقَالَ: «وَكَانَ يُصَلِّي الظُّهْرَ حِينَ تَزُولُ الشَّمْسُ، وَالْعَصْرَ يَذْهَبُ الرَّجُلُ إِلَى أَقْصَى الْمَدِينَةِ وَالشَّمْسُ حَيَّةٌ»، قَالَ: وَالْمَغْرِبَ لَا أَدْرِي أَيَّ حِينٍ ذَكَرَ، قَالَ: ثُمَّ لَقِيتُهُ بَعْدُ فَسَأَلْتُهُ، فَقَالَ: «وَكَانَ يُصَلِّي الصُّبْحَ فَيَنْصَرِفُ الرَّجُلُ فَيَنْظُرُ إِلَى وَجْهِ جَلِيسِهِ الَّذِي يَعْرِفُ فَيَعْرِفُهُ»، قَالَ: «وَكَانَ يَقْرَأُ فِيهَا بِالسِّتِّينَ إِلَى الْمِائَةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9027,
                "hadithNumber": "1463",
                "englishNarrator": "Sayyar bin Salama reported:",
                "hadithEnglish": "I heard Abu Barza saying that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) did not mind some delay in the 'Isha' prayer even up to midnight and he did not like sleeping before (observing it) and talking after it. Shu'ba said: I again met him (Sayyar b. Salama) for the second time and he said: Even up to the third (part) of the night.",
                "hadithUrdu": "میں نے ابو برزہ کو کہتے ہوئے سنا ، رسول اللہ عشاء کی نماز میں کچھ ( یعنی ) آدھی رات تک تا خیر کی پروانہ کرتے تھے اور اس سے پہلے سونے اور اس کے بعد گفتگو کرنے کو پسند نہیں فرماتے تھے ۔ شعبہ نے کہا : پھر میں انھیں دوبارہ ملاتو انھوں نے کہا : یا تہائی رات تک ۔",
                "urduNarrator": "معاذ عنبری نے شعبہ سے حدیث بیان کی اور انھوں نے سیار بن سلامہ سے روایت کی کہ",
                "hadithArabic": "دَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ سَيَّارِ بْنِ سَلَامَةَ، قَالَ: سَمِعْتُ أَبَا بَرْزَةَ، يَقُولُ: «كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لَا يُبَالِي بَعْضَ تَأْخِيرِ صَلَاةِ الْعِشَاءِ إِلَى نِصْفِ اللَّيْلِ، وَكَانَ لَا يُحِبُّ النَّوْمَ قَبْلَهَا، وَلَا الْحَدِيثَ بَعْدَهَا» قَالَ شُعْبَةُ: ثُمَّ لَقِيتُهُ مَرَّةً أُخْرَى، فَقَالَ: «أَوْ ثُلُثِ اللَّيْلِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9028,
                "hadithNumber": "1464",
                "englishNarrator": "Abu Barza bin Aslami رضی ‌اللہ ‌عنہ is reported to have said:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) delayed the night prayer till a third of the night had passed and he did not approve of sleeping before it, and talking after it, and he used to recite in the morning prayer from one hundred to sixty verses (and completed the prayer at such hours) when we recognized the faces of one another.",
                "hadithUrdu": "رسول اللہ ﷺ عشاء کو تہائی رات تک مؤخر کر دیتے تھے اور اس سے پہلے سونے اور بعد میں گفتگو کرنے کو ناپسند فرماتے تھے اور صبح کی نماز میں سو سے لے کر ساٹھ تک آیتیں تلاوت فرماتے اور ایسے وقت میں سلام پھیرتے تھے جب ہم ایک دوسرے کے چہرے کو پہچان سکتے تھے.",
                "urduNarrator": "ہم سے ابو کریب نے بیان کیا، کہا ہم سے سوید بن عمرو کلبی نے بیان کیا، انہوں نے حماد بن سلمہ سے، انہوں نے سیار بن سلمہ ابی المنہال سے، انہوں نے کہا: میں نے ابو بر زازہ اسلمی رضی اللہ عنہ کو کہتے سنا",
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو كُرَيْبٍ، حَدَّثَنَا سُوَيْدُ بْنُ عَمْرٍو الْكَلْبِيُّ، عَنْ حَمَّادِ بْنِ سَلَمَةَ، عَنْ سَيَّارِ بْنِ سَلَامَةَ أَبِي الْمِنْهَالِ، قَالَ: سَمِعْتُ أَبَا بَرْزَةَ الْأَسْلَمِيَّ، يَقُولُ: «كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُؤَخِّرُ الْعِشَاءَ إِلَى ثُلُثِ اللَّيْلِ، وَيَكْرَهُ النَّوْمَ قَبْلَهَا، وَالْحَدِيثَ بَعْدَهَا، وَكَانَ يَقْرَأُ فِي صَلَاةِ الْفَجْرِ مِنَ الْمِائَةِ إِلَى السِّتِّينَ، وَكَانَ يَنْصَرِفُ حِينَ يَعْرِفُ بَعْضُنَا وَجْهَ بَعْضٍ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9029,
                "hadithNumber": "1465",
                "englishNarrator": "Abu Dharr رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to me: How would you act when you are under the rulers who would delay the prayer beyond its prescribed time, or they would make prayer a dead thing as far as its proper time is concerned? I said: What do you command? He (the Holy Prophet) said: Observe the prayer at Its proper time, and if you can say it along with them do so, for it would be a superetogatory prayer for you. Khalaf (one of the narrators in the above hadith) has not mentioned beyond their (prescribed) time .",
                "hadithUrdu": "رسول اللہ ﷺ نے مجھے فرمایا : ’’تمھارا کیا حال ہوگا جب تم پر ایسے لوگ حکمران ہوں گے جو نماز کو اس کے وقت سے مؤخر کریں گے یا نماز کو اس کے وقت سے ختم کردیں گے ؟ ‘ ‘ میں نے عرض کیگ تو آپ مجھے ( اس کے بارے میں ) کیا حکم دیتے ہیں ؟ آپ نے فرمایا : ’’تم اپنے وقت پر نماز پڑھ لینا اگر تمھیں ان کے ساتھ ( بھی ) نماز مل جائے تو پڑھ لینا ، وہ تمھارے لیے نفل ہو جائے گی ۔ ‘ ‘ خلف نےعن وقتھا ( اس کے وقت سے ) کے الفاظ بیان نہیں کیے ۔",
                "urduNarrator": "خلف بن ہشام ، ابوربیع زہرانی اور ابو کامل جحدری نے حدیث بیان کی کی ، کہا ہمیں حماد بن زید نے حدیث سنائی ، انھوں نے ابو عمران جونی سے ، انھوں نے عبداللہ بن صامت سے اور انھوں نے حضرت ابو ذر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا خَلَفُ بْنُ هِشَامٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، ح قَالَ: وَحَدَّثَنِي أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، وَأَبُو كَامِلٍ الْجَحْدَرِيُّ، قَالَا: حَدَّثَنَا حَمَّادٌ، عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ، عَنْ عَبْدِ اللهِ بْنِ الصَّامِتِ، عَنْ أَبِي ذَرٍّ، قَالَ: قَالَ لِي رَسُولُ اللهِ: «كَيْفَ أَنْتَ إِذَا كَانَتْ عَلَيْكَ أُمَرَاءُ يُؤَخِّرُونَ الصَّلَاةَ عَنْ وَقْتِهَا؟ - أَوْ - يُمِيتُونَ الصَّلَاةَ عَنْ وَقْتِهَا؟» قَالَ: قُلْتُ: فَمَا تَأْمُرُنِي؟ قَالَ: «صَلِّ الصَّلَاةَ لِوَقْتِهَا، فَإِنْ أَدْرَكْتَهَا مَعَهُمْ، فَصَلِّ، فَإِنَّهَا لَكَ نَافِلَةٌ» وَلَمْ يَذْكُرْ خَلَفٌ: عَنْ وَقْتِهَ.",
                "headingArabic": "كَرَاهِيَةِ تَأْخِيرِ الصَّلاَةِ عَنْ وَقْتِهَا الْمُخْتَارِ وَمَا يَفْعَلُهُ الْمَأْمُومُ إِذَا أَخَّرَهَا الإِمَامُ",
                "headingUrdu": "نماز کو وقت سے زیادہ مؤخر کرنا مکروہ ہے اور اگر امام نماز میں تاخیر کرے تو کیا کرے؟",
                "headingEnglish": "It is disliked to delay the prayers beyond their proper times, and what a person should do if the Imam delays the prayer",
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9030,
                "hadithNumber": "1466",
                "englishNarrator": "Abu Dharr رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to me: O Abu Dharr, you would soon find after me rulers who would make their prayers dead. You should say prayer at its prescribed time. If you say prayer at its prescribed time that would be a supererogatory prayer for you, otherwise you saved your prayer.",
                "hadithUrdu": "رسول اللہ ﷺ نے مجھ سے کہا : ’’ابو ذر! میرے بعد ایسے حکمران آئیں گے جو نماز کو ماردیں گے ( ان کا وقت ختم کردیں گے ) تو تم نماز کو اس کے وقت پر پڑھ لینا ، اگر تم نے نماز وقت پرپڑھ لی تو ( ان کے ساتھ ادا کی گئی دوسری نماز ) تمھارے لیے نفل ہو جائے گی ورنہ تم نے اپنی نماز تو بچا ہی لی ہے.",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا,جعفر بن سلیمان نے ابو عمران جونس سے اسی سند کے ساتھ حضرت ابو ذر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا جَعْفَرُ بْنُ سُلَيْمَانَ، عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ، عَنْ عَبْدِ اللهِ بْنِ الصَّامِتِ، عَنْ أَبِي ذَرٍّ، قَالَ: قَالَ لِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «يَا أَبَا ذَرٍّ إِنَّهُ سَيَكُونُ بَعْدِي أُمَرَاءُ يُمِيتُونَ الصَّلَاةَ، فَصَلِّ الصَّلَاةَ لِوَقْتِهَا، فَإِنْ صَلَّيْتَ لِوَقْتِهَا كَانَتْ لَكَ نَافِلَةً، وَإِلَّا كُنْتَ قَدْ أَحْرَزْتَ صَلَاتَكَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9031,
                "hadithNumber": "1467",
                "englishNarrator": "Abu Dharr ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "My friend (the Holy Prophet ﷺ) bade me to hear and obey (the ruler) even if he is a slave having his feet and arms cut off, and observe prayer at its prescribed time. (And further said): It you find people having observed the prayer, you in fact saved your prayer, otherwise (if you join with them) that would be a Nafl prayer for you.",
                "hadithUrdu": "میرے خلیل نے مجھے حکم دیا تھا کہ میں سنوں اور فرمانبرداری کروں ، چاہے کٹے ہوئے بازوں والا غلام ( ہی حکمران ) ہو اور یہ کہ میں نماز وقت پر پڑھوں ( آپ ﷺ نے فرمایا : ) ’’پھر اگر تم لوگوں کو اس حالت میں پاؤ کہ انھوں نے نماز پڑھ لی ہے تو تم اپنی نماز بچا چکے ہو ( وقت پر پہلے پڑھ چکے ہو ) ، اور اگر ( انھوں نے نہیں پڑھی اور تم ان کے ساتھ شریک ہوئے ) تو تمھاری یہ نماز نفل ہو گی ۔ ‘ ‘",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے عبداللہ بن ادریس نے بیان کیا,شعبہ نے ابو عمران سے باقی ماندہ سابقہ سند کے ساتھ حضرت ابو ذر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللهِ بْنُ إِدْرِيسَ، عَنْ شُعْبَةَ، عَنْ أَبِي عِمْرَانَ، عَنْ عَبْدِ اللهِ بْنِ الصَّامِتِ، عَنْ أَبِي ذَرٍّ، قَالَ: «إِنَّ خَلِيلِي أَوْصَانِي أَنْ أَسْمَعَ وَأُطِيعَ، وَإِنْ كَانَ عَبْدًا مُجَدَّعَ الْأَطْرَافِ، وَأَنْ أُصَلِّيَ الصَّلَاةَ لِوَقْتِهَا، فَإِنْ أَدْرَكْتَ الْقَوْمَ وَقَدْ صَلَّوْا كُنْتَ قَدْ أَحْرَزْتَ صَلَاتَكَ، وَإِلَّا كَانَتْ لَكَ نَافِلَةً».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9032,
                "hadithNumber": "1468",
                "englishNarrator": "Abu Dharr رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) struck my thigh and said: How would you act if you survive among the people who would delay prayers beyond their (prescribed) time? He (Abu Dharr) said: What do you command (under this situation)? He (the Holy Prophet) slid: Observe prayer at its prescribed time, then go (to meet) your needs, and if the Iqama is pronounced, and you are present in the mosque, then observe prayer (along with the Jama'at).",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا اور میری ران پر ہاتھ مارا : ’’تمھارا کیاحال ہو گا جب تم ایسے لوگوں میں اپنی بقیہ زندگی گزار رہے ہو گے جو نماز کو اس کے وقت سے مؤخر کردیں گے ؟ ‘ ‘ ( عبداللہ بن صامت نے ) کہا : انھوں نے کہا : آپ کیا حکم دیتے ہیں ؟فرمایا : ’’تم نماز کواس کے وقت پر ادا کرلینا ، اور اپنی ضرورت کے لیے چلے جانا ، پھر اگر نماز کی اقامت کہی گئی اور تم مسجد میں ہوئے تو ( دوبارہ ) پڑھ لینا ۔ ‘ ‘",
                "urduNarrator": "مجھ سے یحییٰ بن حبیب الحارث نے بیان کیا، ہم سے خالد بن حارث نے بیان کیا، ہم سے شعبہ نے بیان کیا،بدیل سے روایت ہے ، انھوں نے کہا : میں نے ابو عالیہ سے سنا ، وہ عبداللہ بن صامت سے اور وہ حضرت ابو ذر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کر رہے تھے ، کہا",
                "hadithArabic": "وَحَدَّثَنِي يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا شُعْبَةُ، عَنْ بُدَيْلٍ، قَالَ: سَمِعْتُ أَبَا الْعَالِيَةِ، يُحَدِّثُ عَنْ عَبْدِ اللهِ بْنُ الصَّامِتِ، عَنْ أَبِي ذَرٍّ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَضَرَبَ فَخِذِي: «كَيْفَ أَنْتَ إِذَا بَقِيتَ فِي قَوْمٍ يُؤَخِّرُونَ الصَّلَاةَ عَنْ وَقْتِهَا؟» قَالَ: قَالَ: مَا تَأْمُرُ؟ قَالَ: «صَلِّ الصَّلَاةَ لِوَقْتِهَا، ثُمَّ اذْهَبْ لِحَاجَتِكَ، فَإِنْ أُقِيمَتِ الصَّلَاةُ وَأَنْتَ فِي الْمَسْجِدِ فَصَلِّ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9033,
                "hadithNumber": "1469",
                "englishNarrator": "Abu'l-'Aliyat al-Bara reported:",
                "hadithEnglish": "Ibn Ziyad delayed the prayer. 'Abdullah bin Samit came to me and I placed a chair for him and he sat in it and I made a mention of whit Ibn Ziyad had done. He bit hit lips (as a sign of extreme anger and annoyance) and struck at my thigh and said: I asked Abu Dharr ‌رضی ‌اللہ ‌عنہ ‌as you have asked me, and he struck my thigh just as I have struck your thigh, and said: I asked the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as you have asked me and he struck my thigh just as I have struck your thigh, and he (the Holy Prophet) said: Observe prayer at its prescribed time, and if you can say prayer along with them. do so, and do not say. I have observed prayer and so I shall not pray.",
                "hadithUrdu": "ابن زیاد نے نماز میں تاخیر کر دی تو میرے پاس عبداللہ بن صامت تشریف لے آئے ، میں نے ان کے لیے کرسی رکھوا دی ، وہ اس پر بیٹھ گئے ، میں نے ان کے سامنے ابن زیاد کی حرکت کا تذکرہ کیا تواس پر انھوں نے اپنا ( نچلا ) ہونٹ دانتوں میں دبایا اور میری ران پر ہاتھ مار کر کہا : جس طرح تم نے مجھ سے پوچھا ہے ، اسی طرح میں نے ابو ذر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے پوچھا تھا ، انھوں نے بھی اسی طرح میری ران پر ہاتھ مارا تھا جس طرح میں نے تمھاری ران پر ہاتھ مارا ہے اور کہا : میں نے رسول اللہ ﷺ سے پوچھا تھا جس طرح تم نے مجھ سے پوچھا ہے تو آپ ﷺ نے میری ران پر ہاتھ مارا جس طرح میں نے تمھاری ران پر ہاتھ مارا ہے اور فرمایا : ’’تم نماز بروقت ادا کرلینا ، پھر اگرتمھیں ان کے ساتھ نماز پڑھنی پڑھ تو ( پھر سے ) نماز پڑھ لینا اور یہ نہ کہنا : میں نے نماز پڑھ لی ہے اس لیے اب نہیں پڑھوں گا ۔ ‘ ‘",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے اسماعیل بن ابراہیم نے بیان کیا, ایوب نے ابو عالیہ برّاء سے روایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ أَيُّوبَ، عَنْ أَبِي الْعَالِيَةِ الْبَرَّاءِ، قَالَ: أَخَّرَ ابْنُ زِيَادٍ الصَّلَاةَ، فَجَاءَنِي عَبْدُ اللهِ بْنُ الصَّامِتِ، فَأَلْقَيْتُ لَهُ كُرْسِيًّا، فَجَلَسَ عَلَيْهِ، فَذَكَرْتُ لَهُ صَنِيعَ ابْنُ زِيَادٍ، فَعَضَّ عَلَى شَفَتِهِ، وَضَرَبَ فَخِذِي، وَقَالَ: إِنِّي سَأَلْتُ أَبَا ذَرٍّ كَمَا سَأَلْتَنِي، فَضَرَبَ فَخِذِي كَمَا ضَرَبْتُ فَخِذَكَ، وَقَالَ: إِنِّي سَأَلْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَمَا سَأَلْتَنِي، فَضَرَبَ فَخِذِي كَمَا ضَرَبْتُ فَخِذَكَ، وَقَالَ: «صَلِّ الصَّلَاةَ لِوَقْتِهَا، فَإِنْ أَدْرَكَتْكَ الصَّلَاةُ مَعَهُمْ فَصَلِّ، وَلَا تَقُلْ إِنِّي قَدْ صَلَّيْتُ فَلَا أُصَلِّي».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9034,
                "hadithNumber": "1470",
                "englishNarrator": "Abu Dharr رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "(The Messenger of Allah ﷺ) said: How would you, or how would thou, act if you survive to live among people who defer prayer beyond the (prescribed) time? (The narrator said: Allah and His Messenger know best). whereupon he said: Observe prayer at its prescribed time, but if the Iqama is pronounced for (congregational) prayer, then observe prayer along with them. for herein is an excess of virtue.",
                "hadithUrdu": "آپ ﷺ نے فرمایا : ’’تم لوگوں کا کیا حال ہو گا ‘ ‘ یا فرمایا : ’’تمھاری کیفیت کیا ہو گی جب تم ایسے لوگوں میں رہ جاؤ گے جو نماز کو اس کے وقت سے مؤخر کریں گے ؟ تم وقت پر نماز پڑھ لینا ، پھر اگر ( تمھاری موجودگی میں ) نماز کی اقامت ہو تو تم ان کے ساتھ ( بھی ) پڑھ لینا کیونکہ یہ نیکی میں اضافہ ہے ۔ ‘ ‘",
                "urduNarrator": "ہم سے عاصم بن النضْدر التیمی نے بیان کیا، ہم سے خالد بن حارث نے بیان کیا، ہم سے شعبہ نے بیان کیا، ابو نعامہ نے عبداللہ بن صامت سےاور انھوں نے حضرت ابو ذر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنَا عَاصِمُ بْنُ النَّضْرِ التَّيْمِيُّ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي نَعَامَةَ، عَنْ عَبْدِ اللهِ بْنِ الصَّامِتِ، عَنْ أَبِي ذَرٍّ، قَالَ: قَالَ: «كَيْفَ أَنْتُمْ؟» أَوْ قَالَ: «كَيْفَ أَنْتَ إِذَا بَقِيتَ فِي قَوْمٍ يُؤَخِّرُونَ الصَّلَاةَ عَنْ وَقْتِهَا؟ فَصَلِّ الصَّلَاةَ لِوَقْتِهَا، ثُمَّ إِنْ أُقِيمَتِ الصَّلَاةُ فَصَلِّ مَعَهُمْ، فَإِنَّهَا زِيَادَةُ خَيْرٍ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9035,
                "hadithNumber": "1471",
                "englishNarrator": "Abu'l-'Aliyat al-Bara' reported:",
                "hadithEnglish": "I said to 'Abdullah bin Samit: We say our Jumu'a prayer behind those rulers who defer the prayer. He ('Abdullah bin Samit), struck. my thigh that I felt pain and said: I asked Abu Dharr رضی ‌اللہ ‌عنہ ‌about it, he struck my thigh and said: I asked the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) about it. Upon this he said: Observe prayer at its prescribed time, and treat prayer along with them (along with those Imams who deter prayer) as Nafl. 'Abdullah said: It was narrated to me that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) struck the thigh of Abd Dharr رضی ‌اللہ ‌عنہ ‌.",
                "hadithUrdu": "میں نے عبداللہ بن صامت سے پوچھا کہ ہم جمعہ کے دن حکمرانوں کی اقتدا میں نماز پڑھتے ہیں اور وہ نماز کو مؤخر کر دیتے ہیں ۔ تو انھوں نے زور سے میری ران پر ہاتھ مارا جس سے مجھے تکلیف محسوس ہوئی اور کہا : میں نے اس کے بارےمیں ابو ذر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے پوچھا تو انھوں نے ( بھی ) میری ران پر ہاتھ مارا تھا اور کہا تھا : میں نے اس کے بارے میں رسول اللہ ﷺ سے سوال کیا تھا تو آپ نے فرمایا : ’’نماز اس کے وقت پر ادا رکر لو ، پھر ان ( حکمرانوں ) کے ساتھ اپنی نماز کو نفل بنالو ۔ ‘ ‘ کہا : عبداللہ نے کہا : مجھے بتایا گیا کہ نبی اکرم ﷺ نے ( بھی ) ابو ذر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی ران پر ہاتھ مارا تھا ۔",
                "urduNarrator": "مجھ سے ابو غسان المسمعی نے بیان کیا، معاذ نے جو ابن ہشام ہیں، مجھ سے میرے والد نے بیان کیا,مطر نے ابو عالیہ بّراء سے روایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنِي أَبُو غَسَّانَ الْمِسْمَعِيُّ، حَدَّثَنَا مُعَاذٌ وَهُوَ ابْنُ هِشَامٍ، حَدَّثَنِي أَبِي، عَنْ مَطَرٍ، عَنْ أَبِي الْعَالِيَةِ الْبَرَّاءِ، قَالَ: قُلْتُ لِعَبْدِ اللهِ بْنِ الصَّامِتِ: نُصَلِّي يَوْمَ الْجُمُعَةِ خَلْفَ أُمَرَاءَ فَيُؤَخِّرُونَ الصَّلَاةَ، قَالَ: فَضَرَبَ فَخِذِي ضَرْبَةً أَوْجَعَتْنِي، وَقَالَ: سَأَلْتُ أَبَا ذَرٍّ، عَنْ ذَلِكَ فَضَرَبَ فَخِذِي، وَقَالَ: سَأَلْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ، فَقَالَ: «صَلُّوا الصَّلَاةَ لِوَقْتِهَا، وَاجْعَلُوا صَلَاتَكُمْ مَعَهُمْ نَافِلَةً»، قَالَ: وَقَالَ عَبْدُ اللهِ: ذُكِرَ لِي أَنَّ نَبِيَّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ضَرَبَ فَخِذَ أَبِي ذَرٍّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9036,
                "hadithNumber": "1472",
                "englishNarrator": "Abu Huraira رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Prayer said in a congregation is twenty-five degrees more excellent than prayer said by a single person.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’ باجماعت نماز تمھارے اکیلے کی نماز سے پچیس گنا ہ افضل ہے",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا, مالک نےابن شہاب ( زہری ) سے ، انھوں نے سعید بن مسیب سے اور انھوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت یک کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «صَلَاةُ الْجَمَاعَةِ أَفْضَلُ مِنْ صَلَاةِ أَحَدِكُمْ وَحْدَهُ بِخَمْسَةٍ وَعِشْرِينَ جُزْءًا».",
                "headingArabic": "فَضْلِ صَلاَةِ الجَمَاعَةِ وَبَيَانِ التَّشْدِيدِ فِي التَّخَلُّفِ عَنْهَا ‏",
                "headingUrdu": "باجماعت نماز کی فضیلت، اور اس سے دور رہنے کی سخت تنبیہ کو واضح کرنا، اور یہ کہ یہ فرض کفایہ ہے۔",
                "headingEnglish": "The virtue of prayer in congregation, and clarifying the stern warning against staying away from it, and that it is fard kifayah",
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9037,
                "hadithNumber": "1473",
                "englishNarrator": "Abu Huraira ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Prayer said in a congregation is twenty-five degrees more excellent than prayer said by a single person. He (Abu Huraira ‌رضی ‌اللہ ‌عنہ ‌ ‌further) said: The angels of the night and the angels of the day meet together. Abu Huraira ‌رضی ‌اللہ ‌عنہ said: Recite it you like: Surely the recital of the Qur'an at dawn is witnessed (al-Qur'an, xvii. 78).",
                "hadithUrdu": "آپ نے فرمایا : ’’ سب کے ساتھ مل کر نماز پڑھنا اکیلے انسان کی نماز سے پچیس درجے افضل ہے ۔ ’’آپ نے فرمایا : ’’رات کے فرشتے اور دن کے فرشتے فجر کی نماز میں جمع ہوتے ہیں ۔ ‘ ‘ ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : تم چاہو تو یہ آیت پڑھ لو ( جو اس بات کی تصدیق کرتی ہے ) : ’’ اور فجر کے وقت قرآن پڑھنا بلاشبہ فجر کی قراءت میں حاضری دی جاتی ہے.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, عبدالاعلی نے معمر سے ، انھوں نے زہری سے ، اسی سند کے ساتھ حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انھوں نے نبی ﷺ سے روایت کی",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الْأَعْلَى، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «تَفْضُلُ صَلَاةٌ فِي الْجَمِيعِ عَلَى صَلَاةِ الرَّجُلِ وَحْدَهُ خَمْسًا وَعِشْرِينَ دَرَجَةً» قَالَ: «وَتَجْتَمِعُ مَلَائِكَةُ اللَّيْلِ، وَمَلَائِكَةُ النَّهَارِ فِي صَلَاةِ الْفَجْرِ»، قَالَ أَبُو هُرَيْرَةَ: اقْرَءُوا إِنْ شِئْتُمْ {وَقُرْآنَ الْفَجْرِ إِنَّ قُرْآنَ الْفَجْرِ كَانَ مَشْهُودًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9038,
                "hadithNumber": "1474",
                "englishNarrator": "Abu Huraira رضی ‌اللہ ‌عنہ said:",
                "hadithEnglish": "I heard the prophet ﷺ say...\" a hadith lie that Abdul-Ala from Mamar (no. 1473), except that he said, Twenty five times better in reward.\"",
                "hadithUrdu": "میں نے نبی ﷺ سے سنا ، آپ فرما رہے تھے ۔ ۔ ۔ ۔ آگے معمر سے عبدالاعلیٰ کی ( مذکورہ بالا ) حدیث کی ‌رضی ‌اللہ ‌عنہ ‌ ‌ طرح ہے ، اس کے سوا کہ انھوں نے ( درجے کی بجائے ) ’’پچیس جز ‘ ‘ کہا ۔",
                "urduNarrator": "مجھ سے ابوبکر بن اسحاق نے بیان کیا، کہا ہم سے ابوالیمان نے بیان کیا, شعیب نے زہری سے روایت کی ، کہا : مجھے سعیداور ابو سلمہ نے خبر دی کہ حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نےکہا",
                "hadithArabic": "وَحَدَّثَنِي أَبُو بَكْرِ بْنُ إِسْحَاقَ، حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ: أَخْبَرَنِي سَعِيدٌ، وَأَبُو سَلَمَةَ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ: سَمِعْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ بِمِثْلِ حَدِيثِ عَبْدِ الْأَعْلَى، عَنْ مَعْمَرٍ إِلَّا أَنَّهُ قَالَ: «بِخَمْسٍ وَعِشْرِينَ جُزْءًا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 8726,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=349",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=347",
                "label": "347",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=348",
                "label": "348",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=349",
                "label": "349",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=350",
                "label": "350",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=351",
                "label": "351",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=352",
                "label": "352",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=353",
                "label": "353",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=351",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=351",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=349",
        "to": 8750,
        "total": 40465
    }
}