{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 428,
        "data": [
            {
                "id": 10964,
                "hadithNumber": "3400",
                "englishNarrator": "Abdullah (bin Mas'ud) ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to us: O young men, those among you who can support a wife should marry, for it restrains eyes (from casting evil glances) and preserves one from immorality; but he who cannot afford It should observe fast for it is a means of controlling the sexual desire.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ہم سے فرمایا : \" اے جوانوں کی جماعت! تم میں سے جو شادی کرنے کی استطاعت رکھتا ہو وہ شادی کر لے ، یہ نگاہوں کو جھکانے اور شرمنگاہ کی حفاظت کرنے میں ( دوسری چیزوں کی نسبت ) بڑھ کر ہے ، اور جو استطاعت نہ پائے ، وہ خود پر روزے کو لازم کر لے ، یہ اس کے لیے اس کی خواہش کو قطع کرنے والا ہے.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، انہوں نے کہا ابومعاویہ نے ہمیں اعمش سے حدیث سنائی ، انہوں نے عمارہ بن عمیر سے ، انہوں نے عبدالرحمٰن بن یزید سے ، انہوں نے حضرت عبداللہ ( بن مسعود ) رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، قَالَا: حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ عُمَارَةَ بْنِ عُمَيْرٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، عَنْ عَبْدِ اللهِ، قَالَ: قَالَ لَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «يَا مَعْشَرَ الشَّبَابِ، مَنِ اسْتَطَاعَ مِنْكُمُ الْبَاءَةَ فَلْيَتَزَوَّجْ، فَإِنَّهُ أَغَضُّ لِلْبَصَرِ، وَأَحْصَنُ لِلْفَرْجِ، وَمَنْ لَمْ يَسْتَطِعْ فَعَلَيْهِ بِالصَّوْمِ، فَإِنَّهُ لَهُ وِجَاءٌ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10965,
                "hadithNumber": "3401",
                "englishNarrator": "Abu al-Rahman bin Yazid said:",
                "hadithEnglish": "I and my uncle 'Alqama and al-Aswad went to 'Abdullah bin Mas'ud (رضی اللہ عنہ). He (the narrator further) said: I was at that time young, and he narrated a hadith which it seemed he narrated for me that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said like one transmitted by Mu'awiya, and further added: I lost no time in marrying.",
                "hadithUrdu": "میں ، میرے چچا علقمہ ( بن قیس ) اور ( میرے بھائی ) اسود ( بن یزید بن قیس ) حضرت ابن مسعود رضی اللہ عنہ کی خدمت میں حاضر ہوئے ۔ کہا : میں ان دنوں جوان تھا ۔ انہوں نے ایک حدیث بیان کی ، مجھے یوں لگتا ہے کہ وہ انہوں نے میری وجہ سے بیان کی ۔ انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ۔ ۔ ۔ ( آگے ) ابومعاویہ کی حدیث کے مانند ہے ۔ اور ( یہ ) اضافہ کیا ، کہا : اس کے بعد میں نے زیادہ عرصہ توقف کیے بغیر شادی کر لی.",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ نے بیان کیا، انہوں نے کہا جریر نے ہمیں اعمش سے حدیث بیان کی ، انہوں نے عمارہ بن عمیر سے ، انہوں نے عبدالرحمٰن بن یزید ( بن قیس ) سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنِ الْأَعْمَشِ، عَنْ عُمَارَةَ بْنِ عُمَيْرٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، قَالَ: دَخَلْتُ أَنَا وَعَمِّي عَلْقَمَةُ، وَالْأَسْوَدُ عَلَى عَبْدِ اللهِ بْنِ مَسْعُودٍ قَالَ: وَأَنَا شَابٌّ يَوْمَئِذٍ، فَذَكَرَ حَدِيثًا رُئِيتُ أَنَّهُ حَدَّثَ بِهِ مِنْ أَجْلِي، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ أَبِي مُعَاوِيَةَ، وَزَادَ قَالَ: فَلَمْ أَلْبَثْ حَتَّى تَزَوَّجْتُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10966,
                "hadithNumber": "3402",
                "englishNarrator": "Abdul-Rahman bin Yazid reported on the authority of Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "We went to him, and I was the youngest of all (of us), but he did not mention: I lost no time in marrying.",
                "hadithUrdu": "ہم ان کی خدمت میں حاضر ہوئے ، میں سب سے کم عمر تھا ، آگے انہی کی حدیث کے مانند ہے ، ( مگر ) انہوں نے یہ نہیں کہا : \" اس کے بعد میں نے زیادہ عرصہ توقف کیے بغیر شادی کر لی.",
                "urduNarrator": "مجھ سے عبداللہ بن سعید الاشج نے بیان کیا، انہوں نے ہم سے بیان کیا وکیع نے ہمیں حدیث بیان کی ، کہا : ہمیں اعمش نے باقی ماندہ سابقہ سند کے ساتھ حضرت عبداللہ رضی اللہ عنہ سے روایت کی ، ( عبدالرحمن بن یزید نے ) کہا",
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللهِ بْنُ سَعِيدٍ الْأَشَجُّ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا الْأَعْمَشُ، عَنْ عُمَارَةَ بْنِ عُمَيْرٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، عَنْ عَبْدِ اللهِ، قَالَ: دَخَلْنَا عَلَيْهِ وَأَنَا أَحْدَثُ الْقَوْمِ. بِمِثْلِ حَدِيثِهِمْ. وَلَمْ يَذْكُرْ: فَلَمْ أَلْبَثْ حَتَّى تَزَوَّجْتُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10967,
                "hadithNumber": "3403",
                "englishNarrator": "Anas (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Some of the Companions of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) asked his (the Prophet's) wives about the acts that he performed in private. Someone among them (among his Companions) said: I will not marry women; someone among them said: I will not eat meat; and someone among them said: I will not lie down in bed. He (the Holy Prophet) praised Allah and glorified Him, and said: What has happened to these people that they say so and so, whereas I observe prayer and sleep too; I observe fast and suspend observing them; I marry women also? And he who turns away from my Sunnah, he has no relation with Me.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم کے صحابہ میں سے کچھ لوگوں نے نبی صلی اللہ علیہ وسلم کی ازدواج مطہرات سے آپ کی تنہائی کے معمولات کے بارے میں سوال کیا ، پھر ان میں سے کسی نے کہا : میں عورتوں سے شادی نہیں کروں گا ، کسی نے کہا : میں گوشت نہیں کھاؤں گا ، اور کسی نے کہا : میں بستر پر نہیں سوؤں گا ۔ ( آپ کو پتہ چلا ) تو آپ صلی اللہ علیہ وسلم نے اللہ کی حمد کی ، اس کی ثنا بیان کی اور فرمایا : \" لوگوں کا کیا حال ہے؟ انہوں نے اس اس طرح سے کہا ہے ۔ لیکن میں تو نماز پڑھتا ہوں اور آرام بھی کرتا ہوں ، روزے رکھتا ہوں اور افطار بھی کرتا ہوں اور عورتوں سے نکاح بھی کرتا ہوں ، جس نے میری سنت سے رغبت ہٹا لی وہ مجھ سے نہیں.",
                "urduNarrator": "مجھ سے ابوبکر بن نافع العبدی نے بیان کیا، ہم سے بہز نے بیان کیا، ہم سے حماد بن سلمہ نے ثابت کی سند سے بیان کیا،حضرت انس رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "وحَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ الْعَبْدِيُّ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، أَنَّ نَفَرًا مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ سَأَلُوا أَزْوَاجَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ عَمَلِهِ فِي السِّرِّ؟ فَقَالَ بَعْضُهُمْ: لَا أَتَزَوَّجُ النِّسَاءَ، وَقَالَ بَعْضُهُمْ: لَا آكُلُ اللَّحْمَ، وَقَالَ بَعْضُهُمْ: لَا أَنَامُ عَلَى فِرَاشٍ، فَحَمِدَ اللهَ وَأَثْنَى عَلَيْهِ. فَقَالَ: «مَا بَالُ أَقْوَامٍ قَالُوا كَذَا وَكَذَا؟ لَكِنِّي أُصَلِّي وَأَنَامُ، وَأَصُومُ وَأُفْطِرُ، وَأَتَزَوَّجُ النِّسَاءَ، فَمَنْ رَغِبَ عَنْ سُنَّتِي فَلَيْسَ مِنِّي».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10968,
                "hadithNumber": "3404",
                "englishNarrator": "Sa'd bin Abi Waqqas (رضی اللہ عنہ) reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) rejected (the idea) of Uthman bin Muz'un رضی اللہ عنہ living in celibacy (saying): And if he (the Holy Prophet ﷺ) had given me permission We would have got ourselves castrated.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے عثمان بن معظون رضی اللہ عنہ کی ( طرف سے ) نکاح کو ترک کر کے عبادت میں مشغولیت ( کے ارادے ) کو مسترد فرما دیا ۔ اگر آپ انہیں اجازت دے دیتے تو ہم سب خود کو خصی کر لیتے.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے عبداللہ بن المبارک نے بیان کیا اور ہم سے ابو کریب محمد بن العلاء نے بیان کیا، اور اس کا قول یہ ہے: ہم سے ابن المبارک نے بیان کیا, معمر نے زہری سے ، انہوں نے سعید بن مسیب سے اور انہوں نے سعد بن ابی وقاص رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللهِ بْنُ الْمُبَارَكِ، ح وحَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ، وَاللَّفْظُ لَهُ، أَخْبَرَنَا ابْنُ الْمُبَارَكِ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ، قَالَ: «رَدَّ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى عُثْمَانَ بْنِ مَظْعُونٍ التَّبَتُّلَ، وَلَوْ أَذِنَ لَهُ لَاخْتَصَيْنَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10969,
                "hadithNumber": "3405",
                "englishNarrator": "Sa'id bin al-Musayyib reported:",
                "hadithEnglish": "I heard Sa'd (bin Abi Waqqas) saying that the idea of 'Uthman bin Maz'un ‌رضی ‌اللہ ‌عنہ ‌ ‌ for living in celibacy was rejected (by the Holy Prophet ﷺ), and if he had been given permission they would have got themselves castrated.",
                "hadithUrdu": "میں نے سعد سے سنا وہ کہہ رہے تھے ’’عثمان بن معظون ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے ترک نکاح کو ( ارادے کو ) رسول اللہ ﷺ کی طرف سے رد کر دیا گیا ‘ اگر انہیں اجازت مل جاتی تو ہم سب خصی ہو جاتے.",
                "urduNarrator": "مجھ سے ابو عمران محمد بن جعفر بن زیاد نے بیان کیا، انہوں نے ہم سے بیان کیا ابراھیم بن سعد نے ہمیں ابن شہاب زہری سے حدیث بیان کی انہو ں نے سعید بن مسیب سے روایت کی ‘ انہوں نے کہا کہ",
                "hadithArabic": "وحَدَّثَنِي أَبُو عِمْرَانَ مُحَمَّدُ بْنُ جَعْفَرِ بْنِ زِيَادٍ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، قَالَ: سَمِعْتُ سَعْدًا، يَقُولُ: «رُدَّ عَلَى عُثْمَانَ بْنِ مَظْعُونٍ التَّبَتُّلُ، وَلَوْ أُذِنَ لَهُ لَاخْتَصَيْنَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10970,
                "hadithNumber": "3406",
                "englishNarrator": "Sa'id bin al Musayyib heard Sa'd bin Abi Waqqas (رضی اللہ عنہ) saying:",
                "hadithEnglish": "Uthman bin Maz'un رضی اللہ عنہ decided to live in celibacy, but Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم) forbade him to do so, and if he had permitted him, we would have got ourselves castrated.",
                "hadithUrdu": "عثمان بن معضون رضی اللہ عنہ نے ارادہ کیا کہ وہ ( عبادے کے لئے نکاح اور گھرداری سے ) الگ ہو جائیں تو رسول اللہ صلی اللہ علیہ وسلم نے انہیں منع فرما دیا ، اگر آپ انہیں اس کی اجازت دے دیتے تو ہم سب خصی ہو جاتے.",
                "urduNarrator": "ہم سے محمد بن رافع نے بیان کیا، ہم سے حوین بن المثنیٰ نے بیان کیا، ہم سے لیث نے بیان کیا،عقیل نے ابن شہاب سے روایت کی ، انہوں نے کہا : مجھے سعید بن مسیب نے خبر دی کہ انہوں نے سعد بن ابی وقاص رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا حُجَيْنُ بْنُ الْمُثَنَّى، حَدَّثَنَا لَيْثٌ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ قَالَ: أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيِّبِ، أَنَّهُ سَمِعَ سَعْدَ بْنَ أَبِي وَقَّاصٍ، يَقُولُ: «أَرَادَ عُثْمَانُ بْنُ مَظْعُونٍ أَنْ يَتَبَتَّلَ، فَنَهَاهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَلَوْ أَجَازَ لَهُ ذَلِكَ لَاخْتَصَيْنَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10971,
                "hadithNumber": "3407",
                "englishNarrator": "Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) saw a woman, and so he came to his wife, Zainab رضی اللہ عنہا , as she was tanning a leather and had sexual intercourse with her. He then went to his Companions and told them: The woman advances and retires in the shape of a devil, so when one of you sees a woman, he should come to his wife, for that will repel what he feels in his heart.",
                "hadithUrdu": "ایک عورت پر رسول اللہ صلی اللہ علیہ وسلم کی نظر پڑ گئی تو آپ اپنی اہلیہ حضرت زینب رضی اللہ عنہا کے پاس آئے ۔ وہ اپنے لیے ایک چمڑے کو رنگ رہی تھیں ، آپ نے ( گھر میں ) اپنی ضرورت پوری فرمائی ، پھر اپنے صحابہ کی طرف تشریف لے گئے ، اور فرمایا : \" بلاشبہ ( فتنے میں ڈالنے کے حوالے سے ) عورت شیطان کی صورت میں سامنے آتی ہے اور شیطان ہی کی صورت میں مڑکر واپس جاتی ہے ۔ تم میں سے کوئی جب کسی عورت کو دیکھے تو وہ اپنی بیوی کے پاس آ جائے ، بلاشبہ یہ چیز اس خواہش کو ہتا دے گی جو اس کے دل میں ( پیدا ہوئی ) ہے ، \"",
                "urduNarrator": "ہم سے عمرو بن علی نے بیان کیا، کہا ہم سے عبد الاعلٰی نے بیان کیا، انہوں نے بیان کیاہشام بن ابی عبداللہ نے ابوزبیر سے حدیث بیان کی ، انہوں نے حضرت جابر رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا عَبْدُ الْأَعْلَى، حَدَّثَنَا هِشَامُ بْنُ أَبِي عَبْدِ اللهِ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ رَأَى امْرَأَةً، فَأَتَى امْرَأَتَهُ زَيْنَبَ، وَهِيَ تَمْعَسُ مَنِيئَةً لَهَا، فَقَضَى حَاجَتَهُ، ثُمَّ خَرَجَ إِلَى أَصْحَابِهِ، فَقَالَ: «إِنَّ الْمَرْأَةَ تُقْبِلُ فِي صُورَةِ شَيْطَانٍ، وَتُدْبِرُ فِي صُورَةِ شَيْطَانٍ، فَإِذَا أَبْصَرَ أَحَدُكُمُ امْرَأَةً فَلْيَأْتِ أَهْلَهُ، فَإِنَّ ذَلِكَ يَرُدُّ مَا فِي نَفْسِهِ».",
                "headingArabic": "نَدْبِ مَنْ رَأَى امْرَأَةً فَوَقَعَتْ فِي نَفْسِهِ إِلَى أَنْ يَأْتِيَ امْرَأَتَهُ أَوْ جَارِيَتَهُ فَيُوَاقِعَهَا",
                "headingUrdu": "عورت کو دیکھ کر اس کی طرف متوجہ ہونے والے کو اپنی بیوی یا لونڈی کے پاس جانے اور اس سے جماع کرنے کی سفارش",
                "headingEnglish": "Recommendation to the one who sees a woman and is attracted to her, to go to his wife or slave woman and have intercourse with her",
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10972,
                "hadithNumber": "3408",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saw a woman; and the rest of the hadith was narrated but (with this exception) that he said he came to his wife Zainab رضی اللہ عنہا , who was tanning a (piece of) leather, and he made no mention of: She retires in the shape of satan.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم کی نظر ایک عورت پر پڑ گئی ۔ ۔ ۔ آگے اسی کے مانند بیان کیا ، البتہ انہوں نے کہا : آپ صلی اللہ علیہ وسلم اپنی بیوی زینب رضی اللہ عنہا کے پاس آئے جبکہ وہ چمڑے کو رنگ رہی تھیں ۔ اور یہ نہیں کہا : \" وہ شیطان کی صورت میں واپس آ جاتی ہے.",
                "urduNarrator": "ہم سے زہیر بن حرب نے بیان کیا، ہم سے عبد الصمد بن عبد الوارث نے بیان کیا، انہوں نے ہم سے بیان کیا حرب بن ابوعالیہ نے ہمیں حدیث بیان کی ، کہا : ہمیں ابوزبیر نے جابر بن عبداللہ رضی اللہ عنہ سے حدیث بیان کی کہ",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ، حَدَّثَنَا حَرْبُ بْنُ أَبِي، الْعَالِيَةِ حَدَّثَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم رَأَى امْرَأَةً ‏.‏ فَذَكَرَ بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ فَأَتَى امْرَأَتَهُ زَيْنَبَ وَهْىَ تَمْعَسُ مَنِيئَةً ‏.‏ وَلَمْ يَذْكُرْ تُدْبِرُ فِي صُورَةِ شَيْطَانٍ .‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10973,
                "hadithNumber": "3409",
                "englishNarrator": "Jabir رضی اللہ عنہ heard Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) say:",
                "hadithEnglish": "When a woman fascinates any one of you and she captivates his heart, he should go to his wife and have an intercourse with her, for it would repel what he feels.",
                "hadithUrdu": "\" جب تم میں سے کسی کو ، کوئی عورت اچھی لگے ، اور اس کے دل میں جاگزیں ہو جائے تو وہ اپنی بیوی کا رخ کرے اور اس سے صحبت کرے ، بلاشبہ یہ ( عمل ) اس کیفیت کو دور کر دے گا جو اس کے دل میں ( پیدا ہوئی ) ہے.\"",
                "urduNarrator": "مجھ سے سلمہ بن شبیب نے بیان کیا، کہا ہم سے حسن بن عیان نے بیان کیا,معقل نے ابوزبیر سے روایت کی ، کہا : حضرت جابر رضی اللہ عنہ نے کہا : میں نے نبی اکرم صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا",
                "hadithArabic": "وحَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنْ أَبِي الزُّبَيْرِ، قَالَ: قَالَ جَابِرٌ: سَمِعْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِذَا أَحَدُكُمْ أَعْجَبَتْهُ الْمَرْأَةُ، فَوَقَعَتْ فِي قَلْبِهِ، فَلْيَعْمِدْ إِلَى امْرَأَتِهِ فَلْيُوَاقِعْهَا، فَإِنَّ ذَلِكَ يَرُدُّ مَا فِي نَفْسِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10974,
                "hadithNumber": "3410",
                "englishNarrator": "Abdullah (bin Mas'ud) رضی اللہ عنہ reported:",
                "hadithEnglish": "We were on an expedition with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and we had no women with us. We said: Should we not have ourselves castrated? He (the Holy Prophet) forbade us to do so He then granted us permission that we should contract temporary marriage for a stipulated period giving her a garment, and 'Abdullah رضی اللہ عنہ then recited this verse: 'Those who believe do not make unlawful the good things which Allah has made lawful for you, and do not transgress. Allah does not like transgressors (al-Qur'an, v. 87).",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کی معیت میں جہاد کرتے تھے اور ہمارے پاس عورتیں نہیں ہوتی تھیں ، تو ہم نے ( آپ سے ) دریافت کیا : کیا ہم خصی نہ ہو جائیں؟ آپ نے ہمیں اس سے منع فرما دیا ، پھر آپ نے ہمیں رخصت دی کہ ہم کسی عورت سے ایک کپڑے ( یا ضرورت کی کسی اور چیز ) کے عوض مقررہ وقت تک نکاح کر لیں ، پھر حضرت عبداللہ رضی اللہ عنہ نے ( یہ آیت ) تلاوت کی : \" اے لوگو جو ایمان لائے! وہ پاکیزہ چیزیں حرام مت ٹھہراؤ جو اللہ نے تمہارے لیے حلال کی ہیں اور حد سے نہ بڑھو ، بے شک اللہ تعالیٰ حد سے بڑھنے والوں کو پسند نہیں کرتا.",
                "urduNarrator": "محمد بن عبداللہ بن نمیر ہمدانی نے کہا : میرے والد نے اور وکیع اور ابن بشیر نے ہمیں اسماعیل سے حدیث بیان کی ، انہوں نے قیس سے روایت کی ، کہا : میں نے عبداللہ ( بن مسعود ) رضی اللہ عنہ کو کہتے ہوئے سنا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ الْهَمْدَانِيُّ، حَدَّثَنَا أَبِي، وَوَكِيعٌ، وَابْنُ بِشْرٍ، عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ، قَالَ: سَمِعْتُ عَبْدَ اللهِ، يَقُولُ: كُنَّا نَغْزُو مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، لَيْسَ لَنَا نِسَاءٌ، فَقُلْنَا: أَلَا نَسْتَخْصِي؟ فَنَهَانَا عَنْ ذَلِكَ، ثُمَّ رَخَّصَ لَنَا أَنْ نَنْكِحَ الْمَرْأَةَ بِالثَّوْبِ إِلَى أَجَلٍ ، ثُمَّ قَرَأَ عَبْدُ اللهِ: {يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تُحَرِّمُوا طَيِّبَاتِ مَا أَحَلَّ اللهُ لَكُمْ وَلَا تَعْتَدُوا إِنَّ اللهَ لَا يُحِبُّ الْمُعْتَدِينَ.",
                "headingArabic": "نِكَاحِ الْمُتْعَةِ وَبَيَانِ أَنَّهُ أُبِيحَ ثُمَّ نُسِخَ ثُمَّ أُبِيحَ ثُمَّ نُسِخَ وَاسْتَقَرَّ تَحْرِيمُهُ إِلَى يَوْمِ الْقِيَامَةِ",
                "headingUrdu": "متعہ نکاح: حلال ہوا پھر منسوخ، پھر حلال پھر منسوخ، اور قیامت تک حرام رہے گا۔",
                "headingEnglish": "Mut'ah Marriage: It was permitted then abrograted, then permitted then abrogated, and it will remain Forbidden until the day of resurrection",
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10975,
                "hadithNumber": "3411",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Jarir with the same chain of transmitters and he also recited this (above-mentioned verse) to us, but he did not say that 'Abdullah رضی اللہ عنہ recited it.",
                "hadithUrdu": "ہم سے عثمان بن ابی شیبہ نے بیان کیا, جریر نے اسماعیل بن ابی خالد سے اسی سند کے ساتھ ، اسی کے مانند حدیث بیان کی اور کہا : \" پھر انہوں نے ہمارے سامنے یہ آیت پڑھی ۔ \" انہوں نے ( نام لے کر \" عبداللہ رضی اللہ عنہ نے پڑھی \" نہیں کہا.",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، بِهَذَا الْإِسْنَادِ، مِثْلَهُ. وَقَالَ: ثُمَّ قَرَأَ عَلَيْنَا هَذِهِ الْآيَةَ، وَلَمْ يَقُلْ: قَرَأَ عَبْدُ اللهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10976,
                "hadithNumber": "3412",
                "englishNarrator": "This hadith has been narrated on the authority of Isma'il with the same chain of transmitters (and the words are):",
                "hadithEnglish": "We were young, so we said: Allah's Messenger, should we not have ourselves castrated? But he (the narrator) did not say; We were on an expedition.",
                "hadithUrdu": "ہم سب نوجوان تھے تو ہم نے عرض کی : اے اللہ کے رسول! کیا ہم خصی نہ ہو جائیں؟ اور انہوں نے نغزو ( ہم جہاد کرتے تھے ) کے الفاظ نہیں کہے.",
                "urduNarrator": "ابوبکر بن ابی شیبہ نے کہا : ہمیں وکیع نے اسماعیل سے اسی سند کے ساتھ حدیث بیان کی ، اور کہا",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ إِسْمَاعِيلَ، بِهَذَا الْإِسْنَادِ، قَالَ: كُنَّا وَنَحْنُ شَبَابٌ، فَقُلْنَا: يَا رَسُولَ اللهِ، أَلَا نَسْتَخْصِي؟ وَلَمْ يَقُلْ: نَغْزُو.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10977,
                "hadithNumber": "3413",
                "englishNarrator": "Jabir bin 'Abdullah and Salama bin al-Akwa' رضی اللہ عنہم said:",
                "hadithEnglish": "There came to us the proclaimer of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) has granted you permission to benefit yourselves, i. e. to contract temporary marriage with women.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کا ایک منادی کرنے والا ہمارے پاس آیا اور اعلان کیا : بلاشبہ رسول اللہ صلی اللہ علیہ وسلم نے تمہیں استمتاع ( فائدہ اٹھانے ) ، یعنی عورتوں سے ( نکاح ) متعہ کرنے کی اجازت دی ہے.",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا، کہا ہم سے محمد بن جعفر نے بیان کیا, شعبہ نے ہمیں عمرو بن دینار سے حدیث بیان کی ، انہوں نے کہا : میں نے حسن بن محمد سے سنا ، وہ جابر بن عبداللہ اور سلمہ بن اکوع رضی اللہ عنہم سے حدیث بیان کر رہے تھے ، ان دونوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ دِينَارٍ، قَالَ: سَمِعْتُ الْحَسَنَ بْنَ مُحَمَّدٍ، يُحَدِّثُ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، وَسَلَمَةَ بْنِ الْأَكْوَعِ، قَالَا: خَرَجَ عَلَيْنَا مُنَادِي رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «إِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَدْ أَذِنَ لَكُمْ أَنْ تَسْتَمْتِعُوا» يَعْنِي مُتْعَةَ النِّسَاءِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10978,
                "hadithNumber": "3414",
                "englishNarrator": "Salama bin al Akwa' and Jabir bin Abdullah رضی اللہ عنہم reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came to us and permitted us to contract temporary marriage.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ہمارے پاس آئے ( اعلان کی صورت میں آپ کا پیغام آیا ) اور ہمیں متعہ کی اجازت دی.",
                "urduNarrator": "مجھ سے امیہ بن بسطام العیشی نے بیان کیا، کہا ہم سے یزید نے بیان کیا، یعنی ابن زرعی نے بیان کیا، انہوں نے بیان کیاروح بن قاسم نے ہمیں عمرو بن دینار سے حدیث بیان کی ، انہوں نے حسن بن محمد سے ، انہوں نے سلمہ بن اکوع اور جابر بن عبداللہ رضی اللہ عنہم سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنِي أُمَيَّةُ بْنُ بِسْطَامَ الْعَيْشِيُّ، حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ، حَدَّثَنَا رَوْحٌ يَعْنِي ابْنَ الْقَاسِمِ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ، عَنْ سَلَمَةَ بْنِ الْأَكْوَعِ، وَجَابِرِ بْنِ عَبْدِ اللهِ، «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَتَانَا فَأَذِنَ لَنَا فِي الْمُتْعَةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10979,
                "hadithNumber": "3415",
                "englishNarrator": "Ibn Uraij reported: 'Ata' said:",
                "hadithEnglish": "Jabir bin Abdullah رضی اللہ عنہ came to perform 'Umra, and we came to his abode, and the people asked him about different things, and then they made a mention of temporary marriage, whereupon he said: Yes, we had been benefiting ourselves by this temporary marriage during the lifetime of the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and during the time of Abu Bakr and 'Umar رضی اللہ عنہما .",
                "hadithUrdu": "حضرت جابر بن عبداللہ رضی اللہ عنہ عمرے کے لیے آئے تو ہم ان کی رہائش گاہ پر ان کی خدمت میں حاضر ہوئے ، لوگوں نے ان سے مختلف چیزوں کے بارے میں پوچھا ، پھر لوگوں نے متعے کا تذکرہ کیا تو انہوں نے کہا : ہاں ، ہم نے رسول اللہ صلی اللہ علیہ وسلم ، ابوبکر اور عمر رضی اللہ عنہما کے عہد میں متعہ کیا.",
                "urduNarrator": "ہم سے الحسن الحلوانی نے بیان کیا، کہا ہم سے عبد الرزاق نے بیان کیا، کہا ہم سے ابن جریج نے بیان کیا، انہوں نے کہا عطاء نے کہا",
                "hadithArabic": "وحَدَّثَنَا الْحَسَنُ الْحُلْوَانِيُّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ: قَالَ عَطَاءٌ: قَدِمَ جَابِرُ بْنُ عَبْدِ اللهِ مُعْتَمِرًا، فَجِئْنَاهُ فِي مَنْزِلِهِ، فَسَأَلَهُ الْقَوْمُ عَنْ أَشْيَاءَ، ثُمَّ ذَكَرُوا الْمُتْعَةَ، فَقَالَ: «نَعَمْ، اسْتَمْتَعْنَا عَلَى عَهْدِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَأَبِي بَكْرٍ، وَعُمَرَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10980,
                "hadithNumber": "3416",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "We contracted temporary marriage giving a handful of (tales or flour as a dower during the lifetime of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and durnig the time of Abu Bakr   رضی اللہ عنہ until 'Umar رضی اللہ عنہ forbade it in the case of 'Amr bin Huraith.",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ کے دور میں ایک مٹھی کھجور اور آٹے کے عوض چند دنوں کے لئے متعہ کرتے تھے ، حتی کہ حضرت عمر رضی اللہ عنہ نے عمرو بن حُریث کے واقعے ( کے دوران ) میں اس سے منع کر دیا.",
                "urduNarrator": "مجھ سے محمد بن رافع نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، کہا ہم سے ابن جریج نے بیان کیا، انہوں نے کہا مجھے ابوزبیر نے خبر دی ، کہا : میں نے جابر بن عبداللہ رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، قَالَ: سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللهِ، يَقُولُ: «كُنَّا نَسْتَمْتِعُ بِالْقَبْضَةِ مِنَ التَّمْرِ وَالدَّقِيقِ، الْأَيَّامَ عَلَى عَهْدِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَأَبِي بَكْرٍ، حَتَّى نَهَى عَنْهُ عُمَرُ، فِي شَأْنِ عَمْرِو بْنِ حُرَيْثٍ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10981,
                "hadithNumber": "3417",
                "englishNarrator": "Abu Nadra reported:",
                "hadithEnglish": "While I was in the company of Jabir bin Abdullah رضی اللہ عنہ , a person came to him and said that Ibn 'Abbas and Ibn Zubair رضی اللہ عنہم differed on the two types of Mut'as (Tamattu' of Hajj 1846 and Tamattu' with women), whereupon Jabir رضی اللہ عنہ said: We used to do these two during the lifetime of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). Umar رضی اللہ عنہ then forbade us to do them, and so we did not revert to them.",
                "hadithUrdu": "میں جابر بن عبداللہ رضی اللہ عنہ کے پاس تھا کہ ان کے پاس ایک آنے والا ( ملاقاتی ) آیا اور کہنے لگا : حضرت ابن عباس اور ابن زبیر رضی اللہ عنہم نے دونوں متعتوں ( حج تمتع اور نکاح متعہ ) کے بارے میں اختلاف کیا ہے ۔ تو حضرت جابر رضی اللہ عنہ نے کہا : ہم نے رسول اللہ صلی اللہ علیہ وسلم کے عہد میں وہ دونوں کام کیے ، پھر حضرت عمر رضی اللہ عنہ نے ہمیں ان دونوں سے منع کر دیا ، پھر ہم نے دوبارہ ان کا رخ نہیں کیا.",
                "urduNarrator": "ہم سے حمید بن عمر البکراوی نے بیان کیا، کہا کہ ہم سے عبد الواحد یعنی ابن زیاد نے عاصم کی سند سے بیان کیا, ابونضرہ سے روایت ہے ، کہا",
                "hadithArabic": "حَدَّثَنَا حَامِدُ بْنُ عُمَرَ الْبَكْرَاوِيُّ، حَدَّثَنَا عَبْدُ الْوَاحِدِ يَعْنِي ابْنَ زِيَادٍ، عَنْ عَاصِمٍ، عَنْ أَبِي نَضْرَةَ، قَالَ: كُنْتُ عِنْدَ جَابِرِ بْنِ عَبْدِ اللهِ، فَأَتَاهُ آتٍ، فَقَالَ: ابْنُ عَبَّاسٍ وَابْنُ الزُّبَيْرِ اخْتَلَفَا فِي الْمُتْعَتَيْنِ، فَقَالَ جَابِرٌ: «فَعَلْنَاهُمَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، ثُمَّ نَهَانَا عَنْهُمَا عُمَرُ، فَلَمْ نَعُدْ لَهُمَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10982,
                "hadithNumber": "3418",
                "englishNarrator": "Iyas bin Salama رضی اللہ عنہ reported on the authority of his father:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) gave sanction for contracting temporary marriage for three nights in the year of Autas 1847 and then forbade it.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے اوطاس کے سال تین دن متعے کی اجازت دی ، پھر اس سے منع فرما دیا.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے یونس بن محمد نے بیان کیا، کہا ہم سے عبد الواحد بن زیاد نے بیان کیا، کہا ہم سے ابو عمیس نے بیان کیا, ایاس بن سلمہ نے اپنے والد ( سلمہ بن اکوع رضی اللہ عنہ ) سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، حَدَّثَنَا أَبُو عُمَيْسٍ، عَنْ إِيَاسِ بْنِ سَلَمَةَ، عَنْ أَبِيهِ، قَالَ: «رَخَّصَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَامَ أَوْطَاسٍ، فِي الْمُتْعَةِ ثَلَاثًا، ثُمَّ نَهَى عَنْهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10983,
                "hadithNumber": "3419",
                "englishNarrator": "Sabra Juhanni رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) permitted temporary marriage for us. So I and another person went out and saw a woman of Bana 'Amir, who was like a young long-necked she-camel. We presented ourselves to her (for contracting temporary marriage), whereupon she said: What dower would you give me? I said: My cloak. And my companion also said: My cloak. And the cloak of-my companion was superior to my cloak, but I was younger than he. So when she looked at the cloak of my companion she liked it, and when she cast a glance at me I looked more attractive to her. She then said: Well, you and your cloak are sufficient for me. I remained with her for three nights, and then Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: He who has any such woman with whom he had contracted temporary marriage, he should let her off.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ہمیں ( نکاح ) متعہ کی اجازت دی ۔ میں اور ایک آدمی بنو عامر کی ایک عورت کے پاس گئے ، وہ جوان اور لمبی گردن والی خوبصورت اونٹنی جیسی تھی ، ہم نے خود کو اس کے سامنے پیش کیا تو اس نے کہا : کیا دو گے؟ میں نے کہا : اپنی چادر ۔ اور میرے ساتھی نے بھی کہا : اپنی چادر ۔ میرے ساتھی کی چادر میری چادر سے بہتر تھی ، اور میں اس سے زیادہ جوان تھا ۔ جب وہ میرے ساتھی کی چادر کی طرف دیکھتی تو وہ اسے اچھی لگتی اور جب وہ میری طرف دیکھتی تو میں اس کے دل کو بھاتا ، پھر اس نے ( مجھ سے ) کہا : تم اور تمہاری چادر ہی میرے لیے کافی ہے ۔ اس کے بعد میں تین دن اس کے ساتھ رہا ، پھر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جس کسی کے پاس ان عورتوں میں سے ، جن سے وہ متعہ کرتا ہے ، کوئی ( عورت ) ہو ، تو وہ اس کا راستہ چھوڑ دے.",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, لیث نے ہمیں ربیع بن سبرہ جہنی سے حدیث بیان کی ، انہوں نے اپنے والد سبرہ ( بن معبد جہنی رضی اللہ عنہ ) سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنِ الرَّبِيعِ بْنِ سَبْرَةَ الْجُهَنِيِّ، عَنْ أَبِيهِ سَبْرَةَ، أَنَّهُ قَالَ: أَذِنَ لَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِالْمُتْعَةِ، فَانْطَلَقْتُ أَنَا وَرَجُلٌ إِلَى امْرَأَةٍ مِنْ بَنِي عَامِرٍ، كَأَنَّهَا بَكْرَةٌ عَيْطَاءُ، فَعَرَضْنَا عَلَيْهَا أَنْفُسَنَا، فَقَالَتْ: مَا تُعْطِي؟ فَقُلْتُ: رِدَائِي، وَقَالَ صَاحِبِي: رِدَائِي، وَكَانَ رِدَاءُ صَاحِبِي أَجْوَدَ مِنْ رِدَائِي، وَكُنْتُ أَشَبَّ مِنْهُ، فَإِذَا نَظَرَتْ إِلَى رِدَاءِ صَاحِبِي أَعْجَبَهَا، وَإِذَا نَظَرَتْ إِلَيَّ أَعْجَبْتُهَا، ثُمَّ قَالَتْ: أَنْتَ وَرِدَاؤُكَ يَكْفِينِي، فَمَكَثْتُ مَعَهَا ثَلَاثًا، ثُمَّ إِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ كَانَ عِنْدَهُ شَيْءٌ مِنْ هَذِهِ النِّسَاءِ الَّتِي يَتَمَتَّعُ، فَلْيُخَلِّ سَبِيلَهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10984,
                "hadithNumber": "3420",
                "englishNarrator": "Rabi' bin Sabra reported:",
                "hadithEnglish": "His father went on an expedition with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) during the Victory of Mecca, and we stayed there for fifteen days (i. e. for thirteen full days and a day and a night), and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) permitted us to contract temporary marriage with women. So I and another person of my tribe went out, and I was more handsome than he, whereas he was almost ugly. Each one of us had a cloaks, My cloak was worn out, whereas the cloak of my cousin was quite new. As we reached the lower or the upper side of Mecca, we came across a young woman like a young smart long-necked she-camel. We said: Is it possible that one of us may contract temporary marriage with you? She said: What will you give me as a dower? Each one of us spread his cloak. She began to cast a glance on both the persons. My companion also looked at her when she was casting a glance at her side and he said: This cloak of his is worn out, whereas my cloak is quite new. She, however, said twice or thrice: There is no harm in (accepting) this cloak (the old one). So I contracted temporary marriage with her, and I did not come out (of this) until Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) declared it forbidden.",
                "hadithUrdu": "ان کے والد نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ غزوہ فتح مکہ میں شرکت کی ، کہا : ہم نے وہاں پندرہ روز ۔ ۔ ۔ ( الگ الگ دن اور راتیں گنیں تو ) تیس شب و روز ۔ ۔ قیام کیا ۔ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں عورتوں سے متعہ کرنے کی اجازت دے دی ، چنانچہ میں اور میری قوم کا ایک آدمی نکلے ۔ مجھے حسن میں اس پر ترجیح حاصل تھی اور وہ تقریبا بدصورت تھا ۔ ہم دونوں میں سے ہر ایک کے پاس چادر تھی ، میری چادر پرانی تھی اور میرے چچا زاد کی چادر نئی ( اور ) ملائم تھی ، حتی کہ جب ہم مکہ کے نشیبی علاقے میں یا اس کے بالائی علاقے میں پہنچے تو ہماری ملاقات لمبی گردن والی جوان اور خوبصورت اونٹنی جیسی عورت سے ہوئی ، ہم نے کہا : کیا تم چاہتی ہو کہ ہم میں سے کوئی ایک تمہارے ساتھ متعہ کرے؟ اس نے کہا : تم دونوں کیا خرچ کرو گے؟ اس پر ہم میں سے ہر ایک نے اپنی اپنی چادر ( اس کے سامنے ) پھیلا دی ، اس پر اس نے دونوں آدمیوں کو دیکھنا شروع کر دیا اور میرا ساتھی اس کو دیکھنے لگا اور اس کے پہلو پر نظریں گاڑ دیں اور کہنے لگا : اس کی چادر پرانی ہے اور میری چادر نئی اور ملائم ہے ۔ اس پر وہ کہنے لگی : اس کی چادر میں بھی کوئی خرابی نہیں ۔ تین بار یا دو بار یہ بات ہوئی ۔ پھر میں نے اس سے متعہ کر لیا اور پھر میں اس کے ہاں سے ( اس وقت تک ) نہ نکلا حتیٰ کہ رسول اللہ صلی اللہ علیہ وسلم نے اسے ( متعے کو ) حرام قرار دے دیا.",
                "urduNarrator": "ہم سے ابو کامل فضیل بن حسین الجہدری نے بیان کیا، انہوں نے بیان کیابشر بن مفضل نے ہمیں حدیث بیان کی ، کیا : ہمیں عمارہ بن غزیہ نے ربیع بن سبرہ سے حدیث بیان کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو كَامِلٍ فُضَيْلُ بْنُ حُسَيْنٍ الْجَحْدَرِيُّ، حَدَّثَنَا بِشْرٌ يَعْنِي ابْنَ مُفَضَّلٍ، حَدَّثَنَا عُمَارَةُ بْنُ غَزِيَّةَ، عَنِ الرَّبِيعِ بْنِ سَبْرَةَ، أَنَّ أَبَاهُ، «غَزَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَتْحَ مَكَّةَ»، قَالَ: فَأَقَمْنَا بِهَا خَمْسَ عَشْرَةَ - ثَلَاثِينَ بَيْنَ لَيْلَةٍ وَيَوْمٍ - فَأَذِنَ لَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي مُتْعَةِ النِّسَاءِ، فَخَرَجْتُ أَنَا وَرَجُلٌ مِنْ قَوْمِي، وَلِي عَلَيْهِ فَضْلٌ فِي الْجَمَالِ، وَهُوَ قَرِيبٌ مِنَ الدَّمَامَةِ، مَعَ كُلِّ وَاحِدٍ مِنَّا بُرْدٌ، فَبُرْدِي خَلَقٌ، وَأَمَّا بُرْدُ ابْنِ عَمِّي فَبُرْدٌ جَدِيدٌ، غَضٌّ، حَتَّى إِذَا كُنَّا بِأَسْفَلِ مَكَّةَ - أَوْ بِأَعْلَاهَا - فَتَلَقَّتْنَا فَتَاةٌ مِثْلُ الْبَكْرَةِ الْعَنَطْنَطَةِ، فَقُلْنَا: هَلْ لَكِ أَنْ يَسْتَمْتِعَ مِنْكِ أَحَدُنَا؟ قَالَتْ: وَمَاذَا تَبْذُلَانِ؟ فَنَشَرَ كُلُّ وَاحِدٍ مِنَّا بُرْدَهُ، فَجَعَلَتْ تَنْظُرُ إِلَى الرَّجُلَيْنِ، وَيَرَاهَا صَاحِبِي تَنْظُرُ إِلَى عِطْفِهَا، فَقَالَ: إِنَّ بُرْدَ هَذَا خَلَقٌ، وَبُرْدِي جَدِيدٌ غَضٌّ، فَتَقُولُ: بُرْدُ هَذَا لَا بَأْسَ بِهِ ثَلَاثَ مِرَارٍ - أَوْ مَرَّتَيْنِ - ثُمَّ اسْتَمْتَعْتُ مِنْهَا، فَلَمْ أَخْرُجْ حَتَّى حَرَّمَهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10985,
                "hadithNumber": "3421",
                "englishNarrator": "Rabi' bin S'abra al-jahanni reported on the authority of his father:",
                "hadithEnglish": "We went with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) to Mecca during the year of Victory and he narrated like this a hadith transmitted by Bishr (the previous one) but with this addition: She said: Can it be possible? And it is also mentioned in it: He said: The cloak of this (man) is old and worn out.",
                "hadithUrdu": "فتح مکہ کے سال ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ مکہ کی طرف نکلے ، آگے بشر کی حدیث کے مانند بیان کیا اور یہ اضافہ کیا : اس عورت نے کہا : کیا یہ ( متعہ ) جائز ہے؟ اور اسی ( روایت ) میں ہے : ( میرے ساتھی نے ) کہا : اس کی چادر پرانی بوسیدہ ہے.",
                "urduNarrator": "مجھ سے احمد بن سعید بن صخر الدارمی نے بیان کیا، کہا ہم سے ابو النعمان نے بیان کیا، انہوں نے کہا ہمیں وُہَیب نے حدیث بیان کی ، کہا : ہمیں عُمارہ بن غزیہ نے حدیث بیان کی ، کہا : ربیع بن سبرہ جہنی نے اپنے والد سے حدیث بیان کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي أَحْمَدُ بْنُ سَعِيدِ بْنِ صَخْرٍ الدَّارِمِيُّ، حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا عُمَارَةُ بْنُ غَزِيَّةَ، حَدَّثَنِي الرَّبِيعُ بْنُ سَبْرَةَ الْجُهَنِيُّ، عَنْ أَبِيهِ، قَالَ: خَرَجْنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَامَ الْفَتْحِ إِلَى مَكَّةَ، فَذَكَرَ بِمِثْلِ حَدِيثِ بِشْرٍ، وَزَادَ قَالَتْ: وَهَلْ يَصْلُحُ ذَاكَ؟ وَفِيهِ: قَالَ: إِنَّ بُرْدَ هَذَا خَلَقٌ مَحٌّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10986,
                "hadithNumber": "3422",
                "englishNarrator": "Sabra al-Juhani reported on the authority of his father:",
                "hadithEnglish": "While he was with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) he said: O people, I had permitted you to contract temporary marriage with women, but Allah has forbidden it (now) until the Day of Resurrection. So he who has any (woman with this type of marriage contract) he should let her off, and do not take back anything you have given to them (as dower).",
                "hadithUrdu": "وہ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے ، آپ صلی اللہ علیہ وسلم نے فرمایا : \" لوگو! بےشک میں نے تمہیں عورتوں سے متعہ کرنے کی اجازت دی تھی ، اور بلاشبہ اب اللہ تعالیٰ نے اسے قیامت کے دن تک کے لیے حرام کر دیا ہے ، اس لیے جس کسی کے پاس ان عورتوں میں سے کوئی ( عورت موجود ) ہو تو وہ اس کا راستہ چھوڑ دے ، اور جو کچھ تم لوگوں نے انہیں دیا ہے اس میں سے کوئی چیز ( واپس ) مت لو.",
                "urduNarrator": "عبداللہ بن نمیر نے کہا : ہمیں عبدالعزیز بن عمر نے حدیث بیان کی ، کہا : مجھے ربیع بن سبرہ جہنی نے حدیث سنائی کہ ان کے والد نے انہیں حدیث بیان کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عُمَرَ، حَدَّثَنِي الرَّبِيعُ بْنُ سَبْرَةَ الْجُهَنِيُّ، أَنَّ أَبَاهُ، حَدَّثَهُ، أَنَّهُ كَانَ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «يَا أَيُّهَا النَّاسُ، إِنِّي قَدْ كُنْتُ أَذِنْتُ لَكُمْ فِي الِاسْتِمْتَاعِ مِنَ النِّسَاءِ، وَإِنَّ اللهَ قَدْ حَرَّمَ ذَلِكَ إِلَى يَوْمِ الْقِيَامَةِ، فَمَنْ كَانَ عِنْدَهُ مِنْهُنَّ شَيْءٌ فَلْيُخَلِّ سَبِيلَهُ، وَلَا تَأْخُذُوا مِمَّا آتَيْتُمُوهُنَّ شَيْئًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10987,
                "hadithNumber": "3423",
                "englishNarrator": "This hadith has been narrated on the authority of 'Abdul-'Aziz bin 'Umar with the same chain of transmitters, and he said:",
                "hadithEnglish": "I saw Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) standing between the pillar and the gate (of the Ka'ba) and he was relating a hadith as narrated by Ibn Numair.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو حجر اسود اور ( بیت اللہ کے ) دروازے کے درمیان کھڑے ہوئے دیکھا ، اور آپ فرما رہے تھے ۔ ۔ ۔ ( آگے ) ابن نمیر کی حدیث کی طرح ہے.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، انہوں نے کہا عبدہ بن سلیمان نے عبدالعزیز بن عمر سے اسی سند کے ساتھ حدیث بیان کی ، کہا",
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ عَبْدِ الْعَزِيزِ بْنِ عُمَرَ، بِهَذَا الْإِسْنَادِ، قَالَ: رَأَيْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَائِمًا بَيْنَ الرُّكْنِ وَالْبَابِ، وَهُوَ يَقُولُ: بِمِثْلِ حَدِيثِ ابْنِ نُمَيْرٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10988,
                "hadithNumber": "3424",
                "englishNarrator": "Abdul-Malik bin Rabi' bin Sabraal-Juhanni reported on the authority of his father who narrated it on the authority of his father (i.e. 'Abdul-Malik's grandfather, Sabura al-Juhanniy:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) permitted us to contract temporary marriage in the Year of Victory, as we entered Mecca, and we did come out of it but he forbade us to do it.",
                "hadithUrdu": "فتح مکہ کے سال جب ہم مکہ میں داخل ہوئے تو رسول اللہ صلی اللہ علیہ وسلم نے ہمیں ( نکاح ) متعہ ( کے جواز ) کا حکم دیا ، پھر ابھی ہم وہاں سے نکلے نہ تھے کہ آپ نے ہمیں اس سے منع فرما دیا.",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے یحییٰ بن آدم نے بیان کیا، کہا ہم سے ابراہیم بن سعد نے بیان کیا, عبدالملک بن ربیع بن سبرہ جہنی نے اپنے والد کے حوالے سے اپنے دادا ( سبرہ بن معبد رضی اللہ عنہ ) سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ عَبْدِ الْمَلِكِ بْنِ الرَّبِيعِ بْنِ سَبْرَةَ الْجُهَنِيِّ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ: «أَمَرَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِالْمُتْعَةِ عَامَ الْفَتْحِ، حِينَ دَخَلْنَا مَكَّةَ، ثُمَّ لَمْ نَخْرُجْ مِنْهَا حَتَّى نَهَانَا عَنْهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 10676,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=427",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=425",
                "label": "425",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=426",
                "label": "426",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=427",
                "label": "427",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=428",
                "label": "428",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=429",
                "label": "429",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=430",
                "label": "430",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=431",
                "label": "431",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=429",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=429",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=427",
        "to": 10700,
        "total": 40465
    }
}