{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 398,
        "data": [
            {
                "id": 10214,
                "hadithNumber": "2650",
                "englishNarrator": "Qais bin Sakan رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Al-Ash'ath bin Qais رضی اللہ تعالیٰ عنہ went to 'Abdullah رضی اللہ تعالیٰ عنہ on the day of 'Ashura while he was eating. He said: Abu Muhammad, come near and dine. Upon this he said: I am fasting. Thereupon he said: We used to observe fast and then (this practice) was abandoned.",
                "hadithUrdu": "اشعث بن قیس رضی اللہ تعالیٰ عنہ عاشورہ کے دن حضرت عبداللہ بن مسعود رضی اللہ تعالیٰ عنہ کی خدمت میں اس حال میں آئے کہ آپ کھارہے تھے تو انہوں نے فرمایا اے ابو محمد! قریب ہوجاؤ اور کھاؤ انہوں نے کہا میں روزے سے ہوں حضرت عبداللہ نے فرمایا کہ ہم بھی اس د ن ر وزہ رکھتے تھے لیکن چھوڑ دیا ۔",
                "urduNarrator": "ابو بکر بن ابی شیبہ ، وکیع ، یحییٰ بن سعید ، سفیان ، محمد بن حاتم ، زبید یامی ، عمارۃ بن عمیر ، حضرت قیس بن سکن رضی اللہ تعالیٰ عنہ سے روایت ہے کہ",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، وَيَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ، عَنْ سُفْيَانَ، ح وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنِي زُبَيْدٌ الْيَامِيُّ، عَنْ عُمَارَةَ بْنِ عُمَيْرٍ، عَنْ قَيْسِ بْنِ سَكَنٍ، أَنَّ الْأَشْعَثَ بْنَ قَيْسٍ، دَخَلَ عَلَى عَبْدِ اللهِ يَوْمَ عَاشُورَاءَ، وَهُوَ يَأْكُلُ، فَقَالَ: يَا أَبَا مُحَمَّدٍ ادْنُ فَكُلْ، قَالَ: إِنِّي صَائِمٌ، قَالَ: «كُنَّا نَصُومُهُ ثُمَّ تُرِكَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10215,
                "hadithNumber": "2651",
                "englishNarrator": "Alqama رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Ash'ath bin Qais رضی اللہ تعالیٰ عنہ went to Ibn Mas'udd while he was eating on the day of Ashura. Thereupon he said: Abu Abdul-Rahman, it is the day of 'Ashura (and you are eating). Upon this he said: Fast was observed on (this day) before the (fasting) in Ramadan was made obligatory, but when it was made obligatory, (fasting on the day of 'Ashura) was abandoned. So if you are not fasting, then take food.",
                "hadithUrdu": "اشعث بن قیس رضی اللہ تعالیٰ عنہ ابن مسعود کے پاس عاشورہ کے دن اس حال میں آئے کہ وہ کھاناکھارہے تھے توانہوں نے فرمایا کہ اے ابو عبدالرحمان! آج تو عاشورہ ہے؟تو ابن مسعود رضی اللہ تعالیٰ عنہ نے فرمایا کہ رمضان کے روزے فرض ہونے سے پہلے روزہ رکھا جاتاتھا تو جب رمضان کے روزے فرض ہوگئے یہ روزہ چھوڑ دیا گیا کہ اگر تیرا روزہ نہیں تو تو بھی کھا ۔",
                "urduNarrator": "محمد بن حاتم ، اسحاق بن منصور ، اسرائیل ، منصور ، ابراہیم ، علقمہ ، اشعث بن قیس ، علی ابن مسعود ، حضرت علقمہ رضی اللہ تعالیٰ عنہ سے روایت ہے کہ",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، قَالَ: دَخَلَ الْأَشْعَثُ بْنُ قَيْسٍ عَلَى ابْنِ مَسْعُودٍ وَهُوَ يَأْكُلُ يَوْمَ عَاشُورَاءَ فَقَالَ: يَا أَبَا عَبْدِ الرَّحْمَنِ، إِنَّ الْيَوْمَ يَوْمُ عَاشُورَاءَ فَقَالَ: «قَدْ كَانَ يُصَامُ قَبْلَ أَنْ يَنْزِلَ رَمَضَانُ، فَلَمَّا نَزَلَ رَمَضَانُ، تُرِكَ، فَإِنْ كُنْتَ مُفْطِرًا فَاطْعَمْ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10216,
                "hadithNumber": "2652",
                "englishNarrator": "Jabir bin Samura رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) commanded us to observe fast on the day of Ashura and exhorted us to do it and was particular about it But when (fasting) in Ramadan was made obligatory, he hence. forth neither commanded us nor forbade us, nor was he so particular about it.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم عاشورہ کے دن ر وزہ رکھنے کا حکم فرماتے تھے اور ہمیں اس پر آمادہ کرتے تھے اور اس کا اہتمام کرتے تھے تو جب رمضان کے روزے فرض کردیئے گئے تو پھر آپ نہ ہمیں اس کا حکم فرماتے اور نہ اس سے منع فرماتے اور نہ ہی اسکا اہتمام فرماتے ۔",
                "urduNarrator": "ابو بکر ابن ابی شیبہ ، عبیداللہ بن موسیٰ ، شیبان ، اشعث بن ابی شعشاء ، جعفر بن ابی ثور ، حضرت جابر بن سمرۃ رضی اللہ تعالیٰ عنہ سے روایت ہے کہ فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُوسَى، أَخْبَرَنَا شَيْبَانُ، عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ، عَنْ جَعْفَرِ بْنِ أَبِي ثَوْرٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ رَضِيَ اللهُ عَنْهُ، قَالَ: «كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُنَا بِصِيَامِ يَوْمِ عَاشُورَاءَ، وَيَحُثُّنَا عَلَيْهِ، وَيَتَعَاهَدُنَا عِنْدَهُ، فَلَمَّا فُرِضَ رَمَضَانُ، لَمْ يَأْمُرْنَا، وَلَمْ يَنْهَنَا وَلَمْ يَتَعَاهَدْنَا عِنْدَهُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10217,
                "hadithNumber": "2653",
                "englishNarrator": "Abdul-Rahman رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "He heard Mu'awiya bin Abu Sufyan delivering a sermon in Medina. i.e. when he came there (for Hajj). He delivered a sermon on the day of 'Ashura and said: People of Medina, where are your scholars? I heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) say on this very day: It is the day of 'Ashura. Allah has not made fasting on This day obligatory for you but I am fasting. He who likes to observe fast among you should do so, and he who likes not to observe it may not observe it.",
                "hadithUrdu": "انہوں نے حضرت معاویہ بن ابی سفیان کا مدینہ میں خطبہ سنا یعنی جب وہ مدینہ آئے تو انہوں نے عاشورہ کے دن خطبہ دیا اور فرمایا اے مدینہ والو! کہاں ہیں تمہارے علماء؟میں نے رسول اللہ صلی اللہ علیہ وسلم کو اس دن کے لئے فرماتے ہوئے سنا کہ یہ عاشورہ کا دن ہے اور اللہ تعالیٰ نے تم پر اس دن کا روزہ فرض نہیں کیا اور میں روزے سے ہوں تو جو تم میں سے پسند کر تا ہو کہ وہ روزہ رکھے تو اسے چاہیے کہ وہ روزہ رکھ لے اور جو تم میں سے پسند کرتا ہو کہ وہ افطارکرلے تو اسے چاہیے کہ وہ افطار کرلے ۔",
                "urduNarrator": "حرملہ بن یحییٰ ، ابن وہب ، یونس ، ابن شہاب ، حضرت حمید بن عبدالرحمن رضی اللہ تعالیٰ عنہ خبر دیتے ہیں کہ",
                "hadithArabic": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّهُ سَمِعَ مُعَاوِيَةَ بْنَ أَبِي سُفْيَانَ، خَطِيبًا بِالْمَدِينَةِ - يَعْنِي فِي قَدْمَةٍ قَدِمَهَا - خَطَبَهُمْ يَوْمَ عَاشُورَاءَ، فَقَالَ: أَيْنَ عُلَمَاؤُكُمْ؟ يَا أَهْلَ الْمَدِينَةِ، سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ - لِهَذَا الْيَوْمِ - «هَذَا يَوْمُ عَاشُورَاءَ، وَلَمْ يَكْتُبِ اللهُ عَلَيْكُمْ صِيَامَهُ، وَأَنَا صَائِمٌ، فَمَنْ أَحَبَّ مِنْكُمْ أَنْ يَصُومَ فَلْيَصُمْ، وَمَنْ أَحَبَّ أَنْ يُفْطِرَ فَلْيُفْطِرْ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10218,
                "hadithNumber": "2654",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been narrated on the authority of Ibn Shihab رضی اللہ تعالیٰ عنہ  through the same chain of transmitters.",
                "hadithUrdu": "ابو طاہر عبداللہ ، عبداللہ بن وہب ، مالک بن انس ، حضرت ابن شہاب رضی اللہ تعالیٰ عنہ سے اس سند کے ساتھ مذکورہ حدیث کی طرح روایت کیا گیا ہے ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ، حَدَّثَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، أَخْبَرَنِي مَالِكُ بْنُ أَنَسٍ، عَنِ ابْنِ شِهَابٍ، فِي هَذَا الْإِسْنَادِ، بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10219,
                "hadithNumber": "2655",
                "englishNarrator": "It was narrated from Az-Zuhri with this chain of transmitters:",
                "hadithEnglish": "He heard Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying on a similar day: I am fasting today, so he who wishes to observe fast should do so; but he did not make mention of the rest of the hadith.",
                "hadithUrdu": "انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو اس طرح کے دن فرماتے ہوئے سنا: \"میں روزہ سے ہوں، لہٰذا جو شخص روزہ رکھنا چاہے وہ روزہ رکھے۔\" انہوں نے مالک اور یونس کی باقی حدیث کا ذکر نہیں کیا۔",
                "urduNarrator": "ابن ابی عمر ، سفیان بن عینیہ ، حضرت زہری سے اس سند کے ساتھ روایت ہے کہ",
                "hadithArabic": "وحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، بِهَذَا الْإِسْنَادِ، سَمِعَ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي مِثْلِ هَذَا الْيَوْمِ: «إِنِّي صَائِمٌ، فَمَنْ شَاءَ أَنْ يَصُومَ فَلْيَصُمْ» وَلَمْ يَذْكُرْ بَاقِي حَدِيثِ مَالِكٍ، وَيُونُسَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10220,
                "hadithNumber": "2656",
                "englishNarrator": "Ibn Abbas (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "When Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came to Medina, he found the Jews observing the fast on the day of Ashura. They (the Jews) were asked about it and they said: It is the day on which Allah granted victory to Moses and (his people) Bani Isra'il over the Pharaoh and we observe fast out of gratitude to Him. Upon this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: We have a closer connection with Moses than you have, and he commanded to observe fast on this day.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم مدینہ تشریف لائے تو آپ صلی اللہ علیہ وسلم نے یہودیوں کو عاشورہ کے دن روزہ رکھتے ہوئے پایا تو لوگوں نے ان سے اس روزے کےبارے میں پوچھا تو وہ کہنے لگے کہ یہ وہ دن ہے کہ جس میں اللہ تعالیٰ نے حضر ت موسیٰ علیہ السلام کو اور بنی اسرائیل کو فرعون پر غلبہ عطا فرمایا تھا تو ہم اس دن کی عظمت کی وجہ سے روزہ رکھتے ہیں ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ہم تم سے زیادہ حضرت موسیٰ علیہ السلام کے قریب ہیں تو آپ صلی اللہ علیہ وسلم نے اس روزے کا حکم فرمایا ۔",
                "urduNarrator": "یحییٰ بن یحییٰ ، ہشیم ابی بشر ، سعید بن جبیر ، حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت ہے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا، قَالَ: قَدِمَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ، فَوَجَدَ الْيَهُودَ يَصُومُونَ يَوْمَ عَاشُورَاءَ فَسُئِلُوا عَنْ ذَلِكَ؟ فَقَالُوا: هَذَا الْيَوْمُ الَّذِي أَظْهَرَ اللهُ فِيهِ مُوسَى، وَبَنِي إِسْرَائِيلَ عَلَى فِرْعَوْنَ، فَنَحْنُ نَصُومُهُ تَعْظِيمًا لَهُ، فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «نَحْنُ أَوْلَى بِمُوسَى مِنْكُمْ فَأَمَرَ بِصَوْمِهِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10221,
                "hadithNumber": "2657",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated by Ibn Bishr رضی اللہ تعالیٰ عنہ with the same chain of transmitters (but with a slight variation) that he (the Holy Prophet) inquired of them (Jews) about it (fasting on the day of 'Ashura).",
                "hadithUrdu": "ابن بشار ، ابو بکر بن نافع ، محمد بن جعفر ، شعبہ ، ابی بشراس سندکے ساتھ حضرت ابی بشر رضی اللہ تعالیٰ عنہ سے اسی طرح روایت نقل کی گئی ہے اور اس میں ہے کہ آپ نے ان سے اس کی وجہ پوچھی ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَاه ابْنُ بَشَّارٍ، وَأَبُو بَكْرِ بْنُ نَافِعٍ، جَمِيعًا عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ، عَنْ شُعْبَةَ، عَنْ أَبِي بِشْرٍ، بِهَذَا الْإِسْنَادِ، وَقَالَ: فَسَأَلَهُمْ عَنْ ذَلِكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10222,
                "hadithNumber": "2658",
                "englishNarrator": "Ibn'Abbas ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) arrived in Medina and found the Jews observing fast on the day of 'Ashura. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to them: What is the (significance) of this day that you observe fast on it? They said: It is the day of great (significance) when Allah delivered Moses and his people, and drowned the Pharaoh and his people, and Moses observed fast out of gratitude and we also observe it. Upon this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: We have more right, and we have a closer connection with Moses than you have; so Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) observed fast (on the day of 'Ashura), and gave orders that it should be observed.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم جب مدینہ تشریف لائے تو آپ نے یہودیوں کو عاشورہ کے دن روزہ رکھتے ہوئے پایا تو رسول اللہ صلی اللہ علیہ وسلم نے ان سے فرمایا کہ اس دن کی کیا وجہ ہے؟تو وہ کہنے لگے کہ یہ وہ عظیم دن ہے کہ جس میں اللہ تعالیٰ نے موسیٰ علیہ السلام اور ان کی قوم کونجات عطا فرمائی اور فرعون اور اس کی قوم کو غرق فرمایا چنانچہ حضرت موسیٰ علیہ السلام نے شکرانے کاروزہ رکھا اس لئے ہم بھی روزہ رکھتے ہیں ، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ہم زیادہ حق دار ہیں اور تم سے زیادہ موسیٰ علیہ السلام کے قریب ہیں تو رسول اللہ صلی اللہ علیہ وسلم نے بھی عاشورہ کے دن روزہ رکھا اور اپنے صحابہ رضوان اللہ عنھم اجمعین کو بھی روزہ رکھنے کا حکم فرمایا ۔",
                "urduNarrator": "ابن ابی عمر ، سفیان ، ایوب ، عبداللہ بن سعید بن جبیر ، حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت ہے کہ",
                "hadithArabic": "وحَدَّثَنِي ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَيُّوبَ، عَنْ عَبْدِ اللهِ بْنِ سَعِيدِ بْنِ جُبَيْرٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَدِمَ الْمَدِينَةَ فَوَجَدَ الْيَهُودَ صِيَامًا، يَوْمَ عَاشُورَاءَ، فَقَالَ لَهُمْ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَا هَذَا الْيَوْمُ الَّذِي تَصُومُونَهُ؟» فَقَالُوا: هَذَا يَوْمٌ عَظِيمٌ، أَنْجَى اللهُ فِيهِ مُوسَى وَقَوْمَهُ، وَغَرَّقَ فِرْعَوْنَ وَقَوْمَهُ، فَصَامَهُ مُوسَى شُكْرًا، فَنَحْنُ نَصُومُهُ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «فَنَحْنُ أَحَقُّ وَأَوْلَى بِمُوسَى مِنْكُمْ فَصَامَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَأَمَرَ بِصِيَامِهِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10223,
                "hadithNumber": "2659",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Ayyub with the same chain of transmitters.",
                "hadithUrdu": "اسحاق بن ابراہیم ، عبدالرزاق ، معمر ، حضرت ایوب سے اس سند کے ساتھ اسی طرح روایت نقل کی گئی ہے سوائے اس کے کہ اس میں ابن سعید بن جبیر ہے نام ذکر نہیں کیاگیا ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ أَيُّوبَ، بِهَذَا الْإِسْنَادِ، إِلَّا أَنَّهُ قَالَ: عَنِ ابْنِ سَعِيدِ بْنِ جُبَيْرٍ لَمْ يُسَمِّهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10224,
                "hadithNumber": "2660",
                "englishNarrator": "Abu Musa ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "The day of 'Ashura was one which the Jews respected and they treated it as Id. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: You also observe fast on this day.",
                "hadithUrdu": "یہودی لوگ عاشورہ کے دن کی تعظیم کرتے تھے اور اسے عید سمجھتے تھے تو رسول اللہ صلی اللہ علیہ وسلم نے ارشاد فرمایا کہ تم بھی اس دن کو روزہ رکھو ۔",
                "urduNarrator": "ابو بکر بن ابی شیبہ ، ابن نمیر ، ابو اسامہ ، ابی عمیس ، قیس بن سالم ، طارق بن شہاب ، حضرت ابو موسیٰ رضی اللہ تعالیٰ عنہ سے روایت ہے فرمایا کہ",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ نُمَيْرٍ، قَالَا: حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ أَبِي عُمَيْسٍ، عَنْ قَيْسِ بْنِ مُسْلِمٍ، عَنْ طَارِقِ بْنِ شِهَابٍ، عَنْ أَبِي مُوسَى رَضِيَ اللهُ عَنْهُ، قَالَ: كَانَ يَوْمُ عَاشُورَاءَ يَوْمًا تُعَظِّمُهُ الْيَهُودُ، وَتَتَّخِذُهُ عِيدًا، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «صُومُوهُ أَنْتُمْ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10225,
                "hadithNumber": "2661",
                "englishNarrator": "Abu Musa رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "The people of Khaibar (most of them were Jews) observed fast on the day of 'Ashura and they treated it as 'Id and gave their women ornaments and beautiful dresses to wear. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: You (only) observe fast on this day.",
                "hadithUrdu": "خیبر کے یہودی عاشورہ کے دن روزہ رکھتے تھے اور اسے عید سمجھتے تھے اور اپنی عورتوں کو زیور پہناتے اور بناؤ سنگھار کرتے تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ تم بھی اس دن کو روزہ رکھو ۔",
                "urduNarrator": "احمد بن منذر ، حماد بن اسامہ ، ابو عمیس ، قیس ، صدقہ بن ابی عمران ، قیس بن سالم ، طارق بن شہاب ، حضرت ابو موسیٰ رضی اللہ تعالیٰ عنہ سے روایت ہے فرماتے ہیں کہ",
                "hadithArabic": "وحَدَّثَنَاه أَحْمَدُ بْنُ الْمُنْذِرِ، حَدَّثَنَا حَمَّادُ بْنُ أُسَامَةَ، حَدَّثَنَا أَبُو الْعُمَيْسِ، أَخْبَرَنِي قَيْسٌ، فَذَكَرَ بِهَذَا الْإِسْنَادِ مِثْلَهُ، وَزَادَ: قَالَ أَبُو أُسَامَةَ، فَحَدَّثَنِي صَدَقَةُ بْنُ أَبِي عِمْرَانَ، عَنْ قَيْسِ بْنِ مُسْلِمٍ، عَنْ طَارِقِ بْنِ شِهَابٍ، عَنْ أَبِي مُوسَى رَضِيَ اللهُ عَنْهُ، قَالَ: كَانَ أَهْلُ خَيْبَرَ يَصُومُونَ يَوْمَ عَاشُورَاءَ، يَتَّخِذُونَهُ عِيدًا وَيُلْبِسُونَ نِسَاءَهُمْ فِيهِ حُلِيَّهُمْ وَشَارَتَهُمْ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «فَصُومُوهُ أَنْتُمْ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10226,
                "hadithNumber": "2662",
                "englishNarrator": "Ibn Abbas رضی اللہ تعالیٰ عنہ was asked about observing of fast on the day of Ashura, whereupon he said:",
                "hadithEnglish": "I do not know Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) singling out any day's fast and considering it more excellent than another, except this day (the day of Ashura) and this month, meaning the month of Ramadan.",
                "hadithUrdu": "میں نہیں جانتا کہ رسول اللہ صلی اللہ علیہ وسلم نے اس عاشورہ کے دن کے علاوہ کسی اور دن کی وجہ سے روزہ رکھا ہو اور نہ کسی مہینے میں سوائے اس مہینے یعنی رمضان کے ۔",
                "urduNarrator": "ابو بکر ابن شیبہ ، عمروناقد ، سفیان ، ابو بکر ، ابن عینیہ ، عبیداللہ ابن ابی یزید ، حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے عاشورہ کے دن کے روزوں کے بارے میں پوچھا گیا تو ا نہوں نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، جَمِيعًا عَنْ سُفْيَانَ - قَالَ أَبُو بَكْرٍ، حَدَّثَنَا ابْنُ عُيَيْنَةَ - عَنْ عُبَيْدِ اللهِ بْنِ أَبِي يَزِيدَ، سَمِعَ ابْنَ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا، وَسُئِلَ عَنْ صِيَامِ يَوْمِ عَاشُورَاءَ فَقَالَ: «مَا عَلِمْتُ أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ صَامَ يَوْمًا يَطْلُبُ فَضْلَهُ عَلَى الْأَيَّامِ إِلَّا هَذَا الْيَوْمَ وَلَا شَهْرًا إِلَّا هَذَا الشَّهْرَ». يَعْنِي رَمَضَانَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10227,
                "hadithNumber": "2663",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been narrated on the authority of 'Ubaidullah bin Abi Yazid.",
                "hadithUrdu": "محمد بن رافع ، عبدالرزاق ، ابن جریج ، عبیداللہ بن ابی یزید اس سند کے ساتھ اسی طرح کی یہ حدیث نقل کی گئی ہے ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عُبَيْدُ اللهِ بْنُ أَبِي يَزِيدَ، فِي هَذَا الْإِسْنَادِ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10228,
                "hadithNumber": "2664",
                "englishNarrator": "Hakam bin al-'Araj reported:",
                "hadithEnglish": "I went to Ibn 'Abbas (رضی اللہ تعالیٰ عنہ) and he was reclining using his mantle as a pillow near the fountain of Zamzam. I said to him: Tell me about fasting on Ashura. He said: When you see the new moon of Muharram then count the (days) and observe fast on the 9th. I said to him: Is it how the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) observed the fast? He said: Yes.",
                "hadithUrdu": "میں حضرت ابن عباس رضی اللہ تعالیٰ عنہ کے پاس گیا اس حال میں کہ وہ زم زم ( کے قریب ) اپنی چادر سے ٹیک لگائے بیٹھے تھے تو میں نے ان سے عرض کیا کہ مجھے عاشورے کے روزے کے بارے میں خبر دیجئے انہوں نے فرمایا کہ جب تو محرم کا چانددیکھے تو گنتا رہ اور نویں تاریخ کے دن کی صبح روزے کی حالت میں کر ۔ میں نے عرض کیا کہ کیا محمد رسول اللہ صلی اللہ علیہ وسلم اسی طرح روزہ رکھتے تھے انہوں نے فرمایا ہاں!",
                "urduNarrator": "ابو بکر بن ابی شیبہ ، وکیع بن جراح ، حاجب ابن عمر ، حضرت حکم بن اعرج سے روایت ہے فرماتے ہیں کہ",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعُ بْنُ الْجَرَّاحِ، عَنْ حَاجِبِ بْنِ عُمَرَ، عَنِ الْحَكَمِ بْنِ الْأَعْرَجِ، قَالَ: انْتَهَيْتُ إِلَى ابْنِ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا، وَهُوَ مُتَوَسِّدٌ رِدَاءَهُ فِي زَمْزَمَ، فَقُلْتُ لَهُ: أَخْبِرْنِي عَنْ صَوْمِ عَاشُورَاءَ، فَقَالَ: «إِذَا رَأَيْتَ هِلَالَ الْمُحَرَّمِ فَاعْدُدْ، وَأَصْبِحْ يَوْمَ التَّاسِعِ صَائِمًا»، قُلْتُ: هَكَذَا كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَصُومُهُ قَالَ: «نَعَمْ».",
                "headingArabic": "أَىُّ يَوْمٍ يُصَامُ فِي عَاشُورَاءَ ‏‏",
                "headingUrdu": "عاشورہ کا روزہ کس دن رکھنا چاہیے؟",
                "headingEnglish": "Which day should be fasted for 'Ashura?",
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10229,
                "hadithNumber": "2665",
                "englishNarrator": "Hakam bin 'Araj reported:",
                "hadithEnglish": "I asked Ibn Abbas ( رضی اللہ تعالیٰ عنہ) as he was reclining using his cloak as a pillow near Zamzam about fasting on 'Ashura. The rest of the hadith is the same.",
                "hadithUrdu": "میں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے اس حال میں پوچھا کہ وہ زم زم کے پاس اپنی چادر سے ٹیک لگائے بیٹھے تھے عاشورہ کے روزے کے بارے میں پوچھا اس کے بعد اسی طرح حدیث مبارکہ ہے ۔",
                "urduNarrator": "محمد بن حاتم ، یحییٰ بن سعید ، معاویہ بن عمرو ، حضرت حکم بن اعرج کہتے ہیں کہ",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ، عَنْ مُعَاوِيَةَ بْنِ عَمْرٍو، حَدَّثَنِي الْحَكَمُ بْنُ الْأَعْرَجِ، قَالَ: سَأَلْتُ ابْنَ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا وَهُوَ مُتَوَسِّدٌ رِدَاءَهُ عِنْدَ زَمْزَمَ، عَنْ صَوْمِ عَاشُورَاءَ بِمِثْلِ حَدِيثِ حَاجِبِ بْنِ عُمَرَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10230,
                "hadithNumber": "2666",
                "englishNarrator": "Ibn 'Abbas رضی اللہ تعالیٰ عنہما reported:",
                "hadithEnglish": "When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) fasted on the day of 'Ashura and commanded that it should he observed as a fast, they (his Companions) said to him: Messenger of Allah, it is a day which the Jews and Christians hold in high esteem. Thereupon the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: When the next year comes, God willing, we would observe fast on the 9th But the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) died before the advent of the next year.",
                "hadithUrdu": "جس وقت رسول اللہ صلی اللہ علیہ وسلم نے عاشورہ کے دن روزہ رکھا اور اس کے روزے کا حکم فرمایا تو انہوں نے عرض کیا اے اللہ کے رسول صلی اللہ علیہ وسلم !اس دن تو یہودی اور نصاریٰ تعظیم کرتے ہیں تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جب آئندہ سال آئے گا تو ہم نویں تاریخ کا بھی روزہ رکھیں گے راوی نے کہا کہ ابھی آئندہ سال نہیں آیا تھا کہ رسول اللہ صلی اللہ علیہ وسلم وفات پاگئے ۔",
                "urduNarrator": "حسن بن علی حلوانی ، ابن ابی مریم ، یحییٰ بن ایوب ، اسماعیل بن امیہ ، حضرت ابن عباس رضی اللہ تعالیٰ عنہما فرماتے ہیں کہ",
                "hadithArabic": "وحَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، حَدَّثَنِي إِسْمَاعِيلُ بْنُ أُمَيَّةَ، أَنَّهُ سَمِعَ أَبَا غَطَفَانَ بْنَ طَرِيفٍ الْمُرِّيَّ، يَقُولُ: سَمِعْتُ عَبْدَ اللهِ بْنَ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا، يَقُولُ: حِينَ صَامَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَوْمَ عَاشُورَاءَ وَأَمَرَ بِصِيَامِهِ قَالُوا: يَا رَسُولَ اللهِ إِنَّهُ يَوْمٌ تُعَظِّمُهُ الْيَهُودُ وَالنَّصَارَى فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «فَإِذَا كَانَ الْعَامُ الْمُقْبِلُ إِنْ شَاءَ اللهُ صُمْنَا الْيَوْمَ التَّاسِعَ» قَالَ: فَلَمْ يَأْتِ الْعَامُ الْمُقْبِلُ، حَتَّى تُوُفِّيَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10231,
                "hadithNumber": "2667",
                "englishNarrator": "Abdullah bin 'Abbas رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had said: If I live till the next (year), I would definitely observe fast on the 9th, and the narration transmitted by Abu Bakr is: He meant the day of Ashura.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اگر میں آنے والے سال تک زندہ رہا تو میں نویں تاریخ کا بھی ضرور روزہ رکھوں گا اور ابو بکر کی روایت میں ہے کہ آپ نے فرمایا عاشورہ کے دن کا روزہ ۔",
                "urduNarrator": "ابو بکر بن ابی شیبہ ، ابو کریب ، وکیع ، ابن ابی ذئب ، قاسم بن عبداللہ ، عبداللہ بن عمیر ، حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت ہے کہ فرمایا کہ",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، قَالَا: حَدَّثَنَا وَكِيعٌ، عَنِ ابْنِ أَبِي ذِئْبٍ، عَنِ الْقَاسِمِ بْنِ عَبَّاسٍ، عَنْ عَبْدِ اللهِ بْنِ عُمَيْرٍ، - لَعَلَّهُ قَالَ: - عَنْ عَبْدِ اللهِ بْنِ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَئِنْ بَقِيتُ إِلَى قَابِلٍ لَأَصُومَنَّ التَّاسِعَ» وَفِي رِوَايَةِ أَبِي بَكْرٍ: قَالَ: يَعْنِي يَوْمَ عَاشُورَاءَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10232,
                "hadithNumber": "2668",
                "englishNarrator": "Salama bin al-Akwa' (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sent a person of the tribe of Aslam on the day of 'Ashura and commanded him to declare to the people to observe fast in case they had not observed it, and to complete fast till evening if they had taken food",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے قبیلہ اسلم کے ایک آدمی کو عاشورہ کے دن بھیجا اور اسے حکم فرمایاکہ وہ لوگوں میں اعلان کردے کہ جس آدمی نے روزہ نہ رکھا ہووہ روزہ رکھ لے ۔ اور جس نے کھالیا ہو تو اسے چاہیے کہ وہ اپنے روزے کو رات تک پورا کرلے ۔",
                "urduNarrator": "قتیبہ بن سعید ، حاتم یعنی ابن اسماعیل ، یزید بن ابی عبید ، حضرت سلمہ بن اکوع رضی اللہ تعالیٰ عنہ سے روایت ہے انہوں نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَاتِمٌ يَعْنِي ابْنَ إِسْمَاعِيلَ، عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ، عَنْ سَلَمَةَ بْنِ الْأَكْوَعِ رَضِيَ اللهُ عَنْهُ، أَنَّهُ قَالَ: بَعَثَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ رَجُلًا مِنْ أَسْلَمَ يَوْمَ عَاشُورَاءَ، فَأَمَرَهُ أَنْ يُؤَذِّنَ فِي النَّاسِ: «مَنْ كَانَ لَمْ يَصُمْ، فَلْيَصُمْ وَمَنْ كَانَ أَكَلَ، فَلْيُتِمَّ صِيَامَهُ إِلَى اللَّيْلِ».",
                "headingArabic": "مَنْ أَكَلَ فِي عَاشُورَاءَ فَلْيَكُفَّ بَقِيَّةَ يَوْمِهِ ‏‏",
                "headingUrdu": "جس نے عاشورہ کے دن کھانا کھایا وہ باقی دن (کھانے سے) پرہیز کرے۔",
                "headingEnglish": "Whoever eats on'Ashura, let him refrain (from eating) for the rest of the day",
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10233,
                "hadithNumber": "2669",
                "englishNarrator": "Rubayyi' daughter of Mu'awwidh bin 'Afra' رضی اللہ تعالیٰ عنہ said:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sent (a person) on the morning of Ashura to the villages of Ansar around Medina (with this message): He who got up in the morning fasting (without eating anything) he should complete his fast, and he who had had his breakfast in the morning, he should complete the rest of the day (without food). The Companions said; We henceforth observed fast on it (on the day of 'Ashura) and, God willing, made our children observe that. We went to the mosque and made toys out of wool for them and when anyone felt hungry and wept for food we gave them these toys till it was the time to break the fast.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے عاشورہ کی صبح کو انصارکی اس بستی کی طرف جو مدینہ منورہ کے اردگرد تھی یہ پیغام بھجوادیا کہ جس آدمی نے صبح روزہ رکھا تو وہ اپنے روزے کو پور کرلے اور جس نے صبح کو افطار کرلیا ہوتو اسے چاہیے کہ باقی دن روزہ پورا کرلےاس کے بعد ہم ر وزہ رکھتے تھے اور ہم اپنے چھوٹے بچوں کو بھی روزہ رکھواتے تھے اور ہم انہیں مسجد کی طرف لے جاتے اور ہم ان کے لئے روئی کی گڑیاں بناتے اور جب ان بچوں میں سے کوئی کھانے کی وجہ سے روتاتو ہم انہیں وہ گڑیا دے دیتے تاکہ وہ افطاری تک ان کے ساتھ کھیلتے رہیں ۔",
                "urduNarrator": "ابو بکر بن نافع ، بشر بن مفضل بن لاحق ، خالد بن ذکوان ، حضرت ربیع بنت معوذبن عفراء رضی اللہ تعالیٰ عنہ فرماتی ہیں کہ",
                "hadithArabic": "وحَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ الْعَبْدِيُّ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ بْنِ لَاحِقٍ، حَدَّثَنَا خَالِدُ بْنُ ذَكْوَانَ، عَنِ الرُّبَيِّعِ بِنْتِ مُعَوِّذِ ابْنِ عَفْرَاءَ، قَالَتْ: أَرْسَلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ غَدَاةَ عَاشُورَاءَ إِلَى قُرَى الْأَنْصَارِ، الَّتِي حَوْلَ الْمَدِينَةِ: «مَنْ كَانَ أَصْبَحَ صَائِمًا، فَلْيُتِمَّ صَوْمَهُ، وَمَنْ كَانَ أَصْبَحَ مُفْطِرًا، فَلْيُتِمَّ بَقِيَّةَ يَوْمِهِ» فَكُنَّا، بَعْدَ ذَلِكَ نَصُومُهُ، وَنُصَوِّمُ صِبْيَانَنَا الصِّغَارَ مِنْهُمْ إِنْ شَاءَ اللهُ، وَنَذْهَبُ إِلَى الْمَسْجِدِ، فَنَجْعَلُ لَهُمُ اللُّعْبَةَ مِنَ الْعِهْنِ، فَإِذَا بَكَى أَحَدُهُمْ عَلَى الطَّعَامِ أَعْطَيْنَاهَا إِيَّاهُ عِنْدَ الْإِفْطَارِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10234,
                "hadithNumber": "2670",
                "englishNarrator": "Khalid bin Dhakwan reported:",
                "hadithEnglish": "I asked Rubayyi' daugther of Mu'awwidh رضی اللہ تعالیٰ عنہ about fasting on the day of 'Ashura. Thereupon she said: The Messenger of Allah (ﷺ) sent his messenger to the villages of the Ansar, and the rest of the hadith is the same (but with this variation that one of the Companions) said: We used to make toys out of wool and took (them to the mosque) along with us. When they (the children) asked us for food, we gave them these toys to play with, and these made them forgetful till they completed their fast.",
                "hadithUrdu": "میں نے ربیع بنت معوذ رضی اللہ تعالیٰ عنہ سے عاشورہ کے روزے کے بارے میں پوچھا تو انہوں نے فرمایا کہ رسول اللہ صلی اللہ علیہ وسلم نے انصار کی بستی میں اپنا نمائندہ بھیجا پھر آکر بشر کی حدیث کی طرح روایت ذکر کی سوائے اس کے کہ انہوں نے کہا کہ ہم ان بچوں کے لئے روئی کی گڑیاں بناتے تاکہ وہ ان سے کھیلیں اور وہ ہمارے ساتھ مسجد میں جاتے تو جب وہ ہم سے کھانا مانگتے تو ہم انہیں وہ گڑیاں دے دیتے اور وہ ان سے کھیل میں لگ کر روزہ بھول جاتے یہاں تک کہ ان کا روزہ پورا ہوجاتا ۔",
                "urduNarrator": "یحییٰ بن یحییٰ ، ابو معشر ، عطار ، حضرت خالد بن ذکوان کہتے ہیں کہ",
                "hadithArabic": "وحَدَّثَنَاه يَحْيَى بْنُ يَحْيَى، حَدَّثَنَا أَبُو مَعْشَرٍ الْعَطَّارُ، عَنْ خَالِدِ بْنِ ذَكْوَانَ، قَالَ: سَأَلْتُ الرُّبَيِّعَ بِنْتَ مُعَوِّذٍ عَنْ صَوْمِ عَاشُورَاءَ؟ قَالَتْ: بَعَثَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ رُسُلَهُ فِي قُرَى الْأَنْصَارِ، فَذَكَرَ بِمِثْلِ حَدِيثِ بِشْرٍ غَيْرَ أَنَّهُ قَالَ: وَنَصْنَعُ لَهُمُ اللُّعْبَةَ مِنَ الْعِهْنِ، فَنَذْهَبُ بِهِ مَعَنَا، فَإِذَا سَأَلُونَا الطَّعَامَ، أَعْطَيْنَاهُمُ اللُّعْبَةَ تُلْهِيهِمْ حَتَّى يُتِمُّوا صَوْمَهُمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10235,
                "hadithNumber": "2671",
                "englishNarrator": "Abu Ubaid, the freed slave of Ibn Azhar, reported:",
                "hadithEnglish": "I observed Id along with Umar bin al-Khattab (رضی اللہ تعالیٰ عنہ). He came (out in an open space) and prayed and (after) completing it addressed the people and said: The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) has forbidden the observing of fast on these two days. One is the day of Fitr (at the end of your fasts), and the second one, the day when you eat (the meat) of your sacrifices.",
                "hadithUrdu": "میں عید کے دن حضرت عمر بن خطاب رضی اللہ تعالیٰ عنہ کے پاس موجود تھا تو آپ آئے اور نماز پڑھی پھر نماز سے فارغ ہوکر لوگوں کو خطبہ دیا اور فرمایا کہ یہ وہ دن ہیں رسول اللہ صلی اللہ علیہ وسلم نے روزہ رکھنے سے منع فرمایا ہے ایک وہ دن ہے کہ جس دن تم افطار کرتے ہو اور دوسرا وہ دن ہے کہ جس میں تم اپنی قربانیوں کا گوشت کھاتے ہو ۔",
                "urduNarrator": "یحییٰ بن یحییٰ ، مالک ابن شہاب ، حضرت ابو عبید مولی بن ازہر سے روایت ہے انہوں نے کہاکہ",
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي عُبَيْدٍ، مَوْلَى ابْنِ أَزْهَرَ، أَنَّهُ قَالَ: شَهِدْتُ الْعِيدَ مَعَ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللهُ عَنْهُ، فَجَاءَ فَصَلَّى، ثُمَّ انْصَرَفَ فَخَطَبَ النَّاسَ، فَقَالَ: «إِنَّ هَذَيْنِ يَوْمَانِ، نَهَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ صِيَامِهِمَا، يَوْمُ فِطْرِكُمْ مِنْ صِيَامِكُمْ، وَالْآخَرُ يَوْمٌ تَأْكُلُونَ فِيهِ مِنْ نُسُكِكُمْ».",
                "headingArabic": "النَّهْىِ عَنْ صَوْمِ، يَوْمِ الْفِطْرِ وَيَوْمِ الأَضْحَى ‏‏",
                "headingUrdu": "عید کے دو دن روزہ رکھنے کی ممانعت",
                "headingEnglish": "The prohibition of fasting on the two days of 'Id",
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10236,
                "hadithNumber": "2672",
                "englishNarrator": "Abu Huraira (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) forbade fasting on these two days. 'Id-ul-Adha and 'Id-ul-Fitr.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے دو دنوں کے روزوں سے منع فرمایا ایک قربانی کے دن اور دوسرا فطر کے دن ۔",
                "urduNarrator": "یحییٰ بن یحییٰ ، مالک ، محمد بن یحییٰ ابن حبان ، اعرج ، حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت ہے کہ",
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ: «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ صِيَامِ يَوْمَيْنِ يَوْمِ الْأَضْحَى، وَيَوْمِ الْفِطْرِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10237,
                "hadithNumber": "2673",
                "englishNarrator": "Qaza'a related from Abu Sa'id رضی اللہ تعالیٰ عنہ He said:",
                "hadithEnglish": "I heard from him (Abu Sa'id) a hadith which impressed me, and I said to him: Did you hear it from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌)? Thereupon he said: (Is it possible) that (I should) say about the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) that which I have not heard? I heard him saying: It is not proper to fast on two days, Adha and Fitr (at the end) of Ramadan.",
                "hadithUrdu": "میں نے ایک حدیث سنی جو مجھے بڑی عجیب لگی قزعہ کہتے ہیں کہ میں نے ابو سعید سے کہا ۔ کیا آپ نے رسول اللہ صلی اللہ علیہ وسلم سے یہ حدیث سنی ہے؟حضرت ابو سعید رضی اللہ تعالیٰ عنہ کہا کہ کیا میں رسول اللہ صلی اللہ علیہ وسلم پر وہ بات کہہ سکتاہوں جس کو میں نے آپ سے نہ سناہو انہوں نے فرمایا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا کہ دو د نوں میں روزہ رکھنا درست نہیں ایک قربانی کے دن دوسرے رمضان عید الفطر کے دن ۔",
                "urduNarrator": "قتیبہ بن سعید ، جریر ، عبدالملک ، ابن عمیر ، قزعہ ، حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنْ عَبْدِ الْمَلِكِ وَهُوَ ابْنُ عُمَيْرٍ، عَنْ قَزَعَةَ، عَنْ أَبِي سَعِيدٍ رَضِيَ اللهُ عَنْهُ، قَالَ: سَمِعْتُ مِنْهُ حَدِيثًا فَأَعْجَبَنِي، فَقُلْتُ لَهُ: آنْتَ سَمِعْتَ هَذَا مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ؟ قَالَ: فَأَقُولُ عَلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مَا لَمْ أَسْمَعْ؟ قَالَ: سَمِعْتُهُ يَقُولُ: لَا يَصْلُحُ الصِّيَامُ فِي يَوْمَيْنِ: يَوْمِ الْأَضْحَى وَيَوْمِ الْفِطْرِ، مِنْ رَمَضَانَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10238,
                "hadithNumber": "2674",
                "englishNarrator": "Abu Sa'id al-Khudri (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade to observe fast on two days the day of Fitr and the day of Sacrifice ('Id-ul-Adha).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے دو دنوں کے روزے رکھنے سے منع فرمایا ہے ایک عید الفطر کےدن دوسرے عید الاضحیٰ یعنی قربانی کے دن ۔",
                "urduNarrator": "ابو کامل جحدری ، عبدالعزیز بن مختار ، عمرو بن یحییٰ ، حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ سے روایت ہے کہ",
                "hadithArabic": "وحَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْمُخْتَارِ، حَدَّثَنَا عَمْرُو بْنُ يَحْيَى، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللهُ عَنْهُ: «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ صِيَامِ يَوْمَيْنِ، يَوْمِ الْفِطْرِ، وَيَوْمِ النَّحْرِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 9926,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=397",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=395",
                "label": "395",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=396",
                "label": "396",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=397",
                "label": "397",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=398",
                "label": "398",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=399",
                "label": "399",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=400",
                "label": "400",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=401",
                "label": "401",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=399",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=399",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=397",
        "to": 9950,
        "total": 40465
    }
}