{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 294,
        "data": [
            {
                "id": 7614,
                "hadithNumber": "50",
                "englishNarrator": "Ubaydullah bin Sa’īd narrated to me, Abd ur-Rahman- meaning Ibn Mahdī- narrated to us, Hammād bin Zayd narrated to us, on authority of Ibn Awn, he said, Ibrāhīm said to us:",
                "hadithEnglish": "‘Beware of al-Mughīrah bin Sa’īd and Abū Abd ar-Rahīm for they are both liars’.",
                "hadithUrdu": "تم لوگ مغیرہ بن سعید اور ابو عبد الرحیم سے بچ کر رہو ، وہ کذاب ہیں",
                "urduNarrator": "ہم سے عبید اللہ بن سعید نے بیان کیا، کہا ہم سے عبدالرحمٰن نے بیان کیا، کہا ہم سے ابن مہدی نے بیان کیا، کہا ہم سے حماد بن زید نے بیان کیا، انہوں نے ابن عون کی سند سے، کہا: ہم سے ابراہیم نےہم سے کہا",
                "hadithArabic": "وحَدَّثَنِي عُبَيْدُ اللهِ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ يَعْنِي ابْنَ مَهْدِيٍّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ ابْنِ عَوْنٍ، قَالَ: قَالَ لَنَا إِبْرَاهِيمُ: «إِيَّاكُمْ وَالْمُغِيرَةَ بْنَ سَعِيدٍ، وَأَبَا عَبْدِ الرَّحِيمِ، فَإِنَّهُمَا كَذَّابَانِ»",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7615,
                "hadithNumber": "51",
                "englishNarrator": "Abū Kāmil al-Jahdarī narrated to us, Hammād- and he is Ibn Zayd- narrated to us, he said Āsim [bin Bahdalah] narrated to us, he said:",
                "hadithEnglish": "‘We would catch up with Abū Abd ar-Rahman as-Sulamī and at the time we were young men, so he would say to us: ‘Do not sit with story-tellers other than Abūl-Ahwas and beware of Shaqīq [Abū Abd ar-Rahīm]’. [Muslim] said: ‘This Shaqīq held the view of the Khawārij and is not Abū Wā’il [Shaqīq bin Salamah, the righteous Tabi’ī]’.",
                "hadithUrdu": "ہم بالکل نو عمر لڑکے تھے جو ابو عبد الرحمن سلمی کے پاس حاضر ہوتے تھے ، وہ ہم سے کہا کرتے تھے : ابو احوص کے سوا دوسرے قصہ گوؤں ( واعظوں ) کی مجالس میں مت بیٹھو اور شقیق سے بچ کر رہو ۔ شقیق خوارج کا نقطہ نظر رکھتا تھا ، یہ ابو وائل نہیں ( بلکہ شقیق ضبی ہے ۔ )",
                "urduNarrator": "ہم سے ابو کامل الجہداری نے بیان کیا، کہا ہم سے حماد نے جو ابن زید ہیں، انہوں نے کہا کہ ہم سے عاصم نے بیان کیا، انہوں نے کہا:",
                "hadithArabic": "دَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ، حَدَّثَنَا حَمَّادٌ وَهُوَ ابْنُ زَيْدٍ، قَالَ: حَدَّثَنَا عَاصِمٌ، قَالَ: كُنَّا نَأْتِي أَبَا عَبْدِ الرَّحْمَنِ السُّلَمِيَّ وَنَحْنُ غِلْمَةٌ أَيْفَاعٌ، فَكَانَ يَقُولُ لَنَا: «لَا تُجَالِسُوا الْقُصَّاصَ غَيْرَ أَبِي الْأَحْوَصِ، وَإِيَّاكُمْ وَشَقِيقًا»، قَالَ: «وَكَانَ شَقِيقٌ هَذَا يَرَى رَأْيَ الْخَوَارِجِ، وَلَيْسَ بِأَبِي وَائِلٍ»",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7616,
                "hadithNumber": "52",
                "englishNarrator": "Abū Ghassān Muhammad bin Amr ar-Rāzī narrated to us, he said, I heard Jarīr رضی اللہ عنہ [bin Abd al-Hamīd bin Qurt aḍ-Ḍabbī] saying:",
                "hadithEnglish": "‘I met Jābir bin Yazīd al-Ju’fī and did not write [Ḥadīth] from him; he believed in ar-Raj’ah’ [A Rāfiḍī belief regarding Alī returning].",
                "hadithUrdu": "جریر کہتے ہیں : میں جابر بن یزید جعفی سے ملا تو میں نے اس سے حدیث نہ لکھی ، وہ رجعت پر ایمان رکھتا تھا ۔",
                "urduNarrator": "ہم سے ابو غسان محمد بن عمرو رازی نے بیان کیا، کہا کہ میں نے جریر رضی اللہ عنہ کو کہتے سنا:",
                "hadithArabic": "حَدَّثَنَا أَبُو غَسَّانَ مُحَمَّدُ بْنُ عَمْرٍو الرَّازِيُّ، قَالَ: سَمِعْتُ جَرِيرًا، يَقُولُ: «لَقِيتُ جَابِرَ بْنَ يَزِيدَ الْجُعْفِيَّ فَلَمْ أَكْتُبْ عَنْهُ، كَانَ يُؤْمِنُ بِالرَّجْعَةِ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7617,
                "hadithNumber": "53",
                "englishNarrator": "Al-Hasan al-Hulwānī narrated to us, Yahyā bin Ādam narrated to us, Mis’ar narrated to us, he said:",
                "hadithEnglish": "‘Jābir bin Yazīd narrated to us before there took place what happened [i.e. before his false beliefs] ’.",
                "hadithUrdu": "ہم سے جابر بن یزید ( جعفی ) نے ان بدعتوں سے پہلے ، جو اس نے گھڑیں ، حدیث بیان کی ۔",
                "urduNarrator": "ہم سے حسن الحلوانی نے بیان کیا، کہا ہم سے یحییٰ بن آدم نے بیان کیا، کہا ہم سے مسعر نے بیان کیا، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا الْحَسَنُ الْحُلْوَانِيُّ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا مِسْعَرٌ، قَالَ: «حَدَّثَنَا جَابِرُ بْنُ يَزِيدَ، قَبْلَ أَنْ يُحْدِثَ مَا أَحْدَثَ»",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7618,
                "hadithNumber": "54",
                "englishNarrator": "Salamah bin Shabīb narrated to me, al-Humaydī narrated to us, Sufyān narrated to us, he said:",
                "hadithEnglish": "‘The people would transmit from Jābir before there appeared what appeared, then when there appeared what appeared, the people imputed him in his Ḥadīth and some of the people abandoned him’. So it was said to [Sufyān]: ‘What appeared?’ [Sufyān] said: ‘Belief in ar-Raj’ah’.",
                "hadithUrdu": "جابر نے جس ( عقیدے ) کا اظہار کیا اس کے اظہار سے پہلے لوگ اس سے حدیث لیتے تھے ، جب اس نے اس کا اظہار کر دیا تو لوگوں نے اسے اس کی ( بیان کردہ ) حدیث کے بارے میں مطعون کیا اور بعض نے اسے چھوڑ دیا ۔ ان سے پوچھا گیا : اس نے کس چیز کا",
                "urduNarrator": "مجھ سے سلمہ بن شبیب نے بیان کیا، کہا ہم سے حمیدی نے بیان کیا، کہا ہم سے سفیان نے بیان کیا، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، قَالَ: «كَانَ النَّاسُ يَحْمِلُونَ عَنْ جَابِرٍ قَبْلَ أَنْ يُظْهِرَ مَا أَظْهَرَ، فَلَمَّا أَظْهَرَ مَا أَظْهَرَ اتَّهَمَهُ النَّاسُ فِي حَدِيثِهِ، وَتَرَكَهُ بَعْضُ النَّاسِ»، فَقِيلَ لَهُ: وَمَا أَظْهَرَ؟ قَالَ: «الْإِيمَانَ بِالرَّجْعَةِ»",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7619,
                "hadithNumber": "55",
                "englishNarrator": null,
                "hadithEnglish": "Hasan al-Hulwānī narrated to us, Abū Yahyā al-Himmānī narrated to us, Qabīsah and his brother [Sufyān bin Uqbah] narrated to us, that they heard al-Jarrāh bin Malīh saying, I heard Jābir say: ‘I have 70,000 Ḥadīth all of which are on authority of Abū Ja’far on authority of the Prophet, peace and blessings upon him’.",
                "hadithUrdu": "۔ جراح بن ملیح کہتے ہیں : میں نے جابر بن یزید ( جعفی ) کو یہ کہتے سنا : میرے ابو جعفر ( محمد باقر بن علی بن حسین بن علی ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) کی ستر ہزار حدیثیں ہیں جو سب کی سب رسول اللہﷺ سے ( روایت کی گئی ) ہیں ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا حَسَنٌ الْحُلْوَانِيُّ، حَدَّثَنَا أَبُو يَحْيَى الْحِمَّانِيُّ، حَدَّثَنَا قَبِيصَةُ، وَأَخُوهُ، أَنَّهُمَا سَمِعَا الْجَرَّاحَ بْنَ مَلِيحٍ، يَقُولُ: سَمِعْتُ جَابِرًا يَقُولُ: «عِنْدِي سَبْعُونَ أَلْفَ حَدِيثٍ عَنْ أَبِي جَعْفَرٍ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كُلُّهَا»",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7620,
                "hadithNumber": "56",
                "englishNarrator": null,
                "hadithEnglish": "Hajjāj bin ash-Shā’ir narrated to me, Ahmad bin Yūnus narrated to us, he said, I heard Zuhayr saying, Jābir said, or, I heard Jābir saying: ‘Indeed I have fifty thousand Ḥadīth that I have not narrated from at all’. [Zuhayr] said: ‘Then that day he related a Ḥadīth and said, ‘This is from the fifty thousand’.",
                "hadithUrdu": "۔ زہیر کہتے ہیں : جابر نے کہا یا میں نے جابر ( بن یزید ) کو یہ کہتے سنا : بلاشبہ میرے پاس پچاس ہزار حدیثیں ( ایسی ) ہیں جن میں سے میں نے کوئی حدیث بیان نہیں کی ، پھر ایک دن اس نے ایک حدیث بیان کی اور کہا : یہ ( ان ) پچاس ہزار حدیثوں میں سے ( ایک ) ہے ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، قَالَ: سَمِعْتُ زُهَيْرًا، يَقُولُ: قَالَ جَابِرٌ - أَوْ سَمِعْتُ جَابِرًا - يَقُولُ: «إِنَّ عِنْدِي لَخَمْسِينَ أَلْفَ حَدِيثٍ، مَا حَدَّثْتُ مِنْهَا بِشَيْءٍ»، قَالَ: ثُمَّ حَدَّثَ يَوْمًا بِحَدِيثٍ، فَقَالَ: «هَذَا مِنَ الْخَمْسِينَ أَلْفًا»",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7621,
                "hadithNumber": "57",
                "englishNarrator": "Ibrāhīm bin Khālid al-Yashkurī narrated to me, he said, I heard Abūl-Walīd saying,",
                "hadithEnglish": "I heard Sallām bin Abī Mutī’ saying, I heard Jābir al-Ju’fī saying: ‘I have fifty thousand Ḥadīth on authority of the Prophet, peace and blessings upon him’.",
                "hadithUrdu": "میں نے سلام بن ابی مطیع کہتے ہیں : میں نے جابر جعفی کو یہ کہتے سنا : میرے پاس رسول اللہﷺ سے ( روایت کردہ ) پچاس ہزار احادیث ہیں ۔",
                "urduNarrator": "مجھ سے ابراہیم بن خالد یشکری نے بیان کیا کہ میں نے ابو الولید کو کہتے سنا",
                "hadithArabic": "وحَدَّثَنِي إِبْرَاهِيمُ بْنُ خَالِدٍ الْيَشْكُرِيُّ، قَالَ: سَمِعْتُ أَبَا الْوَلِيدِ، يَقُولُ: سَمِعْتُ سَلَّامَ بْنَ أَبِي مُطِيعٍ، يَقُولُ: سَمِعْتُ جَابِرًا الْجُعْفِيَّ، يَقُولُ: «عِنْدِي خَمْسُونَ أَلْفَ حَدِيثٍ عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ»",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7622,
                "hadithNumber": "58",
                "englishNarrator": "Salamah bin Shabīb narrated to me, al-Humaydī narrated to us, Sufyān narrated to us, he said, I heard a man ask Jābir about the verse: {Thus I will never depart from the land until my father permits me or Allah decides for me, and He is the best of Judges}[Yūsuf: 80]. Jābir said:",
                "hadithEnglish": "‘An interpretation has not come to me about these [verses]’. Sufyān said: ‘He lied’. We said to Sufyān: ‘What did he mean by this?’ [Sufyān] said: ‘Indeed the Rāfiḍah say, ‘Alī is in the clouds and we will not emerge along with he who will emerge from his children [the Khalīfah] until a caller calls from the heaven, meaning Alī: ‘Ride out along with so-and-so [meaning the promised Mahdī]’. Jābir said, ‘that is an interpretation for these verses’, and he would lie as they were regarding the brothers of Yūsuf, peace be upon him’.",
                "hadithUrdu": "اس کی تاویل نہیں دی گئی، سفیان ( بن عیینہ ) نے کہا : میں نے ایک آدمی سے سنا ، اس نے جابر سے ارشاد ربانی : ﴿فلن أبرح الأرض حتى يأذن لي أبي أو يحكم الله لي وهو خير الحاكمين﴾ ’’اب میں اس زمین سے ہرگز نہ ہلوں گا یہاں تک کہ میرا باپ مجھے اجازت دے یا اللہ میرے لیے فیصلہ کر دے اور وہ سب فیصلہ کرنے والوں سے بہتر ہے ۔ ‘ ‘ کے بارے میں سوال ، تو جابر نے کہا : اس کی تفسیر ابھی ظاہر نہیں ہوئی ۔ سفیان نے کہا : اور اس نے یہ جھوٹ بولا ۔ تو ہم نے سفیان سے کہا : اس سے مراد اس کی کیا تھی؟ انہوں نے کہا : روافض کہتے ہیں : حضرت علی ‌رضی ‌اللہ ‌عنہ ‌ ‌ بادلوں میں ہیں ۔ ان کی اولاد میں سے جو کوئی خروج کرے گا ہم اس کے ساتھ خروج نہیں کریں گے حتیٰ کہ آسمان کی طرف سے پکارنے والا ( اس کی مراد علی سے ہے ) پکارے ۔ یقیناً وہی پکارے گا کہ فلاں کے ساتھ ( مل کر ) خروج کرو ۔ جابر کہتا تھا : یہ اس آیت کی تفسیر ہے اور اس نے جھوٹ کہا ۔ یہ آیت حضرت یوسف علیہ السلام کے بھائیوں کے بارے میں ( نازل ہوئی ) تھی ۔",
                "urduNarrator": "مجھ سے سلمہ بن شبیب نے بیان کیا، کہا ہم سے حمیدی نے بیان کیا، کہا کہ ہم سے سفیان نے بیان کیا، انہوں نے کہا: میں نے ایک شخص کو جابر رضی اللہ عنہ سے ان کے یہ کہتے ہوئے سنا کہ میں اپنے والد تک زمین کو نہیں چھوڑوں گا۔ مجھے اجازت دے یا خدا میرے بارے میں فیصلہ کرے اور وہ سب سے بہتر فیصلہ کرنے والا ہے } [یوسف: 80]، اور انہوں نے جابر سے کہا:",
                "hadithArabic": "وحَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، قَالَ: سَمِعْتُ رَجُلًا سَأَلَ جَابِرًا عَنْ قَوْلِهِ عَزَّ وَجَلَّ [ص:21]: {فَلَنْ أَبْرَحَ الْأَرْضَ حَتَّى يَأْذَنَ لِي أَبِي أَوْ يَحْكُمَ اللهُ لِي وَهُوَ خَيْرُ الْحَاكِمِينَ} [يوسف: 80]، فَقَالَ جَابِرٌ: «لَمْ يَجِئْ تَأْوِيلُ هَذِهِ»، قَالَ سُفْيَانُ: وَكَذَبَ، فَقُلْنَا لِسُفْيَانَ: وَمَا أَرَادَ بِهَذَا؟ فَقَالَ: إِنَّ الرَّافِضَةَ تَقُولُ: إِنَّ عَلِيًّا فِي السَّحَابِ، فَلَا نَخْرُجُ مَعَ مَنْ خَرَجَ مِنْ وَلَدِهِ حَتَّى يُنَادِيَ مُنَادٍ مِنَ السَّمَاءِ يُرِيدُ عَلِيًّا أَنَّهُ يُنَادِي اخْرُجُوا مَعَ فُلَانٍ، يَقُولُ جَابِرٌ: «فَذَا تَأْوِيلُ هَذِهِ الْآيَةِ، وَكَذَبَ، كَانَتْ فِي إِخْوَةِ يُوسُفَ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7623,
                "hadithNumber": "59",
                "englishNarrator": "Salamah narrated to me, al-Humaydī narrated to us, Sufyān narrated to us, he said: ‘I heard Jābir talking about something like 30,000 Ḥadīth [that] I did not regard as permissible to mention anything from, and that to me was like this and that [Ḥadīth].’ Muslim said:",
                "hadithEnglish": "I heard Abū Ghassān Muhammad bin Amr ar-Rāzī say, ‘I asked Jarīr bin Abd il-Hamīd: ‘Did you meet al-Hārith bin Hasīrah? He said: ‘Yes, [he is a] Shaykh of lengthy silence; he persisted in a grave matter.’",
                "hadithUrdu": "میں نے ابو غسان محمد بن عمرو رازی سے سنا ، کہا : میں نے جریر بن عبد الحمید سے پوچھا ، میں نے کہا : ( یہ جو ) حارث بن حصیرہ ہے ، آپ اس سے ملے ہیں؟ کہا : ہاں ، لمبی خاموشی والا بوڑھا ہے ۔ ایک بہت بڑی بات پر اصرار کرتا ہے ۔",
                "urduNarrator": "مجھ سے سلمہ نے بیان کیا، ہم سے حمیدی نے بیان کیا، کہا کہ ہم سے سفیان نے بیان کیا، انہوں نے کہا: میں نے جابر رضی اللہ عنہ کو تقریباً تیس ہزار احادیث بیان کرتے ہوئے سنا، جن میں سے ایک بھی حدیث بیان کرنا میرے پاس جائز نہیں، اور میرے پاس فلاں فلاں ہے، مسلم نے کہا",
                "hadithArabic": "وحَدَّثَنِي سَلَمَةُ، حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، قَالَ: «سَمِعْتُ جَابِرًا، يُحَدِّثُ بِنَحْوٍ مِنْ ثَلَاثِينَ أَلْفَ حَدِيثٍ، مَا أَسْتَحِلُّ أَنْ أَذْكُرَ مِنْهَا شَيْئًا، وَأَنَّ لِي كَذَا وَكَذَا‘قَالَ مُسْلِمٌ: وَسَمِعْتُ أَبَا غَسَّانَ مُحَمَّدَ بْنَ عَمْرٍو الرَّازِيَّ، قَالَ: سَأَلْتُ جَرِيرَ بْنَ عَبْدِ الْحَمِيدِ، فَقُلْتُ: الْحَارِثُ بْنُ حَصِيرَةَ لَقِيتَهُ؟ قَالَ: «نَعَمْ، شَيْخٌ طَوِيلُ السُّكُوتِ، يُصِرُّ عَلَى أَمْرٍ عَظِیم",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7624,
                "hadithNumber": "60",
                "englishNarrator": "It was narrated that Hammad bin Zaid said:",
                "hadithEnglish": "\"Ayyub mentioned a man one day and said: 'He is not careful about what he says.' And he mentioned another, and said: 'He adds to the number.\"",
                "hadithUrdu": "ایوب نے ایک دن ایک شخص کا ذکر کیا اور کہا : وہ کج زبان ( جھوٹا ، تہمت تراش اور بد زبان ) تھا اور دوسرے کا ذکر کیا تو کہا : وہ رقم ( اشیاء پر لکھی ہوئی قیمت ) میں اضافہ کر دیتا تھا ۔",
                "urduNarrator": "مجھ سے احمد بن ابراہیم الدورقی نے بیان کیا، عبد الرحمان بن مہدی نے حماد بن زید سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي أَحْمَدُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ حَمَّادِ بْنِ زَيْدٍ، قَالَ ذَكَرَ أَيُّوبُ رَجُلاً يَوْمًا فَقَالَ لَمْ يَكُنْ بِمُسْتَقِيمِ اللِّسَانِ وَذَكَرَ آخَرَ فَقَالَ هُوَ يَزِيدُ فِي الرَّقْمِ ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7625,
                "hadithNumber": "61",
                "englishNarrator": "Hajjāj bin ash-Shā’ir narrated to me, Sulaymān bin Harb narrated to us, Hammād bin Zayd narrated to us, he said, Ayyūb said:",
                "hadithEnglish": "‘Indeed I have a neighbor’ and he mentioned some of his virtues, [and continued] ‘…even if he testified to me about two dates I would not see his testimony as permissible’.",
                "hadithUrdu": "میرا ایک ہمسایہ ہے ، پھر ( زہد وورع میں ) اس کی فضیلت کا ذکر کیا ، اگر وہ میرے سامنے دو کجھوروں کے بارے میں گواہی دے تو میں ( اس میں بھی ) اس کی شہادت قابل قبول نہ سمجھوں گا ۔",
                "urduNarrator": "مجھ سے حجاج بن شعر نے بیان کیا، ہم سے سلیمان بن حرب نے بیان کیا، ہم سے حماد بن زید نے بیان کیا، انہوں نے کہا: ایوب نے کہا",
                "hadithArabic": "حَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، قَالَ: قَالَ أَيُّوبُ: «إِنَّ لِي جَارًا، ثُمَّ ذَكَرَ مِنْ فَضْلِهِ، وَلَوْ شَهِدَ عِنْدِي عَلَى تَمْرَتَيْنِ مَا رَأَيْتُ شَهَادَتَهُ جَائِزَةً»",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7626,
                "hadithNumber": "62",
                "englishNarrator": null,
                "hadithEnglish": "Muhammad bin Rāfi’ and Hajjāj bin ash-Shā’ir narrated to me, they said Abd ur-Razzāq narrated to us, he said Ma’mar said: ‘I did not see Ayyūb speaking ill of anyone, ever, except for Abd al-Karīm- meaning Abū Umayyah’. So he mentioned him and said, may Allah have mercy on him ‘He is not trustworthy- he had asked me about a Ḥadīth of Ikrimah then said ‘I heard from Ikrimah’ [when relating the Ḥadīth].’",
                "hadithUrdu": "معمر نے کہا .’میں نے ایورب کو کبھی کسی کی پیٹھ پیچھے اسے برا کہتے نہیں سنا ‘ سوائے عبدالکریم ‘ یعنی ابو امیہ کے ۔ انھوں نے اس کا ذکر کیا تو کہا .’اللہ اس پر رحم کرے ‘ غیر ثقہ ہے ‘ اس نے مجھ سے عکرمہ سے روایت کی گئی ایک حدیث کے بارے میں سوال کیا ، پھر ( لوگوں سے ) کہا : میں نے عکرمہ سے سنا ہے ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، وَحَجَّاجُ بْنُ الشَّاعِرِ، قَالَا: حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ: قَالَ مَعْمَرٌ: مَا رَأَيْتُ أَيُّوبَ اغْتَابَ أَحَدًا قَطُّ إِلَّا عَبْدَ الْكَرِيمِ يَعْنِي أَبَا أُمَيَّةَ، فَإِنَّهُ ذَكَرَهُ، فَقَالَ رَحِمَهُ اللهُ: كَانَ غَيْرَ ثِقَةٍ، لَقَدْ سَأَلَنِي عَنْ حَدِيثٍ لِعِكْرِمَةَ، ثُمَّ قَالَ: سَمِعْتُ عِكْرِمَةَ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7627,
                "hadithNumber": "63",
                "englishNarrator": "Al-Faḍl bin Sahl narrated to me, he said Affān bin Muslim narrated to us, Hammām narrated to us, he said, Abū Dāwud al-A’mā came to us and began saying: ‘Al-Barā’ [bin Āzib, the Companion] narrated to us’; he said: ‘",
                "hadithEnglish": "Zayd bin Arqam narrated to us’- and he mentioned that [those chains] to Qatādah. [Qatādah] said ‘He lied; he did not hear from them. He would beg the people asking [about Ḥadīth] at the time of the plague’ [circa 67H].",
                "hadithUrdu": "ہمیں زید بن ارقم ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے حدیث بیان کی ۔ ہم نے یہ بات قتادہ کو بتائی ، انہوں نے کہا : اس نے جھوٹ بولا ۔ اس نے ان سے نہیں سنا ، وہ تو ایک منگتا تھا ، انسانوں کی بیخ کنی کرنے والے طاعون ( کے دوران ) میں لوگوں کے سامنے ہاتھ پھیلاتا پھرتا تھا",
                "urduNarrator": "مجھ سے الفضل بن سہل نے بیان کیا، انہوں نے کہا: ہم سے عفان بن مسلم نے بیان کیا، ہم سے ہمام نے بیان کیا، انہوں نے کہا: ہمارے پاس ابوداؤد نابینا آیا تو کہنے لگا: ہمیں براء ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے حدیث سنائی",
                "hadithArabic": "حَدَّثَنِي الْفَضْلُ بْنُ سَهْلٍ، قَالَ: حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ، حَدَّثَنَا هَمَّامٌ، قَالَ: قَدِمَ عَلَيْنَا أَبُو دَاوُدَ الْأَعْمَى، فَجَعَلَ يَقُولُ: حَدَّثَنَا الْبَرَاءُ، قَالَ: وَحَدَّثَنَا زَيْدُ بْنُ أَرْقَمَ، فَذَكَرْنَا ذَلِكَ لِقَتَادَةَ، فَقَالَ: «كَذَبَ، مَا سَمِعَ مِنْهُمْ، إِنَّمَا كَانَ ذَلِكَ سَائِلًا يَتَكَفَّفُ النَّاسَ زَمَنَ طَاعُونِ الْجَارِفِ»",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7628,
                "hadithNumber": "64",
                "englishNarrator": "Hasan bin Alī al-Hulwānī narrated to me, he said Yazīd bin Hārūn narrated to us, Hammām informed us, he said ‘Abū Dāwud al-A’mā entered upon Qatādah and when he stood, they said:",
                "hadithEnglish": "‘Indeed this one alleges he has met eighteen of the warriors of the battle of Badr’. Qatādah said: ‘This one was barely asking [about Ḥadīth] before the plague; he did not attend to anything from [seeking Ḥadīth] and he did not speak [to any scholars] regarding it. By Allah, al-Hasan did not narrate to us from a witness of the battle of Badr without an intermediary; and Sa’īd bin al-Musayyib رضی ‌اللہ ‌عنہ ‌did not narrate to us from a witness of the battle of Badr without an intermediary except from Sa’d bin Mālik ‌رضی ‌اللہ ‌عنہ'.",
                "hadithUrdu": "اسے یہ زعم ہے کہ اس نے اٹھارہ بدری صحابہ سے ملاقات کی ۔ اس پر قتادہ کہنے لگے : ( طاعون کی ) وبائے عام سے پہلے یہ ایک منگتا تھا ، اس کا ( علم حدیث ) ایسی کسی چیز سے کوئی سروکار نہ تھا ، وہ اس بارے میں بات تک نہ کرتا تھا ۔ بخدا نہ حسن ( بصری ) نے ( کبھی ) کسی بدری سے بلاواسطہ حدیث ہمیں سنائی نہ سعید بن مسیب نے ایک سعد بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے سوا کسی اور بدری سے براہ راست سنی ہوئی کوئی حدیث سنائی.",
                "urduNarrator": "مجھ سے حسن بن علی الحلوانی نے بیان کیا،یزید بن ہارون نے کہا : ہمیں ہمام نے خبر دی کہ ابو داود اعمیٰ قتادہ کے ہاں آیا ، جب وہ کھڑا ہوا ( اور چلا گیا ) تو لوگوں نے کہا :",
                "hadithArabic": "وحَدَّثَنِي حَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، قَالَ: حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا هَمَّامٌ، قَالَ: دَخَلَ أَبُو دَاوُدَ الْأَعْمَى عَلَى قَتَادَةَ، فَلَمَّا قَامَ، قَالُوا: إِنَّ هَذَا يَزْعُمُ أَنَّهُ لَقِيَ ثَمَانِيَةَ عَشَرَ بَدْرِيًّا، فَقَالَ قَتَادَةُ: «هَذَا كَانَ سَائِلًا قَبْلَ الْجَارِفِ، لَا يَعْرِضُ فِي شَيْءٍ مِنْ هَذَا، وَلَا يَتَكَلَّمُ فِيهِ، فَوَاللهِ مَا حَدَّثَنَا الْحَسَنُ عَنْ بَدْرِيٍّ مُشَافَهَةً، وَلَا حَدَّثَنَا سَعِيدُ بْنُ الْمُسَيِّبِ عَنْ بَدْرِيٍّ مُشَافَهَةً، إِلَّا عَنْ سَعْدِ بْنِ مَالِكٍ»",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7629,
                "hadithNumber": "65",
                "englishNarrator": "Uthmān bin Abī Shaybah narrated to us, Jarīr narrated to us, on authority of Raqabah that:",
                "hadithEnglish": "‘Abū Ja’fa al-Hāshimī al-Madanī was fabricating narrations with words of truth, and they were not from the narrations of the Prophet, peace and blessings of Allah upon him, though he was transmitting them on authority of the Prophet, peace and blessings of Allah upon him.’",
                "hadithUrdu": "ابو جعفر ( عبد اللہ بن مسعود بن عون بن جعفر بن ابی طالب ) ہاشمی مدائنی احادیث گھڑا کرتا تھا ، سچائی ( یا حکمت ) پر مبنی کلام ( پیش کرتا ) وہ کلام رسول اللہﷺ کے فرامین میں سے نہ ہوتا تھا لیکن اسے وہ رسول اللہﷺ سے روایت کرتا تھا",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ نے بیان کیا، انہوں نے کہاجریر نے رقبہ ( بن مسقلہ بن عبد اللہ عبدی کوفی ‌رضی ‌اللہ ‌عنہ ‌ ‌ جلیل القدر تابعی ) سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ رَقَبَةَ، «أَنَّ أَبَا جَعْفَرٍ الْهَاشِمِيَّ الْمَدَنِيَّ، كَانَ يَضَعُ أَحَادِيثَ كَلَامَ حَقٍّ، وَلَيْسَتْ مِنْ أَحَادِيثِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَكَانَ يَرْوِيهَا عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّم",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7630,
                "hadithNumber": "66",
                "englishNarrator": "Al-Hasan al-Hulwānī narrated to us, he said Nu’aym bin Hammād narrated to us, he said Abū Ishāq Ibrāhīm bin Muhammad bin Sufyān said; and Muhammad bin Yahyā narrated to us, he said, Nu’aym bin Hammād narrated to us, Abū Dāwud at-Tayālisī narrated to us, on authority of Shu’bah, on authority of Yūnus bin Ubayd, he said:",
                "hadithEnglish": "‘Amr bin Ubayd would lie regarding Ḥadīth’.",
                "hadithUrdu": "عمرو بن عبید ( معروف معتزلی جو پہلے حضرت حسن بصری کی مجلس میں حاضر رہا کرتا تھا ) حدیث ( کی روایت ) میں جھوٹ بولا کرتا تھا ۔",
                "urduNarrator": "ہم سے حسن الحلوانی نے بیان کیا، کہا: ہم سے نعیم بن حماد نے بیان کیا، کہا ہم سے ابواسحاق بن محمد بن سفیان نے بیان کیا، کہا کہ ہم سے محمد بن یحییٰ نے بیان کیا، انہوں نے کہا کہ ہم سے نعیم بن حماد نے بیان کیا,ابو داود طیالسی نے شعبہ سے ، انہوں نے یونس بن عبید سے روایت کرتے ہوئے بیان کیا ، ( یونس نے ) کہا",
                "hadithArabic": "حَدَّثَنَا الْحَسَنُ الْحُلْوَانِيُّ، قَالَ: حَدَّثَنَا نُعَيْمُ بْنُ حَمَّادٍ، قَالَ أَبُو إِسْحَاقَ إِبْرَاهِيمُ بْنُ مُحَمَّدِ بْنِ سُفْيَانَ: وحَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، قَالَ: حَدَّثَنَا نُعَيْمُ بْنُ حَمَّادٍ، حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ، عَنْ شُعْبَةَ، عَنْ يُونُسَ بْنِ عُبَيْدٍ، قَالَ: «كَانَ عَمْرُو بْنُ عُبَيْدٍ يَكْذِبُ فِي الْحَدِيثِ»",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7631,
                "hadithNumber": "67",
                "englishNarrator": "Amr bin Alī Abū Hafs narrated to me, he said I heard Mu’ādh bin Mu’ādh saying, I said to Awf bin Abī Jamīlah ‘Indeed Amr bin Ubayd narrated to us on authority of al-Hasan that:",
                "hadithEnglish": "The Messenger of Allah, peace and blessings of Allah upon him, said: ‘Whoever carries arms against us then he is not from us’. [Awf bin Abī Jamīlah] said ‘Amr lied, by Allah. Rather he intended it as a way to permit his filthy opinion.’",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا:’’جس نے ہم پر ہتھیار اٹھایا تو وہ ہم میں سے نہیں ۔ ‘ ‘ انہوں نے کہا : بخدا! عمرو نے ( اس حدیث کی روایت حسن بصری کی طرف منسوب کرنے میں ) جھوٹ بولا لیکن وہ چاہتا ہے کہ اس ( صحیح حدیث ) کو اپنی جھوٹی بات سے ملا دے ۔",
                "urduNarrator": "عمرو بن علی ابو حفص نے مجھ سے بیان کیا، کہامیں نے سنامعاذ بن معاذ کہتے ہیں : میں نے عوف بن ابی جمیلہ سے کہا : عمرو بن عبید نے حضرت حسن بصری سے ( روایت کرتے ہوئے ) یہ حدیث سنائی :",
                "hadithArabic": "حَدَّثَنِي عَمْرُو بْنُ عَلِيٍّ أَبُو حَفْصٍ، قَالَ: سَمِعْتُ مُعَاذَ بْنَ مُعَاذٍ، يَقُولُ: قُلْتُ لِعَوْفِ بْنِ أَبِي جَمِيلَةَ: إِنَّ عَمْرَو بْنَ عُبَيْدٍ حَدَّثَنَا عَنِ الْحَسَنِ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «مَنْ حَمَلَ عَلَيْنَا السِّلَاحَ فَلَيْسَ مِنَّا»، قَالَ: «كَذَبَ وَاللهِ عَمْرٌو، وَلَكِنَّهُ أَرَادَ أَنْ يَحُوزَهَا إِلَى قَوْلِهِ الْخَبِيثِ»",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7632,
                "hadithNumber": "68",
                "englishNarrator": "Ubayd Allah bin Umar al-Qawārīrī narrated to us, Hammād bin Zayd narrated to us, he said: ‘A man kept company with Ayyūb and listened [to Ḥadīth] from him, but then Ayyūb did not find him [one day]. [When Ayyūb asked, the people] said: ‘Oh Abā Bakr, indeed he keeps company with Amr bin Ubayd [now]’. Hammād said:",
                "hadithEnglish": "‘One day we were with Ayyūb, and we went to the market early in the morning. A man came to meet Ayyūb so he gave Salām to him, asked how he was doing, and then Ayyūb said to him: ‘It reached me that you kept company with that man’. Hammād said: ‘[Ayyūb] designated him, that is to say ‘Amr’.’ [The man] said: ‘Yes, Oh Abā Bakr. Indeed he came to us with strange things [i.e. reports]’. Ayyūb said to him: ‘Indeed we flee…’ or ‘…we fear from these strange things [transmissions]’.",
                "hadithUrdu": "ایک دن میں ایوب کے ساتھ تھا ، ہم صبح سویرے بازار کی طرف گئے تو اس آدمی نے ایوب کا استقبال کیا ۔ ایوب نے اسے سلام کہا اور ( حال احوال ) پوچھا ، پھر ایوب کہنے لگے : مجھے یہ بات پہنچی ہے کہ تم اس آدمی کے ساتھ منسلک ہو گئے ہو ۔ حماد نے کہا : انہوں نے اس کا ، یعنی عمرو کا نام لیا ۔ وہ کہنےلگا : ہاں ، جناب ابو بکر! وہ غرائب ( ایسی باتیں جنہیں کوئی نہیں جانتا ) ہمارے سامنے لاتا ہے ۔ کہا : ایوب اس سے کہنے لگے : ہم انہی ( عجیب و ) غریب باتوں سے بھاگتے ہیں یا ڈرتے ہیں ( کہ یہ جھوٹی اور من گھڑت ہوتی ہیں ۔ )",
                "urduNarrator": "ہم سےعبید اللہ بن عمر قواریری نے کہا : ہم سے حماد بن زید نے بیان کیا ، کہا : ایک آدمی تھا ، وہ ایوب ( سختیانی کی علمی مجلس میں حاضری ) کا التزام کرتا تھا اور اس نے ان سے ( حدیث کا ) سماع کیا تھا ۔ ایوب نے اسے غیر حاضر پا کر اس کے بارے میں پوچھا تو لوگوں نے بتایا : جناب ابو بکر ( ایوب کی کنیت ) ! وہ عمرو بن عبید سے منسلک ہو گیا ہے ۔ حماد نے کہا",
                "hadithArabic": "وحَدَّثَنَا عُبَيْدُ اللهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، قَالَ: كَانَ رَجُلٌ قَدْ لَزِمَ أَيُّوبَ وَسَمِعَ مِنْهُ، فَفَقَدَهُ أَيُّوبُ، فَقَالُوا: يَا أَبَا بَكْرٍ إِنَّهُ قَدْ لَزِمَ عَمْرَو بْنَ عُبَيدٍ، قَالَ حَمَّادٌ: فَبَيْنَا أَنَا يَوْمًا مَعَ أَيُّوبَ، وَقَدْ بَكَّرْنَا إِلَى السُّوقِ، فَاسْتَقْبَلَهُ الرَّجُلُ، فَسَلَّمَ عَلَيْهِ أَيُّوبُ، وَسَأَلَهُ، ثُمَّ قَالَ لَهُ أَيُّوبُ: «بَلَغَنِي أَنَّكَ لَزِمْتَ ذَاكَ الرَّجُلَ»، قَالَ حَمَّادٌ: سَمَّاهُ يَعْنِي عَمْرًا، قَالَ: نَعَمْ يَا أَبَا بَكْرٍ إِنَّهُ يَجِيئُنَا بِأَشْيَاءَ غَرَائِبَ، قَالَ: يَقُولُ لَهُ أَيُّوبُ: «إِنَّمَا نَفِرُّ أَوْ نَفْرَقُ مِنْ تِلْكَ الْغَرَائِبِ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7633,
                "hadithNumber": "69",
                "englishNarrator": "Hajjāj bin ash-Shā’ir narrated to me, Sulaymān bin Harb narrated to us, Ibn Zayd, rather Hammād, narrated to us, he said, it was said to Ayyūb, ‘Indeed Amr bin Ubayd transmitted on authority of al-Hasan that he said:",
                "hadithEnglish": "‘There is no flogging the one who gets drunk from Nabīdh’.’ [Ayyūb] said: ‘He lied, for I heard al-Hasan saying, ‘Flog the one who gets drunk from Nabīdh’.’",
                "hadithUrdu": "جسے نبیذ ( شراب ) سے نشہ ہو جائے اسے کوڑے نہ مارے جائں ۔ تو انہوں نے ( ایوب سختیانی ) نے کہا : اس نے جھوٹ بولا ، میں نے ( خود ) حسن سے سنا ، وہ کہتےتھے : جسے نبیذ سے نشہ ہو جائے اسے کوڑے مارے جائیں ۔",
                "urduNarrator": "مجھ سے حجاج بن شعر نے بیان کیا، ہم سےسلیمان بن حرب نے کہا : ہم سے ابن زید ، یعنی حماد نے بیان کیا ، کہا : ایوب سے عرض کی گئی : عمرو بن عبید نے حضرت حسن بصری سے روایت بیان کی کہے ( کہ انہوں نے ) کہا",
                "hadithArabic": "وحَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا ابْنُ زَيْدٍ يَعْنِي حَمَّادًا، قَالَ: قِيلَ لِأَيُّوبَ: إِنَّ عَمْرَو بْنَ عُبَيْدٍ رَوَى عَنِ الْحَسَنِ، قَالَ: لَا يُجْلَدُ السَّكْرَانُ مِنَ النَّبِيذِ، فَقَالَ: كَذَبَ، أَنَا سَمِعْتُ الْحَسَنَ، يَقُولُ: «يُجْلَدُ السَّكْرَانُ مِنَ النَّبِيذِ»",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7634,
                "hadithNumber": "70",
                "englishNarrator": "Hajjāj narrated to me, Sulaymān bin Harb narrated to us, he said, I heard Sallām bin Abī Mutī’ saying, it reached Ayyūb that:",
                "hadithEnglish": "I would go to Amr so he turned to me and said: ‘Have you seen a man whose Dīn you do not trust- how do you trust him regarding Ḥadīth?’",
                "hadithUrdu": "میں عمرو ( بن عبید ) کے ہاں ( درس میں ) جاتا ہوں تو ایک دن وہ میرے پاس آئے اور کہا .’تم نے غور کیا ایک ایسا آدمی آیا جس کے دین پرتمہیں اعتبار نہ ہو ‘ تم اس کی حدیث پر اعتماد نہ کرو گے!",
                "urduNarrator": "مجھ سے حجاج نے بیان کیا، کہا ہم سے سلیمان بن حرب نے بیان کیا، انہوں نے کہا: میں نے سناسلام بن ابی مطیع کہتے ہیں.’جناب ایوب سختیانی کو یہ خبر پہنچی کہ",
                "hadithArabic": "وحَدَّثَنِي حَجَّاجٌ، حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ: سَمِعْتُ سَلَّامَ بْنَ أَبِي مُطِيعٍ، يَقُولُ: بَلَغَ أَيُّوبَ أَنِّي آتِي عَمْرًا فَأَقْبَلَ عَلَيَّ يَوْمًا، فَقَالَ: «أَرَأَيْتَ رَجُلًا لَا تَأْمَنُهُ عَلَى دِينِهِ، كَيْفَ تَأْمَنُهُ عَلَى الْحَدِيثِ؟",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7635,
                "hadithNumber": "71",
                "englishNarrator": "Salamah bin Shabīb narrated to me, al-Humaydī narrated to us, Sufyān narrated to us, he said I heard Abū Mūsā [Isrā’īl bin Mūsā al-Basrī] saying:",
                "hadithEnglish": "‘Amr bin Ubayd narrated to us before what happened’ [i.e. before he became Mu’tazilī].",
                "hadithUrdu": "ہمیں عمرو بن عبید نے بدعت کا شکار ہونے سے پہلے حدیث سنائی ۔",
                "urduNarrator": "مجھ سے سلمہ بن شبیب نے بیان کیا، کہا ہم سے حمیدی نے بیان کیا، کہا ہم سےسفیان نے بیان کیا ، کہا : میں نے ابو موسیٰ ( اسرائیل بن موسیٰ بصری ، نزیل ہند ) سے سنا ، کہہ رہے تھے",
                "hadithArabic": "وحَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، قَالَ: سَمِعْتُ أَبَا مُوسَى، يَقُولُ: «حَدَّثَنَا عَمْرُو بْنُ عُبَيْدٍ قَبْلَ أَنْ يُحْدِثَ»",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7636,
                "hadithNumber": "72",
                "englishNarrator": "Ubayd Allah bin Mu’ādh al-Anbarī narrated to me, my father narrated to us, he said:",
                "hadithEnglish": "‘I wrote to Shu’bah asking him about Abū Shaybah , a judge of Wāsit, so he wrote to me: ‘Do not write anything from him [of Ḥadīth] and tear up my letter [to you about this]’.",
                "hadithUrdu": "میں نے واسط کے قاضی ابو شیبہ کے بارے میں دریافت کرنے کے لیے شعبہ کی طرف لکھا تو انہوں نے جواب میں میری طرف لکھ بھیجا ، اس سے کوئی چیز روایت نہ کرو اور میرا خط پھاڑ دو ۔",
                "urduNarrator": "مجھ سے عبید اللہ بن معاذ عنبری  نے بیان کیا، ہم سے میرے والد نے بیان کیا، انہوں نے کہا,",
                "hadithArabic": "حَدَّثَنِي عُبَيْدُ اللهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، قَالَ: كَتَبْتُ إِلَى شُعْبَةَ أَسْأَلُهُ عَنْ أَبِي شَيْبَةَ قَاضِي وَاسِطَ، فَكَتَبَ إِلَيَّ: «لَا تَكْتُبْ عَنْهُ شَيْئًا وَمَزِّقْ كِتَابِي»",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7637,
                "hadithNumber": "73",
                "englishNarrator": "",
                "hadithEnglish": "Al-Hulwānī narrated to us, he said, I heard Affān [bin Muslim] say: ‘I narrated to Hammād bin Salamah [bin Dīnār al-Basrī], on authority of Sālih al-Murrī , a Ḥadīth on authority of Thābit [bin Aslam al-Banānī], then [Hammād] said: ‘[Sālih] lied’. I also narrated to Hammām on authority of Sālih al-Murrī a Ḥadīth then [Hammām] said: ‘[Sālih] lied’.",
                "hadithUrdu": "۔ عفان ( بن مسلم ) نے کہا : میں نے حماد بن سلمہ کو صالح مری کے واسطے سے ایک حدیث سنائی جو اس نے ثابت سے روایت کی تو انہوں نے ( حماد ) نے کہا : اس نے جھوٹ بولا ۔ ( اسی طرح ) میں نے ہمام کو صالح مری سے ایک حدیث سنائی تو انہوں نے بھی کہا : اس نے جھوٹ بولا ۔",
                "urduNarrator": "",
                "hadithArabic": "وحَدَّثَنَا الْحُلْوَانِيُّ، قَالَ: سَمِعْتُ عَفَّانَ، قَالَ: حَدَّثْتُ حَمَّادَ بْنَ سَلَمَةَ، عَنْ صَالِحٍ الْمُرِّيِّ بِحَدِيثٍ عَنْ ثَابِتٍ، فَقَالَ: «كَذَبَ» وَحَدَّثْتُ هَمَّامًا، عَنْ صَالِحٍ الْمُرِّيِّ، بِحَدِيثٍ، فَقَالَ: «كَذَبَ»",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7638,
                "hadithNumber": "74",
                "englishNarrator": "Mahmūd bin Ghaylān narrated to us, Abū Dāwud narrated to us, he said, Shu’bah said to me: ‘Go to Jarīr bin Hāzim and say to him, ‘It is not allowed for you to transmit from al-Hasan bin Umārah for indeed he lies’.’ Abū Dāwud said, I said to Shu’bah:",
                "hadithEnglish": "‘And how do you know that?’ So [Shu’bah] said: ‘He narrated to us on authority of al-Hakam things that were not found to have any basis’. [Abū Dāwud] said: ‘What things?’ [Shu’bah] said, I said to al-Hakam: ‘Did the Prophet, peace and blessings of Allah upon him, pray over the martyrs of Uhud?’ [al-Hakam] said: ‘He did not pray over them’. Al-Hasan bin Umārah said, on authority of al-Hakam, on authority of Miqsam, on authority of Ibn Abbāsرضی ‌اللہ ‌عنہ ‌: ‘Indeed the Prophet, peace and blessings of Allah upon him, prayed over them and buried them ’. I [Shu’bah] said to al-Hakam: ‘What do you say about the children born from fornication?’ [Al-Hakam] said: ‘Pray over them ’. I [Shu’bah] said: ‘From whose Ḥadīth is it transmitted?’ [Al-Hakam] said: ‘It is transmitted on authority of al-Hasan al-Basrī’.’ Al-Hasan bin Umārah said: ‘Al-Hakam narrated to us, on authority of Yahyā bin al-Jazzār, on authority of Alī رضی ‌اللہ ‌عنہ.",
                "hadithUrdu": "اس نے ہمیں حَکم سے ( روایت کردہ ) احادیث سنائیں جن کی ہم نے اصل نہ پائی ۔ ( کہا ) میں نے عرض کی : کیا چیز روایت کی؟ کہا : میں نے حَکم سے کہا : کیا رسول اللہﷺ نے شہدائے احد کی نماز جنازہ ادا فرمائی؟ تو انہوں نے جواب دیا : آپ نے ان کی نماز جنازہ نہیں پڑھی ( جبکہ ) حسن بن عمارہ نے حَکم ہی سے مِقسم کے حوالے سے ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے یہ روایت بیان کی کہ نبیﷺ نے ان کی نماز جنازہ پڑھی اور انہیں دفن کیا ۔ ( اسی طرح ) میں نے حَکم سے پوچھا : آپ اولاد زنا کے بار ے میں کیا کہتے ہیں؟ کہا : ان کا جنازہ پڑھا جائے گا ۔ میں نے پوچھا : یہ روایت کس حوالے سے بیان کی جاتی ہے ، کہا : حضرت حسن بصری سے ( جبکہ ) حسن بن عمارہ نے کہا : ہم سے حَکم نے یحییٰ بن جزار کے حوالے سے یہ روایت حضرت علی ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے بیان کی ۔",
                "urduNarrator": "ہم سے محمود بن غیلان نے بیان کیا، ہم سےابو داود نے بیان کیا ، کہا : شعبہ نے مجھ سے کہا : جریر بن حازم کے پاس جاؤ اور اس سے کہو : تمہارے لیے حلال نہیں کہ تم حسن بن عمارہ سے ( حدیث ) روایت کرو کیونکہ وہ جھوٹ بولتا ہے ۔ ابو داود نے کہا : میں نے شعبہ سے عرض کی : وہ کیسے؟ تو انہوں نے کہا :",
                "hadithArabic": "وحَدَّثَنِا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا أَبُو دَاوُدَ، قَالَ: قَالَ لِي شُعْبَةُ: ائْتِ جَرِيرَ بْنَ حَازِمٍ، فَقُلْ لَهُ: «لَا يَحِلُّ لَكَ أَنْ تَرْوِيَ عَنِ الْحَسَنِ بْنِ عُمَارَةَ فَإِنَّهُ يَكْذِبُ»، قَالَ أَبُو دَاوُدَ: قُلْتُ لِشُعْبَةَ: وَكَيْفَ ذَاكَ؟ [ص:24] فَقَالَ: «حَدَّثَنَا عَنِ الْحَكَمِ بِأَشْيَاءَ لَمْ أَجِدْ لَهَا أَصْلًا»، قَالَ: قُلْتُ لَهُ: بِأَيِّ شَيْءٍ؟ قَالَ: قُلْتُ لِلْحَكَمِ: أَصَلَّى النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى قَتْلَى أُحُدٍ؟ فَقَالَ: لَمْ يُصَلِّ عَلَيْهِمْ، فَقَالَ الْحَسَنُ بْنُ عُمَارَةَ: عَنِ الْحَكَمِ، عَنْ مِقْسَمٍ، عَنْ ابْنِ عَبَّاسٍ إِنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ صَلَّى عَلَيْهِمْ وَدَفَنَهُمْ، قُلْتُ لِلْحَكَمِ: مَا تَقُولُ فِي أَوْلَادِ الزِّنَا، قَالَ: يُصَلَّى عَلَيْهِمْ، قُلْتُ: مِنْ حَدِيثِ مَنْ يُرْوَى؟ قَالَ: يُرْوَى عَنِ الْحَسَنِ الْبَصْرِيِّ، فَقَالَ الْحَسَنُ بْنُ عُمَارَةَ: حَدَّثَنَا الْحَكَمُ، عَنْ يَحْيَى بْنِ الْجَزَّارِ، عَنْ عَلِيٍّ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 7326,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=293",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=291",
                "label": "291",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=292",
                "label": "292",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=293",
                "label": "293",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=294",
                "label": "294",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=295",
                "label": "295",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=296",
                "label": "296",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=297",
                "label": "297",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=295",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=295",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=293",
        "to": 7350,
        "total": 40465
    }
}