{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 486,
        "data": [
            {
                "id": 12414,
                "hadithNumber": "4851",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated with the same chain of transmitters with the difference that here instead of Urwat al-Bariqi there is Urwa bin ja'd.",
                "hadithUrdu": "ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے جریر نے بیان کیا، حصین رضی اللہ عنہ کی سند سے، سوائے عروہ بن الجعد نے۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، عَنْ حُصَيْنٍ، بِهَذَا الإِسْنَادِ غَيْرَ أَنَّهُ قَالَ عُرْوَةُ بْنُ الْجَعْدِ ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12415,
                "hadithNumber": "4852",
                "englishNarrator": null,
                "hadithEnglish": "It was narrated from 'Urwah Al-Bariqi, from the prophet ﷺ (a Hadith similar to no. 4850),  but he did not mention \"Reward and spoils of war,\" In the hadith of Sufyan (it says): \"He heard 'Urwah Al-Bariqi, who heard the prophet ﷺ.",
                "hadithUrdu": "ہم سے یحییٰ بن یحییٰ، خلف بن ہشام اور ابوبکر بن ابی شیبہ نے ابو الاحواس اور اسحاق بن کی سند سے بیان کیا۔ ابراہیم اور ابن ابی عمر، دونوں سفیان کی سند پر، سب شبیب بن غرقدہ کی سند پر، عروہ الباریقی کی سند پر۔رسول اللہ صلی اللہ علیہ وسلم نے آپ صلی اللہ علیہ وسلم کو ثواب اور غنیمت کا ذکر نہیں کیا اور سفیان کی حدیث میں ہے کہ عروہ الباری نے آپ صلی اللہ علیہ وسلم کو کیا سنا؟ سنا.",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَخَلَفُ بْنُ هِشَامٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ جَمِيعًا عَنْ أَبِي، الأَحْوَصِ ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ أَبِي عُمَرَ، كِلاَهُمَا عَنْ سُفْيَانَ، جَمِيعًا عَنْ شَبِيبِ بْنِ غَرْقَدَةَ، عَنْ عُرْوَةَ الْبَارِقِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَلَمْ يَذْكُرِ الأَجْرَ وَالْمَغْنَمَ ‏.‏ وَفِي حَدِيثِ سُفْيَانَ سَمِعَ عُرْوَةَ الْبَارِقِيَّ سَمِعَ النَّبِيَّ صلى الله عليه وسلم ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12416,
                "hadithNumber": "4853",
                "englishNarrator": null,
                "hadithEnglish": "This was narrated from 'Urwah bin Al-ja'd from the prophet ﷺ, Reward and spoils of war.",
                "hadithUrdu": "ہم سے عبید اللہ بن معاذ نے بیان کیا، ہم سے ابوحنیفہ نے بیان کیا، ان سے ابن المثنیٰ نے اور ہم سے ابن بشار نے بیان کیا، کہا کہ ہم سے محمد بن جعفر نے بیان کیا، ان دونوں نے ان کی سند سے شعبہ، ابواسحاق کی سند سے، الاثار بن حارث کی سند سے، عروہ کی سند سے، ابن الجعد سے، رسول اللہ صلی اللہ علیہ وسلم سے۔ اس روایت میں ثواب اور غنیمت کا ذکر نہیں ہے۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا ابْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، كِلاَهُمَا عَنْ شُعْبَةَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْعَيْزَارِ بْنِ حُرَيْثٍ، عَنْ عُرْوَةَ، بْنِ الْجَعْدِ عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا ‏.‏ وَلَمْ يَذْكُرِ ‏ ‏ الأَجْرَ وَالْمَغْنَمَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12417,
                "hadithNumber": "4854",
                "englishNarrator": "It has been narrated on the authority of Anas bin Malik رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "The Messenger of Allah (ﷺ) said: There is a blessing in the forelocks of the war horses.",
                "hadithUrdu": "رسول ﷲ صلی ‌اللہ ‌علیہ ‌وسلم نے فرمایا برکت گھوڑوں کی پیشانیوں میں ہے۔",
                "urduNarrator": "ہم سے عبید اللہ بن معاذ نے بیان کیا، ہم سے ابوحنیفہ نے بیان کیا، ان سے محمد بن المثنیٰ نے اور ہم سے ابن بشار نے بیان کیا، انہوں نے کہا کہ ہم سے یحییٰ بن سعید نے بیان کیا، ان دونوں سے شعبہ کی سند سے، ابو الطیہ کی سند سے، انس رضی ‌اللہ ‌عنہ سے روایت ہے",
                "hadithArabic": "وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، كِلاَهُمَا عَنْ شُعْبَةَ، عَنْ أَبِي التَّيَّاحِ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ ‏ الْبَرَكَةُ فِي نَوَاصِي الْخَيْلِ ‏ ‏ ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12418,
                "hadithNumber": "4855",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been narrated on the authority of Anas رضی اللہ عنہ through another chain of transmitters.",
                "hadithUrdu": "ہم سے یحییٰ بن حبیب نے بیان کیا، کہا ہم سے خالد نے بیان کیا، ہم سے ابن حارث نے بیان کیا، کہا ہم سے محمد بن ولید نے بیان کیا، ہم سے محمد بن جعفر نے بیان کیا، انہوں نے کہا ہم سے شعبہ نے بیان کیا، انہوں نے ابو الطیہ کی سند سے، انہوں نے انس رضی اللہ عنہ کو رسول اللہ صلی اللہ علیہ وسلم سے اسی طرح کی بات بیان کرتے ہوئے سنا۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ، حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ، الْوَلِيدِ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالاَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي التَّيَّاحِ، سَمِعَ أَنَسًا، يُحَدِّثُ عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12419,
                "hadithNumber": "4856",
                "englishNarrator": "It has been narrated on the authority of Abn Huraira رضی اللہ عنہ:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to dislike the Shikal horse.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم گھوڑوں میں شِکال کو ناپسند فرماتے تھے ۔ ( شِکال کا مفہوم اگلی حدیث میں بیان ہوا ہے ۔ )",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ، ابوبکر بن ابی شیبہ، زہیر بن حرب اور ابو کریب نے بیان کیا، کہا کہ ہمیں یحییٰ نے خبر دی، اور انہوں نے کہا۔ وکیع نے سفیان سے ، انہوں نے سلم بن عبدالرحمٰن سے ، انہوں نے ابوزرعہ سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَأَبُو كُرَيْبٍ، قَالَ يَحْيَى: أَخْبَرَنَا، وقَالَ الْآخَرُونَ: حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ سَلْمِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: «كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَكْرَهُ الشِّكَالَ مِنَ الْخَيْلِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12420,
                "hadithNumber": "4857",
                "englishNarrator": "A similar report (as no. 4856) was narrated from Sufyan with this chain of narration. In the Hadith of 'Abdur-Razzaq it adds:",
                "hadithEnglish": "Shikal is when a horse has some whiteness on its right hind foot and left forefoot, or on its right forefoot nd its left hind foot.\"",
                "hadithUrdu": "شکال یہ ہے کہ گھوڑے کے داہنے پاؤں اور بائیں ہاتھ میں سفیدی ہو یا دائیں ہاتھ اور بائیں پاؤں میں سفیدی ہو ( الٹی طرف کے آگے اور پیچھے دو قدم سفید ہوں ۔ )",
                "urduNarrator": "عبداللہ بن نمیر اور عبدالرزاق نے سفیان سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ۔ اور عبدالرزاق کی حدیث میں یہ اضافہ کیا",
                "hadithArabic": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، ح وحَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ بِشْرٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، جَمِيعًا عَنْ سُفْيَانَ، بِهَذَا الْإِسْنَادِ مِثْلَهُ، وَزَادَ فِي حَدِيثِ عَبْدِ الرَّزَّاقِ: وَالشِّكَالُ: أَنْ يَكُونَ الْفَرَسُ فِي رِجْلِهِ الْيُمْنَى بَيَاضٌ، وَفِي يَدِهِ الْيُسْرَى، أَوْ فِي يَدِهِ الْيُمْنَى وَرِجْلِهِ الْيُسْرَى.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12421,
                "hadithNumber": "4858",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like that of Waki (no. 4556) was narrated from Abu Hurairah رضی اللہ عنہ , from the prophet ﷺ. According to the report of Wahb: \"From 'Abdullah bin Yazid,\" but he did not mention An-Nakha'i.",
                "hadithUrdu": "محمد بن جعفر اور وہب بن جریر نے ہمیں شعبہ سے حدیث بیان کی ، انہوں نے عبداللہ بن یزید نخعی سے ، انہوں نے ابوزرعہ سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے ، انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے اسی طرح روایت کی جس طرح وکیع کی حدیث ہے ۔ اور وہب کی روایت میں ( سند اس طرح ) ہے : انہوں نے عبداللہ بن یزید سے روایت کی لیکن نخعی کا ذکر نہیں کیا ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدٌ يَعْنِي ابْنَ جَعْفَرٍ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنِي وَهْبُ بْنُ جَرِيرٍ، جَمِيعًا عَنْ شُعْبَةَ، عَنْ عَبْدِ اللهِ بْنِ يَزِيدَ النَّخَعِيِّ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ وَكِيعٍ، وَفِي رِوَايَةِ وَهْبٍ، عَنْ عَبْدِ اللهِ بْنِ يَزِيدَ، وَلَمْ يَذْكُرِ النَّخَعِيَّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12422,
                "hadithNumber": "4859",
                "englishNarrator": "It has been narrated on the authority of Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah (ﷺ) said: Allah has undertaken to look after the affairs of one who goes out to fight in His way believing in Him and affirming the truth of His Apostles. He is committed to His care that Re will either admit him to Paradise or bring him back to his home from where he set out with a reward or (his share of) booty. By the Being in Whose Hand is the life of Muhammad. If a person gets wounded in the way of Allah, he will come on the Day of Judgment with his wound in the same condition as it was when it was first inflicted; its colour being the colour of blood but its smell will be the smell of musk. By, the Being in Whose Hand is Muhammad's life, if it were not to be too hard upon the Muslim. I would not lag behind any expedition which is going to fight in the cause of Allah. But I do not have abundant means to provide them (the Mujahids) with riding beasts, nor have they (i. e. all of them) abundant means (to provide themselves with all the means of Jihad) so that they could he left behind. By the Being in Whose Hand is Muhammad's life, I love to fight in the way of Allah and be killed, to fight and again be killed and to fight again and be killed.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ تعالیٰ نے خود ( ایسے شخص کی ) ضمانت دی ہے کہ جو شخص اس کے راستے میں نکلا ، میرے راستے میں جہاد ، میرے ساتھ ایمان اور میرے رسولوں کی تصدیق کے سوا اور کسی چیز نے اسے گھر سے نہیں نکالا ، اس کی مجھ پر ضمانت ہے کہ میں اسے جنت میں داخل کروں گا ، یا پھر اسے اس کی اسی قیام گاہ میں واپس لے آؤں گا جس سے وہ ( میری خاطر ) نکلا تھا ، جو اجر اور غنیمت اس نے حاصل کی وہ بھی اسے حاصل ہو گی ۔ اس ذات کی قسم جس کے ہاتھ میں محمد صلی اللہ علیہ وسلم کی جان ہے! جو زخم بھی اللہ کی راہ میں لگایا جاتا ہے ( تو زخم کھانے والا ) قیامت کے دن اسی حالت میں آئے گا جس حالت میں اس کو زخم لگا تھا ، اس ( زخم ) کا رنگ خون کا ہو گا اور خوشبو کستوری کی ، اور اس ذات کی قسم جس کے ہاتھ میں محمد صلی اللہ علیہ وسلم کی جان ہے! اگر مسلمانوں پر دشوار نہ ہوتا تو میں اللہ کی راہ میں جہاد کرنے والے کسی بھی لشکر سے مختلف رویہ اپناتے ہوئے ( گھر میں ) نہ بیٹھتا ، لیکن میرے پاس اتنی وسعت نہیں ہوتی کہ میں سب مسلمانوں کو سواریاں مہیا کر سکوں اور نہ ہی ان ( سب ) کے پاس اتنی وسعت ہوتی ہے اور یہ بات ان کو بہت شاق گزرتی ہے کہ وہ مجھ سے پیچھے رہ جائیں ۔ اس ذات کی قسم کس کے ہاتھ میں محمد صلی اللہ علیہ وسلم کی جان ہے! مجھے یہ پسند ہے کہ میں اللہ کی راہ میں جہاد کروں اور قتل کر دیا جاؤں ، پھر جہاد کروں ، پھر قتل کر دیا جاؤں اور پھر جہاد کروں ، پھر قتل کر دیا جاؤں ۔ \"",
                "urduNarrator": "مجھ سے زہیر بن حرب نے کہا, جریر نے عمارہ بن قعقاع سے ، انہوں نے ابوزرعہ سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ عُمَارَةَ وَهُوَ ابْنُ الْقَعْقَاعِ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «تَضَمَّنَ اللهُ لِمَنْ خَرَجَ فِي سَبِيلِهِ، لَا يُخْرِجُهُ إِلَّا جِهَادًا فِي سَبِيلِي، وَإِيمَانًا بِي، وَتَصْدِيقًا بِرُسُلِي، فَهُوَ عَلَيَّ ضَامِنٌ أَنْ أُدْخِلَهُ الْجَنَّةَ، أَوْ أَرْجِعَهُ إِلَى مَسْكَنِهِ الَّذِي خَرَجَ مِنْهُ، نَائِلًا مَا نَالَ مِنْ أَجْرٍ أَوْ غَنِيمَةٍ، وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ، مَا مِنْ كَلْمٍ يُكْلَمُ فِي سَبِيلِ اللهِ، إِلَّا جَاءَ يَوْمَ الْقِيَامَةِ كَهَيْئَتِهِ حِينَ كُلِمَ، لَوْنُهُ لَوْنُ دَمٍ، وَرِيحُهُ مِسْكٌ، وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ، لَوْلَا أَنْ يَشُقَّ عَلَى الْمُسْلِمِينَ مَا قَعَدْتُ خِلَافَ سَرِيَّةٍ تَغْزُو فِي سَبِيلِ اللهِ أَبَدًا، وَلَكِنْ لَا أَجِدُ سَعَةً فَأَحْمِلَهُمْ، وَلَا يَجِدُونَ سَعَةً، وَيَشُقُّ عَلَيْهِمْ أَنْ يَتَخَلَّفُوا عَنِّي، وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ، لَوَدِدْتُ أَنِّي أَغْزُو فِي سَبِيلِ اللهِ فَأُقْتَلُ، ثُمَّ أَغْزُو فَأُقْتَلُ، ثُمَّ أَغْزُو فَأُقْتَلُ».",
                "headingArabic": "فَضْلِ الْجِهَادِ وَالْخُرُوجِ فِي سَبِيلِ اللَّهِ ‏‏",
                "headingUrdu": "جہاد اور اللہ کی راہ میں نکلنے کی فضیلت",
                "headingEnglish": "The virtue of Jihad and going out (to fight) in the cause of Allah",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12423,
                "hadithNumber": "4860",
                "englishNarrator": null,
                "hadithEnglish": "It was narrated from 'Umrah with this chain of narration (a hadith similar to no. 4859).",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، انہوں نے کہا: ابن فضیل نے عمارہ سے اسی سند کے ساتھ ( یہی ) حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، قَالَا: حَدَّثَنَا ابْنُ فُضَيْلٍ، عَنْ عُمَارَةَ، بِهَذَا الْإِسْنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12424,
                "hadithNumber": "4861",
                "englishNarrator": "It has been narrated on the authority of Abu Huraira رضی اللہ عنہ who said:",
                "hadithEnglish": "Allah has undertaken to provide for one who leaves his home (only) to fight for His cause and to affirm the truth of His word; Allah will either admit him to Paradise or will bring him back home from where he had come out, with his reward and booty.",
                "hadithUrdu": "\" جس شخص نے اللہ کی راہ میں جہاد کیا ، اسے اپنےگھر سے اللہ کی راہ میں جہاد اور اس کلمے کی تصدیق کے علاوہ اور کسی چیز نے نہیں نکالا تو اللہ اس کے لیے اس بات کا کفیل بنا ہے کہ ( شہید ہو گیا تو ) اسے جنت میں داخل کرے گا یا پھر اس غنیمت اور اجر سمیت جو اسے ملا ، اس کے اسی ٹھکانے میں اس کو واپس لے جائے گا جہاں سے وہ ( جہاد کے لیے ) نکلا تھا ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا, مغیرہ بن عبدالرحمٰن حزامی نے ابوزناد سے خبر دی ، انہوں نے اعرج سے ، انہوں نے ابوہریرہ رضی اللہ عنہ سے ، انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی , فرمایا :",
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ الْحِزَامِيُّ، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «تَكَفَّلَ اللهُ لِمَنْ جَاهَدَ فِي سَبِيلِهِ، لَا يُخْرِجُهُ مِنْ بَيْتِهِ إِلَّا جِهَادٌ فِي سَبِيلِهِ، وَتَصْدِيقُ كَلِمَتِهِ، بِأَنْ يُدْخِلَهُ الْجَنَّةَ، أَوْ يَرْجِعَهُ إِلَى مَسْكَنِهِ الَّذِي خَرَجَ مِنْهُ، مَعَ مَا نَالَ مِنْ أَجْرٍ أَوْ غَنِيمَةٍ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12425,
                "hadithNumber": "4862",
                "englishNarrator": "It has been narrated on the authority of Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: One who is wounded in the way of Allah-and Allah knows better who is wounded in His way-will appear on the Day of Judgment with his wound bleeding. The colour (of its discharge) will be the colour of blood, (but) its smell will be the smell of musk.",
                "hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم نے فرمایا : \" کوئی شخص اللہ کی راہ میں زخمی نہیں کیا گیا اور اللہ خوب جانتا ہے کہ اس کی راہ میں کسے زخمی کیا گیا مگر وہ قیامت کے دن اس طرح آئے گا کہ اس کے زخم سے خون امڈ رہا ہو گا ، رنگ خوب کا ہو گا اور خوشبو کستوری کی ۔ \"",
                "urduNarrator": "عمرو ناقد اور زہیر بن حرب نے کہا : ہمیں سفیان بن عیینہ نے ابوزناد سے حدیث بیان کی ، انہوں نے اعرج سے ، انہوں نے ابوہریرہ رضی اللہ عنہ سے ، انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی",
                "hadithArabic": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالَا: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «لَا يُكْلَمُ أَحَدٌ فِي سَبِيلِ اللهِ، وَاللهُ أَعْلَمُ بِمَنْ يُكْلَمُ فِي سَبِيلِهِ، إِلَّا جَاءَ يَوْمَ الْقِيَامَةِ وَجُرْحُهُ يَثْعَبُ، اللَّوْنُ لَوْنُ دَمٍ، وَالرِّيحُ رِيحُ مِسْكٍ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12426,
                "hadithNumber": "4863",
                "englishNarrator": "It has been narrated on the authority of Abu Haraira رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Every wound received by a Muslim in the way of Allah will appear on the Day of Judgment in the same condition as it was when it was inflicted, and would be bleeding profusely. The color (of its discharge) will be the color of blood, but its smell will be the smell of musk. By the Being in Whose Hand is Muhammad's life, if it were not hard upon the Muslims, I would not lag behind any expedition undertaken for Jihad, but I do not possess abundant means to provide the Mujahids with riding animals, nor do they (i.e. all of them) have abundant means (to provide themselves with all the means of Jihad) to follow me, nor would it please their hearts to stay behind me.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ہر زخم جو مسلمان کو اللہ کی راہ میں لگایا جاتا ہے ، قیامت کے دن پھر اسی طرح اپنی اسی حالت میں ہو گا جس طرح زخم لگتے وقت تھا ، اس سے خون ٹپک رہا ہو گا ، اس کا رنگ خون کا ہو گا اور خوشبو کستوری جیسی ہو گی ، اس ذات کی قسم جس کے ہاتھ میں محمد صلی اللہ علیہ وسلم کی جان ہے! اگر یہ ( ڈر ) نہ ہوتا کہ میں مسلمانوں کو مشقت میں ڈالوں گا تو میں اللہ کی راہ میں لڑنے والے کسی بھی لشکر سے پیچھے نہ بیٹھا رہتا ، لیکن میں اتنی وسعت نہیں پاتا کہ میں ان ( مسلمانوں ) کو سواریاں مہیا کروں ، نہ ان کے پاس اتنی وسعت ہے کہ وہ سواریاں مہیا کر کے میرے پیچھے آئیں ، ان کے دل اس پر ( بھی ) راضی نہیں ہوتے کہ وہ میرے پیچھے گھروں میں بیٹھ رہیں ۔ \"",
                "urduNarrator": "ہم سے محمد بن رافع نے بیان کیا، ہم سے عبدالرزاق نے بیان کیا، ہم سے معمر نے بیان کیا, ہمام بن منبہ سے روایت ہے ، کہا : یہ احادیث ہیں جو حضرت ابوہریرہ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کیں ، انہوں نے متعدد احادیث بیان کیں ، ان میں سے ایک یہ تھی",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ: هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَذَكَرَ أَحَادِيثَ مِنْهَا، وَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «كُلُّ كَلْمٍ يُكْلَمُهُ الْمُسْلِمُ فِي سَبِيلِ اللهِ، ثُمَّ تَكُونُ يَوْمَ الْقِيَامَةِ كَهَيْئَتِهَا إِذَا طُعِنَتْ، تَفَجَّرُ دَمًا، اللَّوْنُ لَوْنُ دَمٍ، وَالْعَرْفُ عَرْفُ الْمِسْكِ» وَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «وَالَّذِي نَفْسُ مُحَمَّدٍ فِي يَدِهِ، لَوْلَا أَنْ أَشُقَّ عَلَى الْمُؤْمِنِينَ مَا قَعَدْتُ خَلْفَ سَرِيَّةٍ تَغْزُو فِي سَبِيلِ اللهِ، وَلَكِنْ لَا أَجِدُ سَعَةً فَأَحْمِلَهُمْ، وَلَا يَجِدُونَ سَعَةً فَيَتَّبِعُونِي، وَلَا تَطِيبُ أَنْفُسُهُمْ أَنْ يَقْعُدُوا بَعْدِي».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12427,
                "hadithNumber": "4864",
                "englishNarrator": "It has been narrated on the authority of Abu Huraira رضی اللہ عنہ who said:",
                "hadithEnglish": "I heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) say: I would not stay behind (when) an expedition (for Jihad was being mobilised) if it were going to be too hard upon the believers.... This is followed by the same words as have appeared in the previous tradition, but this tradition has the same ending as the previous hadith with a slight difference in the wording: By the Being in Whose Hand is my life, I love that I should be killed in the way of Allah; then I should be brought back to life and be killed again in His way....",
                "hadithUrdu": "میں نے نبی صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا : \" اگر یہ بات نہ ہوتی کہ میں مسلمانوں کو مشقت میں مبتلا کروں گا تو میں کسی لشکر سے پیچھے نہ رہتا ۔ \" ان کی حدیث کے مانند ۔ اور اسی سند کے ساتھ ( اور اس میں یہ الفاظ بھی ہیں : ) \" اس ذات کی قسم جس کے ہاتھ میں محمد ( صلی اللہ علیہ وسلم ) کی جان ہے! میں چاہتا ہوں کہ اللہ کی راہ میں قتل کیا جاؤں ، پھر زندہ کیا جاؤں \" حضرت ابوہریرہ رضی اللہ عنہ سے ابوزرعہ کی روایت کردہ حدیث کے مطابق ۔",
                "urduNarrator": "ابن ابی عمر نے کہا : ہمیں سفیان نے ابوزناد سے ، انہوں نے اعرج سے ، انہوں نے ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَوْلَا أَنْ أَشُقَّ عَلَى الْمُؤْمِنِينَ مَا قَعَدْتُ خِلَافَ سَرِيَّةٍ»، بِمِثْلِ حَدِيثِهِمْ وَبِهَذَا الْإِسْنَادِ، «وَالَّذِي نَفْسِي بِيَدِهِ، لَوَدِدْتُ أَنِّي أُقْتَلُ فِي سَبِيلِ اللهِ، ثُمَّ أُحْيَا» بِمِثْلِ حَدِيثِ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12428,
                "hadithNumber": "4865",
                "englishNarrator": "It has been narrated on the authority of Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: If it were not hard upon my Umma (to follow my example), I would not lag behind any expedition-as in the traditions gone before.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اگر یہ ( خدشہ ) نہ ہوتا کہ میں اپنی امت کو مشکل میں ڈالوں گا تو مجھے یہ پسند تھا کہ میں کسی لشکر سے پیچھے نہ رہوں ۔ \" ان سب کی حدیث کی مانند ۔",
                "urduNarrator": "ہم سے محمد بن المثنیٰ نے بیان کیا، کہا ہم سے عبد الوہاب نے بیان کیا، ہم سے ثقفی نے بیان کیا، ان سے ابو بکر بن ابی شیبہ نے بیان کیا، ہم سے ابو معاویہ نے بیان کیا، ح. ہم سے ابن ابی عمر نے بیان کیا، کہا ہم سے مروان بن معاویہ نے بیان کیا, یحییٰ بن سعید نے ابوصالح سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ يَعْنِي الثَّقَفِيَّ، ح وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح وحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، كُلُّهُمْ عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَوْلَا أَنْ أَشُقَّ عَلَى أُمَّتِي لَأَحْبَبْتُ أَنْ لَا أَتَخَلَّفَ خَلْفَ سَرِيَّةٍ»، نَحْوَ حَدِيثِهِمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12429,
                "hadithNumber": "4866",
                "englishNarrator": "It was narrated that Abu Huraira رضی اللہ عنہ said:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Allah takes care of one who goes out in the way of Allah but ends in the words: I would not lag behind any expedition which is undertaken to fight in the way of Allah, the Exalted.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جو شخص اللہ کی راہ میں نکلا ، اللہ اس کے لیے اس بات کی ضمانت دیتا ہے \" سے لے کر \" میں اللہ کی راہ میں لڑنے والے کسی لشکر سے پیچھے نہ رہتا \" تک ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے جریر نے بیان کیا, سہیل منے اپنے والد ( ابو صالح ) سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «تَضَمَّنَ اللهُ لِمَنْ خَرَجَ فِي سَبِيلِهِ» إِلَى قَوْلِهِ «مَا تَخَلَّفْتُ خِلَافَ سَرِيَّةٍ تَغْزُو فِي سَبِيلِ اللهِ تَعَالَى».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12430,
                "hadithNumber": "4867",
                "englishNarrator": "It has been narrated on the authority of Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم) said: Nobody who dies and has something good for him with Allah will (ever like to) return to this world even though he were offered the whole world and all that is in its (as an inducement), except the martyr who desires to return and be killed in the world for the (great) merit of martyrdom that he has seen.",
                "hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم  نے فرمایا : \" کوئی بھی ذی روح جو فوت ہو جائے اور اللہ تعالیٰ کے ہاں اس کے لیے بھلائی موجود ہو ، یہ بات پسند نہیں کرتا کہ وہ دنیا میں واپس جائے یا دنیا اور جو کچھ بھی دنیا میں ہے ، اس کو مل جائے ، سوائے شہید کے ، صرف وہ شہادت کی جو فضیلت دیکھتا ہے اس کی وجہ سے اس بات کی تمنا کرتا ہے کہ وہ دنیا میں واپس جائے اور اللہ کی راہ میں ( دوبارہ ) شہید کیا جائے ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, ابو خالد احمر نے ہمیں شعبہ سے حدیث بیان کی ، انہوں نے قتادہ اور حُمید سے ، انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے ، انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ، عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، وَحُمَيْدٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَا مِنْ نَفْسٍ تَمُوتُ، لَهَا عِنْدَ اللهِ خَيْرٌ، يَسُرُّهَا أَنَّهَا تَرْجِعُ إِلَى الدُّنْيَا، وَلَا أَنَّ لَهَا الدُّنْيَا وَمَا فِيهَا، إِلَّا الشَّهِيدُ، فَإِنَّهُ يَتَمَنَّى أَنْ يَرْجِعَ، فَيُقْتَلَ فِي الدُّنْيَا لِمَا يَرَى مِنْ فَضْلِ الشَّهَادَةِ».",
                "headingArabic": "فَضْلِ الشَّهَادَةِ فِي سَبِيلِ اللَّهِ تَعَالَى ‏‏",
                "headingUrdu": "اللہ کی راہ میں شہادت کی فضیلت",
                "headingEnglish": "The virtue of Martyrdom in the cause of Allah",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12431,
                "hadithNumber": "4868",
                "englishNarrator": "It has been narrated on the authority of Anas bin Malik رضی اللہ عنہ (through a different chain of transmitters):",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Nobody who enters Paradise will (ever like to) return to this world even if he were offered everything on the surface of the earth (as an inducement) except the martyr who will desire to return to this world and be killed ten times for the sake of the great honor that has been bestowed upon him.",
                "hadithUrdu": "آپ نے فرمایا : \" جنت میں داخل ہونے والا کوئی بھی شخص ایسا نہیں جو یہ پسند کرتا ہو کہ وہ دنیا میں واپس جائے ، یا زمین پر موجود کوئی چیز اس کی ہو جائے ، سوائے شہید کے ، وہ ( اپنی ) جو عزت افزائی دیکھتا ہے اس کی بنا پر یہ تمنا کرتا ہے کہ وہ دس بار واپس جائے اور قتل کیا جائے ۔ \"",
                "urduNarrator": "ہم سے محمد بن المثنی اور ابن بشار نے بیان کیا، کہا: محمد بن جعفر نے کہا : ہمیں شعبہ نے قتادہ سے حدیث بیان کی ، انہوں نے کہا : میں نے حضرت انس بن مالک رضی اللہ عنہ کو رسول اللہ صلی اللہ علیہ وسلم سے حدیث بیان کرتے ہوئے سنا",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، قَالَ: سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يُحَدِّثُ عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «مَا مِنْ أَحَدٍ يَدْخُلُ الْجَنَّةَ يُحِبُّ أَنْ يَرْجِعَ إِلَى الدُّنْيَا، وَأَنَّ لَهُ مَا عَلَى الْأَرْضِ مِنْ شَيْءٍ، غَيْرُ الشَّهِيدِ، فَإِنَّهُ يَتَمَنَّى أَنْ يَرْجِعَ، فَيُقْتَلَ عَشْرَ مَرَّاتٍ، لِمَا يَرَى مِنَ الْكَرَامَةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12432,
                "hadithNumber": "4869",
                "englishNarrator": "It has been narrated on the authority of Abu Huraira رضی اللہ عنہ who said:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was asked: What deed could be an equivalent of Jihad in the way of Allah, the Almighty and Exalted? He answered: You do not have the strength to do that deed. The narrator said: They repeated the question twice or thrice. Every time he answered: You do not have the strength to do it. When the question was asked for the third time, he said: One who goes out for Jihad is like a person who keeps fasts, stands in prayer (constantly), (obeying) Allah's (behests contained in) the verses (of the Qur'an), and does not exhibit any lassitude in fasting and prayer until the Mujahid returns from Jihad in the way of Allah, the Exalted.",
                "hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم سے پوچھا گیا : اللہ عزوجل کی راہ میں جہاد کے برابر کون سا عمل ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا : \" تم اس کی استطاعت نہیں رکھتے ۔ \" حضرت ابوہریرہ رضی اللہ عنہ نے کہا : صحابہ نے دو یا تین بار سوال دہرایا ، آپ نے ہر بار فرمایا : \" تم اس کی اسطاعت نہیں رکھتے ۔ \" تیسری بار فرمایا : \" اللہ کی راہ میں جہاد کرنے والے کی مثال اس شخص کی سی ہے جو روزہ دار ہو ، اللہ کے سامنے اس کی آیات کے ساتھ زاری کر رہا ہو ، وہ اس وقت تک نہ روزے میں وقفہ آنے دے ، نہ نماز میں یہاں تک کہ اللہ کی راہ میں جہاد کرنے والا واپس آ جائے ۔ \"",
                "urduNarrator": "ہم سے سعید بن منصور نے بیان کیا, خالد بن عبداللہ واسطی نے سہیل بن ابی صالح سے حدیث بیان کی ، انہوں نے اپنے والد سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللهِ الْوَاسِطِيُّ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قِيلَ لِلنَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: مَا يَعْدِلُ الْجِهَادَ فِي سَبِيلِ اللهِ عَزَّ وَجَلَّ؟ قَالَ: «لَا تَسْتَطِيعُونَهُ»، قَالَ: فَأَعَادُوا عَلَيْهِ مَرَّتَيْنِ، أَوْ ثَلَاثًا كُلُّ ذَلِكَ يَقُولُ: «لَا تَسْتَطِيعُونَهُ»، وَقَالَ فِي الثَّالِثَةِ: «مَثَلُ الْمُجَاهِدِ فِي سَبِيلِ اللهِ كَمَثَلِ الصَّائِمِ الْقَائِمِ الْقَانِتِ بِآيَاتِ اللهِ، لَا يَفْتُرُ مِنْ صِيَامٍ، وَلَا صَلَاةٍ، حَتَّى يَرْجِعَ الْمُجَاهِدُ فِي سَبِيلِ اللهِ تَعَالَى».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12433,
                "hadithNumber": "4870",
                "englishNarrator": null,
                "hadithEnglish": "A similar report (as no. 4869) was narrated from Suhail with this chain of narration.",
                "hadithUrdu": "ہم سے قتیبہ بن سعید نے بیان کیا:ہم سے قتیبہ بن سعید نے بیان کیا, ابو عوانہ ، جریر اور ابو معاویہ سب نے اسی سند کے ساتھ سہیل سے اسی کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو عَوَانَةَ، ح وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، ح وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، كُلُّهُمْ عَنْ سُهَيْلٍ بِهَذَا الْإِسْنَادِ نَحْوَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12434,
                "hadithNumber": "4871",
                "englishNarrator": "It has been narrated on the authority of Nu'man bin Bashir رضی اللہ عنہ who said:",
                "hadithEnglish": "As I was (sitting) near the pulpit of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), a man said: I do not care if, after embracing Islam, I do not do any good deed (except) distributing drinking water among the pilgrims. Another said: I do not care if, after embracing Islam, I do not do any good deed beyond maintenance service to the Sacred Mosque. Another said: Jihad in the way of Allah is better than what you have said. 'Umar رضی اللہ عنہ reprimanded them and said: Don't raise your voices near the pulpit of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) on Friday. When prayer was over, I entered (the apartment of the Holy Prophet) and asked his verdict about the matter in which they had differed. (It was upon this that) Allah, the Almighty and Exalted, revealed the Qur'anic verse: Do you make the giving of drinking water to the pilgrims and the maintenance of the Sacred Mosque equal to (the service of those) who believe in Allah and the Last Day and strive hard in the cause of Allah. They are not equal in the sight of God. And Allah guides not the wrongdoing people.",
                "hadithUrdu": "میں رسول اللہ صلی اللہ علیہ وسلم کے منبر کے پاس تھا کہ ایک شخص نے کہا : اسلام لانے کے بعد اگر میں صرف حاجیوں کو پانی پلاؤں اور اس کے سوا کوئی دوسرا عمل نہ کروں تو مجھے کوئی پرواہ نہیں ۔ دوسرے نے کہا : اسلام لانے کے بعد اگر میں صرف مسجد حرام کو آباد کروں اور اس کے سوا اور کوئی دوسرا عمل نہ کروں تو مجھے کوئی پرواہ نہیں ۔ تیسرے نے کہا : جو تم سب نے کہا اس سے اللہ کی راہ میں جہاد کرنا افضل ہے ۔ حضرت عمر رضی اللہ عنہ نے ان کو ڈانٹا اور کہا : رسول اللہ صلی اللہ علیہ وسلم کے منبر کے پاس آواز اونچی نہ کرو ۔ ( پھر بتایا کہ ) وہ جمعے کا دن تھا ۔ لیکن ( جمعے سے پہلے گفتگو کرنے کے بجائے ) جب میں نے جمعہ پڑھ لیا تو حاضر خدمت ہوں گا اور جس کے بارے میں تم جھگڑ رہے ہو اس کے بارے میں آپ صلی اللہ علیہ وسلم سے پوچھوں گا ، تو ( اس موقع پر ) اللہ تعالیٰ نے یہ آیت اتاری ( ہوئی ) بھی ( جو آپ نے سنائی ) : \" کیا تم حاجیوں کو پانی پلانا اور مسجد حرام کو آباد کرنا اس شخص کے ( عمل ) جیسا سمجھتے ہو جو اللہ اور یومِ آخرت پر ایمان لایا ( اور اس نے اللہ کے راستے میں جہاد کیا؟ ) \" آیت کے آخر تک ۔",
                "urduNarrator": "حسن بن علی الحلوانی نے مجھ سے کہا, ابوتوبہ نے ہمیں حدیث بیان کی ، کہا : ہمیں معاویہ بن سلام نے زید بن سلام سے حدیث بیان کی ، انہوں نے ابوسلام سے سنا ، انہوں نے کہا : مجھے حضرت نعمان بن بشیر رضی اللہ عنہ نے حدیث سنائی ، کہا",
                "hadithArabic": "حَدَّثَنِي حَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، حَدَّثَنَا أَبُو تَوْبَةَ، حَدَّثَنَا مُعَاوِيَةُ بْنُ سَلَّامٍ، عَنْ زَيْدِ بْنِ سَلَّامٍ، أَنَّهُ سَمِعَ أَبَا سَلَّامٍ، قَالَ: حَدَّثَنِي النُّعْمَانُ بْنُ بَشِيرٍ، قَالَ: كُنْتُ عِنْدَ مِنْبَرِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ رَجُلٌ: مَا أُبَالِي أَنْ لَا أَعْمَلَ عَمَلًا بَعْدَ الْإِسْلَامِ إِلَّا أَنْ أُسْقِيَ الْحَاجَّ، وَقَالَ آخَرُ: مَا أُبَالِي أَنْ لَا أَعْمَلَ عَمَلًا بَعْدَ الْإِسْلَامِ إِلَّا أَنْ أَعْمُرَ الْمَسْجِدَ الْحَرَامَ، وَقَالَ آخَرُ: الْجِهَادُ فِي سَبِيلِ اللهِ أَفْضَلُ مِمَّا قُلْتُمْ، فَزَجَرَهُمْ عُمَرُ، وَقَالَ: لَا تَرْفَعُوا أَصْوَاتَكُمْ عِنْدَ مِنْبَرِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَوْمُ الْجُمُعَةِ، وَلَكِنْ إِذَا صَلَّيْتُ الْجُمُعَةَ دَخَلْتُ فَاسْتَفْتَيْتُهُ فِيمَا اخْتَلَفْتُمْ فِيهِ، فَأَنْزَلَ اللهُ عَزَّ وَجَلَّ: {أَجَعَلْتُمْ سِقَايَةَ الْحَاجِّ وَعِمَارَةَ الْمَسْجِدِ الْحَرَامِ كَمَنْ آمَنَ بِاللهِ وَالْيَوْمِ الْآخِرِ} [التوبة: 19] الْآيَةَ إِلَى آخِرِهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12435,
                "hadithNumber": "4872",
                "englishNarrator": "Nu'man bin Bashir رضی اللہ عنہ said:",
                "hadithEnglish": "\"I was in the Minbar of the Messenger of Allah ﷺ...\" a Hadith like that of Abu Tawbah.",
                "hadithUrdu": "میں رسول اللہ صلی اللہ علیہ وسلم کے منبر کے پاس بیٹھا تھا ، جس طرح ابوتوبہ کی حدیث ہے ۔",
                "urduNarrator": "عبداللہ بن عبدالرحمٰن دارمی نے مجھ سے کہا, یحییٰ بن حسان نے کہا : ہمیں معاویہ نے حدیث بیان کی ، کہا : مجھے زید نے خبر دی کہ انہوں نے ابوسلام سے سنا ، انہوں نے کہا : مجھے نعمان بن بشیر رضی اللہ عنہ نے حدیث سنائی ، کہا",
                "hadithArabic": "وحَدَّثَنِيهِ عَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ، حَدَّثَنَا مُعَاوِيَةُ، أَخْبَرَنِي زَيْدٌ، أَنَّهُ سَمِعَ أَبَا سَلَّامٍ، قَالَ: حَدَّثَنِي النُّعْمَانُ بْنُ بَشِيرٍ، قَالَ: كُنْتُ عِنْدَ مِنْبَرِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ أَبِي تَوْبَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12436,
                "hadithNumber": "4873",
                "englishNarrator": "It has been narrated on the authority of Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Leaving (for Jihad) in the way of Allah in the morning or in the evening (will merit a reward) better than the world and all that is in it.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" صبح کو یا شام کو ایک بار اللہ کی راہ میں نکلنا دنیا اور جو کچھ اس میں ہے ، اس سے بہتر ہے ۔ \"",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ بن قعنب نے بیان کیا، کہا ہم سے حماد بن سلمہ نے، ثابت کی سند سے, حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَغَدْوَةٌ فِي سَبِيلِ اللهِ، أَوْ رَوْحَةٌ، خَيْرٌ مِنَ الدُّنْيَا وَمَا فِيهَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12437,
                "hadithNumber": "4874",
                "englishNarrator": "It has been narrated on the authority of Sahl bin Sa'd as-Sa'idi رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: The journey undertaken by a person in the morning (for Jihad) in the way of Allah (will merit a reward) better than the world and all that is in it.",
                "hadithUrdu": "آپ نے فرمایا : \" اللہ کی راہ میں بندہ صبح کے وقت جو ایک سفر کرتا ہے ( جس وقت سفر کرنا آسان بھی ہوتا ہے ) تو وہ دنیا اور جو کچھ دنیا میں ہے اس سے بہتر ہے ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا, عبدالعزیز بن ابی حازم نے اپنے والد سے ، انہوں نے حضرت سہل بن سعد ساعدی رضی اللہ عنہ سے اور انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «وَالْغَدْوَةَ يَغْدُوهَا الْعَبْدُ فِي سَبِيلِ اللهِ، خَيْرٌ مِنَ الدُّنْيَا وَمَا فِيهَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12438,
                "hadithNumber": "4875",
                "englishNarrator": "It has been narrated on the authority of Sahl bin Sa'd as-Sa'idi رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: A journey undertaken in the morning or evening (fond Jihad) in the way of Allah (will merit a reward) better than the world and all that is in it.",
                "hadithUrdu": "آپ نے فرمایا : \" اللہ کی راہ میں صبح کے وقت کا ایک سفر یا شام کے وقت کا ایک سفر ، دنیا اور جو کچھ اس میں ہے ، اس سے بہتر ہے ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور زہیر بن حرب نے بیان کیا، کہا کہ ہم سے وکیع نے بیان کیا, سفیان نے ابوحازم سے ، انہوں نے حضرت سہل بن سعد ساعدی رضی اللہ عنہ سے ، انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالَا: حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «غَدْوَةٌ، أَوْ رَوْحَةٌ فِي سَبِيلِ اللهِ، خَيْرٌ مِنَ الدُّنْيَا وَمَا فِيهَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 12126,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=485",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=483",
                "label": "483",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=484",
                "label": "484",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=485",
                "label": "485",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=486",
                "label": "486",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=487",
                "label": "487",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=488",
                "label": "488",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=489",
                "label": "489",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=487",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=487",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=485",
        "to": 12150,
        "total": 40465
    }
}