{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 385,
        "data": [
            {
                "id": 9889,
                "hadithNumber": "2325",
                "englishNarrator": "Asma' bint Abu Bakr رضی اللہ تعالیٰ عنہا reported:",
                "hadithEnglish": "My mother who was a polytheist came to me when he (the Holy Prophet) entered into treaty with, the Quraish (of Mecca). I inquired from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) saying: Messenger of Allah, there has come to me my mother and she is inclined; should I (in this state of her mind) show her kindness? He said: Yes, treat her kindly.",
                "hadithUrdu": "قریش کے ساتھ معاہدے کے زمانے میں ، جب آپ نے ان سے معاہدہ صلح کیا تھا ، میری والدہ آئیں ، وہ مشرک تھیں تو میں نے رسول اللہ صلی اللہ علیہ وسلم سے پوچھا اور عرض کی : اے اللہ کے رسول صلی اللہ علیہ وسلم !میری والدہ میرے پاس آئی ہیں اور ( مجھ سے صلہ رحمی کی ) اُمید رکھتی ہیں تو کیا میں اپنی ماں سے صلہ رحمی کروں؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" ہاں ، اپنی ماں کے ساتھ صلہ رحمی کرو ۔ \"",
                "urduNarrator": "ہم سے ابو کریب محمد بن العلاء نے بیان کیا، ہم سے ابو اسامہ نے بیان کیا, ہشام کے ایک اور شاگرد ابو اسامہ نے اسی سند کے ساتھ حضرت اسماء بنت ابی بکر رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ قَالَتْ قَدِمَتْ عَلَيَّ أُمِّي وَهِيَ مُشْرِكَةٌ فِي عَهْدِ قُرَيْشٍ إِذْ عَاهَدَهُمْ فَاسْتَفْتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ قَدِمَتْ عَلَيَّ أُمِّي وَهِيَ رَاغِبَةٌ أَفَأَصِلُ أُمِّي قَالَ نَعَمْ صِلِي أُمَّكِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9890,
                "hadithNumber": "2326",
                "englishNarrator": "A'isha رضی اللہ تعالیٰ عنہا said:",
                "hadithEnglish": "A person came to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and said: My mother died suddenly without having made any will. I think she would have definitely given Sadaqa if she had been able to speak. Would she have a reward if I gave Sadaqa on her behalf? He (the Holy Prophet) said: Yes.",
                "hadithUrdu": "ایک آدمی رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور کہا : اے اللہ کے رسول صلی اللہ علیہ وسلم !میری والدہ اچانک وفات پاگئی ہیں اور انھوں نے کوئی وصیت نہیں کی ، میرا ان کے بارے میں گمان ہے کہ اگر بولتیں تو وہ ضرور صدقہ کرتیں ، اگر ( اب ) میں ان کی طرف سے صدقہ کروں تو کیا انھیں اجر ملے گا؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" ہاں \"",
                "urduNarrator": "ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا, محمد بن بشر نے کہا : ہم سے ہشام نے اپنے والد کے حوالے سے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے حدیث بیان کی کہ",
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ حَدَّثَنَا هِشَامٌ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّ رَجُلًا أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ أُمِّيَ افْتُلِتَتْ نَفْسَهَا وَلَمْ تُوصِ وَأَظُنُّهَا لَوْ تَكَلَّمَتْ تَصَدَّقَتْ أَفَلَهَا أَجْرٌ إِنْ تَصَدَّقْتُ عَنْهَا قَالَ نَعَمْ.",
                "headingArabic": "وُصُولِ ثَوَابِ الصَّدَقَةِ عَنِ الْمَيِّتِ، إِلَيْهِ ‏‏",
                "headingUrdu": "میت کی طرف سے صدقہ اس تک پہنچے گا۔",
                "headingEnglish": "Charity given on behalf of the deceased will reach him",
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9891,
                "hadithNumber": "2327",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Hisham with the same chain of transmitters. And in the hadith transmitted by Abu Usama the words are: She did not make any will, as it has been reported by Ibn Bishr, but it was not reported by the rest of the narrators.",
                "hadithUrdu": "مجھ سے زہیر بن حرب نے بیان کیا، ہم سےیحییٰ بن سعید ، ابو اسامہ علی بن مسہر اور شعیب بن اسحاق سب نے ہشام سے باقی ماندہ اسی سند کے ساتھ ( اسی کی طرح ) روایت بیان کی ۔ ابو اسامہ کی حدیث میں ولم توص ( اس نے وصیت نہیں کی ) کے الفاظ ہیں ، جس طرح ابن بشر نے کہا ہے ۔ ( جبکہ ) باقی راویوں نے یہ الفاظ بیان نہیں کئے ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ ح و حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو أُسَامَةَ ح و حَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ أَخْبَرَنَا عَلِيُّ بْنُ مُسْهِرٍ حَدَّثَنَا الْحَكَمُ بْنُ مُوسَى حَدَّثَنَا شُعَيْبُ بْنُ إِسْحَقَ كُلُّهُمْ عَنْ هِشَامٍ بِهَذَا الْإِسْنَادِ وَفِي حَدِيثِ أَبِي أُسَامَةَ وَلَمْ تُوصِ كَمَا قَالَ ابْنُ بِشْرٍ وَلَمْ يَقُلْ ذَلِكَ .",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9892,
                "hadithNumber": "2328",
                "englishNarrator": "Hudhaifa رضی اللہ تعالیٰ عنہ and Abu Shaiba reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Every act of goodness is sadaqa.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم سے روایت ہے ۔ ۔ ۔ \" ہر نیکی صدقہ ہے ۔ \"",
                "urduNarrator": "قتیبہ بن سعید اور ابو بکر بن ابی شیبہ نے اپنی اپنی سند کے ساتھ حضرت حذیفہ رضی اللہ تعالیٰ عنہ سے ر وایت کی ۔ قتیبہ کی حدیث میں ہے تمھارے نبی صلی اللہ علیہ وسلم نے فرمایا اور ابن ابی شیبہ نے کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو عَوَانَةَ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ كِلَاهُمَا عَنْ أَبِي مَالِكٍ الْأَشْجَعِيِّ عَنْ رِبْعِيِّ بْنِ حِرَاشٍ عَنْ حُذَيْفَةَ فِي حَدِيثِ قُتَيْبَةَ قَالَ قَالَ نَبِيُّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ ابْنُ أَبِي شَيْبَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كُلُّ مَعْرُوفٍ صَدَقَةٌ.",
                "headingArabic": "بَيَانِ أَنَّ اسْمَ الصَّدَقَةِ يَقَعُ عَلَى كُلِّ نَوْعٍ مِنَ الْمَعْرُوفِ ‏‏",
                "headingUrdu": "صدقہ (صدقہ) کا لفظ تمام نیک کاموں پر لاگو ہو سکتا ہے۔",
                "headingEnglish": "The word charity (Sadaqah) may apply to all good deeds Ma'ruf",
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9893,
                "hadithNumber": "2329",
                "englishNarrator": "Abu Dharr رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "some of the people from among the Companions of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to him: Messenger of Allah, the rich have taken away (all the) reward. They observe prayer as we do; they keep the fasts as we keep, and they give Sadaqa out of their surplus riches. Upon this he (the Holy Prophet) said: Has Allah not prescribed for you (a course) by following which you can (also) do sadaqa? In every declaration of the glorification of Allah (i. e. saying Subhan Allah) there is a Sadaqa, and every Takbir (i. e. saying Allah-O-Akbar) is a sadaqa, and every praise of His (saying al-Hamdu Lillah) is a Sadaqa and every declaration that He is One (La illha ill-Allah) is a sadaqa, and enjoining of good is a sadaqa, and forbidding of that which is evil is a Sadaqa, and in man's sexual Intercourse (with his wife, ) there is a Sadaqa. They (the Companions) said: Messenger of Allah, is there reward for him who satisfies his sexual passion among us? He said: Tell me, if he were to devote it to something forbidden, would it not be a sin on his part? Similarly, if he were to devote it to something lawful, he should have a reward.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کے کچھ ساتھیوں نے نبی اکرم صلی اللہ علیہ وسلم سے عرض کی : اے اللہ کے رسول صلی اللہ علیہ وسلم !زیادہ مال رکھنے والے اجر وثواب لے گئے وہ ہماری طرح نماز پڑھتے ہیں اور ہماری طرح روزے رکھتے ہیں اور اپنے ضرورت سے زائد مالوں سے صدقہ کرتے ہیں ( جو ہم نہیں کرسکتے ) آپ صلی اللہ علیہ وسلم نے فرمایا : \" کیا اللہ تعالیٰ نے تمھارے لئے ایسی چیز نہیں بنائی جس سے تم صدقہ کرسکو؟بے شک ہر دفعہ سبحان اللہ کہنا صدقہ ہے ، ہر دفعہ اللہ اکبر کہنا صدقہ ہے ۔ ہر دفعہ الحمد للہ کہنا صدقہ ہے ، ہردفعہ لا الٰہ الا اللہ کہنا صدقہ ہے ، نیکی کی تلقین کرنا صدقہ ہے اور بُرائی سے ر وکنا صدقہ ہے اور ( بیوی سے مباشرت کرتے ہوئے ) تمھارے عضو میں صدقہ ہے ۔ \" صحابہ کرام نے پوچھا : اے اللہ کے رسول صلی اللہ علیہ وسلم !ہم میں سے کوئی اپنی خواہش پوری کرتا ہے تو کیا ااس میں بھی اجر ملتا ہے؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" بتاؤ اگر وہ یہ ( خواہش ) حرام جگہ پوری کرتا تو کیا اسے اس گناہ ہوتا؟اسی طرح جب وہ اسے حلال جگہ پوری کرتا ہے تو اس کے لئے اجر ہے ۔ \"",
                "urduNarrator": "ہم سے عبداللہ بن محمد بن اسماء الذہبی نے بیان کیا، کہا ہم سے مہدی بن میمون نے بیان کیا، کہا کہ ہم سے ابی عیینہ کے مؤکل واصل نے بیان کیا، ان سے یحییٰ بن عقیل نے بیان کیا، انہوں نے یحییٰ بن یمار کے واسطہ سے، انہوں نے ابو العلیٰ کے واسطہ سے۔ -اسود الدیلی، حضرت ابو ذر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ الضُّبَعِيُّ حَدَّثَنَا مَهْدِيُّ بْنُ مَيْمُونٍ حَدَّثَنَا وَاصِلٌ مَوْلَى أَبِي عُيَيْنَةَ عَنْ يَحْيَى بْنِ عُقَيْلٍ عَنْ يَحْيَى بْنِ يَعْمَرَ عَنْ أَبِي الْأَسْوَدِ الدِّيلِيِّ عَنْ أَبِي ذَرٍّ أَنَّ نَاسًا مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالُوا لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا رَسُولَ اللَّهِ ذَهَبَ أَهْلُ الدُّثُورِ بِالْأُجُورِ يُصَلُّونَ كَمَا نُصَلِّي وَيَصُومُونَ كَمَا نَصُومُ وَيَتَصَدَّقُونَ بِفُضُولِ أَمْوَالِهِمْ قَالَ أَوَ لَيْسَ قَدْ جَعَلَ اللَّهُ لَكُمْ مَا تَصَّدَّقُونَ إِنَّ بِكُلِّ تَسْبِيحَةٍ صَدَقَةً وَكُلِّ تَكْبِيرَةٍ صَدَقَةً وَكُلِّ تَحْمِيدَةٍ صَدَقَةً وَكُلِّ تَهْلِيلَةٍ صَدَقَةً وَأَمْرٌ بِالْمَعْرُوفِ صَدَقَةٌ وَنَهْيٌ عَنْ مُنْكَرٍ صَدَقَةٌ وَفِي بُضْعِ أَحَدِكُمْ صَدَقَةٌ قَالُوا يَا رَسُولَ اللَّهِ أَيَأتِي أَحَدُنَا شَهْوَتَهُ وَيَكُونُ لَهُ فِيهَا أَجْرٌ قَالَ أَرَأَيْتُمْ لَوْ وَضَعَهَا فِي حَرَامٍ أَكَانَ عَلَيْهِ فِيهَا وِزْرٌ فَكَذَلِكَ إِذَا وَضَعَهَا فِي الْحَلَالِ كَانَ لَهُ أَجْرًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9894,
                "hadithNumber": "2330",
                "englishNarrator": "A'isha رضی اللہ تعالیٰ عنہا reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Every one of the children of Adam has been created with three hundred and sixty joints; so he who declares the Glory of Allah, praises Allah, declares Allah to be One, Glorifies Allah, and seeks forgiveness from Allah, and removes stone, or thorn, or bone from people's path, and enjoins what is good and forbids from evil, to the number of those three hundred and sixty joints, will walk that day having saved himself from the Fire. Abu Taubah said: Perhaps he said: 'Will reach the evening.'",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" بنی آدم میں سے ہر انسان کو تین سو ساٹھ مفاصل ( جوڑوں ) پر پیدا کیاگیا ہے تو جس نے تکبیر کہی ، اللہ کی حمد کہی ، اللہ کی وحدانیت کا اقرار کیا ، اللہ کی تسبیح کہی ، اللہ سے مغفرت مانگی ، لوگوں کے راستے سے کوئی پتھر ہٹایا لوگوں کے راستے سے کانٹا یا ہڈی ( ہٹائی ) ، نیکی کا حکم دیا یا برائی سے روکا ، ان تین سو ساٹھ جوڑوں کی تعداد ے برابر تو وہ اس دن اس طرح چلے گا کہ وہ اپنے آپ کو دوزخ کی آگ سے دور کرچکا ہوگا ۔ \"\" ابو توبہ نے کہا : بسا اوقات انھوں ( معاویہ ) نے ( يمشي \"\" چلے گا \"\" کے بجائے ) يمسي ( شام یا دن کا اختتام کرے گا ) کہا ۔",
                "urduNarrator": "ہم سے حسن بن علی الحلوانی نے بیان کیا, ابوتوبہ ر بیع بن نافع نے بیان کیا ، کہا : ہمیں معاویہ بن سلام نے زید سے حدیث بیان کی کہ انھوں نے ابو سلام کو بیان کرتے ہوئے سنا ، وہ کہہ رہے تھے مجھے عبداللہ بن فروخ نے حدیث بیان کی کہ انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا کو فرماتے ہوئے سنا کہ",
                "hadithArabic": "حَدَّثَنَا حَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ حَدَّثَنَا أَبُو تَوْبَةَ الرَّبِيعُ بْنُ نَافِعٍ حَدَّثَنَا مُعَاوِيَةُ يَعْنِي ابْنَ سَلَّامٍ عَنْ زَيْدٍ أَنَّهُ سَمِعَ أَبَا سَلَّامٍ يَقُولُ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ فَرُّوخَ أَنَّهُ سَمِعَ عَائِشَةَ تَقُولُ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّهُ خُلِقَ كُلُّ إِنْسَانٍ مِنْ بَنِي آدَمَ عَلَى سِتِّينَ وَثَلَاثِ مِائَةِ مَفْصِلٍ فَمَنْ كَبَّرَ اللَّهَ وَحَمِدَ اللَّهَ وَهَلَّلَ اللَّهَ وَسَبَّحَ اللَّهَ وَاسْتَغْفَرَ اللَّهَ وَعَزَلَ حَجَرًا عَنْ طَرِيقِ النَّاسِ أَوْ شَوْكَةً أَوْ عَظْمًا عَنْ طَرِيقِ النَّاسِ وَأَمَرَ بِمَعْرُوفٍ أَوْ نَهَى عَنْ مُنْكَرٍ عَدَدَ تِلْكَ السِّتِّينَ وَالثَّلَاثِ مِائَةِ السُّلَامَى فَإِنَّهُ يَمْشِي يَوْمَئِذٍ وَقَدْ زَحْزَحَ نَفْسَهُ عَنْ النَّارِ قَالَ أَبُو تَوْبَةَ وَرُبَّمَا قَالَ يُمْسِي.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9895,
                "hadithNumber": "2331",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Zaid with the same chain of transmitters except with (a slight) change of words (i.e. he [the Holy Prophet]) said: Or he enjoined what is good, ... and said: He enters the evening [i.e. he walks till evening].",
                "hadithUrdu": "ہم سے عبداللہ بن عبدالرحمٰن دارمی نے بیان کیا , یحییٰ بن حسان نے کہا : ہمیں معاویہ ( بن سلام ) نے حدیث سنائی ، انھوں نے کہا : مجھے زید کے بھائی نے اسی سندکے ساتھ اسی ( سابقہ حدیث ) کی مانند خبر دی مگر انھوں نے کہا : \" اوامربالمعروف ( اور کی بجائے ) یا نیکی کاحکم دیا \" اور کہا : فانه يمسي يومئذ \" وہ اس دن اس حالت میں شام کرے گا ۔ \"",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ أَخْبَرَنَا يَحْيَى بْنُ حَسَّانَ حَدَّثَنِي مُعَاوِيَةُ أَخْبَرَنِي أَخِي زَيْدٌ بِهَذَا الْإِسْنَادِ مِثْلَهُ غَيْرَ أَنَّهُ قَالَ أَوْ أَمَرَ بِمَعْرُوفٍ وَقَالَ فَإِنَّهُ يُمْسِي يَوْمَئِذٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9896,
                "hadithNumber": "2332",
                "englishNarrator": "This hadith has been narrated by 'A'isha through another chain of transmitters in which she reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Every man is created ; the rest of the hadith is the same and he said: He walks on that day.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ہر انسان کو پیدا کیا گیا ہے ۔ ۔ \" آگے زید سے معاویہ کی روایت کے مانند بیان کیا اور کہا : \" فانه يمشي يومئيذ تو وہ اس دن چلے گا ۔",
                "urduNarrator": "مجھ سے ابوبکر بن نافع العبدی نے بیان کیا ,  یحییٰ نے زید بن سلام سے اور انھوں نے اپنے دادا ابو سلام سے روایت کی ، انھوں نے کہا : مجھے عبداللہ بن فروخ نے حدیث بیان کی کہ انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا کو یہ کہتے ہوئے سنا کہ",
                "hadithArabic": "و حَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ الْعَبْدِيُّ حَدَّثَنَا يَحْيَى بْنُ كَثِيرٍ حَدَّثَنَا عَلِيٌّ يَعْنِي ابْنَ الْمُبَارَكِ حَدَّثَنَا يَحْيَى عَنْ زَيْدِ بْنِ سَلَّامٍ عَنْ جَدِّهِ أَبِي سَلَّامٍ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ فَرُّوخَ أَنَّهُ سَمِعَ عَائِشَةَ تَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُلِقَ كُلُّ إِنْسَانٍ بِنَحْوِ حَدِيثِ مُعَاوِيَةَ عَنْ زَيْدٍ وَقَالَ فَإِنَّهُ يَمْشِي يَوْمَئِذٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9897,
                "hadithNumber": "2333",
                "englishNarrator": "Sa'id bin Abu Burda reported on the authority of his grandfather:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Giving of Sadaqa is essential for every Muslim. It was said (to him): What do you say of him who does not find (the means) to do so? He said: Let him work with both his hands, thus doing benefit to himself and give Sadaqa. It was said to him: What about him who does not have (the means) to do so? He said: Then let him assist the needy, the aggrieved. It was said: What do you say of one who cannot even do this? He said: Then he should enjoin what is reputable or what is good. He said: What about him if he cannot do that? He (the Holy Prophet) said: He should then abstain from evil, for verify that is Sadaqa on his behalf.",
                "hadithUrdu": "آ پ صلی اللہ علیہ وسلم نے فرمایا : \" ہر مسلمان پر صدقہ لازم ہے \" کہا گیا : آپ کا کیا خیال ہے اگراسے ( صدقہ کرنے کے لئے کوئی چیز ) نہ ملے؟فرمایا : \" اپنے ہاتھوں سے کام کرکے ا پنے آپ کو فائدہ پہنچائے اور صدقہ ( بھی ) کرے ۔ \" اس نے کہا : عرض کی گئی ، آپ کیا فرماتے ہیں اگر وہ اس کی استطاعت نہ رکھے؟فرمایا : \" بے بس ضرورت مند کی مدد کرے ۔ \" کہا ، آپ سے کہا گیا : دیکھئے!اگر وہ اس کی بھی استطاعت نہ رکھے؟فرمایا : \" نیکی یا بھلائی کاحکم دے ۔ \" کہا : دیکھئے اگر وہ ایسا بھی نہ کرسکے؟فرمایا : \" وہ ( اپنے آپ کو ) شر سے روک لے ، یہ بھی صدقہ ہے ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, ابو اسامہ نے شعبہ سے ، انھوں نے سعید بن ابی بردہ سے ، انھوں نے اپنے والد کے واسطے سے اپنے دادا ( ابو موسیٰ اشعری رضی اللہ تعالیٰ عنہ ) سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ شُعْبَةَ عَنْ سَعِيدِ بْنِ أَبِي بُرْدَةَ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ عَلَى كُلِّ مُسْلِمٍ صَدَقَةٌ قِيلَ أَرَأَيْتَ إِنْ لَمْ يَجِدْ قَالَ يَعْتَمِلُ بِيَدَيْهِ فَيَنْفَعُ نَفْسَهُ وَيَتَصَدَّقُ قَالَ قِيلَ أَرَأَيْتَ إِنْ لَمْ يَسْتَطِعْ قَالَ يُعِينُ ذَا الْحَاجَةِ الْمَلْهُوفَ قَالَ قِيلَ لَهُ أَرَأَيْتَ إِنْ لَمْ يَسْتَطِعْ قَالَ يَأْمُرُ بِالْمَعْرُوفِ أَوْ الْخَيْرِ قَالَ أَرَأَيْتَ إِنْ لَمْ يَفْعَلْ قَالَ يُمْسِكُ عَنْ الشَّرِّ فَإِنَّهَا صَدَقَةٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9898,
                "hadithNumber": "2334",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated by Shu'ba with the same chain of transmitters.",
                "hadithUrdu": "ہم سے محمد بن المثنیٰ نے بیان کیا، ہم سے عبدالرحمن بن مہدی نے کہا : ہمیں شعبہ نے اسی سند کے ساتھ ( یہی ) حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَاه مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا شُعْبَةُ بِهَذَا الْإِسْنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9899,
                "hadithNumber": "2335",
                "englishNarrator": "Hammam bin Munabbih reported that-this is out of (those ahadith) which Abu Huraira رضی اللہ تعالیٰ عنہ narrated to us from Muhammad, the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). And he while making a mention of a hadith reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said this: Sadaqa is due on every joint of a person, every day the sun rises. Administering of justice between two men is also a Sadaqa. And assisting a man to ride upon his beast, or helping him load his luggage upon it, is a Sadaqa; and a good word is a Sadaqa; and every step that you take towards prayer is a Sadaqa, and removing of harmful things from the pathway is a Sadaqa.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا \"\" لوگوں کے ہر جوڑ پر ہر روز ، جس میں سورج طلوع ہوتاہے ، صدقہ ہے ۔ \"\" فرمایا : تم دو ( آدمیوں ) کے درمیان عدل کرو ( یہ ) صدقہ ہے ۔ اور تمھارا کسی آدمی کی ، اس کے جانور کے متعلق مدد کرناکہ اسے اس پر سوار کرادو یا اس کی خاطر سواری پر اس کا سامان اٹھا کر رکھو ، ( یہ بھی ) صدقہ ہے ۔ \"\" فرمایا : \"\" اچھی بات صدقہ ہے اور ہر قدم جس سے تم مسجد کی طرف چلتے ہو ، صدقہ ہے اور تم راستے سے تکلیف دہ چیز کو ہٹا دو ( یہ بھی ) صدقہ ہے ۔ \"\"",
                "urduNarrator": "ہم سے محمد بن رافع نے بیان کیا، ہم سے عبد الرزاق بن ہمام نے بیان کیا، ہم سے معمر نے بیان کیا, ہمام بن منبہ سے روایت کی ، کہا : یہ احادیث ہیں جو حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ نے ہمیں محمد رسول اللہ صلی اللہ علیہ وسلم سے روایت کیں ۔ انھوں نے کچھ احادیث بیا ن کیں ان میں سے یہ بھی ہے اور",
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ بْنُ هَمَّامٍ حَدَّثَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ عَنْ مُحَمَّدٍ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُّ سُلَامَى مِنْ النَّاسِ عَلَيْهِ صَدَقَةٌ كُلَّ يَوْمٍ تَطْلُعُ فِيهِ الشَّمْسُ قَالَ تَعْدِلُ بَيْنَ الِاثْنَيْنِ صَدَقَةٌ وَتُعِينُ الرَّجُلَ فِي دَابَّتِهِ فَتَحْمِلُهُ عَلَيْهَا أَوْ تَرْفَعُ لَهُ عَلَيْهَا مَتَاعَهُ صَدَقَةٌ قَالَ وَالْكَلِمَةُ الطَّيِّبَةُ صَدَقَةٌ وَكُلُّ خُطْوَةٍ تَمْشِيهَا إِلَى الصَّلَاةِ صَدَقَةٌ وَتُمِيطُ الْأَذَى عَنْ الطَّرِيقِ صَدَقَةٌ.",
                "headingArabic": "فِي الْمُنْفِقِ وَالْمُمْسِكِ ‏‏",
                "headingUrdu": "خرچ کرنے والا اور روکنے والا",
                "headingEnglish": "The one who spends and the one who withholds",
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9900,
                "hadithNumber": "2336",
                "englishNarrator": "Abu Huraira reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: There is never a day wherein servants (of God) get up at morn, but are not visited by two angels. One of them says: O Allah, give him more who spends (for the sake of Allah), and the other says: O Allah, bring destruction to one who withholds.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کوئی دن نہیں جس میں بندے صبح کرتے ہیں مگر ( اس میں آسمان سے ) دو فرشتے اترتے ہیں ، ان میں سے ایک کہتاہے : اے اللہ!خرچ کرنے والے کو ( بہترین ) بدل عطا فرما اور دوسرا کہتا ہے : اے اللہ! روکنے والے کا ( مال ) تلف کردے ۔ \"",
                "urduNarrator": "مجھ سے قاسم بن زکریا نے بیان کیا، مجھ سے خالد بن مخلد نے بیان کیا، مجھ سے سلیمان نے جو ابن بلال ہیں، مجھ سے معاویہ بن ابی مزرد نے سعید بن یسار سے بیان کیا, حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت ہے ، انھو ں نے کہا",
                "hadithArabic": "و حَدَّثَنِي الْقَاسِمُ بْنُ زَكَرِيَّا حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنِي سُلَيْمَانُ وَهُوَ ابْنُ بِلَالٍ حَدَّثَنِي مُعَاوِيَةُ بْنُ أَبِي مُزَرِّدٍ عَنْ سَعِيدِ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ يَوْمٍ يُصْبِحُ الْعِبَادُ فِيهِ إِلَّا مَلَكَانِ يَنْزِلَانِ فَيَقُولُ أَحَدُهُمَا اللَّهُمَّ أَعْطِ مُنْفِقًا خَلَفًا وَيَقُولُ الْآخَرُ اللَّهُمَّ أَعْطِ مُمْسِكًا تَلَفًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9901,
                "hadithNumber": "2337",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: There is never a day wherein servants (of God) get up at morn, but are not visited by two angels. One of them says: O Allah, give him more who spends (for the sake of Allah), and the other says: O Allah, bring destruction to one who withholds.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کوئی دن نہیں جس میں بندے صبح کرتے ہیں مگر ( اس میں آسمان سے ) دو فرشتے اترتے ہیں ، ان میں سے ایک کہتاہے : اے اللہ!خرچ کرنے والے کو ( بہترین ) بدل عطا فرما اور دوسرا کہتا ہے : اے اللہ! روکنے والے کا ( مال ) تلف کردے ۔ \"",
                "urduNarrator": "مجھ سے القاسم بن زکریا نے بیان کیا، مجھ سے خالد بن مخلد نے بیان کیا، مجھ سے سلیمان جو ابن بلال ہیں، نے بیان کیا، مجھ سے معاویہ بن ابی مزرد نے سعید بن یسار سے بیان کیا, حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت ہے ، انھو ں نے کہا",
                "hadithArabic": "و حَدَّثَنِي الْقَاسِمُ بْنُ زَكَرِيَّا حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنِي سُلَيْمَانُ وَهُوَ ابْنُ بِلَالٍ حَدَّثَنِي مُعَاوِيَةُ بْنُ أَبِي مُزَرِّدٍ عَنْ سَعِيدِ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ يَوْمٍ يُصْبِحُ الْعِبَادُ فِيهِ إِلَّا مَلَكَانِ يَنْزِلَانِ فَيَقُولُ أَحَدُهُمَا اللَّهُمَّ أَعْطِ مُنْفِقًا خَلَفًا وَيَقُولُ الْآخَرُ اللَّهُمَّ أَعْطِ مُمْسِكًا تَلَفًا.",
                "headingArabic": "التَّرْغِيبِ فِي الصَّدَقَةِ قَبْلَ أَنْ لاَ يُوجَدَ مَنْ يَقْبَلُهَا ‏‏",
                "headingUrdu": "صدقہ دینے کی ترغیب اس سے پہلے کہ قبول کرنے والا کوئی نہ ہو۔",
                "headingEnglish": "Encouragement to give charity before there is no one to accept it",
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9902,
                "hadithNumber": "2338",
                "englishNarrator": "Abu Musa رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: There would come a time for the people when a person would roam about with Sadaqa of gold, but he would find no one to accept it from him. And a man would be seen followed by forty women seeking refuge with him on account of the scarcity of males and abundance of females.\r\n According to the report of Ibn Barad \"you will see a man...\"",
                "hadithUrdu": "آپ نے فر ما یا : \" لو گوں پر یقیناً ایسا وقت آئے گا جس میں آدمی سونے کا صدقہ لے کر گھومے گا پھر اسے کو ئی ایسا آدمی نہیں ملے گا جو اسے اس سے لے لے اور مردوں کی قلت اور عورتوں کی کثرت کی وجہ سے ایسا اکیلا آدمی دیکھا جا ئے گا جس کے پیچھے چا لیس عورتیں ہو ں گی جو اس کی پناہ لے رہی ہو ں گی ۔ ابن براد کی روا یت میں ( ایسا اکیلا آدمی دیکھا جا ئے گا ۔ کی جگہ وتري رجل ( اور تم ایسےآدمی کو دیکھو گے ) ہے ۔",
                "urduNarrator": "عبد اللہ بن براداشعری اور ابو کریب محمد بن علاء دو نوں نے کہا : ہمیں ابو اسامہ نے برید سے حدیث بیا ن کی ، انھوں نے ابو بردہ سے انھوں نے حضرت موسیٰ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی",
                "hadithArabic": "و حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَرَّادٍ الْأَشْعَرِيُّ وَأَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ قَالَا حَدَّثَنَا أَبُو أُسَامَةَ عَنْ بُرَيْدٍ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَى عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيَأْتِيَنَّ عَلَى النَّاسِ زَمَانٌ يَطُوفُ الرَّجُلُ فِيهِ بِالصَّدَقَةِ مِنْ الذَّهَبِ ثُمَّ لَا يَجِدُ أَحَدًا يَأْخُذُهَا مِنْهُ وَيُرَى الرَّجُلُ الْوَاحِدُ يَتْبَعُهُ أَرْبَعُونَ امْرَأَةً يَلُذْنَ بِهِ مِنْ قِلَّةِ الرِّجَالِ وَكَثْرَةِ النِّسَاءِ وَفِي رِوَايَةِ ابْنِ بَرَّادٍ وَتَرَى الرَّجُلَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9903,
                "hadithNumber": "2339",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger (ﷺ) as saying: The Last Hour will not come before wealth becomes abundant and overflowing, so much so that a man takes Zakat out of his property and cannot find anyone to accept it from him and till the land of Arabia becomes meadows and rivers.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا \" قیامت قائم نہیں ہو گی یہاں تک کہ مال بڑھ جا ئے گا اور ( پانی کی طرح ) بہنے لگے گا اور آدمی اپنے مال کی زکاۃ لے کر نکلے گا تو اسے ایک شخص بھی نہیں ملے گا جو اسے اس کی طرف سے قبو ل کر لے اور یہاں تک کہ عربکی سر زمین دو بارہ چرا گا ہوں اور نہروں میں بدل جا ئے گی ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ان سے یعقوب نے جو عبدالرحمٰن قاری کے بیٹے ہیں، انہوں نے بیان کیا کہ سہیل کے والد ( ابو صالح ) نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روا یت کی کہ",
                "hadithArabic": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا يَعْقُوبُ وَهُوَ ابْنُ عَبْدِ الرَّحْمَنِ الْقَارِيُّ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَقُومُ السَّاعَةُ حَتَّى يَكْثُرَ الْمَالُ وَيَفِيضَ حَتَّى يَخْرُجَ الرَّجُلُ بِزَكَاةِ مَالِهِ فَلَا يَجِدُ أَحَدًا يَقْبَلُهَا مِنْهُ وَحَتَّى تَعُودَ أَرْضُ الْعَرَبِ مُرُوجًا وَأَنْهَارًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9904,
                "hadithNumber": "2340",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The Last Hour will not come till wealth is abundant and overflowing, so much so that the owner of the property will think as to who will accept Sadaqa from him, and a person would be called to accept Sadaqa and he would say: I do not need it.",
                "hadithUrdu": "آپ نے فر ما یا : \" قیامت قائم نہیں ہو گی یہا ں تک کہ تمھا رے ہاں مال کی فراوانی ہو گئی وہ مال ( پانی کی طرح ) بہے گا یہاں تک کہ ما ل کے مالک کو یہ فکر لا حق ہو گی کہ اس سے اس ( مال ) کو بطور صدقہ کو ن قبول کرےگا ؟ ایک آدمی کو اسے لینے کے لیے بلا یا جا ئے گا تو وہ کہے گا : مجھے اس کی کو ئی ضرورت نہیں ۔",
                "urduNarrator": "ہم سے ابو الطاہر نے بیان کیا، ہم سے ابن وہب نے بیان کیا، وہ عمرو بن حارث کی سند سے, ابو یونس نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی",
                "hadithArabic": "و حَدَّثَنَا أَبُو الطَّاهِرِ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ أَبِي يُونُسَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَقُومُ السَّاعَةُ حَتَّى يَكْثُرَ فِيكُمْ الْمَالُ فَيَفِيضَ حَتَّى يُهِمَّ رَبَّ الْمَالِ مَنْ يَقْبَلُهُ مِنْهُ صَدَقَةً وَيُدْعَى إِلَيْهِ الرَّجُلُ فَيَقُولُ لَا أَرَبَ لِي فِيهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9905,
                "hadithNumber": "2341",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenaer ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The earth will vomit long pieces of its liver like columns of gold and silver, and the murderer will come and say: It was for this that I committed murder. The breaker of family ties will come and say: It was for this that I broke the family ties; and the thief will come and say: It is for this that my hands were cut off. They will then leave it and will not take anything out of it.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" زمین اپنے جگر کے ٹکڑے سونے اور چا ندی کے ستونوں کی صورت میں اگل دے گی تو قاتل آئے گا اور کہے گا کیا اس کی خا طر میں قتل کیا تھا ؟رشتہ داری تو ڑنے والا آکر کہے گا : کیا اس کے سبب میں نے قطع رحمی کی تھی ؟ چور آکر کہے گا : کیا اس کے سبب میرا ہا تھ کا ٹا گیا تھا ؟پھر وہ اس مال کو چھوڑ دیں گے ۔ اور اس میں سے کچھ نہیں لیں گے ۔",
                "urduNarrator": "ہم سے بن عبد الاعلٰی، ابو کعب اور محمد بن یزید الرفاعی نے اور صلاۃ کے لیے حفظ کرنے والے نے بیان کیا, ابو حازم نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روا یت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا وَاصِلُ بْنُ عَبْدِ الْأَعْلَى وَأَبُو كُرَيْبٍ وَمُحَمَّدُ بْنُ يَزِيدَ الرِّفَاعِيُّ وَاللَّفْظُ لِوَاصِلٍ قَالُوا حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَقِيءُ الْأَرْضُ أَفْلَاذَ كَبِدِهَا أَمْثَالَ الْأُسْطُوَانِ مِنْ الذَّهَبِ وَالْفِضَّةِ فَيَجِيءُ الْقَاتِلُ فَيَقُولُ فِي هَذَا قَتَلْتُ وَيَجِيءُ الْقَاطِعُ فَيَقُولُ فِي هَذَا قَطَعْتُ رَحِمِي وَيَجِيءُ السَّارِقُ فَيَقُولُ فِي هَذَا قُطِعَتْ يَدِي ثُمَّ يَدَعُونَهُ فَلَا يَأْخُذُونَ مِنْهُ شَيْئًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9906,
                "hadithNumber": "2342",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: If anyone gives as Sadaqa the equivalent of a date from that (earning) earned honestly, for Allah accepts that which is lawful, the Lord would accept it with His Right Hand, and even if it is a date, it would foster in the Hand of the lord, as one of you fosters his colt, till it becomes bigger than a mountain.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" کو ئی شخص پا کیزہ مال سے کو ئی صدقہ نہیں کرتا اور اللہ تعا لیٰ پا کیزہ مال ہی قبول فر ما تا ہے مگر وہ رحمٰن اسے اپنے دا ئیں ہا تھ میں لیتا ہے چا ہے وہ کھجور کا ایک دا نہ ہو تو وہ اس رحمٰن کی ہتھیلی میں پھلتا پھولتا ہے حتیٰ کہ پہاڑ سے بھی بڑا ہو جا تا ہے بالکل اسی طرح جس طرح تم میں سے کو ئی اپنے بچھرے یا اونٹ کے بچے کو پا لتا ہے ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ہم سے لیث نے بیان کیا، ان سےسعید بن یسار سے روا یت ہے کہ انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے سنا وہ کہہ رہے تھے",
                "hadithArabic": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ عَنْ سَعِيدِ بْنِ يَسَارٍ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا تَصَدَّقَ أَحَدٌ بِصَدَقَةٍ مِنْ طَيِّبٍ وَلَا يَقْبَلُ اللَّهُ إِلَّا الطَّيِّبَ إِلَّا أَخَذَهَا الرَّحْمَنُ بِيَمِينِهِ وَإِنْ كَانَتْ تَمْرَةً فَتَرْبُو فِي كَفِّ الرَّحْمَنِ حَتَّى تَكُونَ أَعْظَمَ مِنْ الْجَبَلِ كَمَا يُرَبِّي أَحَدُكُمْ فَلُوَّهُ أَوْ فَصِيلَهُ.",
                "headingArabic": "قَبُولِ الصَّدَقَةِ مِنَ الْكَسْبِ الطَّيِّبِ وَتَرْبِيَتِهَا",
                "headingUrdu": "خیرات کی قبولیت جو نیک (طیب) کی کمائی سے حاصل ہوتی ہے اور اس میں اضافہ",
                "headingEnglish": "Acceptance of charity that comes from good (Tayyib) earnings, and the growth there of",
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9907,
                "hadithNumber": "2343",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: No one gives Sadaqa of a date out of his honest earning, but Allah accepts it with His Right Hand, and then fosters it as one of you fosters the colt or a young she-camel, till it becomes like a mountain or even greater.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا \" کو ئی شخص اپنی پا کیزہ کما ئی سے ایک کھجور بھی خرچ نہیں کرتا مگر اللہ اسے اپنے دا ہنے ہا تھ سے قبول کرتا ہے اور اسے اس طرح پالتا ہے جس طرح تم میں سے کو ئی اپنے بچھیرے یا اونٹ کے بچے کو پا لتا ہے حتیٰ کہ وہ ( کھجور ) پہا ڑ کی طرح یا اس سے بھی بڑی ہو جا تی ہے ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, یعقوب بن عبد الرحمٰن القاری نے سہیل سے انھوں نے اپنے والد ( ابو صالح ) سے اور انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روا یت کی ، کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا يَعْقُوبُ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْقَارِيَّ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَتَصَدَّقُ أَحَدٌ بِتَمْرَةٍ مِنْ كَسْبٍ طَيِّبٍ إِلَّا أَخَذَهَا اللَّهُ بِيَمِينِهِ فَيُرَبِّيهَا كَمَا يُرَبِّي أَحَدُكُمْ فَلُوَّهُ أَوْ قَلُوصَهُ حَتَّى تَكُونَ مِثْلَ الْجَبَلِ أَوْ أَعْظَمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9908,
                "hadithNumber": "2344",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated through another chain of transmitters with a change of words. In the hadith transmitted Rauh (the words are): Out of the honest earning and its spending at what is its (due) right ; and in the hadith transmitted by Sulaiman (the words are): And its spending at its proper place.",
                "hadithUrdu": "مجھ سے امیہ بن بسطام نے بیان کیا، کہا ہم سے یزید نے بیان کیا، یعنی ہم سے ابن زرعی نے بیان کیا, روح بن قاسم اور سلیما ن بن بلال دو نوں نے سہیل سے اسی سند کے ساتھ ( مذکور ہ با لا ) حدیث بیان کی ، روح کی حدیث میں ہے ۔ من الكسب الطيب فيضعها في حقها ( حلال کمائی سے صدقہ کرتا ہے پھر اس کو وہاں لگا تا ہے جہاں اس کا حق ہے ) اور سلیمان کی حدیث میں ہے فيضعها في موضعها ( اور اسے اس کی جگہ پر خرچ کرتا ہے )",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنِي أُمَيَّةُ بْنُ بِسْطَامَ حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ حَدَّثَنَا رَوْحُ بْنُ الْقَاسِمِ ح و حَدَّثَنِيهِ أَحْمَدُ بْنُ عُثْمَانَ الْأَوْدِيُّ حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنِي سُلَيْمَانُ يَعْنِي ابْنَ بِلَالٍ كِلَاهُمَا عَنْ سُهَيْلٍ بِهَذَا الْإِسْنَادِ فِي حَدِيثِ رَوْحٍ مِنْ الْكَسْبِ الطَّيِّبِ فَيَضَعُهَا فِي حَقِّهَا وَفِي حَدِيثِ سُلَيْمَانَ فَيَضَعُهَا فِي مَوْضِعِهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9909,
                "hadithNumber": "2345",
                "englishNarrator": null,
                "hadithEnglish": "Narrated Abu Huraira رضی اللہ تعالیٰ عنہ : This hadith has been transmitted through another chain the same as the narration of Ya'qub from Suhail (# 2212).",
                "hadithUrdu": "اور مجھ سے ابو الطاہر نے بیان کیا، مجھ سے عبداللہ بن وہب نے بیان کیا، انہوں نے کہا ہشا م بن سعد نے زید بن اسلم سے انھوں نے ابو صالح سے انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے اسی طرح روا یت کی جس طرح سہیل سے یعقوب کی حدیث ہے ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنِيهِ أَبُو الطَّاهِرِ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي هِشَامُ بْنُ سَعْدٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَ حَدِيثِ يَعْقُوبَ عَنْ سُهَيْلٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9910,
                "hadithNumber": "2346",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: O people, Allah is Good and He therefore, accepts only that which is good. And Allah commanded the believers as He commanded the Messengers by saying: O Messengers, eat of the good things, and do good deeds; verily I am aware of what you do (xxiii. 51). And He said: O those who believe, eat of the good things that We gave you (ii. 172). He then made a mention of a person who travels widely, his hair disheveled and covered with dust. He lifts his hand towards the sky (and thus makes the supplication): O Lord, O Lord, whereas his diet is unlawful, his drink is unlawful, and his clothes are unlawful and his nourishment is unlawful. How can then his supplication be accepted?",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" اے لو گو !اللہ تعا لیٰ پا ک ہے اور پا ک ( مال ) کے سوا ( کو ئی ما ل ) قبو ل نہیں کرتا اللہ نے مو منوں کو بھی اسی بات کا حکم دیا جس کا رسولوں کو حکم دیا اللہ تعا لیٰ نے فر ما یا : \" اے پیغمبران کرام! پا ک چیز یں کھا ؤ اور نیک کا م کرو جو عمل تم کرتے ہو میں اسے اچھی طرح جا ننے والا ہوں اور فر ما یا اے مومنو!جو پا ک رزق ہم نے تمھیں عنا یت فر ما یا ہے اس میں سے کھا ؤ ۔ پھر آپ نے ایک آدمی کا ذکر کیا : \" جو طویل سفر کرتا ہے بال پرا گندا اور جسم غبار آلود ہے ۔ ( دعا کے لیے آسمان کی طرف اپنے دو نوں ہا تھ پھیلا تا ہے اے میرے رب اے میرے رب! جبکہ اس کا کھا نا حرام کا ہے اس کا پینا خرا م کا ہے اس کا لبا س حرا م کا ہے اور اس کو غذا حرا م کی ملی ہے تو اس کی دعا کہا ں سے قبو ل ہو گی ۔",
                "urduNarrator": "مجھ سے ابو کریب محمد بن علاء نے بیان کیا، ہم سے ابو اسامہ نے بیان کیا، ہم سے فضیل بن مرزوق نے بیان کیا، مجھ سے عدی بن ثابت نے بیان کیا، وہ ابوحازم کی سند سے, حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روا یت ہے انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنِي أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنَا فُضَيْلُ بْنُ مَرْزُوقٍ حَدَّثَنِي عَدِيُّ بْنُ ثَابِتٍ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّهَا النَّاسُ إِنَّ اللَّهَ طَيِّبٌ لَا يَقْبَلُ إِلَّا طَيِّبًا وَإِنَّ اللَّهَ أَمَرَ الْمُؤْمِنِينَ بِمَا أَمَرَ بِهِ الْمُرْسَلِينَ فَقَالَ يَا أَيُّهَا الرُّسُلُ كُلُوا مِنْ الطَّيِّبَاتِ وَاعْمَلُوا صَالِحًا إِنِّي بِمَا تَعْمَلُونَ عَلِيمٌ وَقَالَ يَا أَيُّهَا الَّذِينَ آمَنُوا كُلُوا مِنْ طَيِّبَاتِ مَا رَزَقْنَاكُمْ ثُمَّ ذَكَرَ الرَّجُلَ يُطِيلُ السَّفَرَ أَشْعَثَ أَغْبَرَ يَمُدُّ يَدَيْهِ إِلَى السَّمَاءِ يَا رَبِّ يَا رَبِّ وَمَطْعَمُهُ حَرَامٌ وَمَشْرَبُهُ حَرَامٌ وَمَلْبَسُهُ حَرَامٌ وَغُذِيَ بِالْحَرَامِ فَأَنَّى يُسْتَجَابُ لِذَلِكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9911,
                "hadithNumber": "2347",
                "englishNarrator": "Adi bin Hatim رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "He heard Allah's Messenger (ﷺ) as saying: He who among you can protect himself against Fire, he should do so, even if it should be with half a date.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کو فر ما تے ہو ئے سنا : \" تم میں سے جو شخص آگ سے محفوظ رہنے کی استطا عت رکھے چا ہے کھجور کے ایک ٹکڑے کے ذریعے سے کیوں نہ ہو وہ ضرور ( ایسا ) کرے ۔",
                "urduNarrator": "ہم سے عون بن سلام الکوفی نے بیان کیا، کہا ہم سے زہیر بن معاویہ الجعفی نے بیان کیا، ابو اسحاق کی سند سے, عبد اللہ بن معقل نے حضرت عدیبن حاتم رضی اللہ تعالیٰ عنہ سے روا یت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا عَوْنُ بْنُ سَلَّامٍ الْكُوفِيُّ حَدَّثَنَا زُهَيْرُ بْنُ مُعَاوِيَةَ الْجُعْفِيُّ عَنْ أَبِي إِسْحَقَ عَنْ عَبْدِ اللَّهِ بْنِ مَعْقِلٍ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ اسْتَطَاعَ مِنْكُمْ أَنْ يَسْتَتِرَ مِنْ النَّارِ وَلَوْ بِشِقِّ تَمْرَةٍ فَلْيَفْعَلْ.",
                "headingArabic": "الْحَثِّ عَلَى الصَّدَقَةِ وَلَوْ بِشِقِّ تَمْرَةٍ أَوْ كَلِمَةٍ طَيِّبَةٍ وَأَنَّهَا حِجَابٌ مِنْ النَّارِ",
                "headingUrdu": "صدقہ دینے کی ترغیب خواہ نصف کھجور یا مہربان لفظ کے ساتھ ہو۔ اور صدقہ آگ کے خلاف ڈھال ہے۔",
                "headingEnglish": "Encouragement to give charity even if it is with half a date or a kind word. And charity is a shield against the fire.",
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9912,
                "hadithNumber": "2348",
                "englishNarrator": "Adi bin Hatim رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Allah will speak with everyone amongst you without any interpreter between them. He (the man) would see towards his right and would not find anything but (the deeds) which he had done before, and he would see towards the left and would not find anything but (the deeds) which he had done before. He would see in front of him and would find nothing but Fire just before his face. So protect (yourselves) against Fire even if it is with the help of half a date. A hadith like this has been transmitted by Khaithama and addition has been made in this of (these words); Even if it is with a good word.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : تم میں سے کو ئی نہیں مگر عنقریب اللہ اس طرح اس سے بات کرے گا کہ اس کے اور اللہ تعا لیٰ کے درمیان کوئی تر جمان نہیں ہو گا ۔ اور اپنی دا ئیں جا نب دیکھے گا تو اسے وہی کچھ نظر آئے گا جو اس نے آگے بھیجا اور اپنی بائیں جا نب دیکھے گا تو وہی کچھ دکھا ئی دے گا جو اس نے آگے بھیجا اور اپنے آگے دیکھے گا تو اسے اپنے منہ کے سامنے آگ دکھا ئی دے گی اس لیے آگ سے بچو اگر چہ آدھی کھجور کے ذریعے ہی سے کیوں نہ ہو ۔ \"\" ( علی ) بن حجر نے اضافہ کیا : اعمش نے کہا : مجھے عمرو بن مرہ نے خیثمہ سے اسی جیسی حدیث بیان کی اور اس میں اضافہ کیا : چا ہے پا کیزہ بو ل کے ساتھ ( بچو ۔ ) اسحاق نے کہا : اعمش نے کہا : عمرو بن مرہ سے روایت ہے ( کہا ) خیثمہ سے روا یت ہے ۔",
                "urduNarrator": "علی بن حجر سعدی اسحاق بن ابرا ہیم اور علی بن خشرم میں سے علی بن حجر نے کہا : ہمیں عیسیٰ بن یو نس نے حدیث بیا ن کی اور باقی دو نوں نے کہا : ہمیں خبر دی انھوں نے کہا : ہمیں اعمش نے خثیمہ کے واسطے سے حضرت عدی بن حاتم رضی اللہ تعالیٰ عنہ سے حدیث بیان کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ وَعَلِيُّ بْنُ خَشْرَمٍ قَالَ ابْنُ حُجْرٍ حَدَّثَنَا و قَالَ الْآخَرَانِ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ حَدَّثَنَا الْأَعْمَشُ عَنْ خَيْثَمَةَ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْكُمْ مِنْ أَحَدٍ إِلَّا سَيُكَلِّمُهُ اللَّهُ لَيْسَ بَيْنَهُ وَبَيْنَهُ تُرْجُمَانٌ فَيَنْظُرُ أَيْمَنَ مِنْهُ فَلَا يَرَى إِلَّا مَا قَدَّمَ وَيَنْظُرُ أَشْأَمَ مِنْهُ فَلَا يَرَى إِلَّا مَا قَدَّمَ وَيَنْظُرُ بَيْنَ يَدَيْهِ فَلَا يَرَى إِلَّا النَّارَ تِلْقَاءَ وَجْهِهِ فَاتَّقُوا النَّارَ وَلَوْ بِشِقِّ تَمْرَةٍ زَادَ ابْنُ حُجْرٍ قَالَ الْأَعْمَشُ وَحَدَّثَنِي عَمْرُو بْنُ مُرَّةَ عَنْ خَيْثَمَةَ مِثْلَهُ وَزَادَ فِيهِ وَلَوْ بِكَلِمَةٍ طَيِّبَةٍ و قَالَ إِسْحَقُ قَالَ الْأَعْمَشُ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ خَيْثَمَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9913,
                "hadithNumber": "2349",
                "englishNarrator": "Adi bin Hatim رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) made a mention of Fire. He turned his face aside and diverted his attention and then said: Guard (yourselves) against Fire. He turned his face and diverted his attention till we thought as if he were (actually seeing it and then said: Protect yourselves against Fire even if it is with half a date, and he who does not find it, (he should do so) with pleasant words. Abu Kuraib did not mention the word: (as if).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے گ کا تذکرہ فر ما یا تو چہرہ مبا رک ایک طرف موڑ ا اور اس میں مبا لغہ کیا پھر فر ما یا : \"\" آگ سے بچو ۔ پھر رخ مبا رک پھیرا اور دور ہو نے کا اشارہ کیا حتیٰ کہ ہمیں غمان ہوا جیسے آپ اس ( آگ ) کی طرف دیکھ رہے ہیں پھر فر ما یا : \"\" آگ سے بچو چا ہے آدھی کھجور کے ساتھ جسے ( یہ بھی ) نہ ملے تو اچھی بات کے ساتھ ۔ ابو کریب نےكانما ( جیسے ) کا ( لفظ ) ذکر نہیں کیا اور کہا : ہمیں ابو معاویہ نے حدیث بیان کی انھوں نے کہا : ہمیں اعمش نے حدیث بیان کی ۔",
                "urduNarrator": "ابو بکر بن ابی شیبہ اور ابو کریب دو نوں نے کہا : ہمیں ابو معاویہ نے اعمش سے حدیث بیان کی انھوں نے عمرو بن مرہ سے انھوں نے خیثمہ سے انھوں نے حضرت عدی بن حا تم رضی اللہ تعالیٰ عنہ سے روا یت کی انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ خَيْثَمَةَ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَ ذَكَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ النَّارَ فَأَعْرَضَ وَأَشَاحَ ثُمَّ قَالَ اتَّقُوا النَّارَ ثُمَّ أَعْرَضَ وَأَشَاحَ حَتَّى ظَنَنَّا أَنَّهُ كَأَنَّمَا يَنْظُرُ إِلَيْهَا ثُمَّ قَالَ اتَّقُوا النَّارَ وَلَوْ بِشِقِّ تَمْرَةٍ فَمَنْ لَمْ يَجِدْ فَبِكَلِمَةٍ طَيِّبَةٍ وَلَمْ يَذْكُرْ أَبُو كُرَيْبٍ كَأَنَّمَا وَقَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 9601,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=384",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=382",
                "label": "382",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=383",
                "label": "383",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=384",
                "label": "384",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=385",
                "label": "385",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=386",
                "label": "386",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=387",
                "label": "387",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=388",
                "label": "388",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=386",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=386",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=384",
        "to": 9625,
        "total": 40465
    }
}