{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 434,
        "data": [
            {
                "id": 11114,
                "hadithNumber": "3550",
                "englishNarrator": "Abu Sa'id al-Khudri (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Mention was made of 'azl in the presence of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم) whereupon he said: Why do you practise it? They said: There is a man whose wife has to suckle the child, and if that person has a sexual intercourse with her (she may conceive) which he does not like, and there is another person who has a slave-girl and he has a sexual intercourse with her, but he does not like her to have conception so that she may not become Umm Walad, whereupon he (the Holy Prophet) said: There is no harm if you do not do that, for that (the birth of the child) is something pre- ordained. Ibn 'Aun said: I made a mention of this hadith to Hasan, and he said: By Allah, (it seems) as if there is upbraiding in it (for 'azl).",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم کے پاس عزل کا تذکرہ کیا گیا: تو آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" ( اس سے ) تمہارا مقصود کیا ہے؟ \"\" صحابہ کرام رضی اللہ عنہم نے جواب دیا : کسی آدمی کی بیوی ہے ( بچے کو ) دودھ پلا رہی ہوتی ہے ، وہ اس سے مباشرت کرتا ہے اور ناپسند کرتا ہے کہ وہ اس سے حاملہ ہو ۔ اور کسی شخص کی لونڈی ہے وہ اس سے مباشرت کرتا ہے اور ناپسند کرتا ہے کہ وہ اس سے حاملہ ہو ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" کوئی حرج نہیں کہ تم ایسا نہ کرو ، یہ ( بچے کا پیدا ہونا یا نہ ہونا ) تو تقدیر کا معاملہ ہے ۔ \"\" ابن عون نے کہا : میں نے یہ حدیث حسن ( بصری ) کو سنائی تو انہوں نے کہا : اللہ کی قسم! یہ تو گویا ڈانٹ ہے.",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا، انہوں نے کہا معاذ بن معاذ نے ہمیں حدیث بیان کی ، کہا : ہمیں ابن عون نے محمد ( بن سیرین ) سے حدیث بیان کی ، انہوں نے عبدالرحمٰن بن بشر انصاری سے روایت کی ، اور اس حدیث کو پیچھے لے گئے اور اسے حضرت ابوسعید خدری رضی اللہ عنہ کی طرف منسوب کیا ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ، حَدَّثَنَا ابْنُ عَوْنٍ، عَنْ مُحَمَّدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ بِشْرٍ الْأَنْصَارِيِّ، قَالَ: فَرَدَّ الْحَدِيثَ حَتَّى رَدَّهُ إِلَى أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: ذُكِرَ الْعَزْلُ عِنْدَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «وَمَا ذَاكُمْ؟» قَالُوا: الرَّجُلُ تَكُونُ لَهُ الْمَرْأَةُ تُرْضِعُ، فَيُصِيبُ مِنْهَا، وَيَكْرَهُ أَنْ تَحْمِلَ مِنْهُ، وَالرَّجُلُ تَكُونُ لَهُ الْأَمَةُ فَيُصِيبُ مِنْهَا، وَيَكْرَهُ أَنْ تَحْمِلَ مِنْهُ، قَالَ: «فَلَا عَلَيْكُمْ أَنْ لَا تَفْعَلُوا ذَاكُمْ، فَإِنَّمَا هُوَ الْقَدَرُ»، قَالَ ابْنُ عَوْنٍ: فَحَدَّثْتُ بِهِ الْحَسَنَ، فَقَالَ: وَاللهِ لَكَأَنَّ هَذَا زَجْرٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11115,
                "hadithNumber": "3551",
                "englishNarrator": "Ibn 'Aun reported:",
                "hadithEnglish": "I reported to Muhammad on the authority of Ibrahim the hadith reported by 'Abdul-Rahmann bin Bishr (the hadith concerning 'azl), whereupon he said: That (hadith) Abd ul-Rahman bin Bishr had narrated to me (also).",
                "hadithUrdu": "مجھ سے حجاج بن الشاعر نے بیان کیا، کہا ہم سے سلیمان بن حرب نے بیان کیا, حماد بن زید نے ابن عون سے حدیث بیان کی ، کہا : میں نے حماد ( بن سیرین ) کو ابراہیم کے واسطے سے عبدالرحمٰن بن بشر کی حدیث ، یعنی عزل کی حدیث سنائی تو انہوں نے کہا : عبدالرحمٰن بن بشر نے خود مجھے بھی یہ حدیث بیان کی.",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنِ ابْنِ عَوْنٍ، قَالَ: حَدَّثْتُ مُحَمَّدًا، عَنْ إِبْرَاهِيمَ، بِحَدِيثِ عَبْدِ الرَّحْمَنِ بْنِ بِشْرٍ - يَعْنِي حَدِيثَ الْعَزْلِ - فَقَالَ: إِيَّايَ حَدَّثَهُ عَبْدُ الرَّحْمَنِ بْنُ بِشْرٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11116,
                "hadithNumber": "3552",
                "englishNarrator": "Ma'bad bin Sirin said to Abu Sa'id ( رضی اللہ عنہ):",
                "hadithEnglish": "Did you hear Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) making a mention of something in regard to al-'azl? Thereupon he said: Yes. The rest (of the hadith is the same)",
                "hadithUrdu": "کیا آپ نے رسول اللہ صلی اللہ علیہ وسلم کو عزل کے بارے میں کچھ فرماتے ہوئے سنا؟ انہوں نے کہا : ہاں ۔ آگے انہوں نے القدر ( یہ تو تقدیر ہے ) تک ابن عون کی حدیث کے ہم معنی حدیث بیان کی.",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا، کہا ہم سے عبد العلا نے بیان کیا،ہشام نے ہمیں محمد ( بن سیرین ) سے حدیث بیان کی ، انہوں نے معبد بن سیرین سے روایت کی ، کہا  ہم نے حضرت ابوسعید رضی اللہ عنہ سے عرض کی",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْأَعْلَى، حَدَّثَنَا هِشَامٌ، عَنْ مُحَمَّدٍ، عَنْ مَعْبَدِ بْنِ سِيرِينَ، قَالَ: قُلْنَا لِأَبِي سَعِيدٍ: هَلْ سَمِعْتَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَذْكُرُ فِي الْعَزْلِ شَيْئًا؟ قَالَ: نَعَمْ وَسَاقَ الْحَدِيثَ بِمَعْنَى حَدِيثِ ابْنِ عَوْنٍ إِلَى قَوْلِهِ الْقَدَرُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11117,
                "hadithNumber": "3553",
                "englishNarrator": "Abu Sa'id al-Khudri ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "Mention was made about al-'azl in the presence of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), whereupon he said: Why any one of you practises it? (He did not say: One of you should not do it), for there is no created soul, whose creator is not Allah.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے سامنے عزل کا ذکر کیا گیا تو آپ نے فرمایا : \" تم میں سے کوئی شخص ایسا کیوں کرتا ہے؟ ۔ ۔ آپ نے یہ نہیں فرمایا : تم میں سے کوئی ایسا نہ کرے ۔ حقیقت یہ ہے پیدا ہونے والی کوئی جان نہیں مگر اللہ اسے پیدا کرنے والا ہے ۔ ( وہ اسے ضرور پیدا کرے گا.",
                "urduNarrator": "ہم سے عبید اللہ بن عمر القواری اور احمد بن عبدہ نے بیان کیا، انہوں نے کہا کہ ہم کو انہوں نے خبر دی، اور عبید اللہ نے کہا: ہم سے سفیان بن عیینہ نے بیان کیا۔ ابن ابی نجیح کی روایت سے، مجاہد کی سند سے،قزعہ نے حضرت ابوسعید خدری رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، وَأَحْمَدُ بْنُ عَبْدَةَ، قَالَ ابْنُ عَبْدَةَ: أَخْبَرَنَا، وقَالَ عُبَيْدُ اللهِ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ ابْنِ أَبِي نَجِيح، عَنْ مُجَاهِدٍ، عَنْ قَزْعَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: ذُكِرَ الْعَزْلُ عِنْدَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: وَلِمَ يَفْعَلُ ذَلِكَ أَحَدُكُمْ؟ - وَلَمْ يَقُلْ: فَلَا يَفْعَلْ ذَلِكَ أَحَدُكُمْ - فَإِنَّهُ لَيْسَتْ نَفْسٌ مَخْلُوقَةٌ إِلَّا اللهُ خَالِقُهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11118,
                "hadithNumber": "3554",
                "englishNarrator": "Abu Sa'id al-Khudri (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was asked about 'azl, whereupon he said: The child does not come from all the liquid (sermen) and when Allah intends to create anything nothing can prevent it (from coming into existence).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم سے عزل کے بارے میں سوال کیا گیا ، آپ نے فرمایا : \"\" ہر پانی ( منی کے قطرے ) سے بچہ پیدا نہیں ہوتا ، اور جب اللہ تعالیٰ کسی چیز کو پیدا کرنے کا ارادہ فرما لیتا ہے تو اسے کوئی چیز روک نہیں سکتی ۔ \"\" ( زید بن حباب نے معاویہ سے ، باقی ماندہ اسی سند کے ساتھ نبی صلی اللہ علیہ وسلم سے اسی کے مانند حدیث بیان کی.",
                "urduNarrator": "مجھ سے ہارون بن سعید الایلی نے بیان کیا، انہوں نے ہم سے بیان کیا عبداللہ بن وہب نے ہمیں حدیث بیان کی ، کہا : مجھے معاویہ بن صالح نے علی بن ابو طلحہ سے خبر دی ، انہوں نے ابو وداک سے ، انہوں نے حضرت ابوسعید خدری رضی اللہ عنہ سے روایت کی ، انہوں ( ابووداک ) نے ان سے سنا ، وہ کہہ رہے تھے",
                "hadithArabic": "حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ، حَدَّثَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، أَخْبَرَنِي مُعَاوِيَةُ يَعْنِي ابْنَ صَالِحٍ، عَنْ عَلِيِّ بْنِ أَبِي طَلْحَةَ، عَنْ أَبِي الْوَدَّاكِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، سَمِعَهُ يَقُولُ: سُئِلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، عَنِ الْعَزْلِ، فَقَالَ: «مَا مِنْ كُلِّ الْمَاءِ يَكُونُ الْوَلَدُ، وَإِذَا أَرَادَ اللهُ خَلْقَ شَيْءٍ، لَمْ يَمْنَعْهُ شَيْءٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11119,
                "hadithNumber": "3555",
                "englishNarrator": null,
                "hadithEnglish": "A similar report (as no. 3554) was narrated from Abu Saeed Al-Khudri رضی اللہ عنہ , from the prophet ﷺ.",
                "hadithUrdu": "مجھ سے احمد بن المنذر البصری نے بیان کیا، ہم سے زید بن حباب نے بیان کیا، ہم سے معاویہ نے بیان کیا، مجھ سے علی بن ابی طلحہ الہاشمی نے بیان کیا، میرے والد سے۔ الوادق، ابو سعید الخدری رضی اللہ عنہ س کی سند سے، رسول اللہ صلی اللہ علیہ وسلم کی سند سے، اسی طرح کی مثال کے ساتھ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنِي أَحْمَدُ بْنُ الْمُنْذِرِ الْبَصْرِيُّ، حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ، حَدَّثَنَا مُعَاوِيَةُ، أَخْبَرَنِي عَلِيُّ بْنُ أَبِي طَلْحَةَ الْهَاشِمِيُّ، عَنْ أَبِي الْوَدَّاكِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11120,
                "hadithNumber": "3556",
                "englishNarrator": "Jabir (رضی اللہ عنہ) reported:",
                "hadithEnglish": "A man came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: I have a slave-girl who is our servant and she carries water for us and I have intercourse with her, but I do not want her to conceive. He said: Practise 'azl, if you so like, but what is decreed for her will come to her. The person stayed back (for some time) and then came and said: The girl has become pregnant, whereupon he said: I told you what was decreed for her would come to her.",
                "hadithUrdu": "ایک آدمی نے نبی صلی اللہ علیہ وسلم سے دریافت کیا ، اور کہا : میرے پاس میری ایک لونڈی ہے ، میں اس سے عزل کرتا ہوں ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" بے شک یہ ( عزل ) ایسی کسی چیز کو نہیں روک سکتا جس کا اللہ نے ارادہ کیا ہو ۔ \" کہا : وہ شخص ( دوبارہ ) حاضرِ خدمت ہوا اور کہنے لگا : اللہ کے رسول! وہ لونڈی جس کا میں نے آپ سے ذکر کیا تھا ، حاملہ ہو گئی ہے ۔ تو اس نے کہا:\" میں نے تم سے کہا تھا کہ جو اس کا مقدر تھا وہ اس کے پاس آئے گا۔",
                "urduNarrator": "ہم سے احمد بن عبداللہ بن یونس نے بیان کیا، کہا ہم سے زہیر نے بیان کیا، کہا ہم سے ابو الزبیر نے بیان کیا، انہوں نے جابر رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللهِ بْنِ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، أَخْبَرَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ رَجُلًا أَتَى رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: إِنَّ لِي جَارِيَةً، هِيَ خَادِمُنَا وَسَانِيَتُنَا، وَأَنَا أَطُوفُ عَلَيْهَا، وَأَنَا أَكْرَهُ أَنْ تَحْمِلَ، فَقَالَ: «اعْزِلْ عَنْهَا إِنْ شِئْتَ، فَإِنَّهُ سَيَأْتِيهَا مَا قُدِّرَ لَهَا»، فَلَبِثَ الرَّجُلُ، ثُمَّ أَتَاهُ، فَقَالَ: إِنَّ الْجَارِيَةَ قَدْ حَبِلَتْ، فَقَالَ: «قَدْ أَخْبَرْتُكَ أَنَّهُ سَيَأْتِيهَا مَا قُدِّرَ لَهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11121,
                "hadithNumber": "3557",
                "englishNarrator": "Jabir bin 'Abdullah (رضی اللہ عنہ) reported:",
                "hadithEnglish": "A person asked Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saying: I have a slave-girl and I practise 'azl with her, whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: This cannot prevent that which Allah has decreed. The person then came (after some time) and said: Messenger of Allah, the slave-girl about whom I talked to you has conceived, whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: I am the servant of Allah and His Messenger.",
                "hadithUrdu": "ایک آدمی نے نبی صلی اللہ علیہ وسلم سے دریافت کیا ، اور کہا : میرے پاس میری ایک لونڈی ہے ، میں اس سے عزل کرتا ہوں ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" بے شک یہ ( عزل ) ایسی کسی چیز کو نہیں روک سکتا جس کا اللہ نے ارادہ کیا ہو ۔ \" کہا : وہ شخص ( دوبارہ ) حاضرِ خدمت ہوا اور کہنے لگا : اللہ کے رسول! وہ لونڈی جس کا میں نے آپ سے ذکر کیا تھا ، حاملہ ہو گئی ہے ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" میں اللہ کا بندہ اور رسول ہوں ۔ ( میں جو کہتا ہوں اللہ کی طرف سے کہتا ہوں).",
                "urduNarrator": "ہم سے سعید بن عمرو اشعثی نے بیان کیا, سفیان بن عیینہ نے ہمیں سعید بن حسان سے حدیث بیان کی ، انہوں نے عروہ بن عیاض سے اور انہوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ عَمْرٍو الْأَشْعَثِيُّ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ سَعِيدِ بْنِ حَسَّانَ، عَنْ عُرْوَةَ بْنِ عِيَاضٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، قَالَ: سَأَلَ رَجُلٌ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: إِنَّ عِنْدِي جَارِيَةً لِي، وَأَنَا أَعْزِلُ عَنْهَا، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ ذَلِكَ لَنْ يَمْنَعَ شَيْئًا أَرَادَهُ اللهُ» قَالَ: فَجَاءَ الرَّجُلُ، فَقَالَ: يَا رَسُولَ اللهِ، إِنَّ الْجَارِيَةَ الَّتِي كُنْتُ ذَكَرْتُهَا لَكَ حَمَلَتْ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَنَا عَبْدُ اللهِ وَرَسُولُهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11122,
                "hadithNumber": "3558",
                "englishNarrator": "Jabir bin 'Abdullah (رضی اللہ عنہ) reported:",
                "hadithEnglish": "A person came to Allah's Apostle ﷺ ...\" a hadith like that of Sufyan (no. 3557).",
                "hadithUrdu": "ایک آدمی نبی صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا ۔ ( آگے ) سفیان کی حدیث کے ہم معنی ( ہے.",
                "urduNarrator": "ہم سے حجاج بن الشعر نے بیان کیا, ابو احمد زبیری نے ہمیں حدیث بیان کی ، کہا : ہمیں مکہ کے قصہ گو سعید بن حسان نے حدیث بیان کی ، کہا : مجھے عروہ بن عیاض بن عدی بن خیار نوفلی نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے خبر دی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ، حَدَّثَنَا سَعِيدُ بْنُ حَسَّانَ، قَاصُّ أَهْلِ مَكَّةَ، أَخْبَرَنِي عُرْوَةُ بْنُ عِيَاضِ بْنِ عَدِيِّ بْنِ الْخِيَارِ النَّوْفَلِيُّ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، قَالَ: جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَى حَدِيثِ سُفْيَانَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11123,
                "hadithNumber": "3559",
                "englishNarrator": "Jabir ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "We used to practice 'azl while the Qur'an was revealed.\" Ishaq added: Sufyan said: If anything were to have forbidden it by the Quran.",
                "hadithUrdu": "ہم عزل کرتے تھے جبکہ قرآن نازل ہو رہا ہوتا تھا ۔ اسحاق نے اضافہ کیا : سفیان نے کہا : اگر یہ ایسی چیز ہوتی جس سے منع کیا جانا ( ضروری ) ہوتا تو قرآن ہمیں ( ضرور ) اس سے منع کرتا.",
                "urduNarrator": "ہمیں ابوبکر بن ابی شیبہ اور اسحاق بن ابراہیم نے حدیث بیان کی ، ( انہوں نے کہا ) ہمیں سفیان نے عمرو سے حدیث بیان کی ، انہوں نے عطاء سے اور انہوں نے حضرت جابر رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ إِسْحَاقُ: أَخْبَرَنَا، وَقَالَ أَبُو بَكْرٍ: حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، قَالَ: «كُنَّا نَعْزِلُ، وَالْقُرْآنُ يَنْزِلُ»، زَادَ إِسْحَاقُ، قَالَ سُفْيَانُ: لَوْ كَانَ شَيْئًا يُنْهَى عَنْهُ لَنَهَانَا عَنْهُ الْقُرْآنُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11124,
                "hadithNumber": "3560",
                "englishNarrator": "Jabir (رضی اللہ عنہ) reported:",
                "hadithEnglish": "We used to practice 'azl during the life of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ).",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے عہد میں عزل کیا کرتے تھے.",
                "urduNarrator": "مجھ سے سلمہ بن شبیب نے بیان کیا، کہا ہم سے حسن بن عیان نے بیان کیا، انہوں نے بیان کیا معقل نے ہمیں عطاء سے حدیث بیان کی ، انہوں نے کہا : میں نے جابر رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے",
                "hadithArabic": "وحَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنْ عَطَاءٍ، قَالَ: سَمِعْتُ جَابِرًا، يَقُولُ: «لَقَدْ كُنَّا نَعْزِلُ عَلَى عَهْدِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11125,
                "hadithNumber": "3561",
                "englishNarrator": "Jabir (رضی اللہ عنہ) reported:",
                "hadithEnglish": "We used to practice 'azl during the lifetime of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). This (the news of this practice) reached Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), and he did not forbid us.",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں عزل کرتے تھے ۔ یہ بات اللہ کے نبی صلی اللہ علیہ وسلم کو پہنچی تو آپ نے ہمیں منع نہیں فرمایا.",
                "urduNarrator": "مجھ سے ابو غسان المسمعی نے بیان کیا، معاذ یعنی ابن ہشام نے بیان کیا، مجھ سے میرے والد نے بیان کیا,ابوزبیر نے حضرت جابر رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي أَبُو غَسَّانَ الْمِسْمَعِيُّ، حَدَّثَنَا مُعَاذٌ يَعْنِي ابْنَ هِشَامٍ، حَدَّثَنِي أَبِي، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ: «كُنَّا نَعْزِلُ عَلَى عَهْدِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَبَلَغَ ذَلِكَ نَبِيَّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَلَمْ يَنْهَنَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11126,
                "hadithNumber": "3562",
                "englishNarrator": "Abu Darda' ( رضی اللہ عنہ) related from the Prophet of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ):",
                "hadithEnglish": "He came upon a woman who was in the advanced stage of pregnancy at the door of a tent. He (the Holy Prophet ﷺ) said: Perhaps he (the man accompanying her) intends to cohabit with her. They said: Yes. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: I have decided to curse him with such a curse as may go along with him to his grave. How can he own him (the child to be born) and that is not lawful for him, and how can he take him as a servant for that is not lawful for him?",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم خیمے کے دروازے پر کھڑی ایک پورے دِنوں کی حاملہ عورت ( لونڈی ) کے پاس سے گزرے ، آپ نے فرمایا : \" شاید وہ ( اس کا مالک ) چاہتا ہے کہ اس کے ساتھ مجامعت کرے؟ \" صحابہ رضی اللہ عنہم نے عرض کی : جی ہاں ، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" میں نے ارادہ کیا کہ اس پر ایسی لعنت بھیجوں جو اس کی قبر میں اس کے ساتھ جائے ۔ ایسا کام کرنے والا کیسے اس ( طرح کے بچے ) کو وارث بنائے گا ، جبکہ وہ ( وارث بنانا ) اس کے لیے حلال نہیں ۔ وہ کیسے اس سے خدمت لے گا ( اسے غلام بنائے گا؟ ) جبکہ ( اس بچے کے پیٹ میں ہونے کے دوران میں اس کی ماں سے مباشرت کرنے کی بنا پر اس بچے/بچی کو غلام/کنیز بنانا ) اس کے لیے حلال نہیں.",
                "urduNarrator": "مجھ سے محمد بن المثنیٰ نے بیان کیا, محمد بن جعفر نے ہمیں حدیث بیان کی ، کہا : ہمیں شعبہ نے یزید بن خُمَیر سے حدیث بیان کی ، انہوں نے کہا : میں نے عبدالرحمٰن بن جبیر سے سنا وہ اپنے والد ( جبیر بن نفیر ) سے حدیث بیان کر رہے تھے ، انہوں نے ابودرداء رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ يَزِيدَ بْنِ خُمَيْرٍ، قَالَ: سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ جُبَيْرٍ، يُحَدِّثُ عَنْ أَبِيهِ، عَنْ أَبِي الدَّرْدَاءِ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، أَنَّهُ أَتَى بِامْرَأَةٍ مُجِحٍّ عَلَى بَابِ فُسْطَاطٍ، فَقَالَ: «لَعَلَّهُ يُرِيدُ أَنْ يُلِمَّ بِهَا»، فَقَالُوا: نَعَمْ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَقَدْ هَمَمْتُ أَنْ أَلْعَنَهُ لَعْنًا يَدْخُلُ مَعَهُ قَبْرَهُ، كَيْفَ يُوَرِّثُهُ وَهُوَ لَا يَحِلُّ لَهُ؟ كَيْفَ يَسْتَخْدِمُهُ وَهُوَ لَا يَحِلُّ لَهُ؟",
                "headingArabic": "تَحْرِيمِ وَطْءِ الْحَامِلِ الْمَسْبِيَّةِ ‏",
                "headingUrdu": "حاملہ اسیر عورت سے جماع کی ممانعت",
                "headingEnglish": "The prohibition of intercourse with a pregnant captive woman",
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11127,
                "hadithNumber": "3563",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been transmitted on the authority of Shu'ba.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، انہوں نے کہا یزید بن ہارون اور ابوداؤد نے شعبہ سے اسی سند کے ساتھ یہ حدیث بیان کی.",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو دَاوُدَ، جَمِيعًا عَنْ شُعْبَةَ، فِي هَذَا الْإِسْنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11128,
                "hadithNumber": "3564",
                "englishNarrator": "Judaima daughter of Wahb al-Asadiyya (رضی اللہ عنہا) reported:",
                "hadithEnglish": "She heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) assaying: I intended to prohibit cohabitation with a suckling woman until I considered that the Romans and the Persians do it without any injury being caused to their children thereby. (Imam Muslim said: Khalaf reported it from Judamat al-'Asadiyya, but the correct wording is what has been stated by Yahya.)",
                "hadithUrdu": "انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو سنا,  اس نے کہا: \"میں نے غیبت سے منع کرنے کا ارادہ کیا، یہاں تک کہ میں نے ذکر کیا کہ رومی اور فارسی ایسا کرتے ہیں، لہذا اس سے ان کی اولاد کو کوئی نقصان نہیں ہوتا۔\" مسلم نے کہا، اور جہاں تک خلف کا تعلق ہے، اس نے جذام کے بارے میں وہی کہا جو یحییٰ بلدل نے کہا۔",
                "urduNarrator": "ہم سے خلف بن ہشام نے بیان کیا، ہم سے مالک بن انس نے بیان کیا، اور ہم سے یحییٰ بن یحییٰ نے بیان کیا، اور تلفظ ان کا ہے، انہوں نے کہا: میں نے مالک سے محمد بن عبدالرحمٰن بن نوفل، عروہ کی سند سے، عائشہ رضی اللہ عنہا سے، یہودامہ بنت وہب الاسدیہ رضی اللہ عنہا سے کہ",
                "hadithArabic": "وَحَدَّثَنَا خَلَفُ بْنُ هِشَامٍ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، ح وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، - وَاللَّفْظُ لَهُ - قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ نَوْفَلٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ عَنْ جُدَامَةَ بِنْتِ وَهْبٍ الأَسَدِيَّةِ أَنَّهَا سَمِعَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ ‏ لَقَدْ هَمَمْتُ أَنْ أَنْهَى عَنِ الْغِيلَةِ حَتَّى ذَكَرْتُ أَنَّ الرُّومَ وَفَارِسَ يَصْنَعُونَ ذَلِكَ فَلاَ يَضُرُّ أَوْلاَدَهُمْ ‏ ‏ ‏.‏ قَالَ مُسْلِمٌ وَأَمَّا خَلَفٌ فَقَالَ عَنْ جُذَامَةَ الأَسَدِيَّةِ ‏.‏ وَالصَّحِيحُ مَا قَالَهُ يَحْيَى بِالدَّالِ.‏",
                "headingArabic": "جَوَازِ الْغِيلَةِ وَهِيَ وَطْءُ الْمُرْضِعِ وَكَرَاهَةِ الْعَزْلِ",
                "headingUrdu": "دودھ پلانے والی عورت سے مباشرت جائز ہے اور عزل ناپسند ہے",
                "headingEnglish": "It is permissible to have intercourse with a breastfeeding woman (Ghilah), and 'Azl is disliked",
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11129,
                "hadithNumber": "3565",
                "englishNarrator": "Judama daughter of Wahb, sister of Ukkasha (رضی اللہ عنہ) reported:",
                "hadithEnglish": "I went to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) along with some persons and he was saying: I intended to prohibit cohabitation with the suckling women, but I considered the Greeks and Persians, and saw that they suckle their children and this thing (cohabitation) does not do any harm to them (to the suckling women). Then they asked him about 'azl, whereupon he said. That is the secret (way of) burying alive, and Ubaidullah has made this addition in the hadith transmitted by al-Muqri and that is: When the one buried alive is asked.",
                "hadithUrdu": "میں لوگوں کی موجودگی میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی ، آپ صلی اللہ علیہ وسلم فرما رہے تھے : \"\" میں نے ارادہ کیا تھا کہ غیلہ ( دودھ پلانے والی بیوی کے ساتھ مباشرت کرنے ) سے منع کر دوں ، پھر میں نے روم اور فارس ( کے لوگوں کے بارے ) میں دیکھا ( سوچا ، غور کیا ) تو وہ اپنے بچوں ( کی دودھ پلانے والی ماؤں ) سے غیلہ کرتے ہیں اور یہ ان کے بچوں کو کچھ نقصان نہیں پہنچاتا ۔ \"\" پھر صحابہ نے آپ سے عزل کے بارے میں پوچھا تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" یہ مخفی ( واد ) زندہ درگور کرنا ہے ۔ \"\" عبیداللہ نے مُقری سے روایت کردہ اپنی حدیث میں اضافہ کیا : اور یہی ہے : \"\" زندہ درگور کی گئی سے ( قیامت کے دن ) پوچھا جائے گا.",
                "urduNarrator": "عبیداللہ بن سعید اور محمد بن ابی عمر نے ہمیں حدیث بیان کی ، ان دونوں نے کہا : ہمیں مُقری نے حدیث بیان کی ، کہا : ہمیں سعید بن ابی ایوب نے حدیث بیان کی ، کہا : مجھے ابواسود نے عروہ سے حدیث بیان کی ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے ، انہوں نے عکاشہ رضی اللہ عنہ کی بہن جدامہ بنت وہب رضی اللہ عنہا سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللهِ بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ أَبِي عُمَرَ، قَالَا: حَدَّثَنَا الْمُقْرِئُ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي أَيُّوبَ، حَدَّثَنِي أَبُو الْأَسْوَدِ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، عَنْ جُدَامَةَ بِنْتِ وَهْبٍ، أُخْتِ عُكَّاشَةَ، قَالَتْ: حَضَرْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فِي أُنَاسٍ وَهُوَ يَقُولُ: «لَقَدْ هَمَمْتُ أَنْ أَنْهَى عَنِ الْغِيلَةِ، فَنَظَرْتُ فِي الرُّومِ وَفَارِسَ، فَإِذَا هُمْ يُغِيلُونَ أَوْلَادَهُمْ، فَلَا يَضُرُّ أَوْلَادَهُمْ ذَلِكَ شَيْئًا»، ثُمَّ سَأَلُوهُ عَنِ الْعَزْلِ؟ فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «ذَلِكَ الْوَأْدُ الْخَفِيُّ»، زَادَ عُبَيْدُ اللهِ فِي حَدِيثِهِ: عَنِ الْمُقْرِئِ، وَهِيَ: {وَإِذَا الْمَوْءُودَةُ سُئِلَتْ}.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11130,
                "hadithNumber": "3566",
                "englishNarrator": "It was narrated that from Aishah رضی اللہ عنہا Judama bint Wahb al-Asadiyya (رضی اللہ عنہا) reported:",
                "hadithEnglish": "I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saying this. The rest of the hadith is the same concerning 'azl and ghila (cohabitating with a suckling woman), but with a slight variation of words.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ۔ ۔ ۔ آگے عزل اور غیلہ کے بارے میں سعید بن ابوایوب کی حدیث کی طرح بیان کیا ۔ لیکن انہوں نے ( غیلہ کے بجائے ) غِیال کہا ( معنی وہی ہیں.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے یحییٰ بن اسحاق نے بیان کیا، انہوں نے کہا یحییٰ بن ایوب نے ہمیں محمد بن عبدالرحمٰن بن نوفل قرشی سے حدیث بیان کی ، انہوں نے عروہ سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے ، انہوں نے جدامہ بنت وہب اسدیہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ إِسْحَاقَ، حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ نَوْفَلٍ الْقُرَشِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، عَنْ جُدَامَةَ بِنْتِ وَهْبٍ الْأَسَدِيَّةِ، أَنَّهَا قَالَتْ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَذَكَرَ بِمِثْلِ حَدِيثِ سَعِيدِ بْنِ أَبِي أَيُّوبَ فِي الْعَزْلِ، وَالْغِيلَةِ، غَيْرَ أَنَّهُ قَالَ: «الْغِيَالِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11131,
                "hadithNumber": "3567",
                "englishNarrator": "Sa'd bin Abu Waqqas ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "A person came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: I do 'azi with my wife. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Why do you do that? The person said: I fear harm to her child or her children. Thereupon Allah's Messenger (way peace be upon him) said: If that were harmful it would harm the Persians and the Greeks.",
                "hadithUrdu": "ایک آدمی رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کی : می اپنی بیوی سے عزل کرتا ہوں ، تو رسول اللہ صلی اللہ علیہ وسلم نے پوچھا : \"\" تم ایسا کیوں کرتے ہو؟ \"\" اس نے جواب دیا : میں اس کے بچے یا اس کے بچوں پر ( جنہیں وہ دودھ پلا رہی ہوتی ہے ) شفقت کرتا ہوں ( کہ انہیں کوئی نقصان نہ ہو ۔ ) تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" اگر یہ نقصان دہ ہوتا تو فارس اور روم ( کے بچوں ) کو نقصان دیتا ۔ \"\" زہیر نے اپنی روایت میں کہا : \"\" اگر یہ ( عزل ) اس وجہ سے ہے تو ( اس کی ضرورت ) نہیں ، اس ( عمل ) نے فارس اور روم ( کے بچوں ) کو کوئی نقصان نہیں پہنچایا.",
                "urduNarrator": "محمد بن عبداللہ بن نمیر اور زہیر بن حرب نے ۔ ۔ الفاظ ابن نمیر کے ہیں ۔ ۔ حدیث بیان کی ، دونوں نے کہا : ہمیں عبداللہ بن یزید مقبری نے حدیث بیان کی ، کہا : ہمیں حیوہ نے حدیث بیان کی ، کہا : مجھے عیاش بن عباس نے حدیث سنائی ، انہیں ابونضر نے عامر بن سعد سے حدیث بیان کی کہ اسامہ بن زید رضی اللہ عنہ نے ان کے والد سعد بن ابی وقاص رضی اللہ عنہ کو خبر دی کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، وَزُهَيْرُ بْنُ حَرْبٍ، وَاللَّفْظُ لِابْنِ نُمَيْرٍ، قَالَا: حَدَّثَنَا عَبْدُ اللهِ بْنُ يَزِيدَ الْمَقْبُرِيُّ، حَدَّثَنَا حَيْوَةُ، حَدَّثَنِي عَيَّاشُ بْنُ عَبَّاسٍ، أَنَّ أَبَا النَّضْرِ، حَدَّثَهُ، عَنْ عَامِرِ بْنِ سَعْدٍ، أَنَّ أُسَامَةَ بْنَ زَيْدٍ، أَخْبَرَ وَالِدَهُ سَعْدَ بْنَ أَبِي وَقَّاصٍ، أَنَّ رَجُلًا جَاءَ إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: إِنِّي أَعْزِلُ عَنِ امْرَأَتِي، فَقَالَ لَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لِمَ تَفْعَلُ ذَلِكَ؟» فَقَالَ الرَّجُلُ: أُشْفِقُ عَلَى وَلَدِهَا، أَوْ عَلَى أَوْلَادِهَا، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَوْ كَانَ ذَلِكَ ضَارًّا ضَرَّ فَارِسَ وَالرُّومَ»، وقَالَ زُهَيْرٌ فِي رِوَايَتِهِ: «إِنْ كَانَ لِذَلِكَ فَلَا، مَا ضَارَ ذَلِكَ فَارِسَ، وَلَا الرُّومَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11132,
                "hadithNumber": "3568",
                "englishNarrator": "A'isha (رضی اللہ عنہا) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was with her and she heard the voice of a person seeking permission to enter the house of Hafsa رضی اللہ عنہا. 'A'isha (رضی اللہ عنہا) said: Allah's Messenger, he is the person who seeks permission to enter your house, whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: I think he is so and so (uncle of Hafsa رضی اللہ عنہا by reason of fosterage). 'A'isha رضی اللہ عنہا said: Messenger of Allah, if so and so (her uncle by reason of fosterage) were alive, could he enter my house? Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Yes. Fosterage makes unlawful what consanguinity makes unlawful.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ان کے ہاں تشریف فرما تھے انہوں ( حضرت عائشہ رضی اللہ عنہا ) نے ایک آدمی کی آواز سنی جو حضرت حفصہ رضی اللہ عنہا کے گھر میں داخل ہونے کی اجازت مانگ رہا تھا ۔ حضرت عائشہ رضی اللہ عنہا نے کہا : میں نے عرض کی : اے اللہ کے رسول! یہ آدمی آپ کے گھر میں داخل ہونے کی اجازت مانگ رہا ہے؟ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" میرا خیال ہے وہ فلاں ہے ۔ حفصہ رضی اللہ عنہا کے رضاعی چچا کے بارے میں ( فرمایا ) ۔ ۔ \" عائشہ رضی اللہ عنہا نے عرض کی : اے اللہ کے رسول! اگر فلاں ۔ ۔ انہوں نے اپنے ایک رضاعی چچا کے بارے میں کہا ۔ ۔ زندہ ہوتا تو وہ میرے گھر میں آ سکتا تھا؟ رسول اللہ صلی اللہ علیہ وسلم نے جواب دیا : \" ہاں ، بلاشبہ رضاعت ان تمام رشتوں کو حرام کر دیتی ہے جن کو ولادت حرام کرتی ہے.",
                "urduNarrator": "یحییٰ بن یحییٰ نے کہا : میں نے امام مالک کے سامنے قراءت کی ، عبداللہ بن ابوبکر سے روایت ہے ، انہوں نے عمرہ سے روایت کی ، حضرت عائشہ رضی اللہ عنہا نے انہیں خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ عَبْدِ اللهِ بْنِ أَبِي بَكْرٍ، عَنْ عَمْرَةَ، أَنَّ عَائِشَةَ، أَخْبَرَتْهَا، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ عِنْدَهَا، وَإِنَّهَا سَمِعَتْ صَوْتَ رَجُلٍ يَسْتَأْذِنُ فِي بَيْتِ حَفْصَةَ، قَالَتْ عَائِشَةُ: فَقُلْتُ: يَا رَسُولَ اللهِ، هَذَا رَجُلٌ يَسْتَأْذِنُ فِي بَيْتِكَ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أُرَاهُ فُلَانًا» - لِعَمِّ حَفْصَةَ مِنَ الرَّضَاعَةِ - فَقَالَتْ عَائِشَةُ: يَا رَسُولَ اللهِ، لَوْ كَانَ فُلَانٌ حَيًّا - لِعَمِّهَا مِنَ الرَّضَاعَةِ - دَخَلَ عَلَيَّ؟ قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «نَعَمْ، إِنَّ الرَّضَاعَةَ تُحَرِّمُ مَا تُحَرِّمُ الْوِلَادَةُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11133,
                "hadithNumber": "3569",
                "englishNarrator": "A'isha (رضی اللہ عنہا) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: What becomes unlawful through breastfeeding is that which becomes unlawful through birth.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فرمایا : \" رضاعت سے وہ ( رشتے ) حرام ہو جاتے ہیں جو ولادت سے حرام ہوتے ہیں.",
                "urduNarrator": "ہم سے ابو کریب نے بیان کیا، ہم سے ابو اسامہ ایچ نے بیان کیا اور مجھ سے ابو معمر اسماعیل بن ابراہیم الحذلی نے بیان کیا، انہوں نے کہا ہشام بن عروہ نے عبداللہ بن ابوبکر سے ، انہوں نے عمرہ سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، ح وحَدَّثَنِي أَبُو مَعْمَرٍ إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ الْهُذَلِيُّ، حَدَّثَنَا عَلِيُّ بْنُ هَاشِمِ بْنِ الْبَرِيدِ، جَمِيعًا عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ عَبْدِ اللهِ بْنِ أَبِي بَكْرٍ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، قَالَتْ: قَالَ لِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «يَحْرُمُ مِنَ الرَّضَاعَةِ مَا يَحْرُمُ مِنَ الْوِلَادَةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11134,
                "hadithNumber": "3570",
                "englishNarrator": null,
                "hadithEnglish": "Abdullah bin Abi Bakr narrated a Hadith similar to that of Hisham bin Urwah (no. 3569), with this chain.",
                "hadithUrdu": "مجھ سے اسحاق بن منصور نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، انہوں نے بیان کیا ابن جریج نے ہمیں خبر دی ، کہا : مجھے عبداللہ بن ابوبکر نے اسی سند سے ہشام بن عروہ کی حدیث کے مانند خبر دی.",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِيهِ إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عَبْدُ اللهِ بْنُ أَبِي بَكْرٍ، بِهَذَا الْإِسْنَادِ. مِثْلَ حَدِيثِ هِشَامِ بْنِ عُرْوَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11135,
                "hadithNumber": "3571",
                "englishNarrator": "A'isha ( رضی اللہ عنہا) reported:",
                "hadithEnglish": "Aflah, the brother of Abu'l-Qu'ais, who was her uncle by reason of fosterage, came, and asked her permission (to enter the house) after seclusion (Hijab) was instituted. I refused to admit him. When Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came, I informed him what I had done. He commanded me to grant him permission (as the brother of her foster-father was also her uncle).",
                "hadithUrdu": "پردے کے احکام نازل ہونے کے بعد ابوقُعیس کے بھائی افلح آئے ، وہ اندر آنے کی اجازت چاہتے تھے ، اور وہ ان کے رضاعی چچا ( لگتے ) تھے ۔ انہوں نے کہا : میں نے انہیں اجازت دینے سے انکار کر دیا ۔ جب رسول اللہ صلی اللہ علیہ وسلم تشریف لائے تو جو میں نے کیا آپ کو بتایا تو آپ صلی اللہ علیہ وسلم نے مجھے حکم دیا کہ انہیں اپنے سامنے آنے کی اجازت دوں.",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے پڑھا امام مالک نے ابن شہاب سے ، انہوں نے عروہ بن زبیر سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے ان ( عروہ ) کو خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، أَنَّهَا أَخْبَرَتْهُ: أَنَّ أَفْلَحَ أَخَا أَبِي الْقُعَيْسِ، جَاءَ يَسْتَأْذِنُ عَلَيْهَا، وَهُوَ عَمُّهَا مِنَ الرَّضَاعَةِ، بَعْدَ أَنْ أُنْزِلَ الْحِجَابُ، قَالَتْ: فَأَبَيْتُ أَنْ آذَنَ لَهُ، فَلَمَّا جَاءَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَخْبَرْتُهُ بِالَّذِي صَنَعْتُ: «فَأَمَرَنِي أَنْ آذَنَ لَهُ عَلَيَّ.",
                "headingArabic": "تَحْرِيمِ الرَّضَاعَةِ مِنْ مَاءِ الْفَحْلِ ‏",
                "headingUrdu": "دودھ پلانے سے جو ممانعت ہوتی ہے اس کا تعلق مرد کے مسئلے سے ہے۔",
                "headingEnglish": "The prohibition that results from breastfeeding is related to the issue of the male",
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11136,
                "hadithNumber": "3572",
                "englishNarrator": "A'isha (رضی اللہ عنہا) reported:",
                "hadithEnglish": "There came to me Aflah bin Abu Qulais, my uncle by reason of fosterage; the rest of the hadith is the same (but with this) addition: I ('A'isha رضی اللہ عنہا) said (to the Holy Prophet ﷺ): It was the woman who suckled me and not the man, whereupon he (Allah's Messenger ﷺ) said: May your hands or your right hand be besmeared with dust (you were mistaken).",
                "hadithUrdu": "میرے پاس میرے رضاعی چچا افلح بن ابی قعیس آئے ، ( آگے ) امام مالک رحمۃ اللہ علیہ کی حدیث کے ہم معنی بیان کیا اور یہ اضافہ کیا : ( عائشہ رضی اللہ عنہا نے کہا : ) میں نے عرض کی : مجھے تو عورت نے دودھ پلایا ہے ، مرد نے نہیں پلایا ۔ آپ نے فرمایا : \" تیرے دونوں ہاتھ یا تیرا دایاں ہاتھ خاک آلود ہو.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، انہوں نے کہا سفیان بن عیینہ نے ہمیں زہری سے حدیث بیان کی ، انہوں نے عروہ سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ: أَتَانِي عَمِّي مِنَ الرَّضَاعَةِ أَفْلَحُ بْنُ أَبِي قُعَيْسٍ، فَذَكَرَ بِمَعْنَى حَدِيثِ مَالِكٍ، وَزَادَ، قُلْتُ: إِنَّمَا أَرْضَعَتْنِي الْمَرْأَةُ وَلَمْ يُرْضِعْنِي الرَّجُلُ، قَالَ: «تَرِبَتْ يَدَاكِ» أَوْ «يَمِينُكِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11137,
                "hadithNumber": "3573",
                "englishNarrator": "A'isha (Allah be pleased with her) reported that t",
                "hadithEnglish": "There came Aflah the brother, of Abu'l-Qu'ais, who sought her permission (to enter) after seclusion was instituted, and AbuQu'ais was the father of 'A'isha by reason of fosterage. 'A'isha رضی اللہ عنہا said: By Allah, I would not permit Aflah unless I have solicited the opinion of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) for Abu Qulais has not suckled me, but his wife has given me suck. 'A'isha' ( رضی اللہ عنہا) said: When Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) entered, I said: Allah's Messenger, Aflah is the brother of Abu'l-Qulais; he came to me to seek my permission for entering (the houst). I did not like the idea of granting him permission until I had solicited your opinion. Thereupon Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Grant him permission. 'Urwa said it was on account of this that 'A'isha رضی اللہ عنہا used to say. What is unlawful by reason of consanguinity is unlawful by reason of fosterage.",
                "hadithUrdu": "پردے کا حکم نازل ہونے کے بعد ابوقعیس کے بھائی افلح آئے ، وہ ان کے پاس ( گھر کے اندر ) آنے کی اجازت چاہتے تھے ۔ ابوقعیس حضرت عائشہ رضی اللہ عنہا کے رضاعی والد تھے ۔ حضرت عائشہ رضی اللہ عنہا نے کہا : میں نے کہا : اللہ کی قسم! میں افلح کو اجازت نہیں دوں گی حتیٰ کہ میں رسول اللہ صلی اللہ علیہ وسلم سے اجازت لے لوں ۔ مجھے ابوقعیس نے تو دودھ نہیں پلایا ( کہ اس کا بھائی میرا محرم بن جائے ) مجھے تو ان کی بیوی نے دودھ پلایا تھا ۔ عائشہ رضی اللہ عنہا نے کہا : جب رسول اللہ صلی اللہ علیہ وسلم تشریف لائے ، میں نے عرض کی : اللہ کے رسول! ابوقعیس کے بھائی افلح میرے پاس آئے تھے ، وہ اندر آنے کی اجازت مانگ رہے تھے ، مجھے اچھا نہ لگا کہ میں انہیں اجازت دوں یہاں تک کہ آپ سے اجازت لے لوں ۔ ( عروہ نے ) کہا : حضرت ( عائشہ رضی اللہ عنہا نے ) کہا : نبی صلی اللہ علیہ وسلم نے فرمایا : \"\" انہیں اجازت دے دیا کرو ۔ \"\" عروہ نے کہا : اسی ( حکم ) کی وجہ سےحضرت عائشہ رضی اللہ عنہا کہا کرتی تھیں : رضاعت کی وجہ سے وہ سب رشتے حرام ٹھہرا لو جنہیں تم نسب کی وجہ سے حرام ٹھہراتے ہو.",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا, یونس نے مجھے ابن شہاب سے خبر دی ، انہوں نے عروہ سے روایت کی ، حضرت عائشہ رضی اللہ عنہا نے انہیں خبر دی کہ",
                "hadithArabic": "وحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، أَنَّ عَائِشَةَ، أَخْبَرَتْهُ أَنَّهُ جَاءَ أَفْلَحُ أَخُو أَبِي الْقُعَيْسِ يَسْتَأْذِنُ عَلَيْهَا بَعْدَ مَا نَزَلَ الْحِجَابُ، وَكَانَ أَبُو الْقُعَيْسِ أَبَا عَائِشَةَ مِنَ الرَّضَاعَةِ، قَالَتْ عَائِشَةُ: فَقُلْتُ: وَاللهِ، لَا آذَنُ لِأَفْلَحَ، حَتَّى أَسْتَأْذِنَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَإِنَّ أَبَا الْقُعَيْسِ لَيْسَ هُوَ أَرْضَعَنِي، وَلَكِنْ أَرْضَعَتْنِي امْرَأَتُهُ، قَالَتْ عَائِشَةُ: فَلَمَّا دَخَلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قُلْتُ: يَا رَسُولَ اللهِ، إِنَّ أَفْلَحَ أَخَا أَبِي الْقُعَيْسِ جَاءَنِي يَسْتَأْذِنُ عَلَيَّ، فَكَرِهْتُ أَنْ آذَنَ لَهُ حَتَّى أَسْتَأْذِنَكَ، قَالَتْ: فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «ائْذَنِي لَهُ»، قَالَ عُرْوَةُ: فَبِذَلِكَ كَانَتْ عَائِشَةُ تَقُولُ: «حَرِّمُوا مِنَ الرَّضَاعَةِ مَا تُحَرِّمُونَ مِنَ النَّسَبِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11138,
                "hadithNumber": "3574",
                "englishNarrator": "This hadith has been narrated on the authority of Zuhri with the same chain of transmitters (that 'A'isha رضی اللہ عنہا said):",
                "hadithEnglish": "There came Aflah, the brother of Abu'l Qulais (Allah be pleased with him), and sought permission from her, the rest of the hadith is the same (except for the words that the Holy Prophet) said: He is your uncle. Let your hand be besmeared with dust. Abu'l Qulais was the husband of the woman who had suckled 'A'isha (رضی اللہ عنہا).",
                "hadithUrdu": "ابوقعیس کے بھائی افلح آئے ، وہ ان کے پاس گھر کے اندر آنے کی اجازت چاہتے تھے ۔ ۔ ۔ ان سب کی حدیث کی طرح ۔ ۔ ۔ اور اس میں ہے  \" وہ تمہارے چچا ہیں ، تمہارا دایاں ہاتھ خاک آلود ہو \" اور ابوقعیس اس عورت کے شوہر تھے جس نے حضرت عائشہ رضی اللہ عنہا کو دودھ پلایا تھا.",
                "urduNarrator": "اور ہم سے عبد بن حمید نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا, معمر نے ہمیں زہری سے اسی سند کے ساتھ خبر دی کہ",
                "hadithArabic": "وَحَدَّثَنَاهُ عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، بِهَذَا الْإِسْنَادِ، جَاءَ أَفْلَحُ أَخُو أَبِي الْقُعَيْسِ يَسْتَأْذِنُ عَلَيْهَا بِنَحْوِ حَدِيثِهِمْ، وَفِيهِ: «فَإِنَّهُ عَمُّكِ تَرِبَتْ يَمِينُكِ» وَكَانَ أَبُو الْقُعَيْسِ زَوْجَ الْمَرْأَةِ الَّتِي أَرْضَعَتْ عَائِشَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 10826,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=433",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=431",
                "label": "431",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=432",
                "label": "432",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=433",
                "label": "433",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=434",
                "label": "434",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=435",
                "label": "435",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=436",
                "label": "436",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=437",
                "label": "437",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=435",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=435",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=433",
        "to": 10850,
        "total": 40465
    }
}