{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 315,
        "data": [
            {
                "id": 8139,
                "hadithNumber": "575",
                "englishNarrator": "Abu Huraira ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Woe to the heels because of hell-fire.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’ایڑیوں کے لیے آگ کا عذاب ہے",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے جریر نے بیان کیا,سہیل کے والد ابو صالح نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «وَيْلٌ لِلْأَعْقَابِ مِنَ النَّارِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8140,
                "hadithNumber": "576",
                "englishNarrator": "Jabir ‌رضی ‌اللہ ‌عنہ ‌reported 'Umar bin Khattab رضی ‌اللہ ‌عنہ ‌said:",
                "hadithEnglish": "A person performed ablution and left a small part equal to the space of a nail (unwashed). The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) saw that and said: Go back and perform ablution well. He then went back (performed ablution well) and offered the prayer.",
                "hadithUrdu": "ایک شخص نے وضو کیا تو اپنے پاؤں پر ایک ناخن جتنی جگہ چھوڑ دی ، تو نبی ﷺ نے اس کو دیکھ لیا اور فرمایا : ’’واپس جاؤ اور اپنا وضو خوب اچھی طرح کرو- ‘ ‘ وہ واپس گیا ، ( حکم پر عمل کیا ) پھر نماز پڑھی ۔",
                "urduNarrator": "مجھ سے سلمہ بن شبیب نے بیان کیا، ہم سے حسن بن محمد بن عیان نے بیان کیا، ہم سے معقل نے بیان کیا، ابو الزبیر رضی اللہ عنہ سے,حضرت جابر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سےروایت ہے ، انہوں نے کہا : مجھے حضرت عمر بن خطاب ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے بتایا کہ",
                "hadithArabic": "حَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدِ بْنِ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَخْبَرَنِي عُمَرُ بْنُ الْخَطَّابِ، أَنَّ رَجُلًا تَوَضَّأَ فَتَرَكَ مَوْضِعَ ظُفُرٍ عَلَى قَدَمِهِ فَأَبْصَرَهُ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «ارْجِعْ فَأَحْسِنْ وُضُوءَكَ» فَرَجَعَ، ثُمَّ صَلَّى.",
                "headingArabic": "وُجُوبِ اسْتِيعَابِ جَمِيعِ أَجْزَاءِ مَحَلِّ الطَّهَارَةِ ‏‏",
                "headingUrdu": "طہارت کرتے وقت ان تمام حصوں کو مکمل طور پر دھونا فرض ہے۔",
                "headingEnglish": "The obligation of completely washing all the parts to be washed when purifying oneself",
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8141,
                "hadithNumber": "577",
                "englishNarrator": "Abu Huraira ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: When a bondsman-a Muslim or a believer-washes his face (in course of ablution), every sin he contemplated with his eyes, will be washed away from his face along with water, or with the last drop of water; when he washes his hands, every sin they wrought will be effaced from his hands with the water, or with the last drop of water; and when he washes his feet, every sin towards which his feet have walked will be washed away with the water or with the last drop of water with the result that he comes out pure from all sins.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’جب ایک مسلم ( یامومن ) بندہ وضو کرتا ہے اور اپنا چہرہ دھوتا ہے تو پانی ( یاپانی کے آخری قطرے ) کے ساتھ اس کے چہرے سے وہ سارے گناہ ، جنہیں اس نے اپنی آنکھوں سے دیکھتے ہوئے کیا تھا ، خارج ہو جاتے ہیں اور جب وہ اپنے ہاتھ دھوتا ہے تو پانی ( یا پانی کے آخری قطرے ) کے ساتھ وہ سارے گناہ ، جو اس کے ہاتھوں نے پکڑ کر کیے تھے ، خارج ہو جاتے ہیں اور جب وہ اپنے دونوں پاؤں دھوتا ہے تو پانی ( یا پانی کے آخری قطرے ) کے ساتھ وہ تمام گناہ ، جو اس کے پیروں نے چل کر کیے تھے ، خارج ہو جاتے ہیں حتی کہ وہ گناہوں سے پاک ہو کر نکلتا ہے ۔ ‘ ‘",
                "urduNarrator": "ہم سے سوید بن سعید نے بیان کیا، انہوں نے مالک بن انس سے اور ہم سے ابو الطاہر نے بیان کیا، اور ہم سے عبداللہ بن وہب نے بیان کیا، انہوں نے مالک بن انس کی سند سے، سہیل کی سند سے بن ابی صالح، اپنے والد کی طرف سے،حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، ح، وَحَدَّثَنَا أَبُو الطَّاهِرِ، وَاللَّفْظُ لَهُ أَخْبَرَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا تَوَضَّأَ الْعَبْدُ الْمُسْلِمُ - أَوِ الْمُؤْمِنُ - فَغَسَلَ وَجْهَهُ خَرَجَ مِنْ وَجْهِهِ كُلُّ خَطِيئَةٍ نَظَرَ إِلَيْهَا بِعَيْنَيْهِ مَعَ الْمَاءِ - أَوْ مَعَ آخِرِ قَطْرِ الْمَاءِ -، فَإِذَا غَسَلَ يَدَيْهِ خَرَجَ مِنْ يَدَيْهِ كُلُّ خَطِيئَةٍ كَانَ بَطَشَتْهَا يَدَاهُ مَعَ الْمَاءِ أَوْ مَعَ آخِرِ قَطْرِ الْمَاءِ -، فَإِذَا غَسَلَ رِجْلَيْهِ خَرَجَتْ كُلُّ خَطِيئَةٍ مَشَتْهَا رِجْلَاهُ مَعَ الْمَاءِ - أَوْ مَعَ آخِرِ قَطْرِ الْمَاءِ - حَتَّى يَخْرُجَ نَقِيًّا مِنَ الذُّنُوبِ».",
                "headingArabic": "خُرُوجِ الْخَطَايَا مَعَ مَاءِ الْوُضُوءِ ‏‏",
                "headingUrdu": "وضو کے پانی سے گناہ نکل جاتے ہیں",
                "headingEnglish": "Sins exit with the water of wudu’",
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8142,
                "hadithNumber": "578",
                "englishNarrator": "Uthman bin 'Affan ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah (way peace be upon him) said: He who performed ablution well, his sins would come out from his body, even coming out from under his nails.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’جس نے وضو کیا اور خوب اچھی طرح وضو کیا ، تو اس کے جسم سے اس کےگناہ خارج ہو جاتے ہیں حتی کہ اس کے ناخنوں کےنیچے سے بھی نکل جاتے ہیں ۔ ‘ ‘",
                "urduNarrator": "ہم سے محمد بن معمر بن ربیع القیسی نے بیان کیا، کہا ہم سے ابو ہشام المخزومی نے بیان کیا، انہوں نے عبد الواحد کی سند سے جو ابن زیاد ہیں,حضرت عثمان بن عفان ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مَعْمَرِ بْنِ رِبْعِيٍّ الْقَيْسِيُّ، حَدَّثَنَا أَبُو هِشَامٍ الْمَخْزُومِيُّ، عَنْ عَبْدِ الْوَاحِدِ وَهُوَ ابْنُ زِيَادٍ، حَدَّثَنَا عُثْمَانُ بْنُ حَكِيمٍ، حَدَّثَنَا مُحَمَّدُ بْنُ الْمُنْكَدِرِ، عَنْ حُمْرَانَ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ تَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ خَرَجَتْ خَطَايَاهُ مِنْ جَسَدِهِ، حَتَّى تَخْرُجَ مِنْ تَحْتِ أَظْفَارِهِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8143,
                "hadithNumber": "579",
                "englishNarrator": "Nu'aim bin 'Abdullah al-Mujmir reported:",
                "hadithEnglish": "I saw Abu Huraira perform ablution. He washed his face and washed it well. He then washed his right hand including a portion of his arm. He then washed his left hand including a portion of his arm. He then wiped his head. He then washed his right foot including his shank, and then washed his left foot including shank, and then said: This is how I saw Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) perform his ablution. And (Abu Huraira) added that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had observed: You shall have your faces hands and feet bright on the Day of Resurrection because of your perfect ablution. He who can afford among you, let him increase the brightness of his forehead and that of hands and legs.",
                "hadithUrdu": "میں نے ابوہریرہ ﷺ کو وضو کرتے دیکھا ، انہوں نے اپنا چہرہ دھویا اور اچھی طرح وضو کیا ، پھر اپنا دایاں بازو دھویا حتیٰ کہ اوپر بازو کی ابتداء تک پہنچے ، پھر اپنا بایاں بازو دھویا حتیٰ کہ اوپر بازو کی ابتداء تک پہنچے ، پھر اپنے سر کا مسح کیا ، پھر اپنا دایاں پاؤں دھویا حتی کہ اوپر پنڈلی کی ابتداء تک پہنچے ، پھر اپنا بایاں پاؤں دھویا حتیٰ کہ اوپر پنڈلی کی ابتداء تک پہنچے ، پھر کہا : رسول اللہ ﷺ کو اسی طرح وضو کرتے دیکھا ، اور کہا : رسول اللہﷺ نے فرمایا : ’’قیامت کےدن اچھی طرح وضو کرنے کی وجہ سے تم لوگ ہی روشن چہروں اور سفید چمکدار ہاتھ پاؤں والے ہو گے ، لہٰذا تم میں سے جو اپنے چہرے اور ہاتھ پاؤں کی روشنی اور سفیدی کو آگے تک بڑھا سکے ، بڑھا لے ۔ ‘ ‘",
                "urduNarrator": "مجھ سے ابو کریب محمد بن الاعلٰی، القاسم بن زکریا بن دینار اور عبد بن حمید نے بیان کیا، انہوں نے کہا: ہم سے خالد بن مخلد نے سلیمان بن بلال کی روایت سے بیان کیا,عمارہ بن غزیہ انصاری نےنعیم بن عبداللہ مجمر سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنِي أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ، وَالْقَاسِمُ بْنُ زَكَرِيَّا بْنِ دِينَارٍ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالُوا: حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، عَنْ سُلَيْمَانَ بْنِ بِلَالٍ، حَدَّثَنِي عُمَارَةُ بْنُ غَزِيَّةَ الْأَنْصَارِيُّ، عَنْ نُعَيْمِ بْنِ عَبْدِ اللهِ الْمُجْمِرِ، قَالَ: رَأَيْتُ أَبَا هُرَيْرَةَ يَتَوَضَّأُ فَغَسَلَ وَجْهَهُ فَأَسْبَغَ الْوُضُوءَ، ثُمَّ غَسَلَ يَدَهُ الْيُمْنَى حَتَّى أَشْرَعَ فِي الْعَضُدِ، ثُمَّ يَدَهُ الْيُسْرَى حَتَّى أَشْرَعَ فِي الْعَضُدِ، ثُمَّ مَسَحَ رَأْسَهُ، ثُمَّ غَسَلَ رِجْلَهُ الْيُمْنَى حَتَّى أَشْرَعَ فِي السَّاقِ، ثُمَّ غَسَلَ رِجْلَهُ الْيُسْرَى حَتَّى أَشْرَعَ فِي السَّاقِ ، ثُمَّ قَالَ: هَكَذَا رَأَيْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَتَوَضَّأُ. وَقَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَنْتُمُ الْغُرُّ الْمُحَجَّلُونَ يَوْمَ الْقِيَامَةِ مِنْ إِسْباغِ الْوُضُوءِ، فَمَنِ اسْتَطَاعَ مِنْكمْ فَلْيُطِلْ غُرَّتَهُ وَتَحْجِيلَهُ».",
                "headingArabic": "اسْتِحْبَابِ إِطَالَةِ الْغُرَّةِ وَالتَّحْجِيلِ فِي الْوُضُوءِ ‏‏",
                "headingUrdu": "وضو کرتے وقت پیشانی، بازو اور ٹانگوں کے لیے اچھی طرح دھونے والے حصے کو بڑھانے کی سفارش",
                "headingEnglish": "The recommendation to increase the area washed for the forehead, arms, and legs well when performing wudu’",
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8144,
                "hadithNumber": "580",
                "englishNarrator": "Nu'aim bin 'Abdallah reported:",
                "hadithEnglish": "He saw Abu Huraira perform ablution. He washed his face and washed his hands up to the arms. He then washed his feet and reached up to the shanks and then said: I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) say: My people would come with bright faces and bright hands and feet on account of the marks of ablution, so he who can increase the lustre of his forehead (and that of his hands and legs) should do so.",
                "hadithUrdu": "انہوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو وضو کرتے ہوئے دیکھا ، انہوں نے اپنا چہرہ اور بازو دھوئےیہاں تک کہ کندھوں کے قریب پہنچ گئے ، پھر انہوں نے اپنے پاؤں دھوئے ، یہاں تک کہ اوپر پنڈلیوں تک لے گئے ، پھر کہا : میں نے رسول اللہ ﷺ کو یہ فرماتے ہوئے سنا : ’’ میری امت کے لوگ قیامت کے دن وضو کے اثر سے روشن چہروں اور سفید چمکدار ہاتھ پاؤں کے ساتھ آئیں گے ، لہٰذا تم میں سے جو اپنی روشنی کو آگے تک بڑھا سکتا ہے ، بڑھا لے ۔ ‘ ‘",
                "urduNarrator": "مجھ سے ہارون بن سعید العیلی نے بیان کیا، مجھ سے ابن وہب نے بیان کیا، مجھ سے عمرو بن حارث نے بیان کیا,سعید بن ابی ہلال نے نعیم بن عبداللہ سےروایت کی کہ",
                "hadithArabic": "وَحَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ، حَدَّثَنِي ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ سَعِيدِ بْنِ أَبِي هِلَالٍ، عَنْ نُعَيْمِ بْنِ عَبْدِ اللهِ، أَنَّهُ رَأَى أَبَا هُرَيْرَةَ يَتَوَضَّأُ فَغَسَلَ وَجْهَهُ وَيَدَيْهِ حَتَّى كَادَ يَبْلُغُ الْمَنْكِبَيْنِ ثُمَّ غَسَلَ رِجْلَيْهِ حَتَّى رَفَعَ إِلَى السَّاقَيْنِ، ثُمَّ قَالَ سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّ أُمَّتِي يَأْتُونَ يَوْمَ الْقِيَامَةِ غُرًّا مُحَجَّلِينَ مِنْ أَثَرِ الْوُضُوءِ، فَمَنِ اسْتَطَاعَ مِنْكُمْ أَنْ يُطِيلَ غُرَّتَهُ فَلْيَفْعَلْ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8145,
                "hadithNumber": "581",
                "englishNarrator": "Abu Huraira ‌رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "Verily Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: My Cistern has its dimensions wider than the distance between Aila and Aden, and its water is whiter than ice and sweeter than the honey diluted with milk, and its cups are more numerous than the numbers of the stars. Verily I shall prevent the (faithless) people therefrom just as a man prevents the camels of the people from his fountain. They said: Messenger of Allah, will you recognise us on that day? He said: Yes, you will have distinctive marks which nobody among the peoples (except you) will have; you would come to me with blazing forehead and bright hands and feet on account of the traces of ablution.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’میرا حوض عدن سے ایلہ تک کے فاصلے سے زیادہ وسیع ہے اور ( اس کا پانی ) برف سے زیادہ سفید اور شہد سے ملے دودھ سے زیادہ شیریں ہے اور اس کے برتن ستاروں کی تعداد سے زیادہ ہیں ، ( یہ خالصتاً میری امت کے لیے ہے ، اس لیے ) میں ( امت کے علاوہ دوسرے ) لوگوں کو اس سے روکوں گا ، جیسےآدمی اپنےحوض سے لوگوں کے اونٹوں کو روکتا ہے ۔ ‘ ‘ صحابہ کرام نے پوچھا : اے اللہ کے رسول !کیا اس دن آپ ہمیں پہچانیں گے؟ آپ نے فرمایا : ’’ہاں ، تمہاری ایک علامت ہو گی جو دوسری کسی امت کی نہیں ہو گی ، تم وضو کے اثر سے چمکتے ہوئے چہرے اور ہاتھ پاؤں کے ساتھ میرے پاس آؤ گے ۔ ‘ ‘",
                "urduNarrator": "ہم سے سوید بن سعید اور ابن ابی عمر نے بیان کیا,مروان نے ابو مالک اشجعی سعد بن طارق سے ، انہوں نے ابو حازم سے اور انہوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، وَابْنُ أَبِي عُمَرَ، جَمِيعًا عَنْ مَرْوَانَ الْفَزَارِيِّ، قَالَ ابْنُ أَبِي عُمَرَ: حَدَّثَنَا مَرْوَانُ، عَنْ أَبِي مَالِكٍ الْأَشْجَعِيِّ سَعْدِ بْنِ طَارِقٍ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ حَوْضِي أَبْعَدُ مِنْ أَيْلَةَ مِنْ عَدَنٍ لَهُوَ أَشَدُّ بَيَاضًا مِنَ الثَّلْجِ، وَأَحْلَى مِنَ الْعَسَلِ بِاللَّبَنِ، وَلَآنِيَتُهُ أَكْثَرُ مِنْ عَدَدِ النُّجُومِ وَإِنِّي لَأَصُدُّ النَّاسَ عَنْهُ، كَمَا يَصُدُّ الرَّجُلُ إِبِلَ النَّاسِ عَنْ حَوْضِهِ» قَالُوا: يَا رَسُولَ اللهِ أَتَعْرِفُنَا يَوْمَئِذٍ؟ قَالَ: «نَعَمْ لَكُمْ سِيمَا لَيْسَتْ لِأَحَدٍ مِنَ الْأُمَمِ تَرِدُونَ عَلَيَّ غُرًّا، مُحَجَّلِينَ مِنْ أَثَرِ الْوُضُوءِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8146,
                "hadithNumber": "582",
                "englishNarrator": "Abu Huraira رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: My people would come to me on the Cistern and I would drive away persons (from it) just as a person drives away other people's camels from his camels. They (the hearers) said: Apostle of Allah, would you recognize us? He replied: Yea, you would have a mark which other people will not have. You would come to me with a white blaze on your foreheads and white marks on your feet because of the traces of ablution. A group among you would be prevented from coming to me, and they would not meet me, and I would say: O my Lord, they are my companions. Upon this an angel would reply to me saying: Do you know what these people did after you.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’میری امت میرے پاس حوض پر آئے گی اور میں اسی طرح ( دوسرے ) لوگوں کو اس ( حوض ) سے دور ہٹاؤں گا جیسےایک آدمی دوسرے آدمی کے اونٹوں کو اپنے اونٹوں سے ہٹاتا ہے ۔ ‘ ‘ صحابہ کرام نے عرض کی : اے اللہ کے نبی !کیا آپ ہمیں پہچانیں گے؟ آپ نے فرمایا : ’’ہاں ، تمہاری ایک نشانی ہو گی جو تمہارے سوا کسی اور کی نہیں ہو گی ، تم میرے پا س وضو کےاثرات سے روشن چہرے اور چمکدارہاتھ پاؤں کے ساتھ آؤ گے ۔ تم میں سےایک گروہ کو زبردستی میرے پاس آنے سےروک دیا جائے گا ، تو وہ مجھ تک نہیں پہنچ سکیں گے ۔ اس پر میں کہوں گا : اے میرے رب !یہ میرے ساتھیوں میں سے ہیں ۔ ایک فرشتہ مجھے جواب دے گا او رکہے گا : کیا آپ جانتے ہیں انہوں نےآپ کے بعد کیا کیا کام ایجاد کیے تھے؟ ‘ ‘",
                "urduNarrator": "ابو کریب اور واصل بن عبدا لاعلی - اور تلفظ واصل ہے - نے ہم سے بیان کیا، کہا,( مروان کے بجائے ) ابن فضیل نے ابو مالک اشجعی سے ، انہوں نے ابو حازم سے اور انہوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وَحَدَّثَنَا أَبُو كُرَيْبٍ، وَوَاصِلُ بْنُ عَبْدِ الْأَعْلَى، - وَاللَّفْظُ لِوَاصِلٍ -، قَالَا: حَدَّثَنَا ابْنُ فُضَيْلٍ، عَنْ أَبِي مَالِكٍ الْأَشْجَعِيِّ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «تَرِدُ عَلَيَّ أُمَّتِي الْحَوْضَ، وَأَنَا أَذُودُ النَّاسَ عَنْهُ، كَمَا يَذُودُ الرَّجُلُ إِبِلَ الرَّجُلِ عَنْ إِبِلِهِ» قَالُوا يَا نَبِيَّ اللهِ أَتَعْرِفُنَا؟ قَالَ: نَعَمْ لَكُمْ سِيمَا لَيْسَتْ لِأَحَدٍ غَيْرِكُمْ تَرِدُونَ عَلَيَّ غُرًّا مُحَجَّلِينَ مِنْ آثَارِ الْوُضُوءِ، وَلَيُصَدَّنَّ عَنِّي طَائِفَةٌ مِنْكُمْ فَلَا يَصِلُونَ، فَأَقُولُ: يَا رَبِّ هَؤُلَاءِ مِنْ أَصْحَابِي. فَيُجِيبُنِي مَلَكٌ، فَيَقُولُ: وَهَلْ تَدْرِي مَا أَحْدَثُوا بَعْدَكَ؟",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8147,
                "hadithNumber": "583",
                "englishNarrator": "Hudhaifa رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: My Cistern is bigger than the space between Aila and Aden. By Him in Whose Hand is my life, I will drive away persons (from it) just as a person drives away unknown camels from his cistern. They (the companions) said: Messenger of Allah, would you recognise us? He said: Yes, you would come to me with white faces, and white hands and feet on account of the traces of ablution. None but you would have (this mark).",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’بلاشبہ میرا حوض ایلہ سے عدن تک کے فاصلے سے زیادہ وسیع ہے ، اس ذات کی قسم جس کےہاتھ میں میری جان ہے ! میں اس سے اسی طرح ( دوسرے ) لوگوں کو ہٹاؤں گا ، جس طرح آدمی اجنبی اونٹوں کو اپنے حوض سے ہٹاتا ہے ۔ ‘ ‘ صحابہ نے عرض کی : اےاللہ کے رسول ! اور کیا آپ ہمیں پہچان لیں گے؟آپ نے فرمایا : ’’ہاں ، تم میرے پاس روشن چہرے اور چمکتے ہوئے سفید ہاتھ پاؤں کے ساتھ آؤگے ، یہ علامت تمہارے سوا کسی اور میں نہیں ہو گی ۔ ‘ ‘",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ نے بیان کیا، ہم سے علی بن مشر نے بیان کیا، ان سے سعد بن طارق نے، وہ رباعی بن حارث کی سند سے,حضرت حذیفہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے ، انہوں نے کہا",
                "hadithArabic": "وَحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ سَعْدِ بْنِ طَارِقٍ، عَنْ رِبْعِىِّ بْنِ حِرَاشٍ، عَنْ حُذَيْفَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ حَوْضِي لَأَبْعَدُ مِنْ أَيْلَةَ مِنْ عَدَنٍ وَالَّذِي نَفْسِي بِيَدِهِ، إِنِّي لَأَذُودُ عَنْهُ الرِّجَالَ كَمَا يَذُودُ الرَّجُلُ الْإِبِلَ الْغَرِيبَةَ عَنْ حَوْضِهِ» قَالُوا: يَا رَسُولَ اللهِ وَتَعْرِفُنَا؟ قَالَ: «نَعَمْ تَرِدُونَ عَلَيَّ غُرًّا مُحَجَّلِينَ مِنْ آثَارِ الْوُضُوءِ لَيْسَتْ لِأَحَدٍ غَيْرِكُمْ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8148,
                "hadithNumber": "584",
                "englishNarrator": "Abu Huraira رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came to the graveyard and said: Peace be upon you! The abode of the believing people and we, if God so wills, are about to join you. I love to see my brothers. They (the hearers) said: Aren't we your brothers, O Messenger of Allah? He said: You are my companions, and our brothers are those who have, so far, not come into the world. They said: Messenger of Allah, how would you recognise those persons of your Ummah who have not yet been born? He said: Supposing a man had horses with white blazes on foreheads and legs among horses which were all black, tell me, would he not recognise his own horses? They said: Certainly, O Messenger of Allah. He said: They would come with white faces and arms and legs owing to ablution, and I would arrive at the Cistern before them. Some people would be driven away from my Cistern as the stray camel is driven away. I would call out: Come, come. Then it would be said (to me): These people changed themselves after you, and I would say: Be off, be off.",
                "hadithUrdu": "رسو ل اللہﷺقبرستان میں آئے اور فرمایا : ’’اے ایمان والی قوم کے گھرانے ! تم سب پر سلامتی ہو اور ہم بھی ان شاء اللہ تمہیں ساتھ ملنے والے ہیں ، میری خواہش ہے کہ ہم نے اپنے بھائیوں کو ( بھی ) دیکھا ہوتا ۔ ‘ ‘ صحابہ نے عرض کی : اے اللہ کے رسول ! کیا ہم آپ کے بھائی نہیں ؟ آپ نے جواب دیا : ’’تم میرے ساتھی ہو اور ہمارے بھائی وہ لوگ ہیں جو ابھی تک ( دنیا میں ) نہیں آئے ۔ ‘ ‘ اس پر انہوں نے عرض کی : اے اللہ کے رسول ! آپ اپنی امت کے ان لوگوں کو ، جو ابھی ( دنیامیں ) نہیں آئے ، کیسے پہچانیں گے؟ تو آپ نے فرمایا : ’’بتاؤ! اگر کالے سیاہ گھوڑوں کے درمیان کسی کے سفید چہرے ( اور ) سفید پاؤں والے گھوڑے ہوں تو کیا وہ اپنے گھوڑوں کو نہیں پہچانے گا؟ ‘ ‘ انہوں نے کہا : کیوں نہیں ، اے اللہ کےرسول! آپ نے فرمایا : ’’وہ وضو کی بناپر روشن چہروں ، سفید ہاتھ پاؤں کے ساتھ آئیں گے اور میں حوض پر ان کا پیشروہوں گا ، خبردار ! کچھ لوگ یقیناً میرے حوض سے پرے ہٹا ئے جائیں گے ، جیسے ( کہیں اور کا ) بھٹکا ہوا اونٹ ( جوگلے کا حصہ نہیں ہوتا ) پرے ہٹا دیا جاتا ہے ، میں ان کی آوازدوں گا ، دیکھو! ادھر آ جاؤ ۔ تو کہاجائے گا ، انہوں نے آپ کے بعد ( اپنے قول و عمل کو ) بدل لیا تھا ۔ تو میں کہوں گا : دور ہو جاؤ ، دور ہو جاؤ ۔ ‘ ‘",
                "urduNarrator": "ہم سے یحییٰ بن ایوب، سریج بن یونس، قتیبہ بن سعید اور علی بن حجر نے بیان کیا,اسماعیل ( بن جعفر ) نے علاء سے ، انہوں نے اپنے والد سےاور انہوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَسُرَيْجُ بْنُ يُونُسَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَعَلِيُّ بْنُ حُجْرٍ، جَمِيعًا عَنْ إِسْمَاعِيلَ بْنِ جَعْفَرٍ - قَالَ ابْنُ أَيُّوبَ حَدَّثَنَا إِسْمَاعِيلُ - أَخْبَرَنِي الْعَلَاءُ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَتَى الْمَقْبُرَةَ، فَقَالَ: «السَّلَامُ عَلَيْكُمْ دَارَ قَوْمٍ مُؤْمِنِينَ، وَإِنَّا إِنْ شَاءَ اللهُ بِكُمْ لَاحِقُونَ، وَدِدْتُ أَنَّا قَدْ رَأَيْنَا إِخْوَانَنَا» قَالُوا: أَوَلَسْنَا إِخْوَانَكَ؟ يَا رَسُولَ اللهِ قَالَ: «أَنْتُمْ أَصْحَابِي وَإِخْوَانُنَا الَّذِينَ لَمْ يَأْتُوا بَعْدُ» فَقَالُوا: كَيْفَ تَعْرِفُ مَنْ لَمْ يَأْتِ بَعْدُ مِنْ أُمَّتِكَ؟ يَا رَسُولَ اللهِ فَقَالَ: «أَرَأَيْتَ لَوْ أَنَّ رَجُلًا لَهُ خَيْلٌ غُرٌّ مُحَجَّلَةٌ بَيْنَ ظَهْرَيْ خَيْلٍ دُهْمٍ بُهْمٍ أَلَا يَعْرِفُ خَيْلَهُ؟» قَالُوا: بَلَى يَا رَسُولَ اللهِ قَالَ: فَإِنَّهُمْ يَأْتُونَ غُرًّا مُحَجَّلِينَ مِنَ الْوُضُوءِ، وَأَنَا فَرَطُهُمْ عَلَى الْحَوْضِ أَلَا لَيُذَادَنَّ رِجَالٌ عَنْ حَوْضِي كَمَا يُذَادُ الْبَعِيرُ الضَّالُّ أُنَادِيهِمْ أَلَا هَلُمَّ فَيُقَالُ: إِنَّهُمْ قَدْ بَدَّلُوا بَعْدَكَ فَأَقُولُ سُحْقًا سُحْقًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8149,
                "hadithNumber": "585",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ﷺ) went out to the graveyard and said: Peace be upon you, the abode of the believing people. and If Allah so wills we shall join you.... (and so on and so forth) like the hadith narrated by Isma'il bin Ja'far except the words of Malik: Then some persons would be driven away from my Cistern.",
                "hadithUrdu": "رسول اللہ ﷺ قبرستان کی طرف تشریف لے گئے اور فرمایا : ’’اے ایمان والی قوم کے دیار! تم سب پر سلامتی ہو ، ہم بھی اگر اللہ نےچاہا تو تمہارے ساتھ ملنے والے ہیں ۔ ‘ ‘ اس کے بعد اسماعیل بن جعفر کی روایت کی طرح ہے ۔ ہاں مالک کی روایت میں یہ الفاظ ہیں : ’’ تو کچھ لوگوں کو میرے حوض سے ہٹایا جائے گا ۔ ‘ ‘ ( الا ، یعنی خبردار کے بجائے ف ، یعنی ’تو ‘ کا لفظ ہے ۔ )",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے عبدالعزیز نے بیان کیا، کہا ہم سے الدراوردی نے بیان کیا، کہا ہم سے اسحاق بن موسیٰ الانصاری نے بیان کیا، کہا ہم سے معن نے بیان کیا، کہا کہ ہم سے مالک نے بیان کیا، ان سب نے علاء بن عبدالرحمٰن کی سند سے بیان کیا۔ اپنے والد سے، ابوہریرہ رضی اللہ عنہ سے",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي الدَّرَاوَرْدِيَّ ح، وَحَدَّثَنِي إِسْحَاقُ بْنُ مُوسَى الْأَنْصَارِيُّ، حَدَّثَنَا مَعْنٌ، حَدَّثَنَا مَالِكٌ، جَمِيعًا عَنِ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ خَرَجَ إِلَى الْمَقْبُرَةِ فَقَالَ: «السَّلَامُ عَلَيْكُمْ دَارَ قَوْمٍ مُؤْمِنِينَ وَإِنَّا إِنْ شَاءَ اللهُ بِكُمْ لَاحِقُونَ» بِمِثْلِ حَدِيثِ إِسْمَاعِيلَ بْنِ جَعْفَرٍ، غَيْرَ أَنَّ حَدِيثَ مَالِكٍ فَلَيُذَادَنَّ رِجَالٌ عَنْ حَوْضِي.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8150,
                "hadithNumber": "586",
                "englishNarrator": "Abu Hazim reported:",
                "hadithEnglish": "I was (standing) behind Abu Huraira رضی ‌اللہ ‌عنہ ‌and he was performing the ablution for prayer. He extended the (washing) of his hand that it went up to his armpit. I said to him: O Abu Huraira, what is this ablution? He said: O of the tribe of Faruukh, you are here; if I knew that you were here, I would have never performed ablution like this; I have heard my Friend ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) say. In a believer adornment would reach the places where ablution reaches.",
                "hadithUrdu": "میں ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے پیچھے کھڑا تھا اور وہ نماز کے لیے وضو کر رہے تھے ، وہ اپنا ہاتھ آگے بڑھاتے ، یہاں تک کہ بغل تک پہنچ جاتا ، میں نے ان سے پوچھا : اے ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ ! یہ کس طرح کا وضو ہے؟ انہوں نے جواب دیا : اے فروخ کی اولاد ( اے بنی فارس ) ! تم یہاں ہو ؟ اگر مجھے پتہ ہوتا کہ تم لوگ یہاں کھڑے ہو تو میں اس طرح وضو نہ کرتا ۔ میں نے ا پنے خلیل ﷺ کو فرماتے ہوئے سناتھا : ’’ مومن کازیور وہاں پہنچے گا جہاں اس کے وضو کا پانی پہنچے گا ۔ ‘ ‘",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ان سے خلف، یعنی ابن خلیفہ نے، ہم سے ابومالک اشجعی نے بیان کیا,ابو حازم سے روایت ہے ، انہوں نےکہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا خَلَفٌ يَعْنِي ابْنَ خَلِيفَةَ، عَنْ أَبِي مَالِكٍ الْأَشْجَعِيِّ، عَنْ أَبِي حَازِمٍ، قَالَ: كُنْتُ خَلْفَ أَبِي هُرَيْرَةَ، وَهُوَ يَتَوَضَّأُ لِلصَّلَاةِ فَكَانَ يَمُدُّ يَدَهُ حَتَّى تَبْلُغَ إِبْطَهُ فَقُلْتُ لَهُ: يَا أَبَا هُرَيْرَةَ مَا هَذَا الْوُضُوءُ؟ فَقَالَ: يَا بَنِي فَرُّوخَ أَنْتُمْ هَاهُنَا؟ لَوْ عَلِمْتُ أَنَّكُمْ هَاهُنَا مَا تَوَضَّأْتُ هَذَا الْوُضُوءَ، سَمِعْتُ خَلِيلِي صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «تَبْلُغُ الْحِلْيَةُ مِنَ الْمُؤْمِنِ، حَيْثُ يَبْلُغُ الْوَضُوءُ».",
                "headingArabic": "تَبْلُغُ الْحِلْيَةُ حَيْث يَبْلُغُ الْوَضُوءُ ‏‏",
                "headingUrdu": "زینت (آخرت میں) وضو تک پہنچے گی۔",
                "headingEnglish": "Adornment (in the hereafter) will reach as far as the wudu’ reached",
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8151,
                "hadithNumber": "587",
                "englishNarrator": "Abu Huraira ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Should I not suggest to you that by which Allah obliterates the sins and elevates the ranks (of a man). They (the hearers) said: Yes, Messenger of Allah. He said: Performing the ablution thoroughly despite odds, tranverside of more paces towards the mosque, and waiting for the next prayer after observing a prayer, and that is mindfulness.",
                "hadithUrdu": "رسول اللہ ﷺنے فرمایا : ’’کیا میں تمہیں ایسی جیز سے آگاہ نہ کروں جس کے ذریعے سے اللہ تعالیٰ گناہ مٹا دیتا ہے او ر درجات بلند فرماتا ہے ؟ ‘ ‘ صحابہ نے عرض کی : اے اللہ کےر سول کیوں نہیں ! آپ نے فرمایا : ’’ناگواریوں باوجود اچھی طرح وضوکرنا ، مساجد تک زیادہ قدم چلنا ، ایک نماز کے بعد دوسری نماز کا انتظار کرنا ، سو یہی رباط ( شیطان کے خلاف جنگ کی چھاؤنی ( ہے ۔ ‘ ‘",
                "urduNarrator": "ہم سے یحییٰ بن ایوب، قتیبہ اور ابن حجر نے اسماعیل بن جعفر کی سند سے بیان کیا، ابن ایوب نے کہا,اسماعیل نے بیان کیا کہ انہیں علاء نے خبر دی ، انہوں نے اپنے والد سے روایت کی ، انہوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سےروایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ حُجْرٍ جَمِيعًا عَنْ إِسْمَاعِيلَ بْنِ جَعْفَرٍ - قَالَ ابْنُ أَيُّوبَ: حَدَّثَنَا إِسْمَاعِيلُ - أَخْبَرَنِي الْعَلَاءُ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَلَا أَدُلُّكُمْ عَلَى مَا يَمْحُو اللهُ بِهِ الْخَطَايَا، وَيَرْفَعُ بِهِ الدَّرَجَاتِ؟» قَالُوا بَلَى يَا رَسُولَ اللهِ قَالَ: «إِسْبَاغُ الْوُضُوءِ عَلَى الْمَكَارِهِ، وَكَثْرَةُ الْخُطَا إِلَى الْمَسَاجِدِ، وَانْتِظَارُ الصَّلَاةِ بَعْدَ الصَّلَاةِ، فَذَلِكُمُ الرِّبَاطُ».",
                "headingArabic": "فَضْلِ إِسْبَاغِ الْوُضُوءِ عَلَى الْمَكَارِهِ ‏‏",
                "headingUrdu": "اسباغل وضو کی فضیلت ان اوقات میں جب ایسا کرنا مشکل ہو",
                "headingEnglish": "The virtue of isbaghil-wudu’ (performing wudu’ properly) during times when it is difficult to do so",
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8152,
                "hadithNumber": "588",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of `Ali bin `Abdul-Rahman with the same chain of transmitters and there is no mention of the word of al-Ribat in the hadith transmitted by Shu`ba and in the hadith narrated by Malik Ribat has been mentioned twice. This is the Ribat for you, this is the Ribat for you.",
                "hadithUrdu": "( بجائے اسماعیل کے ) مالک اور شعبہ نے اسی سند کے ساتھ علاء بن عبدالرحمن سے روایت کی ، شعبہ کی حدیث میں ’’رباط ‘ ‘ کا تذکرہ نہیں ہے جبکہ مالک کی حدیث میں دوبارہ ہے : ’’یہی رباط ہے ، یہی رباط ہے ۔ ‘ ‘",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ بْنُ مُوسَى الْأَنْصَارِيُّ، حَدَّثَنَا مَعْنٌ، حَدَّثَنَا مَالِكٌ ح، وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ جَمِيعًا عَنِ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ، بِهَذَا الْإِسْنَادِ وَلَيْسَ فِي حَدِيثِ شُعْبَةَ ذِكْرُ الرِّبَاطِ وَفِي حَدِيثِ مَالِكٍ ثِنْتَيْنِ «فَذَلِكُمُ الرِّبَاطُ، فَذَلِكُمُ الرِّبَاطُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8153,
                "hadithNumber": "589",
                "englishNarrator": "Abu Huraira ‌رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "The Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Were it not that I might over-burden the believers-and in the hadith transmitted by Zuhair people -I would have ordered them to use toothstick at every time of prayer.",
                "hadithUrdu": "نبی ﷺ نےفرمایا : ’’اگر مجھے یہ ڈر نہ ہوتا کہ میں مسلمانوں کو ( زہیر کی روایت میں ہے : اپنی امت کو ) مشقت میں ڈال دوں گا تو میں انہیں ہر نماز کے وقت مسواک کرنے کا حکم دیتا ۔ ‘ ‘",
                "urduNarrator": "ہم سے قتیبہ بن سعید، عمرو النقید اور زہیر بن حرب نے بیان کیا، کہا: ہم سے سفیان نے ابو الزناد سے اور العرج کی سند سے بیان کیا,حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالُوا: حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَوْلَا أَنْ أَشُقَّ عَلَى الْمُؤْمِنِينَ - وَفِي حَدِيثِ زُهَيْرٍ عَلَى أُمَّتِي - لَأَمَرْتُهُمْ بِالسِّوَاكِ عِنْدَ كُلِّ صَلَاةٍ».",
                "headingArabic": "السِّوَاكِ ‏‏",
                "headingUrdu": "مسواک (دانتوں کی چھڑی)",
                "headingEnglish": "Siwak (tooth-stick)",
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8154,
                "hadithNumber": "590",
                "englishNarrator": "Miqdam bim Shuraih narrated it from his father who said:",
                "hadithEnglish": "I asked A'isha what Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) did first when he entered his house, and she replied: He used tooth-stick (first of all).",
                "hadithUrdu": "میں نے حضرت عائشہ ؓ سے پوچھا ، میں نے کہا : نبی ﷺ جب گھر تشریف لاتے تو کس بات ( کام ) سے آغاز فرماتے تھے ؟انہوں نے فرمایا : مسواک سے ۔",
                "urduNarrator": "ہم سے ابو کریب محمد بن العلاء نے بیان کیا، کہا ہم سے ابن بشر نے بیان کیا,مسعر نے مقدام بن شریح سے اور انہوں نے اپنے والد سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ، حَدَّثَنَا ابْنُ بِشْرٍ، عَنْ مِسْعَرٍ، عَنِ الْمِقْدَامِ بْنِ شُرَيْحٍ، عَنْ أَبِيهِ، قَالَ: سَأَلْتُ عَائِشَةَ، قُلْتُ: بِأَيِّ شَيْءٍ كَانَ يَبْدَأُ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِذَا دَخَلَ بَيْتَهُ؟ قَالَتْ: «بِالسِّوَاكِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8155,
                "hadithNumber": "591",
                "englishNarrator": "A'isha reported:",
                "hadithEnglish": "Whenever Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) entered his house, he used tooth-stick first of all.",
                "hadithUrdu": "نبی ﷺجب اپنے گھر تشریف لاتے تو مسواک سے آغاز فرماتے ۔",
                "urduNarrator": "مجھ سے ابوبکر بن نافع العبدی نے بیان کیا، ہم سے عبدالرحمٰن نے بیان کیا،سفیان نے مقدام بن شریح سے باقی ماندہ سابقہ سند سے حضرت عائشہ ‎ؓؓؓؓؓؓؓؓؓؓؓؓؓؓسے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ الْعَبْدِيُّ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنِ الْمِقْدَامِ بْنِ شُرَيْحٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «كَانَ إِذَا دَخَلَ بَيْتَهُ بَدَأَ بِالسِّوَاكِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8156,
                "hadithNumber": "592",
                "englishNarrator": "Abu Musa رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "I went to the Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and found one end of the tooth-stick upon his tongue (i. e. he was rinsing his mouth).",
                "hadithUrdu": "میں رسول اللہﷺ کی خدمت میں حاضر ہوا تو مسواک کا ایک کنارا آپ کی زبان پر تھا ۔",
                "urduNarrator": "ہم سے یحییٰ بن حبیب الحارثی نے بیان کیا، کہا ہم سے حماد بن زید نے بیان کیا، انہوں نے غیلان کی سند سے، جو ابن جریر المعو لی ہیں، انہوں نے ابو بردہ کی سند سے,حضرت ابو موسیٰ اشعری ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ غَيْلَانَ وَهُوَ ابْنُ جَرِيرٍ الْمَعْوَلِيُّ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ: «دَخَلْتُ عَلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَطَرَفُ السِّوَاكِ عَلَى لِسَانِهِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8157,
                "hadithNumber": "593",
                "englishNarrator": "Huddaifa ‌رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "Whenever the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) got up for Tahajjud prayer, he cleansed his mouth with the tooth-stick.",
                "hadithUrdu": "جب رسول اللہ ﷺ رات کو تہجد کے لیے کھڑے ہوتے تو اپنا دہن مبارک مسواک سے اچھی طرح صاف فرماتے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا,ہشیم نے حصین سے ، انہوں نے ابو وائل سے ، انہوں نے حضرت حذیفہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا هُشَيْمٌ، عَنْ حُصَيْنٍ، عَنْ أَبِي وَائِلٍ، عَنْ حُذَيْفَةَ، قَالَ: «كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ لِيَتَهَجَّدَ يَشُوصُ فَاهُ بِالسِّوَاكِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8158,
                "hadithNumber": "594",
                "englishNarrator": "This hadith is reported from Hudaifa ‌رضی ‌اللہ ‌عنہ ‌by another chain of transmitters:",
                "hadithEnglish": "Whenever he (the Holy Prophet) got up in the night, they (the transmitters) have not mentioned the words: for offering Tahajjud prayer.",
                "hadithUrdu": "رسول اللہ ﷺ جب رات کو اٹھتے ...... آگے سابقہ روایت کی طرح ہے لیکن انہوں نے ’’تہجد کے لیے ‘ ‘ کے الفاظ روایت نہیں کیے ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے جریر نے بیان کیا,منصور اور اعمش دونوں نے ابو وائل سے ، انہوں نے حضرت حذیفہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "دَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ ح، وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، وَأَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، كِلَاهُمَا عَنْ أَبِي وَائِلٍ، عَنْ حُذَيْفَةَ قَالَ: كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «إِذَا قَامَ مِنَ اللَّيْلِ» بِمِثْلِهِ وَلَمْ يَقُولُوا لِيَتَهَجَّدَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8159,
                "hadithNumber": "595",
                "englishNarrator": "Hudaifa reported:",
                "hadithEnglish": "Whenever he (the Holy Prophet  ﷺ) got up for prayer during the night, he cleansed his mouth with the tooth-stick.",
                "hadithUrdu": "رسول اللہ ﷺ جب رات کو اٹھتے تو اپنا دہن مبارک مسواک سے اچھی طرح صاف فرماتے ۔",
                "urduNarrator": "ہم سے محمد بن المثنیٰ اور ابن بشار نے بیان کیا، کہا: ہم سے عبدالرحمٰن نے بیان کیا،سفیان نے منصور کےحوالے سے اور حصین اور اعمش نے ( بھی منصور کی طرح ) ابو وائل سے اور انہوں نے حضرت حذیفہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، وَحُصَيْنٌ، وَالْأَعْمَشُ، عَنْ أَبِي وَائِلٍ، عَنْ حُذَيْفَةَ: «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا قَامَ مِنَ اللَّيْلِ يَشُوصُ فَاهُ بِالسِّوَاكِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8160,
                "hadithNumber": "596",
                "englishNarrator": "Ibn 'Abbas رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "He spent a night at the house of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), The Apostle of Allah (way peace be upon him) got up for prayer in the latter part of the night. He went out and looked towards the sky and then recited this verse (190th) of AI-i-'Imran: Verily in the creation of the heavens and the earth and the alternation of night and day. up to the (words) save us from the torment of Hell. He then returned to his house, used the tooth-stick, performed the ablution, and then got up and offered the prayer. He than lay down on the bed. and again got up and went out and looked towards the sky and recited this verse (mentioned above), then returned, used the tooth-stick, performed ablution and again offered the prayer.",
                "hadithUrdu": "انہوں نے ایک رات اللہ کے نبی ﷺ کے ہاں گزاری ۔ اللہ کے نبی ﷺ رات کے آخری حصے میں اٹھے ، باہر نکلے اور آسمان پر نظر ڈالی پھر سورہ آل عمران کی آیت : ﴿إِنَّ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ وَاخْتِلَافِ اللَّيْلِ وَالنَّهَارِ﴾تلاوت کی اور﴿فَقِنَا عَذَابَ النَّارِ﴾تک پہنچے ۔ پھر گھر لوٹے اور اچھی طرح مسواک کی اور وضو فرمایا ، پھر کھڑے ہوئے اور نماز پڑھی ، پھر لیٹ گئے ، پھر کھڑے ہوئے ، باہر آسمان کی طرف دیکھا ، پھر ( دوبارہ ) یہ آیت پڑھی ، پھر واپس آئے ، مسواک کی اور وضو فرمایا ، پھر کھڑے ہوئے اور نماز پڑھی ۔",
                "urduNarrator": "ہم سے عبد بن حمید نے بیان کیا، کہا ہم سے ابو نعیم نے بیان کیا، کہا ہم سے اسماعیل بن مسلم نے بیان کیا، ہم سے ابو المتوکل نے بیان کیا,حضرت ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ابو متوکل کو بتایا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ مُسْلِمٍ، حَدَّثَنَا أَبُو الْمُتَوَكِّلِ، أَنَّ ابْنَ عَبَّاسٍ حَدَّثَهُ أَنَّهُ بَاتَ عِنْدَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ذَاتَ لَيْلَةٍ فَقَامَ نَبِيُّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنْ آخِرِ اللَّيْلِ، فَخَرَجَ فَنَظَرَ فِي السَّمَاءِ، ثُمَّ تَلَا هَذِهِ الْآيَةَ فِي آلِ عِمْرَانَ {إِنَّ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ وَاخْتِلَافِ اللَّيْلِ وَالنَّهَارِ} [البقرة: 164] حَتَّى بَلَغَ {فَقِنَا عَذَابَ النَّارِ} [آل عمران: 191] ثُمَّ رَجَعَ إِلَى الْبَيْتِ فَتَسَوَّكَ وَتَوَضَّأَ، ثُمَّ قَامَ فَصَلَّى ثُمَّ اضْطَجَعَ ثُمَّ قَامَ، فَخَرَجَ فَنَظَرَ إِلَى السَّمَاءِ فَتَلَا هَذِهِ الْآيَةَ، ثُمَّ رَجَعَ فَتَسَوَّكَ فَتَوَضَّأَ، ثُمَّ قَامَ فَصَلَّى.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8161,
                "hadithNumber": "597",
                "englishNarrator": "Abu Huraira ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "Five are the acts quite akin to the Fitra, or five are the acts of Fitra: circumcision, shaving the pubes, cutting the nails, plucking the hair under the armpits and clipping the moustache.",
                "hadithUrdu": "آپ نے فرمایا : ’’فطرت ( کے خصائل ) پانچ ہیں ( یا پانچ چیزیں فطرت کا حصہ ہیں ) : ختنہ کرانا ، زیر ناف بال مونڈنا ، ناخن تراشنا ، بغل کے بال اکھیڑنا اور مونچھ کترنا ۔ ‘ ‘",
                "urduNarrator": "ابوبکر بن ابی شیبہ، عمرو الناقد اور زہیر بن حرب نے سفیان کی سند سے کہا,ابن عیینہ نے زہری سے حدیث بیان کی ، انہوں نے سعید بن مسیب سے ، انہوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انہوں نے نبی ﷺ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، جَمِيعًا عَنْ سُفْيَانَ، قَالَ أَبُو بَكْرٍ: حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْفِطْرَةُ خَمْسٌ - أَوْ خَمْسٌ مِنَ الْفِطْرَةِ - الْخِتَانُ، وَالِاسْتِحْدَادُ، وَتَقْلِيمُ الْأَظْفَارِ، وَنَتْفُ الْإِبِطِ، وَقَصُّ الشَّارِبِ».",
                "headingArabic": "خِصَالِ الْفِطْرَةِ ‏‏",
                "headingUrdu": "فطرت کی خصوصیات",
                "headingEnglish": "The characteristics of the fitrah",
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8162,
                "hadithNumber": "598",
                "englishNarrator": "Abu Huraira رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "Five are the acts of fitra: circumcision, removing the pubes, clipping the moustache, cutting the nails, plucking the hair under the armpits.",
                "hadithUrdu": "آپ نے فرمایا : ’’ ( خصائل ) فطرت پانچ ہیں : ختنہ کرانا ، زیر ناف بال مونڈنا ، مونچھ کترنا ، ناخن تراشنا اور بغل کے بال اکھیڑنا ۔ ‘ ‘",
                "urduNarrator": "مجھ سے ابو الطاہر اور ہرملہ بن یحییٰ نے بیان کیا، کہا کہ ہم سے ابن وہب نے بیان کیا,مجھے یونس نے ابن شہاب زہری سے خبر دی ، انہوں نے سعید بن مسیب سے ، انہوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انہوں نے رسول اللہ ﷺ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، قَالَا: أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: «الْفِطْرَةُ خَمْسٌ الِاخْتِتَانُ، وَالِاسْتِحْدَادُ، وَقَصُّ الشَّارِبِ، وَتَقْلِيمُ الْأَظْفَارِ، وَنَتْفُ الْإِبِطِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8163,
                "hadithNumber": "599",
                "englishNarrator": "Anas ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "A time limit has been prescribed for us for clipping the moustache, cutting the nails, plucking hair under the armpits, shaving the pubes, that it should not be neglected far more than forty nights.",
                "hadithUrdu": "ہمارے لیے مونچھیں کترنے ، ناخن تراشنے ، بغل کے بال اکھیڑنے اور زیر ناف بال مونڈنے کے لیے وقت مقرر کر دیا گیا کہ ہم ان کو چالیس دن سےزیادہ نہ چھوڑیں ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ اور قتیبہ بن سعید نے بیان کیا، ان دونوں نے جعفر کی سند سے بیان کیا، انہوں نے کہا: ہم سے یحییٰ، جعفر بن سلیمان نے ابو عمران الجونی کی سند سے بیان کیا,حضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَقُتَيْبَةُ بْنُ سَعِيدٍ، كِلَاهُمَا عَنْ جَعْفَرٍ، قَالَ: يَحْيَى، أَخْبَرَنَا جَعْفَرُ بْنُ سُلَيْمَانَ، عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ: - قَالَ أَنَسٌ - «وُقِّتَ لَنَا فِي قَصِّ الشَّارِبِ، وَتَقْلِيمِ الْأَظْفَارِ، وَنَتْفِ الْإِبِطِ، وَحَلْقِ الْعَانَةِ، أَنْ لَا نَتْرُكَ أَكْثَرَ مِنْ أَرْبَعِينَ لَيْلَةً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 7851,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=314",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=312",
                "label": "312",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=313",
                "label": "313",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=314",
                "label": "314",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=315",
                "label": "315",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=316",
                "label": "316",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=317",
                "label": "317",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=318",
                "label": "318",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=316",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=316",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=314",
        "to": 7875,
        "total": 40465
    }
}