{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 339,
        "data": [
            {
                "id": 8739,
                "hadithNumber": "1175",
                "englishNarrator": "Abu al-Tiyyah reported:",
                "hadithEnglish": "I heard from Anas ‌رضی ‌اللہ ‌عنہ a narration like this from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌).",
                "hadithUrdu": "میں نے حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنا ، وہ فرما رہے تھے کہ رسول اللہ ﷺ .... ( آگے ) سابقہ حدیث کے مانند ہے ۔",
                "urduNarrator": "ہم سے یحییٰ بن حبیب نے بیان کیا,( معاذ کے بجائے ) خالد ، یعنی ابن حارث نے روایت کی ، کہا : ہمیں شعبہ نے ابو تیاح سے حدیث سنائی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ، أَخْبَرَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي التَّيَّاحِ، قَالَ: سَمِعْتُ أَنَسًا، يَقُولُ: كَانَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8740,
                "hadithNumber": "1176",
                "englishNarrator": "Al-Bara' bin 'Azib ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "I said prayer with the Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) turning towards Bait-ul-Maqdis for sixteen months till this verse of Surah Baqara wis revealed: And wherever you are turn your faces towards it (ii. 144). This verse was revealed when the Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had said prayer. A person amongst his people passed by the people of Ansar as they were engaged in prayer. He narrated to them (this command of Allah) and they turned their faces towards the Ka'ba.",
                "hadithUrdu": "میں نے نبی ﷺ کے ساتھ سولہ ماہ تک بیت المقدس کی طرف ( رخ کر کے ) نماز پڑھی یہاں تک کہ سورہ بقرۃ کی آیت : ’’اور تم جہاں کہیں بھی ہو اپنے رخ کعبہ کی طرف کرو ۔ ‘ ‘ اتری ۔ یہ آیت اس وقت اتری جب نبی ﷺ نماز پڑھ چکے تھے ۔ لوگوں میں سے ایک آدمی ( یہ حکم سن ) چلا تو انصار کے کچھ لوگوں کے پاس سے گزرا ، وہ ( مسجد بنی حارثہ میں ، جس کا نام اس واقعے کے بعد مسجد قبلتین پڑ گیا ) نماز پڑھ رہے تھے ، اس نے انہیں یہ ( حکم ) بتایا تو انہوں نے ( اثنائے نماز ہی میں ) اپنے چہرے بیت اللہ کی طرف کر لیے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، انہوں نے کہا,ابو احوص نے ابو اسحاق سے اور انہوں نے حضرت براء بن عازب ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو الْأَحْوَصِ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ: «صَلَّيْتُ مَعَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِلَى بَيْتِ الْمَقْدِسِ سِتَّةَ عَشَرَ شَهْرًا» حَتَّى نَزَلَتِ الْآيَةُ الَّتِي فِي الْبَقَرَةِ {وَحَيْثُ مَا كُنْتُمْ فَوَلُّوا وُجُوهَكُمْ شَطْرَهُ} [البقرة: 144] فَنَزَلَتْ بَعْدَمَا صَلَّى النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَانْطَلَقَ رَجُلٌ مِنَ الْقَوْمِ فَمَرَّ بِنَاسٍ مِنَ الْأَنْصَارِ وَهُمْ يُصَلُّونَ، فَحَدَّثَهُمْ، فَوَلُّوا وُجُوهَهُمْ قِبَلَ الْبَيْتِ.",
                "headingArabic": "تَحْوِيلِ الْقِبْلَةِ مِنَ الْقُدْسِ إِلَى الْكَعْبَةِ ‏",
                "headingUrdu": "قبلہ کو القدس (یروشلم) سے کعبہ کی طرف تبدیل کرنا",
                "headingEnglish": "Changing the qiblah from Al-Quds (Jerusalem) to the Ka`bah",
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8741,
                "hadithNumber": "1177",
                "englishNarrator": "Abu Ishaq reported:",
                "hadithEnglish": "I heard al-Bara' رضی ‌اللہ ‌عنہ saying: We prayed with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) (with our faces) towards Bait-ul-Maqdis for sixteen months or seventeen months. Then we were made to change (our direction) towards the Ka'ba.",
                "hadithUrdu": "میں نے حضرت براء ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنا ، وہ کہہ رہے تھے : ہم نے رسول اللہ ﷺ کے ساتھ سولہ یا سترہ ماہ بیت المقدس کی طرف رخ کر کے نماز پڑھی ، پھر ہمارا رخ کعبہ کی طرف پھیر دیا گیا ۔",
                "urduNarrator": "ہم سے محمد بن المثنی اور ابوبکر بن خلاد نے یحییٰ بن المثنیٰ سے بیان کیا، کہا: ہم سے یحییٰ بن سعید نے بیان کیا،سفیان ( ثوری ) سے روایت ہے ، کہا : مجھے ابو اسحاق نے حدیث سنائی ، کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَأَبُو بَكْرِ بْنُ خَلَّادٍ، جَمِيعًا عَنْ يَحْيَى، قَالَ ابْنُ الْمُثَنَّى: حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ سُفْيَانَ، حَدَّثَنِي أَبُو إِسْحَاقَ، قَالَ: سَمِعْتُ الْبَرَاءَ، يَقُولُ: «صَلَّيْنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَحْوَ بَيْتِ الْمَقْدِسِ سِتَّةَ عَشَرَ شَهْرًا، أَوْ سَبْعَةَ عَشَرَ شَهْرًا، ثُمَّ صُرِفْنَا نَحْوَ الْكَعْبَةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8742,
                "hadithNumber": "1178",
                "englishNarrator": "Ibn 'Umar رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "As the people were praying at Quba' a man came to them and said: It has been revealed to file Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) during the night and he has been directed to turn towards the Ka'ba. So turn towards it. Their faces were towards Syria and they turned round towards Ka'ba.",
                "hadithUrdu": "لوگ قباء میں صبح کی نماز پڑھ رہے تھے ، اسی اثناء میں ان کے پاس آنے والا ایک شخص ( عباد بن بشر ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) آیا اور اس نے کہا : بلاشبہ رات ( گزشتہ دن کے آخری حصے میں ) رسول اللہ ﷺ پر قرآن اترا ۔ اور آپ کو حکم دیا گیا کہ آپ کعبہ کی طرف رخ کریں ، لہٰذا تم لوگ بھی اس کی طرف رخ کر لو ۔ ان کے رخ شام کی طرف تھے تو ( اسی وقت ) وہ سب کعبہ کی طرف گھوم گئے ۔",
                "urduNarrator": "ہم سے شیبان بن فرخ نے بیان کیا، انہوں نے بیان کیا عبد العزیز بن مسلم اورمالک بن انس نے اپنی اپنی سندوں سے عبد اللہ بن دینار سے روایت کی ،، ان سے ابن عمر، ایچ، اور ہم سے قتیبہ بن سعید نے بیان کیا اور  مالک بن انس سے،  انہوں نے حضرت ابن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُسْلِمٍ، حَدَّثَنَا عَبْدُ اللهِ بْنُ دِينَارٍ، عَنِ ابْنِ عُمَرَ، ح وحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ - وَاللَّفْظُ لَهُ - عَنْ مَالِكِ بْنِ أَنَسٍ، عَنْ عَبْدِ اللهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، قَالَ: بَيْنَمَا النَّاسُ فِي صَلَاةِ الصُّبْحِ بِقُبَاءٍ إِذْ جَاءَهُمْ آتٍ فَقَالَ: «إِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَدِ اُنْزِلَ عَلَيْهِ اللَّيْلَةَ، وَقَدْ أُمِرَ أَنْ يَسْتَقْبِلَ الْكَعْبَةَ فَاسْتَقْبِلُوهَا، وَكَانَتْ وُجُوهُهُمْ إِلَى الشَّامِ، فَاسْتَدَارُوا إِلَى الْكَعْبَةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8743,
                "hadithNumber": "1179",
                "englishNarrator": "Ibn 'Umar ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "As the people were engaged in the morning prayer a man came to them. The rest of the hadith is the same.",
                "hadithUrdu": "جب لوگ صبح کی نماز میں تھے کہ ایک آدمی ان کے پاس آیا، جیسا کہ مالک کی حدیث ہے۔",
                "urduNarrator": "مجھ سے سوید بن سعید نے بیان کیا، مجھ سے حفص بن میسرہ نے بیان کیا، وہ موسیٰ بن عقبہ سے، نافع کی سند سے، ابن عمر سے اور عبداللہ بن دینار نے اپنے چچا زاد بھائی سے۔ انہوں نے کہا",
                "hadithArabic": "حَدَّثَنِي سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنِي حَفْصُ بْنُ مَيْسَرَةَ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، وَعَنْ عَبْدِ اللهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، قَالَ: بَيْنَمَا النَّاسُ فِي صَلَاةِ الْغَدَاةِ إِذْ جَاءَهُمْ رَجُلٌ، بِمِثْلِ حَدِيثِ مَالِكٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8744,
                "hadithNumber": "1180",
                "englishNarrator": "Anas رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to pray towards Bait-ul-Maqdis, that it was revealed (to him): Indeed We see the turning of the face to heaven, wherefore We shall assuredly cause thee to turn towards Qibla which shall please thee. So turn thy face towards the sacred Mosque (Ka'ba) (ii. 144). A person from Banu Salama was going; (he found the people) in ruk'u (while) praying the dawn prayer and they had said one rak'ah. He said in a loud voice: Listen! the Qibla has been changed and they turned towards (the new) Qibla (Ka'ba) in that very state.",
                "hadithUrdu": "رسول اللہ ﷺ بیت المقدس کی طرف منہ کر کے نماز پڑھا کرتے تھے ، پھر یہ آیت : ’’ ہم آپ کا چہرہ آسمان کی طرف پھرتا ہوا دیکھ رہے ہیں ، ہم ضرور آپ کا رخ اس قبلے کی طرف پھیر دیں گے جسے آپ پسند کرتے ہیں ، لہٰذا آپ اپنا چہرہ مسجد حرام کی طرف پھیر لیجئے ۔ ‘ ‘ بنو سلمہ کا ایک آدمی ( عباد بن بشر ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) گزرا ، ( اس وقت ) لوگ ( مسجد قباء میں ) صبح کی نماز میں رکوع کر رہے تھے اور ایک رکعت اس سے پہلے پڑھ چکے تھے ، اس نے آواز دی : سنو! قبلہ تبدیل کیا جا چکا ہے ۔ چنانچہ وہ جس حالت میں تھے اسی میں ( رکوع ہی کے عالم میں ) قبلے کی طرف پھر گئے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے عفان نے بیان کیا، کہا ہم سے حماد بن سلمہ نے بیان کیا، ثابت کی سند سے,حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ: «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي نَحْوَ بَيْتِ الْمَقْدِسِ»، فَنَزَلَتْ: {قَدْ نَرَى تَقَلُّبَ وَجْهِكَ فِي السَّمَاءِ فَلَنُوَلِّيَنَّكَ قِبْلَةً تَرْضَاهَا فَوَلِّ وَجْهَكَ شَطْرَ الْمَسْجِدِ الْحَرَامِ} [البقرة: 144] فَمَرَّ رَجُلٌ مِنْ بَنِي سَلَمَةَ وَهُمْ رُكُوعٌ فِي صَلَاةِ الْفَجْرِ، وَقَدْ صَلَّوْا رَكْعَةً، فَنَادَى: أَلَا إِنَّ الْقِبْلَةَ قَدْ حُوِّلَتْ، فَمَالُوا كَمَا هُمْ نَحْوَ الْقِبْلَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8745,
                "hadithNumber": "1181",
                "englishNarrator": "A'isha reported:",
                "hadithEnglish": "Umm Habiba and Umm Salama رضی اللہ عنہما made a mention before the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) of a church which they had seen in Abyssinia and which had pictures in it. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: When a pious person amongst them (among the religious groups) dies they build a place of worship on his grave, and then decorate it with such pictures. They would be the worst of creatures on the Day of judgment in the sight of Allah.",
                "hadithUrdu": "ام حبیبہ اور ام سلمہ رضی اللہ عنہما نے رسول اللہ ﷺ کے سامنے اس گرجے کا تذکرہ ، جو انہوں نے حبشہ میں دیکھا تھا اور اس میں تصویریں آویزاں تھیں ، کہا : ’’بلاشبہ وہ لوگ ( قدیم سے ایسے ہی تھے کہ ) جب ان میں کوئی نیک آدمی فوت ہو جاتا تو وہ اس کی قبر پر مسجد بنا دیتے اور اس میں یہ تصویریں بنا دیتے ۔ یہ لوگ قیامت کے روز اللہ عزوجل کے نزدیک بدترین مخلوق ہوں گے ۔ ‘ ‘",
                "urduNarrator": "مجھ سے زہیر بن حرب نے کہا, یحییٰ بن سعید قطان نے حدیث بیان کی ، کہا : ہمیں ہشام نے حدیث سنائی ، کہا : مجھے میرے والد ( عروہ ) نے حضرت عائشہ رضی اللہ عنہا سے خبر دی کہ",
                "hadithArabic": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا هِشَامٌ، أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ، أَنَّ أُمَّ حَبِيبَةَ، وَأُمَّ سَلَمَةَ ذَكَرَتَا كَنِيسَةً رَأَيْنَهَا بِالْحَبَشَةِ فِيهَا تَصَاوِيرُ لِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ أُولَئِكَ، إِذَا كَانَ فِيهِمُ الرَّجُلُ الصَّالِحُ، فَمَاتَ، بَنَوْا عَلَى قَبْرِهِ مَسْجِدًا، وَصَوَّرُوا فِيهِ تِلْكِ الصُّوَرَ، أُولَئِكِ شِرَارُ الْخَلْقِ عِنْدَ اللهِ يَوْمَ الْقِيَامَةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8746,
                "hadithNumber": "1182",
                "englishNarrator": null,
                "hadithEnglish": "A'isha reported: They (some Companions of the Holy Prophet) were conversing with one another in the presence of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) (during his last) illness. Umm Salama and Umm Habiba made a mention of the church and then (the hadith was) narrated.",
                "hadithUrdu": "۔ وکیع نے کہا : ہمیں ہشام بن عروہ نے اپنے والد عروہ کے حوالے سے حضرت عائشہ رضی اللہ عنہا سے حدیث روایت کی کہ آپ کے مرض الموت میں لوگوں نے آپ کے سامنے آپس میں بات چیت کی تو ام سلمہ اور ام حبیبہ رضی اللہ عنہما نے ایک گرجے کا ذکر کیا ..... پھر اسی کے مانند بیان کیا",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، قَالَا: حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّهُمْ تَذَاكَرُوا عِنْدَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي مَرَضِهِ فَذَكَرَتْ أُمُّ سَلَمَةَ وَأُمُّ حَبِيبَةَ كَنِيسَةً ثُمَّ ذَكَرَ نَحْوَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8747,
                "hadithNumber": "1183",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "The wives of the Messenger of Allah (ﷺ) made a mention of the church which they had seen in Abyssinia which was called Mariya, and the rest of the hadith is the same.",
                "hadithUrdu": "ازواج نبی ﷺ نے ایک کنیسے کا ذکر کیا جو انہوں نے حبشہ کی سرزمین میں دیکھا تھا ، اسے ( کنیسۂ ) ماریہ کہا جاتا تھا .... ( آگے ) ان ( پہلے راویوں ) کی حدیث کی طرح ہے ۔",
                "urduNarrator": "ہم سے ابو کریب نے بیان کیا, ( یحییٰ اور وکیع کے بجائے ) ابو معاویہ نے کہا , ہمیں ہشام نے اپنے والد سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے حدیث سنائی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ: ذَكَرْنَ أَزْوَاجُ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَنِيسَةً رَأَيْنَهَا بِأَرْضِ الْحَبَشَةِ، يُقَالُ لَهَا مَارِيَةُ بِمِثْلِ حَدِيثِهِمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8748,
                "hadithNumber": "1184",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said during his illness from which he never recovered: Allah cursed the Jews and the Christians that they took the graves of their prophets as mosques. She ('A'isha) reported: Had it not been so, his (Prophet's) grave would have been in an open place, but it could not be due to the fear that it may not be taken as a mosque. According to the report of Ibn Abi Shaibah: Were it not for that...'' and he did not mention: \"She said.\"",
                "hadithUrdu": "رسول اللہ ﷺ نے اپنی اس بیماری میں جس سے آپ اٹھ نہ سکے ( جاں بر نہ ہوئے ) فرمایا : ’’ اللہ تعالیٰ یہود اور نصاریٰ پر لعنت کرے! انہوں نے اپنے انبیاء کی قبروں کو مسجدیں بنا لیا ۔ ‘ ‘ حضرت عائشہ رضی اللہ عنہا نے ) کہا : اس لیے اگر یہ اندیشہ نہ ہوتا تو آپ کی قبر کو ظاہر رکھا جاتا لیکن یہ ڈر تھا کہ اسے مسجد بنا لیا جائے گا ۔ ( اس لیے اللہ کی مشیت سے وہ حجرہ مبارکہ میں بنائی گئی ۔ ) ابن ابی شیبہ کی روایت میں فلو لا کی جگہ ولو لا ( اور اگر ) کے الفاظ ہیں اور اس سے پہلے قالت ( انہوں نے کہا ) کا لفظ نہیں کہا.",
                "urduNarrator": "ابوبکر ابی شیبہ او رعمرو ناقد نے کہا : ہم سے ہاشم بن قاسم نے حدیث بیان کی ، انہوں نے کہا : ہمیں شیبان نے ہلال بن ابی حمید سے حدیث سنائی ، انہوں نے عروہ بن زبیر سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، قَالَا: حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، حَدَّثَنَا شَيْبَانُ، عَنْ هِلَالِ بْنِ أَبِي حُمَيْدٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، قَالَتْ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: فِي مَرَضِهِ الَّذِي لَمْ يَقُمْ مِنْهُ «لَعَنَ اللهُ الْيَهُودَ وَالنَّصَارَى، اتَّخَذُوا قُبُورَ أَنْبِيَائِهِمْ مَسَاجِدَ» قَالَتْ: «فَلَوْلَا ذَاكَ أُبْرِزَ قَبْرُهُ، غَيْرَ أَنَّهُ خُشِيَ أَنْ يُتَّخَذَ مَسْجِدًا» وَفِي رِوَايَةِ ابْنِ أَبِي شَيْبَةَ: وَلَوْلَا ذَاكَ لَمْ يَذْكُرْ: قَالَتْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8749,
                "hadithNumber": "1185",
                "englishNarrator": "Abu Huraira رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Let Allah destroy the Jews for they have taken the graves of their apostles as places of worship.",
                "hadithUrdu": "رسول اللہﷺ نے فرمایا : ’’ اللہ یہود کو ہلاک کرے! انہوں نے اپنے انبیاء کی قبروں کو سجدہ گاہ بنا لیا ۔ ‘ ‘",
                "urduNarrator": "ہم سے ہارون بن سعید الایلی نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، کہا کہ مجھ سے یونس اور مالک نے ابن شہاب کی سند سے بیان کیا,سعید بن مسیب نے حدیث بیان کی کہ حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا",
                "hadithArabic": "حَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، وَمَالِكٌ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيِّبِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «قَاتَلَ اللهُ الْيَهُودَ، اتَّخَذُوا قُبُورَ أَنْبِيَائِهِمْ مَسَاجِدَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8750,
                "hadithNumber": "1186",
                "englishNarrator": "Abu Huraira reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Let there be curse of Allah upon the Jews and the Christians for they have taken the graves of their apostles as places of worship.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’ اللہ یہود ونصاریٰ پر لعنت کرے! انہوں نے اپنے انبیاء کی قبروں کو مسجدیں بنا لیا ۔ ‘ ‘",
                "urduNarrator": "مجھ سے قتیبہ بن سعید نے بیان کیا، ہم سے الفزاری نے بیان کیا، عبید اللہ بن صم سے,( سعید کے بجائے ) یزید بن الأصم نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت بیان کی کہ",
                "hadithArabic": "وَحَدَّثَنِي قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا الْفَزَارِيُّ، عَنْ عُبَيْدِ اللهِ بْنِ الْأَصَمِّ، حَدَّثَنَا يَزِيدُ بْنُ الْأَصَمِّ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَعَنَ اللهُ الْيَهُودَ وَالنَّصَارَى، اتَّخَذُوا قُبُورَ أَنْبِيَائِهِمْ مَسَاجِدَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8751,
                "hadithNumber": "1187",
                "englishNarrator": "A'isha and Abdullah ‌رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "As the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was about to breathe his last, he drew his sheet upon his face and when he felt uneasy, he uncovered his face and said in that very state: Let there be curse upon the Jews and the Christians that they have taken the graves of their apostles as places of worship. He in fact warned (his men) against what they (the Jews and the Christians) did.",
                "hadithUrdu": "جب رسول اللہ ﷺ پر ( وفات کے لمحے ) طاری ہوئے تو آپ اپنی ایک چادر اپنےچہرے پر ڈالتے تھے اور جب جی گھبراتا تو اسے چہرے سے ہٹا لیتے تھے ، آپ اسی حالت میں تھے کہ آپ نے فرمایا : ’’ یہود ونصاریٰ پر اللہ کی لعنت ہو! انہوں نے اپنے انبیاء کی قبروں کو مساجد بنا لیا ۔ ‘ ‘ آپ ان جیسا عمل کرنے سے ڈرا رہے تھے ۔",
                "urduNarrator": "مجھ سے ہارون بن سعید العیلی نے بیان کیا اور مجھ سے ہرملہ بن یحییٰ نے بیان کیا - ہرملہ نے کہا : ہم سے انہوں نے بیان کیا اور ہارون نے کہا : ہم سے ابن وہب نے بیان کیا ، مجھ سے یونس نے ابن شہاب سے بیان کیا ,عبید اللہ بن عبد اللہ ( بن مسعود ) نے خبر دی کہ حضرت عائشہ اور حضرت عبد اللہ بن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ دونوں نے کہا کہ",
                "hadithArabic": "وَحَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ، وَحَرْمَلَةُ بْنُ يَحْيَى - قَالَ حَرْمَلَةُ: أَخْبَرَنَا، وَقَالَ هَارُونُ: - حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عُبَيْدُ اللهِ بْنُ عَبْدِ اللهِ، أَنَّ عَائِشَةَ، وَعَبْدَ اللهِ بْنَ عَبَّاسٍ، قَالَا: لَمَّا نُزِلَ بِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، طَفِقَ يَطْرَحُ خَمِيصَةً لَهُ عَلَى وَجْهِهِ، فَإِذَا اغْتَمَّ كَشَفَهَا عَنْ وَجْهِهِ، فَقَالَ: وَهُوَ كَذَلِكَ «لَعْنَةُ اللهِ عَلَى الْيَهُودِ وَالنَّصَارَى، اتَّخَذُوا قُبُورَ أَنْبِيَائِهِمْ مَسَاجِدَ» يُحَذِّرُ مِثْلَ مَا صَنَعُوا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8752,
                "hadithNumber": "1188",
                "englishNarrator": "Jundub ‌رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "I heard from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) five days before his death and he said: I stand acquitted before Allah that I took any one of you as friend, for Allah has taken me as His friend, as he took Ibrahim as His friend. Had I taken any one of my Ummah as a friend, I would have taken Abu Bakr as a friend. Beware of those who preceded you and used to take the graves of their prophets and righteous men as places of worship, but you must not take graves as mosques; I forbid you to do that.",
                "hadithUrdu": "میں نے نبیﷺ کو آپ کی وفات سے پانچ دن پہلے یہ کہتے ہوئے سنا : ’’ میں اللہ تعالیٰ کے حضور اس چیز سے براءت کا اظہار کرتا ہوں کہ تم میں سے کوئی میرا خلیل ہو کیونکہ اللہ تعالیٰ نے مجھے اپنا خلیل بنا لیا ہے ، جس طرح اس نے ابراہیم علیہ السلام ‌ ‌ کو اپنا خلیل بنایا تھا ، اگر میں اپنی امت میں سے کسی کو اپنا خلیل بناتا تو ابو بکر کو خلیل بناتا ، خبردار! تم سے پہلے لوگ اپنے انبیاء اور نیک لوگوں کی قبروں کو سجدہ گاہیں بنا لیا کرتے تھے ، خبردار! تم قبروں کو سجدہ گاہیں نہ بنانا ، میں تم کو اس سے روکتا ہوں ۔ ‘ ‘",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور اسحاق بن ابراہیم نے بیان کیا - اور یہ قول ابوبکر کے لیے ہے، انہوں نے کہا: ہم سے انہوں نے بیان کیا، اور ابوبکر نے کہا: ہم سے زکریا بن عدی نے بیان کیا، انہوں نے عبید اللہ بن عمرو رضی اللہ عنہما سے۔ زید بن ابی انیسہ کی سند سے، عمرو بن مرہ کی سند سے، عبداللہ بن الحارث نجرانی کی سند سے کہتے ہیں,حضرت جندب ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ - وَاللَّفْظُ لِأَبِي بَكْرٍ قَالَ إِسْحَاقُ: أَخْبَرَنَا، وَقَالَ أَبُو بَكْرٍ: - حَدَّثَنَا زَكَرِيَّا بْنُ عَدِيٍّ، عَنْ عُبَيْدِ اللهِ بْنِ عَمْرٍو، عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ عَبْدِ اللهِ بْنِ الْحَارِثِ النَّجْرَانِيِّ، قَالَ: حَدَّثَنِي جُنْدَبٌ، قَالَ: سَمِعْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَبْلَ أَنْ يَمُوتَ بِخَمْسٍ، وَهُوَ يَقُولُ: «إِنِّي أَبْرَأُ إِلَى اللهِ أَنْ يَكُونَ لِي مِنْكُمْ خَلِيلٌ، فَإِنَّ اللهِ تَعَالَى قَدِ اتَّخَذَنِي خَلِيلًا، كَمَا اتَّخَذَ إِبْرَاهِيمَ خَلِيلًا، وَلَوْ كُنْتُ مُتَّخِذًا مِنْ أُمَّتِي خَلِيلًا لَاتَّخَذْتُ أَبَا بَكْرٍ خَلِيلًا، أَلَا وَإِنَّ مَنْ كَانَ قَبْلَكُمْ كَانُوا يَتَّخِذُونَ قُبُورَ أَنْبِيَائِهِمْ وَصَالِحِيهِمْ مَسَاجِدَ، أَلَا فَلَا تَتَّخِذُوا الْقُبُورَ مَسَاجِدَ، إِنِّي أَنْهَاكُمْ عَنْ ذَلِكَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8753,
                "hadithNumber": "1189",
                "englishNarrator": "Ubaidullah al-Khaulini reported:",
                "hadithEnglish": "'Uthman bin 'Affan رضی ‌اللہ ‌عنہ ‌listened to the opinion of the people (which was not favourable) when he rebuilt the mosque of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). Thereupon he said: You have not been fair to me for I have heard from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) saying: He who built a mosque for Allah, the Exalted, Allah would build for him a house in Paradise. Bukair said: I think he (the Holy Prophet) said: While he seeks the pleasure of Allah (by building the mosque). And in the narration of Ibn 'Isa (the words are): (a house) like that (mosque) in Paradise.",
                "hadithUrdu": "انہوں نے حضرت عثمان بن عفان ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو ، جب رسول اللہ ﷺ کی مسجد کی نئے سے سے تعمیر کے وقت لوگوں نے ان کے بارے میں باتیں کیں ، یہ کہتے سنا : تم نے بہت بتایں کی ہیں ، حالانکہ میں نے رسول اللہ ﷺ کو یہ فرماتے ہوئے سنا تھا : ’’جس نے اللہ کے لیے مسجد بنائی ‘ ‘ بکیر نے کہا : میرا خیال ہے ، انہوں نے یہ کہا : ’’ اس سے وہ اللہ تعالیٰ کی رضا اور خوشنودی چاہتا ہے تو اللہ اس کے لیے جنت میں گھر بنائے گا ۔ ‘ ‘ احمد بن عیسیٰ نے اپنی روایت میں مثله في الجنة ’’جنت میں اس جیسا ( گھر ) ‘ ‘ کہا ۔",
                "urduNarrator": "ہارون بن سعید ایلی اور احمد بن عیسیٰ دونوں نے ہمیں حدیث بیان کی ۔ ( کہا : ) ہم سے ابن وہب نے حدیث بیان کی ، انہوں نے کہا : مجھے عمرو نے خبر دی کہ بکیر نے ان سے حدیث بیان کی ، انہیں عاصم بن عمر بن قتادہ نے حدیث بیان کی کہ انہوں نے عبید اللہ خولانی سے سنا ، وہ بیان کر رہے تھے کہ",
                "hadithArabic": "حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ، وَأَحْمَدُ بْنُ عِيسَى، قَالَا: حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو، أَنَّ بُكَيْرًا، حَدَّثَهُ أَنَّ عَاصِمَ بْنَ عُمَرَ بْنَ قَتَادَةَ، حَدَّثَهُ أَنَّهُ سَمِعَ عُبَيْدَ اللهِ الْخَوْلَانِيَّ، يَذْكُرُ أَنَّهُ سَمِعَ عُثْمَانَ بْنَ عَفَّانَ، عِنْدَ قَوْلِ النَّاسِ فِيهِ حِينَ بَنَى مَسْجِدَ الرَّسُولِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: إِنَّكُمْ قَدْ أَكْثَرْتُمْ، وَإِنِّي سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: مَنْ بَنَى مَسْجِدًا لِلَّهِ تَعَالَى - قَالَ بُكَيْرٌ: حَسِبْتُ أَنَّهُ قَالَ: يَبْتَغِي بِهِ وَجْهَ اللهِ - بَنَى اللهُ لَهُ بَيْتًا فِي الْجَنَّةِ «وَقَالَ ابْنُ عِيسَى فِي رِوَايَتِهِ» مِثْلَهُ فِي الْجَنَّةِ.",
                "headingArabic": "فَضْلِ بِنَاءِ الْمَسَاجِدِ وَالْحَثِّ عَلَيْهَا ‏",
                "headingUrdu": "مسجد بنانے کی فضیلت اور اس کی ترغیب",
                "headingEnglish": "The virtue of building masajid and encouragement to do so",
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8754,
                "hadithNumber": "1190",
                "englishNarrator": "Mahmud bin Labid ‌رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "When 'Uthman bin 'Affan ‌رضی ‌اللہ ‌عنہ intended to build the mosque (of the Prophet) the people did not approve of it. They liked that it should be kept in the same state. Thereupon he said: I heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) say: He who built a mosque for Allah, Allah would build a house for him like it in Paradise.",
                "hadithUrdu": "حضرت عثمان بن عفان ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے مسجد نبوی کو نئے سرے سے تعمیر کرنا چاہا تو لوگوں نے اسے پسند نہ کیا ، ان کی خواہش تھی کہ وہ اسے اس کی حالت پر رہنے دیں ، اس پر حضرت عثمان ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے فرمایا : میں نے رسول اللہ ﷺ کو فرماتے ہوئے سنا : ’’ جس شخص نے اللہ کی خاطر کوئی مسجد بنائی ، اللہ اس کے لیے جنت میں اس جیسا ( گھر ) تعمیر کر ے گا ۔ ‘ ‘",
                "urduNarrator": "ہم سے زہیر بن حرب اور محمد بن المثنیٰ نے بیان کیا - اور یہ قول ابن المثنیٰ کا ہے - انہوں نے کہا: ہم سے ضحاک بن مخلد نے بیان کیا، ہم سے عبد الحمید بن جعف نے بیان کیا، مجھ سے میرے والد نے بیان کیا،حضرت محمود بن لبید ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى - وَاللَّفْظُ لِابْنِ الْمُثَنَّى - قَالَا: حَدَّثَنَا الضَّحَّاكُ بْنُ مَخْلَدٍ، أَخْبَرَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ، حَدَّثَنِي أَبِي، عَنْ مَحْمُودِ بْنِ لَبِيدٍ، أَنَّ عُثْمَانَ بْنَ عَفَّانَ، أَرَادَ بِنَاءَ الْمَسْجِدِ، فَكَرِهَ النَّاسُ ذَلِكَ، فَأَحَبُّوا أَنْ يَدَعَهُ عَلَى هَيْئَتِهِ، فَقَالَ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ بَنَى مَسْجِدًا لِلَّهِ بَنَى اللهُ لَهُ فِي الْجَنَّةِ مِثْلَهُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8755,
                "hadithNumber": "1191",
                "englishNarrator": "Al-Aswad and 'Alqama reported:",
                "hadithEnglish": "We came to the house of 'Abdullah bin Mas'ud ‌رضی ‌اللہ ‌عنہ . He said: Have these people said prayer behind you? We said: No. He said: Then stand up and say prayer. He neither ordered us to say Adhan nor Iqama. We went to stand behind him. He caught hold of our hands and mode one of us stand on his right hand and the other on his left side. When we bowed, we placed our hands on our knees. He struck our hands and put his hands together, palm to palm, then put them between his thighs. When he completed the prayer he said. There would soon come your Amirs, who would defer prayers from their appointed time and would make such delay that a little time is left before sunset. So when you see them doing so, say prayer at its appointed time and then say prayer along with them as (Nafl), and when you are three, pray together (standing in one row), and when you are more than three, appoint one amongst you as your Imam. And when any one of you bows he must place his hands upon hie thighs and kneel down. and putting his palms together place (them within his thighs). I perceive as if I am seeing the gap between the fingers of the Messenger of Allah (may peace he upon him).",
                "hadithUrdu": "ہم عبد اللہ بن مسعود ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے گھر ان کی خدمت میں حاضر ہوئے تو وہ پوچھنے لگے : جو ( حکمران اور ان کے ساتھ تاخیر سے نماز پڑھنے والے ان کے پیروکار ) تم سے پیچھے ہیں ، انہوں نے نماز پڑھ لی ہے؟ ہم نے عرض کی : نہیں ۔ انہوں نے کہا : اٹھو اور نماز پڑھو ۔ انہوں نے ہمیں اذان اور اقامت کہنے کا حکم نہ دیا ہم ان کے پیچھے کھڑے ہونے لگے تو انہوں نے ہمارے ہاتھ پکڑ کر ایک کو اپنے دائیں اور دوسرے کو اپنے بائیں طرف کر دیا ۔ جب انہوں نے رکوع کیا تو ہم نے اپنے ہاتھ اپنے گھٹنوں پر رکھے ، انہوں نے ہمارے ہاتھوں پر ہلکا سا مارا اور اپنی دونوں ہتھیلیوں کو جوڑ کر اپنی دونوں رانوں کے درمیان رکھ لیا ۔ انہوں نے جب نماز پڑھ لی تو کہا : یقیناً آیندہ تمہارے ایسے حکمران ہوں گے جو نمازوں کو ان کے اوقات سے مؤخر کر یں گے اور ان کے اوقات کو مرنے والوں کو آخری جھلملاہٹ کی طرح تنگ کر دیں گے ۔ جب تم ان کو دیکھو کہ انہوں نے یہ ( کام شروع ) کر لیا ہے تو تم ( ہر ) نماز اس وقت کے پر پڑھ لینا اور ان کے ساتھ اپنی نماز کو نفل بنا لینا ۔ اور جب تم تین آدمی ہو تو اکٹھے کھڑے ہو کر نماز پڑھو اور جب تم تین زیادہ ہو تو تم میں سے ایک امام بن جائے اور جب تم میں سے کوئی رکوع کرے تو اپنے بازو اپنی رانوں پر پھیلا دے اور جھکے اور اپنی ہتھیلیاں جوڑ لے ، ( ایسا لگتا ہے ) جیسے میں ( اب بھی ) رسول اللہ ﷺ کی ( ایک دوسری میں ) پیوستہ انگلیوں کو دیکھ رہا ہوں ۔ اور ( انگلیاں پیوست کر کے ) انہیں دکھائیں ۔",
                "urduNarrator": "ہم سے محمد بن العلاء الحمدانی ابو کریب نے بیان کیا، انہوں نے کہا,ابو معاویہ نے ہمیں اعمش سے حدیث بیان کی ، انہوں نے ابراہیم سے اور انہوں نے اسود اور علقمہ سے روایت کی ، ان دونوں نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ الْهَمْدَانِيُّ أَبُو كُرَيْبٍ، قَالَ: حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الْأَسْوَدِ، وَعَلْقَمَةَ، قَالَا: أَتَيْنَا عَبْدَ اللهِ بْنَ مَسْعُودٍ فِي دَارِهِ، فَقَالَ: أَصَلَّى هَؤُلَاءِ خَلْفَكُمْ؟ فَقُلْنَا: لَا، قَالَ: فَقُومُوا فَصَلُّوا، فَلَمْ يَأْمُرْنَا بِأَذَانٍ وَلَا إِقَامَةٍ، قَالَ وَذَهَبْنَا لِنَقُومَ خَلْفَهُ، فَأَخَذَ بِأَيْدِينَا فَجَعَلَ أَحَدَنَا عَنْ يَمِينِهِ وَالْآخَرَ عَنْ شِمَالِهِ، قَالَ: فَلَمَّا رَكَعَ وَضَعْنَا أَيْدِيَنَا عَلَى رُكَبِنَا، قَالَ: فَضَرَبَ أَيْدِيَنَا وَطَبَّقَ بَيْنَ كَفَّيْهِ، ثُمَّ أَدْخَلَهُمَا بَيْنَ فَخِذَيْهِ، قَالَ: فَلَمَّا صَلَّى، قَالَ: «إِنَّهُ سَتَكُونُ عَلَيْكُمْ أُمَرَاءُ يُؤَخِّرُونَ الصَّلَاةَ عَنْ مِيقَاتِهَا، وَيَخْنُقُونَهَا إِلَى شَرَقِ الْمَوْتَى، فَإِذَا رَأَيْتُمُوهُمْ قَدْ فَعَلُوا ذَلِكَ، فَصَلُّوا الصَّلَاةَ لِمِيقَاتِهَا، وَاجْعَلُوا صَلَاتَكُمْ مَعَهُمْ سُبْحَةً، وَإِذَا كُنْتُمْ ثَلَاثَةً فَصَلُّوا جَمِيعًا، وَإِذَا كُنْتُمْ أَكْثَرَ مِنْ ذَلِكَ، فَلْيَؤُمَّكُمْ أَحَدُكُمْ، وَإِذَا رَكَعَ أَحَدُكُمْ فَلْيُفْرِشْ ذِرَاعَيْهِ عَلَى فَخِذَيْهِ، وَلْيَجْنَأْ، وَلْيُطَبِّقْ بَيْنَ كَفَّيْهِ، فَلَكَأَنِّي أَنْظُرُ إِلَى اخْتِلَافِ أَصَابِعِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَأَرَاهُمْ».",
                "headingArabic": "النَّدْبِ إِلَى وَضْعِ الأَيْدِي عَلَى الرُّكَبِ فِي الرُّكُوعِ وَنَسْخِ التَّطْبِيقِ ‏",
                "headingUrdu": "رکوع کے وقت ہاتھ گھٹنوں پر رکھنے کی سفارش، اور تبک کو منسوخ کرنا",
                "headingEnglish": "The recommendation to place the hands on the knees when bowing, and the abrogation of tatbiq",
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8756,
                "hadithNumber": "1192",
                "englishNarrator": "It was narrated from Alqamah and Al-Aswad that they entered upon Abdullah... a hadith similar to that of Muaviyah (no. 1191). According to the hadith of Ibn-e-Mushir and Jarir:",
                "hadithEnglish": "\"It is as if I can see the interlaced fingers of the messenger of Allah as was bowing.\"",
                "hadithUrdu": "مجھے ایسا محسوس ہوتا ہے جیسے میں رسول اللہ صلی اللہ علیہ وسلم کی انگلیوں کے درمیان کا فاصلہ دیکھ رہا ہوں جب آپ رکوع کر رہے تھے۔",
                "urduNarrator": "ہم سے منجاب بن الحارث التمیمی نے بیان کیا، کہا ہم سے ابن مشار نے بیان کیا، انہوں نے کہا کہ ہم سے عثمان بن ابی شیبہ نے بیان کیا، کہا کہ ہم سے جریر نے بیان کیا ,انہوں نے کہا: مجھ سے محمد بن رافع نے بیان کیا، ہم سے یحییٰ بن آدم نے بیان کیا، ہم سے مفضل نے بیان کیا، ان سب نے الاعمش کی سند سے، ابراہیم کی سند سے، علقمہ کی سند سے اور اسود سے۔ کہ انہوں نے ابو معاویہ کی حدیث کے معنی میں اور ابن مشار اور جریر کی حدیث میں ہے کہ",
                "hadithArabic": "وَحَدَّثَنَا مِنْجَابُ بْنُ الْحَارِثِ التَّمِيمِيُّ، أَخْبَرَنَا ابْنُ مُسْهِرٍ، ح قَالَ وَحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، ح قَالَ وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا مُفَضَّلٌ، كُلُّهُمْ عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، وَالأَسْوَدِ، أَنَّهُمَا دَخَلاَ عَلَى عَبْدِ اللَّهِ ‏.‏ بِمَعْنَى حَدِيثِ أَبِي مُعَاوِيَةَ ‏.‏ وَفِي حَدِيثِ ابْنِ مُسْهِرٍ وَجَرِيرٍ فَلَكَأَنِّي أَنْظُرُ إِلَى اخْتِلاَفِ أَصَابِعِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ رَاكِعٌ ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8757,
                "hadithNumber": "1193",
                "englishNarrator": "Alqama and Aswad reported that they went to 'Abdullah. He said:",
                "hadithEnglish": "Have (people) behind you said prayer? They said: Yes. He stood between them ('Alqama and Aswad). One was on his right aide and the other was on his left. We then bowed and placed our hands on our knees. He struck our hands and then putting his hands together, palm to palm, placed them between his thighs. When he completed the prayer he said: This is how the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) used to do.",
                "hadithUrdu": "جو تمہارے پیچھے ہیں انھوں نے نماز پڑھ لی ؟دونوں نے کہا : جی ہاں ۔ پھر وہ دونوں کے درمیان کھڑے ہوئے ‘ ان میں سےایک کو اپنی دائیں طرف اور دوسرے کو اپنی بائیں طرف ( کھڑا ) کیا پھر ہم نےرکوع کیاتو ہم اپنے ہاتھ اپنے گٹھنوں پر رکھے ‘ انھو ں نے ہمارے ہاتھوں پر ( ہلکا سا ) مارا ‘ پھر اپنے دونوں ہاتھ جوڑ لیے اور ان کو اپنی رانوں کے درمیان رکھا ‘ جب نماز پڑھ چکے تو کہا : رسول اللہ ﷺ نے اسی طرح کیا ۔",
                "urduNarrator": "ہم سے عبداللہ بن عبدالرحمٰن دارمی نے بیان کیا، کہا ہم سے عبید اللہ بن موسیٰ نے اسرائیل کے بارے میں بیان کیا،( اعمش ےکے بجائے ) منصور ابراھیم سے اور انھوں نے علقمہ اور اسود سے روایت کی کہ وہ دونوں حضرت عبد اللہ ( بن مسعود ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) کے ہاں حاضر ہوئے تو انھوں نے پوچھا",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا عُبَيْدُ اللهِ بْنُ مُوسَى، عَنْ إِسْرَائِيلَ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، وَالْأَسْوَدِ، أَنَّهُمَا دَخَلَا عَلَى عَبْدِ اللهِ، فَقَالَ: أَصَلَّى مَنْ خَلْفَكُمْ؟ قَالَ: نَعَمْ، فَقَامَ بَيْنَهُمَا، وَجَعَلَ أَحَدَهُمَا عَنْ يَمِينِهِ وَالْآخَرَ عَنْ شِمَالِهِ، ثُمَّ رَكَعْنَا، فَوَضَعْنَا أَيْدِيَنَا عَلَى رُكَبِنَا فَضَرَبَ أَيْدِيَنَا، ثُمَّ طَبَّقَ بَيْنَ يَدَيْهِ، ثُمَّ جَعَلَهُمَا بَيْنَ فَخِذَيْهِ، فَلَمَّا صَلَّى، قَالَ: هَكَذَا فَعَلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8758,
                "hadithNumber": "1194",
                "englishNarrator": "Mus'ab bin Sa'd reported:",
                "hadithEnglish": "I said prayer by the side of my father and placed my hands between my knees. My father said to me: Place your hands on your knees. I repeated that (the previous act) for the second time, and he struck at my hands and said: We have been forbidden to do so and have been commanded to place our palms on the knees.",
                "hadithUrdu": "میں نے نماز پڑھی۔ میرے والد، انہوں نے کہامیں نے اپنے دونوں ہاتھ اپنے گھٹنوں کے درمیان رکھے، میرے والد نے مجھ سے کہا: اپنے گھٹنوں پر ہاتھ مارو، اس نے کہا: پھر میں نے ایسا ہی کیا، اس نے میرے ہاتھ پر ہاتھ مارا اور کہا: اس کے بارے میں ہمیں ذلیل کیا جا رہا ہے، اور ہمیں حکم دیا گیا تھا۔ گھٹنوں پر ہتھیلیوں سے مارنا۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید اور ابو کامل الجہدری - اور لفظ قتیبہ ہے - ہم سے بیان کیا، کہا: ہم سے ابو عوانہ نے بیان کیا، انہوں نے ابو یعفور سے، انہوں نے مصعب بن سعد سے، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو كَامِلٍ الْجَحْدَرِيُّ - وَاللَّفْظُ لِقُتَيْبَةَ - قَالَا: حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي يَعْفُورٍ، عَنْ مُصْعَبِ بْنِ سَعْدٍ، قَالَ: صَلَّيْتُ إِلَى جَنْبِ أَبِي، قَالَ: وَجَعَلْتُ يَدَيَّ بَيْنَ رُكْبَتَيَّ، فَقَالَ لِي أَبِي: اضْرِبْ بِكَفَّيْكَ عَلَى رُكْبَتَيْكَ، قَالَ: ثُمَّ فَعَلْتُ ذَلِكَ مَرَّةً أُخْرَى، فَضَرَبَ يَدَيَّ وَقَالَ: إِنَّا نُهِينَا عَنْ هَذَا، وَأُمِرْنَا أَنْ نَضْرِبَ بِالْأَكُفِّ عَلَى الرُّكَبِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8759,
                "hadithNumber": "1195",
                "englishNarrator": "This hadith has been narrated by Abu Ya'fur with the same chain of transmitters up to these words:",
                "hadithEnglish": "We have been forbidden from it and no mention of that has been made what follows it.",
                "hadithUrdu": "پس ہم نے اس سے منع کیا اور اس کے بعد آنے والی چیزوں کا ذکر نہیں کیا۔",
                "urduNarrator": "ہم سے خلف بن ہشام نے بیان کیا، کہا ہم سے ابو الاحواس نے بیان کیا، انہوں نے کہا: ہم سے ابن ابی عمر نے بیان کیا، ان سے سفیان نے بیان کیا، ان دونوں سے ابو یعفور نے بیان کیا، اس آیت کے ساتھ آپ نے اپنا یہ قول پکارا",
                "hadithArabic": "حَدَّثَنَا خَلَفُ بْنُ هِشَامٍ، حَدَّثَنَا أَبُو الْأَحْوَصِ، ح قَالَ: وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، كِلَاهُمَا عَنْ أَبِي يَعْفُورٍ، بِهَذَا الْإِسْنَادِ إِلَى قَوْلِهِ: فَنُهِينَا عَنْهُ، وَلَمْ يَذْكُرَا مَا بَعْدَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8760,
                "hadithNumber": "1196",
                "englishNarrator": "Ibn Sa'd reported:",
                "hadithEnglish": "I bowed and my hands were in this state, i.e. they were put together, palm to palm, and were placed between his thighs. My father said: We used to do like this but were later on commanded to place them on the knees.",
                "hadithUrdu": "اس نے رکوع کیا، پھر میں نے کہا: اس طرح کے ہاتھ - یعنی آپ صلی اللہ علیہ وسلم نے انہیں اپنے ساتھ بند کیا اور اپنی رانوں کے درمیان رکھ لیا - اور میرے والد نے کہا: \"ہم ایسا کرتے تھے، پھر ہمیں گھٹنے ٹیکنے کا حکم دیا گیا۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے وکیع نے بیان کیا، انہوں نے اسماعیل بن ابی خالد سے، وہ زبیر بن عدی سے، وہ مصعب بن سعد سے، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، عَنِ الزُّبَيْرِ بْنِ عَدِيٍّ، عَنْ مُصْعَبِ بْنِ سَعْدٍ، قَالَ: رَكَعْتُ فَقُلْتُ بِيَدَيَّ هَكَذَا - يَعْنِي طَبَّقَ بِهِمَا وَوَضَعَهُمَا بَيْنَ فَخِذَيْهِ - فَقَالَ أَبِي: «قَدْ كُنَّا نَفْعَلُ هَذَا، ثُمَّ أُمِرْنَا بِالرُّكَبِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8761,
                "hadithNumber": "1197",
                "englishNarrator": "Mus'ab bin Sa'd bin Abu Waqqas reported:",
                "hadithEnglish": "I said prayer by the side of my father. When I bowed I intertwined my fingers and placed them between my knees. He struck my hands. When he completed the prayer he said: We used to do that but then were commanded to lift (our palms) to the knees.",
                "hadithUrdu": "میں نے نماز پڑھی۔ اپنے والد کے پاس، اور جب میں گھٹنے ٹیکتا تو میں نے اپنی انگلیاں جوڑ کر اپنے گھٹنوں کے درمیان رکھ دیں، آپ نے میرے ہاتھ مارے، اور جب آپ صلی اللہ علیہ وسلم نے دعا کی تو فرمایا: ہم یہ کر رہے تھے، پھر ہمیں گھٹنوں  ( پرہاتھ رکھنے ) کا حکم دیا گیا ۔",
                "urduNarrator": "ہم سے الحکم بن موسیٰ نے بیان کیا، کہا ہم سے عیسیٰ بن یونس نے بیان کیا، کہا ہم سے اسماعیل بن ابی خالد نے بیان کیا، ان سے زبیر بن عدی نے بیان کیا، وہ مصعب بن سعد بن ابی وقّاص  سے، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنِي الْحَكَمُ بْنُ مُوسَى، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ، عَنِ الزُّبَيْرِ بْنِ عَدِيٍّ، عَنْ مُصْعَبِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ، قَالَ: صَلَّيْتُ إِلَى جَنْبِ أَبِي، فَلَمَّا رَكَعْتُ شَبَّكْتُ أَصَابِعِي وَجَعَلْتُهُمَا بَيْنَ رُكْبَتَيَّ، فَضَرَبَ يَدَيَّ، فَلَمَّا صَلَّى قَالَ: «قَدْ كُنَّا نَفْعَلُ هَذَا، ثُمَّ أُمِرْنَا أَنْ نَرْفَعَ إِلَى الرُّكَبِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8762,
                "hadithNumber": "1198",
                "englishNarrator": "Tawus reported رضی اللہ عنہما :",
                "hadithEnglish": "We asked Ibn Abbas about sitting on one's buttocks (in prayer). (ala alqad mein) He said: It is sunnah. We said to him: We find it a sort of cruelty to the foot. Ibn 'Abbas said: It is the sunnah of your Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ).",
                "hadithUrdu": "ہم نے ابن عباس رضی اللہ عنہماسےدونوں پیروں پربیٹھنے کے بارے میں پو چھا تو انھوں نے جواب دیا : یہ سنت ہے ۔ ہم نے ان سے عرض کی : ہمارا تو خیال ہے کہ یہ انسان ( یا اگر را کی زیرکے ساتھ رجل پڑھا جائے تو پاؤں ) پرزیاتی ہے ۔ ابن عباسﷺنے کہا : ( نہیں ) بلکہ یہ تمہارے بنی ﷺکی سنت ہے ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے محمد بن بکر نے بیان کیا، انہوں نے کہا: ہم سے حسن الحلوانی نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا - اور وہ الفاظ میں ایک جیسے تھے - انہوں نے کہا کہ ہم سے ابن جریج نے بیان کیا، مجھ سے ابو الزبیر نے بیان کیا،حضرت طاوس بیان کرتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ، ح قَالَ: وَحَدَّثَنَا حَسَنٌ الْحُلْوَانِيُّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ - وَتَقَارَبَا فِي اللَّفْظِ - قَالَا: جَمِيعًا أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ طَاوُسًا يَقُولُ: قُلْنَا لِابْنِ عَبَّاسٍ فِي الْإِقْعَاءِ عَلَى الْقَدَمَيْنِ، فَقَالَ: «هِيَ السُّنَّةُ»، فَقُلْنَا لَهُ: إِنَّا لَنَرَاهُ جَفَاءً بِالرَّجُلِ فَقَالَ ابْنُ عَبَّاسٍ: «بَلْ هِيَ سُنَّةُ نَبِيِّكَ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": "جَوَازِ الإِقْعَاءِ عَلَى الْعَقِبَيْنِ ‏",
                "headingUrdu": "ایڑیوں کے بل بیٹھنے کی اجازت",
                "headingEnglish": "The permissibility of squatting on the heels",
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8763,
                "hadithNumber": "1199",
                "englishNarrator": "Mu'awiya bin al-Hakam ‌رضی ‌اللہ ‌عنہ ‌said:",
                "hadithEnglish": "While I was praying with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), a man in the company sneezed. I said: Allah have mercy on you! The people stared at me with disapproving looks, so I said: Woe be upon me, why is it that you stare at me? They began to strike their hands on their thighs, and when I saw them urging me to observe silence (I became angry) but I said nothing. When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had said the prayer (and I declare that neither before him nor after him have I seen a leader who gave better instruction than he for whom I would give my father and mother as ransom). I swear that he did not scold, beat or revile me but said: Talking to persons is not fitting during the prayer, for it consists of glorifying Allah, declaring his Greatness. and recitation of the Qur'an or words to that effect. I said: Messenger of Allah. I was till recently a pagan, but Allah has brought Islam to us; among us there are men who have recourse to Kahins. He said, Do not have recourse to them. I said. There are men who take omens. That is something which they find in their breasts, but let it not turn their way (from freedom of action). I said: Among us there are men who draw lines. He said: There was a prophet who drew lines, so if they do it as they did, that is allowable. I had a maid-servant who tended goats by the side of Uhud and Jawwaniya. One day I happened to pass that way and found that a wolf had carried a goat from her flock. I am after all a man from the posterity of Adam. I felt sorry as they (human beings) feel sorry. So I slapped her. I came to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and felt (this act of mine) as something grievous I said: Messenger of Allah, should I not grant her freedom? He (the Holy Prophet) said: Bring her to me. So I brought her to him. He said to her: Where is Allah? She said: He is in the heaven. He said: Who am I? She said: Thou art the Messenger of Allah. He said: Grant her freedom, she is a believing woman.",
                "hadithUrdu": "میں رسول اللہ ﷺ کے ساتھ نماز پڑ ھ رہاتھا کہ لوگوں میں سے ایک آدمی کو چھینک آئی تو میں نے کہا : یرحمک اللہ’’اللہ تجھ پر رحم کرے ۔ ‘ ‘ لوگوں نے مجھے گھورنا شروع کر دیا ۔ میں نے ( دل میں ) کہا : میری ماں مجھے گم پائے ‘ تم سب کو کیا ہو گیا؟ کہ مجھے گھور رہے ہو پھروہ اپنے ہاتھ اپنی رانوں پر مارنے لگے ۔ جب میں نے انھیں دیکھا کہ وہ مجھے چپ کرا رہے ہیں ( تو مجھے عجیب لگا ) لیکن میں خاموش رہا ‘ جب رسو ل اللہ نماز سے فارغ ہوئے ‘ میرے ماں باپ آپ پرقربان !میں نے آپ سےپہلے اور آپکے بعدآپ سے بہتر کوئی معلم ( سکھانےوالا ) نہیں دیکھا!اللہ کی قسم !نہ تو آپنے مجھے ڈانٹا ‘ نہ مجھے مارا اور نہ مجھے برا بھلا کہا ۔ آپنے فرمایا : ’’یہ نماز ہے اس میں کسی قسم کی گفتگو روانہیں ہے ‘ یہ تو بس تسبیح و تکبیر اور قرآن کی تلاوت ہے ۔ ‘ ‘ یا جیسے رسو ل اللہ ﷺنے فرمایا ۔ میں نے عرض کی اے اللہ کے رسول اللہ !ابھی تھوڑا عرصہ پہلے جاہلیت میں تھا ‘ اور اللہ نے اسلام سے نوازدیا ہے ‘ ہم میں سے کچھ لوگ ہیں جو کاہنوں ( پیش گوئی کرنے والے ) کے پاس جاتے ہیں ۔ آپنے فرمایا : ’’تم ان کے پاس نہ جانا ۔ ‘ ‘ میں نے عرض کی : ہم میں سے کچھ لوگ ایسے ہیں جو بدشگونی لیتےہیں ۔ آپن فرمایا : ’’یہ ایسی بات ہے جو وہ اپنے دلوں میں پاتے ہیں ( ایک طرح کا وہم ہے ) یہ ( وہم ) انھیں ( ان کے ) کسی کام سے نہ روکے ۔ ‘ ‘ ( محمد ) ابن صباح نے روایت کی : ’’یہ تمہیں کسی صورت ( اپنے کاموں سے ) نہ رزکے ۔ ‘ ‘ میں نے عرض کی : ہم میں سے کچھ لوگ لکیریں کھینچھنے ہیں ۔ ‘ ‘ آپنے فرمایا : ’’سابقہ انبیاء میں سے ایک بنی لکیریں کھینچا کرتے تھے تو جس کی لکیریں ان کے موافق ہو جائیں وہ تو صحیح ہو سکتی ہیں ‘ ‘ ( لیکن اب اس کا جاننا مشکل ہے ۔ ) ( معاویہ بن حکم ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ) کہا : میری ایک لونڈی تھی جو احد اور جوانیہ کے اطراف میں میری بکریا چراتی تھی ‘ ایک دن میں اس طرف جاانکلاتو بھیڑیا اس کی بکری لے جا چکا تھا ۔ میں بھی بنی آدم میں سے ایک آدمی ہوں ‘ مجھے بھی اسی طرح افسوس ہوتا ہے جس طرح ان کو ہوتا ہے ( مجھے صبر کرناچاہیے تھا ) لیکن میں نے اسے زور سے ایک تھپڑجڑدیا اس کے بعد رسول اللہﷺکی خدمت میں حاضر ہو اآپنے میری اس حرکت کو میرے لیے بڑی ( غلط ) حرکت قرار دیا ۔ میں نے عرض کی : اے اللہ کے رسول !کیا میں اسے آزادنہ کردوں؟آپ نےفرمایا : ’’اسے میرےپاس لے آؤ ۔ ‘ ‘ میں اسے لےکر آپ کےپاس حاضر ہوا ، آپ نےاس سے پوچھا : ’’اللہ کہا ں ہے؟ ‘ ‘ اس نےکہا : آسمان میں ۔ آپ نےپوچھا : ’’میں کون ہوں؟ ‘ ‘ اس نےکہا : آپ اللہ کےرسول ہیں ۔ تو آپ نے فرمایا : ’’اسے آزاد کردو ، یہ مومنہ ہے.",
                "urduNarrator": "ہم سے ابو جعفرمحمد بن صباح اور ابو بکر بن ابی شیبہ نے حدیث بیان کی ۔ حدیث کے لفظوں میں بھی دونوں ایک دوسرے کے قریب ہیں ۔ دونوں نے کہا : ہم سے اسماعیل بن ابراہیم نے حدیث بیان کی ‘ انھوں نے حجاج صوّاف سے انھوں نے یحییٰ بن ابی کثیر سے ‘ انھوں نے ہلال بن ابی میمونہ سے ‘ انھوں نے عطاء بن یسار سے اور انھوں نے حضرت معاویہ بن ابی حکم سلمی ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو جَعْفَرٍ مُحَمَّدُ بْنُ الصَّبَّاحِ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، - وَتَقَارَبَا فِي لَفْظِ الْحَدِيثِ - قَالَا: حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ حَجَّاجٍ الصَّوَّافِ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ هِلَالِ بْنِ أَبِي مَيْمُونَةَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ مُعَاوِيَةَ بْنِ الْحَكَمِ السُّلَمِيِّ، قَالَ: بَيْنَا أَنَا أُصَلِّي مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، إِذْ عَطَسَ رَجُلٌ مِنَ الْقَوْمِ، فَقُلْتُ: يَرْحَمُكَ اللهُ فَرَمَانِي الْقَوْمُ بِأَبْصَارِهِمْ، فَقُلْتُ: وَاثُكْلَ أُمِّيَاهْ، مَا شَأْنُكُمْ؟ تَنْظُرُونَ إِلَيَّ، فَجَعَلُوا يَضْرِبُونَ بِأَيْدِيهِمْ عَلَى أَفْخَاذِهِمْ، فَلَمَّا رَأَيْتُهُمْ يُصَمِّتُونَنِي لَكِنِّي سَكَتُّ، فَلَمَّا صَلَّى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَبِأَبِي هُوَ وَأُمِّي، مَا رَأَيْتُ مُعَلِّمًا قَبْلَهُ وَلَا بَعْدَهُ أَحْسَنَ تَعْلِيمًا مِنْهُ، فَوَاللهِ، مَا كَهَرَنِي وَلَا ضَرَبَنِي وَلَا شَتَمَنِي، قَالَ: «إِنَّ هَذِهِ الصَّلَاةَ لَا يَصْلُحُ فِيهَا شَيْءٌ مِنْ كَلَامِ النَّاسِ، إِنَّمَا هُوَ التَّسْبِيحُ وَالتَّكْبِيرُ وَقِرَاءَةُ الْقُرْآنِ» أَوْ كَمَا قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قُلْتُ: يَا رَسُولَ اللهِ، إِنِّي حَدِيثُ عَهْدٍ بِجَاهِلِيَّةٍ، وَقَدْ جَاءَ اللهُ بِالْإِسْلَامِ، وَإِنَّ مِنَّا رِجَالًا يَأْتُونَ الْكُهَّانَ، قَالَ: «فَلَا تَأْتِهِمْ» قَالَ: وَمِنَّا رِجَالٌ يَتَطَيَّرُونَ، قَالَ: ذَاكَ شَيْءٌ يَجِدُونَهُ فِي صُدُورِهِمْ، فَلَا يَصُدَّنَّهُمْ - قَالَ ابْنُ الصَّبَّاحِ: فَلَا يَصُدَّنَّكُمْ - قَالَ قُلْتُ: وَمِنَّا رِجَالٌ يَخُطُّونَ، قَالَ: «كَانَ نَبِيٌّ مِنَ الْأَنْبِيَاءِ يَخُطُّ، فَمَنْ وَافَقَ خَطَّهُ فَذَاكَ» قَالَ: وَكَانَتْ لِي جَارِيَةٌ تَرْعَى غَنَمًا لِي قِبَلَ أُحُدٍ وَالْجَوَّانِيَّةِ، فَاطَّلَعْتُ ذَاتَ يَوْمٍ فَإِذَا الذِّيبُ قَدْ ذَهَبَ بِشَاةٍ مِنْ غَنَمِهَا، وَأَنَا رَجُلٌ مِنْ بَنِي آدَمَ، آسَفُ كَمَا يَأْسَفُونَ، لَكِنِّي صَكَكْتُهَا صَكَّةً، فَأَتَيْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَعَظَّمَ ذَلِكَ عَلَيَّ، قُلْتُ: يَا رَسُولَ اللهِ أَفَلَا أُعْتِقُهَا؟ قَالَ: «ائْتِنِي بِهَا» فَأَتَيْتُهُ بِهَا، فَقَالَ لَهَا: «أَيْنَ اللهُ؟» قَالَتْ: فِي السَّمَاءِ، قَالَ: «مَنْ أَنَا؟» قَالَتْ: أَنْتَ رَسُولُ اللهِ، قَالَ: «أَعْتِقْهَا، فَإِنَّهَا مُؤْمِنَةٌ».",
                "headingArabic": "تَحْرِيمِ الْكَلاَمِ فِي الصَّلاَةِ وَنَسْخِ مَا كَانَ مِنْ إِبَاحَتِهِ ‏",
                "headingUrdu": "نماز کے دوران بولنے کی ممانعت، اور اس کی سابقہ ​​اجازت کا منسوخ ہونا",
                "headingEnglish": "The prohibition of speaking during the prayer, and the abrogation of its former permissibility",
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 8451,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=338",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=336",
                "label": "336",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=337",
                "label": "337",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=338",
                "label": "338",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=339",
                "label": "339",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=340",
                "label": "340",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=341",
                "label": "341",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=342",
                "label": "342",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=340",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=340",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=338",
        "to": 8475,
        "total": 40465
    }
}