{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 484,
        "data": [
            {
                "id": 12364,
                "hadithNumber": "4801",
                "englishNarrator": "It has been narrated (through a different chain of tmnamitters) on the authority of Umm Salama رضی اللہ عنہا (wife of the Holy Prophet):",
                "hadithEnglish": "He said: Amirs will be appointed over you, and you will find them doing good as well as bad deeds. One who hates their bad deeds is absolved from blame. One who disapproves of their bad deeds is (also) safe (so far as Divine wrath is concerned). But one who approves of their bad deeds and imitates them (is doomed). People asked: Messenger of Allah, shouldn't we fight against them? He replied: No, as long as they say their prayer. ( Hating and disapproving refers to liking and disliking from the heart.)",
                "hadithUrdu": "آپ نے فرمایا : \" تم پر ایسے امیر لگائے جائیں گے جن میں تم اچھائیاں بھی دیکھو گے اور برائیاں بھی ، جس نے ( برے کاموں کو ) ناپسند کیا ، وہ بری ہو گیا ، جس نے انکار کیا وہ بچ گیا ، مگر جس نے پسند کیا اور پیچھے لگا ( وہ بری ہوا نہ بچ سکا ۔ ) \" صحابہ نے عرض کی : یا رسول اللہ! کیا ہم ان سے لڑائی نہ کریں ، آپ نے فرمایا : \" نہیں ، جب تک وہ نماز پڑھتے رہیں ۔ \" آپ صلی اللہ علیہ وسلم کا مقصد تھا جس نے دل سے ناپسند کیا اور دل سے برا جانا.",
                "urduNarrator": "مجھ سے ابو غسان المسمعی اور محمد بن بشار نے معاذ کی سند سے بیان کیا ہے اور ہم سے معاذ نے بیان کیا ہے اور وہ ان کے بیٹے ہیں, \r\n ہشام دستوائی نے قتادہ سے روایت کی ، کہا : ہمیں حسن نے ضبہ بن محصب عنزی سے حدیث بیان کی ، انہوں نے نبی صلی اللہ علیہ وسلم کی اہلیہ محترمہ حضرت ام سلمہ رضی اللہ عنہا سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنِي أَبُو غَسَّانَ الْمِسْمَعِيُّ، وَمُحَمَّدُ بْنُ بَشَّارٍ، جَمِيعًا عَنْ مُعَاذٍ، وَاللَّفْظُ لِأَبِي غَسَّانَ، حَدَّثَنَا مُعَاذٌ وَهُوَ ابْنُ هِشَامٍ الدَّسْتَوَائِيُّ، حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، حَدَّثَنَا الْحَسَنُ، عَنْ ضَبَّةَ بْنِ مِحْصَنٍ الْعَنَزِيِّ، عَنْ أُمِّ سَلَمَةَ، زَوْجِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: «إِنَّهُ يُسْتَعْمَلُ عَلَيْكُمْ أُمَرَاءُ، فَتَعْرِفُونَ وَتُنْكِرُونَ، فَمَنْ كَرِهَ فَقَدْ بَرِئَ، وَمَنْ أَنْكَرَ فَقَدْ سَلِمَ، وَلَكِنْ مَنْ رَضِيَ وَتَابَعَ»، قَالُوا: يَا رَسُولَ اللهِ، أَلَا نُقَاتِلُهُمْ؟ قَالَ: «لَا، مَا صَلَّوْا»، أَيْ مَنْ كَرِهَ بِقَلْبِهِ وَأَنْكَرَ بِقَلْبِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12365,
                "hadithNumber": "4802",
                "englishNarrator": "It was narrated that Umm Salamah said:",
                "hadithEnglish": "\"The Messenger of Allah ﷺ said: \"a similar report (as no. 4801), except that he said: \"Whoever object to (their bad deeds) will be free of blame, and whoever dislikes (their bad deeds) will also be safe.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے فرمایا : \" سابقہ حدیث کی طرح ، البتہ اس حدیث میں یہ الفاظ ہیں  \" جس نے انکار کیا ، وہ بری ہو گیا اور جس نے ناپسند کیا ، وہ بچ گیا.\"",
                "urduNarrator": "مجھ سے ابو الربیع العتکی نے بیان کیا، انہوں نے کہا:  حماد بن زید نے کہا : ہمیں معلیٰ بن زیاد اور ہشام نے حسن سے حدیث بیان کی ، انہوں نے ضبہ بن محصن سے ، انہوں نے حضرت ام سلمہ رضی اللہ عنہا سے روایت کی ، کہا",
                "hadithArabic": "وحَدَّثَنِي أَبُو الرَّبِيعِ الْعَتَكِيُّ، حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ، حَدَّثَنَا الْمُعَلَّى بْنُ زِيَادٍ، وَهِشَامٌ، عَنِ الْحَسَنِ، عَنْ ضَبَّةَ بْنِ مِحْصَنٍ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِ ذَلِكَ، غَيْرَ أَنَّهُ قَالَ: «فَمَنْ أَنْكَرَ فَقَدْ بَرِئَ، وَمَنْ كَرِهَ فَقَدْ سَلِمَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12366,
                "hadithNumber": "4803",
                "englishNarrator": "It was narrated that Umm Salamah said:",
                "hadithEnglish": "The Messenger of Allah ﷺ said... \"a similar report (as no. 4801), except for the words: \"...but whoever excepts and follows\" which he (the sub-narrator) did not mention.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" پھر اسی کے مانند بیان کیا ، سوائے ان الفاظ کے : \" جس نے پسند کیا اور پیچھے لگا \" یہ الفاظ بیان نہیں کیے.",
                "urduNarrator": "ہم سے حسن بن ربیع البجلی نے بیان کیا, ابن مبارک نے ہشام سے ، انہوں نے حسن سے ، انہوں نے ضبہ بن محصن سے ، انہوں نے حضرت ام سلمہ رضی اللہ عنہا سے روایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنَاهُ حَسَنُ بْنُ الرَّبِيعِ الْبَجَلِيُّ، حَدَّثَنَا ابْنُ الْمُبَارَكِ، عَنْ هِشَامٍ، عَنِ الْحَسَنِ، عَنْ ضَبَّةَ بْنِ مِحْصَنٍ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ مِثْلَهُ، إِلَّا قَوْلَهُ: «وَلَكِنْ مَنْ رَضِيَ وَتَابَعَ» لَمْ يَذْكُرْهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12367,
                "hadithNumber": "4804",
                "englishNarrator": "It has been narrated on the authority of 'Auf bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: The best of your rulers are those whom you love and who love you, who invoke God's blessings upon you and you invoke His blessings upon them. And the worst of your rulers are those whom you hate and who hate you and whom you curse and who curse you. It was asked (by those present): Shouldn't we overthrow them with the help of the sword? He said: No, as long as they establish prayer among you. If you then find anything detestable in them. You should hate their administration, but do not withdraw yourselves from their obedience.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" تمہارے بہترین امام ( خلیفہ ) وہ ہیں جن سے تم محبت کرو اور وہ تم سے محبت کریں ، تم ان کے لیے دعا کرو اور وہ تمہارے لیے دعا کریں اور تمہارے بدترین امام وہ ہیں جن سے تم بغض رکھو اور وہ تم سے بغض رکھیں ، تم ان پر لعنت کرو اور وہ تم پر لعنت کریں ۔ \" عرض کی گئی : اللہ کے رسول! کیا ہم ان کو تلوار کے زور سے پھینک ( ہٹا ) نہ دیں؟ آپ نے فرمایا : \" نہیں ، جب تک کہ وہ تم میں نماز قائم کرتے رہیں اور جب تم اپنے حکمرانوں میں کوئی ایسی چیز دیکھو جسے تم ناپسند کرتے ہو تو اس کے عمل کو ناپسند کرو اور اس کی اطاعت سے دستکش نہ ہو.",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم الحنظَلی نے بیان کیا، کہا ہم سے عیسیٰ بن یونس نے بیان کیا، کہا ہم سے الاوزاعی نے بیان کیا, یزید بن یزید بن جابر نے رُزیق بن حیان سے ، انہوں نے مسلم بن قرظہ سے ، انہوں نے حضرت عوف بن مالک رضی اللہ عنہ سے ، انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا الْأَوْزَاعِيُّ، عَنْ يَزِيدَ بْنِ يَزِيدَ بْنِ جَابِرٍ، عَنْ رُزَيْقِ بْنِ حَيَّانَ، عَنْ مُسْلِمِ بْنِ قَرَظَةَ، عَنْ عَوْفِ بْنِ مَالِكٍ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «خِيَارُ أَئِمَّتِكُمُ الَّذِينَ تُحِبُّونَهُمْ وَيُحِبُّونَكُمْ، وَيُصَلُّونَ عَلَيْكُمْ وَتُصَلُّونَ عَلَيْهِمْ، وَشِرَارُ أَئِمَّتِكُمُ الَّذِينَ تُبْغِضُونَهُمْ وَيُبْغِضُونَكُمْ، وَتَلْعَنُونَهُمْ وَيَلْعَنُونَكُمْ»، قِيلَ: يَا رَسُولَ اللهِ، أَفَلَا نُنَابِذُهُمْ بِالسَّيْفِ؟ فَقَالَ: «لَا، مَا أَقَامُوا فِيكُمُ الصَّلَاةَ، وَإِذَا رَأَيْتُمْ مِنْ وُلَاتِكُمْ شَيْئًا تَكْرَهُونَهُ، فَاكْرَهُوا عَمَلَهُ، وَلَا تَنْزِعُوا يَدًا مِنْ طَاعَةٍ.",
                "headingArabic": "خِيَارِ الأَئِمَّةِ وَشِرَارِهِمْ ‏‏",
                "headingUrdu": "بہترین اور بدترین حکمران",
                "headingEnglish": "The best and worst of rulers",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12368,
                "hadithNumber": "4805",
                "englishNarrator": "It has been narrated on the authority of Auf bin Malik al-Ashja'i رضی اللہ عنہ who said:",
                "hadithEnglish": "He heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) say: The best of your rulers are those whom you love and who love you, upon whom you invoke God's blessings and who invoke His blessing upon you. And the worst of your rulers are those whom you hate and who hate you, who curse you and whom you curse. (Those present) said: Shouldn't we overthrow them at this? He said: No, as long as they establish prayer among you. No, as long as they establish prayer among you. Mind you! One who has a governor appointed over him and he finds that the governor indulges in an act of disobedience to God, he should condemn the governor's act, in disobedience to God, but should not withdraw himself from his obedience. Ibn Jabir رضی اللہ عنہ said: Ruzaiq narrated to me this hadith. I asked him: Abu Miqdam, have you heard it from Muslim bin Qaraza or did he describe it to you and he heard it from 'Auf (bin Malik) رضی اللہ عنہ and he transmitted this tradition of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ )? Upon this Ruzaiq sat upon his knees and facing the Qibla said: By Allah, besides Whom there is no other God, I heard it from Muslim bin Qaraza and he said that te had heard it from Auf (bin Malik) and he said that he had heard it from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ).",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : \"\" تمہارے بہترین امام ( حکمران ) وہ ہیں جن سے تم محبت کرو اور وہ تم سے محبت کریں ، تم ان کے لیے دعا کرو اور وہ تمہارے لیے دعا کریں ۔ اور تمہارے بدترین امام وہ ہیں جن سے تم بغض رکھو اور وہ تم سے بغض رکھیں اور تم ان پر لعنت کرو اور وہ تم پر لعنت کریں ۔ \"\" ( حضرت عوف بن مالک رضی اللہ عنہ نے ) کہا : صحابہ نے عرض کی : کیا ہم ایسے موقع پر ان کا ڈٹ کر مقابلہ نہ کریں؟ آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" نہیں ، جب تک وہ تم میں نماز قائم کرتے رہیں ، نہیں ، جب تک وہ تم میں نماز قائم کرتے رہیں ، سن رکھو! جس پر کسی شخص کو حاکم بنایا گیا ، پھر اس نے اس حاکم کو اللہ کی کسی معصیت میں مبتلا دیکھا تو وہ اللہ کی اس معصیت کو برا جانے اور اس کی اطاعت سے ہرگز ہاتھ نہ کھینچے ۔ \"\" ابن جابر نے کہا : میں نے رزیق سے ، جب انہوں نے مجھے یہ حدیث بیان کی ، پوچھا : ابو مقدام! میں تم کو اللہ کی قسم دیتا ہوں ، واقعی انہوں نے یہ حدیث آپ کو بیان کی ، یا آپ نے مسلم بن قرظہ سے سنی جبکہ وہ کہہ رہے تھے کہ انہوں نے عوف ( بن مالک ) رضی اللہ عنہ سے سنی اور وہ یہ کہہ رہے تھے : میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا؟ کہا : تو وہ ( رزیق ) دو زانو بیٹھ گئے اور قبلے کی طرف منہ کر لیا اور کہا : اس ذات کی قسم جس کے سوا کوئی عبادت کے لائق نہیں! میں نے یہ حدیث مسلم بن قرظہ سے سنی ، وہ کہہ رہے تھے : میں نے عوف بن مالک رضی اللہ عنہ کو یہ کہتے ہوئے سنا ، وہ کہہ رہے تھے : میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا.",
                "urduNarrator": "داود بن رُشید نے کہا : ہمیں ولید بن مسلم نے حدیث سنائی ، کہا : ہمیں عبدالرحمٰن بن یزید بن جابر نے حدیث بیان کی ، کہا : مجھے بنو فزارہ کے آزاد کردہ غلام رزیق بن حیان نے خبر دی کہ انہوں نے عوف بن مالک اشجعی رضی اللہ عنہ کے چچا زاد مسلم بن قرظہ سے سنا ، وہ کہہ رہے تھے : میں نے حضرت عوف بن مالک اشجعی رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے",
                "hadithArabic": "حَدَّثَنَا دَاوُدُ بْنُ رُشَيْدٍ، حَدَّثَنَا الْوَلِيدُ يَعْنِي ابْنَ مُسْلِمٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ يَزِيدَ بْنِ جَابِرٍ، أَخْبَرَنِي مَوْلَى بَنِي فَزَارَةَ، وَهُوَ رُزَيْقُ بْنُ حَيَّانَ، أَنَّهُ سَمِعَ مُسْلِمَ بْنَ قَرَظَةَ - ابْنَ عَمِّ عَوْفِ بْنِ مَالِكٍ الْأَشْجَعِيِّ - يَقُولُ: سَمِعْتُ عَوْفَ بْنَ مَالِكٍ الْأَشْجَعِيَّ، يَقُولُ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «خِيَارُ أَئِمَّتِكُمُ الَّذِينَ تُحِبُّونَهُمْ وَيُحِبُّونَكُمْ، وَتُصَلُّونَ عَلَيْهِمْ وَيُصَلُّونَ عَلَيْكُمْ، وَشِرَارُ أَئِمَّتِكُمُ الَّذِينَ تُبْغِضُونَهُمْ وَيُبْغِضُونَكُمْ، وَتَلْعَنُونَهُمْ وَيَلْعَنُونَكُمْ»، قَالُوا: قُلْنَا: يَا رَسُولَ اللهِ، أَفَلَا نُنَابِذُهُمْ عِنْدَ ذَلِكَ؟ قَالَ: «لَا، مَا أَقَامُوا فِيكُمُ الصَّلَاةَ، لَا، مَا أَقَامُوا فِيكُمُ الصَّلَاةَ، أَلَا مَنْ وَلِيَ عَلَيْهِ وَالٍ، فَرَآهُ يَأْتِي شَيْئًا مِنْ مَعْصِيَةِ اللهِ، فَلْيَكْرَهْ مَا يَأْتِي مِنْ مَعْصِيَةِ اللهِ، وَلَا يَنْزِعَنَّ يَدًا مِنْ طَاعَةٍ»، قَالَ ابْنُ جَابِرٍ: فَقُلْتُ: - يَعْنِي لِرُزَيْقٍ - حِينَ حَدَّثَنِي بِهَذَا الْحَدِيثِ: آللَّهِ، يَا أَبَا الْمِقْدَامِ، لَحَدَّثَكَ بِهَذَا، أَوْ سَمِعْتَ هَذَا مِنْ مُسْلِمِ بْنِ قَرَظَةَ يَقُولُ: سَمِعْتُ عَوْفًا، يَقُولُ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ؟ قَالَ: فَجَثَا عَلَى رُكْبَتَيْهِ وَاسْتَقْبَلَ الْقِبْلَةَ، فَقَالَ: إِي وَاللهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ، لَسَمِعْتُهُ مِنْ مُسْلِمِ بْنِ قَرَظَةَ، يَقُولُ: سَمِعْتُ عَوْفَ بْنَ مَالِكٍ، يَقُولُ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12369,
                "hadithNumber": "4806",
                "englishNarrator": null,
                "hadithEnglish": "Ibn Jabir رضی اللہ عنہ narrated it with chain of narration (a Hadith similar to no. 4805).",
                "hadithUrdu": "اسحٰق بن موسیٰ انصاری نے کہا : ہمیں ولید بن مسلم نے حدیث بیان کی ، کہا : ہمیں ابن جابر نے اسی سند سے خبر دی اور کہا : بنو گزارہ کے آزاد کردہ غلام رزیق ۔ امام مسلم نے کہا : یہ حدیث معاویہ بن صالح نے بھی ربیعہ بن یزید سے روایت کی ، انہوں نے مسلم بن قرظہ سے ، انہوں نے عوف بن مالک رضی اللہ عنہ سے ، انہوں نے نبی صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی.",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا إِسْحَاقُ بْنُ مُوسَى الْأَنْصَارِيُّ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا ابْنُ جَابِرٍ، بِهَذَا الْإِسْنَادِ، وَقَالَ رُزَيْقٌ، مَوْلَى بَنِي فَزَارَةَ، قَالَ مُسْلِمٌ: وَرَوَاهُ مُعَاوِيَةُ بْنُ صَالِحٍ، عَنْ رَبِيعَةَ بْنِ يَزِيدَ، عَنْ مُسْلِمِ بْنِ قَرَظَةَ، عَنْ عَوْفِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12370,
                "hadithNumber": "4807",
                "englishNarrator": "It has been narrated on the authority of Jabir رضی اللہ عنہ who said:",
                "hadithEnglish": "We were one thousand and four hundred on the Day of Hudaibiya. We swore fealty to him (the Holy Prophet ﷺ) and 'Umar رضی اللہ عنہ was holding the latter's hand (when he was sitting) under the tree (called) Samura (to administer the oath to the Companions). The narrator added: We took oath to the effect that we would not flee (from the battlefield if there was an encounter with the Meccans), but we did not take oath to fight to death.",
                "hadithUrdu": "حدیبیہ کے دن ہم ایک ہزار چار سو تھے ، ہم نے رسول اللہ صلی اللہ علیہ وسلم کے ہاتھ پر بیعت کی اور حضرت عمر رضی اللہ عنہ نے ایک درخت کے نیچے آپ صلی اللہ علیہ وسلم کا ہاتھ تھام رکھا تھا ۔ وہ ببول ( کیکر ) کا درخت تھا ۔ حضرت جابر رضی اللہ عنہ نے کہا : ہم نے اس بات پر آپ سے بیعت کی کہ ہم فرار نہ ہوں گے اور ہم نے آپ صلی اللہ علیہ وسلم کے ہاتھ پر موت کی بیعت نہیں کی.",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ہم سے لیث بن سعد نے بیان کیا اور ہم سے محمد بن رومح نے بیان کیا، ہم سے لیث نے بیان کیا، ان سے ابو الزبیر نے جابر رضی اللہ عنہ سے روایت کی، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثُ بْنُ سَعْدٍ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ: كُنَّا يَوْمَ الْحُدَيْبِيَةِ أَلْفًا وَأَرْبَعَ مِائَةً، فَبَايَعْنَاهُ وَعُمَرُ آخِذٌ بِيَدِهِ تَحْتَ الشَّجَرَةِ، وَهِيَ سَمُرَةٌ، وَقَالَ: «بَايَعْنَاهُ عَلَى أَنْ لَا نَفِرَّ، وَلَمْ نُبَايِعْهُ عَلَى الْمَوْتِ.",
                "headingArabic": "اسْتِحْبَابِ مُبَايَعَةِ الإِمَامِ الْجَيْشَ عِنْدَ إِرَادَةِ الْقِتَالِ وَبَيَانِ بَيْعَةِ الرِّضْوَانِ تَحْتَ الشَّجَرَةِ",
                "headingUrdu": "فوج کے لیے مستحب ہے کہ جنگ کا ارادہ کرتے وقت حاکم کی بیعت کرے اور درخت کے نیچے بیعت رضوان کا بیان",
                "headingEnglish": "It is recommended for the army to swear allegiance to the ruler when intending to fight, and an account of Bay'at Ar-Ridwan beneath the tree",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12371,
                "hadithNumber": "4808",
                "englishNarrator": "It has been narrated (through a different chain of transmitters) on the authority of Jabir رضی اللہ عنہ who said:",
                "hadithEnglish": "While swearing fealty to the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) we did not take the oath to death but that we would not run away (from the battlefield).",
                "hadithUrdu": "ہم نے رسول اللہ صلی اللہ علیہ وسلم سے مر جانے پر بیعت نہیں کی ، ہم نے آپ سے اس بات پر بیعت کی تھی کہ ہم فرار نہ ہوں گے.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے ابن عیینہ نے بیان کیا اور ہم سے ابن نمیر نے بیان کیا, سفیان نے ابوزبیر سے ، انہوں نے حضرت جابر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ عُيَيْنَةَ، ح وحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ: «لَمْ نُبَايِعْ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمَوْتِ، إِنَّمَا بَايَعْنَاهُ عَلَى أَنْ لَا نَفِرَّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12372,
                "hadithNumber": "4809",
                "englishNarrator": "It has been narrated on the authority of Abu Zubair:",
                "hadithEnglish": "Who heard Jabir رضی اللہ عنہ being questioned as to how many people were there on the Day of Hudaibiya. He replied: We were fourteen hundred. We swore fealty to him, and Umar رضی اللہ عنہ was holding his hand while he was sitting under the tree (to administer the oath). The tree was a samura (a wild tree found in deserts). All of as took the oath of fealty at his hands except Jadd bin Qais al-Ansari who hid himself under the belly of his camel.",
                "hadithUrdu": "انہوں نے حضرت جابر رضی اللہ عنہ سے سنا ، ان سے پوچھا گیا تھا کہ حدیبیہ کے دن آپ لوگوں کی تعداد کتنی تھی؟ انہوں نے کہا : ہم چودہ سو تھے ، ہم نے ایک درخت کے نیچے آپ صلی اللہ علیہ وسلم سے بیعت کی جبکہ حضرت عمر رضی اللہ عنہ نے آپ کا ہاتھ تھام رکھا تھا ، وہ ببول کا درخت تھا ، ہم سب نے آپ سے بیعت کی سوائے جد بن قیس انصاری کے ، ( اس نے آپ سے بیعت نہیں کی ) وہ اپنے اونٹ کے پیٹ کے نیچے چھپ گیا.",
                "urduNarrator": "محمد بن حاتم نے ہمیں حدیث بیان کی ، کہا : ہمیں حجاج نے ابن جریج سے حدیث سنائی ، کہا : مجھے ابوزبیر نے بتایا کہ",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا حَجَّاجٌ، عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، سَمِعَ جَابِرًا، يَسْأَلُ، كَمْ كَانُوا يَوْمَ الْحُدَيْبِيَةِ؟ قَالَ: «كُنَّا أَرْبَعَ عَشْرَةَ مِائَةً، فَبَايَعْنَاهُ، وَعُمَرُ آخِذٌ بِيَدِهِ تَحْتَ الشَّجَرَةِ، وَهِيَ سَمُرَةٌ، فَبَايَعْنَاهُ غَيْرَ جَدِّ بْنِ قَيْسٍ الْأَنْصَارِيِّ، اخْتَبَأَ تَحْتَ بَطْنِ بَعِيرِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12373,
                "hadithNumber": "4810",
                "englishNarrator": "It has been narrated (through a different chain of transmitters) on the authority of Abu Zubair:",
                "hadithEnglish": "Who heard Jabir رضی اللہ عنہ being questioned as to whether the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) took the oath of fealty at Dhu'l-Hulaifa. He said: No! But he offered his prayers at that place, and he administered the oath of fealty nowhere except near the tree in (the plain oo Hudaibiya. Ibn Juraij said that he was informed by Abu Zabair who heard Jabir bin Abdullah رضی اللہ عنہ say: The Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) prayed over the well at Hudaibiya (as a result of which its scanty water rose up and increased so as to be sufficient for the 1400 or 1500 men who had encamped at the place).",
                "hadithUrdu": "انہوں نے حضرت جابر رضی اللہ عنہ سے سنا ، ان سے سوال کیا گیا تھا : کیا نبی صلی اللہ علیہ وسلم نے ذوالحلیفہ میں بیعت لی تھی؟ انہوں نے کہا : نہیں ، البتہ آپ نے وہاں نماز پڑھی تھی اور حدیبیہ کے درخت کے سوا آپ نے کسی اور درخت کے نیچے بیعت نہیں لی ۔ ابن جریج نے کہا : انہیں ابوزبیر نے یہ بتایا کہ حضرت جابر بن عبداللہ رضی اللہ عنہ یہ کہتے تھے کہ نبی صلی اللہ علیہ وسلم نے حدیبیہ کے کنویں پر دعا کی تھی.",
                "urduNarrator": "مجھے ابراہیم بن دینار نے حدیث بیان کی ، کہا : ہمیں سلیمان بن مجالد کے آزاد کردہ غلام حجاج بن محمد اعور نے حدیث سنائی ، انہوں نے کہا : ابن جریج نے کہا : مجھے ابوزبیر نے خبر دی کہ",
                "hadithArabic": "وحَدَّثَنِي إِبْرَاهِيمُ بْنُ دِينَارٍ، حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ الْأَعْوَرُ، مَوْلَى سُلَيْمَانَ بْنِ مُجَالِدٍ، قَالَ: قَالَ ابْنُ جُرَيْجٍ، وَأَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرًا، يَسْأَلُ، هَلْ بَايَعَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِذِي الْحُلَيْفَةِ؟ فَقَالَ: «لَا، وَلَكِنْ صَلَّى بِهَا، وَلَمْ يُبَايِعْ عِنْدَ شَجَرَةٍ، إِلَّا الشَّجَرَةَ الَّتِي بِالْحُدَيْبِيَةِ» قَالَ ابْنُ جُرَيْجٍ: وَأَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ، يَقُولُ: «دَعَا النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى بِئْرِ الْحُدَيْبِيَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12374,
                "hadithNumber": "4811",
                "englishNarrator": "It has been narrated (through a different chain of transmitters) on the authority of Jabir رضی اللہ عنہ who said:",
                "hadithEnglish": "We were one thousand and four hundred on the Day of Hudaibiya when the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said to us: Today you are the best people on the earth. And Jabir said: If I had the eyesight, I could show you the place of the tree.",
                "hadithUrdu": "حدیبیہ کے دن ہم ایک ہزار چار سو تھے ، نبی صلی اللہ علیہ وسلم نے ہم سے فرمایا : \"\" آج تم روئے زمین کے بہترین افراد ہو حضرت جابر رضی اللہ عنہ نے کہا : اگر میں دیکھ سکتا تو میں تم کو اس درخت کی جگہ دکھاتا.",
                "urduNarrator": "ہم سے سعید بن عمرو اشعثی، سوید بن سعید، اسحاق بن ابراہیم اور احمد بن عبدہ نے بیان کیا اور یہ الفاظ سعید سے ہیں۔ ہم سے سعید اور اسحاق نے بیان کیا اور باقی دونوں نے کہا: ہم سے سفیان نے بیان کیا, عمرو نے حضرت جابر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ عَمْرٍو الْأَشْعَثِيُّ، وَسُوَيْدُ بْنُ سَعِيدٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَأَحْمَدُ بْنُ عَبْدَةَ، وَاللَّفْظُ لِسَعِيدٍ، قَالَ سَعِيدٌ، وَإِسْحَاقُ: أَخْبَرَنَا، وقَالَ الْآخَرَانِ: حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ جَابِرٍ، قَالَ: كُنَّا يَوْمَ الْحُدَيْبِيَةِ أَلْفًا وَأَرْبَعَ مِائَةٍ، فَقَالَ لَنَا النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَنْتُمُ الْيَوْمَ خَيْرُ أَهْلِ الْأَرْضِ»، وقَالَ جَابِرٌ: «لَوْ كُنْتُ أُبْصِرُ لَأَرَيْتُكُمْ مَوْضِعَ الشَّجَرَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12375,
                "hadithNumber": "4812",
                "englishNarrator": "It has been narrated on the authority of Salim bin Abu al-Ja'd who said:",
                "hadithEnglish": "I asked Jabir bin 'Abdullah about the number of the Companions (of the Prophet who took the oath of fealty under) the tree. He said: If we were a hundred thousand, it (i. e. the water in the well at Hudaibiya) would have sufficed us, but actually we were one thousand and five hundred.",
                "hadithUrdu": "میں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے اصحاب شجرہ ( بیعت رضوان کرنے والوں کی تعداد ) کے متعلق پوچھا ، تو انہوں نے کہا : اگر ہم ایک لاکھ بھی ہوتے تو وہ ( پانی ) ہمیں کافی ہوتا لیکن ہم ( تقریبا ) ایک ہزار پانچ سو لوگ تھے.",
                "urduNarrator": "ہم سے محمد بن المثنیٰ اور ابن بشار نے بیان کیا، کہا: ہم سے محمد بن جعفر نے بیان کیا، ہم سے شعبہ نے بیان کیا, عمرو بن مرہ نے سالم بن ابی جعد سے روایت کی ، کہا",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، قَالَ: سَأَلْتُ جَابِرَ بْنَ عَبْدِ اللهِ، عَنْ أَصْحَابِ الشَّجَرَةِ، فَقَالَ: «لَوْ كُنَّا مِائَةَ أَلْفٍ لَكَفَانَا، كُنَّا أَلْفًا وَخَمْسَ مِائَةٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12376,
                "hadithNumber": "4813",
                "englishNarrator": "It has been narrated on the authority of Jabir رضی اللہ عنہ who said:",
                "hadithEnglish": "If we had been a hundred thousand in number, it (the water) would have sufficed us, but actually we were fifteen hundred.",
                "hadithUrdu": "اگر ہم ایک لاکھ بھی ہوتے تو وہ ( پانی ) ہمیں کافی ہوتا لیکن ہم ( تقریبا ) پندرہ سو تھے.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابن نمیر نے بیان کیا، کہا کہ ہم سے عبداللہ بن ادریس نے بیان کیا، اور ہم سے رفاعہ بن الہیثم نے بیان کیا، ہم سے خالد نے بیان کیا۔ اس کا مطلب ہے ملر، وہ دونوں کہتے ہیں, حصین نے سالم بن ابی جعد سے ، انہوں نے حضرت جابر رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ نُمَيْرٍ، قَالَا: حَدَّثَنَا عَبْدُ اللهِ بْنُ إِدْرِيسَ، ح وحَدَّثَنَا رِفَاعَةُ بْنُ الْهَيْثَمِ، حَدَّثَنَا خَالِدٌ يَعْنِي الطَّحَّانَ، كِلَاهُمَا يَقُولُ: عَنْ حُصَيْنٍ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ جَابِرٍ، قَالَ: «لَوْ كُنَّا مِائَةَ أَلْفٍ لَكَفَانَا، كُنَّا خَمْسَ عَشْرَةَ مِائَةً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12377,
                "hadithNumber": "4814",
                "englishNarrator": "It has been narrated (through a different chain of transmitters) on the authority of Salim bin al-Ja'd who said:",
                "hadithEnglish": "I asked Jabir رضی اللہ عنہ : How many were you on the Day of Hudaibiya? He said: One thousand and four hundred.",
                "hadithUrdu": "میں نے حضرت جابر رضی اللہ عنہ سے پوچھا : اس دن آپ لوگ کتنے تھے؟ انہوں نے کہا : ایک ہزار چار سو ۔ ( یعنی بیعت کرنے والے)",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ اور اسحاق بن ابراہیم نے بیان کیا، انہوں نے کہا کہ ہمیں خبر دی، اور عثمان نے کہا: ہم سے جریر نے بیان کیا, اعمش نے کہا : مجھے سالم بن ابی جعد نے حدیث بیان کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ إِسْحَاقُ: أَخْبَرَنَا، وقَالَ عُثْمَانُ: حَدَّثَنَا جَرِيرٌ، عَنِ الْأَعْمَشِ، حَدَّثَنِي سَالِمُ بْنُ أَبِي الْجَعْدِ، قَالَ: قُلْتُ لِجَابِرٍ: كَمْ كُنْتُمْ يَوْمَئِذٍ؟ قَالَ: «أَلْفًا وَأَرْبَعَ مِائَةٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12378,
                "hadithNumber": "4815",
                "englishNarrator": "It has been narrated on the authority of 'Abdullah bin Abu Aufa رضی اللہ عنہ who said:",
                "hadithEnglish": "The Companions of the Tree (i.e. those who swore fealty under the tree) were one thousand and three hundred, and the people of Aslam tribe were one-eighth of the Muhajirs.",
                "hadithUrdu": "اصحاب شجرہ تیرہ سو تھے اور قبیلہ اسلم کے لوگ مہاجرین کا آٹھواں حصہ تھے ۔ ( انہوں نے یہ تعداد اندازے سے بتائی.)",
                "urduNarrator": "عبیداللہ کے والد معاذ نے ہمیں حدیث بیان کی ، کہا : ہمیں شعبہ نے عمرہ بن مرہ سے حدیث سنائی ، کہا : مجھے حضرت عبداللہ بن ابی اوفیٰ رضی اللہ عنہ نے حدیث بیان کی کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرٍو يَعْنِي ابْنَ مُرَّةَ، حَدَّثَنِي عَبْدُ اللهِ بْنُ أَبِي أَوْفَى، قَالَ: «كَانَ أَصْحَابُ الشَّجَرَةِ أَلْفًا وَثَلَاثَ مِائَةٍ، وَكَانَتْ أَسْلَمُ ثُمْنَ الْمُهَاجِرِينَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12379,
                "hadithNumber": "4816",
                "englishNarrator": null,
                "hadithEnglish": "A similar report (as no. 4825) was narrated from Shubah with this chain of narration.",
                "hadithUrdu": "ہم سے ابن المثنی نے بیان کیا, ابوداود اور نضر بن شمیل نے شعبہ سے اسی سند کے ساتھ اسی کے مانند روایت کی.",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا أَبُو دَاوُدَ، ح وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا النَّضْرُ بْنُ شُمَيْلٍ، جَمِيعًا عَنْ شُعْبَةَ، بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12380,
                "hadithNumber": "4817",
                "englishNarrator": "It has been narrated on the authority of Ma'qil bin Yasar رضی اللہ عنہ who aaid:",
                "hadithEnglish": "I remember being present on the Day of the Tree, and the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was taking the oath of the people and I was holding a twig of the tree over his head. We were fourteen hundred (in number). We did not take oath to the death, but to the effect that we would not run away from the battlefield.",
                "hadithUrdu": "میں نے بیعت رضوان کے دن اپنے آپ کو اس حالت میں دیکھا کہ نبی صلی اللہ علیہ وسلم لوگوں سے بیعت لے رہے تھے اور میں نے اس درخت کی شاخوں میں سے ایک شاخ کو آپ کے سر انور سے اوپر اٹھا رکھا تھا ، ہم اس وقت چودہ سو تھے ۔ انہوں نے کہا : ہم نے ( اس موقع پر ) آپ سے موت پر بیعت نہیں کی تھی ، ہم نے یہ بیعت کی تھی کہ ہم فرار نہیں ہوں گے.",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا ہم سے یزید بن زرعی نے بیان کیا، خالد ( حذاء ) نے حکم بن عبداللہ بن اعرج سے ، انہوں نے حضرت معقل بن یسار رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ خَالِدٍ، عَنِ الْحَكَمِ بْنِ عَبْدِ اللهِ بْنِ الْأَعْرَجِ، عَنْ مَعْقِلِ بْنِ يَسَارٍ، قَالَ: لَقَدْ رَأَيْتُنِي يَوْمَ الشَّجَرَةِ، وَالنَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُبَايِعُ النَّاسَ، وَأَنَا رَافِعٌ غُصْنًا مِنْ أَغْصَانِهَا عَنْ رَأْسِهِ، وَنَحْنُ أَرْبَعَ عَشْرَةَ مِائَةً، قَالَ: «لَمْ نُبَايِعْهُ عَلَى الْمَوْتِ، وَلَكِنْ بَايَعْنَاهُ عَلَى أَنْ لَا نَفِرَّ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12381,
                "hadithNumber": "4818",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Yunus with the same chain of transmitters.",
                "hadithUrdu": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا ہم سے خالد بن عبداللہ نے بیان کیا، یونس رضی اللہ عنہ نے اسی سند سے  ، اس سلسلہ کے ساتھ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَاهُ يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللهِ، عَنْ يُونُسَ، بِهَذَا الْإِسْنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12382,
                "hadithNumber": "4819",
                "englishNarrator": "It has been narrated on the authority of Sa'id bin Musayyab who said:",
                "hadithEnglish": "My father was one of those who swore fealty to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) near the tree. When we passed that way next year intending to perform the Hajj, the place of the tree was hidden to us. If you could point out clearly, you would (certainly) be knowing better.",
                "hadithUrdu": "میرے والد بھی ان لوگوں میں سے تھے جنہوں نے درخت کے نیچے رسول اللہ صلی اللہ علیہ وسلم سے بیعت کی تھی ، انہوں نے کہا : جب ہم اگلے سال حج کے لیے گئے تو ہمیں اس کی جگہ نہیں ملی ، اگر تم لوگوں کو وہ جگہ معلوم ہو گئی ہے تو تم لوگ زیادہ جاننے والے ہو ۔",
                "urduNarrator": "ہم سے حمید بن عمر نے بیان کیا, ابوعوانہ نے طارق سے ، انہوں نے سعید بن مسیب سے روایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنَاهُ حَامِدُ بْنُ عُمَرَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ طَارِقٍ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، قَالَ: «كَانَ أَبِي مِمَّنْ بَايَعَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عِنْدَ الشَّجَرَةِ»، قَالَ: «فَانْطَلَقْنَا فِي قَابِلٍ حَاجِّينَ، فَخَفِيَ عَلَيْنَا مَكَانُهَا، فَإِنْ كَانَتْ تَبَيَّنَتْ لَكُمْ فَأَنْتُمْ أَعْلَمُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12383,
                "hadithNumber": "4820",
                "englishNarrator": "It has also been narrated on the authority of Sa'id bin Musayyib who learnt from his father:",
                "hadithEnglish": "They were with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) in the year of the Tree (i.e. in the year of the fealty of God's pleasure sworn under the tree at Hudaibiya), but next year they forgot the spot of the tree.",
                "hadithUrdu": "بیعت رضوان کے سال وہ لوگ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے ، پھر اگلے سال وہ لوگ اس درخت کو بھول چکے تھے ۔",
                "urduNarrator": "مجھ سے محمد بن رافع نے بیان کیا، ہم سے ابو احمد نے بیان کیا، انہوں نے کہا: اور میں نے ابو احمد کی روایت سے نصر بن علی کو پڑھا, سفیان نے طارق بن عبدالرحمٰن سے حدیث بیان کی ، انہوں نے سعید بن مسیب سے ، انہوں نے اپنے والد سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنِيهِ مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا أَبُو أَحْمَدَ، قَالَ: وَقَرَأْتُهُ عَلَى نَصْرِ بْنِ عَلِيٍّ، عَنْ أَبِي أَحْمَدَ، حَدَّثَنَا سُفْيَانُ، عَنْ طَارِقِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، عَنْ أَبِيهِ، «أَنَّهُمْ كَانُوا عِنْدَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَامَ الشَّجَرَةِ»، قَالَ: «فَنَسُوهَا مِنَ الْعَامِ الْمُقْبِلِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12384,
                "hadithNumber": "4821",
                "englishNarrator": "The tradition has been narrated on the authority of Sa'id bin Musayyib who learnt it from his father. The latter said:",
                "hadithEnglish": "I had seen the tree. When I came to the spot afterwards, I could not recognize it.",
                "hadithUrdu": "میں نے وہ درخت دیکھا تھا ، پھر میں اس کے بعد وہاں گیا تو میں اس درخت کو نہ پہچان سکا ۔",
                "urduNarrator": "مجھ سے حجاج بن الشاعر اور محمد بن رافع نے بیان کیا، کہا: ہم سے شبابہ نے بیان کیا، ہم سے شعبہ نے بیان کیا, قتادہ نے سعید بن مسیب سے ، انہوں نے اپنے والد سے روایت کی ، کہا",
                "hadithArabic": "وحَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ، وَمُحَمَّدُ بْنُ رَافِعٍ، قَالَا: حَدَّثَنَا شَبَابةُ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، عَنْ أَبِيهِ، قَالَ: «لَقَدْ رَأَيْتُ الشَّجَرَةَ، ثُمَّ أَتَيْتُهَا بَعْدُ فَلَمْ أَعْرِفْهَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12385,
                "hadithNumber": "4822",
                "englishNarrator": "It has been narrated on the authority of Yazid bin Abu Ubaid (the freed slave of Salama bin al-Akwa' رضی اللہ عنہ) who said:",
                "hadithEnglish": "I asked Salama رضی اللہ عنہ as to what effect he had sworn fealty to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) on the Day of Hudaibiya. He said: To the effect that we will die fighting.",
                "hadithUrdu": "میں نے حضرت سلمہ رضی اللہ عنہ سے پوچھا کہ حدیبیہ کے دن تم لوگوں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ کس چیز پر بیعت کی تھی؟ انہوں نے کہا : موت پر.",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, حاتم بن اسماعیل نے حضرت سلمہ بن اکوع رضی اللہ عنہ کے مولیٰ یزید بن عبید سے حدیث بیان کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَاتِمٌ يَعْنِي ابْنَ إِسْمَاعِيلَ، عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ، مَوْلَى سَلَمَةَ بْنِ الْأَكْوَعِ، قَالَ: قُلْتُ لِسَلَمَةَ: عَلَى أَيِّ شَيْءٍ بَايَعْتُمْ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْحُدَيْبِيَةِ؟ قَالَ: «عَلَى الْمَوْتِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12386,
                "hadithNumber": "4823",
                "englishNarrator": null,
                "hadithEnglish": "A similar (as no. 4822) was narrated from Salamah ‌رضی ‌اللہ ‌عنہ ‌.",
                "hadithUrdu": "ہم سے اسحاق بن ابراہیم نے بیان کیا, حماد بن مسعدہ نے کہا ہمیں یزید نے سلمہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سےاسی کی مانند حدیث بیان کی ہے.",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا حَمَّادُ بْنُ مَسْعَدَةَ، حَدَّثَنَا يَزِيدُ، عَنْ سَلَمَةَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12387,
                "hadithNumber": "4824",
                "englishNarrator": "It has been narrated on the authority of Abdullah bin Zaid رضی اللہ عنہ who said:",
                "hadithEnglish": "A person came to him and said: Here is Ibn Hanzala who is making people swear allegiance to him. He (, Abdullah) asked: To what effect? He replied: To the effect that they will die for him. 'Abdullah said: I will never swear allegiance to this effect after the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌).",
                "hadithUrdu": "ان کے پاس کوئی شخص آیا اور کہنے لگا : ابن حنظلہ لوگوں سے بیعت لے رہے ہیں؟ پوچھا : کس چیز پر؟ کہا : موت پر ۔ کہا : میں رسول اللہ صلی اللہ علیہ وسلم کے بعد کسی شخص کے ساتھ اس بات پر بیعت نہیں کروں گا ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے المخزومی نے بیان کیا، کہا ہم سے وہیب نے بیان کیا، ہم سے عمرو بن یحییٰ نے بیان کیا, عباد بن تمیم نے حضرت عبداللہ بن زید رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا الْمَخْزُومِيُّ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا عَمْرُو بْنُ يَحْيَى، عَنْ عَبَّادِ بْنِ تَمِيمٍ، عَنْ عَبْدِ اللهِ بْنِ زَيْدٍ، قَالَ: أَتَاهُ آتٍ، فَقَالَ: هَا ذَاكَ ابْنُ حَنْظَلَةَ يُبَايِعُ النَّاسَ، فَقَالَ: عَلَى مَاذَا؟ قَالَ: عَلَى الْمَوْتِ، قَالَ: «لَا أُبَايِعُ عَلَى هَذَا أَحَدًا بَعْدَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12388,
                "hadithNumber": "4825",
                "englishNarrator": "It has been narrated by Salama bin al-Akwa' رضی اللہ عنہ :",
                "hadithEnglish": "He visited al-Hajjaj who said to him: O son of al-Akwa', you have turned apostate and have come to live again in the desert with the Bedouins (after your migration). He said: No, but the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) has permitted me to live in the desert.",
                "hadithUrdu": "وہ حجاج کے پاس گئے ، اس نے کہا : ابن اکوع! کیا آپ واپس پچھلی روش پر لوٹ گئے ہیں ، بادیہ میں رہنے لگے ہیں؟ انہوں نے کہا : نہیں ( پچھلی روش پر نہیں لوٹا ) لیکن مجھے رسول اللہ صلی اللہ علیہ وسلم نے بادیہ میں رہنے کی اجازت دی تھی ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے حاتم، یعنی ابن اسماعیل نے بیان کیا, یزید بن ابی عبید نے حضرت سلمہ بن اکوع رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَاتِمٌ يَعْنِي ابْنَ إِسْمَاعِيلَ، عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ، عَنْ سَلَمَةَ بْنِ الْأَكْوَعِ، أَنَّهُ دَخَلَ عَلَى الْحَجَّاجِ، فَقَالَ: يَا ابْنَ الْأَكْوَعِ، ارْتَدَدْتَ عَلَى عَقِبَيْكَ؟ تَعَرَّبْتَ؟ قَالَ: «لَا، وَلَكِنْ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَذِنَ لِي فِي الْبَدْوِ».",
                "headingArabic": "تَحْرِيمِ رُجُوعِ الْمُهَاجِرِ إِلَى اسْتِيطَانِ وَطَنِهِ ‏‏",
                "headingUrdu": "مہاجر کے اپنے سابقہ ​​وطن میں آباد ہونے کی ممانعت",
                "headingEnglish": "The prohibition against a Muhajir returning to settle in his former homeland",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 12076,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=483",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=481",
                "label": "481",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=482",
                "label": "482",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=483",
                "label": "483",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=484",
                "label": "484",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=485",
                "label": "485",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=486",
                "label": "486",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=487",
                "label": "487",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=485",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=485",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=483",
        "to": 12100,
        "total": 40465
    }
}