{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 452,
        "data": [
            {
                "id": 11564,
                "hadithNumber": "4000",
                "englishNarrator": "Abdullah bin Abu Qatada reported:",
                "hadithEnglish": "Abu Qatada (رضی اللہ عنہ) demanded (the payment of his debt) from his debtor but he disappeared; later on he found him and he said: I am hard up financially, whereupon he said: (Do you state it) by God? He said: By God. Upon this he (Qatada) said: I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: He who loves that Allah saves him from the torments of the Day of Resurrection should give respite to the insolvent or remit (his debt).",
                "hadithUrdu": "حضرت ابو قتادہ رضی اللہ عنہ نے اپنے ایک قرض دار کو تلاش کیا تو وہ ان سے چھپ گیا ، پھر ( بعد میں ) انہوں نے اسے پا لیا تو اس نے کہا : میں تنگ دست ہوں ۔ انہوں نے کہا : اللہ کی قسم؟ اس نے جواب دیا : اللہ کی قسم! انہوں نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ فرما رہے تھے : \" جسے یہ بات اچھی لگے کہ اللہ تعالیٰ اسے قیامت کے دن کی سختیوں سے نجات دے تو وہ تنگ دست کو سہولت دے یا اسے معاف کر دے ۔ \"",
                "urduNarrator": "ہم سے ابو الہیثم خالد بن خدش بن عجلان نے بیان کیا,حماد بن زید نے ہمیں ایوب سے حدیث بیان کی ، انہوں نے یحییٰ بن ابی کثیر سے اور انہوں نے عبداللہ بن ابی قتادہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْهَيْثَمِ خَالِدُ بْنُ خِدَاشِ بْنِ عَجْلَانَ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عَبْدِ اللهِ بْنِ أَبِي قَتَادَةَ، أَنَّ أَبَا قَتَادَةَ، طَلَبَ غَرِيمًا لَهُ، فَتَوَارَى عَنْهُ ثُمَّ وَجَدَهُ، فَقَالَ: إِنِّي مُعْسِرٌ، فَقَالَ: آللَّهِ؟ قَالَ: آللَّهِ؟ قَالَ: فَإِنِّي سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: «مَنْ سَرَّهُ أَنْ يُنْجِيَهُ اللهُ مِنْ كُرَبِ يَوْمِ الْقِيَامَةِ، فَلْيُنَفِّسْ عَنْ مُعْسِرٍ، أَوْ يَضَعْ عَنْهُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11565,
                "hadithNumber": "4001",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Ayyub with the same chain of transmitters.",
                "hadithUrdu": "مجھ سے ابو الطاہر نے بیان کیا، ہم سے ابن وہب نے بیان کیا, جریر بن حازم نے ایوب سے اسی سند کے ساتھ اسی طرح حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِيهِ أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي جَرِيرُ بْنُ حَازِمٍ، عَنْ أَيُّوبَ، بِهَذَا الْإِسْنَادِ نَحْوَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11566,
                "hadithNumber": "4002",
                "englishNarrator": "Abu Huraira ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Delay (in the payment of debt) on the part of a rich man is injustice, and when one of you is retired to a rich man, he should follow him.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" غنی آدمی کا ٹال مٹول کرنا ظلم ہے اور جب تم میں سے کسی کو کسی مال دار ( سے وصولی ) پر لگایا جائے تو اسے لگ جانا چاہئے ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے مالک رضی اللہ عنہ کو ابو الزناد کی سند سے پڑھا,اعرج ( عبدالرحمٰن بن ہرمز مدنی ) نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَطْلُ الْغَنِيِّ ظُلْمٌ، وَإِذَا أُتْبِعَ أَحَدُكُمْ عَلَى مَلِيءٍ فَلْيَتْبَعْ».",
                "headingArabic": "تَحْرِيمِ مَطْلِ الْغَنِيِّ وَصِحَّةِ الْحَوَالَةِ وَاسْتِحْبَابِ قَبُولِهَا إِذَا أُحِيلَ عَلَى مَلِيٍّ",
                "headingUrdu": "امیر آدمی کی ادائیگی میں تاخیر کرنے کی ممانعت۔ حوالہ (قرضوں کی منتقلی) کا جواز اور قرض کی منتقلی کو قبول کرنے کی سفارش کی جاتی ہے اگر اسے کسی امیر آدمی کو منتقل کیا جائے",
                "headingEnglish": "The prohibition of a rich man delaying repayment. The validity of Hawalah (Transferal of Debts) and it is recommended to accept transferal of a debt if it is transferred to a rich man",
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11567,
                "hadithNumber": "4003",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been transmitted on the authority of Abu Huraira ( رضی اللہ عنہ).",
                "hadithUrdu": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے مالک رضی اللہ عنہ کو ابو الزناد کی سند سے پڑھا, ہمام بن منبہ نے حضرت ابوہریرہ رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ۔ ۔ اسی کے مانند.",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَا جَمِيعًا: حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11568,
                "hadithNumber": "4004",
                "englishNarrator": "Jabir bin 'Abdullah (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade the sale of excess water.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے بچ جانے والے پانی کو فروخت کرنے سے منع فرمایا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا,  وکیع اور یحییٰ بن سعید نے ابن جریج سے حدیث بیان کی ، انہوں نے ابوزبیر سے اور انہوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، أَخْبَرَنَا وَكِيعٌ، ح وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، جَمِيعًا عَنِ ابْنِ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، قَالَ: «نَهَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ فَضْلِ الْمَاءِ.",
                "headingArabic": "تَحْرِيمِ بَيْعِ فَضْلِ الْمَاءِ الَّذِي يَكُونُ بِالْفَلَاةِ وَيُحْتَاجُ إِلَيْهِ لِرَعْيِ الْكَلَأِ وَتَحْرِيمِ مَنْعِ بَذْلِهِ وَتَحْرِيمِ بَيْعِ ضِرَابِ الْفَحْلِ",
                "headingUrdu": "زائد پانی بیچنے کی ممانعت جو بیابان میں ہو اور چراگاہ کی دیکھ بھال کے لیے ضروری ہو۔ دوسروں کو استعمال کرنے کی اجازت نہ دینے کی ممانعت۔ سٹڈ فیس کی ممانعت",
                "headingEnglish": "The prohibition of selling surplus water which is in the wilderness and is needed to take care of the pasture. The prohibition of not allowing others to use it. The prohibition of Stud fees",
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11569,
                "hadithNumber": "4005",
                "englishNarrator": "Jabir bin 'Abdullah (رضی اللہ عنہ) reported that",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade the hiring of a Camel to cover a she-Camel and from selling water and land to be tilled. So from all this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے اونٹ کی جفتی فروخت کرنے ، کاشتکاری کے لیے پانی اور زمین کو فروخت کرنے سے منع فرمایا ۔ رسول اللہ صلی اللہ علیہ وسلم نے ان ساری باتوں سے منع فرمایا ہے ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا، انہوں نے بیان کیا روح بن عبادہ نے ہمیں خبر دی ، کہا : ہمیں ابن جریج نے حدیث بیان کی ، کہا : مجھے ابوزبیر نے بتایا کہ انہوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے",
                "hadithArabic": "وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ، يَقُولُ: «نَهَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ ضِرَابِ الْجَمَلِ، وَعَنْ بَيْعِ الْمَاءِ وَالْأَرْضِ لِتُحْرَثَ»، فَعَنْ ذَلِكَ نَهَى النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11570,
                "hadithNumber": "4006",
                "englishNarrator": "Abu Huraira (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Excess water must not be withheld so that the growth of herbage may be hindered.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" زائد پانی کو نہ روکا جائے کہ اس کے ذریعے سے گھاس روکی جائے ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے مالک بن حنان رضی اللہ عنہ سے پڑھا اور ہم سے قتیبہ نے بیان کیا، ہم سے لیث نے ابو الزناد سے بیان کیا,اعرج نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، ح وحَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا لَيْثٌ كِلَاهُمَا، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يُمْنَعُ فَضْلُ الْمَاءِ لِيُمْنَعَ بِهِ الْكَلَأُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11571,
                "hadithNumber": "4007",
                "englishNarrator": "Abu Huraira (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Do not withhold excess of water, so that you may prevent the growth of herbage.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" زائد پانی نہ روکو کہ اس کے ذریعے سے تم گھاس روک دو ۔ \"",
                "urduNarrator": "مجھ سے ابو الطاہر اور حرملہ نے بیان کیا اور ہم سے ابن وہب نے بیان کیا، مجھ سے یونس نے بیان کیا, ابن شہاب سے روایت ہے ، کہا : مجھے سعید بن مسیب اور ابوسلمہ بن عبدالرحمٰن نے حدیث بیان کی کہ حضرت ابوہریرہ رضی اللہ عنہ نے کہا",
                "hadithArabic": "وحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، وَاللَّفْظُ لِحَرْمَلَةَ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيِّبِ، وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تَمْنَعُوا فَضْلَ الْمَاءِ لِتَمْنَعُوا بِهِ الْكَلَأَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11572,
                "hadithNumber": "4008",
                "englishNarrator": "Abu Huraira (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The excess of water should not be sold in order to enable the sate of herbage.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" زائد پانی کو فروخت نہ کیا جائے کہ اس کے ذریعے سے گھاس کو فروخت کیا جائے ۔ \"",
                "urduNarrator": "ہم سے احمد بن عثمان النوفلی نے بیان کیا، کہا ہم سے ابوعاصم الضحاک بن مخلد نے بیان کیا، کہا ہم سے ابن جریج نے بیان کیا، مجھ سے زیاد بن سعد نے بیان کیا, ہلال بن اسامہ نے خبر دی کہ ابوسلمہ بن عبدالرحمٰن نے انہیں بتایا کہ انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے",
                "hadithArabic": "وحَدَّثَنَا أَحْمَدُ بْنُ عُثْمَانَ النَّوْفَلِيُّ، حَدَّثَنَا أَبُو عَاصِمٍ الضَّحَّاكُ بْنُ مَخْلَدٍ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي زِيَادُ بْنُ سَعْدٍ، أَنَّ هِلَالَ بْنَ أُسَامَةَ، أَخْبَرَهُ، أَنَّ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ، أَخْبَرَهُ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يُبَاعُ فَضْلُ الْمَاءِ لِيُبَاعَ بِهِ الْكَلَأُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11573,
                "hadithNumber": "4009",
                "englishNarrator": "Aba Mas'ud al-Ansari (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade the charging of price of the dog, and earnings of a prostitute and sweets offered to a kahin.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے کتے کی قیمت ، زانیہ کے معاوضے اور کاہن کے نذرانے سے منع فرمایا ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا امام مالک نے ابن شہاب سے ، انہوں نے ابوبکر بن عبدالرحمٰن سے اور انہوں نے حضرت ابومسعود انصاری رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي مَسْعُودٍ الْأَنْصَارِيِّ، «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ ثَمَنِ الْكَلْبِ، وَمَهْرِ الْبَغِيِّ، وَحُلْوَانِ الْكَاهِنِ».",
                "headingArabic": "حْرِيمِ ثَمَنِ الْكَلْبِ وَحُلْوَانِ الْكَاهِنِ وَمَهْرِ الْبَغِيِّ وَالنَّهْىِ عَنْ بَيْعِ السِّنّ",
                "headingUrdu": "کتے کی قیمت کی ممانعت، نجومی کی فیس اور طوائف کی ادائیگی اور بلیوں کے بیچنے کی ممانعت",
                "headingEnglish": "The prohibition of the price of a dog, the fee of a fortuneteller and the payment of a prostitute, and the prohibition of selling cats",
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11574,
                "hadithNumber": "4010",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this is reported on the authority of Abu Mas'ud رضی اللہ عنہ through another chain of transmitters.",
                "hadithUrdu": "قتیبہ بن سعید اور محمد بن رُمح نے لیث بن سعد سے روایت کی ، نیز ابوبکر بن ابی شیبہ نے کہا : ہمیں سفیان بن عیینہ نے حدیث سنائی ، ان دونوں ( لیث بن سعد اور سفیابن بن عیینہ ) نے زہری سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ۔ ابن رمح کی روایت کردہ لیث کی حدیث میں ہے کہ انہوں ( ابوبکر بن عبدالرحمن ) نے حضرت ابومسعود رضی اللہ عنہ سے سماعت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ رُمْحٍ، عَنِ اللَّيْثِ بْنِ سَعْدٍ، ح وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، كِلَاهُمَا عَنِ الزُّهْرِيِّ، بِهَذَا الْإِسْنَادِ مِثْلَهُ، وَفِي حَدِيثِ اللَّيْثِ، مِنْ رِوَايَةِ ابْنِ رُمْحٍ، أَنَّهُ سَمِعَ أَبَا مَسْعُودٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11575,
                "hadithNumber": "4011",
                "englishNarrator": "Rafi bin Khadij (رضی اللہ عنہ) reported:",
                "hadithEnglish": "I heard Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The worst earning is the earning of a prostitute, the price of a dog and the earning of a cupper.",
                "hadithUrdu": "میں نے نبی صلی اللہ علیہ وسلم سے سنا ، آپ فرما رہے تھے : \" بدترین کمائی زانیہ کی اجرت ، کتے کی قیمت اور پچھنے لگانے والے کی کمائی ہے.",
                "urduNarrator": "مجھ سے محمد بن حاتم نے بیان کیا، ہم سے یحییٰ بن سعید القطان نے بیان کیا،محمد بن یوسف سے روایت ہے ، انہوں نے کہا : میں نے سائب بن یزید سے سنا ، وہ حضرت رافع بن خدیج رضی اللہ عنہ سے حدیث بیان کر رہے تھے ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ، عَنْ مُحَمَّدِ بْنِ يُوسُفَ، قَالَ: سَمِعْتُ السَّائِبَ بْنَ يَزِيدَ، يُحَدِّثُ عَنْ رَافِعِ بْنِ خَدِيجٍ، قَالَ: سَمِعْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: «شَرُّ الْكَسْبِ مَهْرُ الْبَغِيِّ، وَثَمَنُ الْكَلْبِ، وَكَسْبُ الْحَجَّامِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11576,
                "hadithNumber": "4012",
                "englishNarrator": "Rafi bin Khadij  رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah'& Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: The price of a dog is evil, the earning of a prostitute is evil and the earning of a cupper is evil.",
                "hadithUrdu": "آپ نے فرمایا : \" کتے کی قیمت خبیث ( ناپاک اور گندی ) ہے ۔ زانیہ کی اجرت خبیث ہے اور پچھنے لگانے والے کی کمائی خبیث ہے ۔ \"",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے ولید بن مسلم نے بیان کیا, اوزاعی نے یحییٰ بن ابی کثیر سے روایت کی ، کہا : مجھے ابراہیم بن قارظ نے سائب بن یزید سے حدیث بیان کی ، انہوں نے کہا : مجھے حضرت رافع بن خدیج رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے حدیث بیان کی",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، عَنِ الْأَوْزَاعِيِّ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، حَدَّثَنِي إِبْرَاهِيمُ بْنُ قَارِظٍ، عَنِ السَّائِبِ بْنِ يَزِيدَ، حَدَّثَنِي رَافِعُ بْنُ خَدِيجٍ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «ثَمَنُ الْكَلْبِ خَبِيثٌ، وَمَهْرُ الْبَغِيِّ خَبِيثٌ، وَكَسْبُ الْحَجَّامِ خَبِيثٌ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11577,
                "hadithNumber": "4013",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been narrated on the authority of Rafi' bin Khadij through another chain of transmitters.",
                "hadithUrdu": "ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا,معمر نے یحییٰ بن ابی کثیر سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11578,
                "hadithNumber": "4014",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been narrated on the authority of Rafi' bin Khadij رضی اللہ عنہ through another chain of transmitters.",
                "hadithUrdu": "ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے نضر بن شمائل نے بیان کیا,ہشام نے ہمیں یحییٰ بن ابی کثیر سے حدیث بیان کی ، کہا : مجھے ابراہیم نے عبداللہ نے سائب بن یزید سے حدیث بیان کی ، انہوں نے کہا : ہمیں حضرت رافع بن خدیج رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے اسی کے مانند حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا النَّضْرُ بْنُ شُمَيْلٍ، حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، حَدَّثَنِي إِبْرَاهِيمُ بْنُ عَبْدِ اللهِ، عَنِ السَّائِبِ بْنِ يَزِيدَ، حَدَّثَنَا رَافِعُ بْنُ خَدِيجٍ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11579,
                "hadithNumber": "4015",
                "englishNarrator": "Abu Zubair said:",
                "hadithEnglish": "I asked Jabir رضی اللہ عنہ about the price of a dog and a cat; he said: Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) disapproved of that.",
                "hadithUrdu": "میں نے حضرت جابر رضی اللہ عنہ سے کتے اور بلی کی قیمت کے بارے میں پوچھا تو انہوں نے کہا : نبی صلی اللہ علیہ وسلم نےاس سے جھڑک کر روکا ہے ۔",
                "urduNarrator": "مجھ سے سلمہ بن شبیب نے بیان کیا، کہا ہم سے حسن بن عیان نے بیان کیا، کہا ہم سے معقل نے بیان کیا,ابوزبیر سے روایت ہے ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنْ أَبِي الزُّبَيْرِ، قَالَ: سَأَلْتُ جَابِرًا، عَنْ ثَمَنِ الْكَلْبِ وَالسِّنَّوْرِ؟ قَالَ: «زَجَرَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11580,
                "hadithNumber": "4016",
                "englishNarrator": "Ibn 'Umar (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) giving command for killing dogs.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے کتوں کو مار دینے کا حکم دیا.",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا:امام مالک نے نافع سے اور انہوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِقَتْلِ الْكِلَابِ».",
                "headingArabic": "الْأَمْرِ بِقَتْلِ الْكِلَابِ وَبَيَانِ نَسْخِهِ وَبَيَانِ تَحْرِيمِ اقْتِنَائِهَا إِلَّا لِصَيْدٍ أَوْ زَرْعٍ أَوْ مَاشِيَةٍ وَنَحْوِ ذَلِكَ",
                "headingUrdu": "کتوں کو مارنے کا حکم اور اس کی منسوخی کتے پالنے کی ممانعت سوائے شکار، کھیتی باڑی، مویشیوں اور اس طرح کے",
                "headingEnglish": "The command to kill dogs, and its abrogation. The prohibition of keeping dogs, except for hunting, farming, (herding) livestock and the like",
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11581,
                "hadithNumber": "4017",
                "englishNarrator": "Ibn 'Umar ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم) ordered to kill dogs, and he sent (men) to the corners of Medina that they should be killed.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے کتوں کو مارنے کا حکم دیا ۔ آپ نے انہیں مارنے کے لیے مدینہ کی اطراف میں آدمی روانہ کیے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے ابو اسامہ نے بیان کیا, عبیداللہ نے ہمیں نافع کے حوالے سے حضرت ابن عمر رضی اللہ عنہ سے حدیث بیان کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا عُبَيْدُ اللهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ: «أَمَرَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِقَتْلِ الْكِلَابِ، فَأَرْسَلَ فِي أَقْطَارِ الْمَدِينَةِ أَنْ تُقْتَلَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11582,
                "hadithNumber": "4018",
                "englishNarrator": "Abdullah (bin Umar) (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) ordered the killing of dogs and we would send (men) in Medina and its corners and we did not spare any dog that we did not kill, so much so that we killed the dog that accompanied the wet she-camel belonging to the people of the desert.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کتوں کو مارنے کا حکم دیتے تھے ۔ میں مدینہ اور اس کی اطراف میں تلاش کرتا ، ہم کوئی کتا نہ چھوڑتے مگر اسے مار ڈالتے ، حتی کہ ہم دیہات سے آنے والی عورت کے کتے کو بھی ، جو اس کے پیچھے آ جاتا تھا ، قتل کر دیتے تھے ۔",
                "urduNarrator": "مجھ سے حمید بن مسعدہ نے بیان کیا، یعنی ہم سے ابن المفضل نے بیان کیا, اسماعیل بن امیہ نے ہمیں نافع سے حدیث بیان کی ، انہوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي حُمَيْدُ بْنُ مَسْعَدَةَ، حَدَّثَنَا بِشْرٌ يَعْنِي ابْنَ الْمُفَضَّلِ، حَدَّثَنَا إِسْمَاعِيلُ وَهُوَ ابْنُ أُمَيَّةَ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللهِ، قَالَ: «كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُ بِقَتْلِ الْكِلَابِ، فَنَنْبَعِثُ فِي الْمَدِينَةِ وَأَطْرَافِهَا فَلَا نَدَعُ كَلْبًا إِلَّا قَتَلْنَاهُ، حَتَّى إِنَّا لَنَقْتُلُ كَلْبَ الْمُرَيَّةِ مِنْ أَهْلِ الْبَادِيَةِ يَتْبَعُهَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11583,
                "hadithNumber": "4019",
                "englishNarrator": "Ibn Umar (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger (ﷺ) ordered the killing of dogs except the dog tamed for hunting, or watching of the herd of sheep or other domestic animals. It was said to Ibn Umar (رضی اللہ عنہ) that Abu Huraira (رضی اللہ عنہ) talks of (exception) about the dog for watching the field, whereupon he said: Since Abu Huraira (رضی اللہ عنہ) possessed land.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے شکاری کتے ، بکریوں یا مویشیوں ( کی حفاظت ) کے کتے کے سوا ( باقی ) تمام کتوں کو مار ڈالنے کا حکم دیا ۔ حضرت ابن عمر رضی اللہ عنہ سے کہا گیا : حضرت ابوہریرہ رضی اللہ عنہ کہتے ہیں : یا کھیت کی حفاظت کرنے والے کتے کے ۔ تو حضرت ابن عمر رضی اللہ عنہ نے کہا : بے شبہ ابوہریرہ رضی اللہ عنہ کا کھیت بھی ہے ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا ہم سے حماد بن زید نے بیان کیا, عمرو بن دینار نے ابن عمر رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِقَتْلِ الْكِلَابِ، إِلَّا كَلْبَ صَيْدٍ، أَوْ كَلْبَ غَنَمٍ، أَوْ مَاشِيَةٍ»، فَقِيلَ لِابْنِ عُمَرَ: إِنَّ أَبَا هُرَيْرَةَ يَقُولُ: «أَوْ كَلْبَ زَرْعٍ»، فَقَالَ ابْنُ عُمَرَ: «إِنَّ لِأَبِي هُرَيْرَةَ زَرْعًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11584,
                "hadithNumber": "4020",
                "englishNarrator": "Abu Zubair heard Jabir bin 'Abdullah ( رضی اللہ عنہ) saying:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) ordered us to kill dogs, and we carried out this order so much so that we also kill the dog coming with a woman from the desert. Then Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade their killing. He (the Prophet further) said: It is your duty the jet-black (dog) having two spots (on the eyes), for it is a devil.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ہمیں کتوں کو مار ڈالنے کا حکم دیا حتی کہ کوئی عورت بادیہ سے اپنے کتے کے ساتھ آتی تو ہم اس کتے کو بھی مار ڈالتے ، پھر نبی صلی اللہ علیہ وسلم نے ہمیں ان کو مارنے سے منع کر دیا اور فرمایا : \" تم ( آنکھوں کے اوپر ) دو ( سفید ) نقطوں والے کالے سیاہ کتے کو نہ چھوڑو ، بلاشبہ وہ شیطان ہے ۔ \"",
                "urduNarrator": "ہم سے محمد بن احمد بن ابی خلف نے بیان کیا، کہا ہم سے روح نے بیان کیا، کہا ہم سے اسحاق بن منصور نے بیان کیا، ہم سے روح بن عبادہ نے بیان کیا، کہا کہ ابوزبیر نےخبر دی کہ انہوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ، حَدَّثَنَا رَوْحٌ، ح وحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ، يَقُولُ: أَمَرَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِقَتْلِ الْكِلَابِ، حَتَّى إِنَّ الْمَرْأَةَ تَقْدَمُ مِنَ الْبَادِيَةِ بِكَلْبِهَا فَنَقْتُلُهُ، ثُمَّ نَهَى النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ قَتْلِهَا، وَقَالَ: «عَلَيْكُمْ بِالْأَسْوَدِ الْبَهِيمِ ذِي النُّقْطَتَيْنِ، فَإِنَّهُ شَيْطَانٌ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11585,
                "hadithNumber": "4021",
                "englishNarrator": "Ibn Mughaffal رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) ordered the killing of dogs and then said: what is the trouble with them (the people of Medina)? How dogs are nuisance to them (the citizens of Medina)? He then permitted keeping of dogs for hunting and (the protection of) herds.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے کتوں کو مارنے کا حکم دیا ، پھر فرمایا : \" ان لوگوں کا کتوں سے کیا واسطہ ہے؟ \" بعد میں آپ نے شکاری کتے اور بکریوں ( کی حفاظت ) والے کتے کی اجازت دے دی ۔",
                "urduNarrator": "معاذ عنبری نے ہمیں حدیث بیان کی ، کہا : ہمیں شعبہ نے ابوتیاح سے حدیث سنائی ، انہوں نے مطرف بن عبداللہ سے سنا اور انہوں نے حضرت ( عبداللہ ) بن مغفل رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي التَّيَّاحِ، سَمِعَ مُطَرِّفَ بْنَ عَبْدِ اللهِ، عَنِ ابْنِ الْمُغَفَّلِ، قَالَ: أَمَرَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِقَتْلِ الْكِلَابِ، ثُمَّ قَالَ: «مَا بَالُهُمْ وَبَالُ الْكِلَابِ؟»، ثُمَّ رَخَّصَ فِي كَلْبِ الصَّيْدِ، وَكَلْبِ الْغَنَمِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11586,
                "hadithNumber": "4022",
                "englishNarrator": "It was narrated from Shubah (a Hadith similar to no. 4021, with a different chain of narrators) with this chain. Ibn Hatim said in his Hadith from Yahya:",
                "hadithEnglish": "He granted a concession with regard to dogs for herding sheep, Hunting and (guard dogs) in farm.",
                "hadithUrdu": "اور آپ صلی اللہ علیہ وسلم نے بکریوں کی رکھوالی ، شکار اور کھیت کی حفاظت کرنے والے کتے کی اجازت دے دی ۔",
                "urduNarrator": "یحییٰ بن حبیب نے کہا : ہمیں خالد بن حارث نے حدیث بیان کی ۔ محمد بن حاتم نے کہا : ہمیں یحییٰ بن سعید نے حدیث سنائی ۔ محمد بن ولید نے کہا : ہمیں محمد بن جعفر نے حدیث بیان کی ۔ اسحٰق بن ابراہیم نے کہا : ہمیں نضر نے خبر دی ۔ محمد بن مثنیٰ نے کہا : ہمیں وہب بن جریر نے حدیث بیان کی ، ( خالد بن حارث ، یحییٰ بن سعید ، محمد بن جعفر ، نضر اور وہب بن جریر ) سب نے شعبہ سے اسی سند کے ساتھ ( یہی ) حدیث بیان کی ۔ ابن حاتم نے اپنی حدیث میں کہا : یحییٰ سے روایت ہے ۔ ( اور آگے یہ کہا : )",
                "hadithArabic": "وحَدَّثَنِيهِ يَحْيَى بْنُ حَبِيبٍ، حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ، ح وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، ح وحَدَّثَنِي مُحَمَّدُ بْنُ الْوَلِيدِ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ح وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا النَّضْرُ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، كُلُّهُمْ عَنْ شُعْبَةَ بِهَذَا الْإِسْنَادِ، وقَالَ ابْنُ حَاتِمٍ فِي حَدِيثِهِ: عَنْ يَحْيَى، وَرَخَّصَ فِي كَلْبِ الْغَنَمِ، وَالصَّيْدِ، وَالزَّرْعِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11587,
                "hadithNumber": "4023",
                "englishNarrator": "Ibn Umar (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who keeps a dog other than that meant for watching the herd or for hunting loses every day out of his deeds equal to two qirat.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جس نے مویشیوں کی حفاظت کرنے والے اور شکاری کتے کے سوا کتا پالا اس کے اجر میں سے ہر روز دو قیراط کم ہوں گے.",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے مالک رضی اللہ عنہ سے پڑھا,  نافع نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنِ اقْتَنَى كَلْبًا إِلَّا كَلْبَ مَاشِيَةٍ، أَوْ ضَارٍ، نَقَصَ مِنْ عَمَلِهِ كُلَّ يَوْمٍ قِيرَاطَانِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11588,
                "hadithNumber": "4024",
                "englishNarrator": "Salim reported on the authority of his father:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: He who kept a dog other than one meant for hunting or for watching the herd, lost two qirat of his reward every day.",
                "hadithUrdu": "آپ نے فرمایا : \" جس نے شکار یا مویشیوں کے کتے کے سوا کتا رکھا اس کے اجر میں سے ہر روز دو قیراط کم ہوں گے ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، زہیر بن حرب اور ابن نمیر نے بیان کیا، انہوں نے کہا کہ ہم سے سفیان نے بیان کیا, زہری نے سالم سے ، انہوں نے اپنے والد ( حضرت عبداللہ بن عمر رضی اللہ عنہ ) سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَابْنُ نُمَيْرٍ، قَالُوا: حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنِ اقْتَنَى كَلْبًا، إِلَّا كَلْبَ صَيْدٍ، أَوْ مَاشِيَةٍ، نَقَصَ مِنْ أَجْرِهِ كُلَّ يَوْمٍ قِيرَاطَانِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 11276,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=451",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=449",
                "label": "449",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=450",
                "label": "450",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=451",
                "label": "451",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=452",
                "label": "452",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=453",
                "label": "453",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=454",
                "label": "454",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=455",
                "label": "455",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=453",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=453",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=451",
        "to": 11300,
        "total": 40465
    }
}