{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 305,
        "data": [
            {
                "id": 7889,
                "hadithNumber": "325",
                "englishNarrator": "It is narrate on the authority of Hakim bin Hizam ‌رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "I said: Messenger of Allah, I did so some of the deeds in the state of ignorance. (One of the transmitters Hisham bin Urwa explained them as acts of piety. Upon this the Messenger, of Allah remarked: You have embraced Islam with all the previous acts of virtue. I said: By God, I would leave nothing undone in Islam the like of which I did in the state of ignorance.",
                "hadithUrdu": "میں رسول اللہ ﷺ سے پوچھا : وہ ( بھلائی کی ) چیزیں ( کام ) جو میں جاہلیت کے دور میں کیا کرتا تھا؟ ( ہشام نے کہا : ان کی مراد تھی کہ میں نیکی کےلیے کرتا تھا ) تو رسول اللہ ﷺ نے فرمایا : ’’تم اس بھلائی سمیت اسلام میں داخل ہوئے جو تم نے پہلے کی ۔ ‘ ‘ میں نےکہا : اللہ کی قسم ! میں نے جو ( نیک ) کام جاہلیت میں کیے تھے ، ان میں سے کوئی عمل نہیں چھوڑوں گا مگر اس جیسے کام اسلام میں بھی کروں گا ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم اور عبد بن حمید نے بیان کیا، کہا: ہمیں عبدالرزاق نے خبر دی، انہیں معمر نے، زہری کی سند سے اس سلسلہ کی خبر دی۔ ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے ابو معاویہ نے بیان کیا، کہا ہم سے ہشام بن عروہ نے بیان کیا، وہ اپنے والد سے، وہ حکیم بن حزام سے، انہوں نے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَا: أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ بِهَذَا الْإِسْنَادِ. ح، وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ حَكِيمِ بْنِ حِزَامٍ، قَالَ: قُلْتُ: يَا رَسُولَ اللهِ، أَشْيَاءَ كُنْتُ أَفْعَلُهَا فِي الْجَاهِلِيَّةِ - قَالَ هِشَامٌ: يَعْنِي أَتَبَرَّرُ بِهَا - فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَسْلَمْتَ عَلَى مَا أَسْلَفْتَ لَكَ مِنَ الْخَيْرِ»، قُلْتُ: فَوَاللهِ، لَا أَدَعُ شَيْئًا صَنَعْتُهُ فِي الْجَاهِلِيَّةِ إِلَّا فَعَلْتُ فِي الْإِسْلَامِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7890,
                "hadithNumber": "326",
                "englishNarrator": "Hisham bin Urwa narrated it on the authority of his father:",
                "hadithEnglish": "Hakim bin Hizam رضی ‌اللہ ‌عنہ freed one hundred slave and donated one hundred camels (for the sake of Allah) during the state of ignorance. Then he freed one hundred slaves and donated one hundred camel (for the sake of Allah) after) he had embraced Islam. He subsequently came to the Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). The rest of the hadith is the same as narrated above.",
                "hadithUrdu": "حکیم بن حزام ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے دور جاہلیت میں سو غلام آزاد کیے تھے اور سو اونٹ سواری کے لیے ( مستحقین کو ) دیے تھے ، پھر اسلام لانے کے بعد ( دوبارہ ) سو غلام آزاد کیے اور سواونٹ سواری کے لیے دیے ، پھر نبی ﷺ کی خدمت میں حاضر ہوئے ..... آگے مذکورہ بالا حدیث کے مطابق بیان کیا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا,عبد اللہ بن نمیر نے ہشام سے سابقہ سند سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللهِ بْنُ نُمَيْرٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ حَكِيمَ بْنَ حِزَامٍ، أَعْتَقَ فِي الْجَاهِلِيَّةِ مِائَةَ رَقَبَةٍ، وَحَمَلَ عَلَى مِائَةِ بَعِيرٍ، ثُمَّ أَعْتَقَ فِي الْإِسْلَامِ مِائَةَ رَقَبَةٍ وَحَمَلَ عَلَى مِائَةِ بَعِيرٍ، ثُمَّ أَتَى النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَذَكَرَ نَحْوَ حَدِيثِهِمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7891,
                "hadithNumber": "327",
                "englishNarrator": "It is narrated on the authority of 'Abdullah (bin Mas'ud) رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "When this verse was revealed: It is those who believe and confound not their belief with wrongdoing (vi. 82), the Companions of the Messenger of Allah wore greatly perturbed. They said: Who amongst us (is so fortunate) that he does not wrong himself? Upon this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) remarked: It does not mean that which you presume It implies that which Luqman said to his son: O my son, do not associate anything with Allah, for indeed it is the gravest wrongdoing (xxxi. 13).",
                "hadithUrdu": "جب یہ آیت اتری : ’’ جولوگ ایمان لائے اور انہوں نے اپنے ایمان کے ساتھ ظلم کی آمیزش نہیں کی ۔ ‘ ‘ تو رسول اللہ ﷺ کے صحابہ پر یہ آیت گراں گزری اور انہوں نے گزارش کی : ہم میں سے کون ہے جو اپنے نفس پر ظلم نہ کرتا ہو ؟ تو رسول اللہ ﷺ نے فرمایا : ’’اس آیت کا مطلب وہ نہیں جو تم سمجھتے ہو ۔ ظلم وہ ہے جس طرح لقمان نے اپنے بیٹے سے کہا تھا : ’’ اے بیٹے! اللہ کےساتھ شرک نہ کرنا ، شرک یقیناً بہت بڑا ظلم ہے ۔ ‘ ‘",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا,عبد اللہ بن ادریس ، ابو معاویہ اور وکیع اعمش نے حدیث سنائی ، انہوں نے ابراہیم سے ، انہوں نے علقمہ سے اورانہوں نے حضرت عبد اللہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللهِ بْنُ إِدْرِيسَ، وَأَبُو مُعَاوِيَةَ، وَوَكِيعٌ، عَنِ الْأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللهِ، قَالَ: لَمَّا نَزَلَتْ: {الَّذِينَ آمَنُوا وَلَمْ يَلْبِسُوا} [الأنعام: 82] إِيمَانَهُمْ بِظُلْمٍ شَقَّ ذَلِكَ عَلَى أَصْحَابِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَقَالُوا: أَيُّنَا لَا يَظْلِمُ نَفْسَهُ؟ فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: لَيْسَ هُوَ كَمَا تَظُنُّونَ، إِنَّمَا هُوَ كَمَا قَالَ لُقْمَانُ لِابْنِهِ: {يَا بُنَيَّ لَا تُشْرِكْ بِاللهِ إِنَّ الشِّرْكَ} [لقمان: 13] لَظُلْمٌ عَظِيمٌ .",
                "headingArabic": "صِدْقِ الإِيمَانِ وَإِخْلاَصِهِ ‏‏",
                "headingUrdu": "ایمان کا اخلاص اور اس کی پاکیزگی",
                "headingEnglish": "Sincerity of Faith and its Purity",
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7892,
                "hadithNumber": "328",
                "englishNarrator": null,
                "hadithEnglish": "This hadith is narrated by another chain of transmitters, (namely) lshaq bin Ibrahim. Ibn Idris says: My father transmitted it from Aban bin Taghlib who heard it from A'mash; then I heard it also from him (A'mash).",
                "hadithUrdu": "اسحٰق بن ابراہیم اور علی بن خشرم نے کہا : ہمیں عیسٰی بن یونس نے خبر دی ، نیز منجاب بن حارث تمیمی نے کہا : ہمیں ابن مسہر نے خبر دی ، نیز ابو کریب نے کہا : ہمیں ابن ادریس نے خبر دی ، پھر ان تینوں ( عیسیٰ ، ابن مسہر اور ابن ادریس ) نے اعمش سے اسی سند کے ساتھ یہی حدیث بیان کی ۔ ابوکریب نے کہا : ابن ادریس نے کہا : پہلے مجھے میرے والد نے ابان بن تغلب سے اور انہوں نے اعمش سے روایت کی ، پھر میں نے یہ روایت خود انہی ( اعمش ) سے سنی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَلِيُّ بْنُ خَشْرَمٍ، قَالَا: أَخْبَرَنَا عِيسَى وَهُوَ ابْنُ يُونُسَ، ح، وَحَدَّثَنَا مِنْجَابُ بْنُ الْحَارِثِ التَّمِيمِيُّ، أَخْبَرَنَا ابْنُ مُسْهِرٍ، ح، وَحَدَّثَنَا أَبُو كُرَيْبٍ، أَخْبَرَنَا ابْنُ إِدْرِيسَ، كُلُّهُمْ عَنِ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ. قَالَ أَبُو كُرَيْبٍ: قَالَ ابْنُ إِدْرِيسَ، حَدَّثَنِيهِ أَوَّلًا أَبِي، عَنْ أَبَانَ بْنِ تَغْلِبَ، عَنِ الْأَعْمَشِ، ثُمَّ سَمِعْتُهُ مِنْهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7893,
                "hadithNumber": "329",
                "englishNarrator": "It is reported on the authority of Abu Huraira رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "When it was revealed to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ): To Allah belongs whatever is in the heavens and whatever is in the earth and whether you disclose that which is in your mind or conceal it, Allah will call you to account according to it. Then He forgives whom He pleases and chastises whom He Pleases; and Allah is over everything Potent (ii. 284). the Companions of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) felt it hard and severe and they came to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and sat down on their knees and said: Messenger of Allah, we were assigned some duties which were within our power to perform, such as prayer, fasting, struggling (in the cause of Allah), charity. Then this (the above-mentioned) verse was revealed unto you and it is beyond our power to live up to it. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Do you intend to say what the people of two books (Jews and Christians) said before you: We hear and disobey ? You should rather say: We hear and we obey, (we seek) Thy forgiveness, our Lord! and unto Thee is the return. And they said: We hear and we obey, (we seek) Thy forgiveness, Our Lord! and unto Thee is the return. When the people recited it and it smoothly flowed on their tongues, then Allah revealed immediately afterwards: The Apostle believes in that which is sent down unto him from his Lord, and so do the believers. Each one believes in Allah and His Angels and His Books and His Apostles, saying: We differentiate not between any of His Apostles and they say: We hearken and we obey: (we seek) Thy forgiveness, our Lord! and unto Thee is the return (ii. 285). When they did that, Allah abrogated this (verse) and the Great, Majestic Allah revealed: Allah burdens not a soul beyond its capacity. It gets every good that it earns and it suffers every ill that it earns. Our Lord, punish us not if we forget or make a mistake. (The Prophet said: ) Yes, our Lord! do not lay on us a burden as Thou didst lay on those before us. (The Prophet said: ) Yes, our Lord, impose not on us (burdens) which we have not the strength to bear (The Prophet said: ) Yes, and pardon us and grant us protection! and have mercy on us. Thou art our Patron, so grant us victory over the disbelieving people (ii. 286). He (the Lord) said: Yes.",
                "hadithUrdu": "جب رسول اللہ ﷺ پر یہ آیت اتری : ’’ آسمانوں اور زمین میں جو کچھ ہے ، اللہ ہی کا ہے اور تمہارے دلوں میں جو کچھ ہے اسے ظاہر کرو یا چھپاؤ ، اللہ تعالیٰ اس پر تمہارا محاسبہ کرے گا ، پھر جسے چاہے گا بخش دے گا اور جسے چاہے گا عذاب دے گا اور ا للہ ہر چیز پر قادر ہے ۔ ‘ ‘ تو رسول اللہ ﷺ سے ساتھیوں پر یہ بات انتہائی گراں گزری ۔ کہا : وہ رسول اللہ ﷺ کی خدمت میں حاضر ہوئے اور گھٹنوں کے بل بیٹھ کر کہنے لگے : اے اللہ کے رسول ! ( پہلے ) ہمیں ایسے اعمال کا پابند کیا گیا جو ہماری طاقت میں ہیں : نماز ، روزہ ، جہاد اور صدقہ او راب آپ پر یہ آیت اتری ہے جس کی ہم طاقت نہیں رکھتے ۔ رسول اللہ ﷺ نے فرمایا : ’’ کیا تم وہی بات کہنا چاہتے ہو جو تم سے پہلے دونوں اہل کتاب نے کہی : ہم نے سنا اور نافرمانی کی ! بلکہ تم کہو : ہم نے سنا اور اطاعت کی ۔ اے ہمارے رب ! تیری بخشش چاہتے ہیں اور تیری ہی طرف لوٹنا ہے ۔ ‘ ‘ جب صحابہ نے یہ الفاظ دہرانے لگے اور ان کی زبانیں ان الفاظ پر رواں ہو گئیں ، تو اس کے بعد اللہ تعالیٰ نے یہ آیت اتاری : ’’رسو ل اللہ ﷺ اس ( ہدایت ) پر ایمان لائے جوان کے رب کی طرف ان پر نازل کی گئی اور سارے مومن بھی ۔ سب ایمان لائے اللہ پر ، اس کے فرشتوں پر ، اس کی کتابوں پر اور اس کے رسولوں پر ، ( اورکہا : ) ہم ( ایمان لانے میں ) اس کے رسولوں کے درمیان فرق نہیں کرتے اور انہوں نے کہا : ہم نے سنا اور ہم نے اطاعت کی ، اے ہمارے رب !تیری بخشش چاہتے ہیں اور تیری ہی طرف لوٹ کر آنا ہے ۔ ‘ ‘ چنانچہ جب انہوں نے یہ ( مان کر اس پر عمل ) کیا تو اللہ عزوجل نےاس آیت ( کے ابتدائی معنی ) منسوخ کرتے ہوئے یہ آیت نازل فرمائی : ’’ اللہ کسی شخص پر اس کی طاق سے زیادہ بوجھ نہیں ڈالتا ۔ اس نے جو ( نیکی ) کمائی اورجو ( برائی ) کمائی ( اس کا وبال ) اسی پر ہے ، اے ہمارے رب ! اگر ہم بھول جائیں یا ہم خطا کریں تو ہمارا مؤاخذہ نہ کرنا ۔ ‘ ‘ ( اللہ نے ) فرمایا : ہاں ۔ ( انہوں نے کہا : ) ’’ اے ہمارے پروردگار ! اور ہم پر ایسا بوجھ نہ ڈال جیسا تو نے ان لوگوں پر ڈالا جوہم سے پہلے ( گزر چکے ) ہیں ۔ ‘ ‘ ( اللہ نے ) فرمایا : ہاں! ( پھر کہا : ) ’’اے ہمارے رب ! ہم سے وہ چیز نہ اٹھوا جس کے اٹھانے کی ہم میں طاقت نہیں ۔ ‘ ‘ ( اللہ نے ) فرمایا : ہاں ! ( پھر کہا : ) ’’ او رہم سےدرگزر فرما اور ہمیں بخشش دے اور ہم پر مہربانی فرما ۔ تو ہی ہمارا کارساز ہے ، پس تو کافروں کے مقابلے میں ہماری مدد فرما ۔ ‘ ‘ ( اللہ نے ) فرمایا : ہاں ۔",
                "urduNarrator": "اور محمد بن منہال الضریر اور امیہ بن بسطام العیشی کی حدیث اور امیہ کا قول ہے جس نے کہا,زید بن زری کی حدیث، یہ ابن القاسم کی طرح ہے، العلا کی سند پر۔ . اپنے والد کے حکم پر,حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ مِنْهَالٍ الضَّرِيرُ، وَأُمَيَّةُ بْنُ بِسْطَامَ الْعَيْشِيُّ، وَاللَّفْظُ لِأُمَيَّةَ، قَالَا: حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا رَوْحٌ وَهُوَ ابْنُ الْقَاسِمِ، عَنِ الْعَلَاءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ قَالَ: لَمَّا نَزَلَتْ عَلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ {لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ وَإِنْ تُبْدُوا مَا فِي أَنْفُسِكُمْ أَوْ تُخْفُوهُ يُحَاسِبْكُمْ بِهِ اللهُ فَيَغْفِرُ لِمَنْ يَشَاءُ وَيُعَذِّبُ مَنْ يَشَاءُ وَاللهُ عَلَى كُلِّ شَيْءٍ قَدِيرٌ} [البقرة: 284]، قَالَ: فَاشْتَدَّ ذَلِكَ عَلَى أَصْحَابِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَأَتَوْا رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ثُمَّ بَرَكُوا عَلَى الرُّكَبِ، فَقَالُوا: أَيْ رَسُولَ اللهِ، كُلِّفْنَا مِنَ الْأَعْمَالِ مَا نُطِيقُ، الصَّلَاةَ وَالصِّيَامَ وَالْجِهَادَ وَالصَّدَقَةَ، وَقَدِ اُنْزِلَتْ عَلَيْكَ هَذِهِ الْآيَةُ وَلَا نُطِيقُهَا، قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: أَتُرِيدُونَ أَنْ تَقُولُوا كَمَا قَالَ أَهْلُ الْكِتَابَيْنِ مِنْ قَبْلِكُمْ سَمِعْنَا وَعَصَيْنَا؟ بَلْ قُولُوا: سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ ، قَالُوا: سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ، فَلَمَّا اقْتَرَأَهَا الْقَوْمُ، ذَلَّتْ بِهَا أَلْسِنَتُهُمْ، فَأَنْزَلَ اللهُ فِي إِثْرِهَا: {آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ كُلٌّ آمَنَ بِاللهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ وَقَالُوا سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ} [البقرة: 285]، فَلَمَّا فَعَلُوا ذَلِكَ نَسَخَهَا اللهُ تَعَالَى، فَأَنْزَلَ اللهُ عَزَّ وَجَلَّ: {لَا يُكَلِّفُ اللهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا} [البقرة: 286] قَالَ: نَعَمْ {رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا} [البقرة: 286] قَالَ: نَعَمْ {رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ} [البقرة: 286] قَالَ: نَعَمْ {وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ} [البقرة: 286] قَالَ: نَعَمْ.",
                "headingArabic": "بيان تجاوز الله تعالٰى عن حديث النفس والخواطربالقلب إذا لم تستقر وبيان أنه سبحانه وتعالٰى لم يكلف إلَّا ما يطاق وبيان حكم الهم بالحسنة وبالسئة",
                "headingUrdu": "اس بات کی وضاحت کہ اللہ عزوجل انسان کے خیالات اور جو کچھ اس کے دل میں ہوتا ہے اس کی اجازت دیتا ہے جب تک کہ وہ قائم نہ ہو جائیں اور یہ وضاحت کہ وہ بزرگ و برتر ہے کسی پر اس کی طاقت سے زیادہ بوجھ نہیں ڈالتا۔ اور اچھے اور برے کام کرنے کے بارے میں سوچنے کا حکم واضح کرنا",
                "headingEnglish": "Clarification that Allah, most high allows a person's thoughts and whatever occurs in his heart, so long as they do not become established, and the clarification that he, glorious is he and most high, does not burden anyone with more than he can bear, and clarifying the ruling on thinking of doing good and bad deeds",
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7894,
                "hadithNumber": "330",
                "englishNarrator": "It is narrated on the authority of Ibn 'Abbas رضی اللہ عنہ :",
                "hadithEnglish": "When this verse: Whether you disclose that which is in your mind or conceal it, Allah will call you to account according to it (ii 284), there entered in their minds something (of that fear) such as had never entered their hearts (before). The Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم) observed: Say: We have heard and obeyed and submitted ourselves. He (the reporter) said: Allah instilled faith in their hearts and He revealed this verse: Allah burdens not a soul beyond its capacity. It gets every good that it earns and it suffers every ill that it earns. Our Lord, call us not to account if we forget or make a mistake. He the (Lord) said: I indeed did it. Our Lord! do not lay on us a burden as Thou didst lay on those before us. He (our Lord) said: I indeed did it. And pardon us, have mercy on us. Thou art our Protector (ii. 286). He said: I indeed did it.",
                "hadithUrdu": "انہوں نے کہا : جب یہ آیت نازل ہوئی : ’’ تمہارے دلوں میں جو کچھ ہے ، اس کو ظاہر کر دیا چھپاؤ ، اللہ اس پر تمہارا مؤاخذہ کرے گا ۔ ‘ ‘ ( ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ) کہا : اس سے صحابہ کے دلوں میں ایک چیز ( شدید خوف کی کیفیت کہ احکام الہٰی کے اس تقاضے پر عمل نہ ہو سکے گا ) در آئی جو کسی اور بات سے نہیں آئی تھی ۔ تب نبی ﷺ نے فرمایا : ’’ کہو : ہم نے سنا او رہم نے اطاعت کی او رہم نے تسلیم کیا ۔ ‘ ‘ ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : اس پر اللہ تعالیٰ کسی نفس پر اس کی طاقت سے زیادہ بوجھ نہیں ڈالتا ۔ اسی کے لیے ہے جو اس نے کمایا اور اسی پر ( وبال ) پڑتا ہے ( اسی پر برائی کا ) جس کا اس نے ارتکاب کیا ۔ اے ہمارے رب ! اگر ہم بھول جائیں یا چوک جائیں تو ہماری مؤاخذہ نہ کرنا ۔ ‘ ‘ اللہ نے فرمایا : میں نے ایسا کر دیا ۔ ’’ اے ہمارے رب ! ہم پر ایسا بوجھ نہ ڈال جیسا کہ تو ان لوگوں پر ڈالا جو ہم سے پہلے تھے ۔ ‘ ‘ فرمایا : میں ایسا کر دیا ۔ ’’ہمیں بخش دے او رہم پر رحم فرما ، تو ہی ہمارا مولیٰ ہے ۔ ‘ ‘ اللہ نے فرمایا : میں نے ایسا کر دیا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، ابو کریب اور اسحاق بن ابراہیم نے بیان کیا، اور یہ قول ابوبکر سے ہے کہ انہوں نے ہمیں خبر دی، اور دوسرے نے کہا: ہم سے وکیع نے سفیان کی روایت سے بیان کیا۔ خالد کے موکل آدم بن سلیمان کی سند، انہوں نے کہا: میں نے سعید بن جبیر کو ابن عباس رضی اللہ عنہ سے کہتے ہوئے سنا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَاللَّفْظُ لِأَبِي بَكْرٍ، قَالَ إِسْحَاقُ: أَخْبَرَنَا، وَقَالَ الْآخَرَانِ: حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ آدَمَ بْنِ سُلَيْمَانَ، مَوْلَى خَالِدٍ، قَالَ: سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ، يُحَدِّثُ عَنِ ابْنِ عَبَّاسٍ، قَالَ: لَمَّا نَزَلَتْ هَذِهِ الْآيَةُ: {وَإِنْ تُبْدُوا مَا فِي أَنْفُسِكُمْ أَوْ تُخْفُوهُ يُحَاسِبْكُمْ بِهِ اللهُ} [البقرة: 284]، قَالَ: دَخَلَ قُلُوبَهُمْ مِنْهَا شَيْءٌ لَمْ يَدْخُلْ قُلُوبَهُمْ مِنْ شَيْءٍ، فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: قُولُوا: سَمِعْنَا وَأَطَعْنَا وَسَلَّمْنَا قَالَ: فَأَلْقَى اللهُ الْإِيمَانَ فِي قُلُوبِهِمْ، فَأَنْزَلَ اللهُ تَعَالَى: {لَا يُكَلِّفُ اللهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا} [البقرة: 286] قَالَ: قَدْ فَعَلْتُ {رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا} [البقرة: 286] قَالَ: قَدْ فَعَلْتُ {وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا} [البقرة: 286] قَالَ: قَدْ فَعَلْتُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7895,
                "hadithNumber": "331",
                "englishNarrator": "It is narrated on the authority of Abu Huraira رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) observed: Verily Allah forgave my people the evil promptings which arise within their hearts as long as they did not speak about them or did not act upon them.",
                "hadithUrdu": "رسول ا للہﷺ نے فرمایا : ’’ بلاشبہ اللہ تعالیٰ نے میری امت کی ان باتوں سے درگزر فرمایا ہے جو وہ ( دل میں ) اپنے آپ سے کریں : جب تک وہ ان کو زبان پر نہ لائیں یا ان پر عمل نہ کریں ۔ ‘ ‘",
                "urduNarrator": "ہم سے سعید بن منصور، قتیبہ بن سعید اور محمد بن عبید الغباری نے بیان کیا، اور لفظ سعید کے لیے ہے، انہوں نے کہا,ابو عوانہ نے قتادہ سے حدیث سنائی ، انہوں نے زرارہ بن اوفیٰ سے اور انہوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نےکہا",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وُمُحَمَّدُ بْنُ عُبَيْدٍ الْغُبَرِيُّ، وَاللَّفْظُ لِسَعِيدٍ، قَالُوا: حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ بْنِ أَوْفَى، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللهَ تَجَاوَزَ لِأُمَّتِي مَا حَدَّثَتْ بِهِ أَنْفُسَهَا، مَا لَمْ يَتَكَلَّمُوا، أَوْ يَعْمَلُوا بِهِ.",
                "headingArabic": "جَاوُزِ اللَّهِ عَنْ حَدِيثِ النَّفْسِ، وَالْخَوَاطِرِ، بِالْقَلْبِ إِذَا لَمْ تَسْتَقِرَّ ‏‏",
                "headingUrdu": "اللہ انسان کے خیالات اور جو کچھ اس کے دل میں ہوتا ہے اس کی اجازت دیتا ہے جب تک کہ وہ قائم نہ ہوں۔",
                "headingEnglish": "Allah allows a person's thoughts and whatever occurs in his heart so long as they do not become established",
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7896,
                "hadithNumber": "332",
                "englishNarrator": "It is narrated on the authority of Abu Huraira رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) observed: Verily the Great and Mighty Allah forgave my people the evil promptings arising in their minds, but they neither talked about them nor acted upon them.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’ بلاشبہ اللہ تعالیٰ نے میری امت کی ان باتوں سے درگزر فرمایا ہے جو وہ دل میں اپنے آپ سے کریں ، جب تک اس پر عمل یا کلام نہ کریں ۔ ‘ ‘",
                "urduNarrator": "ہم سے عمرو النقید نے بیان کیا، اور ہم سے زہیر بن حرب نے بیان کیا، کہا کہ ہم سے اسماعیل بن ابراہیم نے بیان کیا، ان سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے علی بن ایم نے سحر نے بیان کیا، اور ان سے عبدہ بن سلیمان نے۔ ہم سے ابن المثنیٰ اور ابن بشار نے بیان کیا، کہا: ہم سے ابن ابی عدی نے بیان کیا، یہ سب سعید بن ابی عروبہ نے قتادہ سے ، انہوں نے زرارہ بن اوفیٰ سے اور انہوں نے ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نےکہا کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ قَالَا: حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، ح، وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، وَعَبْدَةُ بْنُ سُلَيْمَانَ، ح، وَحَدَّثَنَا ابْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ كُلُّهُمْ عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللهَ عَزَّ وَجَلَّ تَجَاوَزَ لِأُمَّتِي عَمَّا حَدَّثَتْ بِهِ أَنْفُسَهَا، مَا لَمْ تَعْمَلْ، أَوْ تَكَلَّمْ بِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7897,
                "hadithNumber": "333",
                "englishNarrator": null,
                "hadithEnglish": "The same hadith has been narrated by Zuhair bin Harb, Waki, Ishaq bin Mansur, Husain bin 'Ali.",
                "hadithUrdu": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے وکیع نے بیان کیا,مسعر ، ہشام اور شیبان سب نے قتادہ سے سابقہ سند کے ساتھ اسی حدیث کی طرح روایت کی ۔\r\n\r\nہم سے زہیر بن حرب نے بیان کیا، کہا ہم سے وکیع نے بیان کیا، انہیں مسعر اور ہشام نے، اور ہم سے اسحاق بن منصور نے بیان کیا، کہا ہم سے حسین بن علی نے بیان کیا، انہوں نے ذی عائدہ سے اور شعبان سے۔ تمام قتادہ کے اختیار میں، اس کے مشابہ نشریات کے سلسلے کے ساتھ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا مِسْعَرٌ، وَهِشَامٌ، ح، وَحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا الْحُسَيْنُ بْنُ عَلِيٍّ، عَنْ زَائِدَةَ، عَنْ شَيْبَانَ جَمِيعًا عَنْ قَتَادَةَ، بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7898,
                "hadithNumber": "334",
                "englishNarrator": "It is narrated on the authority of Abu Huraira رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: The Great and the Glorious Lord said (to angels): Whenever My bondsman intends to corn it an evil, do not record it against him, but if he actually commits it, then write it as one evil. And when he intends to do good but does not do it, then take it down is one act of goodness, but if he does it, then write down ten good deeds (in his record).",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’ اللہ عز وجل نے فرمایا : جب میرا بندہ کسی برائی کا قصد کرے تو اس کو ( اس کے نامہ اعمال میں ) نہ لکھو ۔ اگر وہ اس کو کر گزرے تو اسے ایک برائی لکھو ۔ اور جب کسی نیکی کا قصد کرے تو اس کو ایک نیکی لکھ لو ، پھر اگر اس پر عمل کرے تو دس نیکیاں لکھو ۔ ‘ ‘",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، زہیر بن حرب اور اسحاق بن ابراہیم نے بیان کیا، اور یہ قول ابوبکر سے ہے، انہوں نے کہا: ہم سے سفیان نے بیان کیا، دوسرے دونوں نے کہا: ہم سے ابن عیینہ نے ابو الزناد سے بیان کیا،اعرج نے حضرت ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَاللَّفْظُ لِأَبِي بَكْرٍ، قَالَ إِسْحَاقُ: أَخْبَرَنَا سُفْيَانُ، وَقَالَ الْآخَرَانِ: حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: قَالَ اللهُ عَزَّ وَجَلَّ: إِذَا هَمَّ عَبْدِي بِسَيِّئَةٍ فَلَا تَكْتُبُوهَا عَلَيْهِ، فَإِنْ عَمِلَهَا فَاكْتُبُوهَا سَيِّئَةً، وَإِذَا هَمَّ بِحَسَنَةٍ فَلَمْ يَعْمَلْهَا فَاكْتُبُوهَا حَسَنَةً، فَإِنْ عَمِلَهَا فَاكْتُبُوهَا عَشْرًا.",
                "headingArabic": "إِذَا هَمَّ الْعَبْدُ بِحَسَنَةٍ كُتِبَتْ وَإِذَا هَمَّ بِسَيِّئَةٍ لَمْ تُكْتَبْ ‏‏",
                "headingUrdu": "اگر کوئی نیکی کرنے کا سوچے تو اس کے لیے لکھ دیا جائے گا اور اگر برا کرنے کا خیال آئے تو اس کے لیے نہیں لکھا جائے گا۔",
                "headingEnglish": "If a person thinks of doing a good deed it will be recorded for him, and if he thinks of doing a bad deed it will not be recorded for him",
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7899,
                "hadithNumber": "335",
                "englishNarrator": "It is narrated on the authority of Abu Huraira رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) observed: Allah, the Great and Glorious, said: Whenever my bondsman intends to do good, but does not do it, I write one good act for him, but if he puts it into practice I wrote from ten to seven hundred good deeds in favour of him. When he intends to commit an evil, but does not actually do it, do not record it. But if he does it, I write only one evil.",
                "hadithUrdu": "رسول اللہ ﷺ سے روایت کی کہ آپ نے کہا : ’’ اللہ تعالیٰ نے فرمایا : جب میرا بندہ کسی نیکی کا قصد کرے اور اس کو عمل میں نہ لائے تو میں اس کے لیے ایک نیکی لکھوں گا ، پھر اگر وہ اسے کر لے تو میں اس کو دس سے سات سو گنا برس تک لکھوں گا اور جب میرا بندہ کسی برائی کا قصدکرے اور اس کو عمل میں نہ لائے تو اس میں اس بندے کے خلاف نہیں لکھوں گا ، پھر اگر وہ اس پر عمل کرے تو میں ایک برائی لکھوں گا ۔ ‘ ‘",
                "urduNarrator": "ہم سے یحییٰ بن ایوب، قتیبہ اور ابن حجر نے بیان کیا، انہوں نے کہا, ہم سے اسماعیل، جو ابن جعفر ہیں، نے بیان کیا,علاء کے والد عبد الرحمن بن یعقوب نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انہوں نے",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ حُجْرٍ، قَالُوا: حَدَّثَنَا إِسْمَاعِيلُ وَهُوَ ابْنُ جَعْفَرٍ، عَنِ الْعَلَاءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: قَالَ اللهُ عَزَّ وَجَلَّ: إِذَا هَمَّ عَبْدِي بِحَسَنَةٍ وَلَمْ يَعْمَلْهَا، كَتَبْتُهَا لَهُ حَسَنَةً، فَإِنْ عَمِلَهَا كَتَبْتُهَا عَشْرَ حَسَنَاتٍ إِلَى سَبْعِ مِائَةِ ضِعْفٍ، وَإِذَا هَمَّ بِسَيِّئَةٍ وَلَمْ يَعْمَلْهَا، لَمْ أَكْتُبْهَا عَلَيْهِ، فَإِنْ عَمِلَهَا كَتَبْتُهَا سَيِّئَةً وَاحِدَةً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7900,
                "hadithNumber": "336",
                "englishNarrator": "Abu Huraira reported that Muhammad ﷺ:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), said: When it occurs to my bondsman that he should do a good deed but he actually does not do it, record one good to him, but if he puts it into practice, I make an entry of ten good acts in his favour. When it occurs to him to do evil, but he does not commit it, I forgive that. But if he commits it, I record one evil against his name. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) observed. The angels said: That bondsman of Yours intends to commit evil. though His Lord is more Vigilant than he. Upon this He (the Lord) said: Watch him; if he commits (evil), write it against his name but if he refrains from doing it, write one good deed or him, for he desisted from doing it for My sake. The Messenger of Allah said: He who amongst you is good of faith, all his good acts are multiplied from ten to seven hundred times (and are recorded in his name) and all the evils that he commits are recorded as such (i, e. without increase) till he meets Allah.",
                "hadithUrdu": "رسو ل اللہ ﷺنے بتایا : ’’ اللہ تعالیٰ نے فرمایا : جب میرا بندہ ( دل میں ) یہ بات کرتا ہے کہ وہ نیکی کرے گا تو میں اس کے لیے ایک نیکی لکھ دیتا ہوں ، جب تک عمل نہ کرے ، پھر اگر اس کوعمل میں لے آئے تو میں اسے دس گناہ لکھ لیتا ہوں اور جب ( دل میں ) برائی کرنے کی بات کرتا ہے تو میں اسے معاف کر دیتا ہوں جب تک اس پر عمل نہ کرے ۔ جب وہ اس کو عمل میں لے آئے تو میں اسے اس کے برابر ( ایک ہی برائی ) لکھتا ہوں ۔ ‘ ‘ اور رسو ل اللہ ﷺ نے فرمایا : ’’ فرشتوں نے کہا : اے رب ! یہ تیرا بندہ ہے ، برائی کرنا چاہتا ہے او راللہ اس کو خوب دیکھ رہا ہوتا ہے ، اللہ فرماتا ہے : اس پر نظر رکھو ، پس اگر وہ برائی کرے تو اس کے برابر ( ایک برائی ) لکھ لو اور اگر اس کو چھوڑ دے تو اس کے لیے اسے ایک نیکی لکھو ( کیونکہ ) اس نے میری خاطر اسے چھوڑا ہے ۔ ‘ ‘ اوررسو ل اللہﷺ نے فرمایا : ’’ جب تم میں سے ایک انسان اپنے اسلام کو خالص کر لیتا ہے تو ہر نیکی جو وہ کرتا ہے ، دس گناہ سے لے کر سات سو گنا تک لکھی جاتی ہے اور ہر برائی جو وہ کرتا ہے ، اسے اس کے لیے ایک ہی لکھا جاتا ہے یہاں تک کہ وہ اللہ سے جاملتا ہے ۔ ‘ ‘",
                "urduNarrator": "ہم سے محمد بن رافع نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، کہا ہم سے معمر نے بیان کیا,ہمام بن منبہ نے روایت کرتے ہوئے کہا : یہ وہ حدیثیں ہیں جو ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ہمیں محمد رسول اللہ ﷺ سے سنائیں ، پھر انہوں نے کچھ احادیث ذکر کیں ، ان میں سے ایک یہ ہے ، کہا",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ: هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ مُحَمَّدٍ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَذَكَرَ أَحَادِيثَ مِنْهَا قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: قَالَ اللهُ عَزَّ وَجَلَّ: إِذَا تَحَدَّثَ عَبْدِي بِأَنْ يَعْمَلَ حَسَنَةً، فَأَنَا أَكْتُبُهَا لَهُ حَسَنَةً مَا لَمْ يَعْمَلْ، فَإِذَا عَمِلَهَا، فَأَنَا أَكْتُبُهَا بِعَشْرِ أَمْثَالِهَا، وَإِذَا تَحَدَّثَ بِأَنْ يَعْمَلَ سَيِّئَةً، فَأَنَا أَغْفِرُهَا لَهُ مَا لَمْ يَعْمَلْهَا، فَإِذَا عَمِلَهَا، فَأَنَا أَكْتُبُهَا لَهُ بِمِثْلِهَا وَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: قَالَتِ الْملَائِكَةُ: رَبِّ، ذَاكَ عَبْدُكَ يُرِيدُ أَنْ يَعْمَلَ سَيِّئَةً، وَهُوَ أَبْصَرُ بِهِ، فَقَالَ: ارْقُبُوهُ فَإِنْ عَمِلَهَا فَاكْتُبُوهَا لَهُ بِمِثْلِهَا، وَإِنْ تَرَكَهَا فَاكْتُبُوهَا لَهُ حَسَنَةً، إِنَّمَا تَرَكَهَا مِنْ جَرَّايَ وَقَالَ رسولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا أَحْسَنَ أَحَدُكُمْ إِسْلَامَهُ، فَكُلُّ حَسَنَةٍ يَعْمَلُهَا تُكْتَبُ بِعَشْرِ أَمْثَالِهَا إِلَى سَبْعِ مِائَةِ ضِعْفٍ، وَكُلُّ سَيِّئَةٍ يَعْمَلُهَا تُكْتَبُ بِمِثْلِهَا حَتَّى يَلْقَى اللهَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7901,
                "hadithNumber": "337",
                "englishNarrator": "It is narrated on the authority of Abu Huraira رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) observed: He who intended to do good, but did not do it, one good was recorded for him, and he who intended to do good and also did it, ten to seven hundred good deeds were recorded for him. And he who intended evil, but did not commit it, no entry was made against his name, but if he committed that, it was recorded.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’ جس نے کسی نیکی کا ارادہ کیا ، پھر اس پر عمل نہیں کیا ، اس کے لیے ایک نیکی لکھی جاتی ہے او رجس نے کسی نیکی کا ارادہ کر کے اس پر عمل بھی کیا ، اس کے لیے دس سے سات سو گنا تک نیکیاں لکھی جاتی ہیں او رجس نے کسی برائی کا ارادہ کیا لیکن اس کا ارتکاب نہیں کیا تو وہ نہیں لکھی جاتی اور اگر اس کا ارتکاب کیا تو وہ لکھی جاتی ہے ۔ ‘ ‘",
                "urduNarrator": "ہم سے ابو کریب نے بیان کیا، کہا ہم سے ابو خالد الاحمر نے بیان کیا، ہشام کی سند سے,ابن سیرین نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے کہا :",
                "hadithArabic": "وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ، عَنْ هِشَامٍ، عَنِ ابْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ هَمَّ بِحَسَنَةٍ فَلَمْ يَعْمَلْهَا، كُتِبَتْ لَهُ حَسَنَةً، وَمَنْ هَمَّ بِحَسَنَةٍ فَعَمِلَهَا، كُتِبَتْ لَهُ عَشْرًا إِلَى سَبْعِ مِائَةِ ضِعْفٍ، وَمَنْ هَمَّ بِسَيِّئَةٍ فَلَمْ يَعْمَلْهَا، لَمْ تُكْتَبْ، وَإِنْ عَمِلَهَا كُتِبَتْ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7902,
                "hadithNumber": "338",
                "englishNarrator": "It is narrated on the authority of Ibn Abbas ‌رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) transmitted it from the Blessed and Great Lord: Verily Allah recorded the good and the evil and then made it clear that he who intended good but did not do it, Allah recorded one complete good in his favour, but if he intended it and also did it, the Glorious and Great Allah recorded ten to seven hundred virtues and even more to his credit. But it he intended evil, but did not commit it, Allah wrote down full one good in his favour. If he intended that and also committed it, Allah made an entry of one evil against him.",
                "hadithUrdu": "انہوں نے رسو ل اللہ ﷺ سے روایت کی ( ان احادیث میں سے جنہیں وہ رسو ل اللہ ﷺ اپنے رب عزو جل سے روایت کرتے ہیں ) آپ ﷺ نے فرمایا : ’’بلاشبہ اللہ تعالیٰ کے نیکیاں اوربرائیاں لکھی ہیں ، پھر ان کی تفصیل بتائی ہے کہ جس نے کسی نیکی کا ارادہ کیا ، پھر وہ نیکی نہیں کی تو اللہ نے اسے اپنے ہاں ایک پوری نیکی لکھ دی ۔ اور اگر نیکی کا ارادہ کیا ، پھر وہ نیکی کر ڈالی تو اللہ عزوجل نے اسے اپنے ہاں دس سے سات سو گنا ( یا ) اس سے زیادہ گنا تک لکھ لیا ۔ اور اگر اس نے برائی کا ارادہ کیا ، پھر اس کا ارتکاب نہ کیا تو اللہ نے اسے اپنے ہاں ایک پوری نیکی لکھی ۔ اور اگر اس نے ( برائی کا ) ارادہ کیا اور اس کو کر ڈالا تو اللہ نے ایک برائی لکھی ۔ ‘ ‘",
                "urduNarrator": "ہم سے شیبان بن فرخ نے بیان کیا,عبدالوارث نے جعد ابو عثمان سے حدیث سنائی ، انہوں نےکہا , ہمیں ابو رجاء عطاردی نے حضرت ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے حدیث سنائی",
                "hadithArabic": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنِ الْجَعْدِ أَبِي عُثْمَانَ، حَدَّثَنَا أَبُو رَجَاءٍ الْعُطَارِدِيُّ، عَنِ ابْنِ عَبَّاسٍ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِيمَا يَرْوِي عَنْ رَبِّهِ تَبَارَكَ وَتَعَالَى، قَالَ: «إِنَّ اللهَ كَتَبَ الْحَسَنَاتِ وَالسَّيِّئَاتِ، ثُمَّ بَيَّنَ ذَلِكَ، فَمَنْ هَمَّ بِحَسَنَةٍ فَلَمْ يَعْمَلْهَا، كَتَبَهَا اللهُ عِنْدَهُ حَسَنَةً كَامِلَةً، وَإِنْ هَمَّ بِهَا فَعَمِلَهَا، كَتَبَهَا اللهُ عَزَّ وَجَلَّ عِنْدَهُ عَشْرَ حَسَنَاتٍ إِلَى سَبْعِ مِائَةِ ضِعْفٍ إِلَى أَضْعَافٍ كَثِيرَةٍ، وَإِنْ هَمَّ بِسَيِّئَةٍ فَلَمْ يَعْمَلْهَا، كَتَبَهَا اللهُ عِنْدَهُ حَسَنَةً كَامِلَةً، وَإِنْ هَمَّ بِهَا فَعَمِلَهَا، كَتَبَهَا اللهُ سَيِّئَةً وَاحِدَةً».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7903,
                "hadithNumber": "339",
                "englishNarrator": "This hadith has been narrated with another chain of transmitters with the addition of these words:",
                "hadithEnglish": "Allah would even wipe out (the evil committed by a man) and Allah does not put to destruction anyone except he who is doomed to destruction.",
                "hadithUrdu": "’’یا اللہ نے اسے مٹا دیا او راللہ کے ہاں صرف وہی ہلاک ہوتا ہے جو ( خود ) ہلاک ہونے والا ہے ( کہ اللہ کے اس قدر فضل و کرم کے باوجود تباہی سے بچ سکا ۔ ‘ ‘",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے بیان کیا,جعفر بن سلیمان نے جعد ابوعثمان سے عبد الوارث کی حدیث کے ہم معنی روایت کی اور یہ اضافہ کیا",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، حَدَّثَنَا جَعْفَرُ بْنُ سُلَيْمَانَ، عَنِ الْجَعْدِ أَبِي عُثْمَانَ، فِي هَذَا الْإِسْنَادِ بِمَعْنَى حَدِيثِ عَبْدِ الْوَارِثِ، وَزَادَ: «وَمَحَاهَا اللهُ وَلَا يَهْلِكُ عَلَى اللهِ إِلَّا هَالِكٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7904,
                "hadithNumber": "340",
                "englishNarrator": "It is narrated on the authority of Abu Huraira رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "Some people from amongst the Companions of the Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came to him and said: Verily we perceive in our minds that which every one of us considers it too grave to express. He (the Holy Prophet) said: Do you really perceive it? They said: Yes. Upon this he remarked: That is the faith manifest.",
                "hadithUrdu": "نبی ﷺ کے صحابہ میں سے کچھ لوگ حاضر ہوئے اور آپ سے پوچھا : ہم اپنے دلوں میں ایسی چیزیں محسوس کرتے ہیں کہ ہم میں سے کوئی ان کو زبان پر لانا بہت سنگین سمجھتا ہے ، آپ نے پوچھا : ’’ کیا تم نے واقعی اپنے دلوں میں ایسا محسوس کیا ہے ؟ ‘ ‘ انہوں نے عرض کی : جی ہاں ۔ آپ نے فرمایا : ’’ یہی صریح ایمان ہے ۔ ‘ ‘",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے جریر نے بیان کیا,سہیل نے اپنے والد سے ، انہوں نے ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: جَاءَ نَاسٌ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَسَأَلُوهُ: إِنَّا نَجِدُ فِي أَنْفُسِنَا مَا يَتَعَاظَمُ أَحَدُنَا أَنْ يَتَكَلَّمَ بِهِ، قَالَ: «وَقَدْ وَجَدْتُمُوهُ؟» قَالُوا: نَعَمْ، قَالَ: «ذَاكَ صَرِيحُ الْإِيمَانِ».",
                "headingArabic": "بَيَانِ الْوَسْوَسَةِ فِي الإِيمَانِ وَمَا يَقُولُهُ مَنْ وَجَدَهَا ‏‏",
                "headingUrdu": "ایمان کے بارے میں وسواس (سرگوشیاں، برے خیالات) کی وضاحت، اور جو شخص اس کا تجربہ کرے اسے کیا کہنا چاہیے",
                "headingEnglish": "Clarifying the Waswasah (Whispers, Bad Thoughts) with regard to faith, and what the one who experiences that should say",
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7905,
                "hadithNumber": "341",
                "englishNarrator": null,
                "hadithEnglish": "The same hadith has been transmitted by Muhammad bin 'Amr, Abu Bakr bin Ishaq, Abu'l-Jawwab, A'mash and Abu Huraira رضی ‌اللہ ‌عنہ ‌.",
                "hadithUrdu": "ہم سے محمد بن بشار نے بیان کیا، ہم سے ابن ابی عدی نے بیان کیا، شعبہ شعبہ، ہجری سے، مجھ سے محمد بن عمرو بن جبلہ بن ابی رواد نے بیان کیا اور مجھ سے ابوبکر نے ابن اسحاق نے بیان کیا، انہوں نے کہا: ابو ہم سے الجواب نے عمار بن رزاق کی سند سے بیان کیا اوراعمش نے ابو صالح سے ، انہوں نے حضرت ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انہوں نے بنی ﷺ سے یہ حدیث روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ شُعْبَةَ، ح، وَحَدَّثَنِي مُحَمَّدُ بْنُ عَمْرِو بْنِ جَبَلَةَ بْنِ أَبِي رَوَّادٍ، وَأَبُو بَكْرِ بْنُ إِسْحَاقَ، قَالَا: حَدَّثَنَا أَبُو الْجَوَّابِ، عَنْ عَمَّارِ بْنِ رُزَيْقٍ، كِلَاهُمَا عَنِ الْأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْحَدِيثِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7906,
                "hadithNumber": "342",
                "englishNarrator": "It is narrated on the authority of 'Abdullah bin Mas'ud رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "The Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was asked about evil prompting, to which he replied: It is pure faith.",
                "hadithUrdu": "نبی ﷺ سے وسوسے کے بارے میں پوچھا گیا تو آپ نے فرمایا : ’’یہی تو خالص ایمان ہے ۔",
                "urduNarrator": "ہم سے یوسف بن یعقوب الصفر نے بیان کیا، کہا کہ مجھ سے علی بن عثم نے سائر بن الخمس کی سند سے، مغیرہ کی سند سے، ابراہیم کی سند سے، علقمہ کی سند سے,حضرت عبد اللہ ( بن مسعود ( ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا يُوسُفُ بْنُ يَعْقُوبَ الصَّفَّارُ، حَدَّثَنِي عَلِيُّ بْنُ عَثَّامٍ، عَنْ سُعَيْرِ بْنِ الْخِمْسِ، عَنْ مُغِيرَةَ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللهِ، قَالَ: سُئِلَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ الْوَسْوَسَةِ، قَالَ: «تِلْكَ مَحْضُ الْإِيمَانِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7907,
                "hadithNumber": "343",
                "englishNarrator": "It is narrated on the authority of Abu Huraira رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Men will continue to question one another till this is propounded: Allah created all things but who created Allah? He who found himself confronted with such a situation should say: I affirm my faith in Allah.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’ لوگ ہمیشہ ایک دوسرے سے ( فضول ) سوالات کرتے رہیں گے یہاں تک کہ یہ سوال بھی ہو گا کہ اللہ نے سب مخلوق کو پیدا کیا ہے تو پھر اللہ کو کس نے پیدا کیا ہے ؟ جو شخص ایسی کوئی چیز دل میں پائے تو کہے : میں اللہ پر ایمان لایا ہوں ۔ ‘ ‘",
                "urduNarrator": "ہم سے ہارون بن معروف اور محمد بن عباد نے بیان کیا اور یہ الفاظ ہارون کے لیے ہیں، انہوں نے کہا,سفیان نے ہشام سے حدیث سنائی ، انہوں نے اپنےوالد ( عروہ ) سے ، انہوں نے حضرت ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، وَمُحَمَّدُ بْنُ عَبَّادٍ، وَاللَّفْظُ لِهَارُونَ، قَالَا: حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: لَا يَزَالُ النَّاسُ يَتَسَاءَلُونَ حَتَّى يُقَالَ: هَذَا خَلَقَ اللهُ الْخَلْقَ، فَمَنْ خَلَقَ اللهَ؟ فَمَنْ وَجَدَ مِنْ ذَلِكَ شَيْئًا، فَلْيَقُلْ: آمَنْتُ بِاللهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7908,
                "hadithNumber": "344",
                "englishNarrator": "This hadith has been transmitted by Mahmud bin Ghailan by another chain of transmitters (and the words are):",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: The Satan will come to everyone of you and say: Who created the heaven, who created the earth? (And the man) replies: It is Allah, Then the remaining part of the hadith was narrated as mentioned above and the words 'His prophets were added to it.",
                "hadithUrdu": "رسول ا للہ ﷺ نے فرمایا : ’’ تم میں سے کسی کے پاس شیطان آتا ہے او رکہتا ہے : آسمان کو کس نے پیدا کیا ؟ زمین کو کس نے پیدا کیا تو وہ ( جواب میں ) کہتا ہے اللہ نے ..... ‘ ‘ پھر اوپر والی روایت کی طرح بیان کی ’’اور اس کے رسولوں پر ( ایمان لایا ) ‘ ‘ کے الفاظ کا اضافہ کیا ۔",
                "urduNarrator": "ہم سے محمود بن غیلان نے بیان کیا، ہم سے ابو النضر نے بیان کیا،ابو سعید مؤدب نے ہشام بن عروہ سے اسی سند کے ساتھ روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا أَبُو النَّضْرِ، حَدَّثَنَا أَبُو سَعِيدٍ الْمُؤَدِّبُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، بِهَذَا الْإِسْنَادِ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: يَأْتِي الشَّيْطَانُ أَحَدَكُمْ فَيَقُولُ: مَنْ خَلَقَ السَّمَاءَ؟ مَنْ خَلَقَ الْأَرْضَ؟ فَيَقُولُ: اللهُ ثُمَّ ذَكَرَ بِمِثْلِهِ وَزَادَ، وَرُسُلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7909,
                "hadithNumber": "345",
                "englishNarrator": "It is narrated on the authority of Abu Huraira رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "The Messenger of Allah ﷺ observed: The Satan comes to everyone. of you and says: Who created this and that? till he questions: Who created your Lord? When he comes to that, one should seek refuge in Allah and keep away (from such idle thoughts).",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’ تم میں سے کسی کے پاس شیطان آ کر کہتا ہے کہ فلاں فلاں چیز کو کس نے پیدا کیا ؟ یہاں تک کہ اس سے کہتا ہے : تمہارےرب کو کس نے پیدا کیا ؟ جب بات یہاں تک پہنچے تو وہ اللہ سے پناہ مانگے او ر ( مزید سوچنے سے ) رک جائے ۔ ‘ ‘",
                "urduNarrator": "مجھ سے زہیر بن حرب اور عبد بن حمید سب نے یعقوب کی سند سے بیان کیا، کہا: ہم سے یعقوب بن ابراہیم نے بیان کیا,ابن شہاب کے بھتیجے ( محمد بن عبد اللہ بن مسلم ) نے اپنے چچا ( محمد بن مسلم زہری ) سے حدیث سنائی ، انہوں نے کہا : مجھے عروہ بن زبیر نے خبر دی کہ حضرت ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَعَبْدُ بْنُ حُمَيْدٍ، جَمِيعًا عَنْ يَعْقُوبَ، قَالَ زُهَيْرٌ: حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ أَخِي ابْنِ شِهَابٍ، عَنْ عَمِّهِ، قَالَ: أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: يَأْتِي الشَّيْطَانُ أَحَدَكُمْ فَيَقُولَ: مَنْ خَلَقَ كَذَا وَكَذَا؟ حَتَّى يَقُولَ لَهُ: مَنْ خَلَقَ رَبَّكَ؟ فَإِذَا بَلَغَ ذَلِكَ، فَلْيَسْتَعِذْ بِاللهِ وَلْيَنْتَهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7910,
                "hadithNumber": "346",
                "englishNarrator": "This hadith is transmitted by Urwa bin Zubair on the authority of Abu Huraira رضی ‌اللہ ‌عنہ (and the words are):",
                "hadithEnglish": "The Satan comes to the bondsman (of Allah) and says: Who created this and that? The remaining part of the hadith is the same.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’ بندے کے پاس شیطان آتا ہے او رکہتا ہے : فلاں فلاں چیز کو کس نے پیدا کیا ؟ حتی کہ اس سے کہتا ہے : تیرے رب کو کس نے پیدا کیا ؟ سوجب بات یہاں تک پہنچے تو اللہ کی پناہ مانگے اور رک جائے ۔ ‘ ‘ ( یہ حدیث ) ابن شہاب کے بھتیجے کی بیان کردہ حدیث کے مانند ہے ۔",
                "urduNarrator": "مجھ سے عبدالملک بن شعیب بن لیث نے بیان کیا، انہوں نے کہا: مجھ سے میرے والد نے بیان کیا، میرے دادا نے کہا,عقیل بن خالد نے کہاکہ ابن شہاب نے کہا : مجھے عروہ بن زبیر نے خبر دی کہ حضرت ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا",
                "hadithArabic": "حَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، قَالَ: حَدَّثَنِي أَبِي، عَنْ جَدِّي، قَالَ: حَدَّثَنِي عُقَيْلُ بْنُ خَالِدٍ، قَالَ: قَالَ ابْنُ شِهَابٍ، أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: يَأْتِي الْعَبْدَ الشَّيْطَانُ فَيَقُولُ: مَنْ خَلَقَ كَذَا وَكَذَا؟ مِثْلَ حَدِيثِ ابْنِ أَخِي ابْنِ شِهَابٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7911,
                "hadithNumber": "347",
                "englishNarrator": "It is narrated on the authority of Abu Huraira رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) observed: People will constantly ask you questions pertaining to knowledge till they would say: Allah created us, but who created Allah? he (the narrator) says: he (Abu Huraira) was (at the time of narrating this hadith) catching hold of the hand of a man and he said: Allah and the Messenger told the truth. Two persons have already put me this question, and this is the third one, or he said: One man has put me this question and he is the second one.",
                "hadithUrdu": "آپ نے فرمایا : ’’لوگ تم سے ہمیشہ علم کے بارے میں سوال کریں گے یہاں تک کہ یہ کہیں گے : اللہ نے ہمیں پیدا کیا ہے تو اللہ کو کس نے پیدا کیا ؟ ‘ ‘ ابن سیرین نے کہا : اس وقت حضرت ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ ایک آدمی کا ہاتھ پکڑ ے ہوئے تھے تو کہنے لگے : اللہ اور اس کے رسول ﷺ نے سچ فرمایا ۔ مجھ سے دو ( آدمیوں ) نے ( یہی ) سوال کیا تھا اور یہ تیسرا ہے ( یا کہا : ) مجھ سے ایک ( آدمی ) نے ( پہلے یہ ) سوال کیا تھا او ریہ دوسرا ہے ۔",
                "urduNarrator": "عبد الوارث بن عبد ا لصمد کے دادا عبد الوارث بن سعید نے ایوب سے ، انہوں نے محمد بن سیرین سے ، انہوں نےحضرت ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انہوں نبی ﷺ سے روایت کی",
                "hadithArabic": "حَدَّثَنِي عَبْدُ الوارثِ بْنُ عَبْدِ الصَّمدِ، قَالَ: حَدَّثَنِي أَبِي، عَنْ جدِّي، عَنْ أيُّوبَ، عَنْ مُحمَّدِ بْنِ سِيرينَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: لَا يَزَالُ النَّاسُ يَسْأَلُونَكُمْ عَنِ الْعِلْمِ حَتَّى يَقُولُوا: هَذَا اللهُ خَلَقَنَا، فَمَنْ خَلَقَ اللهَ؟ قَالَ: وَهُوَ آخِذٌ بِيَدِ رَجُلٍ، فَقَالَ: صَدَقَ اللهُ وَرَسُولُهُ، قَدْ سَأَلَنِي اثْنَانِ وَهَذَا الثَّالثُ، أَوْ قَالَ: سَأَلَنِي وَاحِدٌ وَهَذَا الثَّاني.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7912,
                "hadithNumber": "348",
                "englishNarrator": "It is narrated on the authority of Abu Huraira ‌رضی ‌اللہ ‌عنہ that he said:",
                "hadithEnglish": "The people will constantly, and the rest of the hadith is the same as that transmitted by 'Abdul-Warith with the exception that there is no mention of the Messenger of Allah in that, but he observed at the end of the hadith: Allah and His Messenger told the truth.",
                "hadithUrdu": "’’ لوگ ہمیشہ سوال کرتے رہیں گے .... ‘ ‘ باقی حدیث عبد الوارث کی حدیث کی مانند ہے ۔ تاہم انہوں نے سند میں نبی کریمﷺ کا ذکر نہیں کیا ، لیکن آخر میں یہ کہا ہے : ’’ اللہ اور اس کے رسول سے سچ فرمایا ۔ ‘ ‘",
                "urduNarrator": "مجھ سے زہیر بن حرب اور یعقوب الدرقی نے بیان کیا، انہوں نے کہا,اسماعیل بن علیہ نے ایوب سے ، انہوں نے محمد سے روایت کی کہ حضرت ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا",
                "hadithArabic": "وَحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، وَيَعْقُوبُ الدَّوْرَقِيُّ، قَالَا: حَدَّثَنَا إِسْمَاعِيلُ وَهُوَ ابْنُ عُليَّةَ، عَنْ أيُّوبَ، عَنْ مُحمَّدٍ، قَالَ: قَالَ أَبُو هُرَيْرَةَ: «لَا يَزَالُ النَّاسُ»، بِمثْلِ حَدِيثِ عَبْدِ الْوَارِثِ، غَيْرَ أنَّهُ لمْ يَذْكُرِ النَّبيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي الْإِسْنَادِ، وَلَكِنْ قَدْ قَالَ: فِي آخِرِ الْحَدِيثِ صَدَقَ اللهُ وَرَسُولُهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7913,
                "hadithNumber": "349",
                "englishNarrator": "Abu Huraira رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said to me: they (the people) till constantly ask you, Abu Huraira, (about different things pertaining to religion) the they would say: Well, there is Allah, but after all who created Allah? He (Abu Huraira) narrated: Once we were in the mosque that some of the Bedouins came there and said: Well, there is Allah, but who created Allah? He (the narrator) said: I took hold of the pebbles in my fist and flung at them and remarked: Stand up, stand up (go away) my friend (the Holy Prophet) told the truth.",
                "hadithUrdu": "مجھ سے رسول اللہ ﷺ نے فرمایا : ’’ ابو ہریرہ ! لوگ ہمیشہ تم سے سوال کرتے رہیں گے حتی کہ کہیں گے : یہ ( ہر چیز کا خالق ) اللہ ہے تو اللہ کو کس نے پیدا کیا ؟ ‘ ‘ ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نےکہا : پھر ( ایک دفعہ ) جب میں مسجد میں تھا تو میرے پاس کچھ بدو آئے اور کہنے لگے : اےابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ ! یہ اللہ ہے ، پھر اللہ کو کس نے پیدا کیا ہے ؟ ( ابو سلمہ نے ) کہا : تب انہوں نے مٹھی میں کنکر پکڑے اور ان پر پھینکے اور کہا : اٹھو اٹھو ! ( یہاں سے جاؤ ) میرے خلیل ( نبی اکرم ﷺ ) نے بالکل سچ فرمایا تھا ۔",
                "urduNarrator": "ہم سے عبداللہ بن الرومی نے بیان کیا، کہا ہم سے النذر بن محمد نے بیان کیا، کہا ہم سے عکرمہ نے جو ابن عمار ہیں، کہا ہم سے یحییٰ نے بیان کیا,ابو سلمہ نے حضرت ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وَحَدَّثَنِي عَبْدُ اللهِ بْنُ الرُّومِيِّ، حَدَّثَنَا النَّضْرُ بْنُ مُحَمَّدٍ، حَدَّثَنَا عِكْرِمَةُ وَهُوَ ابْنُ عَمَّارٍ، حَدَّثَنَا يَحْيَى، حَدَّثَنَا أَبُو سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ لِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: لَا يَزَالُونَ يَسْأَلُونَكَ يَا أَبَا هُرَيْرَةَ حَتَّى يَقُولُوا: هَذَا اللهُ، فَمَنْ خَلَقَ اللهَ؟ قَالَ: فَبَيْنَا أَنَا فِي الْمَسْجِدِ إِذْ جَاءَنِي نَاسٌ مِنَ الْأَعْرَابِ، فَقَالُوا: يَا أَبَا هُرَيْرَةَ، هَذَا اللهُ، فَمَنْ خَلَقَ اللهَ؟ قَالَ: فَأَخَذَ حَصًى بِكَفِّهِ فَرَمَاهُمْ، ثُمَّ قَالَ: قُومُوا قُومُوا صَدَقَ خَلِيلِي.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 7601,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=304",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=302",
                "label": "302",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=303",
                "label": "303",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=304",
                "label": "304",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=305",
                "label": "305",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=306",
                "label": "306",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=307",
                "label": "307",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=308",
                "label": "308",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=306",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=306",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=304",
        "to": 7625,
        "total": 40465
    }
}