{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 429,
        "data": [
            {
                "id": 10989,
                "hadithNumber": "3425",
                "englishNarrator": "Sabra bin Ma'bad رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) permitted his Companions to contract temporary marriage with women in the Year of Victory. So I and a friend of mine from Banu Sulaim went out, until we found a young woman of Banu Amir who was like a young she-camel having a long neck. We proposed to her for contracting temporary marriage with us, and presented to her our cloaks (as dower). She began to look and found me more handsome than my friend, but found the cloak of my friend more beautiful than my cloak. She thought in her mind for a while, but then preferred me to my friend. So I remained with her for three (nights), and then Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) commanded us to part with them (such women).",
                "hadithUrdu": "فتح مکہ کے سال نبی صلی اللہ علیہ وسلم نے اپنے ساتھیوں کو عورتوں کے ساتھ متعہ کر لینے کا حکم دیا ۔ میں اور بنو سُلیم میں سے میرا ایک ساتھی نکلے ، حتیٰ کہ ہم نے بنو عامر کی ایک جوان لڑکی کو پایا ، وہ ایک جوان اور خوبصورت لمبی گردن والی اونٹنی کی طرح تھی ۔ ہم نے اسے نکاح ( متعہ ) کا پیغام دیا ، اور اس کے سامنے اپنی چادریں پیش کیں ، وہ غور سے دیکھنے لگی ، مجھے میرے ساتھی سے زیادہ خوبصورت پاتی اور میرے ساتھی کی چادر کو میری چادر سے بہتر دیکھتی ، اس کے بعد اس نے گھڑی بھر اپنے دل سے مشورہ کیا ، پھر اس نے مجھے میرے ساتھی پر فوقیت دی ، پھر یہ عورتیں تین دن تک ہمارے ساتھ رہیں ، پھر رسول اللہ صلی اللہ علیہ وسلم نے ہمیں ان کو علیحدہ کرنے کا حکم دیا.",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے بیان کیا عبدالعزیز بن ربیع بن سبرہ بن معبد نے کہا : میں نے اپنے والد ربیع بن سبرہ سے سنا ، وہ اپنے والد سبرہ بن معبد رضی اللہ عنہ سے حدیث بیان کر رہے تھے کہ",
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ الرَّبِيعِ بْنِ سَبْرَةَ بْنِ مَعْبَدٍ، قَالَ: سَمِعْتُ أَبِي رَبِيعَ بْنَ سَبْرَةَ، يُحَدِّثُ عَنْ أَبِيهِ سَبْرَةَ بْنِ مَعْبَدٍ، «أَنَّ نَبِيَّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَامَ فَتْحِ مَكَّةَ أَمَرَ أَصْحَابَهُ بِالتَّمَتُّعِ مِنَ النِّسَاءِ»، قَالَ: «فَخَرَجْتُ أَنَا وَصَاحِبٌ لِي مِنْ بَنِي سُلَيْمٍ، حَتَّى وَجَدْنَا جَارِيَةً مِنْ بَنِي عَامِرٍ كَأَنَّهَا بَكْرَةٌ عَيْطَاءُ، فَخَطَبْنَاهَا إِلَى نَفْسِهَا وَعَرَضْنَا عَلَيْهَا بُرْدَيْنَا، فَجَعَلَتْ تَنْظُرُ فَتَرَانِي أَجْمَلَ مِنْ صَاحِبِي، وَتَرَى بُرْدَ صَاحِبِي أَحْسَنَ مِنْ بُرْدِي، فَآمَرَتْ نَفْسَهَا سَاعَةً ثُمَّ اخْتَارَتْنِي عَلَى صَاحِبِي، فَكُنَّ مَعَنَا ثَلَاثًا، ثُمَّ أَمَرَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِفِرَاقِهِنَّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10990,
                "hadithNumber": "3426",
                "englishNarrator": "Rabi' bin Sabra reported on the authority of his father:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) prohibited the contracting of temporary marriage.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے نکاح متعہ سے منع فرما دیا.",
                "urduNarrator": "ہم سے عمرو ناقد اور ابن نمیر نے بیان کیا، کہا, ہم سے بیان کیا سفیان بن عیینہ نے ہمیں زہری سے حدیث بیان کی ، انہوں نے ربیع بن سبرہ سے اور انہوں نے اپنے والد سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، وَابْنُ نُمَيْرٍ، قَالَا: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنِ الرَّبِيعِ بْنِ سَبْرَةَ، عَنْ أَبِيهِ، «أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ نِكَاحِ الْمُتْعَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10991,
                "hadithNumber": "3427",
                "englishNarrator": "Rabi' bin Sabra reported on the authority of his father:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade on the Day of Victory to contract temporary marriage with women.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فتح مکہ کے ( دنوں میں سے ایک ) دن عورتوں کے ساتھ ( نکاح ) متعہ کرنے سے منع فرما دیا.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے ابن اُلیّہ نے بیان کیا, معمر نے زہری سے ، انہوں نے ربیع بن سبرہ سے ، انہوں نے اپنے والد سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ عُلَيَّةَ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنِ الرَّبِيعِ بْنِ سَبْرَةَ، عَنْ أَبِيهِ، «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى يَوْمَ الْفَتْحِ عَنْ مُتْعَةِ النِّسَاءِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10992,
                "hadithNumber": "3428",
                "englishNarrator": "It was narrated from Ar-Rabi' bin Sabra رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) forbade to contract temporary marriage with women at the time of Victory, and that his father had contracted the marriage for two red cloaks.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فتح مکہ کے زمانے میں عورتوں سے متعہ کرنے سے منع فرما دیا تھا ، اور یہ کہ ان کے والد ( سبرہ ) نے ( اپنے ساتھی کے ہمراہ ) دو سرخ چادریں پیش کرتے ہوئے نکاح متعہ کیا تھا.",
                "urduNarrator": "مجھ سے حسن حلوانی اور عبد بن حمید نے بیان کیا، ان سے یعقوب بن ابراہیم بن سعد نے بیان کیا، ہم سے میرے والد نے بیان کیا، صالح سے روایت ہے ، کہا : ہمیں ابن شہاب نے ربیع بن سبرہ جہنی سے خبر دی ، انہوں نے اپنے والد ( سبرہ رضی اللہ عنہ ) سے روایت کی کہ انہوں نے اِن کو بتایا کہ",
                "hadithArabic": "وحَدَّثَنِيهِ حَسَنٌ الْحُلْوَانِيُّ، وَعَبْدُ بْنُ حُمَيْدٍ، عَنْ يَعْقُوبَ بْنِ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنْ صَالِح، أَخْبَرَنَا ابْنُ شِهَابٍ، عَنِ الرَّبِيعِ بْنِ سَبْرَةَ الْجُهَنِيِّ، عَنْ أَبِيهِ، أَنَّهُ أَخْبَرَهُ؛ «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنِ الْمُتْعَةِ زَمَانَ الْفَتْحِ - مُتْعَةِ النِّسَاءِ - وَأَنَّ أَبَاهُ كَانَ تَمَتَّعَ بِبُرْدَيْنِ أَحْمَرَيْنِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10993,
                "hadithNumber": "3429",
                "englishNarrator": "Urwa bin Zabair reported:",
                "hadithEnglish": "'Abdullah bin Zubair (رضی اللہ عنہ) stood up (and delivered an address) in Mecca saying: Allah has made blind the hearts of some people as He has deprived them of eyesight that they give religious verdict in favour of temporary marriage, while he was alluding to a person (Ibn 'Abbas رضی اللہ عنہ ). Ibn Abbas رضی اللہ عنہ called him and said: You are an uncouth person, devoid of sense. By my life, Mut'a was practised during the lifetime of the leader of the pious (he meant Allah's Messenger, may peace be upon him), and Ibn Zubair رضی اللہ عنہ said to him: just do it yourselves, and by Allah, if you do that I will stone you with your stones. Ibn Shihab said. Khalid bin Muhajir bin Saifullah informed me: While I was sitting in the company of a person, a person came to him and he asked for a religious verdict about Mut'a and he permitted him to do it. Ibn Abu 'Amrah al-Ansari (رضی اللہ عنہ) said to him: Be gentle. It was permitted in-the early days of Islam, (for one) who was driven to it under the stress of necessity just as (the eating of) carrion and the blood and flesh of swine and then Allah intensified (the commands of) His religion and prohibited it (altogether). Ibn Shihab reported: Rabi' bin Sabra told me that his father (Sabra) said: I contracted temporary marriage with a woman of Banu 'Amir for two cloaks during the lifetime of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌); then he forbade us to do Mut'a. Ibn Shihab said: I heard Rabi' bin Sabra narrating it to Umar bin 'Abdul-'Aziz and I was sitting there.",
                "hadithUrdu": "حضرت عبداللہ بن زبیر رضی اللہ عنہ مکہ میں کھڑے ہوئے ، اور کہا : بلاشبہ کچھ لوگ ہیں ، اللہ نے ان کے دلوں کو بھی اندھا کر دیا ہے جس طرح ان کی آنکھوں کو اندھا کیا ہے ۔ وہ لوگوں کو متعہ ( کے جواز ) کا فتویٰ دیتے ہیں ، وہ ایک آدمی ( حضرت ابن عباس رضی اللہ عنہ ) پر تعریض کر رہے تھے ، اس پر انہوں نے ان کو پکارا اور کہا : تم بے ادب ، کم فہم ہو ، میری عمر قسم! بلاشبہ امام المتقین کے عہد میں ( نکاح ) متعہ کیا جاتا تھا ۔ ۔ ان کی مراد رسول اللہ صلی اللہ علیہ وسلم سے تھی ۔ ۔ تو ابن زبیر رضی اللہ عنہ نے ان سے کہا : تم خود اپنے ساتھ اس کا تجربہ کر ( دیکھو ) ، بخدا! اگر تم نے یہ کام کیا تو میں تمہارے ( ہی ان ) پتھروں سے ( جن کے تم مستحق ہو گے ) تمہیں رجم کروں گا ۔ ابن شہاب نے کہا : مجھے خالد بن مہاجر بن سیف اللہ نے خبر دی کہ اس اثنا میں جب وہ ان صاحب ( ابن عباس رضی اللہ عنہ ) کے پاس بیٹھے ہوئے تھے ، ایک آدمی ان کے پاس آیا اور متعہ کے بارے میں ان سے فتویٰ مانگا تو انہوں نے اسے اس ( کے جواز ) کا حکم دیا ۔ اس پر ابن ابی عمرہ انصاری رضی اللہ عنہ نے ان سے کہا : ٹھہریے! انہوں نے کہا : کیا ہوا؟ اللہ کی قسم! میں نے امام المتقین صلی اللہ علیہ وسلم کے عہد میں کیا ہے ۔ ابن ابی عمرہ رضی اللہ عنہ نے کہا : بلاشبہ یہ ( ایسا کام ہے کہ ) ابتدائے اسلام میں ایسے شخص ے لئے جو ( حالات کی بنا پر ) اس کے لئے مجبور کر دیا گیا ہو ، اس کی رخصت تھی جس طرح ( مجبوری میں ) مردار ، خون اور سور کے گوشت ( کے لیے ) ہے ، پھر اللہ تعالیٰ نے اپنے دین کو محکم کیا اور اس سے منع فرما دیا ۔ ابن شہاب نے کہا : مجھے ربیع بن سبرہ جہنی نے بتایا کہ ان کے والد نے کہا : میں نے نبی صلی اللہ علیہ وسلم کے زمانے میں بنو عامر کی ایک عورت سے دو سرخ ( کی پیش کش ) پر متعہ کیا تھا ، پھر رسول اللہ صلی اللہ علیہ وسلم نے ہمیں متعہ سے منع فرما دیا ۔ ابن شہاب نے کہا : میں نے ربیع بن سبرہ سے سنا ، وہ یہی حدیث عمر بن عبدالعزیز سے بیان کر رہے تھے اور میں ( اس مجلس میں ) بیٹھا ہوا تھا ۔",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، انہوں نے کہا مجھے یونس نے خبر دی کہ ابن شہاب نے کہا : مجھے عروہ بن زبیر نے خبر دی کہ",
                "hadithArabic": "وحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، قَالَ ابْنُ شِهَابٍ: أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَبْدَ اللهِ بْنَ الزُّبَيْرِ، قَامَ بِمَكَّةَ، فَقَالَ: «إِنَّ نَاسًا أَعْمَى اللهُ قُلُوبَهُمْ، كَمَا أَعْمَى أَبْصَارَهُمْ، يُفْتُونَ بِالْمُتْعَةِ»، يُعَرِّضُ بِرَجُلٍ، فَنَادَاهُ، فَقَالَ: إِنَّكَ لَجِلْفٌ جَافٍ، فَلَعَمْرِي، لَقَدْ كَانَتِ الْمُتْعَةُ تُفْعَلُ عَلَى عَهْدِ إِمَامِ الْمُتَّقِينَ - يُرِيدُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَقَالَ لَهُ ابْنُ الزُّبَيْرِ: «فَجَرِّبْ بِنَفْسِكَ، فَوَاللهِ، لَئِنْ فَعَلْتَهَا لَأَرْجُمَنَّكَ بِأَحْجَارِكَ»، قَالَ ابْنُ شِهَابٍ: فَأَخْبَرَنِي خَالِدُ بْنُ الْمُهَاجِرِ بْنِ سَيْفِ اللهِ، أَنَّهُ بَيْنَا هُوَ جَالِسٌ عِنْدَ رَجُلٍ، جَاءَهُ رَجُلٌ فَاسْتَفْتَاهُ فِي الْمُتْعَةِ، فَأَمَرَهُ بِهَا، فَقَالَ لَهُ ابْنُ أَبِي عَمْرَةَ الْأَنْصَارِيُّ: مَهْلًا، قَالَ: مَا هِيَ؟ وَاللهِ، لَقَدْ فُعِلَتْ فِي عَهْدِ إِمَامِ الْمُتَّقِينَ، قَالَ: ابْنُ أَبِي عَمْرَةَ «إِنَّهَا كَانَتْ رُخْصَةً فِي أَوَّلِ الْإِسْلَامِ لِمَنِ اضْطُرَّ إِلَيْهَا، كَالْمَيْتَةِ، وَالدَّمِ، وَلَحْمِ الْخِنْزِيرِ، ثُمَّ أَحْكَمَ اللهُ الدِّينَ وَنَهَى عَنْهَا» قَالَ ابْنُ شِهَابٍ: وَأَخْبَرَنِي رَبِيعُ بْنُ سَبْرَةَ الْجُهَنِيُّ، أَنَّ أَبَاهُ قَالَ: «قَدْ كُنْتُ اسْتَمْتَعْتُ فِي عَهْدِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ امْرَأَةً مِنْ بَنِي عَامِرٍ بِبُرْدَيْنِ أَحْمَرَيْنِ، ثُمَّ نَهَانَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ الْمُتْعَةِ»، قَالَ ابْنُ شِهَابٍ: وَسَمِعْتُ رَبِيعَ بْنَ سَبْرَةَ، يُحَدِّثُ ذَلِكَ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، وَأَنَا جَالِسٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10994,
                "hadithNumber": "3430",
                "englishNarrator": "Sabra al-Juhanni reported on the authority of his father:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) prohibited the contracting of temporary marriage and said: Behold, it is forbidden from this very day of yours to the Day of Resurrection, and he who has given something (as a dower) should not take it back.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے متعے سے روکا اور فرمایا : \" خبردار! یہ تمہارے آج کے دن سے قیامت کے دن تک کے لیے حرام ہے اور جس نے ( متعے کے عوض ) کوئی چیز دی ہو وہ اسے واپس نہ لے.",
                "urduNarrator": "مجھ سے سلمہ بن شبیب نے بیان کیا، کہا ہم سے حسن بن عیان نے بیان کیا، انہوں نے بیان کیا ہمیں معقل نے ابن ابی عبلہ سے حدیث بیان کی ، انہوں نے عمر بن عبدالعزیز سے روایت کی ، انہوں نے کہا : مجھے ربیع بن سبرہ جہنی نے اپنے والد سے حدیث بیان کی کہ",
                "hadithArabic": "وحَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنِ ابْنِ أَبِي عَبْلَةَ، عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ، قَالَ: حَدَّثَنَا الرَّبِيعُ بْنُ سَبْرَةَ الْجُهَنِيُّ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنِ الْمُتْعَةِ، وَقَالَ: «أَلَا إِنَّهَا حَرَامٌ مِنْ يَوْمِكُمْ هَذَا إِلَى يَوْمِ الْقِيَامَةِ، وَمَنْ كَانَ أَعْطَى شَيْئًا فَلَا يَأْخُذْهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10995,
                "hadithNumber": "3431",
                "englishNarrator": "Ali bin Abi Talib رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) prohibited on the Day of Khaibar the contracting of temporary marriage with women and the eating of the flesh of domestic asses.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے خیبر کے دن عورتوں کے ساتھ متعہ کرنے اور پالتو گدھوں کا گوشت کھانے سے منع فرما دیا تھا.",
                "urduNarrator": "یحییٰ بن یحییٰ نے کہا : میں نے امام مالک کے سامنے قراءت کی ، انہوں نے ابن شہاب سے ، انہوں نے محمد بن علی ( ابن حنفیہ ) کے دونوں بیٹوں عبداللہ اور حسن سے ، ان دونوں نے اپنے والد سے ، اور انہوں نے حضرت علی رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ اللهِ، وَالْحَسَنِ، ابْنَيْ مُحَمَّدِ بْنِ عَلِيٍّ، عَنْ أَبِيهِمَا، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ مُتْعَةِ النِّسَاءِ يَوْمَ خَيْبَرَ، وَعَنْ أَكْلِ لُحُومِ الْحُمُرِ الْإِنْسِيَّةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10996,
                "hadithNumber": "3432",
                "englishNarrator": "Malik narrated this hadith on the authority of the same chain of transmitters:",
                "hadithEnglish": "'Ali bin Abi Talib said to a person: You are a person led astray; Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade us (to do Mut'a), as is stated In the hadith transmitted on the authority of Yahya bin Malik.",
                "hadithUrdu": "تم حیرت میں پڑے ہوئے ( حقیقت سے بے خبر ) شخص ہو ۔ رسول اللہ صلی اللہ علیہ وسلم نے منع فرما دیا تھا ۔ ۔ ۔ آگے یحییٰ بن یحییٰ کی امام مالک رحمۃ اللہ علیہ سے روایت کردہ حدیث کی طرح ہے.",
                "urduNarrator": "ہمیں عبداللہ بن محمد بن اسماء ضبعی نے حدیث سنائی ، کہا : ہمیں جویریہ ( بن اسماء بن عبید ضبعی ) نے امام مالک رحمۃ اللہ علیہ سے اسی سند کے ساتھ حدیث بیان کی اور کہا : انہوں ( محمد بن علی ) نے حضرت علی رضی اللہ عنہ سے سنا ، وہ فلاں ( حضرت ابن عباس رضی اللہ عنہ ) سے کہہ رہے تھے",
                "hadithArabic": "وَحَدَّثَنَاهُ عَبْدُ اللهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ الضُّبَعِيُّ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ مَالِكٍ، بِهَذَا الْإِسْنَادِ، وَقَالَ: سَمِعَ عَلِيَّ بْنَ أَبِي طَالِبٍ، يَقُولُ لِفُلَانٍ: إِنَّكَ رَجُلٌ تَائِهٌ نَهَانَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ يَحْيَى بْنِ يَحْيَى، عَنْ مَالک.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10997,
                "hadithNumber": "3433",
                "englishNarrator": "Muhammad bin 'Ali narrated on the authority of his father 'Ali رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) on the Day of Khaibar prohibited for ever the contracting of temporary marriage and eating of the flesh of the domestic asses.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے خیبر کے دن ( نکاح ) متعہ اور پالتو گدھوں کے گوشت سے منع فرما دیا تھا.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، ابن نمیر اور زہیر بن حرب نے ابن عیینہ کی سند سے بیان کیا، کہا: ہم سے بیان کیا سفیان بن عیینہ نے ہمیں زہری سے حدیث بیان کی ، انہوں نے محمد بن علی ( ابن حنفیہ ) کے دونوں بیٹوں حسن اور عبداللہ سے ، ان دونوں نے اپنے والد سے ، انہوں نے حضرت علی رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ نُمَيْرٍ، وَزُهَيْرُ بْنُ حَرْبٍ، جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، قَالَ زُهَيْرٌ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنِ الْحَسَنِ، وَعَبْدِ اللهِ، ابْنَيْ مُحَمَّدِ بْنِ عَلِيٍّ، عَنْ أَبِيهِمَا، عَنْ عَلِيٍّ، «أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ نِكَاحِ الْمُتْعَةِ يَوْمَ خَيْبَرَ، وَعَنْ لُحُومِ الْحُمُرِ الْأَهْلِيَّةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10998,
                "hadithNumber": "3434",
                "englishNarrator": "Ali (رضی اللہ عنہ):",
                "hadithEnglish": "Ibn Abbas ( رضی اللہ عنہ) gave some relaxation in connection with the contracting of temporary marriage, whereupon he said: Don't be hasty (in your religious verdict), Ibn 'Abbas رضی اللہ عنہ , for Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) on the Day of Khaibar prohibited that forever-along with the eating of flesh of domestic asses.",
                "hadithUrdu": "انہوں نے حضرت ابن عباس رضی اللہ عنہ سے سنا ، وہ عورتوں سے متعہ کرنے کے بارے میں ( فتویٰ دینے میں ) نرمی سے کام لیتے ہیں ، انہوں نے کہا : ابن عباس! ٹھہریے! بلاشبہ رسول اللہ صلی اللہ علیہ وسلم نے خیبر کے دن اس سے اور پالتو گدھوں کے گوشت سے منع فرما دیا تھا.",
                "urduNarrator": "ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا، کہا ہم سے میرے والد نے بیان کیا، انہوں نے کہا عبیداللہ نے ابن شہاب سے ، انہوں نے محمد بن علی سے کے دونوں بیٹوں حسن اور عبداللہ سے ، ان دونوں نے اپنے والد ( محمد ابن حنفیہ ) سے ، اور انہوں نے ( اپنے والد ) حضرت علی رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللهِ، عَنِ ابْنِ شِهَابٍ، عَنِ الْحَسَنِ، وَعَبْدِ اللهِ، ابْنَيْ مُحَمَّدِ بْنِ عَلِيٍّ، عَنْ أَبِيهِمَا، عَنْ عَلِيٍّ، أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ يُلَيِّنُ فِي مُتْعَةِ النِّسَاءِ، فَقَالَ: «مَهْلًا يَا ابْنَ عَبَّاسٍ، فَإِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْهَا يَوْمَ خَيْبَرَ، وَعَنْ لُحُومِ الْحُمُرِ الْإِنْسِيَّةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10999,
                "hadithNumber": "3435",
                "englishNarrator": "Ali ( رضی اللہ عنہ) said to Ibn 'Abbas (رضی اللہ عنہ):",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) on the Day of Khaibar forbade forever the contracting of temporary marriage and the eating of the flesh of domestic asses.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے خیبر کے دن عورتوں کے ساتھ متعہ کرنے اور پالتو گدھوں کے گوشت کھانے سے منع فرما دیا تھا.",
                "urduNarrator": "مجھ سے ابو الطاہر اور حرملہ بن یحییٰ نے بیان کیا، کہا کہ ہم سے ابن وہب نے بیان کیا، انہوں نے مجھ سے بیان کیا یونس نے مجھے ابن شہاب سے خبر دی ، انہوں نے محمد بن علی بن ابی طالب کے بیٹوں حسن اور عبداللہ سے ( اور ) ان دونوں نے اپنے والد ( محمد بن علی ابن حنفیہ ) سے روایت کی ، انہوں نے حضرت علی بن ابی طالب رضی اللہ عنہ سے سنا ، وہ ابن عباس رضی اللہ عنہ سے کہہ رہے تھے",
                "hadithArabic": "وحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، قَالَا: أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنِ الْحَسَنِ، وَعَبْدِ اللهِ، ابْنَيْ مُحَمَّدِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ، عَنْ أَبِيهِمَا، أَنَّهُ سَمِعَ عَلِيَّ بْنَ أَبِي طَالِبٍ يَقُولُ لِابْنِ عَبَّاسٍ: «نَهَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ مُتْعَةِ النِّسَاءِ يَوْمَ خَيْبَرَ، وَعَنْ أَكْلِ لُحُومِ الْحُمُرِ الْإِنْسِيَّةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11000,
                "hadithNumber": "3436",
                "englishNarrator": "Abu Huraira (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger (ﷺ) having said this: One should not combine a woman and her father's sister, nor a woman and her mother's sister in marriage.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کسی عورت اور اس کی پھوپھی کو ، اور کسی عورت اور اس کی خالہ کو ( نکاح میں ) اکٹھا نہ کیا جائے.",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ القنبی نے بیان کیا، کہا ہم سے مالک نے ابو الزناد کی سند سے بیان کیا, اعرج نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ، حَدَّثَنَا مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يُجْمَعُ بَيْنَ الْمَرْأَةِ وَعَمَّتِهَا، وَلَا بَيْنَ الْمَرْأَةِ وَخَالَتِهَا.",
                "headingArabic": "تَحْرِيمِ الْجَمْعِ بَيْنَ الْمَرْأَةِ وَعَمَّتِهَا أَوْ خَالَتِهَا فِي النِّكَاحِ ‏‏",
                "headingUrdu": "عورت اور اس کی پھوپھی یا خالہ سے بیک وقت نکاح کرنے کی ممانعت",
                "headingEnglish": "The prohibition of being married to a woman and her paternal aunt or maternal aunt at the same time",
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11001,
                "hadithNumber": "3437",
                "englishNarrator": "Abu Huraira ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade combining of four women in marriage: a woman with her father's sister, and a woman with her mother's sister.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے چار عورتوں کے بارے میں منع فرمایا کہ ان کو ( نکاح میں باہم ) جمع کیا جائے : عورت اور اس کی پھوپھی ( یا ) عورت اور اس کی خالہ.",
                "urduNarrator": "ہم سے محمد بن روم بن المہاجر نے بیان کیا، کہا کہ ہم سے لیث نے بیان کیا، وہ یزید بن ابی حبیب کی سند سے, عِراک بن مالک نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": ") وحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ، أَخْبَرَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ عِرَاكِ بْنِ مَالِكٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ أَرْبَعِ نِسْوَةٍ، أَنْ يُجْمَعَ بَيْنَهُنَّ: الْمَرْأَةِ وَعَمَّتِهَا، وَالْمَرْأَةِ وَخَالَتِهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11002,
                "hadithNumber": "3438",
                "englishNarrator": "Abu Huraira (رضی اللہ عنہ) reported:",
                "hadithEnglish": "I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) say: Father's sister should not be combined with her brother's daughter, nor the daughter of a sister with her mother's sister.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : \" بھائی کی بیٹی پر پھوپھی کو نہ بیاہا جائے اور نہ خالہ کے ہوتے ہوئے بھانجی سے نکاح کیا جائے ۔ \" ( اصل مقصود یہی ہے کہ یہ اکٹھی ایک شخص کے نکاح میں نہ آئیں).",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ بن قعنب نے بیان کیا، انہوں نے ہم سے بیان کیا عبدالرحمٰن بن عبدالعزیز نے ابن شہاب سے خبر دی ، انہوں نے قبیصہ بن ذؤیب سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا عَبْدُ اللهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ الْعَزِيزِ، قَالَ ابْنُ مَسْلَمَةَ: - مَدَنِيٌّ مِنَ الْأَنْصَارِ مِنْ وَلَدِ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ - عَنِ ابْنِ شِهَابٍ، عَنْ قَبِيصَةَ بْنِ ذُؤَيْبٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا تُنْكَحُ الْعَمَّةُ عَلَى بِنْتِ الْأَخِ، وَلَا ابْنَةُ الْأُخْتِ عَلَى الْخَالَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11003,
                "hadithNumber": "3439",
                "englishNarrator": "Abu Huraira (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade a person to combine in marriage a woman and her father's sister, and a woman and her mother's sister. Ibn Shihab said: So we regarded the paternal aunt of her (wife's) father and the maternal aunt of her (wife's) father at the same level.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے منع فرمایا کہ کوئی شخص کسی عورت اور اس کی پھوپھی کو اور کسی عورت اور اس کی خالہ کو ( اپنے نکاح میں ایک ساتھ ) جمع کرے ۔ ابن شہاب نے کہا : ہم اس ( منکوحہ عورت ) کے والد کی خالہ اور والد کی پھوپھی کو بھی اسی حیثیت میں دیکھتے ہیں.",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، انہوں نے کہا یونس نے مجھے ابن شہاب سے خبر دی ، کہا : مجھے قبیصہ بن ذؤیب کعبی نے خبر دی کہ انہوں نے سیدنا ابوہریرہ رضی اللہ عنہ سے سنا وہ کہہ رہے تھے",
                "hadithArabic": "وحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي قَبِيصَةُ بْنُ ذُؤَيْبٍ الْكَعْبِيُّ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ: «نَهَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ يَجْمَعَ الرَّجُلُ بَيْنَ الْمَرْأَةِ وَعَمَّتِهَا، وَبَيْنَ الْمَرْأَةِ وَخَالَتِهَا»، قَالَ ابْنُ شِهَابٍ: «فَنُرَى خَالَةَ أَبِيهَا، وَعَمَّةَ أَبِيهَا بِتِلْكَ الْمَنْزِلَةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11004,
                "hadithNumber": "3440",
                "englishNarrator": "Abu Huraira (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: One should not combine in marriage a woman with her father's sister, or her mother's sister.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کسی عورت سے اس کی پھوپھی اور اس کی خالہ کی موجودگی میں نکاح نہ کیا جائے.",
                "urduNarrator": "مجھ سے ابو معن الرقاشی نے بیان کیا، ہم سے خالد بن حارث نے بیان کیا، انہوں نے ہم سے بیان کیا ہشام نے ہمیں یحییٰ سے حدیث بیان کی کہ انہوں ( یحییٰ ) نے ان ( ہشام ) کی طرف ابوسلمہ سے ( اپنی ) روایت کردہ حدیث لکھ کر بھیجی کہ حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي أَبُو مَعْنٍ الرَّقَاشِيُّ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى، أَنَّهُ كَتَبَ إِلَيْهِ عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تُنْكَحُ الْمَرْأَةُ عَلَى عَمَّتِهَا، وَلَا عَلَى خَالَتِهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11005,
                "hadithNumber": "3441",
                "englishNarrator": null,
                "hadithEnglish": "Abu Huraira (رضی اللہ عنہ) said: The Messenger of Allah said...\" a similar hadith (as no. 3440).",
                "hadithUrdu": "مجھ سے اسحاق بن منصور نے بیان کیا، ہم سے عبید اللہ بن موسیٰ نے بیان کیا, شیبان نے یحییٰ سے روایت کی ، کہا : مجھے ابوسلمہ نے حدیث بیان کی کہ انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا وہ کہہ رہے تھے ، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ۔ ۔ ۔ ( آگے ) اسی کے مانند ہے.",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُوسَى، عَنْ شَيْبَانَ، عَنْ يَحْيَى، حَدَّثَنِي أَبُو سَلَمَةَ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11006,
                "hadithNumber": "3442",
                "englishNarrator": "Abu Huraira (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: A man must not make proposal of marriage to a woman when his brother has done so already. And he must not offer a price for a thing for which his brother had already offered a price; and a woman must not be combined in marriage with her father's sister, nor with her mother's sister, and a woman must not ask to have her sister divorced in order to deprive her of what belongs to her, but she must marry, because she will have what Allah has decreed for her.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" کوئی آدمی اپنے بھائی کے پیغامِ نکاح پر ( اپنے ) نکاح کا پیغام نہ دے ، اور نہ اپنے بھائی کے سودے پر سودا کرے ، اور نہ کسی عورت سے اس کی پھوپھی اور خالہ کی موجودگی میں نکاح کیا جائے اور نہ کوئی عورت اپنی ( مسلمان ) بہن کی طلاق کا مطالبہ کرے تاکہ اس کی پلیٹ کو ( اپنے لیے ) انڈیل لے ۔ اسے ( پہلی بیوی کی طلاق کا مطالبہ کیے بغیر ) نکاح کر لینا چاہئے ، بات یہی ہے کہ جو اللہ نے اس کے لیے لکھا ہوا ہے وہی اس کا ہے.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے ابو اسامہ نے بیان کیا, ہشام نے محمد بن سیرین سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے ، انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَخْطُبُ الرَّجُلُ عَلَى خِطْبَةِ أَخِيهِ، وَلَا يَسُومُ عَلَى سَوْمِ أَخِيهِ، وَلَا تُنْكَحُ الْمَرْأَةُ عَلَى عَمَّتِهَا وَلَا عَلَى خَالَتِهَا، وَلَا تَسْأَلُ الْمَرْأَةُ طَلَاقَ أُخْتِهَا لِتَكْتَفِئَ صَحْفَتَهَا وَلْتَنْكِحْ، فَإِنَّمَا لَهَا مَا كَتَبَ اللهُ لَهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11007,
                "hadithNumber": "3443",
                "englishNarrator": "Abu Huraira (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade the combining of a woman in marriage with her father's sister, or with her mother's sister, or that a woman should ask for divorce for her sister in order to deprive her of what belongs to her. Allah, the Exalted'and Majestic, is her Sustainer too.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے منع فرمایا کہ کسی عورت کے ساتھ ، اس کی پھوپھی یا اس کی خالہ کے ( نکاح میں ) ہوتے ہوئے ، نکاح کیا جائے اور اس سے کہ کوئی عورت اپنی بہن کی طلاق کا مطالبہ کرے تاکہ جو اس کی پلیٹ میں ہے ، وہ ( اسے اپنے لیے ) انڈیل لے ۔ بلاشبہ اللہ عزوجل ( خود ) اس کو رزق دینے والا ہے.",
                "urduNarrator": "مجھ سے مہریز بن عون بن ابی عون نے بیان کیا، کہا ہم سے علی بن مسہر نے بیان کیا, داود بن ابی ہند نے ابن سیرین سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وحَدَّثَنِي مُحْرِزُ بْنُ عَوْنِ بْنِ أَبِي عَوْنٍ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ، عَنِ ابْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: «نَهَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ تُنْكَحَ الْمَرْأَةُ عَلَى عَمَّتِهَا أَوْ خَالَتِهَا، أَوْ أَنْ تَسْأَلَ الْمَرْأَةُ طَلَاقَ أُخْتِهَا لِتَكْتَفِئَ مَا فِي صَحْفَتِهَا، فَإِنَّ اللهَ عَزَّ وَجَلَّ رَازِقُهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11008,
                "hadithNumber": "3444",
                "englishNarrator": "Abu Huraira (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade to combine a woman and her father's sister, and a woman and her mother's sister.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے منع فرمایا کہ کسی عورت اور اس کی پھوپھی کو اور کسی عورت اور اس کی خالہ کو ( ایک مرد کے نکاح میں ) جمع کیا جائے.",
                "urduNarrator": "ہم سے محمد بن المثنیٰ، ابن بشار اور ابوبکر بن نافع نے بیان کیا، اور یہ قول ابن المثنیٰ اور ابن نافع کا ہے، انہوں نے کہا: ابن ابی عدی، شعبہ نے عمرو بن دینار سے ، انہوں نے ابوسلمہ سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، وَأَبُو بَكْرِ بْنُ نَافِعٍ، وَاللَّفْظُ لِابْنِ الْمُثَنَّى، وَابْنِ نَافِعٍ، قَالُوا: أَخْبَرَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ شُعْبَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: «نَهَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ يُجْمَعَ بَيْنَ الْمَرْأَةِ وَعَمَّتِهَا، وَبَيْنَ الْمَرْأَةِ وَخَالَتِهَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11009,
                "hadithNumber": "3445",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been transmitted on the authority of Amr bin Dinar.",
                "hadithUrdu": "مجھ سے محمد بن حاتم نے بیان کیا، کہا ہم سے شبابہ نے بیان کیا، انہوں نے بیان کیا ورقاء نے عمرو بن دینار سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی.",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنَا وَرْقَاءُ عَنْ عَمْرِو بْنِ دِينَارٍ بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11010,
                "hadithNumber": "3446",
                "englishNarrator": "Nubaih bin Wahb reported:",
                "hadithEnglish": "'Umar bin Ubaidullah intended to marry Talha bin 'Umar with the daughter of Shaiba bin Jubair; so he sent a messenger to Aban bin Uthman to attend the marriage, and he was at that time the Amir of Hajj. Aban said: I heard 'Uthman bin 'Affan رضی اللہ عنہ say that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had stated: A Muhrim must neither marry himself, nor arrange the marriage of another one, nor should he make the proposal of marriage.",
                "hadithUrdu": "عمر بن عبیداللہ ( بن معمر جہنی ) نے ارادہ کیا کہ اپنے بیٹے طلحہ بن عمر کی شادی شیبہ بن جبیر ( بن عثمان جہنی ) کی بیٹی سے کر دیں ، تو انہوں نے ابان بن عثمان کی طرف پیغام بھیجا کہ وہ بھی آئیں ، وہ امیر الحج بھی تھے ۔ ابان نے کہا : میں نے حضرت عثمان بن عفان رضی اللہ عنہ سے سنا وہ کہہ رہے تھے : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : محرم ( احرام باندھنے والا ) نہ ( خود ) نکاح کرے اور نہ اس کا نکاح کرایا جائے اور نہ وہ نکاح کا  پیغام بھیجے.",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے پڑھا امام مالک نے نافع سے ، انہوں نے نُبَیہ بن وہب سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ نَافِعٍ، عَنْ نُبَيْهِ بْنِ وَهْبٍ، أَنَّ عُمَرَ بْنَ عُبَيْدِ اللهِ، أَرَادَ أَنْ يُزَوِّجَ طَلْحَةَ بْنَ عُمَرَ بِنْتَ شَيْبَةَ بْنِ جُبَيْرٍ، فَأَرْسَلَ إِلَى أَبَانَ بْنِ عُثْمَانَ يَحْضُرُ ذَلِكَ وَهُوَ أَمِيرُ الْحَجِّ، فَقَالَ أَبَانُ: سَمِعْتُ عُثْمَانَ بْنَ عَفَّانَ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يَنْكِحُ الْمُحْرِمُ، وَلَا يُنْكَحُ، وَلَا يَخْطُبُ.",
                "headingArabic": "تَحْرِيمِ نِكَاحِ الْمُحْرِمِ وَكَرَاهَةِ خِطْبَتِهِ",
                "headingUrdu": "احرام باندھنے والے کے لیے نکاح کی ممانعت اور اس کے لیے نکاح کی تجویز دینا ناپسندیدہ ہے",
                "headingEnglish": "The prohibition of marriage for one who is in Ihram, and it is disliked for him to propose marriage",
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11011,
                "hadithNumber": "3447",
                "englishNarrator": "Nubaih bin Wahb reported:",
                "hadithEnglish": "Umar bin Ubaidullah bin Ma'mar sent me to Aban bin Uthman as he wanted to make the proposal of the marriage of his son with the daughter of Shaiba bin Uthman. He (Aban bin Uthman) was at that time (busy) in the season of Pilgrimage. He said: I deem him to be a man of the desert (for it is a common thing) that a Muhrim can neither marry, nor is he allowed to be married to anyone. It is Uthman (bin Affan رضی اللہ عنہ ) who reported this to us from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌).",
                "hadithUrdu": "مجھے عمر بن عبیداللہ بن معمر نے بھیجا ۔ وہ شیبہ ( بن جبیر ) بن عثمان کی بیٹی کے لیے اپنے بیٹے کے نکاح کا پیغام بھیج رہے تھے تو مجھے انہوں نے ابان بن عثمان کی طرف بھیجا اور وہ امیر حج تھے ، انہوں نے کہا : کیا میں اسے ( عمر کو ) ایک بدو ( جیسا کام کرتے ) نہیں دیکھ رہا؟ جو شخص حالت احرام میں ہو وہ نہ نکاح کرتا ہے نہ ( کسی کا ) نکاح کراتا ہے ۔ ہمیں حضرت عثمان رضی اللہ عنہ نے اس بات کی خبر رسول اللہ صلی اللہ علیہ وسلم سے دی تھی.",
                "urduNarrator": "ہم سے محمد بن ابی بکر المقدمی نے بیان کیا، کہا ہم سے حماد بن زید نے بیان کیا، ایوب نے نافع سے روایت کی ، کہا : مجھے نبیہ بن وہب نے حدیث بیان کی ، کہا",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، حَدَّثَنِي نُبَيْهُ بْنُ وَهْبٍ، قَالَ: بَعَثَنِي عُمَرُ بْنُ عُبَيْدِ اللهِ بْنِ مَعْمَرٍ، وَكَانَ يَخْطُبُ بِنْتَ شَيْبَةَ بْنِ عُثْمَانَ عَلَى ابْنِهِ، فَأَرْسَلَنِي إِلَى أَبَانَ بْنِ عُثْمَانَ وَهُوَ عَلَى الْمَوْسِمِ، فَقَالَ: أَلَا أُرَاهُ أَعْرَابِيًّا، «إِنَّ الْمُحْرِمَ لَا يَنْكِحُ، وَلَا يُنْكَحُ»، أَخْبَرَنَا بِذَلِكَ عُثْمَانُ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11012,
                "hadithNumber": "3448",
                "englishNarrator": "Uthman bin 'Affan رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had said: A Muhrim should neither marry himself, nor should he be got married to anyone, nor should he make the proposal of marriage.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جو شخص حالت احرام میں ہو ، وہ نہ نکاح کرے نہ نکاح کرائے اور نہ نکاح کا پیغام بھیجے.",
                "urduNarrator": "مجھ سے ابو غسان المسمعی نے بیان کیا، کہا ہم سے عبد اعلی نے بیان کیا، مجھ سے ابو الخطاب زیاد بن یحییٰ نے بیان کیا، ہم سے محمد بن سواع نے بیان کیا۔ سب نے کہا: ہمیں سعید نے بتایا , مطر اور یعلیٰ بن حکیم نے نافع سے ، انہوں نے نبیہ بن وہب سے ، انہوں نے ابان بن عثمان سے ، انہوں نے عثمان بن عفان رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنِي أَبُو غَسَّانَ الْمِسْمَعِيُّ، حَدَّثَنَا عَبْدُ الْأَعْلَى، ح وحَدَّثَنِي أَبُو الْخَطَّابِ زِيَادُ بْنُ يَحْيَى، حَدَّثَنَا مُحَمَّدُ بْنُ سَوَاءٍ، قَالَا جَمِيعًا: حَدَّثَنَا سَعِيدٌ، عَنْ مَطَرٍ، وَيَعْلَى بْنِ حَكِيمٍ، عَنْ نَافِعٍ، عَنْ نُبَيْهِ بْنِ وَهْبٍ، عَنْ أَبَانَ بْنِ عُثْمَانَ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «لَا يَنْكِحُ الْمُحْرِمُ، وَلَا يُنْكَحُ، وَلَا يَخْطُبُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11013,
                "hadithNumber": "3449",
                "englishNarrator": "Uthman (bin 'Affan رضی اللہ عنہ) reported:",
                "hadithEnglish": "It directly from Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) that he said: A Muhrim should neithermarry (in that state) nor make the proposal of marriage.",
                "hadithUrdu": "وہ اس ( کی سند ) کو نبی صلی اللہ علیہ وسلم تک پہنچاتے تھے کہ آپ صلی اللہ علیہ وسلم نے فرمایا : \" محرم ( جس نے احرام باندھ رکھا ہو وہ ) نکاح کرے نہ نکاح کا پیغام بھیجے.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، عمرو نقید اور زہیر بن حرب نے ابن عیینہ کی سند سے بیان کیا: سفیان بن عیینہ، ایوب بن موسیٰ نے نبیہ بن وہب سے ، انہوں نے ابان بن عثمان سے ، انہوں نے حضرت عثمان رضی اللہ عنہ سے روایت کی",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، قَالَ زُهَيْرٌ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَيُّوبَ بْنِ مُوسَى، عَنْ نُبَيْهِ بْنِ وَهْبٍ، عَنْ أَبَانَ بْنِ عُثْمَانَ، عَنْ عُثْمَانَ، يَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «الْمُحْرِمُ لَا يَنْكِحُ، وَلَا يَخْطُبُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 10701,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=428",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=426",
                "label": "426",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=427",
                "label": "427",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=428",
                "label": "428",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=429",
                "label": "429",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=430",
                "label": "430",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=431",
                "label": "431",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=432",
                "label": "432",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=430",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=430",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=428",
        "to": 10725,
        "total": 40465
    }
}