{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 402,
        "data": [
            {
                "id": 10314,
                "hadithNumber": "2750",
                "englishNarrator": "Abu Qatada Ansari (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Massenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was asked about fasting on Monday, whereupon he said: It is (the day) when I was born and revelation was sent down to me.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم سے سوموار کے روزے کے بار ے میں سوال کیا گیا تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" میں اسی دن پیدا ہوا اور اسی دن مجھ پر ( قرآن ) نازل کیا گیا ۔ \"",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، ہم سے عبدالرحمٰن بن مہدی نے بیان کیا، انہوں نے ہم سے بیان کیا ہمیں مہدی بن میمون نے حدیث سنائی ، انھوں نے غیلان سے باقی ماندہ سابقہ سند کے ساتھ ابو قتادہ انصاری رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا مَهْدِيُّ بْنُ مَيْمُونٍ، عَنْ غَيْلَانَ، عَنْ عَبْدِ اللهِ بْنِ مَعْبَدٍ الزِّمَّانِيِّ، عَنْ أَبِي قَتَادَةَ الْأَنْصَارِيِّ، رَضِيَ اللهُ عَنْهُ أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْ صَوْمِ الِاثْنَيْنِ؟ فَقَالَ: «فِيهِ وُلِدْتُ وَفِيهِ أُنْزِلَ عَلَيَّ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10315,
                "hadithNumber": "2751",
                "englishNarrator": "Imran bin Husain ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger (صلی اللہ علیہ وسلم) having said to him or to someone else: Did you fast in the middle of Sha'ban? He said: No. Thereupon he (the Holy Prophet) said: If you did not observe fast, then you should observe fast for two days.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ان سے ۔ ۔ ۔ یا یا کسی اور آدمی سے ۔ ۔ ۔ فر ما یا : \" کیا تم نے شعبان کے وسط میں روزے رکھے ہیں ؟ \" اس نے جواب دیا : نہیں آپ صلی اللہ علیہ وسلم نے فر ما یا : \" جب تم روزے ختم کر لو تو دو دن کے روزے رکھنا ۔ \"",
                "urduNarrator": "ہم سے حداب بن خالد نے بیان کیا، کہا ہم سے حماد بن سلمہ نے بیان کیا ثا بت نے مطر ف سے انھوں نے حضرت عمرا ن حصین رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ مُطَرِّفٍ - وَلَمْ أَفْهَمْ مُطَرِّفًا مِنْ هَدَّابٍ - عَنْ عِمْرَانَ بْنِ حُصَيْنٍ رَضِيَ اللهُ عَنْهُمَا، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ لَهُ - أَوْ لِآخَرَ -: «أَصُمْتَ مِنْ سُرَرِ شَعْبَانَ؟» قَالَ: لَا، قَالَ: «فَإِذَا أَفْطَرْتَ، فَصُمْ يَوْمَيْنِ».",
                "headingArabic": "صَوْمِ سَرَرِ شَعْبَانَ ‏",
                "headingUrdu": "شعبان کے آخر میں روزہ رکھنا",
                "headingEnglish": "Fasting at the end of Sha'ban",
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10316,
                "hadithNumber": "2752",
                "englishNarrator": "Imran bin Husain (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to a person: Did you observe any fast in the middle of this month (Sha'ban)? He said: No. Thereupon the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Fast for two days instead of (one fast) when you have completed (fasts of) Ramadan.",
                "hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم نے ایک آدمی سے پو چھا : کیا تم نے اس مہینے کے دورا ن میں کچھ روزے رکھے ہیں ؟ اس نے جواب دیا : نہیں ۔ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" جب تم تمضا ن کے روزے ختم کر لو تو اس کی جگہ دو رازے رکھ لینا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے یزید بن ہارون نے بیان کیا، وہ الجریری کی سند سے, ابو علا ء نے مطر ف سے اور انھوں نے حضرت حصین رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنِ الْجُرَيْرِيِّ، عَنْ أَبِي الْعَلَاءِ، عَنْ مُطَرِّفٍ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ رَضِيَ اللهُ عَنْهُمَا، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ لِرَجُلٍ: «هَلْ صُمْتَ مِنْ سُرَرِ هَذَا الشَّهْرِ شَيْئًا؟» قَالَ: لَا، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «فَإِذَا أَفْطَرْتَ مِنْ رَمَضَانَ، فَصُمْ يَوْمَيْنِ مَكَانَهُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10317,
                "hadithNumber": "2753",
                "englishNarrator": "Imran bin Husain (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to a person: Did you observe fast in the middle of this month. i. e. Sha'ban? He said: No. Thereupon he said to him: When it is the end of Ramadan, then observe fast for one day or two (Shu'ba had some doubt about it) but he said: I think that he has said: two days.",
                "hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم نے ایک آدمی سے پو چھا : کیا تم نے اس مہینے یعنی شعبا ن کے وسط ( یا دوران ) میں کچھ روزے رکھے ہیں؟اس نے جواب دیا : نہیں تو آپ صلی اللہ علیہ وسلم نے اسے فرما یا : \" جب تم رمضا ن کے روزے ختم کر لو اس کے بعد ایک دن یا دو دن کے روزے رکھ لینا ۔ شعبہ نے ۔ ۔ ۔ جن کو شک ہوا ۔ ۔ کہا میرا خیال ہے کہ آپ نے دو دن کے روزے کہا تھا ۔",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا, محمد بن جعفر نے کہا : ہمیں شعبہ نے مطرف بن شخیر کے بھتیجے سے حدیث سنا ئی کہا : میں نے مطرف کو حضرت عمرا ن بن حصین رضی اللہ تعالیٰ عنہ سے حدیث بیان کرتے ہو ئے سنا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنِ ابْنِ أَخِي مُطَرِّفِ بْنِ الشِّخِّيرِ، قَالَ: سَمِعْتُ مُطَرِّفًا، يُحَدِّثُ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ رَضِيَ اللهُ عَنْهُمَا، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ لِرَجُلٍ: «هَلْ صُمْتَ مِنْ سُرَرِ هَذَا الشَّهْرِ شَيْئًا؟» يَعْنِي شَعْبَانَ، قَالَ: لَا، قَالَ: فَقَالَ لَهُ: «إِذَا أَفْطَرْتَ رَمَضَانَ، فَصُمْ يَوْمًا أَوْ يَوْمَيْنِ» - شُعْبَةُ الَّذِي شَكَّ فِيهِ - قَالَ: وَأَظُنُّهُ قَالَ: يَوْمَيْنِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10318,
                "hadithNumber": "2754",
                "englishNarrator": null,
                "hadithEnglish": "This hadith is narrated by 'Abdullah bin Hani bin Akhi Mutarrif with the same chain of transmitters.",
                "hadithUrdu": "مجھ سے محمد بن قدامہ اور یحییٰ للولوعی نے بیان کیا، کہا: اس نے ہمیں بتایا نضر نے ہمیں خبر دی ( کہا ) ہمیں شعبہ نے خبر دی ( کہا ) ہمیں مطرف کے بھتیجے عبد اللہ بن ہانی نے اسی سند کے ساتھ اس ( سابقہ حدیث ) کے مانند حدیث روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ قُدَامَةَ، وَيَحْيَى اللُّؤْلُؤِيُّ، قَالَا: أَخْبَرَنَا النَّضْرُ، أَخْبَرَنَا شُعْبَةُ، حَدَّثَنَا عَبْدُ اللهِ بْنُ هَانِئِ ابْنِ أَخِي مُطَرِّفٍ، فِي هَذَا الْإِسْنَادِ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10319,
                "hadithNumber": "2755",
                "englishNarrator": "Abu Haraira (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) as saying: The most excellent fast after Ramadan is God's month. Al-Muharram, and the most excellent prayer after what is prescribed is prayer during the night.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" رمضا ن کے بعد سب سے افضل روزے اللہ کے مہینے \" محرم \" کے ہیں اور فرض نماز کے بعد سب سے افضل نماز رات کی نماز ہے ۔",
                "urduNarrator": "مجھ سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے ابو عوانہ نے بیان کیا, ابو بشر نے حمید بن عبد الرحمن حمیری سے اور انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ۔ کہا",
                "hadithArabic": "حَدَّثَنِي قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ الْحِمْيَرِيِّ، عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَفْضَلُ الصِّيَامِ، بَعْدَ رَمَضَانَ، شَهْرُ اللهِ الْمُحَرَّمُ، وَأَفْضَلُ الصَّلَاةِ، بَعْدَ الْفَرِيضَةِ، صَلَاةُ اللَّيْلِ».",
                "headingArabic": "فَضْلِ صَوْمِ الْمُحَرَّمِ ‏",
                "headingUrdu": "محرم کے روزے کی فضیلت",
                "headingEnglish": "The virtue of fasting Muharram",
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10320,
                "hadithNumber": "2756",
                "englishNarrator": "Abu Huraira ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "He (the Messenger of Allah) was asked as to which prayer was most excellent after the prescribed prayer, and which fast was most excellent after the month of Ramadan. He said: Prayer offered in the middle of the night and the most excellent fast after (fasting) in the month of Ramadan is the fast in God's month al-Muharram.",
                "hadithUrdu": "وہ اس کو نبی صلی اللہ علیہ وسلم کی طرف سے بیان کر رہے تھے ۔ کہا : آپ سے در یافت کیا گیا : فرض نماز کے بعد کو ن سی نماز افضل ہے اور ماہ رمضان کے بعد کو ن سے روزے افضل ہے ؟آپ صلی اللہ علیہ وسلم نے فر ما یا : \" فرض نماز کے بعد سب سے افضل نماز آدھی رات کی نماز ہے اور رمضا ن کے مہینے کے بعد سب سے افضل روزے اللہ کے مہینے محرم کے روزے ہیں ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، انہوں نے ہم سے بیان کیاجریر نے عبد الملک بن عمیر سے انھوں نے محمد بن منتشر سے انھوں نے حمید بن عبد الرحمن سے اور انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی",
                "hadithArabic": "وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ مُحَمَّدِ بْنِ الْمُنْتَشِرِ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ، يَرْفَعُهُ، قَالَ: سُئِلَ: أَيُّ الصَّلَاةِ أَفْضَلُ بَعْدَ الْمَكْتُوبَةِ؟ وَأَيُّ الصِّيَامِ أَفْضَلُ بَعْدَ شَهْرِ رَمَضَانَ؟ فَقَالَ: «أَفْضَلُ الصَّلَاةِ، بَعْدَ الصَّلَاةِ الْمَكْتُوبَةِ، الصَّلَاةُ فِي جَوْفِ اللَّيْلِ، وَأَفْضَلُ الصِّيَامِ بَعْدَ شَهْرِ رَمَضَانَ، صِيَامُ شَهْرِ اللهِ الْمُحَرَّمِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10321,
                "hadithNumber": "2757",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been reported from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) by 'Abdul-Malik with the same chain of transmitters in connection with fast.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے حسین بن علی نےزائد ہ نے عبد الملک بن عمیر سے اسی سند کے ساتھ نبی صلی اللہ علیہ وسلم سے روزوں کے ذکر میں اس ( سابقہ حدیث ) کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ، عَنْ زَائِدَةَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، بِهَذَا الْإِسْنَادِ فِي ذِكْرِ الصِّيَامِ عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10322,
                "hadithNumber": "2758",
                "englishNarrator": "Abu Ayyub al-Ansari ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who observed the fast of Ramadan and then followed it with six (fasts) of Shawwal. it would be as if he fasted perpetually.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" جس نے رمضا ن کے روزے رکھے ۔ پھر اس کے بعد شوال کے چھروزے رکھے تو یہ ( پوراسال ) مسلسل روزے رکھنے کی طرح ہے ۔",
                "urduNarrator": "یحییٰ بن ایوب، قتیبہ بن سعید اور علی بن حجر نے ہم سے روایت کی ہے, ہمیں اسما عیل بن جعفر نے حدیث سنا ئی ، ( کہا : ) مجھے سعد بن سعید قیس نے عمر بن ثا بت بن حارث خز رجی سے خبر دی ، انھوں نے حضرت ابو ایوب انصاری رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے ان کو حدیث سنا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَعَلِيُّ بْنُ حُجْرٍ، جَمِيعًا عَنْ إِسْمَاعِيلَ، قَالَ ابْنُ أَيُّوبَ: حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، أَخْبَرَنِي سَعْدُ بْنُ سَعِيدِ بْنِ قَيْسٍ، عَنْ عُمَرَ بْنِ ثَابِتِ بْنِ الْحَارِثِ الْخَزْرَجِيِّ، عَنْ أَبِي أَيُّوبَ الْأَنْصَارِيِّ رَضِيَ اللهُ عَنْهُ، أَنَّهُ حَدَّثَهُ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ صَامَ رَمَضَانَ ثُمَّ أَتْبَعَهُ سِتًّا مِنْ شَوَّالٍ، كَانَ كَصِيَامِ الدَّهْرِ».",
                "headingArabic": "اسْتِحْبَابِ صَوْمِ سِتَّةِ أَيَّامٍ مِنْ شَوَّالٍ اتِّبَاعًا لِرَمَضَانَ ‏",
                "headingUrdu": "رمضان المبارک کے بعد شوال میں چھ روزے رکھنا مستحب ہے۔",
                "headingEnglish": "It is recommended to fast Six Days in Shawwal following Ramadan",
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10323,
                "hadithNumber": "2759",
                "englishNarrator": null,
                "hadithEnglish": "Abu Ayyub al-Ansari رضی اللہ تعالیٰ عنہ reported (through another chain of transmitters): I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saying like this.",
                "hadithUrdu": "عبد اللہ بن نمیر نے باقی ماندہ سابقہ سند کے ساتھ حضرت ابو ایوب انصاری رضی اللہ تعالیٰ عنہ سے خبر دی کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فر ما تے ہو ئے سنا ۔ ۔ ۔ اسی ( سابقہ حدیث کے مانند ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا سَعْدُ بْنُ سَعِيدٍ، أَخُو يَحْيَى بْنِ سَعِيدٍ، أَخْبَرَنَا عُمَرُ بْنُ ثَابِتٍ، أَخْبَرَنَا أَبُو أَيُّوبَ الْأَنْصَارِيُّ رَضِيَ اللهُ عَنْهُ، قَالَ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10324,
                "hadithNumber": "2760",
                "englishNarrator": null,
                "hadithEnglish": "Abu Ayyub رضی اللہ تعالیٰ عنہ reported a hadith like this (through another chain of transmitters).",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، انہوں نے بیان کیاعبد اللہ بن مبا رک نے سعد بن سعید سے روایت کی ، کہا : میں نے عمر بن ثابت سے سنا ، کہا : میں نے حضرت ایوب رضی اللہ تعالیٰ عنہ سے سنا ، کہہ رہے تھے ۔ رسول اللہ صلی اللہ علیہ وسلم نے ارشاد فرمایا ۔ ۔ اسی ( سابقہ حدیث ) کے مانند ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللهِ بْنُ الْمُبَارَكِ، عَنْ سَعْدِ بْنِ سَعِيدٍ، قَالَ: سَمِعْتُ عُمَرَ بْنَ ثَابِتٍ، قَالَ: سَمِعْتُ أَبَا أَيُّوبَ رَضِيَ اللهُ عَنْهُ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10325,
                "hadithNumber": "2761",
                "englishNarrator": "Ibn 'Umar (رضی اللہ تعالیٰ عنہما ) reported:",
                "hadithEnglish": "Some persons among the Companions of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) were shown Lailat-ul-Qadr while sleeping in the last week (of Ramadan). Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: I see that your dreams agree regarding the last week; so he who wants to seek it should seek it in the last week (during the night).",
                "hadithUrdu": "آخری سات راتوں میں نبی اکرم صلی اللہ علیہ وسلم کے اصحاب میں سے کچھ لوگوں کو خواب میں لیلۃ القدردکھا ئی گئی تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" میں دیکھتا ہوں کہ تمھا را خواب آخری ساتھ راتوں میں ایک دوسرے کے موافق ہو گیا ہے اب جو اس ( لیلۃالقدر ) کو تلاش کرنا چا ہے وہ اسے آخری سات راتوں میں تلاش کرے ۔ ( حضرت ابن عمر رضی اللہ تعالیٰ عنہ کے بیان کردہ مکمل الفا ظ آگے حدیث : 2764میں ہیں )",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا: میں نے مالک رضی اللہ عنہ سے پڑھا, نافع نے حضرت ابن عمر رضی اللہ تعالیٰ عنہما سے روایت کی ، کہ",
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ رَضِيَ اللهُ عَنْهُمَا، أَنَّ رِجَالًا مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أُرُوا لَيْلَةَ الْقَدْرِ فِي الْمَنَامِ، فِي السَّبْعِ الْأَوَاخِرِ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَرَى رُؤْيَاكُمْ قَدْ تَوَاطَأَتْ فِي السَّبْعِ الْأَوَاخِرِ، فَمَنْ كَانَ مُتَحَرِّيَهَا، فَلْيَتَحَرَّهَا فِي السَّبْعِ الْأَوَاخِرِ».",
                "headingArabic": "فَضْلِ لَيْلَةِ الْقَدْرِ وَالْحَثِّ عَلَى طَلَبِهَا وَبَيَانِ مَحَلِّهَا وَأَرْجَى أَوْقَاتِ طَلَبِهَا",
                "headingUrdu": "لیلۃ القدر کی فضیلت اور اس کی تلاش کی تلقین؛ یہ کب ہے اور اسے تلاش کرنے کا سب سے زیادہ امکان ہے۔",
                "headingEnglish": "The virtue of Lailat Al-Qadr and the Exhortation to seek it; When it is and the most likely times to seek it",
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10326,
                "hadithNumber": "2762",
                "englishNarrator": "Ibn 'Umar (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Seek Lailat-ul-Qadr in the last week (of Ramadan).",
                "hadithUrdu": "انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ، فر ما یا : \" لیلۃالقدر کو ( رمضان کی ) آخری سات راتوں میں تلا ش کرو ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا: میں نے مالک رضی اللہ عنہ سے پڑھا,  عبد اللہ بن دینار نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے",
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ عَبْدِ اللهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ رَضِيَ اللهُ عَنْهُمَا، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «تَحَرَّوْا لَيْلَةَ الْقَدْرِ فِي السَّبْعِ الْأَوَاخِرِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10327,
                "hadithNumber": "2763",
                "englishNarrator": "Salim reported on the authority of his father:",
                "hadithEnglish": "A person saw Lailat-ul- Qadr on the 27th (of Ramadan). Thereupon Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: I see that your dreams agree regarding the last ten (nights of Ramadan). So seek it on an odd number (of these ten nights).",
                "hadithUrdu": "ایک شخص نے ( خواب میں ) دیکھا کہ لیلۃالقدر ستائیسویں رات ہے ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" میں دیکھ رہا ہوں کہ تمھا را خواب آخری عشرے کے بارے میں ہے تم اس ( لیلۃ القدر ) کو اس ( عشرے ) کی طاق ( راتوں ) میں تلا ش کرو ۔ \"",
                "urduNarrator": "مجھ سے عمرو ناقد نے بیان کیا، اور مجھ سے زہیر بن حرب نے بیان کیا، انہوں نے کہا سفیان بن عیینہ نے زہری سے انھوں نے سالم سے اور انھوں نے اپنے والد ( حضرت عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ )سے روایت کی ، کہا",
                "hadithArabic": "وحَدَّثَنِي عَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالَ زُهَيْرٌ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ رَضِيَ اللهُ عَنْهُ، قَالَ: رَأَى رَجُلٌ أَنَّ لَيْلَةَ الْقَدْرِ لَيْلَةُ سَبْعٍ وَعِشْرِينَ، فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَرَى رُؤْيَاكُمْ فِي الْعَشْرِ الْأَوَاخِرِ، فَاطْلُبُوهَا فِي الْوِتْرِ مِنْهَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10328,
                "hadithNumber": "2764",
                "englishNarrator": "Salim bin 'Abdullah bin 'Umar reported that his father said:",
                "hadithEnglish": "I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: So far as Lailat-ul-Qadr is concerned. some persons among you have seen it (in a dream) in the first week and some persons among you have been shown that it is in the last week; so seek it in the last ten (nights).",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے لیلۃ القدر کے بارے میں سنا ، فر مارہے تھے : \" تم میں سے کچھ لوگوں کو ( خواب میں ) دکھا یا گیا ہے کہ یہ پہلی ساتھ را توں میں ہے اور تم میں سے کچھ لوگوں کو دکھا یا گیا ہے کہ یہ بعد میں آنے والی سات راتوں میں ہے تو تم اس کو بعد میں آنے والی ( آخری ) دس راتوں میں تلاش کرو ۔",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، انہوں نے کہا یو نس نے ابن شہاب سے روایت کی ، ( کہا : ) مجھے سالم بن عبد اللہ بن عمر نے خبرد ی کہ ان کے والد نے کہا",
                "hadithArabic": ") وحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللهِ بْنِ عُمَرَ، أَنَّ أَبَاهُ رَضِيَ اللهُ عَنْهُ، قَالَ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ لِلَيْلَةِ الْقَدْرِ: «إِنَّ نَاسًا مِنْكُمْ قَدْ أُرُوا أَنَّهَا فِي السَّبْعِ الْأُوَلِ، وَأُرِيَ نَاسٌ مِنْكُمْ أَنَّهَا فِي السَّبْعِ الْغَوَابِرِ، فَالْتَمِسُوهَا فِي الْعَشْرِ الْغَوَابِرِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10329,
                "hadithNumber": "2765",
                "englishNarrator": "Ibn Umar (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Seek it (Lailat-ul-Qadr) in the last (ten nights). If one among you shows slackness and weakness (in the earlier part of Ramadan), it should not be allowed to prevail upon him in the last week.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" تم اس یعنی لیلۃ القدر کو آخری دس راتوں میں تلاش کرو اگر تم میں سے کو ئی کمزور پڑ جا ئے یا بے بس ہو جا ئے تو وہ باقی کی سات راتوں میں ( کسی صورت سستی کمزوری سے ) مغلوب نہ ہو ۔",
                "urduNarrator": "ہم سے محمد بن مثنیٰ نے بیان کیا، ہم سے محمد بن جعفر نے بیان کیا، ہم سے شعبہ نے بیان کیا, عقبہ نے کہا : میں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے سنا ، کہہ رہے تھے",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عُقْبَةَ وَهُوَ ابْنُ حُرَيْثٍ، قَالَ: سَمِعْتُ ابْنَ عُمَرَ رَضِيَ اللهُ عَنْهُمَا، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الْتَمِسُوهَا فِي الْعَشْرِ الْأَوَاخِرِ - يَعْنِي لَيْلَةَ الْقَدْرِ - فَإِنْ ضَعُفَ أَحَدُكُمْ أَوْ عَجَزَ، فَلَا يُغْلَبَنَّ عَلَى السَّبْعِ الْبَوَاقِي».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10330,
                "hadithNumber": "2766",
                "englishNarrator": "Ibn Umar ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who is anxious to seek it (Lailat-ul-Qadr) should seek it in the last ten (nights of Ramadan).",
                "hadithUrdu": "آپ نے فرما یا : \"\" جو اس رات کا متلا شی ہو تو وہ اسے آخری دس راتوں میں تلاش کرے ۔",
                "urduNarrator": "ہم سے محمد بن مثنیٰ نے بیان کیا، ہم سے محمد بن جعفر نے بیان کیا، ہم سے انہوں نے بیان کیا شعبہ نے جبلہ سے روایت کی کہا : میں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے سنا ، وہ نبی صلی اللہ علیہ وسلم سے حدیث بیان کر رہے تھے کہ",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ جَبَلَةَ، قَالَ: سَمِعْتُ ابْنَ عُمَرَ رَضِيَ اللهُ عَنْهُمَا، يُحَدِّثُ عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: «مَنْ كَانَ مُلْتَمِسَهَا فَلْيَلْتَمِسْهَا فِي الْعَشْرِ الْأَوَاخِرِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10331,
                "hadithNumber": "2767",
                "englishNarrator": "Ibn 'Umar (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Seek the time of Lailat-ul-Qadr in the last (ten nights), or he said: in the last nine (nights).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" تم لیلۃ القدر کے اوقت آخری دس راتوں میں تلاش کرو ۔ یا فر ما یا : \" آخری سات راتوں میں ( تلاش کرو ۔ )",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے علی بن مشر نے بیان کیا , شیبانی نے جبلہ اور محارب سے انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی کہا",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنِ الشَّيْبَانِيِّ، عَنْ جَبَلَةَ، وَمُحَارِبٍ، عَنِ ابْنِ عُمَرَ رَضِيَ اللهُ عَنْهُمَا، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «تَحَيَّنُوا لَيْلَةَ الْقَدْرِ فِي الْعَشْرِ الْأَوَاخِرِ» أَوْ قَالَ «فِي التِّسْعِ الْأَوَاخِرِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10332,
                "hadithNumber": "2768",
                "englishNarrator": "Abu Huraira ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: I was shown Lailat-ul-Qadr; then some members of my family awoke me up, then I was caused to forget it. So seek it in the last week. Harmala said: (The Prophet did not say: I was made to forget, but he stated): But I forgot it.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \"\" مجھے ( خواب میں ) شب قدر دکھا ئی گئی پھر مجھے میرے گھر والوں میں سے کسی نے بیدار کر دیا تو وہ مجھے بھلوادی گئی ، تم اسے بعد میں آنے والی ( آخری ) دس راتوں میں تلا ش کرو ۔ حرملہ نے ( \"\" مجھے بھلوادی گئی \"\" کے بجا ئے ) \"\" میں اسے بھول گیا \"\" کہا ۔",
                "urduNarrator": "ہمیں ابو طاہر اور حرملہ بن یحییٰ نے حدیث بیان کی ، دونوں نے کہا : ہمیں ابن وہب نے خبردی ( کہا : ) مجھے یو نس نے ابن شہاب سے خبردی ، انھوں نے ابو سلمہ بن عبد الرحمٰن سے اور انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، قَالَا: أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أُرِيتُ لَيْلَةَ الْقَدْرِ، ثُمَّ أَيْقَظَنِي بَعْضُ أَهْلِي، فَنُسِّيتُهَا فَالْتَمِسُوهَا فِي الْعَشْرِ الْغَوَابِرِ» وقَالَ حَرْمَلَةُ: «فَنَسِيتُهَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10333,
                "hadithNumber": "2769",
                "englishNarrator": "Abu Sa'id al-Khudri (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) spent in devotion (in i'tikaf) the middle ten nights of the month of Ramadan, and when twenty nights were over and it was the twenty-first night, he went back to his residence and those who were along with him also returned (to their respective residences). He spent one month in devotion. Then he addressed the people on the night he came back (to his residence) and commanded them as Allah desired (him to command) and then said: I used to devote myself (observe i'tikaf) during these ten (nights). Then I started devoting myself in the last ten (nights). And he who desires to observe i'tikaf along with me should spend the night) at his place of i'tikaf. And I saw this night (Lailat-ul-Qadr) but I forgot it (the exact night) ; so seek it;In the last ten nights on odd numbers. I saw (the glimpses of that dream) that I was prostrating in water and mud. Abu Sa'id al-Khudri رضی اللہ تعالیٰ عنہ said: It rained on the twenty-first night and the water dripped (from the roof) of the mosque at the place where the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) observed prayer. I looked at him and as he completed the dawn prayer, (I found) his face was wet with mud and water.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ان دس دنوں میں اعتکاف کرتے تھے جو مہینے کے درمیان میں ہو تے ہیں جب وہ وقت آتا کہ بیس راتیں گزر جا تیں اور اکیسویں رات کی آمد ہو تی تو اپنے گھر لو ٹ جا تے اور وہ شخص بھی لو ٹ جا تا جو آپ کے ساتھ اعتکاف کرتا تھا ۔ پھر آپ ایک مہینے ، جس میں آپ نے اعتکاف کیا تھا اس رات ٹھہرے رہے جس میں آپ ( گھر ) لو ٹ جا یا کرتے تھے ۔ آپ نے لوگوں کو خطبہ دیا ، جو اللہ تعا لیٰ نے چا ہا اس کا حکم دیا ۔ پھر فر ما یا : \"\" میں ان ( درمیانے ) دس دنوں کا اعتکاف کرتا تھا ۔ پھر مجھ پر منکشف ہوا کہ میں اس آخری عشرے کا اعتکاف کروں ۔ تو جس شخص نے میرے ساتھ اعتکاف کیا ہے وہ اپنے اعتکاف کی جگہ ہی میں رات بسر کرے اور بلاشبہ میں نے یہ رات خواب میں دیکھی ہے اس کے بعد وہ مجھے بھلا دی گئی ۔ لہٰذا تم اسے آخری عشرے کی ہر طاق رات میں تلاش کرو ۔ میں اپنے آپ کو ( خواب میں ) دیکھا کہ میں پانی اور مٹی میں سجدہ کر رہا ہوں ۔ ابو سعید خدری رضی اللہ تعالیٰ عنہ نے کہا : اکیسویں رات ہم پر بارش ہو ئی تو رسول اللہ صلی اللہ علیہ وسلم کی نماز پڑھنے کی جگہ میں مسجد ( کی چھت ٹپک پڑی میں میں نے جب آپ صبح کی نماز سے فارغ ہو چکے تھے ۔ آپ کو دیکھا تو آپ کے چہرہ مبارک مٹی اور پانی سے بھیگا ہوا تھا ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، انہوں نے بیان کیا ہمیں بکر نے ابن ہا د سے حدیث سنا ئی ، انھوں نے محمد بن ابرا ہیم سے ، انھوں نے ابو سلمہ بن عبد الرحمن سے انھوں نے حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا بَكْرٌ وَهُوَ ابْنُ مُضَرَ، عَنِ ابْنِ الْهَادِ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللهُ عَنْهُ، قَالَ: كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُجَاوِرُ فِي الْعَشْرِ الَّتِي فِي وَسَطِ الشَّهْرِ، فَإِذَا كَانَ مِنْ حِينِ تَمْضِي عِشْرُونَ لَيْلَةً، وَيَسْتَقْبِلُ إِحْدَى وَعِشْرِينَ يَرْجِعُ إِلَى مَسْكَنِهِ، وَرَجَعَ مَنْ كَانَ يُجَاوِرُ مَعَهُ، ثُمَّ إِنَّهُ أَقَامَ فِي شَهْرٍ، جَاوَرَ فِيهِ تِلْكَ اللَّيْلَةَ الَّتِي كَانَ يَرْجِعُ فِيهَا، فَخَطَبَ النَّاسَ، فَأَمَرَهُمْ بِمَا شَاءَ اللهُ، ثُمَّ قَالَ: «إِنِّي كُنْتُ أُجَاوِرُ هَذِهِ الْعَشْرَ، ثُمَّ بَدَا لِي أَنْ أُجَاوِرَ هَذِهِ الْعَشْرَ الْأَوَاخِرَ، فَمَنْ كَانَ اعْتَكَفَ مَعِي فَلْيَبِتْ فِي مُعْتَكَفِهِ، وَقَدْ رَأَيْتُ هَذِهِ اللَّيْلَةَ فَأُنْسِيتُهَا، فَالْتَمِسُوهَا فِي الْعَشْرِ الْأَوَاخِرِ، فِي كُلِّ وِتْرٍ، وَقَدْ رَأَيْتُنِي أَسْجُدُ فِي مَاءٍ وَطِينٍ» قَالَ أَبُو سَعِيدٍ الْخُدْرِيُّ: مُطِرْنَا لَيْلَةَ إِحْدَى وَعِشْرِينَ، فَوَكَفَ الْمَسْجِدُ فِي مُصَلَّى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَنَظَرْتُ إِلَيْهِ وَقَدِ انْصَرَفَ مِنْ صَلَاةِ الصُّبْحِ، وَوَجْهُهُ مُبْتَلٌّ طِينًا وَمَاءً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10334,
                "hadithNumber": "2770",
                "englishNarrator": "Abu Sa'id al-Khudri ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) devoted (himself to prayer) in the middle (ten nights) of Ramadan. The rest of the hadith is the same except for these words: That he adhered to his place of i'tikaf and his forehead was besmeared with mud and water.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم رمضا ن میں درمیانے عشرے کا اعتکاف کرتے تھے ۔ ۔ ۔ ( آگے ) اس ( سابقہ حدیث ) کے مانند حدیث بیان کی ، البتہ انھوں نے ( اپنے \" اعتکا ف کی جگہ میں را ت گزارنے \" کے بجا ئے ) ا \" پنے اعتکاف کی جگہ میں ٹکارہے ، \" کہا اور کہا : آپ کی پیشانی مٹی اور پانی سے بھری ہو ئی تھی ۔",
                "urduNarrator": "ہم سے ابن ابی عمر نے بیان کیا، انہوں نے کہا عبد العزیز ، یعنی دراوری نے یزید ( بن ہاد ) سے انھوں نے محمد بن ابرا ہیم سے انھوں نے ابو سلمہ بن عبد الرحمن سے اور انھوں نے حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ سے روایت کی کہ انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي الدَّرَاوَرْدِيَّ، عَنْ يَزِيدَ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللهُ عَنْهُ، أَنَّهُ قَالَ: كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُجَاوِرُ، فِي رَمَضَانَ، الْعَشْرَ الَّتِي فِي وَسَطِ الشَّهْرِ، وَسَاقَ الْحَدِيثَ بِمِثْلِهِ، غَيْرَ أَنَّهُ قَالَ: «فَلْيَثْبُتْ فِي مُعْتَكَفِهِ» وَقَالَ: وَجَبِينُهُ مُمْتَلِئًا طِينًا وَمَاءً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10335,
                "hadithNumber": "2771",
                "englishNarrator": "Abu Sa'id al-Khudri (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) observed i'tikaf (confined himself for devotion and prayer) in the first ten (days) of Ramadan; he then observed i'tikaf in the middle ten (days) in a Turkish tent with a mat hanging at its door. He (the Holy Prophet) took hold of that mat and placed it in the nook of the tent. He then put his head out and talked with people and they came near him, and he (the Holy Prophet) said: I observed i'tikaf in the first ten (nights and days) in order to seek that night (Lailat-ul-Qadr). I then observed i'tikaf in the middle ten days. Then (an angel) was sent to me and I was told that this (night) is among the last ten (nights). He who among you likes to observe i'tikaf should do so; and the people observed it along with him, and he (the Holy Prophet) said: That (Lailat-ul-Qadr) was shown to me on an odd (night) and I (saw in the dream) that I was prostrating in the morning in clay and water. So in the morning of the twenty-first night when he (the Holy Prophet) got up for dawn (prayer). there was a rainfall and the mosque dripped, and I saw clay and water. When he came out after completing the morning prayer (I saw) that his forehead and the tip of his nose had (traces) of clay and water, and that was the twenty-first night among the last ten (nights).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ایک ترکی خیمے کے اندر جس کے دروازے پر چٹائی تھی ، رمضا ن کے پہلے عشرے میں اعتکا ف کیا ، پھر درمیانے عشرے میں اعتکاف کیا ۔ کہا : تو آپ نے چتا ئی کو اپنے ہاتھ سے پکڑ کر خیمے کے ایک کونے میں کیا ، پھر اپنا سر مبا رک خیمے سے باہر نکا ل کر لو گوں سے گفتگو فر ما ئی ، لوگ آپ کے قریب ہو گئے تو آپ صلی اللہ علیہ وسلم نے فر مایا : \"\" میں نے اس شب ( قدر ) کوتلاش کرنے کے لیے پہلے عشرے کا اعتکاف کیا ، پھر میں نے درمیانے عشرے کا اتکاف کیا ، پھر میرے پاس ( بخاری حدیث : 813میں ہے : جبریل ؑ کی آمد ہو ئی تو مجھ سے کہا گیا : وہ آخری دس راتوں میں ہے تو اب تم میں سے جو اعتکاف کرنا چا ہے وہ اعتکاف کر لے ، \"\" لوگوں نے آپ کے ساتھ اعتکاف کیا ۔ آپ نے فر مایا : \"\" اور مجھے وہ ایک طاق رات دکھا ئی گئی اور یہ کہ میں اس ( رات ) کی صبح مٹی اور پانی میں سجدہ کر رہا ہوں ۔ رسول اللہ صلی اللہ علیہ وسلم نے اکیسویں رات کی صبح کی ، اور آپ نے ( اس میں ) صبح تک قیام کیا تھا پھر بارش ہو ئی تو مسجد ( کی چھت ) ٹپک پڑی ، میں نے مٹی اور پانی دیکھا اس کے بعد جب آپ صبح کی نماز سے فارغ ہو کر باہر نکلے تو آپ کی پیشانی اور ناک کے کنارے دونوں میں مٹی اور پانی ( کے نشانات ) موجود تھے اور یہ آخری عشرے میں اکیسویں کی رات تھی ۔",
                "urduNarrator": "مجھ سے محمد بن عبد الاعلٰی نے بیان کیا، ہم سے المعتمر نے بیان کیا, ہم سے عمارہ بن غزیہ انصاری نے حدیث بیان کی ، کہا : میں نے محمد بن ابرا ہیم سے سنا وہ ابو سلمہ سے حدیث بیان کر رہے تھے ، انھوں نے حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى، حَدَّثَنَا الْمُعْتَمِرُ، حَدَّثَنَا عُمَارَةُ بْنُ غَزِيَّةَ الْأَنْصَارِيُّ، قَالَ: سَمِعْتُ مُحَمَّدَ بْنَ إِبْرَاهِيمَ، يُحَدِّثُ عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللهُ عَنْهُ، قَالَ: إِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ اعْتَكَفَ الْعَشْرَ الْأَوَّلَ مِنْ رَمَضَانَ، ثُمَّ اعْتَكَفَ الْعَشْرَ الْأَوْسَطَ، فِي قُبَّةٍ تُرْكِيَّةٍ عَلَى سُدَّتِهَا حَصِيرٌ، قَالَ: فَأَخَذَ الْحَصِيرَ بِيَدِهِ فَنَحَّاهَا فِي نَاحِيَةِ الْقُبَّةِ، ثُمَّ أَطْلَعَ رَأْسَهُ فَكَلَّمَ النَّاسَ، فَدَنَوْا مِنْهُ، فَقَالَ: إِنِّي اعْتَكَفْتُ الْعَشْرَ الْأَوَّلَ، أَلْتَمِسُ هَذِهِ اللَّيْلَةَ، ثُمَّ اعْتَكَفْتُ الْعَشْرَ الْأَوْسَطَ، ثُمَّ أُتِيتُ، فَقِيلَ لِي: إِنَّهَا فِي الْعَشْرِ الْأَوَاخِرِ، فَمَنْ أَحَبَّ مِنْكُمْ أَنْ يَعْتَكِفَ فَلْيَعْتَكِفْ فَاعْتَكَفَ النَّاسُ مَعَهُ، قَالَ: «وَإِنِّي أُرِيتُهَا لَيْلَةَ وِتْرٍ، وَإِنِّي أَسْجُدُ صَبِيحَتَهَا فِي طِينٍ وَمَاءٍ» فَأَصْبَحَ مِنْ لَيْلَةِ إِحْدَى وَعِشْرِينَ، وَقَدْ قَامَ إِلَى الصُّبْحِ، فَمَطَرَتِ السَّمَاءُ، فَوَكَفَ الْمَسْجِدُ، فَأَبْصَرْتُ الطِّينَ وَالْمَاءَ، فَخَرَجَ حِينَ فَرَغَ مِنْ صَلَاةِ الصُّبْحِ، وَجَبِينُهُ وَرَوْثَةُ أَنْفِهِ فِيهِمَا الطِّينُ وَالْمَاءُ، وَإِذَا هِيَ لَيْلَةُ إِحْدَى وَعِشْرِينَ مِنَ الْعَشْرِ الْأَوَاخِرِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10336,
                "hadithNumber": "2772",
                "englishNarrator": "Abu Salama reported:",
                "hadithEnglish": "'We discussed amongst ourselves Lailat-ul-Qadr. I came to Abu Sa'id al-Khudri ( رضی اللہ تعالیٰ عنہ ) who was a friend of mine and said to him: Would you not go with us to the garden of date trees? He went out with a cloak over him. I said to him: Did you hear the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) making mention of Lailat-ul-Qadr? He said: Yes, (and added) we were observing i'tikaf with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) in the middle ten days of Ramadan, and came out on the morning of the twentieth and the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) addressed us and said: I was shown Lailat-ul-Qadr, but I forgot (the exact night) or I was caused to forget it, so seek it in the last ten odd (nights), and I was shown that I was prostrating in water and clay. So he who wanted to observe i'tikaf with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) should return (to the place of i'tikaf). He (Abu Sa'id al-Khudri) said: And we returned and did not find any patch of cloud in the sky. Then the cloud gathered and there was (so heavy) a downpour that the roof of the mosque which was made of the branches of date-palms began to drip. Then there was prayer and I saw the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) prostrating in water and clay till I saw the traces of clay on his forehead.",
                "hadithUrdu": "ہم نے آپس میں لیلۃالقدر کے بارے میں بات چیت کی ، پھر میں ابو خدری رضی اللہ تعالیٰ عنہ کے پاس آیا وہ میرے دوست تھے ، میں نے کہا : کیا آپ ہمارے ساتھ نخلستان میں نہیں چلیں گے؟وہ نکلے اور ان ( کے کندھوں ) پر دھاری دار چادر تھی ، میں نے ان سے پوچھا : ( کیا ) آپ نے رسول اللہ صلی اللہ علیہ وسلم کو لیلۃ القدر کا ذکر کرتے ہو ئے سنا ، تھا ؟ انھوں نے کہا : ہاںہم نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ رمضا ن کے درمیانے عشرے میں اعتکاف کیا ہم بیسویں ( رات ) کی صبح کو ( اعتکاف سے ) نکلے تو رسول اللہ صلی اللہ علیہ وسلم نے ہمیں خطبہ دیا اور فرمایا : \" مجھے لیلۃ القدر دکھا ئی گئی اور اب میں بھول گیا ہوں ۔ ۔ ۔ مجھے بھلا دی گئی ہے ۔ ۔ ۔ اس لیے تم اس کو آخریعشرے کی ہر طاق رات میں تلاش کرو اور میں نے دیکھا کہ میں ( اس رات ) پانی اور مٹی میں سجدہ کر رہا ہوں ۔ تو جس نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ اعتکاف کیا ہے وہ واپس ( اعتکاف میں ) چلا جا ئے ۔ کہا : ہم واپس ہو گئے اور ہمیں آسمان میں بادل کا کو ئی ٹکڑا نظر نہیں آرہا تھا کہا : ایک بدلی آئی ہم پر بارش ہو ئی یہاں تک کہ مسجد کی چھت بہ پڑی ۔ وہ کھجور کی شا خوں سے بنی ہو ئی تھی اور نماز کھڑی کی گئی تو میں رسول اللہ صلی اللہ علیہ وسلم کو دیکھا آپ پانی اور مٹی میں سجدہ کر رہے تھے کہا : یہاں تک کہ میں نے آپ کی پیشانی پر مٹی کا نشان بھی دیکھا ۔",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا، کہا ہم سے ابو عامر نے بیان کیا، انہوں نے بیان کیا ہشا م نے یحییٰ سے اور انھوں نے ابو سلمہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا أَبُو عَامِرٍ، حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، قَالَ: تَذَاكَرْنَا لَيْلَةَ الْقَدْرِ، فَأَتَيْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ رَضِيَ اللهُ عَنْهُ، وَكَانَ لِي صَدِيقًا، فَقُلْتُ: أَلَا تَخْرُجُ بِنَا إِلَى النَّخْلِ؟ فَخَرَجَ وَعَلَيْهِ خَمِيصَةٌ فَقُلْتُ لَهُ: سَمِعْتَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَذْكُرُ لَيْلَةَ الْقَدْرِ؟ فَقَالَ: نَعَمْ، اعْتَكَفْنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الْعَشْرَ الْوُسْطَى مِنْ رَمَضَانَ، فَخَرَجْنَا صَبِيحَةَ عِشْرِينَ، فَخَطَبَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «إِنِّي أُرِيتُ لَيْلَةَ الْقَدْرِ، وَإِنِّي نَسِيتُهَا - أَوْ أُنْسِيتُهَا -، فَالْتَمِسُوهَا فِي الْعَشْرِ الْأَوَاخِرِ مِنْ كُلِّ وِتْرٍ، وَإِنِّي أُرِيتُ أَنِّي أَسْجُدُ فِي مَاءٍ وَطِينٍ، فَمَنْ كَانَ اعْتَكَفَ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَلْيَرْجِعْ» قَالَ: فَرَجَعْنَا وَمَا نَرَى فِي السَّمَاءِ قَزَعَةً، قَالَ: وَجَاءَتْ سَحَابَةٌ فَمُطِرْنَا، حَتَّى سَالَ سَقْفُ الْمَسْجِدِ، وَكَانَ مِنْ جَرِيدِ النَّخْلِ، وَأُقِيمَتِ الصَّلَاةُ، فَرَأَيْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَسْجُدُ فِي الْمَاءِ وَالطِّينِ، قَالَ: حَتَّى رَأَيْتُ أَثَرَ الطِّينِ فِي جَبْهَتِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10337,
                "hadithNumber": "2773",
                "englishNarrator": "This hadith has been reported on the authority of Yahya bin Abu Kathir with the same chain of transmitters (with a slight variation of these words):",
                "hadithEnglish": "I saw the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) after he had completed (the prayer) and there was a trace of clay on his forehead and tip (of the nose).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نماز سے ( فارغ ہو کر ) پلٹے تو میں نے آپ کو اس ھال میں دیکھا کہ آپ کی پیشانی اور ناک کے کنا رے پر مٹی کا نشان تھا ۔",
                "urduNarrator": "ہم سے عبد بن حمید نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، انہوں نے بیان کیا معمر اور اوزاعی دونوں نے یحییٰ بن ابی کثیر سے اسی سند کے ساتھ اس ( سابقہ حدیث ) کے ہم معنی روایت کی ۔ اور ان دونوں کی حدیث میں ہے",
                "hadithArabic": "وحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، ح وحَدَّثَنَا عَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا أَبُو الْمُغِيرَةِ، حَدَّثَنَا الْأَوْزَاعِيُّ كِلَاهُمَا عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، بِهَذَا الْإِسْنَادِ نَحْوَهُ وَفِي حَدِيثِهِمَا رَأَيْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حِينَ انْصَرَفَ وَعَلَى جَبْهَتِهِ وَأَرْنَبَتِهِ أَثَرُ الطِّينِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10338,
                "hadithNumber": "2774",
                "englishNarrator": "Abu Sa'id al-Khudri (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) observed i'tikaf in the middle ten days of Ramadan to seek Lailat-ul-Qadr before it was made manifest to him. When (these nights) were over, he commanded to strike the tent. Then it was made manifest to him that (Lailat-ul-Qadr) was in the last ten nights (of Ramadan), and commanded to pitch the tent (again). He then came to the people and said: O people, Lailat-ul-Qadr was made manifest to me and I came out to inform you about it that two persons came contending with each other and there was a devil along with them and I forgot it. So seek it in the last ten nights of Ramadan. Seek it on the ninth, on the seventh and on the fifth. I (one of the narrators) said: Abu Sa'id, you know more than us about numbers. He said: Yes, indeed we have better right than you. I said: What is this ninth, seventh, and fifth? He said: When twenty-one (nights are over) and the twenty-second begins, it is the ninth, and when twenty-three (nights) are over, that which follows (the last night) is the seventh, and when twenty-five nights are over, what follows it is fifth. Ibn Khallad said: Instead of the word Yahliqan (contending), he said Yakhtasiman, (they are disputing).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے رمضا ن کے درمیا نے عشرے کا اعتکاف کیا اس سے پہلے کہ آپ کے سامنے اس اس کو کھول دیا جا ئے ۔ آپ لیلۃالقدر کو تلاش کر ہے تھے ۔ جب یہ ( دس راتیں ) ختم ہو گئیں تو آپ نے حکم دیا اور ان خیموں کو اکھا ڑدیا گیا پھر ( وہ رات ) آپ پر واضح کر دی گئی کہ وہ آخری عشرے میں ہے ۔ اس پر آپ نے ( خیمے لگا نے کا ) حکم دیا تو ان کو دوبارہ لگا دیا گیا ۔ اس کے بعد آپ صلی اللہ علیہ وسلم نکل کر لوگوں کے سامنے آئے اور فرمایا : \"\" اے لوگو! مجھ پر لیلۃالقدر واضھ کر دی گئی اور میں تم کو اس کے بارے میں بتا نے کے لیے نکلا تو دو آدمی ( ایک دوسرے پر ) اپنے حق کا دعویٰ کرتے ہو ئے آئے ان کے ساتھ شیطان تھا ۔ اس پر وہ مجھے بھلا دی گئی ۔ تم اسے رمضا ن کے آخری عشرے میں تلا ش کرو ۔ تم نویں ساتویں اور پانچویں ( رات ) میں تلاش کرو ۔ ( ابو نضرہ نے ) کہا : میں نے کہا : ابو سعید !ہماری نسبت آپ اس گنتی کو زیادہ جانتے ہیں انھوں نے کہا : ہاں ہم اسے جاننے کے تم تم سے زیادہ حقدار ہیں ۔ کہا میں نے پوچھا : نویں ، ساتویں ، اور پانچویں سے کیا مراد ہے ؟انھوں نے جواب دیا : جب اکیسویں رات گزرتی ہے تو وہی رات جس کے بعد بائیسویں آتی ہے وہی نویں ہے اور جب تیئسویں رات گزرتی ہے تو وہی جس کے بعد ( آخر سے گنتے ہو ئے ساتویں رات آتی ہے ) ساتویں ہے اس کے بعد جب پچسویں رات گزرتی ہے تو وہی جس کے بعد پانچویں رات آتی ہے ) پانچویں ہے ۔",
                "urduNarrator": "محمد بن مثنیٰ اورابو بکر بن خلاد نے کہا : ہمیں عبد الارلیٰ نے حدیث بیا ن کی ، انھوں نے کہا : ہمیں سعید نے ابو نضر ہ سے اور انھوں نےحضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ سے روایت کی کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَأَبُو بَكْرِ بْنُ خَلَّادٍ، قَالَا: حَدَّثَنَا عَبْدُ الْأَعْلَى، حَدَّثَنَا سَعِيدٌ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللهُ عَنْهُ، قَالَ: اعْتَكَفَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الْعَشْرَ الْأَوْسَطَ مِنْ رَمَضَانَ، يَلْتَمِسُ لَيْلَةَ الْقَدْرِ قَبْلَ أَنْ تُبَانَ لَهُ، فَلَمَّا انْقَضَيْنَ أَمَرَ بِالْبِنَاءِ فَقُوِّضَ، ثُمَّ أُبِينَتْ لَهُ أَنَّهَا فِي الْعَشْرِ الْأَوَاخِرِ، فَأَمَرَ بِالْبِنَاءِ فَأُعِيدَ، ثُمَّ خَرَجَ عَلَى النَّاسِ، فَقَالَ: «يَا أَيُّهَا النَّاسُ، إِنَّهَا كَانَتْ أُبِينَتْ لِي لَيْلَةُ الْقَدْرِ، وَإِنِّي خَرَجْتُ لِأُخْبِرَكُمْ بِهَا، فَجَاءَ رَجُلَانِ يَحْتَقَّانِ مَعَهُمَا الشَّيْطَانُ، فَنُسِّيتُهَا، فَالْتَمِسُوهَا فِي الْعَشْرِ الْأَوَاخِرِ مِنْ رَمَضَانَ، الْتَمِسُوهَا فِي التَّاسِعَةِ وَالسَّابِعَةِ وَالْخَامِسَةِ» قَالَ قُلْتُ: يَا أَبَا سَعِيدٍ، إِنَّكُمْ أَعْلَمُ بِالْعَدَدِ مِنَّا، قَالَ: «أَجَلْ، نَحْنُ أَحَقُّ بِذَلِكَ مِنْكُمْ»، قَالَ قُلْتُ: مَا التَّاسِعَةُ وَالسَّابِعَةُ وَالْخَامِسَةُ؟ قَالَ: «إِذَا مَضَتْ وَاحِدَةٌ وَعِشْرُونَ، فَالَّتِي تَلِيهَا ثِنْتَيْنِ وَعِشْرِينَ وَهِيَ التَّاسِعَةُ، فَإِذَا مَضَتْ ثَلَاثٌ وَعِشْرُونَ، فَالَّتِي تَلِيهَا السَّابِعَةُ، فَإِذَا مَضَى خَمْسٌ وَعِشْرُونَ فَالَّتِي تَلِيهَا الْخَامِسَةُ» - وقَالَ ابْنُ خَلَّادٍ مَكَانَ يَحْتَقَّانِ: يَخْتَصِمَانِ .",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 10026,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=401",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=399",
                "label": "399",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=400",
                "label": "400",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=401",
                "label": "401",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=402",
                "label": "402",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=403",
                "label": "403",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=404",
                "label": "404",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=405",
                "label": "405",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=403",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=403",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=401",
        "to": 10050,
        "total": 40465
    }
}