{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 436,
        "data": [
            {
                "id": 11164,
                "hadithNumber": "3600",
                "englishNarrator": "A'isha (رضی اللہ عنہا) reported:",
                "hadithEnglish": "Sahla bint Suhail رضی اللہ عنہا came to Allah's Apostle (may peace be eupon him) and said: Messenger of Allah, I see on the face of Abu Hudhaifa رضی اللہ عنہ (signs of disgust) on entering of Salim (who is an ally) into (our house), whereupon Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Suckle him. She said: How can I suckle him as he is a grown-up man? Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) smiled and said: I already know that he is a young man 'Amr has made this addition in his narration that he participated in the Battle of Badr and in the narration of Ibn 'Umar (the words are): Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) laughed.",
                "hadithUrdu": "سہلہ بنت سہیل رضی اللہ عنہا نبی صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں اور عرض کی : اے اللہ کے رسول! میں سالم رضی اللہ عنہ کے گھر آنے کی بنا پر ( اپنے شوہر ) ابوحذیفہ رضی اللہ عنہ کے چہرے میں ( تبدیلی ) دیکھتی ہوں ۔ ۔ حالانکہ وہ ان کا حلیف بھی ہے ۔ ۔ تو نبی صلی اللہ علیہ وسلم نے فرمایا : \"\" اسے دودھ پلا دو ۔ \"\" انہوں نے عرض کی : میں اسے کیسے دودھ پلاؤں؟ جبکہ وہ بڑا ( آدمی ) ہے ۔ رسول اللہ صلی اللہ علیہ وسلم مسکرائے اور فرمایا : \"\" میں اچھی طرح جانتا ہوں کہ وہ بڑا آدمی ہے ۔ \"\" عمرو نے اپنی حدیث میں یہ اضافہ کیا : اور وہ ( سالم ) بدر میں شریک ہوئے تھے ۔ اور ابن ابی عمر کی روایت میں ہے : \"\" رسول اللہ صلی اللہ علیہ وسلم ہنس پڑے ۔ \"\" ( آپ کا مقصود یہ تھا کہ کسی برتن میں دودھ نکال کر سالم رضی اللہ عنہ کو پلوا دیں).",
                "urduNarrator": "عمرو ناقد اور ابن ابی عمر نے کہا : ہمیں سفیان بن عیینہ نے عبدالرحمٰن بن قاسم سے حدیث بیان کی ، انہوں نے اپنے والد سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، وَابْنُ أَبِي عُمَرَ، قَالَا: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ: جَاءَتْ سَهْلَةُ بِنْتُ سُهَيْلٍ إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَتْ: يَا رَسُولَ اللهِ، إِنِّي أَرَى فِي وَجْهِ أَبِي حُذَيْفَةَ مِنْ دُخُولِ سَالِمٍ وَهُوَ حَلِيفُهُ، فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَرْضِعِيهِ»، قَالَتْ: وَكَيْفَ أُرْضِعُهُ؟ وَهُوَ رَجُلٌ كَبِيرٌ، فَتَبَسَّمَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَقَالَ: «قَدْ عَلِمْتُ أَنَّهُ رَجُلٌ كَبِيرٌ»، زَادَ عَمْرٌو فِي حَدِيثِهِ: وَكَانَ قَدْ شَهِدَ بَدْرًا، وَفِي رِوَايَةِ ابْنِ أَبِي عُمَرَ: فَضَحِكَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": "رَضَاعَةِ الْكَبِيرِ ‏",
                "headingUrdu": "ایک بالغ کو دودھ پلانا۔",
                "headingEnglish": "Breastfeeding an adult",
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11165,
                "hadithNumber": "3601",
                "englishNarrator": "A'isha (رضی اللہ عنہا) reported:",
                "hadithEnglish": "Salim, the freed slave of Abu Hadhaifa رضی اللہ عنہ, lived with him and his family in their house. She (i. e. the daughter of Suhail رضی اللہ عنہا came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and said: Salim has attained (purbety) as men attain, and he understands what they understand, and he enters our house freely, I, however, perceive that something (rankles) in the heart of Abu Hudhaifa رضی اللہ عنہ, whereupon Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said to her: Suckle him and you would become unlawful for him, and (the rankling) which Abu Hudhaifa رضی اللہ عنہ feels in his heart will disappear. She returned and said: So I suckled him, and what (was there) in the heart of Abu Hudhaifa رضی اللہ عنہ disappeared.",
                "hadithUrdu": "ابوحذیفہ رضی اللہ عنہ کے مولیٰ سالم رضی اللہ عنہ ، ابوحذیفہ رضی اللہ عنہ اور ان کی اہلیہ کے ساتھے ان کے گھر ہی میں ( قیام پذیر ) تھے ۔ تو ( ان کی اہلیہ ) یعنی ( سہلہ ) بنت سہیل رضی اللہ عنہا نبی صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں اور عرض کی : سالم مردوں کی ( حد ) بلوغت کو پہنچ چکا ہے اور وہ ( عورتوں کے بارے میں ) وہ سب سمجھنے لگا ہے جو وہ سمجھتے ہیں اور وہ ہمارے ہاں ( گھر میں ) آتا ہے اور میں خیال کرتی ہوں کہ ابوحذیفہ رضی اللہ عنہ کے دل میں اس سے کچھ ( ناگواری ) ہے ۔ تو نبی صلی اللہ علیہ وسلم نے ان سے فرمایا : \" تم اسے دودھ پلا دو ، اس پر حرام ہو جاؤ گی اور وہ ( ناگواری ) دور ہو جائے گی جو ابوحذیفہ رضی اللہ عنہ کے دل میں ہے ۔ \" چنانچہ وہ دوبارہ آپ کے پاس آئی اور کہا : میں نے اسے دودھ پلوا دیا ہے تو ( اب ) وہ ناگواری دور ہو گئی جو ابوحذیفہ کے دل میں تھی.",
                "urduNarrator": ") ہم سے اسحاق بن ابراہیم الحنظلی اور محمد بن ابی عمر نے بیان کیا، ثقفی نے کہا: ہم سے ابن ابی عمر، عبد الوہاب نے بیان کیا۔ الثقفی، ایوب نے ابن ابی مُلیکہ سے ، انہوں نے قاسم سے اور انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی کہ",
                "hadithArabic": ") وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، وَمُحَمَّدُ بْنُ أَبِي عُمَرَ، جَمِيعًا عَنِ الثَّقَفِيِّ، قَالَ: ابْنُ أَبِي عُمَرَ، حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، عَنْ أَيُّوبَ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنِ الْقَاسِمِ، عَنْ عَائِشَةَ، أَنَّ سَالِمًا، مَوْلَى أَبِي حُذَيْفَةَ كَانَ مَعَ أَبِي حُذَيْفَةَ وَأَهْلِهِ فِي بَيْتِهِمْ، فَأَتَتْ - تَعْنِي ابْنَةَ سُهَيْلٍ - النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ: إِنَّ سَالِمًا قَدْ بَلَغَ مَا يَبْلُغُ الرِّجَالُ. وَعَقَلَ مَا عَقَلُوا. وَإِنَّهُ يَدْخُلُ عَلَيْنَا. وَإِنِّي أَظُنُّ أَنَّ فِي نَفْسِ أَبِي حُذَيْفَةَ مِنْ ذَلِكَ شَيْئًا. فَقَالَ لَهَا النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «أَرْضِعِيهِ تَحْرُمِي عَلَيْهِ، وَيَذْهَبِ الَّذِي فِي نَفْسِ أَبِي حُذَيْفَةَ» فَرَجَعَتْ فَقَالَتْ: إِنِّي قَدْ أَرْضَعْتُهُ. فَذَهَبَ الَّذِي فِي نَفْسِ أَبِي حُذَيْفَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11166,
                "hadithNumber": "3602",
                "englishNarrator": "Ibn Abu Mulaika reported Al-Qasim bin Muhammad bin Abu Bakr had narrated to him that 'A'isha (رضی اللہ عنہا) reported:",
                "hadithEnglish": "Sahla bint Suhail bin 'Amr رضی اللہ عنہا came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: Messenger of Allah, Salim (the freed slave of Abu Hudhaifa رضی اللہ عنہ) is living with us in our house, and he has attained (puberty) as men attain it and has acquired knowledge (of the sex problems) as men acquire, whereupon he said: Suckle him so that he may become unlawful (in regard to marriage) for you He (Ibn Abu Mulaika) said: I refrained from (narrating this hadith) for a year or so on account of fear. I then met al-Qasim and said to him: You narrated to me a hadith which I did not narrate (to anyone) afterwards. He said: What is that? I informed him, whereupon he said: Narrate it on my authority that 'A'isha (رضی اللہ عنہا) had narrated that to me.",
                "hadithUrdu": "سہلہ بنت سہیل بن عمرو رضی اللہ عنہا نبی صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں اور کہا : اللہ کے رسول! سالم ۔ ۔ ( انہوں نے ) سالم مولیٰ ابی حذیفہ رضی اللہ عنہ کے بارے میں ( کہا : ) ۔ ۔ ہمارے ساتھ ہمارے گھر میں رہتا ہے ۔ وہ مردوں کی حد بلوغٹ کو پہنچ چکا ہے اور وہ ( سب کچھ ) جاننے لگا ہے جو مرد جانتے ہیں ۔ آپ نے فرمایا : \" تم اسے دودھ پلا دو تو تم اس پر حرام ہو جاؤ گی ۔ \" ( گویا یہ حکم صرف حضرت سہلہ کے لیے تھا ۔ ) ( ابن ابی ملیکہ نے ) کہا : میں سال بھر یا اس کے قریب ٹھہرا ، میں نے یہ حدیث بیان نہ کی ، میں اس ( کو بیان کرنے ) سے ڈرتا رہا ، پھر میں قاسم سے ملا تو میں نے انہیں کہا : آپ نے مجھے ایک حدیث سنائی تھی ، جو میں نے اس کے بعد کبھی بیان نہیں کی ، انہوں نے پوچھا : وہ کون سی حدیث ہے؟ میں نے انہیں بتائی ، انہوں نے کہا : اسے میرے حوالے سے بیان کرو کہ حضرت عائشہ رضی اللہ عنہا نے مجھے اس کی خبر دی تھی.",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم اور محمد بن رافع نے بیان کیا - اور یہ قول ابن رافع کا ہے - انہوں نے کہا: ہم سے عبدالرزاق نے بیان کیا، ابن جریج نے ہمیں خبر دی ، کہا : ہمیں ابن ابی ملیکہ نے بتایا ، انہیں قاسم بن محمد بن ابی بکر نے خبر دی ، انہیں حضرت عائشہ رضی اللہ عنہا نے بتایا کہ",
                "hadithArabic": "وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ رَافِعٍ، - وَاللَّفْظُ لِابْنِ رَافِعٍ -، قَالَ: حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنَا ابْنُ أَبِي مُلَيْكَةَ، أَنَّ الْقَاسِمَ بْنَ مُحَمَّدِ بْنِ أَبِي بَكْرٍ، أَخْبَرَهُ أَنَّ عَائِشَةَ أَخْبَرَتْهُ أَنَّ سَهْلَةَ بِنْتَ سُهَيْلِ بْنِ عَمْرٍو جَاءَتِ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ: يَا رَسُولَ اللهِ إِنَّ سَالِمًا - لِسَالِمٍ مَوْلَى أَبِي حُذَيْفَةَ - مَعَنَا فِي بَيْتِنَا. وَقَدْ بَلَغَ مَا يَبْلُغُ الرِّجَالُ، وَعَلِمَ مَا يَعْلَمُ الرِّجَالُ. قَالَ: «أَرْضِعِيهِ تَحْرُمِي عَلَيْهِ» قَالَ: فَمَكَثْتُ سَنَةً أَوْ قَرِيبًا مِنْهَا لَا أُحَدِّثُ بِهِ وَهِبْتُهُ ثُمَّ لَقِيتُ الْقَاسِمَ فَقُلْتُ لَهُ: لَقَدْ حَدَّثْتَنِي حَدِيثًا مَا حَدَّثْتُهُ بَعْدُ. قَالَ: فَمَا هُوَ؟ فَأَخْبَرْتُهُ قَالَ فَحَدِّثْهُ عَنِّي، أَنَّ عَائِشَةَ أَخْبَرَتْنِيهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11167,
                "hadithNumber": "3603",
                "englishNarrator": "Umm Salama رضی اللہ عنہا said to 'A'isha ( رضی اللہ عنہا):",
                "hadithEnglish": "A young boy who is at the threshold of puberty comes to you. I, however, do not like that he should come to me, whereupon 'A'isha ( رضی اللہ عنہا) said: Don't you see in Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) a model for you? She also said: The wife of Abu Hudhaifa said: Messenger of Allah, Salim comes to me and now he is a (grown-up) person, and there is something that (rankles) in the mind of Abu Hudhaifa رضی اللہ عنہ about him, whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Suckle him (so that he may become your foster-child), and thus he may be able to come to you (freely).",
                "hadithUrdu": "آپ کے پاس ( گھر میں ) ایک قریب البلوغت لڑکا آتا ہے جسے میں پسند نہیں کرتی کہ وہ میرے پاس آئے ۔ حضرت عائشہ رضی اللہ عنہا نے جواب دیا : کیا تمہارے لیے رسول اللہ صلی اللہ علیہ وسلم ( کی زندگی ) میں نمونہ نہیں ہے؟ انہوں نے ( آگے ) کہا : ابوحذیفہ رضی اللہ عنہ کی بیوی نے عرض کی تھی : اے اللہ کے رسول! سالم میرے سامنے آتا ہے اور ( اب ) وہ مرد ہے ، اور اس وجہ سے ابوحذیفہ رضی اللہ عنہ کے دل میں کچھ ناگواری ہے ، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اسے دودھ پلا دو تاکہ وہ تمہارے پاس آ سکے.",
                "urduNarrator": "ہم سے محمد بن المثنیٰ نے بیان کیا، ہم سے محمد بن جعفر نے بیان کیا, شعبہ نے حُمَید بن نافع سے حدیث بیان کی ، انہوں نے زینب بنت ام سلمہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا : حضرت ام سلمہ رضی اللہ عنہا نے حضرت عائشہ رضی اللہ عنہا سے کہا",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ حُمَيْدِ بْنِ نَافِعٍ، عَنْ زَيْنَبَ بِنْتِ أُمِّ سَلَمَةَ، قَالَتْ: قَالَتْ أُمُّ سَلَمَةَ، لِعَائِشَةَ، إِنَّهُ يَدْخُلُ عَلَيْكِ الْغُلَامُ الْأَيْفَعُ، الَّذِي مَا أُحِبُّ أَنْ يَدْخُلَ عَلَيَّ، قَالَ: فَقَالَتْ عَائِشَةُ: أَمَا لَكِ فِي رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أُسْوَةٌ؟ قَالَتْ: إِنَّ امْرَأَةَ أَبِي حُذَيْفَةَ قَالَتْ: يَا رَسُولَ اللهِ، إِنَّ سَالِمًا يَدْخُلُ عَلَيَّ وَهُوَ رَجُلٌ، وَفِي نَفْسِ أَبِي حُذَيْفَةَ مِنْهُ شَيْءٌ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَرْضِعِيهِ حَتَّى يَدْخُلَ عَلَيْكِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11168,
                "hadithNumber": "3604",
                "englishNarrator": "Zainab daughter of Abu Salama رضی اللہ عنہا reported:",
                "hadithEnglish": "I heard Umm Salama, the wife of Allah's Apostle , saying to 'A'isha رضی اللہ عنہا: By Allah, I do not like to be seen by a young boy who has passed the period of fosterage, whereupon she ('A'isha) said: Why is it so? Sahla daughter of Suhail came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: Allah's Messenger, I swear by Allah that I see in the face of Abu Hudhaifa رضی اللہ عنہ(the signs of disgust) on account of entering of Salim (in the house), whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Suckle him. She (Sahla bint Suhail) said: He has a heard. But he (again) said: Suckle him, and it would remove what is there (expression of disgust) on the face of Abu Hudhaifa رضی اللہ عنہ. She said: (I did that) and, by Allah, I did not see (any sign of disgust) on the face of Abu Hudhaifa رضی اللہ عنہ.",
                "hadithUrdu": "میں نے نبی صلی اللہ علیہ وسلم کی زوجہ محترمہ ام سلمہ رضی اللہ عنہا سے سنا وہ حضرت عائشہ رضی اللہ عنہا سے کہہ رہی تھیں : اللہ کی قسم! میرے دل کو یہ بات اچھی نہیں لگتی کہ مجھے کوئی ایسا لڑکا دیکھے جو رضاعت سے مستغنی ہو چکا ہے ۔ انہوں نے پوچھا : کیوں؟ سہلہ بنت سہیل رضی اللہ عنہا رسول اللہ صلی اللہ علیہ وسلم کے پاس آئی تھیں ، انہوں نے عرض کی تھی : اے اللہ کے رسول! اللہ کی قسم! میں سالم کے ( گھر میں ) داخلے کی وجہ سے ابوحذیفہ رضی اللہ عنہ کے چہرے پر ناگواری سی محسوس کرتی ہوں ، کہا : تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" اسے دودھ پلا دو ۔ \"\" اس نے کہا : وہ تو داڑھی والا ہے ۔ آپ نے فرمایا : \"\" اسے دودھ پلا دو ، اس سے وہ ناگواری ختم ہو جائے گی جو ابوحذیفہ کے چہرے پر ہے ۔ \"\" ( سہلہ رضی اللہ عنہا نے ) کہا : اللہ کی قسم! ( اس کے بعد ) میں نے ابوحذیفہ رضی اللہ عنہا کے چہرے پر ( کبھی ) ناگواری محسوس نہیں کی.",
                "urduNarrator": "مجھ سے ابو الطاہر اور ہارون بن سعید العیلی نے بیان کیا اور یہ الفاظ ہارون کے لیے ہیں، انہوں نے کہا: ہم سے ابن وہب نے بیان کیا، مخرمہ بن بُکَیر سے روایت ہے ، انہوں نے کہا : میں نے حمید بن نافع سے سنا وہ کہہ رہے تھے ، میں نے زینب بنت ابی سلمہ رضی اللہ عنہا سے سنا وہ کہہ رہی تھیں",
                "hadithArabic": "وحَدَّثَنِي أَبُو الطَّاهِرِ، وَهَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ، - وَاللَّفْظُ لِهَارُونَ -، قَالَا: حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي مَخْرَمَةُ بْنُ بُكَيْرٍ، عَنْ أَبِيهِ، قَالَ: سَمِعْتُ حُمَيْدَ بْنَ نَافِعٍ، يَقُولُ: سَمِعْتُ زَيْنَبَ بِنْتَ أَبِي سَلَمَةَ، تَقُولُ: سَمِعْتُ أُمَّ سَلَمَةَ، زَوْجَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، تَقُولُ لِعَائِشَةَ: وَاللهِ مَا تَطِيبُ نَفْسِي أَنْ يَرَانِي الْغُلَامُ قَدِ اسْتَغْنَى عَنِ الرَّضَاعَةِ، فَقَالَتْ: لِمَ، قَدْ جَاءَتْ سَهْلَةُ بِنْتُ سُهَيْلٍ إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَتْ: يَا رَسُولَ اللهِ، وَاللهِ إِنِّي لَأَرَى فِي وَجْهِ أَبِي حُذَيْفَةَ مِنْ دُخُولِ سَالِمٍ، قَالَتْ: فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَرْضِعِيهِ»، فَقَالَتْ: إِنَّهُ ذُو لِحْيَةٍ فَقَالَ: «أَرْضِعِيهِ يَذْهَبْ مَا فِي وَجْهِ أَبِي حُذَيْفَةَ»، فَقَالَتْ: وَاللهِ مَا عَرَفْتُهُ فِي وَجْهِ أَبِي حُذَيْفَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11169,
                "hadithNumber": "3605",
                "englishNarrator": "Zainab bint Abi Salama narrated that her mother Umm Salama رضی اللہ عنہا :",
                "hadithEnglish": "The wife of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), used to say that all wives of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) disclaimed the idea that one with this type of fosterage (having been suckled after the proper period) should come to them. and said to 'A'isha  رضی اللہ عنہا : By Allah, we do not find this but a sort of concession given by Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) only for Salim, and no one was going to be allowed to enter (our houses) with this type of fosterage and we do not subscribe to this view.",
                "hadithUrdu": "ان کی والدہ نبی صلی اللہ علیہ وسلم کی زوجہ محترمہ حضرت ام سلمہ رضی اللہ عنہاکہا کرتی تھیں : نبی صلی اللہ علیہ وسلم کی تمام ازواج نے اس بات سے انکار کیا کہ اس ( بڑی عمر کی ) رضاعت کی وجہ سے کسی کو اپنے گھر میں داخل ہونے دیں ، اور انہوں نے عائشہ رضی اللہ عنہا سے کہا : اللہ کی قسم! ہم اسے محض رخصت خیال کرتی ہیں جو رسول اللہ صلی اللہ علیہ وسلم نے خاص طور پر سالم رضی اللہ عنہ کو دی تھی ، لہذا اس ( طرح کی ) رضاعت کی وجہ سے نہ کوئی ہمارے پاس آنے والا بن سکے گا اور نہ ہمیں دیکھنے والا.",
                "urduNarrator": "مجھ سے عبدالملک بن شعیب بن لیث نے بیان کیا، مجھ سے میرے والد نے بیان کیا، وہ میرے دادا سے، عقیل بن خالد نے مجھ سے ابن شہاب کی روایت سے بیان کیا کہ انہوں نے کہا: بتاؤ ابوعبیدہ بن عبداللہ بن زمعہ نے مجھے خبر دی کہ ان کی والدہ زینب بنت ابی سلمہ رضی اللہ عنہا نے انہیں بتایا کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي عُقَيْلُ بْنُ خَالِدٍ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ قَالَ: أَخْبَرَنِي أَبُو عُبَيْدَةَ بْنُ عَبْدِ اللهِ بْنِ زَمْعَةَ، أَنَّ أُمَّهُ زَيْنَبَ بِنْتَ أَبِي سَلَمَةَ، أَخْبَرَتْهُ أَنَّ أُمَّهَا أُمَّ سَلَمَةَ، زَوْجَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، كَانَتْ تَقُولُ: أَبَى سَائِرُ أَزْوَاجِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ يُدْخِلْنَ عَلَيْهِنَّ أَحَدًا بِتِلْكَ الرَّضَاعَةِ، وَقُلْنَ لِعَائِشَةَ: وَاللهِ مَا نَرَى هَذَا إِلَّا رُخْصَةً أَرْخَصَهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِسَالِمٍ خَاصَّةً، فَمَا هُوَ بِدَاخِلٍ عَلَيْنَا أَحَدٌ بِهَذِهِ الرَّضَاعَةِ، وَلَا رَائِينَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11170,
                "hadithNumber": "3606",
                "englishNarrator": "A'isha (رضی اللہ عنہا) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) visited me when a man was sitting near me, and he seemed to disapprove of that. And I saw signs of anger on his face and I said: Messenger of Allah, he is my brother by forsterage, whereupon he said: Consider who your brothers are because of fosterage since fosterage is through hunger (i. e. in infancy).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم میرے ہاں تشریف لائے جبکہ میرے پاس ایک آدمی بیٹھا ہوا تھا ۔ یہبات آپ پر گراں گزری ، اور میں نے آپ کے چہرے پر غصہ دیکھا ، کہا : تو میں نے عرض کی : اللہ کے رسول! یہ رضاعت ( کے رشتے سے ) میرا بھائی ہے ، کہا : تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" ( تم خواتین ) اپنے رضاعی بھائیوں ( کے معاملے ) کو دیکھ لیا کرو ( اچھی طرح غور کر لیا کرو ) کیونکہ رضاعت بھوک ہی سے ( معتبر ) ہے.",
                "urduNarrator": "ہم سے ہناد بن السری نے بیان کیا، انہوں نے کہا ابواحوص نے ہمیں اشعث سے حدیث بیان کی ، انہوں نے اپنے والد سے ، اور انہوں نے مسروق سے روایت کی ، انہوں نے کہا : حضرت عائشہ رضی اللہ عنہا نے کہا",
                "hadithArabic": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، حَدَّثَنَا أَبُو الْأَحْوَصِ، عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ، عَنْ أَبِيهِ، عَنْ مَسْرُوقٍ، قَالَ: قَالَتْ عَائِشَةُ: دَخَلَ عَلَيَّ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعِنْدِي رَجُلٌ قَاعِدٌ، فَاشْتَدَّ ذَلِكَ عَلَيْهِ وَرَأَيْتُ الْغَضَبَ فِي وَجْهِهِ، قَالَتْ: فَقُلْتُ: يَا رَسُولَ اللهِ، إِنَّهُ أَخِي مِنَ الرَّضَاعَةِ، قَالَتْ: فَقَالَ: «انْظُرْنَ إِخْوَتَكُنَّ مِنَ الرَّضَاعَةِ، فَإِنَّمَا الرَّضَاعَةُ مِنَ الْمَجَاعَةِ.",
                "headingArabic": "إِنَّمَا الرَّضَاعَةُ مِنَ الْمَجَاعَةِ",
                "headingUrdu": "دودھ پلانا بھوک کی وجہ سے ہے (یعنی بچپن میں)",
                "headingEnglish": "Breastfeeding is because of Hunger (meaning, during infancy)",
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11171,
                "hadithNumber": "3607",
                "englishNarrator": null,
                "hadithEnglish": "This hadith is narrated on the authority of Abdul-Ahwas with another chain of transmitters and a slight variation of words.",
                "hadithUrdu": "ہم سے محمد بن المثنیٰ اور ابن بشار نے بیان کیا، کہا: ہم سے محمد بن جعفر نے بیان کیا، اور ہم سے عبید اللہ بن معاذ نے بیان کیا، ہم سے میرے والد نے بیان کیا، کہا: ان سب کو۔ ہم سے شعبہ نے بیان کیا، کہا ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے وکیع نے بیان کیا، کہا ہم سے زہیر بن حرب نے بیان کیا، کہا ہم سے عبد نے بیان کیا۔ہم سے رحمن بن مہدی نے سفیان کی سند سے بیان کیا، ہم سے عبد بن حمید نے بیان کیا، ہم سے حسین الجعفی نے بیان کیا، زیدہ کی سند سے، وہ سب اشعث کی سند سے۔ ابن ابی الشاعۃ، ابی الاحواس کی سند کے ساتھ، جیسا کہ ان کی حدیث کا مفہوم ہے، سوائے اس کے کہ انہوں نے قحط کے بارے میں کہا۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ح وحَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، قَالَا: جَمِيعًا حَدَّثَنَا شُعْبَةُ، ح وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، ح وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، جَمِيعًا عَنْ سُفْيَانَ، ح وحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، حَدَّثَنَا حُسَيْنٌ الْجُعْفِيُّ، عَنْ زَائِدَةَ، كُلُّهُمْ عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ، بِإِسْنَادِ أَبِي الْأَحْوَصِ كَمَعْنَى حَدِيثِهِ، غَيْرَ أَنَّهُمْ قَالُوا مِنَ الْمَجَاعَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11172,
                "hadithNumber": "3608",
                "englishNarrator": "Abu Sa'id al-Khudri (رضی اللہ عنہ) reported:",
                "hadithEnglish": "At the Battle of Hanain Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sent an army to Autas and encountered the enemy and fought with them. Having overcome them and taken them captives, the Companions of Allah's Messenger (ﷺ) seemed to refrain from having intercourse with captive women because of their husbands being polytheists. Then Allah, Most High, sent down regarding that: And women already married, except those whom your right hands possess (iv. 24) (i.e. they were lawful for them when their 'Idda period came to an end).",
                "hadithUrdu": "حنین کے دن ( جنگ میں فتح حاصل کرنے کے بعد ) رسول اللہ صلی اللہ علیہ وسلم نے اوطاس کی جانب ایک لشکر بھیجا ، ان کا دشمن سے سامنا ہوا ، انہوں نے ان ( دشمنوں ) سے لڑائی کی ، پھر ان پر غالب آ گئے اور ان میں سے کنیزیں حاصل کر لیں ، تو رسول اللہ صلی اللہ علیہ وسلم کے اصحاب میں سے بعض لوگوں نے ان کے مشرک خاوندوں ( کی موجودگی ) کی بنا پر ان سے مجامعت کرنے میں حرج محسوس کیا ، اس پر اللہ عزوجل نے اس کے بارے میں ( یہ آیت ) نازل فرمائی : \" اور شادی شدہ عورتیں ( بھی حرام ہیں ) سوائے ان ( لونڈیوں ) کے جن کے مالک تمہارے دائیں ہاتھ ہوں ۔ \" یعنی جب ان کی عدت پوری ہو جائے تو ( تمہاری لونڈیاں بن جانے کی بنا پر ) وہ تمہارے لیے حلال ہیں.",
                "urduNarrator": "ہم سے عبید اللہ بن عمر بن میسرہ القواری نے بیان کیا, یزید بن زُرَیع نے ہمیں حدیث بیان کی ، کہا : ہمیں سعید بن ابوعروبہ نے قتادہ سے حدیث بیان کی ، انہوں نے ابوخلیل صالح سے ، انہوں نے ابوعلقمہ ہاشمی سے اور انہوں نے ابوسعید خدری رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللهِ بْنُ عُمَرَ بْنِ مَيْسَرَةَ الْقَوَارِيرِيُّ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنْ صَالِحٍ أَبِي الْخَلِيلِ، عَنْ أَبِي عَلْقَمَةَ الْهَاشِمِيِّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَوْمَ حُنَيْنٍ بَعَثَ جَيْشًا إِلَى أَوْطَاسَ، فَلَقُوا عَدُوًّا، فَقَاتَلُوهُمْ فَظَهَرُوا عَلَيْهِمْ، وَأَصَابُوا لَهُمْ سَبَايَا، فَكَأَنَّ نَاسًا مِنْ أَصْحَابِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ تَحَرَّجُوا مِنْ غِشْيَانِهِنَّ مِنْ أَجْلِ أَزْوَاجِهِنَّ مِنَ الْمُشْرِكِينَ، فَأَنْزَلَ اللهُ عَزَّ وَجَلَّ فِي ذَلِكَ: {وَالْمُحْصَنَاتُ مِنَ النِّسَاءِ إِلَّا مَا مَلَكَتْ أَيْمَانُكُمْ} [النساء: 24]، أَيْ: فَهُنَّ لَكُمْ حَلَالٌ إِذَا انْقَضَتْ عِدَّتُهُنَّ.",
                "headingArabic": "جَوَازِ وَطْءِ الْمَسْبِيَّةِ بَعْدَ الاِسْتِبْرَاءِ وَإِنْ كَانَ لَهَا زَوْجٌ انْفَسَخَ نِكَاحُهَا بِالسَّبْي",
                "headingUrdu": "اسیر عورت کے حاملہ نہ ہونے کے بعد اس سے ہمبستری کرنا جائز ہے اور اگر اس کا شوہر ہو تو جب قید ہو جائے تو اس کا نکاح فسخ ہو جاتا ہے۔",
                "headingEnglish": "It is permissible to have intercourse with a female captive after it is established that she is not pregnant, and if she has a husband, then her marriage is annulled when she is captured",
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11173,
                "hadithNumber": "3609",
                "englishNarrator": "Abu Sa'id al-Khudri ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sent a small army. The rest of the hadith is the same except this that he said: Except what your right hands possess out of them are lawful for you; and he did not mention when their 'idda period comes to an end .",
                "hadithUrdu": "اللہ کے نبی صلی اللہ علیہ وسلم نے حنین کے دن ایک سریہ بھیجا ۔ ۔ ۔ ( آگے ) یزید بن زریع کی حدیث کے ہم معنی ہے لیکن انہوں نے کہا : سوائے ان ( لونڈیوں ) کے جن کے مالک تمہارے دائیں ہاتھ ہوں ، وہ تمہارے لیے حلال ہیں ۔ اور انہوں نے \" جب ان کی عدت پوری ہو جائے \" کے الفاظ ذکر نہیں کیے ۔ ( اس سریہ میں جو کنیزیں ہاتھ آئیں یہ واقعہ ان کے بارے میں ہے.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، محمد بن المثنی اور ابن بشار نے بیان کیا، انہوں نے کہا عبدالاعلی نے ہمیں سعید سے حدیث بیان کی ، انہوں نے قتادہ سے ، انہوں نے ابوخلیل سے روایت کی کہ ابوعلقمہ ہاشمی نے حدیث بیان کی ، انہیں حضرت ابوسعید خدری رضی اللہ عنہ نے حدیث بیان کی کہ",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالُوا: حَدَّثَنَا عَبْدُ الْأَعْلَى، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ أَبِي الْخَلِيلِ، أَنَّ أَبَا عَلْقَمَةَ الْهَاشِمِيَّ، حَدَّثَ، أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ، حَدَّثَهُمْ، أَنَّ نَبِيَّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَعَثَ يَوْمَ حُنَيْنٍ سَرِيَّةً، بِمَعْنَى حَدِيثِ يَزِيدَ بْنِ زُرَيْعٍ، غَيْرَ أَنَّهُ قَالَ: إِلَّا مَا مَلَكَتْ أَيْمَانُكُمْ مِنْهُنَّ فَحَلَالٌ لَكُمْ، وَلَمْ يَذْكُرْ إِذَا انْقَضَتْ عِدَّتُهُنَّ،",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11174,
                "hadithNumber": "3610",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been reported on the authority of AbuSa'id (al-Khudri) (Allah be pleased with him) through another chain of transmitters and the words are: They took captives (women) on the day of Autas who had their husbands. They were afraid (to have sexual intercourse with them) when this verse was revealed: And women already married except those whom you right hands posses (iv. 24)",
                "hadithUrdu": "مجھ سے یحییٰ بن حبیب الحارث نے بیان کیا، یعنی ہم سے یہ ابن حارث نے بیان کیا, شعبہ نے قتادہ سے اسی سند کے ساتھ اسی کے ہم معنی حدیث بیان کی.",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِيهِ يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، بِهَذَا الْإِسْنَادِ نَحْوَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11175,
                "hadithNumber": "3611",
                "englishNarrator": "It was narrated that Abu Saeed رضی اللہ عنہ said:",
                "hadithEnglish": "'They captured some female prisoners on the day of Awtes, who had husband, so they were worried, then this verse was revealed: \"also (forbidden are) women are married, except those (slave) whom your right hands posses...\"",
                "hadithUrdu": "اوطاس کے دن صحابہ کو لونڈیاں ملیں جن کے خاوند بھی تھے ، اس پر وہ ( ان سے تعلقات ، قائم کرتے ہوئے ) ڈرے ( کہ یہ گناہ نہ ہو ) اس پر یہ آیت نازل کی گئی : \" اور شادی شدہ عورتیں ( بھی حرام ہیں ) سوائے ان ( لونڈیوں ) کے جن کے تمہارے دائیں ہاتھ مالک ہو جائیں.",
                "urduNarrator": "مجھ سے یحییٰ بن حبیب الحارث نے بیان کیا، ہم سے خالد بن حارث نے بیان کیا،شعبہ نے ہمیں قتادہ سے حدیث بیان کی ، انہوں نے ابوخلیل سے اور انہوں نے حضرت ابوسعید رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنِيهِ يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَبِي الْخَلِيلِ، عَنْ أَبِي سَعِيدٍ، قَالَ: أَصَابُوا سَبْيًا يَوْمَ أَوْطَاسَ لَهُنَّ أَزْوَاجٌ، فَتَخَوَّفُوا، فَأُنْزِلَتْ هَذِهِ الْآيَةُ: {وَالْمُحْصَنَاتُ مِنَ النِّسَاءِ إِلَّا مَا مَلَكَتْ أَيْمَانُكُمْ} [النساء: 24.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11176,
                "hadithNumber": "3612",
                "englishNarrator": null,
                "hadithEnglish": "Qatada reported a hadith like this with the same chain of transmitters.",
                "hadithUrdu": "مجھ سے یحییٰ بن حبیب نے بیان کیا، کہا ہم سے خالد نے بیان کیا، یعنی ابن حارث نے, سعید نے قتادہ سے اسی سند کے ساتھ اسی طرح حدیث بیان کی.",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِي يَحْيَى بْنُ حَبِيبٍ، حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، بِهَذَا الْإِسْنَادِ نَحْوَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11177,
                "hadithNumber": "3613",
                "englishNarrator": "A'isha (رضی اللہ عنہا) reported:",
                "hadithEnglish": "Sa'd bin Abu Waqqas and Abd bin Zam'a (رضی اللہ عنہما) disputed with each other over a young boy. Sa'd رضی اللہ عنہ said: Messenger of Allah, he is the son of my brother 'Utba bin Abu Waqqas as he made it explicit that he was his son. Look at his resemblance. Abd bin Zam'a said Messenger of Allah, he is my brother as he was born on the bed of my father from his slave-girl. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) looked at his resemblance and found a clear resemblance with 'Utba. (But) he said: He is yours O 'Abd (bin Zam'a), for the child is to be attributed to one on whose bed it is born, and stoning for a fornicator. Sauda bint Zam'a رضی اللہ عنہا, O you should observe veil from him. So he did not see Sauda at all. Muhammad bin Rumh did not make a mention (of the words): O Abd.",
                "hadithUrdu": "سعد بن ابی وقاص اور عبد بن زمعہ رضی اللہ عنہما نے ایک لڑکے کے بارے میں جھگڑا کیا ۔ سعد رضی اللہ عنہ نے کہا : اللہ کے رسول! یہ میرے بھائی عتبہ بن ابی وقاص کا بیٹا ہے ، اس نے مجھے وصیت کی تھی کہ یہ اس کا بیٹا ہے ، آپ اس کی مشابہت دیکھ لیں ۔ عبد بن زمعہ رضی اللہ عنہ نے کہا : یہ میرا بھائی ہے ، اللہ کے رسول! یہ میرے باپ کی لونڈی سے اسی کے بستر پر پیدا ہوا ہے ، رسول اللہ صلی اللہ علیہ وسلم نے اس کی مشابہت دیکھی تو آپ نے واضھ طور پر عتبہ کے ساتھ مشابہت ( بھی ) محسوس کی ، اس کے بعد آپ نے فرمایا : \"\" عبد! یہ تمہارا ( بھائی ) ہے ۔ ( اس کا سبب یہ ہے کہ ) بچہ صاحب فراش کا ہے ، اور زنا کرنے والے کے لیے پتھر ( ناکامی اور محرومی ) ہے ۔ اور سودہ بنت زمعہ! ( تم ) اس سے پردہ کرو ۔ \"\" اس کے بعد اس نے کبھی حضرت سودہ رضی اللہ عنہا کو نہیں دیکھا ۔ اور محمد بن رمح نے آپ کے الفاظ \"\" يا عبد \"\" ذکر نہیں کیے.",
                "urduNarrator": "قتیبہ بن سعید اور محمد بن رُمح نے کہا : لیث نے ہمیں ابن شہاب سے خبر دی ، انہوں نے عروہ سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ رُمْح، أَخْبَرَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ: اخْتَصَمَ سَعْدُ بْنُ أَبِي وَقَّاصٍ، وَعَبْدُ بْنُ زَمْعَةَ فِي غُلَامٍ، فَقَالَ سَعْدٌ: هَذَا يَا رَسُولَ اللهِ ابْنُ أَخِي عُتْبَةَ بْنِ أَبِي وَقَّاصٍ، عَهِدَ إِلَيَّ أَنَّهُ ابْنُهُ، انْظُرْ إِلَى شَبَهِهِ، وَقَالَ عَبْدُ بْنُ زَمْعَةَ: هَذَا أَخِي يَا رَسُولَ اللهِ، وُلِدَ عَلَى فِرَاشِ أَبِي مِنْ وَلِيدَتِهِ، فَنَظَرَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِلَى شَبَهِهِ، فَرَأَى شَبَهًا بَيِّنًا بِعُتْبَةَ، فَقَالَ: «هُوَ لَكَ يَا عَبْدُ، الْوَلَدُ لِلْفِرَاشِ، وَلِلْعَاهِرِ الْحَجَرُ، وَاحْتَجِبِي مِنْهُ يَا سَوْدَةُ بِنْتَ زَمْعَةَ»، قَالَتْ: فَلَمْ يَرَ سَوْدَةَ قَطُّ، وَلَمْ يَذْكُرْ مُحَمَّدُ بْنُ رُمْح: قَوْلَهُ: «يَا عَبْدُ.",
                "headingArabic": "الْوَلَدِ لِلْفِرَاشِ وَتَوَقِّي الشُّبُهَاتِ ‏‏",
                "headingUrdu": "بچہ بستر کے لیے ہے اور شک سے بچنا چاہیے۔",
                "headingEnglish": "The child is for the bed and suspicion must be avoided",
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11178,
                "hadithNumber": "3614",
                "englishNarrator": "A hadith like this is narrated on the authority of Ibn 'Uyaiyna and Ma'mar (and the words are):",
                "hadithEnglish": "The child is attributed to him on whose bed he is born; but they did not mention this: For a fornicator there is stoning.",
                "hadithUrdu": "\" بچہ صاحب فراش کا ہے \" اور ان دونوں نے \" زانی کے لیے پتھر ہے \" کے الفاظ ذکر نہیں کیے.",
                "urduNarrator": "ہم سے سعید بن منصور، ابوبکر بن ابی شیبہ اور عمرو ناقد نے بیان کیا، انہوں نے کہاسفیان بن عیینہ اور معمر نے زہری سے اسی سند کے ساتھ اسی کے ہم معنی حدیث بیان کی ۔ لیکن معمر اور ابن عیینہ کی حدیث میں ہے",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، قَالُوا: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ح وحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، كِلَاهُمَا عَنِ الزُّهْرِيِّ، بِهَذَا الْإِسْنَادِ نَحْوَهُ، غَيْرَ أَنَّ مَعْمَرًا، وَابْنَ عُيَيْنَةَ، فِي حَدِيثِهِمَا «الْوَلَدُ لِلْفِرَاشِ»، وَلَمْ يَذْكُرَا: «وَلِلْعَاهِرِ الْحَجَرُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11179,
                "hadithNumber": "3615",
                "englishNarrator": "Abu Huraira (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The child is to be attributed to one on whose bed he is born, and for a fornicator there is stoning.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" بچہ بستر والے کا ہے اور زانی کے لیے پتھر ( ناکامی اور محرومی ) ہے.",
                "urduNarrator": "مجھ سے محمد بن رافع اور عبد بن حمید نے بیان کیا، ابن رافع نے کہا: ہم سے عبد الرزاق نے بیان کیا, معمر نے زہری سے خبر دی ، انہوں نے ابن مسیب اور ابوسلمہ سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ ابْنُ رَافِعٍ: حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنِ ابْنِ الْمُسَيِّبِ، وَأَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ «الْوَلَدُ لِلْفِرَاشِ، وَلِلْعَاهِرِ الْحَجَرُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11180,
                "hadithNumber": "3616",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this is narrated on the authority of Abu Huraira رضی اللہ عنہ .",
                "hadithUrdu": "سعید بن منصور ، زہیر بن حرب ، عبدالاعلیٰ بن حماد اور عمرو ناقد سب نے کہا : ہمیں سفیان نے زہری سے خبر دی ۔ ابن منصور نے کہا : سعید نے ابوہریرہ رضی اللہ عنہ سے روایت کی ۔ عبدالاعلی نے کہا : ابوسلمہ سے یا سعید سے روایت ہے ، انہوں نے ابوہریرہ رضی اللہ عنہ سے روایت کی ۔ زہیر نے کہا : سعید یا ابوسلمہ نے ان دونوں میں سے ایک نے یا دونوں نے ابوہریرہ رضی اللہ عنہ سے روایت کی ۔ اور عمرو نے ایک بار کہا : ہمیں سفیان نے زہری کے حوالے سے سعید اور ابوسلمہ سے ، اور ایک بار کہا : سعید یا ابوسلمہ سے ، اور ایک بار کہا : سعید نے حضرت ابوہریرہ رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ۔ ۔ ۔ ( آگے ) جس طرح معمر کی حدیث ہے.",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، وَزُهَيْرُ بْنُ حَرْبٍ، وَعَبْدُ الْأَعْلَى بْنُ حَمَّادٍ، وَعَمْرٌو النَّاقِدُ، قَالُوا: حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، أَمَّا ابْنُ مَنْصُورٍ، فَقَالَ: عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، وَأَمَّا عَبْدُ الْأَعْلَى، فَقَالَ: عَنْ أَبِي سَلَمَةَ، أَوْ عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، وَقَالَ زُهَيْرٌ: عَنْ سَعِيدٍ، أَوْ عَنْ أَبِي سَلَمَةَ، أَحَدُهُمَا - أَوْ كِلَاهُمَا - عَنْ أَبِي هُرَيْرَةَ، وَقَالَ عَمْرٌو: حَدَّثَنَا سُفْيَانُ، مَرَّةً عَنِ الزُّهْرِيِّ، عَنْ سَعِيدٍ، وَأَبِي سَلَمَةَ، وَمَرَّةً عَنْ سَعِيدٍ، أَوْ أَبِي سَلَمَةَ، وَمَرَّةً عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، بِمِثْلِ حَدِيثِ مَعْمَرٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11181,
                "hadithNumber": "3617",
                "englishNarrator": "A'isha ( رضی اللہ عنہا) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) visited me looking pleased as if his face was glistening and said: Did you see that Mujazziz cast a glance at Zaid bin Haritha and Usama bin Zaid رضی اللہ عنہما , and (then) said: Some (of the features) of their feet are found in the others?",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم خوش خوش میرے پاس تشریف لائے ، آپ کے چہرے ( پیشانی ) کے خطوط چمک رہے تھے ، آپ نے فرمایا : \" تم نے دیکھا نہیں کہ ابھی ابھی ( بنو مدلج کے قیافہ شناس ) مُجزز نے زید بن حارثہ اور اسامہ بن زید رضی اللہ عنہما کو دیکھا ہے ، اور کہا ہے : ان قدموں میں سے ایک ( قدم ) دوسرے میں سے ہے ۔ \" ( ایک بیٹے کا ہے ، دوسرا باپ کا)",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، اور ہم سے محمد بن روم نے بیان کیا، انہوں نے کہا: ہم سے انہوں نے بیان کیا لیث نے ہمیں ابن شہاب سے حدیث بیان کی ، انہوں نے عروہ سے اور انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا",
                "hadithArabic": ") حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَمُحَمَّدُ بْنُ رُمْح، قَالَ: أَخْبَرَنَا اللَّيْثُ، ح وحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ: إِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، دَخَلَ عَلَيَّ مَسْرُورًا، تَبْرُقُ أَسَارِيرُ وَجْهِهِ، فَقَالَ: أَلَمْ تَرَيْ أَنَّ مُجَزِّزًا نَظَرَ آنِفًا إِلَى زَيْدِ بْنِ حَارِثَةَ، وَأُسَامَةَ بْنِ زَيْدٍ، فَقَالَ: إِنَّ بَعْضَ هَذِهِ الْأَقْدَامِ لَمِنْ بَعْضٍ.",
                "headingArabic": "الْعَمَلِ بِإِلْحَاقِ الْقَائِفِ الْوَلَدَ ‏‏",
                "headingUrdu": "جسمانی خصوصیات سے تعلقات کا پتہ لگانا",
                "headingEnglish": "Detecting relationships from physical features",
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11182,
                "hadithNumber": "3618",
                "englishNarrator": "A'isha ( رضی اللہ عنہا) reported:",
                "hadithEnglish": "One day Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) visited me looking pleased and he said: 'A'isha  رضی اللہ عنہا , don't you see Mujazziz al-Mudliji? (He) entered (my house) and saw Usama and Zaid with a rug over them covering their heads, but their feet appeared, and (he) said: These feet are related to one another.",
                "hadithUrdu": "ایک روز رسول اللہ صلی اللہ علیہ وسلم خوش خوش میرے پاس تشریف لائے ۔ اور فرمایا : \" عائشہ! کیا تم نے دیکھا نہیں کہ مجزز مدلجی میرے پاس آیا ، اس نے اسامہ اور زید کو دیکھا ، ان دونوں پر ایک چادر تھی جس نے ان کے سروں کو ڈھانپا ہوا تھا اور ان کے پاؤں ننگے تھے تو اس نے کہا : بلاشبہ یہ قدم ایک دوسرے میں سے ہیں.",
                "urduNarrator": "مجھ سے عمرو ناقد، زہیر بن حرب اور ابوبکر بن ابی شیبہ نے بیان کیا، اور تلفظ عمرو کے لیے ہے,سفیان نے ہمیں زہری سے حدیث بیان کی ، انہوں نے عروہ سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي عَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَاللَّفْظُ لِعَمْرٍو، قَالُوا: حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ: دَخَلَ عَلَيَّ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ذَاتَ يَوْمٍ مَسْرُورًا، فَقَالَ: يَا عَائِشَةُ، أَلَمْ تَرَيْ أَنَّ مُجَزِّزًا الْمُدْلِجِيَّ دَخَلَ عَلَيَّ، فَرَأَى أُسَامَةَ وَزَيْدًا، وَعَلَيْهِمَا قَطِيفَةٌ قَدْ غَطَّيَا رُءُوسَهُمَا، وَبَدَتْ أَقْدَامُهُمَا، فَقَالَ: إِنَّ هَذِهِ الْأَقْدَامَ بَعْضُهَا مِنْ بَعْضٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11183,
                "hadithNumber": "3619",
                "englishNarrator": "A'isha (رضی اللہ عنہا) reported:",
                "hadithEnglish": "A physiognomist visited (our house) and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was present, and Usama bin Zaid and Zaid bin Haritha رضی اللہ عنہم were both lying asleep, and he (the physiognomist), said: These feet are related to one another. Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was pleased to hear this, and he was happy and informed 'A'isha (رضی اللہ عنہا) about it.",
                "hadithUrdu": "ایک قیافہ شناس آیا ، رسول اللہ صلی اللہ علیہ وسلم بھی موجود تھے ، اسامہ بن زید اور زید بن حارثہ رضی اللہ عنہم ( ایک چادر میں ) لیٹے ہوئے تھے تو اس نے کہا : بلاشبہ یہ قدم ایک دوسرے میں سے ہیں ۔ اس سے نبی صلی اللہ علیہ وسلم کو خوشی ہوئی اور آپ کو بہت اچھا لگا ، آپ نے یہ بات حضرت عائشہ رضی اللہ عنہا کو بھی بتائی.",
                "urduNarrator": "ہم سے منصور بن ابی مزاحم نے بیان کیا، انہوں نے بیان کیا ابراہیم بن سعد نے ہمیں زہری سے حدیث بیان کی ، انہوں نے عروہ سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وَحَدَّثَنَاهُ مَنْصُورُ بْنُ أَبِي مُزَاحِمٍ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ: دَخَلَ قَائِفٌ وَرَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ شَاهِدٌ وَأُسَامَةُ بْنُ زَيْدٍ وَزَيْدُ بْنُ حَارِثَةَ مُضْطَجِعَانِ، فَقَالَ: إِنَّ هَذِهِ الْأَقْدَامَ بَعْضُهَا مِنْ بَعْضٍ، فَسُرَّ بِذَلِكَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَأَعْجَبَهُ، وَأَخْبَرَ بِهِ عَائِشَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11184,
                "hadithNumber": "3620",
                "englishNarrator": "A hadith like this has been narrated on the authority of Zuhri and Yunus said:",
                "hadithEnglish": "Mujazziz was a physiognomist.",
                "hadithUrdu": "اور مجزز ایک قیافہ شاس تھا.",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا, یونس ، معمر اور ابن جریج سب نے زہری سے اسی سند کے ساتھ ، ان ( لیث ، سفیان اور ابراہیم بھی سعد ) کی حدیث کے ہم معنی روایت بیان کی اور ( ابن وہب نے ) یونس کی حدیث میں یہ اضافہ کیا",
                "hadithArabic": "وحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، ح وحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، وَابْنُ جُرَيْجٍ، كُلُّهُمْ عَنِ الزُّهْرِيِّ، بِهَذَا الْإِسْنَادِ بِمَعْنَى حَدِيثِهِمْ، وَزَادَ فِي حَدِيثِ يُونُسَ: وَكَانَ مُجَزِّزٌ قَائِفًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11185,
                "hadithNumber": "3621",
                "englishNarrator": "Abdul-Malik bin Abu Bakr bin Abdul-Rahman bin al-Harith bin Hisham reported on the authority of his father from Umm Salama (رضی اللہ عنہا):",
                "hadithEnglish": "When Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) married Umm Salama رضی اللہ عنہا , he stayed with her for three nights, and said: There is no lack of estimation on the part of your husband for you. If you wish I can stay with you for a week, but in case I stay with you for a week, then I shall have to stay for a week with all my wives.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے جب ام سلمہ رضی اللہ عنہا سے شادی کی تو ان کے ہاں تین دن قیام کیا اور فرمایا : \" اپنے اہل ( شوہر ) کے نزدیک تمہاری قدر و منزلت میں کسی طرح کی کمی نہیں ، اگر تم چاہو تو میں تمہارے پاس ( قیام کے لیے ) سات دن رکھ لیتا ہوں اور اگر میں نے تمہارے ہاں سات دن قیام کیا تو اپنی ساری بیویوں کے ہاں سات سات دن قیام کروں گا.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، محمد بن حاتم اور یعقوب بن ابراہیم نے بیان کیا، اور یہ قول ابوبکر سے ہے، انہوں نے کہا: ہم سے یحییٰ بن نے بیان کیا۔ سعید، سفیان کی سند سے، محمد بن ابی بکر کی سند سے، عبد الملک بن کی سند سے,محمد بن ابوبکر نے عبدالملک بن ابوبکر بن عبدالرحمٰن بن حارث بن ہشام سے ، انہوں نے اپنے والد سے ، انہوں نے ام سلمہ رضی اللہ عنہا سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ حَاتِمٍ، وَيَعْقُوبُ بْنُ إِبْرَاهِيمَ، وَاللَّفْظُ لِأَبِي بَكْرٍ، قَالُوا: حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ سُفْيَانَ، عَنْ مُحَمَّدِ بْنِ أَبِي بَكْرٍ، عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، عَنْ أَبِيهِ، عَنْ أُمِّ سَلَمَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لَمَّا تَزَوَّجَ أُمَّ سَلَمَةَ، أَقَامَ عِنْدَهَا ثَلَاثًا، وَقَالَ: «إِنَّهُ لَيْسَ بِكِ عَلَى أَهْلِكِ هَوَانٌ، إِنْ شِئْتِ سَبَّعْتُ لَكِ، وَإِنْ سَبَّعْتُ لَكِ، سَبَّعْتُ لِنِسَائِي».",
                "headingArabic": "قَدْرِ مَا تَسْتَحِقُّهُ الْبِكْرُ وَالثَّيِّبُ مِنْ إِقَامَةِ الزَّوْجِ عِنْدَهَا عَقِبَ الزِّفَافِ",
                "headingUrdu": "وہ پرویزلمرد میں لمبا کنوارا ہے اور طہٰ حفصہ بند سیٹی کے حقدار سے ہے اور پھر اس نے روزہ افطار کیا ہے۔",
                "headingEnglish": "How long a virgin and a previously-married woman are entitled to have the husband stay with them after marriage",
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11186,
                "hadithNumber": "3622",
                "englishNarrator": "Ibn Abu Bakr bin Abdul-Rahman reported:",
                "hadithEnglish": "When Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) married Umm Salama رضی اللہ عنہا and she stayed with him (during the night), and it was dawn, he (the Holy Prophet ﷺ) said to her: There is no lack of estimation for you on the part of your husband. So if you desire I can spend a week with you, and if you like I may spend three (nights). and then I will visit you in turn. She said: Spend three (nights).",
                "hadithUrdu": "جب رسول اللہ صلی اللہ علیہ وسلم نے ام سلمہ رضی اللہ عنہا سے نکاح کیا اور وہ آپ صلی اللہ علیہ وسلم کے پاس رہائش پذیر ہو گئیں تو آپ صلی اللہ علیہ وسلم نے ان سے کہا : \" اپنے شوہر کے سامنے تمہارے مرتبے میں کوئی کمی نہیں ، اگر تم چاہو تو میں تمہارے ہاں سات دن قیام کروں گا ، اور اگر تم چاہو تو تین دن قیام کروں گا پھر ( باری باری ) سب کے ہاں جانا شروع کروں گا ۔ \" ام سلمہ رضی اللہ عنہا نے جواب دیا : آپ تین دن قیام فرمائیں.",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے مالک رضی اللہ عنہ سے پڑھا, عبداللہ بن ابوبکر نے عبدالملک بن ابوبکر سے ، انہوں نے ابوبکر بن عبدالرحمٰن سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ عَبْدِ اللهِ بْنِ أَبِي بَكْرٍ، عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حِينَ تَزَوَّجَ أُمَّ سَلَمَةَ، وَأَصْبَحَتْ عِنْدَهُ، قَالَ لَهَا: «لَيْسَ بِكِ عَلَى أَهْلِكِ هَوَانٌ، إِنْ شِئْتِ سَبَّعْتُ عِنْدَكِ، وَإِنْ شِئْتِ ثَلَّثْتُ، ثُمَّ دُرْتُ»، قَالَتْ: ثَلِّثْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11187,
                "hadithNumber": "3623",
                "englishNarrator": "Abu Bakr bin 'Abdul-Rahman reported:",
                "hadithEnglish": "When Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) married Umm Salama and he visited her, and when he intended to come out, she caught hold of his cloth. whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: If you so desire, I can extend the time (of my stay) with you, but then I shall have to calculate the time (that I stay with you and shall have to spend the same time with other wives). For the virgin woman, (her husband has to stay with her) for a week, and for the woman previously married it is three days.",
                "hadithUrdu": "جب رسول اللہ صلی اللہ علیہ وسلم نے ام سلمہ رضی اللہ عنہا سے نکاح کیا تو آپ ان کے پاس گئے ، اس کے بعد آپ نے نکلنے کا ارادہ کیا تو انہوں نے آپ کے کپڑے کو پکڑ لیا ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اگر تم چاہو تو میں مزید تمہارے ہاں قیام کروں گا اور تمہارے ساتھ اس کا حساب رکھوں گا ، کنواری کے لیے سات راتیں ہیں اور ثیبہ ( دوہاجو ) کے لیے تین راتیں ہیں.",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ القنبی نے بیان کیا، انہوں نے بیان کیا سلیمان بن بلال نے ہمیں عبدالرحمٰن بن حُمَید سے حدیث بیان کی ، انہوں نے عبدالملک بن ابوبکر سے ، انہوں نے ابوبکر بن عبدالرحمٰن سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَا عَبْدُ اللهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ، حَدَّثَنَا سُلَيْمَانُ يَعْنِي ابْنَ بِلَالٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ حُمَيْدٍ، عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي بَكْرٍ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حِينَ تَزَوَّجَ أُمَّ سَلَمَةَ، فَدَخَلَ عَلَيْهَا، فَأَرَادَ أَنْ يَخْرُجَ أَخَذَتْ بِثَوْبِهِ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنْ شِئْتِ زِدْتُكِ، وَحَاسَبْتُكِ بِهِ، لِلْبِكْرِ سَبْعٌ، وَلِلثَّيِّبِ ثَلَاثٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11188,
                "hadithNumber": "3624",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been narrated on the authority of Ibn Humaid.",
                "hadithUrdu": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے بیان کیا ابوضمرہ نے عبدالرحمٰن بن حمید سے اسی سند کے ساتھ اسی کے مانند روایت کی.",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو ضَمْرَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ حُمَيْدٍ، بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 10876,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=435",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=433",
                "label": "433",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=434",
                "label": "434",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=435",
                "label": "435",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=436",
                "label": "436",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=437",
                "label": "437",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=438",
                "label": "438",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=439",
                "label": "439",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=437",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=437",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=435",
        "to": 10900,
        "total": 40465
    }
}