{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 349,
        "data": [
            {
                "id": 8989,
                "hadithNumber": "1425",
                "englishNarrator": "Ali ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said on the day (of the Battle) of Ahzab: They diverted us from saying the middle prayer, i.e. the 'Asr prayer. May Allah fill their houses and graves with fire; he then observed this prayer between the evening prayer and the night prayer.",
                "hadithUrdu": "رسول اللہ ﷺ نےاحزاب کے دن فرمایا : ’’انھوں نے ہمیں درمیانی نماز ( یعنی ) عصر کی نماز سے مشغول رکھا ، اللہ تعالیٰ ان کے گھروں اور قبروں کو آگ سے بھر دے ۔ ‘ ‘ پھر آپ نے اسے رات کے دونوں نمازوں مغرب اور عشاء کے درمیان پڑھا ۔ ( مغرب کا وقت جارہا تھا اس لیے آخری وقت میں پہلے مغرب پڑھی ، پھر عصر کی قضا پڑھی ، پھر عشاء پڑھی ۔ )",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، زہیر بن حرب اور ابو کریب نے بیان کیا، انہوں نے کہا: ہم سے ابو معاویہ نے الاعمش کی سند سے اور مسلم بن صبیح کی سند سے بیان کیا, شتیر بن شکل نےحضرت علی ‌رضی ‌اللہ ‌عنہ ‌ ‌ سےروایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَأَبُو كُرَيْبٍ، قَالُوا: حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ مُسْلِمِ بْنِ صُبَيْحٍ، عَنْ شُتَيْرِ بْنِ شَكَلٍ، عَنْ عَلِيٍّ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْأَحْزَابِ: «شَغَلُونَا عَنِ الصَّلَاةِ الْوُسْطَى، صَلَاةِ الْعَصْرِ، مَلَأَ اللهُ بُيُوتَهُمْ وَقُبُورَهُمْ نَارًا»، ثُمَّ صَلَّاهَا بَيْنَ الْعِشَاءَيْنِ، بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8990,
                "hadithNumber": "1426",
                "englishNarrator": "Abdullah (bin Mas'ud) رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The polytheists detained the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) from observing the afternoon prayer till the sun became red or it became yellow. Upon this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) said: They have diverted us from (offering) the middle prayer. i. e. the 'Asr prayer. May Allah fill their bellies and their graves with fire, or he said: May Allah stuff their bellies and their graves with fire.",
                "hadithUrdu": "مشرکوں نے ( جنگ میں مشغول رکھ کر ) رسو ل اللہ ﷺ کو عصر کی نمازسے روکے رکھا یہاں تک کہ سورج سرخ یا زرد ہو گیا تو رسول اللہ ﷺ نے فرمایا : ’’انھوں نےہمیں درمیانی نماز ، عصر کی نماز سے مشغول رکھا ، اللہ تعالیٰ ان کے پیٹوں اور قبروں میں آگ بھر دے ۔ ‘ ‘ یا فرمایا : ’’ اللہ تعالیٰ ان کے پیٹوں اور قبروں کو آگ سے بھر دے ۔",
                "urduNarrator": "ہم سے عون بن سلام الکوفی نے بیان کیا، کہا ہم سے محمد بن طلحہ الیمی نے بیان کیا، انہوں نے زبید کی سند سے، مرہ کی سند سے۔حضرت عبداللہ ( بن مسعود ) ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے ، انھوں نے کہا",
                "hadithArabic": "وَحَدَّثَنَا عَوْنُ بْنُ سَلَّامٍ الْكُوفِيُّ، أَخْبَرَنَا مُحَمَّدُ بْنُ طَلْحَةَ الْيَامِيُّ، عَنْ زُبَيْدٍ، عَنْ مُرَّةَ، عَنْ عَبْدِ اللهِ، قَالَ: حَبَسَ الْمُشْرِكُونَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ صَلَاةِ الْعَصْرِ، حَتَّى احْمَرَّتِ الشَّمْسُ، أَوِ اصْفَرَّتْ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «شَغَلُونَا عَنِ الصَّلَاةِ الْوُسْطَى، صَلَاةِ الْعَصْرِ، مَلَأَ اللهُ أَجْوَافَهُمْ، وَقُبُورَهُمْ نَارًا»، أَوْ قَالَ: «حَشَا اللهُ أَجْوَافَهُمْ وَقُبُورَهُمْ نَارًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8991,
                "hadithNumber": "1427",
                "englishNarrator": "Abu Yunus, the freed slave of 'A'isha رضی اللہ عنہا said:",
                "hadithEnglish": "'A'isha رضی اللہ عنہا ordered me to transcribe a copy of the Qur'an for her and said: When you reach this verse: Guard the prayers and the middle prayer (ii. 238), inform me; so when I reached it, I informed her and she gave me dictation (like this): Guard the prayers and the middle prayer and the afternoon prayer, and stand up truly obedient to Allah. 'A'isha رضی اللہ عنہا said: This is how I have heard from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌).",
                "hadithUrdu": "حضرت عائشہ رضی اللہ عنہا نے مجھے حکم دیا: ان کے لیے قرآن مجید لکھوں فرمایا : جب تم اس آیت پر پہنچوں ( حفظو علی الصلوت والصلوۃ الوسطی ) تو مجھے بتانا چنانچہ جب میں آیت پر پہنچا تو انھیں آگاہ کیا ، انھوں نے مجھے لکھوایا : حافظ علی الصلوت والصلاۃ الوسطی وصلاۃ العصر ، قوموا اللہ قانتین ’’ نمازوں کی حفاظت کرو اور ( خاص کر ) درمیانی نماز کی ، یعنی نماز عصر کی اور اللہ کے حضور عاجزانہ قیام کرو ۔ ‘ ‘ حضرت عائشہ رضی اللہ عنہانے فرمایا : میں نے اسے رسول اللہ ﷺ سےایسے ہی سنا ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ التمیمی نے بیان کیا، انہوں نے کہا: میں نے مالک کو زید بن اسلم سے، قعقا ع بن حکیم کی سند سے، ابو یونس کی سند سے, حضرت عائشہ رضی اللہ عنہا نے آزاد کردہ غلام ابو یونس سے روایت ہے ، کہا  کہ",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنِ الْقَعْقَاعِ بْنِ حَكِيمٍ، عَنْ أَبِي يُونُسَ، مَوْلَى عَائِشَةَ، أَنَّهُ قَالَ: أَمَرَتْنِي عَائِشَةُ أَنْ أَكْتُبَ لَهَا مُصْحَفًا، وَقَالَتْ: إِذَا بَلَغْتَ هَذِهِ الْآيَةَ فَآذِنِّي: {حَافِظُوا عَلَى الصَّلَوَاتِ وَالصَّلَاةِ الْوُسْطَى} [البقرة: 238] فَلَمَّا بَلَغْتُهَا آذَنْتُهَا فَأَمْلَتْ عَلَيَّ: {حَافِظُوا عَلَى الصَّلَوَاتِ وَالصَّلَاةِ الْوُسْطَى} [البقرة: 238]، وَصَلَاةِ الْعَصْرِ، {وَقُومُوا لِلَّهِ قَانِتِينَ} [البقرة: 238] ، قَالَتْ عَائِشَةُ: سَمِعْتُهَا مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8992,
                "hadithNumber": "1428",
                "englishNarrator": "Al-Bara' bin 'Azib رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "This verse was revealed (in this way): Guard the prayers and the 'Asr prayer. We recited it (in this very way) so long as Allah desired. Allah, then, abrogated it and it was revealed: Guard the prayers, and the middle prayer. A person who was sitting with Shaqiq (one of the narrators in the chain of transmitters) said: Now it implies the 'Asr prayer. Upon this al-Bara' ‌رضی ‌اللہ ‌عنہ said: I have already informed you how this (verse) was revealed and how Allah abrogated it, and Allah knows best.",
                "hadithUrdu": "یہ آیت ( اس طرح ) حافظ علی الصلوٰت وصلاۃ العصر ) ) نازل ہوئی ، جب تک اللہ تعالیٰ کو منظور ہوا ہم نے اسے پڑھا ، پھر اللہ تعالیٰ نے اسےمنسوخ کر دیا اور آیت اس طرح اتری : ( حفظوا علی الصلوٰت والصلوٰۃ الوسطیٰ ) ’’نمازوں کی نگہداشت کرو اور ( خصوصا ) درمیان کی نماز کی ‘ ‘ اس پر ایک آدمی نے ‘ جو شقیق کے پاس بیٹھا ہوا تھا ، ان سے کہا : تو پھر اس سے مراد عصر کی نماز ہوئی ؟ حضرت براء ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے فرمایا : میں تمھیں بتا چکا ہوں کہ یہ آیت کیسے اتری اور اللہ تعالیٰ نے کیسے اسے منسوخ کیا ، ( اصل حقیقت ) اللہ ہی بہتر جانتا ہے",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم الحنظَلی نے بیان کیا، کہا ہم سے یحییٰ بن آدم نے بیان کیا, فضیل بن مرزوق نے شقیق بن عقبہ سے اور انھوں نے حضرت براء بن عازب ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا الْفُضَيْلُ بْنُ مَرْزُوقٍ، عَنْ شَقِيقِ بْنِ عُقْبَةَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ: نَزَلَتْ هَذِهِ الْآيَةُ: {حَافِظُوا عَلَى الصَّلَوَاتِ} [البقرة: 238] وَصَلَاةِ الْعَصْرِ، فَقَرَأْنَاهَا مَا شَاءَ اللهُ، ثُمَّ نَسَخَهَا اللهُ، فَنَزَلَتْ: {حَافِظُوا عَلَى الصَّلَوَاتِ وَالصَّلَاةِ الْوُسْطَى} [البقرة: 238]، فَقَالَ رَجُلٌ كَانَ جَالِسًا عِنْدَ شَقِيقِ لَهُ: هِيَ إِذَنْ صَلَاةُ الْعَصْرِ، فَقَالَ الْبَرَاءِ: قَدْ أَخْبَرْتُكَ كَيْفَ نَزَلَتْ، وَكَيْفَ نَسَخَهَا اللهُ، وَاللهُ أَعْلَمُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8993,
                "hadithNumber": "1429",
                "englishNarrator": "Imam Muslim said: Ashja'i narrated it from Sufyan al-Thauri, who narrated it from al-Aswad bin Qais, who narrated it from 'Uqba, who narrated it from al-Bara' bin 'Azib رضی ‌اللہ ‌عنہ who said:",
                "hadithEnglish": "We recited with the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) (the above-mentioned verse like this, i. e. instead of Salat al- Wusta, Salat al-'Asr) for a certain period. as It has been mentioned (in the above-quoted hadith).",
                "hadithUrdu": "ہم یہ آیت ایک عرصے تک نبی اکرم ﷺ کے ساتھ ( اسی طرح ) پڑھتے رہے ۔ ۔ ۔ ۔ ۔ ( آگے ) فضیل بن مرزوق کی ( سابقہ ) حدیث کی مانند ہے ۔",
                "urduNarrator": "مسلم نے کہا: اسے اشجعی نے سفیان ثوری کی سند سے،اسود بن قیس نے شقیق بن عبہ سے ، انہوں نے حضرت براء بن عازب ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی انھوں نے کہا",
                "hadithArabic": "قَالَ مُسْلِمٌ: وَرَوَاهُ الْأَشْجَعِيُّ، عَنْ سُفْيَانَ الثَّوْرِيِّ، عَنِ الْأَسْوَدِ بْنِ قَيْسٍ، عَنْ شَقِيقِ بْنِ عُقْبَةَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ: قَرَأْنَاهَا مَعَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ زَمَانًا بِمِثْلِ حَدِيثِ فُضَيْلِ بْنِ مَرْزُوقٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8994,
                "hadithNumber": "1430",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ عنہا reported:",
                "hadithEnglish": "Umar bin al-Khattab رضی اللہ عنہا had been cursing the pagans of the Quraish an the day (of the Battle) of Khandaq (Ditch). (He came to the Holy Prophet) and said: Messenger of Allah, by God, I could not say. the 'Asr prayer till the sun set. Upon this the Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: By Allah I, too, have not observed it. So we went to a valley. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) performed ablution and we too performed ablution, and then the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said the 'Asr prayer after the sun had set. and then said the evening prayer after it.",
                "hadithUrdu": "خندق کے روز حضرت عمر بن خطاب ‌رضی ‌اللہ ‌عنہ ‌ ‌ کفار قریش کو برا بھلا کہنے لگے اور عرض کی : اے اللہ کےرسول ! اللہ کی قسم ! میں عصر کی نماز نہیں پڑھ سکا تھا یہاں تک کہ سورج غروب ہونے کو آگیا ۔ تو رسول اللہ ﷺ نے فرمایا : ’’ اللہ کی قسم ! میں نے ( بھی ) نہیں پڑھی ۔ ‘ ‘ پھر ہم ( وادی ) بطحان میں اترے ، رسول اللہ ﷺ نے وضول کیا اور ہم نے بھی وضو کیا ، پھر رسول اللہ ﷺ نے سورج کے غروب ہو جانے کے بعد عصرکی نماز پڑھی ، پھر اس کے بعد مغرب کی نماز ادا کی ۔",
                "urduNarrator": "ابو غسان المسمعی اور محمد بن المثنی نے مجھ سے کہا, معاذ بن ہشام نے حدیث بیان کی ، کہا : ہمیں میرے والد نے یحییٰ بن ابی کثیر سے حدیث سنائی ، انھوں نے کہا : ہمیں ابو سلمہ بن عبدالرحمن نےحضرت جابر بن عبداللہ رضی اللہ عنہا سے روایت کرتے ہوئے حدیث بیان کی کہ",
                "hadithArabic": "وَحَدَّثَنِي أَبُو غَسَّانَ الْمِسْمَعِيُّ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، عَنْ مُعَاذِ بْنِ هِشَامٍ، قَالَ أَبُو غَسَّانَ: حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنِي أَبِي، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، قَالَ: حَدَّثَنَا أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، يَوْمَ الْخَنْدَقِ جَعَلَ يَسُبُّ كُفَّارَ قُرَيْشٍ، وَقَالَ: يَا رَسُولَ اللهِ ‍، وَاللهِ مَا كِدْتُ أَنْ أُصَلِّيَ الْعَصْرَ حَتَّى كَادَتْ أَنْ تَغْرُبَ الشَّمْسُ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «فَوَاللهِ إِنْ صَلَّيْتُهَا، فَنَزَلْنَا إِلَى بُطْحَانَ، فَتَوَضَّأَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَتَوَضَّأْنَا، فَصَلَّى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الْعَصْرَ بَعْدَ مَا غَرَبَتِ الشَّمْسُ، ثُمَّ صَلَّى بَعْدَهَا الْمَغْرِبَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8995,
                "hadithNumber": "1431",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been reported by Yahya bin Abi Kathir with the same chain of transmitters.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ اور اسحاق بن ابراہیم نے بیان کیا، کہا کہ ہم سے ابوبکر نے بیان کیا، اور اسحاق نے کہا: ہم سے وکیع نے بیان کیا, علی بن مبارک نے یحییٰ بن ابی کثیر سے اسی سند کے ساتھ اسی کی مانند حدیث بیان کی.",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَبُو بَكْرٍ: حَدَّثَنَا، وَقَالَ إِسْحَاقُ: أَخْبَرَنَا وَكِيعٌ، عَنْ عَلِيِّ بْنِ الْمُبَارَكِ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، فِي هَذَا الْإِسْنَادِ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8996,
                "hadithNumber": "1432",
                "englishNarrator": "Abu Huraira ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Angels take turns among you by night and by day, and they all assemble at the dawn and afternoon prayers. Those (of the angels) who spend the night among you, then, ascend, and their Lord asks them, though He is the best informed about them: How did you leave My servants? -they say: We left them while they were praying and we came to them while they were praying.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’رات کے فرشتے اور دن کے فرشتے ایک دوسرے کے پیچھے تمھارے درمیان آتے ہیں اور فجر کی نماز اور عصری نماز کے وقت وہ اکٹھے ہو جاتے ہیں ، پھر جنھوں نے تمھارے درمیان رات گزاری ہوتی ہے وہ اوپر چلے جاتےہیں ، ان سے ان کا رب پوچھتا ہے ، حالانکہ وہ ان سے زیادہ جانتا ہے : تم میرے بندوں کو کس حال میں چھوڑ کر آئے ہو ؟ وہ جواب دیتےہیں : ہم انھیں ( اس حالت میں ) چھوڑ کر آئے ہیں کہ وہ نماز پڑھ رہے تھے اور ہم ان کے پاس ( کل عصر کے وقت ) اس حالت میں پہنچے تھے کہ وہ نماز پڑھ رہے تھے.",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے مالک رضی اللہ عنہ سے پڑھا,ابو زناد نے اعراج سے ، انھوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: يَتَعَاقَبُونَ فِيكُمْ مَلَائِكَةٌ بِاللَّيْلِ، وَمَلَائِكَةٌ بِالنَّهَارِ، وَيَجْتَمِعُونَ فِي صَلَاةِ الْفَجْرِ، وَصَلَاةِ الْعَصْرِ، ثُمَّ يَعْرُجُ الَّذِينَ بَاتُوا فِيكُمْ، فَيَسْأَلُهُمْ رَبُّهُمْ وَهُوَ أَعْلَمُ بِهِمْ: كَيْفَ تَرَكْتُمْ عِبَادِي؟ فَيَقُولُونَ: تَرَكْنَاهُمْ وَهُمْ يُصَلُّونَ، وَأَتَيْنَاهُمْ وَهُمْ يُصَلُّونَ.",
                "headingArabic": "فَضْلِ صَلاَتَىِ الصُّبْحِ وَالْعَصْرِ وَالْمُحَافَظَةِ عَلَيْهِمَا ‏",
                "headingUrdu": "صبح اور عصر کی نمازوں کی فضیلت اور ان کی پابندی",
                "headingEnglish": "The virtue of the Subh and the `Asr prayers, and of maintaining them",
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8997,
                "hadithNumber": "1433",
                "englishNarrator": "Abu Huraira ‌رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Angels take turns among you by night and by day, and the rest of the hadith is the same.",
                "hadithUrdu": "آپ نے فرمایا : ’’فرشتے ایک دوسرے کے پیچھے تمھار ے پاس آتے ہیں ۔ ‘ ‘ ( اس حدیث میں ملائکہ کا لفظ یتعاقبون سے پہلے ہے ۔ ) ۔ ۔ ۔ ۔ ۔ ( باقی روایت ) ابو زناد کی روایت کے مانند ہے",
                "urduNarrator": "ہم سے محمد بن رافع نے بیان کیا، ہم سے عبدالرزاق نے بیان کیا، ہم سے معمر نے بیان کیا, ہمام بن منبہ نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انھوں نے نبی اکرمﷺ سے روایت کی",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «وَالْمَلَائِكَةُ يَتَعَاقَبُونَ فِيكُمْ» بِمِثْلِ حَدِيثِ أَبِي الزِّنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8998,
                "hadithNumber": "1434",
                "englishNarrator": "Jarir bin Abdullah رضی ‌اللہ ‌عنہ is reported to have said:",
                "hadithEnglish": "We were sitting with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) that he looked at the full moon and observed: You shall see your Lord as you are seeing this moon, and you will not be harmed by seeing Him. So if you can, do not let -yourselves be overpowered in case of prayer observed before the rising of the sun and its setting, i. e. the 'Asr prayer and the morning prayer. Jarir ‌رضی ‌اللہ ‌عنہ ‌then recited it: Celebrate the praise of thy Lord before the rising of the sun and before Its setting (xx. 130).",
                "hadithUrdu": "ہم رسول اللہ ﷺ کی خدمت میں بیٹھے ہوئے تھے کہ آپ نے چودھویں رات کے چاند کی طرف نظر کی اور فرمایا : ’’سنو! تم لوگ اپنے رب کو اس طرح دیکھوں گے ، جس طرح اس پورے چاند کو دیکھ رہےہو ، اس کے دیکھنے میں تم بھیٹر نہ لگا ؤ گے ، اگر تم یہ کر سکو کہ سورج نکلنے سے پہلے کی اور سورج غروب ہونے سے پہلے کی نماز میں ( مصروفیت ، سستی وغیرہ سے ) مغلوب نہ ہو ( تو تمہیں یہ نعمت عظمیٰ مل جائے گئی ۔ ) ‘ ‘ آپ کی مراد عصر اور فجر کی نماز سے تھی ، پھر جریر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے یہ آیت پڑھی ( وسبح بحمد ربک قبل طلوع الشمس وقبل غروبہا ) اور اپنے رب کی حمد کی تسبیح بیان کرو ، سورج کے نکلنے سے پہلے اور اس کے غروب ہونے سے پہلے ۔ ‘ ‘",
                "urduNarrator": "زہیر بن حرب نے کہا : ہمیں مروان بن معاویہ فزاری نے حدیث سنائی ، انھوں کہا : ہمیں اسماعیل بن ابی خالد نے خبر دی ، انھوں نے کہا : ہمیں قیس بن ابی حازم نے حدیث سنائی ، انھوں نے کہا : میں نے حضرت جریر بن عبداللہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنا ، وہ کہے رہے تھے",
                "hadithArabic": "وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ الْفَزَارِيُّ، أَخْبَرَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ، حَدَّثَنَا قَيْسُ بْنُ أَبِي حَازِمٍ، قَالَ: سَمِعْتُ جَرِيرَ بْنَ عَبْدِ اللهِ، وَهُوَ يَقُولُ: كُنَّا جُلُوسًا عِنْدَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، إِذْ نَظَرَ إِلَى الْقَمَرِ لَيْلَةَ الْبَدْرِ، فَقَالَ: «أَمَا إِنَّكُمْ سَتَرَوْنَ رَبَّكُمْ كَمَا تَرَوْنَ هَذَا الْقَمَرَ، لَا تُضَامُّونَ فِي رُؤْيَتِهِ، فَإِنِ اسْتَطَعْتُمْ أَنْ لَا تُغْلَبُوا عَلَى صَلَاةٍ قَبْلَ طُلُوعِ الشَّمْسِ، وَقَبْلَ غُرُوبِهَا» - يَعْنِي الْعَصْرَ وَالْفَجْرَ -، ثُمَّ قَرَأَ جَرِيرٌ {وَسَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوعِ الشَّمْسِ وَقَبْلَ غُرُوبِهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8999,
                "hadithNumber": "1435",
                "englishNarrator": "Waki' reported (this hadith) with the same chain of transmitters (that the Holy Prophet) said:",
                "hadithEnglish": "You will be soon presented before your Lord, and you will see Him as you are seeing this moon, and then recited (the above-mentioned verse). But (in this hadith) no mention is made of Jarir ‌رضی ‌اللہ ‌عنہ .",
                "hadithUrdu": "سنو ! تم لوگ یقینا اپنے رب کے سامنے پیش کیے جاؤ گے اور اس کو اسی طرح دیکھوں گے ، جس طرح اس پور ے چا ند کو دیکھتے ہو ۔ ‘ ‘ پھر روای نے ( ثم قراء جریر کے بجائے ) ثم قراء ( پھر انھوں پڑھا ) کہا اور جریر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کا نام نہیں لیا ۔",
                "urduNarrator": "ابو بکر بن ابی شیبہ نےعبداللہ بن نمیر ، ابو اسامہ اور وکیع سے باقی ماندہ اسی سند کے ساتھ روایت کی ، اس میں ہے",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللهِ بْنُ نُمَيْرٍ، وَأَبُو أُسَامَةَ، وَوَكِيعٌ، بِهَذَا الْإِسْنَادِ، وَقَالَ: «أَمَا إِنَّكُمْ سَتُعْرَضُونَ عَلَى رَبِّكُمْ، فَتَرَوْنَهُ كَمَا تَرَوْنَ هَذَا الْقَمَرَ»، وَقَالَ: ثُمَّ قَرَأَ، وَلَمْ يَقُلْ: جَرِيرٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9000,
                "hadithNumber": "1436",
                "englishNarrator": "Umara bin Ruwaiba is reported to have said on the authority of his father:",
                "hadithEnglish": "I heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saying: He who observes prayer before the rising of the sun and its setting, i.e. the dawn prayer and the afternoon prayer, would not enter the (Hell) fire. A person belonging to Basra said to him: Did you yourself hear it from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌)? He said: Yes. The person (from Basra) said: I bear witness that I heard it from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌); my ears heard it and my heart retained it.",
                "hadithUrdu": "میں نے رسول اللہ ﷺ کویہ فرماتے ہوئے سنا : ’’ وہ شخص ہرگز آگ میں داخل نہیں ہو گا جو سورج نکلنے اور اس کے غروب ہونے سے پہلے نماز پڑھتا ہے ۔ ‘ ‘ یعنی فجر اور عصر کی نمازیں ۔ اس پر بصرہ کے ایک آدمی نے ان سے کہا : کیا آپ نے یہ روایت رسول للہ ﷺ سے سنی تھی ؟ انھوں نے کہا : ہا ں ۔ اس آدمی نے کہا : میں شہادت دیتا ہوں کہ میں نے بھی یہ روایت رسول اللہ ﷺ سے سنی ۔ میرے دونوں کانوں نے اسے سنا اور میرے دل نے اسے یاد رکھا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، ابو کریب اور اسحاق بن ابراہیم سب نے وکیع کی سند سے بیان کیا، کہا: ہم سے وکیع نے بیان کیا, ( اسماعیل ) ابن ابی خالد ، مسعر اور بختری بن مختار نےیہ روایت ابو بکر بن عمارہ بن رویبہ سے سنی ، انھوں نے اپنے والد ( حضرت عمارہ بن رویبہ ثقفی ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، جَمِيعًا عَنْ وَكِيعٍ، قَالَ أَبُو كُرَيْبٍ: حَدَّثَنَا وَكِيعٌ، عَنِ ابْنِ أَبِي خَالِدٍ، وَمِسْعَرٍ، وَالْبَخْتَرِيِّ بْنِ الْمُخْتَارِ، سَمِعُوهُ مِنْ أَبِي بَكْرِ بْنِ عُمَارَةَ بْنِ رُؤَيْبَةَ، عَنْ أَبِيهِ، قَالَ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: «لَنْ يَلِجَ النَّارَ أَحَدٌ صَلَّى قَبْلَ طُلُوعِ الشَّمْسِ، وَقَبْلَ غُرُوبِهَا» - يَعْنِي الْفَجْرَ وَالْعَصْرَ -، فَقَالَ لَهُ رَجُلٌ مِنْ أَهْلِ الْبَصْرَةِ: آنْتَ سَمِعْتَ هَذَا مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ؟ قَالَ: نَعَمْ، قَالَ الرَّجُلُ: وَأَنَا أَشْهَدُ أَنِّي سَمِعْتُهُ مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، سَمِعَتْهُ أُذُنَايَ، وَوَعَاهُ قَلْبِي.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9001,
                "hadithNumber": "1437",
                "englishNarrator": "Umara bin Ruwaiba reported on the authority of his father:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: He who said prayer before the rising of the sun and its setting would not enter the fire (of Hell), and there was a man from Basra (sitting) beside him who said: Did you hear it from the Messenger of Allah (way peace be upon him)? He said: Yes, I bear witness to it. The man from Basra said: I bear witness that I did hear from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saying it from the place that you heard from him.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’ جو انسان سورج نکلنے اور اس کے غروب ہونے سے پہلے نماز پڑھتا ہے وہ آگ میں داخل نہیں ہو گا ۔ ‘ ‘ اور ان کے پاس بصرہ کا ایک باشندہ بھی موجود تھا ، اس نے پوچھا : کیا آپ نے یہ حدیث براہ راست نبی اکرم ﷺ سے سنی ؟ تو انھوں نے کہا : ہاں ، اور میں اس کی شہادت دیتا ہوں ۔ اس آدمی نے کہا : اور میں بھی شہادت دیتا ہوں کہ میں نے اسی جگہ ان کو یہ فرماتے ہوئے سنا جہاں آپ نے ان سے سنا تھا ۔",
                "urduNarrator": "مجھ سے یعقوب بن ابراہیم الدورقی نے بیان کیا، کہا ہم سے یحییٰ بن ابی بکر نے بیان کیا، کہا ہم سے شیبان نے بیان کیا,عبدالملک بن عمیر نے حضرت عمارۃ بن رویبہ کے بیٹے سے اور انھوں نے اپنے والد سے روایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنِي يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ، حَدَّثَنَا شَيْبَانُ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنِ ابْنِ عُمَارَةَ بْنِ رُؤَيْبَةَ، عَنْ أَبِيهِ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يَلِجُ النَّارَ مَنْ صَلَّى قَبْلَ طُلُوعِ الشَّمْسِ، وَقَبْلَ غُرُوبِهَا» وَعِنْدَهُ رَجُلٌ مِنْ أَهْلِ الْبَصْرَةِ، فَقَالَ: آنْتَ سَمِعْتَ هَذَا مِنَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ؟ قَالَ: نَعَمْ، أَشْهَدُ بِهِ عَلَيْهِ، قَالَ: وَأَنَا أَشْهَدُ، لَقَدْ سَمِعْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُهُ بِالْمَكَانِ الَّذِي سَمِعْتَهُ مِنْهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9002,
                "hadithNumber": "1438",
                "englishNarrator": "Abu Bakr ‌رضی ‌اللہ ‌عنہ reported on the authority of his father:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: He who observed two prayers at two cool (hours) would enter Paradise.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’جس نے دو ٹھنڈے وقتوں کی نمازیں ادا کیں ، وہ جنت میں داخل ہو گا ۔ ‘ ‘ ( دن کا ٹھنڈا وقت عصر کا اور رات کا سب سے ٹھنڈا وقت فجر کا ہوتا ہے ۔ )",
                "urduNarrator": "ہدّاب بن خالد ازدی نے کہا : ہمیں ہمام بن یحییٰ نے حدیث سنائی ، کہا : مجھے ابو جمرہ ضبعی نے ابوبکر ( بن ابی موسیٰ اشعری ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) سے حدیث سنائی اور انھوں نے اپنے والد سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ الْأَزْدِيُّ، حَدَّثَنَا هَمَّامُ بْنُ يَحْيَى، حَدَّثَنِي أَبُو جَمْرَةَ الضُّبَعِيُّ، عَنْ أَبِي بَكْرٍ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «مَنْ صَلَّى الْبَرْدَيْنِ دَخَلَ الْجَنَّةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9003,
                "hadithNumber": "1439",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated by the same chain of transmitters by Hammam, and said about Abu Bakr رضی اللہ عنہ that he was Ibn Abu Musa.",
                "hadithUrdu": "ہم سے ابن ابی عمر نے بیان کیا, بشر بن سریّ اور عمر و بن عاصم دونوں نے کہا : ہم سے ہمام نے اسی سند کے ساتھ حدیث بیان کی اور انھوں نے ابوبکر رضی اللہ عنہ کا نسب بیان کیا اور کہا : ابن ابی موسیٰ.",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ، ح قَالَ: وَحَدَّثَنَا ابْنُ خِرَاشٍ، حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ، قَالَا جَمِيعًا: حَدَّثَنَا هَمَّامٌ بِهَذَا الْإِسْنَادِ، وَنَسَبَا أَبَا بَكْرٍ، فَقَالَا: ابْنُ أَبِي مُوسَى.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9004,
                "hadithNumber": "1440",
                "englishNarrator": "Salama bin al-Akwa' ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to pray the evening prayer when the sun had set and disappeared (behind the horizon).",
                "hadithUrdu": "رسول اللہﷺ مغرب کی نماز اس وقت پڑھتے جب سورج غروب ہوتا اور پردے کی اوٹ میں چلا جاتا.",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ان سے حاتم نے جو کہ ابن اسماعیل ہیں، انہوں نے ہم سے یزید بن ابی عبید کی سند سے بیان کیا،حضرت سلمہ بن اکوع ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَاتِمٌ وَهُوَ ابْنُ إِسْمَاعِيلَ، عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ، عَنْ سَلَمَةَ بْنِ الْأَكْوَعِ: «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي الْمَغْرِبَ إِذَا غَرَبَتِ الشَّمْسُ، وَتَوَارَتْ بِالْحِجَابِ».",
                "headingArabic": "بَيَانِ أَنَّ أَوَّلَ وَقْتِ الْمَغْرِبِ عِنْدَ غُرُوبِ الشَّمْسِ",
                "headingUrdu": "مغرب کے وقت کا آغاز جب سورج غروب ہو۔",
                "headingEnglish": "The beginning of the time for Maghrib when the sun sets",
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9005,
                "hadithNumber": "1441",
                "englishNarrator": "Rafi' bin Khadij رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "We used to observe the evening prayer with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and then one of us would go away and he could see the (distant) place where his arrow would fall.",
                "hadithUrdu": "ہم رسول اللہ ﷺ کے ساتھ مغرب کی نماز پڑھتے تو ہم میں سے کوئی شخص لوٹتا اور وہ اپنے تیر کے گرنے کی جگہیں دیکھ سکتا تھا ۔",
                "urduNarrator": "ہم سے محمد بن مہران الرازی نے بیان کیا, ولید بن مسلم نے کہا : ہم سے اوزاعی نے حدیث بیان کی ، کہا : ہم سے ابو نجاشی نے حدیث بیان کی ، کہا : میں نے حضرت رافع بن خدیج ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنا ، کہہ رہے تھے",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ مِهْرَانَ الرَّازِيُّ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا الْأَوْزَاعِيُّ، حَدَّثَنِي أَبُو النَّجَاشِيِّ، قَالَ: سَمِعْتُ رَافِعَ بْنَ خَدِيجٍ، يَقُولُ: «كُنَّا نُصَلِّي الْمَغْرِبَ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَيَنْصَرِفُ أَحَدُنَا، وَإِنَّهُ لَيُبْصِرُ مَوَاقِعَ نَبْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9006,
                "hadithNumber": "1442",
                "englishNarrator": "A hadith like this, i. e. We used to observe evening prayer.... so on and so forth, has been narrated by Rafi' bin Khadij رضی ‌اللہ ‌عنہ ‌by another chain of transmitters:",
                "hadithEnglish": "We used to pray Maghrib...\" a similar Hadith (as no. 1441).",
                "hadithUrdu": "ہم مغرب کی نماز ادا کر تے ۔ ۔ ۔ ( آگے ) پچھلی حدیث کی طرح ہے ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم الحنظَلی نے بیان کیا، انہوں نے کہا, شعیب بن اسحاق دمشقی نے اوزاعی سے سابقہ سند کےساتھ رافع بن خدیج ‌رضی ‌اللہ ‌عنہ ‌ ‌ سےحدیث بیان کی ، کہا",
                "hadithArabic": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا شُعَيْبُ بْنُ إِسْحَاقَ الدِّمَشْقِيُّ، حَدَّثَنَا الْأَوْزَاعِيُّ، حَدَّثَنِي أَبُو النَّجَاشِيِّ، حَدَّثَنِي رَافِعُ بْنُ خَدِيجٍ، قَالَ: كُنَّا نُصَلِّي الْمَغْرِبَ بِنَحْوِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9007,
                "hadithNumber": "1443",
                "englishNarrator": "A'isha the wife of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) deferred one night the 'Isya' prayer. And this is called 'Atama. And the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) did not come out till Umar bin Khattab رضی اللہ عنہ told (him) that the women and children had gone to sleep. So the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came out towards them and said to the people of the mosque: None except you from the people of the earth waits for it (for the night prayer at this late hour), and it was before Islam had spread amongst people. And in the narration transmitted by Ibn Shihab the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) is reported to have said: It is not meant that you should compel the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) for prayer. And (this he said) when 'Umar bin Khattab رضی اللہ عنہ called (the Holy Prophet) in a loud voice.",
                "hadithUrdu": "ایک رات رسول اللہ ﷺ نے عشاء کی نماز خوب اندھیرا ہونے تک مؤخر فرمائی اور اسی نماز کو عتمہ ( گہری تاریکی کے وقت کی نماز ) کہا جاتا تھا ۔ رسول اللہﷺ ( اس وقت تک ) گھر سے نہ نکلے یہاں تک کہ حضرت عمربن خطاب ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : ( مسجد میں آنے والی ) عورتیں اور بچے سو گئے ہیں ۔ اس پر رسول اللہ ﷺ باہر تشریف لائے اور نکل کر مسجد کے حاضرین سے فرمایا : ’’اہل زمین میں سے تمھارے سوا اس نماز کا اور کوئی بھی انتظار نہیں کررہا ‘ ‘ اور یہ لوگوں میں ( مدینہ سے باہر ) اسلام پھیلنے سے پہلے کی بات ہے ۔ حرملہ نے اپنی روایت میں اضافہ کیا کہ ابن شہاب نے کہا : مجھے بتایا گیا کہ رسول اللہ ﷺ نے فرمایا : ’’تمھارے لیے مناسب نہ تھا کہ تم اللہ کے رسول ﷺ سے نماز کے لیے اصرار کرتے ۔ ‘ ‘ یہ تب ہوا جب عمر بن خطاب ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے بلند آواز سے پکارا ۔ ( انھوں نے غالباً یہ سمجھا کہ آپ ﷺ بھول گئے ہیں یا سو گئے ہیں",
                "urduNarrator": "عمرو بن سوّاد عامری اور حرملہ بن یحییٰ دونوں نے کہا : ہمیں ابن وہب نے خبر دی ، انھوں نے کہا : مجھے یونس نےخبر دی کہ انھیں ابن شہاب نے خبر دی ، کہا : مجھے عروہ بن زبیر نے خبر دی کہ نبی اکرم ﷺ کی زوجہ حضرت عائشہ رضی اللہ عنہا نے کہا",
                "hadithArabic": "وَحَدَّثَنَا عَمْرُو بْنُ سَوَّادٍ الْعَامِرِيُّ، وَحَرْمَلَةُ بْنُ يَحْيَى، قَالَا: أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، أَنَّ ابْنَ شِهَابٍ، أَخْبَرَهُ، قَالَ: أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَتْ: أَعْتَمَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لَيْلَةً مِنَ اللَّيَالِي بِصَلَاةِ الْعِشَاءِ، وَهِيَ الَّتِي تُدْعَى الْعَتَمَةَ، فَلَمْ يَخْرُجْ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حَتَّى قَالَ عُمَرُ بْنُ الْخَطَّابِ: نَامَ النِّسَاءُ وَالصِّبْيَانُ، فَخَرَجَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ لِأَهْلِ الْمَسْجِدِ حِينَ خَرَجَ عَلَيْهِمْ: «مَا يَنْتَظِرُهَا أَحَدٌ مِنْ أَهْلِ الْأَرْضِ غَيْرُكُمْ»، وَذَلِكَ قَبْلَ أَنْ يَفْشُوَ الْإِسْلَامُ فِي النَّاسِ زَادَ حَرْمَلَةُ فِي رِوَايَتِهِ، قَالَ ابْنُ شِهَابٍ: وَذُكِرَ لِي أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: وَمَا كَانَ لَكُمْ أَنَّ تَنْزُرُوا رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى الصَّلَاةِ، وَذَاكَ حِينَ صَاحَ عُمَرُ بْنُ الْخَطَّابِ،",
                "headingArabic": "عشاء کا وقت اور اس میں تاخیر",
                "headingUrdu": "عشاء کا وقت اور اس میں تاخیر",
                "headingEnglish": "The time of `Isha and delaying it",
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9008,
                "hadithNumber": "1444",
                "englishNarrator": "A hadith like this has been narrated by Ibn Shihab with the same chain of transmitters, but therein no mention has been made of the words of al-Zuhri:",
                "hadithEnglish": "It was narrated to me, and that which followed.",
                "hadithUrdu": "وذکرلی ( مجھے بتایا گیا ) اور اس کے بعد کا حصہ بیان نہیں کیا ۔",
                "urduNarrator": "مجھ سے عبدالملک بن شعیب بن لیث نے بیان کیا، میرے والد نے مجھ سے میرے دادا کی سند سے بیان کیا, عقیل نے ابن شہاب سے اسی سنج کے ساتھ مذکورہ بالا روایت بیان کی لیکن اس میں زہر ی کا قول",
                "hadithArabic": "وَحَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ بِهَذَا الْإِسْنَادِ مِثْلَهُ، وَلَمْ يَذْكُرْ قَوْلَ الزُّهْرِيِّ، وَذُكِرَ لِي وَمَا بَعْدَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9009,
                "hadithNumber": "1445",
                "englishNarrator": "A'isha ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) one night delayed (observing the 'Isya' prayer) till a great part of the night was over and the people in the mosque had gone to sleep. He (the Holy Prophet) then came out and observed prayer and said: This is the proper time for it; were it not that I would impose a burden on my people (I would normally pray at this time). In the hadith transmitters by 'Abdul-Razzaq (the words are): Were it not that it would impose burden on my people.",
                "hadithUrdu": "ایک رات نبی اکرم ﷺ ےعشاء کی نماز میں دیر کر دی یہاں تک کہ رات کا بڑا حصہ گزر گیا اور اہل مسجد سو گئے ، پھر آپ باہر تشریف لے گئے ، نماز پڑھائی اور فرمایا : ’’ اگر ( مجھے ) یہ ( ڈر ) نہ ہوتا کہ میں اپنی امت کو مشقت میں ڈالوں گا تو یہی اس کا ( بہترین ) وقت ہے ۔ ‘ ‘ اور عبدالرزاق کی حدیث میں ہے : ’’ اگریہ ( ڈر ) نہ ہوتا کہ یہ میری امت کے لیے مشقت کا سبب بنے گا ۔ ‘ ‘",
                "urduNarrator": "مجھ سے اسحاق بن ابراہیم اور محمد بن حاتم نے کہا, محمد بن بکر ، حجاج بن محمد اور عبدالرزاق ۔ سب کے الفاظ باہم ملتے جلتے ہیں ۔ سب نے کہا : ابن جریج سے روایت ہے ، انھوں نے کہا : مجھے مغیرہ بن حکیم نے ام کلثوم بنت ابی بکر سے خبر دی کہ انھوں نے انھیں ( مغیرہ کو ) حضرت عائشہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کرتے ہوئے خبر دی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ حَاتِمٍ، كِلَاهُمَا عَنْ مُحَمَّدِ بْنِ بَكْرٍ، ح قَالَ: وَحَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللهِ، حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، ح قَالَ: وَحَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ، وَمُحَمَّدُ بْنُ رَافِعٍ، قَالَا: حَدَّثَنَا عَبْدُ الرَّزَّاقِ، وَأَلْفَاظُهُمْ مُتَقَارِبَةٌ، قَالُوا جَمِيعًا: عَنِ ابْنِ جُرَيْجٍ، قَالَ: أَخْبَرَنِي الْمُغِيرَةُ بْنُ حَكِيمٍ، عَنْ أُمِّ كُلْثُومٍ بِنْتِ أَبِي بَكْرٍ، أَنَّهَا أَخْبَرَتْهُ عَنْ عَائِشَةَ، قَالَتْ: أَعْتَمَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ذَاتَ لَيْلَةٍ حَتَّى ذَهَبَ عَامَّةُ اللَّيْلِ، وَحَتَّى نَامَ أَهْلُ الْمَسْجِدِ، ثُمَّ خَرَجَ فَصَلَّى، فَقَالَ: «إِنَّهُ لَوَقْتُهَا لَوْلَا أَنْ أَشُقَّ عَلَى أُمَّتِي» وَفِي حَدِيثِ عَبْدِ الرَّزَّاقِ: «لَوْلَا أَنْ يَشُقَّ عَلَى أُمَّتِي.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9010,
                "hadithNumber": "1446",
                "englishNarrator": "Abdullah bin Umar ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "We waited one night in expectation of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) for the last prayer of the night, and he came out to us when a third of the night had passed even after that. We do not know whether he had been occupied with family business or something else. When he came cut he said: You are waiting for prayer, for which the followers of no other religion wait. except you. Were it not a burden for my Ummah, I would have led them (in the 'Isya' prayer) at this hour. He then ordered the Mu'adhdin (to call for prayer) and then stood up for prayer and observed prayer.",
                "hadithUrdu": "ایک رات ہم عشاء کی آخری نماز کے لیے رسول اللہ ﷺ کا انتظار کرتے رہے ، جب رات کا تہائی حصہ گزر گیا یا اس کے ( بھی ) بعد آپ تشریف لائے ، ہمیں معلوم نہیں کہ آپ کو گھر والوں ( کے معاملے ) میں کسی چیز نے مشغول رکھا تھا یا کوئی اور بات بھی ، جب آپ باہر آئے تو فرمایا : ’’بلا شبہ تم ایسی نماز کا انتظار کررہے ہو جسکا تمھارے سوا کسی اور دین کے پیرو کار انتظار نہیں کر رہے ، اور اگر مجھے یہ ڈر نہ ہوتا کہ یہ میری امت کے لیے گراں ہو گا تو میں انھیں اسی گھڑی میں ( یہ ) نماز پڑھایا کرتا ۔ ‘ ‘ پھر آپ نے مؤذن کو حکم دیا ، اس نے اقامت کہی اور آب نے نماز پڑھائی ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب اور اسحاق بن ابراہیم نے بیان کیا، انہوں نے کہا: ہم سے انہوں نے بیان کیا، اور زہیر نے کہا: ہم سے جریر نے منصور سے بیان کیا, حکم نےنافع سے اور انھوں نے حضرت عبداللہ بن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ إِسْحَاقُ: أَخْبَرَنَا، وَقَالَ زُهَيْرٌ: حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنِ الْحَكَمِ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللهِ بْنِ عُمَرَ، قَالَ: مَكَثْنَا ذَاتَ لَيْلَةٍ نَنْتَظِرُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِصَلَاةِ الْعِشَاءِ الْآخِرَةِ، فَخَرَجَ إِلَيْنَا حِينَ ذَهَبَ ثُلُثُ اللَّيْلِ، أَوْ بَعْدَهُ، فَلَا نَدْرِي أَشَيْءٌ شَغَلَهُ فِي أَهْلِهِ، أَوْ غَيْرُ ذَلِكَ، فَقَالَ حِينَ خَرَجَ: «إِنَّكُمْ لَتَنْتَظِرُونَ صَلَاةً مَا يَنْتَظِرُهَا أَهْلُ دِينٍ غَيْرُكُمْ، وَلَوْلَا أَنْ يَثْقُلَ عَلَى أُمَّتِي لَصَلَّيْتُ بِهِمْ هَذِهِ السَّاعَةَ»، ثُمَّ أَمَرَ الْمُؤَذِّنَ فَأَقَامَ الصَّلَاةَ، وَصَلَّى.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9011,
                "hadithNumber": "1447",
                "englishNarrator": "Abdullah bin 'Umar رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was one night occupied (in some work) and he delayed it ('Isya' prayer) till we went to sleep in the mosque. We then woke up and again went to sleep and again woke up. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) then came to us and said: None among the people of the earth except you waits for prayer in the night.",
                "hadithUrdu": "ایک رات رسول اللہ ﷺ ( کسی بنا پر ) اس ( عشاء کی نماز ) سے مشغول ہو گئے ، آپ نے اسے مؤخر کر دیا یہاں تک کہ ہم مسجد میں سو گئے ، پھر بیدار ہوئے ، پھر سو گئے ، پھر بیدار ہوئے ، پھر آپ ( گھر سے ) نکل کر ہمارے پاس تشریف لائے اور فرمایا : ’’آج رات تمھارے سوا اہل زمین میں سے کوئی نہیں جو نماز کا انتظار کر رہا ہو ۔ ‘ ‘",
                "urduNarrator": "مجھ سے محمد بن رافع نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا,ہمیں ابن جریج نے خبر دی ، کہا : مجھے نافع نے خبر دی ، انھوں نے کہا : ہم سے حضرت عبد اللہ بن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے حدیث بیان کی کہ",
                "hadithArabic": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي نَافِعٌ، حَدَّثَنَا عَبْدُ اللهِ بْنُ عُمَرَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ شُغِلَ عَنْهَا لَيْلَةً، فَأَخَّرَهَا حَتَّى رَقَدْنَا فِي الْمَسْجِدِ، ثُمَّ اسْتَيْقَظْنَا، ثُمَّ رَقَدْنَا، ثُمَّ اسْتَيْقَظْنَا، ثُمَّ خَرَجَ عَلَيْنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، ثُمَّ قَالَ: «لَيْسَ أَحَدٌ مِنْ أَهْلِ الْأَرْضِ اللَّيْلَةَ يَنْتَظِرُ الصَّلَاةَ غَيْرُكُمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9012,
                "hadithNumber": "1448",
                "englishNarrator": "Thabit reported:",
                "hadithEnglish": "They (the believers) asked Anas ‌رضی ‌اللہ ‌عنہ ‌about the ring of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and he said: One night the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) delayed (observing) the 'Isya' prayer up to the midnight or midnight was about to be over. He then came and said: (Other) people have offered prayers and slept, but you are constantly in prayer as long as you wait for prayer. Anas ‌رضی ‌اللہ ‌عنہ ‌said: I perceive as if I am seeing the lustre of his silver ring, and lifted his, small left finger (in order to show how the Prophet had lifted it).",
                "hadithUrdu": "انھوں نے حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے رسول اللہ ﷺ یک مہر ( یا انگوٹھی ) کے بارے میں پوچھا تو ( حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ) کہا : ایک رات رسول اللہ ﷺ نے عشاء کی نماز آدھی رات تک مؤخر کی یا آدھی رات گزرنےکو تھی ، پھر آپ تشریف لائے اور فرمایا : ’’بلاشبہ ( دوسرے ) لوگوں نے نماز پڑھ لی اور سوچکے ، اور تم ہو کہ نماز ہی میں ہو جب تک نماز کے انتظار میں بیٹھے ہو ۔ ‘ ‘ حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے بتایا : جیسے میں ( اب بھی ) آپ کی چاندی سے بنی انگوٹھی کی چمک دیکھ رہا ہوں اور انھوں نے بائیں ہاتھ کی انگلی اٹھاتے ہوئے چھوٹی انگلی سے ( اشارہ کیاکہ انگوٹھی اس میں تھی ۔ )",
                "urduNarrator": "مجھ سے ابوبکر بن نافع العبدی نے بیان کیا، ہم سے بہز بن اسد العمی نے بیان کیا، ہم سے حماد بن سلمہ نے بیان کیا، ثابت سے روایت ہےکہ",
                "hadithArabic": "وَحَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ الْعَبْدِيُّ، حَدَّثَنَا بَهْزُ بْنُ أَسَدٍ الْعَمِّيُّ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، أَنَّهُمْ سَأَلُوا أَنَسًا عَنْ خَاتَمِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: أَخَّرَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الْعِشَاءَ ذَاتَ لَيْلَةٍ إِلَى شَطْرِ اللَّيْلِ، أَوْ كَادَ يَذْهَبُ شَطْرُ اللَّيْلِ، ثُمَّ جَاءَ، فَقَالَ: «إِنَّ النَّاسَ قَدْ صَلَّوْا، وَنَامُوا، وَإِنَّكُمْ لَمْ تَزَالُوا فِي صَلَاةٍ مَا انْتَظَرْتُمُ الصَّلَاةَ»، قَالَ أَنَسٌ: كَأَنِّي أَنْظُرُ إِلَى وَبِيصِ خَاتَمِهِ مِنْ فِضَّةٍ، وَرَفَعَ إِصْبَعَهُ الْيُسْرَى بِالْخِنْصِرِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9013,
                "hadithNumber": "1449",
                "englishNarrator": "Anas bin Malik ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "We waited for the Messenger of Allah (ﷺ) one night, till it was about midnight. He (the Holy Prophet) came and observed prayer and then turned his face towards us, as it I was seeing the lustre of the silver ring on his finger.",
                "hadithUrdu": "ہم نے ایک رات رسول اللہ ﷺ کا انتظار کیا حتی کہ آدھی رات کے قریب ( کا وقت ) ہوگیا ، پھر آپ آئے اور نماز پڑھائی ۔ پھر آپ نے ہمارے طرف رخ فرمایا ، ایسا لگتا ہے کہ میں ( اب بھی ) آپ کی انگوٹھی کی چمک دیکھ رہا ہوں ، وہ آپ کے ہاتھ میں تھی ، چاندی کی بنی ہوئی تھی.",
                "urduNarrator": "حجاج بن الشاعر نے مجھ سے کہا, ابوزید سعید بن ربیع نے ہمیں حدیث بیان کی ، کہا : ہمیں قرہ بن خالد نے قتادہ سےحدیث سنائی ، انھوں نے حضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا أَبُو زَيْدٍ سَعِيدُ بْنُ الرَّبِيعِ، حَدَّثَنَا قُرَّةُ بْنُ خَالِدٍ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ: «نَظَرْنَا رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لَيْلَةً حَتَّى كَانَ قَرِيبٌ مِنْ نِصْفِ اللَّيْلِ، ثُمَّ جَاءَ فَصَلَّى، ثُمَّ أَقْبَلَ عَلَيْنَا بِوَجْهِهِ، فَكَأَنَّمَا أَنْظُرُ إِلَى وَبِيصِ خَاتَمِهِ فِي يَدِهِ مِنْ فِضَّةٍ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 8701,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=348",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=346",
                "label": "346",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=347",
                "label": "347",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=348",
                "label": "348",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=349",
                "label": "349",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=350",
                "label": "350",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=351",
                "label": "351",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=352",
                "label": "352",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=350",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=350",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=348",
        "to": 8725,
        "total": 40465
    }
}