{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 516,
        "data": [
            {
                "id": 13164,
                "hadithNumber": "5601",
                "englishNarrator": "Samura bin Jundub رضی اللہ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah (ﷺ) said: The dearest phrases to Allah are four: Subhan Allah (Hallowed be Allah), Al-Hamdulillah (Praise be to Allah), La ilaha illa-Allah (There is no deity but Allah), Allahu Akbar (Allah is Greater). There is no harm for you in which of them begin with (while remembering Allah). And do not give these names to your servants: Yasar and Rabah and Najih and Aflah. \"There are only four, and do not ask me any more.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”سب سے زیادہ پسند اللہ تعالیٰ کو چار کلمے ہیں «سُبْحَانَ اللهِ، وَالْحَمْدُ لِلَّهِ، وَلاَ إِلَهَ إِلاَّ اللَّهُ، وَاللَّهُ أَكْبَرُ» ان میں سے جس کو چاہے پہلے کہے کوئی نقصان نہ ہو گا اور اپنے غلام کا نام یسار، رباح اور نجیح (اس کے وہی معنی ہیں جو افلح کے ہیں) اور افلح نہ رکھو۔ اس لیے کہ تو پوچھے گا وہاں وہ ہے (یعنی یسار یا رباح یا نجیح یا افلح) وہ کہے گا نہیں ہے۔“ سمرہ نے کہا: رسول اللہ صلی اللہ علیہ وسلم نے یہی چار نام فرمائے۔ تو زیادہ مت نقل کرنا مجھ سے۔",
                "urduNarrator": "ہم سے احمد بن عبداللہ بن یونس نے بیان کیا، ہم سے زہیر نے بیان کیا، ہم سے منصور نے بیان کیا، ان سے ہلال بن یصف نے، ربیع بن امیہ کی سند سے, ‏‏‏‏ سیدنا سمرہ بن جندب رضی اللہ عنہ سے روایت ہے،",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا مَنْصُورٌ عَنْ هِلَالِ بْنِ يَسَافٍ عَنْ رَبِيعِ بْنِ عُمَيْلَةَ عَنْ سَمُرَةَ بْنِ جُنْدَبٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحَبُّ الْكَلَامِ إِلَى اللَّهِ أَرْبَعٌ سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ لَا يَضُرُّكَ بِأَيِّهِنَّ بَدَأْتَ وَلَا تُسَمِّيَنَّ غُلَامَكَ يَسَارًا وَلَا رَبَاحًا وَلَا نَجِيحًا وَلَا أَفْلَحَ فَإِنَّكَ تَقُولُ أَثَمَّ هُوَ فَلَا يَكُونُ فَيَقُولُ لَا إِنَّمَا هُنَّ أَرْبَعٌ فَلَا تَزِيدُنَّ عَلَيَّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13165,
                "hadithNumber": "5602",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been reported on the authority of Shu'ba and there is no mention but of the fact about giving the name to the servant and there is no mention of the four expressions (of remembrance) and he did not mention the four words",
                "hadithUrdu": "ہم سے اسحاق بن ابراہیم نے بیان کیا, جریر ، روح بن قاسم اورشعبہ سب نے منصور سے زہیر کی سند کے ساتھ حدیث بیان کی ، جریر اورروح کی حدیث قصے سمیت زہیر کی حدیث جیسی ہے ۔ اورجوشعبہ کی حدیث ہے ۔ اس میں صرف غلام کانام رکھنے کا ذکر ہے ، انھوں نے \" چار بہترین کلمات \" کاذ کر نہیں کیا ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنِي جَرِيرٌ ح و حَدَّثَنِي أُمَيَّةُ بْنُ بِسْطَامٍ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا رَوْحٌ وَهُوَ ابْنُ الْقَاسِمِ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ كُلُّهُمْ عَنْ مَنْصُورٍ بِإِسْنَادِ زُهَيْرٍ فَأَمَّا حَدِيثُ جَرِيرٍ وَرَوْحٍ فَكَمِثْلِ حَدِيثِ زُهَيْرٍ بِقِصَّتِهِ وَأَمَّا حَدِيثُ شُعْبَةَ فَلَيْسَ فِيهِ إِلَّا ذِكْرُ تَسْمِيَةِ الْغُلَامِ وَلَمْ يَذْكُرْ الْكَلَامَ الْأَرْبَعَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13166,
                "hadithNumber": "5603",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) decided to forbid (his followers) to name persons as Ya'la (Elevated), Baraka (Blessing), Aflah (Successful), Yasar and Nafi', but I saw that he kept silent after that and he did not say anything until Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) died. And he did not forbid (his followers to do this), then 'Umar رضی اللہ عنہ decided to prohibit (people) from giving these names, but later on gave up the idea.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ارادہ فرمایا کہ آپ یعلیٰ ( بلند ) ، برکت ، افلح ، یساراور نافع جیسے نام رکھنے سے منع فرمادیں ، پھرمیں نے دیکھا کہ آپ خاموش ہوگئے ، پھر آپ کی رحلت ہوئی تو آپ نے ان ناموں سے نہیں روکا تھا ، پھر حضرت عمر رضی اللہ عنہ نے ان سے روکنے کا ا رادہ نہیں کیاتو انھوں نے بھی ( یہ ارادہ ) ترک کردیا ۔",
                "urduNarrator": "ہم سے محمد بن احمد بن ابی خلف نے بیان کیا، ہم سے ایک روح نے بیان کیا, ابن جریج نے کہا : مجھے ابو زبیر نے بتایا کہ انھوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ کو یہ کہتے ہوئے سنا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ حَدَّثَنَا رَوْحٌ حَدَّثَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ أَرَادَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَنْهَى عَنْ أَنْ يُسَمَّى بِيَعْلَى وَبِبَرَكَةَ وَبِأَفْلَحَ وَبِيَسَارٍ وَبِنَافِعٍ وَبِنَحْوِ ذَلِكَ ثُمَّ رَأَيْتُهُ سَكَتَ بَعْدُ عَنْهَا فَلَمْ يَقُلْ شَيْئًا ثُمَّ قُبِضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يَنْهَ عَنْ ذَلِكَ ثُمَّ أَرَادَ عُمَرُ أَنْ يَنْهَى عَنْ ذَلِكَ ثُمَّ تَرَكَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13167,
                "hadithNumber": "5604",
                "englishNarrator": "Ibn 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) changed the name of 'Asiya (Disobedient) and said: You are Jamila (i.e. good and handsome). Ahmad (one of the narrators) narrated it with a slight variation of wording.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے عاصیہ ( نافرمانی کرنے والی ) کانام تبدیل کردیا اور فرمایا : \"\" تم جمیلہ ( خوبصورت ) ہو ۔ \"\" احمد نے \"\" مجھے خبر دی \"\" کی جگہ \"\" سے روایت ہے ۔ \"\" کہا ہے ۔",
                "urduNarrator": "احمد بن حنبل ، زہیر بن حرب ، محمد بن مثنیٰ ، عبیداللہ بن سعید اور محمد بن بشار نے ( ان سب نے ) کہا : ہمیں یحییٰ بن سعید نے عبیداللہ سے حدیث بیان کی ، کہا : مجھے نافع نے حضرت ابن عمر رضی اللہ عنہ سے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ وَزُهَيْرُ بْنُ حَرْبٍ وَمُحَمَّدُ بْنُ الْمُثَنَّى وَعُبَيْدُ اللَّهِ بْنُ سَعِيدٍ وَمُحَمَّدُ بْنُ بَشَّارٍ قَالُوا حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ أَخْبَرَنِي نَافِعٌ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَيَّرَ اسْمَ عَاصِيَةَ وَقَالَ أَنْتِ جَمِيلَةُ قَالَ أَحْمَدُ مَكَانَ أَخْبَرَنِي عَنْ.",
                "headingArabic": "اسْتِحْبَابِ تَغْيِيرِ الِاسْمِ الْقَبِيحِ إِلَى حَسَنٍ وَتَغْيِيرِ اسْمِ بَرَّةَ إِلَى زَيْنَبَ وَجُوَيْرِيَةَ وَنَحْوِهِمَا",
                "headingUrdu": "برے ناموں کو بدل کر اچھے نام رکھنا اور برہ کا نام بدل کر زینب، جویریہ وغیرہ رکھنا مستحب ہے۔",
                "headingEnglish": "It Is Recommended To Change Bad Names To Good Names, And To Change The Name Barrah To Zainab, Juwayriyah And The Like",
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13168,
                "hadithNumber": "5605",
                "englishNarrator": "Ibn 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "'Umar رضی اللہ عنہ had a daughter who was called 'Asiya. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) gave her the name of Jamila.",
                "hadithUrdu": "حضرت عمر رضی اللہ تعالیٰ عنہ کی ایک صاحبزادی کو عاصیہ کہا جاتاتھا ، تو رسول اللہ صلی اللہ علیہ وسلم نےاس کانام جمیلہ رکھا دیا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے حسن بن موسیٰ نے بیان کیا, حماد بن سلمہ نے عبیداللہ سے ، انھوں نے نافع سے ، انھوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ ابْنَةً لِعُمَرَ كَانَتْ يُقَالُ لَهَا عَاصِيَةُ فَسَمَّاهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَمِيلَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13169,
                "hadithNumber": "5606",
                "englishNarrator": "Ibn Abbas رضی اللہ  عنہ reported:",
                "hadithEnglish": "The name of Juwairiya رضی اللہ عنہا (the wife of the Holy Prophet ﷺ) was Barra (Pious). Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) changed her name to Juwairiya and said: I did not like that it should be said: He had come out from Barra (Pious). The hadith transmitted on the authority of Ibn Abi 'Umar is slightly different from it.",
                "hadithUrdu": "( پہلے ام المومنین حضرت ) جویریہ رضی اللہ عنہا کا نام \" برہ \" تھا تو رسول اللہ صلی اللہ علیہ وسلم نے ان کا نام بدل کر جویریہ رکھ دیا ۔ آپ کو پسند نہ تھا ۔ کہ اس طرح کہا جائے کہ آپ برہ ( نیکیوں و الی ) کے ہاں سے نکل گئے ۔ ابن ابی عمر کی حدیث میں ہے : کریب سے روایت ہے ، کہا : میں نے ابن عباس رضی اللہ تعالیٰ عنہ سے سنا ۔",
                "urduNarrator": "عمرو ناقد اور ابن ابی عمر نے حدیث بیان کی ۔ الفاظ عمرو کے ہیں ۔ دونوں نے کہا : ہمیں سفیان نے آل طلحہ کے آزاد کردہ غلام محمد بن عبدالرحمان سے حدیث بیان کی ، انھوں نے کریب سے ، انھوں نے حضرت ابن عباس رضی اللہ  عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا عَمْرٌو النَّاقِدُ وَابْنُ أَبِي عُمَرَ وَاللَّفْظُ لِعَمْرٍو قَالَا حَدَّثَنَا سُفْيَانُ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ مَوْلَى آلِ طَلْحَةَ عَنْ كُرَيْبٍ عَنْ ابْنِ عَبَّاسٍ قَالَ كَانَتْ جُوَيْرِيَةُ اسْمُهَا بَرَّةُ فَحَوَّلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْمَهَا جُوَيْرِيَةَ وَكَانَ يَكْرَهُ أَنْ يُقَالَ خَرَجَ مِنْ عِنْدَ بَرَّةَ وَفِي حَدِيثِ ابْنِ أَبِي عُمَرَ عَنْ كُرَيْبٍ قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13170,
                "hadithNumber": "5607",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "The name of Zainab was Barra. It was said of her: She presents herself to be innocent. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) gave her the name of Zainab.",
                "hadithUrdu": "حضرت زینب ( بنت ام سلمہ رضی اللہ تعالیٰ عنہا ) کا نام برہ تھا تو کہا گیا کہ وہ ( نام بتاتے وقت خود ) اپنی پارسائی بیان کرتی ہیں ، تو رسول اللہ صلی اللہ علیہ وسلم نے ان کا نام زینب رکھ دیا ۔ حدیث کے الفاظ ابن بشار کے علاوہ باقی سب کے ( بیان کردہ ) ہیں ۔ ابن ابی شیبہ نے کہا : ہمیں محمد بن جعفر نے شعبہ سے حدیث بیان کی ۔",
                "urduNarrator": "ابو بکر بن ابی شیبہ ، محمد بن مثنیٰ اورمحمد بن بشار نے کہا ,  ہمیں محمد بن جعفر نے حدیث بیان کی ، محمد بن جعفر اورعبیداللہ کے والد معاذ نے شعبہ سے ، انھوں نے عطاء بن ابی میمونہ سے ، انھوں نے ابو رافع سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ قَالُوا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ عَطَاءِ بْنِ أَبِي مَيْمُونَةَ سَمِعْتُ أَبَا رَافِعٍ يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ ح و حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ عَطَاءِ بْنِ أَبِي مَيْمُونَةَ عَنْ أَبِي رَافِعٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ زَيْنَبَ كَانَ اسْمُهَا بَرَّةَ فَقِيلَ تُزَكِّي نَفْسَهَا فَسَمَّاهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَيْنَبَ وَلَفْظُ الْحَدِيثِ لِهَؤُلَاءِ دُونَ ابْنِ بَشَّارٍ و قَالَ ابْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ عَنْ شُعْبَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13171,
                "hadithNumber": "5608",
                "englishNarrator": "Zainab, daughter of Umm Salama رضی اللہ عنہا reported:",
                "hadithEnglish": "My name first was Barra. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) gave me the name of Zainab رضی اللہ عنہا. Then there entered (into the house of Allah's Prophet as a wife) Zainab, daughter of Jahsh, and her name was also Barra, and he gave her the name of Zainab.",
                "hadithUrdu": "میرا نام برہ تھا ، تو رسول اللہ صلی اللہ علیہ وسلم نے میرا نام زینب رکھ دیا ۔ انھوں نے کہا : جب زینب بنت جحش رضی اللہ عنہا آپ کے حبالہ عقد میں داخل ہوئیں تو ان کا نام بھی برہ تھا ، تو آپ صلی اللہ علیہ وسلم نے ان کا نام بھی زینب رکھا ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے عیسیٰ بن یونس نے بیان کیا، کہا ہم سے ابو کریب نے بیان کیا، ہم سے ابو اسامہ نے بیان کیا، انہوں نے کہا: ولید بن کثیر نے کہا : مجھے محمد بن عمرو بن عطاء نے حدیث بیان کی ، کہا : مجھے حضرت زینب بنت ام سلمہ رضی اللہ عنہا نے بتایا ، کہا",
                "hadithArabic": "حَدَّثَنِي إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ ح و حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو أُسَامَةَ قَالَا حَدَّثَنَا الْوَلِيدُ بْنُ كَثِيرٍ حَدَّثَنِي مُحَمَّدُ بْنُ عَمْرِو بْنِ عَطَاءٍ حَدَّثَتْنِي زَيْنَبُ بِنْتُ أُمِّ سَلَمَةَ قَالَتْ كَانَ اسْمِي بَرَّةَ فَسَمَّانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَيْنَبَ قَالَتْ وَدَخَلَتْ عَلَيْهِ زَيْنَبُ بِنْتُ جَحْشٍ وَاسْمُهَا بَرَّةُ فَسَمَّاهَا زَيْنَبَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13172,
                "hadithNumber": "5609",
                "englishNarrator": "Muhammad bin 'Amr bin 'Ata' reported:",
                "hadithEnglish": "I had given the name Barra to my daughter. Zainab, daughter of Abu Salama رضی اللہ عنہا told me that Allah's' Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had forbidden me to give this name. (She said): I was also called Barra, but Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Don't hold yourself to be pious. It is God alone who knows the people of piety among you. They (the Companions) said: Then, what name should we give to her? He said: Name her as Zainab.",
                "hadithUrdu": "میں نے اپنی بیٹی کانام برہ رکھا تو حضرت زینب بنت ابی سلمہ رضی اللہ عنہا نے مجھ سے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے یہ نام رکھنے سے منع فرمایا ہے ۔ اور ( بتایا کہ ) میرا نام بھی پہلے برہ رکھا گیا رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" تم لوگ اپنی پارسائی بیان کرو اللہ تعالیٰ ہی خوب جانتا ہے کہ تم میں سے نیکو کار کون ہے ۔ \"\" ( گھرکے ) لوگوں نے کہا : پھر ہم اس کا کیا نام رکھیں؟آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" اس کا نام زینب رکھ دو ۔",
                "urduNarrator": "ہم سے عمرو الناقد نے بیان کیا، کہا ہم سے ہاشم بن القاسم نے بیان کیا، ہم سے لیث نے بیان کیا, یزید بن ابی حبیب نے محمد بن عمرو بن عطاء سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا عَمْرٌو النَّاقِدُ حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ قَالَ سَمَّيْتُ ابْنَتِي بَرَّةَ فَقَالَتْ لِي زَيْنَبُ بِنْتُ أَبِي سَلَمَةَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ هَذَا الِاسْمِ وَسُمِّيتُ بَرَّةَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُزَكُّوا أَنْفُسَكُمْ اللَّهُ أَعْلَمُ بِأَهْلِ الْبِرِّ مِنْكُمْ فَقَالُوا بِمَ نُسَمِّيهَا قَالَ سَمُّوهَا زَيْنَبَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13173,
                "hadithNumber": "5610",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The vilest name in Allah's sight is Malik al-Amidh (King of Kings). The narration transmitted on the authority of Shaiba (contains these words): There is no king but Allah, the Exalted and Glorious. Sufyan said: Similarly, the word Shahinshah (is also the vilest appellation). Ahmad bin Hanbal said: I asked Abu 'Amr about the meaning of Akhna. He said: The vilest.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نےفرمایا؛ \"\" اللہ تعالیٰ کے نزدیک سب سے قابل تحقیر نام اس شخص کا ہے جو شہنشاہ کہلائے ۔ \"\" اور ابن ابی شیبہ نے اپنی روایت میں اضافہ کیا : \"\" اللہ عزوجل کے سوا کوئی ( بادشاہت کا ) مالک نہیں ہے ۔ \"\" اشعشی کا قول ہے : سفیان نے کہا : جیسے شاہان شاہ ( شہنشاہ ) ہے ۔ اور احمد بن حنبل نے کہا : میں نے ابو عمرو ( اسحاق بن مرار شیبانی ، نحوی ، کوفی ) سے \"\" اخنع \"\" کے بارے میں پوچھا توانھوں نے کہا : ( اس کے معنی ہیں ) اوضع ( انتہائی حقیر ).",
                "urduNarrator": "سعید بن عمرو اشعشی ، احمد بن حنبل رحمۃ اللہ علیہ اورابو بکر بن ابی شیبہ نے ہمیں حدیث بیان کی ۔ الفاظ امام احمد کے ہیں ، اشعشی نے کہا : ہمیں سفیان بن عینیہ نے خبر دی جبکہ دیگر نے کہا : ہمیں حدیث بیان کی ۔ ابوزناد سے ، انھوں نے اعرج سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ عَمْرٍو الْأَشْعَثِيُّ وَأَحْمَدُ بْنُ حَنْبَلٍ وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَاللَّفْظُ لِأَحْمَدَ قَالَ الْأَشْعَثِيُّ أَخْبَرَنَا و قَالَ الْآخَرَانِ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ أَخْنَعَ اسْمٍ عِنْدَ اللَّهِ رَجُلٌ تَسَمَّى مَلِكَ الْأَمْلَاكِ زَادَ ابْنُ أَبِي شَيْبَةَ فِي رِوَايَتِهِ لَا مَالِكَ إِلَّا اللَّهُ عَزَّ وَجَلَّ قَالَ الْأَشْعَثِيُّ قَالَ سُفْيَانُ مِثْلُ شَاهَانْ شَاهْ و قَالَ أَحْمَدُ بْنُ حَنْبَلٍ سَأَلْتُ أَبَا عَمْرٍو عَنْ أَخْنَعَ فَقَالَ أَوْضَعَ.",
                "headingArabic": "تَحْرِيمِ التَّسَمِّي بِمَلِكِ الأَمْلاَكِ وَبِمَلِكِ الْمُلُوكِ ‏‏",
                "headingUrdu": "برے ناموں کو بدل کر اچھے نام رکھنا اور برہ کا نام بدل کر زینب، جویریہ وغیرہ رکھنا مستحب ہے۔",
                "headingEnglish": "The Prohibition Of The Names Malik Al-Amlak Or Malik Al-Muluk \"King Of Kings\"",
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13174,
                "hadithNumber": "5611",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) so many a hadith and one of them was this:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: The most wretched person in the sight of Allah on the Day of Resurrection and the worst person and target of His wrath would of the person who is called Malik al-Amlak (the King of Kings) for there is no king but Allah.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ تعالیٰ کے نزدیک قیامت کےدن سب سےزیادہ گندا اورغضب کامستحق شخص وہ ہوگا جوشہنشاہ کہلاتا ہوگا ، اللہ کے سوا کوئی اور بادشاہ نہیں ہے ۔",
                "urduNarrator": "ہم سے محمد بن رافع نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا, ہمیں معمر ہمام بن منبہ سے خبر دی ، کہا : یہ احادیث ہمیں حضرت ابوہریرہ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کیں ، پھر انھوں نے کچھ احادیث بیان کیں ، ان میں سے یہ حدیث ( بھی ) ہے  اور",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَغْيَظُ رَجُلٍ عَلَى اللَّهِ يَوْمَ الْقِيَامَةِ وَأَخْبَثُهُ وَأَغْيَظُهُ عَلَيْهِ رَجُلٍ كَانَ يُسَمَّى مَلِكَ الْأَمْلَاكِ لَا مَلِكَ إِلَّا اللَّهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13175,
                "hadithNumber": "5612",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "I took 'Abdullah bin Abi Talha Ansari to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) at the time of his birth. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was at that time wearing a woollen cloak and besmearing the camels with tar. He said: Have you got with you the dates? I said: Yes. He took hold of the dates and put them in his mouth and softened them, then opened the mouth of the infant and put that in it and the child began to lick it. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: The Ansar have a liking for the dates, and he (the Holy Prophet) gave him the name of 'Abdullah.",
                "hadithUrdu": "جب عبداللہ بن ابی طلہ پیدا ہوئے تو میں انھیں لے کر رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا ، اس وقت رسول اللہ صلی اللہ علیہ وسلم ایک دھاری دارعبا ( چادر ) زیب تن فرمائے اپنے ایک اونٹ کو ( خارش سے نجات دلانے کے لئے ) گندھک ( یاکول تار ) لگارہے تھے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" کچھ کھجور ساتھ ہے؟میں نے عرض کی : جی ہاں ، پھر میں نے آپ کو کچھ کھجوریں پیش کیں ، آپ نے ان کو اپنے منہ میں ڈالا ، انھیں چبایا ، پھر بچے کامنہ کھول کر ان کو اپنے دہن مبارک سے براہ راست اس کے منہ میں ڈال دیا ۔ بچے نے زبان ہلاکر اس کاذائقہ لینا شروع کردیا ۔ پھر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" یہ انصار کی کھجوروں سے محبت ہے ۔ \" اور آپ صلی اللہ علیہ وسلم نے اس کا نام عبداللہ رکھا ۔",
                "urduNarrator": "ہم سے عبد الاعلی بن حماد نے بیان کیا، کہا ہم سے حماد بن سلمہ نے بیان کیا, ثابت بنانی نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الْأَعْلَى بْنُ حَمَّادٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ ذَهَبْتُ بِعْبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ الْأَنْصَارِيِّ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ وُلِدَ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي عَبَاءَةٍ يَهْنَأُ بَعِيرًا لَهُ فَقَالَ هَلْ مَعَكَ تَمْرٌ فَقُلْتُ نَعَمْ فَنَاوَلْتُهُ تَمَرَاتٍ فَأَلْقَاهُنَّ فِي فِيهِ فَلَاكَهُنَّ ثُمَّ فَغَرَ فَا الصَّبِيِّ فَمَجَّهُ فِي فِيهِ فَجَعَلَ الصَّبِيُّ يَتَلَمَّظُهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حُبُّ الْأَنْصَارِ التَّمْرَ وَسَمَّاهُ عَبْدَ اللَّهِ.",
                "headingArabic": "اسْتِحْبَابِ تَحْنِيكِ الْمَوْلُودِ عِنْدَ وِلَادَتِهِ وَحَمْلِهِ إِلَى صَالِحٍ يُحَنِّكُهُ وَجَوَازِ تَسْمِيَتِهِ يَوْمَ وِلَادَتِهِ وَاسْتِحْبَابِ التَّسْمِيَةِ بِعَبْدِ اللَّهِ وَإِبْرَاهِيمَ وَسَائِرِ أَسْمَاءِ الْأَنْبِيَاءِ عَلَيْهِمْ السَّلَام",
                "headingUrdu": "یہ مستحب ہے کہ نوزائیدہ کی پیدائش کے وقت اس کے لیے تہنک کی جائے اور اسے کسی صالح آدمی کے پاس لے جائے تاکہ اس کے لیے تہنک کرے۔ جس دن وہ پیدا ہوا اس دن اس کا نام رکھنا جائز ہے، اور عبداللہ، ابراہیم اور دیگر تمام انبیاء علیہم السلام کے نام رکھنا مستحب ہے۔",
                "headingEnglish": "It Is Recommended To Perform Tahnik For The Newborn When He Is Born And To Take Him To A Righteous Man To Perform Tahnik For Him; It Is Permissible To Name Him On The Day He Is Born, And It Is Recommended To Use The Names 'Abdullah, Ibrahim, And The Names Of All Other Prophets, Peace Be Upon Them",
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13176,
                "hadithNumber": "5613",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "The son of Abu Talha رضی اللہ عنہ had been ailing. Abu Talha رضی اللہ عنہ set out (on a journey) and his son breathed his last (in his absence). When Abu Talha رضی اللہ عنہ came back, he said (to his wife): What about my child? Umm Sulaim (the wife of Abu Talha رضی اللہ عنہ) said: He is now in a more comfortable state than before. She served him the evening meal and he took it. He then came to her (and had sexual intercourse with her) and when it was all over she said: Make arrangements for the burial of the child. When it was morning. Abu Talha رضی اللہ عنہ came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and informed him, whereupon he said: Did you spend the night with her. He said: Yes. He (the Holy Prophet) then said: O Allah, bless both of them (and as a result of blessing) she gave birth to a child. Abu Talha رضی اللہ عنہ said to me (Anas b. Malik) to take the child, (so I took him) and came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). She (Umm Sulaim) also had sent some dates (along with the child). Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) took him (the child) (in his lap) and said: Is there anything with you (for Tahnik). They (the Companions) said: Yes. Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) took hold of them (dates and chewed them). He then put them (the chewed dates) in the mouth of the child and then rubbed his palate and gave him the name of 'Abdullah.",
                "hadithUrdu": "ابوطلحہ رضی اللہ عنہ کا ایک لڑکا بیمار تھا ، وہ باہر گئے ہوئے تھے کہ وہ لڑکا فوت ہو گیا ۔ جب وہ لوٹ کر آئے تو انہوں نے پوچھا کہ میرا بچہ کیسا ہے؟ ( ان کی بیوی ) ام سلیم رضی اللہ عنہا نے کہا کہ اب پہلے کی نسبت اس کو آرام ہے ( یہ موت کی طرف اشارہ ہے اور کچھ جھوٹ بھی نہیں ) ۔ پھر ام سلیم شام کا کھانا ان کے پاس لائیں تو انہوں نے کھایا ۔ اس کے بعد ام سلیم سے صحبت کی ۔ جب فارغ ہوئے تو ام سلیم نے کہا کہ جاؤ بچہ کو دفن کر دو ۔ پھر صبح کو ابوطلحہ رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے اور آپ صلی اللہ علیہ وسلم سے سب حال بیان کیا ، تو آپ صلی اللہ علیہ وسلم نے پوچھا کہ کیا تم نے رات کو اپنی بیوی سے صحبت کی تھی؟ ابوطلحہ نے کہا جی ہاں ۔ آپ صلی اللہ علیہ وسلم نے دعا کی کہ اے اللہ ان دونوں کو برکت دے ۔ پھر ام سلیم کے ہاں لڑکا پیدا ہوا تو ابوطلحہ نے مجھ سے کہا کہ اس بچہ کو اٹھا کر رسول اللہ صلی اللہ علیہ وسلم کے پاس لے جا اور ام سلیم نے بچے کے ساتھ تھوڑی کھجوریں بھی بھیجیں ۔ رسول اللہ صلی اللہ علیہ وسلم نے اس بچے کو لے لیا اور پوچھا کہ اس کے ساتھ کچھ ہے؟ لوگوں نے کہا کہ کھجوریں ہیں ۔ آپ صلی اللہ علیہ وسلم نے کھجوروں کو لے کر چبایا ، پھر اپنے منہ سے نکال کر بچے کے منہ میں ڈال کر اسے گٹھی دی اور اس کا نام عبداللہ رکھا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, یزید بن ہارون نے کہا , ہمیں ابن عون نے ابن سیرین سے خبر دی ، انھوں نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی ، کہا؛ سیدنا انس بن مالک رضی اللہ عنہ کہتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا ابْنُ عَوْنٍ عَنْ ابْنِ سِيرِينَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ كَانَ ابْنٌ لِأَبِي طَلْحَةَ يَشْتَكِي فَخَرَجَ أَبُو طَلْحَةَ فَقُبِضَ الصَّبِيُّ فَلَمَّا رَجَعَ أَبُو طَلْحَةَ قَالَ مَا فَعَلَ ابْنِي قَالَتْ أُمُّ سُلَيْمٍ هُوَ أَسْكَنُ مِمَّا كَانَ فَقَرَّبَتْ إِلَيْهِ الْعَشَاءَ فَتَعَشَّى ثُمَّ أَصَابَ مِنْهَا فَلَمَّا فَرَغَ قَالَتْ وَارُوا الصَّبِيَّ فَلَمَّا أَصْبَحَ أَبُو طَلْحَةَ أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرَهُ فَقَالَ أَعْرَسْتُمْ اللَّيْلَةَ قَالَ نَعَمْ قَالَ اللَّهُمَّ بَارِكْ لَهُمَا فَوَلَدَتْ غُلَامًا فَقَالَ لِي أَبُو طَلْحَةَ احْمِلْهُ حَتَّى تَأْتِيَ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَى بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبَعَثَتْ مَعَهُ بِتَمَرَاتٍ فَأَخَذَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَمَعَهُ شَيْءٌ قَالُوا نَعَمْ تَمَرَاتٌ فَأَخَذَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَضَغَهَا ثُمَّ أَخَذَهَا مِنْ فِيهِ فَجَعَلَهَا فِي فِي الصَّبِيِّ ثُمَّ حَنَّكَهُ وَسَمَّاهُ عَبْدَ اللَّهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13177,
                "hadithNumber": "5614",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been reported on the authority of Anas رضی اللہ عنہ through another chain of transmitters.",
                "hadithUrdu": "ہم سے محمد بن بشار نے بیان کیا, حماد بن مسعدہ نے کہا : ہمیں ابن عون نے محمد ( ابن سیرین ) سے حدیث بیان کی ، انھوں نے حضرت انس رضی اللہ عنہ سے اسی قصے کے ساتھ یزید کی حدیث کی طرح بیان کیا ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا حَمَّادُ بْنُ مَسْعَدَةَ حَدَّثَنَا ابْنُ عَوْنٍ عَنْ مُحَمَّدٍ عَنْ أَنَسٍ بِهَذِهِ الْقِصَّةِ نَحْوَ حَدِيثِ يَزِيدَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13178,
                "hadithNumber": "5615",
                "englishNarrator": "Abu Musa رضی اللہ عنہ reported:",
                "hadithEnglish": "A child was born in my house and I brought him to Allah's Apostle (ﷺ) and he gave him the name of Ibrahim and he rubbed his palate with dates.",
                "hadithUrdu": "میرے ہاں ایک لڑکا پیدا ہوا ، میں اس کو لے کر نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا ، آپ نے اس کا نام ابراہیم رکھا اور اس کو ایک کھجور ( کے دانے ) سے گھٹی دی ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، عبداللہ بن براد اشعری اور ابو کریب نے بیان کیا، انہوں نے کہا: ہم سے ابو اسامہ نے ابو کی سند سے بیان کیا, پردہ , حضرت ابوموسیٰ رضی اللہ عنہ سے روایت ہے ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَبْدُ اللَّهِ بْنُ بَرَّادٍ الْأَشْعَرِيُّ وَأَبُو كُرَيْبٍ قَالُوا حَدَّثَنَا أَبُو أُسَامَةَ عَنْ بُرَيْدٍ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَى قَالَ وُلِدَ لِي غُلَامٌ فَأَتَيْتُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَمَّاهُ إِبْرَاهِيمَ وَحَنَّكَهُ بِتَمْرَةٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13179,
                "hadithNumber": "5616",
                "englishNarrator": "Urwa bin Zubair and Fatima daughter of Mandhir bin Zubair, reported:",
                "hadithEnglish": "Asma' رضی اللہ عنہا daughter of Abu Bakr was at the time of migration in the family way with 'Abdullah bin Zubair (in her womb). She came to Quba' and gave birth to 'Abdullah at that place and then sent him to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) so that he should rub his palate with chewed dates. Allah's Messenger (may peace he upon him) took hold of him (the child) and he placed him in his lap and then called for dates. 'A'isha رضی اللہ عنہا said: Some time was spent before we were able to find them. He (the Holy Prophet ﷺ) chewed them and then put his saliva in his mouth. The first thing that entered his stomach, was the saliva of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). Asma' رضی اللہ عنہا said: He then rubbed him and blessed him and gave him the name of Abdullah. He ('Abdullah) went to him (the Holy Prophet ﷺ) when he had attained the age of seven or eight years in order to pledge allegiance to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as Zubair رضی اللہ عنہ had commanded him to do. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) smiled when he saw him coming towards him and then accepted his allegiance.",
                "hadithUrdu": "سیدہ اسماء رضی اللہ عنہا ( مکہ سے ) ہجرت کی نیت سے جس وقت نکلیں ، ان کے پیٹ میں عبداللہ بن زبیر تھے ( یعنی حاملہ تھیں ) جب وہ قباء میں آ کر اتریں تو وہاں سیدنا عبداللہ بن زبیر پیدا ہوئے ۔ پھر ولادت کے بعد انہیں لے کر نبی کریم صلی اللہ علیہ وسلم کے پاس آئیں تاکہ آپ صلی اللہ علیہ وسلم اس کو گھٹی لگائیں ، پس آپ صلی اللہ علیہ وسلم نے انہیں سیدہ اسماء رضی اللہ عنہا سے لے لیا اور اپنی گود میں بٹھایا ، پھر ایک کھجور منگوائی ۔ ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا کہتی ہیں کہ ہم ایک گھڑی تک کھجور ڈھونڈتے رہے ، آخر آپ صلی اللہ علیہ وسلم نے کھجور کو چبایا ، پھر ( اس کا جوس ) ان کے منہ میں ڈال دیا ۔ یہی پہلی چیز جو عبداللہ کے پیٹ میں پہنچی ، وہ رسول اللہ صلی اللہ علیہ وسلم کا تھوک تھا ۔ سیدہ اسماء رضی اللہ عنہا نے کہا کہ اس کے بعد رسول اللہ صلی اللہ علیہ وسلم نے عبداللہ پر ہاتھ پھیرا اور ان کے لئے دعا کی اور ان کا نام عبداللہ رکھا ۔ پھر جب وہ سات یا آٹھ برس کے ہوئے تو سیدنا زبیر رضی اللہ عنہ کے اشارے پر وہ نبی کریم صلی اللہ علیہ وسلم سے بیعت کے لئے آئے ۔ جب نبی کریم صلی اللہ علیہ وسلم نے ان کو آتے دیکھا تو تبسم فرمایا ۔ پھر ان سے ( برکت کے لئے ) بیعت کی ( کیونکہ وہ کمسن تھے ) ۔",
                "urduNarrator": "ہم سے الحکم بن موسیٰ ابوصالح نے بیان کیا، کہا ہم سے شعبی نے بیان کیا، کہا کہ مجھ سے ابن اسحاق نے بیان کیا، مجھ سے ہشام بن عروہ نے بیان کیا، مجھ سے عروہ بن الزبیر نے بیان کیا۔ اور فاطمہ بنت المنذر بن الزبیر رضی اللہ عنہا کہتی ہیں کہ",
                "hadithArabic": "حَدَّثَنَا الْحَكَمُ بْنُ مُوسَى أَبُو صَالِحٍ حَدَّثَنَا شُعَيْبٌ يَعْنِي ابْنَ إِسْحَقَ أَخْبَرَنِي هِشَامُ بْنُ عُرْوَةَ حَدَّثَنِي عُرْوَةُ بْنُ الزُّبَيْرِ وَفَاطِمَةُ بِنْتُ الْمُنْذِرِ بْنِ الزُّبَيْرِ أَنَّهُمَا قَالَا خَرَجَتْ أَسْمَاءُ بِنْتُ أَبِي بَكْرٍ حِينَ هَاجَرَتْ وَهِيَ حُبْلَى بِعَبْدِ اللَّهِ بْنِ الزُّبَيْرِ فَقَدِمَتْ قُبَاءً فَنُفِسَتْ بِعَبْدِ اللَّهِ بِقُبَاءٍ ثُمَّ خَرَجَتْ حِينَ نُفِسَتْ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِيُحَنِّكَهُ فَأَخَذَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْهَا فَوَضَعَهُ فِي حَجْرِهِ ثُمَّ دَعَا بِتَمْرَةٍ قَالَ قَالَتْ عَائِشَةُ فَمَكَثْنَا سَاعَةً نَلْتَمِسُهَا قَبْلَ أَنْ نَجِدَهَا فَمَضَغَهَا ثُمَّ بَصَقَهَا فِي فِيهِ فَإِنَّ أَوَّلَ شَيْءٍ دَخَلَ بَطْنَهُ لَرِيقُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ قَالَتْ أَسْمَاءُ ثُمَّ مَسَحَهُ وَصَلَّى عَلَيْهِ وَسَمَّاهُ عَبْدَ اللَّهِ ثُمَّ جَاءَ وَهُوَ ابْنُ سَبْعِ سِنِينَ أَوْ ثَمَانٍ لِيُبَايِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَمَرَهُ بِذَلِكَ الزُّبَيْرُ فَتَبَسَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ رَآهُ مُقْبِلًا إِلَيْهِ ثُمَّ بَايَعَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13180,
                "hadithNumber": "5617",
                "englishNarrator": "Asma' رضی اللہ عنہا reported:",
                "hadithEnglish": "She had become pregnant at Mecca with Abdullah bin Zubair رضی اللہ عنہ (in her womt) and she (further) said: I set out (for migration to Medina) as I was in the advanced stage of pregnancy. I came to Medina and got down at the place known as Quba' and gave birth to a child there. Then I came to Allah's Messenger (may peace he upon him). He placed him (the child) in his lap and then commanded for the dates to be brought. He chewed them and then put the saliva in his mouth. The first thing which went into his stomach was the saliva of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). He then rubbed his palate with dates and then invoked blessings for him and blessed him. He was the first child who was born in Islam (after Migration).",
                "hadithUrdu": "وہ مکہ میں حاملہ ہوئیں ، حضرت عبداللہ بن زبیر رضی اللہ تعالیٰ عنہ ان کے پیٹ میں تھے ، حضرت اسماء رضی اللہ عنہا نے کہاکہ جب میں ( مکہ سے ) نکلی تو میں پورے دنوں سے تھی ، پھر میں مدینہ آئی اورقباء میں ٹھہری اور قباء میں نے اسے ( عبداللہ ) کو جنم دیا ، پھر میں ر سول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی تو آپ نے اسے اپنی گود میں لے لیا ، پھر آپ نے کھجور منگوائی ، اسے چبایا ۔ پھر اپنا لعاب دہن اس کے منہ میں ڈال دیا ، پہلی چیز جو اس کے پیٹ میں گئی وہ رسول اللہ صلی اللہ علیہ وسلم کالعاب دہن تھا ، پھر آپ نے ( چبائی ہوئی ) کھجور کی گھٹی اس کے تالو کولگائی ، پھر میں کے لئے دعا کی ، برکت مانگی ، ( ہجرت مدینہ کے بعد ) یہ پہلا بچہ تھا جو اسلام میں پیدا ہوا ۔",
                "urduNarrator": "ہم سے ابو کریب محمد بن الاعلٰی نے بیان کیا, ابو اسامہ نے ہشام سے ، انھوں نے ا پنے والد سے ، انھوں نے حضرت اسماء رضی اللہ عنہا سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ أَسْمَاءَ أَنَّهَا حَمَلَتْ بِعَبْدِ اللَّهِ بْنِ الزُّبَيْرِ بِمَكَّةَ قَالَتْ فَخَرَجْتُ وَأَنَا مُتِمٌّ فَأَتَيْتُ الْمَدِينَةَ فَنَزَلْتُ بِقُبَاءٍ فَوَلَدْتُهُ بِقُبَاءٍ ثُمَّ أَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَوَضَعَهُ فِي حَجْرِهِ ثُمَّ دَعَا بِتَمْرَةٍ فَمَضَغَهَا ثُمَّ تَفَلَ فِي فِيهِ فَكَانَ أَوَّلَ شَيْءٍ دَخَلَ جَوْفَهُ رِيقُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ حَنَّكَهُ بِالتَّمْرَةِ ثُمَّ دَعَا لَهُ وَبَرَّكَ عَلَيْهِ وَكَانَ أَوَّلَ مَوْلُودٍ وُلِدَ فِي الْإِسْلَامِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13181,
                "hadithNumber": "5618",
                "englishNarrator": "Asma' daughter of Abu Bakr رضی اللہ عنہا reported:",
                "hadithEnglish": "When she migrated to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) in Medina she was in the family way with Abdullah bin Zubair رضی اللہ عنہ in her womb. A hadith like that of Abu Usamah (no. 5417).",
                "hadithUrdu": "انھوں نے ر سول اللہ صلی اللہ علیہ وسلم کی طرف ہجرت کی ، اس وقت وہ عبداللہ بن زبیر رضی اللہ عنہ سےحاملہ تھیں ، پھر ابو اسامہ کی حدیث کی طرح بیان کیا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے خالد بن مخلد نے بیان کیا, علی بن مسہر نے ہشام بن عروہ سے ، انھوں نے اپنے والد سے ، انھوں نے حضرت اسماء بنت ابی بکر رضی اللہ عنہا سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ عَنْ عَلِيِّ بْنِ مُسْهِرٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ أَنَّهَا هَاجَرَتْ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهِيَ حُبْلَى بِعَبْدِ اللَّهِ بْنِ الزُّبَيْرِ فَذَكَرَ نَحْوَ حَدِيثِ أَبِي أُسَامَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13182,
                "hadithNumber": "5619",
                "englishNarrator": "A'isha reported:",
                "hadithEnglish": "The new-born infants were brought to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). He blessed them and rubbed their palates with dates.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے پاس بچے لائے جاتے ، آپ ان کے لئے برکت کی دعا کرتے اور انھیں گھٹی دیتے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے عبداللہ بن نمیر نے بیان کیا، کہا کہ ہم سے ہشام نے بیان کیا، یعنی ابن عروہ نے اپنے والد سے, حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ حَدَّثَنَا هِشَامٌ يَعْنِي ابْنَ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُؤْتَى بِالصِّبْيَانِ فَيُبَرِّكُ عَلَيْهِمْ وَيُحَنِّكُهُمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13183,
                "hadithNumber": "5620",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "We took 'Abdullah bin Zubair رضی اللہ عنہ to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) so that he should put saliva in his mouth and we had to make a good deal of effort in order to procure them.",
                "hadithUrdu": "ہم گھٹی دلوانے کے لئے عبداللہ بن زبیر رضی اللہ عنہ کو نبی کریم صلی اللہ علیہ وسلم کی خدمت میں لے گئے ، ہم نے کھجور حاصل کرنی چاہی تو ہمارے لیے اس کا حصول دشوار ہوگیا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے ابو خالد الاحمر نے بیان کیا، انہوں نے ہشام کی سند سے، اپنے والد سے,حضرت عائشہ رضی اللہ عنہا سےروایت ہے ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ جِئْنَا بِعَبْدِ اللَّهِ بْنِ الزُّبَيْرِ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُحَنِّكُهُ فَطَلَبْنَا تَمْرَةً فَعَزَّ عَلَيْنَا طَلَبُهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13184,
                "hadithNumber": "5621",
                "englishNarrator": "Sahl bin Sa'd رضی اللہ عنہ reported:",
                "hadithEnglish": "Mundhir bin Aba Usaid رضی اللہ عنہ was brought to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) at the time of his birth Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) placed him on his thigh and Abu Usaid kept sitting there. Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had been occupied with something else before him. Abu Usaid رضی اللہ عنہ commanded his child to be lifted from the lap of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and so he was lifted. When Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had finished the work he said: Where is the child? Abd Usaid said: Allah's Messenger, we took him away. He said: What is his name? He said; Allah's Messenger, it is so and so, whereupon he (the Holy Prophet ﷺ) said: Nay, his name is Mundhir, and named him Mundhir on that day.",
                "hadithUrdu": "ابواسید رضی اللہ عنہ کا بیٹا منذر ، جب پیدا ہوا تو اسے رسول اللہ صلی اللہ علیہ وسلم کے پاس لایا گیا ۔ آپ صلی اللہ علیہ وسلم نے اس کو اپنی ران پر رکھا اور ( اس کے والد ) ابواسید ۔ بیٹھے تھے پھر آپ صلی اللہ علیہ وسلم کسی چیز میں اپنے سامنے متوجہ ہوئے تو ابواسید نے حکم دیا تو وہ بچہ آپ صلی اللہ علیہ وسلم کے ران پر سے اٹھا لیا گیا ۔ جب آپ صلی اللہ علیہ وسلم کو خیال آیا تو فرمایا کہ بچہ کہاں ہے؟ سیدنا ابواسید رضی اللہ عنہ نے کہا کہ یا رسول اللہ! ہم نے اس کو اٹھا لیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس کا نام کیا ہے؟ ابواسید نے کہا کہ فلاں نام ہے ، تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ نہیں ، اس کا نام منذر ہے ۔ پھر اس دن سے انہوں نے اس کا نام منذر ہی رکھ دیا ۔",
                "urduNarrator": "مجھ سے محمد بن سہل تمیمی اور ابوبکر بن اسحاق نے بیان کیا، کہا: ہم سے ابن ابی مریم نے بیان کیا، محمد نے جو ابن مطرف ابو ہیں۔ مجھ سے غسان ابوحازم نے بیان کیا, حضرت سہل بن سعد ( بن مالک رضی اللہ عنہ ) سے روایت ہے ، کہا : کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ سَهْلٍ التَّمِيمِيُّ وَأَبُو بَكْرِ بْنُ إِسْحَقَ قَالَا حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ حَدَّثَنَا مُحَمَّدٌ وَهُوَ ابْنُ مُطَرِّفٍ أَبُو غَسَّانَ حَدَّثَنِي أَبُو حَازِمٍ عَنْ سَهْلِ بْنِ سَعْدٍ قَالَ أُتِيَ بِالْمُنْذِرِ بْنِ أَبِي أُسَيْدٍ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ وُلِدَ فَوَضَعَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى فَخِذِهِ وَأَبُو أُسَيْدٍ جَالِسٌ فَلَهِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشَيْءٍ بَيْنَ يَدَيْهِ فَأَمَرَ أَبُو أُسَيْدٍ بِابْنِهِ فَاحْتُمِلَ مِنْ عَلَى فَخِذِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَقْلَبُوهُ فَاسْتَفَاقَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَيْنَ الصَّبِيُّ فَقَالَ أَبُو أُسَيْدٍ أَقْلَبْنَاهُ يَا رَسُولَ اللَّهِ فَقَالَ مَا اسْمُهُ قَالَ فُلَانٌ يَا رَسُولَ اللَّهِ قَالَ لَا وَلَكِنْ اسْمُهُ الْمُنْذِرُ فَسَمَّاهُ يَوْمَئِذٍ الْمُنْذِرَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13185,
                "hadithNumber": "5622",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had the sublimest character among mankind. I had a brother who was called Abu 'Umair. I think he was weaned. When Allah's Messenger (may peace he upon him) came to our house he saw him, and said: Abu 'Umair, what has the sparrow done? He (Anas) said that he had been playing with that.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم تمام انسانوں سے بڑھ کر خوش ا خلاق تھے ، میرا ایک بھائی تھا جسے ابو عمیر کہا جاتا تھا ۔ ( ابوالتیاح نے ) کہا : میرا خیال ہے ( انس رضی اللہ عنہ نے ) کہا تھا : اس کا دودھ چھڑایا جاچکا تھا ، کہا : جب رسول اللہ صلی اللہ علیہ وسلم تشریف لاتے اور اسے دیکھتے تو فرماتے : ابو عمیر!نغیر نے کیا کیا \" وہ بچہ اس ( پرندے ) سے کھیلا کرتا تھا ۔",
                "urduNarrator": "ہم سے ابو الربیع سلیمان بن داؤد العتکی نے بیان کیا، کہا ہم سے عبدالوارث نے بیان کیا, ابوتیاح نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو الرَّبِيعِ سُلَيْمَانُ بْنُ دَاوُدَ الْعَتَكِيُّ حَدَّثَنَا عَبْدُ الْوَارِثِ حَدَّثَنَا أَبُو التَّيَّاحِ حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ ح و حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ وَاللَّفْظُ لَهُ حَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ أَبِي التَّيَّاحِ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحْسَنَ النَّاسِ خُلُقًا وَكَانَ لِي أَخٌ يُقَالُ لَهُ أَبُو عُمَيْرٍ قَالَ أَحْسِبُهُ قَالَ كَانَ فَطِيمًا قَالَ فَكَانَ إِذَا جَاءَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَآهُ قَالَ أَبَا عُمَيْرٍ مَا فَعَلَ النُّغَيْرُ قَالَ فَكَانَ يَلْعَبُ بِهِ.",
                "headingArabic": "جواز تكنينة من لم يولد له. وكنية الصغير",
                "headingUrdu": "جس کی اولاد نہ ہو یا نابالغ کو کنیت دینا جائز ہے۔",
                "headingEnglish": "It Is Permissible To give a kunyah to one who has no child, or to a minor",
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13186,
                "hadithNumber": "5623",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) addressed me: O My Son.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فرمایا : \" اے میرے بیٹے! \"",
                "urduNarrator": "ہم سے محمد بن عبید الغبری نے بیان کیا، کہا ہم سے ابو عوانہ نے بیان کیا، ابو عثمان کی سند سے, حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الْغُبَرِيُّ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ أَبِي عُثْمَانَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا بُنَيَّ.",
                "headingArabic": "جَوَازِ قَوْلِهِ لِغَيْرِ ابْنِهِ يَا بُنَىَّ وَاسْتِحْبَابِهِ لِلْمُلاَطَفَةِ",
                "headingUrdu": "اپنے بیٹے کے علاوہ کسی اور کو \"اے میرے بیٹے\" کہنا جائز ہے، اور یہ مستحب ہے کہ نرمی سے بات کرے۔",
                "headingEnglish": "It Is Permissible To Say: \"O My Son\" To Someone Other Than One's Son, And It Is Recommended To Speak Kindly",
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13187,
                "hadithNumber": "5624",
                "englishNarrator": "Mughira bin Shu'ba رضی اللہ عنہ reported:",
                "hadithEnglish": "None else had asked more questions from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) about the Dajjal than I, but he simply said in a slight mood): O, my son, why are you worried because of him? He will not harm you. I said: The people think that he would have with him rivers of water and mountains of bread, whereupon he said: He would be more insignificant in the sight of Allah than all these things (belonging to him).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم سے دجال کے متعلق جتنے سوالات میں نے کیے اتنے کسی اور نے نہیں کیے ، آپ صلی اللہ علیہ وسلم نے مجھ سے فرمایا؛ \" میرے بیٹے!تمھیں اس ( دجال ) سے کیا بات پریشان کررہی ہے؟تمھیں اس سے ہر گز کوئی نقصان نہ پہنچے گا ۔ \" کہا : میں نے عرض کی : لوگ سمجھتے ہیں کہ اس کے ساتھ پانی کی نہریں اور ر وٹی کے پہاڑ ہوں گے ۔ \" آپ صلی اللہ علیہ وسلم نے فرمایا : \" وہ اللہ تعالیٰ کے نزدیک اس کی نسبت زیادہ ذلیل ہے ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابن ابی عمر نے بیان کیا اور یہ قول ابن ابی عمر سے ہے, یزید بن ہارون نے اسماعیل بن ابی خالد سے ، انھوں نے قیس بن ابی حازم سے ، انھوں نے حضرت مغیرہ بن شعبہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَابْنُ أَبِي عُمَرَ وَاللَّفْظُ لِابْنِ أَبِي عُمَرَ قَالَا حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ عَنْ إِسْمَعِيلَ بْنِ أَبِي خَالِدٍ عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَ مَا سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحَدٌ عَنْ الدَّجَّالِ أَكْثَرَ مِمَّا سَأَلْتُهُ عَنْهُ فَقَالَ لِي أَيْ بُنَيَّ وَمَا يُنْصِبُكَ مِنْهُ إِنَّهُ لَنْ يَضُرَّكَ قَالَ قُلْتُ إِنَّهُمْ يَزْعُمُونَ أَنَّ مَعَهُ أَنْهَارَ الْمَاءِ وَجِبَالَ الْخُبْزِ قَالَ هُوَ أَهْوَنُ عَلَى اللَّهِ مِنْ ذَلِكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13188,
                "hadithNumber": "5625",
                "englishNarrator": null,
                "hadithEnglish": "It was narrated from Ismail with this chain of narrators (a hadith similar to no. 5624), but it does not mention in the Hadith of any of them the words of the prophet ﷺ to Al-Mughirah رضی اللہ عنہ : \"O my son,\" except the hadith of Yazid (no. 5624).",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ اور ابن نمیر نے بیان کیا، انہوں نے کہا: وکیع ، ہشیم ، جریر اور ابو اسامہ سب نے اسماعیل سے اسی سند کے ساتھ حدیث بیان کی ، ان میں سے تنہا یزید کی حدیث میں رسول اللہ صلی اللہ علیہ وسلم کی طرف سے مغیرہ رضی اللہ عنہ کے لیے \" اے میرے بیٹے \" کے الفاظ ہیں اور کسی کی حدیث میں نہیں ہیں ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَابْنُ نُمَيْرٍ قَالَا حَدَّثَنَا وَكِيعٌ و حَدَّثَنَا سُرَيْجُ بْنُ يُونُسَ حَدَّثَنَا هُشَيْمٌ ح و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا جَرِيرٌ ح و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا أَبُو أُسَامَةَ كُلُّهُمْ عَنْ إِسْمَعِيلَ بِهَذَا الْإِسْنَادِ وَلَيْسَ فِي حَدِيثِ أَحَدٍ مِنْهُمْ قَوْلُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلْمُغِيرَةِ أَيْ بُنَيَّ إِلَّا فِي حَدِيثِ يَزِيدَ وَحْدَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 12876,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=515",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=513",
                "label": "513",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=514",
                "label": "514",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=515",
                "label": "515",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=516",
                "label": "516",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=517",
                "label": "517",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=518",
                "label": "518",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=519",
                "label": "519",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=517",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=517",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=515",
        "to": 12900,
        "total": 40465
    }
}