{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 574,
        "data": [
            {
                "id": 14614,
                "hadithNumber": "7053",
                "englishNarrator": "Abdullah bin Miqsam reported:",
                "hadithEnglish": "'Abdullah bin 'Umar رضی اللہ عنہ reported: I saw Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) upon the pulpit and he was saying that the Mighty Lord, the Exalted and Glorious would take hold of the Heavens and earth in His hand. The rest of the hadith is the same,",
                "hadithUrdu": "انھوں نے حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت کی ، کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو منبر پر دیکھا جب آپ صلی اللہ علیہ وسلم فرمارہے تھے : \" ( اللہ ) جبارعزوجل اپنے آسمانوں اور اپنی زمینوں کو اپنے ہاتھوں میں پکڑ لے گا ۔ \" پھر یعقوب کی حدیث کی طرح بیان کیا ۔",
                "urduNarrator": "ہم سے سعید بن منصور نے بیان کیا, عبدالعزیز بن ابی حازم نے کہا : مجھے میرے والد نے عبیداللہ بن مقسم سے حدیث بیان کی",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ حَدَّثَنِي أَبِي عَنْ عُبَيْدِ اللَّهِ بْنِ مِقْسَمٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ وَهُوَ يَقُولُ يَأْخُذُ الْجَبَّارُ عَزَّ وَجَلَّ سَمَاوَاتِهِ وَأَرَضِيهِ بِيَدَيْهِ ثُمَّ ذَكَرَ نَحْوَ حَدِيثِ يَعْقُوبَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14615,
                "hadithNumber": "7054",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم) took hold of my hands and said: Allah, the Exalted and Glorious, created the clay on Saturday and He created the mountains on Sunday and He created the trees on Monday and He created the things entailing labour on Tuesday and created light on Wednesday and He caused the animals to spread on Thursday and created Adam (peace be upon him) after 'Asr on Friday; the last creation at the last hour of the hours of Friday, i.e. between afternoon and night. This hadith is narrated through another chain of transmitters.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے میرا ہاتھ پکڑا ، پھر فرمایا : \"\" اللہ عزوجل نے مٹی ( زمین ) کو ہفتے کےدن پیداکیا اور اس میں پہاڑوں کو اتوار کے دن پیدا کیا اور درختوں کو پیر کے دن پیدا کیا اور ناپسندیدہ چیزوں کو منگل کےدن پیدا کیا اور نور کو بدھ کے دن پیدا کیا اور اس میں چوپایوں کو جمعرات کے دن پھیلادیا اور سب مخلوقات کے آخر میں آخر میں آدم علیہ السلام کو جمعہ کے دن عصر کے بعد سے لے کر رات تک کے درمیان جمعہ ( کے دن کی آخری ساعتوں میں سے کسی ساعت میں پیدا فرمایا ۔ \"\" جلودی نے ہمیں حدیث بیان کی ، کہا : ہمیں امام مسلم رحمۃاللہ علیہ کے شاگرد ابراہیم نے حدیث بیان کی ، کہا : ہمیں حسین بن علی بسطامی ، سہل بن عمار ، حفص کے نواسے ابراہیم اور دوسروں نے حجاج سے یہی حدیث بیان کی ۔",
                "urduNarrator": "سریج بن یونس اور ہارون بن عبداللہ نے مجھے حدیث بیان کی ، دونوں نے کہا : ہمیں حجاج بن محمد نے حدیث بیان کی ، انھوں نے کہا : ابن جریج نے کہا : مجھے اسماعیل بن امیہ نے ایوب بن خالد سے حدیث بیان کی ۔ انھوں نے ام سلمہ رضی اللہ عنہا کے آزاد کردہ غلام عبداللہ بن رافع سے اور انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي سُرَيْجُ بْنُ يُونُسَ وَهَارُونُ بْنُ عَبْدِ اللَّهِ قَالَا حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي إِسْمَعِيلُ بْنُ أُمَيَّةَ عَنْ أَيُّوبَ بْنِ خَالِدٍ عَنْ عَبْدِ اللَّهِ بْنِ رَافِعٍ مَوْلَى أُمِّ سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ أَخَذَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدِي فَقَالَ خَلَقَ اللَّهُ عَزَّ وَجَلَّ التُّرْبَةَ يَوْمَ السَّبْتِ وَخَلَقَ فِيهَا الْجِبَالَ يَوْمَ الْأَحَدِ وَخَلَقَ الشَّجَرَ يَوْمَ الِاثْنَيْنِ وَخَلَقَ الْمَكْرُوهَ يَوْمَ الثُّلَاثَاءِ وَخَلَقَ النُّورَ يَوْمَ الْأَرْبِعَاءِ وَبَثَّ فِيهَا الدَّوَابَّ يَوْمَ الْخَمِيسِ وَخَلَقَ آدَمَ عَلَيْهِ السَّلَام بَعْدَ الْعَصْرِ مِنْ يَوْمِ الْجُمُعَةِ فِي آخِرِ الْخَلْقِ فِي آخِرِ سَاعَةٍ مِنْ سَاعَاتِ الْجُمُعَةِ فِيمَا بَيْنَ الْعَصْرِ إِلَى اللَّيْلِ قَالَ إِبْرَاهِيمُ حَدَّثَنَا الْبِسْطَامِيُّ وَهُوَ الْحُسَيْنُ بْنُ عِيسَى وَسَهْلُ بْنُ عَمَّارٍ وَإِبْرَاهِيمُ ابْنُ بِنْتِ حَفْصٍ وَغَيْرُهُمْ عَنْ حَجَّاجٍ بِهَذَا الْحَدِيثِ.",
                "headingArabic": "ابْتِدَاءِ الْخَلْقِ وَخَلْقِ آدَمَ عَلَيْهِ السَّلاَمُ ‏‏",
                "headingUrdu": "ابتداء تخلیق اور تخلیق آدم علیہ السلام",
                "headingEnglish": "The Beginning Of Creation And The Creation Of Adam, (Peace Be Upon Him)",
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14616,
                "hadithNumber": "7055",
                "englishNarrator": "Sahl bin Sa'd رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: The people will be assembled on the Day of Resurrection on a white plain with a reddish tinge like the loaf of white bread with no marks set up for anyone.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" قیامت کے دن لوگوں کو غبار کی رنگت ملی ، سفید زمین پر اکٹھا کیا جا ئے گا ، جیسے چھنے ہوئے آٹے کی روٹی ہو تی ہے اور اس کسی شخص کے لیے کو ئی علامت موجود نہیں ہو گی ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے خالد بن مخلد نے بیان کیا، ان سے محمد بن جعفر بن ابی کثیر نے بیان کیا، مجھ سے ابوحازم بن دینار نے بیان کیا, حضرت سہل بن سعد رضی اللہ عنہ سے روایت ہے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ عَنْ مُحَمَّدِ بْنِ جَعْفَرِ بْنِ أَبِي كَثِيرٍ حَدَّثَنِي أَبُو حَازِمِ بْنُ دِينَارٍ عَنْ سَهْلِ بْنِ سَعْدٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُحْشَرُ النَّاسُ يَوْمَ الْقِيَامَةِ عَلَى أَرْضٍ بَيْضَاءَ عَفْرَاءَ كَقُرْصَةِ النَّقِيِّ لَيْسَ فِيهَا عَلَمٌ لِأَحَدٍ.",
                "headingArabic": "فِي الْبَعْثِ وَالنُّشُورِ وَصِفَةِ الأَرْضِ يَوْمَ الْقِيَامَةِ ‏‏",
                "headingUrdu": "قیامت کے دن زمین کی قیامت اور تفصیل",
                "headingEnglish": "The Resurrection And Description Of The Earth On The Day Of Resurrection",
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14617,
                "hadithNumber": "7056",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "I asked Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) about the words of Allah, the Exalted and Glorious: The day when the earth would be changed for another earth and Heaven would be changed for another Heaven (XiV. 48), (and inquired: ) (Allah's Messenger), where would the people be on that day? He said: They would be on the Sirat.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے اللہ عزوجل کے اس قول کے متعلق سوال کیا : \" جس دن زمین دوسری زمین سے بدل دی جا ئے گی اور آسمان ( بھی بدل دیا جائےگا ) تو اللہ کے رسول اللہ صلی اللہ علیہ وسلم !اس دن لوگ کہاں ہوں گے؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" ( پل صراط پر ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے علی بن مشر نے بیان کیا، انہوں نے داؤد کی سند سے، شعبی کی سند سے، مسروق کی سند سے, حضرت عائشہ رضی اللہ عنہا سے روایت ہے انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ دَاوُدَ عَنْ الشَّعْبِيِّ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ قَوْلِهِ عَزَّ وَجَلَّ يَوْمَ تُبَدَّلُ الْأَرْضُ غَيْرَ الْأَرْضِ وَالسَّمَاوَاتُ فَأَيْنَ يَكُونُ النَّاسُ يَوْمَئِذٍ يَا رَسُولَ اللَّهِ فَقَالَ عَلَى الصِّرَاطِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14618,
                "hadithNumber": "7057",
                "englishNarrator": "Abu al-Sa'id Khudri رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying that the earth would turn to be one single bread on the Day of Resurrection and the Almighty would turn it in His hand as one of you turns a loaf while on a journey. It would be a feast arranged in the honour of the people of Paradise. He (the narrator) further narrated that a person from among the Jews came and he said: Abu al-Qasim, may the Compassionate Lord be pleased with you! May I inform you about the feast arranged in honour of the people of Paradise on the Day of Resurrection? He said: Do it, of course. He said: The earth would become one single bread. Then Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) looked towards us and laughed until his molar teeth became visible. He then again said: May I inform you about that with which they would season it? He said: Do it, of course. He said: Their seasoning would be balim and fish. The Companions of the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: What is this balam? He said: Ox and fish from whose excessive livers seventy thousand people would be able to eat.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" قیامت کے دن یہ زمین ایک ہی روئی بن جائے گی ۔ جبار ( اللہ تعالیٰ ) اہل جنت کی مہمانی کے لیے اسے اپنے ہاتھ سے الٹ پلٹ کرروئی کی طرح بنا دے گا جس طرح تم میں سے کو ئی شخص سفر میں روئی کو الٹ پلٹ کرتا ہے ۔ ( حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ نے ) کہا : اتنے میں یہودیوں میں سے ایک شخص آگیا اس نے کہا : ابو القاسم الرحمٰن آپ پر برکت نازل فرمائے !کیا میں آپ کو قیامت کے روز اہل جنت کی ضیافت کے بارے میں نہ بتاؤں ؟آپ نے ارشاد فرمایا : \" کیوں نہیں ! ( بتاؤ ) اس نے کہا : زمین ایک ( بڑی سی ) روئی بن جا ئے گی ۔ جس طرح ( اس کی آمد سے قبل خود ) رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا ۔ ( ابو سعید رضی اللہ عنہ نے ) کہا : تو رسول اللہ صلی اللہ علیہ وسلم نے ہماری طرف دیکھا پھر آپ ہنسے حتی کہ آپ کے پچھلے دندان مبارک نظر آنے لگے ۔ اس نے ( پھر ) کہا : کیامیں آپ کو ان کے سالن کے بارے میں نہ بتاؤں ؟آپ نے فرمایا : \" کیوں نہیں ( بتاؤ ) \" اس نے کہا \" ان کا سالن بالام اور نون ہو گا یہ صحابہ کرام رضوان اللہ عنھم اجمعین نے پوچھا وہ کیا ہے ؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" بیل اور مچھلی یہ اس کے جگر کے چھوٹے سے اضافی حصے کو ( جوا صل جگر کے ساتھ ایک طرف موجود ہو تا ہے ) ستر ہزار لوگ کھائیں ۔ \"",
                "urduNarrator": "ہم سے عبدالملک بن شعیب بن لیث نے بیان کیا، کہا کہ مجھ سے میرے والد نے میرے دادا کی سند سے بیان کیا، مجھ سے خالد بن یزید نے سعید بن ابی ہلال سے، زید بن ابی ہلال کی سند سے انہوں نے اسلام قبول کیا, عطاءبن یسار نے حضرت ابو سعید خدری رضی اللہ عنہ سے اور انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ حَدَّثَنِي أَبِي عَنْ جَدِّي حَدَّثَنِي خَالِدُ بْنُ يَزِيدَ عَنْ سَعِيدِ بْنِ أَبِي هِلَالٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تَكُونُ الْأَرْضُ يَوْمَ الْقِيَامَةِ خُبْزَةً وَاحِدَةً يَكْفَؤُهَا الْجَبَّارُ بِيَدِهِ كَمَا يَكْفَأُ أَحَدُكُمْ خُبْزَتَهُ فِي السَّفَرِ نُزُلًا لِأَهْلِ الْجَنَّةِ قَالَ فَأَتَى رَجُلٌ مِنْ الْيَهُودِ فَقَالَ بَارَكَ الرَّحْمَنُ عَلَيْكَ أَبَا الْقَاسِمِ أَلَا أُخْبِرُكَ بِنُزُلِ أَهْلِ الْجَنَّةِ يَوْمَ الْقِيَامَةِ قَالَ بَلَى قَالَ تَكُونُ الْأَرْضُ خُبْزَةً وَاحِدَةً كَمَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَنَظَرَ إِلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ ضَحِكَ حَتَّى بَدَتْ نَوَاجِذُهُ قَالَ أَلَا أُخْبِرُكَ بِإِدَامِهِمْ قَالَ بَلَى قَالَ إِدَامُهُمْ بَالَامُ وَنُونٌ قَالُوا وَمَا هَذَا قَالَ ثَوْرٌ وَنُونٌ يَأْكُلُ مِنْ زَائِدَةِ كَبِدِهِمَا سَبْعُونَ أَلْفًا.",
                "headingArabic": "نُزُلِ أَهْلِ الْجَنَّةِ ‏‏",
                "headingUrdu": "اہل جنت کی خوش آئند دعوت",
                "headingEnglish": "The Welcoming Feast Of The People Of Paradise",
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14619,
                "hadithNumber": "7058",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: If ten scholars of the Jews would follow me, no Jew would be left upon the surface of the earth who would not embrace Islam.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے فرمایا : اگر دس ( بڑے ) یہودی ( عالم ) میری پیروی کر لیتے تو روئے زمین پر کوئی یہودی باقی نہ رہتا مگر مسلمان ہو جا تا ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن حبیب الحارث نے بیان کیا، ہم سے خالد بن حارث نے بیان کیا، ہم سے قرہ نے بیان کیا, محمد بن سیرین نے ہمیں حضرت ابو ہریرۃ رضی اللہ عنہ سے حدیث بیان کی کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ حَدَّثَنَا قُرَّةُ حَدَّثَنَا مُحَمَّدٌ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ تَابَعَنِي عَشَرَةٌ مِنْ الْيَهُودِ لَمْ يَبْقَ عَلَى ظَهْرِهَا يَهُودِيٌّ إِلَّا أَسْلَمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14620,
                "hadithNumber": "7059",
                "englishNarrator": "`Abdullah (bin Mas`ud) رضی اللہ عنہ reported:",
                "hadithEnglish": "As I was going along with Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم) in a cultivable land and he (the Holy Prophet) was walking with the support of a wood, a group of Jews happened to meet him. Some of them said to the others: Ask him about the Soul. They said: What is your doubt about it? There is a possibility that you may ask him about anything (the answer of) which you may not like. They said: Ask him. So one amongst them asked him about the Soul. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) kept quiet and he gave no reply and I came to know that revelation was being sent to him, so I stood at my place and thus this revelation descended upon him: They ask thee about the Soul. Say: The Soul is by the Commandment of my Lord, and of Knowledge you are given but a little (xvii. 58).",
                "hadithUrdu": "ایک مرتبہ میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک کھیت میں چلا جارہا تھا نبی صلی اللہ علیہ وسلم کھجور کی ایک شاخ کا سہارا لے ( کر چل ) رہے تھے کہ آپ کا یہود کے چند لوگوں کے قریب سے گزر ہوا ان میں سے ایک نے دوسرے سے کہا : ان سے روح کے بارے میں سوال کرو پھر وہ ایک دوسرے سے کہنے لگے : ان کے بارے میں تمھیں شک کس بات کا ہے؟ایسا نہ ہو کہ وہ آگے سے ایسی بات کہہ دیں جو تمھیں بری لگے پھر ان میں سے ایک شخص کھڑا ہوکر آپ کے پاس آگیا اور آپ صلی اللہ علیہ وسلم سے روح کے بارے میں سوال کیا ۔ ( حضرت عبد اللہ بن مسعود رضی اللہ تعالیٰ عنہ نے ) کہا : رسول اللہ صلی اللہ علیہ وسلم ( تھوڑی دیر کے لیے ) خاموش ہو گئے اور ان کو کو ئی جواب نہ دیا ۔ مجھے معلوم ہو گیا کہ آپ پروحی نازل ہو رہی ہے ۔ کہا میں بھی اپنی جگہ پر ( رک کر ) کھڑا ہو گیا ۔ جب وحی نازل ہو چکی تو آپ صلی اللہ علیہ وسلم نے ( یہ پڑھتے ہوئے ) فرمایا : \" یہ لوگ آپ سے روح کے بارے میں سوال کرتے ہیں ۔ کہہ دیجیے روح میرے رب کے حکم سے ہے اور تم ( انسانوں ) کو بہت کم علم دیا گیا ہے ۔",
                "urduNarrator": "حفص بن غیاث نے کہا : ہمیں میرے والد نے حدیث بیان کی کہا : ہمیں اعمش نے حدیث بیان کی ، کہا : مجھے ابراہیم نے علقمہ سے حدیث بیان کی ، انھوں نے حضرت عبد اللہ بن مسعود رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ حَدَّثَنَا أَبِي حَدَّثَنَا الْأَعْمَشُ حَدَّثَنِي إِبْرَاهِيمُ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَ بَيْنَمَا أَنَا أَمْشِي مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَرْثٍ وَهُوَ مُتَّكِئٌ عَلَى عَسِيبٍ إِذْ مَرَّ بِنَفَرٍ مِنْ الْيَهُودِ فَقَالَ بَعْضُهُمْ لِبَعْضٍ سَلُوهُ عَنْ الرُّوحِ فَقَالُوا مَا رَابَكُمْ إِلَيْهِ لَا يَسْتَقْبِلُكُمْ بِشَيْءٍ تَكْرَهُونَهُ فَقَالُوا سَلُوهُ فَقَامَ إِلَيْهِ بَعْضُهُمْ فَسَأَلَهُ عَنْ الرُّوحِ قَالَ فَأَسْكَتَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يَرُدَّ عَلَيْهِ شَيْئًا فَعَلِمْتُ أَنَّهُ يُوحَى إِلَيْهِ قَالَ فَقُمْتُ مَكَانِي فَلَمَّا نَزَلَ الْوَحْيُ قَالَ وَيَسْأَلُونَكَ عَنْ الرُّوحِ قُلْ الرُّوحُ مِنْ أَمْرِ رَبِّي وَمَا أُوتِيتُمْ مِنْ الْعِلْمِ إِلَّا قَلِيلًا.",
                "headingArabic": "سُؤَالِ الْيَهُودِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الرُّوحِ وَقَوْله تَعَالَى يَسْأَلُونَكَ عَنْ الرُّوحِ الْآيَةَ",
                "headingUrdu": "یہودیوں کا نبی صلی اللہ علیہ وسلم سے روح کے بارے میں سوال کرنا اور اللہ کے الفاظ: \"اور وہ آپ سے روح (روح) کے بارے میں پوچھتے ہیں\"",
                "headingEnglish": "The Jews' Asking The Prophet (SAW) About The Soul, And The Words Of Allah: \"And They Ask You Concerning The Ruh (The Spirit)\"",
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14621,
                "hadithNumber": "7060",
                "englishNarrator": "Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "I was walking along with Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) in a field of Medina. a Hadith lie that of Hafs (no. 7059).",
                "hadithUrdu": "میں نبی صلی اللہ علیہ وسلم کے ساتھ مدینہ کے ایک ( اجزائے ہوئے ) کھیت میں جارہاتھا ۔ حفص کی حدیث کے مانند مکروکیع کی حدیث میں ہے : \"\" وَمَا أُوتِيتُم مِّنَ الْعِلْمِ إِلَّا قَلِيلًا \"\" \"\" اور تم لوگوں کو علم کا تھوڑا حصہ ہی دیا گیا ہے ۔ \"\" ( جس طرح قرآن کی مشہور متواتر قرآءت ہے ۔ اور عیسیٰ بن یو نس کی اس روایت میں جوان سے ( علی ) بن خشرم نے بیان کی ہے وما اوتوا \"\" انھیں نہیں دیا گیا \"\" کے الفاظ ہیں ۔",
                "urduNarrator": "ابو بکر بن ابی شیبہ اور ابو اشج نے ہمیں حدیث بیان کی ، دونوں نے کہا : ہمیں وکیع نے حدیث بیان کی ، نیز ہمیں اسحٰق بن ابراہیم حنظلی اور علی بن خشرم نے بھی حدیث بیان کی دونوں نے کہا : ہمیں عیسیٰ بن یونس نے خبر دی ۔ ان دونوں ( وکیع اور عیسیٰ ) نےاعمش سے ، انھوں نے ابراہیم سے ، انھوں نے حضرت عبد اللہ ( بن مسعود رضی اللہ عنہ ) سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو سَعِيدٍ الْأَشَجُّ قَالَا حَدَّثَنَا وَكِيعٌ ح و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ وَعَلِيُّ بْنُ خَشْرَمٍ قَالَا أَخْبَرَنَا عِيسَى بْنُ يُونُسَ كِلَاهُمَا عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَ كُنْتُ أَمْشِي مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَرْثٍ بِالْمَدِينَةِ بِنَحْوِ حَدِيثِ حَفْصٍ غَيْرَ أَنَّ فِي حَدِيثِ وَكِيعٍ وَمَا أُوتِيتُمْ مِنْ الْعِلْمِ إِلَّا قَلِيلًا وَفِي حَدِيثِ عِيسَى بْنِ يُونُسَ وَمَا أُوتُوا مِنْ رِوَايَةِ ابْنِ خَشْرَمٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14622,
                "hadithNumber": "7061",
                "englishNarrator": "Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "The prophet ﷺ was among the date palms, leaving on a palm branch...' then he mention a hadith like the Hadith narrated from Al-Amash (no. 7060).\r\nAllah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was reclining against a tree in the garden. The rest of the hadith is the same with a slight variation of wording.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ایک کھجور کے درخت میں ایک درخت سے ٹیک لگائے ہوئے تھے، پھر آپ نے ان کی حدیث سے ملتا جلتا ایک چیز الاعمش کی روایت میں بیان کی، اور آپ صلی اللہ علیہ وسلم نے اپنی روایت میں فرمایا: اور جو کچھ تمہیں علم دیا گیا ہے سوائے تھوڑے کے۔",
                "urduNarrator": "ابو سعید اشج نے ہمیں حدیث بیان کی ، کہا : میں نے عبد اللہ بن ادریس سے سنا وہ کہہ رہے تھے ، میں نے اعمش سے سنا وہ اس روایت کو عبداللہ رضی اللہ تعالیٰ عنہ بن مرہ سے اور وہ مسروق سے اور وہ حضرت عبد اللہ بن مسعود رضی اللہ عنہ سے روایت کر رہے تھے ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ إِدْرِيسَ يَقُولُ سَمِعْتُ الْأَعْمَشَ يَرْوِيهِ عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ عَنْ مَسْرُوقٍ عَنْ عَبْدِ اللَّهِ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نَخْلٍ يَتَوَكَّأُ عَلَى عَسِيبٍ ثُمَّ ذَكَرَ نَحْوَ حَدِيثِهِمْ عَنْ الْأَعْمَشِ وَقَالَ فِي رِوَايَتِهِ وَمَا أُوتِيتُمْ مِنْ الْعِلْمِ إِلَّا قَلِيلًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14623,
                "hadithNumber": "7062",
                "englishNarrator": "Khabbab رضی اللہ  عنہ reported:",
                "hadithEnglish": "Al-`As bin Wa'il owed debt to me. I came to him in order to demand that. He said: I will never repay you unless you belie Muhammad. I said: I would never belie Muhammad until you die and you are again raised up. He said: When I would be raised up after death, I would repay your debt when I would get my property and children back. Waki` said: This is how Al-A`mash has narrated and it was on this occasion that this verse was revealed: Hast thou seen him who disbelieves in Our message and says: I shall certainly be given wealth and children (xix, 77) up to he would come to Us alone (xix, 80).",
                "hadithUrdu": "کہا میرا کچھ قرض عاص بن وائل کے ذمے تھا ۔ میں اس سے قرض کا تقاضا کرنے کے لیے اس کے پاس گیا تو اس نے مجھ سے کہا : میں اس وقت تک تمھیں ادائیگی نہیں کروں گا ۔ یہاں تک کہ تم نعوذ باللہ محمد صلی اللہ علیہ وسلم سے کفر کرو ۔ کہا : میں نے اس سے کہا : تم مر کردوبارہ زندہ ہو جاؤ گے ۔ پھر بھی میں محمد صلی اللہ علیہ وسلم کے ساتھ کفر نہیں کروں گا ۔ اس نے کہا : اور میں موت کے بعد دوبارہ زندہ کیا جاؤں گا؟تو ( اس وقت ) جب میں دوبارہ مال اور اولاد کے پاس پہنچ جاؤں گاتو تمھیں ادائیگی کردوں گا ۔ وکیع نے کہا : اعمش نے اسی طرح کہا : انھوں نے کہا : اس پریہ آیت نازل ہوئی : \"\" کیا آپ نے اس شخص کو دیکھا جس نے ہماری آیات سے کفر کیا اور کہا : مجھے ( اپنا ) مال اور ( اپنی ) اولاد ضروری دی جائے گی \"\" سے لے کر اس ( اللہ ) کے فرمان \"\" اور وہ ہمارے پاس اکیلا آئے گا \"\" تک ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور عبداللہ بن سعید نے بیان کیا کہ سب سے زیادہ اشجار اور الفاظ عبداللہ ہی سے ہیں، انہوں نے کہا: وکیع نے کہا : ہمیں اعمش نے ابو ضحیٰ سے حدیث بیان کی ، انھوں نے مسروق سے اور انھوں نے حضرت خباب ( بن ارت رضی اللہ  عنہ ) سے روایت کی",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَبْدُ اللَّهِ بْنُ سَعِيدٍ الْأَشَجُّ وَاللَّفْظُ لِعَبْدِ اللَّهِ قَالَا حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي الضُّحَى عَنْ مَسْرُوقٍ عَنْ خَبَّابٍ قَالَ كَانَ لِي عَلَى الْعَاصِ بْنِ وَائِلٍ دَيْنٌ فَأَتَيْتُهُ أَتَقَاضَاهُ فَقَالَ لِي لَنْ أَقْضِيَكَ حَتَّى تَكْفُرَ بِمُحَمَّدٍ قَالَ فَقُلْتُ لَهُ إِنِّي لَنْ أَكْفُرَ بِمُحَمَّدٍ حَتَّى تَمُوتَ ثُمَّ تُبْعَثَ قَالَ وَإِنِّي لَمَبْعُوثٌ مِنْ بَعْدِ الْمَوْتِ فَسَوْفَ أَقْضِيكَ إِذَا رَجَعْتُ إِلَى مَالٍ وَوَلَدٍ قَالَ وَكِيعٌ كَذَا قَالَ الْأَعْمَشُ قَالَ فَنَزَلَتْ هَذِهِ الْآيَةُ أَفَرَأَيْتَ الَّذِي كَفَرَ بِآيَاتِنَا وَقَالَ لَأُوتَيَنَّ مَالًا وَوَلَدًا إِلَى قَوْلِهِ وَيَأْتِينَا فَرْدًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14624,
                "hadithNumber": "7063",
                "englishNarrator": "A Hadith like that of Waki (no. 7062) was narrated from Al-Amash with this chain of narrators, and in the hadith of Jarir it says:",
                "hadithEnglish": "\"I was a blacksmith during the jahiliyyah, I did some work for Al-As bin Wail, I came to him to ask him to pay me.",
                "hadithUrdu": "میں زمانہ جاہلیت میں لوہار تھا تو میں نے عاص بن وائل کے لیے کام کیا پھر میں اس سے ( اجرت کا ) تقاضا کرنے کے لیے آیا ۔",
                "urduNarrator": "ہم سے ابو کریب نے بیان کیا ,ابو معاویہ عبد اللہ بن نمیر جریر اور سفیان سب نے اعمش سے اسی سند کے ساتھ وکیع کی حدیث کی طرح بیان کیا اور جریر کی حدیث میں ہے ۔ ( حضرت خباب رضی اللہ عنہ نے ) کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا جَرِيرٌ و حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ كُلُّهُمْ عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ نَحْوَ حَدِيثِ وَكِيعٍ وَفِي حَدِيثِ جَرِيرٍ قَالَ كُنْتُ قَيْنًا فِي الْجَاهِلِيَّةِ فَعَمِلْتُ لِلْعَاصِ بْنِ وَائِلٍ عَمَلًا فَأَتَيْتُهُ أَتَقَاضَاهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14625,
                "hadithNumber": "7064",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "Abu Jahl said: O Allah, if he is true, then shower upon us the volley of stones from the sky or inflict upon us a grievous torment, and it was on this occasion that this verse was revealed: 'Allah would never torment them so long as you are amongst them. And Allah is not going to torment them as long as they seek forgiveness. And why is it that Allah should not torment them and they prevent people from coming to the sacred mosque.... (viii. 34) to the end.",
                "hadithUrdu": "ابو جہل نے کہا : اے اللہ !اگر ( یہ جو محمد صلی اللہ علیہ وسلم لے کر آئے ہیں ) یہی تیری طرف سے حق ہے تو ہم پر آسمان سے پتھر برسادے یا ہم پر کوئی دردناک عذاب لے آ ۔ تو اس پر ( آیت ) نازل ہوئی : \" اللہ تعالیٰ اس وقت ان پر ( اس طرح کا ) عذاب بھیجنے والا نہ تھا جبکہ آپ بھی ان میں موجود تھے اور اللہ تعالیٰ ان کو عذاب دینے والا نہ تھا جب وہ ( علیحدگی میں ) استغفار کیے جارہے تھے ۔ اور انھیں کیا ہے کہ اللہ انھیں عذاب نہ دےجبکہ وہ ( ایمان لانے والوں کو ) مسجد حرام سے روکتے ہیں ۔ \" آیت کے آخرتک ۔",
                "urduNarrator": "ہم سے عبید اللہ بن معاذ العنبری نے بیان کیا, شعبہ نے عبد الحمید زیادی سے روایت کی انھوں نے حضرت انس بن مالک رضی اللہ عنہ سے سنا : وہ کہہ رہے تھے کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ الْحَمِيدِ الزِّيَادِيِّ أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ يَقُولُ قَالَ أَبُو جَهْلٍ اللَّهُمَّ إِنْ كَانَ هَذَا هُوَ الْحَقَّ مِنْ عِنْدِكَ فَأَمْطِرْ عَلَيْنَا حِجَارَةً مِنْ السَّمَاءِ أَوْ ائْتِنَا بِعَذَابٍ أَلِيمٍ فَنَزَلَتْ وَمَا كَانَ اللَّهُ لِيُعَذِّبَهُمْ وَأَنْتَ فِيهِمْ وَمَا كَانَ اللَّهُ مُعَذِّبَهُمْ وَهُمْ يَسْتَغْفِرُونَ وَمَا لَهُمْ أَلَّا يُعَذِّبَهُمْ اللَّهُ وَهُمْ يَصُدُّونَ عَنْ الْمَسْجِدِ الْحَرَامِ إِلَى آخِرِ الْآيَةِ.",
                "headingArabic": "فِي قَوْلِهِ تَعَالَى ‏{‏ وَمَا كَانَ اللَّهُ لِيُعَذِّبَهُمْ وَأَنْتَ فِيهِمْ}",
                "headingUrdu": "اللہ عزوجل کا فرمان ہے: \"اور اللہ ان کو عذاب نہیں دے گا جب تک کہ تم ان کے درمیان ہو\"۔",
                "headingEnglish": "The Words Of Allah The Most High: \"And Allah Would Not Punish Them While You Are Amongst Them\"",
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14626,
                "hadithNumber": "7065",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Abu Jahl asked (people) whether Muhammad placed his face (on the ground) in their presence. It was said to him: Yes. He said: By Lat and `Uzza. If I were to see him do that, I would trample his neck, or I would smear his face with dust. He came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as he was engaged in prayer and thought of trampling his neck (and the people say) that he came near him but turned upon his heels and tried to repulse something with his hands. It was said to him: What is the matter with you? He said: There is between me and him a ditch of fire and terror and wings. Thereupon Allah's Messenger (may peace he upon him) said: If he were to come near me the angels would have torn him to pieces. Then Allah, the Exalted and Glorious, revealed this verse- (the narrator) said: We do not know whether it is the hadith transmitted by Abu Huraira رضی اللہ عنہ or something conveyed to him from another source: Nay, man is surely inordinate, because he looks upon himself as self-sufficient. Surely to thy Lord is the return. Hast thou seen him who forbids a servant when he prays? Seest thou if he is on the right way, or enjoins observance of piety? Seest thou if he [Abu Jahl] denies and turns away? Knowest he not that Allah sees? Nay, if he desists not, We will seize him by the forelock-a lying, sinful forelock. Then let him summon his council. We will summon the guards of the Hell. Nay! Obey not thou him (lcvi, 6-19). (Rather prostrate thyself.) Ubaidullah made this addition: It was after this that (prostration) was enjoined upon and Ibn Abd al-Ala made this addition that by Nadiyah he meant his people.",
                "hadithUrdu": "ابوجہل نے کہا : کیا محمدتم لوگوں کے سامنے اپنا چہرہ زمین پر رکھتے ہیں؟ ( حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ نے ) کہا : تو کہا گیا : ہاں چنانچہ اس نے کہا : لات اور عزیٰ کی قسم !اگر میں نے ان کو ایسا کرتے ہوئے دیکھ لیا تو میں ان کی گردن کو روندوں گا یا ان کے چہرےکو مٹی میں ملاؤں گا ( العیاذ باللہ! ) کہا : پھر جب رسول اللہ صلی اللہ علیہ وسلم نماز پڑھ رہے تھے وہ آپ کے پاس آیا اور یہ ارادہ کیا کہ آپ کی گردن مبارک کوروندے ( ابوہریرہ رضی اللہ تعالیٰ عنہ نے ) کہا : تووہ انھیں اچانک ایڑیوں کے بل پلٹتا ہوا اور اپنے دونوں ہاتھوں ( کو آگے کر کے ان ) سے اپنا بچاؤ کرتا ہوا نظر آیا ۔ ( ابوہریرہ رضی اللہ تعالیٰ عنہ نے ) کہا : تو اس سے کہا کیا : تمھیں کیا ہوا ؟تو اس نے کہا : میرے اور اس کے درمیان آگ کی ایک خندق اور سخت ہول ( پیدا کرنے والی مخلوق ) اور بہت سے پر تھے ۔ تو رسول اللہ صلی اللہ علیہ وسلم نےفرمایا : \"\" اگر وہ میرے قریب آتا تو فرشتے اس کے ایک ایک عضو کو اچک لیتے ۔ ( ابو ہریرہ رضی اللہ تعالیٰ عنہ نے ) کہا : اس پر اللہ تعالیٰ نے یہ آیاتنازل فرمائیں ۔ ( ابو حازم نے کہا ۔ ( ہمیں معلوم نہیں کہ یہ ابو ہریرہ رضی اللہ تعالیٰ عنہ کی ( رسول اللہ صلی اللہ علیہ وسلم سے سنی ہوئی ) اپنی حدیث ہے یا انھیں ( کسی کی طرف سے ) پہنچی ہے ۔ ( وہ آیات یہ تھیں ) \"\" اس کے سواکوئی بات نہیں کہ انسان ہر صورت میں سر کشی کرتا ہے اس لیے کہ وہ خود کو دیکھتا ہے کہ وہ ہر ایک سے مستغنی ہے حقیقت یہ ہے کہ ( اسے ) آپ کے رب کی طرف واپس جانا ہے ۔ آپ نے اسے دیکھا جو روکتا ہے ۔ ( اللہ کے ) بندے کو جب وہ نماز اداکرتا ہے ۔ کیا تم نے دیکھا کہ اگر وہ ( اللہ کا بندہ ) ہدایت پر ہو اور تقوی کا حکم دیتا ہو ( تو روکنے والے کا کیا بنے گا؟ ) کیا آپ نے دیکھا کہ آکر اس یعنی ابو جہل نے جھٹلایا ہے اور ہدایت سے منہ پھیراہے ۔ ( تو ) کیا وہ نہیں جانتا کہ اللہ دیکھتا ہے ۔ ہر گز نہیں !اگر وہ باز نہ آیا تو ہم ( اسے ) پیشانی سے پکڑ کر کھینچیں کے ۔ ( اس کی ) جھوٹی گناہ کرنے والی پیشانی سے پھر وہ اپنی مجلس کو ( مددکے لیے ) پکارے ہم عذاب دینے والے فرشتوں کو بلائیں گے ۔ ہر گز نہیں!آپ اس کی ( کوئی بات بھی ) نہ مانیں ۔ \"\" عبید اللہ ( بن معاذ ) نے اپنی حدیث میں مزید کہا ۔ ( ابوہریرہ رضی اللہ تعالیٰ عنہ نے أَوْ أَمَرَ بِالتَّقْوَىٰ کی تفسیر کرتے ہوئے ) کہا : اور اس بات کا حکم دیتا ہو جس کا اس ( اللہ ) نے اسے حکم دیا ہے ۔ اور ( محمد ) بن عبد الاعلیٰ نے مزید یہ کہا : \"\" وہ اپنی مجلس کو پکارے \"\" یعنی اپنی قوم کو ۔",
                "urduNarrator": "عبید اللہ بن معاذ اور محمد بن عبد الاعلی قیسی نے ہمیں حدیث بیان کی دونوں نے کہا : ہمیں معتمر نے اپنے والد سے حدیث سنائی ، انھوں نے کہا : مجھے نعیم بن ابی ہندنےابوحازم سے حدیث بیان کی ، انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی کہا",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ وَمُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى الْقَيْسِيُّ قَالَا حَدَّثَنَا الْمُعْتَمِرُ عَنْ أَبِيهِ حَدَّثَنِي نُعَيْمُ بْنُ أَبِي هِنْدٍ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ أَبُو جَهْلٍ هَلْ يُعَفِّرُ مُحَمَّدٌ وَجْهَهُ بَيْنَ أَظْهُرِكُمْ قَالَ فَقِيلَ نَعَمْ فَقَالَ وَاللَّاتِ وَالْعُزَّى لَئِنْ رَأَيْتُهُ يَفْعَلُ ذَلِكَ لَأَطَأَنَّ عَلَى رَقَبَتِهِ أَوْ لَأُعَفِّرَنَّ وَجْهَهُ فِي التُّرَابِ قَالَ فَأَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يُصَلِّي زَعَمَ لِيَطَأَ عَلَى رَقَبَتِهِ قَالَ فَمَا فَجِئَهُمْ مِنْهُ إِلَّا وَهُوَ يَنْكُصُ عَلَى عَقِبَيْهِ وَيَتَّقِي بِيَدَيْهِ قَالَ فَقِيلَ لَهُ مَا لَكَ فَقَالَ إِنَّ بَيْنِي وَبَيْنَهُ لَخَنْدَقًا مِنْ نَارٍ وَهَوْلًا وَأَجْنِحَةً فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ دَنَا مِنِّي لَاخْتَطَفَتْهُ الْمَلَائِكَةُ عُضْوًا عُضْوًا قَالَ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ لَا نَدْرِي فِي حَدِيثِ أَبِي هُرَيْرَةَ أَوْ شَيْءٌ بَلَغَهُ كَلَّا إِنَّ الْإِنْسَانَ لَيَطْغَى أَنْ رَآهُ اسْتَغْنَى إِنَّ إِلَى رَبِّكَ الرُّجْعَى أَرَأَيْتَ الَّذِي يَنْهَى عَبْدًا إِذَا صَلَّى أَرَأَيْتَ إِنْ كَانَ عَلَى الْهُدَى أَوْ أَمَرَ بِالتَّقْوَى أَرَأَيْتَ إِنْ كَذَّبَ وَتَوَلَّى يَعْنِي أَبَا جَهْلٍ أَلَمْ يَعْلَمْ بِأَنَّ اللَّهَ يَرَى كَلَّا لَئِنْ لَمْ يَنْتَهِ لَنَسْفَعًا بِالنَّاصِيَةِ نَاصِيَةٍ كَاذِبَةٍ خَاطِئَةٍ فَلْيَدْعُ نَادِيَهُ سَنَدْعُ الزَّبَانِيَةَ كَلَّا لَا تُطِعْهُ زَادَ عُبَيْدُ اللَّهِ فِي حَدِيثِهِ قَالَ وَأَمَرَهُ بِمَا أَمَرَهُ بِهِ وَزَادَ ابْنُ عَبْدِ الْأَعْلَى فَلْيَدْعُ نَادِيَهُ يَعْنِي قَوْمَهُ.",
                "headingArabic": "قَوْلِهِ ‏{‏ إِنَّ الإِنْسَانَ لَيَطْغَى * أَنْ رَآهُ اسْتَغْنَى‏}",
                "headingUrdu": "اللہ تعالیٰ کا ارشاد ہے: ’’بے شک انسان زیادتی کرتا ہے کیونکہ وہ اپنے آپ کو بے نیاز سمجھتا ہے۔‘‘",
                "headingEnglish": "The Words Of Allah: \"Verily, Man Does Transgress Because He Considers Himself Self-Sufficient.\"",
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14627,
                "hadithNumber": "7066",
                "englishNarrator": "Masruq reported:",
                "hadithEnglish": "We were sitting in the company of Abdullah and he was lying on the bed that a person came and said: Abu Abdul-Rabmin, a story-teller at the gates of Kinda says that the verse (of the Qur'an) which deals with the smoke implies that which is about to come and it would hold the breath of the infidels and would inflict the believers with cold. Thereupon Abdullah got up and said in anger. O people, fear Allah and say only that which one knows amongst you and do not say which he does not know and he should simply say: Allah has the best knowledge for He has the best knowledge amongst all of you. It does not behave him to say that which he does not know. Allah has the best knowledge of it. Verily Allah, the Exalted and Glorious, said to His Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) to state: I do not ask from you any remuneration and I am not the one to put you in trouble, and when Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) saw people turning back (from religion) he said: O Allah, afflict thern with seven famines as was done in the case of Yusuf, so they were afflicted with famine by which they were forced to eat everything until they were obliged to eat the hides and the dead bodies because of hunger, and every one of them looked towards the sky and he found a smoke. And Abu Sufyan came and he said: Muhammad, you have come to command us to obey Allah and cement the ties of blood- relation whereas your people are undone; supplicate Allah for tlicm. Thereupon Allah, the Exalted and Glorious, said: Wait for the day when there would be clear smoke from the sky which would envelop people and that would be grievous torivent up to the words: you are going to return to (evil). (if this verse implied the torment of the next life) could the chastisement of the next (life) be averted (as the Qur'an states): On the day when We seize (them) with the most violent seizing; surely We shall exact retribution (xliv. 16)? The seizing (in the hadith) implies that of the Day of Badr. And so far as the sign of smoke, seizing, inevitability and signs of Rome are concerned, they have become things of the past now.",
                "hadithUrdu": "ہم حضرت عبداللہ ( بن مسعود رضی اللہ عنہ ) کے پاس بیٹھے ہوئے تھے اور وہ ہمارے درمیان ( اپنے بستر یا بچھونے پر ) لیٹے ہوئے تھے تو ایک شخص آیا اور کہنے لگا : ابو عبدالرحمن!ابواب کندہ ( کوفہ کا ایک محلہ ) میں ایک قصہ گو ( واعظ ) آیا ہوا ہے ، وہ وعظ کررہا ہے اور یہ کہتا ہے کہ دھوئیں والی ( اللہ کی ) نشانی آئے گی اور ( یہ د ھواں ) کافروں کی روحیں قبض کرلے گا اور مومنوں کو یہ زکام جیسی کیفیت سے دو چار کرے گا ۔ حضرت عبداللہ ( بن مسعود رضی اللہ عنہ ) نے کہا اور وہ غصے کے عالم میں اٹھ کر بیٹھ گئے ، لوگو! اللہ سے ڈرو ، تم میں سے جو شخص کوئی چیز جانتا ہو ، وہ اتنی ہی بیان کرے جتنی جانتاہو اور جو نہیں جانتا ، وہ کہے : اللہ زیادہ جاننے والا ہے ۔ بے شک وہ ( اللہ تعالیٰ ) تم میں سے اس کو ( بھی ) زیادہ جاننے والاہے ۔ جو اس بات کے بارے میں جو وہ نہیں جانتا ، یہ کہتا ہے : اللہ زیادہ جاننے والا ہے ۔ اللہ عزوجل نے ا پنے نبی کریم صلی اللہ علیہ وسلم سے فرمایا؛ \"\" کہہ دیجئے : میں تم سے کوئی اجر نہیں مانگتا اور نہ ہی بناوٹ کرنے والوں میں سے ہوں ۔ \"\" رسول اللہ صلی اللہ علیہ وسلم نے جب لوگوں کی دین سے روگردانی دیکھی تو آپ نے ( دعا کرتے ہوئے ) فرمایا : \"\" اے اللہ! ( ان پر ) یوسف علیہ السلام کےسات سالوں جیسے سات سال ( بھیج دے ۔ ) \"\" ( عبداللہ بن مسعود رضی اللہ تعالیٰ عنہ نے ) کہا : تو انھیں ( قحط کے ) ایک سال نے آلیا جس نے ہر چیز کاصفایاکرایا ، یہاں تک کہ ان ( مشرک ) لوگوں نے بھوک سے چمڑے اور مردار تک کھائے ۔ ان میں سے کوئی شخص آسمان کی طرف دیکھتا تو اسے دھوئیں کے جیسی ایک چیز چھائی ہوئی نظر آتی ۔ چنانچہ ابو سفیان رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں آیا اور کہا : اے محمد ( صلی اللہ علیہ وسلم ) آپ آئے ہیں ، اللہ کی اطاعت اور صلہ رحمی کاحکم دیتے ہیں ، آپ کی قوم ( قحط اور بھوک سے ) ہلاک ہورہی ہے ۔ ان کےلیے اللہ سے دعا کریں ۔ اللہ عزوجل نے فرمایا : \"\" آپ اس دن کا انتظار کریں جب آسمان ایک نظر آنے والے دھوئیں کو لے آئے گا ۔ ( اور وہ ) لوگوں کو ڈھانپ لے گا ۔ یہ دردناک عذاب ہوگا ، سے لے کر اس کے فرمان : \"\" نے شک تم ( کفر میں ) لوٹ جانے والے ہوگئے \"\" تک ۔ ( حضرت عبداللہ بن مسعود رضی اللہ تعالیٰ عنہ نے ) کہا : کیا آخرت کا عذاب ہٹایا جائے گا؟ \"\" جس دن ہم تم پر بڑی گرفت کریں گے ( اس دن ) ہم انتقام لینے والے ہوں گے ۔ \"\" وہ گرفت بدر کے دن تھی ۔ اب تک دھوئیں کی نشانی گرفت اور چمٹ جانےوالا عذاب ( بدر میں شکست فاش اور قتل ) اور روم ( کی فتح ) کی نشانی ( سب ) آکر گذر چکی ہیں ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے جریر نے بیان کیا, منصور نے ابو ضحیٰ ( مسلم بن صحیح ) سے ، انھوں نے مسروق سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ أَبِي الضُّحَى عَنْ مَسْرُوقٍ قَالَ كُنَّا عِنْدَ عَبْدِ اللَّهِ جُلُوسًا وَهُوَ مُضْطَجِعٌ بَيْنَنَا فَأَتَاهُ رَجُلٌ فَقَالَ يَا أَبَا عَبْدِ الرَّحْمَنِ إِنَّ قَاصًّا عِنْدَ أَبْوَابِ كِنْدَةَ يَقُصُّ وَيَزْعُمُ أَنَّ آيَةَ الدُّخَانِ تَجِيءُ فَتَأْخُذُ بِأَنْفَاسِ الْكُفَّارِ وَيَأْخُذُ الْمُؤْمِنِينَ مِنْهُ كَهَيْئَةِ الزُّكَامِ فَقَالَ عَبْدُ اللَّهِ وَجَلَسَ وَهُوَ غَضْبَانُ يَا أَيَّهَا النَّاسُ اتَّقُوا اللَّهَ مَنْ عَلِمَ مِنْكُمْ شَيْئًا فَلْيَقُلْ بِمَا يَعْلَمُ وَمَنْ لَمْ يَعْلَمْ فَلْيَقُلْ اللَّهُ أَعْلَمُ فَإِنَّهُ أَعْلَمُ لِأَحَدِكُمْ أَنْ يَقُولَ لِمَا لَا يَعْلَمُ اللَّهُ أَعْلَمُ فَإِنَّ اللَّهَ عَزَّ وَجَلَّ قَالَ لِنَبِيِّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُلْ مَا أَسْأَلُكُمْ عَلَيْهِ مِنْ أَجْرٍ وَمَا أَنَا مِنْ الْمُتَكَلِّفِينَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا رَأَى مِنْ النَّاسِ إِدْبَارًا فَقَالَ اللَّهُمَّ سَبْعٌ كَسَبْعِ يُوسُفَ قَالَ فَأَخَذَتْهُمْ سَنَةٌ حَصَّتْ كُلَّ شَيْءٍ حَتَّى أَكَلُوا الْجُلُودَ وَالْمَيْتَةَ مِنْ الْجُوعِ وَيَنْظُرُ إِلَى السَّمَاءِ أَحَدُهُمْ فَيَرَى كَهَيْئَةِ الدُّخَانِ فَأَتَاهُ أَبُو سُفْيَانَ فَقَالَ يَا مُحَمَّدُ إِنَّكَ جِئْتَ تَأْمُرُ بِطَاعَةِ اللَّهِ وَبِصِلَةِ الرَّحِمِ وَإِنَّ قَوْمَكَ قَدْ هَلَكُوا فَادْعُ اللَّهَ لَهُمْ قَالَ اللَّهُ عَزَّ وَجَلَّ فَارْتَقِبْ يَوْمَ تَأْتِي السَّمَاءُ بِدُخَانٍ مُبِينٍ يَغْشَى النَّاسَ هَذَا عَذَابٌ أَلِيمٌ إِلَى قَوْلِهِ إِنَّكُمْ عَائِدُونَ قَالَ أَفَيُكْشَفُ عَذَابُ الْآخِرَةِ يَوْمَ نَبْطِشُ الْبَطْشَةَ الْكُبْرَى إِنَّا مُنْتَقِمُونَ فَالْبَطْشَةُ يَوْمَ بَدْرٍ وَقَدْ مَضَتْ آيَةُ الدُّخَانِ وَالْبَطْشَةُ وَاللِّزَامُ وَآيَةُ الرُّومِ.",
                "headingArabic": "الدُّخَانِ ‏‏",
                "headingUrdu": "دھواں (اد دخان)",
                "headingEnglish": "The Smoke (Ad-Dukhan)",
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14628,
                "hadithNumber": "7067",
                "englishNarrator": "Masruq reported:",
                "hadithEnglish": "There came to Abdullah رضی اللہ عنہ a person and said: I have left behind in the mosque a man who explains the Qur'an according to his personal discretion and he explained this verse: So wait for the day when the Heaven brings a clear smoke. He says that a smoke would come to the people on the Day of Resurrection anl it will withhold breath and they would be inflicted with cold. 'Abdullahرضی اللہ عنہ said: He who has knowledge should say something and he who has no knowledge should simply say: Allah is best aware. This reflects the understanding of a person that he should say about that which he does not know that it is Allah who knows best. The fact is that when the Quraish disobeyed Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) he supplicated Allah that they should be afflicted with famine and starvation as was done in case of Yusuf. And they were so much hard pressed that a person would ace the sky and he would see between him and the sky something like smoke and they were so much hard pressed that they began to cat the bones, and a person came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and said: Allah's Messenger. seek forgiveness for the tribe of Mudar for (its people) have been undone. The Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: For Mudar? You are overbold, but he supplicated Allah for them. It was upon this that this verse was revealed: We shall remove the chastisement a little, but they will surely return to evil (xliv. 15). lie (the narrator) said: There was a downpoor of rain upon them. When there was some relief for them they returned to the same position as they had been before, and Allah, the Exalted and Glorious, revealed this verse: So wait for the day when the heaven brings a clear smoke enveloping people. This is a grievous torment on the day when We seize them with the most violent seizing; surely, We shall exact retribution. And this (seizing) implied (Battle) of Badr.",
                "hadithUrdu": "حضرت عبداللہ ( بن مسعود رضی اللہ عنہ ) کے پاس ایک شخص آیا اور کہنے لگا : میں مسجد میں ایک ایسے شخص کو چھوڑ کر آرہا ہوں جو اپنی رائے سے قرآن مجید کی تفسیر کرتا ہے وہ ( قرآن کی ) آیت : \" جب آسمان سے واضح دھواں اٹھے گا \" کی تفسیر کرتا ہے ، کہتا ہے : \" قیامت کےدن لوگوں کے پاس ایک دھواں آئے گا جو لوگوں کی سانسوں کو گرفت میں لے لے گا ، یہاں تک کہ لوگوں کو زکام جیسی کیفیت ( جس میں سانس لینی مشکل ہوجاتی ہے ) درپیش ہوگی ، توحضرت عبداللہ ( بن مسعود رضی اللہ عنہ ) نے کہا : جس کے پاس علم ہو وہ اس کے مطابق بات کہے اور جو نہ جانتا ہو ، وہ کہے : اللہ زیادہ جاننے والا ہے ۔ یہ بات انسان کے فہم ( دین ) کاحصہ ہے ۔ کہ جس بات کو وہ نہیں جانتا اس کے بارے میں کہے : اللہ زیادہ جاننے والاہے ۔ اس ( دھوئیں ) کی حقیقت یہ تھی کہ قریش نے جب نبی کریم صلی اللہ علیہ وسلم کے خلاف سخت نافرمانی سے کام لیا تو آپ نے ان کے خلاف یوسف علیہ السلام ( کے زمانےوالے ) قحط کے سالوں جیسی قحط سالی کی دعاکی ۔ انھیں قحط اور تنگ دستی نے آلیا یہاں تک کہ ( ان میں سے ) کوئی شخص آسمان کی طرف دیکھنے لگتا تو بھوک کی شدت سے اسے اپنے اور آسمان کے درمیان دھواں ساچھایا ہوا نظرآتا یہاں تک کہ ان لوگوں نے ( بھوک کی شدت سے ) ہڈیاں تک کھائیں ، چنانچہ ( ان میں سے ) ایک شخص نبی کریم صلی اللہ علیہ وسلم کے پاس آیا اور عرض کی : اللہ کے رسول صلی اللہ علیہ وسلم !آپ ( قبیلہ ) مضر کے لئے بخشش طلب فرمائیں ۔ وہ ہلاکت کا شکار ہیں ، تو آ پ صلی اللہ علیہ وسلم نے فرمایا : \" مضر کے لئے؟تو بہت جراءت والا ہے ( کہ اللہ سے شرک اور اس کے رسول سے بغض کے باوجود د رخواست کررہا ہے کہ میں تمہارے لئے اللہ سے دعا کروں ) \" کہا : آپ صلی اللہ علیہ وسلم نے ( پھر بھی ) ان کے حق میں دعا فرمادی ۔ اس پر اللہ عزوجل نے ( آیت ) نازل فرمائی : \" ہم ( تم سے ) تھوڑے عرصے کے لئے عذاب ہٹادیتے ہیں ۔ تم ( پھر کفر ہی میں ) لوٹنے والا ہو ۔ \" ( حضرت عبداللہ بن مسعود رضی اللہ تعالیٰ عنہ نے ) کہا : پھر ان پر بارش برسائی گئی ۔ انھیں خوشحالی مل گئی ، کہا : ( تو پھر ) وہ اپنی اسی روش پر لوٹ گئے جس سے پہلے تھے ۔ اس پر اللہ تعالیٰ نے ( یہ حصہ ) نازل فرمایا : \" آپ انتظار کیجئے جب آسمان ظاہر دھواں لے آئے گا ۔ جو لوگوں کو ڈھانپ لے گا ، یہ دردناک عذاب ہوگا ۔ ( پھر یہ آیت نازل فرمائی ) جس دن ہم بڑ ی گرفت میں لیں گے ، ہم انتقام لینے والے ہوں گے ۔ \" کہا : یعنی جنگ بدر کو ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, ابو معاویہ ، وکیع ، اور جریر نے اعمش سے ، انھوں نے مسلم بن صحیح سے اور انھوں نے مسروق سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو مُعَاوِيَةَ وَوَكِيعٌ و حَدَّثَنِي أَبُو سَعِيدٍ الْأَشَجُّ أَخْبَرَنَا وَكِيعٌ و حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ كُلُّهُمْ عَنْ الْأَعْمَشِ و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو كُرَيْبٍ وَاللَّفْظُ لِيَحْيَى قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ مُسْلِمِ بْنِ صُبَيْحٍ عَنْ مَسْرُوقٍ قَالَ جَاءَ إِلَى عَبْدِ اللَّهِ رَجُلٌ فَقَالَ تَرَكْتُ فِي الْمَسْجِدِ رَجُلًا يُفَسِّرُ الْقُرْآنَ بِرَأْيِهِ يُفَسِّرُ هَذِهِ الْآيَةَ يَوْمَ تَأْتِي السَّمَاءُ بِدُخَانٍ مُبِينٍ قَالَ يَأْتِي النَّاسَ يَوْمَ الْقِيَامَةِ دُخَانٌ فَيَأْخُذُ بِأَنْفَاسِهِمْ حَتَّى يَأْخُذَهُمْ مِنْهُ كَهَيْئَةِ الزُّكَامِ فَقَالَ عَبْدُ اللَّهِ مَنْ عَلِمَ عِلْمًا فَلْيَقُلْ بِهِ وَمَنْ لَمْ يَعْلَمْ فَلْيَقُلْ اللَّهُ أَعْلَمُ مِنْ فِقْهِ الرَّجُلِ أَنْ يَقُولَ لِمَا لَا عِلْمَ لَهُ بِهِ اللَّهُ أَعْلَمُ إِنَّمَا كَانَ هَذَا أَنَّ قُرَيْشًا لَمَّا اسْتَعْصَتْ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَعَا عَلَيْهِمْ بِسِنِينَ كَسِنِي يُوسُفَ فَأَصَابَهُمْ قَحْطٌ وَجَهْدٌ حَتَّى جَعَلَ الرَّجُلُ يَنْظُرُ إِلَى السَّمَاءِ فَيَرَى بَيْنَهُ وَبَيْنَهَا كَهَيْئَةِ الدُّخَانِ مِنْ الْجَهْدِ وَحَتَّى أَكَلُوا الْعِظَامَ فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ اسْتَغْفِرْ اللَّهَ لِمُضَرَ فَإِنَّهُمْ قَدْ هَلَكُوا فَقَالَ لِمُضَرَ إِنَّكَ لَجَرِيءٌ قَالَ فَدَعَا اللَّهَ لَهُمْ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ إِنَّا كَاشِفُوا الْعَذَابِ قَلِيلًا إِنَّكُمْ عَائِدُونَ قَالَ فَمُطِرُوا فَلَمَّا أَصَابَتْهُمْ الرَّفَاهِيَةُ قَالَ عَادُوا إِلَى مَا كَانُوا عَلَيْهِ قَالَ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ فَارْتَقِبْ يَوْمَ تَأْتِي السَّمَاءُ بِدُخَانٍ مُبِينٍ يَغْشَى النَّاسَ هَذَا عَذَابٌ أَلِيمٌ يَوْمَ نَبْطِشُ الْبَطْشَةَ الْكُبْرَى إِنَّا مُنْتَقِمُونَ قَالَ يَعْنِي يَوْمَ بَدْرٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14629,
                "hadithNumber": "7068",
                "englishNarrator": "Abdullah رضی اللہ عنہ said:",
                "hadithEnglish": "Five signs have (become things) of the past (and have proved the truth of the Holy Prophet): (Enveloping) by the smoke, inevitable (punishment to the Meccans at Badr), (the victory of) Rome, (violent) seizing (of the Meccans at Badr) and (the splitting up of) the Moon.",
                "hadithUrdu": "پانچ ( نشانیاں گزر چکی ہیں : دھواں ، چمٹ جانے والا عذاب ( بدر کے دن شکست اور ہلاکتیں ) روم کی فتح ( بدر کےدن ستر مشرکوں کی گرفتاری ) سخت گرفت اور چاند ( کادو ٹکڑے ہونا ۔ )",
                "urduNarrator": "قتیبہ بن سعید نے ہمیں حدیث بیان کی ، انھوں نے کہا : ہمیں جریر نے اعمش سے حدیث بیان کی ، انھوں نے ابو ضحیٰ سے ، انھوں نے مسروق سے اور انھوں نے حضرت عبداللہ ( بن مسعود ) رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي الضُّحَى عَنْ مَسْرُوقٍ عَنْ عَبْدِ اللَّهِ قَالَ خَمْسٌ قَدْ مَضَيْنَ الدُّخَانُ وَاللِّزَامُ وَالرُّومُ وَالْبَطْشَةُ وَالْقَمَرُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14630,
                "hadithNumber": "7069",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of A'mash with the same chain of transmitters.",
                "hadithUrdu": "ہم سے ابو سعید الاشجاج نے بیان کیا, وکیع نے کہا : ہمیں اعمش نے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الْأَعْمَشُ بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14631,
                "hadithNumber": "7070",
                "englishNarrator": "Ubayy bin Ka'b رضی اللہ عنہ reported:",
                "hadithEnglish": "The words of Allah, the Exalted and Glorious: We will, surely, make them taste the lesser punishment before the severer punishment (that haply they may return) (xxxii. 21) imply the torments of the world. (victory of) Rome, seizing (of the Meccans), or smoke. And Shubah was in doubt about seizing or smoke.",
                "hadithUrdu": "اللہ عزوجل کے فرمان : \" اور بڑے عذاب سے پہلے ہم انھیں قریب کا ( چھوٹا ) عذاب چکھائیں گے ۔ \" ( کی تفسیر ) کے بارے میں روایت کی ، انھوں نے کہا ( اسی ) دنیا میں پیش آنے والے مصائب ، روم کی فتح ، گرفت ( جنگ بدر ) یا دھواں ( مراد ) ہیں ۔ گرفت اور دھوئیں کے بارے میں شک کرنے والے شعبہ ہیں ۔ ( ان سے اوپر کے راویوں نے یقین سے بتایا ۔ شعبہ نے کہا : انھیں شک ہوا ہے )",
                "urduNarrator": "ہم سے محمد بن المثنیٰ اور محمد بن بشار نے بیان کیا، کہا: محمد بن جعفر نے شعبہ سے ، انھوں نے قتادہ سے ، انھوں نے عزرۃ سے انھوں نے حسن عرفی سے ، انھوں نے یحییٰ بن جزار سے ، انھوں نے عبدالرحمن بن ابی لیلیٰ سے اور انھوں نے حضرت ابی ابن کعب رضی اللہ عنہ سے",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَاللَّفْظُ لَهُ حَدَّثَنَا غُنْدَرٌ عَنْ شُعْبَةَ عَنْ قَتَادَةَ عَنْ عَزْرَةَ عَنْ الْحَسَنِ الْعُرَنِيِّ عَنْ يَحْيَى بْنِ الْجَزَّارِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ أُبَيِّ بْنِ كَعْبٍ فِي قَوْلِهِ عَزَّ وَجَلَّ وَلَنُذِيقَنَّهُمْ مِنْ الْعَذَابِ الْأَدْنَى دُونَ الْعَذَابِ الْأَكْبَرِ قَالَ مَصَائِبُ الدُّنْيَا وَالرُّومُ وَالْبَطْشَةُ أَوْ الدُّخَانُ شُعْبَةُ الشَّاكُّ فِي الْبَطْشَةِ أَوْ الدُّخَانِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14632,
                "hadithNumber": "7071",
                "englishNarrator": "Abu Ma'mar reported on the authority of Abdullah رضی اللہ عنہ:",
                "hadithEnglish": "The moon was split up during lifetime by Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) in two parts and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Bear testimony to this.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے عہد میں چاند تقسیم ہوکر دوٹکڑے ہوگیاتو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \" ( لوگو! اس کو دیکھ لو اور ) گواہ بن جاؤ ۔ \"",
                "urduNarrator": "ہم سے عمرو ناقد اور زہیر بن حرب نے بیان کیا، کہا: ہم سے سفیان بن عیینہ نے ابن ابی نجیح کی سند سے بیان کیا, مجاہد نے ابو معمر سے اور انھوں نے حضرت عبداللہ ( بن مسعود رضی اللہ عنہ ) سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا عَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ ابْنِ أَبِي نَجِيحٍ عَنْ مُجَاهِدٍ عَنْ أَبِي مَعْمَرٍ عَنْ عَبْدِ اللَّهِ قَالَ انْشَقَّ الْقَمَرُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشِقَّتَيْنِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اشْهَدُوا.",
                "headingArabic": "انْشِقَاقِ الْقَمَرِ ‏‏",
                "headingUrdu": "چاند کی تقسیم",
                "headingEnglish": "The Splitting Of The Moon",
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14633,
                "hadithNumber": "7072",
                "englishNarrator": "This hadith has been transmitted on the authority of Abdullah bin Mas'ud رضی اللہ عنہ (who said):",
                "hadithEnglish": "We were along with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) at Mina, that moon was split up into two. One of its parts was behind the mountain and the other one was on this side of the mountain. Allah's Messenger (ﷺ) said to us: Bear witness to this.",
                "hadithUrdu": "ایک بار ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ منیٰ میں موجودتھے کہ چاند دو ٹکڑوں میں تقسیم ہوگیا ، ایک ٹکڑا پہاڑ کے پیچھے ( نظر آتا ) تھا اوردوسرا ٹکڑا اس سے آگے ( دوسری طرف نظر آتا ) تھا ، تو رسول اللہ صلی اللہ علیہ وسلم نے ہم سے فرمایا : \" ( اس کے ) گواہ بن جاؤ ۔ \"",
                "urduNarrator": "ہمیں ابوبکر بن ابی شیبہ، ابو کریب اور اسحاق بن ابراہیم نے بیان کیا, ابو معاویہ ، حفص بن غیاث اور ( علی ) ابن مسہر نے اعمش سے ، انھوں نے ابراہیم ( نخعی ) سے ، انھوں نے ابو معمر سے اور انھوں نے حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ جَمِيعًا عَنْ أَبِي مُعَاوِيَةَ و حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ حَدَّثَنَا أَبِي كِلَاهُمَا عَنْ الْأَعْمَشِ ح و حَدَّثَنَا مِنْجَابُ بْنُ الْحَارِثِ التَّمِيمِيُّ وَاللَّفْظُ لَهُ أَخْبَرَنَا ابْنُ مُسْهِرٍ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ أَبِي مَعْمَرٍ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ بَيْنَمَا نَحْنُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِنًى إِذَا انْفَلَقَ الْقَمَرُ فِلْقَتَيْنِ فَكَانَتْ فِلْقَةٌ وَرَاءَ الْجَبَلِ وَفِلْقَةٌ دُونَهُ فَقَالَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اشْهَدُوا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14634,
                "hadithNumber": "7073",
                "englishNarrator": "Abdullah bin Mas'ud رضی اللہ عنہ reported:",
                "hadithEnglish": "The moon was split up in two parts during the lifetime of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). The mountain covered one of its parts and one part of it was above the mountain and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: 'O Allah, Bear witness to this.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے عہد میں چاند تقسیم ہوکردوٹکڑے ہوگیا ، ایک ٹکڑے کو پہاڑ نے ڈھانپ لیا ( اس پہاڑ کے پیچھے نظر آتا تھا ) اورایک ٹکڑا پہاڑ کے اوپر تھا ، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \" اے اللہ ! تو گواہ رہ ۔ \"",
                "urduNarrator": "ہم سے عبید اللہ بن معاذ العنبری نے بیان کیا، ہم سے میرے والد نے بیان کیا, شعبہ نے اعمش سے ، انھوں نے ابراہیم سے ، انھوں نے ابو معمر سے اور انھوں نے حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ أَبِي مَعْمَرٍ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ انْشَقَّ الْقَمَرُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِلْقَتَيْنِ فَسَتَرَ الْجَبَلُ فِلْقَةً وَكَانَتْ فِلْقَةٌ فَوْقَ الْجَبَلِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُمَّ اشْهَدْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14635,
                "hadithNumber": "7074",
                "englishNarrator": null,
                "hadithEnglish": "A similar report (as Hadith no. 7073) was narrated from Ibn Umar رضی اللہ عنہ , from the Prophet.",
                "hadithUrdu": "عبید اللہ بن معاذ نے کہا ,  ہمیں شعبہ نے اعمش سے حدیث بیان کی ، انھوں نے مجاہد سے ، انھوں نے ابن عمر رضی اللہ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ الْأَعْمَشِ عَنْ مُجَاهِدٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَ ذَلِكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14636,
                "hadithNumber": "7075",
                "englishNarrator": "A similar Hadith (as no. 7073) was narrated from Shobah, but in the Hadith of Ibn 'Adiyy  it says:",
                "hadithEnglish": "\"And he said: 'Bear witness, Bear witness.'\"",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" ( اس کے ) گواہ بن جاؤ ، گواہ بن جاؤ ۔ \"",
                "urduNarrator": "مجھ سے بشر بن خالد نے بیان کیا, محمد بن جعفر اور ابن عدی دونوں نے شعبہ سے ، شعبہ سے ابن معاذ کی سند کے ساتھ اسی کی حدیث نے مانند روایت کی ، مکر ابن ابی عدی کی حدیث میں ہے کہ",
                "hadithArabic": "و حَدَّثَنِيهِ بِشْرُ بْنُ خَالِدٍ أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ و حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ كِلَاهُمَا عَنْ شُعْبَةَ بِإِسْنَادِ ابْنِ مُعَاذٍ عَنْ شُعْبَةَ نَحْوَ حَدِيثِهِ غَيْرَ أَنَّ فِي حَدِيثِ ابْنِ أَبِي عَدِيٍّ فَقَالَ اشْهَدُوا اشْهَدُوا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14637,
                "hadithNumber": "7076",
                "englishNarrator": "Anas رضی اللہ عنہ reported:",
                "hadithEnglish": "The people of Mecca demanded from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) that he should show them (some) signs (miracles) and he showed twice the splitting of the moon.",
                "hadithUrdu": "اہل مکہ نے رسول اللہ صلی اللہ علیہ وسلم سے مطالبہ کہ آپ انھیں ( اپنی نبوت کی سچائی کی ) کوئی نشانی دکھائیں تو آپ نے انھیں چاند کے دو ٹکڑے ہونا دکھایا ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب اور عبد بن حمید نے بیان کیا، کہا: ہم سے یونس بن محمد نے بیان کیا, شیبان نےکہا : ہمیں قتادہ نے حضرت انس رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ وَعَبْدُ بْنُ حُمَيْدٍ قَالَا حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ حَدَّثَنَا شَيْبَانُ حَدَّثَنَا قَتَادَةُ عَنْ أَنَسٍ أَنَّ أَهْلَ مَكَّةَ سَأَلُوا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُرِيَهُمْ آيَةً فَأَرَاهُمْ انْشِقَاقَ الْقَمَرِ مَرَّتَيْنِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14638,
                "hadithNumber": "7077",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Anas رضی اللہ عنہ through another chain of transmitters.",
                "hadithUrdu": "مجھ سے محمد بن رافع نے بیان کیا، ہم سے عبدالرزاق نے بیان کیا , معمر نے ہمیں قتادہ سے ، انھوں نے حضرت انس رضی اللہ عنہ سے شیبان کی حدیث سے ہم معنی روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنِيهِ مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ قَتَادَةَ عَنْ أَنَسٍ بِمَعْنَى حَدِيثِ شَيْبَانَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 14326,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=573",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=571",
                "label": "571",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=572",
                "label": "572",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=573",
                "label": "573",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=574",
                "label": "574",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=575",
                "label": "575",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=576",
                "label": "576",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=577",
                "label": "577",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=575",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=575",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=573",
        "to": 14350,
        "total": 40465
    }
}