{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 475,
        "data": [
            {
                "id": 12139,
                "hadithNumber": "4575",
                "englishNarrator": "It has been narrated on the authority of Umar رضی اللہ عنہ , who said:",
                "hadithEnglish": "The properties abandoned by Banu Nadir were the ones which Allah bestowed upon His Apostle for which no expedition was undertaken either with cavalry or camelry. These properties were particularly meant for the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). He would meet the annual expenditure of his family from the income thereof, and would spend what remained for purchasing horses and weapons as preparation for Jihad.",
                "hadithUrdu": "بنونضیر کے اموال ان اموال میں سے تھے جو اللہ نے اپنے رسول کو ( بطور فے ) عطا کیے جس پر مسلمانوں نے نہ گھوڑے دوڑائے نہ اونٹ ۔ تو وہ نبی صلی اللہ علیہ وسلم کے لیے خاص تھے ۔ آپ ( ان میں سے ) اپنے اہل و عیال کے لیے ایک سال کا خرچ لیتے اور جو بچ جاتا اسے اللہ کی راہ میں ( جہاد کی ) تیاری کے لیے جنگی سواریوں اور اسلحے پر لگا دیتے.",
                "urduNarrator": "قتیبہ بن سعید ، محمد بن عباد ، ابوبکر بن ابی شیبہ اور اسحاق بن ابراہیم نے ہمیں حدیث بیان کی ، الفاظ ابن ابی شیبہ کے ہیں ۔ اسحاق نے کہا کہ ہمیں خبر دی ، جبکہ دوسروں نے کہا کہ ہمیں حدیث بیان کی سفیان نے عمرو سے ، انہوں نے زہری سے ، انہوں نے مالک بن اوس سے اور انہوں نے حضرت عمر رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ عَبَّادٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَاللَّفْظُ لِابْنِ أَبِي شَيْبَةَ، قَالَ إِسْحَاقُ: أَخْبَرَنَا، وقَالَ الْآخَرُونَ: حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنِ الزُّهْرِيِّ، عَنْ مَالِكِ بْنِ أَوْسٍ، عَنْ عُمَرَ، قَالَ: «كَانَتْ أَمْوَالُ بَنِي النَّضِيرِ مِمَّا أَفَاءَ اللهُ عَلَى رَسُولِهِ، مِمَّا لَمْ يُوجِفْ عَلَيْهِ الْمُسْلِمُونَ بِخَيْلٍ وَلَا رِكَابٍ، فَكَانَتْ لِلنَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ خَاصَّةً، فَكَانَ يُنْفِقُ عَلَى أَهْلِهِ نَفَقَةَ سَنَةٍ، وَمَا بَقِيَ يَجْعَلُهُ فِي الْكُرَاعِ وَالسِّلَاحِ، عُدَّةً فِي سَبِيلِ اللهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12140,
                "hadithNumber": "4576",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Zuhri.",
                "hadithUrdu": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا، معمر نے زہری سے اسی سند کے ساتھ روایت کی.",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: أَخْبَرَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ بِهَذَا الْإِسْنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12141,
                "hadithNumber": "4577",
                "englishNarrator": "It is reported by Zuhri that this tradition was narrated to him by Malik bin Aus who said:",
                "hadithEnglish": "Umar bin al-Khattab رضی اللہ عنہ sent for me and I came to him when the day had advanced. I found him in his house sitting on his bare bed-stead, reclining on a leather pillow. He said (to me): Malik, some people of your tribe have hastened to me (with a request for help). I have ordered a little money for them. Take it and distribute it among them. I said: I wish you had ordered somebody else to do this job. He said: Malik, take it (and do what you have been told). At this moment (his man-servant) Yarfa' came in and said: Commander of the Faithful, what do you say about Uthman, Abdul-Rahman bin 'Auf, Zubair and Sa'd رضی اللہ عنہم (who have come to seek an audience with you)? He said: Yes, and permitted them. so they entered. Then he (Yarfa') came again and said: What do you say about 'Ali and Abbas رضی اللہ عنہما (who are present at the door)? He said: Yes, and permitted them to enter. Abbas رضی اللہ عنہ said: Commander of the Faithful, decide (the dispute) between me and this sinful, treacherous, dishonest liar. The people (who were present) also said: Yes. Commander of the Faithful, do decide (the dispute) and have mercy on them. Malik bin Aus said: I could well imagine that they had sent them in advance for this purpose (by 'Ali and Abbas رضی اللہ عنہ). 'Umar رضی اللہ عنہ said: Wait and be patient. I adjure you by Allah by Whose order the heavens and the earth are sustained, don't you know that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: We (prophets) do not have any heirs; what we leave behind is (to be given in) charity ? They said: Yes. Then he turned to Abbas رضی اللہ عنہ and 'Ali رضی اللہ عنہ and said: I adjure you both by Allah by Whose order the heavens and earth are sustained, don't you know that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: We do not have any heirs; what we leave behind is (to be given in) charity ? They (too) said: Yes. (Then) Umar رضی اللہ عنہ said: Allah, the Glorious and Exalted, had done to His Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) a special favor that He has not done to anyone else except him. He quoted the Qur'anic verse: What Allah has bestowed upon His Apostle from (the properties) of the people of township is for Allah and His Messenger . The narrator said: I do not know whether he also recited the previous verse or not. Umar رضی اللہ عنہ continued: The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) distributed among you the properties abandoned by Banu Nadir. By Allah, he never preferred himself over you and never appropriated anything to your exclusion. (After a fair distribution in this way) this property was left over. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) would meet from its income his annual expenditure, and what remained would be deposited in the Bait-ul-Mal. (Continuing further) he said: I adjure you by Allah by Whose order the heavens and the earth are sustained. Do you know this? They said: Yes. Then he adjured Abbas and 'All as he had adjured the other persons and asked: Do you both know this? They said: Yes. He said: When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) passed away, Abu Bakr رضی اللہ عنہ said: I am the successor of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). Both of you came to demand your shares from the property (left behind by the Messenger of Allah). (Referring to Hadrat 'Abbas رضی اللہ عنہ), he said: You demanded your share from the property of your nephew, and he (referring to 'Ali) demanded a share on behalf of his wife from the property of her father. Abu Bakr (رضی اللہ عنہ) said: The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had said: We do not have any heirs; what we leave behind is (to be given in) charity. So both of you thought him to be a liar, sinful, treacherous and dishonest. And Allah knows that he was true, virtuous, well-guided and a follower of truth. When Abu Bakr رضی اللہ عنہ passed away and (I have become) the successor of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and Abu Bakr (رضی اللہ عنہ), you thought me to be a liar, sinful, treacherous and dishonest. And Allah knows that I am true, virtuous, well-guided and a follower of truth. I became the guardian of this property. Then you as well as he came to me. Both of you have come and your purpose is identical. You said: Entrust the property to us. I said: If you wish that I should entrust it to you, it will be on the condition that both of you will undertake to abide by a pledge made with Allah that you will use it in the same way as the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) used it. So both of you got it. He said: Wasn't it like this? They said: Yes. He said: Then you have (again) come to me with the request that I should adjudge between you. No, by Allah. I will not give any other judgment except this until the arrival of the Doomsday. If you are unable to hold the property on this condition, return it to me.",
                "hadithUrdu": "حضرت عمر بن خطاب رضی اللہ عنہ نے میری طرف قاصد بھیجا ، دن چڑھ چکا تھا کہ میں ان کے پاس پہنچا ۔ کہا : میں نے ان کو ان کے گھر میں اپنی چارپائی پر بیٹھے ہوئے پایا ، انہوں نے اپنا جسم کھجور سے بنے ہوئے بان کے ساتھ لگایا ہوا تھا اور چمڑے کے تکیے سے ٹیک لگائی ہوئی تھی ، تو انہوں نے مجھ سے کہا : اے مال ( مالک ) ! تمہاری قوم میں سے کچھ خاندان لپکتے ہوئے آئے تھے تو میں نے ان کے لیے تھوڑا سا عطیہ دینے کا حکم دیا ہے ، اسے لو اور ان میں تقسیم کر دو ۔ کہا : میں نے کہا : اگر آپ میرے سوا کسی اور کو اس کا حکم دے دیں ( تو کیسا رہے؟ ) انہوں نے کہا : اے مال! تم لے لو ۔ کہا : ( اتنے میں ان کے مولیٰ ) یرفا ان کے پاس آئے اور کہنے لگے : امیر المومنین! کیا آپ کو عثمان ، عبدالرحمن بن عوف ، زبیر اور سعد رضی اللہ عنہم ( کے ساتھ ملنے ) میں دلچسپی ہے؟ انہوں نے کہا : ہاں ۔ تو اس نے ان کو اجازت دی ۔ وہ اندر آ گئے ، وہ پھر آیا اور کہنے لگا : کیا آپ کو عباس اور علی رضی اللہ عنہما ( کے ساتھ ملنے ) میں دلچسپی ہے؟ انہوں نے کہا : ہاں ۔ تو اس نے ان دونوں کو بھی اجازت دے دی ۔ تو عباس رضی اللہ عنہ نے کہا : امیر المومنین! میرے اور اس جھوٹے ، گناہ گار ، عہد شکن اور خائن کے درمیان فیصلہ کر دیں ۔ کہا : اس پر ان لوگوں نے کہا : ہاں ، امیر المومنین! ان کے درمیان فیصلہ کر کے ان کو ( جھگڑے کے عذاب سے ) راحت دلا دیں ۔ ۔ مالک بن اوس نے کہا : میرا خیال ہے کہ انہوں نے ان لوگوں کو اسی غرض سے اپنے آگے بھیجا تھا ۔ ۔ تو حضرت عمر رضی اللہ عنہ نے کہا : تم دونوں رکو ، میں تمہیں اس اللہ کی قسم دیتا ہوں جس کے حکم سے آسمان اور زمین قائم ہیں! کیا تم جانتے ہو کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا : \" ہمارا کوئی وارث نہیں بنے گا ، ہم جو چھوڑیں گے وہ صدقہ ہو گا \" ؟ ان سب نے کہا : ہاں ۔ پھر وہ حضرت عباس اور علی رضی اللہ عنہما کی طرف متوجہ ہوئے اور کہا : میں تم دونوں کو اس اللہ کی قسم دیتا ہوں جس کے حکم سے آسمان اور زمین قائم ہیں! کیا تم دونوں جانتے ہو کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا : \" تمہارا کوئی وارث نہیں ہو گا ، ہم جو کچھ چھوڑیں گے ، صدقہ ہو گا \" ؟ ان دونوں نے کہا : ہاں ۔ تو حضرت عمر رضی اللہ عنہ نے کہا : بلاشبہ اللہ تعالیٰ نے اپنے رسول صلی اللہ علیہ وسلم کو ایک خاص چیز عطا کی تھی جو اس نے آپ کے علاوہ کسی کے لیے مخصوص نہیں کی تھی ، اس نے فرمایا ہے : \" جو کچھ بھی اللہ نے ان بستیوں والوں کی طرف سے اپنے رسول پر لوٹایا وہ اللہ کا اور اس کے رسول صلی اللہ علیہ وسلم کا ہے \" ۔ ۔ مجھے پتہ نہیں کہ انہوں نے اس سے پہلے والی آیت بھی پڑھی یا نہیں ۔ ۔ انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے بنونضیر کے اموال تم سب میں تقسیم کر دیے ، اللہ کی قسم! آپ نے ( اپنی ذات کو ) تم پر ترجیح نہیں دی اور نہ تمہیں چھوڑ کر وہ مال لیا ، حتی کہ یہ مال باقی بچ گیا ہے ، رسول اللہ صلی اللہ علیہ وسلم اس سے اپنے سال بھر کا خرچ لیتے ، پھر جو باقی بچ جاتا اسے ( بیت المال کے ) مال کے مطابق ( عام لوگوں کے فائدے کے لیے ) استعمال کرتے ۔ انہوں نے پھر کہا : میں تمہیں اس اللہ کی قسم دیتا ہوں جس کے حکم سے آسمان اور زمین قائم ہیں! کیا تم یہ بات جانتے ہو؟ انہوں نے کہا : ہاں ۔ پھر انہوں نے عباس اور علی رضی اللہ عنہ کو وہی قسم دی جو باقی لوگوں کو دی تھی ( اور کہا ) : کیا تم دونوں یہ بات جانتے ہو؟ انہوں نے کہا : جی ہاں ۔ پھر کہا : جب رسول اللہ صلی اللہ علیہ وسلم فوت ہوئے تو حضرت ابوبکر رضی اللہ عنہ نے کہا : میں رسول اللہ صلی اللہ علیہ وسلم کا جانشیں ہوں تو آپ دونوں آئے ، آپ اپنے بھتیجے کی وراثت مانگ رہے تھے اور یہ اپنی بیوی کی ان کے والد کی طرف سے وراثت مانگ رہے تھے ۔ تو حضرت ابوبکر رضی اللہ عنہ نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا : \" ہمارا کوئی وارث نہیں ہو گا ، ہم جو چھوڑیں گے ، صدقہ ہے ۔ \" تو تم نے انہیں جھوٹا ، گناہ گار ، عہد شکن اور خائن خیال کیا تھا اور اللہ جانتا ہے وہ سچے ، نیکوکار ، راست رَو اور حق کے پیروکار تھے ۔ پھر ابوبکر رضی اللہ عنہ فوت ہوئے اور میں رسول اللہ صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ کا جانشیں بنا تو تم نے مجھے جھوٹا ، گناہ گار ، عہد شکن اور خائن خیال کیا اور اللہ جانتا ہے کہ میں سچا ، نیکوکار ، راست رَو اور حق کی پیروی کرنے والا ہوں ، میں اس کا منتظم بنا ، پھر تم اور یہ میرے پاس آئے ، تم دونوں اکٹھے ہو اور تمہارا معاملہ بھی ایک ہے ۔ تم نے کہا : یہ ( اموال ) ہمارے سپرد کر دو ۔ میں نے کہا : اگر تم چاہو تو میں اس شرط پر یہ تم دونوں کے حوالے کر دیتا ہوں کہ تم دونوں پر اللہ کے عہد کی پاسداری لازمی ہو گی ، تم بھی اس میں وہی کرو گے جو رسول اللہ صلی اللہ علیہ وسلم کرتے تھے تو تم نے اس شرط پر اسے لے لیا ۔ انہوں نے پوچھا : کیا ایسا ہی ہے؟ ان دونوں نے جواب دیا ۔ ہاں ۔ انہوں نے کہا : پھر تم ( اب ) دونوں میرے پاس آئے ہو کہ میں تم دونوں کے درمیان فیصلہ کروں ۔ نہیں ، اللہ کی قسم! میں قیامت کے قائم ہونے تک تمہارے درمیان اس کے سوا اور فیصلہ نہیں کروں گا ۔ اگر تم اس کے انتظام سے عاجز ہو تو وہ مال مجھے واپس کر دو.",
                "urduNarrator": "مجھ سے عبداللہ بن محمد بن اسماء الضبعی نے بیان کیا، ہم سے جویریہ نے بیان کیا، امام مالک نے زہری سے روایت کی کہ انہیں مالک بن اوس نے حدیث بیان کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي عَبْدُ اللهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ الضُّبَعِيُّ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ مَالِكٍ، عَنِ الزُّهْرِيِّ، أَنَّ مَالِكَ بْنَ أَوْسٍ، حَدَّثَهُ، قَالَ: أَرْسَلَ إِلَيَّ عُمَرُ بْنُ الْخَطَّابِ، فَجِئْتُهُ حِينَ تَعَالَى النَّهَارُ، قَالَ: فَوَجَدْتُهُ فِي بَيْتِهِ جَالِسًا عَلَى سَرِيرٍ مُفْضِيًا إِلَى رُمَالِهِ، مُتَّكِئًا عَلَى وِسَادَةٍ مِنْ أَدَمٍ، فَقَالَ لِي: يَا مَالُ، إِنَّهُ قَدْ دَفَّ أَهْلُ أَبْيَاتٍ مِنْ قَوْمِكَ، وَقَدْ أَمَرْتُ فِيهِمْ بِرَضْخٍ، فَخُذْهُ فَاقْسِمْهُ بَيْنَهُمْ، قَالَ: قُلْتُ: لَوْ أَمَرْتَ بِهَذَا غَيْرِي، قَالَ: خُذْهُ يَا مَالُ، قَالَ: فَجَاءَ يَرْفَا، فَقَالَ: هَلْ لَكَ يَا أَمِيرَ الْمُؤْمِنِينَ فِي عُثْمَانَ، وَعَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، وَالزُّبَيْرِ، وَسَعْدٍ؟ فَقَالَ عُمَرُ: نَعَمْ، فَأَذِنَ لَهُمْ فَدَخَلُوا، ثُمَّ جَاءَ، فَقَالَ: هَلْ لَكَ فِي عَبَّاسٍ، وَعَلِيٍّ؟ قَالَ: نَعَمْ، فَأَذِنَ لَهُمَا، فَقَالَ عَبَّاسٌ: يَا أَمِيرَ الْمُؤْمِنِينَ، اقْضِ بَيْنِي وَبَيْنَ هَذَا الْكَاذِبِ الْآثِمِ الْغَادِرِ الْخَائِنِ، فَقَالَ الْقَوْمُ: أَجَلْ يَا أَمِيرَ الْمُؤْمِنِينَ، فَاقْضِ بَيْنَهُمْ وَأَرِحْهُمْ [ص:1378]، فَقَالَ مَالِكُ بْنُ أَوْسٍ: يُخَيَّلُ إِلَيَّ أَنَّهُمْ قَدْ كَانُوا قَدَّمُوهُمْ لِذَلِكَ، فَقَالَ عُمَرُ: اتَّئِدَا، أَنْشُدُكُمْ بِاللهِ الَّذِي بِإِذْنِهِ تَقُومُ السَّمَاءُ وَالْأَرْضُ، أَتَعْلَمُونَ أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا نُورَثُ مَا تَرَكْنَا صَدَقَةٌ»، قَالُوا: نَعَمْ، ثُمَّ أَقْبَلَ عَلَى الْعَبَّاسِ، وَعَلِيٍّ، فَقَالَ: أَنْشُدُكُمَا بِاللهِ الَّذِي بِإِذْنِهِ تَقُومُ السَّمَاءُ وَالْأَرْضُ، أَتَعْلَمَانِ أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «لَا نُورَثُ مَا تَرَكْنَاهُ صَدَقَةٌ»، قَالَا: نَعَمْ، فَقَالَ عُمَرُ: إِنَّ اللهَ جَلَّ وَعَزَّ كَانَ خَصَّ رَسُولَهُ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِخَاصَّةٍ، لَمْ يُخَصِّصْ بِهَا أَحَدًا غَيْرَهُ، قَالَ: {مَا أَفَاءَ اللهُ عَلَى رَسُولِهِ مِنْ أَهْلِ الْقُرَى فَلِلَّهِ وَلِلرَّسُولِ} [الحشر: 7]- مَا أَدْرِي هَلْ قَرَأَ الْآيَةَ الَّتِي قَبْلَهَا أَمْ لَا - قَالَ: فَقَسَمَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَيْنَكُمْ أَمْوَالَ بَنِي النَّضِيرِ، فَوَاللهِ، مَا اسْتَأْثَرَ عَلَيْكُمْ، وَلَا أَخَذَهَا دُونَكُمْ، حَتَّى بَقِيَ هَذَا الْمَالُ، فَكَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَأْخُذُ مِنْهُ نَفَقَةَ سَنَةٍ، ثُمَّ يَجْعَلُ مَا بَقِيَ أُسْوَةَ الْمَالِ، ثُمَّ قَالَ: أَنْشُدُكُمْ بِاللهِ الَّذِي بِإِذْنِهِ تَقُومُ السَّمَاءُ وَالْأَرْضُ، أَتَعْلَمُونَ ذَلِكَ؟ قَالُوا: نَعَمْ، ثُمَّ نَشَدَ عَبَّاسًا، وَعَلِيًّا، بِمِثْلِ مَا نَشَدَ بِهِ الْقَوْمَ، أَتَعْلَمَانِ ذَلِكَ؟ قَالَا: نَعَمْ، قَالَ: فَلَمَّا تُوُفِّيَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ أَبُو بَكْرٍ: أَنَا وَلِيُّ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَجِئْتُمَا تَطْلُبُ مِيرَاثَكَ مِنِ ابْنِ أَخِيكَ، وَيَطْلُبُ هَذَا مِيرَاثَ امْرَأَتِهِ مِنْ أَبِيهَا، فَقَالَ أَبُو بَكْرٍ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَا نُورَثُ مَا تَرَكْنَاهُ صَدَقَةٌ»، فَرَأَيْتُمَاهُ كَاذِبًا آثِمًا غَادِرًا خَائِنًا، وَاللهُ يَعْلَمُ إِنَّهُ لَصَادِقٌ بَارٌّ رَاشِدٌ تَابِعٌ لِلْحَقِّ، ثُمَّ تُوُفِّيَ أَبُو بَكْرٍ وَأَنَا وَلِيُّ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَوَلِيُّ أَبِي بَكْرٍ، فَرَأَيْتُمَانِي كَاذِبًا آثِمًا غَادِرًا خَائِنًا، وَاللهُ يَعْلَمُ إِنِّي لَصَادِقٌ بَارٌّ رَاشِدٌ تَابِعٌ لِلْحَقِّ، فَوَلِيتُهَا ثُمَّ جِئْتَنِي أَنْتَ وَهَذَا وَأَنْتُمَا جَمِيعٌ وَأَمْرُكُمَا وَاحِدٌ، فَقُلْتُمَا: ادْفَعْهَا إِلَيْنَا، فَقُلْتُ: إِنْ شِئْتُمْ دَفَعْتُهَا إِلَيْكُمَا عَلَى أَنَّ عَلَيْكُمَا عَهْدَ اللهِ أَنْ تَعْمَلَا فِيهَا بِالَّذِي كَانَ يَعْمَلُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَأَخَذْتُمَاهَا بِذَلِكَ، قَالَ: أَكَذَلِكَ؟ قَالَا: نَعَمْ، قَالَ: ثُمَّ جِئْتُمَانِي لِأَقْضِيَ بَيْنَكُمَا، وَلَا وَاللهِ لَا أَقْضِي بَيْنَكُمَا بِغَيْرِ ذَلِكَ حَتَّى تَقُومَ السَّاعَةُ، فَإِنْ عَجَزْتُمَا عَنْهَا فَرُدَّاهَا إِلَيَّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12142,
                "hadithNumber": "4578",
                "englishNarrator": "It was narrated that Malik bin Aws bin Hadthan said:",
                "hadithEnglish": "'Umar bin al-Khattab رضی اللہ عنہ sent for me and said: Some families from your tribe have come to me (then follows the foregoing hadith) by Malik with the difference that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) would spend on his family for a year. And sometimes Ma'mar said: He would retain sustenance for his family for a year, and what was left of that he spent in the cause of Allah, the Majestic and Exalted.",
                "hadithUrdu": "حضرت عمر بن خطاب رضی اللہ عنہ نے میری طرف پیغام بھیجا اور کہا : تمہاری قوم میں سے کچھ گھرانوں کے لوگ آئے تھے ۔ ۔ مالک کی حدیث کی طرح ، البتہ انہوں نے اس میں کہا : آپ صلی اللہ علیہ وسلم اس سے سال بھر اپنے اہل و عیال پر خرچ کرتے ۔ اور ( حدیث بیان کرتے ہوئے ) بسا اوقات معمر نے کہا : آپ اس سے اپنے گھر والوں کی سال بھر کی کم از کم خوراک الگ کر لیتے ، پھر جو بچتا اسے اللہ کے مال ( بیت المال ) کے مصارف پر لگاتے.",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم، محمد بن رافع اور عبد بن حمید نے بیان کیا، کہا کہ ہم سے انہوں نے بیان کیا اور باقی دو نے کہا: ہم سے عبد الرزاق نے بیان کیا، معمر نے ہمیں زہری سے خبر دی ، انہوں نے مالک بن اوس بن حدثان سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ ابْنُ رَافِعٍ: حَدَّثَنَا، وقَالَ الْآخَرَانِ: أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ مَالِكِ بْنِ أَوْسِ بْنِ الْحَدَثَانِ، قَالَ: أَرْسَلَ إِلَيَّ عُمَرُ بْنُ الْخَطَّابِ، فَقَالَ: إِنَّهُ قَدْ حَضَرَ أَهْلُ أَبْيَاتٍ مِنْ قَوْمِكَ بِنَحْوِ حَدِيثِ مَالِكٍ، غَيْرَ أَنَّ فِيهِ، فَكَانَ يُنْفِقُ عَلَى أَهْلِهِ مِنْهُ سَنَةً، وَرُبَّمَا قَالَ مَعْمَرٌ: يَحْبِسُ قُوتَ أَهْلِهِ مِنْهُ سَنَةً، ثُمَّ يَجْعَلُ مَا بَقِيَ مِنْهُ مَجْعَلَ مَالِ اللهِ عَزَّ وَجَلَّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12143,
                "hadithNumber": "4579",
                "englishNarrator": "It is narrated on the authority of 'A'isha رصی اﷲ عنہا who said:",
                "hadithEnglish": "When the Messenger of Allah (ﷺ) passed away, his wives made up their minds to send 'Uthman bin 'Affan رصی اﷲ عنہ (as their spokesman) to Abu Bakr رصی اﷲ عنہ to demand from him their share from the legacy of the Prophet (ﷺ). (At this), A'isha رصی اﷲ عنہا said to them: Hasn't the Messenger of Allah (ﷺ) said: We (Prophets) do not have any heirs; what we leave behind is (to be given in) charity?",
                "hadithUrdu": "جب رسول اﷲ صلی ‌اللہ ‌علیہ ‌وسلم کی وفات ہوئی تو آپ کی بیبیوں نے حضرت عثمان رضی ‌اللہ ‌عنہ کو حضرت ابوبکر صدیق رضی ‌اللہ ‌عنہ کے پاس بھیجنا چاہا اپنا ترکہ مانگنے کے لیے رسول اﷲ کے مال سے، حضرت عائشہ رضی ‌اللہ ‌عنہ نے کہا ان سے کیا جناب رسول اﷲ صلی ‌اللہ ‌علیہ ‌وسلم نے نہیں فرمایا کہ ہمارا کوئی وارث نہیں ہوتا، جو ہم چھوڑ جاویں وہ صدقہ ہے۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے ابن شہاب کی سند سے اور عروہ کی سند سے مالک کو پڑھا, ام المومنین حضرت عائشہ رصی اﷲ عنہا سے روایت ہے",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ إِنَّ أَزْوَاجَ النَّبِيِّ صلى الله عليه وسلم حِينَ تُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَرَدْنَ أَنْ يَبْعَثْنَ عُثْمَانَ بْنَ عَفَّانَ إِلَى أَبِي بَكْرٍ فَيَسْأَلْنَهُ مِيرَاثَهُنَّ مِنَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ عَائِشَةُ لَهُنَّ أَلَيْسَ قَدْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ ‏ لاَ نُورَثُ مَا تَرَكْنَا فَهُوَ صَدَقَةٌ‏.‏",
                "headingArabic": "قَوْلِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ لاَ نُورَثُ مَا تَرَكْنَا فَهُوَ صَدَقَةٌ ‏\"‏ ‏‏",
                "headingUrdu": "رسول اللہ صلی اللہ علیہ وسلم کا ارشاد ہے: ’’ہمارا کوئی وارث نہیں اور جو کچھ ہم چھوڑیں وہ صدقہ ہے۔‘‘",
                "headingEnglish": "The words of the Prophet (saws): \"We (Prophets) have no heirs and whatever we leave behind is charity.\"",
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12144,
                "hadithNumber": "4580",
                "englishNarrator": "It is narrated on the authority of Urwa bin Zubair who narrated from A'isha رضی ‌اللہ ‌عنہا :",
                "hadithEnglish": "She informed him that Fatima رضی ‌اللہ ‌عنہا , daughter of the Messenger of Allah (ﷺ), sent someone to Abu Bakr رضی ‌اللہ ‌عنہ to demand from him her share of the legacy left by the Messenger of Allah (ﷺ) from what Allah had bestowed upon him at Medina and Fadak and what was left from one-filth of the income (annually received) from Khaibar. Abu Bakr رضی ‌اللہ ‌عنہ said: The Messenger of Allah (ﷺ) said: We (prophets) do not have any heirs; what we leave behind is (to be given in) charity. The household of the Messenger of Allah (ﷺ) will live on the income from these properties, but, by Allah, I will not change the charity of the Messenger of Allah (ﷺ) from the condition in which it was in his own time. I will do the same with it as the Messenger of Allah (ﷺ) himself used to do. So Abu Bakr رضی ‌اللہ ‌عنہ refused to hand over anything from it to Fatima who got angry with Abu Bakr رضی ‌اللہ ‌عنہ for this reason. She forsook him and did not talk to him until the end of her life. She lived for six months after the death of the Messenger of Allah (ﷺ). When she died, her husband. 'Ali bin Abu Talib, buried her at night. He did not inform Abu Bakr رضی ‌اللہ ‌عنہ about her death and offered the funeral prayer over her himself. During the lifetime of Fatima, 'All received (special) regard from the people. After she had died, he felt estrangement in the faces of the people towards him. So he sought to make peace with Abu Bakr رضی ‌اللہ ‌عنہ and offer his allegiance to him. He had not yet owed allegiance to him as Caliph during these months. He sent a person to Abu Bakr رضی ‌اللہ ‌عنہ requesting him to visit him unaccompanied by anyone (disapproving the presence of Umar رضی ‌اللہ ‌عنہ). 'Umar رضی ‌اللہ ‌عنہ said to Abu Bakr رضی ‌اللہ ‌عنہ: BY Allah, you will not visit them alone. Abu Bakr رضی ‌اللہ ‌عنہ said: What will they do to me? By Allah, I will visit them. And he did pay them a visit alone. 'All recited Tashahhud (as it is done in the beginning of a religious sermon) ; then said: We recognize your moral excellence and what Allah has bestowed upon you. We do not envy the favor (i. e. the Catiphate) which Allah has conferred upon you; but you have done it (assumed the position of Caliph) alone (without consulting us), and we thought we had a right (to be consulted) on account of our kinship with the Messenger of Allah (ﷺ). He continued to talk to Abu Bakr رضی ‌اللہ ‌عنہ (in this vein) until the latter's eyes welled up with tears. Then Abd Bakr رضی ‌اللہ ‌عنہ  spoke and said: By Allah, in Whose Hand is my life, the kinship of the Messenger of Allah (ﷺ) is dearer to me than the kinship of my own people. As regards the dispute that has arisen between you and me about these properties, I have not deviated from the right course and I have not given up doing about them what the Messenger of Allah (ﷺ) used to do. So 'Ali said to Abu Bakr رضی ‌اللہ ‌عنہ : This aftertnoon is (fixed) for (swearing) allegiance (to you). So when Abu Bakr رضی ‌اللہ ‌عنہ had finished his Zuhr prayer, he ascended the pulpit and recited Tashahhud, and described the status of 'Ali رضی ‌اللہ ‌عنہ , his delay in swearing allegiance and the excuse which lie had offered to him (for this delay). (After this) he asked for God's forgiveness. Then 'Ali bin Abu Talib recited the Tashahhud. extolled the merits of Abu Bakr رضی ‌اللہ ‌عنہ and (said that) his action was not prompted by any jealousy of Abu Bakr رضی ‌اللہ ‌عنہ on his part or his refusal to accept the high position which Allah had conferred upon him, (adding:) But we were of the opinion that we should have a share in the government, but the matter had been decided without taking us into confidence, and this displeased us. (Hence the delay in offering allegiance. The Muslims were pleased with this (explanation) and they said: You have done the right thing. The Muslims were (again) favorably inclined to 'Ali رضی ‌اللہ ‌عنہ since he adopted the proper course of action",
                "hadithUrdu": "حضرت فاطمہ زہرا رضی ‌اللہ ‌عنہا رسول اﷲ صلی ‌اللہ ‌علیہ ‌وسلم کی صاحبزادی نے حضرت ابوبکر صدیق رضی ‌اللہ ‌عنہ کے پاس کسی کو بھیجا اپنا ترکہ مانگنے کو رسول اﷲ صلی ‌اللہ ‌علیہ ‌وسلم کے ان مالوں میں سے جو اﷲ تعالیٰ نے دئیے آپ کو مدینہ میں اور فدک میں اور جو کچھ بچتا تھا خیبر کے خمس میں سے۔ حضرت ابوبکر رضی ‌اللہ ‌عنہ نے کہا رسول اﷲ صلی ‌اللہ ‌علیہ ‌وسلم نے فرمایا ہمارا کوئی وارث نہیں ہوتا اور جو ہم چھوڑ جاویں وہ صدقہ ہے اور حضرت محمد صلی ‌اللہ ‌علیہ ‌وسلم کی اولاد اسی مال میں سے کھاوے گی اور میں تو قسم خدا کی رسول اﷲ صلی ‌اللہ ‌علیہ ‌وسلم کے صدقہ کو کچھ بھی نہیں بدلوں گا اس حال سے جیسے رسول اﷲ صلی ‌اللہ ‌علیہ ‌وسلم کے زمانہ مبارک میں تھا اور میں اس میں وہی کام کروں گا جو جناب رسول اﷲ صلی ‌اللہ ‌علیہ ‌وسلم کرتے تھے۔ غرضیکہ حضرت ابوبکر رضی ‌اللہ ‌عنہ نے انکار کیا حضرت فاطمہ رضی ‌اللہ ‌عنہ کو کچھ دینے اور حضرت فاطمہ کو غصہ آیا انہوں نے حضرت ابوبکر رضی ‌اللہ ‌عنہ سے ملاقات چھوڑ دی اور بات نہ کی یہاں تک کہ وفات ہوئی ان کی ( نوویؒ نے کہا یہ ترک ملاقات وہ ترک نہیں جو شرع میں حرام ہے او روہ یہ ہے کہ ملاقات کے وقت سلام نہ کرے یا سلام کا جواب نہ دے ) اور وہ رسول اﷲ صلی ‌اللہ ‌علیہ ‌وسلم کے بعد صرف چھ مہینہ زندہ رہیں۔ ( بعضوں نے کہا آٹھ مہینے یا نو مہینے یا دو مہینے یا ستر دن ) بہرحال تین تاریخ رمضان مبارک ۱۱ھ مقدس کو انہوں نے انتقال فرمایا۔ جب ان کا انتقال ہوا ت وان کے خاوند حضرت علی بن ابی طالب رضی ‌اللہ ‌عنہ نے ان کو رات کو دفن کیااور حضرت ابوبکر رضی ‌اللہ ‌عنہ کو خبر نہ کی ( اس سے معلوم ہوا کہ رات کو دفن کرنا بھی جائز ہے اور دن کو افضل ہے اگر کوئی عذر نہ ہو ) اور نماز پڑھی ان پر حضرت علی کرم اﷲ وجہہ نے اور جب تک حضرت فاطمہ زہرا رضی ‌اللہ ‌عنہ زندہ تھیں تب تک لوگ حضرت علی کرم اﷲ وجہہ کی طرف مائل تھے ( بوجہ فاطمہ رضی ‌اللہ ‌عنہ کے ) ۔ جب وہ انتقال کرگئیں تو حضرت علی رضی ‌اللہ ‌عنہ نے دیکھا لوگ میری طرف سے پھر گئے۔ انہوں نے حضرت ابوبکر رضی ‌اللہ ‌عنہ سے صلح کرلینا چاہا اور ان سے بیعت کرلینا مناسب سمجھا اور ابھی تک کئی مہینے گزرے تھے انہوں نے بیعت نہیں کی تھی حضرت ابوبکر رضی ‌اللہ ‌عنہ سے تو حضرت علی رضی ‌اللہ ‌عنہ نے حضرت ابوبکر صدیق رضی ‌اللہ ‌عنہ کو بلا بھیجا او ریہ کہلا بھیجا کہ آپ اکیلے آئیے آپ کے ساتھ کوئی نہ آوے کیونکہ وہ حضرت عمر رضی ‌اللہ ‌عنہ کا آنا ناپسند کرتے تھے۔ حضرت عمر رضی ‌اللہ ‌عنہ نے حضرت ابوبکر صدیق رضی ‌اللہ ‌عنہ سے کہا قسم خدا کی تم اکیلے ان کے پاس نہ جاؤگے۔ حضرت ابوبکر رضی ‌اللہ ‌عنہ نے کہا وہ میرے ساتھ کیا کریں گے قسم خدا کی میں تو اکیلا جاؤں گا۔ آخر حضرت ابوبکر رضی ‌اللہ ‌عنہ ان کے پاس گئے اور حضرت علی رضی ‌اللہ ‌عنہ نے تشہد پڑھا ( جیسے خطبہ کے شروع میں پڑھتے ہیں ) پھر کہا ہم نے پہچانا اے ابوبکر رضی ‌اللہ ‌عنہ تمہاری فضیلت کو اور جو اﷲ نے تم کو دیا اور ہم رشک نہیں کرتے اس نعمت پر جو اﷲ نے تم کو دی ( یعنی خلافت او رحکومت ) لیکن تم نے اکیلے اکیلے یہ کام کرلیا اور ہم سمجھتے تھے کہ ہمارا بھی حق ہے اس میں کیونکہ ہم قرابت رکھتے تھے رسول اﷲ صلی ‌اللہ ‌علیہ ‌وسلم سے۔ پھر برابر حضرت ابوبکر رضی ‌اللہ ‌عنہ سے باتیں کرتے رہے یہاں تک کہ حضرت ابوبکر صدیق رضی ‌اللہ ‌عنہ کی آنکھیں بھر آئیں۔ جب حضرت ابوبکر رضی ‌اللہ ‌عنہ نے گفتگو شروع کی تو کہا قسم اس کی جس کے ہاتھ میں میری جان ہے جناب رسول اﷲ صلی ‌اللہ ‌علیہ ‌وسلم کی قرابت کا لحاظ مجھ کو اپنی قرابت سے زیادہ ہے اور یہ جو مجھ میں اور تم میں ان باتوں کی بابت ( یعنی فدک اور نضیر او رخمس خیبر وغیرہ ) اختلاف ہوا تو میں نے حق کو نہیں چھوڑا او رمیں نے وہ کوئی کام نہیں چھوڑا جس کو میں نے دیکھا رسول اﷲ صلی ‌اللہ ‌علیہ ‌وسلم کو کرتے ہوئے بلکہ اس کو میں نے کیا۔ حضرت علی رضی ‌اللہ ‌عنہ نے حضرت ابوبکر رضی ‌اللہ ‌عنہ سے کہا اچھا آج سہ پہر کو ہم آپ سے بیعت کریں گے۔ جب حضرت ابوبکر رضی ‌اللہ ‌عنہ ظہر کی نماز سے فارغ ہوئے تو منبر پر چڑھے اور تشہد پڑھا او رحضرت علی رضی ‌اللہ ‌عنہ کا قصہ بیان کیا اور ان کے دیر کرنے کا بیعت سے اور جو عذر انہوں نے بیان کیا تھا وہ بھی کہا پھر دعا کی مغفرت کی اور حضرت علی رضی ‌اللہ ‌عنہ نے تشہد پڑھا اور حضرت ابوبکر صدیق رضی ‌اللہ ‌عنہ کی فضیلت بیان کی اور یہ کہا کہ میرا دیر کرنا بیعت میں اس وجہ سے نہ تھا کہ مجھ کو حضرت ابوبکر رضی ‌اللہ ‌عنہ پر شک ہے یا ان کی بزرگی اور فضیلت کا مجھے انکار ہے بلکہ ہم یہ سمجھتے تھے کہ اس خلافت میں ہمارا بھی حصہ ہے اور حضرت ابوبکر نے اکیلے بعیر صلاح کے یہ کام کرلیا اس وجہ سے ہمارے دل کو یہ رنج ہوا۔ یہ سن کر مسلمان خوش ہوئے اور سب نے حضرت علی رضی ‌اللہ ‌عنہ سے کہا تم نے ٹھیک کام کیا۔ اس روز سے مسلمان حضرت علی رضی ‌اللہ ‌عنہ کی طرف مائل ہوگئے جب انہوں نے واجبی امر کو اختیار کیا۔",
                "urduNarrator": "مجھ سے محمد بن رافع نے بیان کیا، کہا ہم سے حجین نے بیان کیا، ہم سے لیث نے بیان کیا، عقیل کی سند سے، ابن شہاب سے، عروہ بن زبیر سے, ام المومنین حضرت عائشہ رضی ‌اللہ ‌عنہا سے روایت ہے",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، أَخْبَرَنَا حُجَيْنٌ، حَدَّثَنَا لَيْثٌ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، أَنَّهَا أَخْبَرَتْهُ أَنَّ فَاطِمَةَ بِنْتَ رَسُولِ اللَّهِ صلى الله عليه وسلم أَرْسَلَتْ إِلَى أَبِي بَكْرٍ الصِّدِّيقِ تَسْأَلُهُ مِيرَاثَهَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم مِمَّا أَفَاءَ اللَّهُ عَلَيْهِ بِالْمَدِينَةِ وَفَدَكٍ وَمَا بَقِيَ مِنْ خُمْسِ خَيْبَرَ فَقَالَ أَبُو بَكْرٍ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ ‏ لاَ نُورَثُ مَا تَرَكْنَا صَدَقَةٌ إِنَّمَا يَأْكُلُ آلُ مُحَمَّدٍ - صلى الله عليه وسلم - فِي هَذَا الْمَالِ ‏ ‏ ‏.‏ وَإِنِّي وَاللَّهِ لاَ أُغَيِّرُ شَيْئًا مِنْ صَدَقَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم عَنْ حَالِهَا الَّتِي كَانَتْ عَلَيْهَا فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَلأَعْمَلَنَّ فِيهَا بِمَا عَمِلَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَبَى أَبُو بَكْرٍ أَنْ يَدْفَعَ إِلَى فَاطِمَةَ شَيْئًا فَوَجَدَتْ فَاطِمَةُ عَلَى أَبِي بَكْرٍ فِي ذَلِكَ - قَالَ - فَهَجَرَتْهُ فَلَمْ تُكَلِّمْهُ حَتَّى تُوُفِّيَتْ وَعَاشَتْ بَعْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم سِتَّةَ أَشْهُرٍ فَلَمَّا تُوُفِّيَتْ دَفَنَهَا زَوْجُهَا عَلِيُّ بْنُ أَبِي طَالِبٍ لَيْلاً وَلَمْ يُؤْذِنْ بِهَا أَبَا بَكْرٍ وَصَلَّى عَلَيْهَا عَلِيٌّ وَكَانَ لِعَلِيٍّ مِنَ النَّاسِ وِجْهَةٌ حَيَاةَ فَاطِمَةَ فَلَمَّا تُوُفِّيَتِ اسْتَنْكَرَ عَلِيٌّ وُجُوهَ النَّاسِ فَالْتَمَسَ مُصَالَحَةَ أَبِي بَكْرٍ وَمُبَايَعَتَهُ وَلَمْ يَكُنْ بَايَعَ تِلْكَ الأَشْهُرَ فَأَرْسَلَ إِلَى أَبِي بَكْرٍ أَنِ ائْتِنَا وَلاَ يَأْتِنَا مَعَكَ أَحَدٌ - كَرَاهِيَةَ مَحْضَرِ عُمَرَ بْنِ الْخَطَّابِ - فَقَالَ عُمَرُ لأَبِي بَكْرٍ وَاللَّهِ لاَ تَدْخُلْ عَلَيْهِمْ وَحْدَكَ ‏.‏ فَقَالَ أَبُو بَكْرٍ وَمَا عَسَاهُمْ أَنْ يَفْعَلُوا بِي إِنِّي وَاللَّهِ لآتِيَنَّهُمْ ‏.‏ فَدَخَلَ عَلَيْهِمْ أَبُو بَكْرٍ ‏.‏ فَتَشَهَّدَ عَلِيُّ بْنُ أَبِي طَالِبٍ ثُمَّ قَالَ إِنَّا قَدْ عَرَفْنَا يَا أَبَا بَكْرٍ فَضِيلَتَكَ وَمَا أَعْطَاكَ اللَّهُ وَلَمْ نَنْفَسْ عَلَيْكَ خَيْرًا سَاقَهُ اللَّهُ إِلَيْكَ وَلَكِنَّكَ اسْتَبْدَدْتَ عَلَيْنَا بِالأَمْرِ وَكُنَّا نَحْنُ نَرَى لَنَا حَقًّا لِقَرَابَتِنَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ فَلَمْ يَزَلْ يُكَلِّمُ أَبَا بَكْرٍ حَتَّى فَاضَتْ عَيْنَا أَبِي بَكْرٍ فَلَمَّا تَكَلَّمَ أَبُو بَكْرٍ قَالَ وَالَّذِي نَفْسِي بِيَدِهِ لَقَرَابَةُ رَسُولِ اللَّهِ صلى الله عليه وسلم أَحَبُّ إِلَىَّ أَنْ أَصِلَ مِنْ قَرَابَتِي وَأَمَّا الَّذِي شَجَرَ بَيْنِي وَبَيْنَكُمْ مِنْ هَذِهِ الأَمْوَالِ فَإِنِّي لَمْ آلُ فِيهِ عَنِ الْحَقِّ وَلَمْ أَتْرُكْ أَمْرًا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَصْنَعُهُ فِيهَا إِلاَّ صَنَعْتُهُ ‏.‏ فَقَالَ عَلِيٌّ لأَبِي بَكْرٍ مَوْعِدُكَ الْعَشِيَّةُ لِلْبَيْعَةِ ‏.‏ فَلَمَّا صَلَّى أَبُو بَكْرٍ صَلاَةَ الظُّهْرِ رَقِيَ عَلَى الْمِنْبَرِ فَتَشَهَّدَ وَذَكَرَ شَأْنَ عَلِيٍّ وَتَخَلُّفَهُ عَنِ الْبَيْعَةِ وَعُذْرَهُ بِالَّذِي اعْتَذَرَ إِلَيْهِ ثُمَّ اسْتَغْفَرَ وَتَشَهَّدَ عَلِيُّ بْنُ أَبِي طَالِبٍ فَعَظَّمَ حَقَّ أَبِي بَكْرٍ وَأَنَّهُ لَمْ يَحْمِلْهُ عَلَى الَّذِي صَنَعَ نَفَاسَةً عَلَى أَبِي بَكْرٍ وَلاَ إِنْكَارًا لِلَّذِي فَضَّلَهُ اللَّهُ بِهِ وَلَكِنَّا كُنَّا نَرَى لَنَا فِي الأَمْرِ نَصِيبًا فَاسْتُبِدَّ عَلَيْنَا بِهِ فَوَجَدْنَا فِي أَنْفُسِنَا فَسُرَّ بِذَلِكَ الْمُسْلِمُونَ وَقَالُوا أَصَبْتَ ‏.‏ فَكَانَ الْمُسْلِمُونَ إِلَى عَلِيٍّ قَرِيبًا حِينَ رَاجَعَ الأَمْرَ الْمَعْرُوفَ ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12145,
                "hadithNumber": "4581",
                "englishNarrator": "It has been narrated on the authority of 'A'isha رضی اﷲ عنہا :",
                "hadithEnglish": "Fatima رضی اﷲ عنہا and 'Abbas رضی اﷲ عنہ approached Abu Bakr, soliciting transfer of the legacy of the Messenger of Allah (ﷺ) to them. At that time, they were demanding his (Holy Prophet's) lands at Fadak and his share from Khaibar. Abu Bakr رضی اﷲ عنہ said to them: I have heard from the Messenger of Allah (ﷺ). Then he quoted the hadith having nearly the same meaning as the one which has been narrated by Uqail on the authority of al-Zuhri (and which his gone before) except that in his version he said: Then 'Ali رضی اﷲ عنہ stood up, extolled the merits of Abu Bakr رضی اﷲ عنہ mentioned his superiority, and his earlier acceptance of Islam. Then he walked to Abu Bakr رضی اﷲ عنہ and swore allegiance to him. (At this) people turned towards 'Ali رضی اﷲ عنہ and said: you have done the right thing. And they became favorably inclined to 'Ali after he had adopted the proper course of action.",
                "hadithUrdu": "حضرت فاطمہ زہرا رضی اﷲ عنہا اور حضرت عباس دونوں حضرت ابوبکر رضی ‌اللہ ‌عنہ کے پاس آئے اپنا حصہ مانگتے تھے رسول اﷲ صلی ‌اللہ ‌علیہ ‌وسلم کے مال میں سے اور وہ اس وقت طلب کرتے تھے فدک کی زمین او رخیبر کا حصہ ابوبکر صدیق نے کہا کہ میں نے سنا ہے رسول اﷲ صلی ‌اللہ ‌علیہ ‌وسلم سے پھر بیان کیا حدیث کو اسی طرح جیسے اوپر گزری اس میں یہ ہے کہ پھر حضرت علی کرم اﷲ وجہہ کھڑے ہوئے اور حضرت ابوبکر رضی ‌اللہ ‌عنہ کی بڑائی بیان کی اور ان کی فضیلت اور سبقت اسلام کا ذکر کیا پھر ابوبکر رضی ‌اللہ ‌عنہ کے پاس گئے اور ان سے بیعت کی۔ اس وقت لوگ حضرت علی رضی ‌اللہ ‌عنہ کی طرف متوجہ ہوئے او رکہنے لگے آپ نے ٹھیک کیا اور اچھا کیا اور اس وقت سے لوگ ان کے طرفدار ہوگئے جب سے انہوں نے واجبی بات کو مان لیا۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم، محمد بن رافع اور عبد بن حمید نے بیان کیا اور ہم سے عبد الرزاق نے بیان کیا۔ ہمیں معمر نے الزہری کی سند سے اور عروہ کی سند سے بیان کیا, ام المومنین حضرت عائشہ رضی اﷲ عنہا سے روایت ہے",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَ مُحَمَّدُ بْنُ رَافِعٍ وَعَبْدُ بْنُ حُمَيْدٍ قَالَ ابْنُ رَافِعٍ حَدَّثَنَا وَقَالَ الآخَرَانِ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّصلى الله عليه وسلم وَهُمَا حِينَئِذٍ يَطْلُبَانِ أَرْضَهُ مِنْ فَدَكٍ وَسَهْمَهُ مِنْ خَيْبَرَ ‏.‏ فَقَالَ لَهُمَا أَبُو بَكْرٍ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم ‏.‏ وَسَاقَ الْحَدِيثَ بِمِثْلِ مَعْنَى حَدِيثِ عُقَيْلٍ عَنِ الزُّهْرِيِّ غَيْرَ أَنَّهُ قَالَ ثُمَّ قَامَ عَلِيٌّ فَعَظَّمَ مِنْ حَقِّ أَبِي بَكْرٍ وَذَكَرَ فَضِيلَتَهُ وَسَابِقَتَهُ ثُمَّ مَضَى إِلَى أَبِي بَكْرٍ فَبَايَعَهُ فَأَقْبَلَ النَّاسُ إِلَى عَلِيٍّ فَقَالُوا أَصَبْتَ وَأَحْسَنْتَ ‏.‏ فَكَانَ النَّاسُ قَرِيبًا إِلَى عَلِيٍّ حِينَ قَارَبَ الأَمْرَ الْمَعْرُوفَ ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12146,
                "hadithNumber": "4582",
                "englishNarrator": "'Urwa bin Zubair narrated that 'A'isha رضی اﷲ عنہا , wife of the Prophet (ﷺ), that",
                "hadithEnglish": "Fatima رضی اﷲ عنہا , daughter of the Messenger of Allah (ﷺ), requested Abu Bakr  رضی اﷲ عنہ , after the death of the Messenger of Allah (may peace he upon him), that he should set apart her share from what the Messenger of Allah (ﷺ) had left from the properties that God had bestowed upon him. Abu Bakr رضی اﷲ عنہ said to her: The Messenger of Allah (ﷺ) said: We do not have any heirs; what we leave behind is Sadaqa (charity). The narrator said: She (Fatima) lived six months after the death of the Messenger of Allah (ﷺ) and she used to demand from Abu Bakr رضی اﷲ عنہ  her share from the legacy of the Messenger of Allah (ﷺ) from Khaibar, Fadak and his charitable endowments at Medina. Abu Bakr رضی اﷲ عنہ refused to give her this, and said: I am not going to give up doing anything which the Messenger of Allah (ﷺ) used to do. I am afraid that it I go against his instructions in any matter I shall deviate from the right course. So far as the charitable endowments at Medina were concerned, 'Umar رضی اﷲ عنہ handed them over to 'Ali رضی اﷲ عنہ and Abbas رضی اﷲ عنہ, but 'Ali got the better of him (and kept the property under his exclusive possession). And as far as Khaibar and Fadak were concerned 'Umar رضی اﷲ عنہ kept them with him, and said: These are the endowments of the Messenger of Allah (ﷺ) (to the Umma). Their income was spent on the discharge of the responsibilities that devolved upon him on the emergencies he had to meet. And their management was to be in the hands of one who managed the affairs (of the Islamic State). The narrator said: They have been managed as such up to this day.",
                "hadithUrdu": "حضرت فاطمہ رضی اﷲ عنہا رسول اﷲ صلی ‌اللہ ‌علیہ ‌وسلم کی صاحبزادی نے رسول اﷲ صلی ‌اللہ ‌علیہ ‌وسلم کی وفات کے بعد ابوبکر رضی ‌اللہ ‌عنہ سے اپناحصہ مانگا رسول اﷲ صلی ‌اللہ ‌علیہ ‌وسلم کے ترکہ سے جو اﷲ تعالیٰ نے آپ کو دیا تھا۔ حضرت ابوبکر رضی ‌اللہ ‌عنہ نے کہا رسول اﷲ صلی ‌اللہ ‌علیہ ‌وسلم نے تو یہ فرمایا ہے ہمارا کوئی وارث نہیں ہوتا اور جو ہم چھوڑ جاویں وہ صدقہ ہے اور حضرت فاطمہ رضی ‌اللہ ‌عنہ رسول اﷲ صلی ‌اللہ ‌علیہ ‌وسلم کی وفات کے بعد صرف چھ مہینے تک زندہ رہیں اور وہ اپنا حصہ مانگتی تھیں خیبر اور فدک اور مدینہ کے صدقہ میں سے۔ حضرت ابوبکر صدیق رضی اﷲ عنہ نے نہ دیا اور یہ کہا کہ میں کوئی کام جس کو رسول اﷲ صلی ‌اللہ ‌علیہ ‌وسلم کرتے تھے چھوڑنے والا نہیں میں ڈرتا ہوں کہیں گمراہ نہ ہوجاؤں۔ پھر مدینہ کا صدقہ حضرت عمر رضی ‌اللہ ‌عنہ نے اپنے زمانے میں حضرت علی رضی ‌اللہ ‌عنہ اور عباس رضی ‌اللہ ‌عنہ کو دے دیا لیکن حضرت علی رضی ‌اللہ ‌عنہ نے عباس رضی ‌اللہ ‌عنہ پر غلبہ کیا ( یعنی اپنے قبضہ میں رکھا ) او رخیبر اور فدک کو حضرت عمر رضی ‌اللہ ‌عنہ نے اپنے قبضہ میں رکھا اور یہ کہا کہ یہ دونوں صدقہ تھے رسول اﷲ صلی ‌اللہ ‌علیہ ‌وسلم کے جو صرف ہوتے آپ کے حقوق او رکاموں میں جو پیش آتے آپ کو اور یہ دونوں اس کے اختیار میں رہیں گے جو حاکم ہو مسلمانوں کا پھر آج تک ایسا ہی رہا ( یعنی خیبر اور فدک ہمیشہ خلیفہ وقت کے قبضہ میں رہے۔ حضرت علی رضی ‌اللہ ‌عنہ نے بھی اپنی خلاف میں ان کو تقسیم نہیں کیا۔ پس شیعوں کا اعتراض حضرت ابوبکر صدیق اور حضرت عمر فاروق رضی اﷲ عنہم پر لغو ہوگیا ) ۔",
                "urduNarrator": "ہم سے ابن نمیر نے بیان کیا، ہم سے یعقوب بن ابراہیم نے بیان کیا، ہم سے زہیر بن حرب نے بیان کیا اور ہم سے حسن بن علی الحلوانی نے بیان کیا، انہوں نے کہا, ہم سے یعقوب نے بیان کیا , وہ ابراہیم کے بیٹے ہیں, ہم سے میرے والد نے بیان کیا ، صالح کی سند سے ، ابن شہاب کی سند سے ، عروہ بن الزبیر نے بیان کیا ،ام المومنین حضرت عائشہ رضی اﷲ عنہا سے روایت ہے",
                "hadithArabic": "وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَالْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ قَالاَ حَدَّثَنَا يَعْقُوبُ، - وَهُوَ ابْنُ إِبْرَاهِيمَ - حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهُ أَنَّ فَاطِمَةَ بِنْتَ رَسُولِ اللَّهِ صلى الله عليه وسلم سَأَلَتْ أَبَا بَكْرٍ بَعْدَ وَفَاةِ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنْ يَقْسِمَ لَهَا مِيرَاثَهَا مِمَّا تَرَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِمَّا أَفَاءَ اللَّهُ عَلَيْهِ ‏.‏ فَقَالَ لَهَا أَبُو بَكْرٍ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ ‏ لاَ نُورَثُ مَا تَرَكْنَا صَدَقَةٌ ‏ ‏ ‏.‏ قَالَ وَعَاشَتْ بَعْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم سِتَّةَ أَشْهُرٍ وَكَانَتْ فَاطِمَةُ تَسْأَلُ أَبَا بَكْرٍ نَصِيبَهَا مِمَّا تَرَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ خَيْبَرَ وَفَدَكٍ وَصَدَقَتِهِ بِالْمَدِينَةِ فَأَبَى أَبُو بَكْرٍ عَلَيْهَا ذَلِكَ وَقَالَ لَسْتُ تَارِكًا شَيْئًا كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَعْمَلُ بِهِ إِلاَّ عَمِلْتُ بِهِ إِنِّي أَخْشَى إِنْ تَرَكْتُ شَيْئًا مِنْ أَمْرِهِ أَنْ أَزِيغَ فَأَمَّا صَدَقَتُهُ بِالْمَدِينَةِ فَدَفَعَهَا عُمَرُ إِلَى عَلِيٍّ وَعَبَّاسٍ فَغَلَبَهُ عَلَيْهَا عَلِيٌّ وَأَمَّا خَيْبَرُ وَفَدَكُ فَأَمْسَكَهُمَا عُمَرُ وَقَالَ هُمَا صَدَقَةُ رَسُولِ اللَّهِ صلى الله عليه وسلم كَانَتَا لِحُقُوقِهِ الَّتِي تَعْرُوهُ وَنَوَائِبِهِ وَأَمْرُهُمَا إِلَى مَنْ وَلِيَ الأَمْرَ قَالَ فَهُمَا عَلَى ذَلِكَ إِلَى الْيَوْمِ ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12147,
                "hadithNumber": "4583",
                "englishNarrator": "It has been narrated on the authority of Abu Huraira ‌رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "The Messenger of Allah (ﷺ) said: My heirs cannot share even a dinar (from my legacy) ; what I leave behind after paving maintenance allowance to my wives and remuneration to my manager is (to go in) charity.",
                "hadithUrdu": "رسول ‌اللہ ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌نے ‌فرمایا ‌میرے ‌وارث ‌ایک ‌دینار ‌بھی ‌بانٹ ‌نہیں ‌سکتے ‌جو ‌چھوڑ ‌جاؤں ‌اپنی ‌عورتوں  کے ‌خرچ ‌ ‌ کے ‌بعد ‌اور ‌منتظم ‌ کی ‌اجرت ‌ ‌ کے ‌بعد ‌بچے ‌تو ‌وہ ‌صدقہ ‌ہے ‌.",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے مالک رحمہ اللہ کو ابو الزناد کی سند سے اور العرج کی سند سے پڑھا, حضرت ‌ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌سے ‌روایت ‌ہے ‌",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"\"‏ لاَ يَقْتَسِمُ وَرَثَتِي دِيِنَارًا مَا تَرَكْتُ بَعْدَ نَفَقَةِ نِسَائِي وَمَئُونَةِ عَامِلِي فَهُوَ صَدَقَةٌ ‏\"\"‏ ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12148,
                "hadithNumber": "4584",
                "englishNarrator": null,
                "hadithEnglish": "A similar report (as no. 4583) was narrated from Abu Zinad through with this chain.",
                "hadithUrdu": "ہم سے محمد بن یحییٰ بن ابی عمر المکی نے بیان کیا، ہم سے سفیان نے ابو الزناد کی سند سے اسی طرح روایت کی۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ أَبِي عُمَرَ الْمَكِّيُّ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزِّنَادِ، بِهَذَا الإِسْنَادِ ‏.‏ نَحْوَهُ ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12149,
                "hadithNumber": "4585",
                "englishNarrator": "It his been narrated on the authority of Abu Huraira ‌رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "The Messenger of Allah (ﷺ) said: \"\" We do not have any heirs; what we leave behind is a charitable endowment.\"\"",
                "hadithUrdu": "‌رسول ‌اللہ ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌نے ‌فرمایا ‌ہمارا ‌کوئی ‌وارث ‌نہیں ‌جو ‌ہم ‌چھوڑ ‌جائیں ‌وہ ‌صدقہ ‌ہے ‌۔",
                "urduNarrator": "مجھ سے ابن ابی خلف نے بیان کیا، کہا ہم سے زکریا بن عدی نے بیان کیا، کہا کہ ہم سے ابن مبارک نے بیان کیا، یونس کی سند سے، زہری کی سند سے، العرج کی سند سے, ابو ‌ہریرہ ‌رضی ‌اللہ ‌عنہ ‌سے ‌روایت ‌ہے ‌کہ",
                "hadithArabic": "وَحَدَّثَنِي ابْنُ أَبِي خَلَفٍ، حَدَّثَنَا زَكَرِيَّاءُ بْنُ عَدِيٍّ، أَخْبَرَنَا ابْنُ الْمُبَارَكِ، عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"\"‏ لاَ نُورَثُ مَا تَرَكْنَا صَدَقَةٌ ‏\"\"‏ ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12150,
                "hadithNumber": "4586",
                "englishNarrator": "It was narrated from Abdullah bin 'Umar رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ﷺ divided the spoils of war: two shares for the horseman and one share for the foot solider.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے غنیمت میں سے گھوڑے کے لیے دو حصے اور آدمی ( سوار ) کے لیے ایک حصہ نکالا.",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ اور ابو کامل فضیل بن حسین نے بیان کیا، ان دونوں نے سلیم کی سند سے کہا, سلیم بن اخضر نے ہمیں عبیداللہ بن عمر سے خبر دی ، کہا : ہمیں نافع نے حضرت عبداللہ بن عمر رضی اللہ عنہ سے حدیث بیان کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو كَامِلٍ فُضَيْلُ بْنُ حُسَيْنٍ، كِلَاهُمَا عَنْ سُلَيْمٍ، قَالَ يَحْيَى: أَخْبَرَنَا سُلَيْمُ بْنُ أَخْضَرَ، عَنْ عُبَيْدِ اللهِ بْنِ عُمَرَ، حَدَّثَنَا نَافِعٌ، عَنْ عَبْدِ اللهِ بْنِ عُمَرَأَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَسَمَ فِي النَّفَلِ، لِلْفَرَسِ سَهْمَيْنِ، وَلِلرَّجُلِ سَهْمًا.",
                "headingArabic": "كَيْفِيَّةِ قِسْمَةِ الْغَنِيمَةِ بَيْنَ الْحَاضِرِينَ ‏‏",
                "headingUrdu": "وہ طحہٰ کی طرح ہے، وہ غیر حاضر دماغ ہے، اور وہ مغرور ہے۔",
                "headingEnglish": "How booty is to be shared among the fighters",
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12151,
                "hadithNumber": "4587",
                "englishNarrator": null,
                "hadithEnglish": "The same tradition has been narrated on the authority of Ubaidullah by a different chain of transmitters who do not mention the words: from the booty.",
                "hadithUrdu": "عبداللہ بن نمیر نے عبیداللہ سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی اور انہوں نے یہ نہیں کہا : غنیمت میں.",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَاهُ ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللهِ، بِهَذَا الْإِسْنَادِ مِثْلَهُ، وَلَمْ يَذْكُرْ فِي النَّفَلِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12152,
                "hadithNumber": "4588",
                "englishNarrator": "It has been narrated on the authority of `Umar bin al-Khattab رضی اللہ عنہ who said:",
                "hadithEnglish": "When it was the day on which the Battle of Badr was fought, the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) cast a glance at the infidels, and they were one thousand while his own Companions were three hundred and nineteen. The Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) turned (his face) towards the Qibla. Then he stretched his hands and began his supplication to his Lord: O Allah, accomplish for me what Thou hast promised to me. O Allah, bring about what Thou hast promised to me. O Allah, if this small band of Muslims is destroyed. Thou will not be worshipped on this earth. He continued his supplication to his Lord, stretching his hands, facing the Qibla, until his mantle slipped down from his shoulders. So Abu Bakr رضی اللہ عنہ came to him, picked up his mantle and put it on his shoulders. Then he embraced him from behind and said: Prophet of Allah, this prayer of yours to your Lord will suffice you, and He will fulfill for you what He has promised you. So Allah, the Glorious and Exalted, revealed (the Qur'anic verse): When ye appealed to your Lord for help, He responded to your call (saying): I will help you with one thousand angels coming in succession. So Allah helped him with angels. Abu Zumail said that the hadith was narrated to him by Ibn `Abbas رضی اللہ عنہ who said: While on that day a Muslim was chasing a disbeliever who was going ahead of him, he heard over him the swishing of the whip and the voice of the rider saying: Go ahead, Haizum! He glanced at the polytheist who had (now) fallen down on his back. When he looked at him (carefully he found that) there was a scar on his nose and his face was torn as if it had been lashed with a whip, and had turned green with its poison. An Ansari came to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and related this (event) to him. He said: You have told the truth. This was the help from the third heaven. The Muslims that day (i.e. the day of the Battle of Badr) killed seventy persons and captured seventy. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said to Abu Bakr رضی اللہ عنہ and `Umar (رضی اللہ عنہ): What is your opinion about these captives? Abu Bakr رضی اللہ عنہ said: They are our kith and kin. I think you should release them after getting from them a ransom. This will be a source of strength to us against the infidels. It is quite possible that Allah may guide them to Islam. Then the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم) said: What is your opinion, Ibn Khattab? He said: Messenger of Allah, I do not hold the same opinion as Abu Bakr رضی اللہ عنہ . I am of the opinion that you should hand them over to us so that we may cut off their heads. Hand over `Aqil to `Ali رضی اللہ عنہ that he may cut off his head, and hand over such and such relative to me that I may cut off his head. They are leaders of the disbelievers and veterans among them. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) approved the opinion of Abu Bakr رضی اللہ عنہ and did not approve what I said. The next day when I came to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), I found that both he and Abu Bakr were sitting shedding tears. I said: Messenger of Allah, why are you and your Companion shedding tears? Tell me the reason. For I will weep, or I will at least pretend to weep in sympathy with you. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: I weep for what has happened to your companions for taking ransom (from the prisoners). I was shown the torture to which they were subjected. It was brought to me as close as this tree. (He pointed to a tree close to him.) Then God revealed the verse: It is not befitting for a prophet that he should take prisoners until the force of the disbelievers has been crushed... to the end of the verse: so eat ye the spoils of war, (it is) lawful and pure. So Allah made booty lawful for them.",
                "hadithUrdu": "جب بدر کا دن تھا ، رسول اللہ صلی اللہ علیہ وسلم نے مشرکین کی طرف دیکھا ، وہ ایک ہزار تھے ، اور آپ کے ساتھ تین سو انیس آدمی تھے ، تو نبی صلی اللہ علیہ وسلم قبلہ رخ ہوئے ، پھر اپنے ہاتھ پھیلائے اور بلند آواز سے اپنے رب کو پکارنے لگے : \"\" اے اللہ! تو نے مجھ سے جو وعدہ کیا اسے میرے لیے پورا فرما ۔ اے اللہ! تو نے جو مجھ سے وعدہ کیا مجھے عطا فرما ۔ اے اللہ! اگر اہل اسلام کی یہ جماعت ہلاک ہو گئی تو زمین میں تیری بندگی نہیں ہو گی ۔ \"\" آپ قبلہ رو ہو کر اپنے ہاتھوں کو پھیلائے مسلسل اپنے رب کو پکارتے رہے حتی کہ آپ کی چادر آپ کے کندھوں سے گر گئی ۔ اس پر حضرت ابوبکر رضی اللہ عنہ آپ کے پاس آئے ، چادر اٹھائی اور اسے آپ کے کندھوں پر ڈالا ، پھر پیچھے سے آپ کے ساتھ چمٹ گئے اور کہنے لگے : اللہ کے نبی! اپنے رب سے آپ کا مانگنا اور پکارنا کافی ہو گیا ۔ وہ جلد ہی آپ سے کیا ہوا اپنا وعدہ پورا فرمائے گا ۔ اس پر اللہ عزوجل نے یہ آیت نازل فرمائی : \"\" جب تم لوگ اپنے رب سے مدد مانگ رہے تھے تو اس نے تمہاری دعا قبول کی کہ میں ایک دوسرے کے پیچھے اترنے والے ایک ہزار فرشتوں سے تمہاری مدد کروں گا ۔ \"\" پھر اللہ نے فرشتوں کے ذریعے سے آپ کی مدد فرمائی ۔ ابوزمیل نے کہا : مجھے حضرت ابن عباس رضی اللہ عنہ نے حدیث بیان کی ، انہوں نے کہا : اس دوران میں ، اس دن مسلمانوں میں سے ایک شخص اپنے سامنے بھاگتے ہوئے مشرکوں میں سے ایک آدمی کے پیچھے دوڑ رہا تھا کہ اچانک اس نے اپنے اوپر سے کوڑا مارنے اور اس کے اوپر سے گھڑ سوار کی آواز سنی ، جو کہہ رہا تھا : حیزوم! آگے بڑھ ۔ اس نے اپنے سامنے مشرک کی طرف دیکھا تو وہ چت پڑا ہوا تھا ، اس نے اس پر نظر ڈالی تو دیکھا کہ اس کی ناک پر نشان پڑا ہوا تھا ، کوڑے کی ضرب کی طرح اس کا چہرہ پھٹا ہوا تھا اور وہ پورے کا پورا سبز ہو چکا تھا ، وہ انصاری آیا اور رسول اللہ صلی اللہ علیہ وسلم کو یہ بات بتائی تو آپ نے فرمایا : \"\" تم نے سچ کہا ، یہ تیسرے آسمان سے ( آئی ہوئی ) مدد تھی ۔ \"\" انہوں ( صحابہ ) نے اس دن ستر آدمی قتل کیے اور ستر قیدی بنائے ۔ ابوزمیل نے کہا : حضرت ابن عباس رضی اللہ عنہ نے فرمایا : جب انہوں نے قیدیوں کو گرفتار کر لیا تو رسول اللہ صلی اللہ علیہ وسلم نے حضرت ابوبکر اور حضرت عمر رضی اللہ عنہما سے پوچھا : \"\" ان قیدیوں کے بارے میں تمہاری رائے کیا ہے؟ \"\" تو حضرت ابوبکر رضی اللہ عنہ نے کہا : اے اللہ کے نبی! یہ ہمارے چچا زاد اور خاندان کے بیٹے ہیں ۔ میری رائے ہے کہ آپ ان سے فدیہ لے لیں ، یہ کافروں کے خلاف ہماری قوت کا باعث ہو گا ، ہو سکتا ہے کہ اللہ ان کو اسلام کی راہ پر چلا دے ۔ اس کے بعد رسول اللہ صلی اللہ علیہ وسلم نے کہا : \"\" ابن خطاب! تمہاری کیا رائے ہے؟ \"\" کہا : میں نے عرض کی : نہیں ، اللہ کے رسول! اللہ کی قسم! میری رائے وہ نہیں جو ابوبکر رضی اللہ عنہ کی ہے ، بلکہ میری رائے یہ ہے کہ آپ ہمیں اختیار دیں اور ہم ان کی گردنیں اڑا دیں ۔ آپ عقیل پر علی رضی اللہ عنہ کو اختیار دیں وہ اس کی گردن اڑا دیں اور مجھے فلاں ۔ ۔ عمر کے ہم نسب ۔ ۔ پر اختیار دیں تو میں اس کی گردن اڑا دوں ۔ یہ لوگ کفر کے پیشوا اور بڑے سردار ہیں ۔ رسول اللہ صلی اللہ علیہ وسلم نے اس بات کو پسند کیا جو ابوبکر رضی اللہ عنہ نے کہی تھی اور جو میں نے کہا تھا اسے پسند نہ فرمایا ۔ جب اگلا دن ہوا ( اور ) میں حاضر ہوا تو دیکھا کہ رسول اللہ صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ دونوں بیٹھے ہوئے ہیں اور دونوں رو رہے ہیں ۔ میں نے عرض کی : اللہ کے رسول! مجھے بتائیے ، آپ اور آپ کا ساتھی کس چیز پر رو رہے ہیں؟ اگر مجھے رونا آ یا تو میں بھی روؤں گا اور اگر مجھے رونا نہ آیا تو بھی میں آپ دونوں کے رونے کی بنا پر رونے کی کوشش کروں گا ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" میں اس بات پر رو رہا ہوں جو تمہارے ساتھیوں نے ان سے فدیہ لینے کے بارے میں میرے سامنے پیش کی تھی ، ان کا عذاب مجھے اس درخت سے بھی قریب تر دکھایا گیا \"\" ۔ ۔ وہ درخت جو اللہ کے نبی صلی اللہ علیہ وسلم کے قریب تھا ۔ ۔ اور اللہ عزوجل نے یہ آیات نازل فرمائی ہیں : \"\" کسی نبی کے لیے ( روا ) نہ تھا کہ اس کے پاس قیدی ہوں ، یہاں تک کہ وہ زمین میں اچھی طرح خون بہائے ۔ ۔ ۔ \"\" اس فرمان تک ۔ ۔ ۔ \"\" تو تم اس میں سے کھاؤ جو حلال اور پاکیزہ غنیمتیں تم نے حاصل کی ہیں ۔ \"\" تو اس طرح اللہ نے ان کے لیے غنیمت کو حلال کر دیا.",
                "urduNarrator": "ہم سے ہناد بن السری نے بیان کیا، کہا ہم سے ابن المبارک نے بیان کیا، ان سے عکرمہ بن عمار نے بیان کیا، مجھ سے سماک الحنفی نے بیان کیا، انہوں نے کہا: میں نے ابن عباس رضی اللہ عنہما کو فرماتے ہوئے سنا: مجھ سے عمر بن الخطاب رضی اللہ عنہ نے بیان کیا، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، حَدَّثَنَا ابْنُ الْمُبَارَكِ، عَنْ عِكْرِمَةَ بْنِ عَمَّارٍ، حَدَّثَنِي سِمَاكٌ الْحَنَفِيُّ، قَالَ: سَمِعْتُ ابْنَ عَبَّاسٍ، يَقُولُ: حَدَّثَنِي عُمَرُ بْنُ الْخَطَّابِ، قَالَ: لَمَّا كَانَ يَوْمُ بَدْرٍ، ح وحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَاللَّفْظُ لَهُ، حَدَّثَنَا عُمَرُ بْنُ يُونُسَ الْحَنَفِيُّ، حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ، حَدَّثَنِي أَبُو زُمَيْلٍ هُوَ سِمَاكٌ الْحَنَفِيُّ، حَدَّثَنِي عَبْدُ اللهِ بْنُ عَبَّاسٍ، قَالَ: حَدَّثَنِي عُمَرُ بْنُ الْخَطَّابِ، قَالَ: لَمَّا كَانَ يَوْمُ بَدْرٍ [ص:1384] نَظَرَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِلَى الْمُشْرِكِينَ وَهُمْ أَلْفٌ، وَأَصْحَابُهُ ثَلَاثُ مِائَةٍ وَتِسْعَةَ عَشَرَ رَجُلًا، فَاسْتَقْبَلَ نَبِيُّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الْقِبْلَةَ، ثُمَّ مَدَّ يَدَيْهِ، فَجَعَلَ يَهْتِفُ بِرَبِّهِ: «اللهُمَّ أَنْجِزْ لِي مَا وَعَدْتَنِي، اللهُمَّ آتِ مَا وَعَدْتَنِي، اللهُمَّ إِنْ تُهْلِكْ هَذِهِ الْعِصَابَةَ مِنْ أَهْلِ الْإِسْلَامِ لَا تُعْبَدْ فِي الْأَرْضِ»، فَمَا زَالَ يَهْتِفُ بِرَبِّهِ، مَادًّا يَدَيْهِ مُسْتَقْبِلَ الْقِبْلَةِ، حَتَّى سَقَطَ رِدَاؤُهُ عَنْ مَنْكِبَيْهِ، فَأَتَاهُ أَبُو بَكْرٍ فَأَخَذَ رِدَاءَهُ، فَأَلْقَاهُ عَلَى مَنْكِبَيْهِ، ثُمَّ الْتَزَمَهُ مِنْ وَرَائِهِ، وَقَالَ: يَا نَبِيَّ اللهِ، كَفَاكَ مُنَاشَدَتُكَ رَبَّكَ، فَإِنَّهُ سَيُنْجِزُ لَكَ مَا وَعَدَكَ، فَأَنْزَلَ اللهُ عَزَّ وَجَلَّ: {إِذْ تَسْتَغِيثُونَ رَبَّكُمْ فَاسْتَجَابَ لَكُمْ أَنِّي مُمِدُّكُمْ بِأَلْفٍ مِنَ الْمَلَائِكَةِ مُرْدِفِينَ} [الأنفال: 9] فَأَمَدَّهُ اللهُ بِالْمَلَائِكَةِ، قَالَ أَبُو زُمَيْلٍ: فَحَدَّثَنِي ابْنُ عَبَّاسٍ، قَالَ: بَيْنَمَا رَجُلٌ مِنَ الْمُسْلِمِينَ يَوْمَئِذٍ يَشْتَدُّ فِي أَثَرِ رَجُلٍ مِنَ الْمُشْرِكِينَ أَمَامَهُ، إِذْ سَمِعَ ضَرْبَةً بِالسَّوْطِ فَوْقَهُ وَصَوْتَ الْفَارِسِ يَقُولُ: أَقْدِمْ حَيْزُومُ، فَنَظَرَ إِلَى الْمُشْرِكِ أَمَامَهُ فَخَرَّ مُسْتَلْقِيًا، فَنَظَرَ إِلَيْهِ فَإِذَا هُوَ قَدْ خُطِمَ أَنْفُهُ، وَشُقَّ وَجْهُهُ، كَضَرْبَةِ السَّوْطِ [ص:1385] فَاخْضَرَّ ذَلِكَ أَجْمَعُ، فَجَاءَ الْأَنْصَارِيُّ، فَحَدَّثَ بِذَلِكَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «صَدَقْتَ، ذَلِكَ مِنْ مَدَدِ السَّمَاءِ الثَّالِثَةِ»، فَقَتَلُوا يَوْمَئِذٍ سَبْعِينَ، وَأَسَرُوا سَبْعِينَ، قَالَ أَبُو زُمَيْلٍ، قَالَ ابْنُ عَبَّاسٍ: فَلَمَّا أَسَرُوا الْأُسَارَى، قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِأَبِي بَكْرٍ، وَعُمَرَ: «مَا تَرَوْنَ فِي هَؤُلَاءِ الْأُسَارَى؟» فَقَالَ أَبُو بَكْرٍ: يَا نَبِيَّ اللهِ، هُمْ بَنُو الْعَمِّ وَالْعَشِيرَةِ، أَرَى أَنْ تَأْخُذَ مِنْهُمْ فِدْيَةً فَتَكُونُ لَنَا قُوَّةً عَلَى الْكُفَّارِ، فَعَسَى اللهُ أَنْ يَهْدِيَهُمْ لِلْإِسْلَامِ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَا تَرَى يَا ابْنَ الْخَطَّابِ؟» قُلْتُ: لَا وَاللهِ يَا رَسُولَ اللهِ، مَا أَرَى الَّذِي رَأَى أَبُو بَكْرٍ، وَلَكِنِّي أَرَى أَنْ تُمَكِّنَّا فَنَضْرِبَ أَعْنَاقَهُمْ، فَتُمَكِّنَ عَلِيًّا مِنْ عَقِيلٍ فَيَضْرِبَ عُنُقَهُ، وَتُمَكِّنِّي مِنْ فُلَانٍ نَسِيبًا لِعُمَرَ، فَأَضْرِبَ عُنُقَهُ، فَإِنَّ هَؤُلَاءِ أَئِمَّةُ الْكُفْرِ وَصَنَادِيدُهَا، فَهَوِيَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مَا قَالَ أَبُو بَكْرٍ، وَلَمْ يَهْوَ مَا قُلْتُ، فَلَمَّا كَانَ مِنَ الْغَدِ جِئْتُ، فَإِذَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَأَبُو بَكْرٍ قَاعِدَيْنِ يَبْكِيَانِ، قُلْتُ: يَا رَسُولَ اللهِ، أَخْبِرْنِي مِنْ أَيِّ شَيْءٍ تَبْكِي أَنْتَ وَصَاحِبُكَ؟ فَإِنْ وَجَدْتُ بُكَاءً بَكَيْتُ، وَإِنْ لَمْ أَجِدْ بُكَاءً تَبَاكَيْتُ لِبُكَائِكُمَا، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: أَبْكِي لِلَّذِي عَرَضَ عَلَيَّ أَصْحَابُكَ مِنْ أَخْذِهِمِ الْفِدَاءَ، لَقَدْ عُرِضَ عَلَيَّ عَذَابُهُمْ أَدْنَى مِنْ هَذِهِ الشَّجَرَةِ - شَجَرَةٍ قَرِيبَةٍ مِنْ نَبِيِّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - وَأَنْزَلَ اللهُ عَزَّ وَجَلَّ: {مَا كَانَ لِنَبِيٍّ أَنْ يَكُونَ لَهُ أَسْرَى حَتَّى يُثْخِنَ فِي الْأَرْضِ} [الأنفال: 67] إِلَى قَوْلِهِ {فَكُلُوا مِمَّا غَنِمْتُمْ حَلَالًا طَيِّبًا} [الأنفال: 69] فَأَحَلَّ اللهُ الْغَنِيمَةَ لَهُمْ.",
                "headingArabic": "الإِمْدَادِ بِالْمَلاَئِكَةِ فِي غَزْوَةِ بَدْرٍ وَإِبَاحَةِ الْغَنَائِمِ ‏‏",
                "headingUrdu": "غزوہ بدر میں فرشتوں کی مدد اور غنیمت کی اجازت",
                "headingEnglish": "The support of the angels during the Battle of Badr, and the permissibility of the spoils",
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12153,
                "hadithNumber": "4589",
                "englishNarrator": "It has been narrated on the authority of Abu Huraira رضی اللہ عنہ who said:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sent some horsemen to Najd. They captured a man. He was from the tribe of Banu Hanifa and was called Thumama bin Uthal. He was the chief of the people of Yamama. People bound him with one of the pillars of the mosque. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came out to (see) him. He said: O Thumama, what do you think? He replied: Muhammad, I have good opinion of you. If you kill me, you will kill a person who has spilt blood. If you do me a favour, you will do a favour to a grateful person. If you want wealth, ask and you will get what you will demand. The Messenger of Allah (may peace be pon him) lefthim (in this condition) for two days, (and came to him again) and said: What do you think, O Thumama? He replied: What I have already told you. If you do a favour, you will do a favour to a grateful person. If you kill me, you will kill a person who has spilt blood. If you want wealth, ask and you will get what you will demand. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) left him until the next day when he (came to him again) and said: What do you think, O Thumama? He replied: What I have already told you. If you do me a favour, you will do a favour to a grateful person. If you kill me, you will kill a person who has spilt blood. If you want wealth ask and you will get what you will demand. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Set Thumama free. He went to a palm-grove near the mosque and took a bath. Then he entered the mosque and said: I bear testimony (to the truth) that there is no god but Allah and I testify that Muhammad is His bondman and His messenger. O Muhammad, by Allah, there was no face on the earth more hateful to me than your face, but (now) your face has become to me the dearest of all faces. By Allah, there was no religion more hateful to me than your religion, but (now) your religion has become the dearest of all religions to me. By Allah, there was no city more hateful to me than your city, but (now) your city has become the dearest of all cities to me. Your horsemen captured me when I intended going for Umra. Now what is your opinion (in the matter)? The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) announced good tidings to him and told him to go on 'Umra. When he reached Mecca, somebody said to him: Have you changed your religion? He said: No! I have rather embraced Islam with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). By Allah, you will not get a single grain of wheat from Yamama until it is permitted by the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے نجد کی جانب گھڑ سواروں کا ایک دستہ بھیجا تو وہ بنوحنفیہ کے ایک آدمی کو پکڑ لائے ، جسے ثمامہ بن اثال کہا جاتا تھا ، وہ اہل یمامہ کا سردار تھا ، انہوں نے اسے مسجد کے ستونوں میں سے ایک ستون کے ساتھ باندھ دیا ، رسول اللہ صلی اللہ علیہ وسلم ( گھر سے ) نکل کر اس کے پاس آئے اور پوچھا : \" ثمامہ! تمہارے پاس کیا ( خبر ) ہے؟ \" اس نے جواب دیا : اے محمد! میرے پاس اچھی بات ہے ، اگر آپ قتل کریں گے تو ایک ایسے شخص کو قتل کریں گے جس کے خون کا حق مانگا جاتا ہے اور اگر احسان کریں گے تو اس پر احسان کریں گے جو شکر کرنے والا ہے ۔ اور اگر مال چاہتے ہیں تو طلب کیجئے ، آپ جو چاہتے ہیں ، آپ کو دیا جائے گا ۔ رسول اللہ صلی اللہ علیہ وسلم نے اسے ( اس کے حال پر ) چھوڑ دیا حتی کہ جب اگلے سے بعد کا دن ( آئندہ پرسوں ) ہوا تو آپ صلی اللہ علیہ وسلم نے پوچھا : \" ثمامہ! تمہارے پاس ( کہنے کو ) کیا ہے؟ \" اس نے جواب دیا : ( وہی ) جو میں نے آپ سے کہا تھا ، اگر احسان کریں گے تو ایک شکر کرنے والے پر احسان کریں گے اور اگر قتل کریں گے تو ایک خون والے کو قتل کریں گے اور اگر مال چاہتے ہیں تو طلب کیجئے ، آپ جو چاہتے ہیں آپ کو وہی دیا جائے گا ۔ رسول اللہ صلی اللہ علیہ وسلم نے اسے ( اسی حال میں ) چھوڑ دیا حتی کہ جب اگلا دن ہوا تو آپ صلی اللہ علیہ وسلم نے پوچھا : \" ثمامہ! تمہارے پاس کیا ہے؟ \" اس نے جواب دیا : میرے پاس وہی ہے جو میں نے آپ سے کہا تھا : اگر احسان کریں گے تو ایک احسان شناس پر احسان کریں گے اور اگر قتل کریں گے تو ایک ایسے شخص کو قتل کریں گے جس کا خون ضائع نہیں جاتا ، اور اگر مال چاہتے ہیں تو طلب کیجیے ، آپ جو چاہتے ہیں وہی آپ کو دیا جائے گا ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ثمامہ کو آزاد کر دو ۔ \" وہ مسجد کے قریب کھجوروں کے ایک باغ کی طرف گیا ، غسل کیا ، پھر مسجد میں داخل ہوا اور کہا : میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی عبادت کے لائق نہیں اور میں گواہی دیتا ہوں کہ محمد صلی اللہ علیہ وسلم اس کے بندے اور رسول ہیں ۔ اے محمد! اللہ کی قسم! روئے زمین پر آپ کے چہرے سے بڑھ کر کوئی چہرہ نہیں تھا جس سے مجھے بغض ہو اور اب آپ کے چہرے سے بڑھ کر کوئی چہرہ نہیں جو مجھے زیادہ محبوب ہو ۔ اللہ کی قسم! آپ کے دین سے بڑھ کر کوئی دین مجھے زیادہ ناپسندیدہ نہیں تھا ، اب آپ کا دین سب سے بڑھ کر محبوب دین ہو گیا ہے ۔ اللہ کی قسم! مجھے آپ کے شہر سے بڑھ کر کوئی شہر برا نہیں لگتا تھا ، اب مجھے آپ کے شہر سے بڑھ کو کوئی اور شہر محبوب نہیں ۔ آپ کے گھڑسواروں نے مجھے ( اس وقت ) پکڑا تھا جب میں عمرہ کرنا چاہتا تھا ۔ اب آپ کیا ( صحیح ) سمجھتے ہیں؟ تو رسول اللہ صلی اللہ علیہ وسلم نے انہیں ( ایمان کی قبولیت کی ) خوشخبری دی اور حکم دیا کہ عمرہ ادا کرے ۔ جب وہ مکہ آئے تو کسی کہنے والے نے ان سے کہا : کیا بے دین ہو گئے ہو؟ تو انہوں نے جواب دیا : نہیں ، بلکہ اللہ کے رسول صلی اللہ علیہ وسلم کے ساتھ اسلام میں داخل ہو گیا ہوں ، اور اللہ کی قسم! یمامہ سے گندم کا ایک دانہ بھی تمہارے پاس نہیں پہنچے گا یہاں تک کہ رسول اللہ صلی اللہ علیہ وسلم اس کی اجازت دے دیں.",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, لیث نے ہمیں سعید بن ابی سعید سے حدیث بیان کی کہ انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ: بَعَثَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ خَيْلًا قِبَلَ نَجْدٍ، فَجَاءَتْ بِرَجُلٍ مِنْ بَنِي حَنِيفَةَ يُقَالُ لَهُ: ثُمَامَةُ بْنُ أُثَالٍ، سَيِّدُ أَهْلِ الْيَمَامَةِ، فَرَبَطُوهُ بِسَارِيَةٍ مِنْ سَوَارِي الْمَسْجِدِ، فَخَرَجَ إِلَيْهِ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «مَاذَا عِنْدَكَ يَا ثُمَامَةُ؟» فَقَالَ: عِنْدِي يَا مُحَمَّدُ خَيْرٌ، إِنْ تَقْتُلْ تَقْتُلْ ذَا دَمٍ، وَإِنْ تُنْعِمْ تُنْعِمْ عَلَى شَاكِرٍ، وَإِنْ كُنْتَ تُرِيدُ الْمَالَ فَسَلْ تُعْطَ مِنْهُ مَا شِئْتَ، فَتَرَكَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حَتَّى كَانَ بَعْدَ الْغَدِ، فَقَالَ: «مَا عِنْدَكَ يَا ثُمَامَةُ؟» قَالَ: مَا قُلْتُ لَكَ، إِنْ تُنْعِمْ تُنْعِمْ عَلَى شَاكِرٍ، وَإِنْ تَقْتُلْ تَقْتُلْ ذَا دَمٍ، وَإِنْ كُنْتَ تُرِيدُ الْمَالَ فَسَلْ تُعْطَ مِنْهُ مَا شِئْتَ، فَتَرَكَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حَتَّى كَانَ مِنَ الْغَدِ، فَقَالَ: «مَاذَا عِنْدَكَ يَا ثُمَامَةُ؟» فَقَالَ: عِنْدِي مَا قُلْتُ لَكَ، إِنْ تُنْعِمْ تُنْعِمْ عَلَى شَاكِرٍ، وَإِنْ تَقْتُلْ تَقْتُلْ ذَا دَمٍ، وَإِنْ كُنْتَ تُرِيدُ الْمَالَ فَسَلْ تُعْطَ مِنْهُ مَا شِئْتَ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَطْلِقُوا ثُمَامَةَ»، فَانْطَلَقَ إِلَى نَخْلٍ قَرِيبٍ مِنَ الْمَسْجِدِ، فَاغْتَسَلَ، ثُمَّ دَخَلَ الْمَسْجِدَ، فَقَالَ: أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللهُ، وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ، يَا مُحَمَّدُ، وَاللهِ، مَا كَانَ عَلَى الْأَرْضِ وَجْهٌ أَبْغَضَ إِلَيَّ مِنْ وَجْهِكَ، فَقَدْ أَصْبَحَ وَجْهُكَ أَحَبَّ الْوُجُوهِ كُلِّهَا إِلَيَّ، وَاللهِ، مَا كَانَ مِنْ دِينٍ أَبْغَضَ إِلَيَّ مِنْ دِينِكَ، فَأَصْبَحَ دِينُكَ أَحَبَّ الدِّينِ كُلِّهِ إِلَيَّ، وَاللهِ، مَا كَانَ مِنْ بَلَدٍ أَبْغَضَ إِلَيَّ مِنْ بَلَدِكَ، فَأَصْبَحَ بَلَدُكَ أَحَبَّ الْبِلَادِ كُلِّهَا إِلَيَّ، وَإِنَّ خَيْلَكَ أَخَذَتْنِي وَأَنَا أُرِيدُ الْعُمْرَةَ فَمَاذَا تَرَى؟ فَبَشَّرَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَأَمَرَهُ أَنْ يَعْتَمِرَ، فَلَمَّا قَدِمَ مَكَّةَ قَالَ لَهُ قَائِلٌ: أَصَبَوْتَ، فَقَالَ: لَا، وَلَكِنِّي أَسْلَمْتُ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَلَا وَاللهِ، لَا يَأْتِيكُمْ مِنَ الْيَمَامَةِ حَبَّةُ حِنْطَةٍ حَتَّى يَأْذَنَ فِيهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": "رَبْطِ الأَسِيرِ وَحَبْسِهِ وَجَوَازِ الْمَنِّ عَلَيْهِ",
                "headingUrdu": "قیدیوں کو باندھنا اور حراست میں لینا، اور بغیر فدیہ کے رہا کرنے کی اجازت",
                "headingEnglish": "Tying up and detaining captives, and the permissibility of releasing them without a ransom",
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12154,
                "hadithNumber": "4590",
                "englishNarrator": "Saeed bin Abi Saeed Al-Maqburi narrated that he heard Abu Hurairah رضی اللہ عنہ say:",
                "hadithEnglish": "The Messenger of Allah ﷺ sent his cavalry toward Najd and they brought a man who was called Thumamah bin Uthal Al-Hanafi, the leader of the people of Yamamah... and he quoted a Hadith like that of Al-Laith (as no. 4589), except that he said: If you kill me you will have killed one who shed blood.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے اپنے گھوڑے نجد کی سرزمین کی طرف بھیجے تو وہ ایک آدمی کو لے کر آئے جس کا نام ثمامہ بن اثال الحنفی تھا۔اہل یمامہ کے سردار ثمامہ بن اثال الحنفی نے حدیث لیث کے مشابہ حدیث بیان کی ہے، سوائے اس کے کہ آپ نے فرمایا: اگر تم مجھے قتل کرو گے تو ایک خونی کو قتل کرو گے۔",
                "urduNarrator": "ہم سے محمد بن المثنیٰ نے بیان کیا، ہم سے ابوبکر الحنفی نے بیان کیا، مجھ سے عبدالحمید بن جعفر نے بیان کیا، مجھ سے سعید بن ابی سعید المقبری نے بیان کیا، انہوں نے ابوہریرہ رضی اللہ عنہ کو کہتے سنا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا أَبُو بَكْرٍ الْحَنَفِيُّ، حَدَّثَنِي عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ، حَدَّثَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ الْمَقْبُرِيُّ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ: بَعَثَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ خَيْلًا لَهُ نَحْوَ أَرْضِ نَجْدٍ، فَجَاءَتْ بِرَجُلٍ يُقَالُ لَهُ: ثُمَامَةُ بْنُ أُثَالٍ الْحَنَفِيُّ سَيِّدُ أَهْلِ الْيَمَامَةِ، وَسَاقَ الْحَدِيثَ بِمِثْلِ حَدِيثِ اللَّيْثِ، إِلَّا أَنَّهُ قَالَ: إِنْ تَقْتُلْنِي تَقْتُلْ ذَا دَمٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12155,
                "hadithNumber": "4591",
                "englishNarrator": "It has been narrated on the authority of Abu Huraira رضی اللہ عنہ who said:",
                "hadithEnglish": "We were (sitting) in the mosque when the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came to us and said: (Let us) go to the Jews. We went out with him until we came to them. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) stood up and called out to them (saying): O ye assembly of Jews, accept Islam (and) you will be safe. They said: Abu'l-Qasim, you have communicated (God's Message to us). The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: I want this (i.e. you should admit that God's Message has been communicated to you), accept Islam and you would be safe. They said: Abu'l-Qisim, you have communicated (Allah's Message). The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: I want this... - He said to them (the same words) the third time (and on getting the same reply) he added: You should know that the earth belongs to Allah and His Apostle, and I wish that I should expel you from this land Those of you who have any property with them should sell it, otherwise they should know that the earth belongs to Allah and His Apostle (and they may have to go away leaving everything behind).",
                "hadithUrdu": "ایک بار ہم مسجد میں تھے کہ ( اچانک ) رسول اللہ صلی اللہ علیہ وسلم ہمارے پاس تشریف لائے اور فرمایا : \" یہود کی طرف چلو ۔ \" ہم آپ کے ساتھ  نکلے حتی کہ ان کے ہاں پہنچ گئے ، رسول اللہ صلی اللہ علیہ وسلم کھڑے ہوئے ، بلند آواز سے انہیں پکارا اور فرمایا : \" اے یہود کی جماعت! اسلام قبول کر لو ، سلامتی پاؤ گے ۔ \" انہوں نے کہا : اے ابوالقاسم! آپ نے پیغام پہنچا دیا ہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے ان سے فرمایا : \" میں یہی ( پیغام پہنچانا ) چاہتا ہوں ، اسلام قبول کر لو ، سلامتی پاؤ گے ۔ \" انہوں نے کہا : اے ابوالقاسم! آپ نے پیغام پہنچا دیا ہے ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے ان سے فرمایا : \" میں یہی چاہتا ہوں ۔ \" آپ نے ان سے تیسری مرتبہ کہا اور فرمایا : \" جان لو! یہ زمین اللہ اور اس کے رسول صلی اللہ علیہ وسلم کی ہے اور میں چاہتا ہوں کہ تمہیں اس زمین سے جلا وطن کر دوں ، تم میں سے جسے اپنے مال کے عوض کچھ ملے تو وہ اسے فروخت کر دے ، ورنہ جان لو کہ یہ زمین اللہ کی اور اس کے رسول صلی اللہ علیہ وسلم کی ہے.",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے لیث نے بیان کیا، ان سے سعید بن ابی سعید نے اپنے والد سے, حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ: بَيْنَا نَحْنُ فِي الْمَسْجِدِ إِذْ خَرَجَ إِلَيْنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «انْطَلِقُوا إِلَى يَهُودَ»، فَخَرَجْنَا مَعَهُ حَتَّى جِئْنَاهُمْ، فَقَامَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَنَادَاهُمْ، فَقَالَ: «يَا مَعْشَرَ يَهُودَ، أَسْلِمُوا تَسْلَمُوا»، فَقَالُوا: قَدْ بَلَّغْتَ يَا أَبَا الْقَاسِمِ، فَقَالَ لَهُمْ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «ذَلِكَ أُرِيدُ، أَسْلِمُوا تَسْلَمُوا»، فَقَالُوا: قَدْ بَلَّغْتَ يَا أَبَا الْقَاسِمِ، فَقَالَ لَهُمْ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «ذَلِكَ أُرِيدُ»، فَقَالَ لَهُمُ الثَّالِثَةَ: فَقَالَ: «اعْلَمُوا أَنَّمَا الْأَرْضُ لِلَّهِ وَرَسُولِهِ، وَأَنِّي أُرِيدُ أَنْ أُجْلِيَكُمْ مِنْ هَذِهِ الْأَرْضِ، فَمَنْ وَجَدَ مِنْكُمْ بِمَالِهِ شَيْئًا فَلْيَبِعْهُ، وَإِلَّا فَاعْلَمُوا أَنَّ الْأَرْضَ لِلَّهِ وَرَسُولِهِ.",
                "headingArabic": "إِجْلاَءِ الْيَهُودِ مِنَ الْحِجَازِ ‏‏",
                "headingUrdu": "حجاز سے یہودیوں کا اخراج",
                "headingEnglish": "Expulsion of the Jews from the Hijaz",
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12156,
                "hadithNumber": "4592",
                "englishNarrator": "It has been narrated on the authority of Ibn Umar رضی اللہ عنہ :",
                "hadithEnglish": "The Jews of Banu Nadir and Banu Quraiza fought against the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) who expelled Banu Nadir, and allowed Quraiza to stay on, and granted favour to them until they too fought against him Then he killed their men, and distributed their women, children and properties among the Muslims, except that some of them had joined the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) who granted them security. They embraced Islam. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) turned out all the Jews of Medina. Banu Qainuqa' (the tribe of 'Abdullah bin Salim رضی اللہ عنہ ) and the Jews of Banu Haritha and every other Jew who was in Medina.",
                "hadithUrdu": "بنونضیر اور قریظہ کے یہود نے رسول اللہ صلی اللہ علیہ وسلم سے جنگ کی تو رسول اللہ صلی اللہ علیہ وسلم نے بنونضیر کو جلاوطن کر دیا اور قریظہ کو ٹھہرنے دیا اور ان پر احسان کیا ، یہاں تک کہ اس کے ( ایک ڈیڑھ سال ) بعد قریظہ نے ( غزوہ احزاب میں دشمن کا ساتھ دیا اور ) جنگ کی تو آپ نے ( ان کے چنے ہوئے ثالث حضرت سعد بن معاذ رضی اللہ عنہ کے فیصلے پر ) ان کے ( جنگجو ) مردوں کو قتل کر دیا اور ان کی عورتیں ، بچے اور اموال مسلمانوں میں تقسیم کر دیے ، البتہ ان میں سے کچھ لوگ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ وابستہ ہو گئے تو آپ نے انہیں امان عطا کی اور وہ مسلمان ہو گئے ۔ اور رسول اللہ صلی اللہ علیہ وسلم نے ( خود اپنے فیصلے کی رو سے ) مدینہ کے تمام یہود کو جلا وطن کیا : بنی قینقاع کو ، یہ حضرت عبداللہ بن سلام رضی اللہ عنہ کی قوم تھی ، بنو حارثہ کے یہود کو اور ہر یہودی کو جو مدینہ میں تھا.",
                "urduNarrator": "مجھ سے محمد بن رافع اور اسحاق بن منصور نے بیان کیا کہ ابن رافع نے بیان کیا اور اسحاق نے کہا: ہم سے عبدالرزاق نے بیان کیا, ابن جریج نے موسیٰ بن عقبہ سے ، انہوں نے نافع سے اور انہوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، وَإِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ ابْنُ رَافِعٍ: حَدَّثَنَا، وقَالَ إِسْحَاقُ: أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، «أَنَّ يَهُودَ بَنِي النَّضِيرِ، وَقُرَيْظَةَ، حَارَبُوا رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَأَجْلَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَنِي النَّضِيرِ، وَأَقَرَّ قُرَيْظَةَ وَمَنَّ عَلَيْهِمْ، حَتَّى حَارَبَتْ قُرَيْظَةُ بَعْدَ ذَلِكَ، فَقَتَلَ رِجَالَهُمْ، وَقَسَمَ نِسَاءَهُمْ وَأَوْلَادَهُمْ وَأَمْوَالَهُمْ بَيْنَ الْمُسْلِمِينَ، إِلَّا أَنَّ بَعْضَهُمْ لَحِقُوا بِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَآمَنَهُمْ وَأَسْلَمُوا، وَأَجْلَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَهُودَ الْمَدِينَةِ كُلَّهُمْ، بَنِي قَيْنُقَاعَ، وَهُمْ قَوْمُ عَبْدِ اللهِ بْنِ سَلَامٍ، وَيَهُودَ بَنِي حَارِثَةَ، وَكُلَّ يَهُودِيٍّ كَانَ بِالْمَدِينَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12157,
                "hadithNumber": "4593",
                "englishNarrator": null,
                "hadithEnglish": "This Hadith was narrated from Musa with his chain, but the Hadith of Ibn Juraij (no. 4592) is longer and more complete.",
                "hadithUrdu": "مجھ سے ابو الطاہر نے بیان کیا، کہا ہم سے عبداللہ بن وہب نے بیان کیا، کہا کہ مجھ سےحفص بن میسرہ نے موسیٰ سے یہ حدیث اسی سند کے ساتھ بیان کی اور ابن جریج کی حدیث زیادہ لمبی اور زیادہ مکمل ہے",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِي أَبُو الطَّاهِرِ، حَدَّثَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، أَخْبَرَنِي حَفْصُ بْنُ مَيْسَرَةَ، عَنْ مُوسَى، بِهَذَا الْإِسْنَادِ هَذَا الْحَدِيثَ. وَحَدِيثُ ابْنِ جُرَيْجٍ أَكْثَرُ وَأَتَمُّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12158,
                "hadithNumber": "4594",
                "englishNarrator": "It has been narrated by 'Umar bin al-Khattib رضی اللہ عنہ :",
                "hadithEnglish": "He heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) say: I will expel the Jews and Christians from the Arabian Peninsula and will not leave any but Muslim.",
                "hadithUrdu": "انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا : \" میں یہود و نصاریٰ کو ہر صورت جزیرہ عرب سے نکال دوں گا یہاں تک کہ میں مسلمانوں کے سوا کسی اور کو نہیں رہنے دوں گا.",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، ہم سے ضحاک بن مخلد نے بیان کیا، ابن جریج نے ہمیں خبر دی ، کہا : مجھے ابوزبیر نے خبر دی ، انہوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے : مجھے حضرت عمر بن خطاب رضی اللہ عنہ نے خبر دی کہ",
                "hadithArabic": "وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا الضَّحَّاكُ بْنُ مَخْلَدٍ، عَنِ ابْنِ جُرَيْجٍ، ح وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، وَاللَّفْظُ لَهُ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ، يَقُولُ: أَخْبَرَنِي عُمَرُ بْنُ الْخَطَّابِ، أَنَّهُ سَمِعَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَأُخْرِجَنَّ الْيَهُودَ، وَالنَّصَارَى مِنْ جَزِيرَةِ الْعَرَبِ حَتَّى لَا أَدَعَ إِلَّا مُسْلِمًا.",
                "headingArabic": "إِخْرَاجِ الْيَهُودِ وَالنَّصَارَى مِنْ جَزِيرَةِ الْعَرَبِ",
                "headingUrdu": "جزیرہ نمائے عرب سے یہودیوں اور عیسائیوں کا بے دخل",
                "headingEnglish": "Expulsion of Jews and Christians from the Arabian Peninsula",
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12159,
                "hadithNumber": "4595",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Zubair with the same chain of transmitters.",
                "hadithUrdu": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے روح بن عبادہ نے بیان کیا, سفیان ثوری اور معقل بن عبیداللہ دونوں نے ابوزبیر سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی.",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، أَخْبَرَنَا سُفْيَانُ الثَّوْرِيُّ، ح وحَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ وَهُوَ ابْنُ عُبَيْدِ اللهِ، كِلَاهُمَا عَنْ أَبِي الزُّبَيْرِ، بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12160,
                "hadithNumber": "4596",
                "englishNarrator": "It has been narrated on the authority of Abu Sa'id al-Khudri رضی اللہ عنہ who said:",
                "hadithEnglish": "The people of Quraiza surrendered accepting the decision of Sa'd bin Mu'adh رضی اللہ عنہ about them. Accordingly, the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sent for Sa'd who came to him riding a donkey. When he approached the mosque, the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to the Ansar: Stand up to receive your chieftain. Then he said (to Sa'd): These people have surrendered accepting your decision. He (Sa'd) said: You will kill their fighters and capture their women and children. (Hearing this), the Prophet (ﷺ) said: You have adjudged by the command of God. The narrator is reported to have said: Perhaps he said: You have adjuged by the decision of a king. Ibn Muthanna (in his version of the tradition) has not mentioned the alternative words.",
                "hadithUrdu": "قریظہ کے یہود حضرت سعد بن معاذ رضی اللہ عنہ کے فیصلے ( کو قبول کرنے کی شرط ) پر ( قلعہ سے ) اتر آئے تو رسول اللہ صلی اللہ علیہ وسلم نے حضرت سعد رضی اللہ عنہ کی طرف پیغام بھیجا ، وہ گدھے پر سوار ہو کر آپ صلی اللہ علیہ وسلم کے پاس آئے ، جب وہ مسجد کے قریب پہنچے تو رسول اللہ صلی اللہ علیہ وسلم نے انصار سے فرمایا : \" اپنے سردار ۔ ۔ یا ( فرمایا : ) اپنے بہترین آدمی ۔ ۔ کے ( استقبال کے ) لیے اٹھو ۔ \" پھر فرمایا : \" یہ لوگ تمہارے فیصلے ( کی شرط ) پر ( قلعے سے ) اترے ہیں ۔ \" انہوں نے کہا : ان کے جنگجو افراد کو قتل کر دیا جائے اور ( ان کی عورتوں اور ) ان کے بچوں کو قیدی بنا لیا جائے ۔ کہا : تو نبی صلی اللہ علیہ وسلم نے فرمایا : \" تم نے اللہ کے فیصلے کے مطابق فیصلہ کیا ہے ۔ \" اور بسا اوقات آپ صلی اللہ علیہ وسلم نے فرمایا : \" تم نے ( اصل ) بادشاہ کے فیصلے کے مطابق فیصلہ کیا ہے ۔ \" ابن مثنیٰ نے یہ بیان نہیں کیا : اور بسا اوقات آپ صلی اللہ علیہ وسلم نے فرمایا : \" تم نے بادشاہ کے فیصلے کے مطابق فیصلہ کیا ہے.",
                "urduNarrator": "ابوبکر بن ابی شیبہ ، محمد بن مثنیٰ اور ابن بشار نے ۔ ۔ ان سب کے الفاظ قریب قریب ہیں ۔ ۔ ہمیں حدیث بیان کی ۔ ۔ ابوبکر نے کہا : ہمیں غندر نے شعبہ سے حدیث بیان کی اور دوسرے دونوں نے کہا : ہمیں محمد بن جعفر ( غندر ) نے حدیث بیان کی ، کہا : ہمیں شعبہ نے حدیث بیان کی ۔ ۔ انہوں نے سعد بن ابراہیم سے روایت کی ، انہوں نے کہا : میں نے ابوامامہ بن سہل بن حنیف رضی اللہ عنہ سے سنا ، انہوں نے کہا : میں نے حضرت ابوسعید خدری رضی اللہ عنہ سے سنا ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، وَأَلْفَاظُهُمْ مُتَقَارِبَةٌ، قَالَ أَبُو بَكْرٍ: حَدَّثَنَا غُنْدَرٌ، عَنْ شُعْبَةَ، وقَالَ الْآخَرَانِ: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، قَالَ: سَمِعْتُ أَبَا أُمَامَةَ بْنَ سَهْلِ بْنِ حُنَيْفٍ، قَالَ: سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ، قَالَ: نَزَلَ أَهْلُ قُرَيْظَةَ عَلَى حُكْمِ سَعْدِ بْنِ مُعَاذٍ، فَأَرْسَلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِلَى سَعْدٍ، فَأَتَاهُ عَلَى حِمَارٍ، فَلَمَّا دَنَا قَرِيبًا مِنَ الْمَسْجِدِ، قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِلْأَنْصَارِ: «قُومُوا إِلَى سَيِّدِكُمْ» أَوْ «خَيْرِكُمْ»، ثُمَّ قَالَ: «إِنَّ هَؤُلَاءِ نَزَلُوا عَلَى حُكْمِكَ»، قَالَ: تَقْتُلُ مُقَاتِلَتَهُمْ وَتَسْبِي ذُرِّيَّتَهُمْ، قَالَ: فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «قَضَيْتَ بِحُكْمِ اللهِ»، وَرُبَّمَا قَالَ: «قَضَيْتَ بِحُكْمِ الْمَلِكِ»، وَلَمْ يَذْكُرِ ابْنُ الْمُثَنَّى وَرُبَّمَا قَالَ: «قَضَيْتَ بِحُكْمِ الْمَلِكِ».",
                "headingArabic": "جَوَازِ قِتَالِ مَنْ نَقَضَ الْعَهْدَ وَجَوَازِ إِنْزَالِ أَهْلِ الْحِصْنِ عَلَى حُكْمِ حَاكِمٍ عَدْلٍ أَهْلٍ لِلْحُكْمِ",
                "headingUrdu": "معاہدہ توڑنے والوں سے لڑنے کی اجازت؛ محصور لوگوں کو ہتھیار ڈالنے کی اجازت، کسی عادل شخص کے فیصلے سے مشروط ہے جو فیصلہ سنانے کا اہل ہو",
                "headingEnglish": "Permissibility of fighting those who break a treaty; Permissibility of letting besieged people surrender, subject to the judgement of a just person who is qualified to pass judgement",
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12161,
                "hadithNumber": "4597",
                "englishNarrator": "Through the same chain of transmitters Shu'ba has narrated the same tradition in which he says:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said (to Sa'd): You have adjudged according to the command of God. And once he said: you have adjudged by the decision of a king.",
                "hadithUrdu": "تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم نے ان کے بارے میں اللہ کے حکم کے مطابق فیصلہ کیا ہے ۔ \" اور ایک بار فرمایا : \" تم نے ( حقیقی ) بادشاہ ( اللہ ) کے فیصلے کے مطابق فیصلہ کیا ہے.",
                "urduNarrator": "ہم سے زہیر بن حرب نے بیان کیا, عبدالرحمن بن مہدی نے شعبہ سے اسی سند کے ساتھ حدیث بیان کی اور انہوں نے اپنی حدیث میں کہا",
                "hadithArabic": "وحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ شُعْبَةَ، بِهَذَا الْإِسْنَادِ، وَقَالَ فِي حَدِيثِهِ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَقَدْ حَكَمْتَ فِيهِمْ بِحُكْمِ اللهِ»، وَقَالَ مَرَّةً: «لَقَدْ حَكَمْتَ بِحُكْمِ الْمَلِكِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12162,
                "hadithNumber": "4598",
                "englishNarrator": "It has been narrated on the authority of A'isha رضی اللہ عنہا who said:",
                "hadithEnglish": "Sa'd رضی اللہ عنہ was wounded on the day of the Battle of the Ditch. A man from the Quraish called Ibn al-Ariqah shot at him an arrow which pierced the artery in the middle of his forearm. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) pitched a tent for him in the mosque and would inquire after him being in close proximity. When he returned from the Ditch and laid down his arms and took a bath, the angel Gabriel appeared to him and he was removing dust from his hair (as if he had just returned from the battle). The latter said: You have laid down arms. By God, we haven't (yet) laid them down. So march against them. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) asked: Where? He pointed to Banu Quraiza. So the Messenger of Allah (may peace he upon him) fought against them. They surrendered at the command of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), but he referred the decision about them to Sa'd who said: I decide about them that those of them who can fight be killed, their women and children taken prisoners and their properties distributed (among the Muslims).",
                "hadithUrdu": "خندق کے دن حضرت سعد رضی اللہ عنہ زخمی ہو گئے ، انہیں قریش کے ایک آدمی نے ، جسے ابن عرقہ کہا جاتا تھا ، تیر مارا ۔ اس نے انہیں بازو کی بڑی رگ میں تیر مارا ۔ رسول اللہ صلی اللہ علیہ وسلم نے ان کے لیے مسجد میں خیمہ لگوایا ، آپ قریب سے ان کی تیمارداری کرنا چاہتے تھے ۔ جب رسول اللہ صلی اللہ علیہ وسلم خندق سے واپس ہوئے ، اسلحہ اتارا اور غسل کیا تو ( ایک انسان کی شکل میں ) جبریل علیہ السلام آئے ، وہ اپنے سر سے گردوغبار جھاڑ رہے تھے ، انہوں نے کہا : آپ نے اسلحہ اتار دیا ہے؟ اللہ کی قسم! ہم نے نہیں اتارا ، ان کی طرف نکلیے ، رسول اللہ صلی اللہ علیہ وسلم نے پوچھا : \" کہاں؟ \" انہوں نے بنوقریظہ کی طرف اشارہ کیا ، رسول اللہ صلی اللہ علیہ وسلم نے ان سے جنگ کی ، وہ رسول اللہ صلی اللہ علیہ وسلم کے فیصلے پر اتر آئے تو رسول اللہ صلی اللہ علیہ وسلم نے ان کے بارے میں فیصلہ حضرت سعد رضی اللہ عنہ کے سپرد کر دیا ، انہوں نے کہا : میں ان کے بارے میں فیصلہ کرتا ہوں کہ جنگجو افراد کو قتل کر دیا جائے اور یہ کہ بچوں اور عورتوں کو قیدی بنا لیا جائے اور ان کے اموال تقسیم کر دیے جائیں.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور محمد بن علاء ہمدانی نے بیان کیا، دونوں نے ابن نمیر کی سند سے کہا: ہم سے ابن نمیر نے بیان کیا۔ ہشام نے اپنے والد کے حکم سے کہا, حضرت عائشہ رضی اللہ عنہا سے روایت ہے ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ الْعَلَاءِ الْهَمْدَانِيُّ، كِلَاهُمَا عَنِ ابْنِ نُمَيْرٍ، قَالَ ابْنُ الْعَلَاءِ: حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ: أُصِيبَ سَعْدٌ يَوْمَ الْخَنْدَقِ، رَمَاهُ رَجُلٌ مِنْ قُرَيْشٍ يُقَالُ لَهُ ابْنُ الْعَرِقَةِ رَمَاهُ فِي الْأَكْحَلِ، فَضَرَبَ عَلَيْهِ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ خَيْمَةً فِي الْمَسْجِدِ يَعُودُهُ مِنْ قَرِيبٍ، فَلَمَّا رَجَعَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنَ الْخَنْدَقِ وَضَعَ السِّلَاحَ، فَاغْتَسَلَ، فَأَتَاهُ جِبْرِيلُ وَهُوَ يَنْفُضُ رَأْسَهُ مِنَ الْغُبَارِ، فَقَالَ: وَضَعْتَ السِّلَاحَ؟ وَاللهِ، مَا وَضَعْنَاهُ اخْرُجْ إِلَيْهِمْ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «فَأَيْنَ؟» فَأَشَارَ إِلَى بَنِي قُرَيْظَةَ، فَقَاتَلَهُمْ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَنَزَلُوا عَلَى حُكْمِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَرَدَّ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الْحُكْمَ فِيهِمْ إِلَى سَعْدٍ، قَالَ: فَإِنِّي أَحْكُمُ فِيهِمْ أَنْ تُقْتَلَ الْمُقَاتِلَةُ، وَأَنْ تُسْبَى الذُّرِّيَّةُ وَالنِّسَاءُ، وَتُقْسَمَ أَمْوَالُهُمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12163,
                "hadithNumber": "4599",
                "englishNarrator": "It has been narrated on the authority of Hisham (who learnt it from his father):",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said (to Sa'd): You have adjudged their case with the judgment of God. the Exalted and Glorified.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم نے ان کے بارے میں اللہ عزوجل کے فیصلے کے مطابق فیصلہ کیا ہے.",
                "urduNarrator": "ہم سے ابو کریب نے بیان کیا، کہا ہم سے ابن نمیر نے بیان کیا، کہا کہ ہم سے ہشام نے بیان کیا، انہوں نے کہا: میرے والد نے کہا: تو مجھے خبر ملی کہ",
                "hadithArabic": "وحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا هِشَامٌ، قَالَ: قَالَ أَبِي: فَأَخْبَرْتُ أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «لَقَدْ حَكَمْتَ فِيهِمْ بِحُكْمِ اللهِ عَزَّ وَجَلَّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 11851,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=474",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=472",
                "label": "472",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=473",
                "label": "473",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=474",
                "label": "474",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=475",
                "label": "475",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=476",
                "label": "476",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=477",
                "label": "477",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=478",
                "label": "478",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=476",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=476",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=474",
        "to": 11875,
        "total": 40465
    }
}