{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 352,
        "data": [
            {
                "id": 9064,
                "hadithNumber": "1500",
                "englishNarrator": "Anas bin Malik رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) wits the best among people in character. On occasions, the time of prayer would come while he was in our house. He would then order to spread the mat lying under him. That was dusted and then water was sprinkled over it. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) then led the prayer and we stood behind him, and that mat was made of the leaves of date-palm.",
                "hadithUrdu": "رسول اللہ ﷺ تمام انسانوں میں سب سے زیادہ خوبصورت اخلاق کے مالک تھے ۔ بسا اوقات آپ ہمارے گھر میں ہوتے اور نماز کا وقت ہو جاتا ، پھر آپ اس چٹائی کے بارے میں حکم دیتے جو آپ کے نیچے ہوتی ، اسے جھاڑا جاتا ، پھر اس پر پانی چھڑکا جاتا ، پھر آپ امامت فرماتے اور ہم آپ کے پیچھے کھڑے ہوتے اور آپ ہمیں نماز پڑھاتے ۔ کہا : ان کی چٹائی کجھور کے پتوں کی ہوتی تھی ۔",
                "urduNarrator": "ہم سے شیبان بن فروخ اور ابو الربیع نے بیان کیا، ان دونوں نے عبد الوارث کی سند سے کہا: ہم سے عبد الوارث نے بیان کیا,ابو التیاح نےحضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، وَأَبُو الرَّبِيعِ، كِلَاهُمَا عَنْ عَبْدِ الْوَارِثِ، قَالَ شَيْبَانُ: حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ أَبِي التَّيَّاحِ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ: «كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَحْسَنَ النَّاسِ خُلُقًا، فَرُبَّمَا تَحْضُرُ الصَّلَاةُ وَهُوَ فِي بَيْتِنَا، فَيَأْمُرُ بِالْبِسَاطِ الَّذِي تَحْتَهُ فَيُكْنَسُ، ثُمَّ يُنْضَحُ، ثُمَّ يَؤُمُّ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَنَقُومُ خَلْفَهُ فَيُصَلِّي بِنَا، وَكَانَ بِسَاطُهُمْ مِنْ جَرِيدِ النَّخْلِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9065,
                "hadithNumber": "1501",
                "englishNarrator": "Thabit reported on the authority of Anas ‌رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came to us and there was none in our house but I, my mother and my aunt Umm Haram. He (the Holy Prophet) said: Stand up so that I may lead you in prayer (and there was no time for prescribed prayer). He led us in prayer. A person said to Thabit: Where stood Anas ‌رضی ‌اللہ ‌عنہ ‌with him (the Holy Prophet)? He replied: He was on the right side. He then blessed us, the members of the household with every good of this world and of the Hereafter. My mother said: Messenger of Allah (and then, pointing towards Anas ‌رضی ‌اللہ ‌عنہ ‌, said), here is your little servant, invoke the blessing of Allah upon him too. He then blessed me with every good, and he concluded his blessings for me (with these words): Allah! increase his wealth, and his children and make (them the source of) blessing for him.",
                "hadithUrdu": "نبی ﷺ ہمارے ہاں تشریف لائے وہاں میرے ، میری والدہ اور میری خالہ ام حرام کے سوا کوئی نہ تھا ، آپ نے فرمایا : ‘ ‘ کھڑے ہو جاؤ میں تمھیں نماز پڑھا دوں ۔ ٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗ’ ( فرض ) نماز کے وقت کے بغیر ، آپ نے ہمیں نماز پڑھائی ۔ ایک آدمی نے ثابت سے پوچھا : آپ ﷺنے انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو اپنی کس جانب کھڑا کیا تھا؟ انھوں نے کہا : آپ ﷺ نے انہیں اپنے دائیں ہاتھ کھڑا کیا تھا ۔ پھر آپ نے ہمارے ، سب گھر والوں کے لئے دنیا اور آخرت کی تمام بھلائیوں کی دعا فرمائی ، اس کے بعد میری ماں کہنے لگی : اللہ کے رسول! ( یہ ) آپ کا چھوٹا سا خدمت گزار ہے ، اللہ سے اس کے لئے ( خصوصی ) دعا کریں ۔ کہا : آپ نے میرے لئےہر بھلائی کی دعا کی اور میرے لئے آپ نے جو دعا کی اس کے آخر میں یہ تھا ، آپ نے فرمایا : ‘ ‘ اے اللہ!اس کا مال اور اس کی اولاد زیادہ کر اور اس کے لئے ان میں برکت ڈال دے ۔ ’’",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے ہاشم بن القاسم نے بیان کیا، کہا ہم سے سلیمان نے ثابت کی سند سے بیان کیا,حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سےروایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، حَدَّثَنَا سُلَيْمَانُ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ: دَخَلَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَيْنَا وَمَا هُوَ إِلَّا أَنَا، وَأُمِّي، وَأُمُّ حَرَامٍ خَالَتِي، فَقَالَ: «قُومُوا فَلِأُصَلِّيَ بِكُمْ فِي غَيْرِ وَقْتِ صَلَاةٍ»، فَصَلَّى بِنَا، فَقَالَ رَجُلٌ لِثَابِتٍ: أَيْنَ جَعَلَ أَنَسًا مِنْهُ؟ قَالَ: «جَعَلَهُ عَلَى يَمِينِهِ، ثُمَّ دَعَا لَنَا أَهْلَ الْبَيْتِ بِكُلِّ خَيْرٍ مِنْ خَيْرِ الدُّنْيَا وَالْآخِرَةِ»، فَقَالَتْ أُمِّي: يَا رَسُولَ اللهِ خُوَيْدِمُكَ ادْعُ اللهَ لَهُ، قَالَ: «فَدَعَا لِي بِكُلِّ خَيْرٍ، وَكَانَ فِي آخِرِ مَا دَعَا لِي بِهِ» أَنْ قَالَ: «اللهُمَّ أَكْثِرْ مَالَهُ وَوَلَدَهُ، وَبَارِكْ لَهُ فِيهِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9066,
                "hadithNumber": "1502",
                "englishNarrator": "Abdullah bin al-Mukhtar heard Musa bin Anas narrating on the authority of Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) led him, his mother or his aunt in prayer. He made me, stand on his right side and made the woman stand, behind us.",
                "hadithUrdu": "رسول اللہ ﷺنے انھیں اور ان کی والدہ یا ان کی خالہ کو نماز پڑھائی ، کہا : آپ نے مجھے اپنی دائیں جانب اور عورت کو ہمارے پیچھے کھڑا کیا ۔",
                "urduNarrator": "ہم سے عبید اللہ بن معاذ نے بیان کیا: ہمیں شعبہ نے عبداللہ بن مختار سے حدیث سنائی ، انھوں نے موسیٰ بن انس سے سنا ، وہ حضرت انس بن مالک رضی اللہ عنہ سے حدیث بیان کر رہے تھے کہ",
                "hadithArabic": "وَحَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ اللهِ بْنِ الْمُخْتَارِ، سَمِعَ مُوسَى بْنَ أَنَسٍ، يُحَدِّثُ عَنْ أَنَسِ بْنِ مَالِكٍ: «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ صَلَّى بِهِ وَبِأُمِّهِ، أَوْ خَالَتِهِ»، قَالَ: «فَأَقَامَنِي عَنْ يَمِينِهِ، وَأَقَامَ الْمَرْأَةَ خَلْفَنَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9067,
                "hadithNumber": "1503",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has also been narrated by Shu'ba with this chain of transmitters.",
                "hadithUrdu": "ہم سے محمد بن المثنی نے بیان کیا ,محمد بن جعفر اور عبدالرحمان بن مہدی نے شعبہ سے اسی سند کے ساتھ یہی حریث بیان کی.",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ح وَحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، قَالَ: حَدَّثَنَا عَبْدُ الرَّحْمَنِ يَعْنِي ابْنَ مَهْدِيٍّ، قَالَ: حَدَّثَنَا شُعْبَةُ بِهَذَا الْإِسْنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9068,
                "hadithNumber": "1504",
                "englishNarrator": "Maimuna رضی اللہ عنہا , the wife of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said prayer while I was by his side, and at times when he prostrated his cloth touched me, and he prayed on a small mat.",
                "hadithUrdu": "رسول اللہ ﷺ نماز پڑھتے اور میں آپ کے سامنے ہوتی اور اکثر ایسا ہوتا کہ جب آپ سجدہ کرتے تو آپ کا کپڑا مجھے لگتا اور آپ ( کھجور کے پتوں اور دھاگوں سے بنی ہوئی ) ایک جائے نماز پر نماز پڑھتے تھے ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ التمیمی نے بیان کیا، انہیں خالد بن عبداللہ نے، کہا ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، انہوں نے کہا: ہم سے عباد بن العوام نے بیان کیا، دونوں نے شیبانی کی سند سے, عبداللہ بن شداد سے روایت ہے ، کہا : مجھے نبیﷺ کی زوجہ حضرت میمونہ رضی اللہ عنہا نے حدیث بیان کی  فرمایا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللهِ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، قَالَ: حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ، كِلَاهُمَا عَنِ الشَّيْبَانِيِّ، عَنْ عَبْدِ اللهِ بْنِ شَدَّادٍ، قَالَ: حَدَّثَتْنِي مَيْمُونَةُ، زَوْجُ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَتْ: «كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي وَأَنَا حِذَاءَهُ، وَرُبَّمَا أَصَابَنِي ثَوْبُهُ إِذَا سَجَدَ، وَكَانَ يُصَلِّي عَلَى خُمْرَةٍ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9069,
                "hadithNumber": "1505",
                "englishNarrator": "Abu Sa'id al-Khudri رضی اللہ عنہ reported:",
                "hadithEnglish": "He went to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and found him observing prayer on a mat and prostrating on that.",
                "hadithUrdu": "وہ رسول اللہ ﷺ کے ہاں حاضر ہوئے تو دیکھا کہ آپ ایک چٹائی پر نماز پڑھ رہے ہیں ، اسی پر سجدہ کر رہے ہیں ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، کہا: ہم سے ابو معاویہ نے بیان کیا، اور مجھ سے سوید بن سعید نے بیان کیا، کہا: ہم سے علی بن مشر نے بیان کیا، یہ سب العمش، ح. ہم سے اسحاق بن ابراہیم نے بیان کیا، اور ان کا تلفظ عیسیٰ بن یونس نے بیان کیا، ہم سے الاعمش نے بیان کیا، وہ ابو سفیان سے,حضرت جابر رضی اللہ عنہ سے روایت ہے ، کہا : ہمیں حضرت ابو سعید خدری رضی اللہ عنہ نے حدیث سنائی کہ",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، قَالَا: حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح وَحَدَّثَنِي سُوَيْدُ بْنُ سَعِيدٍ، قَالَ: حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، جَمِيعًا عَنِ الْأَعْمَشِ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَاللَّفْظُ لَهُ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا الْأَعْمَشُ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، قَالَ: حَدَّثَنَا أَبُو سَعِيدٍ الْخُدْرِيُّ، «أَنَّهُ دَخَلَ عَلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَوَجَدَهُ يُصَلِّي عَلَى حَصِيرٍ يَسْجُدُ عَلَيْهِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9070,
                "hadithNumber": "1506",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: A man's prayer in congregation is more valuable than twenty degrees and some above them as compared with his prayer in his house and his market, for when he performs ablution doing it well, then goes out to the mosque, and he is impelled (to do so) only by (the love of congregational) prayer, he has no other objective before him but prayer. He does not take a step without being raised a degree for it and having a sin remitted for it, till he enters the mosque, and when he is busy in prayer after having entered the mosque. the angels continue to invoke blessing on him as long as he is in his place of worship. saying: O Allah, show him mercy, and pardon him! Accept his repentance (and the angels continue this supplication for him) so long as he does not do any harm in it, or as long as his ablution is not broken.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ‘ ‘ آدمی کی باجماعت ( ادا کی گئی ) نماز اس کی گھر میں یا بازار میں پڑھی ہوئی نماز کی نسبت بیس سے زیادہ درجے بڑھ کر ہے اور وہ یوں کہ جب ان میں سے کوئی وضو کرتا ہے اور اچھی طرح وضو کرتا ہے ، پھر مسجد آتا ہے ، اسے نماز ہی نے اٹھایا ہے اور نماز کے علاوہ کچھ نہیں چاہتا ۔ تو وہ کوئی قدم نہیں اٹھاتا مگر اس کے سبب سے اس کا درجہ بلند کر دیا جاتا ہے اور اس کا ایک گناہ مٹا دیا جاتا ہے ، یہاں تک کہ مسجد میں داخل ہو جاتا ہے ، پھر جب مسجد میں داخل ہو جاتا ہے تو جب تک نماز اسے روکے رکھتی ہے وہ نماز ہی میں ہوتا ہے ( اس کے انتظار کا وقت نماز میں شمار ہوتا ہے ) اور تم میں سے کوئی شخص جب تک اس جگہ رہتا ہے جہاں اس نے نماز پڑھی ہے تو فرشتے اس کے حق میں دعا کرتے رہتے ہیں ۔ وہ کہتے ہیں : ‘ ‘ اے اللہ اس پر رحم فرما !اے اللہ ! اس کی توبہ قبول فرما! جب تک وہ اس جگہ ( پر کسی کو ) تکلیف نہیں پہنچاتا اور جب تک وہ اس جگہ بے وضو نہیں ہوتا ۔ ’’",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا, ابو معاویہ نے اعمش سے حدیث بیان کی ، انھوں نے ابو صالح سے اور انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، جَمِيعًا عَنْ أَبِي مُعَاوِيَةَ، قَالَ أَبُو كُرَيْبٍ: حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: صَلَاةُ الرَّجُلِ فِي جَمَاعَةٍ تَزِيدُ عَلَى صَلَاتِهِ فِي بَيْتِهِ، وَصَلَاتِهِ فِي سُوقِهِ، بِضْعًا وَعِشْرِينَ دَرَجَةً، وَذَلِكَ أَنَّ أَحَدَهُمْ إِذَا تَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ، ثُمَّ أَتَى الْمَسْجِدَ لَا يَنْهَزُهُ إِلَّا الصَّلَاةُ، لَا يُرِيدُ إِلَّا الصَّلَاةَ، فَلَمْ يَخْطُ خَطْوَةً إِلَّا رُفِعَ لَهُ بِهَا دَرَجَةٌ، وَحُطَّ عَنْهُ بِهَا خَطِيئَةٌ، حَتَّى يَدْخُلَ الْمَسْجِدَ، فَإِذَا دَخَلَ الْمَسْجِدَ كَانَ فِي الصَّلَاةِ مَا كَانَتِ الصَّلَاةُ هِيَ تَحْبِسُهُ، وَالْمَلَائِكَةُ يُصَلُّونَ عَلَى أَحَدِكُمْ مَا دَامَ فِي مَجْلِسِهِ الَّذِي صَلَّى فِيهِ، يَقُولُونَ: اللهُمَّ ارْحَمْهُ، اللهُمَّ اغْفِرْ لَهُ، اللهُمَّ تُبْ عَلَيْهِ، مَا لَمْ يُؤْذِ فِيهِ، مَا لَمْ يُحْدِثْ فِيهِ.",
                "headingArabic": "فَضْلِ صَلاَةِالمكتوبة فى جماعة  وفضل انْتِظَارِ الصَّلاَةِ ‏‏وكثرة الخطا إلى المساجدوفضل المشي إليها",
                "headingUrdu": "فرض نماز باجماعت ادا کرنے کی فضیلت، نماز کا انتظار کرنے اور مسجد کی طرف بہت زیادہ قدم اٹھانے کی فضیلت، مسجد کی طرف چلنے کی فضیلت",
                "headingEnglish": "The virtue of offering the obligatory prayers in congregation, the virtue of waiting for prayer and taking many steps towards the masjid, the virtue of walking to the masjid",
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9071,
                "hadithNumber": "1507",
                "englishNarrator": null,
                "hadithEnglish": "A hadith having the same meaning (as mentioned above) has been transmitted by A'mash.",
                "hadithUrdu": "ہم سے سعید بن عمرو اشعثی نے بیان کیا، کہا ہم سے عبثر ‌رضی ‌اللہ ‌عنہ نےبیان کیا، کہا ہم سے محمد بن بکر بن الریان نے بیان کیا، انہوں نے کہا: ہم سے اسماعیل بن زکریا نے بیان کیا، ہم سے ایچ ابن المثنیٰ نے بیان کیا، انہوں نے کہا: ابن ابی عدی نے۔ ہمیں شعبی کی سند سے بتایا ہے کہ یہ سب العمش کی سند پر اسی معنی کے ساتھ اس سلسلہ کی نشریات میں ہیں۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ عَمْرٍو الْأَشْعَثِيُّ، أَخْبَرَنَا عَبْثَرٌ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ بَكَّارِ بْنِ الرَّيَّانِ، قَالَ: حَدَّثَنَا إِسْمَاعِيلُ بْنُ زَكَرِيَّاءَ، ح وَحَدَّثَنَا ابْنُ الْمُثَنَّى، قَالَ: حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ شُعْبَةَ، كُلُّهُمْ عَنِ الْأَعْمَشِ، فِي هَذَا الْإِسْنَادِ بِمِثْلِ مَعْنَاهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9072,
                "hadithNumber": "1508",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The angels invoke blessings on everyone among you so long as he is in a place of worship with these words: O Allah! pardon him, O Allah, have mercy upon him, (and they continue to do so) as long as, he ablution (of the worshipper) is not broken, and one among you is in prayer and so long as he is detained for the prayer.",
                "hadithUrdu": "رسول اللہ ﷺنے فرمایا : ‘ ‘ تم میں سے کوئی شخص جب تک اپنی ( نماز پڑھنے کی ) جگہ پر بیٹھا رہتا ہے ، فرشتے اس کے حق میں دعا کرتے رہتے ہیں ، کہتے ہیں : اے اللہ! اسے بخش دے! اے اللہ اس پر رحم فرما! جب تک وہ بے وضو نہیں ہوتا ، نیز جب تک تم میں سے کسی شخض کو نماز روکے رکھتی ہے ، وہ نماز ہی میں ہوتا ہے ۔ ’’",
                "urduNarrator": "ہم سے ابن ابی عمر نے بیان کیا، کہا ہم سے سفیان نے بیان کیا، ایوب سختیانی سے,ابن سیرین نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَيُّوبَ السَّخْتِيَانِيِّ، عَنِ ابْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: إِنَّ الْمَلَائِكَةَ تُصَلِّي عَلَى أَحَدِكُمْ مَا دَامَ فِي مَجْلِسِهِ، تَقُولُ: اللهُمَّ اغْفِرْ لَهُ، اللهُمَّ ارْحَمْهُ، مَا لَمْ يُحْدِثْ، وَأَحَدُكُمْ فِي صَلَاةٍ مَا كَانَتِ الصَّلَاةُ تَحْبِسُهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9073,
                "hadithNumber": "1509",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The servant is constantly in prayer so long as he is in a place of worship waiting for the prayer (to be observed in congregation), and the angels invoke (blessings upon him in these words): O Allah! pardon him. O Allah! show mercy to him, (and they continue to do so) till he returns (from the mosque having completed the prayer) or his ablution breaks. I said: How is the ablution broken? He said: By breaking of the wind noiselessly or with noise.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ‘ ‘ بندہ مسلسل نماز ہی میں ہوتا ہے جب تک وہ نماز کی جگہ پر نماز کے انتظار میں رہتا ہے اور فرشتے کہتے رہتے ہیں : اے اللہ! اسے معاف فرما!اے اللہ!اس پررحم فرما! یہاں تک کہ وہ چلا جاتا ہے یا بے وضو ہو جاتا ہے ۔ ‘ ‘ ( ابو رافع کہتے ہیں : ) میں نے ابوہریرہ رضی اللہ عنہ سے پوچھا : يحدث كا مطلب کیا ہے؟ انھوں نے کہا : آواز کے بغیر یا آواز کے ساتھ ہوا خارج کر دے ۔",
                "urduNarrator": "ہم سے محمد بن حاتم نے بیان کیا، ہم سے بہز نے بیان کیا، ہم سے حماد بن سلمہ نے ثابت کی سند سے بیان کیا، ابو رافع نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: لَا يَزَالُ الْعَبْدُ فِي صَلَاةٍ مَا كَانَ فِي مُصَلَّاهُ يَنْتَظِرُ الصَّلَاةَ، وَتَقُولُ الْمَلَائِكَةُ: اللهُمَّ اغْفِرْ لَهُ، اللهُمَّ ارْحَمْهُ، حَتَّى يَنْصَرِفَ، أَوْ يُحْدِثَ قُلْتُ: مَا يُحْدِثَ؟ قَالَ: «يَفْسُو أَوْ يَضْرِطُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9074,
                "hadithNumber": "1510",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Everyone among you is constantly in prayer so long as the prayer detains him (for this noble objective) and nothing prevents him to return to his family but the prayer",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ‘ ‘ جب تک تم میں سے کسی کو نماز روکے رکھتی ہے وہ مسلسل نماز میں ہوتا ہے ، اسے گھر کی طرف لوٹنے سے نماز کے علاوہ اور کسی چیز نے نہیں روکا ہوتا ۔ ’’",
                "urduNarrator": "یحییٰ بن یحییٰ نے بیان کیا کو نہیں کہا، انہوں نے کہا: مالک رضی اللہ عنہ نے یہ کہا, ابو زناد نے اعرج سے اور انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «لَا يَزَالُ أَحَدُكُمْ فِي صَلَاةٍ مَا دَامَتِ الصَّلَاةُ تَحْبِسُهُ، لَا يَمْنَعُهُ أَنْ يَنْقَلِبَ إِلَى أَهْلِهِ إِلَّا الصَّلَاةُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9075,
                "hadithNumber": "1511",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Anyone amongst you who sat in a place of worship waiting for the prayer is in prayer and his ablution is not broken, the angels invoke blessing upon him (in these words): O Allah! pardon him. O Allah! have mercy upon him.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ‘ ‘ تم میں سے کوئی شخص جتنی دیر نماز کے انتظار میں بیٹھا ہے نماز ہی میں رہتا ہے جب تک بے وضو نہ ہو جائے ۔ فرشتے اس کے لئے دعا کرتے رہتے : اے اللہ ! اسے معاف فرما! اے اللہ!اس پؓر رحم فرما ۔ ’’",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، کہا ہم سے یونس نے بیان کیا، اور مجھ سے محمد بن سلمہ مرادی نے بیان کیا، کہا ہم سے عبداللہ بن وہب نے یونس کے بارے میں بیان کیا, ابن شہاب نے ( عبدالرحمان ) بن ہرمز ( اعرج ) سے اور انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِيُّ، حَدَّثَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنِ ابْنِ هُرْمُزَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: أَحَدُكُمْ مَا قَعَدَ يَنْتَظِرُ الصَّلَاةَ، فِي صَلَاةٍ، مَا لَمْ يُحْدِثْ، تَدْعُو لَهُ الْمَلَائِكَةُ: اللهُمَّ اغْفِرْ لَهُ، اللهُمَّ ارْحَمْهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9076,
                "hadithNumber": "1512",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been narrated by Hammam bin Munabbih on the authority of Abu Huraira رضی اللہ عنہ .",
                "hadithUrdu": "ہم سے محمد بن رافع نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، کہا ہم سے معمر نے بیان کیا، ہمام بن منبہ نے حضرت ابوہریرہ ‌رضی اللہ عنہ سے اور انھوں نے نبی ﷺ سے اسی کے مطابق روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِ هَذَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9077,
                "hadithNumber": "1513",
                "englishNarrator": "Abu Musa رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The most eminent among human beings (as a recipient of) reward (is one) who lives farthest away, and who has to walk the farthest distance, and he who waits for the prayer to observe it along with the Imam, his reward is greater than one who prays (alone) and then goes to sleep. In the narration of Abu Kuraib (the words are): (He waits) till he prays along with the Imam in congregation.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ‘ ‘ نماز میں سب سے زیادہ ثواب اس کا ہے جو اس کے لیے زیادہ دور سے چل کر آتا ہے ۔ پھر ( اس کے بعد ) جو ان میں سے سب سے زیادہ دور سے چل کر آتا ہے ۔ اور جوآدمی نماز کا انتظار کرتا ہے تاکہ اسے امام کے ساتھ ادا کرے ، اجر میں اس سے بہت بڑھ کر ہے جو نماز پڑھتا ہے ، پھر سو جاتا ہے ۔ ’’ ابو کریب کی روایت میں ہے : ‘ ‘ یہاں تک کہ وہ اسے امام کے ساتھ جماعت میں ادا کرے ۔ ’’",
                "urduNarrator": "عبداللہ بن براداشعری اور ابو کریب دونوں نے کہا : ہم سے ابو اسامہ نے برید سے حدیث بیان کی ، انھوں نے ابوبردہ سے اور انھوں نے حضرت ابو موسیٰ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللهِ بْنُ بَرَّادٍ الْأَشْعَرِيُّ، وَأَبُو كُرَيْبٍ، قَالَا: حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ أَعْظَمَ النَّاسِ أَجْرًا فِي الصَّلَاةِ أَبْعَدُهُمْ إِلَيْهَا مَمْشًى، فَأَبْعَدُهُمْ، وَالَّذِي يَنْتَظِرُ الصَّلَاةَ حَتَّى يُصَلِّيَهَا مَعَ الْإِمَامِ أَعْظَمَ أَجْرًا مِنَ الَّذِي يُصَلِّيَهَا ثُمَّ يَنَامُ» وَفِي رِوَايَةِ أَبِي كُرَيْبٍ: «حَتَّى يُصَلِّيَهَا مَعَ الْإِمَامِ فِي جَمَاعَةٍ».",
                "headingArabic": "فَضْلِ كَثْرَةِ الْخُطَا إِلَى الْمَسَاجِدِ ‏",
                "headingUrdu": "مسجد کی طرف بہت سے قدم اٹھانے کی فضیلت",
                "headingEnglish": "The virtue of taking many steps to the masjid",
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9078,
                "hadithNumber": "1514",
                "englishNarrator": "Ubayy bin Ka'b رضی اللہ عنہ reported:",
                "hadithEnglish": "There was a man, and I do not know of any other man, whose house was farther than his from the mosque and he never missed the prayer (in congregation). It was said to him or I said to him: It you were to buy a donkey you could ride upon it In the dark nights and in the burning sand. He said: I do not like my house to be situated by the side of the mosque, for I (eagerly) desire that my steps towards the mosque and back from it, should be recorded when I return to my family. Upon this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Allah has gathered all (rewards) for you.",
                "hadithUrdu": "ایک آدمی تھا ، میرے علم میں کوئی اور آدمی اس کی نسبت مسجد سے زیادہ فاصلے پر نہیں رہتا تھا اور اس کی کوئی نماز نہیں چوکتی تھی ، اس سے کہا گیا-یا میں نے ( اس سے ) کہا- : اگر آپ گدھا خرید لیں کہ ( رات کی ) تاریکی اور ( دوپہر کی ) گرمی میں آپ اس پر سوار ہو جایا کریں ۔ اس نے جواب دیا : مجھے یہ بات پسند نہیں ہے کہ میرا گھر مسجد کے پڑوس میں ہو ، میں چاہتا ہوں میرا مسجد تک چل کر جانا اور جب میں گھر والوں کی طرف لوٹوں تو میرا لٹنا میرے لئے لکھا جائے ۔ تو رسول اللہ ﷺ نے فرمایا : ‘ ‘ اللہ تعالیٰ نے یہ سب کچھ تمھارے لئے اکٹھا کر دیا ہے ۔ ’’",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا, عبثر نے ہمیں خبر دی ، انھوں نے سلیمان تیمی سے ، انھوں نے ابوعثمان نہدی سے اور انھوں نے حضرت ابی بن کعب رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا عَبْثَرٌ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ، عَنْ أُبَيِّ بْنِ كَعْبٍ، قَالَ: كَانَ رَجُلٌ لَا أَعْلَمُ رَجُلًا أَبْعَدَ مِنَ الْمَسْجِدِ مِنْهُ، وَكَانَ لَا تُخْطِئُهُ صَلَاةٌ، قَالَ: فَقِيلَ لَهُ: أَوْ قُلْتُ لَهُ: لَوْ اشْتَرَيْتَ حِمَارًا تَرْكَبُهُ فِي الظَّلْمَاءِ، وَفِي الرَّمْضَاءِ، قَالَ: مَا يَسُرُّنِي أَنَّ مَنْزِلِي إِلَى جَنْبِ الْمَسْجِدِ، إِنِّي أُرِيدُ أَنْ يُكْتَبَ لِي مَمْشَايَ إِلَى الْمَسْجِدِ، وَرُجُوعِي إِذَا رَجَعْتُ إِلَى أَهْلِي، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «قَدْ جَمَعَ اللهُ لَكَ ذَلِكَ كُلَّهُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9079,
                "hadithNumber": "1515",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been transmitted by Taimi with the same chain of narrators.",
                "hadithUrdu": "ہم سے محمد بن عبد الاعلٰی نے بیان کیا، ہم سے معتمر نے بیان کیا، ان سے ح. نے، اور ہم سے اسحاق بن ابراہیم نے بیان کیا، انہوں نے کہا: ہم سے جریر نے بیان کیا، ان دونوں نے تیمی کی سند سے۔ اس کے بارے میں روایت کا یہ سلسلہ اسی طرح کا ہے۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى، حَدَّثَنَا الْمُعْتَمِرُ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ: أَخْبَرَنَا جَرِيرٌ، كِلَاهُمَا عَنِ التَّيْمِيِّ، بِهَذَا الْإِسْنَادِ بِنَحْوِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9080,
                "hadithNumber": "1516",
                "englishNarrator": "Ubayy bin Ka'b reported:",
                "hadithEnglish": "There was a person among the Ansar whose house was situated at the farthest end of Medina, but he never in missed any prayer along with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). We felt pity for him and said to him: O, so and so, had you bought a donkey it would have saved you from the burning sand and would have saved you from the reptiles of the earth. He said: Listen I by Allah, I do not like my house to be situated by the side of Muhammad ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). I took (these words of his) ill and came to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and informed him about (these words). He (the Holy Prophet) called him and he said exactly like that (which he had mentioned to Ubbay bin Ka'b), but made a mention of this (also) that he wanted a reward for his steps. Upon this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: In fact for you is the reward which you expect.",
                "hadithUrdu": "انصار میں ایک آدمی تھا ، اس کا گھر ، مدینہ میں سب سے دور ( واقع ) تھا اور اس کی کوئی نماز رسول اللہ ﷺ کی اقتدا میں پڑھنے سے چوکتی نہیں تھی ، ہم نے اس کے لئے ہمدردی محسوس کی تو میں نے اسے کہا : جناب ! اگر آپ ایک گدھا خرید لیں جو آپ کو گرمی اور زمین کے ( زہریلے ) کیڑوں سے بچائے ( تو کتنا اچھا ہو! ) اس نے کہا : مکر اللہ کی قسم! جھے یہ نہیں کہ میرا گھر ( خیمے کی طرح ) کنابوں کے ذریعے سے محمد ﷺ کے گھر سے بندھا ہوا ہو ۔ مجھے اس کی یہ بات بہت گراں گزری حتی کہ میں اسی کیقیت میں نبی اکرم ﷺ کی خدمت میں حاضر ہوا اور آپ کو اس بات کی خبر دی ۔ آپ نے اسے بلوایا تو اس نے آپ کو بھی وہی جواب دیا اور آپ کو بتایا کہ وہ آنے جانے پر اجر کی امید رکھتا ہے ۔ تو نبی ‌رضی ‌اللہ ‌عنہ ‌ ‌ ﷺ نے فرمایا : ‘ ‘ تمھیں یقینا وہی اجر ملے گا جسے تم حاصل کرنا چاہتے ہو ۔ ’’",
                "urduNarrator": "ہم سے محمد بن ابی بکر المقدمی نے بیان کیا، کہا ہم سے عباد بن عباد نے بیان کیا، کہا ہم سے عاصم نے بیان کیا، وہ ابو عثمان سے، وہ ابی بن کعب سے، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، حَدَّثَنَا عَبَّادُ بْنُ عَبَّادٍ، حَدَّثَنَا عَاصِمٌ، عَنْ أَبِي عُثْمَانَ، عَنْ أُبَيِّ بْنِ كَعْبٍ، قَالَ: كَانَ رَجُلٌ مِنَ الْأَنْصَارِ بَيْتُهُ أَقْصَى بَيْتٍ فِي الْمَدِينَةِ، فَكَانَ لَا تُخْطِئُهُ الصَّلَاةُ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: فَتَوَجَّعْنَا لَهُ، فَقُلْتُ لَهُ: يَا فُلَانُ لَوْ أَنَّكَ اشْتَرَيْتَ حِمَارًا يَقِيكَ مِنَ الرَّمْضَاءِ، وَيَقِيكَ مِنْ هَوَامِّ الْأَرْضِ، قَالَ: أَمَ وَاللهِ مَا أُحِبُّ أَنَّ بَيْتِي مُطَنَّبٌ بِبَيْتِ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: فَحَمَلْتُ بِهِ حِمْلًا حَتَّى أَتَيْتُ نَبِيَّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَأَخْبَرْتُهُ، قَالَ: فَدَعَاهُ، فَقَالَ لَهُ مِثْلَ ذَلِكَ، وَذَكَرَ لَهُ أَنَّهُ يَرْجُو فِي أَثَرِهِ الْأَجْرَ، فَقَالَ لَهُ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ لَكَ مَا احْتَسَبْتَ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9081,
                "hadithNumber": "1517",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been narrated by 'Asim with the same chain of transmitters.",
                "hadithUrdu": "ہم سے سعید بن عمرو اشعثی اور محمد بن ابی عمر نے بیان کیا، ابن عینیہ اور وکیع نے اپنے والد کے حوالے سے عاصم سے اسی سند کے ساتھ اسی طرح روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا سَعِيدُ بْنُ عَمْرٍو الْأَشْعَثِيُّ، وَمُحَمَّدُ بْنُ أَبِي عُمَرَ، كِلَاهُمَا عَنِ ابْنِ عُيَيْنَةَ، ح وَحَدَّثَنَا سَعِيدُ بْنُ أَزْهَرَ الْوَاسِطِيُّ، قَالَ: حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا أَبِي، كُلُّهُمْ عَنْ عَاصِمٍ، بِهَذَا الْإِسْنَادِ نَحْوَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9082,
                "hadithNumber": "1518",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ عنہ narrated:",
                "hadithEnglish": "Our houses were situated far away from the mosque; we, therefore, decided to sell our houses so that we may be able to come near the mosque. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) forbade us (to do so) and said: There is for every step (towards the mosque) a degree (of reward) for you.",
                "hadithUrdu": "ہمارے گھر مسجد سے دور واقع تھے ، ہم نے چاہا کہ ہم اپنے گھروں کو فروخت کر کے مسجد کے قریب آجائیں تو رسول اللہ ﷺ نے ہمیں روک دیا اور فرمایا : ‘ ‘ تمھارے لئے ہر قدم کے بدلے میں ایک درجہ ہے ۔ ’’",
                "urduNarrator": "ہم سے حجاج بن الشعر نے بیان کیا، ہم سے روح بن عبادہ نے بیان کیا، ہم سے زکریا بن اسحاق نے بیان کیا,ابوزبیر نے ہمیں حدیث سنائی ، کہا : میں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے سنا ، کہا",
                "hadithArabic": "وَحَدَّثَنَا حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا زَكَرِيَّاءُ بْنُ إِسْحَاقَ، حَدَّثَنَا أَبُو الزُّبَيْرِ، قَالَ: سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللهِ، قَالَ: كَانَتْ دِيَارُنَا نَائِيَةً عَنِ الْمَسْجِدِ، فَأَرَدْنَا أَنْ نَبِيعَ بُيُوتَنَا، فَنَقْتَرِبَ مِنَ الْمَسْجِدِ، فَنَهَانَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «إِنَّ لَكُمْ بِكُلِّ خَطْوَةٍ دَرَجَةً».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9083,
                "hadithNumber": "1519",
                "englishNarrator": "Jabir bin Abdullah رضی اللہ عنہا reported:",
                "hadithEnglish": "There were some plots vacant around the mosque. Banu Salama decided to shift (to this land) and come near the mosque. This (news) reached the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and he said to them (Banu Salama): I have received (information) that you intend to shift near the mosque. They said: Yes, Messenger of Allah, we have taken this decision. Upon this he (the Holy Prophet) said: O Banu Salama, live in your houses, for your steps are recorded; live in your houses, for your steps are recorded.",
                "hadithUrdu": "( رسول اللہ ﷺ کی ) مسجد کے ارد گرد کی جگہیں خالی ہوئیں تو ( ان کے قبیلے ) بنو سلمہ کے لوگوں نے ارادہ کیا کہ مسجد کے قریب منتقل ہو جائیں ، رسول اللہ ﷺ کو یہ بات پہنچی تو آپ نے ان سے کہا : ’’مجھے خبر پہنچی ہے کہ تم مسجد کے قریب منتقل ہونا چاہتے ہو ۔ ‘ ‘ انھوں نے عرض کی : جی ہاں ، اے اللہ کے رسول! ہم یہی چاہتے ہیں ۔ تو آپ نے فرمایا : ‘ ‘ بنو سلمہ! اپنے گھروں میں رہو ، تمھارے قدموں کے نشان لکھے جاتے ہیں ، ( پھر فرمایا : ) اپنے گھروں ہی میں رہو ، تمھارے قدموں کے نشان لکھے جاتے ہیں ۔ ’’",
                "urduNarrator": "ہم سے محمد بن مثنیٰ نے بیان کیا، کہا ہم سے عبدالصمد بن عبدالوارث نے بیان کیا، انہوں نے کہا: میں نے اپنے والد کو فرماتے ہوئے سنا، انہوں نے کہا,جریری نے ابونضرہ سے اور انھوں نے حضرت جابر بن عبداللہ رضی اللہ عنہا سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ، قَالَ: سَمِعْتُ أَبِي، يُحَدِّثُ، قَالَ: حَدَّثَنِي الْجُرَيْرِيُّ، عَنْ أَبِي نَضْرَةَ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، قَالَ: خَلَتِ الْبِقَاعُ حَوْلَ الْمَسْجِدِ، فَأَرَادَ بَنُو سَلِمَةَ أَنْ يَنْتَقِلُوا إِلَى قُرْبِ الْمَسْجِدِ، فَبَلَغَ ذَلِكَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ لَهُمْ: «إِنَّهُ بَلَغَنِي أَنَّكُمْ تُرِيدُونَ أَنْ تَنْتَقِلُوا قُرْبَ الْمَسْجِدِ»، قَالُوا: نَعَمْ، يَا رَسُولَ اللهِ قَدْ أَرَدْنَا ذَلِكَ، فَقَالَ: «يَا بَنِي سَلِِمَةَ دِيَارَكُمْ تُكْتَبْ آثَارُكُمْ، دِيَارَكُمْ تُكْتَبْ آثَارُكُمْ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9084,
                "hadithNumber": "1520",
                "englishNarrator": "Jabir bin Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Banu Salama decided to shift near the mosque (as there were) some plots vacant. This (news) reached the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), whereupon he said: O people of the Salama tribe, you better stay in your houses (where you are living), for your footsteps are recorded They said. We could not be more delighted even by shifting (near the mosque) as we were delighted (on hearing these words from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌).",
                "hadithUrdu": "بنو سلمہ نے مسجد کے قریب منتقل ہونے کا ارادہ کیا ، کہا : اور ( مسجد کے قریب ) جگہیں ( بھی ) خالی تھیں ۔ نبی اکرم ﷺ کو یہ خبر پہنچی تو آپ نے فرمایا : ‘ ‘ اے بنو سلمہ!اپنے گھروں میں رہو ، تمھارے قدموں کے نشان لکھے جاتے ہیں ۔ ’’ تو انھوں نے کہا : ( اس کے بعد ) ہمیں یہ بات اچھی ( بھی ) نہ لگتی کہ ہم منتقل ہو چکے ہو تے ۔",
                "urduNarrator": "ہم سے عاصم بن النضْدر التیمی نے بیان کیا، ہم سے معتمر نے بیان کیا، انہوں نے کہا, کہمس نے ابو نضرہ سے اور انھوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا عَاصِمُ بْنُ النَّضْرِ التَّيْمِيُّ، حَدَّثَنَا مُعْتَمِرٌ، قَالَ: سَمِعْتُ كَهْمَسًا، يُحَدِّثُ عَنْ أَبِي نَضْرَةَ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، قَالَ: أَرَادَ بَنُو سَلِمَةَ أَنْ يَتَحَوَّلُوا إِلَى قُرْبِ الْمَسْجِدِ، قَالَ: وَالْبِقَاعُ خَالِيَةٌ، فَبَلَغَ ذَلِكَ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «يَا بَنِي سَلِمَةَ دِيَارَكُمْ تُكْتَبْ آثَارُكُمْ»، فَقَالُوا: مَا كَانَ يَسُرُّنَا أَنَّا كُنَّا تَحَوَّلْنَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9085,
                "hadithNumber": "1521",
                "englishNarrator": "Abu Huraira reported:",
                "hadithEnglish": "The Messenger of Allah (ﷺ) said: He who purified himself in his house, and then he walked to one of the houses of Allah for the sake of performing a Fard (obligatory act) out of the Fara'id (obligatory acts) of Allah, both his steps (would be significant) as one of them would obliterate his sin and the second one would raise his status.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ‘ ‘ جس نے اپنے گھر میں وضو کیا ، پھر اللہ کے گھروں میں سے اس کے کسی گھر کی طرف چل کر گیا تاکہ اللہ کے فرضوں میں سے ایک فریضے کو ادا کرے تو اس کے دونوں قدم ( یہ کرتے ہیں کہ ) ان میں سے ایک گناہ نٹاتا ہے اور دوسرا درجہ بلند کرتا ہے",
                "urduNarrator": "مجھ سے اسحاق بن منصور نے بیان کیا، کہا ہم سے زکریا بن عدی نے بیان کیا، کہا ہم سے عبید اللہ نے، یعنی ابن عمرو نے، کہا ہم سے زید بن ابی انیسہ نے، عدی بن ثیب کی سند سے، وہ ابوحازم اشجعی کی سند سے۔ حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے ، کہا",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا زَكَرِيَّاءُ بْنُ عَدِيٍّ، أَخْبَرَنَا عُبَيْدُ اللهِ يَعْنِي ابْنَ عَمْرٍو، عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، عَنْ أَبِي حَازِمٍ الْأَشْجَعِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ تَطَهَّرَ فِي بَيْتِهِ، ثُمَّ مَشَى إِلَى بَيْتٍ مَنْ بُيُوتِ اللهِ لِيَقْضِيَ فَرِيضَةً مِنْ فَرَائِضِ اللهِ، كَانَتْ خَطْوَتَاهُ إِحْدَاهُمَا تَحُطُّ خَطِيئَةً، وَالْأُخْرَى تَرْفَعُ دَرَجَةً».",
                "headingArabic": "الْمَشْىُ إِلَى الصَّلاَةِ تُمْحَى بِهِ الْخَطَايَا وَتُرْفَعُ بِهِ الدَّرَجَاتُ ‏",
                "headingUrdu": "نماز کے لیے چلنا گناہوں کو مٹاتا ہے اور درجات بلند کرتا ہے۔",
                "headingEnglish": "Walking to prayer erases sins and raises one in status",
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9086,
                "hadithNumber": "1522",
                "englishNarrator": "In the hadith narrated of the authority of Abu Huraira رضی اللہ عنہ the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) is reported to have said. while in the hadith narrated by Bakr (the words are like this):",
                "hadithEnglish": "He heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: just see, can anything of his filthiness remain (on the body of) any one of you if there were a river at his door in which he washed himself five times daily? They, said: Nothing of his filthiness will remain (on his body). He said: That is like the five prayers by which Allah obliterates sins.",
                "hadithUrdu": "انھوں ( ابوہریرہ رضی اللہ عنہ ) نے رسول اللہ ﷺ سے سنا ، آ پ نے فرمایا- ‘ ‘ تم کیا سمجھتے ہو اگر تم میں سے کسی کے گھر کے سامنے نہر ہو جس سے وہ ہر روز پانچ مرتبہ نہاتا ہو ، کیا اس ( کے جسم ) کا کوئی میا کچیل باقی رہ جائے گا؟’’ صحابہ نے عرض کی : اس کا کوئی میل کچیل باقی نہیں رہے گا ۔ آپ نے فرمایا یہی پانچ نمازوں کی مثال ہے ، اللہ تعالیٰ ان کے ذریعے سے گناہوں کو صاف کر دیتا ہے ۔ ’’",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا,لیث اور بکر دونوں نے ہاد سے ، انھوں نے محمد بن ابراہیم سے ، انھوں نے ابوہریرہ رضی اللہ عنہ سے روایت کی کہ رسول اللہ ﷺ نے فرمایا-اور بکر کی روایت میں ہے کہ",
                "hadithArabic": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَقَالَ قُتَيْبَةُ: حَدَّثَنَا بَكْرٌ يَعْنِي ابْنَ مُضَرَ، كِلَاهُمَا عَنِ ابْنِ الْهَادِ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: وَفِي حَدِيثِ بَكْرٍ، أَنَّهُ سَمِعَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: «أَرَأَيْتُمْ لَوْ أَنَّ نَهْرًا بِبَابِ أَحَدِكُمْ يَغْتَسِلُ مِنْهُ كُلَّ يَوْمٍ خَمْسَ مَرَّاتٍ، هَلْ يَبْقَى مِنْ دَرَنِهِ شَيْءٌ؟» قَالُوا: لَا يَبْقَى مِنْ دَرَنِهِ شَيْءٌ، قَالَ: «فَذَلِكَ مَثَلُ الصَّلَوَاتِ الْخَمْسِ، يَمْحُو اللهُ بِهِنَّ الْخَطَايَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9087,
                "hadithNumber": "1523",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: The similitude of five prayers is like an overflowing river passing by the gate of one of you in which he washes five times daily Hasan said: No filthiness can remain on him.",
                "hadithUrdu": "رسول اللہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ ﷺ نے فرمایا : ‘ ‘ پانچ نمازوں کی مثال تم میں سے کسی ایک کے دروازے پر چلتی ہویئ بہت بڑی نہر کی سی ہے ، وہ اس میں سے روزانہ پانچ دفعہ غسل کرتا ہو ۔ ’’ ( اعمش نے ابوسفیان کی بجائے حسن کے حوالے سے روایت کرتے ہوئے ) کہا : حسن نے کہا : یہ غسل اس کے جسم پر کوئی میل کچیل نہیں چھوڑے گا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، کہا کہ ہم سے ابو معاویہ نے بیان کیا، اعمش نے ابو سفیان ( طلحہ بن نافع ) سے ، انھوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، قَالَا: حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ وَهُوَ ابْنُ عَبْدِ اللهِ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَثَلُ الصَّلَوَاتِ الْخَمْسِ كَمَثَلِ نَهْرٍ جَارٍ، غَمْرٍ عَلَى بَابِ أَحَدِكُمْ، يَغْتَسِلُ مِنْهُ كُلَّ يَوْمٍ خَمْسَ مَرَّاتٍ». قَالَ: قَالَ الْحَسَنُ: «وَمَا يُبْقِي ذَلِكَ مِنَ الدَّرَنِ؟».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9088,
                "hadithNumber": "1524",
                "englishNarrator": "Ata' bin Yasar reported, on the authority of Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who went towards the mosque in the morning or evening, Allah would arrange a feast for him morning or evening in Paradise.",
                "hadithUrdu": "‘ ‘ جو شخص دن کے پہلے حصے میں یا دن کے دوسرے حصے میں مسجد کی طرف گیا اللہ تعالیٰ ( ہر دفعہ آنے پر ) اس کے لئے جنت میں میزبانی کا انتظام فرماتا ہے ، جب بھی وہ ( آئے ) صبح کو آئے یا شام کو آئے ۔ ’’",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور زہیر بن حرب نے بیان کیا، کہا کہ ہم سے یزید بن ہارون نے بیان کیا، کہا ہم سے محمد بن مطرف نے بیان کیا، انہوں نے زید بن اسلم کی سند سے عطاء بن یسار سے, حضرت ابوہریرہ رضی اللہ عنہ نے نبی ﷺ سے روایت کی",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالَا: حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا مُحَمَّدُ بْنُ مُطَرِّفٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، «مَنْ غَدَا إِلَى الْمَسْجِدِ، أَوْ رَاحَ، أَعَدَّ اللهُ لَهُ فِي الْجَنَّةِ نُزُلًا، كُلَّمَا غَدَا، أَوْ رَاحَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 8776,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=351",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=349",
                "label": "349",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=350",
                "label": "350",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=351",
                "label": "351",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=352",
                "label": "352",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=353",
                "label": "353",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=354",
                "label": "354",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=355",
                "label": "355",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=353",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=353",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=351",
        "to": 8800,
        "total": 40465
    }
}