{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 412,
        "data": [
            {
                "id": 10564,
                "hadithNumber": "3000",
                "englishNarrator": null,
                "hadithEnglish": "A hadith similar to of Ibn Uyaynah (no. 2999) was narrated from Amr bin Dinar, from Ibn Umar رضی اللہ تعالیٰ عنہ from the prophet ﷺ.",
                "hadithUrdu": "ہم سے یحییٰ بن یحییٰ اور ابو الربیع الزہرانی نے بیان کیا, حماد بن زید اور ابن جریج دونوں نے عمرو بن دینار کے واسطے سے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے ابن عینیہ کی ( گزشتہ ) حدیث کے مانند روایت بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو الرَّبِيعِ الزَّهْرَانِيُّ، عَنْ حَمَّادِ بْنِ زَيْدٍ، ح وحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، جَمِيعًا عَنْ عَمْرِو بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ رَضِيَ اللهُ عَنْهُمَا، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، نَحْوَ حَدِيثِ ابْنِ عُيَيْنَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10565,
                "hadithNumber": "3001",
                "englishNarrator": "Muhammad bin 'Abdul-Rahman reported:",
                "hadithEnglish": "A person from Iraq said to him to inquire from 'Urwa bin Zubair رضی اللہ تعالیٰ عنہ for him whether a person who puts on Ihram for Hajj is allowed to put it off or not as he circumambulates the House. And if he says: No, it can't be put off, then tell him that there is a person who makes such an assertion. He (Muhammad bin 'Abdul-Rahman) then said: I asked him ( Urwa bin Zubair), where-upon he said: The person who has entered into the state of Ihram for Hajj cannot get out of it unless he has, completed the Hajj I (further) said (to him): (What) if a person makes that assertion? Thereupon he said: It is indeed unfortunate that he makes such an assertion. That person ('Iraqi) then met me and he asked me and I narrated to him (the reply of 'Urwa), whereupon he (the Iraqi) said: Tell him ('Urwa) that a person had informed him that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had done that; and why is it that Asma' رضی اللہ تعالیٰ عنہا and Zubair رضی اللہ تعالیٰ عنہ have done like this? He (Muhammad b. 'Abd al-Rahman) said: I went to him and made a mention of that to him, whereupon he ('Urwa) said: Who is he (the 'Iraqi)? I said: I do not know, whereupon he said: What is the matter that he does not come to me himself and ask me? I suppose he is an 'Iraqi. I said: I do not know, whereupon he said: He has told a lie. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) performed Hajj, and 'A'isha (رضی اللہ تعالیٰ عنہا) has told me that the first thing with which he commenced (the rituals) when he arrived at Mecca was that he performed ablution and then circumambulated the Ka'ba. Then Abu Bakr رضی اللہ تعالیٰ عنہ performed Hajj and the first thing with which he commenced (the Hajj) as the circumambulation of the Ka'ba and nothing besides it. So did 'Umar رضی اللہ تعالیٰ عنہ . Then 'Uthman رضی اللہ تعالیٰ عنہ performed Hajj and I saw that the first thing with which he commenced the Hajj was the circumambulation of the Ka'ba and nothing besides it. Then Mu'awiya رضی اللہ تعالیٰ عنہ and Abdullah bin 'Umar رضی اللہ تعالیٰ عنہ did that. Then I performed Hajj with my father Zubair bin al-'Awwam رضی اللہ تعالیٰ عنہ , and the first thing with which he commenced (Hajj) was the circumambulation of the House. He then did nothing besides it. I then saw the emigrants (Muhajirin) and the helpers (Ansar) doing like this and nothing besides it. And the last one whom I saw doing like this was Ibn 'Umar رضی اللہ تعالیٰ عنہ. And he did not break it (the Hajj) after performing 'Umra. And Ibn 'Umar رضی اللہ تعالیٰ عنہ is with them. Why don't they ask him (to testify it)? And none amongst those who had passed away commenced (the rituals of Hajj) but by circumambulating the Ka'ba on their (first arrival) and they did not put off Ihram (without completing the Hajj), and I saw my mother and my aunt commencing (their Hajj) with the circumambulation of the House, and they did not put off Ihram. My mother informed me that she came and her sister, and Zubair رضی اللہ تعالیٰ عنہ and so and so for 'Umra, and when they had kissed the corner (the Black Stone, after Sa'i and circumambulation), they put off Ihram. And he (the 'Iraqi) has told a lie in this matter.",
                "hadithUrdu": "ایک عراقی شخص نے ان سے کہا : میری طرف سے عروہ بن زبیر رضی اللہ تعالیٰ عنہ سے اس شخص کے بارے میں سوال کیجئے جو حج کا تلبیہ پکارتا ہے ، جب وہ بیت اللہ کاطواف کرلےتو کیا احرام سے آزاد ہوجائےگا یانہیں؟اگر وہ تمھیں جواب دیں کہ وہ آزاد نہیں ہوگا تو ان سے کہناکہ ایک شخص ہے جو یہ کہتاہے ( محمد بن عبدالرحمان نے ) کہا : میں نے عروہ سے اس کی بابت سوال کیا توا نھوں نےکہا : جو شخص حج کا احرام باندھے ، وہ حج کیے بغیر احرام سے فارغ نہیں ہوگا ۔ میں ( محمد بن عبدالرحمن ) نے عرض کی کہ ایک شخص ہے جو یہی بات کہتا ہے انھوں نے فرمایا : کتنی بری بات ہے جو اس نے کہی ہے ۔ پھر میرا ٹکراؤ ( اس عراقی ) شخص سے ہوا تو اس نے مجھ سے ( اپنے سوال کے متعلق ) پوچھا ۔ میں نے اسے بتادیا ۔ اس ( عراقی ) نے کہا : ان ( عروہ ) سے کہو ، بلاشبہ ایک شخص خبر دے رہاتھا کہ اللہ کے رسول صلی اللہ علیہ وسلم نے ایسا حکم کیا تھا ( حکم دیا تھا ) حضرت اسماء رضی اللہ تعالیٰ عنہا اور حضرت زبیر رضی اللہ تعالیٰ عنہ کا کیا معاملہ تھا؟انھوں نے ( بھی تو ) ایسا کیا تھا ۔ ( محمد بن عبدالرحمان نے ) کہا : میں ان عروہ کے پاس آیا اور ان کو یہ بات سنائی ۔ انھوں نے پوچھا : یہ ( سائل ) کون ہے؟میں نے عرض کی : میں نہیں جانتا ۔ انھوں نے کہا : اسے کیا ہے؟وہ خود میرے پاس آکرمجھ سے سوال کیوں نہیں کرتا؟میرا خیال ہے ، وہ کوئی عراقی ہوگا ۔ میں نے کہا : میں نہیں جانتا ۔ ( عروہ نے ) کہا : بلاشبہ اس نے جھوٹ بولاہے ۔ مجھے حضرت عائشہ رضی اللہ تعالیٰ عنہا نےخبر دی کہ اللہ کےرسول صلی اللہ علیہ وسلم نے حج کیا ، مکہ آکر آپ نے جو کام سب سے پہلے کیا ، یہ تھا کہ آپ نے وضوفرمایا اور پھر بیت اللہ کاطواف کیا ۔ پھر ان کے بعدحضرت ابو بکر رضی اللہ تعالیٰ عنہ نے بھی حج کیا ، انھوں نے بھی ، سب سے پہلے جو کیا ، یہی تھا کہ بیت اللہ کا طواف کیا اور اس کےسوا کوئی کام نہ کیا ( نہ بال کٹوائے نہ احرام کھولا ) ، پھرحضرت عمر رضی اللہ تعالیٰ عنہ نے ہی ایسا ہی کیا ۔ پھرحضرت عثمان رضی اللہ تعالیٰ عنہ نے حج کیا ۔ میں نےانھیں دیکھا ، انھوں نے بھی سب سے پہلا کام جس سے آغاز کیا ، بیت اللہ کاطواف تھا ، پھر اس کےپھر اس کے علاوہ کوئی کام نہ ہوا ۔ پھرمعاویہ رضی اللہ تعالیٰ عنہ اورعبداللہ بن عمر رضی اللہ تعالیٰ عنہ ( نے بھی ایسا ہی کیا ) پھر میں نے اپنے والد زبیر بن عوام رضی اللہ تعالیٰ عنہ کے ساتھ حج کیا ، انھوں نے بھی سب سے پہلے جس سے آغاز کیا بیت اللہ کاطواف تھا اور اس کے علاوہ کوئی نہ تھا ، پھر میں نے مہاجرین وانصار ( کی جماعت ) کو بھی ایسا ہی کرتے دیکھا ۔ اس کے بعد ( بال کٹوانا احرام کھولنا ) کوئی کام نہ ہوا ۔ پھر سب سے آخر میں جسے میں نے یہ کرتے دیکھا وہ حضرت ابن عمر رضی اللہ تعالیٰ عنہ ہیں ۔ انہوں نے بھی عمرے کے ذریعے سے اپنے حج کو فسخ نہیں کیا ، اور یہ ابن عمر رضی اللہ تعالیٰ عنہ لوگوں کے پاس موجود ہیں ۔ یہ انھی سے کیوں نہیں پوچھ لیتے؟اور نہ گزرے ہوئے لوگوں ( صحابہ رضوان اللہ عنھم اجمعین ) میں سے کسی نے ( یہ کام ) کیا ۔ وہ ( صحابہ رضوان اللہ عنھم اجمعین ) جب بھی بیت اللہ میں قدم رکھتے تو طواف سے پہلے اور کسی چیز سے ابتداء نہ کرتے تھے ( طوا ف کرنے کے بعد ) احرام نہیں کھولتے تھے ۔ میں نے اپنی والدہ اور خالہ کو بھی دیکھا ، وہ جب بھی مکہ آتیں طواف سے پہلے کسی اور کام سے آغاز نہ کرتیں ، اس کا طواف کرتیں ، پھر احرام نہ کھولتیں ( حتیٰ کہ حج پورا کرلیتیں ) میری والدہ نے مجھے بتایا کہ وہ ، ان کی ہمشیرہ ( حضرت عائشہ رضی اللہ تعالیٰ عنہا ) ، حضرت زبیر رضی اللہ تعالیٰ عنہ فلاں فلاں لوگ کسی وقت عمرہ کے لئے آئے تھے ، جب انھوں نے حجر اسود کا استلام کرلیا ( اور عمرہ مکمل ہوگیا ) تو ( اس کے بعد ) انھوں نے احرام کھولا ۔ اس شخص نے اس کے بارے میں جس بات کا ذکر کیا ہے ، اس میں جھوٹ بولا ہے ۔",
                "urduNarrator": "مجھ سے ہارون بن سعید الایلی نے بیان کیا، مجھ سے ابن وہب نے بیان کیا، مجھ سے عمرو نے جو ابن حارث ہیں، بیان کیامحمد بن عبدالرحمن سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو وَهُوَ ابْنُ الْحَارِثِ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّ رَجُلًا مِنْ أَهْلِ الْعِرَاقِ قَالَ لَهُ: سَلْ لِي عُرْوَةَ بْنَ الزُّبَيْرِ عَنْ رَجُلٍ يُهِلُّ بِالْحَجِّ، فَإِذَا طَافَ بِالْبَيْتِ أَيَحِلُّ أَمْ لَا؟ فَإِنْ قَالَ لَكَ: لَا يَحِلُّ، فَقُلْ لَهُ: إِنَّ رَجُلًا يَقُولُ ذَلِكَ، قَالَ فَسَأَلْتُهُ فَقَالَ: لَا يَحِلُّ مَنْ أَهَلَّ بِالْحَجِّ إِلَّا بِالْحَجِّ، قُلْتُ: فَإِنَّ رَجُلًا كَانَ يَقُولُ ذَلِكَ، قَالَ: بِئْسَ مَا قَالَ، فَتَصَدَّانِي الرَّجُلُ فَسَأَلَنِي فَحَدَّثْتُهُ، فَقَالَ: فَقُلْ لَهُ: فَإِنَّ رَجُلًا كَانَ يُخْبِرُ أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَدْ فَعَلَ ذَلِكَ، وَمَا شَأْنُ أَسْمَاءَ وَالزُّبَيْرِ قَدْ فَعَلَا ذَلِكَ، قَالَ: فَجِئْتُهُ فَذَكَرْتُ لَهُ ذَلِكَ، فَقَالَ: مَنْ هَذَا؟ فَقُلْتُ: لَا أَدْرِي، قَالَ: فَمَا بَالُهُ لَا يَأْتِينِي بِنَفْسِهِ يَسْأَلُنِي؟ أَظُنُّهُ عِرَاقِيًّا، قُلْتُ: لَا أَدْرِي، قَالَ: فَإِنَّهُ قَدْ كَذَبَ، قَدْ حَجَّ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرَتْنِي عَائِشَةُ رَضِيَ اللهُ عَنْهَا: «أَنَّ أَوَّلَ شَيْءٍ بَدَأَ بِهِ حِينَ قَدِمَ مَكَّةَ أَنَّهُ تَوَضَّأَ، ثُمَّ طَافَ بِالْبَيْتِ، ثُمَّ حَجَّ» أَبُو بَكْرٍ فَكَانَ أَوَّلَ شَيْءٍ بَدَأَ بِهِ الطَّوَافُ بِالْبَيْتِ، ثُمَّ لَمْ يَكُنْ غَيْرُهُ، ثُمَّ عُمَرُ مِثْلُ ذَلِكَ، ثُمَّ حَجَّ عُثْمَانُ فَرَأَيْتُهُ أَوَّلُ شَيْءٍ بَدَأَ بِهِ الطَّوَافُ بِالْبَيْتِ، ثُمَّ لَمْ يَكُنْ غَيْرُهُ، ثُمَّ مُعَاوِيَةُ وَعَبْدُ اللهِ بْنُ عُمَرَ، ثُمَّ حَجَجْتُ مَعَ أَبِي الزُّبَيْرِ بْنِ الْعَوَّامِ، فَكَانَ أَوَّلَ شَيْءٍ بَدَأَ بِهِ الطَّوَافُ بِالْبَيْتِ، ثُمَّ لَمْ يَكُنْ غَيْرُهُ، ثُمَّ رَأَيْتُ الْمُهَاجِرِينَ وَالْأَنْصَارَ يَفْعَلُونَ ذَلِكَ، ثُمَّ لَمْ يَكُنْ غَيْرُهُ، ثُمَّ آخِرُ مَنْ رَأَيْتُ فَعَلَ ذَلِكَ ابْنُ عُمَرَ، ثُمَّ لَمْ يَنْقُضْهَا بِعُمْرَةٍ، وَهَذَا ابْنُ عُمَرَ عِنْدَهُمْ أَفَلَا يَسْأَلُونَهُ؟ وَلَا أَحَدٌ مِمَّنْ مَضَى مَا كَانُوا يَبْدَءُونَ بِشَيْءٍ حِينَ يَضَعُونَ أَقْدَامَهُمْ أَوَّلَ مِنَ الطَّوَافِ بِالْبَيْتِ، ثُمَّ لَا يَحِلُّونَ، وَقَدْ رَأَيْتُ أُمِّي وَخَالَتِي حِينَ تَقْدَمَانِ لَا تَبْدَآنِ بِشَيْءٍ أَوَّلَ مِنَ الْبَيْتِ تَطُوفَانِ بِهِ، ثُمَّ لَا تَحِلَّانِ، وَقَدْ أَخْبَرَتْنِي أُمِّي أَنَّهَا أَقْبَلَتْ هِيَ وَأُخْتُهَا وَالزُّبَيْرُ وَفُلَانٌ وَفُلَانٌ بِعُمْرَةٍ قَطُّ، فَلَمَّا مَسَحُوا الرُّكْنَ حَلُّوا وَقَدْ كَذَبَ فِيمَا ذَكَرَ مِنْ ذَلِكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10566,
                "hadithNumber": "3002",
                "englishNarrator": "Asma bint Abu Bakr (رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "We set out (to Mecca) in a state of Ihram. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: He who has the sacrificial animal with him should remain in the state of Ihram, but he who has not the sacrificial animal with him should put off Ihram. As I had not the sacrificial animal with me, I put off Ihram. And since Zubair (her husband)- had the sacrificial animal with him, he did not put off Ihram. She (Asma رضی اللہ تعالیٰ عنہا ) said: I put on my clothes and then went out and sat by Zabair رضی اللہ تعالیٰ عنہ , whereupon he said: Go away from me, whereupon I said: Do you fear that I would jump upon you?",
                "hadithUrdu": "ہم ( رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ) احرام باندھے ہوئے روانہ ہوئے ، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" جس کے ساتھ قربانی ہے وہ اپنے احرام پر قائم رہے اور جس کے ساتھ قربانی نہیں ہے ( وہ عمرے کےبعد ) احرام کھول دے ۔ \"\" میرے ساتھ قربانی نہیں تھی میں نے احرام کھول دیا اور ( میرے شوہر ) زبیر رضی اللہ تعالیٰ عنہ کے ساتھ قربانی تھی ، انھوں نے نہیں کھولا ۔ حضرت اسماء رضی اللہ تعالیٰ عنہا نے کہا : ( عمرے کے بعد ) میں نے ( دوسرے ) کپڑے پہن لئے اور زبیر رضی اللہ تعالیٰ عنہ کے پاس آبیٹھی ، وہ کہنے لگے : میرے پاس سے اٹھ جاؤ ، میں نے کہا : آپ کو خدشہ ہے کہ میں آپ پر جھپٹ پڑوں گی ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے محمد بن بکر نے بیان کیا، انہوں نے بیان کیا ابن جریج نے کہا : مجھے منصور بن عبدالرحمن نے اپنی والدہ صفیہ بنت شیبہ سے حدیث بیان کی ، انھوں نے حضرت اسماء بنت ابی بکر رضی اللہ تعالیٰ عنہا سے روایت کی ۔ انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، ح وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ - وَاللَّفْظُ لَهُ - حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، حَدَّثَنِي مَنْصُورُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أُمِّهِ صَفِيَّةَ بِنْتِ شَيْبَةَ، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ رَضِيَ اللهُ عَنْهُمَا، قَالَتْ: خَرَجْنَا مُحْرِمِينَ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ كَانَ مَعَهُ هَدْيٌ، فَلْيَقُمْ عَلَى إِحْرَامِهِ، وَمَنْ لَمْ يَكُنْ مَعَهُ هَدْيٌ، فَلْيَحْلِلْ» فَلَمْ يَكُنْ مَعِي هَدْيٌ فَحَلَلْتُ: وَكَانَ مَعَ الزُّبَيْرِ هَدْيٌ فَلَمْ يَحْلِلْ، قَالَتْ: فَلَبِسْتُ ثِيَابِي ثُمَّ خَرَجْتُ فَجَلَسْتُ إِلَى الزُّبَيْرِ، فَقَالَ: قُومِي عَنِّي، فَقُلْتُ: أَتَخْشَى أَنْ أَثِبَ عَلَيْكَ؟",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10567,
                "hadithNumber": "3003",
                "englishNarrator": "Asma bint Abu Bakr (رضی اللہ تعالیٰ عنہا) said:",
                "hadithEnglish": "We came for Hajj in the state of Ihram with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). The rest of the hadith is the same except (for the words) that he (Zubair رضی اللہ تعالیٰ عنہ) said: Keep away from me, keep away from me, whereupon I said: Do you fear that I will jump upon you?",
                "hadithUrdu": "ہم حج کا تلبیہ کہتے ہوئے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ مکہ پہنچے ، پھر آگے ابن جریج کی طرح ہی حدیث بیان کی ، البتہ ( اپنی حدیث میں یہ اضافہ ) ذکر کیا : ( زبیر رضی اللہ تعالیٰ عنہ نے ) کہا : مجھ سے دور رہو ، مجھ سے دور رہو ، میں نے کہا : آپ کو خدشہ ہے کہ میں آپ پر جھپٹ پڑوں گی ۔",
                "urduNarrator": "مجھ سے عباس بن عبدالعظیم الا عنبری نے بیان کیا، کہا ہم سے ابو ہشام المغیرہ بن سلمہ المخزومی نے بیان کیا، انہوں نے کہا وہیب نے کہا : ہمیں منصور بن عبدالرحمن نے اپنی والدہ ( صفیہ بنت شیبہ ) سے ، انھوں نے حضرت اسماء رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے فرمایا",
                "hadithArabic": "وحَدَّثَنِي عَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ، حَدَّثَنَا أَبُو هِشَامٍ الْمُغِيرَةُ بْنُ سَلَمَةَ الْمَخْزُومِيُّ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا مَنْصُورُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أُمِّهِ، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ رَضِيَ اللهُ عَنْهُمَا، قَالَتْ: قَدِمْنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مُهِلِّينَ بِالْحَجِّ، ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ ابْنِ جُرَيْجٍ غَيْرَ أَنَّهُ قَالَ: فَقَالَ: اسْتَرْخِي عَنِّي، اسْتَرْخِي عَنِّي، فَقُلْتُ: أَتَخْشَى أَنْ أَثِبَ عَلَيْكَ؟",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10568,
                "hadithNumber": "3004",
                "englishNarrator": "Abdullah, the freed slave of Asma' bint Abu Bakr (Allah be pleased with them), narrated that he used to hear Asma رضی اللہ تعالیٰ عنہا, ' whenever she passed by Hajun, saying (these words):",
                "hadithEnglish": "May there be peace and blessing of Allah upon His Messenger. We used to stay here along with him with light burdens. Few were our rides, and small were our provisions. I performed 'Umra and so did my sister 'A'isha رضی اللہ تعالیٰ عنہا , and Zubair and so and so. And as we touched the House (performed circumambulation and Sa'i) we put off Ihram, and then again put on Ihram in the afternoon for Hajj. Harun (one of the narrators) in one of the narrations said: The freed slave of Asma' رضی اللہ تعالیٰ عنہا and he did not mention 'Abdullah.",
                "hadithUrdu": "\"\" اللہ تعالیٰ اپنے رسول صلی اللہ علیہ وسلم پر رحمتیں فرمائے! \"\" ہم نے آپ صلی اللہ علیہ وسلم کے ساتھ اس مقام پر پڑاؤ کیا تھا ۔ ان دنوں ہمارے سفر کےتھیلے ہلکے ، سواریاں کم اور زاد راہ بھی تھوڑا ہوتا تھا ۔ میں ، میری بہن عائشہ رضی اللہ تعالیٰ عنہا ، زبیر رضی اللہ تعالیٰ عنہ اور فلاں فلاں شخص نے عمرہ کیاتھا ، پھر جب ہم ( حضرت عائشہ رضی اللہ تعالیٰ عنہا کے سوا باقی سب ) نے بیت اللہ ( اور صفا مروہ ) کا طواف کرلیا تو ہم ( میں سے جنھوں نے عمرہ کرنا تھاانھوں نے ) احرام کھول دیے ، پھر ( ترویہ کے دن ) زوال کے بعد ہم نے ( احرام باندھ کر ) حج کا تلبیہ پکارا ۔ ہارون نے اپنی روایت میں کہا : حضرت اسماء رضی اللہ تعالیٰ عنہا کے آزاد کردہ غلام نے ( کہا ) ، انھوں نے ان کا نام ، عبداللہ نہیں لیا ۔",
                "urduNarrator": "ہمیں ہارون بن سعید ایلی اور احمد بن عیسیٰ نے حدیث بیان کی ، کہا : ہمیں ابن وہب نے حدیث بیا ن کی ، ( کہا : ) مجھے عمرو نے ابن اسود سےخبر دی کہ اسماء رضی اللہ تعالیٰ عنہا کے مولیٰ عبداللہ ( بن کیسان ) نے انھیں حدیث بیان کی کہ حضرت اسماء رضی اللہ تعالیٰ عنہا جب بھی مقام حجون سے گزرتیں تو وہ انھیں یہ کہتے ہوئے سنتے",
                "hadithArabic": "وحَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ، وَأَحْمَدُ بْنُ عِيسَى، قَالَا: حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو، عَنْ أَبِي الْأَسْوَدِ، أَنَّ عَبْدَ اللهِ، مَوْلَى أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ رَضِيَ اللهُ عَنْهُمَا حَدَّثَهُ، أَنَّهُ كَانَ يَسْمَعُ أَسْمَاءَ كُلَّمَا مَرَّتْ بِالْحَجُونِ تَقُولُ: «صَلَّى الله عَلَى رَسُولِهِ وَسَلَّمَ، لَقَدْ نَزَلْنَا مَعَهُ هَاهُنَا، وَنَحْنُ يَوْمَئِذٍ خِفَافُ الْحَقَائِبِ، قَلِيلٌ ظَهْرُنَا قَلِيلَةٌ أَزْوَادُنَا، فَاعْتَمَرْتُ أَنَا وَأُخْتِي عَائِشَةُ وَالزُّبَيْرُ وَفُلَانٌ وَفُلَانٌ، فَلَمَّا مَسَحْنَا الْبَيْتَ أَحْلَلْنَا، ثُمَّ أَهْلَلْنَا مِنَ الْعَشِيِّ بِالْحَجِّ» قَالَ هَارُونُ فِي رِوَايَتِهِ: أَنَّ مَوْلَى أَسْمَاءَ، وَلَمْ يُسَمِّ: عَبْدَ اللهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10569,
                "hadithNumber": "3005",
                "englishNarrator": "Muslim al-Qurri reported:",
                "hadithEnglish": "I asked Ibn Abbas (رضی اللہ تعالیٰ عنہ) about Tamattu' in Hajj and he permitted it, whereas Ibn Zubair رضی اللہ تعالیٰ عنہ had forbidden it. He (Ibn 'Abbas رضی اللہ تعالیٰ عنہ) said: This is the mother of Ibn Zubair رضی اللہ تعالیٰ عنہ who states that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had permitted it, so you better go to her and ask her about it. He (Muslim al-Qurri said): So we went to her and she was a bulky blind lady and she said: Verily Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) permitted it.",
                "hadithUrdu": "میں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے حج تمتع کے بارے میں سوا ل کیا ۔ انھوں نے اس کی اجازت دی ، جبکہ ابن زبیر رضی اللہ تعالیٰ عنہ اس سے منع فرمایا کرتے تھے ۔ انھوں ( ابن عباس رضی اللہ تعالیٰ عنہ ) نے کہا : یہ ابن زبیر رضی اللہ تعالیٰ عنہ کی والدہ ہیں ۔ وہ حدیث بیان کرتی ہیں کہ اللہ کے رسول صلی اللہ علیہ وسلم نے اس کی اجازت دی ، ان کے پاس جاؤ ۔ اور ان سے پوچھو ( قری نے ) کہا : ہم ان کی خدمت میں حاضر ہوئے وہ ( اس وقت ) بھاری جسم کی نابینا خاتون تھی ، ( ہمارے استفسار کے جواب میں ) انھوں نےفرمایا : یقیناً اللہ کےرسول صلی اللہ علیہ وسلم نے اس ( حج تمتع ) کی اجازت عطا فرمائی تھی ۔",
                "urduNarrator": "ہم سے محمد بن حاتم نے بیان کیا، کہا ہم سے روح بن عبادہ نے بیان کیا، انہوں نے بیان کیا شعبہ نے مسلم قری سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا شُعْبَةُ، عَنْ مُسْلِمٍ الْقُرِّيِّ، قَالَ: سَأَلْتُ ابْنَ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا، عَنْ مُتْعَةِ الْحَجِّ؟ فَرَخَّصَ فِيهَا، وَكَانَ ابْنُ الزُّبَيْرِ يَنْهَى عَنْهَا، فَقَالَ: هَذِهِ أُمُّ ابْنِ الزُّبَيْرِ تُحَدِّثُ: أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ رَخَّصَ فِيهَا، فَادْخُلُوا عَلَيْهَا فَاسْأَلُوهَا، قَالَ: فَدَخَلْنَا عَلَيْهَا، فَإِذَا امْرَأَةٌ ضَخْمَةٌ عَمْيَاءُ، فَقَالَتْ: قَدْ رَخَّصَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِيهَا.",
                "headingArabic": "فِي مُتْعَةِ الْحَجِّ ‏",
                "headingUrdu": "حج میں تمتع",
                "headingEnglish": "Tamattu' in Hajj",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10570,
                "hadithNumber": "3006",
                "englishNarrator": "It was narrated from Shubah with this chain (a hadith similar to no. 3005). As for (the narration of) Abdur Rahman, it mentions Mutah but it does not say \"Mutah in Hajj.\" As for Ibn Jafar, he said: \"Shubah said: Muslim said:",
                "hadithEnglish": "\"I do not know whether it is Mutah (Tamatu) in Hajj or Mutah with women.",
                "hadithUrdu": "( ابن عباس رضی اللہ تعالیٰ عنہ ) نے حج تمتع کا ذکر کیا یا کہ عورتوں سے ( نکاح ) متعہ کی بات کی ۔",
                "urduNarrator": "ہم سے ابن المثنی نے بیان کیا، انہوں نے کہا عبدالرحمن اور محمد بن جعفر دونوں نے اسی سند کے ساتھ شعبہ سے روایت کی ، ان میں سے عبدالرحمن کی حدیث میں صرف لفظ تمتع ہے ، انھوں نے حج تمتع کے الفاظ روایت نہیں کیے ۔ جبکہ ابن جعفر نے کہا : شعبہ کا قول ہے کہ مسلم ( قری ) نے کہا : میں نہیں جانتا کہ",
                "hadithArabic": "وحَدَّثَنَاه ابْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، ح وحَدَّثَنَاه ابْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدٌ يَعْنِي ابْنَ جَعْفَرٍ، جَمِيعًا عَنْ شُعْبَةَ، بِهَذَا الْإِسْنَادِ، فَأَمَّا عَبْدُ الرَّحْمَنِ فَفِي حَدِيثِهِ الْمُتْعَةُ وَلَمْ يَقُلْ مُتْعَةُ الْحَجِّ، وَأَمَّا ابْنُ جَعْفَرٍ فَقَالَ: قَالَ شُعْبَةُ قَالَ مُسْلِمٌ: «لَا أَدْرِي مُتْعَةُ الْحَجِّ أَوْ مُتْعَةُ النِّسَاءِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10571,
                "hadithNumber": "3007",
                "englishNarrator": "Muslim al-Qurri heardlbn 'Abbas (رضی اللہ تعالیٰ عنہ) saying:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) entered into the state of Ihram for Umra and his Companions for Hajj. Neither Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) nor those among his Companions who had brought sacrificial animals with them put off Ihram, whereas the rest (of the pilgrims) did so. Talha b. Ubaidullah was one of those who had brought the sacrificial animals along with them so he did not put off Ihram.",
                "hadithUrdu": "( حجۃ الوداع کے موقع پر اولاً ) رسول اللہ صلی اللہ علیہ وسلم نے ( حج کے ساتھ ملاکر ) عمرہ کرنے کا تلبیہ پکاراتھا ، اور آپ کے ( بعض ) صحابہ رضوان اللہ عنھم اجمعین نے حج کا تلبیہ پکارا تھا ، پھر نبی کریم صلی اللہ علیہ وسلم اور آپ صلی اللہ علیہ وسلم کے وہ صحابہ رضوان اللہ عنھم اجمعین جو قربانیاں ساتھ لائے تھے ، انھوں نے ( جب تک حج مکمل نہ کرلیا ) احرام نہ کھولا ، باقی صحابہ رضوان اللہ عنھم اجمعین نے ( جن کےہمراہ قربانیاں نہ تھیں ) احرام کھول دیا ۔ حضرت طلحہ بن عبیداللہ رضی اللہ تعالیٰ عنہ بھی انھی لوگوں میں سے تھے جو قربانیاں ساتھ لائے تھے ، لہذا انھوں نے احرام نہ کھولا ۔",
                "urduNarrator": "معاذ ( بن معاذ ) نے ہمیں شعبہ سے حدیث سنائی ، ( کہا : ) مسلم قریؒ نے ہمیں حدیث سنائی ، انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے سنا ، وہ فرمارہے تھے",
                "hadithArabic": "وحَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا مُسْلِمٌ الْقُرِّيُّ، سَمِعَ ابْنَ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا، يَقُولُ: «أَهَلَّ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِعُمْرَةٍ وَأَهَلَّ أَصْحَابُهُ بِحَجٍّ، فَلَمْ يَحِلَّ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَلَا مَنْ سَاقَ الْهَدْيَ مِنْ أَصْحَابِهِ، وَحَلَّ بَقِيَّتُهُمْ» فَكَانَ طَلْحَةُ بْنُ عُبَيْدِ اللهِ فِيمَنْ سَاقَ الْهَدْيَ فَلَمْ يَحِلَّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10572,
                "hadithNumber": "3008",
                "englishNarrator": "This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters but with this variation (of words):",
                "hadithEnglish": "Talha رضی اللہ تعالیٰ عنہ and another person also were among those who had not brought the sacrificial animals with them and so they put off Ihram.",
                "hadithUrdu": "جن کے پاس قربانیاں نہ تھیں ان میں طلحہ بن عبیداللہ رضی اللہ تعالیٰ عنہ اور ایک دوسرے صاحب تھے ، لہذا ان دونوں نے ( عمرے کے بعد ) احرام کھول دیا ۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا, محمد ، یعنی ابن جعفر نے ہمیں حدیث بیان کی ، ( کہا : ) ہمیں شعبہ نے اسی سند کے ساتھ حدیث سنائی ، البتہ انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنَاه مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدٌ يَعْنِي ابْنَ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، بِهَذَا الْإِسْنَادِ غَيْرَ، أَنَّهُ قَالَ: وَكَانَ مِمَّنْ لَمْ يَكُنْ مَعَهُ الْهَدْيُ طَلْحَةُ بْنُ عُبَيْدِ اللهِ وَرَجُلٌ آخَرُ فَأَحَلَّا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10573,
                "hadithNumber": "3009",
                "englishNarrator": "Ibn Abbas (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "They (the Arabs of pre-Islamic days) looked upon Umra during the months of Hajj as the greatest of sins on the earth. So they intercalated the month of Muharram for Safar and said: When the backs of their camels would become all right and traces (if the pilgrims) would be effaced (from the paths) and the month of Safar would be over, then Umra would be permissible for one who wants to perform it. When Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and his Companions came in the state of Ihram for performing Hajj on the fourth (of Dhu'l-Hijja) he (Allah's Apostle) commanded them to change their state of Ihram (from Hajj) to that of 'Umra. It was something inconceivable for them. So they said: Messenger of Allah, is it a complete freedom (of the obligation) of Ihram? Thereupon he said: It is a complete freedom (from Ihram).",
                "hadithUrdu": "( جاہلیت میں ) لوگوں کا خیال تھا کہ حج کے مہینوں میں عمرہ کرنا ، زمین میں سب سے براکام ہے ۔ اور وہ لوگ محرم کے مہینے کو صفر بنا لیا کرتے تھے ، اور کہا کرتے تھے : جب ( اونٹوں کا ) پیٹھ کا زخم مندمل ہوجائے ، ( مسافروں کا ) نشان ( قدم ) مٹ جائے اورصفر ( اصل میں محر م ) گزر جائے تو عمرہ والے کے لئے عمرہ کرناجائز ہے ۔ ( حالانکہ ) نبی کریم صلی اللہ علیہ وسلم ا اپنے صحابہ رضوان اللہ عنھم اجمعین کے ساتھ چار ذوالحجہ کی صبح کو حج کا تلبیہ پکارتے ہوئے مکہ پہنچے ، اور ان ( صحابہ رضوان اللہ عنھم اجمعین ) کو حکم دیا کہ اپنے حج ( کی نیت ) کو عمرے میں بدل دیں ، یہ بات ان ( صحابہ رضوان اللہ عنھم اجمعین ) پر بڑی گراں تھی ، سب نے بیک زبان کہا : اے اللہ کے رسول صلی اللہ علیہ وسلم !یہ کیسی حلت ( احرام کا خاتمہ ) ہوگی؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" مکمل حلت ۔ \"",
                "urduNarrator": "ہم سے محمد بن حاتم نے بیان کیا، کہا ہم سے بہز نے بیان کیا، کہا ہم سے وہیب نے بیان کیا، انہوں نے بیان کیا عبداللہ بن طاوس نے اپنے والد طاوس بن کیسان سے ، انھوں نےحضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے فرمایا",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا عَبْدُ اللهِ بْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا، قَالَ: كَانُوا يَرَوْنَ أَنَّ الْعُمْرَةَ فِي أَشْهُرِ الْحَجِّ مِنْ أَفْجَرِ الْفُجُورِ فِي الْأَرْضِ، وَيَجْعَلُونَ الْمُحَرَّمَ صَفَرًا، وَيَقُولُونَ: إِذَا بَرَأَ الدَّبَرْ، وَعَفَا الْأَثَرْ، وَانْسَلَخَ صَفَرْ، حَلَّتِ الْعُمْرَةُ، لِمَنِ اعْتَمَرْ، فَقَدِمَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابُهُ صَبِيحَةَ رَابِعَةٍ، مُهِلِّينَ بِالْحَجِّ فَأَمَرَهُمْ أَنْ يَجْعَلُوهَا عُمْرَةً، فَتَعَاظَمَ ذَلِكَ عِنْدَهُمْ فَقَالُوا: يَا رَسُولَ اللهِ، أَيُّ الْحِلِّ؟ قَالَ: «الْحِلُّ كُلُّهُ».",
                "headingArabic": "حج کے مہینوں میں عمرہ کرنا جائز ہے۔",
                "headingUrdu": "حج کے مہینوں میں عمرہ کرنا جائز ہے۔",
                "headingEnglish": "It is permissible to perform 'Umrah during the months of Hajj",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10574,
                "hadithNumber": "3010",
                "englishNarrator": "Ibn 'Abbas (رضی اللہ تعالیٰ عنہ) 'is reported to have said:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) put on Ihigm for Hajj. When four days of Dhu'l-Hijja were over, he led the dawn prayer, and when the prayer was complete, he said: He who wants to change it to Umra may do so.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے حج کاتلبیہ پکارا اور چار ذوالحجہ کو تشریف لائے اور فجر کی نماز ادا کی ، جب نماز فجر ادا کرچکے تو فرمایا : \" جو ( اپنے حج کو ) عمرہ بنانا چاہے ، وہ اسے عمرہ بنا لے ۔ \"",
                "urduNarrator": "نصر بن علی جحضمی نے ہمیں حدیث سنائی ، ( کہا : ) میرے والد نے ہمیں حدیث سنائی ، ( کہا : ) شعبہ نے ہمیں حدیث سنائی ، انھوں نے ایوب سے ، انھوں نے ابو عالیہ براء سے روایت کی ، انھوں نے ابن عباس رضی اللہ تعالیٰ عنہ سے سنا ، وہ فرمارہے تھے",
                "hadithArabic": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ أَيُّوبَ، عَنْ أَبِي الْعَالِيَةِ الْبَرَّاءِ، أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا، يَقُولُ: أَهَلَّ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِالْحَجِّ، فَقَدِمَ لِأَرْبَعٍ مَضَيْنَ مِنْ ذِي الْحِجَّةِ، فَصَلَّى الصُّبْحَ، وَقَالَ: لَمَّا صَلَّى الصُّبْحَ «مَنْ شَاءَ أَنْ يَجْعَلَهَا عُمْرَةً، فَلْيَجْعَلْهَا عُمْرَةً».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10575,
                "hadithNumber": "3011",
                "englishNarrator": "Rauh and Yahya bin Kathir narrated as Nasr reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) entered into the state of Ihram for Hajj. And in the narration of Abu Shihab (the words are): We went out with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) pronouncing Talbiya for Hajj, And in an the ahadith (narrated in this connection the words are): He led the morning prayer at al-Batha', except al-jahdami who did not make mention of it.",
                "hadithUrdu": "اللہ کے رسول اللہ صلی اللہ علیہ وسلم نے حج کا تلبیہ پکا را البتہ ابو شہاب کی روایت میں ہے : ہم تمام رسول اللہ صلی اللہ علیہ وسلم کے ساتھ حج کا تلبیہ پکا رتے ہو ئے نکلے ۔ ( آگے ) ان سب کی روایت میں ہے کہ آپ صلی اللہ علیہ وسلم نے بطحا ء میں فجر کی نماز ادا کی ، سوائے جہضمی کے کہ انھوں نے یہ بات نہیں کی-",
                "urduNarrator": "اور ہم سے ابراہیم بن دینار نے بیان کیا, یہی حدیث روح ، ابو شہاب اور یحییٰ بن کثیر ان تمام نے شعبہ سے اسی سند سے روایت کی ، روح اور یحییٰ بن کثیر دونوں نے ویسے ہی کہا جیسا کہ نصر ( بن علی جہضمی نے کہا کہ",
                "hadithArabic": "وحَدَّثَنَاه إِبْرَاهِيمُ بْنُ دِينَارٍ، حَدَّثَنَا رَوْحٌ، ح وحَدَّثَنَا أَبُو دَاوُدَ الْمُبَارَكِيُّ، حَدَّثَنَا أَبُو شِهَابٍ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى بْنُ كَثِيرٍ، كُلُّهُمْ عَنْ شُعْبَةَ، فِي هَذَا الْإِسْنَادِ أَمَّا رَوْحٌ، وَيَحْيَى بْنُ كَثِيرٍ، فَقَالَا: كَمَا، قَالَ نَصْرٌ: أَهَلَّ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِالْحَجِّ، وَأَمَّا أَبُو شِهَابٍ فَفِي رِوَايَتِهِ: خَرَجْنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نُهِلُّ بِالْحَجِّ، وَفِي حَدِيثِهِمْ جَمِيعًا: فَصَلَّى الصُّبْحَ بِالْبَطْحَاءِ، خَلَا الْجَهْضَمِيَّ فَإِنَّهُ لَمْ يَقُلْهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10576,
                "hadithNumber": "3012",
                "englishNarrator": "Ibn 'Abbas ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came along with his Companions when four days had passed out of ten days (of Dhu'l-Hijja) and they were pronouncing Talbiya for Hajj, and he (the Holy Prophet) commanded them to change (this Ihram) into that of 'Umra.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم اپنے صحا بہ کرام رضوان اللہ عنھم اجمعین سمیت عشرہ ذوالحجہ کی چار راتیں گزارنے کے بعد ( مکہ ) تشریف لا ئے ۔ وہ ( صحابہ کرا م رضوان اللہ عنھم اجمعین ) حج کا تلبیہ پکاررہے تھے ( وہاں پہنچ کر ) آپ نے انھیں حکم دیا کہ اس ( نسک جس کے لیے وہ تلبیہ پکار رہے تھے ) کو عمر ے میں بدل دیں ۔",
                "urduNarrator": "ہم سے ہارون بن عبداللہ نے بیان کیا، ہم سے محمد بن الفضل السدوسی نے بیان کیا، انہوں نے کہا ہمیں وہیب نے حدیث سنا ئی ، ( کہا ) ہمیں ایو ب نے حدیث سنا ئی انھوں نے ابو عالیہ برا ء سے انھوں نے ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی ، فرمایا",
                "hadithArabic": "وحَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللهِ، حَدَّثَنَا مُحَمَّدُ بْنُ الْفَضْلِ السَّدُوسِيُّ، حَدَّثَنَا وُهَيْبٌ، أَخْبَرَنَا أَيُّوبُ، عَنْ أَبِي الْعَالِيَةِ الْبَرَّاءِ، عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا، قَالَ: «قَدِمَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابُهُ لِأَرْبَعٍ خَلَوْنَ مِنَ الْعَشْرِ، وَهُمْ يُلَبُّونَ بِالْحَجِّ، فَأَمَرَهُمْ أَنْ يَجْعَلُوهَا عُمْرَةً».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10577,
                "hadithNumber": "3013",
                "englishNarrator": "Ibn Abbas (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) observed the morning prayer at Dhu Tawa (a valley near Mecca) and arrived (in Mecca) when four days of Dhul-Hijja had passed and he commanded his Companions that they should change their Ihram (of Hajj) to that of Umra, except those who had brought sacrificial animals with them.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فجر کی نماز ذی طوی میں ادا فر ما ئی اور ذوالحجہ کی چا ر راتیں گزری تھیں کہ تشریف لا ئے اور اپنے صحا بہ کرام حکم فرمایا کہ جس کے پاس قربانی ہے ان کے علاوہ باقی سب لو گ اپنے ( حج کے ) احرام کوعمرے میں بدل دیں ۔",
                "urduNarrator": "ہم سے عبد بن حمید نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، انہوں نے بیان کیا معمر نے ہمیں ہمیں خبردی انھوں نے ایوب سے انھوں نے ابو عالیہ سے انھوں نے ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی فرمایا",
                "hadithArabic": "وحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ أَيُّوبَ، عَنْ أَبِي الْعَالِيَةِ، عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا، قَالَ: «صَلَّى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الصُّبْحَ بِذِي طَوًى وَقَدِمَ لِأَرْبَعٍ مَضَيْنَ مِنْ ذِي الْحِجَّةِ، وَأَمَرَ أَصْحَابَهُ أَنْ يُحَوِّلُوا إِحْرَامَهُمْ بِعُمْرَةٍ، إِلَّا مَنْ كَانَ مَعَهُ الْهَدْيُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10578,
                "hadithNumber": "3014",
                "englishNarrator": "Ibn 'Abbas (رضی اللہ تعالیٰ عنہما) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: This is the 'Umra of which we have taken advantage. So he who has not the sacrificial animal with him should get out of the state of Ihram completely, for 'Umra has been incorporated in Hajj until the Day of Resurrection,",
                "hadithUrdu": "اللہ کے رسول اللہ صلی اللہ علیہ وسلم نےفرمایا : \" یہ عمرہ ( اداہوا ) ہے جس سے ہم نے فائدہ اٹھا لیا ہے ( اب ) جس کے پاس قربانی کا جا نور نہ ہو وہ مکمل طور پر حلال ہو جا ئے ۔ ( احرا م کھول دے ) یقیناً ( اب ) قیامت کے دن تک کے لیے عمرہ حج میں داخل ہو گیا ہے ( دونوں ایک ساتھ ادا کیے جا سکتے ہیں ).",
                "urduNarrator": "ہم سے محمد بن المثنیٰ اور ابن بشار نے بیان کیا، کہا: ہم سے انہوں نے بیان کیا محمد بن جعفر نے اور عبید اللہ بن معاذ نے اپنے والد کے واسطے سے حدیث بیان کی ۔ ۔ ۔ لفظ عبید اللہ کے ہیں ۔ ۔ ۔ کہا شعبہ نے ہمیں حدیث بیان کی ، انھوں نے حکم سے ، انھوں نے مجا ہد سے اور انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہما سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، ح وحَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ - وَاللَّفْظُ لَهُ - حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «هَذِهِ عُمْرَةٌ اسْتَمْتَعْنَا بِهَا، فَمَنْ لَمْ يَكُنْ عِنْدَهُ الْهَدْيُ فَلْيَحِلَّ الْحِلَّ كُلَّهُ، فَإِنَّ الْعُمْرَةَ قَدْ دَخَلَتْ فِي الْحَجِّ إِلَى يَوْمِ الْقِيَامَةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10579,
                "hadithNumber": "3015",
                "englishNarrator": "Abu Hamza at Ad-Dubu'i reported:",
                "hadithEnglish": "I performed Tamattu' but the people discouraged me to do so. I came to Ibn 'Abbas رضی اللہ تعالیٰ عنہ and asked him about it. He ordered me to do so. I came to the House (Ka'ba) and slept. I saw a visitant in the dream who said: 'Umra is acceptable and so is the Hajj performed for God's sake. I came to Ibn Abbas رضی اللہ تعالیٰ عنہ and informed him about that Which I saw in the dream whereupon he said: Allah is the Greatest, Allah is the Greatest This is the Sunnah of Abu'l-Qasim (the Holy Prophet) ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ).",
                "hadithUrdu": "میں نے حج تمتع ( کا ارادہ ) کیا تو ( متعدد ) لوگوں نے مجھے اس سے روکا ، میں ( اسی شش و پنج میں ) ابن عباس رضی اللہ تعالیٰ عنہ کے پاس آیا اور اس معاملے میں استفسارکیا تو انھوں نے مجھے اس ( حج تمتع ) کا حکم دیا ۔ کہا پھر میں اپنے گھر لوٹا اور آکر سو گیا ، نیند میں دورا ن خواب میرے پاس ایک شخص آیا ۔ اور کہا ( تمھا را ) عمرہ قبول اور ( تمھا را ) حج مبرو ( ہر عیب سےپاک ) ہے ۔ انھوں نے کہا میں ( دوباراہ ابن عباس رضی اللہ تعالیٰ عنہ کی خدمت میں حا ضر ہوا اور جو دیکھا تھا ۔ کہہ سنا یا ۔ وہ ( خوشی سے ) کہہ اٹھے ( عربی ۔ ۔ ۔ ۔ ۔ ۔ ۔ ۔ ۔ ) یہ ابو القاسم صلی اللہ علیہ وسلم کی سنت ہے ( تمھا را خواب اسی کی بشارت ہے ).",
                "urduNarrator": "ہم سے محمد بن المثنیٰ اور ابن بشار نے بیان کیا، کہا: ہم سے محمد بن جعفر نے بیان کیا، ہم سے شعبہ نے بیان کیا، انہوں نے کہا: میں نے سنا, ابو حمزہ ضبعی نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ: سَمِعْتُ أَبَا جَمْرَةَ الضُّبَعِيَّ، قَالَ: تَمَتَّعْتُ فَنَهَانِي نَاسٌ عَنْ ذَلِكَ، فَأَتَيْتُ ابْنَ عَبَّاسٍ فَسَأَلْتُهُ عَنْ ذَلِكَ، فَأَمَرَنِي بِهَا، قَالَ: ثُمَّ انْطَلَقْتُ إِلَى الْبَيْتِ فَنِمْتُ، فَأَتَانِي آتٍ فِي مَنَامِي، فَقَالَ: عُمْرَةٌ مُتَقَبَّلَةٌ، وَحَجٌّ مَبْرُورٌ، قَالَ: فَأَتَيْتُ ابْنَ عَبَّاسٍ، فَأَخْبَرْتُهُ بِالَّذِي رَأَيْتُ، فَقَالَ: «اللهُ أَكْبَرُ اللهُ أَكْبَرُ سُنَّةُ أَبِي الْقَاسِمِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10580,
                "hadithNumber": "3016",
                "englishNarrator": "Ibn 'Abbas ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) observed the Zuhr prayer at Dhu'l-Hulaifa; then called for his she-camel and marked it on the right side of its bump, removed the blood from it, and tied two sandals round its neck. He then mounted his camel, and when it brought him up to al-Baida', he pronounced Talbiya for the Pilgrimage.",
                "hadithUrdu": "آپ نے ذوالحلیفہ میں ظہر کی نماز ادا فرمائی ۔ پھر اپنی اونٹنی منگوائی اور اس کی کو ہا ن کی دا ئیں جا نب ( ہلکے سے ) زخم کا نشان لگا یا اور خون پونچھ دیا اور دو جوتے اس کے گلے میں لتکا ئے ۔ پھر اپنی سواری پر سوار ہو ئے ۔ ( اور چل دیے ) جب وہ آپ کو لے کر بیداء کے اوپر پہنچی تو آپ نے حج کا تلبیہ پکا را ۔",
                "urduNarrator": "ہم سے محمد بن المثنی اور ابن بشار نے ابن ابی عدی کی سند سے بیان کیا، ابن المثنی نے کہا: ہم سے ابن ابی عدی نے بیان کیا۔شعبہ نے قتادہ سے انھوں نے ابو حسان سے انھوں نے ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی فر ما یا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، جَمِيعًا عَنِ ابْنِ أَبِي عَدِيٍّ، قَالَ ابْنُ الْمُثَنَّى: حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، عَنْ أَبِي حَسَّانَ، عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا، قَالَ: «صَلَّى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الظُّهْرَ بِذِي الْحُلَيْفَةِ، ثُمَّ دَعَا بِنَاقَتِهِ فَأَشْعَرَهَا فِي صَفْحَةِ سَنَامِهَا الْأَيْمَنِ، وَسَلَتَ الدَّمَ، وَقَلَّدَهَا نَعْلَيْنِ، ثُمَّ رَكِبَ رَاحِلَتَهُ، فَلَمَّا اسْتَوَتْ بِهِ عَلَى الْبَيْدَاءِ أَهَلَّ بِالْحَجِّ».",
                "headingArabic": "إشعارالبدن وتقليده عندالإحرام",
                "headingUrdu": "احرام باندھتے وقت قربانی کے جانور پر نشان لگانا اور مالا چڑھانا",
                "headingEnglish": "Marking and Garlanding the sacrificial animal when entering Ihram",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10581,
                "hadithNumber": "3017",
                "englishNarrator": "This hadith has been narrated on the authority of Qatada with the same chain of transmitters but with this variation (of words):",
                "hadithEnglish": "When Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came to Dhu'l-Hulaifa and he made no mention (of the fact) that he led the Zuhr prayer.",
                "hadithUrdu": "\" اللہ کے نبی صلی اللہ علیہ وسلم جب ذوالحلیفہ آئے \" یہ نہیں کہا : \" انھوں نے وہاں ( ذوالحلیفہ میں ) ظہر کی نماز ادا فرمائی ۔",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا, معاذ بن ہشام نے کہا : مجھے میرے والد ( ہشام بن ابی عبد اللہ صاحب الدستوائی ) نے قتادہ سے اسی سند کے ساتھ شعبہ کی حدیث کے ہم معنی حدیث روایت کی ، البتہ انھوں نے یہ الفا ظ کہے",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، فِي هَذَا الْإِسْنَادِ بِمَعْنَى حَدِيثِ شُعْبَةَ غَيْرَ أَنَّهُ قَالَ: إِنَّ نَبِيَّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لَمَّا أَتَى ذَا الْحُلَيْفَةِ، وَلَمْ يَقُلْ صَلَّى بِهَا الظُّهْرَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10582,
                "hadithNumber": "3018",
                "englishNarrator": "Abu Hassan al-A'raj reported:",
                "hadithEnglish": "A person from Bani Hujaim said to Ibn 'Abbas (رضی اللہ تعالیٰ عنہ): What is this religious verdict of yours which has engaged the attention of the people or which has become a matter of dispute among them that he who circumambulated the House can be free from Ihram? Thereupon he said: That is the Sunnah of your Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), even though you may not approve of it.",
                "hadithUrdu": "بنو حجیم کے ایک شخص نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے پو چھا یہ کیا فتوی ہے ۔ جس نے لوگوں کو الجھا رکھا ہے یا پریشان کر رکھا ہے؟ کہ جو شخص بیت اللہ کا طواف کرے ( عمرہ کر لے ) وہ احرا م سے باہر آجا تا ہے ۔ انھوں نے فر ما یا : یہی تمھارے نبی صلی اللہ علیہ وسلم کی سنت ہے چا ہے تمھا ری مرضی نہ ہو ۔",
                "urduNarrator": "محمد بن مثنیٰ یا ابن بشار نے کہا، کوئی بیان نہیں، انہوں نے کہا: محمد بن جعفر نے کہا، کوئی بیان نہیں، انہوں نے کہا شعبہ نے قتادہ سے حدیث بیان کی ، کہا : میں نے ابو حسان اعرج سے سنا ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَ ابْنُ الْمُثَنَّى: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ: حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، قَالَ: سَمِعْتُ أَبَا حَسَّانَ الْأَعْرَجَ، قَالَ: قَالَ رَجُلٌ مِنْ بَنِي الْهُجَيْمِ لِابْنِ عَبَّاسٍ: مَا هَذَا الْفُتْيَا الَّتِي قَدْ تَشَغَّفَتْ أَوْ تَشَغَّبَتْ بِالنَّاسِ، «أَنَّ مَنْ طَافَ بِالْبَيْتِ فَقَدْ حَلَّ»؟ فَقَالَ: «سُنَّةُ نَبِيِّكُمْ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَإِنْ رَغِمْتُمْ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10583,
                "hadithNumber": "3019",
                "englishNarrator": "Abu Hassan reported:",
                "hadithEnglish": "It was said to Ibn 'Abbas (رضی اللہ تعالیٰ عنہ) that this affair had engaged the attention of the people that he who circumambulates the House was permitted to circumambulate for Umra (even though he was in a state of Ihram for Hajj), whereupon he said: That is the Sunnah of your Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), even though you may not approve of it.",
                "hadithUrdu": "ابن عباس رضی اللہ تعالیٰ عنہ سے کہا گیا کہ اس معاملے ( فتوے ) نے لوگوں کو تفرقے میں ڈال دیا ہے کہ جو بیت اللہ کا طوف ( عمرہ ) کر کے وہ احرا م سے باہر آجا تا ہے اور یہ کہ طواف مستقل عمرہ ہے فر ما یا : ( ہاں ) یہی تمھا رے نبی صلی اللہ علیہ وسلم کی سنت ہے چا ہے تمھیں نہ چا ہتے ہو ئے قبول کرنی پڑے ۔",
                "urduNarrator": "مجھ سے احمد بن سعید الدارمی نے بیان کیا، کہا ہم سے احمد بن اسحاق نے بیان کیا، انہوں نے بیان کیا ہمام بن یحییٰ نے قتادہ سے ، انھوں ے ابو حسان سے حدیث بیان کی ، کہا",
                "hadithArabic": "وحَدَّثَنِي أَحْمَدُ بْنُ سَعِيدٍ الدَّارِمِيُّ، حَدَّثَنَا أَحْمَدُ بْنُ إِسْحَاقَ، حَدَّثَنَا هَمَّامُ بْنُ يَحْيَى، عَنْ قَتَادَةَ، عَنْ أَبِي حَسَّانَ، قَالَ: قِيلَ لِابْنِ عَبَّاسٍ إِنَّ هَذَا الْأَمْرَ قَدْ تَفَشَّغَ بِالنَّاسِ، «مَنْ طَافَ بِالْبَيْتِ فَقَدْ حَلَّ الطَّوَافُ عُمْرَةٌ» فَقَالَ: «سُنَّةُ نَبِيِّكُمْ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَإِنْ رَغَمْتُمْ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10584,
                "hadithNumber": "3020",
                "englishNarrator": "Ata' said:",
                "hadithEnglish": "Ibn 'Abbas (رضی اللہ تعالیٰ عنہ) used to say that a pilgrim or non-pilgrim (one performing 'Umar) who circumambulates the House is free from the responsibility of Ihram. I (Ibn Juraij, one of the narrators) said to 'Ata': On what authority does he (Ibn Abbas رضی اللہ تعالیٰ عنہ ) say this? He said: On the authority uf Allah's words: Then their place of sacrifice is the Ancient House (al-Qur'an, xxii. 33). I said: It concerns the time after staying at 'Arafat, whereupon he said: Ibn 'Abbas (رضی اللہ تعالیٰ عنہ) had stated (that the place of sacrifice is the Ancient House) ; it way be after staying at 'Arafat or before (staying there). And he (Ibn Abbas رضی اللہ تعالیٰ عنہ) made this deduction I from the command of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) when he had ordered to put off Ihram on the occasion of the Farewell Pilgrimage.",
                "hadithUrdu": "حضرت ابن عباس رضی اللہ تعالیٰ عنہ فر مایا کرتے تھے : ( احرا م کی حا لت میں ) جو شخص بھی بیت اللہ کا طواف کرے وہ حاجی ہو یا غیر حاجی ( صرف عمرہ کرنے والا ) وہ طواف کے بعد احرا م سے آزاد ہو جا ئے گا ابن جریج نے کہا : میں نے عطا ء سے دریافت کیا ، ابن عباس رضی اللہ تعالیٰ عنہ یہ بات کہاں سے لیتے ہیں؟ ( ان کے پاس کیا دلیل ہے؟ فرمایا اللہ تعا لیٰ کے اس فر مان سے ( دلیل لیتے ہوئے ) \" پھر ان کے حلال ( ذبح ) ہو نے کی جگہ \" البیت العتیق \" ( بیت اللہ ) کے پاس ہے ۔ \" ابن جریج نے کہا : میں نے ( عطاء سے ) کہا : اس آیت کا تعلق تو وقوف عرفات کے بعد سے ہے انھوں نے جواب دیا : ( مگر ) ابن عباس رضی اللہ تعالیٰ عنہ کہتے تھے : اس آیت کا تعلق وقوف عرفات سے قبل اور بعد دونوں سے ہے ۔ اور انھوں نے یہ بات نبی صلی اللہ علیہ وسلم کے اس حکم سے اخذ کی جو آپ صلی اللہ علیہ وسلم نے لوگوں کو حجۃ الوداع کے موقع پر ( طواف وسعی کے بعد ) احرا م کھول دینے کے بارے میں دیا تھا ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے محمد بن بکر نے بیان کیا، انہوں نے بیان کیا ابن جریج نے کہا : مجھے عطا ء نے خبر دی کہ",
                "hadithArabic": "وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عَطَاءٌ، قَالَ: كَانَ ابْنُ عَبَّاسٍ يَقُولُ: لَا يَطُوفُ بِالْبَيْتِ حَاجٌّ وَلَا غَيْرُ حَاجٍّ إِلَّا حَلَّ، قُلْتُ لِعَطَاءٍ: مِنْ أَيْنَ يَقُولُ ذَلِكَ؟ قَالَ: مِنْ قَوْلِ اللهِ تَعَالَى: {ثُمَّ مَحِلُّهَا إِلَى الْبَيْتِ الْعَتِيقِ} [الحج: 33] قَالَ: قُلْتُ: فَإِنَّ ذَلِكَ بَعْدَ الْمُعَرَّفِ، فَقَالَ: كَانَ ابْنُ عَبَّاسٍ يَقُولُ: هُوَ بَعْدَ الْمُعَرَّفِ وَقَبْلَهُ، وَكَانَ يَأْخُذُ ذَلِكَ مِنْ أَمْرِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، حِينَ «أَمَرَهُمْ أَنْ يَحِلُّوا فِي حَجَّةِ الْوَدَاعِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10585,
                "hadithNumber": "3021",
                "englishNarrator": "Ibn Abbas رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Mu'awiya رضی اللہ تعالیٰ عنہ had said to them: Do you know that I clipped some hair from the head of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) at al- Marwa with the help of a clipper? I said: I do not know it except as it verdict against you.",
                "hadithUrdu": "مجھے معاویہ رضی اللہ تعالیٰ عنہ نے بتا یا کیا آپ کو معلوم ہے کہ میں نے مروہ کے پاس رسول اللہ صلی اللہ علیہ وسلم کے بال قینچی سے کا ٹے تھے؟میں نے کہا : میں یہ تو نہیں جانتا مگر ( یہ جا نتا ہوں کہ ) آپ کی یہ بات آپ ہی کے خلا ف دلیل ہے ۔",
                "urduNarrator": "ہم سے عمرو ناقد نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا, ہشام بن حجیر نے طاوس سے روایت کی ، کہا : حضرت ابن عباس رضی اللہ تعالیٰ عنہ نے ذکر کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ هِشَامِ بْنِ حُجَيْرٍ، عَنْ طَاوُسٍ، قَالَ: قَالَ ابْنُ عَبَّاسٍ قَالَ لِي مُعَاوِيَةُ: «أَعَلِمْتَ أَنِّي قَصَّرْتُ مِنْ رَأْسِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عِنْدَ الْمَرْوَةِ بِمِشْقَصٍ؟» فَقُلْتُ لَهُ: لَا أَعْلَمُ هَذَا إِلَّا حُجَّةً عَلَيْكَ.",
                "headingArabic": "جواز تقصير المعتمرمن شعره وأنه لايجب حلقه، يستحب كون حلقه أو تقصيره عنده المروة",
                "headingUrdu": "عمرہ کرنے والے کے لیے بال کٹوانا جائز ہے اور اسے منڈوانا ضروری نہیں ہے۔ اس کے لیے مروہ میں بال منڈوانا یا چھوٹا کرنا مستحب ہے۔",
                "headingEnglish": "It is permissible for the pilgrim performing Umrah to shorten his hair and he does not have to shave it. It is recommended for him to shave his hair or shorten it at Al-Marwah",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10586,
                "hadithNumber": "3022",
                "englishNarrator": "Ibn Abbis (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Mu'awiya bin Abu Safyin رضی اللہ تعالیٰ عنہ had told him: I clipped the hair (from the head of) Allah's Messenger (ﷺ) with a clipper while he was at al-Marwa, or I saw him getting his hair clipped with a clipper as he was at al-Marwa. 1722",
                "hadithUrdu": "حضرت معاویہ ابی سفیان رضی اللہ تعالیٰ عنہ نے انھیں خبر دی کہا : میں نے قینچی سے آپ صلی اللہ علیہ وسلم کے بال تر اشے جبکہ آپ مروہ پر ( سعی سے فارغ ہو ئے ) تھے ۔ یا کہا : میں نے آپ صلی اللہ علیہ وسلم کو دیکھا کہ آپ کے بال قینچی سے ترا شے جا رہے تھے ، اور آپ مروہ پرتھے ۔",
                "urduNarrator": "مجھ سے محمد بن حاتم نے بیان کیا، ہم سے یحییٰ بن سعید نے بیان کیا، انہوں نے ابن جریج کی سند سے بیان کیا, حسن بن مسلم نے طاوس سے انھوں نے ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنِ ابْنِ جُرَيْجٍ، حَدَّثَنِي الْحَسَنُ بْنُ مُسْلِمٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ مُعَاوِيَةَ بْنَ أَبِي سُفْيَانَ، أَخْبَرَهُ قَالَ: «قَصَّرْتُ عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِشْقَصٍ، وَهُوَ عَلَى الْمَرْوَةِ، أَوْ رَأَيْتُهُ يُقَصَّرُ عَنْهُ بِمِشْقَصٍ، وَهُوَ عَلَى الْمَرْوَةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10587,
                "hadithNumber": "3023",
                "englishNarrator": "Abu Sa'id ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "We went out with Allah's messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) pronouncing loudly the Talbiya for Hajj When we came to Mecca, he commanded us that we should change this (Ihram for Hajj) to that of Umra except one who had brought the sacrificial animal with him. When it was the day of Tarwiya (8th of Dhul-Hijja) and we went to Mini, we (again) pronounced Talbiya for Hajj.",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ انتہائی بلند آواز سے حج کا تلبیہ پکا رتے ہو ئے نکلے ۔ جب ہم مکہ پہنچے تو آپ نے ہمیں حکم دیا کہ جن کے پاس قربانی ہے ان کے علاوہ ہم تمام اسے ( حج کو ) عمرے میں بدل دیں ۔ جب ( ترویہ ) آٹھ ذوالحجہ کا دن آیا تو ہم نے احرا م باندھا منیٰ کی طرف روانہ ہو ئے اور حج کا تلبیہ پکا را ۔",
                "urduNarrator": "مجھ سے عبید اللہ بن عمر القواری نے بیان کیا، انہوں نے ہم سے بیان کیاعبد الاعلی بن عبد الاعلی نے حدیث بیان کی ، ( کہا ) ہمیں داود نے ابو نضر ہ سے انھوں نے ابو سعید خدری رضی اللہ تعالیٰ عنہ سے حدیث بیا ن کی ، کہا",
                "hadithArabic": "حَدَّثَنِي عُبَيْدُ اللهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، حَدَّثَنَا عَبْدُ الْأَعْلَى بْنُ عَبْدِ الْأَعْلَى، حَدَّثَنَا دَاوُدُ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ، قَالَ: «خَرَجْنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَصْرُخُ بِالْحَجِّ صُرَاخًا، فَلَمَّا قَدِمْنَا مَكَّةَ أَمَرَنَا أَنْ نَجْعَلَهَا عُمْرَةً إِلَّا مَنْ سَاقَ الْهَدْيَ، فَلَمَّا كَانَ يَوْمُ التَّرْوِيَةِ، وَرُحْنَا إِلَى مِنًى، أَهْلَلْنَا بِالْحَجِّ».",
                "headingArabic": "جواز التمتع في الحج والقران",
                "headingUrdu": "تمتع اور قرآن حج میں جائز ہیں۔",
                "headingEnglish": "Tamattu' and Qiran are permissible in Hajj",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10588,
                "hadithNumber": "3024",
                "englishNarrator": "jibir and Abil Salld al-Khudri (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "We went with Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and we were pronouncing Talbiya for Hajj loudly.",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ مکہ پہنچے اور ہم بہت بلند آواز سے حج کا تلبیہ پکا ر رہے تھے ۔",
                "urduNarrator": "ہم سے حجاج بن الشاعر نے بیان کیا، ہم سے معلی بن اسد نے بیان کیا، انہوں نے ہم سے بیان کیا وہیب بن خا لد نے داود سے انھوں نے ابو نضرہ سے انھوں نے جابر اور ابو خدری رضی اللہ تعالیٰ عنہ سے حدیث بیان کی ، ان دونوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا وُهَيْبُ بْنُ خَالِدٍ، عَنْ دَاوُدَ، عَنْ أَبِي نَضْرَةَ، عَنْ جَابِرٍ، وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللهُ عَنْهُمَا، قَالَا: «قَدِمْنَا مَعَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَنَحْنُ نَصْرُخُ بِالْحَجِّ صُرَاخًا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 10276,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=411",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=409",
                "label": "409",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=410",
                "label": "410",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=411",
                "label": "411",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=412",
                "label": "412",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=413",
                "label": "413",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=414",
                "label": "414",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=415",
                "label": "415",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=413",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=413",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=411",
        "to": 10300,
        "total": 40465
    }
}