{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 409,
        "data": [
            {
                "id": 10489,
                "hadithNumber": "2925",
                "englishNarrator": "Umra reported:",
                "hadithEnglish": "I heard A'isha (رضی اللہ تعالیٰ عنہا) as saying: We went out with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) five days before the end of Dhi Qa'dah, and we did see but that he intended to perform Hajj (only), but as we came near Mecca the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) commanded that he who did not have the sacrificial animal with him should put off Ihram after circumambulating the House and running between al-Safa and aI-Marwa (and thus convert his Ihram from that of Hajj to 'Umra). 'A'isha (رضی اللہ تعالیٰ عنہا) said: The flesh of cow was sent to us on the Day of Sacrifice (10th of Dhu'I-Hijja). I said. What is this? It was said: The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) sacrificed (the cow) on behalf of his wives. Yahya said: I made a mention of this hadith (what has been stated by Umra) to Qasim bin Muhammad, whereupon be said: By Allah, she has rightly narrated it to you.",
                "hadithUrdu": "میں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے سنا ، وہ فرما رہی تھیں : ذوالعقدہ کے پانچ دن باقی تھے کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ( حج کے لیے ) نکلے ، ہمارے پیش نظر صرف حج تھا ۔ جب ہم مکہ کہ قریب پہنچے تو رسول اللہ صلی اللہ علیہ وسلم نے حکم فر مایا : \"\" \"\" جس کے ہمراہ قربانی نہیں ہے وہ جب بیت اللہ کا طواف اور صفا مروہ کی سعی کر لے تو احرا م کھول دے ۔ حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : عید کے دن ہمارے پاس گا ئے گو شت لا یا گیا ۔ میں نے پوچھا : یہ کیا ہے؟بتا یا گیا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم نے اپنی ازواج مطہرات رضی اللہ تعالیٰ عنہا کی طرف سے ( یہ گا ئے ) ذبح کی ہے یحییٰ نے کہا : میں نے یہ حدیث قاسم بن محمد بن قاسم کے سامنے پیش کی تو ( انھوں نے ) فر ما یا : اللہ کی قسم اس ( عمرہ ) نے تمھیں یہ حدیث بالکل صحیح صورت میں پہنچا ئی ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ بن قعنب نے بیان کیا، ان سے سلیمان نے، یعنی ہم سے ابن بلال نے بیان کیا, یحییٰ بن سعید نے عمرہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا عَبْدُ اللهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا سُلَيْمَانُ يَعْنِي ابْنَ بِلَالٍ، عَنْ يَحْيَى وَهُوَ ابْنُ سَعِيدٍ، عَنْ عَمْرَةَ، قَالَتْ: سَمِعْتُ عَائِشَةَ رَضِيَ اللهُ عَنْهَا، تَقُولُ: خَرَجْنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِخَمْسٍ بَقِينَ مِنْ ذِي الْقَعْدَةِ، وَلَا نَرَى إِلَّا أَنَّهُ الْحَجُّ حَتَّى إِذَا دَنَوْنَا مِنْ مَكَّةَ «أَمَرَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مَنْ لَمْ يَكُنْ مَعَهُ هَدْيٌ، إِذَا طَافَ بِالْبَيْتِ وَبَيْنَ الصَّفَا وَالْمَرْوَةِ، أَنْ يَحِلَّ»، قَالَتْ عَائِشَةُ رَضِيَ اللهُ عَنْهَا: فَدُخِلَ عَلَيْنَا يَوْمَ النَّحْرِ بِلَحْمِ بَقَرٍ، فَقُلْتُ: مَا هَذَا؟ فَقِيلَ: ذَبَحَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ أَزْوَاجِهِ قَالَ يَحْيَى: فَذَكَرْتُ هَذَا الْحَدِيثَ لِلْقَاسِمِ بْنِ مُحَمَّدٍ، فَقَالَ: أَتَتْكَ، وَاللهِ، بِالْحَدِيثِ عَلَى وَجْهِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10490,
                "hadithNumber": "2926",
                "englishNarrator": null,
                "hadithEnglish": "This hadlth has been narrated by Yahya through the same chain of transmitters.",
                "hadithUrdu": "ہم سے محمد بن المثنی نے بیان کیا، انہوں نے کہا عبد الوہاب  نے بیان کیا، انہوں نے کہا: میں نے یحییٰ بن سعید کو کہتے سنا: مجھ سے عمرہ نے بیان کیا کہ انہوں نے عائشہ رضی اللہ عنہا کو سنا۔ خدا ان سے راضی ہو، اور ہم سے ابن ابی عمر نے بیان کیا، ہم سے سفیان نے، یحییٰ کی سند سے، اسی طرح کی سند کے ساتھ بیان کیا۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ: سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ، يَقُولُ: أَخْبَرَتْنِي عَمْرَةُ، أَنَّهَا سَمِعَتْ عَائِشَةَ رَضِيَ اللهُ عَنْهَا، ح وحَدَّثَنَاه ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ يَحْيَى، بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10491,
                "hadithNumber": "2927",
                "englishNarrator": "AI-Qasim narrated from the Mother of the Believers (Hadrat 'A'isha رضی اللہ تعالیٰ عنہا) that she said:",
                "hadithEnglish": "Messenger of Allah صلی اللہ علیہ وسلم the people return (from Mecca) having done two worships (both Hajj and Umra), but I am coming back with one (only). whereupon he said: You should wait and when the period of menses is over, you should go to Tan'im and put on lhram and then meet us at such and such time (and I think he said tomorrow) ; and (the reward of this Umra) is for you equal to your hardship or your spending.",
                "hadithUrdu": "( اے رسول اللہ صلی اللہ علیہ وسلم !لوگ ) حج اور عمرہ دودو مناسک ادا کر کے ( اپنے گھروں کو ) لو ٹیں گے اور میں صرف ایک منسک ( حج ) کر کے لو ٹوں گی؟آپ نے فرمایا : \" تم ذرا انتظار کرو!جب تم پاک ہو جاؤ تو تنعیم ( کی طرف ) چلی جا نا اور وہاں سے ( احرا م باندھ کر عمرے کا ) تلبیہ پکا رنا پھر فلاں مقام پر ہم سے آملنا ۔ ۔ ۔ ابرا ہیم نے ) کہا : میرا خیال ہے آپ نے فرمایاتھا : کل ۔ ۔ ۔ اور ( فرمایا : ) لیکن وہ ( تمھا رے عمرے کا اجر ) ۔ ۔ ۔ تمھا ری مشقت یا فرمایا : خرچ ہی کے مطا بق ہو گا ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے ابن عون نے بیان کیا، ابن عون کی سند سے, ابرا ہیم نے اسود اور قاسم سے ان دونوں نے ام المومنین رضی اللہ تعالیٰ عنہا سے روایت کی ، ام المومنین رضی اللہ تعالیٰ عنہا نے ) کہا :میں نے عرض کی",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ عُلَيَّةَ، عَنِ ابْنِ عَوْنٍ، عَنْ إِبْرَاهِيمَ، عَنِ الْأَسْوَدِ، عَنْ أُمِّ الْمُؤْمِنِينَ، ح وَعَنِ الْقَاسِمِ، عَنْ أُمِّ الْمُؤْمِنِينَ، قَالَتْ: قُلْتُ: يَا رَسُولَ اللهِ، يَصْدُرُ النَّاسُ بِنُسُكَيْنِ وَأَصْدُرُ بِنُسُكٍ وَاحِدٍ؟ قَالَ: «انْتَظِرِي، فَإِذَا طَهَرْتِ فَاخْرُجِي إِلَى التَّنْعِيمِ، فَأَهِلِّي مِنْهُ، ثُمَّ الْقَيْنَا عِنْدَ كَذَا وَكَذَا - قَالَ أَظُنُّهُ قَالَ غَدًا - وَلَكِنَّهَا عَلَى قَدْرِ نَصَبِكِ أَوْ - قَالَ - نَفَقَتِكِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10492,
                "hadithNumber": "2928",
                "englishNarrator": "Ibn al-Muththanna reported on the authority of Ibn Abu'Adi who transmitted on the authority of Ibn'Aun who narrated from al-Qasim and Ibrahim having said:",
                "hadithEnglish": "I cannot differentiate the hadith of one from the other (Qasim and Ibrahim) that the Mother of the Believers (رضی اللہ تعالیٰ عنہا ) said this: Messenger of Allah, people have come back with two acts of worship. The rest of the hadith is the same.",
                "hadithUrdu": "میں ان میں سے ایک کی حدیث دوسرے کی حدیث سے الگ نہیں کر سکتا ۔ ام المومنین ( حضرت عائشہ رضی اللہ تعالیٰ عنہا ) نے عرض کی : اے اللہ کے رسول !لوگ دومنسک ( حج اور عمرہ ) کر کے لو ٹیں ۔ اور آگے ( اسی طرح ) حدیث بیان کی ۔",
                "urduNarrator": "ہم سے ابن المثنی نے بیان کیا، انہوں نے کہا ابن ابی عدی نے ابن عون سے حدیث بیان کی ، انھوں نے قاسم اور ابرا ہیم سے روایت کی ( ابن عون نے ) کہا",
                "hadithArabic": "وحَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنِ ابْنِ عَوْنٍ، عَنِ الْقَاسِمِ، وَإِبْرَاهِيمَ، قَالَ: لَا أَعْرِفُ حَدِيثَ أَحَدِهِمَا مِنَ الْآخَرِ، أَنَّ أُمَّ الْمُؤْمِنِينَ رَضِيَ اللهُ عَنْهَا، قَالَتْ: يَا رَسُولَ اللهِ، يَصْدُرُ النَّاسُ بِنُسُكَيْنِ فَذَكَرَ الْحَدِيثَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10493,
                "hadithNumber": "2929",
                "englishNarrator": "A'isha (رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "We went with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and we did not see but that he (intended to perform) Hajj (only), but when we reached Mecca we circumambulated the House; and the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) commanded that he who did not have with him a sacrificial animal should put off Ihram. She (A'isha رضی اللہ تعالیٰ عنہا ) said: (And consequently) those who did not bring the sacrificial animals with them put off Ihram; and among his wives (too) who had not brought the sacrificial animals with them put off Ihram. A'isha رضی اللہ تعالیٰ عنہا said: I entered my period and could not (therefore) circumambulate the House. When it was the night of Hasba she said: Messenger of Allah, people are coming back (after having performed both) Hajj and 'Umra, whereas I am coming back only with Hajj, whereupon he said: Did you not circumambulate (the Ka'ba) that very night we entered Mecca? She (A'isha رضی اللہ تعالیٰ عنہا ) said: No, whereupon he said: Go along with your brother to Tan'im and put on the Ihram for Umra, and it is at such and such a place that you can meet (us). (In the meanwhile) Safiyya رضی اللہ تعالیٰ عنہا (the wife of the Holy Prophet) said: I think, I will detain you (since I have entered in the monthly) period and you shall have to wait for me for the farewell circuit). Thereupon he (the Holy Prophet) said: May you be wounded and your head shorn did you not circumambulate on the Day of Sacrifice (10th of Dhu'l-Hijja)? She said: Yes. The Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: There is no harm. You should go forward. 'A'isha رضی اللہ تعالیٰ عنہا said: The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was going upwards to the side of Mecca, whereas I was coming down from it, or I was going upward, whereas he was coming down. Isbiq said: She was climbing down, and he was climbing down.",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نکلے اور ہم اس کو حج ہی سمجھتے تھے ۔ جب ہم مکہ پہنچے اور بیت اللہ کا طواف کیا تو رسول اللہ صلی اللہ علیہ وسلم نے حکم دیا : جو اپنے ساتھ قربانی نہیں لا یا وہ احرا م کھو ل دے ۔ ( حضرت عائشہ رضی اللہ تعالیٰ عنہا نے ) کہا : جتنے لو گ بھی قربانی ساتھ نہیں لا ئے تھے ۔ انھوں نے احرا م ختم کر دیا ۔ آپ کی ازواج بھی اپنے ساتھ قربانیا ں نہیں لا ئیں تھیں تو وہ بھی احرا م سے باہر آگئیں ۔ حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : ( لیکن ) میرے ایام شروع ہو گئے تھے اور میں بیت اللہ کا طواف نہ کر سکی جب حصبہ کی رات آئی ، کہا : تو میں نے عرض کی : اے اللہ کے رسول اللہ صلی اللہ علیہ وسلم !لوگ حج اور عمرہ کر کے لو ٹیں اور میں صرف حج کر کے لو ٹو ں گی؟آپ نے فرمایا : \"\" جن راتوں ( تاریخوں ) میں ہم مکہ آئے تھے کیا تم نے طواف نہیں کیا تھا؟ میں نے کہا ۔ جی نہیں آپ نے فر ما یا : \"\" تو پھر اپنے بھا ئی ( عبد الرحمٰن رضی اللہ تعالیٰ عنہ ) کے ساتھ مقام تنعیم تک چلی جا ؤ اور وہاں سے ( عمرے کا حرا م باندھ کر ) عمرے کا تلبیہ پکارو ( اور عمرہ کر لو ) پھر تم فلاں مقام پر آملنا ۔ حضرت صفیہ رضی اللہ تعالیٰ عنہا کہنے لگیں : میں اپنے بارے میں سمجھتی ہوں کہ میں ( بھی ) آپ کو روکنے والی ہوں گی ۔ آپ نے فرمایا : \"\" ( اپنی قوم کی زبان میں عقریٰ حلقٰی ( بے اولاد ، بے بال ، یہود حائضہ عورت کے لیے یہی لفظ بو لتے تھے ) کیا تم نے عید کے دن طواف نہیں کیا تھا ؟کہا : کیوں نہیں ( کیا تھا! ) آپ نے فر ما یا : \"\" ( تو پھر ) کو ئی بات نہیں ، اب چل پڑو ۔ \"\" حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : دوسری صبح ) رسول اللہ صلی اللہ علیہ وسلم مجھ سے ( اس وقت ) ملے جب آپ مکہ سے چڑھا ئی پر آرہے تھے اور میں مکہ کی سمت اتر رہی تھی ۔ ۔ ۔ یا میں چڑھا ئی پر جا رہی تھی اور آپ اس سے اتر رہے تھے ( واپس آرہے تھے ) ۔ ۔ ۔ اور اسحاق نے متهبطه ( اترنےوالی ) اور متهبط ( اترنے والے ) کے الفاظ کہے ۔ ( مفہوم وہی ہے )",
                "urduNarrator": "ہم سے زہیر بن حرب اور اسحاق بن ابراہیم نے بیان کیا، کہا کہ ہم سے زہیر نے بیان کیا اور اسحق نے کہا: ہم سے جریر نے بیان کیا, منصور نے ابرا ہیم سے ، انھوں نے اسود سے انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے حدیث بیان کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، - قَالَ زُهَيْرٌ: حَدَّثَنَا، وقَالَ إِسْحَاقُ: - أَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الْأَسْوَدِ، عَنْ عَائِشَةَ رَضِيَ اللهُ عَنْهَا، قَالَتْ: خَرَجْنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَلَا نَرَى إِلَّا أَنَّهُ الْحَجُّ، فَلَمَّا قَدِمْنَا مَكَّةَ تَطَوَّفْنَا بِالْبَيْتِ، فَأَمَرَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مَنْ لَمْ يَكُنْ سَاقَ الْهَدْيَ، أَنْ يَحِلَّ، قَالَتْ: فَحَلَّ مَنْ لَمْ يَكُنْ سَاقَ الْهَدْيَ، وَنِسَاؤُهُ لَمْ يَسُقْنَ الْهَدْيَ، فَأَحْلَلْنَ، قَالَتْ عَائِشَةُ: فَحِضْتُ، فَلَمْ أَطُفْ بِالْبَيْتِ، فَلَمَّا كَانَتْ لَيْلَةُ الْحَصْبَةِ قَالَتْ: قُلْتُ: يَا رَسُولَ اللهِ، يَرْجِعُ النَّاسُ بِعُمْرَةٍ وَحَجَّةٍ، وَأَرْجِعُ أَنَا بِحَجَّةٍ؟ قَالَ: «أَوْ مَا كُنْتِ طُفْتِ لَيَالِيَ قَدِمْنَا مَكَّةَ؟» قَالَتْ: قُلْتُ: لَا، قَالَ: «فَاذْهَبِي مَعَ أَخِيكِ إِلَى التَّنْعِيمِ، فَأَهِلِّي بِعُمْرَةٍ، ثُمَّ مَوْعِدُكِ مَكَانَ كَذَا وَكَذَا» قَالَتْ صَفِيَّةُ: مَا أُرَانِي إِلَّا حَابِسَتَكُمْ، قَالَ «عَقْرَى حَلْقَى، أَوْ مَا كُنْتِ طُفْتِ يَوْمَ النَّحْرِ» قَالَتْ: بَلَى، قَالَ: «لَا بَأْسَ، انْفِرِي» قَالَتْ عَائِشَةُ: فَلَقِيَنِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مُصْعِدٌ مِنْ مَكَّةَ وَأَنَا مُنْهَبِطَةٌ عَلَيْهَا، أَوْ أَنَا مُصْعِدَةٌ وَهُوَ مُنْهَبِطٌ مِنْهَا وقَالَ إِسْحَاقُ: مُتَهَبِّطَةٌ وَمُتَهَبِّطٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10494,
                "hadithNumber": "2930",
                "englishNarrator": "A'isha (رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "We went out with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) pronouncing Talbiya having no explicit intention of Pilgrimage or 'Umra. and he quoted a hadith similar to that of \r\n Mansur (no. 2029).",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تلبیہ کہتے ہو ئے نکلے ہم حج یا عمرے کا ذکر نہیں رہے تھے ۔ اور آگے ( اعمش نے ) منصور کے ہم معنی ہی حدیث بیان کی .",
                "urduNarrator": "ہم سے سوید بن سعید نے علی بن مسہر کی سند سے بیان کیا, اعمش نے ابرا ہیم سے ، انھوں نے اسود کے واسطے سے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنَاه سُوَيْدُ بْنُ سَعِيدٍ، عَنْ عَلِيِّ بْنِ مُسْهِرٍ، عَنِ الْأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الْأَسْوَدِ، عَنْ عَائِشَةَ رَضِيَ اللهُ عَنْهَا، قَالَتْ: خَرَجْنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نُلَبِّي، لَا نَذْكُرُ حَجًّا وَلَا عُمْرَةً، وَسَاقَ الْحَدِيثَ بِمَعْنَى حَدِيثِ مَنْصُورٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10495,
                "hadithNumber": "2931",
                "englishNarrator": "A'isha ( رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came out on the 4th or 5th of Dhul'I-Hijja (for Pilgrimage to Mecca) and came to me, and he was very angry. I said: Messenger of Allah, who has annoyed you? May Allah cast him in fire I He said: Don't you know that I commanded the people to do an act, but they are hesitant. (Hakam said: I think that he said: They seem to be hesitant.) And if I were to know my affair before what I had to do subsequently, I would not have brought with me the sacrificial animals, and would have bought them (at Mecca) and would have put off lhram as others have done.",
                "hadithUrdu": "ذوالحجہ کے چار یا پانچ دن گزر چکے تھے کہ آپ میرے پاس ( خیمے میں تشریف لا ئے ، آپ غصے کی حالت میں تھے ، میں نے دریافت کیا : اے اللہ کے رسول صلی اللہ علیہ وسلم !آپ کو کس نے غصہ دلایا؟ اللہ اسے آگ میں دا خل کرے ۔ آپ نے جواب دیا : \"\" کیا تم نہیں جا نتیں !میں نے لوگوں کو ایک حکم دیا ( کہ جو قر بانی ساتھ نہیں لا ئے ، وہ عمرے کے بعد احرا م کھول دیں ) مگر اس پر عمل کرنے میں پس و پیش کررہے ہیں ۔ ۔ ۔ ۔ حکم نے کہا : میرا خیال ہے ( کہ میرے استا علی بن حسین نے ) \"\" ایسا لگتا ہے وہ پس و پیش کررہے ہیں ۔ \"\" کہا ۔ ۔ ۔ اگر اپنے اس معاملے میں وہ بات پہلے میرے سامنے آجا تی جو بعد میں آئی تو میں اپنے ساتھ قربانی نہ لا تا حتیٰ کہ میں اسے ( یہاں آکر ) خریدتا پھر میں ویسے احرام سے باہر آجا تا جیسے یہ سب ( صحابہ رضوان اللہ عنھم اجمعین عمرے کے بعد ) آگئے ہیں ۔",
                "urduNarrator": "ابوبکر بن ابی شیبہ، محمد بن المثنی اور ابن بشار نے غندر کے بارے میں کہا, محمد بن جعفر ( غندر ) نے کہا : ہمیں شعبہ نے حکم سے حدیث بیان کی ، انھوں نے ( زین العابدین ) علی بن حسین سے ، انھوں نے ذاکون مولیٰ عائشہ رضی اللہ تعالیٰ عنہا سے انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے فر مایا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، جَمِيعًا عَنْ غُنْدَرٍ، قَالَ ابْنُ الْمُثَنَّى: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ عَلِيِّ بْنِ الْحُسَيْنِ، عَنْ ذَكْوَانَ، مَوْلَى عَائِشَةَ، عَنْ عَائِشَةَ رَضِيَ اللهُ عَنْهَا، أَنَّهَا قَالَتْ: قَدِمَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِأَرْبَعٍ مَضَيْنَ مِنْ ذِي الْحِجَّةِ، أَوْ خَمْسٍ، فَدَخَلَ عَلَيَّ وَهُوَ غَضْبَانُ فَقُلْتُ: مَنْ أَغْضَبَكَ، يَا رَسُولَ اللهِ؟ أَدْخَلَهُ اللهُ النَّارَ، قَالَ: «أَوَمَا شَعَرْتِ أَنِّي أَمَرْتُ النَّاسَ بِأَمْرٍ، فَإِذَا هُمْ يَتَرَدَّدُونَ؟» - قَالَ الْحَكَمُ: كَأَنَّهُمْ يَتَرَدَّدُونَ أَحْسِبُ - «وَلَوْ أَنِّي اسْتَقْبَلْتُ مِنْ أَمْرِي مَا اسْتَدْبَرْتُ، مَا سُقْتُ الْهَدْيَ مَعِي حَتَّى أَشْتَرِيَهُ، ثُمَّ أَحِلُّ كَمَا حَلُّوا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10496,
                "hadithNumber": "2932",
                "englishNarrator": "A'isha (رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came out (for Pilgrimage) on The 4th or 5th of Dbu'l Hjjja. The rest of the hadith is the same, but he (the narrator) made no mention of the doubt of Hakam about his (the Prophet's) words: They were reluctant.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ذوالحجہ کی چار یا پانچ راتیں گزرنے کے بعد مکہ تشریف لا ئے آگے ( عبید اللہ بن معاذ نے ) غندر کی روایت کے مانند ہی حدیث بیان کی انھوں نے پس و پیش کرنے کے حوالےسے حکم کا شک ذکر نہیں کیا ۔",
                "urduNarrator": "عبید اللہ بن معاذ نے کہا : مجھے میرے والد نے شعبہ سے باقی ماندہ سابقہ سند کے ساتھ حدیث بیان کی ، حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت ہے ۔ انھوں نے فرمایا",
                "hadithArabic": "وحَدَّثَنَاه عُبَيْدُ اللهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، سَمِعَ عَلِيَّ بْنَ الْحُسَيْنِ، عَنْ ذَكْوَانَ، عَنْ عَائِشَةَ رَضِيَ اللهُ عَنْهَا، قَالَتْ: قَدِمَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِأَرْبَعٍ أَوْ خَمْسٍ مَضَيْنَ مِنْ ذِي الْحِجَّةِ، بِمِثْلِ حَدِيثِ غُنْدَرٍ، وَلَمْ يَذْكُرِ الشَّكَّ مِنَ الْحَكَمِ فِي قَوْلِهِ: يَتَرَدَّدُونَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10497,
                "hadithNumber": "2933",
                "englishNarrator": "A'isha (رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "She put on Ihram for, Umra and arrived 'at Mecca) but did not circumambulate the House as she had entered in the period of menses, and then put on Ihram for Hajj and performed all the rituals concerning it (except circumambulating the House). The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to her on the day of march (when pilgrims come to Mina): Your circumambulation would suffice both Hajj and Umra. She, however, felt reluctant. Thereupon the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sent her with 'Abdul-Rahman رضی اللہ تعالیٰ عنہ to Tan'im and she performed Umra (with separate rituals) after Hajj.",
                "hadithUrdu": "انھوں نے عمرے کا تلبیہ پکارا تھا مکہ پہنچیں ، ابھی بیت اللہ کا طواف نہیں کیا تھا کہ ایا م شروع ہو گئے ، انھوں نے حج کا تلبیہ کہا اور تمام مناسک ( حج ) ادا کیے ۔ واپسی کے دن نبی صلی اللہ علیہ وسلم نے ان سے ( مخاطب ہو کر ) فر مایا : \" تمھا را طواف تمھارے حج اور عمرے ( دونوں ) کے لیے کا فی ہے ۔ ( اب تمھیں مزید عمرے کی ضرورت نہیں ) \" مگر وہ نہ مانیں رسول اللہ صلی اللہ علیہ وسلم نے انھیں ( ان کے بھا ئی ) عبد الرحمٰن رضی اللہ تعالیٰ عنہ کے ساتھ تنعیم بھیجا اور انھوں نے حج کے بعد ( ایک اور ) عمرہ ادا کیا ۔",
                "urduNarrator": "ہم سے محمد بن حاتم نے بیان کیا، کہا ہم سے بہز نے بیان کیا، کہا ہم سے وہیب نے بیان کیا، کہا ہم سے عبداللہ نے بیان کیا, طاوس نے سیدہ عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا عَبْدُ اللهِ بْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ رَضِيَ اللهُ عَنْهَا، أَنَّهَا أَهَلَّتْ بِعُمْرَةٍ، فَقَدِمَتْ وَلَمْ تَطُفْ بِالْبَيْتِ حَتَّى حَاضَتْ، فَنَسَكَتِ الْمَنَاسِكَ كُلَّهَا، وَقَدْ أَهَلَّتْ بِالْحَجِّ، فَقَالَ لَهَا النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: يَوْمَ النَّفْرِ «يَسَعُكِ طَوَافُكِ لِحَجِّكِ وَعُمْرَتِكِ» فَأَبَتْ، فَبَعَثَ بِهَا مَعَ عَبْدِ الرَّحْمَنِ إِلَى التَّنْعِيمِ، فَاعْتَمَرَتْ بَعْدَ الْحَجِّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10498,
                "hadithNumber": "2934",
                "englishNarrator": "A'isha (رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "She entered in the monthly period at Sarif, and took bath at 'Arafa (after the period was over). The messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to her: Your circumambulation between al Safa and al-Marwa is enough for your Hajj and 'Umra.",
                "hadithUrdu": "انھیں مقام سرف سے ایام شروع ہو ئے پھر وہ عرفہ میں جا کر پاک ہو ئیں ۔ رسول اللہ صلی اللہ علیہ وسلم نے ان سے فرمایا تھا : \"\" تمھا ری طرف سے تمھارا صفا مروہ کا طواف تمھا رے حج اور عمرے ( دونوں ) کے لیے کا فی ہے ۔",
                "urduNarrator": "مجھ سے حسن بن علی الحلوانی نے بیان کیا، مجھ سے زید بن الحباب نے بیان کیا، مجھ سے ابراہیم بن نافع نے بیان کیا، مجھ سے عبداللہ بن ابی نجیح نے بیان کیا, مجا ہد نے حضرت عا ئشہ رضی اللہ تعالیٰ عنہاسے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنِي حَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، حَدَّثَنِي إِبْرَاهِيمُ بْنُ نَافِعٍ، حَدَّثَنِي عَبْدُ اللهِ بْنُ أَبِي نَجِيحٍ، عَنْ مُجَاهِدٍ، عَنْ عَائِشَةَ رَضِيَ اللهُ عَنْهَا، أَنَّهَا حَاضَتْ بِسَرِفَ فَتَطَهَّرَتْ بِعَرَفَةَ فَقَالَ لَهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «يُجْزِئُ عَنْكِ طَوَافُكِ بِالصَّفَا وَالْمَرْوَةِ، عَنْ حَجِّكِ وَعُمْرَتِكِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10499,
                "hadithNumber": "2935",
                "englishNarrator": "Safiyya bint Shaiba reported that 'A'isha ( رضی اللہ تعالیٰ عنہا) said:",
                "hadithEnglish": "Messenger of Allah ﷺ, the people are returning with two rewards whereas I am returning with one reward. Thereupon he commanded 'Abdul-Rahman bin Abu Bakr رضی اللہ تعالیٰ عنہ to take her to al-Tan'im. She ('A'isha رضی اللہ تعالیٰ عنہا) said: He seated me behind him on his camel. She (further) stated: I lifted my head covering and took it off from my neck. He struck my foot as if he was striking the camel. I said to him: Do you find anyone bere? She (further) said: I entered into the state of Ihram for 'Umra till we reached the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and he was at Hasba.",
                "hadithUrdu": "اے اللہ کے رسول صلی اللہ علیہ وسلم ! لو گ تو وہ ( عملوںکا ) ثواب لے کر لو ٹیں گے اور میں ( صرف ) ایک ( عمل کا ) ثواب لے کر لوٹوں ؟ تو ( عائشہ رضی اللہ تعالیٰ عنہا کی بات سن کر ) آپ نے عبد الرحمٰن بن ابی بکر رضی اللہ تعالیٰ عنہ کو حکم دیا کہ وہ انھیں ( حضرت عائشہ رضی اللہ تعالیٰ عنہا کو ) تنعیم تک لے جائے ۔ ( حضرت عائشہ رضی اللہ تعالیٰ عنہا نے ) کہا : چنانچہ عبد الرحمٰن رضی اللہ تعالیٰ عنہ نے اپنے اونٹ پر مجھے اپنے پیچھے سوار کر لیا ( راستے میں ) اپنی اوڑھنی کو اپنی گردن سے سر کا نے کے لیے ( بار بار ) اسے اوپر اٹھا تی تو ( عبد الرحمٰن رضی اللہ تعالیٰ عنہا ) سواری کو مارنے کے بہانے میرے پاؤں پر مارتے ( کہااوڑھنی کیوں اٹھا رہی ہیں؟ ) میں ان سے کہتی : آپ یہاں کسی ( اجنبی ) کو دیکھ رہے ہیں ؟ ( جو مجھے ایسا کرتا ہوا دیکھ لے گا ) فرماتی ہیں : میں نے ( وہاں سے ) عمرے کا احرا م باندھ کر ) تلبیہ پکارا ( اور عمرہ کیا ) پھر ہم ( واپس آئے حتی کہ رسول اللہ صلی اللہ علیہ وسلم کے پاس پہنچ گئے ۔ آپ ( اس وقت ) مقام حصبہ پر تھے ۔",
                "urduNarrator": "ہم سے یحییٰ بن حبیب الحارثی نے بیان کیا، ہم سے خالد بن حارث نے بیان کیا، ہم سے قرہ نے بیان کیا، ہم سے عبدالحمید بن جبیر بن شیبہ نے بیان کیا، ہم سے اس نے بیان کیا صفیہ بنت شیبہ نے بیان کیا ، کہا حضرت عائشہ رضی اللہ تعالیٰ عنہا نے عرض کی",
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا قُرَّةُ، حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جُبَيْرِ بْنِ شَيْبَةَ، حَدَّثَتْنَا صَفِيَّةُ بِنْتُ شَيْبَةَ، قَالَتْ: قَالَتْ عَائِشَةُ رَضِيَ اللهُ عَنْهَا يَا رَسُولَ اللهِ: أَيَرْجِعُ النَّاسُ بِأَجْرَيْنِ وَأَرْجِعُ بِأَجْرٍ؟ «فَأَمَرَ عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرٍ أَنْ يَنْطَلِقَ بِهَا إِلَى التَّنْعِيمِ»، قَالَتْ: فَأَرْدَفَنِي خَلْفَهُ عَلَى جَمَلٍ لَهُ، قَالَتْ: فَجَعَلْتُ أَرْفَعُ خِمَارِي أَحْسُرُهُ عَنْ عُنُقِي، فَيَضْرِبُ رِجْلِي بِعِلَّةِ الرَّاحِلَةِ، قُلْتُ لَهُ: وَهَلْ تَرَى مِنْ أَحَدٍ؟ قَالَتْ: فَأَهْلَلْتُ بِعُمْرَةٍ، ثُمَّ أَقْبَلْنَا حَتَّى انْتَهَيْنَا إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَهُوَ بِالْحَصْبَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10500,
                "hadithNumber": "2936",
                "englishNarrator": "Abdul-Rahman bin Abu Bakr رضی اللہ تعالیٰ عنہا reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) ordered him to mount A'isha behind him and enable her to (enter into the state of Ihram for 'Umra) at Tan'im.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے انھیں حکم دیا تھا کہ حضرت عائشہ رضی اللہ تعالیٰ عنہا کو ساتھ لے لیں اور انھیں مقام تنعیم سے عمرہ کروائیں ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابن نمیر نے بیان کیا، کہا: ہم سے سفیان نے عمرو رضی اللہ عنہ سے بیان کیا, عمرو بن اوس نے خبر دی کہ عبد الرحمٰن بن ابی بکر رضی اللہ تعالیٰ عنہ نے انھیں کہا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ نُمَيْرٍ، قَالَا: حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، أَخْبَرَهُ عَمْرُو بْنُ أَوْسٍ، أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرٍ: «أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَمَرَهُ أَنْ يُرْدِفَ عَائِشَةَ، فَيُعْمِرَهَا مِنَ التَّنْعِيمِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10501,
                "hadithNumber": "2937",
                "englishNarrator": "Jabir (رضی اللہ تعالیٰ عنہ) said:",
                "hadithEnglish": "We, in the state of lhram, came with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) for Hajj Mufrad (with the aim of Hajj only), and 'A'isha رضی اللہ تعالیٰ عنہا set out for Umra, and when we reached Sarif, she (Hadrat A'isha رضی اللہ تعالیٰ عنہا ) entered in the state of monthly period; we proceeded on till we reached (Mecca) and circumambulated the Ka'ba and ran between (al-Safa) and al-Marwa; and the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) commanded that one who amongst us had no sacrificial animal with him should put off Ihram. We said: What does this putting off imply? He said: Getting out completely from the state of lhram, (so we put off Ihram), and we turned to our wives and applied perfume and put on our clothes. and we were at a four night's distance from 'Arafa. And we again put on Ihram on the day of Tarwiya (8th of Dhu'l-Hijja). The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came to 'A'isha (رضی اللہ تعالیٰ عنہا) and found her weeping, and said: What is the matter with you? She said: The matter is that I have entered in the monthly period, and the people had put off lhram, but I did not and I did not circumambulate the House, and the people are going for Hajj now (but I can't go), whereupon he said: It is the matter which Allah has ordained for the daughters of Adam, so now take a bath and put on Ihram for Hajj. She ('A'isha رضی اللہ تعالیٰ عنہا ) did accordingly, and stayed at the places of staying till the monthly period was over. She then circumambulated the House, and (ran between) al-Safa and al-Marwa. He (the Holy Prophet) then said: Now both your Hajj and 'Umra are complete, whereupon she said: I feel in my mind that I did not circumambulate the House till I performed Hajj (I missed the circumambulation of 'Umra). Thereupon he (Allah's Apostle) said: 'Abdul-Rahman, take her to Tan'im (so as to enable her) to perform Umra (separately), and it was the night at Hasba.",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ اکیلے حج ( افرا د ) کا تلبیہ پکا رتے ہو ئے آئے اور حضرت عائشہ رضی اللہ تعالیٰ عنہا صرف عمرے کی نیت سے آئیں ۔ جب ہم مقام سرف پہنچے تو حضرت عائشہ رضی اللہ تعالیٰ عنہا کو ایام شروع ہو گئے حتی کہ جب ہم مکہ آئے تو ہم نے کعبہ اور صفا مروہ کا طواف کر لیا پھر آپ صلی اللہ علیہ وسلم نے ہمیں حکم دیا کہ ہم میں سے جس کسی کے ہمرا ہ قر با نی نہیں ، وہ ( احرا م چھوڑ کر ) حلت ( عدم احرا م کی حالت ) اختیا ر کرلے ۔ ہم نے پو چھا : کو ن سی حلت ؟آپ نے فرمایا : مکمل حلت ( احرا م کی تمام پابندیوں سے آزادی ۔ ) \" تو پھر ہم اپنی عورتوں کے پاس گئے خوشبو لگا ئی اور معمول کے ) کپڑے پہن لیے ۔ ( اور اس وقت ) ہمارے اور عرفہ ( کو روانگی ) کے درمیان چار راتیں باقی تھیں ۔ پھر ہم نے ترویہ والے دن ( آٹھ ذوالحجہ کو ) تلبیہ پکارا ۔ آپ صلی اللہ علیہ وسلم حضرت عائشہ رضی اللہ تعالیٰ عنہا کے خیمے میں دا خل ہو ئے تو انھیں روتا ہوا پا یا ۔ پوچھا : \" تمھا را کیا معاملہ ہے؟ انھوں نے جواب دیا : میرا معاملہ یہ ہے کہ مجھے ایام شروع ہو گئے ہیں ۔ لو گ حلال ( احرا م سے فارغ ) ہو چکے ہیں اور میں ابھی نہیں ہو ئی اور نہ میں نے ابھی بیت اللہ کا طواف کیا ہے لو گ اب حج کے لیے روانہ ہو رہے ہیں آپ نے فر ما یا : \" ( پریشان مت ہو ) یہ ( حیض ) ایسا معاملہ ہے جو اللہ نے آدم ؑ کی بیٹیوں کی قسم میں لکھ دیا ہے تم غسل کر لو اور حج کا ( احرا م باندھ کر ) تلبیہ پکارو ۔ \" انھوں نے ایسا ہی کیا اور وقوف کے ہر مقام پر وقوف کیا ( حاضری دی دعائیں کیں ) اور جب پا ک ہو گئیں تو عرفہ کے دن ) بیت اللہ اور صفا مروہ کا طواف کیا ۔ پھر آپ نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے ) فر ما یا : \" تم اپنے حج اور عمرے دونوں ( مکمل کر کے ان کے احرا م کی پابندیوں ) سے آزاد ہو چکی ہو ۔ انھوں نے کہا : اے اللہ کے رسول صلی اللہ علیہ وسلم !میرے دل میں ( ہمیشہ ) یہ کھٹکا رہے گا کہ میں حج کرنے تک بیت اللہ کا طواف نہیں کر سکی ۔ آپ نے فرمایا : \" اے عبد الرحمٰن! انھیں 0لے جاؤ اور ) تنعیم سے عمرہ کرا لاؤ ۔ اور یہ ( منیٰ سے واپسی پر ) حصبہ ( میں قیام والی رات کا واقعہ ہے ۔",
                "urduNarrator": "قتیبہ نے کہا : ہم سے لیث نے حدیث بیان کی ، انھوں نے ابو زبیر سے انھوں نے حضرت جا بر رضی اللہ تعالیٰ عنہ سے روایت کی کہ انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ رُمْحٍ، جَمِيعًا عَنِ اللَّيْثِ بْنِ سَعْدٍ، - قَالَ قُتَيْبَةُ: حَدَّثَنَا، لَيْثٌ - عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ رَضِيَ اللهُ عَنْهُ، أَنَّهُ قَالَ: أَقْبَلْنَا مُهِلِّينَ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِحَجٍّ مُفْرَدٍ، وَأَقْبَلَتْ عَائِشَةُ رَضِيَ اللهُ عَنْهَا، بِعُمْرَةٍ حَتَّى إِذَا كُنَّا بِسَرِفَ عَرَكَتْ، حَتَّى إِذَا قَدِمْنَا طُفْنَا بِالْكَعْبَةِ وَالصَّفَا وَالْمَرْوَةِ، فَأَمَرَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ يَحِلَّ مِنَّا مَنْ لَمْ يَكُنْ مَعَهُ هَدْيٌ، قَالَ فَقُلْنَا: حِلُّ مَاذَا؟ قَالَ: «الْحِلُّ كُلُّهُ» فَوَاقَعْنَا النِّسَاءَ، وَتَطَيَّبْنَا بِالطِّيبِ، وَلَبِسْنَا ثِيَابَنَا، وَلَيْسَ بَيْنَنَا وَبَيْنَ عَرَفَةَ إِلَّا أَرْبَعُ لَيَالٍ، ثُمَّ أَهْلَلْنَا يَوْمَ التَّرْوِيَةِ، ثُمَّ دَخَلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى عَائِشَةَ رَضِيَ اللهُ عَنْهَا، فَوَجَدَهَا تَبْكِي، فَقَالَ: «مَا شَأْنُكِ؟» قَالَتْ: شَأْنِي أَنِّي قَدْ حِضْتُ، وَقَدْ حَلَّ النَّاسُ، وَلَمْ أَحْلِلْ، وَلَمْ أَطُفْ بِالْبَيْتِ وَالنَّاسُ يَذْهَبُونَ إِلَى الْحَجِّ الْآنَ، فَقَالَ: «إِنَّ هَذَا أَمْرٌ كَتَبَهُ اللهُ عَلَى بَنَاتِ آدَمَ، فَاغْتَسِلِي، ثُمَّ أَهِلِّي بِالْحَجِّ» فَفَعَلَتْ وَوَقَفَتِ الْمَوَاقِفَ، حَتَّى إِذَا طَهَرَتْ طَافَتْ بِالْكَعْبَةِ وَالصَّفَا وَالْمَرْوَةِ، ثُمَّ قَالَ: «قَدْ حَلَلْتِ مِنْ حَجِّكِ وَعُمْرَتِكِ جَمِيعًا» فَقَالَتْ: يَا رَسُولَ اللهِ، إِنِّي أَجِدُ فِي نَفْسِي أَنِّي لَمْ أَطُفْ بِالْبَيْتِ حَتَّى حَجَجْتُ، قَالَ: «فَاذْهَبْ بِهَا، يَا عَبْدَ الرَّحْمَنِ، فَأَعْمِرْهَا مِنَ التَّنْعِيمِ» وَذَلِكَ لَيْلَةَ الْحَصْبَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10502,
                "hadithNumber": "2938",
                "englishNarrator": "Jabir bin Abdullah رضی اللہ تعالیٰ عنہما is reported to have said:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came to 'A'isha (رضی اللہ تعالیٰ عنہا) and she was weeping. The rest of the hadith is the same.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم حضرت عائشہ رضی اللہ تعالیٰ عنہا کے خیمے میں دا خل ہو ئے تو وہ رو رہی تھیں ۔ پھر ( آخر تک ) لیث کی روایت کردہ حدیث کے مانند روایت بیان کی ، لیکن لیث کی حدیث میں اس سے پہلے کا جو حصہ ہے وہ بیان نہیں کیا ۔",
                "urduNarrator": "مجھ سے محمد بن حاتم اور عبد بن حمید نے بیان کیا , ابن حاتم نے کہا : ہم سے انہوں نے بیان کیا اور عبد نے کہا : ہم سے محمد بن بکر نے بیان کیا ، انہوں نے کہا ابن جریج نے خبر دی کہا : مجھے ابو زبیر نے خبر دی ، انھوں نے جا بر بن عبد اللہ رضی اللہ تعالیٰ عنہما کو بیان کرتے سنا ، کہہ رہے تھے",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، وَعَبْدُ بْنُ حُمَيْدٍ - قَالَ ابْنُ حَاتِمٍ: حَدَّثَنَا، وَقَالَ عَبْدٌ: - أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ رَضِيَ اللهُ عَنْهُمَا، يَقُولُ: دَخَلَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى عَائِشَةَ رَضِيَ اللهُ عَنْهَا، وَهِيَ تَبْكِي، فَذَكَرَ بِمِثْلِ حَدِيثِ اللَّيْثِ إِلَى آخِرِهِ، وَلَمْ يَذْكُرْ مَا قَبْلَ هَذَا مِنْ حَدِيثِ اللَّيْثِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10503,
                "hadithNumber": "2939",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "A'isha ( رضی اللہ تعالیٰ عنہا) entered into the state of Ihram (separately) for 'Umra while the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was performing Hajj. The rest of the hadith is the same, but with this addition: The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was a person of gentle disposition, so when she (A'isha رضی اللہ تعالیٰ عنہا ) wished for a thing, he accepted it (provided it did not contravene the teachings of Islam). So he (in pursuance of her desire for a separate lhram for Umra) sent her with 'Abdul-Rahman bin Abu Bakr رضی اللہ تعالیٰ عنہ and she put on Ihram for 'Umra at al-Tan'im. Matar and Abu Zubair (the two narrators amongst the chain of transmitters) said: Whenever 'A'isha رضی اللہ تعالیٰ عنہا performed Hajj she did as she had done along with Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌).",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم کے حج ( حجۃ الوداع ) کے موقع پر حضرت عائشہ رضی اللہ تعالیٰ عنہا نے عمرے کا ( احرام باندھ کر ) تلبیہ پکارا تھا ۔ مطر نے آگے لیث کی حدیث کے ہم معنی حدیث بیان کی ، ( البتہ اپنی ) حدیث میں یہ اضا فہ کیا کہا : رسول اللہ صلی اللہ علیہ وسلم بہت نرم خوتھے ۔ وہ ( حضرت عائشہ رضی اللہ تعالیٰ عنہا ) جب بھی کو ئی خواہش کرتیں ، آپ اس میں ان کی بات مان لیتے ۔ لہٰذا آپ صلی اللہ علیہ وسلم نے انھیں عبد الرحمٰن بن ابی بکر رضی اللہ تعالیٰ عنہ کے ساتھ بھیجا اور انھوں نے تنعیم سے عمرے کا تلبیہ پکا را ( اور عمرہ ادا کیا ۔ ) مطرؒ نے کہا : ابو زبیر نے بیان کیا : ( آپ صلی اللہ علیہ وسلم وفات کے بعد ) حضرت عائشہ رضی اللہ تعالیٰ عنہا جب بھی حج فر ما تیں تو وہی کرتیں جو انھوں نے نبی صلی اللہ علیہ وسلم کی معیت میں کیا تھا ۔",
                "urduNarrator": "مجھ سے ابو غسان المسمعی نے بیان کیا، معاذ یعنی ابن ہشام نے بیان کیا، مجھ سے میرے والد نے بیان کیا, مطر نے ابو زبیر سے ، انھوں نے جا بر بن عبد اللہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنِي أَبُو غَسَّانَ الْمِسْمَعِيُّ، حَدَّثَنَا مُعَاذٌ يَعْنِي ابْنَ هِشَامٍ، حَدَّثَنِي أَبِي، عَنْ مَطَرٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، أَنَّ عَائِشَةَ رَضِيَ اللهُ عَنْهَا، فِي حَجَّةِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَهَلَّتْ بِعُمْرَةٍ، وَسَاقَ الْحَدِيثَ بِمَعْنَى حَدِيثِ اللَّيْثِ، وَزَادَ فِي الْحَدِيثِ: قَالَ: وَكَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ رَجُلًا سَهْلًا، إِذَا هَوِيَتِ الشَّيْءَ تَابَعَهَا عَلَيْهِ، فَأَرْسَلَهَا مَعَ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ فَأَهَلَّتْ بِعُمْرَةٍ مِنَ التَّنْعِيمِ. قَالَ مَطَرٌ: قَالَ أَبُو الزُّبَيْرِ: فَكَانَتْ عَائِشَةُ إِذَا حَجَّتْ صَنَعَتْ كَمَا صَنَعَتْ مَعَ نَبِيِّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10504,
                "hadithNumber": "2940",
                "englishNarrator": "Jabir (رضی اللہ تعالیٰ عنہ) said:",
                "hadithEnglish": "We went with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) in 'a state of Ihram for the Hajj. There were women and children with us. When we reached Mecca we circumambulated the House and (ran) between al-Safa and al-Marwa. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: He who has no sacrificial animal with him should put off lhram. We said: What kind of putting off? He said: Getting out of lhram completely. So we came to our wives, and put on our clothes and applied perfume. When it was the day of Tarwiya, we put on Ihram for Hajj. and the first circumambulation and (running) between al-Safa and al-Marwa sufficed us.. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) commanded us to become seven partners (in the sacrifice) of a camel and a cow.",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ حج کا تلبیہ پکا رتے ہو ئے نکلے ، ہمارے ساتھ عورتیں اور بچے بھی تھے ۔ جب ہم مکہ پہنچے تو ہم نے بیت اللہ اور صفا مروہ کا طواف کیا ۔ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں ارشاد فر ما یا : \" جس کے ہمرا ہ قر با نی کے جا نور نہیں ہیں وہ ( احرام سے ) آزاد ہو جا ئے ۔ \" ہم نے دریا فت کیا : کون سی آزادی ( حلت ) ؟ آپ نے فر ما یا : \" ( احرا مکی پابندیوں سے ) پوری آزادی ۔ \" ( حضرت جا بر رضی اللہ تعالیٰ عنہ نے ) کہا : ہم نے اپنی عورتوں سے قربت کی ، اپنے ( معمول کے ) لباس پہنے اور خوشبو ( کا بھی ) استعمال کیا ۔ جب ترویہ ( آٹھ ذوالحجہ ) کا دن آیا ہم نے حج کا ( احرا م باندھ کر ) تلبیہ پکارنا شروع کیا اور ہمیں ( حج قران کرنے والوں کو ) صفا مروہ کے در میان پہلا طواف ( سعی مراد ہے ) ہی کا فی ہو گیا ۔ ( ہمیں ) رسول اللہ صلی اللہ علیہ وسلم نے ( یہ بھی ) حکم دیا کہ گائے اور اونٹ کی قربانی میں ہم سات سات افراد شریک ہو جا ئیں ۔",
                "urduNarrator": "ہم سے احمد بن یونس نے بیان کیا، ہم سے زہیر نے بیان کیا، ہم سے ابو الزبیر نے جابر رضی اللہ عنہ سے بیان کیا اور ہم سے یحییٰ بن یحییٰ نے بیان کیا - ابو الزبیر کی روایت سے ابو خیثمہ نے ہم سے بیان کیا, انھوں نے جا بر رضی اللہ تعالیٰ عنہ سے روایت کی کہا",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ رَضِيَ اللهُ عَنْهُ، ح وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، - وَاللَّفْظُ لَهُ - أَخْبَرَنَا أَبُو خَيْثَمَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ رَضِيَ اللهُ عَنْهُ، قَالَ: خَرَجْنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مُهِلِّينَ بِالْحَجِّ، مَعَنَا النِّسَاءُ وَالْوِلْدَانُ، فَلَمَّا قَدِمْنَا مَكَّةَ طُفْنَا بِالْبَيْتِ وَبِالصَّفَا وَالمَرْوَةِ، فَقَالَ لَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ لَمْ يَكُنْ مَعَهُ هَدْيٌ فَلْيَحْلِلْ» قَالَ قُلْنَا: أَيُّ الْحِلِّ؟ قَالَ: «الْحِلُّ كُلُّهُ» قَالَ: فَأَتَيْنَا النِّسَاءَ، وَلَبِسْنَا الثِّيَابَ، وَمَسِسْنَا الطِّيبَ، فَلَمَّا كَانَ يَوْمُ التَّرْوِيَةِ أَهْلَلْنَا بِالْحَجِّ، وَكَفَانَا الطَّوَافُ الْأَوَّلُ بَيْنَ الصَّفَا وَالْمَرْوَةِ، فَأَمَرَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ نَشْتَرِكَ فِي الْإِبِلِ وَالْبَقَرِ، كُلُّ سَبْعَةٍ مِنَّا فِي بَدَنَةٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10505,
                "hadithNumber": "2941",
                "englishNarrator": "Jabir bin Abdullah رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) ordered us to put on Ihram (again) as we proceeded towards Mina after we had put it off (i.e. 'on the 8th of Dhu'l-Hijja). So we pronounced Talbiya at al-Abtah.",
                "hadithUrdu": "جب ہم \" حلت \" \" کی کیفیت میں آگئے تو رسول اللہ صلی اللہ علیہ وسلم نے ہمیں حکم دیا کہ جب منیٰ کا رخ کرنے لگیں تو احرا م باند ھ لیں ۔ ( حضرت جا بر رضی اللہ تعالیٰ عنہ نے ) کہا : تو ہم نے مقام ابطح سے تلبیہ پکارنا شروع کیا ۔",
                "urduNarrator": "مجھ سے محمد بن حاتم نے بیان کیا، کہا ہم سے یحییٰ بن سعید نے بیان کیا, ابن جریج سے روایت ہے ( کہا : ) مجھے ابو زبیر نے جا بربن عبد اللہ رضی اللہ تعالیٰ عنہ سے خبر دی کہا",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ رَضِيَ اللهُ عَنْهُمَا، قَالَ: أَمَرَنَا النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لَمَّا أَحْلَلْنَا، أَنْ نُحْرِمَ إِذَا تَوَجَّهْنَا إِلَى مِنًى، قَالَ: فَأَهْلَلْنَا مِنَ الْأَبْطَحِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10506,
                "hadithNumber": "2942",
                "englishNarrator": "Jabir bin Abdullah رضی اللہ عنہ is reported to have said:",
                "hadithEnglish": "Neither Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم) nor his Companions (circumambulated the Ka'ba and) ran between al-Safa and al-Marwa but once (sufficing both for Hajj and 'Umra). But in the hadith transmitted by Muhammad bin Bakr there is an addition: That is first circumambulation.\r\nThe Prophet and his companions only went between As-Safa aand Al-Marwah once.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم اور آپ کے اصحاب صفا اور مروہ کے درمیان صرف ایک بار گئے۔\" محمد بن بکر کی حدیث میں یہ اضافہ ہوا ہے: آپ کا  پہلاطواف۔",
                "urduNarrator": "ہم سے محمد بن حاتم نے بیان کیا، کہا ہم سے یحییٰ بن سعید نے بیان کیا، انہوں نے ابن جریج سے، اور ہم سے عبد بن حمید نے بیان کیا، کہا کہ ہم سے محمد بن بکر نے بیان کیا، ان سے ابن جریج نے، کہا: مجھ سے ابو الزبیر نے بیان کیا کہ انہوں نے جابر بن رضی اللہ عنہ سے سنا۔ عبداللہ رضی اللہ عنہ نے کہا",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنِ ابْنِ جُرَيْجٍ، ح وحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ: أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ رَضِيَ اللهُ عَنْهُ، يَقُولُ: «لَمْ يَطُفِ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَلَا أَصْحَابُهُ بَيْنَ الصَّفَا وَالْمَرْوَةِ إِلَّا طَوَافًا وَاحِدًا» زَادَ فِي حَدِيثِ مُحَمَّدِ بْنِ بَكْرٍ: طَوَافَهُ الْأَوَّلَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10507,
                "hadithNumber": "2943",
                "englishNarrator": "Ata' reported: I, along with some people, heard Jabir bin 'Abdullah رضی اللہ تعالیٰ عنہ saying:",
                "hadithEnglish": "We the Companions of Muhammad ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) put on Ihram for Hajj only. Ata' further said that Jabir stated: Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came on the 4th of Dhu'l-Hijja and he commanded us to put off Ihram. 'Ata' said that he (Allah's Apostle) commanded them to put off Ihram and to go to their wives (for intercourse). 'Ata' said: It was not obligatory for them, but (intercourse) with them had become permissible. We said: When only five days had been left to reach 'Arafa, he (the Holy Prophet) commanded us to have intercourse with our wives. And we reached 'Arafa in a state as if we had just had intercourse (with them). He ('Ata') said: Jabir رضی اللہ تعالیٰ عنہ pointed with his hand and I (perceive) as if I am seeing his hand as it moved. In the (meantime) the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) stood amongst us and said: You are well aware that I am the most God-fearing, most truthful and most pious amongst you. And if there were not sacrificial animals with me, I would also have put off Ihram as you have put off. And if I were to know this matter of mine what I have come to know later on, I would not have brought sacrificial animals with me. So they (the Companions) put off Ihram and we also put it off and listened to (the Holy Prophet) and obeyed (his command). Jabir رضی اللہ تعالیٰ عنہ said: 'Ali رضی اللہ تعالیٰ عنہ came with the revenue of the taxes (from Yemen). He (the Holy Prophet) said: For what (purpose) have you entered into the state of Ihram (whether you entered into the state purely for Hajj and, Umra jointly or Hajj and Umra separately)? He said: For the purpose for which the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) had entered. (The Prophet had entered as a Qiran, i.e. Ihram covering both Umra and Hajj simultaneously.) Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Offer a sacrifice of animal, and retain Ihram. And 'Ali رضی اللہ تعالیٰ عنہ brought a sacrificial animal for him (for the Holy Prophet). Suraqa bin Malik bin Ju'shum رضی اللہ تعالیٰ عنہ said: Messenger of Allah, is it (this concession putting off Ihram of Hajj or Umra) meant for this year or is it forever? He said: It is forever.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم چار ذوالحجہ کی صبح مکہ پہنچے تھے ۔ آپ نے ہمیں حکم دیا کہ ہم حلال ( احرا م کی پابندیوں سے فا رغ ) ہو جا ئیں ۔ عطاء نے بیان کیا کہ آپ صلی اللہ علیہ وسلم نے فر مایا تھا : \"\" حلال ہو جاؤ اور اپنی عورتوں کے پاس جاؤ ۔ عطا ء نے کہا : ( عورتوں کی قربت ) آپ نے ان پر لا زم قرار نہیں دی تھی بلکہ بیویوں کو ان کے لیے صرف حلال قراردیا تھا ۔ ہم نے کہا : جب ہمارے اور یوم عرفہ کے درمیان محض پانچ دن باقی ہیں آپ نے ہمیں اپنی عورتوں کے پاس جا نے کی اجازت مرحمت فر ما دی ہے تو ( یہ ایسا ہی ہے کہ ) ہم ( اس ) عرفہ آئیں گے تو ہمارے اعضا ئے مخصوصہ سے منی کے قطرے ٹپک رہے ہوں گے ۔ عطاء نے کہا جابر رضی اللہ تعالیٰ عنہ اپنے ہاتھ سے ( ٹپکنے کا اشارہ کر رہے تھے ۔ ایسا لگتا ہے میں اب بھی ان کے حرکت کرتے ہاتھ کا اشارہ دیکھ رہا ہوں ۔ جا بر رضی اللہ تعالیٰ عنہ نے کہا نبی صلی اللہ علیہ وسلم ( خطبہ دینے کے لیے ) ہم میں کھڑے ہو ئے اور فر ما یا : \"\" تم ( اچھی طرح ) جا نتے ہو کہ میں تم سب سے زیادہ اللہ سے ڈرنے والا ، تم سب سے زیادہ سچا اور تم سب سے زیادہ پارسا ہوں ۔ اگر میرے ساتھ قر بانی نہ ہو تی تو میں بھی ویسے حلال ( احرا م سے فارغ ) ہو جا تا جیسے تم حلال ہو ئے ہو ، اگر وہ چیز پہلے میرے سامنے آجا تی جو بعد میں آئی تو میں قربانی اپنے ساتھ نہ لا تا ، لہٰذا تم سب حلال ( احرا م سے فارغ ) ہو جاؤ ۔ چنانچہ پھر ہم حلال ہو گئے ۔ ہم نے ( آپ صلی اللہ علیہ وسلم کی بات کو ) سنا اور اطاعت کی ۔ عطاء نے کہا : حضرت جابر رضی اللہ تعالیٰ عنہ نے بیان کیا : ( اتنے میں ) حضرت علی رضی اللہ تعالیٰ عنہ اپنی ذمہ داری سے ( عہد ہبر آہو کر ) پہنچ گئے ۔ آپ صلی اللہ علیہ وسلم نے ( ان سے ) پو چھا : ( علی ) تم نے کس ( حج ) کا تلبیہ پکا را تھا ؟ \"\" انھوں نے جواب دیا : جس کا نبی صلی اللہ علیہ وسلم نے پکارا ۔ رسول اللہ صلی اللہ علیہ وسلم نے ان سے فرمایا : \"\" قربانی کرو اور احرا م ہی کی حالت میں رہو ۔ ( جا بر رضی اللہ تعالیٰ عنہ نے ) بیان کیا : حضرت علی رضی اللہ تعالیٰ عنہ رسول اللہ صلی اللہ علیہ وسلم کے لیے بھی اپنے ہمراہ قربانی ( کے جا نور ) لا ئے تھے ۔ سراقہ بن مالک بن جعشم رضی اللہ تعالیٰ عنہ نے دریافت کیا اے اللہ کے رسول اللہ صلی اللہ علیہ وسلم !یہ ( حج کے مہینوں میں عمرہ کرنا ) صرف ہمارے اسی سال کے لیے ( جا ئز ہوا ) ہے یا ہمیشہ کے لیے ؟آپ نے فرمایا : \"\" ہمیشہ کے لیے ۔",
                "urduNarrator": "مجھ سے محمد بن حاتم نے بیان کیا، ہم سے یحییٰ بن سعید نے بیان کیا، ان سے ابن جریج نے بیان کیا، ان سے عطاء نے بیان کیا، انہوں نے کہا: میں نے جابر بن عبداللہ رضی اللہ عنہما کو سنا، ان سے اللہ تعالیٰ راضی ہے، مجھ سے لوگوں نے کہا: ہم نے محمد صلی اللہ علیہ وسلم کے اصحاب نے حج کو خالص اور تنہا کیا ہے، عطاء نے فرمایا",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي عَطَاءٌ، قَالَ: سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللهِ رَضِيَ اللهُ عَنْهُمَا، فِي نَاسٍ مَعِي قَالَ: أَهْلَلْنَا، أَصْحَابَ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، بِالْحَجِّ خَالِصًا وَحْدَهُ، قَالَ عَطَاءٌ: قَالَ جَابِرٌ: فَقَدِمَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ صُبْحَ رَابِعَةٍ مَضَتْ مِنْ ذِي الْحِجَّةِ، فَأَمَرَنَا أَنْ نَحِلَّ، قَالَ عَطَاءٌ: قَالَ «حِلُّوا وَأَصِيبُوا النِّسَاءَ» قَالَ عَطَاءٌ: وَلَمْ يَعْزِمْ عَلَيْهِمْ، وَلَكِنْ أَحَلَّهُنَّ لَهُمْ، فَقُلْنَا: لَمَّا لَمْ يَكُنْ بَيْنَنَا وَبَيْنَ عَرَفَةَ إِلَّا خَمْسٌ، أَمَرَنَا أَنْ نُفْضِيَ إِلَى نِسَائِنَا، فَنَأْتِيَ عرَفَةَ تَقْطُرُ مَذَاكِيرُنَا الْمَنِيَّ، قَالَ: يَقُولُ جَابِرٌ بِيَدِهِ - كَأَنِّي أَنْظُرُ إِلَى قَوْلِهِ بِيَدِهِ يُحَرِّكُهَا - قَالَ: فَقَامَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِينَا، فَقَالَ: «قَدْ عَلِمْتُمْ أَنِّي أَتْقَاكُمْ لِلَّهِ وَأَصْدَقُكُمْ وَأَبَرُّكُمْ، وَلَوْلَا هَدْيِي لَحَلَلْتُ كَمَا تَحِلُّونَ، وَلَوْ اسْتَقْبَلْتُ مِنْ أَمْرِي مَا اسْتَدْبَرْتُ لَمْ أَسُقِ الْهَدْيَ، فَحِلُّوا» فَحَلَلْنَا وَسَمِعْنَا وَأَطَعْنَا، قَالَ عَطَاءٌ: قَالَ جَابِرٌ: فَقَدِمَ عَلِيٌّ مِنْ سِعَايَتِهِ، فَقَالَ: «بِمَ أَهْلَلْتَ؟» قَالَ: بِمَا أَهَلَّ بِهِ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ لَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «فَأَهْدِ وَامْكُثْ حَرَامًا» قَالَ: وَأَهْدَى لَهُ عَلِيٌّ هَدْيًا، فَقَالَ سُرَاقَةُ بْنُ مَالِكِ بْنِ جُعْشُمٍ: يَا رَسُولَ اللهِ، أَلِعَامِنَا هَذَا أَمْ لِأَبَدٍ؟ فَقَالَ: «لِأَبَدٍ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10508,
                "hadithNumber": "2944",
                "englishNarrator": "Jabir bin 'Abdullah (رضی اللہ تعالیٰ عنہما) reported:",
                "hadithEnglish": "We entered with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) in the state of Ihram for Hajj. When we came to Mecca he commanded us to put off Ihram and make it for 'Umra. We felt it (the command) hard for us, and our hearts were anguished on account of this and it (this reaction of the people) reached the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). We do not know whether he received (this news) from the Heaven (through revelation) or from the people. (Whatever the case might be) he said; O people, put off Ihram. If there were not the sacrificial animals with me, I would have done as you do. So we put off the Ihram (after performing Umra), and we had intercourse with our wives and did everything which a non-Muhrim does (applying perfume, putting on clothes, etc.), and when It was the day of Tarwiya (8th of Dhu'l-Hijja) we turned our back to Mecca (in order to go to Mini, 'Arafat) and we put on lhram for Hajj.",
                "hadithUrdu": "ہم نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ حج کا ( احرا م باندھ کر ) تلبیہ کہا ۔ جب ہم مکہ پہنچے تو آپ صلی اللہ علیہ وسلم نے ہمیں حکم دیا کہ ہم حلال ہو جا ئیں اور اسے ( حج کی نیت کو ) عمرے میں بدل دیں ، یہ بات ہمیں بہت گراں ( بڑی ) لگی اور اس سے ہمارے دل بہت تنگ ہو ئے ( ہمارے اس قلق کی خبر ) نبی صلی اللہ علیہ وسلم کو پہنچ گئی ۔ معلوم نہیں کہ آپ کو آسمان سے ( بذریعہ وحی ) اس چیز کی خبر پہنچی یا لوگوں کے ذریعے سے کو ئی چیز معلوم ہوئی ۔ آپ نے فرمایا : \"\" اے لوگو !حلال ہو جاؤ ( احرا م کھول دو ) اگر میرے ساتھ قربانی نہ ہوتی تو میں بھی وہی کرتا جس طرح تم نے کیا ہے ( جابر رضی اللہ تعالیٰ عنہ نے ) بیان کیا : ہم حلال ( احرا م سےآزاد ) ہو گئے حتی کہ اپنی بیویوں سے قربت بھی کی اور ( وہ سب کچھ ) کیا جو حلال ( احرا م کے بغیر ) انسان کرتا ہے ۔ حتی کہ ترویہ کا دن ( آٹھ ذوالحجہ ) آگیا ۔ اور ہم نے مکہ کو پیچھے چھوڑ ا ( خیر باد کہا ) اور حج کا ( احرا م باند ھ کر ) تلبیہ کہنے لگے ۔",
                "urduNarrator": "ہم سے ابن نمیر نے بیان کیا، مجھ سے میرے والد نے بیان کیا، انہوں نے کہا عبد الملک بن ابی سلیمان نے عطا ء سے انھوں نے جابر بن عبداللہ رضی اللہ تعالیٰ عنہما سے روایت کی کہا",
                "hadithArabic": "حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنِي أَبِي، حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ أَبِي سُلَيْمَانَ، عَنْ عَطَاءٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ رَضِيَ اللهُ عَنْهُمَا، قَالَ: أَهْلَلْنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِالْحَجِّ، فَلَمَّا قَدِمْنَا مَكَّةَ أَمَرَنَا أَنْ نَحِلَّ وَنَجْعَلَهَا عُمْرَةً، فَكَبُرَ ذَلِكَ عَلَيْنَا، وَضَاقَتْ بِهِ صُدُورُنَا، فَبَلَغَ ذَلِكَ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَمَا نَدْرِي أَشَيْءٌ بَلَغَهُ مِنَ السَّمَاءِ أَمْ شَيْءٌ مِنْ قِبَلِ النَّاسِ، فَقَالَ: «أَيُّهَا النَّاسُ، أَحِلُّوا، فَلَوْلَا الْهَدْيُ الَّذِي مَعِي، فَعَلْتُ كَمَا فَعَلْتُمْ» قَالَ: فَأَحْلَلْنَا حَتَّى وَطِئْنَا النِّسَاءَ، وَفَعَلْنَا مَا يَفْعَلُ الْحَلَالُ، حَتَّى إِذَا كَانَ يَوْمُ التَّرْوِيَةِ، وَجَعَلْنَا مَكَّةَ بِظَهْرٍ، أَهْلَلْنَا بِالْحَجِّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10509,
                "hadithNumber": "2945",
                "englishNarrator": "Musa bin Nafi reported:",
                "hadithEnglish": "I came to Mecca as a Mutamattil for Umra (performing Umra first and then putting off Ihram and again entering into the state of Ihram for Hajj) four days before the day of Tarwiya (i.e. on the 4th of Dhu'l-Hijja). Thereupon the people said: Now yours is the Hajj of the Meccans. I went to 'Ata' bin Abi Rabah and asked his religious verdict. Ata' said: Jabir bin 'Abdullah al 'Ansari (رضی اللہ تعالیٰ عنہ) narrated to me that he performed Hajj with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) in the year when he took sacrificial animals with him (i.e. during the 10th year of Hijra known as the Farewell Pilgrimage) and they had put on Ihram for Hajj only (as Mufrid). The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Put off Ihram and circumambulate the House, and (run) between al-Safa and al-Marwa, and get your hair cut and stay as non-Muhrims. When it was the day of Tarwiya, then put on Ihram for Hajj and make lhram for Mut'a (you had put on Ihram for Hajj, but take it off after performing Umra and then again put on Ihram for Hajj). They said: How should we make it Mut'a although we entered upon lhram in the name of Hajj? He said: Do whatever I command you to do. Had I not brought sacrificial animals with me, I would have done as I have commanded you to do. But it is not permissible for me to put off Ihram till the sacrifice is offered. Then they also did accordingly.",
                "hadithUrdu": "میں عمرے کی نیت سے یو م ترویہ ( آٹھ ذوالحجہ ) سے چار دن پہلے مکہ پہنچا لوگوں نے کہا : اب تو تمھا رمکی حج ہو گا ۔ ( میں ان کی باتیں سن کر ) عطاء بن ابی رباح کے ہاں حاضر ہوا اور ان سے ( اس مسئلے کے بارے میں ) فتویٰ پوچھا ۔ عطاء نے جواب دیا : مجھے حضرت جابر بن عبد اللہ رضی اللہ تعالیٰ عنہ نے حدیث سنائی کہ انھوں نے اُس سال رسول اللہ صلی اللہ علیہ وسلم کے ساتھ حج کی سعادت حاصل کی تھی لوگوں نے حج افراد کا ( احرا م باند ھ کر ) تلبیہ کہا ۔ رسول اللہ صلی اللہ علیہ وسلم نے ان سے فر مایا : \"\" اپنے احرا م سے فارغ ہو جاؤ ۔ بیت اللہ کا اور صفا و مروہ کا طواف ( سعی کرو ۔ اپنے بال چھوٹے کرو الو اورحلال ( احرام سے آزاد ) ہو جاؤ جب تویہ ( آٹھ ذوالحجہ ) کا دن آجا ئے تو حج کا ( احرا م باندھ کر ) تلبیہ کہو ۔ اور ( حج افراد کو ) جس کے لیے تم آئے تھے اسے حج تمتع بنا لو ۔ صحابہ کرام رضوان اللہ عنھم اجمعین نے کہا : ( اے رسول اللہ صلی اللہ علیہ وسلم ! ) ہم اسے کیسے حج تمتع بنا لیں ؟ہم نے تو صرف حج کا نام لے کر تلبیہ کہا تھا آپ نے فر مایا : \"\" میں نے تمھیں جو حکم دیا ہے وہی کرو ۔ اگر میں اپنے ساتھ قربانی نہ لاتا تو اسی طرح کرتا جس طرح تمھیں حکم دے رہا ہوں ۔ لیکن مجھ پر ( احرام کی وجہ سے ) حرام کردہ چیزیں اس وقت تک حلال نہیں ہو ں گی جب تک کہ قربانی اپنی قربان گا ہ میں نہیں پہنچ جا تی ۔ اس پر لوگوں نے ویسا ہی کیا ( جس کا آپ نے حکم دیا تھا ).",
                "urduNarrator": "ہم سے ابن نمیر نے بیان کیا، کہا ہم سے ابو نعیم نے بیان کیا، انہوں نے کہا موسیٰ بن نافع نے کہا",
                "hadithArabic": "وحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا مُوسَى بْنُ نَافِعٍ، قَالَ: قَدِمْتُ مَكَّةَ مُتَمَتِّعًا بِعُمْرَةٍ، قَبْلَ التَّرْوِيَةِ بِأَرْبَعَةِ أَيَّامٍ، فَقَالَ النَّاسُ: تَصِيرُ حَجَّتُكَ الْآنَ مَكِّيَّةً، فَدَخَلْتُ عَلَى عَطَاءِ بْنِ أَبِي رَبَاحٍ فَاسْتَفْتَيْتُهُ، فَقَالَ عَطَاءٌ: حَدَّثَنِي جَابِرُ بْنُ عَبْدِ اللهِ الْأَنْصَارِيُّ رَضِيَ اللهُ عَنْهُمَا، أَنَّهُ حَجَّ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَامَ سَاقَ الْهَدْيَ مَعَهُ، وَقَدْ أَهَلُّوا بِالْحَجِّ مُفْرَدًا، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَحِلُّوا مِنْ إِحْرَامِكُمْ، فَطُوفُوا بِالْبَيْتِ وَبَيْنَ الصَّفَا وَالْمَرْوَةِ، وَقَصِّرُوا، وَأَقِيمُوا حَلَالًا حَتَّى إِذَا كَانَ يَوْمُ التَّرْوِيَةِ فَأَهِلُّوا بِالْحَجِّ، وَاجْعَلُوا الَّتِي قَدِمْتُمْ بِهَا مُتْعَةً» قَالُوا: كَيْفَ نَجْعَلُهَا مُتْعَةً وَقَدْ سَمَّيْنَا الْحَجَّ؟ قَالَ: «افْعَلُوا مَا آمُرُكُمْ بِهِ، فَإِنِّي لَوْلَا أَنِّي سُقْتُ الْهَدْيَ، لَفَعَلْتُ مِثْلَ الَّذِي أَمَرْتُكُمْ بِهِ، وَلَكِنْ لَا يَحِلُّ مِنِّي حَرَامٌ، حَتَّى يَبْلُغَ الْهَدْيُ مَحِلَّهُ» فَفَعَلُوا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10510,
                "hadithNumber": "2946",
                "englishNarrator": "Jabir bin 'Abdullah (رضی اللہ تعالیٰ عنہما) reported:",
                "hadithEnglish": "We set out with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as Muhrim for Hajj. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) commanded us to make this Ihram for Umra, and some put it off (after performing 'Umra), but the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had sacrificial animals with him, so he could not make it (this Ihram) as that of Umra.",
                "hadithUrdu": "ہم حج کا تلبیہ کہتے ہو ئے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ( مکہ ) آئے آپ نے ہمیں حکم دیا کہ ہم اس ( حج کی نیت اور احرا م کو ) عمرے میں بدل دیں اور ( عمرے کے بعد ) حلال ( عمرے سے فارغ ) ہو جائیں ( حضرت جابر رضی اللہ تعالیٰ عنہ نے ) کہا : آپ صلی اللہ علیہ وسلم کے ساتھ قربانی تھی اس لیے آپ اپنے حج کو عمرہ نہیں بنا سکتے تھے ۔",
                "urduNarrator": "ہم سے محمد بن معمر بن ربعی القیسی نے بیان کیا، ان سے ابو ہشام المغیرہ بن سلمہ المخزومی نے بیان کیا، انہوں نے ابو عوانہ کی سند سے, ابو بشر نے عطاء بن ابی رباح سے انھوں نے جا بر بن عبد اللہ رضی اللہ تعالیٰ عنہما سے روایت کی کہا",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ مَعْمَرِ بْنِ رِبْعِيٍّ الْقَيْسِيُّ، حَدَّثَنَا أَبُو هِشَامٍ الْمُغِيرَةُ بْنُ سَلَمَةَ الْمَخْزُومِيُّ، عَنْ أَبِي عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ رَضِيَ اللهُ عَنْهُمَا، قَالَ: قَدِمْنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مُهِلِّينَ بِالْحَجِّ، فَأَمَرَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ نَجْعَلَهَا عُمْرَةً وَنَحِلَّ، قَالَ: وَكَانَ مَعَهُ الْهَدْيُ، فَلَمْ يَسْتَطِعْ أَنْ يَجْعَلَهَا عُمْرَةً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10511,
                "hadithNumber": "2947",
                "englishNarrator": "Abu Nadra reported:",
                "hadithEnglish": "Ibn 'Abbas رضی اللہ تعالیٰ عنہ commanded the performance of Mut'a putting ihram for 'Umra during the months of Dhul-Hijja and after completing it. then putting on Ihram for Hajj), but Ibn Zubair رضی اللہ تعالیٰ عنہ forbade to do it. I made a mention of it to Jabir bin Abdullah رضی اللہ تعالیٰ عنہ and he said: It is through me that this hadith has been circulated. We entered into the state of Ihram as Tamattu' with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). When 'Umar رضی اللہ تعالیٰ عنہ was Installed as Caliph, he said: Verily Allah made permissible for His Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) whatever He liked and as Re liked. And (every command) of the Holy Qur'an has been revealed for every occasion. So accomplish Hajj and Umra for Allah as Allah has commanded you; and confirm by (proper conditions) the marriage of those women (with whom you have performed Mut'a). And any person would come to me with a marriage of appointed duration (Mut'a), I would stone him (to death).",
                "hadithUrdu": "ابن عباس رضی اللہ تعالیٰ عنہ حج تمتع کا حکم دیا کر تے تھے اور ابن زبیر رضی اللہ تعالیٰ عنہ اس سے منع فرماتے تھے ۔ ( ابو نضرہ نے ) کہا : میں نے اس چیز کا ذکر جابر بن عبداللہ انصاری رضی اللہ تعالیٰ عنہ سے کیا ، انھوں نے فرمایا : \" میرے ہی ذریعے سے ( حج کی ) یہ حدیث پھیلی ہے ۔ ہم نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ( جاکر ) حج تمتع کیا تھا ۔ جب حضرت عمر رضی اللہ تعالیٰ عنہ ( خلیفہ بن کر ) کھڑے ہوئے ( بحیثیت خلیفہ خطبہ دیا ) توا نھوں نے فرمایا : بلاشبہ اللہ تعالیٰ اپنے رسول صلی اللہ علیہ وسلم کے لئے جو چیز جس ذریعے سے چاہتا حلال کردیتاتھا اور بلا شبہ قرآن نے جہاں جہاں ( جس جس معاملے میں ) اترناتھا ، اتر چکا ، لہذا تم اللہ کے لئے حج کو اور عمرے کو مکمل کرو ، جس طرح ( الگ الگ نام لے کر ) اللہ تعالیٰ نے تمھیں حکم دیا ہے ۔ اوران عورتوں سے حتمی طور پرنکاح کیا کرو ( جز وقتی نہیں ) ، اگر میرے پاس کوئی ایسا شخص لایاگیا جس نے کسی عورت سے کسی خاص مدت تک کے لئے نکاح کیا ہوگا تو میں اسے پتھروں سے رجم کروں گا ۔",
                "urduNarrator": "ہم سے محمد بن المثنی اور ابن بشار نے بیان کیا، انہوں نے کہا: ہم سے محمد بن جعفر نے بیان کیا, شعبہ نے کہا : میں نے قتادہ سے سنا ، وہ ابو نضرہ سے حدیث بیان کررہے تھے ، کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَ ابْنُ الْمُثَنَّى: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ: سَمِعْتُ قَتَادَةَ، يُحَدِّثُ عَنْ أَبِي نَضْرَةَ، قَالَ: كَانَ ابْنُ عَبَّاسٍ يَأْمُرُ بِالْمُتْعَةِ، وَكَانَ ابْنُ الزُّبَيْرِ يَنْهَى عَنْهَا، قَالَ: فَذَكَرْتُ ذَلِكَ لِجَابِرِ بْنِ عَبْدِ اللهِ، فَقَالَ: عَلَى يَدَيَّ دَارَ الْحَدِيثُ، «تَمَتَّعْنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ»، فَلَمَّا قَامَ عُمَرُ قَالَ: إِنَّ اللهَ كَانَ يُحِلُّ لِرَسُولِهِ مَا شَاءَ بِمَا شَاءَ، وَإِنَّ الْقُرْآنَ قَدْ نَزَلَ مَنَازِلَهُ، فَ {أَتِمُّوا الْحَجَّ وَالْعُمْرَةَ لِلَّهِ} [البقرة: 196]، كَمَا أَمَرَكُمُ اللهُ، وَأَبِتُّوا نِكَاحَ هَذِهِ النِّسَاءِ، فَلَنْ أُوتَى بِرَجُلٍ نَكَحَ امْرَأَةً إِلَى أَجَلٍ، إِلَّا رَجَمْتُهُ بِالْحِجَارَةِ.",
                "headingArabic": "فِي الْمُتْعَةِ بِالْحَجِّ وَالْعُمْرَةِ ‏",
                "headingUrdu": "حج اور عمرہ کے ساتھ تمتع",
                "headingEnglish": "Tamattu with Hajj and Umrah",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10512,
                "hadithNumber": "2948",
                "englishNarrator": "Qatada narrated this hadith with the same chain of transmitters saying: (That 'Umar also said):",
                "hadithEnglish": "Separate your Hajj from 'Umra, for that is the most complete Hajj, and complete your Umra.",
                "hadithUrdu": "اپنے حج کو اپنے عمرے سے الگ ( ادا کیا ) کرو ۔ بلا شبہ یہ تمھارے حج کو اور تمھارے عمرے کو زیادہ مکمل کرنے والا ہے ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، ہم سے عفان نے بیان کیا، ہمیں ہمام نے حدیث سنائی ، انھوں نے کہا : ہمیں قتادہ نے اسی ( مذکورہ بالا ) سندسے حدیث بیا ن کی ، اور ( اپنی ) حدیث میں کہا",
                "hadithArabic": "وحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ بِهَذَا الْإِسْنَادِ، وَقَالَ فِي الْحَدِيثِ: فَافْصِلُوا حَجَّكُمْ مِنْ عُمْرَتِكُمْ، فَإِنَّهُ أَتَمُّ لِحَجِّكُمْ، وَأَتَمُّ لِعُمْرَتِكُمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10513,
                "hadithNumber": "2949",
                "englishNarrator": "Jabir bin 'Abdullah ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "We came with the Messenger of Allah (ﷺ) pronouncing Talbiya for Hajj, and the Messenger of Allah (ﷺ) commanded us to make (our Ihram) into that of Umra.",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ( حج کے لئے ) آئے اور ہم کہہ رہے تھے : اے اللہ! میں حج کرنے کے لئے حاضر ہوں ( ہماری نیت حج کی تھی راستے میں ) آپ صلی اللہ علیہ وسلم نے ہمیں حکم دیا ۔ کہ ہم اسے عمر ہ بنا لیں ۔ اور لبيك عمرةکہیں ۔ )",
                "urduNarrator": "ہم سے خلف بن ہشام، ابو الربیع اور قتیبہ نے بیان کیا، خلف نے کہا: ہم سے حماد بن زید نے بیان کیا، انہوں نے ایوب سے کہا, مجاہد نے جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے حدیث بیا ن کی ، کہا",
                "hadithArabic": "وحَدَّثَنَا خَلَفُ بْنُ هِشَامٍ، وَأَبُو الرَّبِيعِ، وَقُتَيْبَةُ، جَمِيعًا عَنْ حَمَّادٍ، قَالَ خَلَفٌ: حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، قَالَ: سَمِعْتُ مُجَاهِدًا، يُحَدِّثُ عَنْ جَابِرِ بْنِ عَبْدِ اللهِ رَضِيَ اللهُ عَنْهُمَا، قَالَ: قَدِمْنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ نَقُولُ: «لَبَّيْكَ، بِالْحَجِّ، فَأَمَرَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ نَجْعَلَهَا عُمْرَةً».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 10201,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=408",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=406",
                "label": "406",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=407",
                "label": "407",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=408",
                "label": "408",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=409",
                "label": "409",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=410",
                "label": "410",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=411",
                "label": "411",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=412",
                "label": "412",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=410",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=410",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=408",
        "to": 10225,
        "total": 40465
    }
}