{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 411,
        "data": [
            {
                "id": 10539,
                "hadithNumber": "2975",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Mutarrif with the same chain of transmitters.",
                "hadithUrdu": "محمد بن جعفر نے ہمیں حدیث بیان کی ، ( کہا ) ہمیں شعبہ نے حدیث سنائی ، انھوں نے حمید بن ہلال سے روایت کی ، کہا میں نے مطرف سے سنا ، انھوں نے کہا عمرا ن بن حصین رضی اللہ تعالیٰ عنہ نے مجھ سے کہا ۔ آگے معاذ کی حدیث کے مانند ہے ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَاه مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ حُمَيْدِ بْنِ هِلَالٍ، قَالَ: سَمِعْتُ مُطَرِّفًا، قَالَ: قَالَ لِي عِمْرَانُ بْنُ حُصَيْنٍ بِمِثْلِ حَدِيثِ مُعَاذٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10540,
                "hadithNumber": "2976",
                "englishNarrator": "Mutarrif reported:",
                "hadithEnglish": "'Imran bin Husain رضی اللہ تعالیٰ عنہ sent for me during his illness of which he died, and said: I am narrating to you some ahadith which may benefit you after me. If I live you conceal (the fact that these have been transmitted by me), and if I die, then you narrate them if you like (and these are): I am blessed, and bear in mind that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) combined Hajj and Umra. Then no verse was revealed in regard to it in the Book of Allah (which abrogated it) and the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) did not forbid (from doing it). And whatever a person (, Umar) said was out of his personal opinion.",
                "hadithUrdu": "جس مرض میں عمرا ن بن حصین رضی اللہ تعالیٰ عنہ کی وفا ت ہو ئی ، اس دورا ن میں انھوں نے مجھے بلا بھیجا اور کہا میں تمھیں چند احادیث بیان کرا نا چا ہتا ہوں ۔ امید ہے کہ اللہ تعا لیٰ میرے بعد تمھیں ان سے فائدہ پہنچائے گا ، اگر میں ( شفا یا ب ہو کر ) زندہ رہا تو ان باتوں کو میری طرف سے پو شیدہ رکھنا اگر فو ت ہو گیا تو چاہو تو بیان کر دینا مجھ پر ( فرشتوں کی جا نب سے ) سلام کہا جا تا تھا ( تفصیل سابقہ حدیث میں ہے ) اور یا د رکھو !اللہ کے نبی صلی اللہ علیہ وسلم نے حج اور عمرے کو اکٹھا کر دیا ، اس کے بعد نہ تو اس بارے میں اللہ کی کتاب نازل ہو ئی اور نہ ( آخر تک ) اللہ کے نبی صلی اللہ علیہ وسلم نے اس سے منع فرمایا ۔ ایک شخص نے اس بارے میں اپنی را ئے سے جو چا ہا کہا ۔",
                "urduNarrator": "ہم سے محمد بن المثنی اور ابن بشار نے بیان کیا، ابن المثنی نے کہا: ہم سے محمد بن جعفر نے شعبہ رضی اللہ عنہ سے بیان کیا, قتادہ نے مطرف سے روایت کی ، کہا",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَ ابْنُ الْمُثَنَّى: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، عَنْ مُطَرِّفٍ، قَالَ: بَعَثَ إِلَيَّ عِمْرَانُ بْنُ حُصَيْنٍ فِي مَرَضِهِ الَّذِي تُوُفِّيَ فِيهِ، فَقَالَ: إِنِّي كُنْتُ مُحَدِّثَكَ بِأَحَادِيثَ، لَعَلَّ اللهَ أَنْ يَنْفَعَكَ بِهَا بَعْدِي، فَإِنْ عِشْتُ فَاكْتُمْ عَنِّي، وَإِنْ مُتُّ فَحَدِّثْ بِهَا إِنْ شِئْتَ: إِنَّهُ قَدْ سُلِّمَ عَلَيَّ، وَاعْلَمْ «أَنَّ نَبِيَّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَدْ جَمَعَ بَيْنَ حَجٍّ وَعُمْرَةٍ، ثُمَّ لَمْ يَنْزِلْ فِيهَا كِتَابُ اللهِ، وَلَمْ يَنْهَ عَنْهَا نَبِيُّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ» قَالَ رَجُلٌ فِيهَا: بِرَأْيِهِ مَا شَاءَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10541,
                "hadithNumber": "2977",
                "englishNarrator": "Imran bin al-Husain ( رضی اللہ تعالیٰ عنہ) said:",
                "hadithEnglish": "Know well that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) combined 'Hajj and 'Umra, and nothing was revealed in the Book (to abrogate it), and the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) too did not forbid us from (combining) them. And whatever a person said was out of his personal opinion.",
                "hadithUrdu": "جا ن لو!اللہ کے رسول صلی اللہ علیہ وسلم نے حج اور عمرے کو اکٹھا کیا تھا ۔ اس کے بعد نہ تو اس معاملے میں اللہ کی کتاب ( میں کو ئی بات ) نازل ہو ئی ۔ اور نہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں ان دونوں سے منع فرمایا : پھر ایک شخص نے اس کے بارے میں اپنی را ئے سے جو چا ہا کہا ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا، ہم سے عیسیٰ بن یونس نے بیان کیا، ہم سے انہوں نے بیان کیا ہمیں سعید بن ابی عروبہ نے قتادہ سے حدیث بیان کی ، انھوں نے مطرف بن عبد اللہ بن شخیر سے انھوں نے عمرا ن بن حصین رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے فرمایا",
                "hadithArabic": "وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنْ مُطَرِّفِ بْنِ عَبْدِ اللهِ بْنِ الشِّخِّيرِ، عَنْ عِمْرَانَ بْنِ الْحُصَيْنِ رَضِيَ اللهُ عَنْهُ، قَالَ: «اعْلَمْ أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ جَمَعَ بَيْنَ حَجٍّ وَعُمْرَةٍ، ثُمَّ لَمْ يَنْزِلْ فِيهَا كِتَابٌ، وَلَمْ يَنْهَنَا عَنْهُمَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ» قَالَ: فِيهَا رَجُلٌ بِرَأْيِهِ مَا شَاءَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10542,
                "hadithNumber": "2978",
                "englishNarrator": "Imran bin Husain ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "We performed Tamattu' (Hajj and 'Umra combining together) in the company of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), and nothing was revealed in the Qur'an (concerning the abrogation of this practice), and whatever a person (Hadhrat 'Umar) said was his personal opinion.",
                "hadithUrdu": "ہم نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ( حج میں ) تمتع کیا تھا اور اس کے بعد اس کے متعلق قرآن نازل نہ ہوا ( کہ یہ درست نہیں ہے اس کے متعلق ) ایک شخص نے اپنی را ئے سے جو چا ہا کہہ دیا ۔",
                "urduNarrator": "ہم سے محمد بن المثنیٰ نے بیان کیا، کہا کہ مجھ سے عبدالصمد نے بیان کیا، انہوں نے کہا ہمام نے کہا : ہمیں قتادہ نے مطرف کے واسطے سے حضرت عمران بن حصین رضی اللہ تعالیٰ عنہ سے حدیث بیان فر مائی : کہا",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنِي عَبْدُ الصَّمَدِ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، عَنْ مُطَرِّفٍ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ رَضِيَ اللهُ عَنْهُ، قَالَ: «تَمَتَّعْنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَلَمْ يَنْزِلْ فِيهِ الْقُرْآنُ» قَالَ رَجُلٌ بِرَأْيِهِ مَا شَاءَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10543,
                "hadithNumber": "2979",
                "englishNarrator": "Imran bin Husain رضی اللہ تعالیٰ عنہ narrated this hadith (in these words also):",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) performed Hajj Tamattu' and we also performed it along with him.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ( حج میں ) تمتع ( حج و عمرے کو ایک ساتھ ادا ) کیا اور ہم نے بھی آپ کے ساتھ ( حج میں ) تمتع کیا تھا ۔ ( رسول اللہ صلی اللہ علیہ وسلم نے قران کی صور ت میں حج و عمرہ اکٹھا ادا کیا ، جو قربانیاں ساتھ نہ لا ئے تھے انھوں نے انھی دنوں میں الگ الگ احرا م باندھ کر دونوں کو ادا کیا )",
                "urduNarrator": "مجھ سے حجاج بن الشاعر نے بیان کیا، ہم سے عبید اللہ بن عبدالمجید نے بیان کیا، ہم سے اسماعیل بن مسلم نے بیان کیا، محمد بن واسع نے مطرف بن عبد اللہ بن شخر سے ، انھوں نے حضرت عمرا ن بن حصین رضی اللہ تعالیٰ عنہ سے یہی حدیث بیان کی ، ( عمرا ن بن حصین رضی اللہ تعالیٰ عنہ نے ) کہا",
                "hadithArabic": "وحَدَّثَنِيهِ حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا عُبَيْدُ اللهِ بْنُ عَبْدِ الْمَجِيدِ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ مُسْلِمٍ، حَدَّثَنِي مُحَمَّدُ بْنُ وَاسِعٍ، عَنْ مُطَرِّفِ بْنِ عَبْدِ اللهِ بْنِ الشِّخِّيرِ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ رَضِيَ اللهُ عَنْهُ، بِهَذَا الْحَدِيثِ، قَالَ: تَمَتَّعَ نَبِيُّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَتَمَتَّعْنَا مَعَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10544,
                "hadithNumber": "2980",
                "englishNarrator": "Imran bin Husain رضی اللہ عنہ said:",
                "hadithEnglish": "There was revealed the verse of Tamattu' in Hajj in the Book of Allah and the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) commanded us to perform it. and then no verse was revealed abrogating the Tamattu' (form of Hajj), and the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) did not forbid to do it till he died. So whatever a person said was his personal opinion.",
                "hadithUrdu": "متعہ یعنی حج میں تمتع کی آیت قرآن مجید میں نازل ہو ئی ۔ اور اللہ کے رسول اللہ صلی اللہ علیہ وسلم نے بھی ہمیں اس کا حکم دیا ، بعد ازیں نہ تو کو ئی آیت نازل ہو ئی جس نے حج میں تمتع کی آیت کو منسوخ کیا ہو اور نہ رسول اللہ صلی اللہ علیہ وسلم نے اس سے منع فر ما یا حتی کہ آپ فوت ہو گئے بعد میں ایک شخص نے اپنی را ئے سے جو چا ہا کہا ۔",
                "urduNarrator": "ہم سے حامد بن عمر البکراوی اور محمد بن ابی بکر المقدمی نے بیان کیا، کہا: انہوں نے ہم سے بیان کیا بشر بن مفضل نے ہمیں حدیث بیان کی ، ( کہا ہمیں عمرا ن بن مسلم نے ابو رجاء سے روایت کی ، کہ عمرا ن بن حصین رضی اللہ عنہ نے کہا",
                "hadithArabic": "حَدَّثَنَا حَامِدُ بْنُ عُمَرَ الْبَكْرَاوِيُّ، وَمُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، قَالَا: حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، حَدَّثَنَا عِمْرَانُ بْنُ مُسْلِمٍ، عَنْ أَبِي رَجَاءٍ، قَالَ: قَالَ عِمْرَانُ بْنُ حُصَيْنٍ: «نَزَلَتْ آيَةُ الْمُتْعَةِ، فِي كِتَابِ اللهِ - يَعْنِي مُتْعَةَ الْحَجِّ - وَأَمَرَنَا بِهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، ثُمَّ لَمْ تَنْزِلْ آيَةٌ تَنْسَخُ آيَةَ مُتْعَةِ الْحَجِّ، وَلَمْ يَنْهَ عَنْهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حَتَّى مَاتَ» قَالَ رَجُلٌ بِرَأْيِهِ: بَعْدُ، مَا شَاءَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10545,
                "hadithNumber": "2981",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this is transmitted on the authority of Imran bin Husain, but with this variation that he ('Imran) said: We did that (Tamattu') in the company of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and he did not say anything but he (the Holy Prophet) commanded us to do it.",
                "hadithUrdu": "ہم نے یہ ( حج میں تمتع ) رسول اللہ صلی اللہ علیہ وسلم کے ساتھ کیا ( یحییٰ بن سعید نے ) یہ نہیں کہا : آپ نے ہمیں اس کا حکم دیا ۔",
                "urduNarrator": "مجھ سے محمد بن حاتم نے بیان کیا، انہوں نے ہم سے بیان کیا یحییٰ بن سعید نے ہمیں عمرا ن قصیر سے حدیث سنا ئی ( انھوں نے کہا : ) ہمیں ابو رجاء نے عمرا ن بن حصین رضی اللہ تعالیٰ عنہ سے اسی سند ( مذکورہ بالاروایت ) کے مانند حدیث بیان کی ۔ البتہ اس میں یہ کہا کہ",
                "hadithArabic": "وحَدَّثَنِيهِ مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عِمْرَانَ الْقَصِيرِ، حَدَّثَنَا أَبُو رَجَاءٍ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، بِمِثْلِهِ، غَيْرَ أَنَّهُ قَالَ: وَفَعَلْنَاهَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يَقُلْ: وَأَمَرَنَا بِهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10546,
                "hadithNumber": "2982",
                "englishNarrator": "Abdullah bin 'Umar ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) observed Tamattu' in Hajjat-ul-Wada'. He first put on Ihram for 'Umra and then for Hajj. and then offered animal sacrifice. So he drove the sacrificial animals with him from Dhu'l-Hulaifa. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) commenced Ihram of Umra and thus pronounced Talbiya for 'Umra. and then (put on Ihram for Hajj) and pronounced Talbiya for Hajj. And the people performed Tamattu' in the company of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). They put on Ihram for Umra (first) and then for Hajj. Some of them had sacrificial animals which they had brought with them, whereas some of them had none to sacrifice. So when Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came to Mecca, he said to the people: He who amongst you has brought sacrificial animals along with him must not treat as lawful anything which has become unlawful for him till he has completed the Hajj; and he, who amongst you has not brought the sacrificial animals should circumambulate the House, and run between al-Safa' and al-Marwa and clip (his hair) and put off the Ihram, and then again put on the Ihram for Hajj and offer sacrifice of animals. But he who does not find the sacrificial animal, he should observe fast for three days during the Hajj and for seven days when he returns to his family. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) circumambulated (the House) when he came to Mecca: he first kissed the corner (of the Ka'ba containing the Black Stone), then ran in three circuits out of seven and walked in four circuits. And then when he had finished the circumambulation of the House he observed two rak'ahs of prayer at the Station (of Ibrahim), and then pronounced Salaam (for concluding the rak'ahs), and departed and came to al-Safa' and ran seven times between al-Safa' and al-Marwa. After that he did not treat anything as lawful which had become unlawful till he had completed his Hajj and sacrificed his animal on the day of sacrifice (10th of Dhu'l-Hijja). and then went back quickly (to Mecca) and performed circumambulation of the House (known as tawaf ifada) after which all that was unlawful for him became lawful; and those who had brought the sacrificial animals along with them did as Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) had done.",
                "hadithUrdu": "حجۃ الوداع کے موقع پر رسول اللہ صلی اللہ علیہ وسلم نے حج تک عمرے سے تمتع فرمایا اور ہدیہ قربانی کا اہتمام کیا آپ ذوالحلیفہ سے قربانی کے جا نور اپنے ساتھ چلا کر لا ئے تھے ۔ رسول اللہ صلی اللہ علیہ وسلم نے آغا ز فرمایا تو ( پہلے ) عمرے کا تلبیہ پکا را پھر حج کا تلبیہ پکا را اور لوگوں نے بھی آپ کے ساتھ حج تک عمرے سے تمتع کیا ۔ لوگوں میں کچھ ایسے تھے انھوں نے ہدیہ قربانی کا اہتمام کیا اور قربانی کے جانور چلا کر ساتھ لا ئے تھے اور کچھ ایسے تھے جو قربانیاں لے کر نہیں چلے تھے ۔ جب آپ مکہ تشریف لے آئے تو آپ نے لوگوں سے فرمایا : \"\" تم میں سے جو قربانی لے چلا وہ ان چیزوں سے جنھیں اس نے ( احرا م بندھ کر ) حرام کیا اس وقت تک حلال نہیں ہو گا جب تک کہ حج پو را نہ کرے ۔ اور جو شخص قربا نی نہیں لا یا وہ بیت اللہ اور صفا مروہ کا طواف کرے اور بال کتروا کر حلال ہو جا ئے ( اور آٹھ ذوالحجہ کو ) پھر حج کا ( احرا م باندھ کر ) تلبیہ پکا رے ( اور رمی کے بعد ) قر بانی کرے ۔ اور جسے قربانی میسر نہ ہو وہ تین دن حج کے دورا ن میں اور سات دن گھر لو ٹ کر روزے رکھے ۔ جب آپ صلی اللہ علیہ وسلم مکہ پہنچے تھے تو آپ صلی اللہ علیہ وسلم نے بیت اللہ کا طواف فر ما یا ۔ سب سے پہلے حجرا سود کا استلام کیا ۔ پھر تین چکروں میں تیز چلے اور چار چکر معمول کی رفتار سے چل کر لگا ئے ۔ جب آپ نے بیت اللہ کا طواف مکمل کر لیا تو مقام ابرا ہیم کے پاس دو رکعتیں ادا فرمائیں ۔ پھر سلام پھیر ااور رخ بد لیا ۔ صفا پر تشریف لا ئے اور صفا مروہ کے ( درمیا ن ) ساتھ چکر لگا ئے ۔ پھر جب تک آپ نے اپنا حج مکمل نہ کیا آپ نے ایسی کسی چیز کو ( اپنے لیے ) حلال نہ کیا جسے آپ نے حرا م کیا تھا قربانی کے دن آپ نے اپنے قربانی کے اونٹ نحر کیے اور ( طواف ) افاضہ فر ما یا ۔ پھر آپ نے ہر وہ چیز ( اپنے لیے ) حلال کر لی جو احرام کی وجہ سے ) حرام ٹھہرائی تھی ۔ اور لوگوں میں سے جنھوں نے ہدیہ قربانی کا اہتمام کیا تھا اور لوگو ں کے ساتھ قربانی کے جا نور ہانک کر لے آئے تھے ۔ انھوں نے بھی ویسا ہی کیا جس طرح رسول اللہ صلی اللہ علیہ وسلم نے کیا تھا ۔",
                "urduNarrator": "ہم سے عبدالملک بن شعیب بن لیث نے بیان کیا، مجھ سے میرے والد نے بیان کیا، وہ میرے دادا کے واسطہ سے، مجھ سے عقیل بن خالد نے بیان کیا، وہ ابن شہاب کی سند سے, سالم بن عبد اللہ سے روایت ہے کہ عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ نے کہا",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي عُقَيْلُ بْنُ خَالِدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللهِ، أَنَّ عَبْدَ اللهِ بْنَ عُمَرَ رَضِيَ اللهُ عَنْهُمَا، قَالَ: تَمَتَّعَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ بِالْعُمْرَةِ إِلَى الْحَجِّ، وَأَهْدَى، فَسَاقَ مَعَهُ الْهَدْيَ مِنْ ذِي الْحُلَيْفَةِ، وَبَدَأَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَأَهَلَّ بِالْعُمْرَةِ، ثُمَّ أَهَلَّ بِالْحَجِّ، وَتَمَتَّعَ النَّاسُ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِالْعُمْرَةِ إِلَى الْحَجِّ، فَكَانَ مِنَ النَّاسِ مَنْ أَهْدَى فَسَاقَ الْهَدْيَ وَمِنْهُمْ مَنْ لَمْ يُهْدِ، فَلَمَّا قَدِمَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مَكَّةَ قَالَ لِلنَّاسِ: «مَنْ كَانَ مِنْكُمْ أَهْدَى، فَإِنَّهُ لَا يَحِلُّ مِنْ شَيْءٍ حَرُمَ مِنْهُ حَتَّى يَقْضِيَ حَجَّهُ، وَمَنْ لَمْ يَكُنْ مِنْكُمْ أَهْدَى، فَلْيَطُفْ بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ وَلْيُقَصِّرْ وَلْيَحْلِلْ، ثُمَّ لِيُهِلَّ بِالْحَجِّ وَلْيُهْدِ، فَمَنْ لَمْ يَجِدْ هَدْيًا، فَلْيَصُمْ ثَلَاثَةَ أَيَّامٍ فِي الْحَجِّ وَسَبْعَةً إِذَا رَجَعَ إِلَى أَهْلِهِ» وَطَافَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حِينَ قَدِمَ مَكَّةَ، فَاسْتَلَمَ الرُّكْنَ أَوَّلَ شَيْءٍ، ثُمَّ خَبَّ ثَلَاثَةَ أَطْوَافٍ مِنَ السَّبْعِ، وَمَشَى أَرْبَعَةَ أَطْوَافٍ، ثُمَّ رَكَعَ، حِينَ قَضَى طَوَافَهُ بِالْبَيْتِ عِنْدَ الْمَقَامِ رَكْعَتَيْنِ، ثُمَّ سَلَّمَ فَانْصَرَفَ، فَأَتَى الصَّفَا فَطَافَ بِالصَّفَا وَالْمَرْوَةِ سَبْعَةَ أَطْوَافٍ، ثُمَّ لَمْ يَحْلِلْ مِنْ شَيْءٍ حَرُمَ مِنْهُ حَتَّى قَضَى حَجَّهُ، وَنَحَرَ هَدْيَهُ يَوْمَ النَّحْرِ، وَأَفَاضَ، فَطَافَ بِالْبَيْتِ ثُمَّ حَلَّ مِنْ كُلِّ شَيْءٍ حَرُمَ مِنْهُ، وَفَعَلَ، مِثْلَ مَا فَعَلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، مَنْ أَهْدَى وَسَاقَ الْهَدْيَ مِنَ النَّاسِ.",
                "headingArabic": "وُجُوبِ الدَّمِ عَلَى الْمُتَمَتِّعِ وَأَنَّهُ إِذَا عَدِمَهُ لَزِمَهُ صَوْمُ ثَلاَثَةِ أَيَّامٍ فِي الْحَجِّ وَسَبْعَةٍ إِذَا رَجَعَ إِلَى أَهْلِهِ",
                "headingUrdu": "تمتع کرنے والے حاجی کے لیے قربانی کی ذمہ داری؛ اگر اس کے پاس قربانی کے لیے کوئی جانور نہ ہو تو اسے حج کے دوران تین دن اور جب وہ اپنے گھر والوں کے پاس جائے تو سات روزے رکھے",
                "headingEnglish": "The Obligation For the Pilgrim who is performing Tamattu' to offer a sacrifice; If he has no animal to sacrifice, he must fast for three days during Hajj and seven days when he goes back to his family",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10547,
                "hadithNumber": "2983",
                "englishNarrator": "It was narrated that of 'Urwah bin Zubair, that A'isha رضی اللہ تعالیٰ عنہا wife of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌):",
                "hadithEnglish": "The Messenger of Allah's ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) followed 'Umrah with Hajj (Tamattu'). And the people did Tamattu' with him, as was informed to me by Salim bin Abdullah from Abdullah رضی اللہ تعالیٰ عنہ from the Messenger of Allah's ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌).",
                "hadithUrdu": "انھیں ( عروہ کو ) رسول اللہ صلی اللہ علیہ وسلم کے بارے میں آپ کے حج کے ساتھ عمرے کے تمتع کے متعلق اور جو آپ کے ساتھ تھے ۔ ان کے تمتع کے متعلق اسی طرح خبر دی ۔ جس طرح سالم بن عبد اللہ نے مجھے عبد اللہ ( بن عمر رضی اللہ تعالیٰ عنہ ) کے واسطے سے رسول اللہ صلی اللہ علیہ وسلم سے خبر دی تھی ۔",
                "urduNarrator": "مجھ سے عبد الملک بن شعیب نے بیان کیا، مجھ سے میرے والد نے بیان کیا، میرے دادا کی سند سے عقیل نے بیان کیا, ابن شہاب نے عروہ بن زبیر سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم کی زوجہ ام المومنین حضرت عائشہ رضی اللہ تعالیٰ عنہا نے",
                "hadithArabic": "وحَدَّثَنِيهِ عَبْدُ الْمَلِكِ بْنُ شُعَيْبٍ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، أَنَّ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَخْبَرَتْهُ: «عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي تَمَتُّعِهِ بِالْحَجِّ إِلَى الْعُمْرَةِ، وَتَمَتُّعِ النَّاسِ مَعَهُ» بِمِثْلِ الَّذِي أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللهِ، عَنْ عَبْدِ اللهِ رَضِيَ اللهُ عَنْهُ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10548,
                "hadithNumber": "2984",
                "englishNarrator": "Hafsa (رضی اللہ تعالیٰ عنہا), the wife of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), said:",
                "hadithEnglish": "O Messenger of Allah. what about people who have put off Ihram whereas you have not put it off after your 'Umra? He said: I have stuck my hair and have driven my sacrificial animal, and would not, therefore, put off Ihram until I have sacrificed the animal.",
                "hadithUrdu": "اے اللہ کے رسول صلی اللہ علیہ وسلم ! لوگوں کا معاملہ کیا ہے؟ انھوں نے ( عمرے کے بعد ) احرا م کھول دیا ہے ۔ اور آپ نے اپنے عمرے ( آتے ہی طواف وسعی جو عمرے کے منسک کے برابر ہے ) کے بعد احرا م نہیں کھولا ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" میں نے اپنے سر ( کے بالوں ) کو گوند یا خطمی بوٹی سے ) چپکالیا اور اپنی قربانیوں کو ہار ڈا ل دیے ۔ اس لیے میں جب تک قربانی نہ کر لوں ۔ احرا م نہیں کھول سکتا ۔",
                "urduNarrator": "یحییٰ بن یحییٰ نے کہا : میں نے امام مالک کے سامنے پڑھا ، انھوں نے نافع سے روایت کی ، انھوں نے عبد اللہ بن عمر رضی اللہ عنہ سے روایت کی ، کہ رسول اللہ صلی اللہ علیہ وسلم کی زوجہ حضرت حفصہ رضی اللہ تعالیٰ عنہا نے عرض کی",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللهِ بْنِ عُمَرَ، أَنَّ حَفْصَةَ رَضِيَ اللهُ عَنْهَا زَوْجَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَتْ: يَا رَسُولَ اللهِ، مَا شَأْنُ النَّاسِ حَلُّوا وَلَمْ تَحْلِلْ أَنْتَ مِنْ عُمْرَتِكَ؟ قَالَ: «إِنِّي لَبَّدْتُ رَأْسِي، وَقَلَّدْتُ هَدْيِي، فَلَا أَحِلُّ حَتَّى أَنْحَرَ».",
                "headingArabic": "بَيَانِ أَنَّ الْقَارِنَ لاَ يَتَحَلَّلُ إِلاَّ فِي وَقْتِ تَحَلُّلِ الْحَاجِّ الْمُفْرِدِ ‏",
                "headingUrdu": "قرآن پڑھنے والے کو احرام سے نہیں نکلنا چاہیے سوائے اس کے کہ جب افراد ادا کرنے والا احرام سے نکلے۔",
                "headingEnglish": "The pilgrim performing Qiran should not exit Ihram except when the pilgrims performing Ifrad exit Ihram",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10549,
                "hadithNumber": "2985",
                "englishNarrator": "Hafsa ( رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "I said: Messenger of Allah ﷺ what is the matter with you that you have not put off Ihram? The rest of the hadith is the same.",
                "hadithUrdu": "\" میں نے عرض کی : اے اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! کیا وجہ ہے کہ آپ نے احرا م نہیں کھولا ؟ ( آگے ) مذکورہ بالا حدیث کے مانند ہے ۔",
                "urduNarrator": "ابن نمیر نے ہم سے کہا خالد بن مخلد نے مالک سے ، انھوں نے نافع سے انھوں نے ابن عمر رضی اللہ تعالیٰ عنہ سے ، انھوں نے حضرت حفصہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے فرمایا",
                "hadithArabic": "وحَدَّثَنَاه ابْنُ نُمَيْرٍ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنْ حَفْصَةَ رَضِيَ اللهُ عَنْهُمْ، قَالَتْ: قُلْتُ يَا رَسُولَ اللهِ مَا لَكَ لَمْ تَحِلَّ بِنَحْوِهِ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10550,
                "hadithNumber": "2986",
                "englishNarrator": "Hafsa (رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "I said to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌): What is the matter with people that they have put off Ihram, whereas you have not put it off after your Umra'? He said: I have driven my sacrificial animal and stuck my hair, and it is not permissible for me to put off Ihram unless I have completed the Hajj.",
                "hadithUrdu": "میں نے نبی صلی اللہ علیہ وسلم سے عرض کی : لوگوں کا کیا معاملہ ہے؟ انھوں نے احرا م کھول دیا ہے اور آپ نے ( مناسک ) ادا ہو جا نے کے باوجود ) ابھی تک عمرے کا احرا م نہیں کھولا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" میں نے اپنی قربانی کے اونٹوں کو ہار پہنائے اور اپنے سر ( کے بالوں ) کو گوند ( جیلی ) سے چپکا یا میں جب تک حج سے فارغ نہ ہو جاؤں ۔ احرام سے فارغ نہیں ہو سکتا ۔",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا، کہا ہم سے یحییٰ بن سعید نے بیان کیا, عبید اللہ نے کہا : مجھے نافع نے ابن عمر رضی اللہ تعالیٰ عنہ سے انھوں نے حضرت حفصہ رضی اللہ تعالیٰ عنہا سے خبر دی انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عُبَيْدِ اللهِ، قَالَ: أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، عَنْ حَفْصَةَ رَضِيَ اللهُ عَنْهُمْ، قَالَتْ: قُلْتُ لِلنَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: مَا شَأْنُ النَّاسِ حَلُّوا وَلَمْ تَحِلَّ مِنْ عُمْرَتِكَ؟ قَالَ: «إِنِّي قَلَّدْتُ هَدْيِي، وَلَبَّدْتُ رَأْسِي، فَلَا أَحِلُّ حَتَّى أَحِلَّ مِنَ الْحَجِّ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10551,
                "hadithNumber": "2987",
                "englishNarrator": "Hafsa (رضی اللہ تعالیٰ عنہا) said:",
                "hadithEnglish": "O Messenger of Allah ﷺ; the rest of the hadith is the same and (the concluding words of the Holy Prophet): I won't put off Ihram until I have sacrificed the animal.",
                "hadithUrdu": "اے اللہ کے رسول صلی اللہ علیہ وسلم ! ( آگے ) مالک کی ھدیث کے مانند ہے ( البتہ الفاظ یوں ہیں ) : \" میں جب تک قربانی نہ کر لوں ۔ احرا م سے فارغ نہیں ہو سکتا ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے ابو اسامہ نے بیان کیا، انہوں نے بیان کیا عبید اللہ نے نافع سے انھوں نے ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی کہ حضرت حفصہ رضی اللہ تعالیٰ عنہا نے ( اللہ کے رسول اللہ صلی اللہ علیہ وسلم ) سے عرض کی",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا عُبَيْدُ اللهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ حَفْصَةَ رَضِيَ اللهُ عَنْهَا، قَالَتْ: يَا رَسُولَ اللهِ بِمِثْلِ حَدِيثِ مَالِكٍ «فَلَا أَحِلُّ حَتَّى أَنْحَرَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10552,
                "hadithNumber": "2988",
                "englishNarrator": "Hafsa (رضی اللہ تعالیٰ عنہا) said:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) commanded his wives that they should put off Ihram during the year of Hajj (at-ul-Wada'). whereupon she (Hafsa رضی اللہ تعالیٰ عنہا) said: What hinders you that you have not put off Ihram? Thereupon he said: I have stuck my hair and driven my sacrificial animal along with men and it is not permissible to put off Ihram (under this condition until I have sacrificed the animal.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے اپنی ازواج کو حجۃ الوداع کے سال حکم دیا تھا کہ وہ ( عمرہ کرنے کے بعد ) احرا م کھول دیں ۔ حضرت حفصہ رضی اللہ تعالیٰ عنہا نے کہا : میں نے عرض کی : آپ کو احرا م کھو لنے سے کیا چیز مانع ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا : \" میں اپنے سر ( کے بالوں کو ) چپکا چکا ہو ں ۔ اور اپنی قربانی کے اونٹ نحر نہ کر لوں ۔ احرام نہیں کھو ل سکتا ۔",
                "urduNarrator": "ہم سے ابن ابی عمر نے بیان کیا، ہم سے ہشام بن سلیمان المخزومی اور عبدالمجید نے بیان کیا, ابن جریج نے نافع سے انھوں نے ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : مجھے حضرت حفصہ رضی اللہ تعالیٰ عنہا نے حدیث بیان فرمائی کہ",
                "hadithArabic": "وحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا هِشَامُ بْنُ سُلَيْمَانَ الْمَخْزُومِيُّ، وَعَبْدُ الْمَجِيدِ، عَنِ ابْنِ جُرَيْجٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ: حَدَّثَتْنِي حَفْصَةُ رَضِيَ اللهُ عَنْهَا، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَمَرَ أَزْوَاجَهُ أَنْ يَحْلِلْنَ عَامَ حَجَّةِ الْوَدَاعِ، قَالَتْ حَفْصَةُ: فَقُلْتُ: مَا يَمْنَعُكَ أَنْ تَحِلَّ؟ قَالَ: «إِنِّي لَبَّدْتُ رَأْسِي، وَقَلَّدْتُ هَدْيِي، فَلَا أَحِلُّ حَتَّى أَنْحَرَ هَدْيِي».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10553,
                "hadithNumber": "2989",
                "englishNarrator": "Nafi' reported:",
                "hadithEnglish": "'Abdullah bin Umar (رضی اللہ تعالیٰ عنہ) set out for Umra during the turmoil, and he said: If I am detained (from going to) the House, we would do the same as we did with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). So he went out and put on Ihram for 'Umra and moved on until he reached al-Baida'. He turned towards his Companions and said: There is one command for both of them. and 1 call you as my witness (and say) that verify I have- made Hajj with 'Umra compulsory for me. He proceeded until, when he came to the House, he circumambulated it seven times and ran between al-Safa' and al-Marwa seven times, and made no addition to it and thought it to be sufficient for him and offered sacrifice.",
                "hadithUrdu": "عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ فتنے کے ایام میں عمرے کے لیے نکلے اور کہا : اگر مجھے بیت اللہ جا نے سے روک دیا گیا تو ہم ویسے ہی کریں گے جیسے ہم نے رسول اللہ صلی اللہ علیہ وسلم کے ہمراہ کیا تھا ۔ وہ ( مدینہ سے ) نکلے اور ( میقات سے ) عمرے کا تلبیہ پکا را ، اور چل پرے جب مقا م بیداء ( کی بلندی ) پر نمودار ہو ئے تو اپنے ساتھیوں کی طرف متوجہ ہو کر فرمایا : \"\" دونوں ( حج وعمرہ ) کا معاملہ ایک ہی جیسا ہے ۔ میں تمھیں گواہ بناتا ہوں کہ میں نے عمرے کے ساتھ حج کی نیت بھی کر لی ہے ۔ پھر آپ نکل پڑے حتی کہ بیت اللہ پہنچے تو اس کے ( گرد ) سات چکر لگا ئے ۔ اور صفامروہ کے مابین بھی سات چکر پو رے کیے ، ان پر کوئی اضافہ نہیں کیا ۔ ان کی را ئے تھی کہ یہی ( ایک طواف اور ایک سعی ) ان کی طرف سے کا فی ہے اور ( بعدازاں ) انھوں نے ( حج قران ہو نے کی بنا پر ) قربانی کی ۔",
                "urduNarrator": "یحییٰ بن یحییٰ نے کہا : میں نے امام مالک کے سامنے ( حدیث کی ) قراءت کی ، انھوں نے نافع سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللهِ بْنَ عُمَرَ رَضِيَ اللهُ عَنْهُمَا، خَرَجَ فِي الْفِتْنَةِ مُعْتَمِرًا وَقَالَ: إِنْ صُدِدْتُ عَنِ الْبَيْتِ صَنَعْنَا كَمَا صَنَعْنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَخَرَجَ فَأَهَلَّ بِعُمْرَةٍ وَسَارَ، حَتَّى إِذَا ظَهَرَ عَلَى الْبَيْدَاءِ الْتَفَتَ إِلَى أَصْحَابِهِ، فَقَالَ: مَا أَمْرُهُمَا إِلَّا وَاحِدٌ، أُشْهِدُكُمْ أَنِّي قَدْ أَوْجَبْتُ الْحَجَّ مَعَ الْعُمْرَةِ، فَخَرَجَ حَتَّى إِذَا جَاءَ الْبَيْتَ طَافَ بِهِ سَبْعًا، وَبَيْنَ الصَّفَا وَالْمَرْوَةِ، سَبْعًا. لَمْ يَزِدْ عَلَيْهِ، وَرَأَى أَنَّهُ مُجْزِئٌ عَنْهُ، وَأَهْدَى.",
                "headingArabic": "جوازالتحلل بالإحصاروجواز القران واقتصار القارن على طواف واحد وسعي واحد",
                "headingUrdu": "اگر کسی کو حج سے روکا جائے تو احرام سے نکلنا جائز ہے۔ قرآن پڑھنا جائز ہے اور حج کرنے والا صرف ایک طواف اور ایک سعی کرے۔",
                "headingEnglish": "It is permissible to exit Ihram if one is prevented from completing Hajj; It is permissible to perform Qiran and the pilgrim performing Qiran should perform just one Tawaf and one Sa'i",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10554,
                "hadithNumber": "2990",
                "englishNarrator": "Nafi' reported:",
                "hadithEnglish": "'Abdullah bin 'Abdullah رضی اللہ تعالیٰ عنہ and Salim bin Abdullah said to 'Abdullah (bin 'Umar رضی اللہ تعالیٰ عنہ ) at the time when Hajjaj came to fight against Ibn Zubair رضی اللہ تعالیٰ عنہ : There would be no harm if you do not (proceed) for Hajj this year, for we fear that there would be fight among people which would cause obstruction between you and the House, whereupon he said: If there would be obstruction between me and that (Ka'ba), I would do as Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) did. I was with him (the Holy Prophet) when the infidels of Quraish caused obstructions between him (the Holy Prophet) and the House. I call you as my witness (to the fact) that I have made 'Umra essential for me. He proceeded until he came to Dhu'l-Hulaifa and pronounced Talbiya for Umra, and said: If the way Is clear forme, I would then complete my 'Umra but If there is some obstruction between me and that (the Ka'ba). I would then do what Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had done (at the occasion of Hudaibiya), and I was with him (the Holy Prophet). and then recited: Verily in the Messenger of Allah, there is a model pattern for you (xxxiii. 21). He then moved on until he came to the rear side of al-Baida' and said: There is one command for both of them automatically) (Hajj and Umra). If I am detained (in the performance) of 'Umra, I am ( automatically detained (in the performance) of Hajj (too). I call you as witness that Hajj along with 'Umra I had made essential for me. (I am performing Hajj and 'Umra as Qiran.) He then bought sacrificial animals at Qudaid and then circumambulated the House and ran between al-Safa' and al-Marwa once (covering both Hajj and Umra), and did not put off Ihram until on the Day of Sacrifice in the month of Dhu'l-Hijja.",
                "hadithUrdu": "جس سال حجاج بن یوسف نے حضرت ابن زبیر رضی اللہ تعالیٰ عنہ سے لرا ئی کرنے کے لیے مکہ میں پراؤ کیا تو عبد اللہ بن عبد اللہ اور سالم بن عبد اللہ نے حضرت عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ سے گفتگو کی کہ اگر آپ اس سال حج نہ فرمائیں تو کو ئی حرج نہیں ہمیں اندیشہ ہے کہ لوگوں ( حجاج بنیوسف اور عبد اللہ بن زبیر رضی اللہ تعالیٰ عنہ کی فوجوں ) کے درمیان جنگ ہو گی اور آپ کے اور بیت اللہ کے درمیان رکاوٹ حائل ہو جا ئے گی ( آپ بیت اللہ تک پہنچ نہیں پائیں گے ) انھوں نے فر ما یا : \"\" اگر میرے اور بیت اللہ کے درمیان کو ئی رکاوٹ آگئی تو میں وہی کروں گا جو رسول اللہ صلی اللہ علیہ وسلم نے کیا تھا ( اسموقع پر ) میں بھی آپ کے ساتھ ( شریک سفر ) تھا جب قریش مکہ آپ کے اور بیت اللہ کے درمیان حا ئل ہو گئے تھے میں تمھیں گواہ بنا تا ہوں کہ میں نے عمرے کی نیت کر لی ہے ۔ ( پھر حضرت ابن عمر رضی اللہ تعالیٰ عنہ ) نکلے جب ذوالحلیفہ پہنچے تو عمرے کا تلبیہ پکارا پھر فرمایا : \"\" اگر میرا راستہ خالی رہا تو میں اپنا عمرہ مکمل کروں گا اور اگر میرے اور بیت اللہ کے درمیان کو ئی رکاوٹ پیدا ہو گئی تو میں وہی کروں گا جو رسول اللہ صلی اللہ علیہ وسلم نے کیا تھا جب میں بھی آپ کے ساتھ تھا ۔ پھر ( ابن عمر رضی اللہ تعالیٰ عنہ نے ) یہ آیت تلاوت فرمائی ۔ \"\" لَّقَدْ كَانَ لَكُمْ فِي رَ‌سُولِ اللَّـهِ أُسْوَةٌ حَسَنَةٌ \"\" یقیناً تمھا رے لیے رسول اللہ صلی اللہ علیہ وسلم ( کے عمل ) میں بہترین نمونہ ہے ۔ \"\" پھر ( حضرت ابن عمر رضی اللہ تعالیٰ عنہ ) چل پڑے جب مقام بیداء کی بلندی پر پہنچے تو فر ما یا : \"\" ان دونوں ( حج و عمرہ ) کا حکم ایک جیسا ہے ۔ اگر میرے اور عمرے کے درمیان کو ئی رکاوٹ حائل ہو گئی تو ( وہی رکا وٹ ) میرے اور میرے حج کے درمیان حائل ہو گی ۔ میں تمھیں گواہ ٹھہراتا ہوں کہ میں نے اپنے عمرے کے ساتھ حج بھی لا زم ٹھہرا لیا ہے آپ چلتے رہے حتی کہ مقام قدید آپ نے قربانی کے اونٹ خریدے پھر آپ نے ان دونوں ( حج اور عمرے ) کے لیے بیت اللہ اور احرا م باندھا تھا اسے نہ کھولا یہاں تک کہ قربانی کے دن حج ( مکمل ) کر کے دونوں کے احرا م سے فارغ ہو ئے ۔",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا، کہا ہم سے یحییٰ نے جو کہ القطان ہیں، نے بیان کیا کہ عبید اللہ سے روایت ہے کہا : مجھے نافع نے حدیث بیان کی کہ",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى وَهُوَ الْقَطَّانُ، عَنْ عُبَيْدِ اللهِ، حَدَّثَنِي نَافِعٌ، أَنَّ عَبْدَ اللهِ بْنَ عَبْدِ اللهِ، وَسَالِمَ بْنَ عَبْدِ اللهِ، كَلَّمَا عَبْدَ اللهِ حِينَ نَزَلَ الْحَجَّاجُ لِقِتَالِ ابْنِ الزُّبَيْرِ، قَالَا: لَا يَضُرُّكَ أَنْ لَا تَحُجَّ الْعَامَ، فَإِنَّا نَخْشَى أَنْ يَكُونَ بَيْنَ النَّاسِ قِتَالٌ يُحَالُ بَيْنَكَ وَبَيْنَ الْبَيْتِ، قَالَ: فَإِنْ حِيلَ بَيْنِي وَبَيْنَهُ فَعَلْتُ كَمَا فَعَلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَأَنَا مَعَهُ، حِينَ حَالَتْ كُفَّارُ قُرَيْشٍ بَيْنَهُ وَبَيْنَ الْبَيْتِ، أُشْهِدُكُمْ أَنِّي قَدْ أَوْجَبْتُ عُمْرَةً، فَانْطَلَقَ حَتَّى أَتَى ذَا الْحُلَيْفَةِ فَلَبَّى بِالْعُمْرَةِ، ثُمَّ قَالَ: إِنْ خُلِّيَ سَبِيلِي قَضَيْتُ عُمْرَتِي، وَإِنْ حِيلَ بَيْنِي وَبَيْنَهُ فَعَلْتُ كَمَا فَعَلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَأَنَا مَعَهُ، ثُمَّ تَلَا: {لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللهِ أُسْوَةٌ حَسَنَةٌ} [الأحزاب: 21]، ثُمَّ سَارَ حَتَّى إِذَا كَانَ بِظَهْرِ الْبَيْدَاءِ قَالَ: مَا أَمْرُهُمَا إِلَّا وَاحِدٌ، إِنْ حِيلَ بَيْنِي وَبَيْنَ الْعُمْرَةِ حِيلَ بَيْنِي وَبَيْنَ الْحَجِّ، أُشْهِدُكُمْ أَنِّي قَدْ أَوْجَبْتُ حَجَّةً مَعَ عُمْرَةٍ، فَانْطَلَقَ حَتَّى ابْتَاعَ بِقُدَيْدٍ هَدْيًا، ثُمَّ طَافَ لَهُمَا طَوَافًا وَاحِدًا بِالْبَيْتِ وَبَيْنَ الصَّفَا وَالْمَرْوَةِ، ثُمَّ لَمْ يَحِلَّ مِنْهُمَا حَتَّى حَلَّ مِنْهُمَا بِحَجَّةٍ يَوْمَ النَّحْرِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10555,
                "hadithNumber": "2991",
                "englishNarrator": "Nafi' reported:",
                "hadithEnglish": "Ibn Umar رضی اللہ تعالیٰ عنہ intended to go to Hajj (during the year) when Hajjaj attacked Ibn Zubair رضی اللہ تعالیٰ عنہ , and he narrated the account as (narrated above), and he used to say at the end of the hadith: He who combines Hajj with Umra, for him one single circumambulation is sufficient, and he did not put off Ihram until he had completed both of them.",
                "hadithUrdu": "حضرت عبداللہ ( بن عمر رضی اللہ تعالیٰ عنہ ) نے اس موقع پر حجاج بن یوسف ، ابن زبیر رضی اللہ تعالیٰ عنہ کے مقابلے میں اترا ، حج کااردہ کیا ۔ ( ابن نمیر نے پوری ) حدیث ( یحییٰ قطان کے ) اس قصے کی طرح بیان کی ۔ البتہ حدیث کے آخر میں کہا کہ ( ابن عمر رضی اللہ تعالیٰ عنہ ) یہ کہا کرتے تھے : جو شخص حج وعمرہ اکھٹا ( حج قران کی صورت میں ) ادا کرے تو اسے ایک ہی طواف کافی ہے ۔ اور وہ اس وقت  احرام سے فارغ نہیں ہوگا جب تک دونوں سے فارغ نہ ہوجائے ۔",
                "urduNarrator": "ابن نمیر نے ہمیں حدیث سنائی ، ( کہا : ) ہمیں میرے والد ( عبداللہ ) نے عبیداللہ سے ، انھوں نے نافع سے روایت کی ، کہا",
                "hadithArabic": "وحَدَّثَنَاه ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللهِ، عَنْ نَافِعٍ، قَالَ: أَرَادَ ابْنُ عُمَرَ الْحَجَّ حِينَ نَزَلَ الْحَجَّاجُ بِابْنِ الزُّبَيْرِ، وَاقْتَصَّ الْحَدِيثَ بِمِثْلِ هَذِهِ الْقِصَّةِ، وَقَالَ فِي آخِرِ الْحَدِيثِ: وَكَانَ يَقُولُ: مَنْ جَمَعَ بَيْنَ الْحَجِّ وَالْعُمْرَةِ كَفَاهُ طَوَافٌ وَاحِدٌ وَلَمْ يَحِلَّ حَتَّى يَحِلَّ مِنْهُمَا جَمِيعًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10556,
                "hadithNumber": "2992",
                "englishNarrator": "Nafi' reported:",
                "hadithEnglish": "Ibn Umar رضی اللہ تعالیٰ عنہ intended to go for Hajj during the year when Hajjaj attacked Ibn Zubair. It was said to him: There is a state of war between people and we fear that they would detain you, whereupon he ('Abdullah b. Umar) said: Verily in the Messenger of Allah there is a model pattern for you. I would do as Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) did. I call you as witness that I have undertaken to perform 'Umra. He then set out until, when he reached the rear side of al-Baida', he said: There is one command both for Hajj and Umra. so bear witness. Ibn Rumh said: I call you as witness that I have undertaken to perform my Hajjalong with my Umra (i. e. I am performing both of them as Qiran), and he offered the sacrifice of animals which he had bought at Qudaid. He then proceeded pronouncing Talbiya for both of them together until he reached Mecca, He circumambulated the House. and (ran) between al-Safa' and al-Marwa and made no addition to it. He neither sacrificed the animal, nor got his head shaved, nor got his hair clipped, nor did he make anything lawful which was unlawful (due to Ihram) until it was the Day of Sacrifice (10th of Dhu'l-Hijja). He then offered sacrifice, and got his hair cut, and saw that circumambulation of Hajj and 'Umra was complete with the first circumambulation. Ibn 'Umar رضی اللہ تعالیٰ عنہ said: This is how Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had done.",
                "hadithUrdu": "جس سال حجاج بن یوسف ، ابن سال حضرت ابن عمر رضی اللہ تعالیٰ عنہ نے حج کا قصد فرمایا ، ان سے کہا گیا : لوگوں کے مابین تو لڑائی ہونے والی ہے ، ہمیں خدشہ ہے کہ وہ آپ کو ( بیت اللہ سے پہلے ہی ) روک دیں گے ۔ انھوں نے فرمایا : بلا شبہ تمھارے لیے اللہ کے رسول صلی اللہ علیہ وسلم کی ذات میں بہترین نمونہ ہے ۔ میں اس طرح کروں گا جس طرح رسول اللہ صلی اللہ علیہ وسلم نےکیا تھا ۔ میں تمھیں گواہ ٹھراتا ہوں کہ میں نے ( خود پر ) عمرہ واجب کرلیا ہے ۔ پھرروانہ ہوئے ، جب مقام بیداء کی بلندی پر پہنچے تو فرمایا : ( کسی رکاوٹ کے باعث بیت اللہ تک نہ پہنچ سکنے کے لحاظ سے ) حج وعمرے کا معاملہ یکساں ہی ہے ۔ ( لوگو! ) تم گواہ رہو ۔ ابن رمح کی روایت ہے : میں تمھیں گواہ بناتا ہوں ۔ میں نے اپنے عمرے کے ساتھ حج بھی خود پرواجب کرلیا ہے ۔ اور وہ قربانی جو مقام قدید سے خریدی تھی اسے ساتھ لیا ۔ اور حج اور عمرہ دونوں کاتلبیہ پکارتے ہوئے آگے بڑھے ، حتیٰ کہ مکہ آپہنچے ، وہاں آپ نے بیت اللہ کا اورصفا مروہ کا طواف کیا ۔ اس سے زیادہ ( کوئی اور طواف ) نہیں کیا ، نہ قربانی کی نہ بال منڈوائے ، نہ کتروائے اور نہ کسی ایسی ہی چیز کو اپنےلئے حلال قرار دیا جو ( احرام کی وجہ سے آپ پر ) حرام تھی ۔ یہاں تک کہ جب نحر کادن ( دس ذوالحجہ ) آیاتو آپ نے قربانی کی اور سرمنڈایا ۔ ان ( عبداللہ بن عمر رضی اللہ تعالیٰ عنہ ) کی رائے یہی تھی کہ انھوں نے اپنے طواف کے ذریعے سے حج وعمرے ( دونوں ) کاطواف مکمل کرلیا ہے ۔ اور ابن عمر رضی اللہ تعالیٰ عنہ نے فرمایا : اللہ کے رسول صلی اللہ علیہ وسلم نے ایسا ہی کیا تھا ( ایک طواف کے ساتھ سعی کی )",
                "urduNarrator": "محمد بن رمح اورقتیبہ نے لیث سے ، انھوں نے نافع سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، ح وحَدَّثَنَا قُتَيْبَةُ - وَاللَّفْظُ لَهُ - حَدَّثَنَا لَيْثٌ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ، أَرَادَ الْحَجَّ عَامَ نَزَلَ الْحَجَّاجُ بِابْنِ الزُّبَيْرِ، فَقِيلَ لَهُ: إِنَّ النَّاسَ كَائِنٌ بَيْنَهُمْ قِتَالٌ، وَإِنَّا نَخَافُ أَنْ يَصُدُّوكَ، فَقَالَ: {لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللهِ أُسْوَةٌ} [الأحزاب: 21] حَسَنَةٌ أَصْنَعُ كَمَا صَنَعَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِنِّي أُشْهِدُكُمْ أَنِّي قَدْ أَوْجَبْتُ عُمْرَةً، ثُمَّ خَرَجَ حَتَّى إِذَا كَانَ بِظَاهِرِ الْبَيْدَاءِ، قَالَ: مَا شَأْنُ الْحَجِّ وَالْعُمْرَةِ إِلَّا وَاحِدٌ، اشْهَدُوا - قَالَ ابْنُ رُمْحٍ: أُشْهِدُكُمْ - أَنِّي قَدْ أَوْجَبْتُ حَجًّا مَعَ عُمْرَتِي، وَأَهْدَى هَدْيًا اشْتَرَاهُ بِقُدَيْدٍ، ثُمَّ انْطَلَقَ يُهِلُّ بِهِمَا جَمِيعًا، حَتَّى قَدِمَ مَكَّةَ، فَطَافَ بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ وَلَمْ يَزِدْ عَلَى ذَلِكَ، وَلَمْ يَنْحَرْ، وَلَمْ يَحْلِقْ، وَلَمْ يُقَصِّرْ، وَلَمْ يَحْلِلْ مِنْ شَيْءٍ حَرُمَ مِنْهُ، حَتَّى كَانَ يَوْمُ النَّحْرِ فَنَحَرَ وَحَلَقَ، وَرَأَى أَنْ قَدْ قَضَى طَوَافَ الْحَجِّ وَالْعُمْرَةِ بِطَوَافِهِ الْأَوَّلِ . وَقَالَ ابْنُ عُمَرَ: «كَذَلِكَ فَعَلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10557,
                "hadithNumber": "2993",
                "englishNarrator": "This hadith has been narrated from Ibn Umar رضی اللہ عنہ through another chain of transmitters except with (this variation):",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was mentioned in the first part of the hadith,. i.e. when it was said to him: They would bar you (from going) to the House. He said: In that, case I would do what Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had done. He did not mention at the end of this hadith (i.e. these words): This is how the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had done, as it Is narrated by al-Laith.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کا ذکر صرف حدیث کی ابتداء میں کیا کہ جب ان سے کہا گیا کہ وہ آپ کو بیت اللہ ( تک پہنچنے ) سے روک دیں گے ، انھوں نے کہا : میں اسی طرح کروں گا جس طرح رسول اللہ صلی اللہ علیہ وسلم نے کیا تھا ۔ اورحدیث کے آخر میں یہ نہیں کہا کہ اللہ کے رسول صلی اللہ علیہ وسلم نے ایسا ہی کیا تھا جیسا کہ لیث نے کہا ہے ۔",
                "urduNarrator": "ہم سے ابو الربیع الزہرانی اور ابو کامل نے بیان کیا، کہا کہ ہم سے حماد نے بیان کیا، مجھ سے زہیر بن حرب نے بیان کیا، مجھ سے اسماعیل نے بیان کیا، مجھ سے ان دونوں نے بیان کیا, ایوب نے نافع سے ، انھوں نے ابن عمر رضی اللہ عنہ سے یہی قصہ روایت کیا ہے ، البتہ انھوں نے",
                "hadithArabic": "حَدَّثَنَا أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، وَأَبُو كَامِلٍ، قَالَا: حَدَّثَنَا حَمَّادٌ، ح وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنِي إِسْمَاعِيلُ، كِلَاهُمَا عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، بِهَذِهِ الْقِصَّةِ وَلَمْ يَذْكُرِ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِلَّا فِي أَوَّلِ الْحَدِيثِ حِينَ قِيلَ لَهُ يَصُدُّوكَ عَنِ الْبَيْتِ، قَالَ: إِذَنْ أَفْعَلَ كَمَا فَعَلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَلَمْ يَذْكُرْ فِي آخِرِ الْحَدِيثِ: هَكَذَا فَعَلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، كَمَا ذَكَرَهُ اللَّيْثُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10558,
                "hadithNumber": "2994",
                "englishNarrator": "Nafi' thus reported on the authority of Ibn Umar رضی اللہ عنہ :",
                "hadithEnglish": "We entered into the state of Ihram with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) for Hajj Mufrad and in the narration of Ibn 'Aun (the words are): Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) entered into the state of Ihram (with the intention) of Hajj Mufrad.",
                "hadithUrdu": "ہم نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ صرف حج کاتلبیہ پکارا ۔ اور ابن عون کی روایت میں ہے کہ اللہ کے رسول صلی اللہ علیہ وسلم نے صرف حج کا تلبیہ پکارا ۔",
                "urduNarrator": "یحییٰ بن ایوب اور عبداللہ بن عون ہلالی نے حدیث بیان کی ، ( کہا : ) ہمیں عباد بن عباد مہلبی نے حدیث بیان کی ، ( کہا : ) عبیداللہ بن عمر نے نافع سے ، انھوں نے ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی ہے ۔ یحییٰ کی روایت میں ہے ۔ ابن عمر رضی اللہ عنہ نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَعَبْدُ اللهِ بْنُ عَوْنٍ الْهِلَالِيُّ، قَالَا: حَدَّثَنَا عَبَّادُ بْنُ عَبَّادٍ الْمُهَلَّبِيُّ، حَدَّثَنَا عُبَيْدُ اللهِ بْنُ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ - فِي رِوَايَةِ يَحْيَى - قَالَ: «أَهْلَلْنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِالْحَجِّ مُفْرَدًا، - وَفِي رِوَايَةِ ابْنِ عَوْنٍ - أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَهَلَّ بِالْحَجِّ مُفْرَدًا».",
                "headingArabic": "فِي الإِفْرَادِ وَالْقِرَانِ",
                "headingUrdu": "افراد اور قرن",
                "headingEnglish": "Ifrad and Qiran",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10559,
                "hadithNumber": "2995",
                "englishNarrator": "Anas ( رضی اللہ تعالیٰ عنہ) said:",
                "hadithEnglish": "I heard Allah's Apostle (ﷺ) pronouncing Talbiya for both Hajj and Umra. Bakr (one of the narrators) said: I narrated it to Ibn 'Umar رضی اللہ تعالیٰ عنہ , whereupon he said: He (the Holy Prophet) pronounced the Talbiya for Hajj alone. I met Anas رضی اللہ تعالیٰ عنہ and narrated to him the words of Ibn 'Umar, whereupon he said: You treat us not but only as children. I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) pronouncing Talbiya both for 'Umra and Hajj.",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم کو حج وعمرے کا اکٹھا تلبیہ پکارتے ہوئے سنا ۔ بکر نے کہا : میں نے ( حضرت انس رضی اللہ تعالیٰ عنہ کی ) یہ بات حضرت ابن عمر رضی اللہ تعالیٰ عنہ کو بتائی تو انھوں نے فرمایا کہ اللہ کے رسول صلی اللہ علیہ وسلم نے اکیلے حج ہی کا تلبیہ پکارا تھا ۔ ( بکر نے کہا : ) پھر میری ملاقات حضرت انس رضی اللہ تعالیٰ عنہ سے ہوئی تو میں نے انھیں ابن عمر رضی اللہ تعالیٰ عنہ کاقول سنایا ، حضرت انس رضی اللہ تعالیٰ عنہ نے فرمایا : ( اس وقت کے لحاظ سے ) تم ہمیں بچے ہی سمجھتے ہو؟ ( حالانکہ ایسانہ تھا ) میں نے خود رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا \"\" لبيك عمرة وحجا \"\" اےاللہ میں حج اور عمرے کے لئے حاضر ہوں ۔ \"\"",
                "urduNarrator": "ہم سے سریج بن یونس نے بیان کیا، کہا ہم سے ہشیم نے بیان کیا، انہوں نے کہا حمید نے بکر سے حدیث بیان کی ، انھوں نے حضرت انس رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا سُرَيْجُ بْنُ يُونُسَ، حَدَّثَنَا هُشَيْمٌ، حَدَّثَنَا حُمَيْدٌ، عَنْ بَكْرٍ، عَنْ أَنَسٍ رَضِيَ اللهُ عَنْهُ، قَالَ: سَمِعْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «يُلَبِّي بِالْحَجِّ وَالْعُمْرَةِ جَمِيعًا» قَالَ بَكْرٌ: فَحَدَّثْتُ بِذَلِكَ ابْنَ عُمَرَ، فَقَالَ: «لَبَّى بِالْحَجِّ وَحْدَهُ» فَلَقِيتُ أَنَسًا فَحَدَّثْتُهُ بِقَوْلِ ابْنِ عُمَرَ، فَقَالَ أَنَسٌ: مَا تَعُدُّونَنَا إِلَّا صِبْيَانًا، سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَبَّيْكَ عُمْرَةً وَحَجًّا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10560,
                "hadithNumber": "2996",
                "englishNarrator": "Bakr bin 'Abdullah reported Anas ( رضی اللہ تعالیٰ عنہ) had narrated to us that h:",
                "hadithEnglish": "He saw Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) combining Hajj and 'Umra. He (Bakr) said: I asked (about it) from Ibn 'Umar رضی اللہ تعالیٰ عنہ , whereupon he said: We entered into the state of Ihram for Hajj (only). I came to Anas رضی اللہ تعالیٰ عنہ and told him what Ibn Umar رضی اللہ تعالیٰ عنہ had said, whereupon he remarked: (You are treating us) as if we were children.",
                "hadithUrdu": "انھوں نے نبی کریم صلی اللہ علیہ وسلم کو دیکھا کہ آپ نے ان دونوں کو ملایاتھا ، حج اور عمرے کو ۔ ( بکر نے ) کہا : میں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے اس کے متعلق دریافت کیا تو انھوں نے فرمایا : ہم نے ( صرف ) حج کا تلبیہ کہا تھا ۔ ( بکر نے کہا : ) پھر میں نے حضرت انس رضی اللہ تعالیٰ عنہ سے رجوع کیا اور انھیں ابن عمر رضی اللہ تعالیٰ عنہ کی بات بتائی ۔ انھوں نے جواب دیا : جیسے ہم تو اس وقت بچے تھے؟",
                "urduNarrator": "اور مجھ سے امیہ بن بسطا م العیشی نے بیان کیا، یعنی ابن زرعی نے,حبیب بن شہید نے بکر بن عبداللہ سے روایت کی ، ( کہا : ) ہمیں حضرت انس رضی اللہ تعالیٰ عنہ نے حدیث بیا ن کی کہ",
                "hadithArabic": "وَحَدَّثَنِي وأُمَيَّةُ بْنُ بِسْطَامَ الْعَيْشِيُّ، حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ، حَدَّثَنَا حَبِيبُ بْنُ الشَّهِيدِ، عَنْ بَكْرِ بْنِ عَبْدِ اللهِ، حَدَّثَنَا أَنَسٌ رَضِيَ اللهُ عَنْهُ، أَنَّهُ رَأَى النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «جَمَعَ بَيْنَهُمَا بَيْنَ الْحَجِّ وَالْعُمْرَةِ» قَالَ: فَسَأَلْتُ ابْنَ عُمَرَ، فَقَالَ: «أَهْلَلْنَا بِالْحَجِّ» فَرَجَعْتُ إِلَى أَنَسٍ فَأَخْبَرْتُهُ مَا قَالَ ابْنُ عُمَرَ، فَقَالَ: «كَأَنَّمَا كُنَّا صِبْيَانًا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10561,
                "hadithNumber": "2997",
                "englishNarrator": "Wabara reported While I was sitting in the company of Ibn 'Umar رضی اللہ تعالیٰ عنہ :",
                "hadithEnglish": "A person came to him and said: Is it right for me to circumambulate the House before I come to stay (at 'Arafat)? Ibn 'Umar رضی اللہ تعالیٰ عنہ said: Yes. whereupon he said: Ibn Abbas رضی اللہ تعالیٰ عنہ , however, says: Do not circumambulate the House until you come to stay at 'Arafat. Thereupon Ibn 'Umar رضی اللہ تعالیٰ عنہ said: Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) Performed the Hajj and circumambulated the House before coming to stay (at 'Arafat). If you say the Truth, is it more rightful to follow the saying of the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) or the words of Ibn Abbas رضی اللہ تعالیٰ عنہ ?",
                "hadithUrdu": "ان کے پاس ایک شخص آیا ، اس نے پوچھا : کیا عرفات پہنچنے سے پہلے میں بیت اللہ کا طواف کرسکتا ہوں؟انھوں نے جواب دیا ، ہاں ( کرسکتے ہو ) اس نے کہا : ابن عباس رضی اللہ تعالیٰ عنہ نے تو کہا ہے کہ عرفہ پہنچنے سے قبل بیت اللہ کا طواف نہ کرنا ۔ ابن عمر رضی اللہ تعالیٰ عنہ نے اسے جواب دیا : ( سنو! ) اللہ کے رسول صلی اللہ علیہ وسلم نے جب حج فرمایا تو آپ نے میدان عرفات پہنچنے سے قبل بیت اللہ کا طواف کیاتھا ۔ ( اب سوچو ) کہ تم اللہ کے رسول صلی اللہ علیہ وسلم کا قول ا پناؤ یہ زیادہ حق ہے؟یا یہ کہ ابن عباس رضی اللہ تعالیٰ عنہ کا قول؟اگر تم ( ان کے بارے میں ) سچ کہہ رہے ہو ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا ہم سےعبتر نے بیان کیا, اسماعیل بن ابی خالد نے وبرہ سے روایت کی ، کہا : میں حضرت ابن عمر رضی اللہ تعالیٰ عنہ کے پاس بیٹھا ہوا تھا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا عَبْثَرٌ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، عَنْ وَبَرَةَ، قَالَ: كُنْتُ جَالِسًا عِنْدَ ابْنِ عُمَرَ فَجَاءَهُ رَجُلٌ فَقَالَ: أَيَصْلُحُ لِي أَنْ أَطُوفَ بِالْبَيْتِ قَبْلَ أَنْ آتِيَ الْمَوْقِفَ، فَقَالَ: نَعَمْ، فَقَالَ: فَإِنَّ ابْنَ عَبَّاسٍ يَقُولُ: لَا تَطُفْ بِالْبَيْتِ حَتَّى تَأْتِيَ الْمَوْقِفَ، فَقَالَ ابْنُ عُمَرَ: «فَقَدْ حَجَّ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَطَافَ بِالْبَيْتِ قَبْلَ أَنْ يَأْتِيَ الْمَوْقِفَ» فَبِقَوْلِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَحَقُّ أَنْ تَأْخُذَ، أَوْ بِقَوْلِ ابْنِ عَبَّاسٍ إِنْ كُنْتَ صَادِقًا.",
                "headingArabic": "استحاب طواف القدوم للحجاج والسعي بعده",
                "headingUrdu": "حاجی کے لیے مستحب ہے کہ طواف قدوم اور اس کے بعد سعی کرے۔",
                "headingEnglish": "It is recommended for the pilgrim to perform Tawaf Al-Qudum and As-Sa'i after it",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10562,
                "hadithNumber": "2998",
                "englishNarrator": "Wabara reported:",
                "hadithEnglish": "A person asked Ibn Umar (رضی اللہ تعالیٰ عنہ): May I circumambulate the House, whereas I have entered-into the state of Ihram for Hajj? Thereupon he said: What prevents you from doing it? He said: I saw the son of so and so showing disapproval of it, and you are dearer to us as compared with him. And we see that he is allured by the world, whereupon he said: Who amongst you and us is not allured by the world? And said (further)': 'We saw that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) put on Ihram for Hajj and circumambulated the House and run between al Safa' and al-Marwa. And the way prescribed by Allah and that prescribed by His Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) deserve more to be followed than the way shown by so and so, if you speak the truth.",
                "hadithUrdu": "ایک شخص نے سیدنا ابن عمر رضی اللہ تعالیٰ عنہ سے سوال کیا : میں نےحج کا احرام باندھا ہے ، تو کیا میں بیت اللہ کاطواف کرلوں؟انھوں نے فرمایا : ( ہاں ) تمھیں کیا مانع ہے؟اس نے کہا : میں نے ابن فلاں ( ابن عباس رضی اللہ تعالیٰ عنہ ) کو دیکھا ہے کہ وہ اسے ناپسندکرتے ہیں اور آپ ہمیں ان سے زیادہ محبوب ہیں ہم نے دیکھا ہے کہ دنیا نے انھیں فتنے میں ڈال دیا ہے حضرت ابن عمر رضی اللہ تعالیٰ عنہ نے کہا : ہم میں سے کون یاتم میں سے کون ۔ جسے دنیا نے فتنے میں نہیں ڈالا؟ ( تم ان پر دنیا داری کا اعتراض نہ کرو ، ) پھر فرمایا : ہم نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا ، آپ نے حج کااحرام باندھا ، بیت اللہ کاطواف کیا اور صفا مروہ کی سعی فرمائی ، ( اب سوچو ) اللہ تعالیٰ اور اس کے رسول صلی اللہ علیہ وسلم کے طریقے کی پیروی کا زیادہ حق ہے ۔ یافلاں کے راستے کا کہ اس کی اتباع کی جائے؟اگر تم سچ کہہ رہے ہو ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا کہ ہم سے جریر نے بیان کیا، ایک بیان نے وبرہ سے روایت کی ، کہا",
                "hadithArabic": "وحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنْ بَيَانٍ، عَنْ وَبَرَةَ، قَالَ: سَأَلَ رَجُلٌ ابْنَ عُمَرَ رَضِيَ اللهُ عَنْهُمَا أَطُوفُ بِالْبَيْتِ وَقَدْ أَحْرَمْتُ بِالْحَجِّ؟ فَقَالَ: وَمَا يَمْنَعُكَ؟ قَالَ: إِنِّي رَأَيْتُ ابْنَ فُلَانٍ يَكْرَهُهُ وَأَنْتَ أَحَبُّ إِلَيْنَا مِنْهُ، رَأَيْنَاهُ قَدْ فَتَنَتْهُ الدُّنْيَا، فَقَالَ: وَأَيُّنَا - أَوْ أَيُّكُمْ - لَمْ تَفْتِنْهُ الدُّنْيَا؟ ثُمَّ قَالَ: «رَأَيْنَا رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَحْرَمَ بِالْحَجِّ، وَطَافَ بِالْبَيْتِ، وَسَعَى بَيْنَ الصَّفَا وَالْمَرْوَةِ»، فَسُنَّةُ اللهِ وَسُنَّةُ رَسُولِهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَحَقُّ أَنْ تَتَّبِعَ مِنْ سُنَّةِ فُلَانٍ، إِنْ كُنْتَ صَادِقًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10563,
                "hadithNumber": "2999",
                "englishNarrator": "Amr bin Dinar said:",
                "hadithEnglish": "We asked Ibn Umar رضی اللہ تعالیٰ عنہ about a person who came for Umra and circumambulated the House, but he did not run between al-Safa' and al-Marwa, whether he is allowed to (put off Ihram) and have intercourse with his wife. He replied: Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) circumambulated the House seven times and offered two rak'ahs of prayer after staying (at 'Arafat), and ran between al-Safa and al-Marwa seven times. Verily there is in Allah's Messenger a model pattern for you (xxxill. 21).",
                "hadithUrdu": "ہم نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے اس شخص کے متعلق پوچھا جو عمرے کی غرض سے آیا ، اس نے بیت اللہ کاطواف کرلیا ( لیکن ابھی ) صفا مروہ کی سعی نہیں کی ، کیا وہ اپنی بیوی سے صحبت کرسکتا ہے؟انھوں نے فرمایا : ( جب ) رسول اللہ صلی اللہ علیہ وسلم تشریف لائے تھے تو آپ نے بیت اللہ کا سات بار طواف کیا ، مقام ابراہیم کے پیچھے دو رکعتیں ادا فرمائیں ، اور ( پھر ) صفا مروہ کے درمیان سات بار چکر لگائے ۔ اور ( یاد رکھو ) تمھارے لئے اللہ کے رسول صلی اللہ علیہ وسلم ( کے طریقے ) میں بہترین نمونہ ہے ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، انہوں نے ہم سے بیان کیا سفیان بن عینیہ نے عمرو بن دینار سے حدیث بیان کی ، کہا",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، قَالَ: سَأَلْنَا ابْنَ عُمَرَ عَنْ رَجُلٍ قَدِمَ بِعُمْرَةٍ، فَطَافَ بِالْبَيْتِ وَلَمْ يَطُفْ بَيْنَ الصَّفَا وَالْمَرْوَةِ، أَيَأْتِي امْرَأَتَهُ؟ فَقَالَ: «قَدِمَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَطَافَ بِالْبَيْتِ سَبْعًا، وَصَلَّى خَلْفَ الْمَقَامِ رَكْعَتَيْنِ، وَبَيْنَ الصَّفَا وَالْمَرْوَةِ سَبْعًا، وَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللهِ أُسْوَةٌ حَسَنَةٌ».",
                "headingArabic": "بيان أن المحرم بعمرة لا يتحلل بالطواف قبل السعي وأن المحرم بححج لا يتحلل بطواف القدوم وكذلك القارن",
                "headingUrdu": "واضح کرنا کہ عمرہ کا احرام باندھنے والا سعی سے پہلے طواف کرنے کے بعد احرام سے باہر نہ نکلے۔ اور حج کا احرام باندھنے والا طواف قدوم کرنے کے بعد احرام سے باہر نہ نکلے، اور یہی حال حج کے لیے بھی ہے",
                "headingEnglish": "Clarifying that the pilgrim who has entered Ihram for Umrah should not exit Ihram after performing Tawaf before Sa'i; And the pilgrim who has entered Ihram for Hajj should not exit Ihram after performing Tawaf Al-Qudum, and the same applies to the pilgrim performing Qiran",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 10251,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=410",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=408",
                "label": "408",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=409",
                "label": "409",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=410",
                "label": "410",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=411",
                "label": "411",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=412",
                "label": "412",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=413",
                "label": "413",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=414",
                "label": "414",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=412",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=412",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=410",
        "to": 10275,
        "total": 40465
    }
}