{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 493,
        "data": [
            {
                "id": 12589,
                "hadithNumber": "5026",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been transmitted on the authority of Hisham.",
                "hadithUrdu": "ہم سے یحییٰ بن یحییٰ نے بیان کیا, ابو معاویہ اور ابو اسامہ دونوں نے ہشام سے اسی سند کے ساتھ روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَاهُ يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، ح وحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، كِلَاهُمَا عَنْ هِشَامٍ بِهَذَا الْإِسْنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12590,
                "hadithNumber": "5027",
                "englishNarrator": "Ibn 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was asked about the eating of (the flesh) of the lizard, whereupon he said: I am neither the eater of it nor its prohibitor.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم سے سانڈے (چھپکلی)کے متعلق سوال کیا گیا تو آپ نے فرما یا : \" میں اس کو نہ کھاتا ہو نہ حرام کرتا ہوں ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ، یحییٰ بن ایوب، قتیبہ اور ابن حجر نے اسماعیل کی سند سے بیان کیا۔ اسماعیل بن جعفر, عبد اللہ بن دینار سے روایت ہے ، انھوں نے حضرت ابن عمر رضی اللہ عنہ کو کہتے ہو ئے سنا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَيَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ وَابْنُ حُجْرٍ عَنْ إِسْمَعِيلَ قَالَ يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا إِسْمَعِيلُ بْنُ جَعْفَرٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ أَنَّهُ سَمِعَ ابْنَ عُمَرَ يَقُولُ سُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الضَّبِّ فَقَالَ لَسْتُ بِآكِلِهِ وَلَا مُحَرِّمِهِ.",
                "headingArabic": "إِبَاحَةِ الضَّبِّ ‏‏",
                "headingUrdu": "دب(چھپکلی) کھانے کی اجازت",
                "headingEnglish": "The permissibility of eating the Dabb (mastigure)",
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12591,
                "hadithNumber": "5028",
                "englishNarrator": "Ibn 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "A person asked Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) about the eating of the lizard, whereupon he said. I neither eat it, nor do I prohibit it",
                "hadithUrdu": "ایک شخص نے رسول اللہ صلی اللہ علیہ وسلم سے سانڈا کھا نے کے متعلق سوال کیا تو آپ نے فرما یا : \" نہ میں اس کو کھاتا ہوں ، نہ حرا م کرتا ہوں ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, لیث نے نافع سے ، انھوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وحَدَّثَنِي مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ: سَأَلَ رَجُلٌ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ أَكْلِ الضَّبِّ، فَقَالَ: «لَا آكُلُهُ، وَلَا أُحَرِّمُهُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12592,
                "hadithNumber": "5029",
                "englishNarrator": "Ibn 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "A person asked Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as he was sitting on the pulpit about the eating of the lizard, whereupon he said: I neither eat it, nor do I prohibit it.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم منبر پر تھے کہ ایک شخص نے رسول اللہ صلی اللہ علیہ وسلم سے سانڈا کھا نے کے بارے میں سوال کیا تو آپ نے فرما یا : \" میں اس کو کھاتا ہو ں نہ حرا م کرتاہوں ۔ \"",
                "urduNarrator": "عبد اللہ بن نمیر نے کہا : ہمیں عبید اللہ نے حدیث بیان کی ، انھوں نے نافع سے ، انھوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ: سَأَلَ رَجُلٌ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَهُوَ عَلَى الْمِنْبَرِ، عَنْ أَكْلِ الضَّبِّ، فَقَالَ: «لَا آكُلُهُ، وَلَا أُحَرِّمُهُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12593,
                "hadithNumber": "5030",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of 'Ubaidullah with the same chain of transmitters.",
                "hadithUrdu": "ہم سے عبید اللہ بن سعید نے بیان کیا, یحییٰ نے عبید اللہ سے اسی سند سے اسی کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا عُبَيْدُ اللهِ بْنُ سَعِيدٍ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللهِ، بِمِثْلِهِ فِي هَذَا الْإِسْنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12594,
                "hadithNumber": "5031",
                "englishNarrator": "A hadith pertaining to the eating of the lizard is transmitted from the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) on the authority of Ibn 'Umar رضی اللہ عنہ , but in this very hadith narrated through a different chain of transmitters there is a slight variation of wording (and the words are):",
                "hadithEnglish": "A lizard was brought to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) but he neither ate that nor declared it unlawful. And in the hadith transmitted through Usama (the words are): The man (inquirer) was standing in the mosque and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was sitting on the pulpit.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے پاس سانڈا ( پکا کر ) لایا گیا تو آپ نے اسے نہ کھا یا نہ حرام قرار دیا ۔ اسامہ کی حدیث میں کہا : ایک آدمی مسجد میں کھڑا ہوا جبکہ رسول اللہ صلی اللہ علیہ وسلم منبر پر تھے ۔",
                "urduNarrator": "ہم سے ابو الربیع اور قتیبہ نے بیان کیا، کہا: ہم سے حماد نے بیان کیا، اور مجھ سے زہیر بن حرب نے بیان کیا، ہم سے اسماعیل نے بیان کیا، ایوب ، مالک بن مغول ، ابن جریج ، موسیٰ بن عقبہ اور اسامہ سب نے نافع سے ، انھوں نے حضرت ابن عمر رضی اللہ عنہ سے ، انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے سانڈے کے بارے میں نافع سے روایت کردہ لیث کی حدیث کے ہم معنی روایت بیان کی ، البتہ ایوب کی حدیث میں ہے کہ",
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو الرَّبِيعِ، وَقُتَيْبَةُ، قَالَا: حَدَّثَنَا حَمَّادٌ، ح وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ، كِلَاهُمَا عَنْ أَيُّوبَ، ح وحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا مَالِكُ بْنُ مِغْوَلٍ، ح وحَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللهِ، أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، ح وحَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللهِ، حَدَّثَنَا شُجَاعُ بْنُ الْوَلِيدِ، قَالَ: سَمِعْتُ مُوسَى بْنَ عُقْبَةَ، ح وحَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي أُسَامَةُ، كُلُّهُمْ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي الضَّبِّ، بِمَعْنَى حَدِيثِ اللَّيْثِ، عَنْ نَافِعٍ، غَيْرَ أَنَّ حَدِيثَ أَيُّوبَ: أُتِيَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِضَبٍّ، فَلَمْ يَأْكُلْهُ، وَلَمْ يُحَرِّمْهُ، وَفِي حَدِيثِ أُسَامَةَ، قَالَ: قَامَ رَجُلٌ فِي الْمَسْجِدِ وَرَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12595,
                "hadithNumber": "5032",
                "englishNarrator": "Ibn 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "There were some persons with Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) from among his Companions, Sa'd رضی اللہ عنہ being one of them. There was brought to them the flesh of the lizard when a lady amongst the wives of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: It is the flesh of the lizard. Thereupon Allah's Messenger (ﷺ) said: Eat, for it is lawful, but it is not my diet.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے ساتھ آپ کے کچھ صحابہ کرام رضوان اللہ عنھم اجمعین تھے ۔ ان میں حضرت سعد رضی اللہ عنہ بھی تھے ۔ اتنے میں سانڈے کا گو شت لا یا گیا : اس وقت نبی صلی اللہ علیہ وسلم کی کسی زوجہ نے یہ آواز دی کہ یہ سانڈے کا گوشت ہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" کھاؤ ، بلا شبہ حلال ہے لیکن یہ میرے کھانے میں ( شامل ) نہیں ۔ \"",
                "urduNarrator": "عبید اللہ کے والد معاذ نے کہا : ہمیں شعبہ نے تو بہ عنبری سے حدیث بیان کی ، انھوں نے شعبی سے سنا ، انھوں نے حضرت ابن عمر رضی اللہ عنہ سے سنا کہ",
                "hadithArabic": "وحَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ تَوْبَةَ الْعَنْبَرِيِّ، سَمِعَ الشَّعْبِيَّ، سَمِعَ ابْنَ عُمَرَ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ مَعَهُ نَاسٌ مِنْ أَصْحَابِهِ، فِيهِمْ سَعْدٌ، وَأُتُوا بِلَحْمِ ضَبٍّ، فَنَادَتِ امْرَأَةٌ مِنْ نِسَاءِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِنَّهُ لَحْمُ ضَبٍّ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «كُلُوا فَإِنَّهُ حَلَالٌ، وَلَكِنَّهُ لَيْسَ مِنْ طَعَامِي».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12596,
                "hadithNumber": "5033",
                "englishNarrator": "Taubat Al-'Anbari reported:",
                "hadithEnglish": "Al-Sha'bi (one of the narrators) asked me if I had heard the hadith transmitted on the authority of Hasan from the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). He said: I sat in the company if Ibn 'Umar رضی اللہ عنہ for two years or a year and a half but I did not hear narrated from Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) but this one (pertaining to the flesh of the lizard) as narrated by Mu'adh.",
                "hadithUrdu": "شعبی نے مجھ سے کہا : تم حسن ( بصری ) کی رسول اللہ صلی اللہ علیہ وسلم سے بیان کردہ ( مرسل ) حدیث دیکھی ( سنی اور لکھی ہو ئی دیکھی ، اور اس کے مرسل ہونے پر غور کیا؟ ) میں تو حضرت ابن معر رضی اللہ عنہ کے ساتھ ڈیڑھ یا دوسال تک ( اٹھتا ) بیٹھتا رہا لیکن میں نے انھیں اس حدیث کے علاوہ رسول اللہ صلی اللہ علیہ وسلم سے کو ئی اور حدیث روایت کرتے ہو ئے نہیں سنا ۔ انھوں نے ( اس طرح ) کہا : رسول اللہ صلی اللہ علیہ وسلم کے صحابہ کرام رضوان اللہ عنھم اجمعین میں سے بہت سے لو گ ( مو جودتھے ) ان میں سعد رضی اللہ عنہ بھی شامل تھے ۔ معاذ کی حدیث کے مانند ۔",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا, محمدبن جعفر نے کہا : ہمیں شعبہ نے تو بہ عنبری سے حدیث بیان کی ، انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ تَوْبَةَ الْعَنْبَرِيِّ، قَالَ: قَالَ لِي الشَّعْبِيُّ: أَرَأَيْتَ حَدِيثَ الْحَسَنِ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ؟ وَقَاعَدْتُ ابْنَ عُمَرَ قَرِيبًا مِنْ سَنَتَيْنِ، أَوْ سَنَةٍ وَنِصْفٍ، فَلَمْ أَسْمَعْهُ رَوَى عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ غَيْرَ هَذَا، قَالَ: كَانَ نَاسٌ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِيهِمْ سَعْدٌ بِمِثْلِ حَدِيثِ مُعَاذٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12597,
                "hadithNumber": "5034",
                "englishNarrator": "Abdullah bin 'Abbas رضی اللہ عنہ reported:",
                "hadithEnglish": "I and Khalid bin Walid رضی اللہ عنہ went to the apartment of Maimuna رضی اللہ عنہا along with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), and there was presented to him a roasted lizard. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) stretched his hand towards It, whereupon some of the women who had been in the house of Maimuna رضی اللہ عنہا said: Inform Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) what he intends to eat. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) lifted his hand. I said: Messenger of Allah, Is it forbidden? He said: No. It is not found in the land of my people, and I feel that I have no liking for it. Khalid رضی اللہ عنہ said: I then chewed and ate it, while, Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was looking (at me).",
                "hadithUrdu": "میں اور حضرت خالد بن ولید رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ حضرت میمونہ رضی اللہ عنہا کے گھر گئے ، اتنے میں ایک بھنا ہوا سانڈا لا یا گیا ، رسول اللہ صلی اللہ علیہ وسلم نے اس کی طرف ہاتھ بڑھانے کا قصد کیا ، حضرت میمونہ رضی اللہ تعالیٰ عنہا کے گھر جو عورتیں تھیں ۔ ان میں سے کسی نے کہا : رسول اللہ صلی اللہ علیہ وسلم جو چیز کھانے لگے ہیں وہ آپ کو بتا دو ، ( یہ سنتے ہی ) آپ نے اپنا ہاتھ کھینچ لیا ۔ میں نے پوچھا : یا رسول اللہ صلی اللہ علیہ وسلم ! کیا یہ حرا م ہے؟ آپ نے فر ما یا : \"\" نہیں لیکن یہ ( جا نور ) میری قوم کی سر زمین میں نہیں ہو تا ، اس لیے میں خود کو اس سے کرا ہت کرتے ہو ئے پاتا ہوں ۔ \"\" حضرت خالد ( بن ولید ) رضی اللہ عنہ نے کہا : پھر میں نے اس کو ( اپنی طرف ) کھینچا اور کھا لیا جبکہ رسول اللہ صلی اللہ علیہ وسلم دیکھ رہے تھے ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا : امام مالک نے ابن شہاب سے انھوں نے ابو امامہ بن سہل بن حنیف سے ، انھوں نے حضرت عبد اللہ بن عباس رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، عَنْ عَبْدِ اللهِ بْنِ عَبَّاسٍ، قَالَ: دَخَلْتُ أَنَا وَخَالِدُ بْنُ الْوَلِيدِ، مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَيْتَ مَيْمُونَةَ، فَأُتِيَ بِضَبٍّ مَحْنُوذٍ، فَأَهْوَى إِلَيْهِ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِيَدِهِ، فَقَالَ بَعْضُ النِّسْوَةِ اللَّاتِي فِي بَيْتِ مَيْمُونَةَ: أَخْبِرُوا رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمَا يُرِيدُ أَنْ يَأْكُلَ، فَرَفَعَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَدَهُ، فَقُلْتُ: أَحَرَامٌ هُوَ يَا رَسُولَ اللهِ؟ قَالَ: «لَا، وَلَكِنَّهُ لَمْ يَكُنْ بِأَرْضِ قَوْمِي فَأَجِدُنِي أَعَافُهُ»، قَالَ خَالِدٌ: فَاجْتَرَرْتُهُ فَأَكَلْتُهُ وَرَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَنْظُرُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12598,
                "hadithNumber": "5035",
                "englishNarrator": "Abdullah bin 'Abbas رضی اللہ عنہ reported:",
                "hadithEnglish": "Khalid bin Walid رضی اللہ عنہ who is called the Sword of Allah had informed him that he visited Maimuna رضی اللہ عنہا , the wife of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), in the company of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), and she was the sister of his mother (that of Khalid) and that of 'Ibn Abbas رضی اللہ عنہ, and he found with her a roasted lizard which her sister Hufaida the daughter of al-Harith رضی اللہ عنہا had brought from Najd, and she presented that lizard to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). It was rare that some food was presented to the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and it was not mentioned or named. While Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was about to stretch forth his hand towards the lizard, a woman from amongst the women present there informed the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) what they had presented to him. They said: Messenger of Allah, it is a lizard. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) withdrew his hand, whereupon Khalid bin Walid رضی اللہ عنہ said: Messenger of Allah, is a lizard forbidden? There open he said: No, but it is not found in the land of my people, and I feel that I have no liking for it. Khalid رضی اللہ عنہ said: I then chewed and ate it, and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was looking at me and he did not forbid (me to eat it).",
                "hadithUrdu": "حضرت خالد بن ولید رضی اللہ عنہ نے جنھیں سیف اللہ کہا جا تا ہے ، انھیں خبر دی کہ وہ رسول اللہ صلی اللہ علیہ وسلم کے ہمرا ہ رسول اللہ صلی اللہ علیہ وسلم کی زوجہ حضرت میمونہ رضی اللہ عنہا کے ہاں گئے وہ ان ( حضرت خالد ) اور حضرت ابن عباس رضی اللہ  عنہ کی خالہ تھیں ۔ ان کے ہاں آپ صلی اللہ علیہ وسلم نے ایک بھنا ہوا سانڈا دیکھا جو ان کی بہن حفیدہ بنت حارث رضی اللہ عنہا نجد سے لا ئی تھیں ۔ انھوں نے وہ سانڈا رسول اللہ صلی اللہ علیہ وسلم کے سامنے پیش کیا ، ایسا کم ہو تا کہ آپ کسی کھانے کی طرف ہاتھ بڑھا تے یہاں تک کہ آپ کو اس کے بارے میں بتا یا جا تا اور آپ کے سامنے اس کا نام لیا جا تا ۔ ( اس روز ) آپ نے سانڈے کی طرف ہاتھ بڑھانا چا ہا تو وہاں مو جود خواتین میں سے ایک خاتون نے کہا : رسول اللہ صلی اللہ علیہ وسلم کو بتاؤ کہ آپ لوگوں نے انھیں کیا پیش کیا ہے ۔ تو انھوں نے کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! یہ سانڈا ہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے ہا تھ اوپر کر لیا تو حضرت خالد بن ولید رضی اللہ عنہ نے پو چھا : یا رسول اللہ صلی اللہ علیہ وسلم ! کیا سانڈا حرام ہے؟ آپ نے فر ما یا : \"\" نہیں لیکن یہ میری قوم کے علاقے میں نہیں ہو تا ، میں خود کو اس سے کرا ہت کرتے ہو ئے پا تا ہوں ۔ حضرت خالد رضی اللہ  عنہ نے کہا : پھر میں نے اس کو ( اپنی طرف ) کھینچا اور کھا لیا اور رسول اللہ صلی اللہ علیہ وسلم دیکھ رہے تھے لیکن آپ نے مجھے منع نہیں فر ما یا ۔ \"\"",
                "urduNarrator": "یو نس نے ابن شہاب سے ، انھوں نے ابو امامہ بن سہل بن حنیف انصاری سے روایت کی کہ حضرت عبد اللہ بن عباس رضی اللہ عنہ نے انھیں بتا یا کہ",
                "hadithArabic": "وحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، جَمِيعًا عَنِ ابْنِ وَهْبٍ، قَالَ حَرْمَلَةُ: أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ الْأَنْصَارِيِّ، أَنَّ عَبْدَ اللهِ بْنَ عَبَّاسٍ، أَخْبَرَهُ، أَنَّ خَالِدَ بْنَ الْوَلِيدِ، الَّذِي يُقَالُ لَهُ: سَيْفُ اللهِ، أَخْبَرَهُ، أَنَّهُ دَخَلَ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى مَيْمُونَةَ، زَوْجِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَهِيَ خَالَتُهُ وَخَالَةُ ابْنِ عَبَّاسٍ، فَوَجَدَ عِنْدَهَا ضَبًّا مَحْنُوذًا، قَدِمَتْ بِهِ أُخْتُهَا حُفَيْدَةُ بِنْتُ الْحَارِثِ مِنْ نَجْدٍ، فَقَدَّمَتِ الضَّبَّ لِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَكَانَ قَلَّمَا يُقَدَّمُ إِلَيْهِ طَعَامٌ حَتَّى يُحَدَّثَ بِهِ وَيُسَمَّى لَهُ، فَأَهْوَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَدَهُ إِلَى الضَّبِّ، فَقَالَتِ امْرَأَةٌ مِنَ النِّسْوَةِ الْحُضُورِ: أَخْبِرْنَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمَا قَدَّمْتُنَّ لَهُ، قُلْنَ: هُوَ الضَّبُّ يَا رَسُولَ اللهِ، فَرَفَعَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَدَهُ، فَقَالَ خَالِدُ بْنُ الْوَلِيدِ: أَحَرَامٌ الضَّبُّ يَا رَسُولَ اللهِ؟ قَالَ: «لَا، وَلَكِنَّهُ لَمْ يَكُنْ بِأَرْضِ قَوْمِي فَأَجِدُنِي أَعَافُهُ»، قَالَ خَالِدٌ: فَاجْتَرَرْتُهُ، فَأَكَلْتُهُ وَرَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَنْظُرُ، فَلَمْ يَنْهَنِي.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12599,
                "hadithNumber": "5036",
                "englishNarrator": "Khalid bin Walid رضی اللہ عنہ reported:",
                "hadithEnglish": "He visited Maimuna رضی اللہ عنہا daughter of al-Harith with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), and she was the sister of his mother. She presented to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) the flesh of a lizard which Umm Hufaid رضی اللہ عنہا daughter of al-Harith had brought from Najd, and she had been married to a person belonging to Banu Ja'far. It was the habit of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) not to eat anything until he knew what that was. The rest of the hadith is the same but with this (addition): Ibn al-Asamm narrated it from Maimuna رضی اللہ عنہا and he was under her care.",
                "hadithUrdu": "وہ رسول اللہ صلی اللہ علیہ وسلم کے ہمرا ہ حضرت میمونہ بنت حا رث رضی اللہ تعالیٰ عنہا کے ہا ں گئے ، وہ ان کی خالہ تھیں ، رسول اللہ صلی اللہ علیہ وسلم کے سامنے سانڈے کا گو شت پیش کیا گیا ، اسے ام حفید بنت حارث رضی اللہ  عنہا نجد سے لا ئی تھیں ، یہ نبو جعفر کے ایک شخص کے نکاح میں تھیں ۔ رسول اللہ صلی اللہ علیہ وسلم اس وقت تک کو ئی چیز تناول نہ فر ما تے تھے ۔ جب تک کہ آپ کو معلوم نہ ہو جائے کہ وہ کیا ہے ۔ پھر انھوں نے یونس کی حدیث کی طرح بیان کیا اور حدیث کے آخر میں اضا فہ کیا اور انھیں ( یزید ) ابن اصم نے ( بھی ) حضرت میمونہ رضی اللہ عنہا سے ( یہی ) حدیث سنائی ، انھوں نے ان ( میمونہ رضی اللہ عنہا ) کے ہاں پرورش پا ئی ۔ ( ان کی والدہ برزہ بنت حارث ام المومنین حضرت میمونہ رضی اللہ عنہا کی بہن تھیں ۔ )",
                "urduNarrator": "مجھ سے ابوبکر بن نضر اور عبد بن حمید نے بیان کیا، انہوں نے کہا: انہوں نے مجھ سے بیان کیا، اور ابوبکر نے کہا: ہم سے یعقوب بن ابراہیم نے بیان کیا۔ سعد، میرے والد نے ہمیں بتایا، صالح بن کیسان نے ابن شہاب سے ، انھوں نے ابو امامہ بن سہل سے ، انھوں نے حضرت ابن عباس رضی اللہ عنہ سے روایت کی ، انھوں نے ان سے بیان کیا کہ انھیں خالد بن ولید رضی اللہ عنہ نے خبر دی کہ",
                "hadithArabic": "وحَدَّثَنِي أَبُو بَكْرِ بْنُ النَّضْرِ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ عَبْدٌ: أَخْبَرَنِي، وقَالَ أَبُو بَكْرٍ: حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ أَخْبَرَهُ أَنَّ خَالِدَ بْنَ الْوَلِيدِ، أَخْبَرَهُ، أَنَّهُ دَخَلَ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى مَيْمُونَةَ بِنْتِ الْحَارِثِ وَهِيَ خَالَتُهُ، فَقُدِّمَ إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لَحْمُ ضَبٍّ جَاءَتْ بِهِ أُمُّ حُفَيْدٍ بِنْتُ الْحَارِثِ مِنْ نَجْدٍ، وَكَانَتْ تَحْتَ رَجُلٍ مِنْ بَنِي جَعْفَرٍ، وَكَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لَا يَأْكُلُ شَيْئًا حَتَّى يَعْلَمَ مَا هُوَ، ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ يُونُسَ، وَزَادَ فِي آخِرِ الْحَدِيثِ: وَحَدَّثَهُ ابْنُ الْأَصَمِّ، عَنْ مَيْمُونَةَ وَكَانَ فِي حَجْرِهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12600,
                "hadithNumber": "5037",
                "englishNarrator": "Ibn 'Abbas رضی اللہ عنہ reported:",
                "hadithEnglish": "While we were in the house of Maimuna رضی اللہ عنہا there were brought to Allah's Messenger two roasted lizards. Here no mention is made of al- 'Asamm narrating from Maimuna رضی اللہ عنہا .",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں دوبھنے ہو ئے سانڈے پیش کیے گئے جبکہ ہم سب حضرت میمونہ رضی اللہ عنہا کے ہاں مو جو دتھے ان سب کی حدیث کے مانند انھوں نے ( معمر ) نے حضرت میمونہ رضی اللہ عنہا سے روایت کردہ یزید بن اصم کی حدیث کا ذکر نہیں کیا ۔",
                "urduNarrator": "ہم سے عبد بن حمید نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا, معمر نے زہری سے ، انھوں نے ابو امامہ بن سہل بن حنیف سے ، انھوں نے حضرت ابن عباس رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ: أُتِيَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ فِي بَيْتِ مَيْمُونَةَ بِضَبَّيْنِ مَشْوِيَّيْنِ بِمِثْلِ حَدِيثِهِمْ، وَلَمْ يَذْكُرْ يَزِيدَ بْنَ الْأَصَمِّ، عَنْ مَيْمُونَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12601,
                "hadithNumber": "5038",
                "englishNarrator": "Ibn 'Abbas رضی اللہ عنہ reported:",
                "hadithEnglish": "Some mastigure meat was brought to the Messenger of Allah ﷺ when he was in the house of Maimunah رضی اللہ عنہا and Khalid bin Walid رضی اللہ عنہ was also present there. The rest of the hadith is the same.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں سانڈے کا گوشت لا یا گیا ، اس وقت رسول اللہ صلی اللہ علیہ وسلم حضرت میمونہ رضی اللہ عنہا کے گھر تشریف فر ما تے اور ان کے ساتھ حضرت خالد بن ولید رضی اللہ عنہ بھی مو جود تھے پھر زہری کی حدیث کے ہم معنی حدیث بیان کی ۔",
                "urduNarrator": "ہم سے عبدالملک بن شعیب بن لیث نے بیان کیا، کہا ہم سے میرے والد نے بیان کیا، مجھ سے میرے دادا نے بیان کیا، مجھ سے خالد بن یزید نے بیان کیا، مجھ سے سعید بن ابی ہلال نے بیان کیا, ابن منکدر سے روایت ہے کہ ابو امامہ بن سہل نے انھیں بتا یا کہ ابن عباس رضی اللہ عنہ نے کہا",
                "hadithArabic": "وحَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنَا أَبِي، عَنْ جَدِّي، حَدَّثَنِي خَالِدُ بْنُ يَزِيدَ، حَدَّثَنِي سَعِيدُ بْنُ أَبِي هِلَالٍ، عَنِ ابْنِ الْمُنْكَدِرِ، أَنَّ أَبَا أُمَامَةَ بْنَ سَهْلٍ، أَخْبَرَهُ عَنِ ابْنِ عَبَّاسٍ، قَالَ: أُتِيَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَهُوَ فِي بَيْتِ مَيْمُونَةَ وَعِنْدَهُ خَالِدُ بْنُ الْوَلِيدِ بِلَحْمِ ضَبٍّ، فَذَكَرَ بِمَعْنَى حَدِيثِ الزُّهْرِيِّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12602,
                "hadithNumber": "5039",
                "englishNarrator": "Sa'id bin Jubair reported:",
                "hadithEnglish": "He heard Ibn 'Abbas رضی اللہ عنہ says: The sister of my mother Umm Hufaid رضی اللہ عنہا presented to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) clarified butter (ghee), cheese and some lizards. He ate out of the clarified butter and cheese, but left the lizard finding no liking for it. But it was eaten on the table of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). Had it been forbidden (haram), it could not be eaten on the table of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌).",
                "hadithUrdu": "میں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ کو یہ کہتے ہوئے سنا کہ میری خالہ ام حفید رضی اللہ عنہا نے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں گھی پنیر اور سانڈے ہدیہ کیے ۔ آپ صلی اللہ علیہ وسلم نے گھی اور پنیر میں سے تناول فر ما یا اور سانڈے کو کراہت محسوس کرتے ہو ئے چھوڑدیا ۔ یہ ( سانڈ ا ) رسول اللہ صلی اللہ علیہ وسلم کے دسترخوان پر کھا یا گیا ۔ اگر یہ حرام ہو تا تو رسول اللہ صلی اللہ علیہ وسلم کے دسترخوان پر نہ کھا یا جا تا ۔",
                "urduNarrator": "ہم سے محمد بن بشار اور ابوبکر بن نافع نے بیان کیا، ابن نافع نے کہا کہ ہم سے غندر نے بیان کیا، ہم سے شعبہ نے بیان کیا، ابو بشر سے, سعید بن جبیر نے کہا",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، وَأَبُو بَكْرِ بْنُ نَافِعٍ، قَالَ ابْنُ نَافِعٍ: أَخْبَرَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ: سَمِعْتُ ابْنَ عَبَّاسٍ، يَقُولُ: «أَهْدَتْ خَالَتِي أَمُّ حُفَيْدٍ إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ سَمْنًا وَأَقِطًا وَأَضُبًّا، فَأَكَلَ مِنَ السَّمْنِ وَالْأَقِطِ، وَتَرَكَ الضَّبَّ تَقَذُّرًا، وَأُكِلَ عَلَى مَائِدَةِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَلَوْ كَانَ حَرَامًا، مَا أُكِلَ عَلَى مَائِدَةِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12603,
                "hadithNumber": "5040",
                "englishNarrator": "Yazid bin al-Asamm reported:",
                "hadithEnglish": "A newly wedded person of Medina invited us to a wedding feast, and he served us thirteen lizards. There were those who ate it and those who abandoned it. I met Ibn 'Abbas رضی اللہ عنہ the next day, and informed him (about this) in the presence of many persons. Some of them said that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had observed: I neither eat it nor forbid (anyone) from eating it, nor declare it to be unlawful. Thereupon Ibn 'Abbas رضی اللہ  عنہ said: Sad it is what you say! Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) has not been sent, but (to declare in clear words) the lawful and the unlawful (things). We were once with Allah's Messenger (may peace be. upon him) as he was with Maimuna رضی اللہ عنہا , and there were with him al-Fadl bin 'Abbas رضی اللہ عنہ, Khalid bin Walid رضی اللہ عنہ and some women (also) when a tray of food containing flesh was presented to him. As Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was about to eat that, Maimuna رضی اللہ عنہا said: It is the flesh of the lizard. He withdrew his hand saying: That is the flesh which I never eat; but he said to them (those who were present there): You may eat. Al-Fadl ate out of that, so did Khalid bin Walidn رضی اللہ عنہ , and the women. Maimuna رضی اللہ عنہا (however) said: I do not eat anything but that which Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) eats.",
                "hadithUrdu": "مدینہ منورہ میں ایک دلھا نے ہماری دعوت کی اور ہمیں تیرہ عدد ( بھنے ہو ئے ) سانڈے پیش کیے ۔ کو ئی ( اس کو ) کھا نے والا تھا کو ئی نہ کھا نے والا ۔ دوسرے دن میں حضرت ابن عباس رضی اللہ  عنہ سے ملا اور میں نے ان کو یہ بات بتا ئی ۔ ان کے اردگرد مو جود لوگوں نے بہت سی باتیں کیں حتی کہ کسی نے یہ بھی کہا : رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا تھا : \" میں اسے نہ کھاتا ہوں نہ روکتا ہوں نہ اسے حرام کرتا ہوں ۔ \" اس پر حضرت ابن عباس نے کہا : تم لو گوں نے جو کہا ناروا ہے ۔ اللہ تعا لیٰ نے جو نبی بھیجا وہ حلال کرنے والا اور حرام کرنے والا تھا ( حلت و حرمت کے حکم کو واضح کرنے والا تھا ۔ رسول اللہ صلی اللہ علیہ وسلم جس طرح تم سمجھ رہے ہو ۔ غیر واضح بات نہیں کرتے تھے ۔ ) رسول اللہ صلی اللہ علیہ وسلم جب حضرت میمونہ رضی اللہ تعالیٰ عنہا کے ہاں تشریف فرما تھے اور آپ کے قریب فضل بن عباس رضی اللہ عنہ اور خالد بن ولید رضی اللہ تعالیٰ عنہ تھے ۔ ایک اور خاتون بھی مو جود تھی تو ان کے سامنے دسترخوان لا یا گیا جس پر گوشت تھا ، جب رسول اللہ صلی اللہ علیہ وسلم نے اس کو کھانے کا ارادہ کیا تو حضرت میمونہ رضی اللہ عنہا نے عرض کی : یہ سانڈے کا گو شت ہے آپ نے ہاتھ روک لیا اور فر ما یا : \" یہ ایسا گو شت ہے جو میں نے کبھی نہیں کھا یا ۔ \" اور آپ صلی اللہ علیہ وسلم نے لوگوں سے فر ما یا : \" کھاؤ ۔ سو اس گوشت میں سے فضل خالد بن ولید رضی اللہ عنہ اور اس خاتون نے کھا یا ۔ حضرت میمونہ رضی اللہ عنہا نے کہا : میں تو صرف اس کھا نے میں سے کھا ؤں گی جو رسول اللہ صلی اللہ علیہ وسلم کھا ئیں گے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے علی بن مسْهِر، نے بیان کیا, شیبانی نے یزید بن اصم سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنِ الشَّيْبَانِيِّ، عَنْ يَزِيدَ بْنِ الْأَصَمِّ، قَالَ: دَعَانَا عَرُوسٌ بِالْمَدِينَةِ فَقَرَّبَ إِلَيْنَا ثَلَاثَةَ عَشَرَ ضَبًّا، فَآكِلٌ وَتَارِكٌ، فَلَقِيتُ ابْنَ عَبَّاسٍ مِنَ الْغَدِ، فَأَخْبَرْتُهُ، فَأَكْثَرَ الْقَوْمُ حَوْلَهُ حَتَّى قَالَ بَعْضُهُمْ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «لَا آكُلُهُ، وَلَا أَنْهَى عَنْهُ، وَلَا أُحَرِّمُهُ»، فَقَالَ ابْنُ عَبَّاسٍ: بِئْسَ مَا قُلْتُمْ، مَا بُعِثَ نَبِيُّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِلَّا مُحِلًّا وَمُحَرِّمًا، إِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَيْنَمَا هُوَ عِنْدَ مَيْمُونَةَ، وَعِنْدَهُ الْفَضْلُ بْنُ عَبَّاسٍ، وَخَالِدُ بْنُ الْوَلِيدِ، وَامْرَأَةٌ أُخْرَى، إِذْ قُرِّبَ إِلَيْهِمْ خُوَانٌ عَلَيْهِ لَحْمٌ، فَلَمَّا أَرَادَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ يَأْكُلَ، قَالَتْ لَهُ مَيْمُونَةُ: إِنَّهُ لَحْمُ ضَبٍّ، فَكَفَّ يَدَهُ، وَقَالَ: «هَذَا لَحْمٌ لَمْ آكُلْهُ قَطُّ»، وَقَالَ لَهُمْ: «كُلُوا»، فَأَكَلَ مِنْهُ الْفَضْلُ، وَخَالِدُ بْنُ الْوَلِيدِ، وَالْمَرْأَةُ، وَقَالَتْ مَيْمُونَةُ: لَا آكُلُ مِنْ شَيْءٍ إِلَّا شَيْءٌ يَأْكُلُ مِنْهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12604,
                "hadithNumber": "5041",
                "englishNarrator": "Abu Zubair reported he heard Jabir bin 'Abdullah رضی اللہ عنہ saying:",
                "hadithEnglish": "There was presented to Allah's Messenger (the flesh) of the lizard, but he refused to eat that, saying: I do not know; perhaps it (lizard) might (be one of those natives of) the distant past whose (forms) had beer, distorted.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے پاس سانڈ الا یا گیا ۔ آپ نے اسے کھا نے سے انکا ر کیا اور فرما یا : \" میں نہیں جا نتا کہ شاید یہ ( سانڈا بھی ) ان قوموں میں سے ہو جن میں مسخ ہوا تھا ۔ \"",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم اور عبد بن حمید نے بیان کیا، کہا کہ ہم سے عبد الرزاق نے ابن جریج کی سند سے بیان کیا، انہوں نے مجھ سے بیان کیا, ابو زبیر نے حضرت جا بر  بن عبد اللہ رضی اللہ عنہ کو کہتے ہو ئے سنا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَعَبْدُ بْنُ حُمَيْدٍ قَالَا أَخْبَرَنَا عَبْدُ الرَّزَّاقِ عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ أُتِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِضَبٍّ فَأَبَى أَنْ يَأْكُلَ مِنْهُ وَقَالَ لَا أَدْرِي لَعَلَّهُ مِنْ الْقُرُونِ الَّتِي مُسِخَتْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12605,
                "hadithNumber": "5042",
                "englishNarrator": "Abu Zubair reported:",
                "hadithEnglish": "I asked Jabir رضی اللہ عنہ about the eating) of the lizard, whereupon he said: Don't eat that as he (the Holy Prophet ﷺ) felt disgust. He (the narrator) said that Umar bin al-Khattab  رضی اللہ عنہ reminded: Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) did not declare it to be unlawful. Allah, the Exalted and Majestic, has (made it a source) of benefit for more than one (persons). It is a common diet of the shepherds. Had it been with me, I would have eaten that.",
                "hadithUrdu": "میں نے حضرت جابر رضی اللہ عنہ سے سانڈے کے متعلق سوال کیا ، انھوں نے کہا : اسے مت کھاؤ ۔ اور اس سے اظہار کراہت کیا اور بیان کیا کہ حضرت عمر بن خطاب رضی اللہ تعالیٰ عنہ نے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم نے اسے حرام نہیں کیا ۔ بلا شبہ اللہ تعالیٰ اس کے ذریعے سے ( بھی ) کو نفع پہنچاتا ہے ، یہ عام چرواہوں کی غذا ہے ۔ ( حضرت عمر رضی اللہ تعالیٰ عنہ نے مزید کہا : ) اگر یہ میرے پاس ہوتا تو میں اسے کھا لیتا ۔",
                "urduNarrator": "مجھ سے سلمہ بن شبیب نے بیان کیا، ہم سے حسن بن عیان نے بیان کیا، ہم سے معقل نے بیان کیا, ابو زبیر نے کہا",
                "hadithArabic": "و حَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ حَدَّثَنَا مَعْقِلٌ عَنْ أَبِي الزُّبَيْرِ قَالَ سَأَلْتُ جَابِرًا عَنْ الضَّبِّ فَقَالَ لَا تَطْعَمُوهُ وَقَذِرَهُ وَقَالَ قَالَ عُمَرُ بْنُ الْخَطَّابِ إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يُحَرِّمْهُ إِنَّ اللَّهَ عَزَّ وَجَلَّ يَنْفَعُ بِهِ غَيْرَ وَاحِدٍ فَإِنَّمَا طَعَامُ عَامَّةِ الرِّعَاءِ مِنْهُ وَلَوْ كَانَ عِنْدِي طَعِمْتُهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12606,
                "hadithNumber": "5043",
                "englishNarrator": "Abu Sa'id رضی اللہ عنہ reported:",
                "hadithEnglish": "A person said: Messenger of Allah, we live in a land abounding in lizards, so what do you command or what verdict you give (about eating of it)? Thereupon he said: It was mentioned to me that a people from among Bani Isra'il were distorted (so there is a likelihood that those people might have been distorted in the shape of lizards). So he neither commanded (us to eat that) nor forbade (us). Abu Sa'id رضی اللہ عنہ said: After some time Umar رضی اللہ عنہ said: Allah, the Exalted and Majestic, has made it (a source of) benefit for more than one (person), for it is the common diet of shepherds. Had it been with me, I would have eaten that. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) disliked it.",
                "hadithUrdu": "ایک شخص نے عرض کی : اللہ کے رسول صلی اللہ علیہ وسلم !ہم سانڈوں سے بھری ہوئی سرزمین میں رہتے ہیں ، آپ صلی اللہ علیہ وسلم ہمیں کیا حکم دیتے ہیں؟یا کہا : آپ صلی اللہ علیہ وسلم ہمیں کیا فتویٰ دیتے ہیں؟ مجھے بتایاگیا کہ بنو اسرائیل کی ایک امت ( بڑی جماعت ) مسخ کر ( کے رینگنے والے جانوروں میں تبدیل کر ) دی گئی تھی ۔ \"\" ( اس کے بعد ) آپ نے نہ اجازت دی اور نہ منع فرمایا ۔ حضرت ابوسعید ( خدری رضی اللہ عنہ ) نے کہا : پھر بعد کا عہد آیا توحضرت عمر رضی اللہ تعالیٰ عنہ نے کہا : اللہ عزوجل اس کے ذریعے سے ایک سے زیادہ لوگوں کو نفع پہنچاتا ہے ۔ یہ عام چرواہوں کی غذا ہے ، اگر یہ میرے پاس ہوتا تو میں اسے کھاتا ۔ رسول اللہ صلی اللہ علیہ وسلم نے اس کو نامرغوب محسوس کیا تھا ۔ ( اسے حرام قرار نہیں دیا تھا ۔ )",
                "urduNarrator": "مجھ سے محمد بن المثنی نے بیان کیا، کہا ہم سے ابن ابی عدی نے بیان کیا, داود نے ابو نضرہ سے ، انھوں نے حضرت ابو سعید رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ دَاوُدَ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ، قَالَ: قَالَ رَجُلٌ: يَا رَسُولَ اللهِ، إِنَّا بِأَرْضٍ مَضَبَّةٍ، فَمَا تَأْمُرُنَا؟ - أَوْ فَمَا تُفْتِينَا؟ - قَالَ: «ذُكِرَ لِي أَنَّ أُمَّةً مِنْ بَنِي إِسْرَائِيلَ مُسِخَتْ»، فَلَمْ يَأْمُرْ وَلَمْ يَنْهَ، قَالَ أَبُو سَعِيدٍ: فَلَمَّا كَانَ بَعْدَ ذَلِكَ، قَالَ عُمَرُ: «إِنَّ اللهَ عَزَّ وَجَلَّ لَيَنْفَعُ بِهِ غَيْرَ وَاحِدٍ، وَإِنَّهُ لَطَعَامُ عَامَّةِ هَذِهِ الرِّعَاءِ، وَلَوْ كَانَ عِنْدِي لَطَعِمْتُهُ، إِنَّمَا عَافَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12607,
                "hadithNumber": "5044",
                "englishNarrator": "Abu Sa'id رضی اللہ عنہ reported:",
                "hadithEnglish": "An Arab of the desert came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: I live in a low land abounding in lizards, and these are the common diet of my family, but he (the Holy Prophet) did not make any reply. We said to him: Repeat it (your problem) and so he repeated it, but he did not make any reply. (It was repeated thrice ) Then Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) called him out at the third time saying: O man of the desert, verily Allah cursed or showed wrath to a tribe of Bani Isra'il and distorted them to beasts which move on the earth. I do not know, perhaps this (lizard) may be one of them. So I do not eat it, nor do I prohibit the eating of it.",
                "hadithUrdu": "ایک اعرابی رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا ۔ میں سانڈوں سے بھرے ہوئے ایک نشیبی علاقے میں رہتا ہوں اور میرے گھر والوں کی عام غذا یہی ہے ۔ آپ نے اس کو کوئی جواب نہیں دیا ، ہم نے اس سے کہا : دوبارہ عرض کرو ، اس نے دوبارہ عرض کی ، مگر آپ نے تین بار ( دہرانے پر بھی ) کوئی جواب نہ دیا ، پھر تیسری بار رسول اللہ صلی اللہ علیہ وسلم نے اس کو آواز دی اور فرمایا : \" اے اعرابی! اللہ تعالیٰ نے بنی اسرائیل کے کسی گروہ پر لعنت کی یا غضب فرمایا اور ان کو زمین پر چلنے والے جانوروں کی شکل میں مسخ کردیا ۔ مجھے علم نہیں ، شاید یہ انھی جانوروں میں سے ہو ، ( جن کی شکل میں ان لوگوں کو مسخ کیا گیا تھا ) اس لیے نہ اس کو کھاتا ہوں اور نہ اس سے روکتا ہوں ۔ \"",
                "urduNarrator": "مجھ سے محمد بن حاتم نے بیان کیا، انہوں نے ہم سے اس کے متعلق بیان کیا, ابوعقیل دورقی نے کہا : ہمیں ابو نضرہ نے حضرت ابو سعید رضی اللہ عنہ سے حدیث بیان کی کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا أَبُو عَقِيلٍ الدَّوْرَقِيُّ، حَدَّثَنَا أَبُو نَضْرَةَ، عَنْ أَبِي سَعِيدٍ، أَنَّ أَعْرَابِيًّا أَتَى رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: إِنِّي فِي غَائِطٍ مَضَبَّةٍ، وَإِنَّهُ عَامَّةُ طَعَامِ أَهْلِي؟ قَالَ: فَلَمْ يُجِبْهُ، فَقُلْنَا: عَاوِدْهُ، فَعَاوَدَهُ، فَلَمْ يُجِبْهُ ثَلَاثًا، ثُمَّ نَادَاهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي الثَّالِثَةِ، فَقَالَ: «يَا أَعْرَابِيُّ، إِنَّ اللهَ لَعَنَ - أَوْ غَضِبَ - عَلَى سِبْطٍ مِنْ بَنِي إِسْرَائِيلَ فَمَسَخَهُمْ دَوَابَّ، يَدِبُّونَ فِي الْأَرْضِ، فَلَا أَدْرِي، لَعَلَّ هَذَا مِنْهَا، فَلَسْتُ آكُلُهَا، وَلَا أَنْهَى عَنْهَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12608,
                "hadithNumber": "5045",
                "englishNarrator": "Ibn Abu Aufa رضی اللہ عنہ reported:",
                "hadithEnglish": "We went on seven expeditions with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and ate locusts.",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ غزوات میں شامل ہوئے ( جن کے دوران میں ) ہم ٹڈیاں کھاتے رہے ۔",
                "urduNarrator": "ابو کامل الجہداری نے ہم سے کہا, ابو عوانہ نے ابو یعفور سے ، انھوں نے حضرت عبداللہ بن اوفیٰ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي يَعْفُورٍ، عَنْ عَبْدِ اللهِ بْنِ أَبِي أَوْفَى، قَالَ: «غَزَوْنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ سَبْعَ غَزَوَاتٍ نَأْكُلُ الْجَرَادَ».",
                "headingArabic": "إِبَاحَةِ الْجَرَادِ ‏‏",
                "headingUrdu": "ٹڈیاں کھانے کی اجازت",
                "headingEnglish": "The permissibility of eating Locusts",
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12609,
                "hadithNumber": "5046",
                "englishNarrator": "This hadith has been narrated on the authority of Abu Ya'fur with the same chain of transmitters. Abu Bakr (one of the narrators):",
                "hadithEnglish": "I said seven expeditions, whereas Ishaq said six, and Ibn Umar said six or seven .",
                "hadithUrdu": "میں \"\" سات جنگیں \"\" کہا ، اسحاق نے \"\" چھ \"\" اور ابن ابی عمر نے \"\" چھ یا سات \"\" کہا ۔",
                "urduNarrator": "ابو بکر بن ابی شیبہ ، اسحاق بن ابراہیم اور ابن ابی عمر سب نے ابن عینیہ سے ، انھوں نے ابو یعفور سے اسی سند کے ساتھ حدیث بیا ن کی ,  ابو بکر نے اپنی روایت",
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ أَبِي عُمَرَ، جَمِيعًا، عَنِ ابْنِ عُيَيْنَةَ، عَنْ أَبِي يَعْفُورٍ، بِهَذَا الْإِسْنَادِ، قَالَ أَبُو بَكْرٍ فِي رِوَايَتِهِ: سَبْعَ غَزَوَاتٍ، وقَالَ إِسْحَاقُ: سِتَّ، وقَالَ ابْنُ أَبِي عُمَرَ: سِتَّ، أَوْ سَبْعَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12610,
                "hadithNumber": "5047",
                "englishNarrator": null,
                "hadithEnglish": "It was narrated from Abu Ya'fur with this chain of narrators, and he said: seven compaigns.",
                "hadithUrdu": "ہم سے محمد بن مثنیٰ نے بیان کیا، ہم سے ابن ابی عدی نے بیان کیا اور ہم سے ابن بشار نے محمد بن جعفر کی سند سے بیان کیا, شعبہ نے ابو یعفور سے یہ حدیث اسی سند سے روایت کی اور انھوں نے \" سات غزوات \" کہا ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، ح وحَدَّثَنَا ابْنُ بَشَّارٍ، عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ، كِلَاهُمَا عَنْ شُعْبَةَ، عَنْ أَبِي يَعْفُورٍ، بِهَذَا الْإِسْنَادِ، وَقَالَ: سَبْعَ غَزَوَاتٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12611,
                "hadithNumber": "5048",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "We chased a hare at Marr az-Zahrin (a valley near Mecca). They (my companions) ran, but felt exhausted; I also tried until I caught hold of it. I brought it to Abu Talha. He slaughtered it and sent its haunch and two hind legs to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) through me; and he accepted them.",
                "hadithUrdu": "ہم جا رہے تھے کہ ( مقام ) مرالظہران میں ایک خرگوش دیکھا تو اس کا پیچھا کیا ۔ پہلے لوگ اس پر دوڑے لیکن تھک گئے پھر میں دوڑا تو میں نے پکڑ لیا اور سیدنا ابوطلحہ رضی اللہ عنہ کے پاس لایا ۔ انہوں نے اس کو ذبح کیا اور اس کا پٹھ اور دونوں رانیں رسول اللہ صلی اللہ علیہ وسلم کے پاس بھیجیں ۔ میں لے کر آیا تو آپ صلی اللہ علیہ وسلم نے ان کو لے لیا ۔",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا, محمد بن جعفر نے کہا : ہمیں شعبہ نے ہشام بن زید سے حدیث بیان کی ، انھوں نےحضرت انس بن مالک رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ هِشَامِ بْنِ زَيْدٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ: «مَرَرْنَا فَاسْتَنْفَجْنَا أَرْنَبًا بِمَرِّ الظَّهْرَانِ، فَسَعَوْا عَلَيْهِ فَلَغَبُوا»، قَالَ: «فَسَعَيْتُ حَتَّى أَدْرَكْتُهَا، فَأَتَيْتُ بِهَا أَبَا طَلْحَةَ فَذَبَحَهَا، فَبَعَثَ بِوَرِكِهَا وَفَخِذَيْهَا إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَأَتَيْتُ بِهَا رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَقَبِلَهُ».",
                "headingArabic": "إِبَاحَةِ الأَرْنَبِ ‏‏",
                "headingUrdu": "خرگوش کھانے کی اجازت",
                "headingEnglish": "The permissibility of eating Rabbit",
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12612,
                "hadithNumber": "5049",
                "englishNarrator": "It was narrated from Shubah with this chain (a similar hadith as no. 5048). In the hadith of Yahya it says:",
                "hadithEnglish": "\"Its haunch or its hind legs.",
                "hadithUrdu": "\" اس کا پچھلا حصہ یا اس کی دونوں رانوں \" کے الفاظ ہیں ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، ہم سے یحییٰ بن سعید نے بیان کیا، یحییٰ بن یحییٰ اور خالد بن حارث دونوں نے شعبہ سے اسی سند کے ساتھ روایت کی ، یحییٰ کی حدیث میں",
                "hadithArabic": "وحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، ح وحَدَّثَنِي يَحْيَى بْنُ حَبِيبٍ، حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ، كِلَاهُمَا عَنْ شُعْبَةَ، بِهَذَا الْإِسْنَادِ، وَفِي حَدِيثِ يَحْيَى: بِوَرِكِهَا أَوْ فَخِذَيْهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12613,
                "hadithNumber": "5050",
                "englishNarrator": "Ibn Buraida reported:",
                "hadithEnglish": "Abdullah bin al-Mughaffal رضی اللہ عنہ saw a person from amongst his companions throwing small pebbles, whereupon he said: Don't throw pebbles. for Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) did not like it, or he forbade flinging of pebbles since neither the game is taken thereby, nor an enemy defeated. but it may break a tooth or put out an eye. He, afterwards, again saw him flinging pebbles, and said to him: I inform you that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) did not approve or he forbade flinging of pebbles, but if I see you again flinging pebbles. I will not speak with you.",
                "hadithUrdu": "حضرت عبداللہ بن مغفل رضی اللہ عنہ نے اپنے ساتھیوں میں سے ایک شخص کو کنکر سے ( کسی چیز کو ) نشانہ بناتے ہوئے دیکھا تو کہا : کنکر سے نشانہ مت بناؤ ، رسول اللہ صلی اللہ علیہ وسلم اسے ناپسند فرماتے تھے ۔ یا کہا ۔ کنکر مارنے سے منع فرماتے تھے ، کیونکہ اس کے ذریعے سے نہ کوئی شکار مارا جاسکتا ہے ۔ نہ دشمن کو ( پیچھے ) دھکیلا جاسکتاہےیہ ( صرف ) دانت توڑتاہے یا آنکھ پھوڑتا ہے ۔ اس کے بعد انھوں نے اس شخص کو پھر کنکر مارتے دیکھا تو اس سے کہا : میں تمھیں بتاتا ہوں کہ رسول اللہ صلی اللہ علیہ وسلم اسے ناپسند فرماتے تھے یا ( کہا : ) آپ اس سے منع فرماتے تھے ، پھر میں تمھیں دیکھتا ہوں کہ تم کنکر مار رہے ہو!میں اتنا اتنا ( عرصہ ) تم سے ایک جملہ تک نہ کہوں گا ( بات تک نہ کروں گا ).",
                "urduNarrator": "عبید اللہ بن معاذ عنبری نے کہا : ہمیں کہمس نے ابن بریدہ سے حدیث بیان کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا كَهْمَسٌ، عَنِ ابْنِ بُرَيْدَةَ، قَالَ: رَأَى عَبْدُ اللهِ بْنُ الْمُغَفَّلِ رَجُلًا مِنْ أَصْحَابِهِ يَخْذِفُ، فَقَالَ لَهُ: لَا تَخْذِفْ، «فَإِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ يَكْرَهُ - أَوْ قَالَ - يَنْهَى عَنِ الْخَذْفِ، فَإِنَّهُ لَا يُصْطَادُ بِهِ الصَّيْدُ، وَلَا يُنْكَأُ بِهِ الْعَدُوُّ، وَلَكِنَّهُ يَكْسِرُ السِّنَّ، وَيَفْقَأُ الْعَيْنَ»، ثُمَّ رَآهُ بَعْدَ ذَلِكَ يَخْذِفُ، فَقَالَ لَهُ: «أُخْبِرُكَ أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ يَكْرَهُ أَوْ يَنْهَى عَنِ الْخَذْفِ ثُمَّ أَرَاكَ تَخْذِفُ، لَا أُكَلِّمُكَ كَلِمَةً كَذَا وَكَذَا».",
                "headingArabic": "إِبَاحَةِ مَا يُسْتَعَانُ بِهِ عَلَى الاِصْطِيَادِ وَالْعَدُوِّ وَكَرَاهَةِ الْخَذْفِ ‏‏",
                "headingUrdu": "شکار کرنے اور دشمن کے تعاقب میں مدد دینے والی چیزوں کے استعمال کی اجازت لیکن چھوٹی کنکریاں پھینکنا مکروہ ہے۔",
                "headingEnglish": "The permissibility of using things that help in hunting and pursuing the enemy, but throwing small pebbles is disliked",
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 12301,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=492",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=490",
                "label": "490",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=491",
                "label": "491",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=492",
                "label": "492",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=493",
                "label": "493",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=494",
                "label": "494",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=495",
                "label": "495",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=496",
                "label": "496",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=494",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=494",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=492",
        "to": 12325,
        "total": 40465
    }
}