{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 573,
        "data": [
            {
                "id": 14589,
                "hadithNumber": "7028",
                "englishNarrator": "This hadith has been narrated on the authority of 'Abaidullah with the same chain of transmitters but with this addition:",
                "hadithEnglish": "He then abandoned offering (funeral) prayer for them.",
                "hadithUrdu": "چنانچہ آپ صلی اللہ علیہ وسلم نے ان پر نماز جنازہ ترک کر دی ۔",
                "urduNarrator": "ہم سے محمد بن المثنی اور عبید اللہ بن سعید نے بیان کیا، انہوں نے کہا:  یحییٰ قطان نے عبیداللہ ( بن عمر بن حفص ) سے اسی سند کے ساتھ اسی طرح حدیث بیان کی اور مزید یہ کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَعُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَا حَدَّثَنَا يَحْيَى وَهُوَ الْقَطَّانُ عَنْ عُبَيْدِ اللَّهِ بِهَذَا الْإِسْنَادِ نَحْوَهُ وَزَادَ قَالَ فَتَرَكَ الصَّلَاةَ عَلَيْهِمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14590,
                "hadithNumber": "7029",
                "englishNarrator": "Ibn Mas'ud رضی اللہ عنہ reported:",
                "hadithEnglish": "There gathered near the Ka'bah three persons amongst whom two were Quraishi and one was a Thaqafi or two were Thaqafis and one was a Quraishi. They lacked understanding but wore more flesh. One of them said: Do you think that Allah hears as we speak? The other one said: He does hear when we speak loudly and He does not hear when we speak in undertones, and still the other one said: If He listens when we speak loudly, He also listens when we speak in undertones. It was on this occasion that this verse was revealed: You did not conceal yourselves lest your ears, your eyes and your skins would stand witness against you (xli. 22).",
                "hadithUrdu": "تین آدمی بیت اللہ کے پاس اکٹھے ہوئے ، ( ان میں سے ) دو قریشی تھے اور ایک ثقفی تھا ، یا دو ثقفی تھے اور ایک قریشی تھا ، ان کے دلوں کا فہم کم تھا ، ان کے پیٹوں کی چربی بہت تھی ۔ ان میں سے ایک نے کہا : کیا تم سمجھتے ہو کہ جو کچھ ہم کہتے ہیں ، اللہ سنتا ہے؟ دوسرے نے کہا : اگر ہم اونچی آواز سے بات کریں تو سنتا ہے اور آہستہ بات کریں تو نہیں سنتا ۔ تیسرے نے کہا : اگر ہم اونچا بولیں تو وہ سنتا ہے تو پھر ہم آہستہ بولیں تو بھی سنتا ہے ۔ اس پر اللہ عزوجل نے ( یہ آیتیں ) نازل فرمائیں : \" تم اس لیے ( اپنی باتیں ) نہیں چھپا رہے تھے کہ تمہارے خلاف تمہارے کان گواہی دیں گے اور نہ تمہاری آنکھیں اور نہ تمہاری کھالیں ۔ \"",
                "urduNarrator": "محمد بن ابی عمر مکی نے ہمیں حدیث بیان کی ، کہا : ہمیں سفیان نے منصور سے حدیث بیان کی ، انہوں نے مجاہد سے ، انہوں نے ابومعمر سے اور انہوں نے حضرت ابن مسعود رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْمَكِّيُّ حَدَّثَنَا سُفْيَانُ عَنْ مَنْصُورٍ عَنْ مُجَاهِدٍ عَنْ أَبِي مَعْمَرٍ عَنْ ابْنِ مَسْعُودٍ قَالَ اجْتَمَعَ عِنْدَ الْبَيْتِ ثَلَاثَةُ نَفَرٍ قُرَشِيَّانِ وَثَقَفِيٌّ أَوْ ثَقَفِيَّانِ وَقُرَشِيٌّ قَلِيلٌ فِقْهُ قُلُوبِهِمْ كَثِيرٌ شَحْمُ بُطُونِهِمْ فَقَالَ أَحَدُهُمْ أَتُرَوْنَ اللَّهَ يَسْمَعُ مَا نَقُولُ وَقَالَ الْآخَرُ يَسْمَعُ إِنْ جَهَرْنَا وَلَا يَسْمَعُ إِنْ أَخْفَيْنَا وَقَالَ الْآخَرُ إِنْ كَانَ يَسْمَعُ إِذَا جَهَرْنَا فَهُوَ يَسْمَعُ إِذَا أَخْفَيْنَا فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ وَمَا كُنْتُمْ تَسْتَتِرُونَ أَنْ يَشْهَدَ عَلَيْكُمْ سَمْعُكُمْ وَلَا أَبْصَارُكُمْ وَلَا جُلُودُكُمْ الْآيَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14591,
                "hadithNumber": "7030",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of 'Abdullah رضی اللہ عنہ through another chain of transmitters.",
                "hadithUrdu": "ابوبکر بن خلاد باہلی نے مجھے حدیث بیان کی ، کہا : ہمیں یحییٰ بن سعید نے حدیث بیان کی ، کہا : ہمیں سفیان نے حدیث بیان کی ، کہا : مجھے سلیمان نے عمارہ بن عمیر سے حدیث بیان کی ، انہوں نے وہب بن ربیعہ سے اور انہوں نے عبداللہ رضی اللہ عنہ سے روایت کی ، نیز ہمیں یحییٰ نے حدیث بیان کی ، کہا : ہمیں سفیان نے حدیث سنائی ، کہا : مجھے منصور نے مجاہد سے حدیث بیان کی ، انہوں نے ابومعمر سے اور انہوں نے عبداللہ رضی اللہ عنہ سے اسی طرح روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنِي أَبُو بَكْرِ بْنُ خَلَّادٍ الْبَاهِلِيُّ حَدَّثَنَا يَحْيَى يَعْنِي ابْنَ سَعِيدٍ حَدَّثَنَا سُفْيَانُ حَدَّثَنِي سُلَيْمَانُ عَنْ عُمَارَةَ بْنِ عُمَيْرٍ عَنْ وَهْبِ بْنِ رَبِيعَةَ عَنْ عَبْدِ اللَّهِ ح و قَالَ حَدَّثَنَا يَحْيَى حَدَّثَنَا سُفْيَانُ حَدَّثَنِي مَنْصُورٌ عَنْ مُجَاهِدٍ عَنْ أَبِي مَعْمَرٍ عَنْ عَبْدِ اللَّهِ بِنَحْوِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14592,
                "hadithNumber": "7031",
                "englishNarrator": "Zaid bin Thabit رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) set out for Uhud. Some of those persons who were with them came back. The Companions of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) were divided in two groups. One group said: We would kill them, and the other one said: No, this should not be done, and it was on this occasion that this verse was revealed: Why should you, then, be two parties in relation to hypocrites? (iv. 88).",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم ( جنگ کے لئے ) اُحد کی جانب روانہ ہوئے ۔ جو لوگ آپ کے ساتھ تھے ان میں سے کچھ واپس آ گئے ۔ رسول اللہ صلی اللہ علیہ وسلم کے صحابہ ان کے بارے میں دو حصوں میں تقسیم ہو گئے ۔ بعض نے کہا : ہم انہیں قتل کر دیں اور بعض نے کہا : نہیں ۔ تو ( یہ آیت ) نازل ہوئی : \" تمہیں کیا ہو گیا ہے کہ منافقین کے بارے میں تم وہ دو گروہ بن گئے ہو ۔ \"",
                "urduNarrator": "عبید اللہ بن معاذ عنبری نے کہا : ہمیں شعبہ نے عدی بن ثابت سے حدیث بیان کی ، انہوں نے کہا : میں نے عبداللہ بن یزید کو حضرت زید بن ثابت رضی اللہ عنہ سے حدیث بیان کرتے ہوئے سنا کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ عَدِيٍّ وَهُوَ ابْنُ ثَابِتٍ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ يَزِيدَ يُحَدِّثُ عَنْ زَيْدِ بْنِ ثَابِتٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ إِلَى أُحُدٍ فَرَجَعَ نَاسٌ مِمَّنْ كَانَ مَعَهُ فَكَانَ أَصْحَابُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهِمْ فِرْقَتَيْنِ قَالَ بَعْضُهُمْ نَقْتُلُهُمْ وَقَالَ بَعْضُهُمْ لَا فَنَزَلَتْ فَمَا لَكُمْ فِي الْمُنَافِقِينَ فِئَتَيْنِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14593,
                "hadithNumber": "7032",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters.",
                "hadithUrdu": "مجھ سے زہیر بن حرب نے بیان کیا, یحییٰ بن سعید اور غندر دونوں نے شعبہ سے اسی سند کے ساتھ اسی کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ ح و حَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ حَدَّثَنَا غُنْدَرٌ كِلَاهُمَا عَنْ شُعْبَةَ بِهَذَا الْإِسْنَادِ نَحْوَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14594,
                "hadithNumber": "7033",
                "englishNarrator": "Abu Sa'id Khudri رضی اللہ عنہ reported:",
                "hadithEnglish": "During the lifetime of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) the hypocrites behaved in this way that when Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) set out for a battle, they kept themselves behind, and they became happy that they had managed to sit in the house contrary to (the act of) Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), and when Allah's Apostle (may peace he upon him) came back, they put forward excuses and took oath and wished that people should laud them for the deeds which they had not done. It was on this occasion that this verse was revealed: Think not that those who exult in what they have done, and love to be praised for what they have not done-think not them to be safe from the chastisement; and for them is a painful chastisement (iii. 18).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے عہد میں کچھ منافقین ایسے تھے کہ جب نبی صلی اللہ علیہ وسلم کسی جنگ کے لئے تشریف لے جاتے تو وہ پیچھے رہ جاتے اور رسول اللہ صلی اللہ علیہ وسلم کی مخالفت میں اپنے پیچھے رہ جانے پر خوش ہوتے ، اور جب نبی صلی اللہ علیہ وسلم واپس آتے تو آپ کے سامنے عذر بیان کرتے اور قسمیں کھاتے اور چاہتے کہ لوگ ان کاموں پر ان کی تعریف کریں جو انہوں نے نہیں کیے تھے ، اس پر یہ ( آیت نازل ) ہوئی : \" ان لوگوں کے متعلق گمان نہ کرو جو اپنے کیے پر خوش ہوتے ہیں اور یہ پسند کرتے ہیں کہ اس کام پر ان کی تعریف کی جائے جو انہوں نے نہیں کیا ، ان کے متعلق یہ گمان بھی نہ کرو کہ وہ عذاب سے بچنے والے مقام پر ہوں گے ۔ \"",
                "urduNarrator": "ہم سے حسن بن علی الحلوانی اور محمد بن سہل التمیمی نے بیان کیا، کہا: ہم سے ابن ابی مریم نے بیان کیا، ہم سے محمد بن جعفر نے بیان کیا، مجھ سے زید نے بیان کیا۔ ابن اسلم نے عطاء ابن یسار کی سند سے, حضرت ابوسعید خدری رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ وَمُحَمَّدُ بْنُ سَهْلٍ التَّمِيمِيُّ قَالَا حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ أَخْبَرَنِي زَيْدُ بْنُ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ رِجَالًا مِنْ الْمُنَافِقِينَ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانُوا إِذَا خَرَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْغَزْوِ تَخَلَّفُوا عَنْهُ وَفَرِحُوا بِمَقْعَدِهِمْ خِلَافَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِذَا قَدِمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اعْتَذَرُوا إِلَيْهِ وَحَلَفُوا وَأَحَبُّوا أَنْ يُحْمَدُوا بِمَا لَمْ يَفْعَلُوا فَنَزَلَتْ لَا تَحْسَبَنَّ الَّذِينَ يَفْرَحُونَ بِمَا أَتَوْا وَيُحِبُّونَ أَنْ يُحْمَدُوا بِمَا لَمْ يَفْعَلُوا فَلَا تَحْسَبَنَّهُمْ بِمَفَازَةٍ مِنْ الْعَذَابِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14595,
                "hadithNumber": "7034",
                "englishNarrator": "Humaid bin 'Abdul-Rahman bin 'Auf reported:",
                "hadithEnglish": "Marwan said to Rafi', his chamberlain, that he should go to Ibn 'Abbas رضی اللہ عنہ and ask him: If every one of us be punished for his being happy upon his deed and for his being praised for what he has not done, nobody would be saved from the torment. Ibn 'Abbas رضی اللہ عنہ said: What you have to do with this verse? It has been in fact revealed in connection with the people of the Book. Then Ibn Abbas رضی اللہ عنہ recited this verse: When Allah took a covenant from those who had been given the Book: You shall explain it to people and shall not conceal this (iii. 186), and then Ibn 'Abbas  رضی اللہ عنہ recited this verse: Think not that those who exult in what they have done and love to be praised for what they have not done (iii. 186). Ibn 'Abbas رضی اللہ عنہ (further) said: Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) asked them about something and then they concealed that and they told him something else and they went out and they thought that they had informed him as lie had asked them and they felt happy of what they had concealed.",
                "hadithUrdu": "مروان نے اپنے دربان سے کہا : \" رافع! حضرت ابن عباس رضی اللہ عنہ کے پاس جاؤ اور کہو کہ اگر یہ بات ہے کہ ہم میں سے ہر شخص جو اپنے کیے پر خوش ہوتا ہے اور ہر ایک جو یہ پسند کرتا ہے کہ جو اس نے نہیں کیا ، اس پر اس کی تعریف کی جائے ، اس کو عذاب ہو گا تو ہم سب ہی ضرور عذاب میں ڈالے جائیں گے ۔ تو حضرت ابن عباس رضی اللہ عنہ نے فرمایا : تم لوگوں کا اس آیت سے کیا تعلق ( بنتا ) ہے؟ یہ آیت اہل کتاب کے بارے میں اتری تھی ، پھر حضرت ابن عباس رضی اللہ عنہ نے ( اس سے پہلی ) یہ آیت پڑھی : \" اور جب اللہ نے ان لوگوں کا ، جنہیں کتاب دی گئی تھی ، عہد لیا کہ تم اسے لوگوں کے سامنے کھول کر بیان کرو گے اور اس کو چھپاؤ گے نہیں ۔ \" پھر ابن عباس رضی اللہ عنہ نے ( اس کے بعد والی ) آیت تلاوت فرمائی : \" ان لوگوں کے بارے میں گمان نہ کرو جو اپنے کیے پر خوش ہوتے ہیں اور پسند کرتے ہیں کہ اس کام پر ان کی تعریف کی جائے جو انہوں نے نہیں کیا ۔ \" اور حضرت ابن عباس رضی اللہ عنہ نے فرمایا : نبی صلی اللہ علیہ وسلم نے ان سے ( ان کی کتاب میں لکھی ہوئی ) کسی چیز کے بارے میں پوچھا تو انہوں نے آپ سے وہ چیز چھپا لی اور ( اس کے بجائے ) ایک دوسری بات بتا دی اور وہ اس طرح نکلے کہ انہوں نے آپ صلی اللہ علیہ وسلم کے سامنے یہ ظاہر کیا کہ آپ صلی اللہ علیہ وسلم نے ان سے جو پوچھا تھا ، انہوں نے آپ صلی اللہ علیہ وسلم کو وہی بتا دیا ہے اور اس بات پر انہوں نے آپ صلی اللہ علیہ وسلم سے تعریف بھی بٹورنی چاہی اور جو بات آپ نے ان سے پوچھی وہ بات چھپا کر انہوں نے جو کچھ لیا تھا اس پر ( اپنے دلوں میں ) خوش بھی ہوئے ۔",
                "urduNarrator": "ہم سے زہیر بن حرب اور ہارون بن عبداللہ نے بیان کیا اور یہ قول زہیر سے ہے۔ انہوں نے کہا: ہم سے حجاج بن محمد نے روایت کی ہے, ابن جریج سے روایت ہے ، انہوں نے کہا : مجھے ابن ابی ملیکہ نے بتایا ، انہیں حمید بن عبدالرحمن بن عوف نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَهَارُونُ بْنُ عَبْدِ اللَّهِ وَاللَّفْظُ لِزُهَيْرٍ قَالَا حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنِي ابْنُ أَبِي مُلَيْكَةَ أَنَّ حُمَيْدَ بْنَ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ أَخْبَرَهُ أَنَّ مَرْوَانَ قَالَ اذْهَبْ يَا رَافِعُ لِبَوَّابِهِ إِلَى ابْنِ عَبَّاسٍ فَقُلْ لَئِنْ كَانَ كُلُّ امْرِئٍ مِنَّا فَرِحَ بِمَا أَتَى وَأَحَبَّ أَنْ يُحْمَدَ بِمَا لَمْ يَفْعَلْ مُعَذَّبًا لَنُعَذَّبَنَّ أَجْمَعُونَ فَقَالَ ابْنُ عَبَّاسٍ مَا لَكُمْ وَلِهَذِهِ الْآيَةِ إِنَّمَا أُنْزِلَتْ هَذِهِ الْآيَةُ فِي أَهْلِ الْكِتَابِ ثُمَّ تَلَا ابْنُ عَبَّاسٍ وَإِذْ أَخَذَ اللَّهُ مِيثَاقَ الَّذِينَ أُوتُوا الْكِتَابَ لَتُبَيِّنُنَّهُ لِلنَّاسِ وَلَا تَكْتُمُونَهُ هَذِهِ الْآيَةَ وَتَلَا ابْنُ عَبَّاسٍ لَا تَحْسَبَنَّ الَّذِينَ يَفْرَحُونَ بِمَا أَتَوْا وَيُحِبُّونَ أَنْ يُحْمَدُوا بِمَا لَمْ يَفْعَلُوا وَقَالَ ابْنُ عَبَّاسٍ سَأَلَهُمْ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ شَيْءٍ فَكَتَمُوهُ إِيَّاهُ وَأَخْبَرُوهُ بِغَيْرِهِ فَخَرَجُوا قَدْ أَرَوْهُ أَنْ قَدْ أَخْبَرُوهُ بِمَا سَأَلَهُمْ عَنْهُ وَاسْتَحْمَدُوا بِذَلِكَ إِلَيْهِ وَفَرِحُوا بِمَا أَتَوْا مِنْ كِتْمَانِهِمْ إِيَّاهُ مَا سَأَلَهُمْ عَنْهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14596,
                "hadithNumber": "7035",
                "englishNarrator": "Qais reported:",
                "hadithEnglish": "I said to 'Ammar رضی اللہ عنہ : What is your opinion about that which you have done in case (of your siding with Hadrat 'Ali رضی اللہ عنہ )? Is it your personal opinion or something you got from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌)? 'Ammar رضی اللہ عنہ said: We have got nothing from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) which people at large did not get, but Hudhaifa رضی اللہ عنہ  told me that Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had especially told him amongst his Companion, that there would be twelve hypocrites out of whom eight would not get into Paradise, until a camel would be able to pass through the needle hole. The ulcer would be itself sufficient (to kill) eight. So far as four are concerned, I do not remember what Shu'ba said about them.",
                "hadithUrdu": "میں نے حضرت عمار رضی اللہ عنہ سے کہا : آپ نے اپنے اس کام پر غور کیا جو آپ نے حضرت علی رضی اللہ عنہ کے معاملے میں کیا ہے ( ان کا بھرپور ساتھ دیا ہےاور ان کے مخالفین سے جنگ تک کی ہے ) یہ آپ کے اپنے غوروفکر سے اختیار کی ہوئی آپ کی رائے تھی یا ایسی چیز تھی جس کی ذمہ داری رسول اللہ صلی اللہ علیہ وسلم نے آپ لوگوں کے سپرد کی تھی؟ انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے کوئی ایسی ذمہ داری ہمارے سپرد نہیں کی جو انہوں نے تمام لوگوں کے سپرد نہ کی ہو لیکن حضرت حذیفہ رضی اللہ عنہ نے مجھے نبی صلی اللہ علیہ وسلم سے خبر دی ، کہا : نبی صلی اللہ علیہ وسلم نے فرمایا : \" میرے ساتھیوں میں سے بارہ افراد منافق ہیں ، ان میں سے آٹھ ایسے ہیں جو جنت میں داخل نہیں ہوں گے یہاں تک کہ اونٹ سوئی کے ناکے میں داخل ہو جائے ( کبھی داخل نہیں ہوں گے ) ، ان میں آٹھ ایسے ہیں ( کہ ان کے شر سے نجات کے لیے ان کے کندھوں کے درمیان ظاہر ہونے والا سرخ ) پھوڑا تمہاری نجات کے لیے تمہیں کفایت کرے گا ۔ اور چار ۔ \" ( آگے کا حصہ ) مجھے ( اسود بن عامر کو ) یاد نہیں کہ شعبہ نے ان ( چار ) کے بارے میں کیا کہا تھا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, اسود بن عامر نے کہا , ہمیں شعبہ بن حجاج نے قتادہ سے حدیث بیان کی ، انہوں نے ابونضرہ سے اور انہوں نے قیس ( بن عباد ) سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ حَدَّثَنَا شُعْبَةُ بْنُ الْحَجَّاجِ عَنْ قَتَادَةَ عَنْ أَبِي نَضْرَةَ عَنْ قَيْسٍ قَالَ قُلْتُ لِعَمَّارٍ أَرَأَيْتُمْ صَنِيعَكُمْ هَذَا الَّذِي صَنَعْتُمْ فِي أَمْرِ عَلِيٍّ أَرَأْيًا رَأَيْتُمُوهُ أَوْ شَيْئًا عَهِدَهُ إِلَيْكُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَا عَهِدَ إِلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْئًا لَمْ يَعْهَدْهُ إِلَى النَّاسِ كَافَّةً وَلَكِنْ حُذَيْفَةُ أَخْبَرَنِي عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي أَصْحَابِي اثْنَا عَشَرَ مُنَافِقًا فِيهِمْ ثَمَانِيَةٌ لَا يَدْخُلُونَ الْجَنَّةَ حَتَّى يَلِجَ الْجَمَلُ فِي سَمِّ الْخِيَاطِ ثَمَانِيَةٌ مِنْهُمْ تَكْفِيكَهُمُ الدُّبَيْلَةُ وَأَرْبَعَةٌ لَمْ أَحْفَظْ مَا قَالَ شُعْبَةُ فِيهِمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14597,
                "hadithNumber": "7036",
                "englishNarrator": "Qais bin 'Ubad reported:",
                "hadithEnglish": "We said to 'Ammar رضی اللہ عنہ: Was your fighting (on the side of 'Ali رضی اللہ عنہ in the Battle of Siffin) a matter of your own choice or you got its hints from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) for it, is likely for one to err in one's own discretion or was it because of any covenant that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) got from you? He said: It was not because of any covenant that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) got from us which he did get from other people, and he further said that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: In my Ummah. And I think that Hudhaifa رضی اللہ عنہ reported to me and according to Ghundar (the words are) that he said: In my Ummah, there would be twelve hypocrites and they would not be admitted to Paradise and they would not smell its odour, until the camel would pass through a needle's hole. Dubaila (ulcer) would be enough to (torment them) -a kind of flame of Fire which would appear in their shoulders and it would protrude from their chest.",
                "hadithUrdu": "ہم لوگوں نے حضرت عمار رضی اللہ عنہ سے کہا : آپ ( حضرت علی رضی اللہ عنہ کی حمایت میں ) اپنی جنگ کو کیسے دیکھتے ہیں ، کیا یہ ایک رائے ہے جو آپ نے غوروفکر سے اختیار کی ہے؟ تو رائے غلط بھی ہو سکتی ہے اور صحیح بھی ، یا کوئی ذمہ داری ہے جو رسول اللہ صلی اللہ علیہ وسلم نے ہمیں کوئی ایسی ( خصوصی ) ذمہ داری نہیں دی تھی جو تمام لوگوں کے سپرد نہ کی ہو اور کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا : \"\" بےشک میری امت میں ۔ ۔ ۔ \"\" شعبہ نے کہا : اور میں سمجھتا ہوں کہ انہوں نے کہا تھا : مجھے حذیفہ رضی اللہ عنہ نے ( یہ ) حدیث سنائی ۔ اور غندر نے کہا : مجھے لگتا ہے کہ انہوں نے کہا : \"\" میری امت میں بارہ منافق ہیں ، وہ جنت میں داخل نہ ہوں گے اور نہ اس کی خوشبو پائیں گے ، جب تک کہ اونٹ سوئی کے ناکے میں داخل نہ ہو جائے ۔ ان میں سے آٹھ ایسے ہیں ( کہ ان کے شر سے بچاؤ کے لیے ) تمہاری کفایت ایک ایسا پھوڑا کرے گا جو آگ کے جلتے ہوئے دیے کی طرح ( اوپر سے سرک ) ہو گا ، ان کے کندھوں میں طاہر ہو گا یہاں تک کہ ان کے سینوں سے نکل آئے گا ۔ \"\"",
                "urduNarrator": "ہم سے محمد بن المثنیٰ اور محمد بن بشار نے بیان کیا، اور قول ابن المثنیٰ کا ہے, محمد بن جعفر ( غندر ) نے کہا؛ ہمیں شعبہ نے قتادہ سے حدیث بیان کی ، انہوں نے ابونضرہ سے اور انہوں نے قیس بن عباد سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ وَاللَّفْظُ لِابْنِ الْمُثَنَّى قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ أَبِي نَضْرَةَ عَنْ قَيْسِ بْنِ عُبَادٍ قَالَ قُلْنَا لِعَمَّارٍ أَرَأَيْتَ قِتَالَكُمْ أَرَأْيًا رَأَيْتُمُوهُ فَإِنَّ الرَّأْيَ يُخْطِئُ وَيُصِيبُ أَوْ عَهْدًا عَهِدَهُ إِلَيْكُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَا عَهِدَ إِلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْئًا لَمْ يَعْهَدْهُ إِلَى النَّاسِ كَافَّةً وَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ فِي أُمَّتِي قَالَ شُعْبَةُ وَأَحْسِبُهُ قَالَ حَدَّثَنِي حُذَيْفَةُ وَقَالَ غُنْدَرٌ أُرَاهُ قَالَ فِي أُمَّتِي اثْنَا عَشَرَ مُنَافِقًا لَا يَدْخُلُونَ الْجَنَّةَ وَلَا يَجِدُونَ رِيحَهَا حَتَّى يَلِجَ الْجَمَلُ فِي سَمِّ الْخِيَاطِ ثَمَانِيَةٌ مِنْهُمْ تَكْفِيكَهُمُ الدُّبَيْلَةُ سِرَاجٌ مِنْ النَّارِ يَظْهَرُ فِي أَكْتَافِهِمْ حَتَّى يَنْجُمَ مِنْ صُدُورِهِمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14598,
                "hadithNumber": "7037",
                "englishNarrator": "Abu Tufail رضی اللہ عنہ reported:",
                "hadithEnglish": "There was a dispute between Hudhaifa رضی اللہ عنہ and one from the people of Aqaba as it happens amongst people. He said: I adjure you by Allah to tell me as to how many people from Aqaba were. The people said to him (Hudhaifa رضی اللہ عنہ ) to inform him as he had asked. We have been informed that they were fourteen and If you are to be counted amongst them, then they would be fifteen and I state by Allah that twelve amongst them were the enemies of Allah and of His Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) in this world. The rest of the three put forward this excuse: We did not hear the announcement of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and we were not aware of the intention of the people as he (the Holy Prophet) had been in the hot atmosphere. He (the Holy Prophet) then said: The water is small in quantity (at the next station). So nobody should go ahead of me, but he found people who had gone ahead of him and he cursed them on that day.",
                "hadithUrdu": "عقبہ والوں میں سے ایک شخص اور حضرت حذیفہ رضی اللہ عنہ کے درمیان ( اس طرح کا ) جھگڑا ہو گیا جس طرح لوگوں کے درمیان ہو جاتا ہے ۔ ( گفتگو کے دوران میں ) انہوں نے ( اس شخص سے ) کہا : میں تمہیں اللہ کی قسم دے کر پوچھتا ہوں کہ عقبہ والوں کی تعداد کتنی تھی؟ ( حضرت ابوطفیل رضی اللہ عنہ نے ) کہا : لوگوں نے اس سے کہا : جب وہ آپ سے پوچھ رہے ہیں تو انہیں بتاؤ ۔ ( پھر حضرت حذیفہ رضی اللہ عنہ نے خود ہی جواب دیتے ہوئے ) کہا : ہمیں بتایا جاتا تھا کہ وہ چودہ لوگ تھے اور اگر تم بھی ان میں شامل تھے تو وہ کل پندرہ لوگ تھے اور میں گواہی دیتا ہوں کہ ان میں سے بارہ دنیا کی زندگی میں بھی اللہ اور اس کے رسول صلی اللہ علیہ وسلم کے خلاف جنگ میں تھے اور ( آخرت میں بھی ) جب گواہ کھڑے ہوں گے ۔ اور آپ صلی اللہ علیہ وسلم نے ان تین لوگوں کا عذر قبول فرما لیا تھا جنہوں نے کہا تھا کہ ہم نے رسول اللہ صلی اللہ علیہ وسلم کے اعلان کرنے والے کا اعلان نہیں سنا تھا اور اس بات سے بھی بے خبر تھے کہ ان لوگوں کا ارادہ کیا ہے جبکہ آپ صلی اللہ علیہ وسلم اس وقت حرہ میں تھے ، آپ چل پڑے اور فرمایا : \" پانی کم ہے ، اس لیے مجھ سے پہلے وہاں کوئی نہ پہنچے ۔ \" چنانچہ آپ صلی اللہ علیہ وسلم نے ( وہاں پہنچ کر ) دیکھا کہ کچھ لوگ آپ سے پہلے وہاں پہنچ گئے ہیں تو آپ نے اس روز ان پر لعنت کی ۔",
                "urduNarrator": "ہم سے زہیر بن حرب نے بیان کیا، کہا ہم سے ابو احمد الکوفی نے بیان کیا, ولید بن جمیع نے کہا : ہمیں ابوطفیل رضی اللہ عنہ نے حدیث بیان کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا أَبُو أَحْمَدَ الْكُوفِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ جُمَيْعٍ حَدَّثَنَا أَبُو الطُّفَيْلِ قَالَ كَانَ بَيْنَ رَجُلٍ مِنْ أَهْلِ الْعَقَبَةِ وَبَيْنَ حُذَيْفَةَ بَعْضُ مَا يَكُونُ بَيْنَ النَّاسِ فَقَالَ أَنْشُدُكَ بِاللَّهِ كَمْ كَانَ أَصْحَابُ الْعَقَبَةِ قَالَ فَقَالَ لَهُ الْقَوْمُ أَخْبِرْهُ إِذْ سَأَلَكَ قَالَ كُنَّا نُخْبَرُ أَنَّهُمْ أَرْبَعَةَ عَشَرَ فَإِنْ كُنْتَ مِنْهُمْ فَقَدْ كَانَ الْقَوْمُ خَمْسَةَ عَشَرَ وَأَشْهَدُ بِاللَّهِ أَنَّ اثْنَيْ عَشَرَ مِنْهُمْ حَرْبٌ لِلَّهِ وَلِرَسُولِهِ فِي الْحَيَاةِ الدُّنْيَا وَيَوْمَ يَقُومُ الْأَشْهَادُ وَعَذَرَ ثَلَاثَةً قَالُوا مَا سَمِعْنَا مُنَادِيَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَا عَلِمْنَا بِمَا أَرَادَ الْقَوْمُ وَقَدْ كَانَ فِي حَرَّةٍ فَمَشَى فَقَالَ إِنَّ الْمَاءَ قَلِيلٌ فَلَا يَسْبِقْنِي إِلَيْهِ أَحَدٌ فَوَجَدَ قَوْمًا قَدْ سَبَقُوهُ فَلَعَنَهُمْ يَوْمَئِذٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14599,
                "hadithNumber": "7038",
                "englishNarrator": "Jabir bin Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: He who climbed this hill, the hill of Murar, his sins would be obliterated as were obliterated the sins of Bani Isra'il. So the first to take their horses were the people of Banu Khazraj. Then there was a ceaseless flow of persons and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to them: All of you are those who have been pardoned except the owner of a red camel. We came to him and said to him: You also come on, so that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) may seek forgiveness for you. But he said: By Allah, so far as I am concerned, the finding of something lost is dearer to me than seeking of forgiveness for me by your companion (the Holy Prophet), and he remained busy in finding out his lost thing.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" کون ہے جو اس گھاٹی ( یعنی ) مرار کی گھاٹی پرچڑھے گا!بے شک اس کے گناہ بھی اسی طرح جھڑ جائیں گے جس طرح بنی اسرائیل کے گناہ جھڑ گئے تھے ۔ \"\" ( حضرت جابر رضی اللہ  عنہ نے ) کہا : تو سب سے پہلے جو اس گھاٹی پر چڑھے وہ ہمارے بنو خزرج کے گھوڑ ے تھے ، پھر لوگوں کا تانتابندھ گیا تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" تم سب وہ ہو جن کے گناہ بخش دیئے گئے ، سوائے سرخ اونٹ والے شخص کے ۔ \"\" ہم اس کے پاس آئے اور ( اس سے ) کہا : آؤ رسول اللہ صلی اللہ علیہ وسلم تمہارے لئے بھی استغفار فرمائیں ۔ اس نے کہا : اللہ کی قسم!اگر میں اپنی گم شدہ چیز پالوں تو یہ بات مجھے اس کی نسبت زیادہ پسند ہے کہ تمہارا صاحب میرے لئے مغفرت کی دعا کرے ۔ ( حضرت جابر رضی اللہ عنہ نے ) کہا : وہ آدمی اس وقت اپنی سے کم شدہ چیز کو ڈھونڈنے کے لئے آوازیں لگارہا تھا ۔",
                "urduNarrator": "ہم سے عبید اللہ بن نے بیان کیا, معاذ عنبری نے کہا ,  ہمیں قروہ بن خالد نے ابو زبیر سے حدیث بیان کی ، انھوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سےروایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا قُرَّةُ بْنُ خَالِدٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ يَصْعَدُ الثَّنِيَّةَ ثَنِيَّةَ الْمُرَارِ فَإِنَّهُ يُحَطُّ عَنْهُ مَا حُطَّ عَنْ بَنِي إِسْرَائِيلَ قَالَ فَكَانَ أَوَّلَ مَنْ صَعِدَهَا خَيْلُنَا خَيْلُ بَنِي الْخَزْرَجِ ثُمَّ تَتَامَّ النَّاسُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكُلُّكُمْ مَغْفُورٌ لَهُ إِلَّا صَاحِبَ الْجَمَلِ الْأَحْمَرِ فَأَتَيْنَاهُ فَقُلْنَا لَهُ تَعَالَ يَسْتَغْفِرْ لَكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ وَاللَّهِ لَأَنْ أَجِدَ ضَالَّتِي أَحَبُّ إِلَيَّ مِنْ أَنْ يَسْتَغْفِرَ لِي صَاحِبُكُمْ قَالَ وَكَانَ رَجُلٌ يَنْشُدُ ضَالَّةً لَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14600,
                "hadithNumber": "7039",
                "englishNarrator": "Jabir bin Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who would climb this hill of Murar. The rest of the hadith is the same but with this variation that it was a desert Arab who was finding out his lost thing.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کون ہےجو مراد مرار یا مرار کی گھاٹی پر چڑھے گا ۔ \" ( آگے ) معاذ عنبری کی حدیث کے مانند ، البتہ ( اس حدیث میں ) انھوں نے کہا : اور وہ ایک اعرابی تھا جو اپنی گم شدہ چیز ڈھونڈنے کے لئے اعلان کرنے کے لئے آیا تھا ۔",
                "urduNarrator": "یحییٰ بن حبیب حارثی نے ہمیں یہی حدیث بیان کی ، کہا : ہمیں خالد بن حارث نےحدیث بیان کی ، کہا : ہمیں قرہ نے حدیث بیان کی ، انھوں نے کہا : ہمیں ابو زبیر نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت کی ، انھوں نے کہا کہ",
                "hadithArabic": "و حَدَّثَنَاه يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ حَدَّثَنَا قُرَّةُ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ يَصْعَدُ ثَنِيَّةَ الْمُرَارِ أَوْ الْمَرَارِ بِمِثْلِ حَدِيثِ مُعَاذٍ غَيْرَ أَنَّهُ قَالَ وَإِذَا هُوَ أَعْرَابِيٌّ جَاءَ يَنْشُدُ ضَالَّةً لَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14601,
                "hadithNumber": "7040",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "There was a person amongst us who belonged to the tribe of Bani Najjar and he recited Sura al-Baqarah and Surat Al-i-'Imran and he used to transcribe for Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). He ran away as a rebel and joined the People of the Book. They gave it much importance and said: He is the person who used to transcribe for Muhammad and they were much pleased with him. Time rolled on that Allah caused his death. They dug the grave and buried him therein, but they found to their surprise that the earth had thrown him out over the surface. They again dug the grave for him and buried him but the earth again threw him out upon the surface. They again dug the grave for him and buried him but the earth again threw him out upon the surface. At last they left him unburied.",
                "hadithUrdu": "ہم بنو نجار میں سے ایک شخص تھا ، اس نے سورہ بقرہ اور سورہ آل عمران پڑھی ( یاد کی ) ہوئی تھی اور وہ رسول اللہ صلی اللہ علیہ وسلم کے لئے کتابت کیا کرتا تھا ، وہ بھاگ کر چلا گیا اور اہل کتاب کے ساتھ شامل ہوگیا ، انھوں نے اس کو بہت اونچا اٹھایا اور کہا : یہ ہے جو محمد ( صلی اللہ علیہ وسلم ) کے لئے کتابت کرتا تھا وہ اس کے آنے سے بہت خوش ہوئے ، تھوڑے ہی دن گزرے کہ اللہ تعالیٰ نے ان کے بیچ میں ( ہوتے ہوئے ) اس کی گردن توڑ دی ۔ انھوں نے اس کے لیے قبر کھودی اور اسے دفن کردیا ۔ صبح ہوئی تو زمین نے اسے اپنی سطح کے ا وپر پھینک دیا تھا ۔ انھوں نے دوبارہ وہی کیا ، اس کی قبر کھودی اور اسے دفن کردیا ۔ پھر صبح ہوئی تو زمین نے اسے باہر پھینک دیا تھا ، انھوں نے پھر ( تیسری بار ) اسی طرح کیا ، اس کے لئے قبر کھودی اور اسے دفن کردیا ، صبح کو زمین نے اسے باہر پھینک دیا ہواتھا تو انھوں نے اسے اسی طرح پھینکا ہوا چھوڑ دیا ۔",
                "urduNarrator": "مجھ سے محمد بن رافع نے بیان کیا، کہا ہم سے ابو نضر نے بیان کیا، ہم سے سلیمان نے جو کہ ابن المغیرہ ہیں، ثابت کی سند سے بیان کیا, حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے ، کہا",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا أَبُو النَّضْرِ حَدَّثَنَا سُلَيْمَانُ وَهُوَ ابْنُ الْمُغِيرَةِ عَنْ ثَابِتٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ كَانَ مِنَّا رَجُلٌ مِنْ بَنِي النَّجَّارِ قَدْ قَرَأَ الْبَقَرَةَ وَآلَ عِمْرَانَ وَكَانَ يَكْتُبُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَانْطَلَقَ هَارِبًا حَتَّى لَحِقَ بِأَهْلِ الْكِتَابِ قَالَ فَرَفَعُوهُ قَالُوا هَذَا قَدْ كَانَ يَكْتُبُ لِمُحَمَّدٍ فَأُعْجِبُوا بِهِ فَمَا لَبِثَ أَنْ قَصَمَ اللَّهُ عُنُقَهُ فِيهِمْ فَحَفَرُوا لَهُ فَوَارَوْهُ فَأَصْبَحَتْ الْأَرْضُ قَدْ نَبَذَتْهُ عَلَى وَجْهِهَا ثُمَّ عَادُوا فَحَفَرُوا لَهُ فَوَارَوْهُ فَأَصْبَحَتْ الْأَرْضُ قَدْ نَبَذَتْهُ عَلَى وَجْهِهَا ثُمَّ عَادُوا فَحَفَرُوا لَهُ فَوَارَوْهُ فَأَصْبَحَتْ الْأَرْضُ قَدْ نَبَذَتْهُ عَلَى وَجْهِهَا فَتَرَكُوهُ مَنْبُوذًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14602,
                "hadithNumber": "7041",
                "englishNarrator": "Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came back from a journey and as he was near Medina, there was such a violent gale that the mountain seemed to be pressed. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: This wind has perhaps been made to blow for the death of a hypocrite, and as he reached Medina a notorious hypocrite from amongst the hypocrites had died.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ایک سفر سے و اپس آئے ، جب آپ صلی اللہ علیہ وسلم مدینہ منورہ کے قریب تھے تو اتنے زور کی آندھی چلی کہ قریب تھا وہ سوار کو بھی ( ریت میں ) دفن کردے گی ۔ تو وہ ( جابر رضی اللہ عنہ ) یقین سے کہتے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا : \" یہ آندھی کسی منافق کی موت کے لئے بھیجی گئی ہے \" جب آ پ مدینہ منورہ تشریف لے آئے تو منافقوں میں سے ایک بہت بڑا منافق مرچکا تھا ۔",
                "urduNarrator": "مجھ سے ابو کریب محمد بن العلاء نے بیان کیا، حفص نے، یعنی ابن غیث نے، ہم سے الاعمش کی سند سے، ابو سفیان کی سند سے بیان کیا, حضرت جابر رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنِي أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا حَفْصٌ يَعْنِي ابْنَ غِيَاثٍ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدِمَ مِنْ سَفَرٍ فَلَمَّا كَانَ قُرْبَ الْمَدِينَةِ هَاجَتْ رِيحٌ شَدِيدَةٌ تَكَادُ أَنْ تَدْفِنَ الرَّاكِبَ فَزَعَمَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ بُعِثَتْ هَذِهِ الرِّيحُ لِمَوْتِ مُنَافِقٍ فَلَمَّا قَدِمَ الْمَدِينَةَ فَإِذَا مُنَافِقٌ عَظِيمٌ مِنْ الْمُنَافِقِينَ قَدْ مَاتَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14603,
                "hadithNumber": "7042",
                "englishNarrator": "Iyas reported on the authority of his father:",
                "hadithEnglish": "We went along with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) to visit a person suffering from fever. When I placed my hand upon him, I said: By Allah, I have never seen, till this day, a person running higher temperature than he. Thereupon Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), turning his face to his companions, said: May I not inform you of a severer temperature than this which these two persons would run on the Day of Resurrection? These two man who were riding with their backs towards the prophet ﷺ (heading away from him)\" -referring to two man who were among his companions at that time.",
                "hadithUrdu": "ہم نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک شخص کی ، جسے بخار چڑھا ہوا تھا ، عیادت کی ، کہا : میں نے اس ( کےجسم ) پر اپنا ہاتھ رکھا تو میں نے کہا : اللہ کی قسم! میں نے آج کی طرح کسی شخص کو نہیں دیکھا جو اس سے زیادہ تپ رہا ہو ، تو اللہ کے نبی صلی اللہ علیہ وسلم نے فرمایا : \" کیا میں تمھیں قیامت کے دن اس سے بھی زیادہ تپتے ہوؤں کے بارے میں نہ بتاؤں؟یہ دونوں شخص جو ( اونٹوں پر ) سوار ہیں ، اپنے منہ دوسری طرف کیے ہوئے ہیں ۔ \" ( آپ نے یہ بات ) دو آدمیوں کے بارے میں ( فرمائی ) جو اس وقت ( ظاہر طور ) آپ کے ساتھیوں میں ( شمار ہوتے ) تھے ۔",
                "urduNarrator": "مجھ سے عباس بن عبدالعظیم العنبری نے بیان کیا، کہا ہم سے ابو محمد الندر بن محمد بن موسیٰ الیمامی نے بیان کیا، ہم سے عکرمہ نے بیان کیا, ایاس ( بن سلمہ بن اکوع ) نے ہمیں حدیث بیان کی ، کہا : مجھے میرے والد نے حدیث بیان کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنِي عَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ حَدَّثَنَا أَبُو مُحَمَّدٍ النَّضْرُ بْنُ مُحَمَّدِ بْنِ مُوسَى الْيَمَامِيُّ حَدَّثَنَا عِكْرِمَةُ حَدَّثَنَا إِيَاسٌ حَدَّثَنِي أَبِي قَالَ عُدْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا مَوْعُوكًا قَالَ فَوَضَعْتُ يَدِي عَلَيْهِ فَقُلْتُ وَاللَّهِ مَا رَأَيْتُ كَالْيَوْمِ رَجُلًا أَشَدَّ حَرًّا فَقَالَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا أُخْبِرُكُمْ بِأَشَدَّ حَرًّا مِنْهُ يَوْمَ الْقِيَامَةِ هَذَيْنِكَ الرَّجُلَيْنِ الرَّاكِبَيْنِ الْمُقَفِّيَيْنِ لِرَجُلَيْنِ حِينَئِذٍ مِنْ أَصْحَابِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14604,
                "hadithNumber": "7043",
                "englishNarrator": "Ibn Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The similitude of a hypocrite is that of a sheep which roams aimlessly between two flocks. She goes to one at one time and to the other at another time.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" منافق کی مثال اس بکری کی طرح ہے جو بکریوں کے دو ریوڑوں کے درمیان ممیاتی ہوئی بھاگی پھرتی ہے کبھی بھاگ کر اس ریوڑ میں جاتی ہے اور کبھی اس طرف جاتی ہے ( کسی بھی ایک ریوڑ کا حصہ نہیں ہوتی ۔ )",
                "urduNarrator": "مجھ سے محمد بن عبداللہ بن نمیر نے بیان کیا، کہا ہم سے میرے والد نے بیان کیا، کہا ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا کہ ہم سے ابو اسامہ نے بیان کیا، انہوں نے کہا کہ ہم سے عبید اللہ نے بیان کیا، ہم سے محمد بن المثنیٰ نے بیان کیا اور اس کا لفظ یہ ہے کہ ہم سے عبد الوہاب نے بیان کیا، یعنی ثقفی نے, عبیداللہ نے نافع سے ، انھوں نے حضرت ابن عمر رضی اللہ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي  و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ قَالَا حَدَّثَنَا عُبَيْدُ اللَّهِ و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَاللَّفْظُ لَهُ أَخْبَرَنَا عَبْدُ الْوَهَّابِ يَعْنِي الثَّقَفِيَّ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَثَلُ الْمُنَافِقِ كَمَثَلِ الشَّاةِ الْعَائِرَةِ بَيْنَ الْغَنَمَيْنِ تَعِيرُ إِلَى هَذِهِ مَرَّةً وَإِلَى هَذِهِ مَرَّةً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14605,
                "hadithNumber": "7044",
                "englishNarrator": "Ibn Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saying like this but with this change of words: She sometimes finds a way in one flock and then in another flock.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ، مگر انھوں نے کہا : \" پلٹ کر ایک باراس ( ریوڑ ) میں آتی ہے اور دوسری بار اس میں ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے یعقوب نے بیان کیا، یعنی ابن عبدالرحمٰن القاری نے, موسیٰ بن عقبہ نے نافع سے ، انھوں نے حضرت ابن عمر رضی اللہ عنہ سے اور انھوں نے",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا يَعْقُوبُ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْقَارِيَّ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ تَكِرُّ فِي هَذِهِ مَرَّةً وَفِي هَذِهِ مَرَّةً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14606,
                "hadithNumber": "7045",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: A bulky person would be brought on the Day of judgment and he would not carry the weight to the eye of Allah equal even to that of a gnat. Nor shall We set up a balance for them on the Day of Resurrection (xviii. 105).",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" ( قیامت کے دن ایک بہت بڑا ( اور ) موٹا آدمی آئے گا ، ( لیکن ) اللہ تعالیٰ کے نزدیک وہ ( وزن میں ) مچھر کے پر کے برابر بھی نہ ہوگا ( یہ آیت ) پڑھ لو : \" پس ہم قیامت کے دن ان کے لئے کوئی وزن قائم نہیں کریں گے ۔ \"",
                "urduNarrator": "مجھ سے ابوبکر بن اسحاق نے بیان کیا، مجھ سے یحییٰ بن بکیر نے بیان کیا، مجھ سے المغیرہ نے بیان کیا، یعنی الحزمی نے، ابو الزناد کی سند سے، العرج کی سند سے, حضرت ابو ہریرۃ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي أَبُو بَكْرِ بْنُ إِسْحَقَ حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ حَدَّثَنِي الْمُغِيرَةُ يَعْنِي الْحِزَامِيَّ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّهُ لَيَأْتِي الرَّجُلُ الْعَظِيمُ السَّمِينُ يَوْمَ الْقِيَامَةِ لَا يَزِنُ عِنْدَ اللَّهِ جَنَاحَ بَعُوضَةٍ اقْرَءُوا فَلَا نُقِيمُ لَهُمْ يَوْمَ الْقِيَامَةِ وَزْنًا.",
                "headingArabic": "صفة القيامة والجنة والنار",
                "headingUrdu": "قیامت اور جنت اور دوزخ کی تفصیل",
                "headingEnglish": "The description of the Resurrection, and Paradise and Hell",
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14607,
                "hadithNumber": "7046",
                "englishNarrator": "Abdullah bin Mas'ud رضی اللہ عنہ reported:",
                "hadithEnglish": "A Jewish scholar came to Allah's Apostle (ﷺ) and said: Muhammad, or Abu al-Qasim, verily, Allah, the Exalted and Glorious would carry the Heavens on the Day of Judgment upon one finger and earths upon one finger and the mountains and trees upon one finger and the ocean and moist earth upon one finger, and in fact the whole of the creation upon one finger, and then He would stir them and say: I am your Lord, I am your Lord. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) smiled testifying what that scholar had said. He then recited this verse: And they honour not Allah with the honour due to Him; and the whole earth will be in His grip on the Day of Resurrection and the heaven rolled up in His right hand. Glory be to Him I and highly Exalted is He above what they associate (with Him) (Az-Zumar:67).",
                "hadithUrdu": "ایک یہودی عالم نبی کریم صلی اللہ علیہ وسلم کے پاس آیا اور کہا : اے محمد ( صلی اللہ علیہ وسلم ) یا کہا : ابو القاسم! بے شک اللہ تعالیٰ قیامت کے دن آسمانوں کو ایک انگلی پر رکھ لے گا ، اور زمینوں کو ایک انگلی پر ، اور پہاڑوں اور درختوں کو ایک انگلی پر اورپانی اور گیلی مٹی کو ایک انگلی پر اور تمام مخلوق کو ایک انگلی پر تھام لے گا ، پھر ان کو بلائے گا اور فرمائے گا : \" بادشاہ میں ہوں ، بادشاہ میں ہوں ۔ \" رسول اللہ صلی اللہ علیہ وسلم اس یہودی عالم کی بات پر تعجب اور اس کے تصدیق کرتے ہوئےہنسے ، پھر آپ نے ( یہ آیت ) پڑھی : \" انھوں نے اس طرح اللہ کی قدر نہیں کی جس طرح اس کی قدر کرنے کا حق ہے ۔ ساری زمین اور سب کے سب آسمان قیامت کے دن اس کے دائیں ہاتھ میں لپٹے ہوئے ہوں گے ۔ وہ ( ہراس چیز کی شراکت سے ) پاک اور بلند ہے جنھیں وہ ( اس کے ساتھ ) شریک کر تے ہیں ۔ \"",
                "urduNarrator": "ہم سے احمد بن عبداللہ بن یونس نے بیان کیا, افضیل بن عیاض نے منصور سے ، انھوں نے ابراہیم سے ، انھوں نے عبیدہ سلمانی سے اور انھوں نے حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ حَدَّثَنَا فُضَيْلٌ يَعْنِي ابْنَ عِيَاضٍ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عَبِيدَةَ السَّلْمَانِيِّ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ جَاءَ حَبْرٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا مُحَمَّدُ أَوْ يَا أَبَا الْقَاسِمِ إِنَّ اللَّهَ تَعَالَى يُمْسِكُ السَّمَاوَاتِ يَوْمَ الْقِيَامَةِ عَلَى إِصْبَعٍ وَالْأَرَضِينَ عَلَى إِصْبَعٍ وَالْجِبَالَ وَالشَّجَرَ عَلَى إِصْبَعٍ وَالْمَاءَ وَالثَّرَى عَلَى إِصْبَعٍ وَسَائِرَ الْخَلْقِ عَلَى إِصْبَعٍ ثُمَّ يَهُزُّهُنَّ فَيَقُولُ أَنَا الْمَلِكُ أَنَا الْمَلِكُ فَضَحِكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَعَجُّبًا مِمَّا قَالَ الْحَبْرُ تَصْدِيقًا لَهُ ثُمَّ قَرَأَ وَمَا قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ وَالْأَرْضُ جَمِيعًا قَبْضَتُهُ يَوْمَ الْقِيَامَةِ وَالسَّمَاوَاتُ مَطْوِيَّاتٌ بِيَمِينِهِ سُبْحَانَهُ وَتَعَالَى عَمَّا يُشْرِكُونَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14608,
                "hadithNumber": "7047",
                "englishNarrator": "This hadith has been narrated on the authority of Mansur with the same chain of transmitter (and the words are):",
                "hadithEnglish": "A Jew scholar came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). The rest of the hadith is the same, but there is no mention of then He would stir them. But there is this addition: I saw Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) smiling so much that his front teeth appeared and testifying him (the Jew scholar); then Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) recited the verse: And they honour not Allah with the honour due to Him (xxxix. 67).",
                "hadithUrdu": "یہود میں سے ایک عالم رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا ، فضیل کی حدیث کے مانند ، اور اس میں یہ بیان نہیں کیا : \"\" وہ ( اللہ ) ان ( انگلیوں ) کو ہلائے گا ۔ \"\" اور ( حضرت عبداللہ بن مسعود رضی اللہ  عنہ نے ) کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو د یکھا ، آپ اس بات پر تعجب سے اس کی تصدیق کرتے ہوئے ( اس طرح ) ہنسے کہ آپ سے پچھلے دندان مبارک ظاہر ہوگئے ، پھر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" انھوں نے ( اس طرح ) اللہ کی قدر نہیں کی ( جس طرح ) اس کی قدر کرنے کا حق ہے ۔ \"\" ( اور ( پوری ) آیت تلاوت فرمائی ۔",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ اور اسحاق بن ابراہیم دونوں نے بیان کیا, جریر نے منصور سے اسی سند کے ساتھ روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ كِلَاهُمَا عَنْ جَرِيرٍ عَنْ مَنْصُورٍ بِهَذَا الْإِسْنَادِ قَالَ جَاءَ حَبْرٌ مِنْ الْيَهُودِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ فُضَيْلٍ وَلَمْ يَذْكُرْ ثُمَّ يَهُزُّهُنَّ وَقَالَ فَلَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَحِكَ حَتَّى بَدَتْ نَوَاجِذُهُ تَعَجُّبًا لِمَا قَالَ تَصْدِيقًا لَهُ ثُمَّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَا قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ وَتَلَا الْآيَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14609,
                "hadithNumber": "7048",
                "englishNarrator": "Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "A person from the People of the Book came to Allah's Apostle (ﷺ) and said: Abu al-Qasim, verily, Allah holds the Heavens upon one finger and the earths upon one finger and the trees and moist earth upon one finger and in fact the whole of the creation upon one finger and then say: I am the King. I am the King. And he (the narrator) further said: I saw Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) smiling until his front teeth became visible and then he recited the verse: And they measure not the power of Allah with His true measure (39:67).",
                "hadithUrdu": "اہل کتاب میں سے ایک شخص رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں آیا اور اس نے کہا : ابو القاسم! بے شک اللہ تعالیٰ تمام آسمانوں کو ایک انگلی پر ، زمینوں کو ایک انگلی پر اور درختوں اور گیلی مٹی کو ایک انگلی پر اور تمام مخلوق کو ایک انگلی پر تھام لے گا ، پھر فرمائے گا : \" بادشاہ میں ہوں بادشاہ میں ہوں ۔ \" ( ابن مسعود رضی اللہ عنہ نے ) کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا ، آپ ( اس بات پر ) ہنس پڑے یہاں تک کہ آپ کے پچھلے دندان مبارک ظاہر ہوئے ، پھرآپ نے ( اس آیت کی ) تلاوت کی : \" انھوں نے اللہ تعالیٰ کی ( اس طرح قدر نہیں پہچانی جس طرح قدر پہچاننے کا حق ہے ۔ \"",
                "urduNarrator": "حفص بن غیاث نے کہا : ہمیں اعمش نے حدیث بیان کی ، انھوں نے کہا : میں نے ابراہیم کو کہتے ہوئے سنا : میں نے علقمہ کو کہتے ہوئے سنا کہ حضرت عبداللہ بن مسعود رضی اللہ عنہ نے کہا",
                "hadithArabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ حَدَّثَنَا أَبِي حَدَّثَنَا الْأَعْمَشُ قَالَ سَمِعْتُ إِبْرَاهِيمَ يَقُولُ سَمِعْتُ عَلْقَمَةَ يَقُولُ قَالَ عَبْدُ اللَّهِ جَاءَ رَجُلٌ مِنْ أَهْلِ الْكِتَابِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا أَبَا الْقَاسِمِ إِنَّ اللَّهَ يُمْسِكُ السَّمَاوَاتِ عَلَى إِصْبَعٍ وَالْأَرْضِينَ عَلَى إِصْبَعٍ وَالشَّجَرَ وَالثَّرَى عَلَى إِصْبَعٍ وَالْخَلَائِقَ عَلَى إِصْبَعٍ ثُمَّ يَقُولُ أَنَا الْمَلِكُ أَنَا الْمَلِكُ قَالَ فَرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَحِكَ حَتَّى بَدَتْ نَوَاجِذُهُ ثُمَّ قَرَأَ وَمَا قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14610,
                "hadithNumber": "7049",
                "englishNarrator": "It was narrated from Al-Amash with this chain of narrators in (a narration similar to no. 7048), except that their Hadith it says:",
                "hadithEnglish": "The trees no one finger, the soil on one finger. In the Hadith of Jarir it does not say: \"And the creation on one finger,\" but in his Hadith it says: \"The mountains on one finger.\" In the Hadith of Jarir it add. \"Confirming it and liking what he said.\"",
                "hadithUrdu": "\" اور درختوں کو ایک انگلی پر اور گیلی مٹی کو ایک انگلی پر تھام لےگااور جریر کی حدیث میں یہ نہیں ہے \" اور مخلوق کو ایک انگلی پر تھامے گا \" لیکن اس کی حدیث میں یہ ہے : \" اور پہاڑوں کو ایک انگلی پر تھام لے گا \" اور انھوں نے جریر کی حدیث میں مذید یہ کہا : \" اس کی بات کی تصدیق اور اس پر تعجب کا اظہار کرتے ہوئے ( آپ ہنسے ۔ ) \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، کہا: ابو معاویہ ، عیسی بن یونس اور جریر سب نے اعمش سے اسی سند کے ساتھ روایت کی ، مگران سب کی روایتوں میں ہے",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَعَلِيُّ بْنُ خَشْرَمٍ قَالَا أَخْبَرَنَا عِيسَى بْنُ يُونُسَ و حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ كُلُّهُمْ عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ غَيْرَ أَنَّ فِي حَدِيثِهِمْ جَمِيعًا وَالشَّجَرَ عَلَى إِصْبَعٍ وَالثَّرَى عَلَى إِصْبَعٍ وَلَيْسَ فِي حَدِيثِ جَرِيرٍ وَالْخَلَائِقَ عَلَى إِصْبَعٍ وَلَكِنْ فِي حَدِيثِهِ وَالْجِبَالَ عَلَى إِصْبَعٍ وَزَادَ فِي حَدِيثِ جَرِيرٍ تَصْدِيقًا لَهُ تَعَجُّبًا لِمَا قَالَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14611,
                "hadithNumber": "7050",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Allah, the Exalted and Glorious, will take in His grip the Earth on the Day of Judgment and He would roll up the sky in His right hand and would say: I am the Lord; where are the sovereigns of the world?",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ تعالیٰ قیامت کے دن زمین کو اپنی مٹھی میں لے لے گا اور آسمان کو اپنے داہنے ہاتھ میں لپیٹ لے گا ، پھر فرمائے گا : \" بادشاہ میں ہوں ، زمین کے بادشاہ کہاں ہیں؟ \"",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، مجھ سے یونس نے ابن شہاب کی سند سے بیان کیا, ابن مسیب نے حدیث بیان کی کہ حضرت ابو ہریرہ رضی اللہ عنہ بیان کیا کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ حَدَّثَنِي ابْنُ الْمُسَيَّبِ أَنَّ أَبَا هُرَيْرَةَ كَانَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْبِضُ اللَّهُ تَبَارَكَ وَتَعَالَى الْأَرْضَ يَوْمَ الْقِيَامَةِ وَيَطْوِي السَّمَاءَ بِيَمِينِهِ ثُمَّ يَقُولُ أَنَا الْمَلِكُ أَيْنَ مُلُوكُ الْأَرْضِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14612,
                "hadithNumber": "7051",
                "englishNarrator": "Abdullah bin 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saying: Allah, the Exalted and Glorious, would fold the Heavens on the Day of Judgment and then He would place them on His right hand and say: I am the Lord; where are the haughty and where are the proud (today)? He would fold the' earth (placing it) on the left hand and say: I am the Lord; where are the haughty and where are the proud (today)?",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ عزوجل قیامت کےدن آسمانوں کو لپیٹے گا ، پھران کو دائیں ہاتھ سے پکڑ لے گا اور فرمائے گا : بادشاہ میں ہوں ۔ ( آج دوسروں پر ) جبر کرنے والے کہاں ہیں؟تکبر کرنے والے کہاں ہیں؟پھر بائیں ہاتھ سے زمین کو لپیٹ لے گا ، پھر فرمائے گا : \" بادشاہ میں ہوں ، ( آج ) جبر کرنےوالے کہاں ہیں؟تکبر کرنے والے کہاں ہیں؟ ‘ ‘",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے ابو اسامہ نے، عمر بن حمزہ رضی اللہ عنہ سے, سالم بن عبداللہ نے کہا : مجھے عبداللہ بن عمر رضی اللہ عنہ نے خبر دی ، کہا",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ عُمَرَ بْنِ حَمْزَةَ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَطْوِي اللَّهُ عَزَّ وَجَلَّ السَّمَاوَاتِ يَوْمَ الْقِيَامَةِ ثُمَّ يَأْخُذُهُنَّ بِيَدِهِ الْيُمْنَى ثُمَّ يَقُولُ أَنَا الْمَلِكُ أَيْنَ الْجَبَّارُونَ أَيْنَ الْمُتَكَبِّرُونَ ثُمَّ يَطْوِي الْأَرَضِينَ بِشِمَالِهِ ثُمَّ يَقُولُ أَنَا الْمَلِكُ أَيْنَ الْجَبَّارُونَ أَيْنَ الْمُتَكَبِّرُونَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14613,
                "hadithNumber": "7052",
                "englishNarrator": "Abdullah bin Miqsam reported:",
                "hadithEnglish": "He saw Abdullah bin Umar رضی اللہ عنہ as he narrated Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Allah, the Exalted and Glorious, would take in His hand His Heavens and His Earth, and would say: I am Allah. And He would clench His fingers and then would open them (and say): I am your Lord. I saw the pulpit in commotion from underneath because of something (vib-ating) there. And (I felt this commotion so much) that I said (to myself): It would fall with the Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) upon it.",
                "hadithUrdu": "انھوں نے حضر ت عبداللہ بن عمر رضی اللہ  عنہ کی طرف دیکھا کہ وہ ( حدیث بیان کرتے ہوئے عملاً ) کس طرح رسول اللہ صلی اللہ علیہ وسلم کی طرح کرکے دکھاتے ہیں ۔ ( ابن عمر رضی اللہ عنہ نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے ) فرمایا : \" اللہ عزوجل اپنے آسمانوں اور اپنی زمینوں کو اپنے دونوں ہاتھوں سے پکڑ لے گا پھر فرمائے گا \" میں اللہ ، میں بادشاہ ہوں ۔ \" اور آپ صلی اللہ علیہ وسلم ا پنی انگلیوں کو بند کرتے تھے اور کھولتے تھے ۔ حتیٰ کہ میں نے منبر کو دیکھا ، وہ اپنے نچلے حصے سے ( لے کر او پرکے حصے تک ) ہل رہاتھا ۔ یہاں تک کہ میں نے کہا : کیا وہ رسول اللہ صلی اللہ علیہ وسلم کو لے کر گرجائے گا؟",
                "urduNarrator": "ہم سے سعید بن منصور نے بیان کیا, یعقوب بن عبدالرحمن نے کہا : مجھے ابو حازم نے عبیداللہ بن مقسم سے حدیث بیان کی",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا يَعْقُوبُ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ حَدَّثَنِي أَبُو حَازِمٍ عَنْ عُبَيْدِ اللَّهِ بْنِ مِقْسَمٍ أَنَّهُ نَظَرَ إِلَى عَبْدِ اللَّهِ بْنِ عُمَرَ كَيْفَ يَحْكِي رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَأْخُذُ اللَّهُ عَزَّ وَجَلَّ سَمَاوَاتِهِ وَأَرَضِيهِ بِيَدَيْهِ فَيَقُولُ أَنَا اللَّهُ وَيَقْبِضُ أَصَابِعَهُ وَيَبْسُطُهَا أَنَا الْمَلِكُ حَتَّى نَظَرْتُ إِلَى الْمِنْبَرِ يَتَحَرَّكُ مِنْ أَسْفَلِ شَيْءٍ مِنْهُ حَتَّى إِنِّي لَأَقُولُ أَسَاقِطٌ هُوَ بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 14301,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=572",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=570",
                "label": "570",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=571",
                "label": "571",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=572",
                "label": "572",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=573",
                "label": "573",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=574",
                "label": "574",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=575",
                "label": "575",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=576",
                "label": "576",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=574",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=574",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=572",
        "to": 14325,
        "total": 40465
    }
}