{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 455,
        "data": [
            {
                "id": 11639,
                "hadithNumber": "4075",
                "englishNarrator": "Fadala bin Ubaid al-Ansari رضی اللہ عنہ reported:",
                "hadithEnglish": "A necklace having gold and gems in it was brought to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) in Khaibar and it was one of the spoils of war and was put to sale. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: The gold used in it should be separated, and then Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) further said: (Sell) gold for gold with equal weight.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے پاس ، جبکہ آپ خیبر میں تھے ، ایک ہار لایا گیا ، اس میں نگینے تھے اور سونا تھا اور وہ ان غنائم میں سے تھا جو فروخت کی جا رہی تھیں تو رسول اللہ صلی اللہ علیہ وسلم نے اس سونے کے بارے میں حکم دیا جو ہار میں تھا ، تو اکیلے اسی کو الگ کر دیا گیا ، پھر رسول اللہ صلی اللہ علیہ وسلم نے ان لوگوں سے ( جو لین دین کر رہے تھے ) فرمایا : \" سونے کے عوض سونا برابر برابر وزن کا ( خریدو اور بیچو ۔ ) \"",
                "urduNarrator": "مجھ سے ابو الطاہر احمد بن عمرو بن سرح نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، مجھ سے ابو ہانی الخولانی نے بیان کیا، انہوں نے سنا, علی بن رباح لخمی نے کہا : میں نے حضرت فضالہ بن عبید رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي أَبُو هَانِئٍ الْخَوْلَانِيُّ، أَنَّهُ سَمِعَ عُلَيَّ بْنَ رَبَاحٍ اللَّخْمِيَّ، يَقُولُ: سَمِعْتُ فَضَالَةَ بْنَ عُبَيْدٍ الْأَنْصَارِيَّ، يَقُولُ: أُتِيَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَهُوَ بِخَيْبَرَ بِقِلَادَةٍ فِيهَا خَرَزٌ وَذَهَبٌ، وَهِيَ مِنَ الْمَغَانِمِ تُبَاعُ، فَأَمَرَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِالذَّهَبِ الَّذِي فِي الْقِلَادَةِ فَنُزِعَ وَحْدَهُ، ثُمَّ قَالَ لَهُمْ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الذَّهَبُ بِالذَّهَبِ وَزْنًا بِوَزْنٍ».",
                "headingArabic": "بَيْعِ الْقِلاَدَةِ فِيهَا خَرَزٌ وَذَهَبٌ ‏‏",
                "headingUrdu": "وہ ہار بیچنا جس میں موتی اور سونا ہو۔",
                "headingEnglish": "Selling a necklace in which there are pearls and gold",
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11640,
                "hadithNumber": "4076",
                "englishNarrator": "Fadila bin 'Ubaid (رضی اللہ عنہ) reported:",
                "hadithEnglish": "I bought on the day (of the Victory of Khaibar) a necklace for twelve dinars (gold coins). It was made of gold studded with gems. I separated (gold from gems) in it, and found (gold) of more (worth) than twelve dinars. I made a mention of it to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), whereupon he said: It should not be sold unless it is separated.",
                "hadithUrdu": "میں نے خیبر کے دن بارہ دینار میں ایک ہار خریدا ، اس میں سونا اور نگینے تھے ۔ میں نے انہیں الگ الگ کیا تو مجھے اس میں بارہ دینار سے زیادہ مل گئے ، میں نے اس بات کا تذکرہ نبی صلی اللہ علیہ وسلم سے کیا تو آپ نے فرمایا : \" اسے الگ الگ کرنے سے پہلے فروخت نہ کیا جائے ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, لیث نے ہمیں ابوشجاع سعید بن یزید سے حدیث بیان کی ، انہوں نے خالد بن ابی عمران سے ، انہوں نے حنش صنعانی سے اور انہوں نے حضرت فضالہ بن عبید رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ أَبِي شُجَاعٍ سَعِيدِ بْنِ يَزِيدَ، عَنْ خَالِدِ بْنِ أَبِي عِمْرَانَ، عَنْ حَنَشٍ الصَّنْعَانِيِّ، عَنْ فَضَالَةَ بْنِ عُبَيْدٍ، قَالَ: اشْتَرَيْتُ يَوْمَ خَيْبَرَ قِلَادَةً بِاثْنَيْ عَشَرَ دِينَارًا، فِيهَا ذَهَبٌ وَخَرَزٌ، فَفَصَّلْتُهَا، فَوَجَدْتُ فِيهَا أَكْثَرَ مِنِ اثْنَيْ عَشَرَ دِينَارًا، فَذَكَرْتُ ذَلِكَ لِلنَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «لَا تُبَاعُ حَتَّى تُفَصَّلَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11641,
                "hadithNumber": "4077",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this is narrated on the authority of Sa'id bin Yazid with the same chain of transmitters.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، انہوں نے کہا ابن مبارک نے سعید بن یزید سے اسی سند کے ساتھ اسی طرح حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، قَالَا: حَدَّثَنَا ابْنُ مُبَارَكٍ، عَنْ سَعِيدِ بْنِ يَزِيدَ، بِهَذَا الْإِسْنَادِ نَحْوَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11642,
                "hadithNumber": "4078",
                "englishNarrator": "Fadala bin 'Ubaid رضی اللہ عنہ reported:",
                "hadithEnglish": "We were in the company of Allah's Messenger (ﷺ) on the day (of the Victory of) Khaibar, and made transaction with the Jews for the 'uqiya of gold for the dinars or three (gold coins), whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Do not sell gold for gold but for equal weight",
                "hadithUrdu": "خیبر کے دن ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے ، ہم یہود کے ساتھ دو یا تین دیناروں کے عوض ایک اوقیہ سونے کی بیع کرتے تھے تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" سونے کے عوض سونے کی بیع نہ کرو مگر برابر برابر وزن کے ساتھ ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ہم سے لیث نے بیان کیا، ابن ابی جعفر کی سند سے, جلاح ابوکثیر سے روایت ہے ، انہوں نے کہا : مجھے حنش صنعانی نے حضرت فضالہ بن عبید رضی اللہ عنہ سے حدیث بیان کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنِ ابْنِ أَبِي جَعْفَرٍ، عَنِ الْجُلَاحِ أَبِي كَثِيرٍ، حَدَّثَنِي حَنَشٌ الصَّنْعَانِيُّ، عَنْ فَضَالَةَ بْنِ عُبَيْدٍ، قَالَ: كُنَّا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَوْمَ خَيْبَرَ، نُبَايِعُ الْيَهُودَ الْوُقِيَّةَ الذَّهَبَ بِالدِّينَارَيْنِ وَالثَّلَاثَةِ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تَبِيعُوا الذَّهَبَ بِالذَّهَبِ، إِلَّا وَزْنًا بِوَزْنٍ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11643,
                "hadithNumber": "4079",
                "englishNarrator": "Hanash reported:",
                "hadithEnglish": "We were along with Fadala bin Ubaid (رضی اللہ عنہ) in an expedition. There fell to my and my friend's lot a necklace made of gold, silver and jewels. I decided to buy that. I asked Fadala bin 'Ubaid رضی اللہ عنہ , whereupon he said: Separate its gold and place it in one pan (of the balance) and place your gold in the other pan, and do not receive but equal for equal, for I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who believes in Allah and the Hereafter should not take but equal for equal.",
                "hadithUrdu": "ہم ایک غزوے میں حضرت فضالہ بن عبید رضی اللہ عنہ کے ساتھ تھے ، میرے اور میرے ساتھیوں کے حصے میں ایک ہار آیا جس میں سونا ، چاندی اور جواہر تھے ۔ میں نے اسے خریدنے کا ارادہ کیا ، چنانچہ میں نے حضرت فضالہ بن عبید رضی اللہ عنہ سے پوچھا تو انہوں نے کہا : اس کا سونا اتار لو اور اسے ایک پلڑے میں رکھو اور اپنا سونا دوسرے پلڑے میں رکھو ، پھر برابر برابر کے سوا نہ لو ( کیونکہ ) میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے ، آپ فرما رہے تھے : \" جو اللہ اور یومِ آخرت پر ایمان رکھتا ہے وہ ( اس طرح کی بیع میں ) مثل بمثل ( یکساں ) کے سوا ہرگز نہ لے ۔ \"",
                "urduNarrator": "مجھ سے ابو الطاہر نے بیان کیا، ہم سے ابن وہب نے قرہ بن عبدالرحمٰن المعافیری، عمرو بن الحارث اور دوسرے لوگوں سے بیان کیا, عامر بن یحییٰ معافری نے حنش سے خبر دی کہ انہوں نے کہا",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، عَنْ قُرَّةَ بْنِ عَبْدِ الرَّحْمَنِ الْمَعَافِرِيِّ، وَعَمْرِو بْنِ الْحَارِثِ، وَغَيْرِهِمَا، أَنَّ عَامِرَ بْنَ يَحْيَى الْمَعَافِرِيَّ، أَخْبَرَهُمْ، عَنْ حَنَشٍ، أَنَّهُ قَالَ: كُنَّا مَعَ فَضَالَةَ بْنِ عُبَيْدٍ فِي غَزْوَةٍ، فَطَارَتْ لِي وَلِأَصْحَابِي قِلَادَةٌ فِيهَا ذَهَبٌ وَوَرِقٌ وَجَوْهَرٌ، فَأَرَدْتُ أَنْ أَشْتَرِيَهَا، فَسَأَلْتُ فَضَالَةَ بْنَ عُبَيْدٍ، فَقَالَ: انْزِعْ ذَهَبَهَا فَاجْعَلْهُ فِي كِفَّةٍ، وَاجْعَلْ ذَهَبَكَ فِي كِفَّةٍ، ثُمَّ لَا تَأْخُذَنَّ إِلَّا مِثْلًا بِمِثْلٍ، فَإِنِّي سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: «مَنْ كَانَ يُؤْمِنُ بِاللهِ وَالْيَوْمِ الْآخِرِ، فَلَا يَأْخُذَنَّ إِلَّا مِثْلًا بِمِثْلٍ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11644,
                "hadithNumber": "4080",
                "englishNarrator": "Ma'mar bin Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "He sent his slave with a sa' of wheat and said to him: Sell it, and then buy with it barley. The slave went away and he got a sa' (of barley) and a part of sa' over and above that. When he came to Ma'mar he informed him about that, whereupon Ma'mar said to him: Why did you do that? Go back and return that, and do not accept but weight, for weight, for I used to hear from Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Wheat for wheat and like for like. He (one of the narrators) said: Our food in those days consisted of barley. It was said to him (Ma'mar) that (wheat) is not like that (barley). He replied: I am afraid these may not be similar",
                "hadithUrdu": "انہوں نے گندم کا ایک صاع دے کر اپنا غلام بھیجا اور کہا : اسے بیچ دو ، پھر اس ( کی قیمت ) سے جو خرید لاؤ ۔ غلام گیا اور ( گندم کے صاع کے عوض ) ایک صاع اور صاع سے کچھ زیادہ ( جو ) لے آیا ، جب وہ معمر رضی اللہ عنہ کے پاس آیا تو انہیں یہ بات بتائی ، تو حضرت معمر رضی اللہ عنہ نے اس سے کہا : تم نے یہ کام کیوں کیا؟ جاؤ اور اسے واپس کرو اور مثل بمثل کے سوا کچھ نہ لو ، میں رسول اللہ صلی اللہ علیہ وسلم سے سنا کرتے تھا ، آپ فرماتے تھے : \" غلے کے عوض غلے کی بیع مثل بمثل ہے ۔ \" کہا : ان دنوں ہماری خوراک جَو کی تھی ۔ ان سے کہا گیا : وہ تو اس ( گندم ) کی مثل نہیں ہے ۔ ( یعنی دو الگ جنسیں ہیں ، اس لیے تفاضل جائز ہے ۔ ) انہوں نے کہا : مجھے خدشہ ہے کہ وہ اس کے مشابہ ہو گی ۔",
                "urduNarrator": "ہم سے ہارون بن معروف نے بیان کیا، کہا ہم سے عبداللہ بن وہب نے بیان کیا، کہا کہ مجھ سے عمرو نے بیان کیا، کہا کہ مجھ سے ابو الطاہر نے بیان کیا، کہا کہ ہم سے ابن وہب نے عمرو کی سند سے بیان کیا۔ ابن حارث کہ ابو الندر, بُسر بن سعید نے معمر بن عبداللہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، حَدَّثَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو، ح وحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، عَنْ عَمْرِو بْنِ الْحَارِثِ، أَنَّ أَبَا النَّضْرِ، حَدَّثَهُ أَنَّ بُسْرَ بْنَ سَعِيدٍ، حَدَّثَهُ، عَنْ مَعْمَرِ بْنِ عَبْدِ اللهِ، أَنَّهُ أَرْسَلَ غُلَامَهُ بِصَاعِ قَمْحٍ، فَقَالَ: بِعْهُ، ثُمَّ اشْتَرِ بِهِ شَعِيرًا، فَذَهَبَ الْغُلَامُ، فَأَخَذَ صَاعًا وَزِيَادَةَ بَعْضِ صَاعٍ، فَلَمَّا جَاءَ مَعْمَرًا أَخْبَرَهُ بِذَلِكَ، فَقَالَ لَهُ مَعْمَرٌ: لِمَ فَعَلْتَ ذَلِكَ؟ انْطَلِقْ فَرُدَّهُ، وَلَا تَأْخُذَنَّ إِلَّا مِثْلًا بِمِثْلٍ، فَإِنِّي كُنْتُ أَسْمَعُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: «الطَّعَامُ بِالطَّعَامِ مِثْلًا بِمِثْلٍ»، قَالَ: «وَكَانَ طَعَامُنَا يَوْمَئِذٍ الشَّعِيرَ»، قِيلَ لَهُ: فَإِنَّهُ لَيْسَ بِمِثْلِهِ، قَالَ: «إِنِّي أَخَافُ أَنْ يُضَارِعَ.",
                "headingArabic": "بَيْعِ الطَّعَامِ مِثْلاً بِمِثْلٍ ‏‏",
                "headingUrdu": "پسند کے بدلے کھانا فروخت کرنا",
                "headingEnglish": "Selling Food Like for Like",
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11645,
                "hadithNumber": "4081",
                "englishNarrator": "Abu Huraira and Abu Sa'id al-Khudri ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) deputed a person from Banu 'Adi al-Ansari to collect revenue from Khaibar. He came with a fine quality of dates, whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to him: Are all the dates of Khaibar like this? He said: Allah's Messenger, it is not so. We buy one sa' of (fine quality of dates) for two sa's out of total output (including even the inferior quality of dates), whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Don't do that, but like for like, or sell this (the inferior quality and receive the price) and then buy with the price of that, and that would make up the measure.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے بنو عدی سے تعلق رکھنے والے ایک انصاری کو بھیجا اور اسے خیبر کا عامل مقرر کیا ، وہ جنیب ( عمدہ قسم کی ) کھجور لے کر آیا ، تو رسول اللہ صلی اللہ علیہ وسلم نے اس سے پوچھا : \" کیا خیبر کی تمام کھجور اسی طرح کی ہے؟ اس نے عرض کی : اللہ کے رسول! واللہ! نہیں ۔ ہم ملی جلی کھجور کے دو صاع کے عوض ( عمدہ کھجور کا ) ایک صاع خریدتے ہیں ، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ایسا نہ کرو بلکہ مثل بمثل ( یکساں خریدو بیچو ) یا پھر اسے بیچ دو اور اس کی قیمت سے دوسری قسم خرید لو ، اسی طرح وزن ( کے ذریعے سے لین دین کرنا ہو تو بھی برابر ہونا ضروری ) ہے ۔ \"",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ بن قَنعب نے بیان کیا,سلیمان بن بلال نے ہمیں عبدالمجید بن سہیل بن عبدالرحمن سے حدیث بیان کی کہ انہوں نے سعید بن مسیب سے سنا ، وہ حدیث بیان کر رہے تھے کہ حضرت ابوہریرہ اور حضرت ابو سعید خدری رضی اللہ عنہ نے انہیں حدیث بیان کی",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا سُلَيْمَانُ يَعْنِي ابْنَ بِلَالٍ، عَنْ عَبْدِ الْمَجِيدِ بْنِ سُهَيْلِ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيِّبِ، يُحَدِّثُ أَنَّ أَبَا هُرَيْرَةَ، وَأَبَا سَعِيدٍ، حَدَّثَاهُ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَعَثَ أَخَا بَنِي عَدِيٍّ الْأَنْصَارِيَّ، فَاسْتَعْمَلَهُ عَلَى خَيْبَرَ، فَقَدِمَ بِتَمْرٍ جَنِيبٍ، فَقَالَ لَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَكُلُّ تَمْرِ خَيْبَرَ هَكَذَا؟» قَالَ: لَا وَاللهِ يَا رَسُولَ اللهِ إِنَّا لَنَشْتَرِي الصَّاعَ بِالصَّاعَيْنِ مِنَ الْجَمْعِ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تَفْعَلُوا، وَلَكِنْ مِثْلًا بِمِثْلٍ، أَوْ بِيعُوا هَذَا وَاشْتَرُوا بِثَمَنِهِ مِنْ هَذَا، وَكَذَلِكَ الْمِيزَانُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11646,
                "hadithNumber": "4082",
                "englishNarrator": "Abu Huraira (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) deputed a person to collect revenue from Khaibar. He brought fine quality of dates, whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Are all the dates of Khaibar like this)? He said: No. We got one sa' (of fine dates) for two sa's (of inferior dates), and (similarly) two sa's for three sa's. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Don't do that rather sell the inferior quality of dates for dirhams (money), and then buy the superior quality with the help of dirhams.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ایک آدمی کو خیبر کو عامل مقرر کیا ، وہ آپ کے پاس جنیب ( عمدہ قسم کی ) کھجور لے آیا تو رسول اللہ صلی اللہ علیہ وسلم نے اس سے پوچھا : \" کیا خیبر کی تمام کھجور اسی طرح کی ہے؟ \" اس نے عرض کی : واللہ! یا رسول اللہ! نہیں ۔ ہم ( ملی جلی کھجور کے ) دو صاع کے عوض اس کا ایک صاع اور تین کے عوض دو صاع لیتے ہیں ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ایسا نہ کرو ، ملی جلی کھجور کو درہموں کے عوض بیچ دو ، پھر درہموں سے جنیب ( عمدہ ) کھجور خرید لو ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا  امام مالک نے عبدالمجید بن سہیل بن عبدالرحمن بن عوف سے ، انہوں نے سعید بن مسیب سے اور انہوں نے حضرت ابوسعید خدری اور حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ عَبْدِ الْمَجِيدِ بْنِ سُهَيْلِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، وَعَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ اسْتَعْمَلَ رَجُلًا عَلَى خَيْبَرَ، فَجَاءَهُ بِتَمْرٍ جَنِيبٍ، فَقَالَ لَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَكُلُّ تَمْرِ خَيْبَرَ هَكَذَا؟»، فَقَالَ: لَا وَاللهِ يَا رَسُولَ اللهِ إِنَّا لَنَأْخُذُ الصَّاعَ مِنْ هَذَا بِالصَّاعَيْنِ، وَالصَّاعَيْنِ بِالثَّلَاثَةِ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «فَلَا تَفْعَلْ، بِعِ الْجَمْعَ بِالدَّرَاهِمِ، ثُمَّ ابْتَعْ بِالدَّرَاهِمِ جَنِيبًا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11647,
                "hadithNumber": "4083",
                "englishNarrator": "Abu Sa'id رضی اللہ عنہ reported:",
                "hadithEnglish": "Bilal (رضی اللہ عنہ) came with fine quality of dates. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to him: From where (you have brought them)? Bilal رضی اللہ عنہ said: We had inferior quality of dates and I exchanged two sa's (of inferior quality) with one sa (of fine quality) as food for Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Woe! it is in fact usury; therefore, don't do that. But when you intend to buy dates (of superior quality), sell (the inferior quality) in a separate bargain and then buy (the superior quality). And in the hadith transmitted by Ibn Sahl there is no mention of whereupon .",
                "hadithUrdu": "حضرت بلال رضی اللہ عنہ برنی کھجور لے کر آئے تو رسول اللہ صلی اللہ علیہ وسلم نے ان سے پوچھا : \"\" یہ کہاں سے لائے ہو؟ \"\" تو حضرت بلال رضی اللہ عنہ نے کہا : ہمارے پاس ردی کھجور تھی ، میں نے نبی صلی اللہ علیہ وسلم کے کھانے کے لیے اُسے دو صاع کے عوض ( اِس کے ) ایک صاع سے بیچ دیا ۔ تو اس وقت رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" مجھے افسوس ہوا! تو یہ عین سود ہے ، ایسا نہ کرو بلکہ جب تم کھجور خریدنا چاہو تو اسے ( ردی کھجور کو ) دوسری ( نقدی وغیرہ کے عوض کی گئی ) بیع کے ذریعے سے بیچ دو ، پھر اس ( کی قیمت ) سے ( دوسری قسم ) خرید لو ۔ \"\" ابن سہل نے اپنی حدیث میں \"\" اس وقت \"\" کے الفاظ بیان نہیں کیے.",
                "urduNarrator": "اسحاق بن منصور نے کہا : ہمیں یحییٰ بن صالح وحاظی سے حدیث بیان کی ، انہوں نے کہا : ہمیں معاویہ بن سلام نے حدیث سنائی ۔ نیز محمد بن سہیل تمیمی اور عبداللہ بن عبدالرحمٰن دارمی نے ۔ ۔ الفاظ دونوں کے یہی ہیں ۔ ۔ دونوں نے مجھے یحییٰ بن حسان سے حدیث بیان کی ، کہا : ہمیں معاویہ بن سلام نے حدیث سنائی ، انہوں نے کہا : مجھے یحییٰ بن ابی کثیر نے خبر دی ، انہوں نے کہا : میں نے عقبہ بن عبدالغافر سے سنا ، وہ کہہ رہے تھے : میں نے حضرت ابوسعید رضی اللہ عنہ سے سنا وہ کہہ رہے تھے",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا يَحْيَى بْنُ صَالِحٍ الْوُحَاظِيُّ، حَدَّثَنَا مُعَاوِيَةُ، ح وحَدَّثَنِي مُحَمَّدُ بْنُ سَهْلٍ التَّمِيمِيُّ، وَعَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، وَاللَّفْظُ لَهُمَا جَمِيعًا، عَنْ يَحْيَى بْنِ حَسَّانَ، حَدَّثَنَا مُعَاوِيَةُ وَهُوَ ابْنُ سَلَّامٍ، أَخْبَرَنِي يَحْيَى وَهُوَ ابْنُ أَبِي كَثِيرٍ، قَالَ: سَمِعْتُ عُقْبَةَ بْنَ عَبْدِ الْغَافِرِ، يَقُولُ: سَمِعْتُ أَبَا سَعِيدٍ، يَقُولُ: جَاءَ بِلَالٌ بِتَمْرٍ بَرْنِيٍّ، فَقَالَ لَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مِنْ أَيْنَ هَذَا؟» فَقَالَ بِلَالٌ: تَمْرٌ كَانَ عِنْدَنَا رَدِيءٌ، فَبِعْتُ مِنْهُ صَاعَيْنِ بِصَاعٍ لِمَطْعَمِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ رَسُولُ اللهِ عِنْدَ ذَلِكَ: «أَوَّهْ عَيْنُ الرِّبَا، لَا تَفْعَلْ، وَلَكِنْ إِذَا أَرَدْتَ أَنْ تَشْتَرِيَ التَّمْرَ فَبِعْهُ بِبَيْعٍ آخَرَ، ثُمَّ اشْتَرِ بِهِ»، لَمْ يَذْكُرِ ابْنُ سَهْلٍ فِي حَدِيثِهِ عِنْدَ ذَلِكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11648,
                "hadithNumber": "4084",
                "englishNarrator": "Abu Sa'id ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "Dates were brought to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), and he said: These dates are not like our dates, whereupon a man said: We sold two sa's of our dates (in order to get) one sa', of these (fine dates), whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: That is interest; so return (these dates of fine quality), and get your (inferior dates) ; then sell our dates (for money) and buy for us (with the help of money) such (fine dates).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے پاس کھجور لائی گئی تو آپ نے فرمایا : \" یہ کھجور ہماری کھجور میں سے نہیں ۔ \" اس پر ایک آدمی نے کہا : اللہ کے رسول! ہم نے اپنی کھجور کے دو صاع اس کھجور کے ایک صاع کے عوض بیچے ہیں ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" یہ سود ہے ، اسے واپس کرو ، پھر ہماری کھجور ( نقدی کے عوض ) فروخت کرو اور ( اس کی قیمت سے ) ہمارے لیے یہ کھجور خریدو ۔ \"",
                "urduNarrator": "ہم سے سلمہ بن شبیب نے بیان کیا، ہم سے حسن بن عیان نے بیان کیا، ہم سے معقل نے بیان کیا، وہ ابو قزعہ الباہلی کی سند سے, ابونضرہ نے حضرت ابوسعید خدری رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنْ أَبِي قَزَعَةَ الْبَاهِلِيِّ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ، قَالَ: أُتِيَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِتَمْرٍ، فَقَالَ: «مَا هَذَا التَّمْرُ مِنْ تَمْرِنَا؟»، فَقَالَ الرَّجُلُ: يَا رَسُولَ اللهِ، بِعْنَا تَمْرَنَا صَاعَيْنِ بِصَاعٍ مِنْ هَذَا، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «هذَا الرِّبَا فَرُدُّوهُ، ثُمَّ بِيعُوا تَمْرَنَا وَاشْتَرُوا لَنَا مِنْ هَذَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11649,
                "hadithNumber": "4085",
                "englishNarrator": "Abu Sa'id (رضی اللہ عنہ) reported:",
                "hadithEnglish": "We were given to eat, during the lifetime of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), dates of different qualities mixed together, and we used to sell two sa's of these for one sa, (of fine quality of dates). This reached Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), whereupon he said: There should be no exchange of two sa's of (inferior) dates for one sa (of fine dates) and two sa's of (inferior) wheat for one sa' of (fine) wheat. and one dirham for two dirharms.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں ہمیں ( ہمارے حصے میں ) عام کھجور دی جاتی تھی اور وہ ملی جلی کھجور ہوتی تھی تو ہم اس کے دو صاع کے عوض ایک صاع کا سودا کرتے ، رسول اللہ صلی اللہ علیہ وسلم کو یہ بات پہنچی تو آپ نے فرمایا : \" کھجور کے دو صاع ایک صاع کے عوض ( جائز ) نہیں ، گندم کے دو صاع ایک صاع کے عوض ( جائز ) نہیں اور نہ ایک درہم دو درہموں کے عوض ( جائز ہے ۔ ) \"",
                "urduNarrator": "مجھ سے اسحاق بن منصور نے بیان کیا، ہم سے عبید اللہ بن موسیٰ نے بیان کیا، انہوں نے شیبان سے، یحییٰ سے، ابو سلمہ رضی اللہ عنہ سے, حضرت ابوسعید رضی اللہ عنہ سے روایت ہے ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُوسَى، عَنْ شَيْبَانَ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي سَعِيدٍ، قَالَ: كُنَّا نُرْزَقُ تَمْرَ الْجَمْعِ عَلَى عَهْدِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَهُوَ الْخِلْطُ مِنَ التَّمْرِ، فَكُنَّا نَبِيعُ صَاعَيْنِ بِصَاعٍ، فَبَلَغَ ذَلِكَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «لَا صَاعَيْ تَمْرٍ بِصَاعٍ، وَلَا صَاعَيْ حِنْطَةٍ بِصَاعٍ، وَلَا دِرْهَمَ بِدِرْهَمَيْنِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11650,
                "hadithNumber": "4086",
                "englishNarrator": "Abu Nadra reported:",
                "hadithEnglish": "I asked Ibn Abbas ( رضی اللہ عنہ) about the conversion (of gold and silver for silver and gold). We said: Is it hand to hand exchange? I said: Yes. whereupon he said: There is no harm in it. I informed Abu Sa'id رضی اللہ عنہ about it, telling him that I had asked Ibn 'Abbas رضی اللہ عنہ about it and he said: Is it hand to hand exchange? I said: Yes, whereupon he said: There is no harm in it. He (the narrator) said, or he said like it: We will soon write to him, and he will not give you this fatwa (religious verdict). He said: By Allah, someone of the boy-servants of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) brought dates, but he refused to accept them (on the plea) that those did not seem to be of the dates of our land. He said: Something had happened to the dates of our land, or our dates. So I got these dates (in exchange by giving) excess (of the dates of our land), whereupon he said: You made an addition for getting the fine dates (in exchange) which tantamounts, to interest; don't do that (in future). Whenever you find some doubt (as regards the deteriorating quality of) your dates, sell them, and then buy the dates that you like.",
                "hadithUrdu": "میں نے حضرت ابن عباس رضی اللہ عنہ سے دینار و درہم یا سونے چاندی کے تبادلے کے بارے میں سوال کیا تو انہوں نے کہا : کہا یہ دست بدست ہے؟ میں نے جواب دیا : جی ہاں ، انہوں نے کہا : اس میں کوئی حرج نہیں ۔ میں نے حضرت ابوسعید رضی اللہ عنہ کو خبر دی ، میں نے کہا : میں نے حضرت ابن عباس رضی اللہ عنہ سے دینار و درہم یا سونے چاندی کے تبادلے کے بارے میں سوال کیا تھا تو انہوں نے کہا تھا : کیا دست بدست ہے؟ میں نے جواب دیا تھا : ہاں ، تو انہوں نے کہا تھا : اس میں کوئی حرج نہیں ( انہوں نے ایک ہی جنس کی صورت میں مساوات کی شرط لگائے بغیر اسے علی الاطلاق جائز قرار دیا ۔ ) انہوں ( ابوسعید ) نے کہا : کیا انہوں نے یہ بات کہی ہے؟ ہم ان کی طرف لکھیں گے تو وہ تمہیں ( غیر مشروط جواز کا ) یہ فتویٰ نہیں دیں گے ۔ اللہ کی قسم! رسول اللہ صلی اللہ علیہ وسلم کے خدام سے کوئی کھجوریں لے کر آیا تو آپ نے انہیں نہ پہچانا اور فرمایا : \" ایسا لگتا ہے کہ یہ ہماری سرزمین کی کھجوروں میں سے نہیں ہیں ۔ \" اس نے کہا : اس سال ہماری زمین کی کھجوروں میں ۔ ۔ یا ہماری کھجوروں میں ۔ ۔ کوئی چیز ( خرابی ) تھی ، میں نے یہ ( عمدہ کھجوریں ) لے لیں اور بدلے میں کچھ زیادہ دے دیں ، تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" تم نے دوگنا دیں ، تم نے سود کا لین دین کیا ، اس کے قریب ( بھی ) مت جاؤ ، جب تمہیں اپنی کھجور کے بارے میں کسی چیز ( نقص وغیرہ ) کا شک ہو تو اسے فروخت کرو ، پھر کھجور میں سے تم جو چاہتے ہو ( نقدی کے عوج ) خرید لو ۔ \"",
                "urduNarrator": "مجھ سے عمرو الناقد نے بیان کیا، ہم سے اسماعیل بن ابراہیم نے، سعید الجریری کی سند سے،سعید جریری نے ابونضرہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنِي عَمْرٌو النَّاقِدُ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ سَعِيدٍ الْجُرَيْرِيِّ، عَنْ أَبِي نَضْرَةَ، قَالَ: سَأَلْتُ ابْنَ عَبَّاسٍ عَنِ الصَّرْفِ، فَقَالَ: أَيَدًا بِيَدٍ؟ قُلْتُ: نَعَمْ، قَالَ: فَلَا بَأْسَ بِهِ، فَأَخْبَرْتُ أَبَا سَعِيدٍ، فَقُلْتُ: إِنِّي سَأَلْتُ ابْنَ عَبَّاسٍ عَنِ الصَّرْفِ، فَقَالَ: أَيَدًا بِيَدٍ؟ قُلْتُ: نَعَمْ، قَالَ: فَلَا بَأْسَ بِهِ، قَالَ: أَوَ قَالَ ذَلِكَ؟ إِنَّا سَنَكْتُبُ إِلَيْهِ فَلَا يُفْتِيكُمُوهُ، قَالَ: فَوَاللهِ لَقَدْ جَاءَ بَعْضُ فِتْيَانِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِتَمْرٍ، فَأَنْكَرَهُ، فَقَالَ: «كَأَنَّ هَذَا لَيْسَ مِنْ تَمْرِ أَرْضِنَا» قَالَ: كَانَ فِي تَمْرِ أَرْضِنَا، أَوْ فِي تَمْرِنَا الْعَامَ بَعْضُ الشَّيْءِ، فَأَخَذْتُ هَذَا وَزِدْتُ بَعْضَ الزِّيَادَةِ، فَقَالَ: «أَضْعَفْتَ، أَرْبَيْتَ، لَا تَقْرَبَنَّ هَذَا، إِذَا رَابَكَ مِنْ تَمْرِكَ شَيْءٌ فَبِعْهُ، ثُمَّ اشْتَرِ الَّذِي تُرِيدُ مِنَ التَّمْرِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11651,
                "hadithNumber": "4087",
                "englishNarrator": "Abu Nadra reported:",
                "hadithEnglish": "I asked Ibn Umar and Ibn Abbas (رضی اللہ عنہ) about the conversion of gold with gold but they did not find any harm in that. I was sitting in the company of Abd Sa'id al-Khudri (رضی اللہ عنہ) and asked him about this exchange, and he said: Whatever is addition is an' interest. I refused to accept it on account of their statement (statement of Ibn 'Abbas and Ibn 'Umar رضی اللہ عنہ ). He said: I am not narrating to you except what I heard from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). There came to him the owner of a date-palm with one sa' of fine dates, and the dates of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) were of that colour. Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said to him: Where did you get these dates? I went with two sa's of (inferior dates) and bought one sa' of (these fine dates), for that is the prevailing price (of inferior dates) in the market and that is the price (of the fine quality of dates in the market), whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Woe be upon you! You have dealt in interest, when you decide to do it (i.e. exchange superior quality of dates for inferior quality); so you should sell your dates for another commodity (or currency) and then with the help of that commodity buy the dates you like. Abu Sa'ad رضی اللہ عنہ said: When dates are exchanged for dates (with different qualities) there is the possibility (of the element of) interest (creeping into that) or when gold is exchanged for gold having different qualities. I subsequently came to Ibn 'Umar رضی اللہ عنہ and he forbade me (to do it), but I did not come to Ibn 'Abbas (رضی اللہ عنہ). He (the narrator) said: Abu as-Sahba' narrated to me: He asked Ibn Abbas (رضی اللہ عنہ) in Mecca, and he too disapproved of it.",
                "hadithUrdu": "میں نے حضرت ابن عمر رضی اللہ عنہ اور حضرت ابن عباس رضی اللہ عنہ سے سونا چاندی کے تبادلے کے بارے میں پوچھا تو ان دونوں نے اس میں کوئی حرج نہ دیکھا ۔ میں حضرت ابوسعید خدری رضی اللہ عنہ کے پاس بیٹھا ہوا تھا تو میں نے ان سے اس تبادلے کے بارے میں پوچھا ، تو انہوں نے کہا : ( ایک ہی جنس کے تبادلے میں ) جو اضافہ ہو گا وہ سود ہے ۔ میں نے ان دونوں کے قول کی بنا پر ( جس میں انہوں نے ایسی کوئی شرط نہ لگائی تھی ) اس بات کا انکار کیا تو انہوں نے کہا : میں تمہیں وہی حدیث بیان کروں گا جو میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنی ۔ آپ کے باغ کا نگران آپ کے پاس عمدہ کھجور کا ایک صاع لایا اور نبی صلی اللہ علیہ وسلم کی کھجور اس ( عام ) قسم کی تھی تو نبی صلی اللہ علیہ وسلم نے اس سے پوچھا : \"\" یہ تمہارے پاس کہاں سے آئیں؟ \"\" اس نے کہا : میں ( اس کے ) دو صاع لے کر گیا اور ان کے عوض میں نے یہ ایک صاع خرید لی ، بازار میں اِس کا نرخ اتنا ہے اور اُس کا اتنا ہے ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" تم پر افسوس! تم نے سود کا معاملہ کیا ، جب تم یہ ( عمدہ کھجور ) لینا چاہو تو اپنی کھجور کسی ( اور ) تجارتی چیز کے عوض فروخت کر دو ، پھر اپنی چیز سے جو کھجور چاہو ، خرید لو ۔ \"\" حضرت ابوسعید رضی اللہ عنہ نے کہا : کھجور کے عوض کھجور ، زیادہ لائق ہے کہ سود ہو ، یا چاندی کے عوض چاندی؟ ( ابونضرہ نے ) کہا : میں اس کے بعد حضرت ابن عمر رضی اللہ عنہ کے پاس آیا تو انہوں نے مجھے اس سے منع کیا اور میں حضرت ابن عباس رضی اللہ عنہ کے پاس نہیں آیا ۔ کہا : مجھے ابوصبہاء نے حدیث بیان کی کہ انہوں نے مکہ میں حضرت ابن عباس رضی اللہ عنہ سے اس کے بارے میں سوال کیا تو انہوں نے بھی اسے ناپسند کیا تھا ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے عبد الاعلی نے بیان کیا, داود نے ہمیں ابونضرہ سے خبر دی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عَبْدُ الْأَعْلَى، أَخْبَرَنَا دَاوُدُ، عَنْ أَبِي نَضْرَةَ، قَالَ: سَأَلْتُ ابْنَ عُمَرَ، وَابْنَ عَبَّاسٍ عَنِ الصَّرْفِ، فَلَمْ يَرَيَا بِهِ بَأْسًا، فَإِنِّي لَقَاعِدٌ عِنْدَ أَبِي سَعِيدٍ الْخُدْرِيِّ، فَسَأَلْتُهُ عَنِ الصَّرْفِ، فَقَالَ: مَا زَادَ فَهُوَ رِبًا، فَأَنْكَرْتُ ذَلِكَ لِقَوْلِهِمَا، فَقَالَ: لَا أُحَدِّثُكَ إِلَّا مَا سَمِعْتُ مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: جَاءَهُ صَاحِبُ نَخْلِهِ بِصَاعٍ مِنْ تَمْرٍ طَيِّبٍ، وَكَانَ تَمْرُ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ هَذَا اللَّوْنَ، فَقَالَ لَهُ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَنَّى لَكَ هَذَا؟» قَالَ: انْطَلَقْتُ بِصَاعَيْنِ فَاشْتَرَيْتُ بِهِ هَذَا الصَّاعَ، فَإِنَّ سِعْرَ هَذَا فِي السُّوقِ كَذَا، وَسِعْرَ هَذَا كَذَا، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «وَيْلَكَ، أَرْبَيْتَ، إِذَا أَرَدْتَ ذَلِكَ، فَبِعْ تَمْرَكَ بِسِلْعَةٍ، ثُمَّ اشْتَرِ بِسِلْعَتِكَ أَيَّ تَمْرٍ شِئْتَ»، قَالَ أَبُو سَعِيدٍ: «فَالتَّمْرُ بِالتَّمْرِ أَحَقُّ أَنْ يَكُونَ رِبًا، أَمِ الْفِضَّةُ بِالْفِضَّةِ؟»، قَالَ: فَأَتَيْتُ ابْنَ عُمَرَ بَعْدُ فَنَهَانِي، وَلَمْ آتِ ابْنَ عَبَّاسٍ، قَالَ: فَحَدَّثَنِي أَبُو الصَّهْبَاءِ، أَنَّهُ سَأَلَ ابْنَ عَبَّاسٍ عَنْهُ بِمَكَّةَ فَكَرِهَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11652,
                "hadithNumber": "4088",
                "englishNarrator": "Abu Salih reported:",
                "hadithEnglish": "I heard Abu Sa'id al-Khudri (رضی اللہ عنہ) said: Dinar (gold) for gold and dirham for dirham can be (exchanged) with equal for equal; but he who gives more or demands more in fact deals in interest. I said to him: Ibn 'Abbas (رضی اللہ عنہ) says otherwise, whereupon he said: I met Ibn 'Abbas (رضی اللہ عنہ) and said: Do you see what you say; have you heard it from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), or found it in the Book of Allah, the Glorious and Majestic? He said: I did not hear it from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). and I did not find it in the Book of Allah (Glorious and Majestic), but Usama bin Zaid رضی اللہ عنہ narrated it to me that Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: There can be an element of interest in credit.",
                "hadithUrdu": "میں نے حضرت ابوسعید خدری رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے : دینار کے بدلے دینار اور درہم کے بدلے درہم مثل بمثل ہو ، جس نے زیادہ دیا یا زیادہ لیا ، اس نے سود کا معاملہ کیا ۔ میں نے ان سے کہا : حضرت ابن عباس رضی اللہ عنہ تو اس سے مختلف بات کہتے ہیں ، تو انہوں نے کہا : میں نے خود ابن عباس رضی اللہ عنہ سے ملاقات کی اور کہا : آپ کی کیا رائے ہے ، یہ جو آپ کہتے ہیں کیا آپ نے یہ بات رسول اللہ صلی اللہ علیہ وسلم سے سنی ہے یا اللہ کی کتاب میں پائی ہے؟ تو انہوں نے کہا : نہ میں نے یہ بات رسول اللہ صلی اللہ علیہ وسلم سے سنی نہ کتاب اللہ میں پائی ، بلکہ مجھے اسامہ بن زید رضی اللہ عنہ نے بیان کیا ہے کہ نبی صلی اللہ علیہ وسلم نے فرمایا : \" سود ادھار میں ہے.",
                "urduNarrator": "مجھ سے محمد بن عباد، محمد بن حاتم اور ابن ابی عمر سب نے سفیان بن عیینہ کی سند سے بیان کیا، اور یہ قول ابن عباد کا ہے، انہوں نے کہا: انہوں نے ہم سے روایت کی۔ سفیان، عمرو کی طرف سے،ابوصالح سے روایت ہے ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبَّادٍ، وَمُحَمَّدُ بْنُ حَاتِمٍ، وَابْنُ أَبِي عُمَرَ، جَمِيعًا عَنْ سُفْيَانَ بْنِ عُيَيْنَةَ، وَاللَّفْظُ لِابْنِ عَبَّادٍ، قَالَ: حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ أَبِي صَالِحٍ، قَالَ: سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ: الدِّينَارُ بِالدِّينَارِ، وَالدِّرْهَمُ بِالدِّرْهَمِ، مِثْلًا بِمِثْلٍ، مَنْ زَادَ، أَوِ ازْدَادَ، فَقَدْ أَرْبَى، فَقُلْتُ لَهُ: إِنَّ ابْنَ عَبَّاسٍ، يَقُولُ غَيْرَ هَذَا، فَقَالَ: لَقَدْ لَقِيتُ ابْنَ عَبَّاسٍ، فَقُلْتُ: أَرَأَيْتَ هَذَا الَّذِي تَقُولُ؟ أَشَيْءٌ سَمِعْتَهُ مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، أَوْ وَجَدْتَهُ فِي كِتَابِ اللهِ عَزَّ وَجَلَّ، فَقَالَ: لَمْ أَسْمَعْهُ مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَلَمْ أَجِدْهُ فِي كِتَابِ اللهِ، وَلَكِنْ حَدَّثَنِي أُسَامَةُ بْنُ زَيْدٍ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الرِّبَا فِي النَّسِيئَةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11653,
                "hadithNumber": "4089",
                "englishNarrator": "Ubaidullah bin Abu Yazid heard Ibn 'Abbas (رضی اللہ عنہ) as saying: Usama bin Zaid رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: There can be an element of interest in credit (when the payment is not equal).",
                "hadithUrdu": "آپ نے فرمایا : \" ( اگر جنسیں مختلف ہوں تو ) سود ادھار میں ہی ہے ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، عمرو الناقد، اسحاق بن ابراہیم اور ابن ابی عمر نے بیان کیا اور عمرو کا قول ہے: ہم سے انہوں نے بیان کیا اور دوسروں نے کہا : ہم سے سفیان بن عیینہ نے بیان کیا , عبیداللہ بن ابی یزید سے روایت ہے کہ انہوں نے حضرت ابن عباس رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے : مجھے اسامہ بن زید رضی اللہ عنہ نے نبی صلی اللہ علیہ وسلم سے خبر دی",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ أَبِي عُمَرَ، وَاللَّفْظُ لِعَمْرٍو، قَالَ إِسْحَاقُ: أَخْبَرَنَا، وَقَالَ الْآخَرُونَ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عُبَيْدِ اللهِ بْنِ أَبِي يَزِيدَ، أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ، يَقُولُ: أَخْبَرَنِي أُسَامَةُ بْنُ زَيْدٍ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «إِنَّمَا الرِّبَا فِي النَّسِيئَةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11654,
                "hadithNumber": "4090",
                "englishNarrator": "Ibn 'Abbas (رضی اللہ عنہ) reported on the authority of Usama bin Zaid رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as having said this: There is no element of interest when the money or commodity is exchanged hand to hand.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ( مختلف چیزوں کے تبادلے میں ) جو دست بدست ہو اس میں سود نہیں ہے ۔ \"",
                "urduNarrator": "ہم سے زہیر بن حرب نے بیان کیا، کہا ہم سے عفان نے بیان کیا، کہا ہم سے محمد بن حاتم نے بیان کیا، کہا ہم سے بہز نے بیان کیا، انہوں نے کہا کہ ہم سے وہیب نے بیان کیا، طاوس نے حضرت ابن عباس رضی اللہ عنہ سے اور انہوں نے حضرت اسامہ بن زید رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَفَّانُ، ح وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا بَهْزٌ، قَالَا: حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا رِبًا فِيمَا كَانَ يَدًا بِيَدٍ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11655,
                "hadithNumber": "4091",
                "englishNarrator": "Ata' bin Abu Rabah reported:",
                "hadithEnglish": "Abu Sa'id al-Khudri ( رضی اللہ عنہ) met Ibn 'Abbas (رضی اللہ عنہ) and said to him: What do you say in regard to the conversion (of commodities or money) did you hear it from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), or is it something which you found In Allah's Book, Majestic and Glorious? Thereupon Ibn Abbas ( رضی اللہ عنہ) said: I don't say that. So far at Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) is concerned, you know him better, and to far as the Book of Allah to concerned, I do not know it (more than you do), but 'Usama bin Zaid ( رضی اللہ عنہ) narrated to me Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as having said this: Beware, there can be an element of interest in credit.",
                "hadithUrdu": "حضرت ابوسعید خدری رضی اللہ عنہ نے حضرت ابن عباس رضی اللہ عنہ سے ملاقات کی اور ان سے کہا : بیع صَرف ( نقدی یا سونے چاندی کے تبادلے ) کے حوالے سے آپ کی اپنے قول کے بارے میں کیا رائے ہے ، کیا آپ نے یہ چیز رسول اللہ صؒی اللہ علیہ وسلم سے سنی ہے یا اللہ کی کتاب میں پائی ہے؟ حضرت ابن عباس رضی اللہ عنہ نے کہا : میں ان میں سے کوئی بات نہیں کہتا ، رسول اللہ صلی اللہ علیہ وسلم کو تم مجھ سے زیادہ جاننے والے ہو اور رہی اللہ کی کتاب تو میں ( اس میں ) اس بات کو نہیں جانتا ، البتہ اسامہ بن زید رضی اللہ عنہ نے مجھے حدیث بیان کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" متنبہ رہو! سود ادھار میں ہی ہے ۔ \"",
                "urduNarrator": "ہم سے الحکم بن موسیٰ نے بیان کیا، کہا ہم سے حقل نے بیان کیا، اوزاعی کی سند سے، انہوں نے کہا عطاء بن ابی رباح نے مجھے حدیث بیان کی کہ",
                "hadithArabic": "حَدَّثَنَا الْحَكَمُ بْنُ مُوسَى، حَدَّثَنَا هِقْلٌ، عَنِ الْأَوْزَاعِيِّ، قَالَ: حَدَّثَنِي عَطَاءُ بْنُ أَبِي رَبَاحٍ، أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ، لَقِيَ ابْنَ عَبَّاسٍ، فَقَالَ لَهُ: أَرَأَيْتَ قَوْلَكَ فِي الصَّرْفِ، أَشَيْئًا سَمِعْتَهُ مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، أَمْ شَيْئًا وَجَدْتَهُ فِي كِتَابِ اللهِ عَزَّ وَجَلَّ؟ فَقَالَ ابْنُ عَبَّاسٍ: كَلَّا، لَا أَقُولُ أَمَّا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَأَنْتُمْ أَعْلَمُ بِهِ، وَأَمَّا كِتَابُ اللهِ فَلَا أَعْلَمُهُ، وَلَكِنْ حَدَّثَنِي أُسَامَةُ بْنُ زَيْدٍ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «أَلَا إِنَّمَا الرِّبَا فِي النَّسِيئَةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11656,
                "hadithNumber": "4092",
                "englishNarrator": "Abdullah (bin Mas'ud) (رضی اللہ عنہ) said:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) cursed the one who accepted interest and the one who paid it I asked about the one who recorded it, and two witnesses to it. He (the narrator) said: We narrate what we have heard.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے سود کھانے اور کھلانے والے پر لعنت کی ۔ کہا : میں نے پوچھا : اس کے لکھنے والے اور دونوں گواہوں پر بھی؟ انہوں نے کہا : ہم صرف وہ حدیث بیان کرتے ہیں جو ہم نے سنی ہے ۔",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ اور اسحاق بن ابراہیم نے بیان کیا، اور یہ قول عثمان سے ہے اسحاق نے کہا: انہوں نے ہمیں خبر دی، اور عثمان نے کہا: ہم سے جریر نے بیان کیا۔ مغیرہ سے روایت ہے کہ انہوں نے کہا: شباق نے ابراہیم سے پوچھا, علقمہ نے حضرت عبداللہ ( بن مسعود رضی اللہ عنہ ) سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَاللَّفْظُ لِعُثْمَانَ، قَالَ إِسْحَاقُ: أَخْبَرَنَا، وَقَالَ عُثْمَانُ: حَدَّثَنَا جَرِيرٌ، عَنْ مُغِيرَةَ، قَالَ: سَأَلَ شِبَاكٌ إِبْرَاهِيمَ، فَحَدَّثَنَا عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللهِ، قَالَ: «لَعَنَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ آكِلَ الرِّبَا وَمُؤْكِلَهُ»، قَالَ: قُلْتُ: وَكَاتِبَهُ، وَشَاهِدَيْهِ؟ قَالَ: «إِنَّمَا نُحَدِّثُ بِمَا سَمِعْنَا».",
                "headingArabic": "لَعْنِ آكِلِ الرِّبَا وَمُؤْكِلِهِ ‏‏",
                "headingUrdu": "سود کھانے والے اور ادا کرنے والے پر لعنت",
                "headingEnglish": "Cursing the one who consumes Riba and the one who pays it",
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11657,
                "hadithNumber": "4093",
                "englishNarrator": "Jabir رضی اللہ عنہ said:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) cursed the accepter of interest and its payer, and one who records it, and the two witnesses, and he said: They are all equal.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے سود کھانے والے ، کھلانے والے ، لکھنے والے اور اس کے دونوں گواہوں پر لعنت کی اور فرمایا : ( گناہ میں ) یہ سب برابر ہیں ۔",
                "urduNarrator": "ہم سے محمد بن صباح، زہیر بن حرب اور عثمان بن ابی شیبہ نے بیان کیا، انہوں نے کہا: ہم سے ہشیم نے بیان کیا، ہم سے ابو الزبیر نے بیان کیا, حضرت جابر رضی اللہ عنہ سے روایت ہے ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، وَزُهَيْرُ بْنُ حَرْبٍ، وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ، قَالُوا: حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ: «لَعَنَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ آكِلَ الرِّبَا، وَمُؤْكِلَهُ، وَكَاتِبَهُ، وَشَاهِدَيْهِ»، وَقَالَ: «هُمْ سَوَاءٌ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11658,
                "hadithNumber": "4094",
                "englishNarrator": "Nu'man bin Bashir ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "I heard Allah's Messenger (ﷺ) as having said this (and Nu'man) pointed towards his ears with his fingers): What is lawful is evident and what is unlawful is evident, and in between them are the things doubtful which many people do not know. So he who guards against doubtful things keeps his religion and honour blameless, and he who indulges in doubtful things indulges in fact in unlawful things, just as a shepherd who pastures his animals round a preserve will soon pasture them in it. Beware, every king has a preserve, and the things God his declaced unlawful are His preserves. Beware, in the body there is a piece of flesh; if it is sound, the whole body is sound and if it is corrupt the whole body is corrupt, and hearken it is the heart.",
                "hadithUrdu": "میں نے ان سے سنا ، وہ کہہ رہے تھے : میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، ۔ ۔ اور حضرت نعمان رضی اللہ عنہ نے اپنی دونوں انگلیوں سے اپنے دونوں کانوں کی طرف اشارہ کیا ۔ ۔ آپ فرما رہے تھے : \" بلاشبہ حلال واضح ہے اور حرام واضح ہے اور ان دونوں کے درمیان شبہات ہیں لوگوں کی بڑی تعداد ان کو نہیں جانتی ، جو شبہات سے بچا اس نے اپنے دین اور عزت کو بچا لیا اور جو شبہات میں پڑ گیا وہ حرام میں پڑ گیا ، جیسے چرواہا ( جو ) چراگاہ کے اردگرد ( بکریاں ) چراتا ہے ، قریب ہے وہ اس ( چراگاہ ) میں چرنے لگیں ، دیکھو! ہر بادشاہ کی چراگاہ ہے ۔ دھیان رکھو! اللہ کی چراگاہ اس کی حرام کردہ اشیاء ہیں ۔ سنو! جسم میں ایک ٹکڑا ہے ، اگر ٹھیک رہا تو سارا جسم ٹھیک رہا اور اگر وہ بگڑ گیا تو سارا جسم بگڑ گیا ۔ سنو! وہ دل ہے ۔ \" ( سوچ اور نیت سے ہر عمل کی درستی ہے یا خرابی ۔ )",
                "urduNarrator": "عبداللہ بن نمیر ہمدانی نے ہمیں حدیث بیان کی ، کہا : ہمیں زکریا نے شعبی سے حدیث بیان کی ، انہوں نے حضرت نعمان بن بشیر رضی اللہ عنہ سے روایت کی ، ( شعبی نے ) کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ الْهَمْدَانِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا زَكَرِيَّاءُ، عَنِ الشَّعْبِيِّ، عَنِ النُّعْمَانِ بْنِ بَشِيرٍ، قَالَ: سَمِعْتُهُ يَقُولُ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: - وَأَهْوَى النُّعْمَانُ بِإِصْبَعَيْهِ إِلَى أُذُنَيْهِ - «إِنَّ الْحَلَالَ بَيِّنٌ، وَإِنَّ الْحَرَامَ بَيِّنٌ، وَبَيْنَهُمَا مُشْتَبِهَاتٌ لَا يَعْلَمُهُنَّ كَثِيرٌ مِنَ النَّاسِ، فَمَنِ اتَّقَى الشُّبُهَاتِ اسْتَبْرَأَ لِدِينِهِ، وَعِرْضِهِ، وَمَنْ وَقَعَ فِي الشُّبُهَاتِ وَقَعَ فِي الْحَرَامِ، كَالرَّاعِي يَرْعَى حَوْلَ الْحِمَى، يُوشِكُ أَنْ يَرْتَعَ فِيهِ، أَلَا وَإِنَّ لِكُلِّ مَلِكٍ حِمًى، أَلَا وَإِنَّ حِمَى اللهِ مَحَارِمُهُ، أَلَا وَإِنَّ فِي الْجَسَدِ مُضْغَةً، إِذَا صَلَحَتْ، صَلَحَ الْجَسَدُ كُلُّهُ، وَإِذَا فَسَدَتْ، فَسَدَ الْجَسَدُ كُلُّهُ، أَلَا وَهِيَ الْقَلْبُ.",
                "headingArabic": "أَخْذِ الْحَلاَلِ وَتَرْكِ الشُّبُهَاتِ ‏‏",
                "headingUrdu": "جو حلال ہے اسے لینا اور غیر واضح کو چھوڑ دینا",
                "headingEnglish": "Taking that which is lawful and leaving that which is unclear",
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11659,
                "hadithNumber": "4095",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Zakariya with the same chain of transmitters.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, وکیع اور عیسیٰ بن یونس نے زکریا سے اسی سند کے ساتھ اسی کی مانند حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، ح وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، قَالَا: حَدَّثَنَا زَكَرِيَّاءُ، بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11660,
                "hadithNumber": "4096",
                "englishNarrator": null,
                "hadithEnglish": "AI-Nu'man bin Bashir reported it from Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). The hadith narrated by Zakariya is, however, more complete and lengthy than the other ones.",
                "hadithUrdu": "ہم سے اسحاق بن ابراہیم نے بیان کیا، ہم سے جریر نے بیان کیا، وہ مطرف کی سند سے، ابی نے، فروہ ہمدانی نے، اور ہم سے قتیبہ بن سعید نے بیان کیا، ان سے یعقوب , یعنی ابن عبدالرحمن القاری , ابن عجلان کی سند سے، عبدالرحمٰن بن سعید کی سند پر، یہ سب الشعبی کی سند پر،النعمان بن بشیر کی سند سے، رسول اللہ صلی اللہ علیہ وسلم کی سند سے، اس حدیث کے ساتھ، سوائے اس کے کہ زکریا کی حدیث ان کی حدیث سے زیادہ مکمل اور زیادہ ہے۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، عَنْ مُطَرِّفٍ، وَأَبِي، فَرْوَةَ الْهَمْدَانِيِّ ح وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْقَارِيَّ - عَنِ ابْنِ عَجْلاَنَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَعِيدٍ، كُلُّهُمْ عَنِ الشَّعْبِيِّ، عَنِ النُّعْمَانِ بْنِ بَشِيرٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا الْحَدِيثِ غَيْرَ أَنَّ حَدِيثَ زَكَرِيَّاءَ أَتَمُّ مِنْ حَدِيثِهِمْ وَأَكْثَرُ.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11661,
                "hadithNumber": "4097",
                "englishNarrator": "It was narrated from Amir Ash-Shabi that:",
                "hadithEnglish": "He heard An-Nu'man bin Bashir bin Sa'd, a Companion of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was heard delivering a sermon at Him and was saying: I heard Allah's Messenger (ﷺ) as saying: The lawful is evident and the unlawful is evident, the rest of the hadith is the same as related by Zakariya.",
                "hadithUrdu": "نعمان بن بشیر بن سعد سے روایت ہے, جو صحابی تھے رسول اﷲ ﷺ کے اور وہ خطبہ سناتے تھے لوگوں کو حمص میں ( ایک شہر کا نام ہے شام میں ) اور کہتے تھے میں نے سنا رسول اﷲ ﷺ سے آپ فرماتے تھے حلال کھلا ہوا ہے اور حرام کھلا ہوا ہے ۔ پھر بیان کیا حدیث کو اسی طرح جیسے اوپر گزری ۔ یوشک ان یقع فیہ تک ۔",
                "urduNarrator": "ہم سے عبدالملک بن شعیب بن لیث بن سعد نے بیان کیا، مجھ سے میرے والد نے بیان کیا، مجھ سے میرے دادا نے بیان کیا، مجھ سے خالد بن یزید نے بیان کیا، مجھ سے سعید بن ابی نے بیان کیا۔ ہلال، عون بن عبداللہ کی سند پر، امیر الشعبی کی طرف سے",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ بْنِ سَعْدٍ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي خَالِدُ، بْنُ يَزِيدَ حَدَّثَنِي سَعِيدُ بْنُ أَبِي هِلاَلٍ، عَنْ عَوْنِ بْنِ عَبْدِ اللَّهِ، عَنْ عَامِرٍ الشَّعْبِيِّ، أَنَّهُ سَمِعَ نُعْمَانَ بْنَ بَشِيرِ بْنِ سَعْدٍ، صَاحِبَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ يَخْطُبُ النَّاسَ بِحِمْصَ وَهُوَ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ ‏ الْحَلاَلُ بَيِّنٌ وَالْحَرَامُ بَيِّنٌ ‏ ‏ ‏.‏ فَذَكَرَ بِمِثْلِ حَدِيثِ زَكَرِيَّاءَ عَنِ الشَّعْبِيِّ إِلَى قَوْلِهِ ‏ ‏ يُوشِكُ أَنْ يَقَعَ فِيهِ.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11662,
                "hadithNumber": "4098",
                "englishNarrator": "Jabir bin 'Abdullah (رضی اﷲ عنہ) reported:",
                "hadithEnglish": "He was travelling on his camel which had grown jaded, and he decided to let it off. When Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) met him and prayed for him and struck it, so it trotted as it had never trotted before. He said: Sell it to me for an 'uqaya. I said: No. He again said: Sell it to me. So I sold it to him for an 'uqaya, but made the stipulation that I should be allowed to ride back to my family. Then when I came to (my place) I took the camel to him and he paid me its price in ready money. I then went back and he sent: (someone) behind me (and as I came) he said: Do you see that I asked you to reduce price for buying your camel. Take your camel and your coins; these are yours.",
                "hadithUrdu": "ایک اونٹ پر جو تھک گیا تھا انہوں نے چاہا اس کو آزاد کردینا ( یعنی چھوڑ دینا جنگل میں ) جابرؓ نے کہا رسول اﷲ ﷺ مجھ سے آن کر ملے او رمیرے لیے دعا کی اور اونٹ کو مارا پھر وہ ایسا چلا کہ وہ ایسا کبھی نہیں چلا تھا ( یہ آپ کا معجزہ تھا ) ۔ آپ نے فرمایا اس کو میرے ہاتھ بیچ ڈال ایک اوقیہ پر ( دوسری روایت میں پانچ اوقیہ ہیں اور ایک اوقیہ زیادہ دیا اور ایک روایت میں دو اوقیہ اور ایک درم یا دو درم ہیں اور ایک روایت میں سونے کا ایک اوقیہ اور ایک روایت میں چار دینار اور بخاری نے ایک روایت میں آٹھ سو درم اور ایک روایت میں بیس دینرا او رایک روایت میں چار اوقیہ نقل کیے ہیں ) ۔ میں نے کہا نہیں پھر آپ نے فرمایا اس کو میرے ہاتھ بیچ ڈال ۔ میں نے ایک اوقیہ پر آپ ﷺ کے ہاتھ بیچ ڈالا اور شرط کی اس پر سواری کی اپنے گھر تک ۔ جب میں اپنے گھر پہنچا تو اونٹ آپ کے پاس لے کر آیا آپ نے اس کی قیمت میرے حوالے کی ۔ میں لوتا پھر آپ نے مجھ کو بلا بھیجا اور فرمایا کیا میں تجھ سے قیمت کم کراتا تھا تیرا اونٹ لینے کے لیے اپنا اونٹ لے جا او رروپیہ بھی تیرا ہے ۔",
                "urduNarrator": "ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا، کہا ہم سے میرے والد نے بیان کیا، کہا ہم سے زکریا نے بیان کیا، عامر کی سند سے, جابر بن عبداﷲ رضی اﷲ عنہ سے روایت ہے وہ جارہے تھے",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا زَكَرِيَّاءُ، عَنْ عَامِرٍ، حَدَّثَنِي جَابِرُ بْنُ عَبْدِ اللَّهِ، أَنَّهُ كَانَ يَسِيرُ عَلَى جَمَلٍ لَهُ قَدْ أَعْيَا فَأَرَادَ أَنْ يُسَيِّبَهُ قَالَ فَلَحِقَنِي النَّبِيُّ صلى الله عليه وسلم فَدَعَا لِي وَضَرَبَهُ فَسَارَ سَيْرًا لَمْ يَسِرْ مِثْلَهُ قَالَ ‏ ‏ بِعْنِيهِ بِوُقِيَّةٍ ‏ ‏ ‏.‏ قُلْتُ لاَ ‏.‏ ثُمَّ قَالَ ‏ ‏ بِعْنِيهِ ‏ ‏ ‏.‏ فَبِعْتُهُ بِوُقِيَّةٍ وَاسْتَثْنَيْتُ عَلَيْهِ حُمْلاَنَهُ إِلَى أَهْلِي فَلَمَّا بَلَغْتُ أَتَيْتُهُ بِالْجَمَلِ فَنَقَدَنِي ثَمَنَهُ ثُمَّ رَجَعْتُ فَأَرْسَلَ فِي أَثَرِي فَقَالَ ‏ ‏ أَتُرَانِي مَاكَسْتُكَ لآخُذَ جَمَلَكَ خُذْ جَمَلَكَ وَدَرَاهِمَكَ فَهُوَ لَكَ.‏",
                "headingArabic": "بَيْعِ الْبَعِيرِ وَاسْتِثْنَاءِ رُكُوبِهِ ‏‏",
                "headingUrdu": "اونٹ بیچنا اور ان پر سوار ہونے کی شرط لگانا",
                "headingEnglish": "Selling Camels and Stipulating that one may ride them",
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11663,
                "hadithNumber": "4099",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Jabir through another chain of transmitters.",
                "hadithUrdu": "اور ہم سے علی بن خشرم نے بیان کیا، ہم سے عیسیٰ یعنی ابن یونس نے بیان کیا، ہم سے زکریا نے بیان کیا، اور عامر کی سند سے، مجھ سے جابر بن عبداللہ نے اسی طرح کی حدیث بیان کی ابن نمیر...",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَاهُ عَلِيُّ بْنُ خَشْرَمٍ، أَخْبَرَنَا عِيسَى، - يَعْنِي ابْنَ يُونُسَ - عَنْ زَكَرِيَّاءَ، عَنْ عَامِرٍ، حَدَّثَنِي جَابِرُ بْنُ عَبْدِ اللَّهِ، بِمِثْلِ حَدِيثِ ابْنِ نُمَيْرٍ.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 11351,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=454",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=452",
                "label": "452",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=453",
                "label": "453",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=454",
                "label": "454",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=455",
                "label": "455",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=456",
                "label": "456",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=457",
                "label": "457",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=458",
                "label": "458",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=456",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=456",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=454",
        "to": 11375,
        "total": 40465
    }
}