{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 521,
        "data": [
            {
                "id": 13289,
                "hadithNumber": "5726",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) granted sanction to the family of Hazm for incantation (in mitigating the effect of the poison of) the snake, and, he said-to Asma' daughter of 'Umais رضی اللہ عنہا : What is this that I see the children of my brother lean? Are they not fed properly? She said: No, but they fall under the influence of an evil eve. He said: Use incantation She recited (the words of incantation before him), whereupon he (by approving them) said: Yes, use this incantation for them.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے آل ( بنو عمروبن ) حزم کو سانپ ( کے کا ٹے ) کا دم کرنے کی اجازت دی اور آپ صلی اللہ علیہ وسلم نےاسماء بنت عمیس رضی اللہ عنہا سے فر ما یا : \" کیا ہوا ہے میں نے اپنے بھا ئی ( حضرت جعفر بن ابی طالب رضی اللہ عنہ ) کے بچوں کے جسم لا غر دیکھ رہا ہوں ، کیا انھیں بھوکا رہنا پڑتا ہے؟ \" انھوں نے کہا : نہیں لیکن انھیں نظر بد جلدی لگ جاتی ہے ۔ آپ صلی اللہ علیہ وسلم نے فرما یا : \" انھیں دم کرو ۔ \" انھوں ( اسماء بنت عمیس رضی اللہ عنہا ) نے کہا : تومیں نے ( دم کے الفاظ کو ) آپ کے سامنے پیش کیا تو آپ صلی اللہ علیہ وسلم نے فر مایا : \" ( ان الفاظ سے ) ان کو دم کردو ۔ \"",
                "urduNarrator": "مجھ سے عقبہ بن مکرم العمی نے بیان کیا, ابوعاصم نے ابن جریج سے روایت کی ، کہا : مجھے ابو زبیر نے بتا یا کہ انھوں نے حضرت جا بر بن عبد اللہ رضی اللہ عنہ کو یہ کہتے ہو ئے سنا",
                "hadithArabic": "حَدَّثَنِي عُقْبَةُ بْنُ مُكْرَمٍ الْعَمِّيُّ حَدَّثَنَا أَبُو عَاصِمٍ عَنْ ابْنِ جُرَيْجٍ قَالَ وَأَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ رَخَّصَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِآلِ حَزْمٍ فِي رُقْيَةِ الْحَيَّةِ وَقَالَ لِأَسْمَاءَ بِنْتِ عُمَيْسٍ مَا لِي أَرَى أَجْسَامَ بَنِي أَخِي ضَارِعَةً تُصِيبُهُمْ الْحَاجَةُ قَالَتْ لَا وَلَكِنْ الْعَيْنُ تُسْرِعُ إِلَيْهِمْ قَالَ ارْقِيهِمْ قَالَتْ فَعَرَضْتُ عَلَيْهِ فَقَالَ ارْقِيهِمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13290,
                "hadithNumber": "5727",
                "englishNarrator": "Jabir bin 'Abdullah reported that Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) granted a special sanction for incantation in case of the snake poison to a tribe of 'Amr Abu Zubair said:",
                "hadithEnglish": "I heard Jabir bin 'Abdullah رضی اللہ عنہ as saying that the scorpion stung one of us as we were sitting with Allah's Messenger (may peace upon him). A person said: Allah's Messenger, I use incantation (for curing the effect of sting), whereupon he said: He who is competent amongst you to benefit his brother should do so.",
                "hadithUrdu": "انھوں نے حضرت جا بر بن عبد اللہ رضی اللہ  عنہ کو یہ کہتے ہو ئے سنا ، نبی صلی اللہ علیہ وسلم نے بنو عمرو ( بن حزم ) کو سانپ کے ڈسنے کی صورت میں دم کرنے کی اجا زت دی ۔ ابو زبیر نے کہا : میں نے حضرت جابر بن عبد اللہ رضی اللہ عنہ سے ( یہ بھی ) سنا ، وہ کہتے تھے : ہم میں سے ایک شخص کو بچھو نے ڈنگ مار دیا ، ہم رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں بیٹھے ہو ئے تھے ۔ کہ ایک آدمی نے کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم !میں دم کردوں؟آپ نے فرما یا : \" تم میں سے جو شخص اپنے بھا ئی کو فا ئدہ پہنچا سکتا ہو تو اسے ایسا کرنا چا ہیے ۔",
                "urduNarrator": "مجھ سے محمد بن حاتم نے بیان کیا, روح بن عبادہ نے کہا , ہمیں ابن جریج نے حدیث بیان کی ، کہا : مجھے ابو زبیر نے بتا یا کہ",
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ حَدَّثَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ أَرْخَصَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي رُقْيَةِ الْحَيَّةِ لِبَنِي عَمْرٍو قَالَ أَبُو الزُّبَيْرِ وَسَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ لَدَغَتْ رَجُلًا مِنَّا عَقْرَبٌ وَنَحْنُ جُلُوسٌ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ أَرْقِي قَالَ مَنْ اسْتَطَاعَ مِنْكُمْ أَنْ يَنْفَعَ أَخَاهُ فَلْيَفْعَلْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13291,
                "hadithNumber": "5728",
                "englishNarrator": "Ibn Juraij narrated a similar report (as no. 5727) with this chain of narrators except that he said:",
                "hadithEnglish": "\"A man among the people said: \"Shall I recite Ruqyah for him, O Messenger of Allah?'\"",
                "hadithUrdu": "لو گوں میں سے ایک شخص نے کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم !کیا میں اس کو دم کردوں؟اور ( صرف ) : \" دم کردوں \" نہیں کہا ۔",
                "urduNarrator": "سعید بن یحییٰ اموی کے والد نے کہا : ہمیں ابن جریج نے اسی سند کے ساتھ اسی کی مثل روایت بیان کی مگر انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنِي سَعِيدُ بْنُ يَحْيَى الْأُمَوِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا ابْنُ جُرَيْجٍ بِهَذَا الْإِسْنَادِ مِثْلَهُ غَيْرَ أَنَّهُ قَالَ فَقَالَ رَجُلٌ مِنْ الْقَوْمِ أَرْقِيهِ يَا رَسُولَ اللَّهِ وَلَمْ يَقُلْ أَرْقِي.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13292,
                "hadithNumber": "5729",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "I had a maternal uncle who treated the sting of the scorpion with the help of incantation. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) forbade incantation. He came to him and said: Allah's Messenger, you forbade to practise incantation, whereas I employ it for curing the sting of the scorpion, whereupon he said: He who amongst you is capable of employing it as a means to do good should do that.",
                "hadithUrdu": "میرے ایک ماموں تھے وہ بچھوکے کا ٹے پردم کرتے تھے ۔ رسول اللہ صلی اللہ علیہ وسلم نے ( عمومی طور ہر طرح کے ) دم کرنے سے منع فر ما یا ۔ وہ رسول اللہ صلی اللہ علیہ وسلم کے پاس حاضر ہو ئے اور کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم !آپ نے دم کرنے سے منع فرما دیا ہے ۔ میں بچھو کے کاٹے سے دم کرتا ہوں تو آپ صلی اللہ علیہ وسلم نے فر ما یا : \" تم میں سے جو کو ئی اپنے بھا ئی کو فا ئدہ پہنچا سکتا ہو تو وہ ایسا کرے ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابو سعید الاشجع نے بیان کیا، کہا: وکیع نے اعمش سے ، انھوں نے ابو سفیان سے ، انھوں نے حضرت جا بر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو سَعِيدٍ الْأَشَجُّ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ قَالَ كَانَ لِي خَالٌ يَرْقِي مِنْ الْعَقْرَبِ فَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الرُّقَى قَالَ فَأَتَاهُ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّكَ نَهَيْتَ عَنْ الرُّقَى وَأَنَا أَرْقِي مِنْ الْعَقْرَبِ فَقَالَ مَنْ اسْتَطَاعَ مِنْكُمْ أَنْ يَنْفَعَ أَخَاهُ فَلْيَفْعَلْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13293,
                "hadithNumber": "5730",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of A'mash with the same chain of transmitters.",
                "hadithUrdu": "ہم سے عثمان بن ابی شیبہ نے بیان کیا، انہوں نے کہا: جریر نے اعمش سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَاه عُثْمَانُ بْنُ أَبِي شَيْبَةَ قَالَ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13294,
                "hadithNumber": "5731",
                "englishNarrator": "Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) prohibited incantation. Then the people of Amr bin Hazm came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and said: We know an incantation which we use for curing the sting of the scorpion but you have prohibited it. They recited (the words of incantation) before him, whereupon he said: I do not see any harm (in it), so he who amongst you is competent to do good to his brother should do that.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے دم کرنے سے منع فرما دیا تو عمرو بن حزم کا خاندان رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حا ضر ہوا اور عرض کی ، اللہ کے رسول صلی اللہ علیہ وسلم ! ہمارے پاس دم ( کرنے کا ایک کلمہ ) تھا ۔ ہم اس سے بچھو کے ڈسے ہو ئے کو دم کرتے تھے اور آپ نے دم کرنے سے منع فر ما دیا ۔ انھوں ( جا بر رضی اللہ عنہ ) نے کہا : تو انھوں نے وہ پیش کیا تو آپ صلی اللہ علیہ وسلم نے فر ما یا : \" میں ( اس میں کو ئی ) حرج نہیں سمجھتا ۔ تم میں سے جو کوئی اپنے بھا ئی کو فائدہ پہنچاسکتا ہو تو وہ ضرور اسے فائدہ پہنچائے ۔",
                "urduNarrator": "ہم سے ابو کریب نے بیان کیا, ابو معاویہ نے اعمش سے ، انھوں نے سفیان سے ، انھوں نے حضرت جا بر رضی اللہ عنہ سے روایت کی کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الرُّقَى فَجَاءَ آلُ عَمْرِو بْنِ حَزْمٍ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّهُ كَانَتْ عِنْدَنَا رُقْيَةٌ نَرْقِي بِهَا مِنْ الْعَقْرَبِ وَإِنَّكَ نَهَيْتَ عَنْ الرُّقَى قَالَ فَعَرَضُوهَا عَلَيْهِ فَقَالَ مَا أَرَى بَأْسًا مَنْ اسْتَطَاعَ مِنْكُمْ أَنْ يَنْفَعَ أَخَاهُ فَلْيَنْفَعْهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13295,
                "hadithNumber": "5732",
                "englishNarrator": "Auf bin Malik Ashja'i رضی اللہ عنہ reported:",
                "hadithEnglish": "We practised incantation in the pre-Islamic days and we said: Allah's Messenger. what is your opinion about it? He said: Let me know your incantation and said: There is no harm in the incantation which does not smack of polytheism.",
                "hadithUrdu": "ہم زمانہ جاہلیت میں دم کیا کرتے تھے ہم نے عرض کی : اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! اس کے بارے میں آپ کا کیا خیال ہے؟آپ صلی اللہ علیہ وسلم نے فر ما یا : \" اپنے دم کے کلمات میرے سامنے پیش کرو دم میں کو ئی حرج نہیں جب تک اس میں شرک نہ ہو ۔ \"",
                "urduNarrator": "مجھ سے ابو الطاہر نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، کہا کہ مجھ سے معاویہ بن صالح نے، وہ عبدالرحمٰن بن جبیر کے واسطہ سے اپنے والد سے, حضرت عوف بن مالک اشجعی رضی اللہ عنہ سے روایت ہے ، کہا",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي مُعَاوِيَةُ بْنُ صَالِحٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرٍ عَنْ أَبِيهِ عَنْ عَوْفِ بْنِ مَالِكٍ الْأَشْجَعِيِّ قَالَ كُنَّا نَرْقِي فِي الْجَاهِلِيَّةِ فَقُلْنَا يَا رَسُولَ اللَّهِ كَيْفَ تَرَى فِي ذَلِكَ فَقَالَ اعْرِضُوا عَلَيَّ رُقَاكُمْ لَا بَأْسَ بِالرُّقَى مَا لَمْ يَكُنْ فِيهِ شِرْكٌ.",
                "headingArabic": "لاَ بَأْسَ بِالرُّقَى مَا لَمْ يَكُنْ فِيهِ شِرْكٌ ‏‏",
                "headingUrdu": "رقیہ میں کوئی حرج نہیں جس میں شرک نہ ہو۔",
                "headingEnglish": "There Is Nothing Wrong With Ruqyah That Does Not Involve Shirk",
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13296,
                "hadithNumber": "5733",
                "englishNarrator": "Abu Sa'id Khudri رضی اللہ عنہ reported:",
                "hadithEnglish": "Some persons amongst the Companions of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) set out on a journey and they happened to pass by a tribe from the tribes of Arabia. They demanded hospitality from the members of that tribe, but they did not extend any hospitality to them. They said to them: Is there any incantator amongst you, at the chief of the tribe has began stung by a scorpion? A person amongst us said: 'Yes. So he came to him and he practised incantation with the help of Sura al-Fatiha and the person became all right. He was given a flock of sheep (as recompense), but he refused to accept that, saying: I shall make a mention of it to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), and if he approves of it. then I shall accept it. So we came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and made a mention of that to him and he (that person) said: Allah's Messenger by Allah ﷺ, I did not practice incantation but with the help of Sura al-Fatiha of the Holy Book. He (the Holy Prophet ﷺ) smiled and said: How did you come to know that it can be used (as incactation)? - and then said: Take out of that and allocate a share for me along with your share.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ! کے چند صحابہ کرام رضوان اللہ عنھم اجمعین سفر میں تھے عرب کے قبائل میں سے کسی قبیلے کے سامنے سے ان کا گزر ہوا انھوں نے ان ( قبیلے والے ) لوگوں سے چاہا کہ وہ انھیں اپنا مہمان بنائیں ۔ انھوں نے مہمان بنانے سے انکا ر کر دیا ، پھر انھوں نے کہا : کیا تم میں کو ئی دم کرنے والا ہے کیونکہ قوم کے سردار کو کسی چیز نے ڈس لیا ہے یا اسے کو ئی بیماری لا حق ہو گئی ہے ۔ ان ( صحابہ کرام رضوان اللہ عنھم اجمعین ) میں سے ایک آدمی نے کہا : ہاں پھر وہ اس کے قریب آئے اور اسے فاتحہ الکتاب سے دم کر دیا ۔ وہ آدمی ٹھیک ہو گیا تو اس ( دم کرنے والے ) کو بکریوں کاا یک ریوڑ ( تیس بکریاں ) پیش کی گئیں ۔ اس نے انھیں ( فوری طور پر ) قبول کرنے ( کا م میں لا نے ) سے انکا ر کر دیا اور کہا : یہاں تک کہ میں رسول اللہ صلی اللہ علیہ وسلم ! کو ماجرا سنادوں ۔ وہ رسول اللہ صلی اللہ علیہ وسلم ! کی خدمت میں حا ضر ہوا اور سارا ماجرا آپ کو سنایا اور کہا اللہ کے رسول اللہ صلی اللہ علیہ وسلم !!میں فاتحہ الکتاب کے علاوہ اور کو ئی دم نہیں کیا ۔ آپ صلی اللہ علیہ وسلم مسکرائے اور فرما یا : \" تمھیں کیسے پتہ چلا کہ وہ دم ( بھی ) ہے؟ \" پھر انھیں لے لو اور اپنے ساتھ میرا بھی حصہ رکھو ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ التمیمی نے بیان کیا, ہشیم نے ابو بشر سے ، انھوں نے ابو متوکل سے ، انھوں نے حضرت ابو سعید خدری رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ أَخْبَرَنَا هُشَيْمٌ عَنْ أَبِي بِشْرٍ عَنْ أَبِي الْمُتَوَكِّلِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ نَاسًا مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانُوا فِي سَفَرٍ فَمَرُّوا بِحَيٍّ مِنْ أَحْيَاءِ الْعَرَبِ فَاسْتَضَافُوهُمْ فَلَمْ يُضِيفُوهُمْ فَقَالُوا لَهُمْ هَلْ فِيكُمْ رَاقٍ فَإِنَّ سَيِّدَ الْحَيِّ لَدِيغٌ أَوْ مُصَابٌ فَقَالَ رَجُلٌ مِنْهُمْ نَعَمْ فَأَتَاهُ فَرَقَاهُ بِفَاتِحَةِ الْكِتَابِ فَبَرَأَ الرَّجُلُ فَأُعْطِيَ قَطِيعًا مِنْ غَنَمٍ فَأَبَى أَنْ يَقْبَلَهَا وَقَالَ حَتَّى أَذْكُرَ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ ذَلِكَ لَهُ فَقَالَ يَا رَسُولَ اللَّهِ وَاللَّهِ مَا رَقَيْتُ إِلَّا بِفَاتِحَةِ الْكِتَابِ فَتَبَسَّمَ وَقَالَ وَمَا أَدْرَاكَ أَنَّهَا رُقْيَةٌ ثُمَّ قَالَ خُذُوا مِنْهُمْ وَاضْرِبُوا لِي بِسَهْمٍ مَعَكُمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13297,
                "hadithNumber": "5734",
                "englishNarrator": "This hadith has been reported on the authority of Abu Bishr with the same the same chain of transmitters (with these words):",
                "hadithEnglish": "That he recited Umm-ul-Qur'an (Sura Fatiha), and he collected his spittle and he applied that and the person became all right.",
                "hadithUrdu": "اس نے ام القرآن ( سورۃفاتحہ ) پڑھنی شروع کی اور اپنا تھوک جمع کرتا اور اس پر پھینکتا جاتا تو وہ آدمی تندرست ہوگیا ۔",
                "urduNarrator": "ہم سے محمد بن بشار اور ابوبکر بن نافع نے غندر محمد بن جعفر کی سند سے بیان کیا, شعبہ نے ابو بشر سے اسی سند کے ساتھ روایت کی ، اور حدیث میں یہ کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ وَأَبُو بَكْرِ بْنُ نَافِعٍ كِلَاهُمَا عَنْ غُنْدَرٍ مُحَمَّدِ بْنِ جَعْفَرٍ عَنْ شُعْبَةَ عَنْ أَبِي بِشْرٍ بِهَذَا الْإِسْنَادِ وَقَالَ فِي الْحَدِيثِ فَجَعَلَ يَقْرَأُ أُمَّ الْقُرْآنِ وَيَجْمَعُ بُزَاقَهُ وَيَتْفِلُ فَبَرَأَ الرَّجُلُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13298,
                "hadithNumber": "5735",
                "englishNarrator": "Abu Sa'id al-Khudri رضی اللہ عنہ reported:",
                "hadithEnglish": "We landed at a place where a woman came to us and said: A scorpion has bitten the chief of the tribe. Is there any incantator amongst you? A person amongst us stood up (and went with her). We had no idea that he had been a good incantator but he practiced incantation with the help of Sura al-Fatiha and the (the chief) was all right. They gave him a flock of sheep and served us milk. We said (to him): Are you a good incantator. Thereupon he said: I did not do it but by the help of Sura al-Fatiha. He said: Do not drive (these goats) until we go to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and find out (whether it is permissible to accept (this reward of incantation). So we came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and made a mention of that to him, whereupon he said: How did you come to know that this (Sura al-Fatiha) could be used as an incantation? So distribute them (amongst those who had been present there with him) and allocate a share of mine also.",
                "hadithUrdu": "ہم نے ایک مقام پر پڑاؤکیا ، ایک عورت ہمارے پاس آئی اور کہا : قبیلے کےسردار کو ڈنک لگا ہے ، ( اسے بچھو نے ڈنک ماراہے ) کیا تم میں سے کوئی دم کرنے والا ہے؟ہم میں سے ایک آدمی اس کے ساتھ ( جانے کےلئے ) کھڑا ہوگیا ، اس کے بارے میں ہمارا خیال نہیں تھا کہ وہ اچھی طرح دم کرسکتا ہے ۔ اس نے اس ( ڈسے ہوئے ) کو فاتحہ سے دم کیاتو وہ ٹھیک ہوگیا ، تو انھوں نے اسے بکریوں کا ایک ریوڑ دیا اور ہم سب کو دودھ پلایا ۔ ہم نے ( اس سے ) پوچھا : کیا تم اچھی طرح دم کرنا جانتے تھے؟اس نے کہا : میں نے اسے صرف فاتحۃ الکتاب سے دم کیا ہے ۔ کہا : میں نے ( ساتھیوں سے ) کہا : ان بکریوں کو کچھ نہ کہو یہاں تک کہ ہم رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوجائیں ۔ ہم نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے ، آپ کو یہ بات بتائی توآپ صلی اللہ علیہ وسلم نے فرمایا : \" اسے کس ذریعے سے پتہ چلا کہ یہ ( فاتحہ ) دم ( کا کلمہ بھی ) ہے؟ان ( بکریوں ) کو بانٹ لو اور اپنے داتھ میرا بھی حصہ رکھو ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, یزید بن ہارون نے کہا : ہمیں ہشام بن حسان نے محمد بن سیرین سےخبر دی ، انھوں نے ا پنے بھائی معبد بن سیرین سے ، انھوں نے حضرت ابو سعید خدری رضی اللہ عنہ سے ، روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا هِشَامُ بْنُ حَسَّانَ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَخِيهِ مَعْبَدِ بْنِ سِيرِينَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ نَزَلْنَا مَنْزِلًا فَأَتَتْنَا امْرَأَةٌ فَقَالَتْ إِنَّ سَيِّدَ الْحَيِّ سَلِيمٌ لُدِغَ فَهَلْ فِيكُمْ مِنْ رَاقٍ فَقَامَ مَعَهَا رَجُلٌ مِنَّا مَا كُنَّا نَظُنُّهُ يُحْسِنُ رُقْيَةً فَرَقَاهُ بِفَاتِحَةِ الْكِتَابِ فَبَرَأَ فَأَعْطَوْهُ غَنَمًا وَسَقَوْنَا لَبَنًا فَقُلْنَا أَكُنْتَ تُحْسِنُ رُقْيَةً فَقَالَ مَا رَقَيْتُهُ إِلَّا بِفَاتِحَةِ الْكِتَابِ قَالَ فَقُلْتُ لَا تُحَرِّكُوهَا حَتَّى نَأْتِيَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَيْنَا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرْنَا ذَلِكَ لَهُ فَقَالَ مَا كَانَ يُدْرِيهِ أَنَّهَا رُقْيَةٌ اقْسِمُوا وَاضْرِبُوا لِي بِسَهْمٍ مَعَكُمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13299,
                "hadithNumber": "5736",
                "englishNarrator": "This hadith has been narrated on the authority of Hisham with the same chain of transmitters and he said:",
                "hadithEnglish": "There stood up with her a person amongst us whom we did not know before as an incantator.",
                "hadithUrdu": "ہم میں سے ایک آدمی اس کے ساتھ ( جانے کے لئے کھڑا ہوگیا ) ہم نے کبھی گمان نہیں کیاتھا کہ وہ دم کرسکتاہے ۔",
                "urduNarrator": "مجھ سے محمد بن المثنی نے بیان کیا، کہا ہم سے وہب بن جریر نے بیان کیا, ہمیں ہشام نے اسی سند کے ساتھ ، اسی طرح حدیث بیان کی ، مگر اس نے کہا",
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ حَدَّثَنَا هِشَامٌ بِهَذَا الْإِسْنَادِ نَحْوَهُ غَيْرَ أَنَّهُ قَالَ فَقَامَ مَعَهَا رَجُلٌ مِنَّا مَا كُنَّا نَأْبِنُهُ بِرُقْيَةٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13300,
                "hadithNumber": "5737",
                "englishNarrator": "Uthman bin Abu al-'As Al-Thaqafi رضی اللہ عنہ reported:",
                "hadithEnglish": "He made a complaint of pain to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) that he felt in his body at the time he had become Muslim. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Place your hand at the place where you feel pain in your body and say Bismillah (in the name of Allah) three times and seven times A'udhu billahi wa qudratihi min sharri ma ajidu wa uhadhiru (I seek refuge with Allah and with His Power from the evil that I find and that I fear).",
                "hadithUrdu": "انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے اپنے ایک درد کی شکایت کی ، جو ان کے بدن میں پیدا ہو گیا تھا جب سے وہ مسلمان ہوئے تھے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم اپنا ہاتھ درد کی جگہ پر رکھو اور تین بار ( ( بسم اللہ ) ) کہو ، اس کے بعد سات بار یہ کہو کہأَعُوذُ بِاللَّهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ ”میں اللہ تعالیٰ کی پناہ مانگتا ہوں اس چیز کی برائی سے جس کو پاتا ہوں اور جس سے ڈرتا ہوں“ ۔",
                "urduNarrator": "مجھ سے ابو الطاہر اور حرملہ بن یحییٰ نے بیان کیا، انہوں نے کہا: ہم سے ابن وہب نے بیان کیا، مجھ سے یونس نے ابن شہاب کی سند سے بیان کیا، مجھ سے نافع بن جبیر نے بیان کیا, ابن مطعم , سیدنا عثمان بن ابی العاص ثقفی رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ وَحَرْمَلَةُ بْنُ يَحْيَى قَالَا أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي نَافِعُ بْنُ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ عُثْمَانَ بْنِ أَبِي الْعَاصِ الثَّقَفِيِّ أَنَّهُ شَكَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَجَعًا يَجِدُهُ فِي جَسَدِهِ مُنْذُ أَسْلَمَ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَعْ يَدَكَ عَلَى الَّذِي تَأَلَّمَ مِنْ جَسَدِكَ وَقُلْ بِاسْمِ اللَّهِ ثَلَاثًا وَقُلْ سَبْعَ مَرَّاتٍ أَعُوذُ بِاللَّهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ.",
                "headingArabic": "اسْتِحْبَابِ وَضْعِ يَدِهِ عَلَى مَوْضِعِ الأَلَمِ مَعَ الدُّعَاءِ ‏‏",
                "headingUrdu": "دعا کرتے وقت درد کی جگہ پر ہاتھ رکھنا مستحب ہے۔",
                "headingEnglish": "It Is Recommended To Put Ones Hand On The Site Of The Pain When Supplicating",
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13301,
                "hadithNumber": "5738",
                "englishNarrator": "Uthman bin Abu al-'As رضی اللہ عنہ reported:",
                "hadithEnglish": "He came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: Allah's Messenger, the Satan intervenes between me and my prayer and my reciting of the Qur'an and he confounds me. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said:, That is (the doing of a) Satan (devil) who is known as Khinzab, and when you perceive its effect, seek refuge with Allah from it and spit three times to your left. I did that and Allah dispelled that from me.",
                "hadithUrdu": "وہنبی کریم صلی اللہ علیہ وسلم کے پاس آئے اور کہا کہ یا رسول اللہ! شیطان میری نماز میں حائل ہو جاتا ہے اور مجھے قرآن بھلا دیتا ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس شیطان کا نام خنزب ہے ، جب تجھے اس شیطان کا اثر معلوم ہو تو اس سے اللہ تعالیٰ کی پناہ مانگ اور ( نماز کے اندر ہی ) بائیں طرف تین بار تھوک لے ۔ سیدنا عثمان رضی اللہ عنہ نے کہا کہ میں نے ایسا ہی کیا ، پھر اللہ تعالیٰ نے اس شیطان کو مجھ سے دور کر دیا ۔",
                "urduNarrator": "ہم سے یحییٰ بن خلف الباہلی نے بیان کیا, عبدالاعلیٰ نے سعید جریری سے ، انھوں نے ابو علاء سے روایت کی کہ سیدنا عثمان بن ابوالعاص رضی اللہ عنہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ خَلَفٍ الْبَاهِلِيُّ حَدَّثَنَا عَبْدُ الْأَعْلَى عَنْ سَعِيدٍ الْجُرَيْرِيِّ عَنْ أَبِي الْعَلَاءِ أَنَّ عُثْمَانَ بْنَ أَبِي الْعَاصِ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ الشَّيْطَانَ قَدْ حَالَ بَيْنِي وَبَيْنَ صَلَاتِي وَقِرَاءَتِي يَلْبِسُهَا عَلَيَّ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاكَ شَيْطَانٌ يُقَالُ لَهُ خَنْزَبٌ فَإِذَا أَحْسَسْتَهُ فَتَعَوَّذْ بِاللَّهِ مِنْهُ وَاتْفِلْ عَلَى يَسَارِكَ ثَلَاثًا قَالَ فَفَعَلْتُ ذَلِكَ فَأَذْهَبَهُ اللَّهُ عَنِّي.",
                "headingArabic": "التَّعَوُّذِ مِنْ شَيْطَانِ الْوَسْوَسَةِ فِي الصَّلاَةِ ‏‏",
                "headingUrdu": "نماز میں وسوسہ ڈالنے والے شیطان سے اللہ کی پناہ مانگنا",
                "headingEnglish": "Seeking Refuge With Allah From The Devil Who Whispers During Prayer",
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13302,
                "hadithNumber": "5739",
                "englishNarrator": "Uthman bin Abu al-'As رضی اللہ عنہ reported:",
                "hadithEnglish": "He came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and he narrated like this. In the hadith transmitted on the authority of Salam bin Nuh there is no mention of three times,",
                "hadithUrdu": "وہ نبی کریم صلی اللہ علیہ وسلم کے پاس حاضر ہوئے ، پھر اس طرح بیا ن کیا اور سالم بن نوح کی حدیث میں \" تین بار \" کا لفظ نہیں ہے ۔",
                "urduNarrator": "ہم سے محمد بن المثنیٰ نے بیان کیا, سالم بن نوح اور ابو اسامہ ، دونوں نےجریری سے ، انھوں نے ابو علااء سے ، انھوں نے عثمان بن ابی العاص رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَاه مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا سَالِمُ بْنُ نُوحٍ و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ كِلَاهُمَا عَنْ الْجُرَيْرِيِّ عَنْ أَبِي الْعَلَاءِ عَنْ عُثْمَانَ بْنِ أَبِي الْعَاصِ أَنَّهُ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ بِمِثْلِهِ وَلَمْ يَذْكُرْ فِي حَدِيثِ سَالِمِ بْنِ نُوحٍ ثَلَاثًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13303,
                "hadithNumber": "5740",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been transmitted on the authority of 'Uthman bin Abu al-'As رضی اللہ عنہ with a slight variation of wording.",
                "hadithUrdu": "سفیان نے سعید جریری سے روایت کی ، کہا : ہمیں یزید بن عبداللہ بن شخیر نے حدیث بیان کی ، انھوں نے حضرت عثمان بن ابی العاص مجھ سے محمد بن رافع نے بیان کیا، ہم سے عبدالرزاق نے بیان کیا, ثقفی رضی اللہ عنہ سے روایت کی ، کہا : میں نے عرض کی : اللہ کے رسول صلی اللہ علیہ وسلم !پھر ان کی حدیث کی مانند بیان کیا ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا سُفْيَانُ عَنْ سَعِيدٍ الْجُرَيْرِيِّ حَدَّثَنَا يَزِيدُ بْنُ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ عَنْ عُثْمَانَ بْنِ أَبِي الْعَاصِ الثَّقَفِيِّ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِهِمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13304,
                "hadithNumber": "5741",
                "englishNarrator": "Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: There is a remedy for every malady, and when the remedy is applied to the disease it is cured with the permission of Allah, the Exalted and Glorious.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" ہر بیماری کی دوا ہے ، جب کوئی دوا بیماری پر ٹھیک بٹھا دی جاتی ہے تو مریض اللہ تعالیٰ کےحکم سے تندرست ہوجاتاہے ۔",
                "urduNarrator": "ہم سے ہارون بن معروف، ابو الطاہر اور احمد بن عیسیٰ نے بیان کیا، انہوں نے کہا: ہم سے ابن وہب نے بیان کیا، مجھ سے عمرو نے جو ابن حارث ہیں، نے بیان کیا۔ عبد ربہ بن سعید، ابو الزبیر کی سند سے, حضرت جابر رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ وَأَبُو الطَّاهِرِ وَأَحْمَدُ بْنُ عِيسَى قَالُوا حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو وَهُوَ ابْنُ الْحَارِثِ عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ لِكُلِّ دَاءٍ دَوَاءٌ فَإِذَا أُصِيبَ دَوَاءُ الدَّاءِ بَرَأَ بِإِذْنِ اللَّهِ عَزَّ وَجَلَّ.",
                "headingArabic": "لِكُلِّ دَاءٍ دَوَاءٌ وَاسْتِحْبَابُ التَّدَاوِي ‏‏",
                "headingUrdu": "ہر بیماری کے لئے ایک علاج ہے، اور یہ بیماری کے علاج کے لئے سفارش کی جاتی ہے",
                "headingEnglish": "For Every Disease There Is A Remedy, And It Is Recommended To Treat Disease",
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13305,
                "hadithNumber": "5742",
                "englishNarrator": "Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "He visited Muqanna' and then said: I will not go away unless you get yourself cupped, for I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) say: It is a remedy.",
                "hadithUrdu": "آپ نے مقنع ( بن سنان تابعی ) کی عیادت کی ، پھر فرمایا : میں ( اس وقت تک ) یہاں سے نہیں جاؤں گا جب تک کہ تم پچھنے نہ لگوالو ، کیونکہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے ، آپ فرماتے ہیں؛ \" یقیناً اس میں شفاہے ۔ \"",
                "urduNarrator": "ہم سے ہارون بن معروف اور ابو الطاہر نے بیان کیا، انہوں نے کہا کہ ہم سے ابن وہب نے بیان کیا، مجھ سے عمرو نے بیان کیا, بکیر نے کہا کہ عاصم بن عمر بن قتادہ نے انھیں حدیث سنائی کہ حضرت جابر بن عبداللہ رضی اللہ عنہ بکیر نے کہا کہ عاصم بن عمر بن قتادہ نے انھیں حدیث سنائی کہ حضرت جابر بن عبداللہ رضی اللہ عنہ",
                "hadithArabic": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ وَأَبُو الطَّاهِرِ قَالَا حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو أَنَّ بُكَيْرًا حَدَّثَهُ أَنَّ عَاصِمَ بْنَ عُمَرَ بْنِ قَتَادَةَ حَدَّثَهُ أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ عَادَ الْمُقَنَّعَ ثُمَّ قَالَ لَا أَبْرَحُ حَتَّى تَحْتَجِمَ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ فِيهِ شِفَاءً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13306,
                "hadithNumber": "5743",
                "englishNarrator": "Asim bin 'Umar bin Qatada reported:",
                "hadithEnglish": "There came to our house 'Abdullah رضی اللہ عنہ and another person from amongst the members of the household who complained of a wound. Jabir رضی اللہ عنہ said: What ails you? He said: There is a wound which is very painful for me, whereupon he said: Boy, bring to me a cupper. He said: 'Abdullah رضی اللہ عنہ , what do you intend to do with the cupper? I said: I would get this wound cupped. He said: By Allah. oven the touch of fly or cloth causes me pain (and cupping) would thus cause me (unbearable) pain. And when he saw him feeling pain (at the idea of cupping), he said: I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: If there is any effective remedy amongst your remedies, these are (three): Cupping, drinking of honey and cauterisation with the help of fire. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had said: As for myself I do not like cauterisation. The cupper was called and he cupped him and he was all right.",
                "hadithUrdu": "سیدنا جابر بن عبداللہ رضی اللہ عنہ ہمارے گھر میں آئے اور ایک شخص کو زخم کی تکلیف تھی ( یعنی قرحہ پڑ گیا تھا ) ۔ سیدنا جابر رضی اللہ عنہ نے کہا کہ تجھے کیا تکلیف ہے؟ وہ بولا کہ ایک قرحہ ہو گیا ہے جو کہ مجھ پر نہایت سخت ہے ۔ سیدنا جابر رضی اللہ عنہ نے کہا کہ اے غلام! ایک پچھنے لگانے والے کو لے کر آ ۔ وہ بولا کہ پچھنے لگانے والے کا کیا کام ہے؟ سیدنا جابر رضی اللہ عنہ نے کہا کہ میں اس زخم پر پچھنے لگوانا چاہتا ہوں ، وہ بولا کہ اللہ کی قسم مجھے مکھیاں ستائیں گی اور کپڑا لگے گا تو مجھے تکلیف ہو گی اور مجھ پر بہت سخت ( وقت ) گزرے گا ۔ جب سیدنا جابر رضی اللہ عنہ نے دیکھا کہ اس کو پچھنے لگانے سے رنج ہوتا ہے تو کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے آپ صلی اللہ علیہ وسلم فرماتے تھے کہ اگر تمہاری دواؤں میں بہتر کوئی دوا ہے تو تین ہی دوائیں ہیں ، ایک تو پچھنا ، دوسرے شہد کا ایک گھونٹ اور تیسرے انگارے سے جلانا اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ میں داغ لینا بہتر نہیں جانتا ۔ راوی نے کہا کہ پھر پچھنے لگانے والا آیا اور اس نے اس کو پچھنے لگائے اور اس کی بیماری جاتی رہی ۔",
                "urduNarrator": "مجھ سے نصر بن علی الجہدمی نے بیان کیا، مجھ سے میرے والد نے بیان کیا, عبدالرحمن بن سلیمان نے حضرت عاصم بن عمر بن قتادہ سے روایت کی ، کہا : کہ",
                "hadithArabic": "حَدَّثَنِي نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنِي أَبِي حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سُلَيْمَانَ عَنْ عَاصِمِ بْنِ عُمَرَ بْنِ قَتَادَةَ قَالَ جَاءَنَا جَابِرُ بْنُ عَبْدِ اللَّهِ فِي أَهْلِنَا وَرَجُلٌ يَشْتَكِي خُرَاجًا بِهِ أَوْ جِرَاحًا فَقَالَ مَا تَشْتَكِي قَالَ خُرَاجٌ بِي قَدْ شَقَّ عَلَيَّ فَقَالَ يَا غُلَامُ ائْتِنِي بِحَجَّامٍ فَقَالَ لَهُ مَا تَصْنَعُ بِالْحَجَّامِ يَا أَبَا عَبْدِ اللَّهِ قَالَ أُرِيدُ أَنْ أُعَلِّقَ فِيهِ مِحْجَمًا قَالَ وَاللَّهِ إِنَّ الذُّبَابَ لَيُصِيبُنِي أَوْ يُصِيبُنِي الثَّوْبُ فَيُؤْذِينِي وَيَشُقُّ عَلَيَّ فَلَمَّا رَأَى تَبَرُّمَهُ مِنْ ذَلِكَ قَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنْ كَانَ فِي شَيْءٍ مِنْ أَدْوِيَتِكُمْ خَيْرٌ فَفِي شَرْطَةِ مِحْجَمٍ أَوْ شَرْبَةٍ مِنْ عَسَلٍ أَوْ لَذْعَةٍ بِنَارٍ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَا أُحِبُّ أَنْ أَكْتَوِيَ قَالَ فَجَاءَ بِحَجَّامٍ فَشَرَطَهُ فَذَهَبَ عَنْهُ مَا يَجِدُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13307,
                "hadithNumber": "5744",
                "englishNarrator": "Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "Umm Salama رضی اللہ عنہ sought permission from Allah's messenger (may Allah's peace upon him) tor getting herself cupped. The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) asked Abu Taiba رضی اللہ عنہ to cup her. He (Jabir رضی اللہ عنہ ) said: I think he (Abu Taiba رضی اللہ عنہ) was her faster brother or a young boy before entering upon the adolescent period.",
                "hadithUrdu": "حضرت ام سلمہ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے پچھنے لگوانے کے متعلق اجازت طلب کی تو نبی کریم صلی اللہ علیہ وسلم نے حضرت ابوطیبہ رضی اللہ تعالیٰ عنہ کو حکم دیا کہ انھیں پچھنے لگائیں ۔ انھوں نے ( جابر رضی اللہ تعالیٰ عنہ ) نے کہا : حضرت ابو طیبہ رضی اللہ تعالیٰ عنہ حضرت ام سلمہ رضی اللہ تعالیٰ عنہا کے رضاعی بھائی تھے یا نابالغ لڑکے تھے ۔ ( اور انھوں نے ہاتھ یا پاؤں ایسی جگہ پچھنے لگائےجنھیں دیکھنا محرم یا بچے کے لئے جائز ہے ۔ )",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ہم سے لیث نے بیان کیا اور ہم سے محمد بن رومح نے بیان کیا، ہم سے لیث نے ابو الزبیر کی سند سے بیان کیا, حضرت جابر رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ و حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ أَنَّ أُمَّ سَلَمَةَ اسْتَأْذَنَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْحِجَامَةِ فَأَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبَا طَيْبَةَ أَنْ يَحْجُمَهَا قَالَ حَسِبْتُ أَنَّهُ قَالَ كَانَ أَخَاهَا مِنْ الرَّضَاعَةِ أَوْ غُلَامًا لَمْ يَحْتَلِمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13308,
                "hadithNumber": "5745",
                "englishNarrator": "Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sent a phystian to Ubayy bin Ka'b رضی اللہ عنہ. He cut the vein and then cauterised it.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ( جب ) حضرت ابی بن کعب رضی اللہ عنہ ( کو جنگ خندق کے موقع پر ہاتھ کی بڑی رگ پر زخم لگاتو ان ) کے پاس ا یک طبیب بھیجا ، اس نے ان کی ( زخمی ) رگ ( کی خراب ہوجانے والی جگہ ) کاٹی ، پھر اس پرداغ لگایا ( تاکہ خون رک جائے ۔ )",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ، ابو بکر بن ابی شیبہ اور ابو کریب نے بیان کیا، اور ہم سے اس کا تلفظ ہے، اور باقی دو نے کہا, ابومعاویہ نے اعمش سے ، انھوں نے ابو سفیان سے ، انھوں نے حضرت جابر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَ يَحْيَى وَاللَّفْظُ لَهُ أَخْبَرَنَا و قَالَ الْآخَرَانِ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ قَالَ بَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى أُبَيِّ بْنِ كَعْبٍ طَبِيبًا فَقَطَعَ مِنْهُ عِرْقًا ثُمَّ كَوَاهُ عَلَيْهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13309,
                "hadithNumber": "5746",
                "englishNarrator": null,
                "hadithEnglish": "It was narrated from A'mash with this chin of narrators (a hadith similar to no. 5745), but he did not mention: \"He cut one of his veins.\"",
                "hadithUrdu": "ہم سے عثمان بن ابی شیبہ نے بیان کیا, جریر اور سفیان دونوں نے اعمش سے اسی سند کے ساتھ بیان کیا اور \" تو ان کی رگ کاٹی \" کے الفاظ بیان نہیں کیے ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ و حَدَّثَنِي إِسْحَقُ بْنُ مَنْصُورٍ أَخْبَرَنَا عَبْدُ الرَّحْمَنِ أَخْبَرَنَا سُفْيَانُ كِلَاهُمَا عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ وَلَمْ يَذْكُرَا فَقَطَعَ مِنْهُ عِرْقًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13310,
                "hadithNumber": "5747",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "On the day of Ahzab Ubayy رضی اللہ عنہ received the wound of an arrow in his medial arm vein. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) cauterised it.",
                "hadithUrdu": "غزوہ احزاب میں حضرت ابی بن کعب رضی اللہ تعالیٰ عنہ کے بازو کی بڑی رگ میں تیر لگا ۔ کہا : تو نبی کریم صلی اللہ علیہ وسلم نے انھیں داغ لگوایا ۔",
                "urduNarrator": "مجھ سے بشر بن خالد نے بیان کیا، محمد نے، یعنی ابن جعفر نے، ہم سے شعبہ کی سند سے بیان کیا, سلیمان نے کہا : میں نے ابو سفیان کو سنا ، انھوں نے کہا : میں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے سنا ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنِي بِشْرُ بْنُ خَالِدٍ حَدَّثَنَا مُحَمَّدٌ يَعْنِي ابْنَ جَعْفَرٍ عَنْ شُعْبَةَ قَالَ سَمِعْتُ سُلَيْمَانَ قَالَ سَمِعْتُ أَبَا سُفْيَانَ قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ قَالَ رُمِيَ أُبَيٌّ يَوْمَ الْأَحْزَابِ عَلَى أَكْحَلِهِ فَكَوَاهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13311,
                "hadithNumber": "5748",
                "englishNarrator": "Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "Sa'd bin Mu'adh رضی اللہ عنہ received a wound of the arrow in his vein. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) cauterised it with a rod and it was swollen, to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) did it for the second time.",
                "hadithUrdu": "حضرت سعد بن معاذ رضی اللہ عنہ کے بازو کی بڑی رگ میں تیر لگا ، کہا : تو نبی کریم صلی اللہ علیہ وسلم نے اپنے دست مبارک سےتیر کے پھل کے ساتھ اس ( جگہ ) کو داغ لگایا ، ان کا ہاتھ دوبارہ سوج گیا تو آپ نے دوبارہ اس پر داغ لگایا ۔",
                "urduNarrator": "ہم سے احمد بن یونس نے بیان کیا، کہا ہم سے زہیر نے بیان کیا , ابو زبیر نے حضرت جابر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو خَيْثَمَةَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ رُمِيَ سَعْدُ بْنُ مُعَاذٍ فِي أَكْحَلِهِ قَالَ فَحَسَمَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدِهِ بِمِشْقَصٍ ثُمَّ وَرِمَتْ فَحَسَمَهُ الثَّانِيَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13312,
                "hadithNumber": "5749",
                "englishNarrator": "Ibn 'Abbas رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) got himself cupped and gave to the cupper his wages and he put the medicine in the nostril.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے پچھنے لگوانے اور لگانے والے کو اس کی اجرت دی اور آپ نے ناک کے ذریعے دوائی لی ۔",
                "urduNarrator": "مجھ سے احمد بن سعید بن صخر الدارمی نے بیان کیا، کہا ہم سے حبان بن ہلال نے بیان کیا، کہا ہم سے وہیب نے بیان کیا، ہم سے عبداللہ بن طاؤس نے بیان کیا، وہ اپنے والد کی سند سے, حضرت ابن عباس رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنِي أَحْمَدُ بْنُ سَعِيدِ بْنِ صَخْرٍ الدَّارِمِيُّ حَدَّثَنَا حَبَّانُ بْنُ هِلَالٍ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَجَمَ وَأَعْطَى الْحَجَّامَ أَجْرَهُ وَاسْتَعَطَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13313,
                "hadithNumber": "5750",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) got himself cupped and never withheld the wages of anyone.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے پچھنے بھی لگوائے ، آپ کسی کی اجرت کےمعاملے میں کسی پر زرہ برابر ظلم نہیں کرتے تھے ( بلکہ زیادہ عطافرماتے تھے ۔ )",
                "urduNarrator": "اور ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، کہا کہ ابوبکر نے کہا کہ ہم سے وکیع نے بیان کیا اور ابو کریب نے کہا اور تلفظ یہ ہے کہ وکیع نے بیان کیا۔ قیمت کے بارے میں عمر و بن عامر انصاری نے کہا : میں نے حضرت انس بن مالک رضی اللہ عنہ سے سنا ، آپ کہہ رہے تھے",
                "hadithArabic": "و حَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَ أَبُو بَكْرٍ حَدَّثَنَا وَكِيعٌ و قَالَ أَبُو كُرَيْبٍ وَاللَّفْظُ لَهُ أَخْبَرَنَا وَكِيعٌ عَنْ مِسْعَرٍ عَنْ عَمْرِو بْنِ عَامِرٍ الْأَنْصَارِيِّ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُ احْتَجَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَ لَا يَظْلِمُ أَحَدًا أَجْرَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 13001,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=520",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=518",
                "label": "518",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=519",
                "label": "519",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=520",
                "label": "520",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=521",
                "label": "521",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=522",
                "label": "522",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=523",
                "label": "523",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=524",
                "label": "524",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=522",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=522",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=520",
        "to": 13025,
        "total": 40465
    }
}