{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 542,
        "data": [
            {
                "id": 13814,
                "hadithNumber": "6251",
                "englishNarrator": "Urwa reported:",
                "hadithEnglish": "'Aisha رضی اللہ عنہا said to me: Your fathers (Zubair and Abu Bakr) were amongst those about whom (it has been revealed): Those who responded to the call of Allah and His Messenger ﷺ after the misfortune had fallen upon them.",
                "hadithUrdu": "حضرت عائشہ رضی اللہ عنہا نے مجھ سے فرمایا : \" تمھا رے دونوں والد ان لوگوں میں سے تھے جنھوں نے زخم کھا نے کے بعد بھی اللہ اور اس کے رسول اللہ صلی اللہ علیہ وسلم کے بلا وے پر لبیک کہا ۔",
                "urduNarrator": "ہم سے ابو کریب محمد بن علاء نے بیان کیا، کہا ہم سے وکیع نے بیان کیا، کہا ہم سے اسماعیل نے بیان کیا, بہی نے عروہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا إِسْمَاعِيلُ، عَنِ الْبَهِيِّ، عَنْ عُرْوَةَ، قَالَ: قَالَتْ لِي عَائِشَةُ: «كَانَ أَبَوَاكَ مِنَ الَّذِينَ اسْتَجَابُوا لِلَّهِ وَالرَّسُولِ مِنْ بَعْدِ مَا أَصَابَهُمُ الْقَرْحُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13815,
                "hadithNumber": "6252",
                "englishNarrator": "Anas رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: For every Umma there is a man of trust and the man of trust of this Umma is Abu 'Ubaida bin Jarrah رضی اللہ عنہ .",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" ہر امت کا ایک امین ہو تا ہے اور اے امت! ہمارے امین ابو عبیدہ ابن الجراح رضی اللہ تعالیٰ عنہ ہیں ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے اسماعیل بن الیہ نے بیان کیا، ان سے خالد نے بیان کیا، مجھ سے زہیر بن حرب نے بیان کیا، ہم سے اسماعیل بن عالیہ نے بیان کیا۔ عالیہ، خالد نے ہم سے بیان کیا، ابو قلابہ کی سند سے، انہوں نے کہا :حضرت انس رضی اللہ عنہ نے کہا : کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ خَالِدٍ، ح وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، أَخْبَرَنَا خَالِدٌ، عَنْ أَبِي قِلَابَةَ، قَالَ: قَالَ أَنَسٌ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ لِكُلِّ أُمَّةٍ أَمِينًا. وَإِنَّ أَمِينَنَا، أَيَّتُهَا الْأُمَّةُ أَبُو عُبَيْدَةَ بْنُ الْجَرَّاحِ».",
                "headingArabic": "ابو عبیدہ بن الجراح رضی اللہ عنہ کے فضائل",
                "headingUrdu": "ابو عبیدہ بن الجراح رضی اللہ عنہ کے فضائل",
                "headingEnglish": "The Virtues Of Abu 'Ubaidah Bin Al-Jarrah (RA)",
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13816,
                "hadithNumber": "6253",
                "englishNarrator": "Anas رضی اللہ عنہ reported:",
                "hadithEnglish": "The people of Yemen came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: Send with us a person who should teach us Sunnah and al-Islam, whereupon he (the Holy Prophet) caught hold of the hand of Ubaida رضی اللہ عنہ and said: He is a man of trust of this Umma.",
                "hadithUrdu": "یمن کے لوگ رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے ، انھوں نے کہا : ہمارے ساتھ ایک شخص بھیجیے جو ہمیں سنت اور اسلام کی تعلیم دے ( حضرت انس رضی اللہ عنہ نے ) کہا : تو آپ صلی اللہ علیہ وسلم نے حضرت ابو عبیدہ رضی اللہ عنہ کا ہاتھ پکڑ کر فر ما یا : یہ اس امت کے امین ہیں ۔ \"",
                "urduNarrator": "مجھ سے عمرو الناقد نے بیان کیا، ہم سے عفان نے بیان کیا، ہم سے حماد نے جو ابن سلمہ ہیں، بیان کیا, ثابت نے حضرت انس رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي عَمْرٌو النَّاقِدُ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادٌ وَهُوَ ابْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، أَنَّ أَهْلَ الْيَمَنِ قَدِمُوا عَلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا: ابْعَثْ مَعَنَا رَجُلًا يُعَلِّمْنَا السُّنَّةَ وَالْإِسْلَامَ قَالَ فَأَخَذَ بِيَدِ أَبِي عُبَيْدَةَ فَقَالَ: «هَذَا أَمِينُ هَذِهِ الْأُمَّةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13817,
                "hadithNumber": "6254",
                "englishNarrator": "Hudhaifa رضی اللہ عنہ reported:",
                "hadithEnglish": "The people of Najran came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and said: Allah's Messenger ﷺ, send along with us a man of trust; whereupon he said: I would definitely send to you a man of trust, a man of trust in the true sense of the term. Thereupon his Companions looked up eagerly and he sent Abu Ubaida bin Jarrah رضی اللہ عنہ .",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے پاس اہل نجران آئے اور کہنے لگے ۔ اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! ہمارے پاس ایک امین شخص بھیجیے ۔ آپ نے فر ما یا : میں تمھا رے پاس ایسا شخص بھیجوں گا جو ایسا امین ہے جس طرح امین ہو نے کا حق ہے ۔ لو گوں نے اس بات پراپنی نگا ہیں اٹھا ئیں ( کہ اس کا مصداق کو ن ہے ) کہا : تو رسول اللہ صلی اللہ علیہ وسلم نے ابو عبیدہ بن جراح رضی اللہ تعالیٰ عنہ کو روانہ فرما یا ۔",
                "urduNarrator": "ہم سے محمد بن المثنیٰ اور ابن بشار نے بیان کیا - اور یہ لفظ ابن المثنیٰ کا ہے - انہوں نے کہا: ہم سے محمد بن جعفر نے بیان کیا، شعبہ نے کہا : میں نے ابو اسحٰق کو صلہ بن زفر سے حدیث بیان کرتے ہو ئے سنا ، انھوں نے حضرت حذیفہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ - وَاللَّفْظُ لِابْنِ الْمُثَنَّى - قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ: سَمِعْتُ أَبَا إِسْحَاقَ يُحَدِّثُ عَنْ صِلَةَ بْنِ زُفَرَ، عَنْ حُذَيْفَةَ، قَالَ: جَاءَ أَهْلُ نَجْرَانَ إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا: يَا رَسُولَ اللهِ ابْعَثْ إِلَيْنَا رَجُلًا أَمِينًا فَقَالَ: «لَأَبْعَثَنَّ إِلَيْكُمْ رَجُلًا أَمِينًا حَقَّ أَمِينٍ حَقَّ أَمِينٍ»، قَالَ فَاسْتَشْرَفَ لَهَا النَّاسُ قَالَ فَبَعَثَ أَبَا عُبَيْدَةَ بْنَ الْجَرَّاحِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13818,
                "hadithNumber": "6255",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been reported on the authority of Abu Ishaq with the same chain of transmitters.",
                "hadithUrdu": "ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے ابوداؤد الحفری نے بیان کیا, سفیان نے ابو اسحٰق سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا أَبُو دَاوُدَ الْحَفَرِيُّ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي إِسْحَاقَ بِهَذَا الْإِسْنَادِ نَحْوَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13819,
                "hadithNumber": "6256",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying to Hasan رضی اللہ عنہ : O Allah, behold, I love him. Thou too love him and love one who loves him.",
                "hadithUrdu": "آ پ صلی اللہ علیہ وسلم نے حضرت حسن رضی اللہ تعالیٰ عنہ کے متعلق فرمایا : \" اے اللہ! میں اس سے محبت کرتاہوں ، تو ( بھی ) اس سے محبت فرما اور جو اس سے محبت کرے ، اس سے ( بھی ) محبت فرما ۔ \"",
                "urduNarrator": "احمد بن حنبل نے کہا , ہمیں سفیان بن عیینہ نے حدیث بیان کی ، کہا : مجھے عبیداللہ بن ابی یزید نے نافع بن جبیر سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، حَدَّثَنِي عُبَيْدُ اللهِ بْنُ أَبِي يَزِيدَ، عَنْ نَافِعِ بْنِ جُبَيْرٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، أَنَّهُ قَالَ لِحَسَنٍ: «اللهُمَّ إِنِّي أُحِبُّهُ فَأَحِبَّهُ وَأَحْبِبْ مَنْ يُحِبُّهُ».",
                "headingArabic": "فَضَائِلِ الْحَسَنِ وَالْحُسَيْنِ رضى الله عنهما ‏‏",
                "headingUrdu": "حسن و حسین رضی اللہ عنہ کے فضائل",
                "headingEnglish": "The Virtues Of Al-Hasan And Al-Husain (RA)",
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13820,
                "hadithNumber": "6257",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "I went along with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) at a time during the day but he did not talk to me and I did not talk to him until he reached the market of Bani Qainuqa`. He came back to the tent of Fatima رضی اللہ عنہا and said: Is the little chap (meaning Hasan رضی اللہ عنہ) there? We were under the impression that his mother had detained him in order to bathe him and dress him and garland him with a sweet garland. Not much time had passed that he (Hasan رضی اللہ عنہ) came running until both of them embraced each other, thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: O Allah, I love him; love him Thou and love one who loves him (Hasan رضی اللہ عنہ).",
                "hadithUrdu": "میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ دن کو ایک وقت میں نکلا ، کہ نہ آپ صلی اللہ علیہ وسلم مجھ سے بات کرتے تھے اور نہ میں آپ صلی اللہ علیہ وسلم سے بات کرتا تھا ( یعنی خاموش چلے جاتے تھے ) یہاں تک کہ بنی قینقاع کے بازار میں پہنچے ۔ پھر آپ صلی اللہ علیہ وسلم لوٹے اور سیدہ فاطمۃالزہراء رضی اللہ عنہا کے گھر پر آئے اور پوچھا کہ بچہ ہے؟ بچہ ہے؟ یعنی سیدنا حسن رضی اللہ عنہ کا پوچھ رہے تھے ۔ ہم سمجھے کہ ان کی ماں نے ان کو روک رکھا ہے نہلانے دھلانے اور خوشبو کا ہار پہنانے کے لئے ، لیکن تھوڑی ہی دیر میں وہ دوڑتے ہوئے آئے اور دونوں ایک دوسرے سے گلے ملے ( یعنی رسول اللہ صلی اللہ علیہ وسلم اور سیدنا حسن رضی اللہ عنہ ) پھر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اے اللہ! میں اس سے محبت کرتا ہوں تو بھی اس سے محبت رکھ اور اس شخص سے محبت کر جو اس سے محبت کرے ۔",
                "urduNarrator": "ابن ابی عمر نے کہا : ہمیں سفیان نے عبیداللہ بن ابی یزید سے ، انھوں نے نافع بن جبیر بن معطم سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی ، سیدنا ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ عُبَيْدِ اللهِ بْنِ أَبِي يَزِيدَ، عَنْ نَافِعِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: خَرَجْتُ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي طَائِفَةٍ مِنَ النَّهَارِ، لَا يُكَلِّمُنِي وَلَا أُكَلِّمُهُ، حَتَّى جَاءَ سُوقَ بَنِي قَيْنُقَاعَ، ثُمَّ انْصَرَفَ، حَتَّى أَتَى خِبَاءَ فَاطِمَةَ فَقَالَ: «أَثَمَّ لُكَعُ؟ أَثَمَّ لُكَعُ؟» يَعْنِي حَسَنًا فَظَنَنَّا أَنَّهُ إِنَّمَا تَحْبِسُهُ أُمُّهُ لِأَنْ تُغَسِّلَهُ وَتُلْبِسَهُ سِخَابًا، فَلَمْ يَلْبَثْ أَنْ جَاءَ يَسْعَى، حَتَّى اعْتَنَقَ كُلُّ وَاحِدٍ مِنْهُمَا صَاحِبَهُ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «اللهُمَّ إِنِّي أُحِبُّهُ، فَأَحِبَّهُ وَأَحْبِبْ مَنْ يُحِبُّهُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13821,
                "hadithNumber": "6258",
                "englishNarrator": "Al-Bara' bin Azib رضی اللہ عنہ reported:",
                "hadithEnglish": "I saw Hasan bin 'Ali رضی اللہ عنہ upon the shoulders of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and he was saying: O Allah, I love him, and love him Thou.",
                "hadithUrdu": "میں نے حضرت حسن بن علی رضی اللہ عنہ کو رسول اللہ صلی اللہ علیہ وسلم کے کندھے پر دیکھا ، اور آپ فرمارہے تھے : \" اے اللہ! میں اس سے محبت کرتا ہوں تو بھی اس سے محبت فرما ۔ \"",
                "urduNarrator": "عبیداللہ کے والد معاذ نے کہا : ہمیں شعبہ نے عدی بن ثابت سے حدیث بیان کی ، انھوں نے کہا : ہمیں حضرت براء بن عازب رضی اللہ تعالیٰ عنہ نے حدیث بیان کی ، کہا",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيٍّ وَهُوَ ابْنُ ثَابِتٍ، حَدَّثَنَا الْبَرَاءُ بْنُ عَازِبٍ، قَالَ: رَأَيْتُ الْحَسَنَ بْنَ عَلِيٍّ عَلَى عَاتِقِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَهُوَ يَقُولُ: «اللهُمَّ إِنِّي أُحِبُّهُ فَأَحِبَّهُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13822,
                "hadithNumber": "6259",
                "englishNarrator": "Al-Bara' bin Azib رضی اللہ عنہ reported:",
                "hadithEnglish": "I saw the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) with Al-Hasan bin 'Ali رضی اللہ عنہ placed upon his shoulders and he was saying: O Allah, I love him, and love him Thou.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ آپ نے حضرت حسن بن علی رضی اللہ تعالیٰ عنہ کو اپنے کندھے پر بٹھا رکھا تھا اور فرمارہے تھے : \" اے اللہ! میں اس سے محبت کرتا ہوں ، تو بھی اس سے محبت فرما ۔ \"",
                "urduNarrator": "ہم سے محمد بن بشار اور ابوبکر بن نافع نے بیان کیا، کہا: ابن نافع,  ( محمد بن جعفر ) غندر نے کہا : ہمیں شعبہ نے عدی بن ثابت سے حدیث بیان کی ، انھوں نے حضرت براء رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، وَأَبُو بَكْرِ بْنُ نَافِعٍ، قَالَ: ابْنُ نَافِعٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيٍّ وَهُوَ ابْنُ ثَابِتٍ، عَنِ الْبَرَاءِ، قَالَ: رَأَيْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَاضِعًا الْحَسَنَ بْنَ عَلِيٍّ عَلَى عَاتِقِهِ، وَهُوَ يَقُولُ: «اللهُمَّ إِنِّي أُحِبُّهُ فَأَحِبَّهُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13823,
                "hadithNumber": "6260",
                "englishNarrator": "Iyas reported on the authority of his father:",
                "hadithEnglish": "I (had the honour of) leading the white mule on which rode Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and with him were Hasan and Husain, till it reached the apartment of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). The one amongst them was seated before him and the other one was seated behind him.",
                "hadithUrdu": "میں نبی کریم صلی اللہ علیہ وسلم اور حضرت حسن اور حسین رضوان للہ عنھم اجمعین کو آپ کے سفید خچر پر بٹھا کر اس کی باگ پکڑ کر چلا ، یہاں تک کہ انھیں نبی کریم صلی اللہ علیہ وسلم کے گھر میں لے گیا ۔ یہ ( ایک بچہ ) آپ کے آگے بیٹھ گیا اور وہ ( دوسرا بچہ ) آپ کے پیچھے بیٹھ گیا ۔",
                "urduNarrator": "مجھ سے عبداللہ بن الرومی الیمیمی نے بیان کیا، اور ہم سے عباس بن عبدالعظیم الاعنبر ی نے بیان کیا، کہا: ہم سے نضر بن محمد نے بیان کیا، ہم سے عکرمہ نے بیان کیا، اور وہ ابن عمار، ہمیں ایاس نے اپنے والد سے حدیث سنائی ، کہا",
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللهِ بْنُ الرُّومِيُّ الْيَمَامِيُّ، وَعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ، قَالَا: حَدَّثَنَا النَّضْرُ بْنُ مُحَمَّدٍ، حَدَّثَنَا عِكْرِمَةُ وَهُوَ ابْنُ عَمَّارٍ، حَدَّثَنَا إِيَاسٌ، عَنْ أَبِيهِ، قَالَ: «لَقَدْ قُدْتُ بِنَبِيِّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَالْحَسَنِ وَالْحُسَيْنِ، بَغْلَتَهُ الشَّهْبَاءَ، حَتَّى أَدْخَلْتُهُمْ حُجْرَةَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ هَذَا قُدَّامَهُ وَهَذَا خَلْفَهُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13824,
                "hadithNumber": "6261",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) went out one morning wearing a striped cloak of the black camel's hair that there came Hasan bin 'Ali رضی اللہ عنہ . He wrapped hitn under it, then came Husain رضی اللہ عنہ and he wrapped him under it along with the other one (Hasan). Then came Fatima رضی اللہ عنہا and he took her under it, then came 'Ali رضی اللہ عنہ and he also took him under it and then said: Allah only desires to take away any uncleanliness from you, O people of the household, and purify you (thorough purifying)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم صبح کو نکلے اور آپ صلی اللہ علیہ وسلم ایک چادر اوڑھے ہوئے تھے جس پر کجاووں کی صورتیں یا ہانڈیوں کی صورتیں بنی ہوئی تھیں ۔ اتنے میں سیدنا حسن رضی اللہ عنہ آئے تو آپ صلی اللہ علیہ وسلم نے ان کو اس چادر کے اندر کر لیا ۔ پھر سیدنا حسین رضی اللہ عنہ آئے تو ان کو بھی اس میں داخل کر لیا ۔ پھر سیدہ فاطمۃالزہراء رضی اللہ عنہا آئیں تو ان کو بھی انہی کے ساتھ شامل کر لیا پھر سیدنا علی رضی اللہ عنہ آئے تو ان کو بھی شامل کر کے فرمایا کہ ”اللہ تعالیٰ چاہتا ہے کہ تم سے ناپاکی کو دور کرے اور تم کو پاک کرے اے گھر والو ۔ ( الاحزاب : 33 ) ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور محمد بن عبداللہ بن نمیر نے بیان کیا - اور یہ لفظ ابوبکر کا ہے - انہوں نے کہا : ہم سے محمد بن بشر نے بیان کیا ، ان سے زکریا، مصعب بن شیبہ کی سند سے، صفیہ بنت شیبہ کی سند سے، انہوں نے کہا:  ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا کہتی ہیں کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ - وَاللَّفْظُ لِأَبِي بَكْرٍ - قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، عَنْ زَكَرِيَّاءَ، عَنْ مُصْعَبِ بْنِ شَيْبَةَ، عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ، قَالَتْ: قَالَتْ عَائِشَةُ: خَرَجَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ غَدَاةً وَعَلَيْهِ مِرْطٌ مُرَحَّلٌ، مِنْ شَعْرٍ أَسْوَدَ، فَجَاءَ الْحَسَنُ بْنُ عَلِيٍّ فَأَدْخَلَهُ، ثُمَّ جَاءَ الْحُسَيْنُ فَدَخَلَ مَعَهُ، ثُمَّ جَاءَتْ فَاطِمَةُ فَأَدْخَلَهَا، ثُمَّ جَاءَ عَلِيٌّ فَأَدْخَلَهُ، ثُمَّ قَالَ: {إِنَّمَا يُرِيدُ اللهُ لِيُذْهِبَ عَنْكُمُ الرِّجْسَ أَهْلَ الْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيرًا} [الأحزاب: 33].",
                "headingArabic": "اہل بیت کے فضائل",
                "headingUrdu": "خاندانِ نبوی کے فضائل",
                "headingEnglish": "The Virtues Of The Household Of The Prophet (SAW)",
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13825,
                "hadithNumber": "6262",
                "englishNarrator": "Salim bin 'Abdullah reported on the authority of his father:",
                "hadithEnglish": "We were in the habit of calling Zaid bin Harith رضی اللہ عنہ as Zaid bin Muhammad until it was revealed in the Qur'an: Call them by the names of their fathers. This is more equitable with Allah (This hadith has been transmitted on the authority of Qutaiba bin Sa'd)",
                "hadithUrdu": "ہم زید بن حارثہ رضی اللہ عنہ کو زید بن محمد صلی اللہ علیہ وسلم کے سوا اورکسی نام سے نہیں پکارتے تھے ، یہاں تک کہ قرآن میں یہ آیت نازل ہوئی؛ \"\" ان ( متنبیٰ ) کو ان کے اپنے باپوں کی نسبت سے پکارو ، اللہ کے نزدیک یہی زیادہ انصاف کی بات ہے ۔ \"\" ( اس کتاب کے ایک راوی ) شیخ ابو احمد محمد بن عیسیٰ ( نیشار پوری ) نے کہا : ہمیں ابو عباس سراج اور محمد بن عبداللہ بن یوسف دویری نے بیان کیا ، کہا : ہمیں بھی ( امام مسلم رحمۃ اللہ علیہ کے استاد ) قتیبہ بن سعید نے یہ حدیث بیان کی ( یعنی اس کتاب کے راوی نے یہ حدیث امام مسلم کے علاوہ قتیبہ سے ان کے دو اور شاگردوں کے حوالے سے بھی سنی ۔ )",
                "urduNarrator": "قتیبہ بن سعید نے ہمیں حدیث بیان کی ، کہا : ہمیں یعقوب بن عبدالرحمن القاری نے موسیٰ بن عقبہ سے حدیث بیان کی ، انھوں نے سالم بن عبداللہ ( بن عمر ) سے ، انھوں نے اپنے والد سے روایت کی کہ وہ کہا کرتے تھے",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ الْقَارِيُّ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ سَالِمِ بْنِ عَبْدِ اللهِ، عَنْ أَبِيهِ، أَنَّهُ كَانَ يَقُولُ: مَا كُنَّا نَدْعُو زَيْدَ بْنَ حَارِثَةَ إِلَّا زَيْدَ بْنَ مُحَمَّدٍ حَتَّى نَزَلَ فِي الْقُرْآنِ {ادْعُوهُمْ لِآبَائِهِمْ هُوَ أَقْسَطُ عِنْدَ اللهِ} [الأحزاب: 5] قَالَ الشَّيْخُ أَبُو أَحْمَدَ مُحَمَّدُ بْنُ عِيسَى: أَخْبَرَنَا أَبُو الْعَبَّاسِ السَّرَّاجُ، وَمُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ يُوسُفَ الدُّوَيْرِيُّ، قَالَا: حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، بِهَذَا الْحَدِيثِ.",
                "headingArabic": "فَضَائِلِ زَيْدِ بْنِ حَارِثَةَ وَأُسَامَةَ بْنِ زَيْدٍ رَضِيَ اللَّهُ عَنْهُمَا ‏‏",
                "headingUrdu": "زید بن حارثہ اور ان کے بیٹے اسامہ رضی اللہ عنہ کے فضائل",
                "headingEnglish": "The Virtues Of Zaid Bin Harithah And His Son Usamah (RA)",
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13826,
                "hadithNumber": "6263",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority 'Abdullah رضی اللہ عنہ through another chain of transmitters.",
                "hadithUrdu": "مجھ سے احمد بن سعید دارمی نے بیان کیا، کہا ہم سے حبان نے بیان کیا, وہیب نے کہا , موسیٰ بن عقبہ نےہمیں حدیث بیان کی ، کہا : مجھے سالم نے عبداللہ رضی اللہ عنہ سے اسی سند کے مانند حدیث بیان کی ، ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنِي أَحْمَدُ بْنُ سَعِيدٍ الدَّارِمِيُّ، حَدَّثَنَا حَبَّانُ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، حَدَّثَنِي سَالِمٌ، عَنْ عَبْدِ اللهِ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13827,
                "hadithNumber": "6264",
                "englishNarrator": "Ibn 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sent an expedition and appointed Usama bin Zaid رضی اللہ عنہ as its chief. The people objected to his command, whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) stood up and said: You object to his command and before this you objected to the command of his father (Zaid). By Allah, he was fit as the commander and he was one of the dearest of persons to me and after him, behold! this one (Usama) is one of the dearest of persons to me.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ایک لشکر بھیجا اور اُسامہ بن زید کو اس کا امیر مقرر فرمایا ۔ کچھ لوگوں نے ان کی امارت پر اعتراض کیا تو رسول اللہ صلی اللہ علیہ وسلم ( خطبہ دینے کے لئے ) کھڑے ہوئے اور فرمایا : \" تم نےاگر اس ( اسامہ رضی اللہ عنہ ) کی امارت پر اعتراض کیا ہےتواس سے پہلے اس کے والد کی امارت پر بھی اعتراض کرتے تھے ۔ اللہ کی قسم! وہ بھی امارت کا اہل تھا اور بلاشبہ میرے محبوب ترین لوگوں میں سے تھا اور ا س کے بعد بلاشبہ یہ ( بھی ) میرے محبوب ترین لوگوں میں سے ہے ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ، یحییٰ بن ایوب، قتیبہ اور ابن حجر نے بیان کیا، انہوں نے کہا: ہم سے یحییٰ بن یحییٰ نے بیان کیا اور دوسرے لوگوں نے کہا: اس نے ہم سے کہا کہ اسماعیل سے مراد ابن جعفر ہے,عبداللہ بن دینار سے روایت ہے ، انھوں نے حضرت ابن عمر رضی اللہ عنہ سے سنا ، کہہ رہے تھے",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَيَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ حُجْرٍ - قَالَ: يَحْيَى بْنُ يَحْيَى: أَخْبَرَنَا وقَالَ الْآخَرُونَ: حَدَّثَنَا - إِسْمَاعِيلُ يَعْنُونَ ابْنَ جَعْفَرٍ، عَنْ عَبْدِ اللهِ بْنِ دِينَارٍ، أَنَّهُ سَمِعَ ابْنَ عُمَرَ، يَقُولُ: بَعَثَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَعْثًا، وَأَمَّرَ عَلَيْهِمْ أُسَامَةَ بْنَ زَيْدٍ، فَطَعَنَ النَّاسُ فِي إِمْرَتِهِ، فَقَامَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «إِنْ تَطْعَنُوا فِي إِمْرَتِهِ، فَقَدْ كُنْتُمْ تَطْعَنُونَ فِي إِمْرَةِ أَبِيهِ مِنْ قَبْلُ، وَايْمُ اللهِ إِنْ كَانَ لَخَلِيقًا لِلْإِمْرَةِ، وَإِنْ كَانَ لَمِنْ أَحَبِّ النَّاسِ إِلَيَّ، وَإِنَّ هَذَا لَمِنْ أَحَبِّ النَّاسِ إِلَيَّ بَعْدَهُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13828,
                "hadithNumber": "6265",
                "englishNarrator": "Salim reported on the authority of his father:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said on the pulpit: You object to the command of Usima bin Zaid as you had objected before to the command of his father (Zaid). By Allah, he was most competent for it and, by Allah, he was dearest to me amongst people and, by Allah, the same is the case with Usama b. Zaid. He is most dear to me after him and I advise you to treat him well for he is pious amongst you.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اور ( اس وقت ) آپ منبر پر تھے : \" اگر تم اسکی امارت پر اعتراض کررہے ہو آپ کی مراد حضرت اُسامہ بن زید سے تھی ۔ تو اس سے پہلے تم اس کے باپ کی امارت پر ( بھی ) اعتراض کرچکے ہو ۔ اللہ کی قسم!اس کے بعد یہ بھی مجھے سب لوگوں سے زیادہ محبوب ہے ۔ میں تمھیں اس کے ساتھ ہر طرح کی اچھائی کی وصیت کرتا ہوں کیونکہ یہ تمھارے نیک ترین لوگوں میں سے ہے ۔ \"",
                "urduNarrator": "ہم سے ابو کریب محمد بن العلا نے بیان کیا، کہا ہم سے ابو اسامہ نے بیان کیا، عمر رضی اللہ عنہ سے، یعنی ابن حمزہ رضی اللہ عنہ نے, سالم نے اپنے والد ( حضرت ابن عمر رضی اللہ عنہ ) سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ عُمَرَ يَعْنِي ابْنَ حَمْزَةَ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ وَهُوَ عَلَى الْمِنْبَرِ: «إِنْ تَطْعَنُوا فِي إِمَارَتِهِ - يُرِيدُ أُسَامَةَ بْنَ زَيْدٍ - فَقَدْ طَعَنْتُمْ فِي إِمَارَةِ أَبِيهِ مِنْ قَبْلِهِ، وَايْمُ اللهِ إِنْ كَانَ لَخَلِيقًا لَهَا، وَايْمُ اللهِ إِنْ كَانَ لَأَحَبَّ النَّاسِ إِلَيَّ، وَايْمُ اللهِ إِنَّ هَذَا لَهَا لَخَلِيقٌ - يُرِيدُ أُسَامَةَ بْنَ زَيْدٍ - وَايْمُ اللهِ إِنْ كَانَ لَأَحَبَّهُمْ إِلَيَّ مِنْ بَعْدِهِ، فَأُوصِيكُمْ بِهِ فَإِنَّهُ مِنْ صَالِحِيكُمْ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13829,
                "hadithNumber": "6266",
                "englishNarrator": "Abdullah bin Abu Mulaika reported:",
                "hadithEnglish": "Abdullah bin Jafar رضی اللہ عنہ said to Ibn Zubair رضی اللہ عنہ : Do you remember (the occasion) when we three (i.e. I, you and lbn 'Abbas رضی اللہ عنہ ) met Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and he mounted us (on his camel) but left you? He said: Yes.",
                "hadithUrdu": "حضرت عبداللہ بن جعفر رضی اللہ عنہ نے حضرت ابن زبیر رضی اللہ تعالیٰ عنہ سے کہا : تمھیں یاد ہے جب ہم ، میں ، تم اور ابن عباس رضی اللہ تعالیٰ عنہ رسول اللہ صلی اللہ علیہ وسلم کو ملے تھے؟انھوں نے کہا : ہاں ، ( کہا : ) تو آپ نے ہمیں سوار کرلیا تھا اور ( جگہ نہ ہونے کی بناء پر ) تمھیں چھوڑ دیاتھا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, اسماعیل بن علیہ نے حبیب بن شہید سے ، انھوں نے عبداللہ بن ابی ملیکہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ حَبِيبِ بْنِ الشَّهِيدِ، عَنْ عَبْدِ اللهِ بْنِ أَبِي مُلَيْكَةَ، قَالَ عَبْدُ اللهِ بْنُ جَعْفَرٍ، لِابْنِ الزُّبَيْرِ: أَتَذْكُرُ إِذْ تَلَقَّيْنَا رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَا وَأَنْتَ وَابْنُ عَبَّاسٍ؟ قَالَ: نَعَمْ «فَحَمَلَنَا، وَتَرَكَكَ».",
                "headingArabic": "فَضَائِلِ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ رضى الله عنهما ‏‏",
                "headingUrdu": "عبداللہ بن جعفر رضی اللہ عنہ کے فضائل",
                "headingEnglish": "The Virtues Of Abdullah Bin Ja'far (RA)",
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13830,
                "hadithNumber": "6267",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been transmitted on the authority of Habib bin Ash-Shahid.",
                "hadithUrdu": "ہم سے اسحاق بن ابراہیم نے بیان کیا, ابو اسامہ نے حبیب بن شہید سے ابن علیہ کی حدیث کے مانند اور اسی کی سند سے حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا أَبُو أُسَامَةَ، عَنْ حَبِيبِ بْنِ الشَّهِيدِ، بِمِثْلِ حَدِيثِ ابْنِ عُلَيَّةَ وَإِسْنَادِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13831,
                "hadithNumber": "6268",
                "englishNarrator": "Abdullah bin Ja'far رضی اللہ عنہ reported:",
                "hadithEnglish": "When Allah's Messenger (ﷺ) came back from a journey, the children of his family used to accord him welcome. It was in this way that once he came back from a journey and I went to him first of all. He mounted me before him. Then there came one of the two sons of Fatima رضی اللہ عنہا and he mounted him behind him and this is how we three entered Medina riding on a beast.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم جب کسی سفر سے آتے تو آپ کے گھر کے بچوں کو ( باہر لے جاکر ) آپ سے ملایا جاتا ، ایک بار آپ سفر سے آئے ، مجھے سب سے پہلے آپ کے پاس پہنچا دیاگیا تو آپ صلی اللہ علیہ وسلم نے مجھے اپنے سامنے بٹھا دیا ، پھر حضرت فاطمہ رضی اللہ عنہا کے ایک صاحبزادے کو لایا گیا تو انھیں آ پ صلی اللہ علیہ وسلم نے پیچھے بٹھا لیا ۔ کہا : تو ہم تینوں کو ایک سواری پر مدینہ کے اندر لایا گیا ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ اور ابوبکر بن ابی شیبہ نے بیان کیا اور ہم سے یحییٰ نے بیان کیا تو انہوں نے کہا: یحییٰ ابو معاویہ نے عاصم احول سے ، انھوں نے مورق عجلی سے ، انھوں نے حضرت عبداللہ بن جعفررضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ - وَاللَّفْظُ لِيَحْيَى قَالَ أَبُو بَكْرٍ حَدَّثَنَا وقَالَ يَحْيَى: أَخْبَرَنَا - أَبُو مُعَاوِيَةَ، عَنْ عَاصِمٍ الْأَحْوَلِ، عَنْ مُوَرِّقٍ الْعِجْلِيِّ، عَنْ عَبْدِ اللهِ بْنِ جَعْفَرٍ، قَالَ: كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِذَا قَدِمَ مِنْ سَفَرٍ تُلُقِّيَ بِصِبْيَانِ أَهْلِ بَيْتِهِ، قَالَ: وَإِنَّهُ قَدِمَ مِنْ سَفَرٍ فَسُبِقَ بِي إِلَيْهِ، فَحَمَلَنِي بَيْنَ يَدَيْهِ، ثُمَّ جِيءَ بِأَحَدِ ابْنَيْ فَاطِمَةَ، فَأَرْدَفَهُ خَلْفَهُ، قَالَ: فَأُدْخِلْنَا الْمَدِينَةَ، ثَلَاثَةً عَلَى دَابَّةٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13832,
                "hadithNumber": "6269",
                "englishNarrator": "Abdullah bin Ja'a'far رضی اللہ عنہ reported:",
                "hadithEnglish": "When Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came back from a journey he met us. Once he met me, Hasan or Husain, and he mounted one of us before him and the other one behind him until we entered Medina.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم جب سفر سے آتے تو ہمیں ( آپ کی محبت میں ) آگے لے جاکر آپ سے ملایا جاتا ، کہا : مجھے اور حسن یا حسین رضوان اللہ عنھم اجمعین کو آپ کے پاس آگے لے جایا گیا تو آپ صلی اللہ علیہ وسلم نے ہم میں سے ایک کو ا پنے آگے اور ایک کو اپنے پیچھے سوار کرلیا ، یہاں تک کہ ہم ( اسی طرح ) مدینہ میں داخل ہوئے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, عبدالرحیم بن سلیمان نے عاصم سے روایت کی ، کہا : مجھے مورق عجلی نے حدیث بیان کی ، کہا : مجھے حضرت عبداللہ بن جعفر رضی اللہ عنہ نے حدیث سنائی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ، عَنْ عَاصِمٍ، حَدَّثَنِي مُوَرِّقٌ، حَدَّثَنِي عَبْدُ اللهِ بْنُ جَعْفَرٍ، قَالَ: كَانَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، «إِذَا قَدِمَ مِنْ سَفَرٍ تُلُقِّيَ بِنَا قَالَ فَتُلُقِّيَ بِي وَبِالْحَسَنِ أَوْ بِالْحُسَيْنِ» قَالَ: «فَحَمَلَ أَحَدَنَا بَيْنَ يَدَيْهِ وَالْآخَرَ خَلْفَهُ حَتَّى دَخَلْنَا الْمَدِينَةَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13833,
                "hadithNumber": "6270",
                "englishNarrator": "Abdullah bin Ja'far رضی اللہ عنہ reported:",
                "hadithEnglish": "One day Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) mounted me behind him and narrated to me something in secret which I would narrate to none amongst people.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ایک دن مجھے سواری پر اپنے پیچھے بٹھایا ، پھر مجھے راز داری سے ایک بات بتائی جو میں لوگوں میں سے کسی بھی شخص کو نہیں سناؤں گا ۔",
                "urduNarrator": "ہم سے شیبان بن فروخ نے بیان کیا، ہم سے مہدی بن میمون نے بیان کیا، ہم سے محمد بن عبداللہ بن ابی یعقوب نے بیان کیا، حسن بن سعد کی سند سے, حضرت حسن بن علی رضی اللہ عنہ کے آزاد کردہ غلام حسن بن سعد نے حضرت عبداللہ بن جعفر رضی اللہ عنہ سے ر وایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا مَهْدِيُّ بْنُ مَيْمُونٍ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ أَبِي يَعْقُوبَ، عَنِ الْحَسَنِ بْنِ سَعْدٍ، مَوْلَى الْحَسَنِ بْنِ عَلِيٍّ، عَنْ عَبْدِ اللهِ بْنِ جَعْفَرٍ، قَالَ: «أَرْدَفَنِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، ذَاتَ يَوْمٍ خَلْفَهُ، فَأَسَرَّ إِلَيَّ حَدِيثًا لَا أُحَدِّثُ بِهِ أَحَدًا مِنَ النَّاسِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13834,
                "hadithNumber": "6271",
                "englishNarrator": "`Abdullah bin Ja`far رضی اللہ عنہ reported:",
                "hadithEnglish": "He heard `Ali رضی اللہ عنہ say in Kufa that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: The best of the women of her time was Mary, daughter of `Imran, and the best of the women of her time was Khadija رضی اللہ عنہا , daughter of Khuwailid رضی اللہ عنہا. Abu Kuraib said that Waki` pointed towards the sky and the earth.",
                "hadithUrdu": "میں نے کوفہ میں حضرت علی رضی اللہ عنہ کو یہ کہتے ہوئے سنا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : \"\" ( اپنے دور کی ) تمام عورتوں میں سے بہترین مریم بنت عمران علیہ السلام ہیں اور ( اس دور کی ) تمام عورتوں میں سے بہترین حضرت خدیجہ رضی اللہ عنہا بنت خویلد رضی اللہ عنہا ہیں ۔ \"\" ابو کریب نے کہا : وکیع نے آسمان وزمین کی طرف اشارہ کرکے بتایا ( کہ ان دونوں کے درمیان بہترین خواتین یہ ہیں ۔ )",
                "urduNarrator": "ابوبکر بن ابی شیبہ اور ابوکریب نے ابو اسامہ ، ابن نمیر ، وکیع اور ابو معاویہ سے حدیث بیان کی ۔ اسحاق بن ابراہیم نے کہا : ہمیں عبدہ بن سلیمان نے خبر دی ۔ ان سب نے ہشام بن عروہ سے روایت کی ۔ الفاظ حدیث ابو اسامہ کے ہیں ,  ہشام نے اپنے والد سے روایت کی ، انھوں نےکہا : میں نے عبداللہ بن جعفر رضی اللہ عنہ کو کہتے ہوئے سنا ،",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللهِ بْنُ نُمَيْرٍ، وَأَبُو أُسَامَةَ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، وَابْنُ نُمَيْرٍ وَوَكِيعٌ، وَأَبُو مُعَاوِيَةَ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، كُلُّهُمْ عَنْ هِشَامِ بْنِ عُرْوَةَ - وَاللَّفْظُ حَدِيثُ أَبِي أُسَامَةَ -، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، قَالَ: سَمِعْتُ عَبْدَ اللهِ بْنَ جَعْفَرٍ، يَقُولُ: سَمِعْتُ عَلِيًّا، بِالْكُوفَةِ يَقُولُ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: «خَيْرُ نِسَائِهَا مَرْيَمُ بِنْتُ عِمْرَانَ وَخَيْرُ نِسَائِهَا خَدِيجَةُ بِنْتُ خُوَيْلِدٍ» قَالَ: أَبُو كُرَيْبٍ، وَأَشَارَ وَكِيعٌ إِلَى السَّمَاءِ وَالْأَرْضِ.",
                "headingArabic": "فَضَائِلِ خَدِيجَةَ أُمِّ الْمُؤْمِنِينَ رضى الله تعالى عنها ‏‏",
                "headingUrdu": "خدیجہ رضی اللہ عنہا کے فضائل، مومنین کی ماں",
                "headingEnglish": "The Virtues Of Khadijah, The Mother Of The Believers (RA)",
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13835,
                "hadithNumber": "6272",
                "englishNarrator": "Abu Musa رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: There are many persons amongst men who are quite perfect but there are none perfect amongst women except Mary, daughter of 'Imran, Asiya wife of Pharaoh, and the excellence of 'A'isha رضی اللہ عنہا as compared to women is that of Tharid over all other foods.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \" مردوں میں بہت سے لوگ کامل ہوئے ہیں اور ( لیکن ) عورتوں میں سے مریم بنت عمران اور فرعون کی بیوی آسیہ کے سوا کوئی کامل نہیں ہوئی اور عائشہ رضی اللہ عنہا کی فضیلت عورتوں پر اسی طرح ہے جس طرح ثرید کی باقی کھانوں پر ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، کہا: ہم سے وکیع، محمد بن المثنی اور ابن بشار نے بیان کیا، کہا: ہم سے محمد بن جعفر نے شعبہ کی سند سے بیان کیا اور ہم سے عبید اللہ بن معاذ الانباری نے بیان کیا اور تلفظ ان کا ہے - ہم سے میرے والد نے بیان کیا، ہم سے شعبہ نے بیان کیا عمرو بن مرہ کی سند پر، مرہ کی سند پر، حضرت ابو موسیٰ رضی اللہ عنہ سے روایت ہے ، کہا",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، قَالَا: حَدَّثَنَا وَكِيعٌ، وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، جَمِيعًا عَنْ شُعْبَةَ، ح وَحَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ مُرَّةَ، عَنْ أَبِي مُوسَى، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «كَمَلَ مِنَ الرِّجَالِ كَثِيرٌ، وَلَمْ يَكْمُلْ مِنَ النِّسَاءِ غَيْرُ مَرْيَمَ بِنْتِ عِمْرَانَ، وَآسِيَةَ امْرَأَةِ فِرْعَوْنَ، وَإِنَّ فَضْلَ عَائِشَةَ عَلَى النِّسَاءِ كَفَضْلِ الثَّرِيدِ عَلَى سَائِرِ الطَّعَامِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13836,
                "hadithNumber": "6273",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Gabriel came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: Allah's Messenger, lo. Khadija is coming to you with a vessel of seasoned food or drink. When she comes to you, offer her greetings from her Lord, the Exalted and Glorious, and on my behalf and give her glad tidings of a palace of jewels in Paradise wherein there is no noise and no toil. This hadith has been narrated on the authority of Abu Huraira رضی اللہ عنہ through another chain of transmitters with a slight variation of wording.",
                "hadithUrdu": "حضرت جبرائیل علیہ السلام نبی اکرم صلی اللہ علیہ وسلم کے پاس آئے اور کہا : اللہ کے رسول صلی اللہ علیہ وسلم !یہ خدیجہ ہیں ، آپ کے پاس آئی ہیں ، ان کے پاس ایک برتن ہے جس میں سالن ہے یا کھانا ہے یا مشروب ہے ، چنانچہ جب یہ آپ کے پاس آجائیں تو انھیں ان کے رب عزوجل کی طرف سے اور میری طرف سے سلام کہیں اور انھیں جنت میں ایک گھر کی خوش خبری دیں جو ( موتیوں کی ) لمبی چھڑیوں کا بنا ہواہے ، نہ اس میں کوئی شور ہے اور نہ تھکاوٹ کا گزر ہے ۔ ابو بکر بن ابی شیبہ نے اپنی روایت میں کہا : \"\" حضرت ابو ہریرہ رضی اللہ عنہ سےروایت ہے ۔ \"\" انھوں نے \"\" میں نے سنا \"\" ( کا لفظ ) نہیں کہا اور نہ ہی حدیث میں \"\" اورمیری طرف سے \"\" ( کالفظ ) کہا ہے ۔",
                "urduNarrator": "ابو بکر بن ابی شیبہ ، ابو کریب اور ابن نمیر نے کہا : ہمیں ابن فضیل نے عمارہ سے حدیث بیان کی ، انھوں نے ابو زرعہ سے ، انھوں نےکہا : میں نے حضرت ابو ہریرہ رضی اللہ عنہ سے سنا ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، وَابْنُ نُمَيْرٍ، قَالُوا: حَدَّثَنَا ابْنُ فُضَيْلٍ، عَنْ عُمَارَةَ، عَنْ أَبِي زُرْعَةَ، قَالَ: سَمِعْتُ أَبَا هُرَيْرَةَ، قَالَ: أَتَى جِبْرِيلُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: يَا رَسُولَ اللهِ هَذِهِ خَدِيجَةُ قَدْ أَتَتْكَ مَعَهَا إِنَاءٌ فِيهِ إِدَامٌ أَوْ طَعَامٌ أَوْ شَرَابٌ، فَإِذَا هِيَ أَتَتْكَ، فَاقْرَأْ عَلَيْهَا السَّلَامَ مِنْ رَبِّهَا عَزَّ وَجَلَّ، وَمِنِّي، وَبَشِّرْهَا بِبَيْتٍ فِي الْجَنَّةِ مِنْ قَصَبٍ، لَا صَخَبَ فِيهِ وَلَا نَصَبَ قَالَ أَبُو بَكْرٍ فِي رِوَايَتِهِ: عَنْ أَبِي هُرَيْرَةَ وَلَمْ يَقُلْ: سَمِعْتُ وَلَمْ يَقُلْ فِي الْحَدِيثِ: وَمِنِّي.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13837,
                "hadithNumber": "6274",
                "englishNarrator": "Ismail reported:",
                "hadithEnglish": "I said to 'Abdullah bin Abi Aufa رضی اللہ عنہ : Did Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) give glad tidings of Paradise to Khadija رضی اللہ عنہا ? He said: Yes. He did give glad tidings to her of a palace of jewels in Paradise wherein there would be no noise and no toil.",
                "hadithUrdu": "میں نے حضرت عبداللہ بن ابی اوفیٰ رضی اللہ عنہ سے پوچھا : کیا رسول اللہ صلی اللہ علیہ وسلم نے حضرت خدیجہ رضی اللہ عنہا کو جنت میں ایک گھر کی بشارت دی تھی؟انھوں نے کہا : ہاں ، آپ صلی اللہ علیہ وسلم نے حضرت خدیجہ رضی اللہ عنہا کو ایسے گھر کی بشارت دی تھی جو ( موتیوں کی ) شاخوں سے بنا ہے ، اس میں نہ شور وشغب ہوگا اور نہ تکان ہوگی ۔",
                "urduNarrator": "محمد بن عبداللہ بن نمیر اور محمد بن بشر عبدی نے اسماعیل سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، وَمُحَمَّدُ بْنُ بِشْرٍ الْعَبْدِيُّ، عَنْ إِسْمَاعِيلَ، قَالَ: قُلْتُ لِعَبْدِ اللهِ بْنِ أَبِي أَوْفَى، أَكَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَشَّرَ خَدِيجَةَ بِبَيْتٍ فِي الْجَنَّةِ؟ قَالَ: نَعَمْ، «بَشَّرَهَا بِبَيْتٍ فِي الْجَنَّةِ مِنْ قَصَبٍ لَا صَخَبَ، فِيهِ وَلَا نَصَبَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13838,
                "hadithNumber": "6275",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the a tliority of Ibn Abi Aufa رضی اللہ عنہ through other chains of transmitters.",
                "hadithUrdu": "ہم سے یحییٰ بن یحییٰ نے بیان کیا, ابو معاویہ ، وکیع ، معتمر بن سلیمان ، جریر اور سفیان سب نے اسماعیل بن ابی خالد سے ، انھوں نے ابن ابی اوفیٰ رضی اللہ عنہ سے اور انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے اسی کی مثل روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، ح وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، ح وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ، وَجَرِيرٌ، ح وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ كُلُّهُمْ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، عَنِ ابْنِ أَبِي أَوْفَى، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 13526,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=541",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=539",
                "label": "539",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=540",
                "label": "540",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=541",
                "label": "541",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=542",
                "label": "542",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=543",
                "label": "543",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=544",
                "label": "544",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=545",
                "label": "545",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=543",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=543",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=541",
        "to": 13550,
        "total": 40465
    }
}