{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 337,
        "data": [
            {
                "id": 8689,
                "hadithNumber": "1125",
                "englishNarrator": "Abdullah bin Abbas رضی اللہ عنہما reported:",
                "hadithEnglish": "He came riding on a donkey, and the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was leading the people in prayer at Mina on the occasion of the Farewell Pilgrimage and (the narrator) reported: The donkey passed in front of the row and then he got down from it And joined the row along with the people.",
                "hadithUrdu": "وہ گدھے پر سوار ہو کر آئے جبکہ رسول اللہﷺ حجۃ الوداع کے موقع پر منیٰ میں لوگوں کو نماز پڑھا رہے تھے ، انہوں نے کہا : گدھا صف کے کچھ حصے کے آگے سے گزرا ، پھر وہ اس سے اتر کر لوگوں کے ساتھ صف میں مل گئے.",
                "urduNarrator": "ہم سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا, یونس نے ابن شہاب سے روایت کی ، کہا : مجھے عبید اللہ بن عبد اللہ بن عتبہ نے خبر دی کہ انہیں حضرت عباس رضی اللہ عنہما نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عُبَيْدُ اللهِ بْنُ عَبْدِ اللهِ بْنِ عُتْبَةَ، أَنَّ عَبْدَ اللهِ بْنَ عَبَّاسٍ، أَخْبَرَهُ أَنَّهُ أَقْبَلَ يَسِيرُ عَلَى حِمَارٍ وَرَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «قَائِمٌ يُصَلِّي بِمِنًى فِي حَجَّةِ الْوَدَاعِ يُصَلِّي بِالنَّاسِ» قَالَ: فَسَارَ الْحِمَارُ بَيْنَ يَدَيْ بَعْضِ الصَّفِّ، ثُمَّ نَزَلَ عَنْهُ فَصَفَّ مَعَ النَّاسِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8690,
                "hadithNumber": "1126",
                "englishNarrator": "This hadith has been narrated by Ibn 'Uyaina on the authority of al-Zuhri with the same chain of transmitters and he reported:",
                "hadithEnglish": "The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was leading prayer at 'Arafa.",
                "hadithUrdu": "نبی اکرمﷺ عرفہ میں نماز پڑھا رہے تھے ۔ ( ابن عباس اپنی سواری پر حج کر رہے تھے ۔ یہ واقعہ ان کے ساتھ غالبا منیٰ اور عرفہ دونوں مقامات پر پیش آیا ۔ اس سے ثابت ہوتا ہے کہ آپﷺ کےلیے ہر جگہ سترے کا اہتمام کیا جاتا تھا ۔ )",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ، عمرو النقید اور اسحاق بن ابراہیم نے بیان کیا,سفیان بن عیینہ نے زہری سے اسی سند کے ساتھ مذکورہ روایت بیان کی ، کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَعَمْرٌو النَّاقِدُ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، عَنِ ابْنِ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، بِهَذَا الْإِسْنَادِ قَالَ: وَالنَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «يُصَلِّي بِعَرَفَةَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8691,
                "hadithNumber": "1127",
                "englishNarrator": "This hadith has been reported by Ma'mar on the authority of al-Zuhri with the came chain of transmitters:",
                "hadithEnglish": "But here no mention has been made of Mina or 'Arafa, and he said: It was in the Farewell Pilgrimage or on the Day of Victory.",
                "hadithUrdu": "اس میں منیٰ یا عرفہ کا تذکرہ کرنے کے بجائے حجۃ الوداع یا فتح مکہ کے دن کا ذکر کیا ہے",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم اور عبد بن حمید نے بیان کیا، کہا کہ ہم سے عبدالرزاق نے بیان کیا,معمر نے بھی زہری سے اسی سند کے ساتھ یہی حدیث بیان کی ہے اور",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَا: أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، بِهَذَا الْإِسْنَادِ. وَلَمْ يَذْكُرْ فِيهِ مِنًى وَلَا عَرَفَةَ. وَقَالَ: فِي حَجَّةِ الْوَدَاعِ أَوْ يَوْمَ الْفَتْحِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8692,
                "hadithNumber": "1128",
                "englishNarrator": "Abu Sa'id al-Khudri رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: When any one of you prays he should not let anyone pass in front of him (if there is no sutra), and should try to turn him away as far as possible, but if he refuses to go, he should turn him away forcibly for he is a devil.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’جب تم میں سے کوئی نماز پڑھ رہا ہو تو کسی کو آگے سے نہ گزرنے دے اور جہاں تک ممکن ہو اس کو ہٹائے اگر وہ نہ مانے تو اس سے لڑے کیونکہ وہ شیطان ہے ۔ ‘ ‘ ( مقصود یہ تھا کہ لوگوں کو اس گناہ سے ہر قیمت پر بچایا جائے اور نماز کی حرمت کا اہتمام کیا جائے ۔ )",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے زید بن اسلم رضی اللہ عنہ سے مالک کو پڑھا,عبد الرحمان بن ابی سعید نے ( اپنے والد ) حضرت ابو سعید خدری ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا كَانَ أَحَدُكُمْ يُصَلِّي فَلَا يَدَعْ أَحَدًا يَمُرُّ بَيْنَ يَدَيْهِ وَلْيَدْرَأْهُ مَا اسْتَطَاعَ، فَإِنْ أَبَى فَلْيُقَاتِلْهُ، فَإِنَّمَا هُوَ شَيْطَانٌ.",
                "headingArabic": "مَنْعِ الْمَارِّ بَيْنَ يَدَىِ الْمُصَلِّي ‏",
                "headingUrdu": "نمازی کے سامنے سے گزرنے والے کو روکنا",
                "headingEnglish": "Preventing One Who Wants To Pass In Front Of A Praying Person",
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8693,
                "hadithNumber": "1129",
                "englishNarrator": "Abu Salih al-Samman reported:",
                "hadithEnglish": "I narrate to you what I heard and saw from Abu Sa'id al-Khudri رضی ‌اللہ ‌عنہ ‌: One day I was with Abu Sa'id رضی ‌اللہ ‌عنہ ‌and he was saying prayer on Friday turning to a thing which concealed him from the people when a young man from Banu Mu'ait came there and he tried to pass in front of him; he turned him back by striking his chest. He looked about but finding no other way to pass except in front of Abu Sa'id رضی ‌اللہ ‌عنہ ‌, made a second attempt. He (Abu Sa'id) turned him away by Striking his chest more vigorously than the first stroke. He stood up and had a scuffle with Abu Sa'id. Then the people gathered there He came out and went to Marwan and complained to him what had happened to him. Abu Sa'id too came to Marwan. Marwin said to him: What has happened to you and the son of your brother that he came to complain against you? Abu Sa'id رضی ‌اللہ ‌عنہ ‌said: I heard from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saying: When any one of you prays facing something which conceals him from people and anyone tries to pass in front of him, he should be turned away, but if he refuses, he should be forcibly restrained from it, for he is a devil.",
                "hadithUrdu": "میں تمہیں حدیث بیان کرتا ہوں جو میں نے ابو سعید ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنی اور ( ان کا عمل ) جو ان سے دیکھا ۔ کہا : ایک موقع پر ، جب میں حضرت ابو سعید ‌رضی ‌اللہ ‌عنہ ‌ ‌ کےساتھ تھا اور وہ جمعہ کے دن کسی چیز کی طرف ( رخ کر کے ) ، جو انہیں لوگوں سے ستر ہ مہیا کر رہی تھی ، نماز پڑھ رہے تھے ، اتنے میں ابو معیط کے خاندان کا ایک نوجوان آیا ، اس نے ان کے آگے سے گزرنا چاہا تو انہوں نے اسے اس کے سینے سے ( پیچھے ) دھکیلا ۔ اس نے نظر دوڑائی ، اسے ابو سعید ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے سامنے سے ( گزرنے ) کے سوا کوئی راستہ نہ ملا ، اس نے دوبارہ گزرنا چاہا تو انہوں نے اسے پہلی دفعہ سے زیادہ شدت کے ساتھ اس کے سینے سے پیچھے دھکیلا ، وہ سیدھا کھڑا ہو گیا اور ابو سعید ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو برا بھلا کہا ، پھر لوگوں کی بھیڑ میں گھستا ہوا نکل کر مروان کےسامنے پہنچ گیا اور جو ان کے ساتھ بیتی تھی اس کی شکایت کی ، کہا : ابو سعید ‌رضی ‌اللہ ‌عنہ ‌ ‌ بھی مروان کے پاس پہنچ گئے تو اس نے ان سے کہا : آپ کا اپنے بھتیجے کا ساتھ کیا معاملہ ہے؟ وہ آ کر آپ کی شکایت کر رہا ہے ۔ ابو سعید ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے جواب دیا : میں نے رسول اللہﷺ کو یہ فرماتے ہوئے سنا ہے : ’’ جب تم میں سے کوئی لوگوں سے کسی چیز کی اوٹ میں نماز پڑھے اور کوئی اس کے آگے سے گزرنا چاہے تو وہ اسے اس کے سینے سے دھکیلے اگر وہ نہ مانے تو اس سے لڑے کیونکہ وہ یقیناً شیطان ہے ۔ ‘ ‘",
                "urduNarrator": "ہم سے شیبان بن فرخ نے بیان کیا، ہم سے سلیمان بن مغیرہ نے بیان کیا، ہم سےابن ہلال ، یعنی حمید نے کہا  ایک دن میں اور میرا ایک ساتھی ایک حدیث کے بارے میں مذاکرہ کر رہے تھے کہ ابو صالح سمان کہنے لگے",
                "hadithArabic": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، حَدَّثَنَا ابْنُ هِلَالٍ يَعْنِي حُمَيْدًا، قَالَ: بَيْنَمَا أَنَا وَصَاحِبٌ لِي نَتَذَاكَرُ حَدِيثًا. إِذْ قَالَ أَبُو صَالِحٍ السَّمَّانُ، أَنَا أُحَدِّثُكَ مَا سَمِعْتُ مِنْ أَبِي سَعِيدٍ وَرَأَيْتُ مِنْهُ قَالَ: بَيْنَمَا أَنَا مَعَ أَبِي سَعِيدٍ يُصَلِّي يَوْمَ الْجُمُعَةِ إِلَى شَيْءٍ يَسْتُرُهُ مِنَ النَّاسِ، إِذْ جَاءَ رَجُلٌ شَابٌّ مِنْ بَنِي أَبِي مُعَيْطٍ أَرَادَ أَنْ يَجْتَازَ بَيْنَ يَدَيْهِ، فَدَفَعَ فِي نَحْرِهِ فَنَظَرَ فَلَمْ يَجِدْ مَسَاغًا، إِلَّا بَيْنَ يَدَيْ أَبِي سَعِيدٍ فَعَادَ، فَدَفَعَ فِي نَحْرِهِ أَشَدَّ مِنَ الدَّفْعَةِ الْأُولَى، فَمَثَلَ قَائِمًا، فَنَالَ مِنْ أَبِي سَعِيدٍ، ثُمَّ زَاحَمَ النَّاسَ، فَخَرَجَ فَدَخَلَ عَلَى مَرْوَانَ فَشَكَا إِلَيْهِ مَا لَقِيَ، قَالَ: وَدَخَلَ أَبُو سَعِيدٍ عَلَى مَرْوَانَ، فَقَالَ لَهُ مَرْوَانُ: مَا لَكَ وَلِابْنِ أَخِيكَ جَاءَ يَشْكُوكَ. فَقَالَ أَبُو سَعِيدٍ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِذَا صَلَّى أَحَدُكُمْ إِلَى شَيْءٍ يَسْتُرُهُ مِنَ النَّاسِ، فَأَرَادَ أَحَدٌ أَنْ يَجْتَازَ بَيْنَ يَدَيْهِ، فَلْيَدْفَعْ فِي نَحْرِهِ فَإِنْ أَبَى فَلْيُقَاتِلْهُ، فَإِنَّمَا هُوَ شَيْطَانٌ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8694,
                "hadithNumber": "1130",
                "englishNarrator": "Abdullah bin 'Umar رضی اللہ عنہما reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: When any one of you prays, he should not allow anyone to pass before him, and if he refuses, he should be then forcibly resisted, for there is a devil with him.",
                "hadithUrdu": "رسول اللہﷺ نے فرمایا : ’’جب تم میں سے کوئی نماز پڑھ رہا ہو تو کسی کو اپنے آگے سے نہ گزرنے دے ، اگر وہ نہ مانے تو اس سے لڑے کیونکہ اس کی معیت میں ( اس کا ) ہمراہی ( شیطان ) ہے ۔",
                "urduNarrator": "مجھ سے ہارون بن عبداللہ اور محمد بن رافع نے بیان کیا، کہا ہم سے محمد بن رافع نے بیان کیا,اسماعیل بن ابی فدیک نے ضحاک بن عثمان سے ، انہوں نے صدقہ بن یسار سے ، اور انہوں نے حضرت عبد اللہ بن عمر رضی اللہ عنہما سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللهِ، وَمُحَمَّدُ بْنُ رَافِعٍ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ ابْنِ أَبِي فُدَيْكٍ، عَنِ الضَّحَّاكِ بْنِ عُثْمَانَ، عَنْ صَدَقَةَ بْنِ يَسَارٍ، عَنْ عَبْدِ اللهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا كَانَ أَحَدُكُمْ يُصَلِّي فَلَا يَدَعْ أَحَدًا يَمُرُّ بَيْنَ يَدَيْهِ، فَإِنْ أَبَى فَلْيُقَاتِلْهُ، فَإِنَّ مَعَهُ الْقَرِينَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8695,
                "hadithNumber": "1131",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated by Ibn Umar رضی اللہ عنہما by another chain of transmitters.",
                "hadithUrdu": "ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے ابو بکر حنفی نے بیان کیا، کہا ہم سے ضحاک بن عثمان نے بیان کیا، کہا ہم سے صدقہ بن یسار نے بیان کیا، انہوں نے کہا کہ میں نے ابن عمر رضی اللہ عنہما کو یہ فرماتے ہوئے سنا: رسول اللہ صلی اللہ علیہ وسلم ، کچھ ایسا ہی کہا۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا أَبُو بَكْرٍ الْحَنَفِيُّ، حَدَّثَنَا الضَّحَّاكُ بْنُ عُثْمَانَ، حَدَّثَنَا صَدَقَةُ بْنُ يَسَارٍ، قَالَ: سَمِعْتُ ابْنَ عُمَرَ يَقُولُ: إِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8696,
                "hadithNumber": "1132",
                "englishNarrator": "Busr bin Sa'id reported that Zaid bin Khalid al-Juhani sent him to Abu Juhaim in order to ask him what he had heard from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) with regard to the passer in front of the worshipper. Abu Juhaim ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: If anyone who passes in front of a man who is praying knew the responsibility he incurs, he would stand still forty (years) rather than to pass in front of him Abu Nadr said: I do not know whether he said forty days or months or years.",
                "hadithUrdu": "رسول اللہﷺ نے فرمایا : ’’ اگر نمازی کے آگے سے گزرنے والا جان لے کہ اس پر کس قدر ( گناہ ) ہے تو اسے چالیس ( سال ) تک کھڑے رہنا ، اس کے آگے گزرنے سے بہتر ( معلوم ) ہو ۔ ‘ ‘ ابو نضر نے کہا : مجھے معلوم نہیں ، انہوں نے چالیس دن کہا یا ماہ یا سال ۔ ( مسند بزار میں چالیس سال کے الفاظ ہیں ۔ )",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا امام مالک کے ابو نضر سے اور انہوں نے بسر بن سعید سے روایت کی کہ زید بن خالد جہنی ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے انہیں ابو جہیم ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی خدمت میں بھیجا تاکہ ان سے پوچھیں کہ انہوں نے نمازی کے آگے سے گزرنے والے کے بارے میں رسول اللہ ﷺ سے کیا سنا تھا؟ ابو جہیم ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ أَبِي النَّضْرِ، عَنْ بُسْرِ بْنِ سَعِيدٍ، أَنَّ زَيْدَ بْنَ خَالِدٍ الْجُهَنِيَّ، أَرْسَلَهُ إِلَى أَبِي جُهَيْمٍ، يَسْأَلُهُ مَاذَا سَمِعَ مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي الْمَارِّ بَيْنَ يَدَيِ الْمُصَلِّي؟ قَالَ أَبُو جُهَيْمٍ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَوْ يَعْلَمُ الْمَارُّ بَيْنَ يَدَيِ الْمُصَلِّي مَاذَا عَلَيْهِ، لَكَانَ أَنْ يَقِفَ أَرْبَعِينَ خَيْرًا لَهُ، مِنْ أَنْ يَمُرَّ بَيْنَ يَدَيْهِ» قَالَ أَبُو النَّضْرِ: لَا أَدْرِي قَالَ: أَرْبَعِينَ يَوْمًا أَوْ شَهْرًا أَوْ سَنَةً؟",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8697,
                "hadithNumber": "1133",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated from Abu Juhaim Ansari ‌رضی ‌اللہ ‌عنہ ‌by another chain of transmitters.",
                "hadithUrdu": "ہم سے عبداللہ بن ہاشم بن حیان العبدی نے بیان کیا، کہا ہم سے وکیع نے بیان کیا,سفیان نے ابو نضر سالم سے اور انہوں نے بسر بن سعید سے روایت کی کہ زید بن خالد جہنی ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ( انہیں ) ابو جہیم انصاری ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے پاس بھیجا ( تاکہ پوچھے ) کہ آپ نے نبی اکرمﷺ کو کیا فرماتے سنا .... پھر ( سفیان نے ) مالک کی روایت کے ہم معنیٰ حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللهِ بْنُ هَاشِمِ بْنِ حَيَّانَ الْعَبْدِيُّ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ سَالِمٍ أَبِي النَّضْرِ، عَنْ بُسْرِ بْنِ سَعِيدٍ، أَنَّ زَيْدَ بْنَ خَالِدٍ الْجُهَنِيَّ، أَرْسَلَ إِلَى أَبِي جُهَيْمٍ الْأَنْصَارِيِّ مَا سَمِعْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: فَذَكَرَ بِمَعْنَى حَدِيثِ مَالِكٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8698,
                "hadithNumber": "1134",
                "englishNarrator": null,
                "hadithEnglish": "Sahl b. Sa'd al-Si'idi reported: Between the place of worship where the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) prayed and the wall, there was a gap through which a goat could pass.",
                "hadithUrdu": "حضرت سہل بن سعد ساعدی ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے ، انہوں نے کہا : رسول اللہﷺ کے سجدے کی جگہ اور دیوار کی درمیان بکری گزرنے کے برابر فاصلہ تھا ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنِي يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، حَدَّثَنَا ابْنُ أَبِي حَازِمٍ، حَدَّثَنِي أَبِي، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، قَالَ: «كَانَ بَيْنَ مُصَلَّى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَبَيْنَ الْجِدَارِ مَمَرُّ الشَّاةِ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8699,
                "hadithNumber": "1135",
                "englishNarrator": "Salama bin Akwa' رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "He sought the place (in the mosque) where the copies of the Qur'an were kept and glorified Allah there, and the narrator made a mention that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) sought that place and that was between the pulpit and the qibla-a place where a goat could pass.",
                "hadithUrdu": "وہ ( سلمہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) کوشش کر کے ( مسجد نبوی میں ) اس جگہ نفلی نماز پڑھتے جہاں مصحف ( رکھا ہوا ) تھا اور انہوں نے کہا کہ رسول اللہﷺ اسی جگہ کی کوشش فرماتے تھے اور ( یہاں ) منبر اور قبلے کی دیوار کے درمیان بکری کے راستے کے برابر فاصلہ تھا ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم اور محمد بن المثنی نے بیان کیا اور یہ قول ابن المثنیٰ نے کہا: انہوں نے ہمیں خبر دی، اور ابن المثنی نے کہا, حماد بن مسعدہ نے یزید بن ابی عبید سے اور انہوں نے حضرت سلمہ بن اکوع ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، - وَاللَّفْظُ لِابْنِ الْمُثَنَّى قَالَ إِسْحَاقُ: أَخْبَرَنَا، وَقَالَ ابْنُ الْمُثَنَّى: - حَدَّثَنَا حَمَّادُ بْنُ مَسْعَدَةَ، عَنْ يَزِيدَ يَعْنِي ابْنَ أَبِي عُبَيْدٍ، عَنْ سَلَمَةَ وَهُوَ ابْنُ الْأَكْوَعِ أَنَّهُ كَانَ يَتَحَرَّى مَوْضِعَ مَكَانِ الْمُصْحَفِ يُسَبِّحُ فِيهِ، وَذَكَرَ: «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ يَتَحَرَّى ذَلِكَ الْمَكَانَ، وَكَانَ بَيْنَ الْمِنْبَرِ وَالْقِبْلَةِ قَدْرُ مَمَرِّ الشَّاةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8700,
                "hadithNumber": "1136",
                "englishNarrator": "Yazid reported:",
                "hadithEnglish": "Salama رضی ‌اللہ ‌عنہ ‌sought to say prayer near the pillar which was by that place where copies of the Qur'an were kept. I said to him: Abu Muslim. I see you striving to offer your prayer by this pillar. He said: I saw the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) seeking to pray by its side.",
                "hadithUrdu": "حضرت سلمہ ( بن اکوع ) ‌رضی ‌اللہ ‌عنہ ‌ ‌ اس ستون کے پاس نماز پڑھنے کی جستجو کرتے جو مصحف کے پاس تھا ۔ میں نے ان سے کہا : اے ابو مسلم! میں دیکھتا ہوں کہ آپ اس ستون کے پاس نماز پڑھنے کا اہتمام کرتے ہیں ۔ انہوں نے کہا : میں نے نبی اکرمﷺ کو اس کے قریب نماز پڑھنے کا اہتمام کرتے دیکھا ہے",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا، انہوں نے کہا مکی ( بن ابراہیم ) نے کہا : ہمیں یزید بن ابی عبید نے خبر دی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مَكِّيٌّ، قَالَ يَزِيدُ: أَخْبَرَنَا، قَالَ: كَانَ سَلَمَةُ يَتَحَرَّى الصَّلَاةَ عِنْدَ الْأُسْطُوَانَةِ الَّتِي عِنْدَ الْمُصْحَفِ. فَقُلْتُ لَهُ: يَا أَبَا مُسْلِمٍ أَرَاكَ تَتَحَرَّى الصَّلَاةَ عِنْدَ هَذِهِ الْأُسْطُوَانَةِ، قَالَ: «رَأَيْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَتَحَرَّى الصَّلَاةَ عِنْدَهَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8701,
                "hadithNumber": "1137",
                "englishNarrator": "Abu Dharr رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of 'Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: When any one of you stands for prayer and there is a thing before him equal to the back of the saddle that covers him and in case there is not before him (a thing) equal to the back of the saddle, his prayer would be cut off by (passing of an) ass, woman, and black Dog. I said: O Abu Dharr, what feature is there in a black dog which distinguish it from the red dog and the yellow dog? He said: O, son of my brother, I asked the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as you are asking me, and he said: The black dog is a devil.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’ جب تم میں سے کوئی نماز کے لیے کھڑا ہو جب اس کے سامنے پالان کی پچھلی لکڑی کے برابر کوئی چیز ہو گی تو وہ اسے سترہ مہیا کرے گی ، اور جب اس کے سامنے پالان کی پچھلی لکڑی کے برابر کوئی چیز نہ ہو گی تو گدھا ، عورت اور سیاہ کتا اس کی نماز کو قطع کریں گے ۔ ‘ ‘ میں نے کہا : اے ابو ذر! سیاہ کتے کی لال کتے یا زرد کتے سے تخصیص کیوں ہے؟ انہوں نے کہا : بھتیجے! میں نے بھی رسول اللہﷺ سے یہی سوال کیا تھا جو تم نے مجھ سے کیا ہے تو آپ نے فرمایا تھا : ’’ سیاہ کتا شیطان ہوتا ہے ۔ ‘ ‘",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے اسماعیل بن اولیاء نے بیان کیا، کہا کہ ہم سے زہیر بن حرب نے بیان کیا، ہم سے اسماعیل بن ابراہیم نے بیان کیا, یونس نے حمید بن ہلال سے ، انہوں نے عبد اللہ بن صامت سے اور انہوں نے حضرت ابو ذر ( غفاری ) ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، ح قَالَ: وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ يُونُسَ، عَنْ حُمَيْدِ بْنِ هِلَالٍ، عَنْ عَبْدِ اللهِ بْنِ الصَّامِتِ، عَنْ أَبِي ذَرٍّ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا قَامَ أَحَدُكُمْ يُصَلِّي، فَإِنَّهُ يَسْتُرُهُ إِذَا كَانَ بَيْنَ يَدَيْهِ مِثْلُ آخِرَةِ الرَّحْلِ، فَإِذَا لَمْ يَكُنْ بَيْنَ يَدَيْهِ مِثْلُ آخِرَةِ الرَّحْلِ، فَإِنَّهُ يَقْطَعُ صَلَاتَهُ الْحِمَارُ، وَالْمَرْأَةُ، وَالْكَلْبُ الْأَسْوَدُ» قُلْتُ: يَا أَبَا ذَرٍّ، مَا بَالُ الْكَلْبِ الْأَسْوَدِ مِنَ الْكَلْبِ الْأَحْمَرِ مِنَ الْكَلْبِ الْأَصْفَرِ؟ قَالَ: يَا ابْنَ أَخِي، سَأَلْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَمَا سَأَلْتَنِي فَقَالَ: «الْكَلْبُ الْأَسْوَدُ شَيْطَانٌ».",
                "headingArabic": "قَدْرِ مَا يَسْتُرُ الْمُصَلِّيَ ‏‏",
                "headingUrdu": "اس کی بلندی جو دعا کرنے والے کے لیے سترہ کا کام کرتی ہے۔",
                "headingEnglish": "The Height Of That Which Serves As A Sutrah For The One Who Is Praying",
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8702,
                "hadithNumber": "1138",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been transmitted by Humaid bin Hilal on the authority of Yunus.",
                "hadithUrdu": "ہم سے شیبان بن فرخ نے بیان کیا,سلیمان بن مغیرہ ، شعبہ ، جریر ، سلم بن ابو ذیال اور عاصم احول سب نے حمید بن ہلال سے یونس کی سند کے ساتھ اس کی حدیث کی مانند حدیث بیان کی ہے ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، ح قَالَ: وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، ح قَالَ: وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا أَبِي، ح قَالَ: وَحَدَّثَنَا إِسْحَاقُ، أَيْضًا أَخْبَرَنَا، الْمُعْتَمِرُ بْنُ سُلَيْمَانَ، قَالَ: سَمِعْتُ سَلْمَ بْنَ أَبِي الذَّيَّالِ، ح قَالَ: وَحَدَّثَنِي يُوسُفُ بْنُ حَمَّادٍ، الْمَعْنِيُّ حَدَّثَنَا زِيَادٌ الْبَكَّائِيُّ، عَنْ عَاصِمٍ الْأَحْوَلِ كُلُّ هَؤُلَاءِ عَنْ حُمَيْدِ بْنِ هِلَالٍ، بِإِسْنَادِ يُونُسَ كَنَحْوِ حَدِيثِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8703,
                "hadithNumber": "1139",
                "englishNarrator": "Abu Huraira رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: A woman, an ass and a dog disrupt the prayer, but something like the back of a saddle guards against that.",
                "hadithUrdu": "رسول اللہﷺ نے فرمایا : ’’ عورت ، گدھا اور کتا نماز قطع کر دیتے ہیں اور پالان کی پچھلی لکڑی کے برابر کوئی چیز اسے بچاتی ہے ۔ ‘ ‘",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے المخزومی نے بیان کیا، کہا کہ ہم سے عبد الواحد جو کہ ابن زیاد ہیں، نے بیان کیا، کہا ہم سے عبید اللہ بن عبداللہ بن العصام نے بیان کیا، کہا ہم سے یزید بن الا صم نے بیان کیا,حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے ، انہوں نے کہا کہ",
                "hadithArabic": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا الْمَخْزُومِيُّ، حَدَّثَنَا عَبْدُ الْوَاحِدِ وَهُوَ ابْنُ زِيَادٍ، حَدَّثَنَا عُبَيْدُ اللهِ بْنُ عَبْدِ اللهِ بْنِ الْأَصَمِّ، حَدَّثَنَا يَزِيدُ بْنُ الْأَصَمِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «يَقْطَعُ الصَّلَاةَ الْمَرْأَةُ وَالْحِمَارُ وَالْكَلْبُ، وَيَقِي ذَلِكَ مِثْلُ مُؤْخِرَةِ الرَّحْلِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8704,
                "hadithNumber": "1140",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "The Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to pray at night while I lay interposed between him and the Qibla like a corpse on the bier.",
                "hadithUrdu": "نبی اکرمﷺ رات کو نماز پڑھتے تھے ، میں جنازے کی طرح آپ کے اور قبلے کے درمیان چوڑائی میں لیٹی ہوتی تھی",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، عمرو ناقد اور زہیر بن حرب نے بیان کیا، انہوں نے کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا,زہری نے عروہ سے اور انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالُوا: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ: «أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي مِنَ اللَّيْلِ وَأَنَا مُعْتَرِضَةٌ بَيْنَهُ وَبَيْنَ الْقِبْلَةِ، كَاعْتِرَاضِ الْجَنَازَةِ».",
                "headingArabic": "الاِعْتِرَاضِ بَيْنَ يَدَىِ الْمُصَلِّي ‏",
                "headingUrdu": "نماز پڑھنے والے کے سامنے لیٹنا",
                "headingEnglish": "Lying In Front Of One Who Is Praying",
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8705,
                "hadithNumber": "1141",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said his whole prayer (Tahajjud prayer) during the night while I lay between him and the Qibla. When he intended to say Witr (prayer) he awakened me and I too said witr (prayer).",
                "hadithUrdu": "نبی اکرمﷺ رات کو اپنی پوری نماز پڑھتے اور میں آپ کے اور قبلے کے درمیان لیٹی ہوتی تھی اور جب آپ وتر پڑھنا چاہتے ، مجھے جگا دیتے تو میں بھی وتر پڑھ لیتی.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے وکیع نے بیان کیا,ہشام نے اپنے والد عروہ سے اور انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ: «كَانَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي صَلَاتَهُ مِنَ اللَّيْلِ كُلَّهَا وَأَنَا مُعْتَرِضَةٌ بَيْنَهُ وَبَيْنَ الْقِبْلَةِ، فَإِذَا أَرَادَ أَنْ يُوتِرَ أَيْقَظَنِي فَأَوْتَرْتُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8706,
                "hadithNumber": "1142",
                "englishNarrator": "Urwa bin Zubair reported:",
                "hadithEnglish": "'A'isha رضی اللہ عنہا asked: What disrupts the prayer? We said: The woman and the ass. Upon this she remarked: Is the woman an ugly animal? I lay in front of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) like the bier of a corpse and he said prayer.",
                "hadithUrdu": "حضرت عائشہ رضی اللہ عنہا نے پوچھا : کون سی چیز نماز قطع کر دیتی ہے؟ تو ہم نے کہا : عورت اور گدھا ۔ اس پر انہوں نے کہا : عورت برا چوپایہ ہے! میں نے اپنے آپ کو دیکھا ہے کہ میں رسول اللہ ﷺ کے سامنے چوڑائی رخ جنازے کی طرح لیٹی ہوتی تھی جبکہ آپ نماز پڑھ رہے تھے ۔",
                "urduNarrator": "مجھ سے عمرو بن علی نے بیان کیا، کہا ہم سے محمد بن جعفر نے بیان کیا، ہم سے شعبہ نے بیان کیا,ابو بکر بن حفص نے عروہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وَحَدَّثَنِي عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي بَكْرِ بْنِ حَفْصٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، قَالَ: قَالَتْ عَائِشَةُ: مَا يَقْطَعُ الصَّلَاةَ؟ قَالَ: فَقُلْنَا الْمَرْأَةُ وَالْحِمَارُ. فَقَالَتْ: «إِنَّ الْمَرْأَةَ لَدَابَّةُ سَوْءٍ لَقَدْ رَأَيْتُنِي بَيْنَ يَدَيْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مُعْتَرِضَةً، كَاعْتِرَاضِ الْجَنَازَةِ وَهُوَ يُصَلِّي».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8707,
                "hadithNumber": "1143",
                "englishNarrator": "Masruq reported:",
                "hadithEnglish": "It was mentioned before 'A'isha رضی اللہ عنہا that prayer is invalidated (in case of passing) of a dog, an ass and a woman (before the worshipper, when he is not screened). Upon this 'A'isha said: You likened us to the asses and the dogs. By Allah I saw the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) saying prayer while I lay on the bedstead interposing between him and the Qibla. When I felt the need, I did not like to wit to front (of the Holy Prophet) and perturb the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and quietly moved out from under its (i. e. of the bedstead) legs.",
                "hadithUrdu": "انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، ان کے سامنے ان چیزوں کا تذکرہ کیا گیا جو نماز قطع کرتی ہیں ( یعنی ) کتا ، گدھا اور عورت ۔ تو عائشہ رضی اللہ عنہا نے فرمایا : تم نے ہمیں گدھوں اور کتوں کے مشابہ بنا دیا ہے! اللہ کی قسم! میں نے رسول اللہ ﷺ کو اس حال میں نماز پڑھتے دیکھا کہ میں چار پائی پر آپ کے اور قبلے کے درمیان لیٹی ہوتی تھی ، مجھے ضرورت پیش آتی تو میں بیٹھ کر رسول اللہﷺ کو تکلیف دینا پسند نہ کرتی ، اس لیے میں اس ( چار پائی یا بستر ) کے پایوں ( والی جگہ کی طرف ) سے کھسک جاتی ۔",
                "urduNarrator": "ہم سے عمرو ناقد اور ابو سعید اشجع نے بیان کیا، کہا: ہم سے حفص بن غیاث نے بیان کیا، انہوں نے کہا: ہم سے عمر بن حفص بن غیاث نے بیان کیا، اور تلفظ کی ایک تعریف ہے پھر میرے والد! اعمش نے ہمیں حدیث سنائی ، کہا : مجھے ابراہیم نے حدیث بیان کی ، انہوں نے اسود سے اور اسود نے عائشہ رضی اللہ عنہا سے روایت کی ۔ اعمش نے ( مزید ) کہا : مجھے مسلم بن صبیح نے مسروق سے حدیث بیان کی اور",
                "hadithArabic": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، وَأَبُو سَعِيدٍ الْأَشَجُّ، قَالَا: حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، ح قَالَ: وَحَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، وَاللَّفْظُ لَهُ، حَدَّثَنَا أَبِي، حَدَّثَنَا الْأَعْمَشُ، حَدَّثَنِي إِبْرَاهِيمُ، عَنِ الْأَسْوَدِ، عَنْ عَائِشَةَ، ح وَحَدَّثَنِي مُسْلِمٌ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، وَذُكِرَ عِنْدَهَا مَا يَقْطَعُ الصَّلَاةَ الْكَلْبُ، وَالْحِمَارُ، وَالْمَرْأَةُ فَقَالَتْ عَائِشَةُ: قَدْ شَبَّهْتُمُونَا بِالْحَمِيرِ وَالْكِلَابِ، وَاللهِ لَقَدْ «رَأَيْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي وَإِنِّي عَلَى السَّرِيرِ بَيْنَهُ وَبَيْنَ الْقِبْلَةِ مُضْطَجِعَةً، فَتَبْدُو لِي الْحَاجَةُ، فَأَكْرَهُ أَنْ أَجْلِسَ فَأُوذِيَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَأَنْسَلُّ مِنْ عِنْدِ رِجْلَيْهِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8708,
                "hadithNumber": "1144",
                "englishNarrator": "Al-Aswad reported that 'A'isha رضی اللہ عنہا said:",
                "hadithEnglish": "You have made us equal to the dogs and the asses, whereas I lay on the bedstead and the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came there and stood in the middle of the bedstead and said prayer. I did not like to take off the quilt from me (in that state), so I moved away quietly from the front legs of the bedstead and thus came out of the quilt.",
                "hadithUrdu": "تم نے ہمیں کتوں اورگدھوں کے برابر کر دیا ہے ، حالانکہ میں نے اپنے آپ کو ( اس طرح ) دیکھا ہے کہ میں چار پائی پر لیٹی ہوتی تھی ، رسول اللہﷺ تشریف لاتے اور چارپائی کے وسط میں کھڑے ہو کر نماز پڑھتے ، میں آپ کے سامنے ہونا پسند نہ کرتی ، اس لیے میں چار پائی کے پایوں کی طرف سے کھسکتی یہاں تک کہ اپنے لحاف سے نکل جاتی ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے جریر نے بیان کیا,منصور نے ابراہیم ( نخعی ) سے ، انہوں نے اسود سے اور انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے فرمایا",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الْأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ: عَدَلْتُمُونَا بِالْكِلَابِ وَالْحُمُرِ، «لَقَدْ رَأَيْتُنِي مُضْطَجِعَةً عَلَى السَّرِيرِ، فَيَجِيءُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَيَتَوَسَّطُ السَّرِيرَ، فَيُصَلِّي فَأَكْرَهُ أَنْ أَسْنَحَهُ، فَأَنْسَلُّ مِنْ قِبَلِ رِجْلَيِ السَّرِيرِ حَتَّى أَنْسَلَّ مِنْ لِحَافِي».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8709,
                "hadithNumber": "1145",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "I was sleeping in front of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) with my legs between him and the Qibla. When he prostrated himself he pinched me and I drew up my legs, and when be stood up, I stretched them out. She said: At that time there were no lamps in the houses.",
                "hadithUrdu": "میں رسول اللہﷺ کے سامنے سو جاتی اور میرے پاؤں آپ کے قبلے ( والے حصے ) میں ہوتے ، جب آپ سجدہ کرتے تو ( پاؤں پر ہاتھ لگا کر ) مجھے اشارہ کر دیتے تو میں اپنے دونوں پاؤں سکیٹر لیتی اور جب آپ کھڑے ہو جاتے تو میں ان کو پھیلا لیتی ۔ انہوں ( عائشہ رضی اللہ عنہا ) نے کہا : گھر ان دنوں ایسے تھے کہ ان میں چراغ نہیں ہوتے تھے ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے مالک رضی اللہ عنہ کو ابو نضر رضی اللہ عنہ سے روایت کی،ابو سلمہ بن عبد الرحمن نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ أَبِي النَّضْرِ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، قَالَتْ: «كُنْتُ أَنَامُ بَيْنَ يَدَيْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَرِجْلَايَ فِي قِبْلَتِهِ فَإِذَا سَجَدَ غَمَزَنِي فَقَبَضْتُ رِجْلَيَّ، وَإِذَا قَامَ بَسَطْتُهُمَا» قَالَتْ: «وَالْبُيُوتُ يَوْمَئِذٍ لَيْسَ فِيهَا مَصَابِيحُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8710,
                "hadithNumber": "1146",
                "englishNarrator": "Maimuna رضی اللہ عنہا , the wife of the Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said prayer and I (lay) opposite to him while I was in menses. Sometimes his clothes touched me when he prostrated.",
                "hadithUrdu": "رسول اللہﷺ نماز پڑھتے اور میں حیض کی حالت میں آپ کے سامنے ہوتی ، بسا اوقات آپ سجدہ کرتے تو آپ کا کپڑا مجھ سے لگ رہا ہوتا.",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا ہم سے خالد بن عبداللہ نے بیان کیا، انہوں نے کہا: ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے عباد بن العوام نے بیان کیا، انہوں نے شیبانی کی سند سے، وہ عبداللہ بن شداد بن الحاد رضی اللہ عنہ سے۔ انہوں نے کہا, نبی اکرمﷺ کی زوجہ حضرت میمونہ رضی اللہ عنہا سے روایت ہے ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللهِ، ح قَالَ: وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ، جَمِيعًا عَنِ الشَّيْبَانِيِّ، عَنْ عَبْدِ اللهِ بْنِ شَدَّادِ بْنِ الْهَادِ، قَالَ: حَدَّثَتْنِي مَيْمُونَةُ زَوْجُ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَتْ: «كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي وَأَنَا حِذَاءَهُ وَأَنَا حَائِضٌ وَرُبَّمَا أَصَابَنِي ثَوْبُهُ إِذَا سَجَدَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8711,
                "hadithNumber": "1147",
                "englishNarrator": "",
                "hadithEnglish": "A'isha reported: The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said prayer at night and I was by his side in a state of meanses and I had a sheet pulled over me a portion of which was on his side.",
                "hadithUrdu": "حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ ﷺ رات کو نماز پڑھتے اور میں حیض کی حالت میں آپ کے پہلو کی جانب ہوتی ۔ مجھ پر چادر ہوتی اور اس چادر کا کچھ حصہ آپ کے پہلو ( کی طرف ) سے آپ پر ( بھی ) ہوتا ۔",
                "urduNarrator": "",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالَ زُهَيْرٌ: حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا طَلْحَةُ بْنُ يَحْيَى، عَنْ عُبَيْدِ اللهِ بْنِ عَبْدِ اللهِ، قَالَ: سَمِعْتُهُ عَنْ عَائِشَةَ، قَالَتْ: كَانَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «يُصَلِّي مِنَ اللَّيْلِ وَأَنَا إِلَى جَنْبِهِ، وَأَنَا حَائِضٌ وَعَلَيَّ مِرْطٌ وَعَلَيْهِ بَعْضُهُ إِلَى جَنْبِهِ»",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8712,
                "hadithNumber": "1148",
                "englishNarrator": "Abu Huraira رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "An inquirer asked the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) about the prayer in a single garment. He (the Holy Prophet) add: Has everyone of you two garments?",
                "hadithUrdu": "ایک سائل نے رسول اللہﷺ سے ایک کپڑے میں نماز پڑھنے کے بارے میں سوال کیا تو آپ نے فرمایا : ’’ کیا تم میں سے ہر ایک کے پاس دو کپڑے ہیں؟ ‘ ‘",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا امام مالک نے ابن شہاب ( زہری ) سے ، انہوں نے سعید بن مسیب سے اور انہوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ سَائِلًا سَأَلَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ الصَّلَاةِ فِي الثَّوْبِ الْوَاحِدِ؟ فَقَالَ «أَوَلِكُلِّكُمْ ثَوْبَانِ؟",
                "headingArabic": "الصَّلاَةِ فِي ثَوْبٍ وَاحِدٍ وَصِفَةِ لُبْسِهِ",
                "headingUrdu": "ایک لباس میں نماز پڑھنا، اور اسے کس طرح پہننا چاہئے؟",
                "headingEnglish": "Praying In A Single Garment, And How It Should Be Worn",
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8713,
                "hadithNumber": "1149",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been narrated by Abu Huraira ‌رضی ‌اللہ ‌عنہ ‌with another chain of transmitters.",
                "hadithUrdu": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا,یونس اور عقیل بن خالد دونوں نے ابن شہاب ( زہری ) سے ، انہوں نے سعید بن مسیب اور ابو سلمہ سے ، انہوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انہوں نے نبی ﷺ سے سابقہ حدیث کے مانند روایت بیان کی.",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، ح قَالَ: وَحَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، وَحَدَّثَنِي أَبِي، عَنْ جَدِّي، قَالَ: حَدَّثَنِي عُقَيْلُ بْنُ خَالِدٍ، كِلَاهُمَا عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، وَأَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 8401,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=336",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=334",
                "label": "334",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=335",
                "label": "335",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=336",
                "label": "336",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=337",
                "label": "337",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=338",
                "label": "338",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=339",
                "label": "339",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=340",
                "label": "340",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=338",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=338",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=336",
        "to": 8425,
        "total": 40465
    }
}