{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 590,
        "data": [
            {
                "id": 15014,
                "hadithNumber": "7453",
                "englishNarrator": "Urwa bin Zubair reported on the authority of 'A'isha, the wife of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), that she said:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) died (in a state) that it never happened that he could eat to his fill the bread with olive oil twice during a day.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم رحلت فرماگئےاور آپ کبھی ایک دن میں دوبار روٹی اور زیتون کے تیل سے سیر نہیں ہو ئے ۔",
                "urduNarrator": "ہم سے ابو الطاہر احمد نے بیان کیا، کہا ہم سے عبداللہ بن وہب نے بیان کیا، کہا ہم سے ابو صخر نے بیان کیا، وہ یزید بن عبداللہ بن قصیط کی سند سے اور ہم سے ہارون بن سعید نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، کہا ہم سے ابو صخر نے بیان کیا، وہ ابن قصیط کی سند سے, عروہ بن زبیر نے نبی صلی اللہ علیہ وسلم کی اہلیہ حضرت عائشہ رضی اللہ عنہا سے روایت کی کہا",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ أَحْمَدُ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي أَبُو صَخْرٍ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ قُسَيْطٍ و حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي أَبُو صَخْرٍ عَنْ ابْنِ قُسَيْطٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ لَقَدْ مَاتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَا شَبِعَ مِنْ خُبْزٍ وَزَيْتٍ فِي يَوْمٍ وَاحِدٍ مَرَّتَيْنِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "54",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 154,
                    "chapterNumber": "54",
                    "chapterEnglish": "The Book of Zuhd and Softening of Hearts",
                    "chapterUrdu": "زہد اور رقت انگیز باتیں",
                    "chapterArabic": "كتاب الزُّهْدِ وَالرَّقَائِقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 15015,
                "hadithNumber": "7454",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) died (in a state) when the people could afford to eat only the dates and water.",
                "hadithUrdu": "جب لوگ دو سیاہ چیزیں کھجور اور پانی سے سیر ہونے لگے تو رسول اللہ صلی اللہ علیہ وسلم رحلت فرماگئے ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا, داؤد بن عبد الرحمٰن عطاء نے ہمیں خبر دی کہا : مجھے منصور بن عبد الرحمٰن یحییٰ نے اپنی والدہ صفیہ سے حدیث بیان کی انھوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا دَاوُدُ بْنُ عَبْدِ الرَّحْمَنِ الْمَكِّيُّ الْعَطَّارُ عَنْ مَنْصُورٍ عَنْ أُمِّهِ عَنْ عَائِشَةَو حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا دَاوُدُ بْنُ عَبْدِ الرَّحْمَنِ الْعَطَّارُ حَدَّثَنِي مَنْصُورُ بْنُ عَبْدِ الرَّحْمَنِ الْحَجَبِيُّ عَنْ أُمِّهِ صَفِيَّةَ عَنْ عَائِشَةَ قَالَتْ تُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ شَبِعَ النَّاسُ مِنْ الْأَسْوَدَيْنِ التَّمْرِ وَالْمَاءِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "54",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 154,
                    "chapterNumber": "54",
                    "chapterEnglish": "The Book of Zuhd and Softening of Hearts",
                    "chapterUrdu": "زہد اور رقت انگیز باتیں",
                    "chapterArabic": "كتاب الزُّهْدِ وَالرَّقَائِقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 15016,
                "hadithNumber": "7455",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had died in a state that they could afford to eat two things only: water and dates.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کی رحلت ہو گئی اور ہم دو سیاہ چیزوں پانی اور کھجورسے سیر ہونے لگے ۔",
                "urduNarrator": "مجھ سے محمد بن المثنیٰ نے بیان کیا, عبد الرحمٰن ( بن مہدی ) نے ہمیں سفیان ( ثوری ) سے حدیث بیان کی ، انھوں نے منصور بن صفیہ سے انھوں نے اپنی والدہ سے اور انھوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ سُفْيَانَ عَنْ مَنْصُورِ بْنِ صَفِيَّةَ عَنْ أُمِّهِ عَنْ عَائِشَةَ قَالَتْ تُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَدْ شَبِعْنَا مِنْ الْأَسْوَدَيْنِ الْمَاءِ وَالتَّمْرِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "54",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 154,
                    "chapterNumber": "54",
                    "chapterEnglish": "The Book of Zuhd and Softening of Hearts",
                    "chapterUrdu": "زہد اور رقت انگیز باتیں",
                    "chapterArabic": "كتاب الزُّهْدِ وَالرَّقَائِقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 15017,
                "hadithNumber": "7456",
                "englishNarrator": "This hadith has been transmitted on the authority of Sufyan and the words are:",
                "hadithEnglish": "We could not afford to eat to the fill even dates and water.",
                "hadithUrdu": "( آپ تشریف لے گئے ) جبکہ ( ابھی ) ہم دوسیاہ چیزیں ( پانی اور کھجور ) بھی پیٹ بھر کے نہیں کھاتے تھے ۔",
                "urduNarrator": "ہم سے ابو کریب نے بیان کیا, ( عبید اللہ بن عبد الرحمٰن ) اشجعی اور ابو احمد دونوں نے سفیان سے اسی سند کے ساتھ حدیث بیان کی مگر ان دونوں کی سفیان سے مروی حدیث میں ہے",
                "hadithArabic": "و حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا الْأَشْجَعِيُّ و حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ حَدَّثَنَا أَبُو أَحْمَدَ كِلَاهُمَا عَنْ سُفْيَانَ بِهَذَا الْإِسْنَادِ غَيْرَ أَنَّ فِي حَدِيثِهِمَا عَنْ سُفْيَانَ وَمَا شَبِعْنَا مِنْ الْأَسْوَدَيْنِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "54",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 154,
                    "chapterNumber": "54",
                    "chapterEnglish": "The Book of Zuhd and Softening of Hearts",
                    "chapterUrdu": "زہد اور رقت انگیز باتیں",
                    "chapterArabic": "كتاب الزُّهْدِ وَالرَّقَائِقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 15018,
                "hadithNumber": "7457",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "By Him in Whose Hand is my life and Ibn 'Abbad also said: By One in Whose hand is the life of Abu Huraira رضی اللہ عنہ , Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) could not afford to provide adequate food to his family which could (fill their bellies) with bread and wheat for three days successively until he left the world.",
                "hadithUrdu": "اس ذات کی قسم جس کے ہاتھ میں میری جان ہے!جبکہ ابن عباد نے کہا : اس ذات کی قسم جس کے ہاتھ میں ابو ہریرہ رضی اللہ عنہ کی جان ہے! ۔ رسول اللہ صلی اللہ علیہ وسلم نے کبھی اپنے گھروالوں کو تین لگاتار گندم کی روٹی پیٹ بھر کر نہیں کھلائی تھی یہاں تک کہ آپ دنیا سے تشریف لے گئے ۔",
                "urduNarrator": "محمد بن عباد اور ابن ابی عمر نے ہمیں حدیث بیان کی ، کہا : ہمیں مروان فزاری نے یزید بن کیسان سے حدیث بیان کی ، انھوں نے ابو حازم سے اور انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبَّادٍ وَابْنُ أَبِي عُمَرَ قَالَا حَدَّثَنَا مَرْوَانُ يَعْنِيَانِ الْفَزَارِيَّ عَنْ يَزِيدَ وَهُوَ ابْنُ كَيْسَانَ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَ وَالَّذِي نَفْسِي بِيَدِهِ و قَالَ ابْنُ عَبَّادٍ وَالَّذِي نَفْسُ أَبِي هُرَيْرَةَ بِيَدِهِ مَا أَشْبَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَهْلَهُ ثَلَاثَةَ أَيَّامٍ تِبَاعًا مِنْ خُبْزِ حِنْطَةٍ حَتَّى فَارَقَ الدُّنْيَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "54",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 154,
                    "chapterNumber": "54",
                    "chapterEnglish": "The Book of Zuhd and Softening of Hearts",
                    "chapterUrdu": "زہد اور رقت انگیز باتیں",
                    "chapterArabic": "كتاب الزُّهْدِ وَالرَّقَائِقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 15019,
                "hadithNumber": "7458",
                "englishNarrator": "Abu Hazim reported:",
                "hadithEnglish": "I saw Abu Huraira رضی اللہ عنہ point with his finger many a time and saying: By One in Whose Hand is the life of Abu Huraira رضی اللہ عنہ, Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) could not eat to his fill and provide his family bread of wheat beyond three days successively until he left the world.",
                "hadithUrdu": "میں نے حضرت ابو ہریرہ رضی اللہ عنہ کو کئی بار دیکھا وہ انگلی سے اشارہ کرتے تھے کہتے تھے اس ذات کی قسم جس کے ہاتھ میں ابوہریرہ رضی اللہ عنہ کی جان ہے !اللہ کے نبی صلی اللہ علیہ وسلم اور آپ کے گھروالوں نے کبھی لگاتار تین دن گندم کی روٹی سیر ہوکر نہیں کھائی تھی یہاں تک کہ آپ دنیا سے رخصت ہو گئے ۔",
                "urduNarrator": "مجھ سے محمد بن حاتم نے بیان کیا, یحییٰ بن سعید نے ہمیں یزید بن کیسان سے حدیث بیان کی ، انھوں نےکہا : مجھے حازم نے حدیث بیان کی کہا",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ يَزِيدَ بْنِ كَيْسَانَ حَدَّثَنِي أَبُو حَازِمٍ قَالَ رَأَيْتُ أَبَا هُرَيْرَةَ يُشِيرُ بِإِصْبَعِهِ مِرَارًا يَقُولُ وَالَّذِي نَفْسُ أَبِي هُرَيْرَةَ بِيَدِهِ مَا شَبِعَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَهْلُهُ ثَلَاثَةَ أَيَّامٍ تِبَاعًا مِنْ خُبْزِ حِنْطَةٍ حَتَّى فَارَقَ الدُّنْيَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "54",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 154,
                    "chapterNumber": "54",
                    "chapterEnglish": "The Book of Zuhd and Softening of Hearts",
                    "chapterUrdu": "زہد اور رقت انگیز باتیں",
                    "chapterArabic": "كتاب الزُّهْدِ وَالرَّقَائِقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 15020,
                "hadithNumber": "7459",
                "englishNarrator": "Nu'man bin Bashir رضی اللہ عنہ said:",
                "hadithEnglish": "Don't you eat and drink according to your heart's desire, whereas I saw that your Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) (at times) could not find even an inferior quality of the dates with which he could fill his belly? Qutaiba, however, did not make a mention of It.",
                "hadithUrdu": "کیا تم لوگوں کو اپنی مرضی کا کھانا اور پینا میسر نہیں ؟میں نے تمھارے نبی صلی اللہ علیہ وسلم کو دیکھا تھا آپ کے پاس روٹی کھجور بھی اتنی نہیں ہو تی تھی جس سے آپ اپنا پیٹ بھر لیں ۔ اور قتیبہ نےبہ ( جس سے ) کا ذکر نہیں کیا ۔",
                "urduNarrator": "قتیبہ بن سعید اور ابو بکر بن ابی شیبہ نے کہا : ہمیں ابو احوص نے سماک بن حرب سے حدیث بیان کی ، انھوں نے کہا : میں نے حضرت نعمان بن بشیر رضی اللہ عنہ کو یہ کہتے ہوئے سنا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَا حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ سِمَاكٍ قَالَ سَمِعْتُ النُّعْمَانَ بْنَ بَشِيرٍ يَقُولُ أَلَسْتُمْ فِي طَعَامٍ وَشَرَابٍ مَا شِئْتُمْ لَقَدْ رَأَيْتُ نَبِيَّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَا يَجِدُ مِنْ الدَّقَلِ مَا يَمْلَأُ بِهِ بَطْنَهُ وَقُتَيْبَةُ لَمْ يَذْكُرْ بِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "54",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 154,
                    "chapterNumber": "54",
                    "chapterEnglish": "The Book of Zuhd and Softening of Hearts",
                    "chapterUrdu": "زہد اور رقت انگیز باتیں",
                    "chapterArabic": "كتاب الزُّهْدِ وَالرَّقَائِقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 15021,
                "hadithNumber": "7460",
                "englishNarrator": "This hadith has been narrated on the authority of Simak with the same chain of transmitters, with this addition of words:",
                "hadithEnglish": "You are not satisfied with the qualities of dates and butter.",
                "hadithUrdu": "تم کھجوروں اور مکھن کی کئی قسموں کے بغیر راضی نہیں ہوتے ۔",
                "urduNarrator": "ہم سے محمد بن رافع نے بیان کیا، ہم سے یحییٰ بن آدم نے بیان کیا, زہیر اور اسرائیل دونوں نے سماک سے اسی سند کے ساتھ اسی کے مطابق حدیث بیان کی اور زہیر کی حدیث میں مزید ہے اور",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا زُهَيْرٌ و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا الْمُلَائِيُّ حَدَّثَنَا إِسْرَائِيلُ كِلَاهُمَا عَنْ سِمَاكٍ بِهَذَا الْإِسْنَادِ نَحْوَهُ وَزَادَ فِي حَدِيثِ زُهَيْرٍ وَمَا تَرْضَوْنَ دُونَ أَلْوَانِ التَّمْرِ وَالزُّبْدِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "54",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 154,
                    "chapterNumber": "54",
                    "chapterEnglish": "The Book of Zuhd and Softening of Hearts",
                    "chapterUrdu": "زہد اور رقت انگیز باتیں",
                    "chapterArabic": "كتاب الزُّهْدِ وَالرَّقَائِقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 15022,
                "hadithNumber": "7461",
                "englishNarrator": "Simak bin Barb reported:",
                "hadithEnglish": "I heard Nu'man رضی اللہ عنہ deliver an address in which he said that (Hadrat) Umar رضی اللہ عنہ made a mention of what had fallen to the lot of people out of the material world and he said: I saw Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) spend the whole day being upset because of hunger and he could not get even an interior quality of dates with which he could fill his belly.",
                "hadithUrdu": "میں نے حضرت نعمان بن بشیر رضی اللہ عنہ کو خطبہ دیتے ہوئے سنا کہا : حضرت عمر رضی اللہ عنہ نے اس بات کا ذکر کیا کہ لوگوں نے دنیا میں سے کیا کچھ حاصل کر لیاہے ۔ پھر فرمایا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا تھا آپ پورا دن بھوک لوٹتے تھے اور آپ کو سوکھی ہوئی اتنی سخت کھجور بھی میسر نہ ہوتی تھی جس سے اپنا پیٹ بھر لیتے ۔",
                "urduNarrator": "ہم سے محمد بن المثنیٰ اور ابن بشار نے بیان کیا اور قول ابن المثنیٰ کا ہے, انہوں نے کہا: ہم سے محمد بن جعفر نے بیان کیا, شعبہ نے سماک بن حرب سے حدیث بیان کی ، کہا",
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ وَاللَّفْظُ لِابْنِ الْمُثَنَّى قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ سِمَاكِ بْنِ حَرْبٍ قَالَ سَمِعْتُ النُّعْمَانَ يَخْطُبُ قَالَ ذَكَرَ عُمَرُ مَا أَصَابَ النَّاسُ مِنْ الدُّنْيَا فَقَالَ لَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَظَلُّ الْيَوْمَ يَلْتَوِي مَا يَجِدُ دَقَلًا يَمْلَأُ بِهِ بَطْنَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "54",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 154,
                    "chapterNumber": "54",
                    "chapterEnglish": "The Book of Zuhd and Softening of Hearts",
                    "chapterUrdu": "زہد اور رقت انگیز باتیں",
                    "chapterArabic": "كتاب الزُّهْدِ وَالرَّقَائِقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 15023,
                "hadithNumber": "7462",
                "englishNarrator": "Abdul-Rahman al-Hubuli reported:",
                "hadithEnglish": "I heard that a person asked 'Abdullah b. 'Amr bin 'As رضی اللہ عنہ and heard him saying: Are we not amongst the destitute of the emigrants? Abdullah رضی اللہ عنہ said to him: Have you a spouse with whom you live? He said: Yes. Abdullah رضی اللہ عنہ asked: Do you not have a home in which you reside? The man replied Yes. Abdullah said: Then you are amongst the rich. He said: I have a servant also. Thereupon he (Abdullah b. 'Amr b. 'As) said: Then you are amongst the kings.",
                "hadithUrdu": "میں نے حضرت عبداللہ بن عمرو بن عاص رضی اللہ عنہ سے سنا ان سے کسی آدمی نے پوچھا تھا کیا : ہم فقراء مہاجرین میں سے نہیں ہیں؟تو حضرت عبد اللہ رضی اللہ عنہ نے اس سے کہا : کیا تمھاری بیوی ہے جس کے پاس تم آرام کرنے کے لیے جاتے ہو ۔ \" اس نے کہا : ہاں پوچھا : کیا تمھارے پاس رہائش گاہ ہےجہاں تم رہتے ہو؟ اس نے کہا : میرے پاس تو خادم ( بھی ) ہے کہا : پھر تو تم بادشاہوں میں سے ہو ۔",
                "urduNarrator": "مجھ سے ابو الطاہر احمد بن عمرو بن سرح نے بیان کیا، ہم سے ابن وہب نے بیان کیا, ابو ہانی نے ابو عبد الرحمٰن کو کہتے ہوئے سنا",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي أَبُو هَانِئٍ سَمِعَ أَبَا عَبْدِ الرَّحْمَنِ الْحُبُلِيَّ يَقُولُ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ وَسَأَلَهُ رَجُلٌ فَقَالَ أَلَسْنَا مِنْ فُقَرَاءِ الْمُهَاجِرِينَ فَقَالَ لَهُ عَبْدُ اللَّهِ أَلَكَ امْرَأَةٌ تَأْوِي إِلَيْهَا قَالَ نَعَمْ قَالَ أَلَكَ مَسْكَنٌ تَسْكُنُهُ قَالَ نَعَمْ قَالَ فَأَنْتَ مِنْ الْأَغْنِيَاءِ قَالَ فَإِنَّ لِي خَادِمًا قَالَ فَأَنْتَ مِنْ الْمُلُوكِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "54",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 154,
                    "chapterNumber": "54",
                    "chapterEnglish": "The Book of Zuhd and Softening of Hearts",
                    "chapterUrdu": "زہد اور رقت انگیز باتیں",
                    "chapterArabic": "كتاب الزُّهْدِ وَالرَّقَائِقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 15024,
                "hadithNumber": "7463",
                "englishNarrator": "Abu 'Abdul-Rahman reported:",
                "hadithEnglish": "Three persons came to 'Abdullah bin Amr bin 'As رضی اللہ عنہ while I was sitting with him and they said: By Allah, we have nothing with us either in the form of provision, riding animals or wealth. Thereupon he said to them: I am prepared to do whatever you like. If you come to us, we would give you what Allah would make available for you. and if you like I would make a mention of your case to the ruler, and if you like you can show patience also. for I have heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The destitute amongst the emigrants would precede the rich emigrants by forty years in getting into Paradise on the Day of Resurrection. Thereupon they said: We then, show patience and do not ask for anything.",
                "hadithUrdu": "حضرت عبد اللہ بن عمرو بن عاص رضی اللہ عنہ کے پاس تین شخص آئے جبکہ میں ان کے ہاں تھا وہ کہنے لگے : ابو محمد !اللہ کی قسم! ہمیں کوئی چیز میسر نہیں ہے نہ خرچ نہ سواری اور نہ اور نہ سامان ( وہ لوگ واقعتاًفقیر تھے ) حضرت عبد اللہ رضی اللہ  عنہ نے ان سے کہا : تم کیا چاہتے ہو؟اگر تم پسند کرو تو دوبارہ ہمارے پاس آؤ اللہ تعالیٰ جو تمھارےلیے مہیاکرے گا ہم تمھیں دے دیں گے ۔ اگر چاہو تو ہم تمھاراذکر بااختیار حاکم کے پاس کردیں گے ۔ ( وہ تمھاری ضرورتوں کا خیال رکھے گا ) اور اگر تم چاہو تو صبر کرومیں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : \" بے شک ہجرت کر کے آنے والے فقیر قیامت کے روز اغنیاء کی نسبت چالیس سال پہلے جنت میں جا ئیں گے ۔ ان ( صحابہ کرام رضوان اللہ عنھم اجمعین ) نے کہا : ہم صبر کریں گے ۔ کوئی چیز نہیں مانگیں گے ۔",
                "urduNarrator": "ابو عبد الرحمن نے کہا",
                "hadithArabic": "قَالَ أَبُو عَبْدِ الرَّحْمَنِ وَجَاءَ ثَلَاثَةُ نَفَرٍ إِلَى عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ وَأَنَا عِنْدَهُ فَقَالُوا يَا أَبَا مُحَمَّدٍ إِنَّا وَاللَّهِ مَا نَقْدِرُ عَلَى شَيْءٍ لَا نَفَقَةٍ وَلَا دَابَّةٍ وَلَا مَتَاعٍ فَقَالَ لَهُمْ مَا شِئْتُمْ إِنْ شِئْتُمْ رَجَعْتُمْ إِلَيْنَا فَأَعْطَيْنَاكُمْ مَا يَسَّرَ اللَّهُ لَكُمْ وَإِنْ شِئْتُمْ ذَكَرْنَا أَمْرَكُمْ لِلسُّلْطَانِ وَإِنْ شِئْتُمْ صَبَرْتُمْ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ فُقَرَاءَ الْمُهَاجِرِينَ يَسْبِقُونَ الْأَغْنِيَاءَ يَوْمَ الْقِيَامَةِ إِلَى الْجَنَّةِ بِأَرْبَعِينَ خَرِيفًا قَالُوا فَإِنَّا نَصْبِرُ لَا نَسْأَلُ شَيْئًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "54",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 154,
                    "chapterNumber": "54",
                    "chapterEnglish": "The Book of Zuhd and Softening of Hearts",
                    "chapterUrdu": "زہد اور رقت انگیز باتیں",
                    "chapterArabic": "كتاب الزُّهْدِ وَالرَّقَائِقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 15025,
                "hadithNumber": "7464",
                "englishNarrator": "Abdullah bin Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said in connection with the people of Hijr (Thamud): Do not enter but weepingly (the habitations) of these people who had been punished by (Allah), and in case you do not feel inclined to weep, then do not enter (these habitations) that you may not meet the same calamity as had fallen to their lot.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے اصحاب حجرکے متعلق فرمایا : \" ان عذاب دیے گئے لوگوں کے ہاں ( ان کے گھروں میں داخل نہ ہو نا مگر اس صورت میں کہ تم ( اللہ کےغضب کے ڈرسے ) رورہے ہو ۔ اگر تم رو نہیں رہے ہوتو ان کے ہاں داخل نہ ہونا ایسا نہ ہو کہ تم پر بھی وہی عذاب آجا ئے جو ان پر آیاتھا ۔",
                "urduNarrator": "ہم سے یحییٰ بن ایوب، قتیبہ بن سعید اور علی بن حجر نے اسماعیل کی سند سے بیان کیا۔ ابن ایوب نے کہا: ہم سے اسماعیل بن جعفر نے بیان کیا, عبد اللہ بن دینار نے حضرت عبد اللہ بن عمرو رضی اللہ عنہ کو کہتے ہوئے سنا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ بْنُ سَعِيدٍ وَعَلِيُّ بْنُ حُجْرٍ جَمِيعًا عَنْ إِسْمَعِيلَ قَالَ ابْنُ أَيُّوبَ حَدَّثَنَا إِسْمَعِيلُ بْنُ جَعْفَرٍ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ دِينَارٍ أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عُمَرَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأَصْحَابِ الْحِجْرِ لَا تَدْخُلُوا عَلَى هَؤُلَاءِ الْقَوْمِ الْمُعَذَّبِينَ إِلَّا أَنْ تَكُونُوا بَاكِينَ فَإِنْ لَمْ تَكُونُوا بَاكِينَ فَلَا تَدْخُلُوا عَلَيْهِمْ أَنْ يُصِيبَكُمْ مِثْلُ مَا أَصَابَهُمْ.",
                "headingArabic": "لاَ تَدْخُلُوا مَسَاكِنَ الَّذِينَ ظَلَمُوا أَنْفُسَهُمْ إِلاَّ أَنْ تَكُونُوا بَاكِينَ ‏.‏",
                "headingUrdu": "اہل حجر پر داخل ہونے کی ممانعت جب تک کہ کوئی روتے ہوئے داخل نہ ہو۔",
                "headingEnglish": "The Prohibition Of Entering Upon The People Of Al-Hijr (The Rocky Tract) Unless One Enters Weeping",
                "chapterId": "54",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 154,
                    "chapterNumber": "54",
                    "chapterEnglish": "The Book of Zuhd and Softening of Hearts",
                    "chapterUrdu": "زہد اور رقت انگیز باتیں",
                    "chapterArabic": "كتاب الزُّهْدِ وَالرَّقَائِقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 15026,
                "hadithNumber": "7465",
                "englishNarrator": "Ibn Shihab reported:",
                "hadithEnglish": "He had been talking about the stony abodes of Thamud, and he said: Salim bin 'Abdullah reported that 'Abdullah bin Umar رضی اللہ عنہ said: We were passing along with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) through the habitations of Hijr, and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Do not enter but weepingly the habitations of these persons who committed tyranny among themselves, lest the same calamity should fall upon you as it fell upon them. He then urged his mount to proceed quickly and pass through that valley hurriedly.",
                "hadithUrdu": "جب وہ ثمود کے مکانات الحجر کا ذکر کر رہے تھے, سالم بن عبد اللہ نے کہا کہ حضرت عبد اللہ بن عمر رضی اللہ عنہ نے کہا :ہم رسول اللہ صلی اللہ علیہ وسلم کے ہمراہ حجر ( قوم ثمود کی اجڑی ہوئی بستی ) کے پاس سے گزرے تو رسول اللہ صلی اللہ علیہ وسلم نے ہم سے فرمایا : \" جن لوگوں نے اپنے آپ پر ظلم کیا ہے ان کی رہائش گا ہوں میں داخل نہ ہونا مگر اس طرح کہ تم رورہے ہو ۔ ڈرہے کہ تمھیں بھی وہی عذاب نہ آئےجس نے انھیں آلیا تھا \" پھر آپ نے زور سے سواری کو ہانکا رفتار تیز کی یہاں تک کہ اس جگہ کو پیچھے چھوڑ دیا ۔",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، مجھ سے یونس نے بیان کیا، ابن شہاب کی سند سے",
                "hadithArabic": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ وَهُوَ يَذْكُرُ الْحِجْرَ مَسَاكِنَ ثَمُودَ قَالَ سَالِمُ بْنُ عَبْدِ اللَّهِ إِنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ قَالَ مَرَرْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْحِجْرِ فَقَالَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَدْخُلُوا مَسَاكِنَ الَّذِينَ ظَلَمُوا أَنْفُسَهُمْ إِلَّا أَنْ تَكُونُوا بَاكِينَ حَذَرًا أَنْ يُصِيبَكُمْ مِثْلُ مَا أَصَابَهُمْ ثُمَّ زَجَرَ فَأَسْرَعَ حَتَّى خَلَّفَهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "54",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 154,
                    "chapterNumber": "54",
                    "chapterEnglish": "The Book of Zuhd and Softening of Hearts",
                    "chapterUrdu": "زہد اور رقت انگیز باتیں",
                    "chapterArabic": "كتاب الزُّهْدِ وَالرَّقَائِقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 15027,
                "hadithNumber": "7466",
                "englishNarrator": "Abdullah bin 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "The people encamped along with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) in the valley of Hijr, the habitations of Thamud, and they quenched their thirst from the wells thereof and kneaded the flour with it. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) commanded that the water collected for drinking should be spilt and the flour should be given to the camels and commanded them that the water for drinking should be taken from that well where the she-camel (of Hadrat Salih) used to come.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے ہمراہ ( سفر کرنے والے لوگ سرزمین ثمود حجر میں اتر گئے اور وہاں کے کنوؤں سے پانی حاصل کیا اور اس کے ساتھ آٹا ( بھی ) گوندھ لیا ۔ رسول اللہ صلی اللہ علیہ وسلم نے انھیں حکم دیاکہ انھوں نے جو پانی بھراہے وہ بہادیں اورگندھا ہوا آٹا اونٹوں کو کھلا دیں اور ان سے کہا : کہ وہ اس کنویں سے پانی حاصل کریں جہاں ( حضرت صالح رضی اللہ تعالیٰ عنہ کی ) اونٹنی پانی پینے کے لیے آیا کرتی تھی ۔",
                "urduNarrator": "مجھ سے الحکم بن موسیٰ ابوصالح نے بیان کیا, شعیب بن اسحٰق نے کہا : ہمیں عبید اللہ نے نافع سے خبر دی انھیں حضرت عبد اللہ بن عمر رضی اللہ عنہ نے بتایا کہ",
                "hadithArabic": "حَدَّثَنِي الْحَكَمُ بْنُ مُوسَى أَبُو صَالِحٍ حَدَّثَنَا شُعَيْبُ بْنُ إِسْحَقَ أَخْبَرَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ أَخْبَرَهُ أَنَّ النَّاسَ نَزَلُوا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْحِجْرِ أَرْضِ ثَمُودَ فَاسْتَقَوْا مِنْ آبَارِهَا وَعَجَنُوا بِهِ الْعَجِينَ فَأَمَرَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُهَرِيقُوا مَا اسْتَقَوْا وَيَعْلِفُوا الْإِبِلَ الْعَجِينَ وَأَمَرَهُمْ أَنْ يَسْتَقُوا مِنْ الْبِئْرِ الَّتِي كَانَتْ تَرِدُهَا النَّاقَةُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "54",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 154,
                    "chapterNumber": "54",
                    "chapterEnglish": "The Book of Zuhd and Softening of Hearts",
                    "chapterUrdu": "زہد اور رقت انگیز باتیں",
                    "chapterArabic": "كتاب الزُّهْدِ وَالرَّقَائِقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 15028,
                "hadithNumber": "7467",
                "englishNarrator": null,
                "hadithEnglish": "'Ubaidullah narrated with this chain of narrators (a Hadith similar to no. 7466) except that he said: \"Draw water from its well and make dough with it.\"",
                "hadithUrdu": "اور ہم سے اسحاق بن موسیٰ الانصاری نے بیان کیا, انس بن عیاض نے کہا : مجھے عبید اللہ نے اسی سند کے ساتھ اسی کے مانند روایت کی ، مگر انھوں نے ( الفاظ کی تبدیلی سے ) کہا : فاستقوا من بئارها واعتجنوا به ( معنی میں کوئی فرق نہیں ۔ )",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا إِسْحَقُ بْنُ مُوسَى الْأَنْصَارِيُّ حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ حَدَّثَنِي عُبَيْدُ اللَّهِ بِهَذَا الْإِسْنَادِ مِثْلَهُ غَيْرَ أَنَّهُ قَالَ فَاسْتَقَوْا مِنْ بِئَارِهَا وَاعْتَجَنُوا بِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "54",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 154,
                    "chapterNumber": "54",
                    "chapterEnglish": "The Book of Zuhd and Softening of Hearts",
                    "chapterUrdu": "زہد اور رقت انگیز باتیں",
                    "chapterArabic": "كتاب الزُّهْدِ وَالرَّقَائِقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 15029,
                "hadithNumber": "7468",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: One who makes efforts (for earning to be spent) on a widow and the destitute is like a striver in the cause of Allah, and I think he also said: He is like one who constantly stands for prayer and observes fast without breaking it.",
                "hadithUrdu": "آپ ﷺنے فرمایا : \" بیوہ اورمسکین کے لیے محنت کرنے والا اللہ کی راہ میں جہاد کرنے والے کی طرح ہے ۔ اور میرا ( عبد اللہ بن مسلمہ کا ) خیال ہے کہ انھوں ( مالک رحمۃ اللہ علیہ ) نے کہا : وہ ( اللہ کے سامنے ) اس قیام کرنے والے کی طرح ہے جو وقفہ کرتا ہے نہ تھکتا ہے اور اس روزے دار کی طرح ہے جو روزہ نہیں چھوڑتا ۔ \"",
                "urduNarrator": "عبد اللہ بن مسلمہ بن قعنب نے ہمیں حدیث بیان کی ، کہا : ہمیں امام مالک رحمۃ اللہ علیہ نے ثور بن زید سے حدیث بیان کی ، انھوں نے ابو غیث سے انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ حَدَّثَنَا مَالِكٌ عَنْ ثَوْرِ بْنِ زَيْدٍ عَنْ أَبِي الْغَيْثِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ السَّاعِي عَلَى الْأَرْمَلَةِ وَالْمِسْكِينِ كَالْمُجَاهِدِ فِي سَبِيلِ اللَّهِ وَأَحْسِبُهُ قَالَ وَكَالْقَائِمِ لَا يَفْتُرُ وَكَالصَّائِمِ لَا يُفْطِرُ.",
                "headingArabic": "الإِحْسَانِ إِلَى الأَرْمَلَةِ وَالْمِسْكِينِ وَالْيَتِيمِ",
                "headingUrdu": "بیواؤں، غریبوں اور یتیموں کے ساتھ حسن سلوک کی فضیلت",
                "headingEnglish": "The Virtue Of Treating Widows, The Poor And Orphans Kindly",
                "chapterId": "54",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 154,
                    "chapterNumber": "54",
                    "chapterEnglish": "The Book of Zuhd and Softening of Hearts",
                    "chapterUrdu": "زہد اور رقت انگیز باتیں",
                    "chapterArabic": "كتاب الزُّهْدِ وَالرَّقَائِقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 15030,
                "hadithNumber": "7469",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: One who looks after the orphan whether he is his relative or not, I and he would be together in Paradise like this, and Malik (explained it) with the gesture by drawing his index finger and middle finger close together.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" یتیم کی پرورش کرنے والا اس کا اپنا ( رشتہ دار ) ہو یا غیر ہو میں اور وہ جنت میں اس طرح ہوں گے ۔ \" پھر امام مالک رحمۃ اللہ علیہ نے انگشت شہادت اور درمیان انگلی ( کو ملاکر اس ) کے ساتھ اشارہ کیا ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا, اسحٰق بن عیسیٰ نے کہا , ہمیں امام مالک رحمۃ اللہ علیہ نےثور بن یزید سے حدیث بیان کی انھوں نے کہا : میں نے ابو غیث کو حضرت ابو ہریرہ رضی اللہ عنہ سے حدیث بیان کرتے ہوئے سنا انھوں نے کہا",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا إِسْحَقُ بْنُ عِيسَى حَدَّثَنَا مَالِكٌ عَنْ ثَوْرِ بْنِ زَيْدٍ الدِّيلِيِّ قَالَ سَمِعْتُ أَبَا الْغَيْثِ يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَافِلُ الْيَتِيمِ لَهُ أَوْ لِغَيْرِهِ أَنَا وَهُوَ كَهَاتَيْنِ فِي الْجَنَّةِ وَأَشَارَ مَالِكٌ بِالسَّبَّابَةِ وَالْوُسْطَى.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "54",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 154,
                    "chapterNumber": "54",
                    "chapterEnglish": "The Book of Zuhd and Softening of Hearts",
                    "chapterUrdu": "زہد اور رقت انگیز باتیں",
                    "chapterArabic": "كتاب الزُّهْدِ وَالرَّقَائِقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 15031,
                "hadithNumber": "7470",
                "englishNarrator": "Abdullah al-Khaulani reported:",
                "hadithEnglish": "When Uthman bin 'Affan رضی اللہ عنہ tried to rebuild the mosque of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) the people began to talk about this. Uthman bin 'Affan رضی اللہ عنہ said: You discuss it very much whereas I have heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: He who builds a mosque-- and the narrator Bukair said: I think he also said: (for) seeking the pleasure of Allah- Allah would build (a similar house for him in Paradise). and in the narration of Harun (the words are): A house for him in Paradise.",
                "hadithUrdu": "انھوں نے حضرت عثمان بن عفان رضی اللہ عنہ سے جب رسول اللہ صلی اللہ علیہ وسلم کی مسجد کی تعمیر ( نو ) کے وقت لوگوں نے ان کو باتیں کیں سنا ( وہ کہہ رہے تھے ) تم لوگوں نے بہت باتیں کی ہیں جبکہ میں نے رسول اللہ صلی اللہ علیہ وسلم کوفرماتے ہوئے سناتھا : \" جس نے مسجد کی تعمیر کی ۔ بکیر نے کہا : میراخیال ہے کہ انھوں ( عاصم ) نے یہ جملہ بھی کہا : ۔ اس سے وہ اللہ کی رضا چاہتا ہے تو اللہ اس کے لیے جنت میں اس جیسا ( گھر ) بنائے گا ۔ اور ہارون کی روایت میں ہے : \" اللہ تعالیٰ اس کے لیے جنت میں گھر بنائے گا ۔",
                "urduNarrator": "ہارون بن سعید ایلی اور احمد بن عیسیٰ نے مجھے حدیث بیان کی ، دونوں نے کہا : ہمیں ( عبد اللہ ) ابن وہب نے حدیث بیان کی ، کہا : مجھے عمرو بن حارث نے بتایا کہ بکیر نے انھیں حدیث بیان کی ، انھیں عاصم بن عمربن قتادہ نے حدیث بیان کی کہ انھوں نے عبید اللہ خولانی کو بیان کرتے ہوئے سناکہ کہ",
                "hadithArabic": "حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ وَأَحْمَدُ بْنُ عِيسَى قَالَا حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو وَهُوَ ابْنُ الْحَارِثِ أَنَّ بُكَيْرًا حَدَّثَهُ أَنَّ عَاصِمَ بْنَ عُمَرَ بْنِ قَتَادَةَ حَدَّثَهُ أَنَّهُ سَمِعَ عُبَيْدَ اللَّهِ الْخَوْلَانِيَّ يَذْكُرُ أَنَّهُ سَمِعَ عُثْمَانَ بْنَ عَفَّانَ عِنْدَ قَوْلِ النَّاسِ فِيهِ حِينَ بَنَى مَسْجِدَ الرَّسُولِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّكُمْ قَدْ أَكْثَرْتُمْ وَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ بَنَى مَسْجِدًا قَالَ بُكَيْرٌ حَسِبْتُ أَنَّهُ قَالَ يَبْتَغِي بِهِ وَجْهَ اللَّهِ بَنَى اللَّهُ لَهُ مِثْلَهُ فِي الْجَنَّةِ وَفِي رِوَايَةِ هَارُونَ بَنَى اللَّهُ لَهُ بَيْتًا فِي الْجَنَّةِ.",
                "headingArabic": "فَضْلِ بِنَاءِ الْمَسَاجِدِ",
                "headingUrdu": "مسجد بنانے کی فضیلت",
                "headingEnglish": "The Virtue Of Building Masajid",
                "chapterId": "54",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 154,
                    "chapterNumber": "54",
                    "chapterEnglish": "The Book of Zuhd and Softening of Hearts",
                    "chapterUrdu": "زہد اور رقت انگیز باتیں",
                    "chapterArabic": "كتاب الزُّهْدِ وَالرَّقَائِقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 15032,
                "hadithNumber": "7471",
                "englishNarrator": "Mahmud bin Labid reported:",
                "hadithEnglish": "'Uthman bin 'Affan رضی اللہ عنہ decided to rebuild the mosque (of Allah's Apostle in Medina) but the people did not like this idea and they wished that it should be preserved in the same (old) form. Thereupon he (Hadrat 'Uthman رضی اللہ عنہ ) said: I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: He who builds a mosque for Allah, Allah would build for him (a house) in Paradise like it.",
                "hadithUrdu": "حضرت عثمان بن عفان رضی اللہ عنہ نے مسجد بنانے کا ارداہ کیا تو لوگوں نے اس کو ناپسند کیا ۔ وہ چاہتے تھے کہ اس ( مسجد ) کو اس کی اصل حالت پر رہنے دیا جائے تو انھوں ( عثمان رضی اللہ تعالیٰ عنہ ) نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : \" جس نے اللہ کے لیے مسجد بنائی اللہ تعالیٰ اس کے لیے جنت میں اس کے مانند گھر بنائے گا ۔ \"",
                "urduNarrator": "ہم سے زہیر بن حرب اور محمد بن المثنیٰ نے بیان کیا, ضحاک بن مخلد نے ہمیں حدیث بیان کی ، کہا : ہمیں عبد الحمید بن جعفر نے خبر دی کہا : ہمیں میرے والد نے محمود بن لبید سے حدیث بیان کی کہ",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَمُحَمَّدُ بْنُ الْمُثَنَّى كِلَاهُمَا عَنْ الضَّحَّاكِ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا الضَّحَّاكُ بْنُ مَخْلَدٍ أَخْبَرَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ حَدَّثَنِي أَبِي عَنْ مَحْمُودِ بْنِ لَبِيدٍ أَنَّ عُثْمَانَ بْنَ عَفَّانَ أَرَادَ بِنَاءَ الْمَسْجِدِ فَكَرِهَ النَّاسُ ذَلِكَ وَأَحَبُّوا أَنْ يَدَعَهُ عَلَى هَيْئَتِهِ فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ بَنَى مَسْجِدًا لِلَّهِ بَنَى اللَّهُ لَهُ فِي الْجَنَّةِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "54",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 154,
                    "chapterNumber": "54",
                    "chapterEnglish": "The Book of Zuhd and Softening of Hearts",
                    "chapterUrdu": "زہد اور رقت انگیز باتیں",
                    "chapterArabic": "كتاب الزُّهْدِ وَالرَّقَائِقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 15033,
                "hadithNumber": "7472",
                "englishNarrator": "This hadith has been narrated on the authority of Ja'far with the same chain of transmitters with this variation (that the words are):",
                "hadithEnglish": "Allah would build for him a house in Paradise.",
                "hadithUrdu": "\" اللہ اس کے لیے جنت میں گھربنائے گا ۔ \"",
                "urduNarrator": "اور ہم سے اسے اسحاق بن ابراہیم الحنظَلی نے روایت کیا ہے, ابو بکر حنفی اور عبدالملک بن صباح دونوں نے عبد الحمید بن جعفر سے اسی سند کے ساتھ خبر دی مگر ان دونوں کی حدیث میں ہے",
                "hadithArabic": "و حَدَّثَنَاه إِسْحَقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ حَدَّثَنَا أَبُو بَكْرٍ الْحَنَفِيُّ وَعَبْدُ الْمَلِكِ بْنُ الصَّبَّاحِ كِلَاهُمَا عَنْ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ بِهَذَا الْإِسْنَادِ غَيْرَ أَنَّ فِي حَدِيثِهِمَا بَنَى اللَّهُ لَهُ بَيْتًا فِي الْجَنَّةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "54",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 154,
                    "chapterNumber": "54",
                    "chapterEnglish": "The Book of Zuhd and Softening of Hearts",
                    "chapterUrdu": "زہد اور رقت انگیز باتیں",
                    "chapterArabic": "كتاب الزُّهْدِ وَالرَّقَائِقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 15034,
                "hadithNumber": "7473",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "While a person was in the wilderness he heard a voice from the cloud (commanding it thus): Irrigate the garden of so and so. (After that the clouds slinked aside and poured water on a stony ground. It filled a channel amongst the channels of that land and that person followed that water and he found a person standing in the garden busy in changing the course of water with the help of a hatchet. He said to him: Servant of Allah, what is your name? he said: So and so. And it was that very name which he had heard from the clouds. and he said to him: Servant of Allah, why do you ask me my name? He said: I heard a voice from the clouds of which is the downpour, saying: Water the garden of so and so, like your name. What do you do (for the favour) shown to you by Allah in this matter? He said: Now as you state so. I look what yield I get from it, and I give one-third as charity out of it and I and my children eat one-third of it and one-third I return to it as investment.",
                "hadithUrdu": "\" ایک دفعہ ایک شخص زمین میں ایک صحرائی ٹکڑے پر کھڑاتھا ۔ اس نے ایک بادل میں آوازسنی : \" فلاں کے باغ کو سیراب کرو ۔ \" وہ بادل ایک جانب بنا اور ایک پتھریلی زمین میں اپناپانی انڈیل دیا ۔ پانی کے بہاؤوالی ندیوں میں سے ایک ندی نے وہ ساراپانی اپنے اندر لے لیا ۔ وہ شخص پانی کے پیچھے پیچھے چل پڑا تو وہاں ایک آدمی اپنے باغ میں کھڑا اپنے کدال سے پانی کا رخ ( اپنے باغ کی طرف ) پھیررہا ہے ۔ اس نے اس سے کہا : اللہ کےبندے !تمھارا نام کیا ہے؟اس نے کہا : فلاں وہی نام جو اس نے بادل میں سنا تھا ۔ اس ( آدمی ) نے اس سے کہا : اللہ کے بندے!تم نے مجھ سے میرانام کیوں پوچھا ہے؟اس نے کہا : میں نے اس بادل میں جس کا یہ پانی ہے ( کسی کو ) یہ کہتے سناتھا ۔ فلاں کے باغ کو سیراب کرو تمھارا نام لیا تھا ۔ تم اس میں کیا کرتے ہو ۔ \" اس نے جواب دیا تم نے یہ بات کہہ دی ہے تو میں ( تمھیں بتادیتا ہوں ) اس باغ سے جو کچھ حاصل ہوتا ہےمیں اس پر نظر ڈال کر اس کا ایک تہائی حصہ صدقہ کردیتا ہوں ایک تہائی میں اور میرے گھروالے کھاتے ہیں ۔ اور ایک تہائی اسی ( باغ کی دیکھ بھال ) میں لگادیتا ہوں ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور زہیر بن حرب نے بیان کیا، اور الفاظ ابوبکر کا ہے، انہوں نے کہا: یزید بن ہارون نے ہمیں حدیث بیان کی ، کہا : ہمیں عبد العزیز بن ابو سلمہ نے وہب بن کیسان سے خبر دی انھوں نے عبید بن عمیر لیثی سے انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے اور نھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ آپ نے فرمایا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ وَاللَّفْظُ لِأَبِي بَكْرٍ قَالَا حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ عَنْ وَهْبِ بْنِ كَيْسَانَ عَنْ عُبَيْدِ بْنِ عُمَيْرٍ اللَّيْثِيِّ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ بَيْنَا رَجُلٌ بِفَلَاةٍ مِنْ الْأَرْضِ فَسَمِعَ صَوْتًا فِي سَحَابَةٍ اسْقِ حَدِيقَةَ فُلَانٍ فَتَنَحَّى ذَلِكَ السَّحَابُ فَأَفْرَغَ مَاءَهُ فِي حَرَّةٍ فَإِذَا شَرْجَةٌ مِنْ تِلْكَ الشِّرَاجِ قَدْ اسْتَوْعَبَتْ ذَلِكَ الْمَاءَ كُلَّهُ فَتَتَبَّعَ الْمَاءَ فَإِذَا رَجُلٌ قَائِمٌ فِي حَدِيقَتِهِ يُحَوِّلُ الْمَاءَ بِمِسْحَاتِهِ فَقَالَ لَهُ يَا عَبْدَ اللَّهِ مَا اسْمُكَ قَالَ فُلَانٌ لِلِاسْمِ الَّذِي سَمِعَ فِي السَّحَابَةِ فَقَالَ لَهُ يَا عَبْدَ اللَّهِ لِمَ تَسْأَلُنِي عَنْ اسْمِي فَقَالَ إِنِّي سَمِعْتُ صَوْتًا فِي السَّحَابِ الَّذِي هَذَا مَاؤُهُ يَقُولُ اسْقِ حَدِيقَةَ فُلَانٍ لِاسْمِكَ فَمَا تَصْنَعُ فِيهَا قَالَ أَمَّا إِذْ قُلْتَ هَذَا فَإِنِّي أَنْظُرُ إِلَى مَا يَخْرُجُ مِنْهَا فَأَتَصَدَّقُ بِثُلُثِهِ وَآكُلُ أَنَا وَعِيَالِي ثُلُثًا وَأَرُدُّ فِيهَا ثُلُثَهُ.",
                "headingArabic": "الصَّدَقَةِ فِي الْمَسَاكِينِ",
                "headingUrdu": "غریبوں اور مسافروں پر خرچ کرنے کی فضیلت",
                "headingEnglish": "The Virtue Of Spending On The Poor And Wayfarers",
                "chapterId": "54",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 154,
                    "chapterNumber": "54",
                    "chapterEnglish": "The Book of Zuhd and Softening of Hearts",
                    "chapterUrdu": "زہد اور رقت انگیز باتیں",
                    "chapterArabic": "كتاب الزُّهْدِ وَالرَّقَائِقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 15035,
                "hadithNumber": "7474",
                "englishNarrator": "This hadith has been narrated on the authority of Wahb bin Kaisan with the same chain of transmitters but with this change that he said:",
                "hadithEnglish": "I earmark one-third for the poor, the needy and the wayfarers.",
                "hadithUrdu": "اس کا ایک تہائی مسکینوں سوال کرنے والوں اور مسافر کے لیے مختص کردیتا ہوں ۔",
                "urduNarrator": "اور ہم سے احمد بن عبدہ الضَّبی نے بیان کیا ہے, ابو داود نے ہمیں خبر دی ہمیں عبد العزیز بن ابی سلمہ نے حدیث بیان کی انھوں نےکہا : ہمیں وہب بن کیسان نے اسی سند کے ساتھ حدیث بیان کی مگر انھوں نے ( اس طرح ) کہا",
                "hadithArabic": "و حَدَّثَنَاه أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ أَخْبَرَنَا أَبُو دَاوُدَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ حَدَّثَنَا وَهْبُ بْنُ كَيْسَانَ بِهَذَا الْإِسْنَادِ غَيْرَ أَنَّهُ قَالَ وَأَجْعَلُ ثُلُثَهُ فِي الْمَسَاكِينِ وَالسَّائِلِينَ وَابْنِ السَّبِيلِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "54",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 154,
                    "chapterNumber": "54",
                    "chapterEnglish": "The Book of Zuhd and Softening of Hearts",
                    "chapterUrdu": "زہد اور رقت انگیز باتیں",
                    "chapterArabic": "كتاب الزُّهْدِ وَالرَّقَائِقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 15036,
                "hadithNumber": "7475",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as stating that Allah the Most High and Exalted said: I am the One, One Who does not stand in need of a partner. If anyone does anything in which he associates anyone else with Me, I shall abandon him with one whom he associates with Allah.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ تعالیٰ نے ارشاد فرمایا کہ شریک بنائے جانے والوں میں سب سے زیادہ میں شراکت سے مستغنی ہوں ۔ جس شخص نے بھی کوئی عمل کیا اور اس میں میرے ساتھ کسی اور کوشریک کیا تو میں اسے اس کے شرک کے ساتھ اکیلاچھوڑدیتا ہوں ۔ \"",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، ہم سے اسماعیل بن ابراہیم نے بیان کیا، ہم سے روح بن قاسم نے بیان کیا، وہ علاء بن عبدالرحمٰن بن یعقوب سے اپنے والد کی سند سے, حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہا",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا رَوْحُ بْنُ الْقَاسِمِ عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ يَعْقُوبَ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اللَّهُ تَبَارَكَ وَتَعَالَى أَنَا أَغْنَى الشُّرَكَاءِ عَنْ الشِّرْكِ مَنْ عَمِلَ عَمَلًا أَشْرَكَ فِيهِ مَعِي غَيْرِي تَرَكْتُهُ وَشِرْكَهُ.",
                "headingArabic": "مَنْ أَشْرَكَ فِي عَمَلِهِ غَيْرَ اللَّهِ",
                "headingUrdu": "دکھاوے کی ممانعت",
                "headingEnglish": "The Prohibition On Showing Off",
                "chapterId": "54",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 154,
                    "chapterNumber": "54",
                    "chapterEnglish": "The Book of Zuhd and Softening of Hearts",
                    "chapterUrdu": "زہد اور رقت انگیز باتیں",
                    "chapterArabic": "كتاب الزُّهْدِ وَالرَّقَائِقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 15037,
                "hadithNumber": "7476",
                "englishNarrator": "Ibn Abbas رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: If anyone wants to have his deeds widely publicised, Allah will publicise (his humiliation). And if anyone makes a hypocritical display (of his deeds) Allah will make a display of him.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جو شخص ( اپناعمل لوگوں کو ) سناتا ہے اللہ اس کے بارے میں ( ہونے والا فیصلہ ) لوگوں کو سنائے گا ( اور اسے رسواکرے گا ) اور جو ( لوگوں کو ) دکھاتا پھرتا ہے اللہ تعالیٰ اس کے بارے میں لوگوں کو دکھا دے گا ۔ ( کہ اس کا انجام کیا ہوا )",
                "urduNarrator": "ہم سے عمر بن حفص بن غیاث نے بیان کیا، مجھ سے میرے والد نے اسماعیل بن سمیع کی سند سے، مسلم الباطن کی سند سے، سعید بن جبیر رضی اللہ عنہ کی سند سے بیان کیا, حضرت ابن عباس رضی اللہ عنہ سے روایت ہے کہا",
                "hadithArabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ حَدَّثَنِي أَبِي عَنْ إِسْمَعِيلَ بْنِ سُمَيْعٍ عَنْ مُسْلِمٍ الْبَطِينِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ سَمَّعَ سَمَّعَ اللَّهُ بِهِ وَمَنْ رَاءَى رَاءَى اللَّهُ بِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "54",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 154,
                    "chapterNumber": "54",
                    "chapterEnglish": "The Book of Zuhd and Softening of Hearts",
                    "chapterUrdu": "زہد اور رقت انگیز باتیں",
                    "chapterArabic": "كتاب الزُّهْدِ وَالرَّقَائِقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 15038,
                "hadithNumber": "7477",
                "englishNarrator": "Jundub رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who wants to publicise (his deeds), Allah will publicise (his humility), and he who makes a hypocritical display (of his deeds), Allah will make a display of him.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جو شخص ( لوگوں کو ) سناتاہے اللہ تعالیٰ اس کے بارے میں ( سب کو ) سنوائےگا اور جو ( اپناعمل ) لوگوں کو دکھاتا ہے اللہ تعالیٰ اس کے بارے میں لوگوں کو دکھائےگا ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, وکیع نے سفیان سے اور انھوں نے سلمہ بن کُہیل روایت کی , انھوں نے کہا : میں نے حضرت جندب علقی رضی اللہ عنہ سے سنا ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ قَالَ سَمِعْتُ جُنْدُبًا الْعَلَقِيَّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ يُسَمِّعْ يُسَمِّعْ اللَّهُ بِهِ وَمَنْ يُرَائِي يُرَائِي اللَّهُ بِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "54",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 154,
                    "chapterNumber": "54",
                    "chapterEnglish": "The Book of Zuhd and Softening of Hearts",
                    "chapterUrdu": "زہد اور رقت انگیز باتیں",
                    "chapterArabic": "كتاب الزُّهْدِ وَالرَّقَائِقِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 14726,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=589",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=587",
                "label": "587",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=588",
                "label": "588",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=589",
                "label": "589",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=590",
                "label": "590",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=591",
                "label": "591",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=592",
                "label": "592",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=593",
                "label": "593",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=591",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=591",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=589",
        "to": 14750,
        "total": 40465
    }
}