{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 372,
        "data": [
            {
                "id": 9564,
                "hadithNumber": "2000",
                "englishNarrator": "Jabir bin Abdullah رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "While the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was delivering (a sermon) on Friday, a caravan of merchandise came to Medina. The Companions of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) rushed towards it till only twelve persons were left with him including Abu Bakr and 'Umar; and it was at this occasion that this verse was revealed. And when they see merchandise or sport, they break away to it.",
                "hadithUrdu": "ایک بار جب نبی اکرم صلی اللہ علیہ وسلم جمعے کے دن کھڑے ہوئے ( خطبہ دے رہے ) تھے کہ ایک تجارتی قافلہ مدینہ آگیا ، رسول اللہ صلی اللہ علیہ وسلم کے ساتھی اس کی طرف لپک پڑے حتیٰ کہ آپ کے ساتھ بارہ آدمیوں کے سوا کوئی نہ بچا ۔ ان میں ابو بکر اور عمر رضی اللہ تعالیٰ عنہ بھی موجود تھے ۔ کہا : تو ( اس پر ) یہ آیت اتری : \" اور جب وہ تجارت یا کوئی مشغلہ دیکھتے ہیں تو اس کی طرف ٹوٹ پڑتے ہیں ۔ \"",
                "urduNarrator": "ہم سے اسماعیل بن سالم نے بیان کیا، انہوں نے بیان کیا, ہشیم نے کہا : ہمیں حصین نے ابو سفیان اور سالم بن ابی جعد سے خبر دی ، انھوں نے حضرت جابربن عبداللہ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے بیان کیا",
                "hadithArabic": "و حَدَّثَنَا إِسْمَعِيلُ بْنُ سَالِمٍ أَخْبَرَنَا هُشَيْمٌ أَخْبَرَنَا حُصَيْنٌ عَنْ أَبِي سُفْيَانَ وَسَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ بَيْنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَائِمٌ يَوْمَ الْجُمُعَةِ إِذْ قَدِمَتْ عِيرٌ إِلَى الْمَدِينَةِ فَابْتَدَرَهَا أَصْحَابُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى لَمْ يَبْقَ مَعَهُ إِلَّا اثْنَا عَشَرَ رَجُلًا فِيهِمْ أَبُو بَكْرٍ وَعُمَرُ قَالَ وَنَزَلَتْ هَذِهِ الْآيَةُ وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9565,
                "hadithNumber": "2001",
                "englishNarrator": "Ka'b bin 'Ujra رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "He entered the mosque and saw Abd al-Rahman b. Umm Hakam delivering the sermon in a sitting posture. Upon this he said: Look at this wretched person; he delivers the sermon while sitting, whereas Allah said: And when they see merchandise or sport, they break away to it and leave thee standing.",
                "hadithUrdu": "وہ مسجد میں آئے ، دیکھاکہ ( اموی والی ) عبدالرحمان بن ام حکیم بیٹھ کر خطبہ دے رہا ہے ، انھوں نے فرمایا : اس خبیث کودیکھو ، بیٹھ کر خطبہ دے رہا ہے ، جبکہ اللہ تعالیٰ کا فرمان ہے : \" اور جب وہ تجارت یا کوئی مشغلہ دیکھتے ہیں تو ادھر ٹوٹ پڑتے ہیں اور آپ کوکھڑا چھوڑ جاتے ہیں ۔ \"",
                "urduNarrator": "ہم سے محمد بن المثنیٰ اور ابن بشار نے بیان کیا، کہا کہ ہم سے محمد بن جعفر نے بیان کیا، ہم سے شعبہ نے بیان کیا، ان سے منصور نے، عمرو بن مرہ سے اور ابو عبیدہ رضی اللہ عنہ سے۔ کے بارے میں , حضرت کعب بن عجرہ رضی اللہ تعالیٰ عنہ سے روایت ہے کہ",
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ مَنْصُورٍ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ أَبِي عُبَيْدَةَ عَنْ كَعْبِ بْنِ عُجْرَةَ قَالَ دَخَلَ الْمَسْجِدَ وَعَبْدُ الرَّحْمَنِ ابْنُ أُمِّ الْحَكَمِ يَخْطُبُ قَاعِدًا فَقَالَ انْظُرُوا إِلَى هَذَا الْخَبِيثِ يَخْطُبُ قَاعِدًا وَقَالَ اللَّهُ تَعَالَى وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا وَتَرَكُوكَ قَائِمًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9566,
                "hadithNumber": "2002",
                "englishNarrator": "Abdullah bin Umar and Abu Huraira رضی اللہ تعالیٰ عنہ said:",
                "hadithEnglish": "They heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) say on the planks of his pulpit: People must cease to neglect the Friday prayer or Allah will seal their hearts and then they will be among the negligent.",
                "hadithUrdu": "انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا آپ اپنے منبر کی لکڑیوں پر ( کھڑے ہو ئے ) فر ما رہے تھے \" لو گوں کے گروہ ہر صورت جمعہ چھوڑ دینے سے باز آجا ئیں یا اللہ تعا لیٰ ان کے دلوں پر مہر لگا دے گا پھر وہ غا فلوں میں سے ہو جا ئیں گے ۔",
                "urduNarrator": "مجھ سے حسن بن علی الحلوانی نے بیان کیا، ہم سے ابو توبہ نے بیان کیا، ہم سے معاویہ نے جو ابن سلام ہیں، انہوں نے زید کی سند سے بیان کیا، یعنی ان کے بھائی نے کہ میں نے ابو سلام کو سنا کہ انہوں نے مجھ سے بات کی, حکم بن مینا ء نے حدیث بیان کی کہا : حضرت عبد اللہ بن عمر اور حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ نے انھیں حدیث بیان کی کہ",
                "hadithArabic": "و حَدَّثَنِي الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ حَدَّثَنَا أَبُو تَوْبَةَ حَدَّثَنَا مُعَاوِيَةُ وَهُوَ ابْنُ سَلَّامٍ عَنْ زَيْدٍ يَعْنِي أَخَاهُ أَنَّهُ سَمِعَ أَبَا سَلَّامٍ قَالَ حَدَّثَنِي الْحَكَمُ بْنُ مِينَاءَ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ وَأَبَا هُرَيْرَةَ حَدَّثَاهُ أَنَّهُمَا سَمِعَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ عَلَى أَعْوَادِ مِنْبَرِهِ لَيَنْتَهِيَنَّ أَقْوَامٌ عَنْ وَدْعِهِمْ الْجُمُعَاتِ أَوْ لَيَخْتِمَنَّ اللَّهُ عَلَى قُلُوبِهِمْ ثُمَّ لَيَكُونُنَّ مِنْ الْغَافِلِينَ.",
                "headingArabic": "التَّغْلِيظِ فِي تَرْكِ الْجُمُعَةِ ‏",
                "headingUrdu": "جمعہ غائب ہونے کے خلاف سخت وارننگ",
                "headingEnglish": "Stern warning against missing Jumu`ah",
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9567,
                "hadithNumber": "2003",
                "englishNarrator": "Jabir bin Samura رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "I used to pray with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and both his prayer and sermon were of moderate length.",
                "hadithUrdu": "میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نماز پڑھتا تھا آپ کی نماز ( طوالت میں ) متوسط ہو تی تھی اور آپ کا خطبہ بھی متوسط ہو تا تھا ۔",
                "urduNarrator": "ہم سے حسن بن ربیع اور ابوبکر بن ابی شیبہ نے بیان کیا، کہا کہ ہم سے انہوں نے بیان کیا ,ابوا حوص نے سما ک بن حرب سے اور انھوں نے حضرت جا بربن سمرہ رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا حَسَنُ بْنُ الرَّبِيعِ وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَا حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ سِمَاكٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ كُنْتُ أُصَلِّي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَانَتْ صَلَاتُهُ قَصْدًا وَخُطْبَتُهُ قَصْدًا.",
                "headingArabic": "تَخْفِيفِ الصَّلاَةِ وَالْخُطْبَةِ ‏",
                "headingUrdu": "نماز اور خطبہ مختصر رکھنا",
                "headingEnglish": "Keeping the prayer and khutbah short",
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9568,
                "hadithNumber": "2004",
                "englishNarrator": "Jabir bin Samura رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "I used to observe prayer with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and his prayer was of moderate length and his sermon too was of moderate length.",
                "hadithUrdu": "میں نماز یں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ پڑھتا تھا تو آپ کی نماز در میانی ہو تی تھی اور آپ کا خطبہ بھی درمیانہ ہو تا تھا ابو بکر بن ابی شیبہ کی روا یت میں ( زکریا نے کہا : ( حدثني سماك بن حرب ) \" مجھے سماک بن حرب نے حدیث بیان کی \" کے بجائے ) زكريا نےمجھے سماک سے روایت کی \" کے الفا ظ ہیں ۔",
                "urduNarrator": "ابو بکر بن ابی شیبہ اور ابن نمیر نے کہا : ہمیں محمد بن بشر نے حدیث بیان کی ، ہمیں زکریا نے حدیث بیان کی کہا : مجھ سے سماک بن حرب نے حضرت جا بر بن سمرہ رضی اللہ تعالیٰ عنہ سے حدیث بیان کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَابْنُ نُمَيْرٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ حَدَّثَنَا زَكَرِيَّاءُ حَدَّثَنِي سِمَاكُ بْنُ حَرْبٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ كُنْتُ أُصَلِّي مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصَّلَوَاتِ فَكَانَتْ صَلَاتُهُ قَصْدًا وَخُطْبَتُهُ قَصْدًا وَفِي رِوَايَةِ أَبِي بَكْرٍ زَكَرِيَّاءُ عَنْ سِمَاكٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9569,
                "hadithNumber": "2005",
                "englishNarrator": "Jabir bin Abdullah رضی اللہ تعالیٰ عنہ said:",
                "hadithEnglish": "When Allah's Messenger (may peace he upon him) delivered the sermon, his eyes became red, his voice rose, and his anger increased so that he was like one giving a warning against the enemy and saying: The enemy has made a morning attack on you and in the evening too. He would also say: The Last Hour and I have been sent like these two. And he would join his forefinger and middle finger; and would further say: The best of the speech is embodied in the Book of Allah, and the best of the guidance is the guidance given by Muhammad. And the most evil affairs are their innovations; and every innovation is error. He would further say:, I am more dear to a Muslim even than his self; and he who left behind property that is for his family; and he who dies under debt or leaves children (in helplessness), the responsibility (of paying his debt and bringing up his children) lies on me.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم جب خطبہ دیتے تو آپ کی آنکھیں سرخ ہو جا تیں ، آواز بلند ہو جا تی اور جلال کی کیفیت طاری ہو جا تی تھی حتیٰ کہ ایسا لگتا جیسے آپ کسی لشکر سے ڈرا رہے ہیں فر ما رہے ہیں کہ وہ ( لشکر ) صبح یا شام ( تک ) تمھیں آلے گا اور فر ما تے \" میں اور قیامت اس طرح بھیجے گئے ہیں \" اور آپ اپنی انگشت شہادت اور درمیانی انگلی کو ملا کر دکھا تے اور فر ما تے ۔ \" ( حمدو صلاۃ ) کے بعد بلا شبہ بہترین حدیث ( کلام ) اللہ کی کتاب ہے اور زندگی کا بہترین طریقہ محمد صلی اللہ علیہ وسلم کا طریقہ زندگی ہے اور ( دین میں ) بد ترین کا وہ ہیں جو خود نکا لے گئے ہوں اور ہر نیا نکا لا ہوا کا م گمراہی ہے پھر فر ما تے : \" میں ہر مو من کے ساتھ خود اس کی نسبت زیادہ محبت اور شفقت رکھنے والا ہوں جو کو ئی ( مومن اپنے بعد ) مال چھوڑ گیا تو وہ اس کے اہل و عیال ( وارثوں ) کا ہے اور جو مومن قرض یا بے سہارا اہل و عیال چھوڑ گیا تو ( اس قرض کو ) میری طرف لو ٹا یا جا ئے ( اور اس کے کنبے کی پرورش ) میرے ذمے ہے ۔",
                "urduNarrator": "اور مجھ سے محمد بن المثنی نے بیان کیا انہوں نے ہم سے بیان کیا, عبد الوہاب بن عبد المجید ( ثقفی ) نے جعفر ( صادق ) بن محمد ( باقر ) سے روایت کی انھوں نے اپنے والد سے اور انھوں نے حضرت جابر بن عبد اللہ رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ عَبْدِ الْمَجِيدِ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا خَطَبَ احْمَرَّتْ عَيْنَاهُ وَعَلَا صَوْتُهُ وَاشْتَدَّ غَضَبُهُ حَتَّى كَأَنَّهُ مُنْذِرُ جَيْشٍ يَقُولُ صَبَّحَكُمْ وَمَسَّاكُمْ وَيَقُولُ بُعِثْتُ أَنَا وَالسَّاعَةُ كَهَاتَيْنِ وَيَقْرُنُ بَيْنَ إِصْبَعَيْهِ السَّبَّابَةِ وَالْوُسْطَى وَيَقُولُ أَمَّا بَعْدُ فَإِنَّ خَيْرَ الْحَدِيثِ كِتَابُ اللَّهِ وَخَيْرُ الْهُدَى هُدَى مُحَمَّدٍ وَشَرُّ الْأُمُورِ مُحْدَثَاتُهَا وَكُلُّ بِدْعَةٍ ضَلَالَةٌ ثُمَّ يَقُولُ أَنَا أَوْلَى بِكُلِّ مُؤْمِنٍ مِنْ نَفْسِهِ مَنْ تَرَكَ مَالًا فَلِأَهْلِهِ وَمَنْ تَرَكَ دَيْنًا أَوْ ضَيَاعًا فَإِلَيَّ وَعَلَيَّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9570,
                "hadithNumber": "2006",
                "englishNarrator": "Ja'far bin Muhammad said on the authority of his father:",
                "hadithEnglish": "I heard Jabir bin 'Abdullah رضی اللہ تعالیٰ عنہ saying that in the sermon of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) he praised Allah, lauded Him (and subsequently said [other words] and raised his voice, and the rest of the hadith is the same).",
                "hadithUrdu": "میں نے حضرت جا بر بن عبد اللہ رضی اللہ تعالیٰ عنہ سے سنا وہ کہتے تھے جمعے کے دن نبی اکرم صلی اللہ علیہ وسلم کا خطبہ اس طرح ہوتا تھاکہ آپ اللہ تعا لیٰ کی حمد و ثناء بیان کرتے پھر اس کے بعد آپ ( اپنی بات ارشاد فر ما تے اور آپ کی اواز بہت بلند ہو تی ۔ ۔ ۔ پھر اس ( سابقہ حدیث ) کے مانند حدیث بیان کی ۔",
                "urduNarrator": "اور ہم سے عبد بن حمید نے بیان کیا، کہا ہم سے خالد بن مخلد نے بیان کیا، انہوں نے مجھ سے بیان کیا, سلیمان بن بلال نے کہا : مجھ سے جعفر بن محمد نے اپنے نے اپنے والد سے روایت کی انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنِي سُلَيْمَانُ بْنُ بِلَالٍ حَدَّثَنِي جَعْفَرُ بْنُ مُحَمَّدٍ عَنْ أَبِيهِ قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ كَانَتْ خُطْبَةُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْجُمُعَةِ يَحْمَدُ اللَّهَ وَيُثْنِي عَلَيْهِ ثُمَّ يَقُولُ عَلَى إِثْرِ ذَلِكَ وَقَدْ عَلَا صَوْتُهُ ثُمَّ سَاقَ الْحَدِيثَ بِمِثْلِهِ ِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9571,
                "hadithNumber": "2007",
                "englishNarrator": "Jabir رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), while delivering the sermon' to the people, praised Allah, and lauded Him for what He deserves, and would then say: He whom Allah guides aright, there is none to mislead him, and he who is led astray, there is none to guide him (aright), and the best of the talk is embodied in the Book of Allah. And the rest of the hadith is the same.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم لو گوں کو ( اس طرح ) خطبہ دیتے پہلے اللہ کی شان کے مطابق اس کی حمد و ثنا ء بیان کرتے پھر فر ما تے ۔ \" جسے اللہ سیدھی راہ پر چلا ئے اسے کو ئی گمراہ نہیں کر سکتا اور جسے وہ سیدھی راہ سے ہٹا دے اسے کو ئی ہدایت نہیں دے سکتا اور بہترین بات ( حدیث ) اللہ کی کتاب ہے ۔ ۔ ۔ \" آگے ( عبد الوہاب بن عبد المجید ) ثقفی کی حدیث ( 2005 ) کے ما نند ہے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ان سے وکیع نے بیان کیا، ان سےسفیان نے جعفر سے انھوں نے اپنے والد ( محمد باقر ) سے اور انھوں نے حضرت جا بر رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ جَعْفَرٍ عَنْ أَبِيهِ عَنْ جَابِرٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ النَّاسَ يَحْمَدُ اللَّهَ وَيُثْنِي عَلَيْهِ بِمَا هُوَ أَهْلُهُ ثُمَّ يَقُولُ مَنْ يَهْدِهِ اللَّهُ فَلَا مُضِلَّ لَهُ وَمَنْ يُضْلِلْ فَلَا هَادِيَ لَهُ وَخَيْرُ الْحَدِيثِ كِتَابُ اللَّهِ ثُمَّ سَاقَ الْحَدِيثَ بِمِثْلِ حَدِيثِ الثَّقَفِيّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9572,
                "hadithNumber": "2008",
                "englishNarrator": "Ibn 'Abbas رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Dimad came to Mecca and he belonged to the tribe of Azd Shanu'a, and he used to protect the person who was under the influence of charm. He heard the foolish people of Mecca say that Muhammad ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was under the spell. Upon this he said: If 1 were to come across this man, Allah might cure him at my hand. He met him and said: Muhammad, I can protect (one) who is under the influence of charm, and Allah cures one whom He so desires at my hand. Do you desire (this)? Upon this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Praise is due to Allah, we praise Him, ask His help; and he whom Allah guides aright there is none to lead him astray, and he who is led astray there is none to guide him, and I bear testimony to the fact that there is no god but Allah, He is One, having no partner with Him, and that Muhammad is His Servant and Messenger. Now after this he (Dimad) said: Repeat these words of yours before me, and the messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) repeated these to him thrice; and he said I have heard the words of soothsayers and the words of magicians, and the words of poets, but I have never heard such words as yours, and they reach the depth (of the ocean of eloquence) ; bring forth your hand so that I should take oath of fealty to you on Islam. So he took an oath of allegiance to him. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: It (this allegiance of yours) is on behalf of your people too. He said: It is on behalf of my people too. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) sent an expedition and the flying column passed by his people. The leader of the flying column said to the detachment: Did you find anything from these people? One of the people said: I found a utensil for water. Upon this he (the commander) said: Return it, for he is one of the people of Dimad رضی اللہ تعالیٰ عنہ .",
                "hadithUrdu": "ضمادمکہ آیا ، وہ ( قبیلہ ) از دشنوء سے تھا اور آسیب کا دم کیا کرتا تھا ( جسے لوگ ریح کہتے تھے ، یعنی ایسی ہوا جو نظرنہیں آتی ، اثر کرتی ہے ) اس نے مکہ کے بے وقوفوں کو یہ کہتے سنا کہ محمد ( صلی اللہ علیہ وسلم ) کو جنون ہوگیا ہے ( نعوذ باللہ ) اس نے کہا : اگر میں اس آدمی کو دیکھ لوں تو شاید اللہ تعالیٰ اسے میرے ہاتھوں شفا بخش دے ۔ کہا : وہ آپ سے ملا اور کہنے لگا : اے محمد صلی اللہ علیہ وسلم !میں اس نظر نہ آنے والی بیماری ( ریح ) کو زائل کرنے کے لئے دم کرتا ہوں اور اللہ تعالیٰ جسے چاہتا ہے میرے ہاتھوں شفا بخشتا ہے تو آپ کیا چاہتے ہیں ( کہ میں دم کروں؟ ) رسول اللہ صلی اللہ علیہ وسلم نے ( جواب میں ) کہا : \" ان الحمد لله نحمده ونستعينه من يهده الله فلا مضل له ومن يضلل فلا هادي له واشهد ان لا اله الا الله وحده لا شريك له وان محمدا عبده ورسوله اما بعد \" یقیناً تمام حمد اللہ کے لیے ہے ، ہم اسی کی حمد کرتے ہیں اور اسی سے مدد مانگتے ہیں ، جس کو اللہ سیدھی راہ پرچلائے ، اسے کوئی گمراہ نہیں کرسکتا اور جسے وہ گمراہ چھوڑ دے ، اسے کوئی راہ راست پر نہیں لاسکتا اور میں گواہی دیتا ہوں کہ اللہ کے سواکوئی سچا معبود نہیں ، وہی اکیلا ( معبود ) ہے ، ا س کا کوئی شریک نہیں اور بلاشبہ محمد ( صلی اللہ علیہ وسلم ) اس کا بندہ اور اس کا رسول ہے ، اس کے بعد! \" کہا : وہ بول اٹھا : اپنے یہ کلمات مجھے دوبارہ سنائیں ۔ رسول اللہ صلی اللہ علیہ وسلم نے تین مرتبہ یہ کلمات اس کے سامنے دہرائے ۔ اس پر اس نے کہا : میں نے کاہنوں ، جادوگروں اور شاعروں ( سب ) کے قول سنے ہیں ، میں نے آپ کے ان کلمات جیسا کوئی کلمہ ( کبھی ) نہیں سنا ، یہ تو بحر ( بلاغت ) کہ تہ تک پہنچ گئے ہیں اور کہنے لگا : ہاتھ بڑھایئے!میں آپ کے ساتھ اسلام پر بیعت کرتا ہوں ۔ کہا : تو اس نے آپ کی بیعت کرلی ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اور تیری ( طرف سے تیری ) قوم ( کے اسلام ) پر بھی ( تیری بیعت لیتاہوں ) \" اس نے کہا : اپنی قوم ( کے اسلام ) پر بھی ( بیعت کرتاہوں ) اس کے بعد آپ نے ایک سریہ ( چھوٹا لشکر ) بھیجا ، وہ ان کی قوم کے پاس سے گزرے تو امیر لشکر نے لشکر سے پوچھا : کیا تم نے ان لوگوں سے کوئی چیز لی ہے؟تو لوگوں میں سے ایک شخص نے کہا : میں نے ان سے ایک لوٹا لیا ہے اس نے کہا : اسے واپس کردو کیونکہ یہ ( کوئی اور نہیں بلکہ ) ضماد رضی اللہ تعالیٰ عنہ کی قوم ہے ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم اور محمد بن المثنی نے عبد الاعلٰی کی سند سے بیان کیا، انہوں نے کہا: مجھ سے عبد الاعلی  نے جو ابو ہمام ہیں، نے داؤد سے روایت کی۔ ہم سے عمرو بن سعید نے بیان کیا، سعید بن جبیر کی سند سےحضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت ہے کہ",
                "hadithArabic": "و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَمُحَمَّدُ بْنُ الْمُثَنَّى كِلَاهُمَا عَنْ عَبْدِ الْأَعْلَى قَالَ ابْنُ الْمُثَنَّى حَدَّثَنِي عَبْدُ الْأَعْلَى وَهُوَ أَبُو هَمَّامٍ حَدَّثَنَا دَاوُدُ عَنْ عَمْرِو بْنِ سَعِيدٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ ضِمَادًا قَدِمَ مَكَّةَ وَكَانَ مِنْ أَزْدِ شَنُوءَةَ وَكَانَ يَرْقِي مِنْ هَذِهِ الرِّيحِ فَسَمِعَ سُفَهَاءَ مِنْ أَهْلِ مَكَّةَ يَقُولُونَ إِنَّ مُحَمَّدًا مَجْنُونٌ فَقَالَ لَوْ أَنِّي رَأَيْتُ هَذَا الرَّجُلَ لَعَلَّ اللَّهَ يَشْفِيهِ عَلَى يَدَيَّ قَالَ فَلَقِيَهُ فَقَالَ يَا مُحَمَّدُ إِنِّي أَرْقِي مِنْ هَذِهِ الرِّيحِ وَإِنَّ اللَّهَ يَشْفِي عَلَى يَدِي مَنْ شَاءَ فَهَلْ لَكَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الْحَمْدَ لِلَّهِ نَحْمَدُهُ وَنَسْتَعِينُهُ مَنْ يَهْدِهِ اللَّهُ فَلَا مُضِلَّ لَهُ وَمَنْ يُضْلِلْ فَلَا هَادِيَ لَهُ وَأَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ أَمَّا بَعْدُ قَالَ فَقَالَ أَعِدْ عَلَيَّ كَلِمَاتِكَ هَؤُلَاءِ فَأَعَادَهُنَّ عَلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَلَاثَ مَرَّاتٍ قَالَ فَقَالَ لَقَدْ سَمِعْتُ قَوْلَ الْكَهَنَةِ وَقَوْلَ السَّحَرَةِ وَقَوْلَ الشُّعَرَاءِ فَمَا سَمِعْتُ مِثْلَ كَلِمَاتِكَ هَؤُلَاءِ وَلَقَدْ بَلَغْنَ نَاعُوسَ الْبَحْرِ قَالَ فَقَالَ هَاتِ يَدَكَ أُبَايِعْكَ عَلَى الْإِسْلَامِ قَالَ فَبَايَعَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَى قَوْمِكَ قَالَ وَعَلَى قَوْمِي قَالَ فَبَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَرِيَّةً فَمَرُّوا بِقَوْمِهِ فَقَالَ صَاحِبُ السَّرِيَّةِ لِلْجَيْشِ هَلْ أَصَبْتُمْ مِنْ هَؤُلَاءِ شَيْئًا فَقَالَ رَجُلٌ مِنْ الْقَوْمِ أَصَبْتُ مِنْهُمْ مِطْهَرَةً فَقَالَ رُدُّوهَا فَإِنَّ هَؤُلَاءِ قَوْمُ ضِمَادٍ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9573,
                "hadithNumber": "2009",
                "englishNarrator": "Abu Wa'il reported:",
                "hadithEnglish": "'Ammar رضی اللہ تعالیٰ عنہ delivered to us the sermon. It was short and eloquent. When he (, Ammir) descended (from the pulpit) we said to him: 0 Abd al-Yaqzn, you have delivered a short and eloquent sermon. Would that you had lengthened (the sermon). He said: I have heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: The lengthening of prayer by a man and the shortness of the sermon is the sign of his understanding (of faith). So lengthen the prayer and shorten the sermon, for there is charm (in precise) expression.",
                "hadithUrdu": "ہمارے سامنے حضرت عمار رضی اللہ تعالیٰ عنہ نے خطبہ دیا ۔ انتہائی مختصر اورانتہائی بلیغ ( بات کی ) جب وہ منبر سے اترے تو ہم نے کہا : ابویقظان! آپ نے انتہائی پر تاثیر اور انتہائی مختصر خطبہ دیاہے ، کاش! آپ سانس کچھ لمبی کرلیتے ( زیادہ دیر بات کرلیتے ) انھوں نے فرمایا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا ہے : \" انسان کی نماز کا طویل ہونا اوراس کے خطبے کاچھوٹا ہونا اس کی سمجھداری کی علامت ہے ، اس لئے نماز لمبی کرو اور خطبہ چھوٹا دو ، اوراس میں کوئی شبہ نہیں کہ کوئی بیان جادو ( کی طرح ) ہوتا ہے ۔ \"",
                "urduNarrator": "مجھ سے سریج بن یونس نے بیان کیا، کہا ہم سے عبدالرحمٰن بن عبدالملک بن ابجر نے اپنے والد سے، واصل بن حیان سے، انہوں نے کہا, ابو وائل نے کہا",
                "hadithArabic": "حَدَّثَنِي سُرَيْجُ بْنُ يُونُسَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبْجَرَ عَنْ أَبِيهِ عَنْ وَاصِلِ بْنِ حَيَّانَ قَالَ قَالَ أَبُو وَائِلٍ خَطَبَنَا عَمَّارٌ فَأَوْجَزَ وَأَبْلَغَ فَلَمَّا نَزَلَ قُلْنَا يَا أَبَا الْيَقْظَانِ لَقَدْ أَبْلَغْتَ وَأَوْجَزْتَ فَلَوْ كُنْتَ تَنَفَّسْتَ فَقَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ طُولَ صَلَاةِ الرَّجُلِ وَقِصَرَ خُطْبَتِهِ مَئِنَّةٌ مِنْ فِقْهِهِ فَأَطِيلُوا الصَّلَاةَ وَاقْصُرُوا الْخُطْبَةَ وَإِنَّ مِنْ الْبَيَانِ سِحْرًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9574,
                "hadithNumber": "2010",
                "englishNarrator": "Adi bin Hatim رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "A person recited a sermon before the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) thus: He who obeys Allah and His Apostle, he in fact follows the right path, and he who disobeys both of them, he goes astray. Upon this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: What a bad speaker you are; say: He who disobeys Allah and His Apostle. Ibn Numair added: He in fact went astray.",
                "hadithUrdu": "ایک شخص نے رسول اللہ صلی اللہ علیہ وسلم کے سامنے خطبہ دیا اور ( اس میں ) کہا : جو اللہ اور اس کے رسو ل کی اطاعت کرتاہے اس نے رشدوہدایت پالی اور جو ان دونوں کی نافرمانی کرتاہے وہ بھٹک گیا ۔ اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" تو بُرا خطیب ہے ، ( فقرے کے پہلے حصے کی طرح ) یوں کہو ، جس نے اللہ کی اور اس کے ر سول کی نافرمانی کی ( وہ گمراہ ہوا ۔ ) \"\" ابن نمیر کی ر وایت میں غوي ( واہ کے نیچے زیر ) ہے ۔",
                "urduNarrator": "ابو بکر بن ابی شیبہ اور محمد بن عبداللہ بن نمیر نے کہا : ہمیں وکیع نے سفیان سے حدیث بیان کی ، انھوں نے عبدالعزیز بن رفیع سے ، انھوں نے تمیم بن طرفہ سے اور انھوں نے حضرت عدی بن حاتم رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ عَنْ تَمِيمِ بْنِ طَرَفَةَ عَنْ عَدِيِّ بْنِ حَاتِمٍ أَنَّ رَجُلًا خَطَبَ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَنْ يُطِعْ اللَّهَ وَرَسُولَهُ فَقَدْ رَشَدَ وَمَنْ يَعْصِهِمَا فَقَدْ غَوَى فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِئْسَ الْخَطِيبُ أَنْتَ قُلْ وَمَنْ يَعْصِ اللَّهَ وَرَسُولَهُ قَالَ ابْنُ نُمَيْرٍ فَقَدْ غَوِيَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9575,
                "hadithNumber": "2011",
                "englishNarrator": "Safwan bin Ya'la رضی اللہ تعالیٰ عنہ reported on the authority of his father that h",
                "hadithEnglish": "He heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) reciting (verses of the Qur'an) on the pulpit. and They cried: O Malik.",
                "hadithUrdu": "انھوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ منبر پر پڑھ رہے تھے : وَنَادَوْا يَا مَالِكُ \" اور وہ پکاریں گے : اے مالک! \" ( الزخرف 77 : 43 )",
                "urduNarrator": "ہم سے قتیبہ بن سعید، ابوبکر بن ابی شیبہ اور اسحاق الحنظَلی نے ابن عیینہ کی سند سے بیان کیا، انہوں نے کہا: ہم سے سفیان نے عمر رضی اللہ عنہ سے بیان کیا اور انہوں نے عطاء کو کہتے سنا, صفوان کے والد حضرت یعلیٰ بن امیہ رضی اللہ تعالیٰ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ الْحَنْظَلِيُّ جَمِيعًا عَنْ ابْنِ عُيَيْنَةَ قَالَ قُتَيْبَةُ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو سَمِعَ عَطَاءً يُخْبِرُ عَنْ صَفْوَانَ بْنِ يَعْلَى عَنْ أَبِيهِ أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ عَلَى الْمِنْبَرِ وَنَادَوْا يَا مَالِكُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9576,
                "hadithNumber": "2012",
                "englishNarrator": "Amra daughter of Abdul-Rahman reported on the authority of the sister of Amra:",
                "hadithEnglish": "I memorised (surah) Qaf, by the glorious Qur'an from the mouth of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) on Friday for he recited it on the pulpit on every Friday.",
                "hadithUrdu": "میں نے سورہ ق والْقُرْ‌آنِ الْمَجِيدِ جمعے کے دن رسول اللہ صلی اللہ علیہ وسلم کی زبان مبارک سے سن کریاد کی ۔ آپ اسے ہر جمعے منبر پر پڑھ کر سنایا ( اور سمجھایا ) کرتے تھے ۔",
                "urduNarrator": "اور ہم سے عبداللہ بن عبدالرحمٰن دارمی نے بیان کیا,  سلیمان بن بلال نے یحییٰ بن سعید سے روایت کی ، انھوں نے عمرہ بنت عبدالرحمان ( بن سعد بن زرارہ انصاریہ ) سے ، انھوں نے کہا : ( ماں کی طرف سے ) اپنی بہن کی طرف سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ أَخْبَرَنَا يَحْيَى بْنُ حَسَّانَ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ عَنْ أُخْتٍ لِعَمْرَةَ قَالَتْ أَخَذْتُ ق وَالْقُرْآنِ الْمَجِيدِ مِنْ فِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْجُمُعَةِ وَهُوَ يَقْرَأُ بِهَا عَلَى الْمِنْبَرِ فِي كُلِّ جُمُعَةٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9577,
                "hadithNumber": "2013",
                "englishNarrator": null,
                "hadithEnglish": "The daughter of Haritha bin Nu'man said: I did not memorise (Surah) Qaf but from the mouth of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as he used to deliver the. sermon along with it on every Friday. She also added: Our oven and that of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was one.",
                "hadithUrdu": "مجھ سے ابو الطاہر نے بیان کیا، کہا کہ ہم سے ابن وہب نے بیان کیا، وہ  یحییٰ بن ایوب نے یحییٰ بن سعید سے ، انھوں نے عمرہ سے اور انھوں نے اپنی بہن سے جو عمر میں ان سے بڑی تھیں ، روایت کی ۔ ۔ ۔ سلیمان بن بلال کی حدیث کے مانند ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنِيهِ أَبُو الطَّاهِرِ أَخْبَرَنَا ابْنُ وَهْبٍ عَنْ يَحْيَى بْنِ أَيُّوبَ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَمْرَةَ عَنْ أُخْتٍ لِعَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ كَانَتْ أَكْبَرَ مِنْهَا بِمِثْلِ حَدِيثِ سُلَيْمَانَ بْنِ بِلَالٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9578,
                "hadithNumber": "2014",
                "englishNarrator": "Umm Bisham hint Haritha bin Nu'man said:",
                "hadithEnglish": "Our oven and that of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was one for two years, or for one year or for a part of a year; and I learnt Qaf. By the Glorious Qur'an from no other source than the tongue of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) who used to recite it every Friday on the pulpit when he delivered the sermon to the people.",
                "hadithUrdu": "میں نے سورہ ق ( کسی اور سے نہیں براہ راست ) رسول اللہ صلی اللہ علیہ وسلم کی زبان سے سن کر یاد کی ، آپ ہر جمعے میں اسےپڑھ کر خطاب فرماتے تھے ۔ انھوں نے کہا : ہمارا اور رسول اللہ صلی اللہ علیہ وسلم کا تندور ایک ہی تھا ۔",
                "urduNarrator": "مجھ سے محمد بن بشار نے بیان کیا، ہم سے محمد بن جعفر نے بیان کیا، ہم سے شعبہ نے بیان کیا، خبیب رضی اللہ عنہ کی سند سے, عبداللہ بن محمد بن معن نے حارثہ بن نعمان کی بیٹی ( ام ہشام ) سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ خُبَيْبٍ عَنْ عَبدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ مَعْنٍ عَنْ بِنْتٍ لِحَارِثَةَ بْنِ النُّعْمَانِ قَالَتْ مَا حَفِظْتُ ق إِلَّا مِنْ فِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ بِهَا كُلَّ جُمُعَةٍ قَالَتْ وَكَانَ تَنُّورُنَا وَتَنُّورُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاحِدًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9579,
                "hadithNumber": "2015",
                "englishNarrator": "It was narrated that Umm Hisham bin Harithah bin An-Nu'man رضی اللہ تعالیٰ عنہ said:",
                "hadithEnglish": "Our oven and the oven of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) were the same for two years, or for one year and part of a year. And I only learned Surah Qaf. By the Glorious Quran from the tongue of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), who used to recited it every Friday from the Minbar, when he addresses the people.",
                "hadithUrdu": "ہمارا اور رسول اللہ صلی اللہ علیہ وسلم کا تندور دو یا ایک سال سے کچھ زیادہ عرصہ ایک ہی رہا اور میں نے سورہ ق ۚ وَالْقُرْ‌آنِ الْمَجِيدِ ( کسی اور سے نہیں بلکہ ) رسول اللہ صلی اللہ علیہ وسلم کی زبان سے سن کر یاد کی ، آپ ہر جمعے کے دن جب لوگوں کو خطبہ دیتے تو اسے منبر پر پڑھتے تھے ۔",
                "urduNarrator": "ہم سے عمرو الناقد نے بیان کیا، کہا ہم سے یعقوب بن ابراہیم بن سعد نے بیان کیا، کہا ہم سے میرے والد نے بیان کیا، انہوں نے محمد بن اسحاق کی سند سے، کہا کہ مجھ سے عبداللہ بن ابی بکر بن مہ نے بیان کیا، ان سے معد بن عمرو بن حزم الانصاری نے بیان کیا۔ کی یحییٰ بن عبداللہ بن عبدالرحمن بن سعد نے زرارہ نے ام ہشام بنت حارثہ بن نعمان رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا عَمْرٌو النَّاقِدُ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنَا أَبِي عَنْ مُحَمَّدِ بْنِ إِسْحَقَ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ الْأَنْصَارِيُّ عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ سَعْدِ بْنِ زُرَارَةَ عَنْ أُمِّ هِشَامٍ بِنْتِ حَارِثَةَ بْنِ النُّعْمَانِ قَالَتْ لَقَدْ كَانَ تَنُّورُنَا وَتَنُّورُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاحِدًا سَنَتَيْنِ أَوْ سَنَةً وَبَعْضَ سَنَةٍ وَمَا أَخَذْتُ ق وَالْقُرْآنِ الْمَجِيدِ إِلَّا عَنْ لِسَانِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَؤُهَا كُلَّ يَوْمِ جُمُعَةٍ عَلَى الْمِنْبَرِ إِذَا خَطَبَ النَّاسَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9580,
                "hadithNumber": "2016",
                "englishNarrator": "Umara bin Ruwaiba رضی اللہ تعالیٰ عنہ said:",
                "hadithEnglish": "He saw Bishr bin Marwan on the pulpit raising his hands and said: Allah, disfigure these hands! I have seen Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) gesture no more than this with his hands, and he pointed with his forefinger.",
                "hadithUrdu": "انھوں نے بشر بن مروان ( بن حکم ، عامل مدینہ ) کو منبر پر ( تقریر کے دوران ) دونوں ہاتھ بلند کرتے دیکھا تو کہا : اللہ تعالیٰ ان دونوں ہاتھوں کو بگاڑے ، میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ آپ اپنے ہاتھ سے اس سےزیادہ اشارہ نہیں کرتے تھے اور اپنی انگشت شہادت سے اشارہ کیا ۔",
                "urduNarrator": "عبداللہ بن ادریس نے حصین سے اور انھوں نے حضرت عمارہ بن رویبہ ( ثقفی ) رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ حُصَيْنٍ عَنْ عُمَارَةَ بْنِ رُؤَيْبَةَ قَالَ رَأَى بِشْرَ بْنَ مَرْوَانَ عَلَى الْمِنْبَرِ رَافِعًا يَدَيْهِ فَقَالَ قَبَّحَ اللَّهُ هَاتَيْنِ الْيَدَيْنِ لَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا يَزِيدُ عَلَى أَنْ يَقُولَ بِيَدِهِ هَكَذَا وَأَشَارَ بِإِصْبَعِهِ الْمُسَبِّحَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9581,
                "hadithNumber": "2017",
                "englishNarrator": "It was narrated that Hussain bin Abdur Rahman said:",
                "hadithEnglish": "\"I saw Bishr bin Marwan on a Friday, raising his hand, and Umarah bin Ruaibah said...\" and he mentioned something similar (to no. 2016).",
                "hadithUrdu": "میں نے جمعے کے دن بشر بن مروان کو دونوں ہاتھ اٹھاتے ہوئے دیکھا تو اس پر عمارہ بن رویبہ رضی اللہ تعالیٰ عنہ نے کہا ۔ ۔ ۔ اس کے بعد اس ( مذکورہ بالا روایت ) کے ہم معنی روایت بیان کی ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، انہوں نے بیان کیا ابو عوانہ نے حصین بن عبدالرحمن سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَاه قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ حُصَيْنِ بْنِ عَبْدِ الرَّحْمَنِ قَالَ رَأَيْتُ بِشْرَ بْنَ مَرْوَانَ يَوْمَ جُمُعَةٍ يَرْفَعُ يَدَيْهِ فَقَالَ عُمَارَةُ بْنُ رُؤَيْبَةَ فَذَكَرَ نَحْوَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9582,
                "hadithNumber": "2018",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "While Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was delivering the sermon on Friday a person came there, and the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said to him: So and so, have you prayed (two rak'ahs)? He said: No. He (the Holy Prophet) said: Then stand and pray.",
                "hadithUrdu": "اسی اثناء میں جب جمعے کے دن رسول اللہ صلی اللہ علیہ وسلم خطبہ دے رہے تھے ایک آدمی ( مسجد میں ) آیا تو نبی کریم صلی اللہ علیہ وسلم نے اس سے پوچھا : \" اے فلاں ( نام لیا ) !کیا تو نے نماز پڑھ لی ہے؟ \" اس نے کہا : نہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" اور اٹھو اور نماز پڑھو ۔ \"",
                "urduNarrator": "ہم سے ابو الربیع الزہرانی اور قتیبہ بن سعید نے بیان کیا، کہا: ہم سے انہوں نے بیان کیا, حماد بن زید نے عمرو بن دینار سے اور انھوں نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا أَبُو الرَّبِيعِ الزَّهْرَانِيُّ وَقُتَيْبَةُ بْنُ سَعِيدٍ قَالَا حَدَّثَنَا حَمَّادٌ وَهُوَ ابْنُ زَيْدٍ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ بَيْنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ يَوْمَ الْجُمُعَةِ إِذْ جَاءَ رَجُلٌ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَصَلَّيْتَ يَا فُلَانُ قَالَ لَا قَالَ قُمْ فَارْكَعْ.",
                "headingArabic": "التَّحِيَّةِ وَالإِمَامُ يَخْطُبُ ‏",
                "headingUrdu": "سلام (مسجد میں داخل ہونے پر دعا) جب امام تبلیغ کر رہا ہو۔",
                "headingEnglish": "Greeting (prayers upon entering the masjid) while the Imam is preaching",
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9583,
                "hadithNumber": "2019",
                "englishNarrator": null,
                "hadithEnglish": "This hadith is narrated by Jabir رضی اللہ تعالیٰ عنہ through another chain of transmitters but Hammad (one of the narrators) made no mention of the two rak'ahs.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ اور یعقوب الدورقی نے ابن علییہ کی سند سے بیان کی, ایوب نے عمرو ( بن دینار ) سے ، انھوں نے حضرت جابر رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے حماد کی طرح روایت کی ، اور انھوں ( ایوب ) نے بھی اس میں دو رکعت کا ذکر نہیں کیا ( البتہ اگلی روایت میں سفیان نے کیا ہے ۔ )",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَيَعْقُوبُ الدَّوْرَقِيُّ عَنْ ابْنِ عُلَيَّةَ عَنْ أَيُّوبَ عَنْ عَمْرٍو عَنْ جَابِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَمَا قَالَ حَمَّادٌ وَلَمْ يَذْكُرْ الرَّكْعَتَيْنِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9584,
                "hadithNumber": "2020",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ تعالیٰ عنہ said:",
                "hadithEnglish": "A person entered the Mosque while the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was delivering the sermon on Friday. Upon this he (the Holy Prophet) said: Have you observed prayer? He said: No. He (the Holy Prophet) said: Stand and offer the two rak'ahs. According to Qutaiba, the words are: He said: Offer two rak'ahs.",
                "hadithUrdu": "ایک آدمی مسجد میں داخل ہوا جب رسول اللہ صلی اللہ علیہ وسلم جمعے کے دن خطبہ دےرہے تھے ۔ تو آپ نے پوچھا : \" کیا تم نے نماز پڑھ لی؟ \" اس نے کہا : نہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" اٹھو اور دو رکعتیں پڑھ لو ۔ \" قتیبہ کی حدیث میں ( فصل ركعتين کے بجائے ) صل ركعتين ( دو رکعتیں پڑھو ) ہے ۔",
                "urduNarrator": "قتیبہ بن سعید اور اسحاق بن ابراہیم میں سے قتیبہ نے کہا : ہمیں حدیث سنائی اور اسحاق نے کہا : ہمیں خبر دی سفیان نے عمرو سے ، انھوں نے جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سےسنا ، وہ کہہ رہے تھے",
                "hadithArabic": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ قُتَيْبَةُ حَدَّثَنَا وَقَالَ إِسْحَقُ أَخْبَرَنَا سُفْيَانُ عَنْ عَمْرٍو سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ دَخَلَ رَجُلٌ الْمَسْجِدَ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ يَوْمَ الْجُمُعَةِ فَقَالَ أَصَلَّيْتَ قَالَ لَا قَالَ قُمْ فَصَلِّ الرَّكْعَتَيْنِ وَفِي رِوَايَةِ قُتَيْبَةَ قَالَ صَلِّ رَكْعَتَيْنِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9585,
                "hadithNumber": "2021",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "A person came (in the Mosque) while the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was delivering the sermon on Friday (standing) on the pulpit. He (the Holy Prophet) said to him: Have you offered two rak'ahs? He said: No. Upon this he said: Then observe (them).",
                "hadithUrdu": "ایک آدمی آیا جب کہ نبی اکرم صلی اللہ علیہ وسلم منبر پر تھے ، جمعے کے دن خطبہ ارشاد فرمارہے تھے تو آپ نے اس سے پوچھا : \" کیا تم نے دو رکعتیں پڑھ لی ہیں؟ \" اس نے کہا : نہیں ۔ آپ نے فرمایا : \" پڑھ لو ۔ \"",
                "urduNarrator": "اور مجھ سے محمد بن رافع اور عبد بن حمید نے بیان کیا، کہا کہ ہم سے عبد الرزاق نے بیان کیا, ابن جریج نے کہا : ہمیں عمرو بن دینار نے خبر دی کہ انھوں نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے سنا ، وہ کہہ رہے تھے",
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ وَعَبْدُ بْنُ حُمَيْدٍ قَالَ ابْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ جَاءَ رَجُلٌ وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ يَوْمَ الْجُمُعَةِ يَخْطُبُ فَقَالَ لَهُ أَرَكَعْتَ رَكْعَتَيْنِ قَالَ لَا فَقَالَ ارْكَعْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9586,
                "hadithNumber": "2022",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ تعالیٰ عنہ said:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) delivered the sermon and said: When any one of you comes for the Friday (prayer) and the Imam comes out (from his apartment), (even then) should observe two rak'ahs (of prayer).",
                "hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم نے خطبے میں فرمایا : \" جب تم میں سے کوئی شخص جمعے کے دن آئے جبکہ امام ( گھر سے ) نکل ( کر ) آچکا ہے تو وہ دو رکعت پڑھ لے ۔ \"",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا، ہم سے محمد نے جو کہ ہم سے ابن جعفر نے بیان کیا، بیان کیا, شعبہ نے عمرو ( بن دینار ) سے روایت کی ، انھوں نے کہا : میں نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدٌ وَهُوَ ابْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرٍو قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطَبَ فَقَالَ إِذَا جَاءَ أَحَدُكُمْ يَوْمَ الْجُمُعَةِ وَقَدْ خَرَجَ الْإِمَامُ فَلْيُصَلِّ رَكْعَتَيْنِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9587,
                "hadithNumber": "2023",
                "englishNarrator": "Jabir رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Sulaik Ghatafani came on Friday (for prayer) while the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was sitting on the pulpit. Sulaik also sat down before observing prayer. The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Have you observed two rak'ahs? He said: No. He (the Holy Prophet) said: Stand and observe them",
                "hadithUrdu": "سلیک غطفانی رضی اللہ تعالیٰ عنہ جمعے کے دن آئے جبکہ رسول اللہ صلی اللہ علیہ وسلم منبر پر بیٹھے ہوئے تھے تو سلیک نماز پڑھنے سے پہلے ہی بیٹھ گئے ۔ رسول اللہ صلی اللہ علیہ وسلم نے ان سے کہا : \" کیا تم نے دو رکعتیں پڑھ لی ہیں؟ \" انھوں نے کہا : نہیں ۔ آپ نے فرمایا : \" اٹھو اور دو ر کعتیں پڑھو ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ہم سے لیث نے بیان کیا، ہم سے محمد بن رومح نے بیان کیا، ہم سے لیث نے بیان کیا, ابو زبیر نے حضرت جابر رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ أَنَّهُ قَالَ جَاءَ سُلَيْكٌ الْغَطَفَانِيُّ يَوْمَ الْجُمُعَةِ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَاعِدٌ عَلَى الْمِنْبَرِ فَقَعَدَ سُلَيْكٌ قَبْلَ أَنْ يُصَلِّيَ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرَكَعْتَ رَكْعَتَيْنِ قَالَ لَا قَالَ قُمْ فَارْكَعْهُمَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9588,
                "hadithNumber": "2024",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Sulaik Ghatafani رضی اللہ تعالیٰ عنہ came on Friday when the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was delivering the sermon. He (Sulaik) sat down. He (the Holy Prophet) said to him: 0 Sulaik I stand and observe two rak'ahs and make them short, and then said: When any one of you comes on Friday, while the Imam delivers the sermon, he should observe two rak'ahs and should make them short.",
                "hadithUrdu": "سلیک غطفانی رضی اللہ تعالیٰ عنہ جمعے کے دن ( اس وقت ) آئے جب رسول اللہ صلی اللہ علیہ وسلم خطبہ دے رہے تھے تو وہ بیٹھ گئے ۔ آپ نے ان سے کہا : \" اے سلیک!ا ٹھ کر دو رکعتیں پڑھو اور ان میں سے اختصار برتو ۔ \" اس کے بعد آپ صلی اللہ علیہ وسلم نے فرمایا! \" جب تم میں سے کوئی جمعے کےدن آئے جبکہ امام خطبہ دے رہا ہو تو وہ دو رکعتیں پڑھے اور ان میں اختصار کرے ۔ \"",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم اور علی بن خشرم نے عیسیٰ بن یونس کی سند سے بیان کیا، انہوں نے کہا کہ ہمیں عیسیٰ نے الاعمش کی سند سے خبر دی, ابو سفیان ( طلحہ بن نافع واسطی ) نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نےکہا",
                "hadithArabic": "و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَعَلِيُّ بْنُ خَشْرَمٍ كِلَاهُمَا عَنْ عِيسَى بْنِ يُونُسَ قَالَ ابْنُ خَشْرَمٍ أَخْبَرَنَا عِيسَى عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ جَاءَ سُلَيْكٌ الْغَطَفَانِيُّ يَوْمَ الْجُمُعَةِ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ فَجَلَسَ فَقَالَ لَهُ يَا سُلَيْكُ قُمْ فَارْكَعْ رَكْعَتَيْنِ وَتَجَوَّزْ فِيهِمَا ثُمَّ قَالَ إِذَا جَاءَ أَحَدُكُمْ يَوْمَ الْجُمُعَةِ وَالْإِمَامُ يَخْطُبُ فَلْيَرْكَعْ رَكْعَتَيْنِ وَلْيَتَجَوَّزْ فِيهِمَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 9276,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=371",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=369",
                "label": "369",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=370",
                "label": "370",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=371",
                "label": "371",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=372",
                "label": "372",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=373",
                "label": "373",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=374",
                "label": "374",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=375",
                "label": "375",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=373",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=373",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=371",
        "to": 9300,
        "total": 40465
    }
}