{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 547,
        "data": [
            {
                "id": 13939,
                "hadithNumber": "6376",
                "englishNarrator": "",
                "hadithEnglish": "Anas reported: My mother Umm Anas came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). And she prepared my lower garment out of the half of her headdress and (with the other half) she covered my upper body and said: Allah's Messenger, here is my son Unais; I have brought him to you for serving you. Invoke blessings of Allah upon him. Thereupon he (the Holy Prophet) said: O Allah, make an increase in his wealth, and progeny. Anas said: By Allah, my fortune is huge and my children, and grand-children are now more than one hundred.",
                "hadithUrdu": "اسحٰق نے کہا : مجھے حضرت انس رضی اللہ تعالیٰ عنہ نے حدیث سنائی کہا : میری والدہ ام انس رضی اللہ تعالیٰ عنہا مجھے لے کر رسول اللہ صلی اللہ علیہ وسلم کے پاس آئیں ، انھوں نے اپنی آدھی اوڑھنی سے میری کمر پر چادر باندھ دی تھی اور اوڑھنی میرے شانوں پر ڈال دی تھی ۔ انھوں نے عرض کی : اللہ کے رسول صلی اللہ علیہ وسلم ! یہ انیس ( انس کی تصغیر ) ہے میرا بیٹا ہے ، میں اسے آپ کے پاس لا ئی ہوں تا کہ یہ آپ کی خدمت کرے ، آپ اس کے لیےاللہ سے دعاکریں تو آپ نے فر ما یا : \" اے اللہ !اس کے مال اور اولاد کو زیادہ کر ۔ حضرت انس رضی اللہ تعالیٰ عنہ نے کہا : اللہ کی قسم!میرا مال بہت زیادہ ہے اور آج میری اولاداور اولاد کی اولاد کی گنتی سو کے لگ بھگ ہے ۔",
                "urduNarrator": "",
                "hadithArabic": "حَدَّثَنِي أَبُو مَعْنٍ الرَّقَاشِيُّ، حَدَّثَنَا عُمَرُ بْنُ يُونُسَ، حَدَّثَنَا عِكْرِمَةُ، حَدَّثَنَا إِسْحَاقُ، حَدَّثَنَا أَنَسٌ، قَالَ: جَاءَتْ بِي أُمِّي أُمُّ أَنَسٍ إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَقَدْ أَزَّرَتْنِي بِنِصْفِ خِمَارِهَا، وَرَدَّتْنِي بِنِصْفِهِ، فَقَالَتْ: يَا رَسُولَ اللهِ، هَذَا أُنَيْسٌ ابْنِي، أَتَيْتُكَ بِهِ يَخْدُمُكَ فَادْعُ اللهَ لَهُ، فَقَالَ: «اللهُمَّ أَكْثِرْ مَالَهُ وَوَلَدَهُ» قَالَ أَنَسٌ: فَوَاللهِ إِنَّ مَالِي لَكَثِيرٌ، وَإِنَّ وَلَدِي وَوَلَدَ وَلَدِي لَيَتَعَادُّونَ عَلَى نَحْوِ الْمِائَةِ، الْيَوْمَ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13940,
                "hadithNumber": "6377",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ said:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) passed (by our house) that my mother Umm Sulaim رضی اللہ عنہا listened to his voice and said: Allah's Messenger, let my father and mother be sacrificed for thee, here is Unais (and requested him to invoke blessings upon me). So Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) invoked three blessings upon me. I have seen (the results) of the two in this very world (in regard to wealth and progeny) and I hope to see (the result) of the third one in the Hereafter.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ( ہمارے گھر کے قریب سے ) گزرے میری والدہ ام سلیم رضی اللہ عنہا نے آپ کی آواز سنی انھوں نے کہا : یا رسول اللہ صلی اللہ علیہ وسلم ! میرے ماں باپ آپ پر قربان !یہ انیس ہے اس کے لیے دعا فر مائیے پھر رسول اللہ صلی اللہ علیہ وسلم نے میرے لیے تین دعائیں کیں ۔ جن میں سے دو دعاؤں ( کی قبولیت ) کو میں نے دیکھ لیا اور تیسری ( کی قبولیت ) کے متعلق آخرت میں امید رکھتا ہوں ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ان سے جعفر نے بیان کیا، ان سے ابن سلیمان نے بیان کیا، انہوں نے الجعد ابو عثمان کی سند سے، انہوں نے کہا:حضرت انس بن مالک رضی اللہ تعالیٰ عنہ نے حدیث بیان کی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَعْفَرٌ يَعْنِي ابْنَ سُلَيْمَانَ، عَنِ الْجَعْدِ أَبِي عُثْمَانَ، قَالَ: حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، قَالَ: مَرَّ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَسَمِعَتْ أُمِّي، أُمُّ سُلَيْمٍ صَوْتَهُ، فَقَالَتْ: بِأَبِي وَأُمِّي يَا رَسُولَ اللهِ أُنَيْسٌ، «فَدَعَا لِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، ثَلَاثَ دَعَوَاتٍ» قَدْ رَأَيْتُ مِنْهَا اثْنَتَيْنِ فِي الدُّنْيَا، وَأَنَا أَرْجُو الثَّالِثَةَ فِي الْآخِرَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13941,
                "hadithNumber": "6378",
                "englishNarrator": "Anas رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came to me as I was playing with playmates. He greeted and sent me on an errand and I made delay in going to my mother. When I came to her she said: What detained you? I said: Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) sent me on an errand. She said: What was the purpose? I said: It is something secret. Thereupon she said: Do not then divulge the secret of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) to anyone. Anas رضی اللہ عنہ said: By Allah, if I were to divulge it to anyone, then, O Thabit, I would have divulged it to you.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم میرے پاس تشریف لا ئے اس وقت میں لڑکوں کے ساتھ کھیل رہا تھا کہا : آپ نے ہم سب کو سلام کیا اور مجھے کسی کام کے لیے بھیج دیا تو میں اپنی والد ہ کے پاس تا خیر سے پہنچا ، جب میں آیا تو والدہ نے پو چھا : تمھیں دیر کیوں ہوئی ۔ ؟میں نے کہا : مجھے رسول اللہ صلی اللہ علیہ وسلم نے کسی کا م سے بھیجا تھا ۔ انھوں نے پو چھا : آپ کا وہ کام کیا تھا؟ میں نے کہا : وہ ایک راز ہے ۔ میری والدہ نے کہا : تم رسول اللہ صلی اللہ علیہ وسلم کا راز کسی پر افشانہ کرنا ۔ حضرت انس رضی اللہ عنہ نے کہا : اللہ کی قسم! ثابت !اگر میں وہ راز کسی کو بتاتاتو تمہیں ( جو رسول اللہ صلی اللہ علیہ وسلم کی حدیث کے طلبگار ہو ) ضرور بتا تا ۔",
                "urduNarrator": "ہم سے ابوبکر بن نافع نے بیان کیا، کہا ہم سے بہز نے بیان کیا، ہم سے حماد نے بیان کیا, ثابت نے حضرت انس رضی اللہ عنہ سے حدیث بیان کی کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ نَافِعٍ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا حَمَّادٌ، أَخْبَرَنَا ثَابِتٌ، عَنْ أَنَسٍ، قَالَ: أَتَى عَلَيَّ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَأَنَا أَلْعَبُ مَعَ الْغِلْمَانِ، قَالَ: فَسَلَّمَ عَلَيْنَا، فَبَعَثَنِي إِلَى حَاجَةٍ، فَأَبْطَأْتُ عَلَى أُمِّي، فَلَمَّا جِئْتُ قَالَتْ: مَا حَبَسَكَ؟ قُلْتُ بَعَثَنِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِحَاجَةٍ، قَالَتْ: مَا حَاجَتُهُ؟ قُلْتُ: إِنَّهَا سِرٌّ، قَالَتْ: لَا تُحَدِّثَنَّ بِسِرِّ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَحَدًا قَالَ أَنَسٌ: وَاللهِ لَوْ حَدَّثْتُ بِهِ أَحَدًا لَحَدَّثْتُكَ يَا ثَابِتُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13942,
                "hadithNumber": "6379",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) told me something secretly. I informed none about that and Umm Sulaim رضی اللہ عنہا asked me about it, but I did not tell her even.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ایک راز میں مجھے شریک کیا ۔ میں نے اب تک وہ راز کسی کو نہیں بتا یا میری والد ہ حضرت ام سلیم رضی اللہ عنہا نے اس کے متعلق پو چھا ، میں نے وہ راز ان کو بھی نہیں بتا یا ۔",
                "urduNarrator": "ہم سے حجاج بن الشاعر نے بیان کیا، ہم سے ارم بن الفضل نے بیان کیا، معتمر بن سلیمان نے کہا : میں نے اپنے والد سے سنا ، وہ حضرت انس بن مالک رضی اللہ عنہ سے حدیث بیان کر رہے تھے ۔ ( کہ حضرت انس رضی اللہ تعالیٰ عنہ ) نے کہا",
                "hadithArabic": "حَدَّثَنَا حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا عَارِمُ بْنُ الْفَضْلِ، حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ، قَالَ: سَمِعْتُ أَبِي يُحَدِّثُ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ: «أَسَرَّ إِلَيَّ نَبِيُّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ سِرًّا، فَمَا أَخْبَرْتُ بِهِ أَحَدًا بَعْدُ، وَلَقَدْ سَأَلَتْنِي عَنْهُ أُمُّ سُلَيْمٍ فَمَا أَخْبَرْتُهَا بِهِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13943,
                "hadithNumber": "6380",
                "englishNarrator": "Amir bin Sa'd reported:",
                "hadithEnglish": "He heard his father (Sa'd bin Abi Waqqas) say: never heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) say unto one living and moving about that he was in Paradise except to 'Abdullah bin Salam رضی اللہ عنہ .",
                "hadithUrdu": "اپنے والد کو یہ کہتے ہو ئے سنا ، میں نے حضرت عبد اللہ بن سلام رضی اللہ عنہ کے علاوہ کسی زندہ چلتے پھرتے شخص کے متعلق رسول اللہ صلی اللہ علیہ وسلم سے یہ نہیں سنا ، بلا شبہ وہ جنت میں جا ئے گا ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، مجھ سے اسحاق بن عیسیٰ نے بیان کیا، مجھ سے مالک نے ابو النضر کی سند سے بیان کیا, عامر بن سعد نے کہا : میں نے",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْحَاقُ بْنُ عِيسَى، حَدَّثَنِي مَالِكٌ، عَنْ أَبِي النَّضْرِ، عَنْ عَامِرِ بْنِ سَعْدٍ، قَالَ: سَمِعْتُ أَبِي يَقُولُ: مَا سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لِحَيٍّ يَمْشِي، إِنَّهُ فِي الْجَنَّةِ إِلَّا لِعَبْدِ اللهِ بْنِ سَلَامٍ».",
                "headingArabic": "مِنْ فَضَائِلِ عَبْدِ اللَّهِ بْنِ سَلاَمٍ رضى الله عنه ‏‏",
                "headingUrdu": "عبداللہ بن سلام رضی اللہ عنہ کے فضائل",
                "headingEnglish": "The Virtues Of Abdullah Bin Salam (RA)",
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13944,
                "hadithNumber": "6381",
                "englishNarrator": "Qais bin 'Ubada reported:",
                "hadithEnglish": "I was in the company of some persons, amongst whom some were the Companions of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) in Medina, that there came a person whose face depicted the fear (of Allah). Some people said: He is a person from amongst the people of Paradise; he is a person from amongst the people of Paradise. He observed two short rak'ahs of prayer and then went out. I followed him and he got into his house and I also got in and we began to converse with each other. And when he became familiar (with me) I said to Him: When you entered (the mosque) before (your entrance in the house) a person said so and so (that you are amongst the people of Paradise), whereupon he said: It is not meet for anyone to say anything which he does not know. I shall (now) tell you why they (say) this. I saw a dream during the lifetime of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and narrated it to him. I seemed to be in a garden [he described its vastness, its rich fructification and its verdure]; in the midst of it, there stood an iron pillar, with its base in the earth and its summit in the sky: and upon its summit there was a handhold. It was said to me: Climb up this (pillar). I said to him (visitant in the dream): I am unable to do it. Thereupon a helper came to me, and he (supported) me (by catching hold of my) garment from behind and thus helped me with his hand and so I climbed up till I was at the summit of the pillar, and grasped the handhold. It was said to me: Ho d it tightly. It was at this that I woke up when (the handhold) was in fthe grip) of my hand. I narrated it (the dream) to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), whereupon he said: That garden implies al-Islam and that pillar implies the pillar of Islam. And that handhold is the firmest faith (as refered to in the Qur'an). And you will remain attached to Islam until you shall die. And that man was 'Abdullah b. Salim.",
                "hadithUrdu": "میں مدینہ منورہ میں کچھ لوگوں کےساتھ تھا جن میں نبی کریم صلی اللہ علیہ وسلم کے بعض صحابہ رضوان اللہ عنھم اجمعین بھی تھے ، پھر ایک شخص آیا جس کے چہرے پر خشوع کا اثر ( نظر آتا ) تھا ، لوگوں میں سے ایک نے کہا : یہ اہل جنت میں سے ایک آدمی ہے ۔ اس آدمی نے دو رکعت نماز پڑھی جن میں اختصار کیا پھر چلاگیا ۔ میں بھی اس کے پیچھے گیا ، پھر وہ اپنے گھر میں داخل ہوگیا ، میں بھی ( اجازت ) لے کر اندر گیا ، پھر ہم نے آپس میں باتیں کیں ۔ جب وہ کچھ میرے ساتھ مانوس ہوگئے تو میں نے ان سے کہا : جب آپ ( کچھ دیر ) پہلے مسجد میں آئے تھے تو آپ کے متعلق ایک شخص نے اس طرح کہاتھا ۔ انھوں نے کہا : سبحان اللہ!کسی شخص کے لئے مناسب نہیں کہ وہ کوئی بات کہے جس کا اسے پوری طرح علم نہیں اورمیں تمھیں بتاتا ہوں کہ یہ کیونکر ہوا ۔ میں نے رسول اللہ صلی اللہ علیہ وسلم کے عہد مبارک میں ایک خواب دیکھا اور وہ خواب آپ کے سامنے بیان کیا ۔ میں نے اپنے آپ کو ایک باغ میں دیکھا ۔ انھوں نے اس باغ کی وسعت ، اس کے پودوں اور اس کی شادابی کے بارے میں بتایا ۔ باغ کے وسط میں لوہے کا ایک ستون تھا ، اس کا نیچے کا حصہ زمین کے اندر تھا اور اسکے اوپر کا حصہ آسمان میں تھا ، اس کے اوپر کی جانب ایک حلقہ تھا ، مجھ سے کہا گیا : اس پرچڑھو ۔ میں نے کہا؛میں اس پر نہیں چڑھ سکتا ، پھر ایک منصف آیا ۔ ابن عون نے کہا : منصف ( سے مراد ) خادم ہےاس نے میرے پیچھے سے میرے کپڑے تھام لیے اور انھوں ( عبداللہ بن سلام رضی اللہ تعالیٰ عنہ ) نے واضح کیا کہ اس نے اپنے ہاتھ سے انھیں پیچھے سےاوپر اٹھایا تو میں اوپر چڑھ گیا یہاں تک کہ میں ستون کی چوٹی پر پہنچ گیا اور حلقے کو پکڑ لیا تو مجھ سےکہا گیا : اس کو مضبوطی سے پکڑ رکھو اور وہ میرے ہاتھ ہی میں تھا کہ میں جاگ گیا ۔ میں نے یہ ( خواب ) رسول اللہ صلی اللہ علیہ وسلم کے سامنے بیان کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" وہ باغ اسلام ہے ۔ اور وہ ستون اسلام کا ستون ہے اور وہ حلقہ ( ایمان کا ) مضبوط حلقہ ہے اور تم موت تک اسلام پر رہو گے ۔ \"\" ( قیس بن عباد نے ) کہا : اور وہ شخص عبداللہ بن سلام رضی اللہ تعالیٰ عنہ تھے ۔",
                "urduNarrator": "ہم سے محمد بن المثنی العنزی نے بیان کیا, معاذ بن معاذ نے کہا : ہمیں عبداللہ بن عون نے محمد بن سیرین سے حدیث بیان کی ، انھوں نے قیس بن عباد سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى الْعَنَزِيُّ، حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ، حَدَّثَنَا عَبْدُ اللهِ بْنُ عَوْنٍ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ قَيْسِ بْنِ عُبَادٍ، قَالَ: كُنْتُ بِالْمَدِينَةِ فِي نَاسٍ، فِيهِمْ بَعْضُ أَصْحَابِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَجَاءَ رَجُلٌ فِي وَجْهِهِ أَثَرٌ مِنْ خُشُوعٍ، فَقَالَ بَعْضُ الْقَوْمِ: هَذَا رَجُلٌ مِنْ أَهْلِ الْجَنَّةِ، هَذَا رَجُلٌ مِنْ أَهْلِ الْجَنَّةِ، فَصَلَّى رَكْعَتَيْنِ يَتَجَوَّزُ فِيهِمَا، ثُمَّ خَرَجَ فَاتَّبَعْتُهُ، فَدَخَلَ مَنْزِلَهُ، وَدَخَلْتُ، فَتَحَدَّثْنَا، فَلَمَّا اسْتَأْنَسَ قُلْتُ لَهُ: إِنَّكَ لَمَّا دَخَلْتَ قَبْلُ، قَالَ رَجُلٌ كَذَا وَكَذَا، قَالَ: سُبْحَانَ اللهِ مَا يَنْبَغِي لِأَحَدٍ أَنْ يَقُولَ مَا لَا يَعْلَمُ، وَسَأُحَدِّثُكَ لِمَ ذَاكَ؟ رَأَيْتُ رُؤْيَا عَلَى عَهْدِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَصَصْتُهَا عَلَيْهِ، رَأَيْتُنِي فِي رَوْضَةٍ - ذَكَرَ سَعَتَهَا وَعُشْبَهَا وَخُضْرَتَهَا - وَوَسْطَ الرَّوْضَةِ عَمُودٌ مِنْ حَدِيدٍ، أَسْفَلُهُ فِي الْأَرْضِ، وَأَعْلَاهُ فِي السَّمَاءِ، فِي أَعْلَاهُ عُرْوَةٌ، فَقِيلَ لِي: ارْقَهْ، فَقُلْتُ لَهُ: لَا أَسْتَطِيعُ، فَجَاءَنِي مِنْصَفٌ - قَالَ ابْنُ عَوْنٍ: وَالْمِنْصَفُ الْخَادِمُ - فَقَالَ بِثِيَابِي مِنْ خَلْفِي - وَصَفَ أَنَّهُ رَفَعَهُ مِنْ خَلْفِهِ بِيَدِهِ - فَرَقِيتُ حَتَّى كُنْتُ فِي أَعْلَى الْعَمُودِ، فَأَخَذْتُ بِالْعُرْوَةِ، فَقِيلَ لِيَ: اسْتَمْسِكْ. فَلَقَدِ اسْتَيْقَظْتُ وَإِنَّهَا لَفِي يَدِي، فَقَصَصْتُهَا عَلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «تِلْكَ الرَّوْضَةُ الْإِسْلَامُ، وَذَلِكَ الْعَمُودُ عَمُودُ الْإِسْلَامِ، وَتِلْكَ الْعُرْوَةُ عُرْوَةُ الْوُثْقَى، وَأَنْتَ عَلَى الْإِسْلَامِ حَتَّى تَمُوتَ» قَالَ: وَالرَّجُلُ عَبْدُ اللهِ بْنُ سَلَامٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13945,
                "hadithNumber": "6382",
                "englishNarrator": "Qais bin 'Ubaida reported:",
                "hadithEnglish": "I was (sitting) in a company in which there were (besides others) Sa'd b. Malik and Ibn 'Umar رضی اللہ عنہ that 'Abdullah bin Salam رضی اللہ عنہ happened to pass (by that side). They (the people sitting in that company) said: He is a person from amongst the dwellers of Paradise. I stood up and said to him: They say such and such (thing about you), whereupon he said: Hallowed be Allah, it is not meet for them to say (anything) of which They have no knowledge. Verily I saw as if a pillar had been raised in a green garden and there had been fixed at its (upper) end a handhold and there was a helper at its base. It was said to me: Climb up. So I climbed up and caught hold of the haildhold. I narrated (the contents of this dream) to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), whereupon he said: 'Abdullah would die in a state that he would be catching hold of the firmest handhold (he would die holding fast to the faith).",
                "hadithUrdu": "میں ایک مجلس میں بیٹھا تھا جس میں حضرت سعد بن مالک اور حضرت ابن عمر رضی اللہ عنہ بھی موجودتھے اتنے میں حضرت عبد اللہ بن سلام رضی اللہ تعالیٰ عنہ وہاں سے گزرے تو لو گوں نے کہا : یہ اہل جنت میں سے ایک شخص ہے میں اٹھا اور ان سے کہا : آپ کے متعلق لو گ اس اس طرح کہہ رہے تھے ، انھوں نے کہا : سبحان اللہ !انھیں زیبا نہیں کہ وہ ایسی بات کہیں جس کا انھیں ( پوری طرح ) علم نہ ہو ۔ میں نے ( خواب میں ) دیکھا کہ ایک ستون جو ایک سر سبز باغ کے اندر لا کر اس میں نصب کیا گیا تھا ۔ اس کی چوٹی پر ایک حلقہ تھا اور اس کے نیچے ایک منصف تھا ۔ اور منصف خدمت گا ر ہو تا ہے ۔ مجھ سے کہا : گیا : اس پر چڑھ جاؤ میں اس پر چڑھ گیا یہاں تک کہ حلقے کو پکڑ لیا ، پھر میں نے یہ خواب رسول اللہ صلی اللہ علیہ وسلم کے سامنے بیان کیا تو رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : عبد اللہ کی مو ت آئے گی تو اس نے عروہ ثقیٰ ( ایمان کا مضبوط حلقہ ) تھا م رکھا ہو گا ۔",
                "urduNarrator": "ہم سے محمد بن عمرو بن عباد بن جبلہ بن ابی رواد نے بیان کیا، ہم سے حرامی بن عمارہ نے بیان کیا, قرہ بن خالد نے ہمیں محمد بن سیرین سے حدیث سنائی انھوں نے کہا : قیس بن عباد نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرِو بْنِ عَبَّادِ بْنِ جَبَلَةَ بْنِ أَبِي رَوَّادٍ، حَدَّثَنَا حَرَمِيُّ بْنُ عُمَارَةَ، حَدَّثَنَا قُرَّةُ بْنُ خَالِدٍ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، قَالَ: قَالَ قَيْسُ بْنُ عُبَادٍ: كُنْتُ فِي حَلَقَةٍ فِيهَا سَعْدُ بْنُ مَالِكٍ، وَابْنُ عُمَرَ، فَمَرَّ عَبْدُ اللهِ بْنُ سَلَامٍ، فَقَالُوا: هَذَا رَجُلٌ مِنْ أَهْلِ الْجَنَّةِ، فَقُمْتُ فَقُلْتُ لَهُ: إِنَّهُمْ قَالُوا كَذَا وَكَذَا، قَالَ: سُبْحَانَ اللهِ مَا كَانَ يَنْبَغِي لَهُمْ أَنْ يَقُولُوا مَا لَيْسَ لَهُمْ بِهِ عِلْمٌ، إِنَّمَا رَأَيْتُ كَأَنَّ عَمُودًا وُضِعَ فِي رَوْضَةٍ خَضْرَاءَ، فَنُصِبَ فِيهَا، وَفِي رَأْسِهَا عُرْوَةٌ، وَفِي أَسْفَلِهَا مِنْصَفٌ - وَالْمِنْصَفُ الْوَصِيفُ - فَقِيلَ لِيَ: ارْقَهْ، فَرَقِيتُ حَتَّى أَخَذْتُ بِالْعُرْوَةِ، فَقَصَصْتُهَا عَلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «يَمُوتُ عَبْدُ اللهِ وَهُوَ آخِذٌ بِالْعُرْوَةِ الْوُثْقَى».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13946,
                "hadithNumber": "6383",
                "englishNarrator": "Kharasha bin Hurr reported:",
                "hadithEnglish": "I was sitting in a circle in the mosque of Medina and there was an old man, quite handsome. He was 'Abdullah bin Salam  رضی اللہ عنہ . He was telling good things to them (to the people sitting in that company). As he stood up (to depart) the people said: He who is desirous of looking at a person from amongst the people of Paradise should see him. I said: By Allah, I will follow him, and would try to know his residence. So I followed him and he walked on until he reached the outskirts of Medina. He then entered his house. I sought permission from him to get in, and he granted me the permission, saying: My nephew, what is the need (that has brought you here)? I said to him: As you stood up, I heard people say about you: He who is desirous of seeing a person from among the people of Paradise should look at him. So I became desirous of accompanying you. He ('Abdullah b. Salim) said: It is Allah Who knows best about the people of Paradise. I would, however, narrate to you as to why they said like it. (The story is) that while I was asleep (one night) there came to me a person (in the dream) who asked me to stand up. (So I stood up) and he caught hold of my hand and I walked along with him, and, lo, I found some paths on my left and I was about to set out upon them. Thereupon he said to me Do not set yourself on (them) for these are the paths of the leftists (denizens of Hell-fire). Then there were paths leading to the right side, whereupon he said: Set yourself on these paths. We came across a hill and he said to me: Climb up, and I attempted to climb up that I fell upon my buttocks. I made several attempts (but failed to succeed). He led until he came to a pillar (so high) that its upper end touched the sky and its base was in the earth. And there was a handhold at its upper end. He said to me Climb over it. I said: How can I climb upon it, as its upper end touches the sky? He cought hold of my hand and pushed me up and I found myself suspended with the handhold. He then struck the pillar and it fell down, but I remained attached to that handhold until it was morning (and the dream was thus over). I came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and narrated it to him. He said: So far as the paths which you saw on your left are concerned, these are paths of the leftists (denizens of Hell) and the paths which you saw on your right, these are the paths of the rightists (the dwellers of Paradise) and the mountain represents the destination of the martyrs which you would not be able to attain. The pillar implies the pillar of Islam. and so far as the handhold is concerned, it implies the handhold of Islam, and you would hold to it fastly until you would meet death.",
                "hadithUrdu": "میں مدینہ منورہ کی مسجد کے اندر ایک حلقے میں بیٹھا ہوا تھا ، کہا : اس میں خوبصورت ہیت والے ایک حسین وجمیل بزرگ بھی موجود تھے ۔ وہ عبداللہ بن سلام رضی اللہ عنہ تھے ، کہا : انھوں نے ان لوگوں کو خوبصورت احادیث سنانی شروع کردیں ، کہا : جب وہ کھڑے ہوئے تو لوگوں نے کہا کہ جس کو ایک جنتی کا دیکھنا اچھا معلوم ہو ، وہ اس کو دیکھے ۔ میں نے ( اپنے دل میں ) کہا کہ اللہ کی قسم میں ان کے ساتھ جاؤں گا اور ان کا گھر دیکھوں گا ۔ پھر میں ان کے پیچھے ہوا ، وہ چلے ، یہاں تک کہ قریب ہوا کہ وہ شہر سے باہر نکل جائیں ، پھر وہ اپنے مکان میں گئے تو میں نے بھی اندر آنے کی اجازت چاہی ۔ انہوں نے اجازت دی ، پھر پوچھا کہ اے میرے بھتیجے! تجھے کیا کام ہے؟ میں نے کہا کہ جب آپ کھڑے ہوئے تو میں نے لوگوں کو سنا کہ جس کو ایک جنتی کا دیکھنا اچھا لگے ، وہ ان کو دیکھے تو مجھے آپ کے ساتھ رہنا اچھا معلوم ہوا ۔ انہوں نے کہا کہ جنت والوں کو اللہ تعالیٰ جانتا ہے اور میں تجھ سے لوگوں کے یہ کہنے کی وجہ بیان کرتا ہوں ۔ میں ایک دفعہ سو رہا تھا کہ خواب میں ایک شخص آیا اور اس نے کہا کہ کھڑا ہو ۔ پھر اس نے میرا ہاتھ پکڑا ، میں اس کے ساتھ چلا ، مجھے بائیں طرف کچھ راہیں ملیں تو میں نے ان میں جانا چاہا تو وہ بولا کہ ان میں مت جا ، یہ بائیں طرف والوں ( یعنی کافروں ) کی راہیں ہیں ۔ پھر دائیں طرف کی راہیں ملیں تو وہ شخص بولا کہ ان راہوں میں جا ۔ پس وہ مجھے ایک پہاڑ کے پاس لے آیا اور بولا کہ اس پر چڑھ ۔ میں نے اوپر چڑھنا چاہا تو پیٹھ کے بل گرا ۔ کئی بار میں نے چڑھنے کا قصد کیا لیکن ہر بار گرا ۔ پھر وہ مجھے لے چلا ، یہاں تک کہ ایک ستون ملا جس کی چوٹی آسمان میں تھی اور تہہ زمین میں ، اس کے اوپر ایک حلقہ تھا ۔ مجھ سے اس شخص نے کہا کہ اس ستون کے اوپر چڑھ جا ۔ میں نے کہا کہ میں اس پر کیسے چڑھوں کہ اس کا سرا تو آسمان میں ہے ۔ آخر اس شخص نے میرا ہاتھ پکڑا اور مجھے اچھال دیا اور میں نے دیکھا کہ میں اس حلقہ کو پکڑے ہوئے لٹک رہا ہوں ۔ پھر اس شخص نے ستون کو مارا تو وہ گر پڑا اور میں صبح تک اسی حلقہ میں لٹکتا رہا ( اس وجہ سے کہ اترنے کا کوئی ذریعہ نہیں رہا ) ۔ کہتے ہیں پس میں نے رسول اللہ صلی اللہ علیہ وسلم کے پاس آ کر اپنا خواب بیان کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ جو راہیں تو نے بائیں طرف دیکھیں ، وہ بائیں طرف والوں کی راہیں ہیں اور جو راہیں دائیں طرف دیکھیں ، وہ دائیں طرف والوں کی راہیں ہیں ۔ اور وہ پہاڑ شہیدوں کا مقام ہے ، تو وہاں تک نہ پہنچ سکے گا اور ستون ، اسلام کا ستون ہے اور حلقہ ، اسلام کا حلقہ ہے اور تو مرتے دم تک اسلام پر قائم رہے گا ۔ ( اور جب اسلام پر خاتمہ ہو تو جنت کا یقین ہے ، اس وجہ سے لوگ مجھے جنتی کہتے ہیں ).",
                "urduNarrator": "ہم سے قتیبہ بن سعید اور اسحاق بن ابراہیم نے بیان کیا - اور لفظ قتیبہ ہے - ہم سے جریر نے الاعمش سے اور سلیمان بن مشر کی سند سے بیان کیا, خرشہ بن حر سے روایت ہے ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لِقُتَيْبَةَ - حَدَّثَنَا جَرِيرٌ، عَنِ الْأَعْمَشِ، عَنْ سُلَيْمَانَ بْنِ مُسْهِرٍ، عَنْ خَرَشَةَ بْنِ الْحُرِّ، قَالَ: كُنْتُ جَالِسًا فِي حَلَقَةٍ فِي مَسْجِدِ الْمَدِينَةِ، قَالَ: وَفِيهَا شَيْخٌ حَسَنُ الْهَيْئَةِ، وَهُوَ عَبْدُ اللهِ بْنُ سَلَامٍ، قَالَ: فَجَعَلَ يُحَدِّثُهُمْ حَدِيثًا حَسَنًا، قَالَ فَلَمَّا قَامَ قَالَ الْقَوْمُ: مَنْ سَرَّهُ أَنْ يَنْظُرَ إِلَى رَجُلٍ مِنْ أَهْلِ الْجَنَّةِ فَلْيَنْظُرْ إِلَى هَذَا، قَالَ فَقُلْتُ: وَاللهِ لَأَتْبَعَنَّهُ فَلَأَعْلَمَنَّ مَكَانَ بَيْتِهِ، قَالَ فَتَبِعْتُهُ، فَانْطَلَقَ حَتَّى كَادَ أَنْ يَخْرُجَ مِنَ الْمَدِينَةِ، ثُمَّ دَخَلَ مَنْزِلَهُ، قَالَ: فَاسْتَأْذَنْتُ عَلَيْهِ فَأَذِنَ لِي، فَقَالَ: مَا حَاجَتُكَ؟ يَا ابْنَ أَخِي قَالَ فَقُلْتُ لَهُ: سَمِعْتُ الْقَوْمَ يَقُولُونَ لَكَ، لَمَّا قُمْتَ: مَنْ سَرَّهُ أَنْ يَنْظُرَ إِلَى رَجُلٍ مِنْ أَهْلِ الْجَنَّةِ فَلْيَنْظُرْ إِلَى هَذَا، فَأَعْجَبَنِي أَنْ أَكُونَ مَعَكَ، قَالَ: اللهُ أَعْلَمُ بِأَهْلِ الْجَنَّةِ، وَسَأُحَدِّثُكَ مِمَّ قَالُوا ذَاكَ، إِنِّي بَيْنَمَا أَنَا نَائِمٌ، إِذْ أَتَانِي رَجُلٌ فَقَالَ لِي: قُمْ، فَأَخَذَ بِيَدِي فَانْطَلَقْتُ مَعَهُ، قَالَ: فَإِذَا أَنَا بِجَوَادَّ عَنْ شِمَالِي، قَالَ: فَأَخَذْتُ لِآخُذَ فِيهَا، فَقَالَ لِي لَا تَأْخُذْ فِيهَا فَإِنَّهَا طُرُقُ أَصْحَابِ الشِّمَالِ، قَالَ فَإِذَا جَوَادُّ مَنْهَجٌ عَلَى يَمِينِي، فَقَالَ لِي: خُذْ هَاهُنَا، فَأَتَى بِي جَبَلًا، فَقَالَ لِيَ: اصْعَدْ، قَالَ فَجَعَلْتُ إِذَا أَرَدْتُ أَنْ أَصْعَدَ خَرَرْتُ عَلَى اسْتِي، قَالَ: حَتَّى فَعَلْتُ ذَلِكَ مِرَارًا، قَالَ: ثُمَّ انْطَلَقَ بِي حَتَّى أَتَى بِي عَمُودًا، رَأْسُهُ فِي السَّمَاءِ وَأَسْفَلُهُ فِي الْأَرْضِ، فِي أَعْلَاهُ حَلْقَةٌ، فَقَالَ لِيَ: اصْعَدْ فَوْقَ هَذَا، قَالَ قُلْتُ: كَيْفَ أَصْعَدُ هَذَا؟ وَرَأْسُهُ فِي السَّمَاءِ، قَالَ فَأَخَذَ بِيَدِي فَزَجَلَ بِي، قَالَ فَإِذَا أَنَا مُتَعَلِّقٌ بِالْحَلْقَةِ، قَالَ ثُمَّ ضَرَبَ الْعَمُودَ فَخَرَّ، قَالَ وَبَقِيتُ مُتَعَلِّقًا بِالْحَلْقَةِ حَتَّى أَصْبَحْتُ، قَالَ فَأَتَيْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَقَصَصْتُهَا عَلَيْهِ، فَقَالَ: «أَمَّا الطُّرُقُ الَّتِي رَأَيْتَ عَنْ يَسَارِكَ فَهِيَ طُرُقُ أَصْحَابِ الشِّمَالِ، قَالَ وَأَمَّا الطُّرُقُ الَّتِي رَأَيْتَ عَنْ يَمِينِكَ فَهِيَ طُرُقُ أَصْحَابِ الْيَمِينِ، وَأَمَّا الْجَبَلُ فَهُوَ مَنْزِلُ الشُّهَدَاءِ، وَلَنْ تَنَالَهُ، وَأَمَّا الْعَمُودُ فَهُوَ عَمُودُ الْإِسْلَامِ، وَأَمَّا الْعُرْوَةُ فَهِيَ عُرْوَةُ الْإِسْلَامِ وَلَنْ تَزَالَ مُتَمَسِّكًا بِهَا حَتَّى تَمُوتَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13947,
                "hadithNumber": "6384",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "'Umar رضی اللہ عنہ happened to pass by Hassan رضی اللہ عنہ as he was reciting verses in the mosque. He (Hadrat 'Umar رضی اللہ عنہ ) looked towards him (meaningfully), whereupon he (Hassan رضی اللہ عنہ ) said: I used to recite (verses) when one better than you (the Holy Prophet) had been present (here). He then looked towards Abu Huraira رضی اللہ عنہ and said to him: I adjure you by Allah (to tell) if you had not heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: (Hassan رضی اللہ عنہ), give a reply on my behalf; Allah I help him with Ruh-ul-Qudus. He (Abu Huraira رضی اللہ عنہ ) said: By Allah, it is so (i.e. the Prophet actually said these words).",
                "hadithUrdu": "سیدنا عمر بن خطاب رضی اللہ عنہ سیدنا حسان رضی اللہ عنہ کے پاس سے گزرے اور وہ مسجد میں شعر پڑھ رہے تھے ( معلوم ہوا کہ اشعار جو اسلام کی تعریف اور کافروں کی برائی یا جہاد کی ترغیب میں ہو مسجد میں پڑھنا درست ہے ) ۔ سیدنا عمر رضی اللہ عنہ نے ان کی طرف ( غصہ سے ) دیکھا ۔ سیدنا حسان رضی اللہ عنہ نے کہا کہ میں تو مسجد میں ( اس وقت بھی ) شعر پڑھتا تھا جب تم سے بہتر شخص ( یعنی نبی کریم صلی اللہ علیہ وسلم ) موجود تھے ۔ پھر سیدنا ابوہریرہ رضی اللہ عنہ کی طرف دیکھا اور کہا کہ میں تمہیں اللہ کی قسم دیتا ہوں کہ تم نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے؟ آپ صلی اللہ علیہ وسلم فرماتے تھے کہ اے حسان! میری طرف سے جواب دے ، اے اللہ اس کی روح القدس ( جبرائیل علیہ السلام ) سے مدد کر ۔ سیدنا ابوہریرہ رضی اللہ عنہ نے کہا ہاں میں نے سنا ہے یا اللہ تو جانتا ہے ۔",
                "urduNarrator": "ہم سے عمرو نا قد، اسحاق بن ابراہیم اور ابن ابی عمر نے بیان کیا, سفیان بن عیینہ نے زہری سے ، انھوں نے سعید ( بن مسیب ) سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی ، کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ أَبِي عُمَرَ، كُلُّهُمْ عَنْ سُفْيَانَ، قَالَ: عَمْرٌو، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ عُمَرَ، مَرَّ بِحَسَّانَ وَهُوَ يُنْشِدُ الشِّعْرَ فِي الْمَسْجِدِ، فَلَحَظَ إِلَيْهِ، فَقَالَ: قَدْ كُنْتُ أُنْشِدُ، وَفِيهِ مَنْ هُوَ خَيْرٌ مِنْكَ، ثُمَّ الْتَفَتَ إِلَى أَبِي هُرَيْرَةَ، فَقَالَ: أَنْشُدُكَ اللهَ أَسَمِعْتَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «أَجِبْ عَنِّي، اللهُمَّ أَيِّدْهُ بِرُوحِ الْقُدُسِ»؟ قَالَ: اللهُمَّ نَعَمْ.",
                "headingArabic": "فَضَائِلِ حَسَّانَ بْنِ ثَابِتٍ رضى الله عنه ‏‏",
                "headingUrdu": "حسن بن ثابت رضی اللہ عنہ کے فضائل",
                "headingEnglish": "The Virtues Of Hassan Bin Thabit (RA)",
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13948,
                "hadithNumber": "6385",
                "englishNarrator": null,
                "hadithEnglish": "Ibn Musayyib reported: Hassan رضی اللہ عنہ said to a circle in which there was also Abu Huraira رضی اللہ عنہ : Abu Huraira رضی اللہ عنہ, I adjure you by Allah (to tell) whether you-had not heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) saying like this.",
                "hadithUrdu": "ہم سے اسحاق بن ابراہیم، محمد بن رافع اور عبد بن حمید نے عبد الرزاق کی سند سے بیان کیا, معمر نے زہری سے ، انھوں نے ابن مسیب سے روایت کی کہ حضرت حسان رضی اللہ عنہ نے ایک حلقے میں کہا جس میں ابوہریرہ رضی اللہ تعالیٰ عنہ موجود تھے : ابوہریرہ رضی اللہ عنہ !میں آپ کو اللہ کی قسم دیتا ہوں ، کیا آپ نے رسول اللہ صلی اللہ علیہ وسلم سے سنا تھا؟اس کے بعد اس کے مانند یوں بیان کیا ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ رَافِعٍ وَعَبْدُ بْنُ حُمَيْدٍ، عَنْ عَبْدِ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنِ ابْنِ الْمُسَيِّبِ، أَنَّ حَسَّانَ، قَالَ فِي حَلْقَةٍ فِيهِمْ أَبُو هُرَيْرَةَ: أَنْشُدُكَ اللهَ يَا أَبَا هُرَيْرَةَ أَسَمِعْتَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13949,
                "hadithNumber": "6386",
                "englishNarrator": "Abdul-Rahman reported:",
                "hadithEnglish": "He heard Hassin bin Thabit al-Ansari رضی اللہ عنہ call Abu Huraira رضی اللہ عنہ to bear witness by saying: I adjure you by Allah if you had not heard Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) saying: Hassin, give a reply on behalf of the Messenger of Allah. O Allah, help him with Ruh-ul-Qudus. Abu Huraira رضی اللہ عنہ said: Yes, it is so.",
                "hadithUrdu": "انھوں نے حضرت حسان بن ثابت انصاری رضی اللہ عنہ سے سنا ، وہ حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے گواہی طلب کررہے تھے ، ( کہہ رہے تھے : ) میں تمھارے سامنے اللہ کا نام لیتا ہوں! کیاتم نے نبی کریم صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سناتھا ۔ \" حسان!اللہ کےرسول صلی اللہ علیہ وسلم کی طرف سے جواب دو ۔ اےاللہ!روح القدس کے ذریعے سے اس کی تائید فرما! \" ؟ابو ہریرہ رضی اللہ تعالیٰ عنہ نے کہا : ہاں ۔",
                "urduNarrator": "ہم سے عبداللہ بن عبدالرحمٰن الدارمی نے بیان کیا، کہا ہم سے ابوالیمان نے بیان کیا، کہا ہم سے شعیب نے بیان کیا, زہری نے کہا ,  مجھے ابو سلمہ بن عبدالرحمن نے بتایا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّهُ سَمِعَ حَسَّانَ بْنَ ثَابِتٍ الْأَنْصَارِيَّ، يَسْتَشْهِدُ أَبَا هُرَيْرَةَ أَنْشُدُكَ اللهَ هَلْ سَمِعْتَ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: «يَا حَسَّانُ أَجِبْ عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، اللهُمَّ أَيِّدْهُ بِرُوحِ الْقُدُسِ» قَالَ أَبُو هُرَيْرَةَ: نَعَمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13950,
                "hadithNumber": "6387",
                "englishNarrator": "Al-Bari' bin 'Azib رضی اللہ عنہ reported:",
                "hadithEnglish": "I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Hassan bin Thabit رضی اللہ عنہ , write satire (against the non-believers) ; Gabriel is with you.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو حضرت حسان بن ثابت رضی اللہ عنہ سے یہ فرماتے ہوئے سنا : \" ان ( کافروں ) کی ہجو کرو ، یا ( فرمایا : ) ہجو میں ان کا مقابلہ کرو جبرائیل تمھارے ساتھ ہیں ۔ \"",
                "urduNarrator": "عبید اللہ بن معاذ نے کہا : ہمیں شعبہ نے عدی بن ثابت سے حدیث بیان کی ، انھوں نے کہا : میں نے حضرت براء بن عاذب رضی اللہ عنہ سے سنا ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيٍّ وَهُوَ ابْنُ ثَابِتٍ، قَالَ: سَمِعْتُ الْبَرَاءَ بْنَ عَازِبٍ، قَالَ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ لِحَسَّانَ بْنِ ثَابِتٍ: «اهْجُهُمْ، أَوْ هَاجِهِمْ، وَجِبْرِيلُ مَعَكَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13951,
                "hadithNumber": "6388",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters.",
                "hadithUrdu": "مجھ سے زہیر بن حرب نے بیان کیا، ہم سے عبدالرحمٰن، مجھ سے ابوبکر بن نافع نے بیان کیا، ہم سے غندر، ح نے بیان کیا، ہم سے ابن بشار نے بیان کیا, محمد بن جعفر غندر اور عبدا الرحمان ( بن مہدی ) دونوں نے شعبہ سے اسی سندک سا تھ اسی کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، ح وحَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ، حَدَّثَنَا غُنْدَرٌ، ح وَحَدَّثَنَا ابْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، وَعَبْدُ الرَّحْمَنِ كُلُّهُمْ، عَنْ شُعْبَةَ بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13952,
                "hadithNumber": "6389",
                "englishNarrator": "Hisham reported on the authority of his father:",
                "hadithEnglish": "Hassan bin Thabit رضی اللہ عنہ talked much about 'A'isha رضی اللہ عنہا. I scolded him, whereupon she said: My nephew, leave him for he defended Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌).",
                "hadithUrdu": "حضرت حسان بن ثابت رضی اللہ تعالیٰ عنہ ان لوگوں میں سے تھے جنھوں نے ام المومنین حضرت عائشہ رضی اللہ عنہا کے متعلق بہت کچھ کہا تھا ( تہمت لگانے والوں کے ساتھ شامل ہوگئے تھے ) ، میں نے ان کو برا بھلا کہا توحضرت عائشہ رضی اللہ تعالیٰ عنہا نے فرمایا : بھتیجے!ان کو کچھ نہ کہو ، کیونکہ وہ رسول اللہ صلی اللہ علیہ وسلم کی طرف سے کافروں کو جواب دیتے تھے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، انہوں نے کہا: ابو اسامہ نے ہشام ( بن عروہ ) سے ، انھوں نے اپنے والد سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، قَالَا: حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، أَنَّ حَسَّانَ بْنَ ثَابِتٍ، كَانَ مِمَّنْ كَثَّرَ عَلَى عَائِشَةَ فَسَبَبْتُهُ فَقَالَتْ: يَا ابْنَ أُخْتِي دَعْهُ «فَإِنَّهُ كَانَ يُنَافِحُ عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13953,
                "hadithNumber": "6390",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Hisham with the same chain of transmitters.",
                "hadithUrdu": "ہم سے عثمان بن ابی شیبہ نے بیان کیا, عبدہ نے ہشام سے اسی سند کے ساتھ حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَاهُ عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ، عَنْ هِشَامٍ بِهَذَا الْإِسْنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13954,
                "hadithNumber": "6391",
                "englishNarrator": "Masruq reported:",
                "hadithEnglish": "I visited 'A'isha رضی اللہ عنہا when Hassan رضی اللہ عنہ was sitting there and reciting verses from his compilation: She is chaste and prudent. There is no calumny against her and she rises up early in the morning without eating the meat of the un- mindful. 'A'isha رضی اللہ عنہا said: But you are not so. Masruq said: I said to her: Why do you permit him to visit you, whereas Allah has said: And as for him among them who took upon himself the main part thereof, he shall have a grievous punishment (XXIV. ll)? Thereupon she said: What tornient can be more severe than this that he has become blind? He used to write satire as a rebuttal on behalf of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ).",
                "hadithUrdu": "میں ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا کے پاس گیا تو ان کے پاس سیدنا حسان بن ثابت رضی اللہ عنہ بیٹھے اپنی غزل میں سے ایک شعر سنا رہے تھے جو چند بیتوں کی انہوں نے کہی تھی ۔ وہ شعر یہ ہے کہ : ”پاک ہیں اور عقل والی ان پہ کچھ تہمت نہیں ۔ صبح کو اٹھتی ہیں بھوکی غافلوں کے گوشت سے“ ( یعنی کسی کی غیبت نہیں کرتیں کیونکہ غیبت کرنا گویا اس کا گوشت کھانا ہے ) ۔ ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا نے سیدنا حسان رضی اللہ عنہ سے کہا کہ لیکن تو ایسا نہیں ہے ( یعنی تو لوگوں کی غیبت کرتا ہے ) ۔ مسروق نے کہا کہ میں نے ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا سے کہا کہ آپ حسان رضی اللہ عنہ کو اپنے پاس کیوں آنے دیتی ہو حالانکہ اللہ تعالیٰ نے ان کی شان میں فرمایا ہے کہ ”وہ شخص جس نے ان میں سے بڑی بات ( یعنی ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا پر تہمت لگانے ) کا بیڑا اٹھایا اس کے واسطے بڑا عذاب ہے ۔ ( حسان بن ثابت رضی اللہ عنہ ان لوگوں میں شریک تھے جنہوں نے ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا پر تہمت لگائی تھی ۔ پھر آپ صلی اللہ علیہ وسلم نے ان کو حد لگائی ) ام المؤمنین عائشہ رضی اللہ عنہا نے کہا کہ اس سے زیادہ عذاب کیا ہو گا کہ وہ نابینا ہو گیا ہے اور کہا کہ وہ رسول اللہ صلی اللہ علیہ وسلم کی طرف سے کافروں کی جوابدہی کرتا تھا یا ہجو کرتا تھا ۔ ( اس لئے اس کو اپنے پاس آنے کی اجازت دیتی ہوں ) ۔",
                "urduNarrator": "بشر بن خالد نے مجھ سے کہا, محمد بن جعفر نے شعبہ سے ، انھوں نے سلیمان سے ، انھوں نے ابو ضحیٰ سے ، انھوں نے مسروق سے روایت کی کہا : کہ",
                "hadithArabic": "حَدَّثَنِي بِشْرُ بْنُ خَالِدٍ، أَخْبَرَنَا مُحَمَّدٌ يَعْنِي ابْنَ جَعْفَرٍ، عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، قَالَ: دَخَلْتُ عَلَى عَائِشَةَ وَعِنْدَهَا حَسَّانُ بْنُ ثَابِتٍ يُنْشِدُهَا شِعْرًا يُشَبِّبُ بِأَبْيَاتٍ لَهُ فَقَالَ: حَصَانٌ رَزَانٌ مَا تُزَنُّ بِرِيبَةٍ وَتُصْبِحُ غَرْثَى مِنْ لُحُومِ الْغَوَافِلِ فَقَالَتْ لَهُ عَائِشَةُ: لَكِنَّكَ لَسْتَ كَذَلِكَ، قَالَ مَسْرُوقٌ فَقُلْتُ لَهَا: لِمَ تَأْذَنِينَ لَهُ يَدْخُلُ عَلَيْكِ؟ وَقَدْ قَالَ اللهُ: {وَالَّذِي تَوَلَّى كِبْرَهُ مِنْهُمْ لَهُ عَذَابٌ عَظِيمٌ} [النور: 11] فَقَالَتْ: فَأَيُّ عَذَابٍ أَشَدُّ مِنَ الْعَمَى؟ إِنَّهُ كَانَ يُنَافِحُ أَوْ يُهَاجِي عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13955,
                "hadithNumber": "6392",
                "englishNarrator": "It was narrated from Shu'ba with this chain of narrators (a Hadith similar to no. 6391), and he said:",
                "hadithEnglish": "She (Aishah' رضی اللہ عنہا) said: \"He used to composed satire as a rebuttal behalf of the Messenger of Allah ﷺ. But he did not mention the words: 'She is chaste and prudent.'\"",
                "hadithUrdu": "حضرت عائشہ رضی اللہ عنہا نے فرمایا : حضرت حسان بن ثابت رضی اللہ تعالیٰ عنہ رسول اللہ صلی اللہ علیہ وسلم کی طرف سے مدافعت کرتے تھے ، انھوں نے ( حضرت عائشہ رضی اللہ تعالیٰ عنہا کی مدح والاحصہ ) \" وہ پاکیزہ ہیں ، عقل مند ہیں \" بیان نہیں کیا ۔",
                "urduNarrator": "ہم سے ابن المثنی نے بیان کیا, ابن ابی عدی نے شعبہ سے اسی سند کے ساتھ حدیث بیان کی اورکہا",
                "hadithArabic": "حَدَّثَنَاهُ ابْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ شُعْبَةَ، فِي هَذَا الْإِسْنَادِ، وَقَالَ قَالَتْ: كَانَ يَذُبُّ عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَلَمْ يَذْكُرْ حَصَانٌ رَزَانٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13956,
                "hadithNumber": "6393",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "Hassan رضی اللہ عنہ said: Allah's Messenger, permit me to write satire against Abu Sufyan, whereupon he said: How can it be because I am also related to him? Thereupon he (Hassan رضی اللہ عنہ) said: By Him Who has honoured you. I shall draw you out from them (their family) just as hair is drawn out from the fermented (flour). Thereupon Hassan رضی اللہ عنہ said: The dignity and greatness belongs to the tribe of Bint Makhzum from amongst the tribe of Hisham, whereas your father was a slave.",
                "hadithUrdu": "حضرت حسان رضی اللہ تعالیٰ عنہ نے عرض کی : اللہ کےرسول صلی اللہ علیہ وسلم !مجھے ابو سفیان ( مغیرہ بن حارث بن عبدالمطلب ) کی ہجو کرنے کی اجازت دیجئے ، آپ نے فرمایا : \"\" اس کے ساتھ میری جو قرابت ہے اس کا کیا ہوگا؟ \"\" حضرت حسان رضی اللہ تعالیٰ عنہ نےکہا : اس ذات کی قسم جس نے آپ کو عزت عطا فرمائی!میں آپ کو ان میں سے اس طرح باہرنکال لوں گا جس طرح خمیر سے بال کو نکال لیا جاتاہے ، پھر حضرت حسان رضی اللہ تعالیٰ عنہ نے یہ قصیدہ کہا : اور آل ہاشم میں سے عظمت ومجد کی چوٹی پر وہ ہیں جو بنت مخزوم ( فاطمہ بنت عمرو بن عابد بن عمران بن مخزوم ) کی اولاد ہیں ( ابو طالب ، عبداللہ اور زبیر ) اورتیرا باپ تو غلام ( کنیز کا بیٹا ) تھا ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا, یحییٰ بن زکریا نے ہمیں ہشام بن عروہ سے خبر دی ، انھوں نے اپنے والد سے اور انھوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا يَحْيَى بْنُ زَكَرِيَّاءَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ: قَالَ حَسَّانُ: يَا رَسُولَ اللهِ، ائْذَنْ لِي فِي أَبِي سُفْيَانَ، قَالَ: «كَيْفَ بِقَرَابَتِي مِنْهُ؟» قَالَ: وَالَّذِي أَكْرَمَكَ لَأَسُلَّنَّكَ مِنْهُمْ كَمَا تُسَلُّ الشَّعْرَةُ مِنَ الْخَمِيرِ، فَقَالَ حَسَّانُ: [البحر الطويل] وَإِنَّ سَنَامَ الْمَجْدِ مِنْ آلِ هَاشِمٍ ... بَنُو بِنْتِ مَخْزُومٍ وَوَالِدُكَ الْعَبْدُ قَصِيدَتَهُ هَذِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13957,
                "hadithNumber": "6394",
                "englishNarrator": "Urwa reported on the same chain of transmitters:",
                "hadithEnglish": "Hassan bin Thabit رضی اللہ عنہ sought permission from Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) to satirise against the polytheists, but he did not mention Abu Sufyan. And instead of the word al- Khamir, the word al-'Ajin was used.",
                "hadithUrdu": "حسان بن ثابت رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے مشرکین کی ہجو کرنے کی اجازت مانگی ۔ اور ( عبدہ نے ) ابو سفیان کا ذکر نہیں کیا اور ۔ ۔ ۔ خمیر کے بجائے ۔ گندھا ہوا آٹا کہا ۔",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ نے بیان کیا, عبدہ نے ہشام بن عروہ سے اسی سند کے ساتھ حدیث بیان کی کہ حضرت عائشہ رضی اللہ عنہا نے کہا",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، بِهَذَا الْإِسْنَادِ، قَالَتْ: اسْتَأْذَنَ حَسَّانُ بْنُ ثَابِتٍ، النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي هِجَاءِ الْمُشْرِكِينَ، وَلَمْ يَذْكُرْ أَبَا سُفْيَانَ، وَقَالَ بَدَلَ - الْخَمِيرِ - الْعَجِينِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13958,
                "hadithNumber": "6395",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "Allah's Messenger (ﷺ) said. Satirise against the (non-believing amongst the) Quraish, for (the satire) is more grievous to them than the hurt of an arrow. So he (the Holy Prophet ﷺ) sent (someone) to Ibn Rawiha رضی اللہ عنہ and asked him to satirise against them, and he composed a satire, but it did not appeal to him (to the Holy Prophet). He then sent (someone) to Ka'b bin Malik (to do the same, but what he composed did not appeal to the Holy Prophet ﷺ). He then sent one to Hassan b. Thabit. As he got into his presence, Hassan said: Now you have called for this lion who strikes (the enemies) with his tail. He then brought out his tongue and began to move it and said: By Him Who has sent you with Truth, I shall tear them with my tongue as the leather is torn. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Don't be hasty; (let) Abu Bakr رضی اللہ عنہ who has the best know- ledge of the lineage of the Quraish draw a distinction for you in regard to my lineage, as my lineage is the same as theirs. Hassan then came to him (Abu Bakr رضی اللہ عنہ ) and after making inquiry (in regard to the lineage of the Holy Prophet) came back to him (the holy Prophet ﷺ) and said: Allah's Messenger ﷺ, he (Abu Bakr رضی اللہ عنہ) has drawn a distinction in vour lineage (and that of the Quraish) By Him Who has sent you with Truth, I shall draw out from them (your name) as hair is drawn out from the flour. 'A'isha رضی اللہ عنہا said: I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying to Hassin: Verily Ruh-ul- Qudus would continue to help you so long as you put up a defence on behalf of Allah and His Messenger. And she said: I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) saying: Hassan satirised against them and gave satisfaction to the (Muslims) and disquieted (the non-Muslims). You satirised Muhammad, but I replied on his behalf, And there is reward with Allah for this. You satirised Muhammad. virtuous, righteous, The Apostle of Allah, whose nature is truthfulness. So verily my father and his father and my honour Are a protection to the honour of Muhammad; May I lose my dear daughter, if you don't see her, Wiping away the dust from the two sides of Kada', They pull at the rein, going upward; On their shoulders are spears thirsting (for the blood of the enemy) ; our steeds are sweating-our women wipe them with their mantles. If you had not interfered with us, we would have performed the 'Umra, And (then) there was the Victory, and the darkness cleared away. Otherwise wait for the fighting on the day in which Allah will honour whom He pleases. And Allah said: I have sent a servant who says the Truth in which there is no ambiguity; And Allah said: I have prepared an army-they are the Ansar whose object is fighting (the enemy), There reaches every day from Ma'add abuse, or fighting or satire; Whoever satirises the Apostle from amongst you, or praises him and helps it is all the same, And Gabriel, the Messenger of Allah is among us, and the Holy Spirit who has no match.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \"\" قریش کی ہجو کرو کیونکہ ہجو ان کو تیروں کی بوچھاڑ سے زیادہ ناگوار ہے ۔ پھر آپ صلی اللہ علیہ وسلم نے ایک شخص کو سیدنا ابن رواحہ رضی اللہ عنہ کے پاس بھیجا اور فرمایا کہ قریش کی ہجو کرو ۔ انہوں نے ہجو کی لیکن آپ صلی اللہ علیہ وسلم کو پسند نہ آئی ۔ پھر سیدنا کعب بن مالک رضی اللہ عنہ کے پاس بھیجا ۔ پھر سیدنا حسان بن ثابت رضی اللہ عنہ کے پاس بھیجا ۔ جب سیدنا حسان آپ صلی اللہ علیہ وسلم کے پاس آئے تو انہوں نے کہا کہ تم پر وہ وقت آ گیا کہ تم نے اس شیر کو بلا بھیجا جو اپنی دم سے مارتا ہے ( یعنی اپنی زبان سے لوگوں کو قتل کرتا ہے گویا میدان فصاحت اور شعر گوئی کے شیر ہیں ) ۔ پھر اپنی زبان باہر نکالی اور اس کو ہلانے لگے اور عرض کیا کہ قسم اس کی جس نے آپ صلی اللہ علیہ وسلم کو سچا پیغمبر کر کے بھیجا ہے میں کافروں کو اپنی زبان سے اس طرح پھاڑ ڈالوں گا جیسے چمڑے کو پھاڑ ڈالتے ہیں ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اے حسان! جلدی مت کر! کیونکہ ابوبکر رضی اللہ عنہ قریش کے نسب کو بخوبی جانتے ہیں اور میرا بھی نسب قریش ہی ہیں ، تو وہ میرا نسب تجھے علیحدہ کر دیں گے ۔ پھر حسان سیدنا ابوبکر رضی اللہ عنہ کے پاس آئے ، پھر اس کے بعد لوٹے اور عرض کیا کہ یا رسول اللہ! سیدنا ابوبکر رضی اللہ عنہ نے آپ صلی اللہ علیہ وسلم کا نسب مجھ سے بیان کر دیا ہے ، قسم اس کی جس نے آپ صلی اللہ علیہ وسلم کو سچا پیغمبر کر کے بھیجا ، میں آپ صلی اللہ علیہ وسلم کو قریش میں سے ایسا نکال لوں گا جیسے بال آٹے میں سے نکال لیا جاتا ہے ۔ ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا کہتی ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم حسان سے فرماتے تھے کہ روح القدس ہمیشہ تیری مدد کرتے رہیں گے جب تک تو اللہ اور اس کے رسول کی طرف سے جواب دیتا رہے گا ۔ اور ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا نے کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم فرماتے تھے کہ حسان نے قریش کی ہجو کی تو مومنوں کے دلوں کو شفاء دی اور کافروں کی عزتوں کو تباہ کر دیا ۔ حسان نے کہا کہ تو نے محمد صلی اللہ علیہ وسلم کی برائی کی تو میں نے اس کا جواب دیا اور اللہ تعالیٰ اس کا بدلہ دے گا ۔ تو نے محمد صلی اللہ علیہ وسلم کی برائی کی جو نیک اور پرہیزگار ہیں ، اللہ تعالیٰ کے رسول صلی اللہ علیہ وسلم ہیں اور وفاداری ان کی خصلت ہے ۔ میرے باپ دادا اور میری آبرو محمد صلی اللہ علیہ وسلم کی آبرو بچانے کے لئے قربان ہیں ۔ اگر کداء ( مکہ کے دروازہ پر گھاٹی ) کے دونوں جانب سے غبار اڑتا ہو نہ دیکھو تو میں اپنی جان کو کھوؤں ۔ ایسی اونٹنیاں جو باگوں پر زور کریں گی اور اپنی قوت اور طاقت سے اوپر چڑھتی ہوئیں ، ان کے کندھوں پر وہ برچھے ہیں جو باریک ہیں یا خون کی پیاسی ہیں اور ہمارے گھوڑے دوڑتے ہوئے آئیں گے ، ان کے منہ عورتیں اپنے دوپٹوں سے پونچھتی ہیں ۔ اگر تم ہم سے نہ بولو تو ہم عمرہ کر لیں گے اور فتح ہو جائے گی اور پردہ اٹھ جائے گا ۔ نہیں تو اس دن کی مار کے لئے صبر کرو جس دن اللہ تعالیٰ جس کو چاہے گا عزت دے گا ۔ اور اللہ تعالیٰ نے فرمایا کہ میں نے ایک لشکر تیار کیا ہے جو انصار کا لشکر ہے ، جس کا کھیل کافروں سے مقابلہ کرنا ہے ۔ اور اللہ تعالیٰ نے فرمایا کہ میں نے ایک بندہ بھیجا جو سچ کہتا ہے اس کی بات میں کچھ شبہہ نہیں ہے ۔ ہم تو ہر روز ایک نہ ایک تیاری میں ہیں ، گالی گلوچ ہے کافروں سے یا لڑائی ہے یا کافروں کی ہجو ہے ۔ تم میں سے جو کوئی اللہ کے رسول صلی اللہ علیہ وسلم کی ہجو کرے اور ان کی تعریف کرے یا مدد کرے وہ سب برابر ہیں ۔ اور ( روح القدس ) جبریل علیہ السلام کو اللہ کی طرف سے ہم میں بھیجاگیا ہے اور روح القدس کا ( کائنات میں ) کوئی مد مقابل نہیں ۔",
                "urduNarrator": "ہم سے عبدالملک بن شعیب بن لیث نے بیان کیا، مجھ سے میرے والد نے بیان کیا، مجھ سے میرے دادا نے بیان کیا، مجھ سے خالد بن یزید نے بیان کیا، مجھ سے سعید بن ابی ہلال نے بیان کیا۔ عمارہ بن غازیہ، محمد بن ابراہیم کی سند سے، ابو سلمہ بن عبدالرحمن نے حضرت عائشہ رضی اللہ عنہا سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي خَالِدُ بْنُ يَزِيدَ، حَدَّثَنِي سَعِيدُ بْنُ أَبِي هِلَالٍ، عَنْ عُمَارَةَ بْنِ غَزِيَّةَ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «اهْجُوا قُرَيْشًا، فَإِنَّهُ أَشَدُّ عَلَيْهَا مِنْ رَشْقٍ بِالنَّبْلِ» فَأَرْسَلَ إِلَى ابْنِ رَوَاحَةَ فَقَالَ: «اهْجُهُمْ» فَهَجَاهُمْ فَلَمْ يُرْضِ، فَأَرْسَلَ إِلَى كَعْبِ بْنِ مَالِكٍ، ثُمَّ أَرْسَلَ إِلَى حَسَّانَ بْنِ ثَابِتٍ، فَلَمَّا دَخَلَ عَلَيْهِ، قَالَ حَسَّانُ: قَدْ آنَ لَكُمْ أَنْ تُرْسِلُوا إِلَى هَذَا الْأَسَدِ الضَّارِبِ بِذَنَبِهِ [ص:1936]، ثُمَّ أَدْلَعَ لِسَانَهُ فَجَعَلَ يُحَرِّكُهُ، فَقَالَ: وَالَّذِي بَعَثَكَ بِالْحَقِّ لَأَفْرِيَنَّهُمْ بِلِسَانِي فَرْيَ الْأَدِيمِ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تَعْجَلْ، فَإِنَّ أَبَا بَكْرٍ أَعْلَمُ قُرَيْشٍ بِأَنْسَابِهَا، وَإِنَّ لِي فِيهِمْ نَسَبًا، حَتَّى يُلَخِّصَ لَكَ نَسَبِي» فَأَتَاهُ حَسَّانُ، ثُمَّ رَجَعَ فَقَالَ: يَا رَسُولَ اللهِ قَدْ لَخَّصَ لِي نَسَبَكَ، وَالَّذِي بَعَثَكَ بِالْحَقِّ لَأَسُلَّنَّكَ مِنْهُمْ كَمَا تُسَلُّ الشَّعْرَةُ مِنَ الْعَجِينِ. قَالَتْ عَائِشَةُ: فَسَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ لِحَسَّانَ: «إِنَّ رُوحَ الْقُدُسِ لَا يَزَالُ يُؤَيِّدُكَ، مَا نَافَحْتَ عَنِ اللهِ وَرَسُولِهِ»، وَقَالَتْ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «هَجَاهُمْ حَسَّانُ فَشَفَى وَاشْتَفَى» قَالَ حَسَّانُ: [البحر الوافر] هَجَوْتَ مُحَمَّدًا فَأَجَبْتُ عَنْهُ ... وَعِنْدَ اللهِ فِي ذَاكَ الْجَزَاءُ هَجَوْتَ مُحَمَّدًا بَرًّا حَنِيفًا ... رَسُولَ اللهِ شِيمَتُهُ الْوَفَاءُ فَإِنَّ أَبِي وَوَالِدَهُ وَعِرْضِي ... لِعِرْضِ مُحَمَّدٍ مِنْكُمْ وِقَاءُ [ص:1937] ثَكِلْتُ بُنَيَّتِي إِنْ لَمْ تَرَوْهَا ... تُثِيرُ النَّقْعَ مِنْ كَنَفَيْ كَدَاءِ يُبَارِينَ الْأَعِنَّةَ مُصْعِدَاتٍ ... عَلَى أَكْتَافِهَا الْأَسَلُ الظِّمَاءُ تَظَلُّ جِيَادُنَا مُتَمَطِّرَاتٍ ... تُلَطِّمُهُنَّ بِالْخُمُرِ النِّسَاءُ فَإِنْ أَعْرَضْتُمُو عَنَّا اعْتَمَرْنَا ... وَكَانَ الْفَتْحُ وَانْكَشَفَ الْغِطَاءُ وَإِلَّا فَاصْبِرُوا لِضِرَابِ يَوْمٍ ... يُعِزُّ اللهُ فِيهِ مَنْ يَشَاءُ وَقَالَ اللهُ: قَدْ أَرْسَلْتُ عَبْدًا ... يَقُولُ الْحَقَّ لَيْسَ بِهِ خَفَاءُ وَقَالَ اللهُ: قَدْ يَسَّرْتُ جُنْدًا ... هُمُ الْأَنْصَارُ عُرْضَتُهَا اللِّقَاءُ لَنَا فِي كُلِّ يَوْمٍ مِنْ مَعَدٍّ ... سِبَابٌ أَوْ قِتَالٌ أَوْ هِجَاءُ فَمَنْ يَهْجُو رَسُولَ اللهِ مِنْكُمْ ... وَيَمْدَحُهُ وَيَنْصُرُهُ سَوَاءُ وَجِبْرِيلٌ رَسُولُ اللهِ فِينَا ... وَرُوحُ الْقُدُسِ لَيْسَ لَهُ كِفَاءُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13959,
                "hadithNumber": "6396",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "I invited my mother, who was a polytlieist, to Islam. I invited her one day and she said to me something about Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) which I hated. I came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) weeping and said: Allah's Messenger, I invited my mother to Islam but she did not accept (my invitation). I invited her today but she said to me something which I did not like. (Kindly) supplicate Allah that He may set the mother of Abu Huraira right. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: O Allah, set the mother of Abu Huraira on the right path. I came out quite pleased with the supplication of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and when I came near the door it was closed from within. My mother heard the noise of my footsteps and she said: Abu Huraira, just wait. And I heard the noise of falling of water. She took a bath and put on the shirt and quickly covered her head with a headdress and opened the door and then said: Abu Huraira, I bear witness to the fact that there is no god but Allah and Muhammad is His bondsman and His Messenger. He (Abu Huraira) said: I went back to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and (this time) I was shedding the tears of joy. I said: Allah's Messenger, be happy, for Allah has responded to your supplication and He has set on the right path the mother of Abu Huraira. He (the Holy Prophet) praised Allah, and extolled Him and uttered good words. I said: Allah's Messenger, supplicate to Allah so that He may instill love of mine and that of my mother too in the believing servants and let our hearts be filled with their love, whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: O Allah, let there be love of these servants of yours, i.e. Abu Huraira and his mother, in the hearts of the believing servants and let their hearts be filled with the love of the believing servants. (Abu Huraira said: This prayer) was so well granted by Allah that no believer was ever born who heard of me and who saw me but did not love me.",
                "hadithUrdu": "میں اپنی والدہ کو اسلام کی طرف بلاتا تھا اور وہ مشرک تھی ۔ ایک دن میں نے اس کو مسلمان ہونے کو کہا تو اس نے رسول اللہ صلی اللہ علیہ وسلم کے حق میں وہ بات سنائی جو مجھے ناگوار گزری ۔ میں رسول اللہ صلی اللہ علیہ وسلم کے پاس روتا ہوا آیا اور عرض کیا کہ میں اپنی والدہ کو اسلام کی طرف بلاتا تھا وہ نہ مانتی تھی ، آج اس نے آپ صلی اللہ علیہ وسلم کے حق میں مجھے وہ بات سنائی جو مجھے ناگوار ہے تو آپ صلی اللہ علیہ وسلم اللہ تعالیٰ سے دعا کیجئے کہ وہ ابوہریرہ کی ماں کو ہدایت دیدے ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اے اللہ! ابوہریرہ کی ماں کو ہدایت کر دے ۔ میں رسول اللہ صلی اللہ علیہ وسلم کی دعا سے خوش ہو کر نکلا ۔ جب گھر پر آیا اور دروازہ پر پہنچا تو وہ بند تھا ۔ میری ماں نے میرے پاؤں کی آواز سنی ۔ اور بولی کہ ذرا ٹھہرا رہ ۔ میں نے پانی کے گرنے کی آواز سنی غرض میری ماں نے غسل کیا اور اپنا کرتہ پہن کر جلدی سے اوڑھنی اوڑھی ، پھر دروازہ کھولا اور بولی کہ اے ابوہریرہ! ”میں گواہی دیتی ہوں کہ اللہ کے سوا کوئی معبود برحق نہیں ہے اور میں گواہی دیتی ہوں کہ محمد صلی اللہ علیہ وسلم اللہ کے بندے اور اس کے رسول ہیں“ ۔ سیدنا ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ میں رسول اللہ صلی اللہ علیہ وسلم کے پاس خوشی سے روتا ہوا آیا اور عرض کیا کہ یا رسول اللہ! خوش ہو جائیے اللہ تعالیٰ نے آپ صلی اللہ علیہ وسلم کی دعا قبول کی اور ابوہریرہ کی ماں کو ہدایت کی تو آپ صلی اللہ علیہ وسلم نے اللہ تعالیٰ کی تعریف اور اس کی صفت کی اور بہتر بات کہی ۔ میں نے عرض کیا کہ یا رسول اللہ! اللہ عزوجل سے دعا کیجئے کہ میری اور میری ماں کی محبت مسلمانوں کے دلوں میں ڈال دے ۔ اور ان کی محبت ہمارے دلوں میں ڈال دے ۔ تب رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اے اللہ! اپنے بندوں کی یعنی ابوہریرہ اور ان کی ماں کی محبت اپنے مومن بندوں کے دلوں میں ڈال دے اور مومنوں کی محبت ان کے دلوں میں ڈال دے ۔ پھر کوئی مومن ایسا پیدا نہیں ہوا جس نے میرے بارے میں سنایا مجھے دیکھا ہواور میرےساتھ محبت نہ کی ہو ۔",
                "urduNarrator": "ہم سے عمرو ناقد نے بیان کیا، کہا ہم سے عمر بن یونس الیمیمی نے بیان کیا، کہا ہم سے عکرمہ بن عمار نے بیان کیا، وہ ابو کثیر یزید بن عبدالرحمٰن کی سند سے, حضرت ابو ہریرہ رضی اللہ عنہ نے کہا : کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا عُمَرُ بْنُ يُونُسَ الْيَمَامِيُّ، حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ، عَنْ أَبِي كَثِيرٍ يَزِيدَ بْنِ عَبْدِ الرَّحْمَنِ، حَدَّثَنِي أَبُو هُرَيْرَةَ، قَالَ: كُنْتُ أَدْعُو أُمِّي إِلَى الْإِسْلَامِ وَهِيَ مُشْرِكَةٌ، فَدَعَوْتُهَا يَوْمًا فَأَسْمَعَتْنِي فِي رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مَا أَكْرَهُ، فَأَتَيْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَأَنَا أَبْكِي، قُلْتُ يَا رَسُولَ اللهِ إِنِّي كُنْتُ أَدْعُو أُمِّي إِلَى الْإِسْلَامِ فَتَأْبَى عَلَيَّ، فَدَعَوْتُهَا الْيَوْمَ فَأَسْمَعَتْنِي فِيكَ مَا أَكْرَهُ، فَادْعُ اللهَ أَنْ يَهْدِيَ أُمَّ أَبِي هُرَيْرَةَ فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «اللهُمَّ اهْدِ أُمَّ أَبِي هُرَيْرَةَ» فَخَرَجْتُ مُسْتَبْشِرًا بِدَعْوَةِ نَبِيِّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَلَمَّا جِئْتُ فَصِرْتُ إِلَى الْبَابِ، فَإِذَا هُوَ مُجَافٌ، فَسَمِعَتْ أُمِّي خَشْفَ قَدَمَيَّ، فَقَالَتْ: مَكَانَكَ يَا أَبَا هُرَيْرَةَ وَسَمِعْتُ خَضْخَضَةَ الْمَاءِ، قَالَ: فَاغْتَسَلَتْ وَلَبِسَتْ دِرْعَهَا وَعَجِلَتْ عَنْ خِمَارِهَا، فَفَتَحَتِ الْبَابَ، ثُمَّ قَالَتْ: يَا أَبَا هُرَيْرَةَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللهُ، وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ، قَالَ فَرَجَعْتُ إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَأَتَيْتُهُ وَأَنَا أَبْكِي مِنَ الْفَرَحِ، قَالَ: قُلْتُ: يَا رَسُولَ اللهِ أَبْشِرْ قَدِ اسْتَجَابَ اللهُ دَعْوَتَكَ وَهَدَى أُمَّ أَبِي هُرَيْرَةَ، فَحَمِدَ اللهَ وَأَثْنَى عَلَيْهِ وَقَالَ خَيْرًا، قَالَ قُلْتُ: يَا رَسُولَ اللهِ ادْعُ اللهَ أَنْ يُحَبِّبَنِي أَنَا وَأُمِّي إِلَى عِبَادِهِ الْمُؤْمِنِينَ، وَيُحَبِّبَهُمْ إِلَيْنَا، قَالَ: فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «اللهُمَّ حَبِّبْ عُبَيْدَكَ هَذَا - يَعْنِي أَبَا هُرَيْرَةَ - وَأُمَّهُ إِلَى عِبَادِكَ الْمُؤْمِنِينَ، وَحَبِّبْ إِلَيْهِمِ الْمُؤْمِنِينَ» فَمَا خُلِقَ مُؤْمِنٌ يَسْمَعُ بِي وَلَا يَرَانِي إِلَّا أَحَبَّنِي.",
                "headingArabic": "مِنْ فَضَائِلِ أَبِي هُرَيْرَةَ الدَّوْسِيِّ رضى الله عنه ‏‏",
                "headingUrdu": "العجین کا لفظ استعمال ہوا۔",
                "headingEnglish": "The Virtues Of Abu Hurairah [Ad-Dawsi] (RA)",
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13960,
                "hadithNumber": "6397",
                "englishNarrator": "Al-A'raj reported:",
                "hadithEnglish": "He heard Abu Huraira رضی اللہ عنہ as saying: You are under the impression that Abu Huraira transmits so many ahadith from Allah's Messenger (may peace up upon him) ; (bear in mind) Allah is the great Reckoner. I was a poor man and I served Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) being satisfied with bare subsistence, whereas the immigrants remained busy with transactions in the bazar; while the Ansar had been engaged in looking after their properties. (He further reported) that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: He who spreads the cloth would not forget anything that he would hear from me. I spread my cloth until he narrated something. I then pressed it against my (chest), so I never forgot anything that I heard from him.",
                "hadithUrdu": "میں نے حضرت ابو ہریرہ رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے : تم یہ سمجھتے ہو کہ ابو ہریرہ رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم سے بہت زیادہ احادیث بیان کرتاہے ، اللہ ہی کے پاس پیشی ہونی ہے ۔ میں ایک مسکین آدمی تھا ، پیٹ بھرجانے پر اللہ کے رسول صلی اللہ علیہ وسلم کی خدمت میں لگا رہتاتھا ۔ مہاجروں کو بازار میں گہما گہمی مشغول رکھتی تھی اور انصار کو اپنے مال ( مویشی ) وغیرہ کی نگہداشت مشغول رکھتی تھی ، تو ( جب ) رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کون اپنا کپڑا پھیلائے گا ، پھر جو چیز بھی اس نے مجھ سے سنی اسے ہرگز نہیں بھولے گا ۔ \" تو میں نے اپنا کپڑا پھیلا دیا ، یہاں تک کہ آپ نے اپنی بات مکمل کی تو میں نے وہ ( کپڑا سمیٹ کر ) اپنے ساتھ لگا لیا ، پھر میں نے آپ صلی اللہ علیہ وسلم سے جو کچھ سنا اس میں سے کوئی چیز کبھی نہ بھولا ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید، ابوبکر بن ابی شیبہ اور زہیر بن حرب نے بیان کیا, سفیان بن عیینہ نے زہری سے ، انھوں نے اعرج سےروایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، جَمِيعًا عَنْ سُفْيَانَ، قَالَ زُهَيْرٌ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنِ الْأَعْرَجِ، قَالَ: سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ: إِنَّكُمْ تَزْعُمُونَ أَنَّ أَبَا هُرَيْرَةَ، يُكْثِرُ الْحَدِيثَ عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَاللهُ الْمَوْعِدُ، كُنْتُ رَجُلًا مِسْكِينًا، أَخْدُمُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى مِلْءِ بَطْنِي، وَكَانَ الْمُهَاجِرُونَ يَشْغَلُهُمُ الصَّفْقُ بِالْأَسْوَاقِ وَكَانَتِ الْأَنْصَارُ يَشْغَلُهُمُ الْقِيَامُ عَلَى أَمْوَالِهِمْ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ يَبْسُطْ ثَوْبَهُ فَلَنْ يَنْسَى شَيْئًا سَمِعَهُ مِنِّي» فَبَسَطْتُ ثَوْبِي حَتَّى قَضَى حَدِيثَهُ، ثُمَّ ضَمَمْتُهُ إِلَيَّ، فَمَا نَسِيتُ شَيْئًا سَمِعْتُهُ مِنْهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13961,
                "hadithNumber": "6398",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been transmitted on the authority of Abu Huraira رضی اللہ عنہ but with the variation that the hadith transmitted on the authority of Malik conclude with the words of Abu Huraira رضی اللہ عنہ and there is no mention of a transmission of these from Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ): who spreads his cloth, to the end.",
                "hadithUrdu": "مجھ سے عبداللہ بن جعفر بن یحییٰ بن خالد نے بیان کیا، کہا ہم سے معان نے بیان کیا، انہوں نے کہا: مالک بن انس اور معمر نے زہری سے ، انھوں نے اعرج سے اور انھوں نے ابو ہریرہ رضی اللہ عنہ سے یہ حدیث روایت کی ، مگر مالک کی حدیث ابو ہریرہ رضی اللہ تعالیٰ عنہ کی بات پر ختم ہو گئی ۔ انھوں نے اپنی حدیث میں نبی صلی اللہ علیہ وسلم سے روایت کردہ یہ بات : \" کون اپنا کپڑا پھیلا ئےگا : \" آخر تک بیان نہیں کی .",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللهِ بْنُ جَعْفَرِ بْنِ يَحْيَى بْنِ خَالِدٍ، أَخْبَرَنَا مَعْنٌ، أَخْبَرَنَا مَالِكٌ، ح وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، كِلَاهُمَا عَنِ الزُّهْرِيِّ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ بِهَذَا الْحَدِيثِ، غَيْرَ أَنَّ مَالِكًا، انْتَهَى حَدِيثُهُ عِنْدَ انْقِضَاءِ قَوْلِ أَبِي هُرَيْرَةَ، وَلَمْ يَذْكُرْ فِي حَدِيثِهِ الرِّوَايَةَ عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «مَنْ يَبْسُطْ ثَوْبَهُ» إِلَى آخِرِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13962,
                "hadithNumber": "6399",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "Don't you feel surprised at Abu Huraira رضی اللہ عنہ ? He came (one day) and sat beside the nook of my apartment and began to narrate (the hadith of Allah's Apostle). I was hearing while I was engaged in extolling Allah (reciting Subhan Allah) constantly. He stood up before I finished my repetition of Subhan Allah. if I were to meet him I would have warned him in stern words that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) did not speak so quickly as you talk.\r\nIbn Shihab transmitted on the authority of Ibn Musayyib that Abu Huraira رضی اللہ عنہ said:\r\nPeople say that Abu Huraira رضی اللہ عنہ transmits so many ahadith, whereas Allah is the Reckoner, and they say: How is it with Muhajirs and the Ansar that they do not narrate ahadith like him (like Abu Huraira رضی اللہ عنہ)? Abu Huraira رضی اللہ عنہ said: I tell you that my brothers from Ansar remained busy with their lands and my brothers Muhajirs were busy in transactions in the bazars, but I always kept myself attached to Allah's Messenger (ﷺ) with bare subsistence. I remained present (in the company of the Holy Prophet ﷺ), whereas they had been absent. I retained in my mind (what the Prophet said), whereas they forgot it. One day Allah's Messenger (ﷺ) said: He who amongst you spreads the cloth and listens to my talk and would then press it against his chest would never forget anything heard from me. So I spread my mantle and when he had concluded his talk I then pressed it against my chest and so I never forgot after that day anything that he (the Holy Prophet ﷺ) said. And if these two verses would not have been revealed in the Book I would have never transmitted anything (to anybody):\" Those who conceal the clear evidence and the guidance that We revealed\" (ii. 159) tip to the last verse.",
                "hadithUrdu": "کیا تمھیں ابوہریرہ رضی اللہ تعالیٰ عنہ ( ایسا کرتے ہوئے ) اچھے نہیں لگتے کہ وہ آئے میرے حجرے کے ساتھ بیٹھ گئےاور رسول اللہ صلی اللہ علیہ وسلم سے احادیث بیان کرنے لگے وہ مجھے ( یہ ) احادیث سنا رہے تھے ۔ میں نفل پڑھ رہی تھی تو وہ میرے نوافل ختم کرنے سے پہلے اٹھ گئے ۔ اگر میں ( نوافل ختم کرنے کے بعد ) انھیں مو جو د پا تی تو میں ان کو جواب میں یہ کہتی کہ رسول اللہ صلی اللہ علیہ وسلم تم لوگوں کی طرح تسلسل سے ایک کے بعد دوسری بات ارشاد نہیں فر ما تےتھے ۔\r\n ابن شہاب نے بیان کیا : حضرت سعید بن مسیب نے روایت کیا کہ حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ نے کہا : لو گ کہتے ہیں ۔ ابو ہریرہ رضی اللہ تعالیٰ عنہ بہت احادیث بیان کرتے ہیں اور پیشی اللہ کے سامنے ہو نی ہے نیز وہ کہتے ہیں ، کیا وجہ ہے کہ مہاجرین اور انصار ابو ہریرہ رضی اللہ تعالیٰ عنہ کی طرح احادیث بیان نہیں کرتے ؟ میں تم کو اس کے بارے میں بتا تا ہوں ۔ میرے انصاری بھا ئیوں کو ان کی زمینوں کاکام مشغول رکھتا تھا اور میرے مہاجر بھا ئیوں کو بازار کی خریدو فروخت مصروف رکھتی تھی اور میں پیٹ بھرنے پر رسول اللہ صلی اللہ علیہ وسلم کے ساتھ لگا رہتا تھا ، جب دوسرے لو گ غائب ہو تے تو میں حاضر رہتا تھا اور جن باتوں کو وہ بھول جا تے تھے میں ان کو یا د رکھتا تھا ۔ ایک دن رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \"\" تم میں سے کو ن شخص اپنا کپڑا بچھائے گا ۔ تا کہ میری یہ بات ( حدیث ) سنے پھر اس ( کپڑے ) کو اپنے سینے سے لگا لے تو اس نے جو کچھ سنا ہو گا اس میں سے کو ئی چیز نہیں بھولے گا ۔ \"\" میں نے ایک چادر جو میرے کندھوں پر تھی پھیلا دی یہاں تک کہ آپ اپنی بات سے فارغ ہوئے تو میں نے اس چادر کو اپنے سینے کے ساتھ اکٹھا کر لیا تو اس دن کے بعد کبھی کو ئی ایسی چیز نہیں بھولا جو آپ نے مجھ سے بیان فر ما ئی ۔ اگر دو آیتیں نہ ہو تیں ، جو اللہ نے اپنی کتاب میں نازل فر ما ئی ہیں تو میں کبھی کوئی چیز بیان نہ کرتا ( وہ آیتیں یہ ہیں ) \"\" وہ لو گ جو ہماری اتاری ہو ئی کھلی باتوں اور ہدایت کو چھپا تے ہیں ۔ ۔ ۔ دونوں آیتوں کے آخر تک ۔",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ التجیبی نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا, یو نس نے ابن شہاب سے روایت کی عروہ بن زبیر نے انھیں حدیث بیان کی کہ حضرت عائشہ رضی اللہ عنہا نے فرمایا",
                "hadithArabic": "وحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى التُّجِيبِيُّ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَنَّ عُرْوَةَ بْنَ الزُّبَيْرِ، حَدَّثَهُ أَنَّ عَائِشَةَ قَالَتْ: أَلَا يُعْجِبُكَ أَبُو هُرَيْرَةَ جَاءَ فَجَلَسَ إِلَى جَنْبِ حُجْرَتِي يُحَدِّثُ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يُسْمِعُنِي ذَلِكَ، وَكُنْتُ أُسَبِّحُ، فَقَامَ قَبْلَ أَنْ أَقْضِيَ سُبْحَتِي، وَلَوْ أَدْرَكْتُهُ لَرَدَدْتُ عَلَيْهِ، إِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَمْ يَكُنْ يَسْرُدُ الْحَدِيثَ كَسَرْدِكُمْ».\r\n قَالَ ابْنُ شِهَابٍ: وَقَالَ ابْنُ الْمُسَيِّبِ: إِنَّ أَبَا هُرَيْرَةَ قَالَ: يَقُولُونَ: إِنَّ أَبَا هُرَيْرَةَ قَدْ أَكْثَرَ، وَاللهُ الْمَوْعِدُ، وَيَقُولُونَ: مَا بَالُ الْمُهَاجِرِينَ وَالْأَنْصَارِ لَا يَتَحَدَّثُونَ مِثْلَ أَحَادِيثِهِ؟ وَسَأُخْبِرُكُمْ عَنْ ذَلِكَ: إِنَّ إِخْوَانِي مِنَ الْأَنْصَارِ كَانَ يَشْغَلُهُمْ عَمَلُ أَرَضِيهِمْ، وَإِنَّ إِخْوَانِي مِنَ الْمُهَاجِرِينَ كَانَ يَشْغَلُهُمُ الصَّفْقُ بِالْأَسْوَاقِ، وَكُنْتُ أَلْزَمُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى مِلْءِ بَطْنِي، فَأَشْهَدُ إِذَا غَابُوا، وَأَحْفَظُ إِذَا نَسُوا، وَلَقَدْ قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَوْمًا: «أَيُّكُمْ يَبْسُطُ ثَوْبَهُ، فَيَأْخُذُ مِنْ حَدِيثِي هَذَا، ثُمَّ يَجْمَعُهُ إِلَى صَدْرِهِ، فَإِنَّهُ لَمْ يَنْسَ شَيْئًا سَمِعَهُ» فَبَسَطْتُ بُرْدَةً عَلَيَّ، حَتَّى فَرَغَ مِنْ حَدِيثِهِ، ثُمَّ جَمَعْتُهَا إِلَى صَدْرِي، فَمَا نَسِيتُ بَعْدَ ذَلِكَ الْيَوْمِ شَيْئًا حَدَّثَنِي بِهِ، وَلَوْلَا آيَتَانِ أَنْزَلَهُمَا اللهُ فِي كِتَابِهِ مَا حَدَّثْتُ شَيْئًا أَبَدًا: {إِنَّ الَّذِينَ يَكْتُمُونَ مَا أَنْزَلْنَا مِنَ الْبَيِّنَاتِ وَالْهُدَى} [البقرة: 159] إِلَى آخِرِ الْآيَتَيْنِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13963,
                "hadithNumber": "6400",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been transmitted on the authority of Abu Huraira رضی اللہ  عنہ (and the words are): You say that Abu Huraira رضی اللہ  عنہ narrates so many ahadith from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) ; the rest of the hadith is the same.",
                "hadithUrdu": "ہم سے عبداللہ بن عبدالرحمٰن الدارمی نے بیان کیا، کہا ہم سے ابو الایمان نے بیان کیا, شعیب نے زہری سے روایت کی ، انھوں نے کہا : مجھے سعید بن مسیب اور ابو سلمہ بن عبد الرحمٰن نے بتا یا کہ حضرت ابو ہریرہ رضی اللہ  عنہ نےکہا : تم لو گ یہ کہتے ہو کہ ابو ہریرہ رضی اللہ تعالیٰ عنہ رسول اللہ صلی اللہ علیہ وسلم سے بہت احادیث بیان کرتا ہے ۔ آگے ان کی حدیث کی طرح ( بیان کیا ۔ )",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا عَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا أَبُو الْيَمَانِ، عَنْ شُعَيْبٍ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيِّبِ، وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ قَالَ: إِنَّكُمْ تَقُولُونَ: إِنَّ أَبَا هُرَيْرَةَ يُكْثِرُ الْحَدِيثَ عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، بِنَحْوِ حَدِيثِهِمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 13651,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=546",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=544",
                "label": "544",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=545",
                "label": "545",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=546",
                "label": "546",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=547",
                "label": "547",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=548",
                "label": "548",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=549",
                "label": "549",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=550",
                "label": "550",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=548",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=548",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=546",
        "to": 13675,
        "total": 40465
    }
}