{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 517,
        "data": [
            {
                "id": 13189,
                "hadithNumber": "5626",
                "englishNarrator": "Abu Sa'id Khudri رضی اللہ عنہ reported:",
                "hadithEnglish": "I was sitting in Medina in the company of the Ansar when Abu Musa came trembling with fear. We said to him: What is the matter? He said: 'Umar ( رضی اللہ عنہ ) sent for me. I went to him and paid him salutation thrice at (his) door but he made no response to me and so I came back. Thereupon he ('Umar رضی اللہ عنہ ) said: What stood in your way that you did not turn up? I said: I did come to you and paid you salutations at your door three times but I was not given any response, so I came back as the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) has said: When any one of you seeks permission three times and he is not granted permission, he should come back. Umar رضی اللہ عنہ  said: Bring a witness to support that you say, otherwise I shall take you to task. Ubayy bin Ka'b  رضی اللہ عنہ said: None should stand with him (as a witness) but the youngest amongst the people. Abu Sa'id رضی اللہ عنہ said: I am the youngest amongst the people, whereupon he said: Then you go with him (to support his contention).",
                "hadithUrdu": "میں مدینہ منورہ میں انصار کی مجلس میں بیٹھا ہوا تھا اتنے میں ابو موسیٰ ڈرے سہمے ہوئے آئے ، ہم نے ان سے پوچھا آپ کو کیا ہوا؟ انھوں نے بتایا کہ حضرت عمر رضی اللہ عنہ نے میری طرف پیغام بھیجا ہے کہ میں ان کے پاس آؤں ، میں ان کے دروازے پر گیا اور تین مرتبہ سلام کیا انھوں نے مجھے سلام کا جواب نہیں دیا تو میں لوٹ آیا ، انھوں نے کہا : آپ کو ہمارے پاس آنے سے کس بات نے روکا؟میں نے کہا : میں آیا تھا ، آپ کے دروازے پر کھڑے تین بار سلام کیا ، آپ لوگوں نے مجھے جواب نہیں دیا ، اس لئے میں لوٹ گیا کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا : \"\" جب تم میں سے کوئی شخص تین باراجازت مانگے اور اسے اجازت نہ دی جائے تو وہ لوٹ جائے ۔ \"\" حضرت عمر رضی اللہ عنہ نے فرمایا : اس پر گواہی پیش کرو ورنہ میں تم کو سزا دوں گا ۔ حضرت ابی ابن کعب رضی اللہ عنہ نے کہا : ان کے ساتھ صرف وہ شخص جا کرکھڑا ہوگا جو قوم میں سے سب سے کم عمر ہے ، حضرت ابو سعید رضی اللہ عنہ نے کہا : میں نے کہا کہ میں سب سے کم عمر ہوں توانھوں نے کہا : تم ان کے ساتھ جاؤ ( اور گواہی دو )",
                "urduNarrator": "عمرو بن محمد بن بکیر ناقد نے کہا : ہمیں سفیان بن عینیہ نے حدیث بیان کی ، کہا : اللہ کی قسم!ہمیں یزید بن خصیفہ نے بسر بن سعید سے حدیث بیان کی ، کہا : میں نے حضرت ابوسعید خدری رضی اللہ عنہ کو کہتے ہوئے سنا",
                "hadithArabic": "حَدَّثَنِي عَمْرُو بْنُ مُحَمَّدِ بْنِ بُكَيْرٍ النَّاقِدُ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ حَدَّثَنَا وَاللَّهِ يَزِيدُ بْنُ خُصَيْفَةَ عَنْ بُسْرِ بْنِ سَعِيدٍ قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ يَقُولُ كُنْتُ جَالِسًا بِالْمَدِينَةِ فِي مَجْلِسِ الْأَنْصَارِ فَأَتَانَا أَبُو مُوسَى فَزِعًا أَوْ مَذْعُورًا قُلْنَا مَا شَأْنُكَ قَالَ إِنَّ عُمَرَ أَرْسَلَ إِلَيَّ أَنْ آتِيَهُ فَأَتَيْتُ بَابَهُ فَسَلَّمْتُ ثَلَاثًا فَلَمْ يَرُدَّ عَلَيَّ فَرَجَعْتُ فَقَالَ مَا مَنَعَكَ أَنْ تَأْتِيَنَا فَقُلْتُ إِنِّي أَتَيْتُكَ فَسَلَّمْتُ عَلَى بَابِكَ ثَلَاثًا فَلَمْ يَرُدُّوا عَلَيَّ فَرَجَعْتُ وَقَدْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اسْتَأْذَنَ أَحَدُكُمْ ثَلَاثًا فَلَمْ يُؤْذَنْ لَهُ فَلْيَرْجِعْ فَقَالَ عُمَرُ أَقِمْ عَلَيْهِ الْبَيِّنَةَ وَإِلَّا أَوْجَعْتُكَ فَقَالَ أُبَيُّ بْنُ كَعْبٍ لَا يَقُومُ مَعَهُ إِلَّا أَصْغَرُ الْقَوْمِ قَالَ أَبُو سَعِيدٍ قُلْتُ أَنَا أَصْغَرُ الْقَوْمِ قَالَ فَاذْهَبْ بِهِ.",
                "headingArabic": "الاِسْتِئْذَانِ ‏‏",
                "headingUrdu": "گھر میں داخل ہونے کی اجازت طلب کرنا",
                "headingEnglish": "Seeking Permission To Enter A House",
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13190,
                "hadithNumber": "5627",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Yazid bin Khusaifa with the same chain of transmitters but with this addition: Abu Sa'id رضی اللہ عنہ said: So I stood up, and went to 'Umar رضی اللہ عنہ and gave witness (to what Abu Musa had said).",
                "hadithUrdu": "قتیبہ بن سعید اور ابن ابی عمر نے کہا : \" ہمیں سفیان نے یزید بن خصیفہ سے اسی سند کے ساتھ حدیث بیان کی اور ابن ابی عمر نے اپنی حدیث میں یہ اضافہ کیا : حضرت ابو سعید رضی اللہ عنہ نے کہا : میں ان کے ہمرا اٹھ کھڑا ہوا ، حضرت عمر رضی اللہ عنہ کے پاس گیا اور گواہی دی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَابْنُ أَبِي عُمَرَ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ يَزِيدَ بْنِ خُصَيْفَةَ بِهَذَا الْإِسْنَادِ وَزَادَ ابْنُ أَبِي عُمَرَ فِي حَدِيثِهِ قَالَ أَبُو سَعِيدٍ فَقُمْتُ مَعَهُ فَذَهَبْتُ إِلَى عُمَرَ فَشَهِدْتُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13191,
                "hadithNumber": "5628",
                "englishNarrator": "Abd Sa'id Khudri رضی اللہ عنہ reported:",
                "hadithEnglish": "We were in the company of Ubayy bin Ka'b رضی اللہ عنہ that Abu Musa Ash'ari رضی اللہ عنہ came there in a state of anger. He stood (before us) and said: I ask you to bear witness in the name of Allah whether anyone amongst you heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Permission (for entering the house) should be sought three times and if permission is granted to you (then get in). otherwise go back. Ubayy bin Ka'b رضی اللہ عنہ said: What is the matter? He said: I sought permission yesterday from 'Umar bin Khattab رضی اللہ عنہ three times but he did not permit me, so I came back; then I went to him today and visited him and informed him that I had come to him yesterday and greeted him thrice, then came back, whereupon he said: Yes, we did hear you but be were at that time busy, but why did you not seek permission (further and you must have never gone back until you were permitted to do so). He said: I sought permission (in the manner) that I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) having said (in connection 'With the seeking of permission for entering the house of a stranger). Thereupon he (Hadrat Umar رضی اللہ عنہ) said: By Allah, I shall torture your back and your stomach unless you bring one who may bear witness to what you state. 'Ubayy bin Ka'b رضی اللہ عنہ said: By Allah, none should stand with you (to bear testimony) but the youngest amongst us. And he therefore, said to Abu Sa'id رضی اللہ عنہ : Stand up. So I stood up until I came to Umar رضی اللہ عنہ and said: I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) say this.",
                "hadithUrdu": "ایک مجلس میں ہم حضرت ابی ابن کعب رضی اللہ عنہ کے پا س بیٹھےہوئے تھے ۔ اتنے میں حضرت ابو موسیٰ اشعری رضی اللہ تعالیٰ عنہ غصے کی حالت میں آئے اور کھڑے ہوگئے پھر کہنے لگے : میں تم کو اللہ کی قسم دیتا ہوں کہ تم میں سے کسی شخص نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا : \"\" اجازت تین بار مانگی جاتی ہے ، اگر تمھیں اجازت مل جائے ( تو اندر آجاؤ ) ، نہیں تو لوٹ جاؤ؟حضرت ابی نے کہا معاملہ کیا ہے؟انھوں نے کہا : میں نے کل حضرت عمر رضی اللہ عنہ کے پاس تین بار اجازت مانگی ، مجھے اجازت نہیں دی گئی تو میں لوٹ گیا پھر میں آج ان کے پاس آیاتو ان کے پا س حاضر ہوگیا ۔ میں نے انھیں بتایا کہ میں کل آیا تھا ، تین بار سلام کیا تھا ، پھر چلا گیا تھا ۔ کہنے لگے ہم نے سن لیاتھا ، اس وقت ہم کسی کام میں لگے ہوئے تھے تم کیوں نہ اجازت مانگتے رہے یہاں تک کہ تمھیں اجازت مل جاتی ۔ میں نے کہا : میں نے اسی طرح اجازت مانگی جس طرح میں نے ر سول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا تھا ۔ کہنے لگے : اللہ کی قسم!میں تمھاری پشت اور پیٹھ پر کوڑے ماروں گا پھر تم کوئی ایسا شخص لے آؤ جو تمہارے لئے اس پر گواہی دے ۔ حضرت ابی ابن کعب کہنے لگے : اللہ کی قسم!تمھارے ساتھ ہم میں سے صرف وہ کھڑاہوگا جو عمر میں سب سے چھوٹاہے ( بڑے تو بڑے ہیں یہ حدیث ہم میں سے کم عمر لوگوں نے بھی سنی ہے اور یادرکھی ہے ۔ ) ابو سعید !اٹھو ، ( انھوں نے کہا ) تو میں اٹھا ، حضرت عمر رضی اللہ تعالیٰ عنہ کے پاس آیا اور کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو ا س طرح فرماتے ہوئے سنا تھا ۔",
                "urduNarrator": "مجھ سے ابو الطاہر نے بیان کیا، مجھ سے عبداللہ بن وہب نے بیان کیا، مجھ سے عمرو بن حارث نے بیان کیا, بکیر بن اشج سے روایت ہے کہ بسر بن سعید نے انھیں حدیث بیان کی ، انھوں نے حضرت ابوسعید خدری رضی اللہ عنہ سے سنا ، کہہ رہے تھے",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ وَهْبٍ حَدَّثَنِي عَمْرُو بْنُ الْحَارِثِ عَنْ بُكَيْرِ بْنِ الْأَشَجِّ أَنَّ بُسْرَ بْنَ سَعِيدٍ حَدَّثَهُ أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ يَقُولُ كُنَّا فِي مَجْلِسٍ عِنْدَ أُبَيِّ بْنِ كَعْبٍ فَأَتَى أَبُو مُوسَى الْأَشْعَرِيُّ مُغْضَبًا حَتَّى وَقَفَ فَقَالَ أَنْشُدُكُمْ اللَّهَ هَلْ سَمِعَ أَحَدٌ مِنْكُمْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الِاسْتِئْذَانُ ثَلَاثٌ فَإِنْ أُذِنَ لَكَ وَإِلَّا فَارْجِعْ قَالَ أُبَيٌّ وَمَا ذَاكَ قَالَ اسْتَأْذَنْتُ عَلَى عُمَرَ بْنِ الْخَطَّابِ أَمْسِ ثَلَاثَ مَرَّاتٍ فَلَمْ يُؤْذَنْ لِي فَرَجَعْتُ ثُمَّ جِئْتُهُ الْيَوْمَ فَدَخَلْتُ عَلَيْهِ فَأَخْبَرْتُهُ أَنِّي جِئْتُ أَمْسِ فَسَلَّمْتُ ثَلَاثًا ثُمَّ انْصَرَفْتُ قَالَ قَدْ سَمِعْنَاكَ وَنَحْنُ حِينَئِذٍ عَلَى شُغْلٍ فَلَوْ مَا اسْتَأْذَنْتَ حَتَّى يُؤْذَنَ لَكَ قَالَ اسْتَأْذَنْتُ كَمَا سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَوَاللَّهِ لَأُوجِعَنَّ ظَهْرَكَ وَبَطْنَكَ أَوْ لَتَأْتِيَنَّ بِمَنْ يَشْهَدُ لَكَ عَلَى هَذَا فَقَالَ أُبَيُّ بْنُ كَعْبٍ فَوَاللَّهِ لَا يَقُومُ مَعَكَ إِلَّا أَحْدَثُنَا سِنًّا قُمْ يَا أَبَا سَعِيدٍ فَقُمْتُ حَتَّى أَتَيْتُ عُمَرَ فَقُلْتُ قَدْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ هَذَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13192,
                "hadithNumber": "5629",
                "englishNarrator": "Abu Sa'id رضی اللہ عنہ reported:",
                "hadithEnglish": "Abu Musa al-Ash'ari رضی اللہ عنہ came to the door of 'Umar and sought his permission (to get into his house). Umar رضی اللہ عنہ said: That is once. He again sought permission for the second time and 'Umar رضی اللہ عنہ said: It is twice. He again sought permission for the third time and Umar رضی اللہ عنہ said: It is thrice. He (Abu Musa رضی اللہ عنہ ) then went back. He (Hadrat 'Umar رضی اللہ عنہ ) (sent someone) to pursue him so that he should be brought back. Thereupon he (Hadrat Umar رضی اللہ عنہ ) said: If this act (of yours is in accordance with the command of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) you have preserved in your mind, then it is all right, otherwise (I shall give you such a severe punishment) that it will serve as an example to others. Abu Sa'id رضی اللہ عنہ said: Then he (Abu Musa رضی اللہ عنہ ) came to us and said: Do you remember Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) having said this: Permission is for three times ? They (Companions sitting in that company) began to laugh, whereupon he (Abu Musa) said: There comes to you your Muslim brother who had been perturbed and you laugh. Abu Sa'id رضی اللہ عنہ said: (Well), you go forth. I shall be your participant in this trouble of yours. So he came to him (Hadrat Umar رضی اللہ عنہ ) and said: Here is Abu Sa'id رضی اللہ عنہ (to support my statement).",
                "hadithUrdu": "حضرت ابو موسیٰ رضی اللہ تعالیٰ عنہ حضرت عمر رضی اللہ تعالیٰ عنہ کے دروازے پر گئے اور اجازت طلب کی ، حضرت عمر رضی اللہ تعالیٰ عنہ نےکہا : یہ ایک بار ہے ۔ پھر انھوں نے دوبارہ اجازت طلب کی ، حضرت عمر رضی اللہ  عنہ نے کہا : یہ دوسری بار ہے ۔ پھر انہوں نے تیسری باراجازت طلب کی ، حضرت عمر رضی اللہ تعالیٰ عنہ نے کہا : یہ تیسری بار ہے ، پھر وہ لوٹ گئے ۔ حضرت عمر رضی اللہ تعالیٰ عنہ نے ( اگلے دن ) کسی کو ان کے پیچھے روانہ کیا اور انھیں دوبارہ بلا بھیجا ۔ پھر ( حضرت عمر رضی اللہ تعالیٰ عنہ نے ) ان سے کہا : اگر یہ ایسی بات ہے جو تم نے رسول اللہ صلی اللہ علیہ وسلم سے ( سن کر ) یار رکھی ہے تو ٹھیک ہے ، اگر نہیں تو میں تمھیں ( دوسروں کے لیے نشان ) عبرت بنا دوں گا ۔ حضرت ابو سعید رضی اللہ عنہ نے کہا : تو وہ ہمارے ہاں آئے اور کہنے لگے : تمھیں علم نہیں ہے کہ ر سول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا : \" اجازت تین بار طلب کی جاتی ہے؟ \" کہا : تو لوگ ہنسنے لگے ، کہا : میں نے ( لوگوں سے کہا : ) تمھارے پاس تمھارا مسلمان بھائی ڈرا ہوا آیا ہے اور تم ہنس رہے ہو؟ ( پھر حضرت موسیٰ رضی اللہ تعالیٰ عنہ سے کہا : ) چلیں میں اس سزا میں آپ کا حصہ دار بنوں گاپھر وہ حضرت عمر رضی اللہ تعالیٰ عنہ کے پاس آئے اور کہا : یہ ابو سعید ہیں ( یہ میرے گواہ ہیں ۔ )",
                "urduNarrator": "ہم سے نصر بن علی الجہدمی نے بیان کیا, بشر بن مفضل نے کہا : ہمیں سعید بن یزید نے ابو نضرہ سے حدیث بیان کی ، انھوں نے حضرت ابو سعید رضی اللہ عنہ سے ر وایت کی کہ",
                "hadithArabic": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا بِشْرٌ يَعْنِي ابْنَ مُفَضَّلٍ حَدَّثَنَا سَعِيدُ بْنُ يَزِيدَ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ أَنَّ أَبَا مُوسَى أَتَى بَابَ عُمَرَ فَاسْتَأْذَنَ فَقَالَ عُمَرُ وَاحِدَةٌ ثُمَّ اسْتَأْذَنَ الثَّانِيَةَ فَقَالَ عُمَرُ ثِنْتَانِ ثُمَّ اسْتَأْذَنَ الثَّالِثَةَ فَقَالَ عُمَرُ ثَلَاثٌ ثُمَّ انْصَرَفَ فَأَتْبَعَهُ فَرَدَّهُ فَقَالَ إِنْ كَانَ هَذَا شَيْئًا حَفِظْتَهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَهَا وَإِلَّا فَلَأَجْعَلَنَّكَ عِظَةً قَالَ أَبُو سَعِيدٍ فَأَتَانَا فَقَالَ أَلَمْ تَعْلَمُوا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الِاسْتِئْذَانُ ثَلَاثٌ قَالَ فَجَعَلُوا يَضْحَكُونَ قَالَ فَقُلْتُ أَتَاكُمْ أَخُوكُمْ الْمُسْلِمُ قَدْ أُفْزِعَ تَضْحَكُونَ انْطَلِقْ فَأَنَا شَرِيكُكَ فِي هَذِهِ الْعُقُوبَةِ فَأَتَاهُ فَقَالَ هَذَا أَبُو سَعِيدٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13193,
                "hadithNumber": "5630",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Abu Sa'id Khudri رضی اللہ عنہ through another chain of transmitters.",
                "hadithUrdu": "ہم سے محمد بن المثنیٰ اور ابن بشار نے بیان کیا، کہا کہ ہم سے محمد بن جعفر نے بیان کیا, شعبہ نے ابو سلمہ جریری اور سعید بن یزید سے حدیث بیان کی ، جریری اور سعید بن یزید دونوں نے ابو نضر ہ سے روایت کی ، دونوں نے کہا : ہم نے انھیں ابو سعید خدری رضی اللہ عنہ سے اسی حدیث کے ہم معنی حدیث بیان کر تے ہو ئے سنا ، جس طرح بشر بن مفضل نے ابو سلمہ سے روایت کی ہے ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي مَسْلَمَةَ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ ح و حَدَّثَنَا أَحْمَدُ بْنُ الْحَسَنِ بْنِ خِرَاشٍ حَدَّثَنَا شَبَابَةُ حَدَّثَنَا شُعْبَةُ عَنْ الْجُرَيْرِيِّ وَسَعِيدِ بْنِ يَزِيدَ كِلَاهُمَا عَنْ أَبِي نَضْرَةَ قَالَا سَمِعْنَاهُ يُحَدِّثُ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ بِمَعْنَى حَدِيثِ بِشْرِ بْنِ مُفَضَّلٍ عَنْ أَبِي مَسْلَمَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13194,
                "hadithNumber": "5631",
                "englishNarrator": "Ubaid bin Umair reported:",
                "hadithEnglish": "Abu Musa رضی اللہ عنہ brought permission from Umar رضی اللہ عنہ (to enter the house) three times, and finding him busy came back, whereupon Umar said (to the Inmates of his house): Did you not hear the voice of 'Abdullah bin Qais (the Kunya of Abu Musa Ash'ari رضی اللہ عنہ)? He was called back. and he (Hadrat 'Umar رضی اللہ عنہ) said: What did prompt you to do it? Thereupon, he said: This is how we have been commanded to act. He (Hadrat 'Umar رضی اللہ عنہ ) said: Bring evidence (in support of) it, otherwise I shall deal (strictly) with you. So he (Abu Musa رضی اللہ عنہ ) set out and came to the meeting of the Ansar and asked them to bear witness before hadrat Umar رضی اللہ عنہ about this. They (the Companions present there) said: None but the youngest amongst us would bear out this fact. So Abu Sa'id Khudri رضی اللہ عنہ (who was the youngest one in that company) said: We have been commanded to do so (while visiting the house of other people). Thereupon 'Umar رضی اللہ عنہ said: This command of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had remained hidden from me up till now due to (my) business in the market.",
                "hadithUrdu": "حضرت ابو موسیٰ رضی اللہ عنہ نے حضرت عمر رضی اللہ تعالیٰ عنہ سے تین مرتبہ اجا زت طلب کی تو جیسے انھوں نے حضرت عمر رضی اللہ عنہ کو مشغول سمجھا اور واپس ہو گئے ۔ حضرت عمر رضی اللہ تعالیٰ عنہ نے کہا : کیا ہم نے عبد اللہ بن قیس ( ابو موسیٰ رضی اللہ تعالیٰ عنہ ) کی آواز نہیں سنی تھی؟ ان کو اندر آنے کی اجازت دو ، ( حضرت ابو موسیٰ رضی اللہ تعالیٰ عنہ واپس چلے گئے ہوئے تھے ، دوسرے دن ) حضرت ابو موسیٰ رضی اللہ تعالیٰ عنہ کو بلا یا گیا حضرت عمر رضی اللہ تعالیٰ عنہ نے کہا : تم نے ایسا کیوں کیا؟ انھوں نے کہا : ہمیں یہی ( کرنے کا ) حکم دیا جا تا تھا ۔ انھوں نے کہا : تم اس پر گواہی دلاؤ ، نہیں تو میں ( وہ ) کروں گا ( جو کروںگا ) وہ ( حضرت ابو موسیٰ رضی اللہ تعالیٰ عنہ ) نکلے انصار کی مجلس میں آئے انھوں نے کہا : اس بات پر تمھا رے حق میں اور کو ئی نہیں ، ہم میں سے جو سب سے چھوٹا ہے وہی گواہی دے گا ۔ ابو سعید رضی اللہ تعالیٰ عنہ نے ( حضرت عمر رضی اللہ تعالیٰ عنہ کے سامنے ) کھڑے ہو کر کہا : ہمیں ( رسول اللہ صلی اللہ علیہ وسلم کے عہد مبارک میں ) اسی کا حکم دیا جا تا تھا ۔ حضرت عمر رضی اللہ تعالیٰ عنہ نے کہا : رسول اللہ صلی اللہ علیہ وسلم کا یہ حکم مجھ سے اوجھل رہ گیا ، بازاروں میں ہو نے والے سودوں نے مجھے اس سے مشغول کردیا ۔",
                "urduNarrator": "مجھ سے محمد بن حاتم نے کہا, یحییٰ بن سعیدقطان نے ابن جریج سے روایت کی کہا : ہمیں عطاء نے عبید بن عمیر سے حدیث بیان کی کہ",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ، عَنِ ابْنِ جُرَيْجٍ، حَدَّثَنَا عَطَاءٌ، عَنْ عُبَيْدِ بْنِ عُمَيْرٍ، أَنَّ أَبَا مُوسَى، اسْتَأْذَنَ عَلَى عُمَرَ ثَلَاثًا، فَكَأَنَّهُ وَجَدَهُ مَشْغُولًا، فَرَجَعَ فَقَالَ عُمَرُ: أَلَمْ تَسْمَعْ صَوْتَ عَبْدِ اللهِ بْنِ قَيْسٍ، ائْذَنُوا لَهُ، فَدُعِيَ لَهُ، فَقَالَ: مَا حَمَلَكَ عَلَى مَا صَنَعْتَ، قَالَ: إِنَّا كُنَّا نُؤْمَرُ بِهَذَا قَالَ: لَتُقِيمَنَّ عَلَى هَذَا بَيِّنَةً أَوْ لَأَفْعَلَنَّ، فَخَرَجَ فَانْطَلَقَ إِلَى مَجْلِسٍ مِنَ الْأَنْصَارِ، فَقَالُوا: لَا يَشْهَدُ لَكَ عَلَى هَذَا إِلَّا أَصْغَرُنَا، فَقَامَ أَبُو سَعِيدٍ فَقَالَ: «كُنَّا نُؤْمَرُ بِهَذَا» فَقَالَ عُمَرُ: «خَفِيَ عَلَيَّ هَذَا مِنْ أَمْرِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، أَلْهَانِي عَنْهُ الصَّفْقُ بِالْأَسْوَاقِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13195,
                "hadithNumber": "5632",
                "englishNarrator": null,
                "hadithEnglish": "Ibn Juraij narrated a similar report (as no. 5631) with this chain of narrators, but in the Hadith of An-Nadr it does not mention (the phrase): \"I missed out of this command of the Messenger of Allah ﷺ because of my business in my workplace.",
                "hadithUrdu": "ہم سے محمد بن بشار نے بیان کیا, ابو عاصم اور نضر بن شمیل دونوں نے کہا : ہمیں ابن جریج نے اسی سند کے ساتھ اسی طرح حدیث بیان کی ۔ اور نضر کی حدیث میں انھوں نے \" بازاروں میں ہو نے والے سودوں نے مجھے اس سے مشغول کردیا ۔ \" کے الفا ظ بیان نہیں کیے ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو عَاصِمٍ، ح وَحَدَّثَنَا حُسَيْنُ بْنُ حُرَيْثٍ، حَدَّثَنَا النَّضْرُ يَعْنِي ابْنَ شُمَيْلٍ، قَالَا: جَمِيعًا، حَدَّثَنَا ابْنُ جُرَيْجٍ، بِهَذَا الْإِسْنَادِ، نَحْوَهُ. وَلَمْ يَذْكُرَ فِي حَدِيثِ النَّضْرِ أَلْهَانِي عَنْهُ الصَّفْقُ بِالْأَسْوَاقِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13196,
                "hadithNumber": "5633",
                "englishNarrator": "Abu Musa Ash'ari رضی اللہ عنہ reported:",
                "hadithEnglish": "He went to 'Umar bin Khattab رضی اللہ عنہ and greeted him by saying: As-Salamu-'Alaikum, here is 'Abdullah bin Qais, but he did not permit him (to get in). He (Abu Musa Ash'ari رضی اللہ عنہ) again greeted him with as-Salamu-'Alaikum and said: Here is Abu Musa, but he (Hadrat 'Umar رضی اللہ عنہ ) did not permit him (to get in). He again said: As-Salam-u-'Alaikum, (and said) here is Ash'ari, (then receiving no response he came back). He (Hadrat 'Umar رضی اللہ عنہ ) said: Bring him back to me, bring him back to me So he went there (in the presence of Hadrat 'Umar رضی اللہ عنہ ) and he said to him: Abu Musa رضی اللہ عنہ , what made you go back, while we were busy in some work? He said: I heard Allah's Messenger (ﷺ) as saying: Permission should be sought thrice. And if you are permitted, (then get in), otherwise go back. He said: Bring witness to this fact, otherwise I shall do this and that, i.e. I shall punish you. Abu Musa رضی اللہ عنہ went away and 'Umar رضی اللہ عنہ said to him (on his departure): It he (Abu Musa رضی اللہ عنہ ) finds a witness he should meet him by the side of the pulpit in the evening and it he does not find a witness you would not find him there. When it was evening he (Hadrat 'Umar رضی اللہ عنہ ) found him (Abu Musa رضی اللہ عنہ ) there. He (Hadrat 'Umar رضی اللہ عنہ ) said: Abu Musa رضی اللہ عنہ , have you been able to find a witness to what you have said? He said: Yes. Here is Ubayy bin Ka'b رضی اللہ عنہ , whereupon he (Hadrat 'Umar) said: Yes, he is an authentic (witness). He (Hadrat 'Umar رضی اللہ عنہ ) said: Abu Tufail (the kunya of Ubayy bin Ka'b رضی اللہ عنہ ), what does he (Abu Musa say? Thereupon he said: Ibn Khattab رضی اللہ عنہ , I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying so. Do not prove to be a hard (task-master) for the Companions of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), whereupon he Hadrat 'Umar رضی اللہ عنہ said: Hallowed be Allah. I had heard something (in this connection), but I wished it to be established (as an undeniable fact).",
                "hadithUrdu": "ابو موسیٰ اشعری رضی اللہ عنہ حضرت عمر بن خطاب رضی اللہ تعالیٰ عنہ کے پاس آئے اور کہا : السلام علیکم ، عبد اللہ بن قیس ( حاضر ہوا ) ہے ، انھوں نے آنے کی اجازت نہ دی ۔ انھوں نے پھر کہا : السلام علیکم ، یہ ابو موسیٰ ہے ، السلام علیکم ، یہ اشعری ہے ، اس کے بعد چلے گئے ، حضرت عمر رضی اللہ تعالیٰ عنہ نے کہا : ان کو میرے پاس واپس لا ؤ ۔ میرے پاس واپس لا ؤ ۔ وہ آئے تو حضرت عمر رضی اللہ تعالیٰ عنہ نے کہا : ابو موسیٰ !آپ کو کس بات نے لوٹا دیا ؟ ہم کا م میں مشغول تھے ۔ انھوں نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ نے فر ما یا : \"\" اجازت تین بار طلب کی جا ئے ، اگر تم کو اجازت دے دی جا ئے ( توآ جاؤ ) ورنہ لوٹ جا ؤ ۔ \"\" حضرت عمر رضی اللہ تعالیٰ عنہ نے کہا : یا تو آپ اس پر گواہ لا ئیں گے یا پھر میں یہ کروں گا تو حضرت ابو موسیٰ رضی اللہ تعالیٰ عنہ چلے گئے ۔ حضرت عمر رضی اللہ تعالیٰ عنہ نے کہا ابو موسیٰ کو گواہ مل گیا تو شام کو وہ تمھیں منبر کے پاس ملیں گے اور اگر ان کو گواہ نہیں ملا تو وہ تمھیں نہیں ملیں گے ، جب حضرت عمر رضی اللہ تعالیٰ عنہ شام کو آئے تو انھوں نے حضرت ابو موسیٰ رضی اللہ تعالیٰ عنہ کو موجود پا یا ، انھوں نے کہا ابو موسیٰ !کیا کہتے ہیں ؟آپ کو گواہ مل گیا ؟ انھوں نے کہا : ہاں! ابی بن کعب ہیں انھوں ( حضرت عمر رضی اللہ تعالیٰ عنہ ) نے کہا : وہ قابل اعتماد گواہ ہیں ۔ ( پھر ابو طفیل عامر بن واثلہ رضی اللہ تعالیٰ عنہ کی طرف متوجہ ہو کر ) کہا : ابو طفیل !یہ ( ابی بن کعب رضی اللہ تعالیٰ عنہ ) کیا کہتے ہیں ؟ انھوں ( حضرت ابی بن کعب رضی اللہ تعالیٰ عنہ ) نے کہا : ابن خطاب !میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ یہی فر ما رہے تھے ۔ لہٰذا آپ رسول اللہ صلی اللہ علیہ وسلم کے صحابہ کرام رضوان اللہ عنھم اجمعین پر عذاب نہ بنیں ۔ انھوں نے کہا : سبحان اللہ !میں نے ایک چیز سنی اور چاہا کہ اس کا ثبوت حاصل کروں ۔",
                "urduNarrator": "ہم سے حسین بن حارث ابو عمار نے بیان کیا, افضل بن موسیٰ نے کہا : ہمیں طلحہ بن یحییٰ نے ابو بردہ سے خبر دی ، انھوں نے حضرت ابو موسیٰ اشعری رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا حُسَيْنُ بْنُ حُرَيْثٍ أَبُو عَمَّارٍ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى أَخْبَرَنَا طَلْحَةُ بْنُ يَحْيَى عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ قَالَ جَاءَ أَبُو مُوسَى إِلَى عُمَرَ بْنِ الْخَطَّابِ فَقَالَ السَّلَامُ عَلَيْكُمْ هَذَا عَبْدُ اللَّهِ بْنُ قَيْسٍ فَلَمْ يَأْذَنْ لَهُ فَقَالَ السَّلَامُ عَلَيْكُمْ هَذَا أَبُو مُوسَى السَّلَامُ عَلَيْكُمْ هَذَا الْأَشْعَرِيُّ ثُمَّ انْصَرَفَ فَقَالَ رُدُّوا عَلَيَّ رُدُّوا عَلَيَّ فَجَاءَ فَقَالَ يَا أَبَا مُوسَى مَا رَدَّكَ كُنَّا فِي شُغْلٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الِاسْتِئْذَانُ ثَلَاثٌ فَإِنْ أُذِنَ لَكَ وَإِلَّا فَارْجِعْ قَالَ لَتَأْتِيَنِّي عَلَى هَذَا بِبَيِّنَةٍ وَإِلَّا فَعَلْتُ وَفَعَلْتُ فَذَهَبَ أَبُو مُوسَى قَالَ عُمَرُ إِنْ وَجَدَ بَيِّنَةً تَجِدُوهُ عِنْدَ الْمِنْبَرِ عَشِيَّةً وَإِنْ لَمْ يَجِدْ بَيِّنَةً فَلَمْ تَجِدُوهُ فَلَمَّا أَنْ جَاءَ بِالْعَشِيِّ وَجَدُوهُ قَالَ يَا أَبَا مُوسَى مَا تَقُولُ أَقَدْ وَجَدْتَ قَالَ نَعَمْ أُبَيَّ بْنَ كَعْبٍ قَالَ عَدْلٌ قَالَ يَا أَبَا الطُّفَيْلِ مَا يَقُولُ هَذَا قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ ذَلِكَ يَا ابْنَ الْخَطَّابِ فَلَا تَكُونَنَّ عَذَابًا عَلَى أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ سُبْحَانَ اللَّهِ إِنَّمَا سَمِعْتُ شَيْئًا فَأَحْبَبْتُ أَنْ أَتَثَبَّتَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13197,
                "hadithNumber": "5634",
                "englishNarrator": "This hadith has been narrated on the authority of Talha bin Yahya with the same chain of transmitters but with this variation of wording: He (Hadrat 'Umar رضی اللہ عنہ ) said:",
                "hadithEnglish": "Abu Mundhir (the Kunya of Ubayy bin Ka'b رضی اللہ عنہ ), did you hear this from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ )? Thereupon he said: Yes. and he further said: Ibn Khattab, do not be a torment for the Companions of Allah's Messenger (ﷺ). No mention has, however, been made of the words of 'Umar رضی اللہ عنہ : Hallowed be Allah and what follows subsequently.",
                "hadithUrdu": "ابو منذر! ( ابی بن کعب رضی اللہ عنہ کی کنیت ) کیا آپ نے رسول اللہ صلی اللہ علیہ وسلم سے یہ حدیث سنی تھی ؟انھوں نے کہا : ہاں ، ابن خطاب !تو آپ رسول اللہ صلی اللہ علیہ وسلم کے صحابہ کرام رضوان اللہ عنھم اجمعین کے لیے عذاب نہ بنیں اور انھوں نے حضرت عمر رضی اللہ عنہ کا قول : سبحان اللہ اور اس کے بعد کا حصہ ذکر نہیں کیا ۔",
                "urduNarrator": "اور ہم سے عبداللہ بن عمر بن محمد بن ابان نے بیان کیا, علی بن ہاشم نے طلحہ بن یحییٰ سے اسی سند کے ساتھ حدیث بیان کی ، مگر انھوں نے کہا : تو انھوں ( حضرت عمر رضی اللہ عنہ ) نے کہا",
                "hadithArabic": "و حَدَّثَنَاه عَبْدُ اللَّهِ بْنُ عُمَرَ بْنِ مُحَمَّدِ بْنِ أَبَانَ حَدَّثَنَا عَلِيُّ بْنُ هَاشِمٍ عَنْ طَلْحَةَ بْنِ يَحْيَى بِهَذَا الْإِسْنَادِ غَيْرَ أَنَّهُ قَالَ فَقَالَ يَا أَبَا الْمُنْذِرِ آنْتَ سَمِعْتَ هَذَا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ نَعَمْ فَلَا تَكُنْ يَا ابْنَ الْخَطَّابِ عَذَابًا عَلَى أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يَذْكُرْ مِنْ قَوْلِ عُمَرَ سُبْحَانَ اللَّهِ وَمَا بَعْدَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13198,
                "hadithNumber": "5635",
                "englishNarrator": "Jabir bin Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "I came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and called him (with a view to seeking permission). whereupon Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Who is it? I said: It is I. Thereupon he (the Holy Prophet) came out saying: It is I. it is I.",
                "hadithUrdu": "میں نبی صلی اللہ علیہ وسلم کی خدمت میں حا ضر ہوا اور آواز دی نبی صلی اللہ علیہ وسلم نے فر ما یا \" کون ہے \" ؟میں نے کہا : میں ۔ آپ باہر تشریف لا ئے اور آپ فرما رہے تھے َ \" میں ، میں ( کیسا جواب ہے؟ )",
                "urduNarrator": "ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا, عبد اللہ بن ادریس نے شبعہ سے انھوں نے محمد بن منکدر سے ، انھوں نے جابر بن عبداللہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ شُعْبَةَ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَدَعَوْتُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ هَذَا قُلْتُ أَنَا قَالَ فَخَرَجَ وَهُوَ يَقُولُ أَنَا أَنَا.",
                "headingArabic": "كَرَاهَةِ قَوْلِ الْمُسْتَأْذِنِ أَنَا ‏إِذَا قِيلَ مَنْ هَذَا ‏‏",
                "headingUrdu": "یہ اس شخص کے لیے ناپسندیدہ ہے جو اجازت طلب کر رہا ہو کہ \"میں\" کہنے پر \"کون ہے؟\"",
                "headingEnglish": "It Is Disliked For The Person Who Is Seeking Permission To Say \"Me\" When Asked \"Who Is It?\"",
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13199,
                "hadithNumber": "5636",
                "englishNarrator": "Jabir bin Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "I sought permission from Allah's Messenger (ﷺ) to see him. He said: Who is it? I said: It is I. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: It is I. it is I (these words lead me to no conclusion).",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم کے ہاں اجازت طلب کی ، آپ نے فرما یا : \" یہ کو ن ہے؟ \" میں نے کہا : میں ۔ نبی صلی اللہ علیہ وسلم نے فر ما یا : \" میں ، میں ! ( سے کیا پتہ چل سکتا ہے ؟ ) \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ اور ابوبکر بن ابی شیبہ نے بیان کیا، اور یہ قول ابوبکر سے ہے، یحییٰ نے کہا، انہوں نے کہا، اور ابوبکر نے کہا, وکیع نے شعبہ سے ، انھوں نے محمد بن منکدر سے ، انھوں نے حضرت جابر بن عبد اللہ رضی اللہ عنہ سے روایت کی کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَاللَّفْظُ لِأَبِي بَكْرٍ قَالَ يَحْيَى أَخْبَرَنَا و قَالَ أَبُو بَكْرٍ حَدَّثَنَا وَكِيعٌ عَنْ شُعْبَةَ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ اسْتَأْذَنْتُ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَنْ هَذَا فَقُلْتُ أَنَا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَا أَنَاَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13200,
                "hadithNumber": "5637",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been transmitted on the authority of Shu'ba with a slight variation of wording and that is: The Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) uttered these words: It is I. it is I. in the manner as if he disapproved of this.",
                "hadithUrdu": "ہم سے اسحاق بن ابراہیم نے بیان کیا, نضر بن شمیل ابو عامر عقدی وہب بن جریر اور بہز ، سب نے شعبہ سے اسی سند کے ساتھ روایت کی ، ان سب کی حدیث میں ( یہ جملہ بھی ) ہے : جیسے آپ نے اس کو ناپسند فر ما یا ہو ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ وَأَبُو عَامِرٍ الْعَقَدِيُّ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنِي وَهْبُ بْنُ جَرِيرٍ ح و حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ بِشْرٍ حَدَّثَنَا بَهْزٌ كُلُّهُمْ عَنْ شُعْبَةَ بِهَذَا الْإِسْنَادِ وَفِي حَدِيثِهِمْ كَأَنَّهُ كَرِهَ ذَلِك.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13201,
                "hadithNumber": "5638",
                "englishNarrator": "Sahl bin Sa'd as-Sa'id رضی اللہ عنہ reported:",
                "hadithEnglish": "A person peeped through the hole of the door of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), and at that time Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had with him a scratching instrument with which he had been scratching his head. When Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saw him. he said: If I were to know that you had been peeping through the door, I would have thrust that into your eyes, and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Permission is needed as a protection against glance.",
                "hadithUrdu": "ایک شخص نے رسول اللہ صلی اللہ علیہ وسلم کے دروازے کی جھری میں اندر جھا نکا ، اس وقت رسول اللہ صلی اللہ علیہ وسلم کے پاس ( لکڑی یا لو ہے کا لمبی لمبی کئی نوکوں والا ) بال درست کرنے کا ایک آلہ تھا جس سے آپ سر کھجا رہے تھے ، جب رسول اللہ صلی اللہ علیہ وسلم نے اس کو دیکھا تو فرما یا : \" اگر مجھے یقینی طور پر پتہ چل جا تا کہ تم مجھے دیکھ رہے ہو تو میں اس کو تمھا ری آنکھوں میں گھسا دیتا ، \" رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" اجازت لینے کا طریقہ آنکھ ہی کی وجہ سے تو رکھا گیا ہے ۔ \" ( کہ آنکھ کسی خلوت کے عالم میں نہ دیکھ سکے ۔ )",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ اور محمد بن رمح نے بیان کیا, لیث نے ابن شہاب سے روایت کی کہ حضرت سہل بن سعد ساعدی رضی اللہ عنہ نے انھیں بتا یا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَمُحَمَّدُ بْنُ رُمْحٍ قَالَا أَخْبَرَنَا اللَّيْثُ وَاللَّفْظُ لِيَحْيَى ح و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ عَنْ ابْنِ شِهَابٍ أَنَّ سَهْلَ بْنَ سَعْدٍ السَّاعِدِيَّ أَخْبَرَهُ أَنَّ رَجُلًا اطَّلَعَ فِي جُحْرٍ فِي بَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِدْرًى يَحُكُّ بِهِ رَأْسَهُ فَلَمَّا رَآهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَوْ أَعْلَمُ أَنَّكَ تَنْتَظِرُنِي لَطَعَنْتُ بِهِ فِي عَيْنِكَ وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا جُعِلَ الْإِذْنُ مِنْ أَجْلِ الْبَصَرِ.",
                "headingArabic": "تَحْرِيمِ النَّظَرِ فِي بَيْتِ غَيْرِهِ ‏‏",
                "headingUrdu": "گھر میں جھانکنے کی ممانعت",
                "headingEnglish": "The Prohibition Of Looking Into A House",
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13202,
                "hadithNumber": "5639",
                "englishNarrator": "Sahl bin Sa'd as-Sa'idi رضی اللہ عنہ reported:",
                "hadithEnglish": "A person peeped through the hole of the door of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and he had with him some pointed thing with which he had been adjusting (the hair of his head). Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to him: If I were to know that you had been peeping. I would have thrust it in your eyes. Allah has prescribed seeking permission because of protection against glance.",
                "hadithUrdu": "ایک شخص نے رسول اللہ صلی اللہ علیہ وسلم کے دروازے میں بن جا نے والی جھری میں سے جھا نکا ، اس وقت رسول اللہ صلی اللہ علیہ وسلم کے پاس بال درست کرنے والا لوہے کا ایک آلہ تھا جس سے آپ سر کے بالوں کو سنوار رہے تھے رسول اللہ صلی اللہ علیہ وسلم نے اس سے فر ما یا : \" اگر میں جان لیتا کہ تو واقعی مجھے دیکھ رہے ہو تو میں اس کو تمھا ری آنکھوں میں چبھو دیتا ۔ اللہ نے اجازت لینے کا طریقہ آنکھ ہی کے لیے تو رکھا ہے ۔ \"",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا, یو نس نے ابن شہاب سے روایت کی کہ سہل بن سعدانصاری رضی اللہ عنہ نے انھیں بتا یا کہ",
                "hadithArabic": "و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ أَنَّ سَهْلَ بْنَ سَعْدٍ الْأَنْصَارِيَّ أَخْبَرَهُ أَنَّ رَجُلًا اطَّلَعَ مِنْ جُحْرٍ فِي بَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِدْرًى يُرَجِّلُ بِهِ رَأْسَهُ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ أَعْلَمُ أَنَّكَ تَنْظُرُ طَعَنْتُ بِهِ فِي عَيْنِكَ إِنَّمَا جَعَلَ اللَّهُ الْإِذْنَ مِنْ أَجْلِ الْبَصَرِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13203,
                "hadithNumber": "5640",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like that of Al-Laith and Younus (no. 5641) was narrated from Sahl bin Sa'd رضی اللہ عنہ , from the prophet ﷺ.",
                "hadithUrdu": "سفیان بن عیینہ اور معمر دونوں نے زہری سے انھوں نے حضرت سہل بن سعد رضی اللہ عنہ سے ، انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے لیث اور یونس کی حدیث کی طرح روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ وَابْنُ أَبِي عُمَرَ قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ ح و حَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ حَدَّثَنَا مَعْمَرٌ كِلَاهُمَا عَنْ الزُّهْرِيِّ عَنْ سَهْلِ بْنِ سَعْدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَ حَدِيثِ اللَّيْثِ وَيُونُسَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13204,
                "hadithNumber": "5641",
                "englishNarrator": "",
                "hadithEnglish": "Anas b. Malik reported that a person peeped in some of the holes (in the doors) of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) (and he found him) standing up (lifting) an arrow or some arrows. The narrator said: I perceived as if Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was going to pierce (his eyes).",
                "hadithUrdu": "حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے روایت ہے کہ ایک شخص نے رسول اللہ صلی اللہ علیہ وسلم کے حجرے میں جھا نکا رسول اللہ صلی اللہ علیہ وسلم چوڑے پھل کا ایک تیر یا کئی تیرلے کر اٹھے جیسے میں رسول اللہ صلی اللہ علیہ وسلم کو دیکھ رہا ہو ں کہ آپ خاموشی سے اس کی آنکھوں میں وہ تیر چبھو نے کے امکا ن کا جائزہ لے رہے تھے ۔",
                "urduNarrator": "",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو كَامِلٍ فُضَيْلُ بْنُ حُسَيْنٍ وَقُتَيْبَةُ بْنُ سَعِيدٍ وَاللَّفْظُ لِيَحْيَى وَأَبِي كَامِلٍ قَالَ يَحْيَى أَخْبَرَنَا و قَالَ الْآخَرَانِ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ رَجُلًا اطَّلَعَ مِنْ بَعْضِ حُجَرِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَامَ إِلَيْهِ بِمِشْقَصٍ أَوْ مَشَاقِصَ فَكَأَنِّي أَنْظُرُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْتِلُهُ لِيَطْعُنَهُ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13205,
                "hadithNumber": "5642",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) say: He who peeped into the house of people without their consent, it is permissible for them to put out his eyes.",
                "hadithUrdu": "آپ نے فر ما یا : \" جس نے اجازت کے بغیر لو گوں کے گھر میں تانک جھانک کی ، انھیں اجا زت ہے کہ وہ اس کی آنکھ پھوڑدیں ۔ \"",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے جریر نے بیان کیا, سہیل کے والد ابو صالح نے حضرت ابو ہریرہ رضی اللہ عنہ سے ، انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ اطَّلَعَ فِي بَيْتِ قَوْمٍ بِغَيْرِ إِذْنِهِمْ فَقَدْ حَلَّ لَهُمْ أَنْ يَفْقَئُوا عَيْنَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13206,
                "hadithNumber": "5643",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: If a person were to cast a glance in your (house) without permission, and you had in your hand a staff and you would have thrust that in his eyes, there is no harm for you.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" اگر کو ئی شخص اجازت کے بغیر تمھا رے ہاں جھا نکے اور تم کنکری مارکر اس کی آنکھ پھوڑدو تو تم پر کو ئی گناہ نہیں ہے ( کو ئی سزایا جرمانہ نہیں ۔ )",
                "urduNarrator": "ہم سے ابن ابی عمر نے بیان کیا، ہم سے سفیان نے ابو الزناد سے بیان کیا, اعرج نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی ، کہ",
                "hadithArabic": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَوْ أَنَّ رَجُلًا اطَّلَعَ عَلَيْكَ بِغَيْرِ إِذْنٍ فَخَذَفْتَهُ بِحَصَاةٍ فَفَقَأْتَ عَيْنَهُ مَا كَانَ عَلَيْكَ مِنْ جُنَاحٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13207,
                "hadithNumber": "5644",
                "englishNarrator": "Jarir bin 'Abdullah reported:",
                "hadithEnglish": "I asked Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) about the sudden glance (that is cast) on the face (of a non-Mahram). He commanded me that I should turn away my eyes.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم سے اچانک نظر پڑجا نے کے بارے میں پو چھا تو آپ نے مجھے حکم دیا کہ میں اپنی نظر ہٹا لوں ۔",
                "urduNarrator": "مجھ سے قتیبہ بن سعید نے بیان کیا, یزید بن زریع ، اسماعیل بن علیہ اور ہشیم نے یو نس سے ، انھوں نے عمرو بن سعید سے ، انھوں نے ابوزرعہ سے ، انھوں نے حضرت جریر بن عبد اللہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ كِلَاهُمَا عَنْ يُونُسَ ح و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا يُونُسُ عَنْ عَمْرِو بْنِ سَعِيدٍ عَنْ أَبِي زُرْعَةَ عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ قَالَ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ نَظَرِ الْفُجَاءَةِ فَأَمَرَنِي أَنْ أَصْرِفَ بَصَرِي.",
                "headingArabic": "نَظَرِ الْفَجْأَةِ ‏‏",
                "headingUrdu": "گھر میں جھانکنے کی ممانعت",
                "headingEnglish": "An Accidental Glance",
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13208,
                "hadithNumber": "5645",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Yunus through another chain of transmitters.",
                "hadithUrdu": "ہم سے اسحاق بن ابراہیم نے بیان کیا, عبد الاعلیٰ اور سفیان دونوں نے یو نس سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا عَبْدُ الْأَعْلَى وَقَالَ إِسْحَقُ أَخْبَرَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ كِلَاهُمَا عَنْ يُونُسَ بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13209,
                "hadithNumber": "5646",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: The rider should first greet the pedestrian, and the pedestrian the one who is seated and a small group should greet a larger group (with as-Salam-o-'Alaikum).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" سوار پید ل کو سلام کرے ، چلنے والا بیٹھے ہو ئے کو سلام کرے اور کم لو گ زیادہ لوگوں کو سلام کریں ۔",
                "urduNarrator": "مجھ سے عقبہ بن مکرم نے بیان کیا، ہم سے ابو عاصم نے ابن جریج کی سند سے اور مجھ سے محمد بن مرزوق نے بیان کیا، ہم سے روح نے بیان کیا، ہم سے ابن جریج نے بیان کیا۔ زیاد نے مجھے بتایا کہ ثابت ایک بندہ ہے, عبد الرحمٰن بن زید کے آزاد کردہ غلام ثابت نے بتا یا کہ انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے سنا ، کہہ رہے تھے کہ",
                "hadithArabic": "حَدَّثَنِي عُقْبَةُ بْنُ مُكْرَمٍ حَدَّثَنَا أَبُو عَاصِمٍ عَنْ ابْنِ جُرَيْجٍ و حَدَّثَنِي مُحَمَّدُ بْنُ مَرْزُوقٍ حَدَّثَنَا رَوْحٌ حَدَّثَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي زِيَادٌ أَنَّ ثَابِتًا مَوْلَى عَبْدِ الرَّحْمَنِ بْنِ زَيْدٍ أَخْبَرَهُ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُسَلِّمُ الرَّاكِبُ عَلَى الْمَاشِي وَالْمَاشِي عَلَى الْقَاعِدِ وَالْقَلِيلُ عَلَى الْكَثِيرِ.",
                "headingArabic": "يُسَلِّمُ الرَّاكِبُ عَلَى الْمَاشِي وَالْقَلِيلُ عَلَى الْكَثِيرِ ‏‏",
                "headingUrdu": "جو سوار ہو وہ پیدل چلنے والے کو سلام کرے اور چھوٹا گروہ بڑے گروہ کو سلام کرے۔",
                "headingEnglish": "The One Who Is Riding Should Greet The One Who Is Walking, And The Smaller Group Should Greet The Larger Group",
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13210,
                "hadithNumber": "5647",
                "englishNarrator": "Abu Talha رضی اللہ عنہ reported:",
                "hadithEnglish": "While we were sitting in front of the houses and talking amongst ourselves, Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) happened to come there. He stood by us and said: What about you and your meetings on the paths? Avoid these meetings on the paths. We said: We were sitting here without (any intention of doing harm to the passers-by) ; we are sitting to discuss matters and to hold conversation amongst ourselves. Thereupon he said: If there is no help (for you but to sit on these paths), then give the paths their rights and these are lowering of the gaze, exchanging of greetings and good conversation.",
                "hadithUrdu": "ہم مکانوں کے سامنے کی کھلی جگہوں میں بیٹھے باتیں کر رہے تھے کہ رسول اللہ صلی اللہ علیہ وسلم تشریف لے آئے اور ہمارے پاس کھڑے ہو گئے ۔ آپ نے فر ما یا : \" تمھا را راستوں کی خالی جگہوں پر مجلسوں سے کیا سروکار؟ راستوں کی مجا لس سے اجتناب کرو ۔ \" ہم ایسی باتوں کے لیے بیٹھے ہیں جن میں کسی قسم کی کو ئی قباحت نہیں ، ہم ایک دوسرے سے گفتگو اور بات چیت کے لیے بیٹھے ہیں ، آپ نے فر ما یا : \" اگر نہیں ( رہ سکتے ) تو ان ( جگہوں ) کے حق ادا کرو ( جو یہ ہیں ) : آنکھ نیچی رکھنا ، سلام کا جواب دینا اور اچھی گفتگو کرنا ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے عفان نے بیان کیا، کہا ہم سے عبد الواحد بن زیاد نے بیان کیا، کہا ہم سے عثمان بن حکیم نے بیان کیا, اسحاق بن عبد اللہ بن ابی طلحہ نے اپنے والد سے روایت کی ، انھوں نے کہا کہ حضرت ابو طلحہ رضی اللہ عنہ نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَفَّانُ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ حَدَّثَنَا عُثْمَانُ بْنُ حَكِيمٍ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ عَنْ أَبِيهِ قَالَ قَالَ أَبُو طَلْحَةَ كُنَّا قُعُودًا بِالْأَفْنِيَةِ نَتَحَدَّثُ فَجَاءَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَامَ عَلَيْنَا فَقَالَ مَا لَكُمْ وَلِمَجَالِسِ الصُّعُدَاتِ اجْتَنِبُوا مَجَالِسَ الصُّعُدَاتِ فَقُلْنَا إِنَّمَا قَعَدْنَا لِغَيْرِ مَا بَاسٍ قَعَدْنَا نَتَذَاكَرُ وَنَتَحَدَّثُ قَالَ إِمَّا لَا فَأَدُّوا حَقَّهَا غَضُّ الْبَصَرِ وَرَدُّ السَّلَامِ وَحُسْنُ الْكَلَامِ.",
                "headingArabic": "مِنْ حَقِّ الْجُلُوسِ عَلَى الطَّرِيقِ رَدُّ السَّلاَمِ ‏‏",
                "headingUrdu": "گلی میں بیٹھنے کا ایک فرض سلام پھیرنا ہے۔",
                "headingEnglish": "One Of The Duties Of Sitting In The Street Is To Return Salam",
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13211,
                "hadithNumber": "5648",
                "englishNarrator": "Abu Sa'id Khudri رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Avoid sitting on the paths. They (the Companions) said: Allah's Messenger, we cannot help but holding our meetings (in these paths) and discuss matters (there). Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: If you insist on holding meetings, then give the path its due right. They said: What are its due rights? Upon this he said: Lowering the gaze, refraining from doing harm, exchanging of greetings. commanding of good and forbidding from evil.",
                "hadithUrdu": "آپ نے فر ما یا : \" راستوں میں بیٹھنے سے اجتنا ب کرو ۔ \" صحابہ کرام رضوان اللہ عنھم اجمعین نے کہا : اے اللہ کے رسول اللہ صلی اللہ علیہ وسلم !ہمارے لیے ( را ستے کی ) مجلسوں کے بغیر جن میں ( بیٹھ کر ) ہم باتیں کرتے ہیں ، کو ئی چارہ نہیں ۔ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : اگر تم مجا لس کے بغیر نہیں رہ ہو سکتے تو را ستے کا حق ادا کرو ۔ \" لوگوں نے کہا : اس کا حق کیا ہے ؟آپ نے فر ما یا : \" نگاہ نیچی رکھنا تکلیف دہ چیزوں کو ( را ستے سے ) ہٹانا ، سلام کا جواب دینا ، اچھا ئی کی تلقین کرنا اور بر ائی سے روکنا ۔ \"",
                "urduNarrator": "ہم سے سوید بن سعید نے بیان کیا,حفص بن میسرہ نے زید بن اسلم سے ، انھوں نے عطاء بن یسار سے ، انھوں نے حضرت ابو سعید خدری رضی اللہ عنہ سے ، انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا حَفْصُ بْنُ مَيْسَرَةَ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِيَّاكُمْ وَالْجُلُوسَ بِالطُّرُقَاتِ قَالُوا يَا رَسُولَ اللَّهِ مَا لَنَا بُدٌّ مِنْ مَجَالِسِنَا نَتَحَدَّثُ فِيهَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَبَيْتُمْ إِلَّا الْمَجْلِسَ فَأَعْطُوا الطَّرِيقَ حَقَّهُ قَالُوا وَمَا حَقُّهُ قَالَ غَضُّ الْبَصَرِ وَكَفُّ الْأَذَى وَرَدُّ السَّلَامِ وَالْأَمْرُ بِالْمَعْرُوفِ وَالنَّهْيُ عَنْ الْمُنْكَرِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13212,
                "hadithNumber": "5649",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Zaid bin Aslam with the same chain of transmitters.",
                "hadithUrdu": "ہم سے یحییٰ بن یحییٰ نے بیان کیا, عبد العزیزبن محمد مدنی اور ہشام بن سعد دونوں نے زید بن اسلم سے اسی سند کے ساتھ روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ الْمَدَنِيُّ ح و حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ عَنْ هِشَامٍ يَعْنِي ابْنَ سَعْدٍ كِلَاهُمَا عَنْ زَيْدِ بْنِ أَسْلَمَ بِهَذَا الْإِسْنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13213,
                "hadithNumber": "5650",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Five are the rights of a Muslim over his brother: Returning the salam, replying by saying Yarhamuk Allah (may Allah have mercy on you) to one who sneezes accepting an invitation, visiting the sick nd attending funeral.\r\nresponding to salutation, saying Yarhamuk Allah when anybody sneezes and says al-Hamdulillah, visiting the sick. following the bier. ' Abdul-Razzaq said that this hadith has been transmitted as mursal hadith from Zuhri and he then substantiated it on the authority of Ibn Musayyib.\r\nAbdul Razzaq said: Mu'mar used to transmit this hadith (without mentioning the names of the Tabi'i and the Companions) and sometimes he would narrate it (from Sa'id bin Al-Musayyib) and then from Abu Hurairah (رضی اللہ عنہ ).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر مایا : \"\" ایک مسلمان کے لیے اس کے بھا ئی پر پانچ چیزیں واجب ہیں : سلام کا جواب دینا چھینک مارنے والے کے لیے رحمت کی دعا کرنا دعوت قبول کرنا ، مریض کی عیادت کرنا اور جنازوں کے ساتھ جا نا ۔ \"\"\r\n عبدالرزاق نے کہا : معمر اس حدیث ( کی سند ) میں ارسال کرتے تھے ( تابعی اور صحابی کا نام ذکر نہیں کرتے تھے ) اور کبھی اسے ( سعید ) بن مسیب اور آگے حضرت ابو ہریرہ رضی اللہ عنہ کی سند سے ( متصل مرفوع ) روایت کرتے تھے ۔",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا, یو نس نے ابن شہاب ( زہری ) سے انھوں نے ابن مسیب سے روایت کی کہ حضرت ابو ہریرہ رضی اللہ عنہ نے کہا  رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : مسلمان کے مسلمان پر پا نچ حق ہیں ۔ \"\" نیز عبد الرزاق نے کہا : ہمیں معمر نے ( ابن شہاب ) زہری سے خبر دی ، انھوں نے ابن مسیب سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی کہا",
                "hadithArabic": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ ابْنِ الْمُسَيَّبِ أَنَّ أَبَا هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَقُّ الْمُسْلِمِ عَلَى الْمُسْلِمِ خَمْسٌ ح و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ ابْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَمْسٌ تَجِبُ لِلْمُسْلِمِ عَلَى أَخِيهِ رَدُّ السَّلَامِ وَتَشْمِيتُ الْعَاطِسِ وَإِجَابَةُ الدَّعْوَةِ وَعِيَادَةُ الْمَرِيضِ وَاتِّبَاعُ الْجَنَائِزِ قَالَ عَبْدُ الرَّزَّاقِ كَانَ مَعْمَرٌ يُرْسِلُ هَذَا الْحَدِيثَ عَنْ الزُّهْرِيِّ وَأَسْنَدَهُ مَرَّةً عَنْ ابْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ.",
                "headingArabic": "مِنْ حَقِّ الْمُسْلِمِ لِلْمُسْلِمِ رَدُّ السَّلاَمِ ‏‏",
                "headingUrdu": "ایک مسلمان کا دوسرے پر حق سلام ہے۔",
                "headingEnglish": "One Of The Rights Of One Muslim Over Another Is (The Greeting Of) Salam",
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 12901,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=516",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=514",
                "label": "514",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=515",
                "label": "515",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=516",
                "label": "516",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=517",
                "label": "517",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=518",
                "label": "518",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=519",
                "label": "519",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=520",
                "label": "520",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=518",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=518",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=516",
        "to": 12925,
        "total": 40465
    }
}