{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 424,
        "data": [
            {
                "id": 10864,
                "hadithNumber": "3300",
                "englishNarrator": "Al-Ala' bin al-Hadrami رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The stay at Mecca after the completion of his rituals (of Hajj) is only for three days.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فر ما یا : \" مہا جر کا اپنی عبادت مکمل کرنے کے بعد مکہ میں قیام تین دن تک کا ہے ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، کہا ہم سے ابن جریج نے بیان کیا، اور ہم سے اس کا حکم دیا، انہوں نے کہا اسماعیل بن محمد بن سعد نے مجھے خبر دی کہ حمید بن عبد الرحمٰن بن عوف نے انھیں بتا یا کہ سائب بن یزید رضی اللہ تعالیٰ عنہ نے انھیں بتا یا کہ علاء بن حضرمی رضی اللہ تعالیٰ عنہ نے انھیں رسول اللہ صلی اللہ علیہ وسلم سے خبر دی",
                "hadithArabic": "وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، وَأَمْلَاهُ عَلَيْنَا إِمْلَاءً، أَخْبَرَنِي إِسْمَاعِيلُ بْنُ مُحَمَّدِ بْنِ سَعْدٍ، أَنَّ حُمَيْدَ بْنَ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَخْبَرَهُ أَنَّ السَّائِبَ بْنَ يَزِيدَ، أَخْبَرَهُ أَنَّ الْعَلَاءَ بْنَ الْحَضْرَمِيِّ، أَخْبَرَهُ عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «مَكْثُ الْمُهَاجِرِ بِمَكَّةَ بَعْدَ قَضَاءِ نُسُكِهِ ثَلَاثٌ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10865,
                "hadithNumber": "3301",
                "englishNarrator": null,
                "hadithEnglish": "Ibn Juraij narrated this hadith with the same chain of transmitters.",
                "hadithUrdu": "مجھ سے حجاج بن الشعر نے بیان کیا، انہوں نے ہم سے بیان کیا ضحا ک بن مخلد نے ہمیں حدیث بیان کی ، ( کہا : ) ہمیں ابن جریج نے اسی سند کے ساتھ اسی کے مانند خبر دی ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا الضَّحَّاكُ بْنُ مَخْلَدٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ بِهَذَا الْإِسْنَادِ، مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10866,
                "hadithNumber": "3302",
                "englishNarrator": "Ibn 'Abbas ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying on the Day of Victory over Mecca: There is no Hijra (emigration) but only Jihad and good intention; and when you are called to battle, then go forth. He also said on the Day of Victory over Mecca: Allah made this town sacred on the day He created the earth and the heavens; so it is -sacred by the sacred- ness conferred on it by Allah until the Day of Resurrection and fighting in it was not lawful to anyone before me, and it was made lawful for me only during an hour on one day, for it is sacred by the sacredness conferred on it by Allah until the Day of Resurrection. Its thorns are not to be cut, its game is not to be molested, and the things dropped are to be picked up only by one who makes a public announcement of it, and its fresh herbage is not to be cut. Abbas ( رضی اللہ تعالیٰ عنہ) said: Messenger of Allah, exception may be made in case of rush, for it is useful for their blacksmiths and for their houses. He (the Holy Prophet) conceding the suggestion of 'Abbas رضی اللہ تعالیٰ عنہ) said: Except rush.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فتح مکہ کے دن فر ما یا : \" اب ہجرت نہیں ہے البتہ جہاد اور نیت باقی ہے اور جب تمھیں نفیر عام ( جہاد میں حا ضری ) کے لیے کہا جا ئے تو نکل پڑو ۔ اور آپ نے فتح مکہ کے دن فر ما یا : بلا شبہ یہ شہر ( ایسا ) ہے جسے اللہ نے ( اس وقت سے ) حرمت عطا کی ہے جب سے اس نے آسمانوں اور زمین کو پیدا کیا ۔ یہ اللہ کی ( عطا کردہ ) حرمت ( کی وجہ ) سے قیامت تک کے لیے محترم ہے اور مجھ سے پہلے کسی ایک کے لیے اس میں لڑا ئی کو حلال قرار نہیں دیا کیا اور میرے لیے بھی دن میں سے ایک گھڑی کے لیے ہی اسے حلال کیا گیا ہے ( اب ) یہ اللہ کی ( عطا کردہ ) حرمت کی وجہ سے قیامت کے دن تک حرا م ہے اس کے کا ٹنے نہ کا ٹے جا ئیں اس کے شکار کو ڈرا کر نہ بھگا یا جا ئے کو ئی شخص اس میں گری ہو ئی چیز کو نہ اٹھا ئے سوائے اس کے جو اس کا اعلا ن کرے ، نیز اس کی گھا س بھی نہ کا ٹی جا ئے ۔ اس پر حضرت عباس رضی اللہ تعالیٰ عنہ نے عرض کی : اے اللہ کے رسول صلی اللہ علیہ وسلم !سوائے اذخر ( خوشبو دار گھا س ) کے وہ ان کے لوہا روں اور گھروں کے لیے ( ضروری ) ہے تو آپ نے فر ما یا : \" سوائے اذخر کے ۔ \"",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم الحنظلی نے بیان کیا، انہوں نے کہا جریر نے ہمیں منصور سے خبر دی انھوں نے مجا ہد سے انھوں نے طاوس سے انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ مُجَاهِدٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْفَتْحِ - فَتْحِ مَكَّةَ - «لَا هِجْرَةَ، وَلَكِنْ جِهَادٌ وَنِيَّةٌ، وَإِذَا اسْتُنْفِرْتُمْ فَانْفِرُوا» وَقَالَ يَوْمَ الْفَتْحِ - فَتْحِ مَكَّةَ - «إِنَّ هَذَا الْبَلَدَ حَرَّمَهُ اللهُ يَوْمَ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ، فَهُوَ حَرَامٌ بِحُرْمَةِ اللهِ إِلَى يَوْمِ الْقِيَامَةِ، وَإِنَّهُ لَمْ يَحِلَّ الْقِتَالُ فِيهِ لِأَحَدٍ قَبْلِي، وَلَمْ يَحِلَّ لِي إِلَّا سَاعَةً مِنْ نَهَارٍ، فَهُوَ حَرَامٌ بِحُرْمَةِ اللهِ إِلَى يَوْمِ الْقِيَامَةِ، لَا يُعْضَدُ شَوْكُهُ، وَلَا يُنَفَّرُ صَيْدُهُ، وَلَا يَلْتَقِطُ إِلَّا مَنْ عَرَّفَهَا، وَلَا يُخْتَلَى خَلَاهَا»، فَقَالَ الْعَبَّاسُ: يَا رَسُولَ اللهِ، إِلَّا الْإِذْخِرَ، فَإِنَّهُ لِقَيْنِهِمْ وَلِبُيُوتِهِمْ، فَقَالَ: «إِلَّا الْإِذْخِرَ».",
                "headingArabic": "تَحْرِيمِ مَكَّةَ وَصَيْدِهَا وَخَلاَهَا وَشَجَرِهَا وَلُقَطَتِهَا إِلاَّ لِمُنْشِدٍ عَلَى الدَّوَام",
                "headingUrdu": "مکہ کی حرمت اور اس کے کھیل، گھاس، درخت اور کھوئی ہوئی جائیداد کی حرمت، سوائے اس کے جو اس کا اعلان کرے، ہمیشہ کے لیے ہے۔",
                "headingEnglish": "The sanctity of Makkah and the sanctity of its game, grasses, trees and lost property, except for the one who announces it, is forever",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10867,
                "hadithNumber": "3303",
                "englishNarrator": "A hadith like this has been narrated on the authority of Mansur, but he did not mention:",
                "hadithEnglish": "On that very day He created the heavens and the earth, and he (the narrator) substituted the word fighting (qital) for killing (qatl), and further said: No one is to pick up the dropped thing except one who makes a public announcement of it.",
                "hadithUrdu": "\" جس دن سے اللہ تعا لیٰ نے آسمانوں اور زمین کو پیدا کیا \" کے الفا ظ ذکر نہیں کیے ۔ \" قتال \" ( لڑائی ) کے بجا ئے \" قتل \" کا لفظ کہا اور کہا \" یہاں کی گری پڑی چیز اس شخص کے سوا جو اس کا اعلا ن کرے ، کو ئی نہ اٹھا ئے ۔ \"",
                "urduNarrator": "مجھ سے محمد بن رافع نے بیان کیا، کہا ہم سے یحییٰ بن آدم نے بیان کیا، انہوں نے بیان کیا مفضل نے ہمیں منصور سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ، انھوں نے",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا مُفَضَّلٌ، عَنْ مَنْصُورٍ، فِي هَذَا الْإِسْنَادِ، بِمِثْلِهِ، وَلَمْ يَذْكُرْ: «يَوْمَ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ»، وَقَالَ: بَدَلَ الْقِتَالِ: «الْقَتْلَ» وَقَالَ: «لَا يَلْتَقِطُ لُقَطَتَهُ إِلَّا مَنْ عَرَّفَهَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10868,
                "hadithNumber": "3304",
                "englishNarrator": "Abu Shuraih al-'Adawi رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "He said to Amr bin Sa'id when he was sending troops to Mecca: Let me tell you something. O Commander, which Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said on the day following, the Conquest which my ears heard and my heart has retained, and my eyes saw as he spoke it. He praised Allah and extolled Him and then said: Allah, not men, has made Mecca sacred; so it is not permissible for any person believing in Allah and the Last Day to shed blood in it, or lop a tree in it. If anyone seeks a concession on the basis of fighting of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), tell him that Allah permitted His Messenger, but not you, and He gave him permission only for an hour on one day, and its sacredness was restored on the very day like that of yesterday. Let him who is present convey the information to him who is absent. It was said to Abu Shuraih رضی اللہ تعالیٰ عنہ : What did Amr say to you? He said: I am better informed of that than you, Abu Shuraih رضی اللہ تعالیٰ عنہ, but the sacred territory does not grant protection to one who is disobedient, or one who runs away after shedding blood, or one who runs away after committing.",
                "hadithUrdu": "انھوں نے عمرو بن سعید سے جب وہ ( ابن زبیر رضی اللہ تعالیٰ عنہ کے خلا ف ) مکہ کی طرف لشکر بھیج رہا تھا کہا : اے امیر ! مجھے اجا زت دیں ۔ میں آپ کو ایک ایسا فرمان بیان کروں جو رسول اللہ صلی اللہ علیہ وسلم نے فتح مکہ کے دوسرے دن ارشاد فر ما یا تھا ۔ اسے میرے دونوں کا نوں نے سنا ، میرے دل نے یا د رکھا اور جب آپ نے اس کے الفا ظ بو لے تو میرے دونوں آنکھوں نے آپ کو دیکھا ۔ آپ نے اللہ تعا لیٰ کی حمد و ثنا بیان کی ، پھر فرمایا : \" بلا شبہ مکہ کو اللہ نے حرمت عطا کی ہے لوگوں نے نہیں ۔ ۔ کسی آدمی کے لیے جو اللہ اور یو آخرت پر ایما ن رکھتا ہو حلال نہیں کہ وہ اس میں خون بہا ئے اور نہ ( یہ حلال ہے کہ ) کسی درخت کو کا ٹے ۔ اگر کو ئی شخص اس میں رسول اللہ صلی اللہ علیہ وسلم کی لڑا ئی کی بنا پر رخصت نکا لے تو اسے کہہ دینا : بلا شبہ اللہ نے اپنے رسول اللہ صلی اللہ علیہ وسلم کو اجا زت دی تھی تمھیں اس کی اجا زت نہیں دی تھی اور آج ہی اس کی حرمت اسی طرح واپس آگئی ہے جیسے کل اس کی حرمت موجود تھی اور جو حا ضر ہے ( یہ بات ) اس تک پہنچا دے جو حا ضر نہیں ۔ اس پر ابو شریح رضی اللہ تعالیٰ عنہ سے کہا گیا : ( جواب میں ) عمرو نے تم سے کیا گہا ؟ ( کہا : ) اس نے جواب دیا : اے ابو شریح !میں یہ بات تم سے زیادہ جا نتا ہوں جرم کسی نافر مان ( باغی ) کو خون کر کے بھا گ آنے والے کو اور چوری کر کے فرار ہو نے والے کو پناہ نہیں دیتا ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ہم سے لیث نے بیان کیا، وہ سعید بن ابی سعید کی سند سے, ابو شریح عدوی رضی اللہ تعالیٰ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِي شُرَيْحٍ الْعَدَوِيِّ، أَنَّهُ قَالَ لِعَمْرِو بْنِ سَعِيدٍ وَهُوَ يَبْعَثُ الْبُعُوثَ إِلَى مَكَّةَ: ائْذَنْ لِي أَيُّهَا الْأَمِيرُ أُحَدِّثْكَ قَوْلًا قَامَ بِهِ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الْغَدَ مِنْ يَوْمِ الْفَتْحِ، سَمِعَتْهُ أُذُنَايَ، وَوَعَاهُ قَلْبِي، وَأَبْصَرَتْهُ عَيْنَايَ حِينَ تَكَلَّمَ بِهِ، أَنَّهُ حَمِدَ اللهَ، وَأَثْنَى عَلَيْهِ، ثُمَّ قَالَ: إِنَّ مَكَّةَ حَرَّمَهَا اللهُ وَلَمْ يُحَرِّمْهَا النَّاسُ، فَلَا يَحِلُّ لِامْرِئٍ يُؤْمِنُ بِاللهِ وَالْيَوْمِ الْآخِرِ أَنْ يَسْفِكَ بِهَا دَمًا، وَلَا يَعْضِدَ بِهَا شَجَرَةً، فَإِنْ أَحَدٌ تَرَخَّصَ بِقِتَالِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِيهَا، فَقُولُوا لَهُ: إِنَّ اللهَ أَذِنَ لِرَسُولِهِ، وَلَمْ يَأْذَنْ لَكُمْ، وَإِنَّمَا أَذِنَ لِي فِيهَا سَاعَةً مِنْ نَهَارٍ، وَقَدْ عَادَتْ حُرْمَتُهَا الْيَوْمَ كَحُرْمَتِهَا بِالْأَمْسِ، وَلْيُبَلِّغِ الشَّاهِدُ الْغَائِبَ ، فَقِيلَ لِأَبِي شُرَيْح: مَا قَالَ لَكَ عَمْرٌو؟ قَالَ: أَنَا أَعْلَمُ بِذَلِكَ مِنْكَ يَا أَبَا شُرَيْح، «إِنَّ الْحَرَمَ لَا يُعِيذُ عَاصِيًا، وَلَا فَارًّا بِدَمٍ، وَلَا فَارًّا بِخَرْبَةٍ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10869,
                "hadithNumber": "3305",
                "englishNarrator": "Abu Huraira, (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "When Allah, the Exalted and Majestic, granted Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) victory over Mecca, he stood before people and praised and extolled Allah and then said: Verily Allah held back the elephants from Mecca and gave the domination of it to His Messenger and believers, and it (this territory) was not violable to anyone before me and it was made violable to me for an hour of a day, and it shall not be violable to anyone after me. So neither molest the game, nor weed out thorns from it. And it is not lawful for anyone to pick up a thing dropped but one who makes public announcement of it. And it a relative of anyone is killed he is entitled to opt for one of two things. Either he should be paid blood-money or he can take life as (a just retribution). 'Abbas (رضی اللہ تعالیٰ عنہ) said: Allah's Messenger, but Idhkhir (a kind of herbage), for we use it for our graves and for our houses, whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: With the exception of Idhkhir. A person known as Abu Shah, one of the people of Yemen, stood up and said: Messenger of Allah, (kindly) write it for me. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said I Write it for Abu Shah. Walid said: I asked al-Auzai': What did his saying mean: Write it for me, Messenger of Allah ? He said: This very address that he had heard from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ).",
                "hadithUrdu": "جب اللہ عزوجل نے رسول اللہ صلی اللہ علیہ وسلم کو مکہ پر فتح عطا کی تو آپ لوگوں میں ( خطبہ دینے کے لیے ) کھڑے ہو ئے اللہ کی حمد و ثنا بیان کی ، پھر فر ما یا : \"\" بلا شبہ اللہ نے ہا تھی کو مکہ سے رو ک دیا ۔ اور اپنے رسول اور مومنوں کو اس پر تسلط عطا کیا ، مجھ سے پہلے یہ ہر گز کسی کے لیے حلال نہ تھا میرے لیے دن کی ایک گھڑی کے لیے حلال کیا گیا ۔ اور میرے بعد یہ ہر گز کسی کے لیے حلال نہ ہو گا ۔ اس لیے نہ اس کے شکار کو ڈرا کر بھگا یا جا ئے اور نہ اس کے کا نٹے ( دار درخت ) کا ٹے جا ئیں ۔ اور اس میں گری پڑی کو ئی چیز اٹھا نا اعلان کرنے والے کے سواکسی کے لیے حلال نہیں ۔ اور جس کا کو ئی قریبی ( عزیز ) قتل کر دیا جا ئے اس کے لیے دو صورتوں میں سے وہ ہے جو ( اس کی نظر میں ) بہتر ہو : یا اس کی دیت دی جا ئے یا ( قاتل ) قتل کیا جا ئے ۔ اس پر حضرت عباس رضی اللہ تعالیٰ عنہ نے کہا : اے اللہ کے رسول صلی اللہ علیہ وسلم !اذخر کے سوا ہم اسے اپنی قبروں ( کی سلوں کی درزوں ) اور گھروں ( کی چھتوں ) میں استعمال کرتے ہیں ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \"\" اذخر کے سوا ۔ اس پر اہل یمن میں سے ایک آدمی ابو شاہ کھڑے ہو ئے اور کہا : اے اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! ( یہ سب ) میرے لیے لکھوادیجیے تو رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \"\" ابو شاہ کے لیے لکھ دو ۔ ولید نے کہا : میں نے اوزاعی سے پو چھا : اس ( یمنی ) کا یہ کہنا \"\" اے اللہ کے رسول صلی اللہ علیہ وسلم ! مجھے لکھوا دیں ۔ ( اس سے مراد ) کیا تھا؟ انھوں نے کہا : یہ خطبہ ( مراد تھا ) جو اس نے رسول اللہ صلی اللہ علیہ وسلم سے سنا تھا ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب اور عبید اللہ بن سعید سب نے ولید کی سند سے بیان کیا: انہوں نے ہم سے بیان کیا ولید بن مسلم نے ہمیں حدیث بیان کی ، ( کہا ) ہمیں اوزاعی نے حدیث سنا ئی ۔ ( کہا : ) مجھے یحییٰ بن ابی کثیر نے حدیث سنا ئی ۔ ( کہا : ) مجھے ابو سلمہ بن عبد الرحمٰن نے اور ( انھوں نے کہا ) مجھے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ نے حدیث بیا ن کی ، انھو ں ںےکہا",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَعُبَيْدُ اللهِ بْنُ سَعِيدٍ، جَمِيعًا عَنِ الْوَلِيدِ، قَالَ زُهَيْرٌ: حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا الْأَوْزَاعِيُّ، حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، حَدَّثَنِي أَبُو سَلَمَةَ هُوَ ابْنُ عَبْدِ الرَّحْمَنِ، حَدَّثَنِي أَبُو هُرَيْرَةَ قَالَ: لَمَّا فَتَحَ اللهُ عَزَّ وَجَلَّ عَلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مَكَّةَ، قَامَ فِي النَّاسِ، فَحَمِدَ اللهَ وَأَثْنَى عَلَيْهِ. ثُمَّ قَالَ: إِنَّ اللهَ حَبَسَ عَنْ مَكَّةَ الْفِيلَ، وَسَلَّطَ عَلَيْهَا رَسُولَهُ وَالْمُؤْمِنِينَ، وَإِنَّهَا لَنْ تَحِلَّ لِأَحَدٍ كَانَ قَبْلِي، وَإِنَّهَا أُحِلَّتْ لِي سَاعَةً مِنْ نَهَارٍ، وَإِنَّهَا لَنْ تَحِلَّ لِأَحَدٍ بَعْدِي، فَلَا يُنَفَّرُ صَيْدُهَا، وَلَا يُخْتَلَى شَوْكُهَا، وَلَا تَحِلُّ سَاقِطَتُهَا إِلَّا لِمُنْشِدٍ، وَمَنْ قُتِلَ لَهُ قَتِيلٌ فَهُوَ بِخَيْرِ النَّظَرَيْنِ: إِمَّا أَنْ يُفْدَى، وَإِمَّا أَنْ يُقْتَلَ ، فَقَالَ الْعَبَّاسُ: إِلَّا الْإِذْخِرَ يَا رَسُولَ اللهِ، فَإِنَّا نَجْعَلُهُ فِي قُبُورِنَا وَبُيُوتِنَا، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِلَّا الْإِذْخِرَ» فَقَامَ أَبُو شَاهٍ - رَجُلٌ مِنْ أَهْلِ الْيَمَنِ - فَقَالَ: اكْتُبُوا لِي يَا رَسُولَ اللهِ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «اكْتُبُوا لِأَبِي شَاهٍ»، قَالَ الْوَلِيدُ: فَقُلْتُ لِلْأَوْزَاعِيِّ: مَا قَوْلُهُ: اكْتُبُوا لِي يَا رَسُولَ اللهِ؟ قَالَ: «هَذِهِ الْخُطْبَةَ الَّتِي سَمِعَهَا مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10870,
                "hadithNumber": "3306",
                "englishNarrator": "Abu Huraira (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "The people of the Khuza'ah tribe killed a man of the tribe of Laith in the Year of Victory as a retaliation for one whom they had killed (whom the people of the tribe of Laith had killed). It was reported to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). He mounted his camel and delivered this address: Verily Allah, the Exalted and Majestic, held back the Elephants from Mecca, and gave its domination to His Messenger and believers. Behold, it was not violable for anyone before me and it will not be violable for anyone after me. Behold, it was made violable for me for an hour of a day; and at this very hour it has again been made inviolable (for me as well as for others). So its thorns are not to be cut, its trees are not to be lopped, and (no one is allowed to) pick up a thing dropped, but the one who makes an announcement of it. And one whose fellow is killed is allowed to opt between two alternatives: either he should receive blood-money or get the life of the (murderer) in return. He (the narrator said): A person from the Yemen, who was called Abu Shah, came to him and said: Messenger of Allah, write it down for me, whereupon he (Allah's Messenger) said: Write it down for Abu Shah. One of the persons from among the Quraish also said: Except Idhkhir, for we use it in our houses ant our graves. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Except Idhkhir.",
                "hadithUrdu": "فتح مکہ کے سال خزاعہ نے بنو لیث کا ایک آدمی اپنے ایک مقتول کے بدلے میں جسے انھوں نے ( بنولیث ) نے قتل کیا تھا قتل کر دیا ۔ رسول اللہ صلی اللہ علیہ وسلم کو اس کی خبر دی گئی تو آپ اپنی سواری پر بیٹھے اور خطبہ ارشاد فر ما یا : \" بلا شبہ اللہ عزوجل نے ہا تھی کو مکہ ( پر حملے ) سے روک دیا جبکہ اپنے رسول اللہ صلی اللہ علیہ وسلم اور مومنوں کو اس پر تسلط عطا کیا ۔ مجھ سے پہلے یہ کسی کے لیے حلال نہیں تھا اور میرے بعد بھی ہر گز کسی کے لیے حلال نہ ہو گا ۔ سن لو!یہ میرے لیے دن کی ایک گھڑی بھر حلال کیا گیا تھا اور ( اب ) یہ میری اس موجودہ گھڑی میں بھی حرمت والا ہے نہ ڈنڈے کے ذریعے سے اس کے کانٹے جھا ڑے جا ئیں نہ اس کے درخت کا ٹے جائیں اور نہ ہی اعلان کرنے والے کے سوا اس میں گری ہو ئی چیز اٹھا ئے اور جس کا کو ئی قریبی قتل کر دیا گیا اس کے لیے دو صورتوں میں سے وہ ہے جو ( اس کی نظر میں ) بہتر ہو : ہا سے عطا کر دیا جا ئے ۔ یعنی خون بہا ۔ ۔ ۔ یا مقتول کے گھر والوں کو اس سے بدلہ لینے دیا جا ئے ۔ کہا : تو اہل یمن میں سے ایک آدمی آیا جسے ابو شاہ کہا جا تا تھا اس نے کہا : اللہ کے رسول صلی اللہ علیہ وسلم ! مجھے لکھوا دیں آپ نے فر ما یا : \" ابو شاہ کو لکھ دو ۔ قریش کے ایک آدمی نے عرض کی : اذخر کے سوا ، ( کیونکہ ) ہم اسے اپنے گھروں اور اپنی قبروں میں استعمال کرتے ہیں تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اذخر کے سوا ۔",
                "urduNarrator": "مجھ سے اسحاق بن منصور نے بیان کیا، ہم سے عبید اللہ بن موسیٰ نے بیان کیا, شیبان نے یحییٰ سے روایت کی ، ( کہا : ) مجھے ابو سلمہ نے خبر دی ، انھوں نے حجرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے سنا وہ کہہ رہے تھے",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا عُبَيْدُ اللهِ بْنُ مُوسَى، عَنْ شَيْبَانَ، عَنْ يَحْيَى، أَخْبَرَنِي أَبُو سَلَمَةَ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ: إِنَّ خُزَاعَةَ قَتَلُوا رَجُلًا مِنْ بَنِي لَيْثٍ عَامَ فَتْحِ مَكَّةَ بِقَتِيلٍ مِنْهُمْ قَتَلُوهُ، فَأُخْبِرَ بِذَلِكَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَرَكِبَ رَاحِلَتَهُ، فَخَطَبَ، فَقَالَ: إِنَّ اللهَ عَزَّ وَجَلَّ حَبَسَ عَنْ مَكَّةَ الْفِيلَ، وَسَلَّطَ عَلَيْهَا رَسُولَهُ وَالْمُؤْمِنِينَ، أَلَا وَإِنَّهَا لَمْ تَحِلَّ لِأَحَدٍ قَبْلِي، وَلَنْ تَحِلَّ لِأَحَدٍ بَعْدِي، أَلَا وَإِنَّهَا أُحِلَّتْ لِي سَاعَةً مِنَ النَّهَارِ، أَلَا وَإِنَّهَا سَاعَتِي هَذِهِ حَرَامٌ، لَا يُخْبَطُ شَوْكُهَا، وَلَا يُعْضَدُ شَجَرُهَا، وَلَا يَلْتَقِطُ سَاقِطَتَهَا إِلَّا مُنْشِدٌ، وَمَنْ قُتِلَ لَهُ قَتِيلٌ فَهُوَ بِخَيْرِ النَّظَرَيْنِ: إِمَّا أَنْ يُعْطَى - يَعْنِي الدِّيَةَ -، وَإِمَّا أَنْ يُقَادَ - أَهْلُ الْقَتِيلِ - ، قَالَ: فَجَاءَ رَجُلٌ مِنْ أَهْلِ الْيَمَنِ يُقَالُ لَهُ أَبُو شَاهٍ، فَقَالَ: اكْتُبْ لِي يَا رَسُولَ اللهِ، فَقَالَ: «اكْتُبُوا لِأَبِي شَاهٍ»، فَقَالَ رَجُلٌ مِنْ قُرَيْشٍ: إِلَّا الْإِذْخِرَ، فَإِنَّا نَجْعَلُهُ فِي بُيُوتِنَا وَقُبُورِنَا، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِلَّا الْإِذْخِرَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10871,
                "hadithNumber": "3307",
                "englishNarrator": "Jabir (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "I heard Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) say: It is not permissible for any one of you to carry weapons in Mecca.",
                "hadithUrdu": "میں نے نبی صلی اللہ علیہ وسلم سے سنا ، آپ فر ما رہے تھے \" تم میں سے کسی کے لیے مکہ میں اسلحہ اٹھا نا حلال نہیں ۔",
                "urduNarrator": "مجھ سے سلمہ بن شبیب نے بیان کیا، کہا ہم سے ابن اعین نے بیان کیا، کہا ہم سے معقل نے بیان کیا، ابو الزبیر رضی اللہ عنہ سے, حضرت جا بر رضی اللہ تعالیٰ عنہ سے روایت ہے انھوں نے کہا",
                "hadithArabic": "حَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا ابْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ: سَمِعْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا يَحِلُّ لِأَحَدِكُمْ أَنْ يَحْمِلَ بِمَكَّةَ السِّلَاحَ».",
                "headingArabic": "النَّهْىِ عَنْ حَمْلِ السِّلاَحِ، بِمَكَّةَ بِلاَ حَاجَةٍ ‏‏",
                "headingUrdu": "مکہ مکرمہ میں اسلحہ لے جانے کی ممانعت جب اس کی ضرورت نہ ہو۔",
                "headingEnglish": "The prohibition of carrying weapons in Makkah when there is no need for that",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10872,
                "hadithNumber": "3308",
                "englishNarrator": "Anas bin Malik ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) entered Mecca in the Year of Victory with a helmet on his head; and when he took it off, a man came to him and said: Ibn Khatal is hanging on to the curtains of the Ka'ba, whereupon he said: Kill him. Malik (said): 'Yes'\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم فتح کے سال مکہ میں دا خل ہو ئے اور آپ کے سر مبارک پر خود تھا جب آپ نے اسے اتارا تو آپ کے پاس ایک آدمی آیا اور کہنے لگا : ابن خطل کعبہ کے پردوں سے چمٹا ہوا ہے آپ نے فر ما یا : \" اے قتل کر دو ؟تو امام مالک نے جوا ب دیا ۔ : ہا ں.",
                "urduNarrator": "عبد اللہ بن مسلمہ قعنبی یحییٰ بن یحییٰ اور قتیبہ بن سعید نے ہمیں حدیث بیان کی ، قعنبی نے کہا : میں نے امام مالک کے سامنے قراءت کی قتیبہ نے کہا : ہم سے امام مالک نے حدیث بیان کی اور یحییٰ نے کہا ۔ ۔ ۔ الفا ظ انھی کے ہیں میں نے امام مالک سے پو چھا : کیا بن شہاب نے آپ کو حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے حدیث بیان کی ہے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ، وَيَحْيَى بْنُ يَحْيَى، وَقُتَيْبَةُ بْنُ سَعِيدٍ، أَمَّا الْقَعْنَبِيُّ، فَقَالَ: قَرَأْتُ عَلَى مَالِكِ بْنِ أَنَسٍ، وَأَمَّا قُتَيْبَةُ، فَقَالَ حَدَّثَنَا مَالِكٌ، وقَالَ يَحْيَى: وَاللَّفْظُ لَهُ، قُلْتُ لِمَالِكٍ: أَحَدَّثَكَ ابْنُ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ دَخَلَ مَكَّةَ عَامَ الْفَتْحِ وَعَلَى رَأْسِهِ مِغْفَرٌ، فَلَمَّا نَزَعَهُ جَاءَهُ رَجُلٌ، فَقَالَ: ابْنُ خَطَلٍ مُتَعَلِّقٌ بِأَسْتَارِ الْكَعْبَةِ، فَقَالَ: «اقْتُلُوهُ»، فَقَالَ مَالِكٌ: نَعَمْ.",
                "headingArabic": "جَوَازِ دُخُولِ مَكَّةَ بِغَيْرِ إِحْرَامٍ ‏‏",
                "headingUrdu": "مکہ مکرمہ میں بغیر احرام کے داخل ہونا جائز ہے۔",
                "headingEnglish": "It is permissible to enter Makkah without Ihram",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10873,
                "hadithNumber": "3309",
                "englishNarrator": "Jabir bin 'Abdullah al-Ansari (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) entered Mecca and Qutaiba (another narrator) stated that he entered Mecca in the Year of Victory, wearing a black turban, but not wearing the Ihram. Abu Zubair ( رضی اللہ تعالیٰ عنہ) narrated to us a Hadith from Hazrat Jabir (رضی اللہ تعالیٰ عنہ).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم مکہ میں دا خل ہوئے ۔ ۔ ۔ قتیبہ نے کہا : فتح مکہ کے دن ۔ ۔ ۔ بغیر احرا م کے داخل ہو ئے اور آپ ( کے سر مبا رک ) پر سیا ہ عمامہ تھا ۔ قتیبہ کی روایت میں ہے ( معاویہ بن عمار نے ) کہا : ہمیں ابو زبیر رضی اللہ تعالیٰ عنہ نے حضرت جا بر رضی اللہ تعالیٰ عنہ سے حدیث بیان کی ۔",
                "urduNarrator": "یحییٰ بن یحییٰ تمیمی اور قتیبہ بن سعید چقفی نے ہمیں حدیث بیان کی ۔ ۔ ۔ یحییٰ نے کہا : ہمیں معاویہ بن عمار دہنی نے ابو زبیر سے خبر دی اور قتیبہ نے کہا : ہمیں حدیث بیان کی ۔ ۔ ۔ انھوں نے جا بر بن عبد اللہ  انصاری رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَقُتَيْبَةُ بْنُ سَعِيدٍ الثَّقَفِيُّ، قَالَ يَحْيَى: أَخْبَرَنَا، وقَالَ قُتَيْبَةُ: حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمَّارٍ الدُّهْنِيُّ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ الْأَنْصَارِيِّ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ دَخَلَ مَكَّةَ - وَقَالَ قُتَيْبَةُ: دَخَلَ يَوْمَ فَتْحِ مَكَّةَ - وَعَلَيْهِ عِمَامَةٌ سَوْدَاءُ بِغَيْرِ إِحْرَامٍ ، وَفِي رِوَايَةِ قُتَيْبَةَ، قَالَ: حَدَّثَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10874,
                "hadithNumber": "3310",
                "englishNarrator": "Jabir bin Abdullah رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) entered on the day of Victory of Mecca wearing a black turban on his head.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم فتح مکہ کے دن دا خل ہو ئے تو آپ ( کے سرمبارک ) پر سیا ہ رنگ کا عمامہ تھا ۔",
                "urduNarrator": "ہم سے علی بن حکیم الاودی نے بیان کیا، انہوں نے بیان کیا شریک نے ہمیں عمار دہنی سے خبر دی انھوں نے ابو زبیر سے انھوں نے جا بر بن عبد اللہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ حَكِيمٍ الْأَوْدِيُّ، أَخْبَرَنَا شَرِيكٌ، عَنْ عَمَّارٍ الدُّهْنِيِّ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، «أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ دَخَلَ يَوْمَ فَتْحِ مَكَّةَ، وَعَلَيْهِ عِمَامَةٌ سَوْدَاءُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10875,
                "hadithNumber": "3311",
                "englishNarrator": "Amr bin Huraith reported on the authority of his father:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) addressed the people (on the day of the Victory of Mecca) with a black turban on his head.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے لوگوں کو خطبہ دیا جبکہ آپ ( کے سر مبارک ) پر سیاہ عمامہ تھا ۔",
                "urduNarrator": "وکیع نے ہمیں مساوروراق سے خبردی ، انھوں نے جعفر بن عمرو بن حریث سے انھوں نے اپنے والد ( عمرہ بن حریث بن عمرو مخزومی رضی اللہ تعالیٰ عنہ ) سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَا: أَخْبَرَنَا وَكِيعٌ، عَنْ مُسَاوِرٍ الْوَرَّاقِ، عَنْ جَعْفَرِ بْنِ عَمْرِو بْنِ حُرَيْثٍ، عَنْ أَبِيهِ، «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ خَطَبَ النَّاسَ وَعَلَيْهِ عِمَامَةٌ سَوْدَاءُ»",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10876,
                "hadithNumber": "3312",
                "englishNarrator": "Ja'far bin 'Amr bin Huraith رضی اللہ تعالیٰ عنہ reported his father as saying:",
                "hadithEnglish": "As if I am seeing Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) on the pulpit with a black turban on his head, and its two ends hanging between his shoulders. Abu Bakr (another narrator) did not make mention of: Upon the pulpit .",
                "hadithUrdu": "جیسے میں ( اب بھی ) رسول اللہ صلی اللہ علیہ وسلم کو منبر پر دیکھ رہا ہوں ، آپ ( کے سر مبارک ) پر سیاہ عمامہ ہے آپ نے اس کے دونوں کناروں کو اپنے دونوں کندھوں کے درمیا ن لٹکا یا ہوا ہے ابو بکر ( بن ابی شیبہ ) نے \" منبرپر \" کے الفاظ نہیں کہے ۔",
                "urduNarrator": "ابو بکر بن ابی شیبہ اور حسن حلوانی نے ہمیں حدیث بیان کی دونوں نے کہا : ہمیں ابو اسامہ نے مساور وراق سے حدیث بیان کی ۔ کہا : مجھے حدیث بیان کی ( جعفر بن عمرو نے ) اور حلوانی کی روایت میں ہے کہا : میں نے جعفر بن عمرو بن حریث سے سنا ۔ ۔ ۔ انھوں نے اپنے والد ( عمرہ بن حریث رضی اللہ تعالیٰ عنہ ) سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَالْحَسَنُ الْحُلْوَانِيُّ، قَالَا: حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ مُسَاوِرٍ الْوَرَّاقِ، قَالَ: حَدَّثَنِي، وَفِي رِوَايَةِ الْحُلْوَانِيِّ، قَالَ: سَمِعْتُ جَعْفَرَ بْنَ عَمْرِو بْنِ حُرَيْثٍ، عَنْ أَبِيهِ، قَالَ: «كَأَنِّي أَنْظُرُ إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ، وَعَلَيْهِ عِمَامَةٌ سَوْدَاءُ، قَدْ أَرْخَى طَرَفَيْهَا بَيْنَ كَتِفَيْهِ»، وَلَمْ يَقُلْ أَبُو بَكْرٍ: عَلَى الْمِنْبَرِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10877,
                "hadithNumber": "3313",
                "englishNarrator": "Abdullah bin Zaid bin 'Asim (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Verily Ibrahim declared Mecca sacred and supplicated (for blessings to be showered) upon its inhabitants, and I declare Medina to be sacred as lbrahim had declared Mecca to be sacred. I have supplicated (Allah for His blessings to be showered) in its sa' and its mudd (two standards of weight and measurement) twice as did Ibrahim for the inhabitants of Mecca.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" بلا شبہ ابرا ہیم ؑنے مکہ کو حرم قرار دیا اور اس کے رہنے والوں کے لیے دعا کی اور میں نے مدینہ کو حرم قرار دیا جیسے ابرا ہیم ؑ نے مکہ کو حرم قراردیا تھا اور میں نے اس کے صاع اور مد میں سے دگنی ( بر کت ) کی دعا کی جتنی ابرا ہیم ؑنے اہل مکہ کے لیے کی تھی ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، انہوں نے بیان کیا عبد العزیز یعنی محمد دراوردی کے بیٹے نے عمرو بن یحییٰ مازنی سے حدیث بیان کی انھوں نے عباد بن تمیم سے انھوں نے اپنے چچا عبد اللہ بن زید عاصم رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُحَمَّدٍ الدَّرَاوَرْدِيَّ، عَنْ عَمْرِو بْنِ يَحْيَى الْمَازِنِيِّ، عَنْ عَبَّادِ بْنِ تَمِيمٍ، عَنْ عَمِّهِ عَبْدِ اللهِ بْنِ زَيْدِ بْنِ عَاصِمٍ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ إِبْرَاهِيمَ حَرَّمَ مَكَّةَ وَدَعَا لِأَهْلِهَا، وَإِنِّي حَرَّمْتُ الْمَدِينَةَ كَمَا حَرَّمَ إِبْرَاهِيمُ مَكَّةَ، وَإِنِّي دَعَوْتُ فِي صَاعِهَا وَمُدِّهَا بِمِثْلَيْ مَا دَعَا بِهِ إِبْرَاهِيمُ لِأَهْلِ مَكَّةَ».",
                "headingArabic": "فَضْلِ الْمَدِينَةِ وَدُعَاءِ النَّبِيِّ صلى الله عليه وسلم فِيهَا بِالْبَرَكَةِ وَبَيَانِ تَحْرِيمِها وَتَحْرِيمِ صَيْدِهَا وَشَجَرِهَا وَبَيَانِ حُدُودِ حَرَمِهَا",
                "headingUrdu": "مدینہ منورہ کی فضیلت اور اس کے لیے نبی صلی اللہ علیہ وسلم کی دعا۔ اس کی حرمت اور اس کے کھیل اور درختوں کی حرمت۔ اس کے حرم کی حدود",
                "headingEnglish": "The virtue of Al-Madinah and the Prophet's Prayer for it to be blessed. Its sanctity and the sanctity of its game and trees. The Boundaries of its sanctuary",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10878,
                "hadithNumber": "3314",
                "englishNarrator": "It was narrated from Amr bin Yahya-Al-Mazini with this chain (a Hadith similar to no. 3313). As for the Hadith of Wuhaib, it is like to report of Ad-Darawrdi:",
                "hadithEnglish": "Twice the supplication of Ibrahim peace and blessing be upon him.\" As for Sulaiman bin Bilal and Abdul Aziz bin AL-Mukhtar, in their report it says: \"Like that for which Ibrahim supplication.\"",
                "hadithUrdu": "\" اس سے دگنی ( بر کت ) کی جتنی بر کت کی برا ہیمؑ نے دعا کی تھی \" جبکہ سلیمان بن بلال اور عبد العزیز بن مختار دونوں کی روایت میں ہے \" جتنی ( برکت کی ) ابرا ہیمؑ نے دعا کی تھی ۔",
                "urduNarrator": "مجھ سے ابو کامل الجہدری نے بیان کیا، انہوں نے ہم سے بیان کیا عبدالعزیز یعنی ابن مختار سلیمان بن بلال اور وہیب ( بن خالد باہلی ) سب نے عمرو بن یحییٰ مازنی سے اسی سند کے ساتھ حدیث بیان کی وہیب کی حدیث درااوردی کی حدیث کی طرح ہے",
                "hadithArabic": "وحَدَّثَنِيهِ أَبُو كَامِلٍ الْجَحْدَرِيُّ، حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ الْمُخْتَارِ، ح وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنِي سُلَيْمَانُ بْنُ بِلَالٍ، ح وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا الْمَخْزُومِيُّ، حَدَّثَنَا وُهَيْبٌ، كُلُّهُمْ عَنْ عَمْرِو بْنِ يَحْيَى هُوَ الْمَازِنِيُّ، بِهَذَا الْإِسْنَادِ. أَمَّا حَدِيثُ وُهَيْبٍ فَكَرِوَايَةِ الدَّرَاوَرْدِيِّ: «بِمِثْلَيْ مَا دَعَا بِهِ إِبْرَاهِيمُ»، وَأَمَّا سُلَيْمَانُ بْنُ بِلَالٍ، وَعَبْدُ الْعَزِيزِ بْنُ الْمُخْتَارِ فَفِي رِوَايَتِهِمَا: «مِثْلَ مَا دَعَا بِهِ إِبْرَاهِيمُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10879,
                "hadithNumber": "3315",
                "englishNarrator": "Rafi' bin Khadij رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Ibrahim declared Mecca as sacred and I declare sacred the area between its two stony grounds (lava lands by which he meant Medina).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" بلا شبہ حضرت ابرا ہیم ؑ نے مکہ کو حرم ٹھہرا یا اور میں اس ( شہر ) کی دونوں سیاہ پتھر زمینوں کے درمیان میں واقع حصے کو حرم قرار دیتا ہوں ۔ ۔ ۔ آپ صلی اللہ علیہ وسلم کی مراد مدینہ تھا ۔ ۔ ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ان سے بکر، یعنی ابن مدر نے، کہا ہم سے ابن الحاد نے بیان کیا، وہ ابوبکر بن محمد کی سند سے, عبد اللہ بن عمرو بن عثمان نے رافع بن خدیج رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا بَكْرٌ يَعْنِي ابْنَ مُضَرَ، عَنِ ابْنِ الْهَادِ، عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدٍ، عَنْ عَبْدِ اللهِ بْنِ عَمْرِو بْنِ عُثْمَانَ، عَنْ رَافِعِ بْنِ خَدِيجٍ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ إِبْرَاهِيمَ حَرَّمَ مَكَّةَ، وَإِنِّي أُحَرِّمُ مَا بَيْنَ لَابَتَيْهَا» يُرِيدُ الْمَدِينَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10880,
                "hadithNumber": "3316",
                "englishNarrator": "Nafi' bin Jubair reported:",
                "hadithEnglish": "Marwan bin al-Hakam addressed people and made mention of Mecca and its inhabitants and its sacredness, but he made no mention of Medina, its inhabitants and its sacredness. Rafi' bin Khadij رضی اللہ تعالیٰ عنہ called to him and said: What is this that I hear you making mention of Mecca and its inhabitants and its sacredness, but you did not make mention of Medina and its inhabitants and its sacredness, while the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) has also declared sacred (the area) between its two lava lands (Medina)? And (we have record of this) with us written on Khaulani parchment. If you like, I can read it out to you. Thereupon Marwan became silent, and then Said: I too have heard some part of it.",
                "hadithUrdu": "مروان بن حکم نے لوگون کو خطا ب کیا ، اس نے مکہ کے باشبدوں اور اس کی حرمت کا تذکرہ کیا اور مدینہ اس کے باشندوں اور اس کی حرمت کا تذکرہ نہ کیاتو رافع بن خدیج رضی اللہ تعالیٰ عنہ نے بلند آواز سے اس کو مخا طب کیا اور کہا : کیا ہوا ہے ؟ میں سن رہا ہوں کہ تم نے مکہ اس کے باشندوں اور اس کی حرمت کا تذکرہ کیا لیکن مدینہ اس کے باشندوں اور اس کی حرمت کا تذکرہ نہیں کیا ، حالانکہ رسول اللہ صلی اللہ علیہ وسلم نے اس کے دونوں سیاہ پتھروں والی زمینوں کے درمیان میں واقع علا قے کو حرم قرار دیا ہے اور ( آپ صلی اللہ علیہ وسلم کا ) وہ فر ما ن خولانی چمڑے میں ہمارے پاس محفوظ ہے ۔ اگر تم چاہو تو اسے میں تمھیں پڑھا دوں ۔ اس پر مروان خاموش ہوا پھر کہنے لگا : اس کا کچھ حصہ میں نے بھی سنا ہے.",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ بن قعنب نے بیان کیا، کہا ہم سے سلیمان بن بلال نے بیان کیا، وہ عتبہ بن مسلمہ سے, نافع بن جبیر سے روایت ہے کہ",
                "hadithArabic": "وحَدَّثَنَا عَبْدُ اللهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ، عَنْ عُتْبَةَ بْنِ مُسْلِمٍ، عَنْ نَافِعِ بْنِ جُبَيْرٍ، أَنَّ مَرْوَانَ بْنَ الْحَكَمِ، خَطَبَ النَّاسَ، فَذَكَرَ مَكَّةَ وَأَهْلَهَا وَحُرْمَتَهَا، وَلَمْ يَذْكُرِ الْمَدِينَةَ وَأَهْلَهَا وَحُرْمَتَهَا، فَنَادَاهُ رَافِعُ بْنُ خَدِيجٍ، فَقَالَ: «مَا لِي أَسْمَعُكَ ذَكَرْتَ مَكَّةَ وَأَهْلَهَا وَحُرْمَتَهَا، وَلَمْ تَذْكُرِ الْمَدِينَةَ وَأَهْلَهَا وَحُرْمَتَهَا، وَقَدْ حَرَّمَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مَا بَيْنَ لَابَتَيْهَا»، وَذَلِكَ عِنْدَنَا فِي أَدِيمٍ خَوْلَانِيٍّ إِنْ شِئْتَ أَقْرَأْتُكَهُ، قَالَ: فَسَكَتَ مَرْوَانُ، ثُمَّ قَالَ: قَدْ سَمِعْتُ بَعْضَ ذَلِكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10881,
                "hadithNumber": "3317",
                "englishNarrator": "Jabir (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Ibrahim declared Mecca as sacred; I declare Medina, that between the two mountains, as inviolable. No tree should be lopped and no game is to be molested.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر مایا : \" بلا شبہ ابرا ہیم ؑ نے مکہ کو حرم قرار دیا اور میں مدینہ کو جو ان دو سیاہ پتھر یلی زمینوں کے درمیان ہے حرم قرار دیتا ہوں ، نہ اس کے کا نٹے دار درخت کا ٹے جا ئیں اور نہ اس کے شکار کے جا نوروں کا شکار کیا جا ئے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور عمرو ناقد نے بیان کیا، دونوں نے ابو بکر کی سند سے کہا: ہم سے محمد بن عبداللہ نے بیان کیا۔ ہم سے اسدی، سفیان نے ابو الزبیر کی سند سے بیان کیا, حضرت جا بر رضی اللہ تعالیٰ عنہ سے روایت ہے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، كِلَاهُمَا عَنْ أَبِي أَحْمَدَ، قَالَ أَبُو بَكْرٍ: حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ الْأَسْدِيُّ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ: قَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ إِبْرَاهِيمَ حَرَّمَ مَكَّةَ، وَإِنِّي حَرَّمْتُ الْمَدِينَةَ مَا بَيْنَ لَابَتَيْهَا، لَا يُقْطَعُ عِضَاهُهَا، وَلَا يُصَادُ صَيْدُهَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10882,
                "hadithNumber": "3318",
                "englishNarrator": "Amir bin Sa'd reported on the authority of his father ( رضی اللہ تعالیٰ عنہ):",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: I have declared sacred the territory between the two lava plains of Medina, so its trees should not be cut down, or its game killed; and he also said: Medina is best for them if they knew. No one leaves it through dislike of it without Allah putting in it someone better than he in place of him; and no one will stay there in spite of its hardships and distress without my being an intercessor or witness on behalf of him on the Day of Resurrection.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" میں مدینہ کی دو سیاہ پتھریلی زمینوں کے درمیانی حصے کو حرا م ٹھہرا تا ہوں کہ اس کے کا نٹے دار درخت کاٹے جا ئیں یا اس میں شکار کو مارا جا ئے ۔ اور آپ نے فر ما یا : \" اگر یہ لو گ جا ن لیں تو مدینہ ان کے لیے سب سے بہتر جگہ ہے ۔ کو ئی بھی آدمی اس سے بے رغبتی کرتے ہو ئے اسے چھوڑ کر نہیں جا تا مگر اس کے بدلے میں اللہ تعا لیٰ ایسا شخص اس میں لے آتا ہے جو اس ( جا نے والے ) سے بہتر ہو تا ہے اور کو ئی شخص اس کی تنگدستی اور مشقت پر ثابت قدم نہیں رہتا مگر میں قیامت کے دن اس کے لیے سفارشی یاگواہ ہوں گا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, عبد اللہ بن نمیر نے کہا : ہمیں عثمان بن حکیم نے حدیث بیان کی ( کہا ) ۔ مجھ سے عامر بن سعد نے اپنے والد ( سعد بن ابی وقاص رضی اللہ تعالیٰ عنہ ) سے حدیث بیان کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللهِ بْنُ نُمَيْرٍ، ح وحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عُثْمَانُ بْنُ حَكِيمٍ، حَدَّثَنِي عَامِرُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنِّي أُحَرِّمُ مَا بَيْنَ لَابَتَيِ الْمَدِينَةِ أَنْ يُقْطَعَ عِضَاهُهَا، أَوْ يُقْتَلَ صَيْدُهَا»، وَقَالَ: «الْمَدِينَةُ خَيْرٌ لَهُمْ لَوْ كَانُوا يَعْلَمُونَ، لَا يَدَعُهَا أَحَدٌ رَغْبَةً عَنْهَا إِلَّا أَبْدَلَ اللهُ فِيهَا مَنْ هُوَ خَيْرٌ مِنْهُ، وَلَا يَثْبُتُ أَحَدٌ عَلَى لَأْوَائِهَا وَجَهْدِهَا إِلَّا كُنْتُ لَهُ شَفِيعًا، أَوْ شَهِيدًا يَوْمَ الْقِيَامَةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10883,
                "hadithNumber": "3319",
                "englishNarrator": "Amir bin Sa'd bin Abu Waqqas reported on the authority of his father (Allah be pleased with him):",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said, and then the (above-mentioned) hadith was narrated with this addition: None should nurse ill-will towards the people of Medina, or Allah will melt him in fire like the melting of lead or the dissolution of salt in water.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا ۔ ۔ ۔ پھر ابن نمیر کی حدیث کی طرح بیان کیا اور حدیث میں ان الفاظ کا اضافہ کیا : \" اور کو ئی شخص نہیں جو اہل مدینہ کے ساتھ برا ئی کا ارادہ کرے گا مگر اللہ تعا لیٰ اسے آگ میں سیسے کے پگھلنے یاپانی میں نمک کے پگھلنے کی طرح پگھلا دے گا ۔",
                "urduNarrator": "ہم سے ابن ابی عمر نے بیان کیا، انہوں نے کہا مروان بن معاویہ نے ہمیں حدیث بیان کی ( کہا : ) ہمیں عثمان بن حکیم انصاری نے حدیث بیان کی ، ( کہا : ) مجھے عامر بن سعد بن ابی وقاص نے اپنے والد سے خبر دی کہ",
                "hadithArabic": "وحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، حَدَّثَنَا عُثْمَانُ بْنُ حَكِيمٍ الْأَنْصَارِيُّ، أَخْبَرَنِي عَامِرُ بْنُ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: ثُمَّ ذَكَرَ مِثْلَ حَدِيثِ ابْنِ نُمَيْرٍ، وَزَادَ فِي الْحَدِيثِ: «وَلَا يُرِيدُ أَحَدٌ أَهْلَ الْمَدِينَةِ بِسُوءٍ إِلَّا أَذَابَهُ اللهُ فِي النَّارِ ذَوْبَ الرَّصَاصِ، أَوْ ذَوْبَ الْمِلْحِ فِي الْمَاءِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10884,
                "hadithNumber": "3320",
                "englishNarrator": "Amir bin Sa'd reported:",
                "hadithEnglish": "Sa'd رضی اللہ تعالیٰ عنہ rode to his castle in al-'Aqiq and found a slave cutting down the trees, or beating off their leaves, so he stripped him off his belongings. When Sa'd رضی اللہ تعالیٰ عنہ returned, there came to him the masters of the slave and negotiated with him asking him to return to their slave or to them what he had taken from their slave, whereupon he said: God forbid that I should return anything which Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) has given me as spoil, and refused to return anything to them.",
                "hadithUrdu": "حضرت سعد ( بن ابی وقاص رضی اللہ تعالیٰ عنہ ) ( مدینہ کے قریب ) عقیق میں اپنے محل کی طرف روانہ ہو ئے انھوں نے ایک غلام کو دیکھا وہ درخت کا ٹ رہا تھا یا اس کے پتے چھاڑ رہا تھا انھوں نے اس سے ( اس لباس اور سازو سامان ) سلب کر لیا ۔ جب حضرت سعد رضی اللہ تعالیٰ عنہ ( مدینہ ) لو ٹے تو غلام کے مالک ان کے پاس حا ضر ہو ئے اور ان سے گفتگو کی کہ انھوں نے جو ان کے غلام کو ۔ ۔ ۔ یا انھیں ۔ ۔ ۔ واپس کردیں ۔ انھوں نے کہا : اللہ کی پناہ کہ میں کو ئی ایسی چیز واپس کروں جو رسول اللہ صلی اللہ علیہ وسلم نے مجھے بطور غنیمت دی ہے اور انھوں نے وہ ( سامان ) انھیں واپس کرنے سے انکا ر کر دیا ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم اور عبد بن حمید نے عقدی کی سند سے بیان کیا کہ ہم کو عبد الملک بن عمرو نے خبر دی ۔ اللہ بن جعفر، کی سند پر اسماعیل بن محمد نے عا مر بن سعد سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبْدُ بْنُ حُمَيْدٍ، جَمِيعًا عَنِ الْعَقَدِيِّ، قَالَ عَبْدٌ: أَخْبَرَنَا عَبْدُ الْمَلِكِ بْنُ عَمْرٍو، حَدَّثَنَا عَبْدُ اللهِ بْنُ جَعْفَرٍ، عَنْ إِسْمَاعِيلَ بْنِ مُحَمَّدٍ، عَنْ عَامِرِ بْنِ سَعْدٍ، أَنَّ سَعْدًا رَكِبَ إِلَى قَصْرِهِ بِالْعَقِيقِ، فَوَجَدَ عَبْدًا يَقْطَعُ شَجَرًا، أَوْ يَخْبِطُهُ، فَسَلَبَهُ، فَلَمَّا رَجَعَ سَعْدٌ، جَاءَهُ أَهْلُ الْعَبْدِ فَكَلَّمُوهُ أَنْ يَرُدَّ عَلَى غُلَامِهِمْ - أَوْ عَلَيْهِمْ - مَا أَخَذَ مِنْ غُلَامِهِمْ، فَقَالَ: «مَعَاذَ اللهِ أَنْ أَرُدَّ شَيْئًا نَفَّلَنِيهِ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَأَبَى أَنْ يَرُدَّ عَلَيْهِمْ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10885,
                "hadithNumber": "3321",
                "englishNarrator": "Anas bin Malik ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to Abu Talha ( رضی اللہ تعالیٰ عنہ): Find for me a servant from amongst your boys to serve me. Abu Talha went out along with me and made me sit behind him. And I used to serve Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) whenever he got down from the camel. And in one hadith he said: He proceeded and when (the mountain of) Uhud was within sight, he said: This is the mountain which loves us and we love it. And as he came close to Medina he said: O Allah, I declare (the area) between the two mountains of it (Medina) sacred just as Ibrahim declared Mecca as sacred. O Allah, bless them (the people of Medina) in their mudd and sa'.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ابو طلحہ رضی اللہ تعالیٰ عنہ سے کہا : \" میرے لیے اپنے ( انصار کے ) لڑکوں میں سے ایک لڑکا ڈھونڈو جو میری خدمت کیا کرے ۔ ابو طلحہ مجھے سواری پر پیچھے بٹھا ئے ہو ئے لے کر نکلے اور رسول اللہ صلی اللہ علیہ وسلم جہاں بھی قیام فر ماتے ، میں آپ کی خدمت کرتا ۔ اور ( اس ) حدیث میں کہا : پھر آپ ( لو ٹکر ) آئے حتی کہ جب کو ہ اُحد آپ کے سامنے نما یاں ہوا تو آپ نے فرمایا : \" یہ پہاڑ ہے جو ہم سے محبت کرتا ہے اور ہم اس سے محبت کرتے ہیں \" پھر جب بلندی سے مدینہ پر نگا ہ ڈا لی تو فرمایا : \" اے اللہ !میں اس دونوں پہاڑوں کے درمیان کے علاقے کو حرم قرار دیتا ہوں جس طرح ابرا ہیم ؑ نے مکہ کو حرا م قرار دیا تھا ۔ اے اللہ !ان ( اہل مدینہ ) کے لیے ان کے مداور صاع میں برکت عطا فر ما ۔",
                "urduNarrator": "ہم سے یحییٰ بن ایوب، قتیبہ بن سعید اور ابن حجر نے بیان کیا, اسماعیل بن جعفر نے ہمیں ھدیث بیان کی ، ( کہا ) مجھے مطلب بن عبد اللہ بن خطا ب کے مولیٰ عمرو بن ابی عمرو نے خبر دی کہ انھوں نے انس بن مالک رضی اللہ تعالیٰ عنہ سے سنا ، وہ کہہ رہے تھے",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَابْنُ حُجْرٍ، جَمِيعًا عَنْ إِسْمَاعِيلَ، قَالَ ابْنُ أَيُّوبَ: حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، أَخْبَرَنِي عَمْرُو بْنُ أَبِي عَمْرٍو، مَوْلَى الْمُطَّلِبِ بْنِ عَبْدِ اللهِ بْنِ حَنْطَبٍ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِأَبِي طَلْحَةَ: «الْتَمِسْ لِي غُلَامًا مِنْ غِلْمَانِكُمْ يَخْدُمُنِي»، فَخَرَجَ بِي أَبُو طَلْحَةَ يُرْدِفُنِي وَرَاءَهُ، فَكُنْتُ أَخْدُمُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كُلَّمَا نَزَلَ، وَقَالَ فِي الْحَدِيثِ: ثُمَّ أَقْبَلَ حَتَّى إِذَا بَدَا لَهُ أُحُدٌ، قَالَ: «هَذَا جَبَلٌ يُحِبُّنَا وَنُحِبُّهُ»، فَلَمَّا أَشْرَفَ عَلَى الْمَدِينَةِ، قَالَ: «اللهُمَّ إِنِّي أُحَرِّمُ مَا بَيْنَ جَبَلَيْهَا مِثْلَ مَا حَرَّمَ بِهِ إِبْرَاهِيمُ مَكَّةَ، اللهُمَّ بَارِكْ لَهُمْ فِي مُدِّهِمْ وَصَاعِهِمْ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10886,
                "hadithNumber": "3322",
                "englishNarrator": "Anas bin Malik رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "A hadith like this from Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) except with this variation that he said: I declare sacred the area between its two lava mountains.",
                "hadithUrdu": "انھوں نے نبی صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ۔ ۔ ۔ مگر انھوں نے کہا  \" میں اس کی دونوں کالے سنگریزوں والی زمینوں کے درمیانی حصے کو حرم قرار دیتا ہوں ۔ \"",
                "urduNarrator": "ہم سے سعید بن منصور اور قتیبہ بن سعید نے بیان کیا، کہا  یعقوب بن عبد الرحمٰن القاری نے ہمیں عمرو بن ابی عمرو سے حدیث بیان کی انھوں نے انس بن مالک رضی اللہ تعالیٰ عنہ سے",
                "hadithArabic": "وَحَدَّثَنَاهُ سَعِيدُ بْنُ مَنْصُورٍ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، قَالَا: حَدَّثَنَا يَعْقُوبُ وَهُوَ ابْنُ عَبْدِ الرَّحْمَنِ الْقَارِيُّ، عَنْ عَمْرِو بْنِ أَبِي عَمْرٍو، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ، غَيْرَ أَنَّهُ قَالَ: إِنِّي أُحَرِّمُ مَا بَيْنَ لَابَتَيْهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10887,
                "hadithNumber": "3323",
                "englishNarrator": "Asim reported:",
                "hadithEnglish": "I asked Anas bin Malik رضی اللہ تعالیٰ عنہ whether Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had declared Medina as sacred. He said: Yes. (the area) between so and so. He who made any innovation in it, and further said to me: It is something serious to make any innovation in it (and he who does it) there is upon him the curse of Allah, and that of the angels and of all the people, Allah will not accept from him on the Day of Resurrection either obligatory acts or the surpererogatory acts. Ibn Anas said: Or he accommodates an innovator.",
                "hadithUrdu": "میں نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے پو چھا : کیا رسول اللہ صلی اللہ علیہ وسلم نے مدینہ کو حرم قرار دیا تھا؟ انھوں نے کہا : ہاں ، فلاں مقام فلاں مقام تک ( کا علاقہ ) جس نے اس میں کو ئی بدعت نکا لی ، پھر انھوں نے مجھ سے کہا : یہ سخت وعید ہے : \" جس نے اس میں بدعت کا ارتکاب کیا اس پر اللہ کی فرشتوں کی اور تمام انسانوں کی لعنت ہو گی ، قیامت کے دن اللہ تعا لیٰ اس کی طرف سے نہ کو ئی عذر وحیلہ قبو ل فر مائے گا نہ کو ئی بدلہ ۔ کہا : ابن انس نے کہا : یا ( جس نے ) کسی بدعت کا ارتکاب کرنے والے کو پناہ دی ۔",
                "urduNarrator": "ہم سے حامد بن عمر نے بیان کیا، کہا ہم سے عبد الواحد نے بیان کیا،عاصم نے ہمیں حدیث بیان کی کہا",
                "hadithArabic": "وَحَدَّثَنَاهُ حَامِدُ بْنُ عُمَرَ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا عَاصِمٌ، قَالَ: قُلْتُ لِأَنَسِ بْنِ مَالِكٍ: أَحَرَّمَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ؟ قَالَ: نَعَمْ مَا بَيْنَ كَذَا إِلَى كَذَا، فَمَنْ أَحْدَثَ فِيهَا حَدَثًا، قَالَ: ثُمَّ قَالَ لِي: هَذِهِ شَدِيدَةٌ «مَنْ أَحْدَثَ فِيهَا حَدَثًا فَعَلَيْهِ لَعْنَةُ اللهِ وَالْمَلَائِكَةِ وَالنَّاسِ أَجْمَعِينَ، لَا يَقْبَلُ اللهُ مِنْهُ يَوْمَ الْقِيَامَةِ صَرْفًا، وَلَا عَدْلًا»، قَالَ: فَقَالَ ابْنُ أَنَسٍ: «أَوْ آوَى مُحْدِثًا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10888,
                "hadithNumber": "3324",
                "englishNarrator": "Asim reported:",
                "hadithEnglish": "I asked Anas ( رضی اللہ تعالیٰ عنہ) whether Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had declared Medina as sacred. He said: Yes, it is sacred, so its tree is not to be cut; and he who did that let the curse of Allah and that of the angels and of all people be upon him.",
                "hadithUrdu": "میں نے حضرت انس رضی اللہ تعالیٰ عنہ سے پوچھا : کیا رسول اللہ صلی اللہ علیہ وسلم نے مدینہ کو حرم قرار دیا ہے؟ انھوں نے کہا : ہاں ، یہ حرم ہے اس کی گھاس نہ کا ٹی جا ئے جس نے ایسا کیا اس پر اللہ کی ، فرشتوں کی ، اور سب لوگوں کی لعنت ہو گی ۔ \"",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے یزید بن ہارون نے بیان کیا، انہوں نے بیان کیا ہمیں عاصم احول نے خبر دی کہا",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا عَاصِمٌ الْأَحْوَلُ، قَالَ: سَأَلْتُ أَنَسًا، أَحَرَّمَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ؟ قَالَ: «نَعَمْ، هِيَ حَرَامٌ لَا يُخْتَلَى خَلَاهَا، فَمَنْ فَعَلَ ذَلِكَ فَعَلَيْهِ لَعْنَةُ اللهِ وَالْمَلَائِكَةِ وَالنَّاسِ أَجْمَعِينَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 10576,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=423",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=421",
                "label": "421",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=422",
                "label": "422",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=423",
                "label": "423",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=424",
                "label": "424",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=425",
                "label": "425",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=426",
                "label": "426",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=427",
                "label": "427",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=425",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=425",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=423",
        "to": 10600,
        "total": 40465
    }
}