{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 360,
        "data": [
            {
                "id": 9264,
                "hadithNumber": "1700",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) would pray in the night for a long time, and when he prayed standing be bowed in a standing posture, and when he prayed sitting, he bowed in a sitting posture.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم رات کو لمبا وقت نماز پڑھتے رہتے ، پس جب آپ کھڑے ہوکر نماز پڑھتے تو کھڑے کھڑے رکوع کرتے اور جب بیٹھ کر نماز پڑھتے تو بیٹھے ہوئے رکوع کرتے ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, حماد نے بدیل اورایوب سے روایت کی ، انھوں نے عبداللہ بن شقیق سے اور انھوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا حَمَّادٌ عَنْ بُدَيْلٍ وَأَيُّوبَ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي لَيْلًا طَوِيلًا فَإِذَا صَلَّى قَائِمًا رَكَعَ قَائِمًا وَإِذَا صَلَّى قَاعِدًا رَكَعَ قَاعِدًاَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9265,
                "hadithNumber": "1701",
                "englishNarrator": "Abdullah bin Shaqiq reported:",
                "hadithEnglish": "I fell ill in Persia and therefore, prayed in a sitting posture, and I asked 'A'isha رضی اللہ عنہا about it and she said: The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) prayed for a long time in the night standing....' \" And he mention the Hadith.",
                "hadithUrdu": "میں فارس ( ایران ) میں بیمار تھا ، اس لئے بیٹھ کر نماز پڑھتا تھا ۔ میں نے اس کے بارے میں حضرت عائشہ رضی اللہ عنہا سے پوچھا تو انھوں نے جواب دیا : رسول اللہ صلی اللہ علیہ وسلم رات کو لمباوقت کھڑے ہوکر نماز پڑھتے تھے ۔ ۔ ۔ اس کے بعد ( اسی طرح ) حدیث بیان کی ۔",
                "urduNarrator": "اور ہم سے محمد بن المثنیٰ نے بیان کیا، ہم سے محمد بن جعفر نے بیان کیا, شعبہ نے بدیل سے حدیث سنائی انھوں نے عبداللہ بن شقیق سے روایت کی ، انھوں نے کہا :شعبہ نے بدیل سے حدیث سنائی انھوں نے عبداللہ بن شقیق سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ بُدَيْلٍ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ قَالَ كُنْتُ شَاكِيًا بِفَارِسَ فَكُنْتُ أُصَلِّي قَاعِدًا فَسَأَلْتُ عَنْ ذَلِك عَائِشَةَ فَقَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي لَيْلًا طَوِيلًا قَائِمًا فَذَكَرَ الْحَدِيث",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9266,
                "hadithNumber": "1702",
                "englishNarrator": "Abdullah bin Shaqiq al-'Uqaili reported:",
                "hadithEnglish": "I asked 'A'isha رضی اللہ عنہ about the prayer of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) during the night (i. e. Tahajjud prayer) She replied: He used to pray for a long time standing and for a long time sitting in the night, and when he recited the Qur'an while standing, he would bow himself from the standing position, and when he recited while sitting, he would bow from the sitting position.",
                "hadithUrdu": "میں نے حضرت عائشہ رضی اللہ عنہ سے رسول اللہ صلی اللہ علیہ وسلم کی رات کی نماز کے بارے میں سوا ل کیاتو ا نھوں نے جواب دیا : آپ رات کو لمبا وقت کھڑے ہوکر نماز پڑھتے اور رات کو لمبا وقت بیٹھ کر نماز پڑھتے اور جب آپ کھڑے ہوکر قراءت کرتے تو کھڑے کھڑے رکوع کرتے اور جب بیٹھ کر قراءت کرتے تو بیٹھے بیٹھے رکوع کرتے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے معاذ بن معاذ نے بیان کیا،حمید نے عبداللہ بن شقیق سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ عَنْ حُمَيْدٍ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ الْعُقَيْلِيِّ قَالَ سَأَلْتُ عَائِشَةَ عَنْ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِاللَّيْلِ فَقَالَتْ كَانَ يُصَلِّي لَيْلًا طَوِيلًا قَائِمًا وَلَيْلًا طَوِيلًا قَاعِدًا وَكَانَ إِذَا قَرَأَ قَائِمًا رَكَعَ قَائِمًا وَإِذَا قَرَأَ قَاعِدًا رَكَعَ قَاعِدًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9267,
                "hadithNumber": "1703",
                "englishNarrator": "Abdullah bin Shaqiq al-'Uqaili reported:",
                "hadithEnglish": "I asked 'A'isha رضی اللہ عنہا about the prayer of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). She said: The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) would observe prayer (Nafl) in a standing position as well as in a sitting position, and when he commenced the prayer in a standing position, he bowed in this very position, and when he commenced the prayer in a sitting position, he bowed in this very position.",
                "hadithUrdu": "ہم لوگوں نے حضرت عائشہ رضی اللہ عنہا رسول اللہ صلی اللہ علیہ وسلم کی نماز کے بارے میں پوچھا تو انھوں نے کہا آپ کثرت سے کھڑ ے ہوکراور بیٹھ کر نماز پڑھتے تھے ۔ جب آپ کھڑے ہوکر نماز کا آغازفرماتے تو کھڑے کھڑے رکوع کرتے اور جب آپ بیٹھے ہوئے نماز کا آغاز کرتے تو بیٹھے ہوئے رکوع کرتے ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا ہم سے ابو معاویہ نے بیان کیا، وہ ہشام بن حسان کی سند سے,محمد بن سیرین نے عبداللہ بن شقیق عقیلی سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو مُعَاوِيَةَ عَنْ هِشَامِ بْنِ حَسَّانَ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ الْعُقَيْلِيِّ قَالَ سَأَلْنَا عَائِشَةَ عَنْ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُكْثِرُ الصَّلَاةَ قَائِمًا وَقَاعِدًا فَإِذَا افْتَتَحَ الصَّلَاةَ قَائِمًا رَكَعَ قَائِمًا وَإِذَا افْتَتَحَ الصَّلَاةَ قَاعِدًا رَكَعَ قَاعِدًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9268,
                "hadithNumber": "1704",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "I did not see the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) reciting (the Qur'an) in the night prayer in a sitting position, till he grew old and then he recited (it) in a sitting position, but when thirty or forty verses were left out of the Surah, he would then stand up, recite them and then bowed.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو نہیں دیکھا تھا کہ آپ نے رات کی نماز کے کسی حصے میں بیٹھ کر قراءت کی ہو یہاں تک کہ جب آپ کی عمر زیادہ ہوگئی تو آپ بیٹھ کر قراءت کرتے اور جب سورت کی تیس یا چالیس آیتیں ر ہ جاتیں تو کھڑے ہوکر انھیں پڑھتے پھر رکوع کرتے ۔",
                "urduNarrator": "مجھ سے ابو الربیع الزہرانی نے بیان کیا، کہا ہم سے حماد نے بیان کیا، کہا ہم سے ابن زید نے بیان کیا، کہا ہم سے حسن بن ربیع نے بیان کیا، کہا کہ ہم سے مہدی بن میمون نے بیان کیا اور ہم سے ابوبکر نے بیان کیا، ہم سے ابن ابی شیبہ نے بیان کیا، کہا کہ ہم سے وکیع نے بیان کیا، کہا ہم سے کریب نے بیان کیا، ہم سے ابن نمیر نے بیان کیا، ہشام بن عروہ نے اور مجھ سے زہیر بن حرب نے بیان کیا اور اس کا قول یہ ہے کہ ہم سے یحییٰ بن سعید نے بیان کیا,ہشام بن عروہ سے روایت ہے ، کہا : مجھے میرے والد نے حضرت عائشہ رضی اللہ عنہا سے خبر دی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنِي أَبُو الرَّبِيعِ الزَّهْرَانِيُّ أَخْبَرَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ قَالَ ح و حَدَّثَنَا حَسَنُ بْنُ الرَّبِيعِ حَدَّثَنَا مَهْدِيُّ بْنُ مَيْمُونٍ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ ح و حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا ابْنُ نُمَيْرٍ جَمِيعًا عَنْ هِشَامِ بْنِ عُرْوَةَ ح و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ وَاللَّفْظُ لَهُ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ هِشَامِ بْنِ عُرْوَةَ قَالَ أَخْبَرَنِي أَبِي عَنْ عَائِشَةَ قَالَتْ مَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي شَيْءٍ مِنْ صَلَاةِ اللَّيْلِ جَالِسًا حَتَّى إِذَا كَبِرَ قَرَأَ جَالِسًا حَتَّى إِذَا بَقِيَ عَلَيْهِ مِنْ السُّورَةِ ثَلَاثُونَ أَوْ أَرْبَعُونَ آيَةً قَامَ فَقَرَأَهُنَّ ثُمَّ رَكَعَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9269,
                "hadithNumber": "1705",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to pray while sitting (when he grew old) and he recited in this position and when the recitation equal to thirty or forty verses was left, he would then stand up and recite (for this duration) in a standing position and then bowed himself and then prostrated himself and did the same in the second rak'ah.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم بیٹھ کر ( بھی ) نماز پڑھتے تھے ، آپ بیٹھے ہوئے قراءت فرماتے جب آپ کی قراءت سے اتنا حصہ بچ جاتا جتنی تیس یا چالیس آیتیں ہوتی ہیں تو آپ کھڑ ے ہوجاتے اور کھڑے ہوئے ان کی قراءت فرماتے پھر رکوع کرتے پھر سجدہ کرتے ، پھر دوسری رکعت میں ایسا ہی کرتے ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے عبداللہ بن یزید اور ابی النضر کی سند سے مالک کو پڑھا,ابو سلمہ بن عبدالرحمن نے حضرت عائشہ رضی اللہ عنہا سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ وَأَبِي النَّضْرِ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي جَالِسًا فَيَقْرَأُ وَهُوَ جَالِسٌ فَإِذَا بَقِيَ مِنْ قِرَاءَتِهِ قَدْرُ مَا يَكُونُ ثَلَاثِينَ أَوْ أَرْبَعِينَ آيَةً قَامَ فَقَرَأَ وَهُوَ قَائِمٌ ثُمَّ رَكَعَ ثُمَّ سَجَدَ ثُمَّ يَفْعَلُ فِي الرَّكْعَةِ الثَّانِيَةِ مِثْلَ ذَلِكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9270,
                "hadithNumber": "1706",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to recite in sitting position (while observing the Tahajjud prayer) and when he intended to bow, he would stand up and recite (for the duration in which) a man (ordinarily) recites forty verses.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم بیٹھے ہوئے قراءت فرماتے ، پس جب رکوع کرناچاہتے تو اتنی دیر کے لئے کھڑے ہوجاتے جتنی دیر میں ایک انسان چالیس آیتیں پڑھ لیتا ہے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور اسحاق بن ابراہیم نے بیان کیا، ابوبکر نے کہا کہ ہم سے اسماعیل بن اوعلیہ نے ولید بن ابی ہشام کی سند سے بیان کیا، انہوں نے ابو بکر بن محمد سے,عمرہ نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَبُو بَكْرٍ حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ عَنْ الْوَلِيدِ بْنِ أَبِي هِشَامٍ عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ وَهُوَ قَاعِدٌ فَإِذَا أَرَادَ أَنْ يَرْكَعَ قَامَ قَدْرَ مَا يَقْرَأُ إِنْسَانٌ أَرْبَعِينَ آيَةً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9271,
                "hadithNumber": "1707",
                "englishNarrator": "Alqama bin Waqqas reported:",
                "hadithEnglish": "I asked 'A'isha رضی اللہ عنہا how the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) did in the two rak'ahs as he (observed them) sitting. She said: He would recite (the Qur'an) in them, and when he intended to bow, he would stand up and then bowed.",
                "hadithUrdu": "میں نے حضرت عائشہ رضی اللہ عنہا سے پوچھا : جب رسول اللہ صلی اللہ علیہ وسلم بیٹھ کر دو رکعتیں پڑھتے تو کیا کرتے تھے؟انھوں نے جواب دیا : آپ ان میں قراءت کرتے رہتے ، جب رکوع کرنے کا ارادہ کرتے تو کھڑے ہوجاتے پھر ر کوع کرتے ۔",
                "urduNarrator": "ہم سے ابن نمیر نے بیان کیا، ہم سے محمد بن بشر نے بیان کیا، ہم سے محمد بن عمرو نے بیان کیا، مجھ سے محمد بن ابراہیم نے بیان کیا, علقمہ بن وقاص سے روایت ہے ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو حَدَّثَنِي مُحَمَّدُ بْنُ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ بْنِ وَقَّاصٍ قَالَ قُلْتُ لِعَائِشَةَ كَيْفَ كَانَ يَصْنَعُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الرَّكْعَتَيْنِ وَهُوَ جَالِسٌ قَالَتْ كَانَ يَقْرَأُ فِيهِمَا فَإِذَا أَرَادَ أَنْ يَرْكَعَ قَامَ فَرَكَعَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9272,
                "hadithNumber": "1708",
                "englishNarrator": "Abdullah bin Shaqiq reported:",
                "hadithEnglish": "I asked 'A'isha رضی اللہ عنہا whether the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) observed (Nafl) sitting. She said: Yes, when the people had made him old.",
                "hadithUrdu": "میں نے حضرت عائشہ رضی اللہ عنہا سے کہا : کیا رسول اللہ صلی اللہ علیہ وسلم بیٹھ کر نماز پڑھ لیتے تھے؟انہوں نے کہا : ہاں ، جب لوگوں ( کے معاملات کی دیکھ بھال اورفکر مندی ) نے آپ کو بوڑھا کردیا ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا ہم سے یزید بن زرعی نے بیان کیا,سعید بن جریری نے عبداللہ بن شقیق سے روایت کی ، انھوں نے کہا :",
                "hadithArabic": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا يَزِيدُ بْنُ زُرَيْعٍ عَنْ سَعِيدٍ الْجُرَيْرِيِّ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ قَالَ قُلْتُ لِعَائِشَةَ هَلْ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي وَهُوَ قَاعِدٌ قَالَتْ نَعَمْ بَعْدَ مَا حَطَمَهُ النَّاسُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9273,
                "hadithNumber": "1709",
                "englishNarrator": "Abdullah bin Shaqiq reported:",
                "hadithEnglish": "I said to 'A'isha رضی اللہ عنہا and she made a mention of that (recorded above) about the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ).",
                "hadithUrdu": "میں نے حضرت عائشہ رضی اللہ عنہا سے کہا ۔ ۔ ۔ پھر نبی کریم صلی اللہ علیہ وسلم سے اسی طرح روایت بیان کی ۔",
                "urduNarrator": "ہم سے عبید اللہ بن معاذ نے بیان کیا، ہم سے میرے والد نے بیان کیا, کہمس نے عبداللہ بن شقیق سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا كَهْمَسٌ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ قَالَ قُلْتُ لِعَائِشَةَ فَذَكَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9274,
                "hadithNumber": "1710",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) died (in this very state) that he observed most of his (Nafl) prayers in a sitting position.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کا انتقال نہیں ہوا یہاں تک کہ آپ کی نماز کا بہت سا حصہ بیٹھے ہوئے ہوتا تھا ۔",
                "urduNarrator": "اور مجھ سے محمد بن حاتم اور ہارون بن عبداللہ نے بیان کیا، انہوں نے کہا کہ ہم سے حجاج بن محمد نے بیان کیا، انہوں نے کہا کہ ابن جریج نے کہا کہ مجھ سے عثمان بن ابی سلیمان نے بیان کیا, ابو سلمہ بن عبدالرحمن نے خبر دی کہ حضرت عائشہ رضی اللہ عنہا نے انھیں بتایا کہ",
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ وَهَارُونُ بْنُ عَبْدِ اللَّهِ قَالَا حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي عُثْمَانُ بْنُ أَبِي سُلَيْمَانَ أَنَّ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ أَخْبَرَهُ أَنَّ عَائِشَةَ أَخْبَرَتْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَمُتْ حَتَّى كَانَ كَثِيرٌ مِنْ صَلَاتِهِ وَهُوَ جَالِسٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9275,
                "hadithNumber": "1711",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) grew bulky and heavy he would observe (most of his Nafl) prayers sitting.",
                "hadithUrdu": "جب رسول اللہ صلی اللہ علیہ وسلم کا بدن زرا بڑھ گیا اور آپ بھاری ہوگئے تو آپ کی نماز کا زیادہ تر حصہ بیٹھے ہوئے ( ادا ) ہوتا تھا ۔",
                "urduNarrator": "اور مجھ سے محمد بن حاتم اور حسن الحلوانی دونوں نے زید کی سند سے بیان کیا، حسن نے کہا: ہم سے زید بن الحباب نے بیان کیا، مجھ سے ضحاک بن عثمان نے بیان کیا,عبداللہ بن عروہ کے والد عروہ بن زبیر نے حضرت عائشہ رضی اللہ عنہا سے روایت کی انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ وَحَسَنٌ الْحُلْوَانِيُّ كِلَاهُمَا عَنْ زَيْدٍ قَالَ حَسَنٌ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ حَدَّثَنِي الضَّحَّاكُ بْنُ عُثْمَانَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ لَمَّا بَدَّنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَثَقُلَ كَانَ أَكْثَرُ صَلَاتِهِ جَالِسًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9276,
                "hadithNumber": "1712",
                "englishNarrator": "Hafsa رضی اللہ عنہا reported:",
                "hadithEnglish": "Never did I see the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) observing supererogatory prayer sitting till one year before his death when he would observe Nafl prayer in a sitting position, and he would recite the Surah (of the Qur'an) in such a slow-measured tone (that duration of its recital) became more lengthy than the one longer than this.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو نفل نماز بیٹھ کر کبھی نہ پڑھتے دیکھاتھا حتیٰ کہ آپ صلی اللہ علیہ وسلم کی وفات سے ایک سال پہلے کا زمانہ ہوا تو آپ نفل نماز بیٹھ کر پڑھنےلگے ۔ آپ سورت کی قراءت کرتے تو اسے ٹھہر ٹھہر کر پڑھتے حتیٰ کہ وہ طویل ترین سورت سے بھی لمبی ہوجاتی ۔ ( یعنی بیٹھ کر لیکن اور بھی زیادہ لمبی نماز پڑھتے ) -",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا: میں نے پڑھا, امام مالک نے ابن شہاب سے ، انھوں نے سائب بن یزید سے ، انھوں نے مطلب بن ابی وداعہ سہمی سے اور انھوں نے حضرت حفصہ رضی اللہ عنہا سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ السَّائِبِ بْنِ يَزِيدَ عَنْ الْمُطَّلِبِ بْنِ أَبِي وَدَاعَةَ السَّهْمِيِّ عَنْ حَفْصَةَ أَنَّهَا قَالَتْ مَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى فِي سُبْحَتِهِ قَاعِدًا حَتَّى كَانَ قَبْلَ وَفَاتِهِ بِعَامٍ فَكَانَ يُصَلِّي فِي سُبْحَتِهِ قَاعِدًا وَكَانَ يَقْرَأُ بِالسُّورَةِ فَيُرَتِّلُهَا حَتَّى تَكُونَ أَطْوَلَ مِنْ أَطْوَلَ مِنْهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9277,
                "hadithNumber": "1713",
                "englishNarrator": null,
                "hadithEnglish": "A similar report (as no. 1712) was narrated from Az-Zuhri with chain, expect that they said: \"One or two years (before his death).\"",
                "hadithUrdu": "مجھ سے ابو الطاہر اور حرملہ نے بیان کیا، کہا: ہم سے ابن وہب نے بیان کیا، انہوں نے مجھ سے بیان کیا, یونس اور معمر دونوں نے زہری سے اسی سند کے ساتھ اس کے مانند روایت کی  البتہ ان دونوں ( یونس اور معمر ) نے ایک یا دو سال کہا ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنِي أَبُو الطَّاهِرِ وَحَرْمَلَةُ قَالَا أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ ح و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَعَبْدُ بْنُ حُمَيْدٍ قَالَا أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ جَمِيعًا عَنْ الزُّهْرِيِّ بِهَذَا الْإِسْنَادِ مِثْلَهُ غَيْرَ أَنَّهُمَا قَالَا بِعَامٍ وَاحِدٍ أَوْ اثْنَيْنِ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9278,
                "hadithNumber": "1714",
                "englishNarrator": "Jabir bin Samura رضی اللہ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) observed (Nafl) prayer sitting before his death.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کی وفات نہ ہوئی یہاں تک کہ آپ ( رات کو ) بیٹھ کر نماز پڑھنے لگے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے عبید اللہ بن موسیٰ نے بیان کیا، ان سے حسن بن صالح نے سماک سے، انہوں نے کہا کہ مجھے خبر دو, حضرت جابربن سمرہ رضی اللہ عنہ نے خبر دی کہ",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ حَسَنِ بْنِ صَالِحٍ عَنْ سِمَاكٍ قَالَ أَخْبَرَنِي جَابِرُ بْنُ سَمُرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَمُتْ حَتَّى صَلَّى قَاعِدًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9279,
                "hadithNumber": "1715",
                "englishNarrator": "Abdullah bin 'Amr رضی اللہ عنہ reported:",
                "hadithEnglish": "It was narrated to me that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had said: The prayer observed by a person sitting is half of the prayer. I came to him ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and found him praying in a sitting position. I placed my hand on his head. He said: O 'Abdullah bin 'Amr, what is the matter with you? I said: Messenger of Allah, it has been narrated to me that you said: The prayer of a man in a sitting position is half of the prayer, whereas you are observing prayer sitting. He (the Holy Prophet) said: Yes, it is so, but I am not like anyone amongst you.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" بیٹھ کر آدمی کی نماز ( اجر میں ) آدھی نماز ہے ۔ \" انھوں نے کہا : ایک بار میں آپ کے پاس آیا اور میں نے آپ کو بیٹھ کر نماز پڑھتے ہوئے پایا تو میں نے اپنا ہاتھ آپ کے سر مبارک پر لگایا ۔ آپ نے پوچھا : \" اے عبداللہ بن عمرو رضی اللہ عنہ تمھیں کیا ہوا؟ میں نے عرض کی ، اے اللہ کے رسول صلی اللہ علیہ وسلم مجھے بتایا گیا کہ آپ نے فرمایا ہے \" بیٹھ کر آدمی کی نماز آدھی نماز کے برابر ہے ۔ \" جب کہ آپ بیٹھ کر نماز پڑھ رہے ہیں ۔ آپ نے فرمایا : \" ہاں ایسا ہی ہے لیکن میں تم میں سے کسی ایک طرح کا نہیں ہوں ۔ \"",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، انہوں نے ہم سے بیان کیا, جریر نے مجھے حدیث سنائی ، انھوں نے منصور سے ، انھوں نے ہلال بن یساف سے ، انھوں نے ابو یحییٰ سے اور انھوں نے حضرت عبداللہ بن عمرو ( بن حوص ) رضی اللہ عنہ سے روایت کی ، انھوں نے کہا : مجھے بتایا گیا کہ",
                "hadithArabic": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ هِلَالِ بْنِ يَسَافٍ عَنْ أَبِي يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ حُدِّثْتُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ صَلَاةُ الرَّجُلِ قَاعِدًا نِصْفُ الصَّلَاةِ قَالَ فَأَتَيْتُهُ فَوَجَدْتُهُ يُصَلِّي جَالِسًا فَوَضَعْتُ يَدِي عَلَى رَأْسِهِ فَقَالَ مَا لَكَ يَا عَبْدَ اللَّهِ بْنَ عَمْرٍو قُلْتُ حُدِّثْتُ يَا رَسُولَ اللَّهِ أَنَّكَ قُلْتَ صَلَاةُ الرَّجُلِ قَاعِدًا عَلَى نِصْفِ الصَّلَاةِ وَأَنْتَ تُصَلِّي قَاعِدًا قَالَ أَجَلْ وَلَكِنِّي لَسْتُ كَأَحَدٍ مِنْكُمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9280,
                "hadithNumber": "1716",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been narrated by Abu Yahya al-A'raj with the same chain of transmitters.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ، محمد بن المثنیٰ اور ابن بشار نے محمد بن جعفر کی سند سے بیان کیا, شعبہ اور سفیان دونوں نے منصور سے اسی سابقہ سند کے ساتھ حدیث بیان کی ، البتہ شعبہ کی روایت میں ہے : \" ابو یحییٰ الاعرج سے روایت ہے \" ( انھوں نے ابو یحییٰ کے ساتھ ان کے لقب الاعرج کا بھی ذکر کیا ہے ) -",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ جَمِيعًا عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ عَنْ شُعْبَةَ ح و حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا سُفْيَانُ كِلَاهُمَا عَنْ مَنْصُورٍ بِهَذَا الْإِسْنَادِ وَفِي رِوَايَةِ شُعْبَةَ عَنْ أَبِي يَحْيَى الْأَعْرَجِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9281,
                "hadithNumber": "1717",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) used to pray eleven rak'ahs at night, observing the Witr with a single rak'ah, and when he had finished them, he lay down on his right side, till the Mu'adhdhin came to him and he (the Holy Prophet) then observed two short rak'ahs (of Sunan of the dawn prayer).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم رات کوگیارہ رکعت پڑھتے تھے ، ان میں سے ایک کے ذریعے وتر ادا فرماتے ، جب آپ اس ( ایک رکعت ) سے فارغ ہوجاتے تو آپ اپنے دائیں پہلو کے بل لیٹ جاتے یہاں تک کہ آپ کے پاس موذن آجاتا تو آپ دو ( نسبتاً ) ہلکی رکعتیں پڑھتے ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے پڑھا, مالک نے ابن شہاب سے ، انھوں نے عروہ سے ، اور انھوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي بِاللَّيْلِ إِحْدَى عَشْرَةَ رَكْعَةً يُوتِرُ مِنْهَا بِوَاحِدَةٍ فَإِذَا فَرَغَ مِنْهَا اضْطَجَعَ عَلَى شِقِّهِ الْأَيْمَنِ حَتَّى يَأْتِيَهُ الْمُؤَذِّنُ فَيُصَلِّي رَكْعَتَيْنِ خَفِيفَتَيْنِ.",
                "headingArabic": "صَلاَةِ اللَّيْلِ وَعَدَدِ رَكَعَاتِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي اللَّيْلِ وَأَنَّ الْوِتْرَ رَكْعَةٌ وَأَنَّ الرَّكْعَةَ صَلاَةٌ صَحِيحَةٌ",
                "headingUrdu": "رات کی نماز اور رسول اللہ صلی اللہ علیہ وسلم کی رات میں پڑھی جانے والی رکعتوں کی تعداد، اور یہ کہ وتر ایک رکعت ہے، اور ایک رکعت کی نماز صحیح ہے۔",
                "headingEnglish": "Night prayers and the number of rak`ah offered by the Prophet (saws) at night, and that Witr is one rak`ah, and a one-rak`ah prayer is correct",
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9282,
                "hadithNumber": "1718",
                "englishNarrator": "A'isha رضی اللہ عنہا , the wife of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), said that between the time:",
                "hadithEnglish": "When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) finished the 'Isha' prayer which is called 'Atama by the people, he used to pray eleven rak'ahs, uttering the salutation at the end of every two rak'ahs, and observing the Witr with a single one. And when the Mu'adhdhin had finished the call (for the) dawn prayer and he saw the dawn clearly and the Mu'adhdhin had come to him, he stood up and prayed two short rak'ahs. Then he lay down on his right side till the Mu'adhdhin came to him for lqama. (This hadith has been narrated with the same chain of transmitters by Ibn Shihab, but in it no mention has been made of Iqama).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم عشاء کی نماز سے جس کو لوگ عتمہ کہتے ہیں فراغت کے بعد سے فجر تک گیارہ رکعت پڑھتے تھے ۔ ہر دو رکعت پر سلام پھیرتے اور وتر ایک رکعت پڑھتے ۔ جب موذن صبح کی نماز کی اذان کہہ کر خاموش ہوجاتا آپ کے سامنے صبح واضح ہوجاتی ۔ اور موذن آپ کے پاس آجاتا تو آپ اٹھ کر دو ہلکی رکعتیں پڑھتےپھر اپنے داہنے پہلو کے بل لیٹ جاتے حتیٰ کہ موذن آپ کے پاس اقامت ( کی اطلاع دینے ) کے لئے آجاتا ۔",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، مجھ سے ابن وہب نے بیان کیا، انہوں نے کہا عمرو بن حارث نے ابن شہاب سے اسی سند کے ساتھ نبی اکر م صلی اللہ علیہ وسلم کی زوجہ حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِيمَا بَيْنَ أَنْ يَفْرُغَ مِنْ صَلَاةِ الْعِشَاءِ وَهِيَ الَّتِي يَدْعُو النَّاسُ الْعَتَمَةَ إِلَى الْفَجْرِ إِحْدَى عَشْرَةَ رَكْعَةً يُسَلِّمُ بَيْنَ كُلِّ رَكْعَتَيْنِ وَيُوتِرُ بِوَاحِدَةٍ فَإِذَا سَكَتَ الْمُؤَذِّنُ مِنْ صَلَاةِ الْفَجْرِ وَتَبَيَّنَ لَهُ الْفَجْرُ وَجَاءَهُ الْمُؤَذِّنُ قَامَ فَرَكَعَ رَكْعَتَيْنِ خَفِيفَتَيْنِ ثُمَّ اضْطَجَعَ عَلَى شِقِّهِ الْأَيْمَنِ حَتَّى يَأْتِيَهُ الْمُؤَذِّنُ لِلْإِقَامَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9283,
                "hadithNumber": "1719",
                "englishNarrator": "It was narrated from Ibn Shihab with this chain, and Harmlah Quoted a similar Hadith (as no. 1718) except that he did not mention:",
                "hadithEnglish": "\"When he could see the down and he Mu'adhdhin came to him,\" and he did not mention: the Iqamah.\" The rest of the Hadith is like the Hadith of Amr.",
                "hadithUrdu": "\" آپ صلی اللہ علیہ وسلم کے سامنے صبح کے روشن ہوجانے اور موذن آپ کے پاس آتا \" کے الفاظ ذکر نہیں کیے اور \" اقامت \" کا ذکر کیا ۔ باقی حدیث بالکل عمرو کی حدیث کی طر ح ہے ۔",
                "urduNarrator": "حرملہ نے مجھے یہ حدیث بیان کی ( کہا ) ہمیں ابن وہب نے خبر دی ، انھوں نے کہا ، مجھے یونس نے ابن شہاب سے اسی سند کے ساتھ خبر دی ۔ اگر حرملہ نے سابقہ حدیث کی مانند حدیث بیان کی البتہ اس میں",
                "hadithArabic": "و حَدَّثَنِيهِ حَرْمَلَةُ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ بِهَذَا الْإِسْنَادِ وَسَاقَ حَرْمَلَةُ الْحَدِيثَ بِمِثْلِهِ غَيْرَ أَنَّهُ لَمْ يَذْكُرْ وَتَبَيَّنَ لَهُ الْفَجْرُ وَجَاءَهُ الْمُؤَذِّنُ وَلَمْ يَذْكُرْ الْإِقَامَةَ وَسَائِرُ الْحَدِيثِ بِمِثْلِ حَدِيثِ عَمْرٍو سَوَاءً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9284,
                "hadithNumber": "1720",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to observe thirteen rak'ahs of the night prayer. Five out of them consisted of Witr, and he did not sit, but at the end (for salutation).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم رات کو تیرہ رکعتیں پڑھتے تھے ، ان میں سے پانچ رکعتوں کے ذریعے وتر ( ادا ) کرتے تھے ، ان میں آخری رکعت کے علاوہ کسی میں بھی تشہد کے لئے نہ بیٹھتے تھے ۔ ( بعض راتوں میں آپ صلی اللہ علیہ وسلم کا یہ معمول ہوتا ).",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، کہا: ہم سے انہوں نے بیان کیا, عبداللہ بن نمیر نے ہمیں حدیث بیان کی اور کہا : ہمیں اپنے ہشام نے اپنے والد ( عروہ ) سے حدیث سنائی اور انھوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا هِشَامٌ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي مِنْ اللَّيْلِ ثَلَاثَ عَشْرَةَ رَكْعَةً يُوتِرُ مِنْ ذَلِكَ بِخَمْسٍ لَا يَجْلِسُ فِي شَيْءٍ إِلَّا فِي آخِرِهَاِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9285,
                "hadithNumber": "1721",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated by Hisham with the same chain of transmitters.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا,عبدہ بن سلیمان ، وکیع اور ابو اسامہ سب نے ہشام سے اسی سند کے ساتھ ( یہ ) روایت بیان کی ہے ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ و حَدَّثَنَاه أَبُو كُرَيْبٍ حَدَّثَنَا وَكِيعٌ وَأَبُو أُسَامَةَ كُلُّهُمْ عَنْ هِشَامٍ بِهَذَا الْإِسْنَاد.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9286,
                "hadithNumber": "1722",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to pray thirteen rak'ahs during the night including the two rak'ahs (Sunan) of the dawn prayer.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم فجر کی دو رکعتوں سمیت تیرہ ر کعتیں پڑھا کرتے تھے ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے لیث نے بیان کیا، ان سے یزید بن ابی حبیب نے بیان کیا، ان سے عرق بن مالک رضی اللہ عنہ نے,عروہ بن مالک نے عروہ سے روایت کی کہ حضرت عائشہ رضی اللہ عنہا نے انھیں بتایا کہ",
                "hadithArabic": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ عِرَاكِ بْنِ مَالِكٍ عَنْ عُرْوَةَ أَنَّ عَائِشَةَ أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي ثَلَاثَ عَشْرَةَ رَكْعَةً بِرَكْعَتَيْ الْفَجْرِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9287,
                "hadithNumber": "1723",
                "englishNarrator": "Abu Salama bin Abdul-Rahman asked:",
                "hadithEnglish": "'A'isha رضی اللہ عنہا about the (night) prayer of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) during the month of Ramadan. She said: The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) did not observe either in Ramadan or in other months more than eleven rak'ahs (of the night prayer). He (in the first instance) observed four rak'ahs. Ask not about their excellence and their length (i. e. these were matchless in perfection and length). He again observed four rak'ahs, and ask not about their excellence and their length. He would then observe three rak'ahs (of the Witr prayer). 'A'isha رضی اللہ عنہا again said: I said: Messenger of Allah, do you sleep before observing the Witr prayer? He said: O 'A'isha رضی اللہ عنہا , my eyes sleep but my heart does not sleep.",
                "hadithUrdu": "انھوں نے حضرت عائشہ رضی اللہ عنہا سے پوچھا : رمضان میں رسول اللہ صلی اللہ علیہ وسلم کی نماز کیسے ہوتی تھی؟انھوں نے جواب دیا : رسول اللہ صلی اللہ علیہ وسلم رمضان اور اس کے علاوہ ( دوسرے مہینوں ) میں ( فجر سے پہلے ) گیارہ رکعتوں سے زائد نہیں پڑھتے تھے ، چار رکعتیں پڑھتے ، ان کی خوبصورتی اور ان کی طوالت کے بارے میں مت پوچھو ، پھر چار رکعتیں پڑھتے ، ان کے حسن اور طوالت کے بارے میں نہ پوچھو ، پھرتین رکعتیں پڑھتے ۔ حضرت عائشہ رضی اللہ عنہا نے کہا میں نے عرض کی : اے اللہ کے رسول صلی اللہ علیہ وسلم !کیا آپ وتر پڑھنے سے پہلے سوجاتے ہیں؟تو آپ نے فرمایا : اے عائشہ!میری آنکھیں سوتی ہیں اور میرا دل نہیں سوتا ۔ \" ( وہ بدستور اللہ کے ذکر میں مشغول ر ہتا ہے ) -",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے مالک کو سعید بن ابی سعید مقبری نے ابو سلمہ بن عبدالرحمن سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ أَنَّهُ سَأَلَ عَائِشَةَ كَيْفَ كَانَتْ صَلَاةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي رَمَضَانَ قَالَتْ مَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَزِيدُ فِي رَمَضَانَ وَلَا فِي غَيْرِهِ عَلَى إِحْدَى عَشْرَةَ رَكْعَةً يُصَلِّي أَرْبَعًا فَلَا تَسْأَلْ عَنْ حُسْنِهِنَّ وَطُولِهِنَّ ثُمَّ يُصَلِّي أَرْبَعًا فَلَا تَسْأَلْ عَنْ حُسْنِهِنَّ وَطُولِهِنَّ ثُمَّ يُصَلِّي ثَلَاثًا فَقَالَتْ عَائِشَةُ فَقُلْتُ يَا رَسُولَ اللَّهِ أَتَنَامُ قَبْلَ أَنْ تُوتِرَ فَقَالَ يَا عَائِشَةُ إِنَّ عَيْنَيَّ تَنَامَانِ وَلَا يَنَامُ قَلْبِي.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9288,
                "hadithNumber": "1724",
                "englishNarrator": "Abu Salama asked:",
                "hadithEnglish": "'A'isha رضی اللہ عنہا about the prayer of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) She said: He observed thirteen rak'ahs (in the night prayer). He observed eight rak'ahs and would then observe Witr and then observe two rak'ahs sitting, and when he wanted to bow he stood up and then bowed down, and then observed two rak'ahs in between the Adhan and lqama of the dawn prayer.",
                "hadithUrdu": "میں نے حضرت عائشہ رضی اللہ عنہا سے رسول اللہ صلی اللہ علیہ وسلم کے بارے میں سوا ل کیا تو انھوں نے کہا آپ تیرہ رکعتیں پڑھتے تھے ، آٹھ رکعتیں پڑھتے پھر ( ایک رکعت سے ) وتر ادا فرماتے ، پھر بیٹھے ہوئے دو رکعتیں پڑھتے ، پھر جب رکوع کرنا چاہتے تو اٹھ کھڑے ہوتے اور رکوع کرتے ، پھر صبح کی نماز کی اذان اور اقامت کے درمیان دو رکعتیں پڑھتے ۔ ( کبھی آپ صلی اللہ علیہ وسلم کی تہجد اور وتر کی ترتیب یہ بن جاتی تھی ) -",
                "urduNarrator": "اور ہم سے محمد بن المثنی نے بیان کیا، کہا ہم سے ابن ابی عدی نے بیان کیا، انہوں نے بیان کیا, ہشام نے یحییٰ سے اور انھوں نے ابو سلمہ سے ر وایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ حَدَّثَنَا هِشَامٌ عَنْ يَحْيَى عَنْ أَبِي سَلَمَةَ قَالَ سَأَلْتُ عَائِشَةَ عَنْ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ كَانَ يُصَلِّي ثَلَاثَ عَشْرَةَ رَكْعَةً يُصَلِّي ثَمَانَ رَكَعَاتٍ ثُمَّ يُوتِرُ ثُمَّ يُصَلِّي رَكْعَتَيْنِ وَهُوَ جَالِسٌ فَإِذَا أَرَادَ أَنْ يَرْكَعَ قَامَ فَرَكَعَ ثُمَّ يُصَلِّي رَكْعَتَيْنِ بَيْنَ النِّدَاءِ وَالْإِقَامَةِ مِنْ صَلَاةِ الصُّبْحِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 8976,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=359",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=357",
                "label": "357",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=358",
                "label": "358",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=359",
                "label": "359",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=360",
                "label": "360",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=361",
                "label": "361",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=362",
                "label": "362",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=363",
                "label": "363",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=361",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=361",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=359",
        "to": 9000,
        "total": 40465
    }
}