{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 441,
        "data": [
            {
                "id": 11289,
                "hadithNumber": "3725",
                "englishNarrator": "Zainab (bint Abu Salama) (رضی اللہ عنہا) reported:",
                "hadithEnglish": "I went to Umm Habiba رضی اللہ عنہا , the wife of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), when her father Abu Sufyan رضی اللہ عنہ had died. Umm Habiba رضی اللہ عنہا sent for a perfume having yellowness in it or something else like it, and she applied it to a girl and then rubbed it on her cheeks and then said: By Allah, I need no perfume but for the fact that I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) say on the pulpit: It is not permissible for a woman believing in Allah and the Hereafter to mourn for the dead beyond three days, but (in case of the death) of the husband it is permissible for four months and ten days.",
                "hadithUrdu": "جب نبی صلی اللہ علیہ وسلم کی زوجہ محترمہ حضرت ام حبیبہ رضی اللہ عنہا کے والد ابوسفیان رضی اللہ عنہ فوت ہوئے تو میں ان کے ہاں گئی ، ام حبیبہ رضی اللہ عنہا نے زرد رنگ ملی مخلوط یا کوئی اور خوشبو منگوائی ، اس میں سے ( پہلے ) ایک بچی کو لگائی ( تاکہ ) ہاتھ پر اس کی مقدار بہت کم ہو جائے ) پھر اپنے رخساروں پر ہاتھ مل لیا ، پھر کہا : اللہ کی قسم! مجھے خوشبو کی ضرورت نہ تھی مگر ( بات یہ ہے کہ ) میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ منبر پر ارشاد فرما رہے تھے : \" کسی عورت کے لیے جو اللہ تعالیٰ اور آخرت کے دن پر ایمان رکھتی ہو ، حلال نہیں کہ وہ کسی بھی مرنے والے پر تین دن سے زیادہ سوگ منائے مگر خاوند پر ، چار ماہ دس دن ( سوگ منائے.",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے عبداللہ بن ابی بکر رضی اللہ عنہ کی روایت سے مالک کو پڑھا, حمید بن نافع نے زینب بنت ابی سلمہ سے روایت کی کہ انہوں نے اِن ( حمید ) کو یہ تین حدیثیں بیان کیں ، کہا : زینب رضی اللہ عنہا نے کہا",
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ عَبْدِ اللهِ بْنِ أَبِي بَكْرٍ، عَنْ حُمَيْدِ بْنِ نَافِعٍ، عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ، أَنَّهَا أَخْبَرَتْهُ، هَذِهِ الْأَحَادِيثَ الثَّلَاثَةَ، قَالَ: قَالَتْ زَيْنَبُ: دَخَلْتُ عَلَى أُمِّ حَبِيبَةَ زَوْجِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، حِينَ تُوُفِّيَ أَبُوهَا أَبُو سُفْيَانَ، فَدَعَتْ أُمُّ حَبِيبَةَ بِطِيبٍ فِيهِ صُفْرَةٌ خَلُوقٌ - أَوْ غَيْرُهُ - فَدَهَنَتْ مِنْهُ جَارِيَةً، ثُمَّ مَسَّتْ بِعَارِضَيْهَا، ثُمَّ قَالَتْ: وَاللهِ مَا لِي بِالطِّيبِ مِنْ حَاجَةٍ، غَيْرَ أَنِّي سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ عَلَى الْمِنْبَرِ: «لَا يَحِلُّ لِامْرَأَةٍ تُؤْمِنُ بِاللهِ وَالْيَوْمِ الْآخِرِ تُحِدُّ عَلَى مَيِّتٍ فَوْقَ ثَلَاثٍ، إِلَّا عَلَى زَوْجٍ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا».",
                "headingArabic": "وُجُوبِ الإِحْدَادِ فِي عِدَّةِ الْوَفَاةِ وَتَحْرِيمِهِ فِي غَيْرِ ذَلِكَ إِلاَّ ثَلاَثَةَ أَيَّامٍ",
                "headingUrdu": "شوہر کی وفات کے بعد عدت میں سوگ کرنا فرض ہے، لیکن دوسری صورتوں میں تین دن سے زیادہ سوگ کرنا منع ہے۔",
                "headingEnglish": "The Obligation to mourn during the 'Iddah following the death of one's husband, but it is forbidden to mourn for more than three days in other cases",
                "chapterId": "19",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 119,
                    "chapterNumber": "19",
                    "chapterEnglish": "The Book of Divorce",
                    "chapterUrdu": "طلاق کے احکام و مسائل",
                    "chapterArabic": "كتاب الطَّلَاقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11290,
                "hadithNumber": "3726",
                "englishNarrator": "Zainab said:",
                "hadithEnglish": "\"Then I entered upon Zainab bint Jahsh رضی اللہ عنہا when her brother died. She called for some perfume and put on some of it, then she said: 'By Allah, I have no need of perfume, but I heard the Messenger of Allah saying on the Minbar. \"It is not permissible for a women who believes in Allah and the last Day to mourn for more than free days for anyone who dies, except for a husband; four month and ten days.\"",
                "hadithUrdu": "پھر میں زینب بنت جحش رضی اللہ عنہا کے ہاں اس وقت گئی جب ان کے بھائی ( عبیداللہ بن جحش ) فوت ہوئے ، تو انہوں نے بھی خوشبو منگوائی اور لگائی ، پھر کہا : اللہ کی قسم! مجھے خوشبو کی ضرورت نہ تھی مگر ( بات یہ ہے کہ ) میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ منبر پر ارشاد فرما رہے تھے : \" کسی عورت کے لیے جو اللہ پر اور آخرت کے دن پر ایمان رکھتی ہے ، حلال نہیں کہ وہ کسی مرنے والے پر تین دن سے زیادہ سوگ کرے مگر شوہر پر ، چار مہینے دس دن ( سوگ کرے.",
                "urduNarrator": "زینب ( بنت ابی سلمہ رضی اللہ عنہا ) نے کہا",
                "hadithArabic": "قَالَتْ زَيْنَبُ: ثُمَّ دَخَلْتُ عَلَى زَيْنَبَ بِنْتِ جَحْشٍ حِينَ تُوُفِّيَ أَخُوهَا، فَدَعَتْ بِطِيبٍ، فَمَسَّتْ مِنْهُ، ثُمَّ قَالَتْ: وَاللهِ مَا لِي بِالطِّيبِ مِنْ حَاجَةٍ، غَيْرَ أَنِّي سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ عَلَى الْمِنْبَرِ: «لَا يَحِلُّ لِامْرَأَةٍ تُؤْمِنُ بِاللهِ وَالْيَوْمِ الْآخِرِ، تُحِدُّ عَلَى مَيِّتٍ فَوْقَ ثَلَاثٍ، إِلَّا عَلَى زَوْجٍ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "19",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 119,
                    "chapterNumber": "19",
                    "chapterEnglish": "The Book of Divorce",
                    "chapterUrdu": "طلاق کے احکام و مسائل",
                    "chapterArabic": "كتاب الطَّلَاقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11291,
                "hadithNumber": "3727",
                "englishNarrator": "Zainab (رضی اللہ عنہا) said:",
                "hadithEnglish": "I heard my mother Umm Salama (رضی اللہ عنہا) as saying: A woman came to Allah's Messenger (ﷺ) and said: Allah's Messenger. I have a daughter whose husband has died and there has developed some trouble in her eye; should we apply collyrium to it? Thereupon Allah's Messenger (ﷺ) said: No (repeating it twice or thrice, saying only, NO\" all the time). Then he said: It is only four mouths and ten days, whereas in the pre Islamic period none of you threw away the dung until one year had passed.",
                "hadithUrdu": "میں نے اپنی والدہ ام سلمہ رضی اللہ عنہا سے سنا وہ کہہ رہی تھیں ، ایک عورت رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی اور عرض کی : اللہ کے رسول! میری بیٹی کا شوہر فوت ہو گیا ہے ۔ اور اس کی آنکھوں میں تکلیف ہے ۔ کیا ہم اسے سرمہ لگا دیں؟ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" نہیں \" دو یا تین بار ( پوچھا گیا ) ہر بار آپ فرماتے : \" نہیں ۔ \" پھر فرمایا : \" یہ تو صرف چار ماہ دس دن ہیں ، حالانکہ جاہلیت میں تم میں سے ایک عورت ( پورا ) ایک سال گزرنے کے بعد مینگنی پھینکا کرتی تھی.",
                "urduNarrator": "زینب رضی اللہ عنہا نے کہا",
                "hadithArabic": "قَالَتْ زَيْنَبُ: سَمِعْتُ أُمِّي أُمَّ سَلَمَةَ، تَقُولُ: جَاءَتِ امْرَأَةٌ إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَتْ: يَا رَسُولَ اللهِ، إِنَّ ابْنَتِي تُوُفِّيَ عَنْهَا زَوْجُهَا، وَقَدِ اشْتَكَتْ عَيْنُهَا، أَفَنَكْحُلُهَا؟ فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا» - مَرَّتَيْنِ أَوْ ثَلَاثًا، كُلَّ ذَلِكَ يَقُولُ: لَا - ثُمَّ قَالَ: «إِنَّمَا هِيَ أَرْبَعَةُ أَشْهُرٍ وَعَشْرٌ، وَقَدْ كَانَتْ إِحْدَاكُنَّ فِي الْجَاهِلِيَّةِ تَرْمِي بِالْبَعْرَةِ عَلَى رَأْسِ الْحَوْلِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "19",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 119,
                    "chapterNumber": "19",
                    "chapterEnglish": "The Book of Divorce",
                    "chapterUrdu": "طلاق کے احکام و مسائل",
                    "chapterArabic": "كتاب الطَّلَاقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11292,
                "hadithNumber": "3728",
                "englishNarrator": "Humaid said:",
                "hadithEnglish": "I said to Zainab رضی اللہ عنہا : What is this throwing of dung until a year is passed? Zainab said: When the husband of a woman died, she went into a hut and put on her worst clothes, and did not apply perfume or something like it until a year was over. Then an animal like a donkey, or a goat, or a bird was brought to her and she rubbed her hand over it, and it so happened that one on which she rubbed her hand died. She then came out of her house and she was given dung and she threw it and then she made use of anything like perfume or something else as she liked.",
                "hadithUrdu": "میں نے زینب رضی اللہ عنہا سے پوچھا ایک سال گزرنے پر مینگنی پھینکنا کیا ہے؟ زینب نے جواب دیا : ( جاہلیت میں ) جب کسی عورت کا شوہر فوت ہو جاتا تھا تو وہ ایک ( دڑبہ نما ) انتہائی تنگ جھونپڑی میں چلی جاتی ، اپنے بدترین کپڑے پہن لیتی اور کوئی خوشبو وغیرہ استعمال نہ کرتی حتی کہ ( اسی حالت میں ) سال گزر جاتا ، پھر اس کے پاس کوئی جانور گدھا ، بکری یا کوئی پرندہ لایا جاتا ، تو وہ اسے اپنی شرمگاہ سے ملتی ، کم ہی ہوتا کہ وہ کسی کو ملتی تو وہ زندہ رہتا ( سخت تعفن اور جراثیم وغیرہ کی بنا پر بیمار ہو کر مر جاتا ) پھر وہ باہر نکلتی تو اسے ایک مینگنی دی جاتی جسے وہ ( اپنے آگے یا پیچھے ) پھینکتی ، پھر اس کے بعد خوشبو وغیرہ جو وہ چاہتی استعمال کرتی.",
                "urduNarrator": "حمید نے کہا",
                "hadithArabic": "قَالَ حُمَيْدٌ: فَقُلْتُ لِزَيْنَبَ، وَمَا تَرْمِي بِالْبَعْرَةِ عَلَى رَأْسِ الْحَوْلِ؟ فَقَالَتْ زَيْنَبُ: «كَانَتِ الْمَرْأَةُ إِذَا تُوُفِّيَ عَنْهَا زَوْجُهَا دَخَلَتْ حِفْشًا، وَلَبِسَتْ شَرَّ ثِيَابِهَا، وَلَمْ تَمَسَّ طِيبًا، وَلَا شَيْئًا حَتَّى تَمُرَّ بِهَا سَنَةٌ، ثُمَّ تُؤْتَى بِدَابَّةٍ - حِمَارٍ، أَوْ شَاةٍ، أَوْ طَيْرٍ - فَتَفْتَضُّ بِهِ، فَقَلَّمَا تَفْتَضُّ بِشَيْءٍ إِلَّا مَاتَ، ثُمَّ تَخْرُجُ، فَتُعْطَى بَعْرَةً، فَتَرْمِي بِهَا، ثُمَّ تُرَاجِعُ بَعْدُ مَا شَاءَتْ مِنْ طِيبٍ أَوْ غَيْرِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "19",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 119,
                    "chapterNumber": "19",
                    "chapterEnglish": "The Book of Divorce",
                    "chapterUrdu": "طلاق کے احکام و مسائل",
                    "chapterArabic": "كتاب الطَّلَاقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11293,
                "hadithNumber": "3729",
                "englishNarrator": "Zainab bint Umm Salama (رضی اللہ عنہا) reported:",
                "hadithEnglish": "A relative of Umm Habiba (رضی اللہ عنہا) died. She sent for a yellow (perfume) and applied that to her forearm and said: I, am doing it, for I have heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saying: It is not permissible for a woman believing in Allah and the Hereafter to mourn beyond three days except the husband (for whom she can mourn) for four months and ten days.",
                "hadithUrdu": "ام حبیبہ رضی اللہ عنہا کا کوئی انتہائی قریبی عزیز فوت ہو گیا ۔ انہوں نے زرد رنگ کی خوشبو منگوائی اور اسے ہلکا سا اپنے ( رخسار اور ) بازوؤں پر لگایا ، اور کہا : میں اس لیے ایسا کر رہی ہوں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ فرما رہے تھے : \" کسی عورت کے لیے جو اللہ تعالیٰ اور آخرت کے دن پر ایمان رکھتی ہو ، حلال نہیں کہ وہ ( کسی مرنے والے پر ) تین دن سے زیادہ سوگ منائے ، مگر خاوند پر چار مہینے دس دن ( سوگ منائے).",
                "urduNarrator": "ہم سے محمد بن المثنیٰ نے بیان کیا، ہم سے محمد بن جعفر نے بیان کیا، ہم سے شعبہ نے بیان کیا،حمید بن نافع سے روایت ہے ، انہوں نے کہا : میں نے زینب بنت ام سلمہ رضی اللہ عنہا سے سنا ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ حُمَيْدِ بْنِ نَافِعٍ، قَالَ: سَمِعْتُ زَيْنَبَ بِنْتَ أُمِّ سَلَمَةَ، قَالَتْ: تُوُفِّيَ حَمِيمٌ لِأُمِّ حَبِيبَةَ، فَدَعَتْ بِصُفْرَةٍ، فَمَسَحَتْهُ بِذِرَاعَيْهَا، وَقَالَتْ: إِنَّمَا أَصْنَعُ هَذَا لِأَنِّي سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا يَحِلُّ لِامْرَأَةٍ تُؤْمِنُ بِاللهِ وَالْيَوْمِ الْآخِرِ أَنْ تُحِدَّ فَوْقَ ثَلَاثٍ، إِلَّا عَلَى زَوْجٍ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "19",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 119,
                    "chapterNumber": "19",
                    "chapterEnglish": "The Book of Divorce",
                    "chapterUrdu": "طلاق کے احکام و مسائل",
                    "chapterArabic": "كتاب الطَّلَاقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11294,
                "hadithNumber": "3730",
                "englishNarrator": null,
                "hadithEnglish": "This hadith was narrated by Zainab from her mother and from Zainab رضی اللہ عنہا , the wife of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), or from some other lady from among the wives of the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌).",
                "hadithUrdu": "زینب نے انہیں ( حمید کو ) اپنی والدہ ( حضرت ام سلمہ رضی اللہ عنہا ) سے اور نبی صلی اللہ علیہ وسلم کی اہلیہ حضرت زینب رضی اللہ عنہا سے یا نبی صلی اللہ علیہ وسلم کی ازواج میں سے کسی سے یہی حدیث بیان کی.",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَتْهُ زَيْنَبُ، عَنْ أُمِّهَا، وَعَنْ زَيْنَبَ زَوْجِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، أَوْ عَنِ امْرَأَةٍ مِنْ بَعْضِ أَزْوَاجِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "19",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 119,
                    "chapterNumber": "19",
                    "chapterEnglish": "The Book of Divorce",
                    "chapterUrdu": "طلاق کے احکام و مسائل",
                    "chapterArabic": "كتاب الطَّلَاقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11295,
                "hadithNumber": "3731",
                "englishNarrator": "Zainab bint Umm Salama (رضی اللہ عنہا) reported on the authority of her mother:",
                "hadithEnglish": "A woman lost her husband. (As her eyes were ailing) they (her kith and kin) entertained fear about her eyes, so they came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and sought permission for the use of collyrium, whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: One among you used to spend one year in a dungeon dressed in worst clothes. (And at the end of this period) she threw dung at the dog which happened to pass that way and then she came out (of her 'Idda). Can't she (wait) even for four months and ten days?",
                "hadithUrdu": "ایک عورت کا شوہر فوت ہو گیا ، انہیں اس کی آنکھ کے بارے میں ( بیماری لاحق ہونے کا ) خطرہ محسوس ہوا تو وہ نبی صلی اللہ علیہ وسلم کے پاس آئے ، اور آپ سے سرمہ لگانے کی اجازت مانگی ، اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم میں سے کوئی اپنے گھر کے بدترین حصے میں اپنے ٹاٹوں میں ۔ ۔ یا فرمایا : اپنے بدترین ٹاٹوں میں اپنے گھر کے اندر ۔ ۔ ۔ سال بھر رہتی ، اس کے بعد جب کوئی کتا گزرتا تو وہ ایک لید پھینکتی اور باہر نکلتی تو کیا ( اب ) چار مہینے دس دن ( صبر ) نہیں ( کر سکتی).",
                "urduNarrator": "ہم سے محمد بن المثنیٰ نے بیان کیا، ہم سے محمد بن جعفر نے بیان کیا، ہم سے شعبہ نے بیان کیا،حمید بن نافع سے روایت ہے ، انہوں نے کہا : میں نے زینب بنت ام سلمہ رضی اللہ عنہا سے سنا وہ اپنی والدہ سے حدیث بیان کر رہی تھیں کہ",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ حُمَيْدِ بْنِ نَافِعٍ، قَالَ: سَمِعْتُ زَيْنَبَ بِنْتَ أُمِّ سَلَمَةَ، تُحَدِّثُ عَنْ أُمِّهَا، أَنَّ امْرَأَةً تُوُفِّيَ زَوْجُهَا، فَخَافُوا عَلَى عَيْنِهَا، فَأَتَوُا النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَاسْتَأْذَنُوهُ فِي الْكُحْلِ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «قَدْ كَانَتْ إِحْدَاكُنَّ تَكُونُ فِي شَرِّ بَيْتِهَا فِي أَحْلَاسِهَا - أَوْ فِي شَرِّ أَحْلَاسِهَا - فِي بَيْتِهَا حَوْلًا، فَإِذَا مَرَّ كَلْبٌ رَمَتْ بِبَعْرَةٍ، فَخَرَجَتْ، أَفَلَا أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "19",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 119,
                    "chapterNumber": "19",
                    "chapterEnglish": "The Book of Divorce",
                    "chapterUrdu": "طلاق کے احکام و مسائل",
                    "chapterArabic": "كتاب الطَّلَاقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11296,
                "hadithNumber": "3732",
                "englishNarrator": null,
                "hadithEnglish": "Humaid bin Nafi' narrated two traditions from Umm Salama رضی اللہ عنہا dealing with collyrium and the other hadith from the wives of Allah's Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) except with this that no mention was made of Zainab.",
                "hadithUrdu": "معاذ بن معاذ نے ہمیں حدیث بیان کی ، ( کہا : ) ہمیں شعبہ نے حمید بن نافع سے اکٹھی دو حدیثیں بیان کیں ، سرمہ لگانے کے بارے میں ام سلمہ رضی اللہ عنہا کی حدیث اور ام سلمہ رضی اللہ عنہا اور نبی صلی اللہ علیہ وسلم کی ازواج میں سے ایک اور بیوی کی حدیث ، البتہ انہوں نے ان کا نام ، زینب نہیں لیا ۔ ۔ ۔ ( باقی حدیث ) محمد بن جعفر کی ( سابقہ ) حدیث کی طرح ( بیان کی).",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ حُمَيْدِ بْنِ نَافِعٍ بِالْحَدِيثَيْنِ جَمِيعًا حَدِيثِ أُمِّ سَلَمَةَ فِي الْكُحْلِ، وَحَدِيثِ أُمِّ سَلَمَةَ، وَأُخْرَى مِنْ أَزْوَاجِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، غَيْرَ أَنَّهُ لَمْ تُسَمِّهَا زَيْنَبَ، نَحْوَ حَدِيثِ مُحَمَّدِ بْنِ جَعْفَرٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "19",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 119,
                    "chapterNumber": "19",
                    "chapterEnglish": "The Book of Divorce",
                    "chapterUrdu": "طلاق کے احکام و مسائل",
                    "chapterArabic": "كتاب الطَّلَاقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11297,
                "hadithNumber": "3733",
                "englishNarrator": "Zainab bint Abu Salama رضی اللہ عنہا reported:",
                "hadithEnglish": "Umm Salama and Umm Habiba (رضی اللہ عنہا) were talking with each other (and saying) that a woman came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and mentioned to him that her daughter had lost her husband, and her eyes were sore and she wnted to use collyrium, whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: One among you used to throw dung at the end of a year, and now (this abstinence from adornment) is only for four months and ten days.",
                "hadithUrdu": "وہ حضرت ام سلمہ اور حضرت ام حبیبہ رضی اللہ عنہا سے حدیث بیان کر رہی تھیں ، وہ دونوں یہ بتا رہی تھیں کہ ایک عورت رسول اللہ صلی اللہ علیہ وسلم کے پاس حاضر ہوئی اور عرض کی کہ اس کی ایک بیٹی کا شوہر فوت ہو گیا ہے ، اس کی آنکھ میں تکلیف ہو گئی ہے وہ چاہتی ہے کہ اس میں سرمہ لگائے ، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" بلاشبہ تم میں سے کوئی عورت ( پورا ) سال گزرنے پر لید پھینکا کرتی تھی ، اور یہ تو صرف چار مہینے دس دن ہیں.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور عمرو الناقد نے بیان کیا، کہا کہ ہم سے یزید بن ہارون نے بیان کیا، کہا ہم سے یحییٰ بن سعید نے بیان کیا, حمید بن نافع سے روایت ہے کہ انہوں نے زینب بنت ابی سلمہ رضی اللہ عنہا سے سنا",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ قَالَا حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ حُمَيْدِ بْنِ نَافِعٍ أَنَّهُ سَمِعَ زَيْنَبَ بِنْتَ أَبِي سَلَمَةَ تُحَدِّثُ عَنْ أُمِّ سَلَمَةَ وَأُمِّ حَبِيبَةَ تَذْكُرَانِ أَنَّ امْرَأَةً أَتَتْ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَتْ لَهُ أَنَّ بِنْتًا لَهَا تُوُفِّيَ عَنْهَا زَوْجُهَا فَاشْتَكَتْ عَيْنُهَا فَهِيَ تُرِيدُ أَنْ تَكْحُلَهَا، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «قَدْ كَانَتْ إِحْدَاكُنَّ تَرْمِي بِالْبَعْرَةِ عِنْدَ رَأْسِ الْحَوْلِ وَإِنَّمَا هِيَ أَرْبَعَةُ أَشْهُرٍ وَعَشْرٌ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "19",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 119,
                    "chapterNumber": "19",
                    "chapterEnglish": "The Book of Divorce",
                    "chapterUrdu": "طلاق کے احکام و مسائل",
                    "chapterArabic": "كتاب الطَّلَاقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11298,
                "hadithNumber": "3734",
                "englishNarrator": "Zainab bint Abu Salama رضی اللہ عنہا reported:",
                "hadithEnglish": "When the news of the death of Abu Safyan رضی اللہ عنہ came to Umm Habiba رضی اللہ عنہا she sent for yellow (perfume) on the third day and rubbed it on her forearms and on her cheeks and said: I had in fact no need of it, but I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: It is not permissible for the women believing in Allah and the Hereafter to abstain from adornment beyond three days except (at the death of) husband (in which case she must abstain from adornment) for four months and ten days.",
                "hadithUrdu": "جب ام حبیبہ رضی اللہ عنہا کے پاس ( ان کے والد ) ابوسفیان رضی اللہ عنہ کی موت کی خبر آئی تو انہوں نے تیسرے دن زرد رنگ کی خوشبو منگوائی اور اسے اپنے بازوؤں اور رخساروں پر ہلکا سا لگایا اور کہا : مجھے اس کی ضرورت نہ تھی ، ( مگر ) میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا تھا : \" کسی عورت کے لیے جو اللہ تعالیٰ اور آخرت کے دن پر ایمان رکھتی ہو ، حلال نہیں کہ وہ ( کسی مرنے والے پر ) تین دن سے زیادہ سوگ منائے ، سوائے شوہر کے ، وہ اس پر چار مہینے دس دن سوگ منائے.",
                "urduNarrator": "ہم سے عمرو ناقد اور ابن ابی عمر نے بیان کیا، اور ہم سے سفیان بن عیینہ نے بیان کیا، وہ ایوب بن موسیٰ سے، حمید بن نافع نے, پر زینب بنت ابی سلمہ رضی اللہ عنہا سے روایت ہے ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا عَمْرٌو النَّاقِدُ، وَابْنُ أَبِي عُمَرَ، وَاللَّفْظُ لِعَمْرٍو، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَيُّوبَ بْنِ مُوسَى، عَنْ حُمَيْدِ بْنِ نَافِعٍ، عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ، قَالَتْ: لَمَّا أَتَى أُمَّ حَبِيبَةَ نَعِيُّ أَبِي سُفْيَانَ، دَعَتْ فِي الْيَوْمِ الثَّالِثِ بِصُفْرَةٍ، فَمَسَحَتْ بِهِ ذِرَاعَيْهَا، وَعَارِضَيْهَا، وَقَالَتْ: كُنْتُ عَنْ هَذَا غَنِيَّةً، سَمِعْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا يَحِلُّ لِامْرَأَةٍ تُؤْمِنُ بِاللهِ وَالْيَوْمِ الْآخِرِ، أَنْ تُحِدَّ فَوْقَ ثَلَاثٍ، إِلَّا عَلَى زَوْجٍ، فَإِنَّهَا تُحِدُّ عَلَيْهِ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "19",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 119,
                    "chapterNumber": "19",
                    "chapterEnglish": "The Book of Divorce",
                    "chapterUrdu": "طلاق کے احکام و مسائل",
                    "chapterArabic": "كتاب الطَّلَاقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11299,
                "hadithNumber": "3735",
                "englishNarrator": "Safiyya bint Abu 'Ubaid reported on the authority of Hafsa رضی اللہ عنہا or 'A'isha ( رضی اللہ عنہا) or from both of them:",
                "hadithEnglish": "Allah's Messenger (ﷺ) said: It is not permissible for a woman believing in Allah and the Hereafter (or believing in Allah and His Messenger) that she should observe mourning for the dead beyond three days except in case of her husband.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کسی عورت کے لیے ، جو اللہ تعالیٰ اور آخرت کے دن پر ایمان رکھتی ہے ۔ ۔ یا فرمایا : اللہ تعالیٰ اور اس کے رسول صلی اللہ علیہ وسلم پر ایمان رکھتی ہے ۔ ۔ حلال نہیں کہ وہ اپنے شوہر کے سوا کسی بھی مرنے والے پر تین دن سے زیادہ سوگ منائے.",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ، قتیبہ اور ابن روم نے بیان کیا, لیث بن سعد نے نافع سے روایت کی کہ صفیہ بنت ابی عبید نے انہیں حضرت حفصہ رضی اللہ عنہا سے یا حضرت عائشہ رضی اللہ عنہا سے یا ان دونوں سے حدیث بیان کی کہ",
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَقُتَيْبَةُ، وَابْنُ رُمْح، عَنِ اللَّيْثِ بْنِ سَعْدٍ، عَنْ نَافِعٍ، أَنَّ صَفِيَّةَ بِنْتَ أَبِي عُبَيْدٍ، حَدَّثَتْهُ، عَنْ حَفْصَةَ، أَوْ عَنْ عَائِشَةَ، أَوْ عَنْ كِلْتَيْهِمَا، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَحِلُّ لِامْرَأَةٍ تُؤْمِنُ بِاللهِ وَالْيَوْمِ الْآخِرِ - أَوْ تُؤْمِنُ بِاللهِ وَرَسُولِهِ - أَنْ تُحِدَّ عَلَى مَيِّتٍ فَوْقَ ثَلَاثَةِ أَيَّامٍ، إِلَّا عَلَى زَوْجِهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "19",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 119,
                    "chapterNumber": "19",
                    "chapterEnglish": "The Book of Divorce",
                    "chapterUrdu": "طلاق کے احکام و مسائل",
                    "chapterArabic": "كتاب الطَّلَاقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11300,
                "hadithNumber": "3736",
                "englishNarrator": null,
                "hadithEnglish": "A hadith similar to that of Al-Laith (no. 3735) was narrated from Nafi with this chain.",
                "hadithUrdu": "ہم سے شیبان بن فرخ نے بیان کیا، کہا ہم سے عبد العزیز نے، یعنی ہم سے ابن مسلم نے بیان کیا, عبداللہ بن دینار نے نافع سے لیث کی حدیث کی سند کے ساتھ اسی کی مانند روایت بیان کی.",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَاهُ شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُسْلِمٍ، حَدَّثَنَا عَبْدُ اللهِ بْنُ دِينَارٍ، عَنْ نَافِعٍ، بِإِسْنَادِ حَدِيثِ اللَّيْثِ مِثْلَ رِوَايَتِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "19",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 119,
                    "chapterNumber": "19",
                    "chapterEnglish": "The Book of Divorce",
                    "chapterUrdu": "طلاق کے احکام و مسائل",
                    "chapterArabic": "كتاب الطَّلَاقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11301,
                "hadithNumber": "3737",
                "englishNarrator": "Safiyya bint Abu 'Ubaid reported:",
                "hadithEnglish": "She heard Hafsa daughter of Umar (رضی اللہ عنہا), (and) wife of Allah's Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), narrating a hadith like this from Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), and she made this addition: She should abstain from adorning herself (in case of the death of her husband) for four months and ten days.",
                "hadithUrdu": "انہوں نے نبی صلی اللہ علیہ وسلم کی زوجہ حفصہ بنت عمر رضی اللہ عنہا سے سنا ، وہ نبی صلی اللہ علیہ وسلم سے حدیث بیان کر رہی تھیں ۔ ۔ ۔ جس طرح لیث اور ابن دینار کی حدیث ہے , اور یہ اضافہ کیا \" وہ اس پر چار مہینے دس دن سوگ منائے گی.",
                "urduNarrator": "ہم سے ابو غسان المسمعی اور محمد بن المثنیٰ نے بیان کیا، کہا: ہم سے عبد الوہاب نے بیان کیا، انہوں نے کہا یحییٰ بن سعید کہتے ہیں : میں نے نافع سے سنا ، وہ صفیہ بنت ابوعبید سے حدیث بیان کر رہے تھے کہ",
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو غَسَّانَ الْمِسْمَعِيُّ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالَا: حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ: سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ، يَقُولُ: سَمِعْتُ نَافِعًا، يُحَدِّثُ عَنْ صَفِيَّةَ بِنْتِ أَبِي عُبَيْدٍ، أَنَّهَا سَمِعَتْ حَفْصَةَ بِنْتَ عُمَرَ، زَوْجَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ تُحَدِّثُ عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ اللَّيْثِ، وَابْنِ دِينَارٍ، وَزَادَ فَإِنَّهَا تُحِدُّ عَلَيْهِ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "19",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 119,
                    "chapterNumber": "19",
                    "chapterEnglish": "The Book of Divorce",
                    "chapterUrdu": "طلاق کے احکام و مسائل",
                    "chapterArabic": "كتاب الطَّلَاقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11302,
                "hadithNumber": "3738",
                "englishNarrator": null,
                "hadithEnglish": "Safiyya bint Abu 'Ubaid narrated this tradition of Allah's Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) on the authority of some wives of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ )",
                "hadithUrdu": "ہم سے ابو الربیع نے بیان کیا، ہم سے حماد نے بیان کیا،ایوب اور عبیداللہ دونوں نے نافع سے ، انہوں نے صفیہ بنت ابی عبید سے ، انہوں نے نبی صلی اللہ علیہ وسلم کی کسی اور اہلیہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے ان ( لیث بن سعد ، عبداللہ بن دینار اور یحییٰ بن سعید ) کی حدیث کے ہم معنی حدیث روایت کی.",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا أَبُو الرَّبِيعِ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، ح وحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللهِ، جَمِيعًا عَنْ نَافِعٍ، عَنْ صَفِيَّةَ بِنْتِ أَبِي عُبَيْدٍ، عَنْ بَعْضِ أَزْوَاجِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَى حَدِيثِهِمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "19",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 119,
                    "chapterNumber": "19",
                    "chapterEnglish": "The Book of Divorce",
                    "chapterUrdu": "طلاق کے احکام و مسائل",
                    "chapterArabic": "كتاب الطَّلَاقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11303,
                "hadithNumber": "3739",
                "englishNarrator": "A'isha (رضی اللہ عنہا) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: It is not permissible for a woman believing in Allah and the Hereafter to observe mourning on the dead for more than three (days), except in case of her husband.",
                "hadithUrdu": "آپ نے فرمایا : \" کسی عورت کے لیے ، جو اللہ تعالیٰ اور قیامت کے دن پر ایمان رکھتی ہے ، حلال نہیں کہ وہ اپنے شوہر کے سوا کسی مرنے والے پر تین دن سے زیادہ سوگ منائے.",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ، ابوبکر بن ابی شیبہ، عمرو ناقد اور زہیر بن حرب نے بیان کیا اور تلفظ یحییٰ کا ہے۔ ہم سے انہوں نے بیان کیا اور دوسروں نے کہا : ہم سے سفیان بن عیینہ نے زہری سے اور عروہ کی سند سے بیان کیا ,حضرت عائشہ رضی اللہ عنہا نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، وَاللَّفْظُ لِيَحْيَى، قَالَ يَحْيَى: أَخْبَرَنَا، وَقَالَ الْآخَرُونَ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: لَا يَحِلُّ لِامْرَأَةٍ تُؤْمِنُ بِاللهِ وَالْيَوْمِ الْآخِرِ، أَنْ تُحِدَّ عَلَى مَيِّتٍ فَوْقَ ثَلَاثٍ، إِلَّا عَلَى زَوْجِهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "19",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 119,
                    "chapterNumber": "19",
                    "chapterEnglish": "The Book of Divorce",
                    "chapterUrdu": "طلاق کے احکام و مسائل",
                    "chapterArabic": "كتاب الطَّلَاقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11304,
                "hadithNumber": "3740",
                "englishNarrator": "Umm `Atiyya ( رضی اللہ عنہا) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had said: A woman must not observe mourning for one who had died for more than three (days) except for four months and ten days in the case of her husband. And she must not wear a dyed garment except one of the types made of dyed yarn, or apply collyrium, or touch perfume except a little perfume or incense, when she has been purified after her courses.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کوئی عورت کسی مرنے والے پر تین دن سے زیادہ سوگ نہ منائے ، مگر خاوند پر ، ( اس پر ) چار مہینے دس دن ( سوگ منائے ) نہ وہ عَصب کے خانہ دار کپڑے کے سوا کوئی رنگا ہوا کپڑا پہنے ، نہ سرمہ لگائے ، مگر ( اس دوران میں ) جب ( حیض سے ) پاک ہو تو معمولی سی قُسط یا اظفار ( جیسی کوئی چیز ) استعمال کر لے ۔ \" ( یہ دونوں خوشبوئیں نہیں ، صرف بدبو کو زائل کرنے والے بخور ہیں.",
                "urduNarrator": "ہم سے حسن بن الربیع نے بیان کیا, ابن ادریس نے ہمیں ہشام سے حدیث بیان کی ، انہوں نے حضرت حفصہ رضی اللہ عنہا سے اور انہوں نے ام عطیہ رضی اللہ عنہا سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَا حَسَنُ بْنُ الرَّبِيعِ، حَدَّثَنَا ابْنُ إِدْرِيسَ، عَنْ هِشَامٍ، عَنْ حَفْصَةَ، عَنْ أُمِّ عَطِيَّةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تُحِدُّ امْرَأَةٌ عَلَى مَيِّتٍ فَوْقَ ثَلَاثٍ، إِلَّا عَلَى زَوْجٍ، أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا، وَلَا تَلْبَسُ ثَوْبًا مَصْبُوغًا، إِلَّا ثَوْبَ عَصْبٍ، وَلَا تَكْتَحِلُ، وَلَا تَمَسُّ طِيبًا، إِلَّا إِذَا طَهُرَتْ، نُبْذَةً مِنْ قُسْطٍ أَوْ أَظْفَارٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "19",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 119,
                    "chapterNumber": "19",
                    "chapterEnglish": "The Book of Divorce",
                    "chapterUrdu": "طلاق کے احکام و مسائل",
                    "chapterArabic": "كتاب الطَّلَاقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11305,
                "hadithNumber": "3741",
                "englishNarrator": "It was narrated from Hisham with this chain (a Hadith similar to no.3740), and he said:",
                "hadithEnglish": "\"As soon as her menses and a little of Qust or Azhar.",
                "hadithUrdu": "\" طہر کے آغاز میں تھوڑی سی قسط اور اظفار لگا لے.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، انہوں نے کہا عبداللہ بن نمیر اور یزید بن ہارون ، دونوں نے ہشام سے اسی سند کے ساتھ روایت کی ، اور دونوں نے کہا",
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللهِ بْنُ نُمَيْرٍ، ح وحَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، كِلَاهُمَا عَنْ هِشَامٍ، بِهَذَا الْإِسْنَادِ. وَقَالَا: «عِنْدَ أَدْنَى طُهْرِهَا نُبْذَةً مِنْ قُسْطٍ وَأَظْفَارٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "19",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 119,
                    "chapterNumber": "19",
                    "chapterEnglish": "The Book of Divorce",
                    "chapterUrdu": "طلاق کے احکام و مسائل",
                    "chapterArabic": "كتاب الطَّلَاقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11306,
                "hadithNumber": "3742",
                "englishNarrator": "Umm 'Atiyya (رضی اللہ عنہا) said:",
                "hadithEnglish": "We were forbidden to observe mourning for the dead beyond three days except in the case of husband (where it is permissible) for four months and ten days, and (that during this period) we should neither use collyrium nor touch perfume, nor wear dyed clothes, but concession was given to a woman when one of us was purified of our courses to make use of a little incense or scent.",
                "hadithUrdu": "ہم کسی مرنے والے پر تین دن سے زیادہ سوگ منائیں ۔ مگر خاوند پر ، ( اس پر ) چار مہینے دس دن ( سوگ ہے ۔ ) نہ سرمہ لگائیں ، نہ خوشبو استعمال کریں اور نہ رنگا ہوا کپڑا پہنیں ، اور عورت کو اس کے طہر میں ، جب ہم میں سے کوئی اپنے حیض سے غسل کر لے ، اجازت دی گئی کہ وہ تھوڑی سی قسط اور اظفار استعمال کر لے.",
                "urduNarrator": "مجھ سے ابو الربیع الزہرانی نے بیان کیا، ہم سے حماد نے بیان کیا,ایوب نے حفصہ سے ، انہوں نے ام عطیہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا : ہمیں منع کیا جاتا تھا کہ",
                "hadithArabic": "وحَدَّثَنِي أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا أَيُّوبُ، عَنْ حَفْصَةَ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ: «كُنَّا نُنْهَى أَنْ نُحِدَّ عَلَى مَيِّتٍ فَوْقَ ثَلَاثٍ، إِلَّا عَلَى زَوْجٍ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا، وَلَا نَكْتَحِلُ، وَلَا نَتَطَيَّبُ، وَلَا نَلْبَسُ ثَوْبًا مَصْبُوغًا، وَقَدْ رُخِّصَ لِلْمَرْأَةِ فِي طُهْرِهَا إِذَا اغْتَسَلَتْ إِحْدَانَا مِنْ مَحِيضِهَا، فِي نُبْذَةٍ مِنْ قُسْطٍ وَأَظْفَارٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "19",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 119,
                    "chapterNumber": "19",
                    "chapterEnglish": "The Book of Divorce",
                    "chapterUrdu": "طلاق کے احکام و مسائل",
                    "chapterArabic": "كتاب الطَّلَاقِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11307,
                "hadithNumber": "3743",
                "englishNarrator": "Sahl bin Sa'd al-Sa'idi رضی اﷲ عنہ reported:",
                "hadithEnglish": "'Uwaimir al-'Ajlani came to 'Asim bin 'Adi al-Ansari and said to him. Tell me about a person who finds a man with his wife; should he kill him, and be killed In retaliation; or how should he act? 'Asim رضی اﷲ عنہ , ask for me (religious verdict about it) from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). So 'Asim رضی اﷲ عنہ asked Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and he did not like this question and he disapproved of it so much that'Asim felt aggrieved at what he had heard from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). When 'Asim came back to his family, 'Uwaimir came to him and said: 'Asim, what did Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) say to you? 'Asim said to 'Uwaimir: You did not bring something good. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) did not like this religious verdict that I sought from him. 'Uwaimir said: By Allah, I will not rest until I have asked him about it. 'Uwaimir proceeded until he came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as he was sitting amidst people, and said: Messenger of Allah, tell me about a person who found a man with his wife. Should he kill him, and then you would kill him, or how should he act? Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: (Verses) have been revealed concerning you and your wife; so go and bring her. Sahl said that they both invoked curses (and further said): I was along with people in the company of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). And when they had finished, Uwaimir said: Allah's Messenger, I shall have told a lie against her if I keep her (now). So he divorced her with three pronouncements before Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had commanded him. Ibn Shihab said: Subsequently that was the practice of invokers of curses (al Mutala'inain)",
                "hadithUrdu": "عویمر عجلانی ، عاصم بن عدی انصاری کے پاس آیا اور ان سے کہا اے عاصم! بھلا اگر کوئی شخص اپنی جورو کیس اتھ کسی مرد کو دیکھے کیا اس کو مار ڈالے ، پھر تم اس کو مار ڈالو گے یا وہ کیا کرے؟ تو یہ مسئلہ پوچھو میرے واسطے رسول اﷲ ﷺ سے ۔ عاصم رضی اﷲ عنہ نے رسول اﷲ ﷺ سے پوچھا آپ نے اس قسم کے سوالوں کو ناپسند کیا اور ان کی برائی بیان کی ۔ عاصمؓ نے جو رسول اﷲ ﷺ سے سنا وہ ان کو شاق گزرا ۔ جب وہ اپنے لوگوں میں لوٹ کر آئے تو عویمر ان کے پاس آئے اور پوچھا اے عاصمؓ! جناب رسول اﷲ ﷺ نے کیا فرمایا؟ عاصمؓ نے عویمرؓ سے کہا تو میرے اچھی چیز نہیں لایا ۔ رسول اﷲ ﷺ کو تیرا مسئلہ پوچھنا ناگوار ہوا ۔ عویمرؓ نے کہا قسم خدا کی میں تو باز نہ آؤں گا جب تک یہ مسئلہ آپ سے نہ پوچھوں گا ۔ پھر عویمرؓ آیا رسول اﷲ ﷺ کے پاس تمام لوگوں میں اور عرض کیا یارسول اﷲ! آپ کیا فرماتے ہیں اگرکوئی شخص اپنی بی بی کے پاس غیر مرد کو دیکھے اس کو مار ڈالے ، پھر آپ اس کو مار ڈالیں گے ( اس کے قصاص میں ) وہ کیا کرے؟ رسول اﷲ ﷺ نے فرمایا تیرے او رتیری جورو کے باب میں اﷲ کا حکم اُترا ( یعنی آیت لعان کی ) تو جا او راپنی جورو کو لے کر آ ۔ سہلؓ نے کہا پھر دونوں میاں بیبی نے لعان کیا او رمیں لوگوں کے ساتھ رسول اﷲ ﷺ کے پاس موجود تھا جب وہ فارغ ہوئے تو عویمرؓ نے کہا یا رسول اﷲ اگر میں اس عورت کو اب رکھوں تو میں جھوٹا ہوں پھر عویمرؓ نے اس کو تین طلاق دے دیں اس سے پہلے کہ رسول اﷲ ﷺ اس کو حکم کرتے ابن شہاب نے کہا پھر لعان کرنے والوں کا یہی طریقہ ٹھہرگیا ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے مالک کو ابن شہاب کی روایت سے پڑھا کہ,سہل بن سعد ساعدی رضی اﷲ عنہ سے روایت ہے",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، أَنَّ سَهْلَ بْنَ سَعْدٍ، السَّاعِدِيَّ أَخْبَرَهُ أَنَّ عُوَيْمِرًا الْعَجْلاَنِيَّ جَاءَ إِلَى عَاصِمِ بْنِ عَدِيٍّ الأَنْصَارِيِّ فَقَالَ لَهُ أَرَأَيْتَ يَا عَاصِمُ لَوْ أَنَّ رَجُلاً وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً أَيَقْتُلُهُ فَتَقْتُلُونَهُ أَمْ كَيْفَ يَفْعَلُ فَسَلْ لِي عَنْ ذَلِكَ يَا عَاصِمُ رَسُولَ اللَّهِ صلى الله عليه وسلم ‏.‏ فَسَأَلَ عَاصِمٌ رَسُولَ اللَّهِ صلى الله عليه وسلم فَكَرِهَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَسَائِلَ وَعَابَهَا حَتَّى كَبُرَ عَلَى عَاصِمٍ مَا سَمِعَ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمَّا رَجَعَ عَاصِمٌ إِلَى أَهْلِهِ جَاءَهُ عُوَيْمِرٌ فَقَالَ يَا عَاصِمُ مَاذَا قَالَ لَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ عَاصِمٌ لِعُوَيْمِرٍ لَمْ تَأْتِنِي بِخَيْرٍ قَدْ كَرِهَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَسْأَلَةَ الَّتِي سَأَلْتُهُ عَنْهَا ‏.‏ قَالَ عُوَيْمِرٌ وَاللَّهِ لاَ أَنْتَهِي حَتَّى أَسْأَلَهُ عَنْهَا ‏.‏ فَأَقْبَلَ عُوَيْمِرٌ حَتَّى أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم وَسَطَ النَّاسِ فَقَالَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ رَجُلاً وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً أَيَقْتُلُهُ فَتَقْتُلُونَهُ أَمْ كَيْفَ يَفْعَلُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ ‏ قَدْ نَزَلَ فِيكَ وَفِي صَاحِبَتِكَ فَاذْهَبْ فَأْتِ بِهَا ‏ ‏ ‏.‏ قَالَ سَهْلٌ فَتَلاَعَنَا وَأَنَا مَعَ النَّاسِ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمَّا فَرَغَا قَالَ عُوَيْمِرٌ كَذَبْتُ عَلَيْهَا يَا رَسُولَ اللَّهِ إِنْ أَمْسَكْتُهَا ‏.‏ فَطَلَّقَهَا ثَلاَثًا قَبْلَ أَنْ يَأْمُرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَ ابْنُ شِهَابٍ فَكَانَتْ سُنَّةَ الْمُتَلاَعِنَيْنِ ‏.‏",
                "headingArabic": "كتاب اللعان التحفة",
                "headingUrdu": "لیان کی کتاب",
                "headingEnglish": "The book of Li'an",
                "chapterId": "20",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 120,
                    "chapterNumber": "20",
                    "chapterEnglish": "The Book of Invoking Curses",
                    "chapterUrdu": "لعان کا بیان",
                    "chapterArabic": "كتاب اللِّعَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11308,
                "hadithNumber": "3744",
                "englishNarrator": "Sahl bin Sa'd reported:",
                "hadithEnglish": "'Uwaimir al-Ansari ( رضی اﷲ عنہ) from Banu'l-'Ajlan came to 'Asim bin 'Adi ( رضی اﷲ عنہ) the remaining part of the hadith is the same and it was also reecorded in it: And subsequebtly the separation became the practice of al-Mutala'inain. And this addition was also made: She was pregnant and her son was ascribed to her, and it became customary that such (a son) would inherit her and she would inherit him in the share prescribed by Allah for her.",
                "hadithUrdu": "عویمر انصاری رضی اﷲ عنہ جو بنی عجلان میں سے تھا عاصم بن عدی رضی اﷲ عنہ کے پاس آیا پھر بیان کیا حدیث کو اخیر تک اسی طرح جیسے اوپر گزری اور حدیث میں ابن شہاب کا قول بھی شریک کردیاکہ پھر جدائی مرد کو عورت سے سنت ہوگئی لعان کرنے والوں میں اور اتنا زیادہ کیا کہ سہل نے کہا وہ عورت حاملہ تھی اس کے بیٹے کو ماں کی طرف نسبت کرکے پکارتے پھر یہ طریقہ جاری ہوا کہ ایسا لڑکا اپنی ماں کا وارث ہوگا اور وہ اس کی وارث ہوگی اپنے حصہ کے موافق ۔",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، کہا کہ مجھ سے یونس نے بیان کیا، ابن شہاب سے,سہل بن سعد رضی اﷲ عنہ سے روایت ہے",
                "hadithArabic": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي سَهْلُ بْنُ سَعْدٍ الأَنْصَارِيُّ، أَنَّ عُوَيْمِرًا الأَنْصَارِيَّ، مِنْ بَنِي الْعَجْلاَنِ أَتَى عَاصِمَ بْنَ عَدِيٍّ ‏.‏ وَسَاقَ الْحَدِيثَ بِمِثْلِ حَدِيثِ مَالِكٍ وَأَدْرَجَ فِي الْحَدِيثِ قَوْلَهُ وَكَانَ فِرَاقُهُ إِيَّاهَا بَعْدُ سُنَّةً فِي الْمُتَلاَعِنَيْنِ ‏.‏ وَزَادَ فِيهِ قَالَ سَهْلٌ فَكَانَتْ حَامِلاً فَكَانَ ابْنُهَا يُدْعَى إِلَى أُمِّهِ ‏.‏ ثُمَّ جَرَتِ السُّنَّةُ أَنَّهُ يَرِثُهَا وَتَرِثُ مِنْهُ مَا فَرَضَ اللَّهُ لَهَا.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "20",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 120,
                    "chapterNumber": "20",
                    "chapterEnglish": "The Book of Invoking Curses",
                    "chapterUrdu": "لعان کا بیان",
                    "chapterArabic": "كتاب اللِّعَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11309,
                "hadithNumber": "3745",
                "englishNarrator": "Ibn Juraij narrated:",
                "hadithEnglish": "Ibn Shihab narrated about the invokers of curses and the practice of (li'an) based on the authority of Sahl bin Sa'd, of the tribe of Sa'ida. That a person from the Ansar came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: Allah's Messenger, tell me about the person who found a man with his wife. The remaining part of the hadith is the same (but) with this addition: They invoked curses in the mosque and I was present there. And he narrated in the hadith: He divorced her with three pronouncements before Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) commanded him (to get separation). He separated from her in the presence of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), whereupon he said: There is a separation between the invokers of curses.",
                "hadithUrdu": "مجھ سے ابن شہاب نے بیان کیا متاعنین کا حال او ران کا طریقہ سہل بن سعدؓ کی حدیث سے جو بنی ساعدہ میں سے تھا اس نے کہا انصار میں سے ایک شخص رسول اﷲ ﷺ کے پاس آیا اور عرض کیا یارسول اﷲ آپ کیا سمجھتے ہیں اگر کوئی شخص اپنی جورو کے ساتھ کسی مرد کو دیکھے اور بیان کیا سارا قصہ حدیث کا اور اتنا زیادہ کیا کہ پھر دونوں نے لعان کیا مسجد کے اندر اور میں موجود تھا اور اس روایت میں یہ بھی ہے کہ اس شخص نے طلاق دی تین بار اپنی عورت کو رسول اﷲ ﷺ کے حکم کرنے سے پہلے پھر وہ جدا ہوگیا اس سے آپ کے سامنے آپ نے فرمایا یہی جدائی ہے درمیان لعان کرنے والوں کے ۔",
                "urduNarrator": "ہم سے محمد بن رافع نے بیان کیا، ہم سے عبدالرزاق نے بیان کیا، ابن جریج سے روایت ہے کہ",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي ابْنُ شِهَابٍ، عَنِ الْمُتَلاَعِنَيْنِ، وَعَنِ السُّنَّةِ، فِيهِمَا عَنْ حَدِيثِ، سَهْلِ بْنِ سَعْدٍ أَخِي بَنِي سَاعِدَةَ أَنَّ رَجُلاً، مِنَ الأَنْصَارِ جَاءَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ رَجُلاً وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً وَذَكَرَ الْحَدِيثَ بِقِصَّتِهِ ‏.‏ وَزَادَ فِيهِ فَتَلاَعَنَا فِي الْمَسْجِدِ وَأَنَا شَاهِدٌ ‏.‏ وَقَالَ فِي الْحَدِيثِ فَطَلَّقَهَا ثَلاَثًا قَبْلَ أَنْ يَأْمُرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ فَفَارَقَهَا عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ذَاكُمُ التَّفْرِيقُ بَيْنَ كُلِّ مُتَلاَعِنَيْنِ ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "20",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 120,
                    "chapterNumber": "20",
                    "chapterEnglish": "The Book of Invoking Curses",
                    "chapterUrdu": "لعان کا بیان",
                    "chapterArabic": "كتاب اللِّعَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11310,
                "hadithNumber": "3746",
                "englishNarrator": "Sa'id bin Jubair رضی اﷲ عنہ reported:",
                "hadithEnglish": "I was asked about the invokers of curses during the reign of Mus'ab (bin Zubair) whether they could separate (themselves by this process). He said: I did not understand what to say. So I went to the house of Ibn 'Umar ( رضی اﷲ عنہ) in Mecca. I said to his servant: Seek permission for Me. He said that he (Ibn 'Umar رضی اﷲ عنہ) had been taking rest. He (Ibn 'Umar رضی اﷲ عنہ) heard my voice. and said: Are you Ibn Jubair? I said: Yes. He 'said: Come in. By Allah, it must be some (great) need which has brought you here at this Hour. So I got in and found him lying on a blanket reclining against a pillow stuffed with fibres of date-palm. I said: O Abu'Abd al-Rahman, should there be separation between the invokers of curses? He said: Hallowed be Allah, yes, The first one who asked about it was so and so. he said: Messenger of Allah, tell me If one of us finds his wife committing adultery: what should he do? If he talks, that is something great, and if he keeps quiet that is also (something great) (which he cannot afford to do). Allah's Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) kept quiet (or some time). After some time he (that very person) came to him (Allah's Messenger) and said: I have been involved in that very cage about which I had asked you Allah the Exalted and Majestic then revealed (these) verses of Surah Nur: Those who accuse their wives (verse 6), and he (the Holy Prophet) recited them to him and admonished him, and exhorted him and informed him that the torment of the world is less painful than the torment of the Hereafter. He said: No, by Him Who sent you with Truth, I did not tell a lie against her. He (the Holy Prophet) then called her (the wife of that person who had accused her) and admonished her, and exhorted her, and informed her that the torment of this world is less painful than the torment of the Hereafter. She said: No, by Him Who sent thee with Truth, he is a liar. (it was) the man who started the swearing of oath and he swore in the name of Allah four times that he was among the truthful. and at the fifth turn he said: Let there be curse of Allah upon him if he were among the liars. Then the woman was called and she swore four times in the name of Allah that he (her husband) was among the liars, and at the fifth time (she said): Let there be curse upon her if he were among the truthful. He (the Holy Prophet) then effected separation between the two.",
                "hadithUrdu": "لعان کرنے والوں کا مسئلہ مصعب بن زبیر کی خلافت میں میں حیران ہوا کیا جواب دوں تو میں چلا عبدﷲ بن عمر رضی اﷲ عنہ کے مکان کی طرف مکہ میں او ران کے غلام سے کہا میری عرض کرو اس نے کہا وہ آرام کرتے ہیں انہوں نے میری آواز سنی او رکہا کیا جبیر کا بیٹا ہے؟ میں نے کہا ہاں انہوں نے کہا اندر آ قسم خدا کی تو کسی کام سے آیا ہوگا میں اندر آگیا تو وہ ایک کمبل بچھائے بیٹھے تھے او رایک تکیے پر ٹیک لگائے تھے جو چھال سے کھجور کی بھرا ہوا تھا ۔ میں نے کہا اے ابوعبدالرحمن! لعان کرنے والوں میں جدائی کی جائے گی؟ انہوں نے کہا سبحان اﷲ بے شک جدائی کی جائے گی اور سب سے پہلے اس باب میں فلاں نے پوچھا جو فلاں کا بیٹا تھا رسول اﷲ ﷺ سے ۔ اس نے کہا یا رسول اﷲ آپ کیا سمجھتے ہیں اگر ہم میں سے کوئی اپنی عورت کو برا کام کراتے دیکھے تو کیا کرے ، اگر منہ سے نکالے تو بری بات نکالے گا اگر چپ رہے تو ایسی بری بات سے کیونکر چپ رہے؟ رسول اﷲ ﷺ یہ سن کر چپ ہورہے اور جواب نہیں دیا ۔ پھر وہ شخص آپ کے پاس آیا اور کہنے لگا یا رسول اﷲ ۔ جو بات میں نے آپ سے پوچھی تھی میں خود اس میں پڑگیا ۔ تب اﷲ تعالیٰ نے یہ آیتیں اتاریں سورۂ نور میں والذین یرمون ازواجھم آخر تک ۔ آپ نے یہ آیتیں مرد کو پڑھ کر سنائیں اور اس کو نصیحت کی اور سمجھایا کہ دنیا کا عذاب آخرت کے عذاب سے آسان ہے ۔ ( یعنی اگر تو جھوٹ طوفان باندھتا ہے تو اب بھی بول دے ، حد قذف کے اسی کوڑے پڑجائیں گے ، مگر یہ جہنم میں جلنے سے آسان ہے ) ۔ وہ بولا نہیں قسم اس کی جس نے آپ کو سچائی کے ساتھ بھیجا میں نے عورت پر طوفان نہیں جوڑا ۔ پھر آپ نے عوت کو بلایااوراس کو ڈرایا اور سمجھایا اور فرمایا دنیا کا عذاب سہل ہے آخرت کے عذاب سے ۔ وہ بولی نہیں قسم اس کی جس نے آپ کو سچائی کیس اتھ بھیجا ہے میرا خاوند جھوٹ بولتا ہے ۔ تب آپ نے شروع کیا مرد سے اور اس نے چار گواہیاں دیں اﷲ تعالیٰ کے نام کی مقرر وہ سچا ہے اور پانچویں بار میں یہ کہا کہ خدا کی پھٹکار ہو اس پر اگر وہ جھوٹا ہو ۔ پھر عورت کو بلایا اس نے چار گواہیاں دیں اﷲ تعالیٰ کے نام کی مقرر مرد جھوٹا ہے اور پانچویں بار میں یہ کہا اﷲ کا غضب اترے اس پر اگر مرد سچا ہے ۔ اس کے بعد آپ نے جدائی کرادی ان دونوں میں ۔",
                "urduNarrator": "ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا، کہا ہم سے بیان کیا، کہا ہم سے ابوبکر بن ابی شیبہ نے بیان کیا اور اس کا تلفظ عبداللہ نے بیان کیا۔ ہم سے ابن نمیر، عبد الملک ابن ابی سلیمان نے بیان کیا,سعید بن جبیر رضی اﷲ عنہ سے روایت ہے مجھ سے پوچھا گیا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ أَبِي سُلَيْمَانَ، عَنْ سَعِيدِ بْنِ، جُبَيْرٍ قَالَ سُئِلْتُ عَنِ الْمُتَلاَعِنَيْنِ، فِي إِمْرَةِ مُصْعَبٍ أَيُفَرَّقُ بَيْنَهُمَا قَالَ فَمَا دَرَيْتُ مَا أَقُولُ فَمَضَيْتُ إِلَى مَنْزِلِ ابْنِ عُمَرَ بِمَكَّةَ فَقُلْتُ لِلْغُلاَمِ اسْتَأْذِنْ لِي ‏.‏ قَالَ إِنَّهُ قَائِلٌ فَسَمِعَ صَوْتِي ‏.‏ قَالَ ابْنُ جُبَيْرٍ قُلْتُ نَعَمْ ‏.‏ قَالَ ادْخُلْ فَوَاللَّهِ مَا جَاءَ بِكَ هَذِهِ السَّاعَةَ إِلاَّ حَاجَةٌ فَدَخَلْتُ فَإِذَا هُوَ مُفْتَرِشٌ بَرْذَعَةً مُتَوَسِّدٌ وِسَادَةً حَشْوُهَا لِيفٌ قُلْتُ أَبَا عَبْدِ الرَّحْمَنِ الْمُتَلاَعِنَانِ أَيُفَرَّقُ بَيْنَهُمَا قَالَ سُبْحَانَ اللَّهِ نَعَمْ إِنَّ أَوَّلَ مَنْ سَأَلَ عَنْ ذَلِكَ فُلاَنُ بْنُ فُلاَنٍ قَالَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ أَنْ لَوْ وَجَدَ أَحَدُنَا امْرَأَتَهُ عَلَى فَاحِشَةٍ كَيْفَ يَصْنَعُ إِنْ تَكَلَّمَ تَكَلَّمَ بِأَمْرٍ عَظِيمٍ ‏.‏ وَإِنْ سَكَتَ سَكَتَ عَلَى مِثْلِ ذَلِكَ قَالَ فَسَكَتَ النَّبِيُّ صلى الله عليه وسلم فَلَمْ يُجِبْهُ فَلَمَّا كَانَ بَعْدَ ذَلِكَ أَتَاهُ فَقَالَ إِنَّ الَّذِي سَأَلْتُكَ عَنْهُ قَدِ ابْتُلِيتُ بِهِ ‏.‏ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ هَؤُلاَءِ الآيَاتِ فِي سُورَةِ النُّورِ ‏{‏ وَالَّذِينَ يَرْمُونَ أَزْوَاجَهُمْ‏}‏ فَتَلاَهُنَّ عَلَيْهِ وَوَعَظَهُ وَذَكَّرَهُ وَأَخْبَرَهُ أَنَّ عَذَابَ الدُّنْيَا أَهْوَنُ مِنْ عَذَابِ الآخِرَةِ قَالَ لاَ وَالَّذِي بَعَثَكَ بِالْحَقِّ مَا كَذَبْتُ عَلَيْهَا ‏.‏ ثُمَّ دَعَاهَا فَوَعَظَهَا وَذَكَّرَهَا وَأَخْبَرَهَا أَنَّ عَذَابَ الدُّنْيَا أَهْوَنُ مِنْ عَذَابِ الآخِرَةِ ‏.‏ قَالَتْ لاَ وَالَّذِي بَعَثَكَ بِالْحَقِّ إِنَّهُ لَكَاذِبٌ فَبَدَأَ بِالرَّجُلِ فَشَهِدَ أَرْبَعَ شَهَادَاتٍ بِاللَّهِ إِنَّهُ لَمِنَ الصَّادِقِينَ وَالْخَامِسَةُ أَنَّ لَعْنَةَ اللَّهِ عَلَيْهِ إِنْ كَانَ مِنَ الْكَاذِبِينَ ثُمَّ ثَنَّى بِالْمَرْأَةِ فَشَهِدَتْ أَرْبَعَ شَهَادَاتٍ بِاللَّهِ إِنَّهُ لَمِنَ الْكَاذِبِينَ وَالْخَامِسَةُ أَنَّ غَضَبَ اللَّهِ عَلَيْهَا إِنْ كَانَ مِنَ الصَّادِقِينَ ثُمَّ فَرَّقَ بَيْنَهُمَا.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "20",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 120,
                    "chapterNumber": "20",
                    "chapterEnglish": "The Book of Invoking Curses",
                    "chapterUrdu": "لعان کا بیان",
                    "chapterArabic": "كتاب اللِّعَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11311,
                "hadithNumber": "3747",
                "englishNarrator": "Saeed bin Jubair رضی اللہ عنہ said:",
                "hadithEnglish": "\"At the time of Musab bin Az-Zubair, I was asked about the two who engaged in Lian, and I did not know what to say, so I went to 'Abdullah bin Umar رضی اللہ عنہ and I said: 'Do you think that two who engaged in Lian should be separated?... '\" then he mentioned a Hadith like that of Ibn Umair (no. 3746).",
                "hadithUrdu": "مجھ سے مصعب بن الزبیر کے زمانے میں دونوں لعنت کرنے والوں کے بارے میں پوچھا گیا اور مجھے معلوم نہیں تھا کہ میں کیا کہوں، تو میں عبداللہ بن عمر رضی اللہ عنہ کے پاس آیا اور کہا: کیا آپ نے دونوں لعنت کرنے والوں کو دیکھا ہے؟ ان کے درمیان؟\" پھر ابن نمیر کی اسی طرح کی حدیث ذکر کی۔",
                "urduNarrator": "ہم سے علی بن حجر السعدی نے بیان کیا، ہم سے عیسیٰ بن یونس نے بیان کیا، ہم سے عبدالملک بن ابی سلیمان نے بیان کیا، انہوں نے کہا کہ میں نے سعید بن جبیر رضی اللہ عنہ سے سنا، انہوں نے کہا",
                "hadithArabic": "وَحَدَّثَنِيهِ عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ، أَبِي سُلَيْمَانَ قَالَ سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ، قَالَ سُئِلْتُ عَنِ الْمُتَلاَعِنَيْنِ، زَمَنَ مُصْعَبِ بْنِ الزُّبَيْرِ فَلَمْ أَدْرِ مَا أَقُولُ فَأَتَيْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ فَقُلْتُ أَرَأَيْتَ الْمُتَلاَعِنَيْنِ أَيُفَرَّقُ بَيْنَهُمَا ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ ابْنِ نُمَيْرٍ.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "20",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 120,
                    "chapterNumber": "20",
                    "chapterEnglish": "The Book of Invoking Curses",
                    "chapterUrdu": "لعان کا بیان",
                    "chapterArabic": "كتاب اللِّعَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11312,
                "hadithNumber": "3748",
                "englishNarrator": "Ibn Umar (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saying to the invokers of curse: Your account is with Allah. One of you must be a liar. You have now no right over this woman. He said: Messenger of Allah, what about my wealth (dower that I paid her at the time of marriage)? He said: You have no claim to wealth. If you tell the truth, it (dower) is the recompense for your having had the right to intercourse with her, and if you tell a lie against her, it is still more remote from you than she is. Zuhair said in his narration: Sufyan reported to us on the authority of 'Amr that he had heard Sa'id bin Jubair saying: I heard Ibn Umar (رضی اللہ عنہ) saying that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had said it.",
                "hadithUrdu": "عبداﷲ بن عمررضی اللہ عنہ سے روایت ہے کہ رسول اﷲ ﷺ نے فرمایا لعان کرنے والوں کو تم دونوں کا حساب اﷲ تعالیٰ پر ہے ، تم میں سے ایک جھوٹا ہے ۔ آپ نے خاوند سے فرمایا اب تیرا کوئی بس عورت پر نہں ہے کیونکہ وہ تجھ سے ہمیشہ کے لیے جدا ہوگئی ۔ مرد بولا میرا مال یا رسول اﷲ! جو اس نے لیا ہے ۔ آپ نے فرمایا مال تجھ کو نہیں ملے گا ، کیونکہ اگر تو سچا ہے تو مال کا بدلہ ہے جو اس کی فرج تجھ پر حلال ہوگئی اور اگر تو جھوٹا ہے تو مال اور دور ہوگیا ( بلکہ تیرے اوپر اور وبال ہوا جھوٹ کا ) ۔اور اگر تم نے اس سے جھوٹ بولا تو یہ اس سے زیادہ دور ہے، زہیر نے اپنی روایت میں کہا: سفیان نے ہمیں سعید بن جبیر سے سنا وہ کہتے ہیں, میں نے ابن عمر رضی اللہ عنہما کو کہتے سنا: رسول اللہ صلی اللہ علیہ وسلم نے فرمایا:",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ - وَاللَّفْظُ لِيَحْيَى - قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، عَنْ سَعِيدِ بْنِ، جُبَيْرٍ عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِلْمُتَلاَعِنَيْنِ ‏ ‏ حِسَابُكُمَا عَلَى اللَّهِ أَحَدُكُمَا كَاذِبٌ لاَ سَبِيلَ لَكَ عَلَيْهَا ‏ ‏ ‏.‏ قَالَ يَا رَسُولَ اللَّهِ مَالِي قَالَ ‏ ‏ لاَ مَالَ لَكَ إِنْ كُنْتَ صَدَقْتَ عَلَيْهَا فَهْوَ بِمَا اسْتَحْلَلْتَ مِنْ فَرْجِهَا وَإِنْ كُنْتَ كَذَبْتَ عَلَيْهَا فَذَاكَ أَبْعَدُ لَكَ مِنْهَا ‏ ‏ ‏.‏ قَالَ زُهَيْرٌ فِي رِوَايَتِهِ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو سَمِعَ سَعِيدَ بْنَ جُبَيْرٍ يَقُولُ سَمِعْتُ ابْنَ عُمَرَ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "20",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 120,
                    "chapterNumber": "20",
                    "chapterEnglish": "The Book of Invoking Curses",
                    "chapterUrdu": "لعان کا بیان",
                    "chapterArabic": "كتاب اللِّعَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11313,
                "hadithNumber": "3749",
                "englishNarrator": "Ibn 'Umar (رضی اللہ عنہ) said:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) effected separation between the two members of Banu al-'Ajlan, and said: Allah knows that one of you is a liar. Is there one to repent among you?",
                "hadithUrdu": "رسول اﷲ ﷺ نے جدائی کردی بنی عجلان کی جورو اور مرد میں اور فرمایا اﷲ تعالیٰ جانتا ہے تم میں سے کوئی جھوٹا ہے ۔ پھر کیا تم میں سے کوئی توبہ کرتا ہے؟",
                "urduNarrator": "مجھ سے ابو الربیع الزہرانی نے بیان کیا، ہم سے حماد نے، ایوب کی سند سے، سعید بن جبیر سے, عبداﷲ بن عمررضی اللہ عنہ سے روایت ہے",
                "hadithArabic": "وَحَدَّثَنِي أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عُمَرَ، قَالَ فَرَّقَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَ أَخَوَىْ بَنِي الْعَجْلاَنِ وَقَالَ اللَّهُ يَعْلَمُ أَنَّ أَحَدَكُمَا كَاذِبٌ فَهَلْ مِنْكُمَا تَائِبٌ .‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "20",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 120,
                    "chapterNumber": "20",
                    "chapterEnglish": "The Book of Invoking Curses",
                    "chapterUrdu": "لعان کا بیان",
                    "chapterArabic": "كتاب اللِّعَانِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 11001,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=440",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=438",
                "label": "438",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=439",
                "label": "439",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=440",
                "label": "440",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=441",
                "label": "441",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=442",
                "label": "442",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=443",
                "label": "443",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=444",
                "label": "444",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=442",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=442",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=440",
        "to": 11025,
        "total": 40465
    }
}