{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 513,
        "data": [
            {
                "id": 13089,
                "hadithNumber": "5526",
                "englishNarrator": "It was narrated  from Al-Qasim bin Muhammad that Aishah رضی اللہ عنہ told him:",
                "hadithEnglish": "The Messenger of Allah ﷺ entered upon her... a Hadith like that of Ibrahim bin sad (no. 5526) except that he said: \"Then he went to the curtain and tore it down with his own hand.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ان کے ہاں تشریف لائے ، ( آگے اسی طرح ) جس طرح ابراہیم بن سعد کی حدیث ہے ، البتہ انھوں نے کہا : پھر آپ صلی اللہ علیہ وسلم اس ( پردے ) کی طرف لپکے اور اپنے ہاتھ سے اس کو پھاڑ دیا ۔",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا, یونس نے ابن شہاب سے ، انھوں نے قاسم بن محمد سے ، انھوں نے حضرت عائشہ رضی اللہ عنہ سے روایت کی کہ انھوں نے انھیں حدیث بیان کی کہ",
                "hadithArabic": "و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ أَنَّ عَائِشَةَ حَدَّثَتْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا بِمِثْلِ حَدِيثِ إِبْرَاهِيمَ بْنِ سَعْدٍ غَيْرَ أَنَّهُ قَالَ ثُمَّ أَهْوَى إِلَى الْقِرَامِ فَهَتَكَهُ بِيَدِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13090,
                "hadithNumber": "5527",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Zuhri with the same chain of transmitters but with a slight variation of wording.",
                "hadithUrdu": "ہم سے یحییٰ بن یحییٰ، ابوبکر بن ابی شیبہ اور زہیر بن حرب نے ابن عیینہ کی سند سے بیان کیا اور ہم سے اسحاق بن ابراہیم نے بیان کیا۔ اور عبد بن حمید نے کہا: ہمیں عبد الرزاق نے خبر دی: ہمیں معمر نے زہری کی سند سے اس سلسلہ کی خبر دی، اور ان کی حدیث میں لوگوں میں سب سے سخت عذاب نہیں تھا۔ وہ کس کا ذکر کرتے ہیں۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَاه يَحْيَى بْنُ يَحْيَى وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ جَمِيعًا عَنْ ابْنِ عُيَيْنَةَ ح و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَعَبْدُ بْنُ حُمَيْدٍ قَالَا أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ بِهَذَا الْإِسْنَادِ وَفِي حَدِيثِهِمَا إِنَّ أَشَدَّ النَّاسِ عَذَابًا لَمْ يَذْكُرَا مِنْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13091,
                "hadithNumber": "5528",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) visited me. and I had a shelf with a thin cloth curtain hang in. over it and on which there were portraits. No sooner did he see it than he tore it and the colour of his face underwent a change and he said: A'isha, the most grievous torment from the Hand of Allah on the Day of Resurrection would be for those who imitate (Allah) in the act of His creation. A'isha said: We tore it into pieces and made a cushion or two cushions out of that.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم میرے ہاں تشریف لائے اور میں نے اپنے طاق پر موٹا ساکپڑے کا پردہ لٹکایا ہوا تھا جس میں تصویریں تھیں ۔ جب آپ نے اس کے پردے کو دیکھا تو اس کو پھاڑ ڈالاآپ کے چہرہ انور کا رنگ متغیر ہوگیا اور آپ نے فرمایا؛ \"\" عائشہ! رضی اللہ عنہا قیامت کے دن اللہ تعالیٰ کے نزدیک سب سے شدید عذاب کے مستحق وہ لوگ ہوں گے جو اللہ تعالیٰ کی تخلیق کی مشابہت کریں گے ۔ \"\" حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : ہم نے اس پردے کو کاٹ دیااور اس سے ایک یا دو تکیے بنا لیے ( ایک یا دو کے بارے میں شک راوی کی طرف سے ہے ۔ )",
                "urduNarrator": "ابو بکر بن ابی شیبہ اور زہیر بن حرب نے کہا : ہمیں سفیان بن عینیہ نے عبدالرحمن بن قاسم سے حدیث بیان کی ، انھوں نے اپنے والد سے روایت کی کہ انھوں نے حضرت عائشہ رضی اللہ عنہا سے سنا ، وہ کہہ رہی تھیں",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ جَمِيعًا عَنْ ابْنِ عُيَيْنَةَ وَاللَّفْظُ لِزُهَيْرٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ أَنَّهُ سَمِعَ عَائِشَةَ تَقُولُ دَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَدْ سَتَرْتُ سَهْوَةً لِي بِقِرَامٍ فِيهِ تَمَاثِيلُ فَلَمَّا رَآهُ هَتَكَهُ وَتَلَوَّنَ وَجْهُهُ وَقَالَ يَا عَائِشَةُ أَشَدُّ النَّاسِ عَذَابًا عِنْدَ اللَّهِ يَوْمَ الْقِيَامَةِ الَّذِينَ يُضَاهُونَ بِخَلْقِ اللَّهِ قَالَتْ عَائِشَةُ فَقَطَعْنَاهُ فَجَعَلْنَا مِنْهُ وِسَادَةً أَوْ وِسَادَتَيْنِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13092,
                "hadithNumber": "5529",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "She had a cloth having, pictures upon it and it was hanging upon the shelf and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Take it (away) from me (from my sight), so I removed it and made cushions from that.",
                "hadithUrdu": "ان کے پاس ا یک کپڑا تھا جس میں تصویریں تھیں ، وہ طاق پر لٹکا ہوا تھا ، نبی کریم صلی اللہ علیہ وسلم اس طرف رخ کرکے نماز پڑھا کرتے تھے ، آپ صلی اللہ علیہ وسلم نے فرمایا : \" اس کو مجھ سے ہٹا دو ۔ \" تو میں نے اس کو ہٹا دیا اور اسکے تکیے بنالیے ۔",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا, محمد بن جعفر نے کہا : ہمیں شعبہ نے عبدالرحمن بن قاسم سے حدیث بیان کی ، انھوں نے کہا : میں نے قاسم سے سنا ، وہ حضرت عائشہ رضی اللہ عنہا سے حدیث بیان کررہے تھے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ قَالَ سَمِعْتُ الْقَاسِمَ يُحَدِّثُ عَنْ عَائِشَةَ أَنَّهُ كَانَ لَهَا ثَوْبٌ فِيهِ تَصَاوِيرُ مَمْدُودٌ إِلَى سَهْوَةٍ فَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي إِلَيْهِ فَقَالَ أَخِّرِيهِ عَنِّي قَالَتْ فَأَخَّرْتُهُ فَجَعَلْتُهُ وَسَائِدَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13093,
                "hadithNumber": "5530",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters.",
                "hadithUrdu": "اور ہم سے اسحاق بن ابراہیم اور عقبہ بن مکرم نے بیان کیا, سعید بن عامر اور ابو عامر عقدی نے شعبہ سے اسی سند کے ساتھ حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَاه إِسْحَقُ بْنُ إِبْرَاهِيمَ وَعُقْبَةُ بْنُ مُكْرَمٍ عَنْ سَعِيدِ بْنِ عَامِرٍ ح و حَدَّثَنَاه إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا أَبُو عَامِرٍ الْعَقَدِيُّ جَمِيعًا عَنْ شُعْبَةَ بِهَذَا الْإِسْنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13094,
                "hadithNumber": "5531",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) visited me when I had screened (my door) with a carpet having pictures on it. He removed it and we made cushions out of that.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم میرے ہاں تشریف لائے ، اور میں نے ایک بچھانے والے کپڑے کا پردہ بنایا ہواتھا ، اس میں تصویریں تھیں ، آپ نے اس کو ہٹوادیا اور میں نے اس سے دو تکیے بنا لیے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, وکیع نے سفیان سے ، انھوں نے عبدالرحمان بن قاسم سے ، انھوں نے اپنے والد سے ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ: «دَخَلَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَيَّ وَقَدْ سَتَرْتُ نَمَطًا فِيهِ تَصَاوِيرُ، فَنَحَّاهُ» فَاتَّخَذْتُ مِنْهُ وِسَادَتَيْنِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13095,
                "hadithNumber": "5532",
                "englishNarrator": "A'isha رضی اللہ عنہا the wife of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) reported:",
                "hadithEnglish": "She had hung a curtain which had pictures upon it. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) entered (the room) and he pulled it. A'isha رضی اللہ عنہا said: I then tore it and prepared two cushions out of that. A person who was then in that company and whose name was Rabi'a bin 'Ata, the freed slave of Banu Zuhra, asked: Did you hear Abu Mabammad making a mention of A'isha رضی اللہ عنہا having stated that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) used to recline upon them? lbn al-Qasim said: No, but I heard Qasim bin Muhammad saying so.",
                "hadithUrdu": "انھوں نے ایک پردہ لٹکا رکھاتھا جس میں تصاویر تھیں ، رسول اللہ صلی اللہ علیہ وسلم اندر تشریف لائے تو آپ نے اس پردے کو اتار دیا ، حضرت عائشہ رضی اللہ عنہا نے کہا : میں اس کو کاٹ کر دو تکیے بنالیے ، ( جب یہ حدیث بیان کی جارہی تھی ) تواس مجلس میں ایک شخص نے ، جو ربیعہ بن عطاء کہلاتے تھے ، بنو زہری کے مولیٰ تھے ، کہا : کیا آپ نے ابو محمد ( قاسم بن محمد ) کو یہ بیان کرتے ہوئے سنا کہ حضرت عائشہ رضی اللہ عنہا نے فرمایا : رسول اللہ صلی اللہ علیہ وسلم ان دونوں ( تکیوں ) کے ساتھ ٹیک لگاتے تھے؟تو ( عبدالرحمن ) ابن قاسم نے کہا : نہیں ، اس نے کہا : لیکن میں نے یقیناً ( ان سے ) یہ بات سنی تھی ۔ ان کی مراد ( ان کےوالد ) قاسم بن محمد سے تھی ۔",
                "urduNarrator": "ہم سے ہارون بن معروف نے بیان کیا، ہم سے ابن وہب نے بیان کیا، ہم سے عمرو بن حارث نے بیان کیا، بکیر نے کہا , عبدالرحمن بن قاسم نے انھیں حدیث بیان کی ، انھیں ان کے والد نے نبی کریم صلی اللہ علیہ وسلم کی اہلیہ حضرت عائشہ رضی اللہ عنہا سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، حَدَّثَنَا ابْنُ وَهْبٍ، حَدَّثَنَا عَمْرُو بْنُ الْحَارِثِ، أَنَّ بُكَيْرًا، حَدَّثَهُ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ الْقَاسِمِ، حَدَّثَهُ، أَنَّ أَبَاهُ، حَدَّثَهُ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهَا «نَصَبَتْ سِتْرًا فِيهِ تَصَاوِيرُ، فَدَخَلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَنَزَعَهُ»، قَالَتْ: فَقَطَعْتُهُ وِسَادَتَيْنِ، فَقَالَ رَجُلٌ فِي الْمَجْلِسِ حِينَئِذٍ، يُقَالُ لَهُ: رَبِيعَةُ بْنُ عَطَاءٍ مَوْلَى بَنِي زُهْرَةَ، أَفَمَا سَمِعْتَ أَبَا مُحَمَّدٍ يَذْكُرُ أَنَّ عَائِشَةَ قَالَتْ: فَكَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَرْتَفِقُ عَلَيْهِمَا؟ قَالَ ابْنُ الْقَاسِمِ: لَا، قَالَ: لَكِنِّي قَدْ سَمِعْتُهُ يُرِيدُ الْقَاسِمَ بْنَ مُحَمَّدٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13096,
                "hadithNumber": "5533",
                "englishNarrator": "A'isha reported:",
                "hadithEnglish": "She bought a carpet which had pictures on it. When Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) saw that, he stayed at the door and did not get in. I perceived or I was made to perceive upon his face signs of disgust. She said: Allah's Messenger, I offer repentance to Allah and His Messenger. (but tell me) what is the sin that I have committed. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: What is this carpet? She said: I bought it for you so that you might sit on it and take rest. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: The owners of these pictures would be tormented and they would be asked to bring to life what they tried to create. He then said: Angels do not enter the house in which there is a picture.",
                "hadithUrdu": "انھوں نے ایک ( چھوٹا سا بیٹھنے کے لئے ) گدا خریدا جس میں تصویریں بنی ہوئی تھیں ، جب رسول اللہ صلی اللہ علیہ وسلم نے اس ( گدے ) کو دیکھا تو آ پ دروازے پر ٹھہر گئے اور اندر داخل نہ ہوئے ، میں نے آپ کے چہر ے پر ناپسندیدگی کے آثار محسوس کیے ، ( یا کہا : ) آپ کے چہرے پر ناپسندیدگی کی آثار محسوس ہوئے ، تو انھوں ) ( حضرت عائشہ رضی اللہ تعالیٰ عنہا ) نے کہا : اللہ کے رسول صلی اللہ علیہ وسلم !میں ( سچے دل سے ) اللہ اور اس کے رسول صلی اللہ علیہ وسلم کے سامنے توبہ کرتی ہوں ۔ میں نے کیاگناہ کیا ہے؟تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا یہ گدا کیسا ہے؟ \" انھوں نے کہا : میں نے یہ آپ کے لئے خرید اہے ۔ تا کہ آپ اس پر بیٹھیں اور ٹیک لگائیں ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ان تصویروں ( کےبنانے ) والوں کو قیامت کے دن عذاب دیا جائےگا اوران سے کہا جائے گا : تم نے جو ( صورتیں ) تخلیق کی ہیں ، ان کو زندہ کرو ۔ \" پھر فرمایا؛ \" جس گھر میں تصویریں ہوں ان میں فرشتے داخل نہیں ہوتے ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: اما م مالک رحمۃ اللہ علیہ نے نافع سے ، انھوں نے قاسم بن محمد سے ، انھوں نے حضرت عائشہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ نَافِعٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، أَنَّهَا اشْتَرَتْ نُمْرُقَةً فِيهَا تَصَاوِيرُ، فَلَمَّا رَآهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَامَ عَلَى الْبَابِ فَلَمْ يَدْخُلْ، فَعَرَفْتُ، أَوْ فَعُرِفَتْ فِي وَجْهِهِ الْكَرَاهِيَةُ، فَقَالَتْ: يَا رَسُولَ اللهِ أَتُوبُ إِلَى اللهِ وَإِلَى رَسُولِهِ فَمَاذَا أَذْنَبْتُ؟ فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَا بَالُ هَذِهِ النُّمْرُقَةِ؟» فَقَالَتْ: اشْتَرَيْتُهَا لَكَ، تَقْعُدُ عَلَيْهَا وَتَوَسَّدُهَا، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: إِنَّ أَصْحَابَ هَذِهِ الصُّوَرِ يُعَذَّبُونَ، وَيُقَالُ لَهُمْ: أَحْيُوا مَا خَلَقْتُمْ ثُمَّ قَالَ: «إِنَّ الْبَيْتَ الَّذِي فِيهِ الصُّوَرُ لَا تَدْخُلُهُ الْمَلَائِكَةُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13097,
                "hadithNumber": "5534",
                "englishNarrator": "This Hadith was narrated from 'Aishah. Some of them narrated a more complete Hadith than others. In the Hadith of Ibn Akhil -Majishun it adds:",
                "hadithEnglish": "\"She said: I took it and prepared two cushions out of that and he (the Holy Prophet) used to recline against them in the house.",
                "hadithUrdu": "انھوں ( حضرت عائشہ رضی اللہ تعالیٰ عنہا ) نے فرمایا : میں نے اس گدے کو لے کر اس کے دو تکیے بنا لیے ، آپ صلی اللہ علیہ وسلم گھر میں ان کے ساتھ ٹیک لگاتے تھے ۔",
                "urduNarrator": "قتیبہ اور ابن رمح نے لیث سے حدیث بیان کی ، اسحاق بن ابراہیم نے کہا : ہمیں ثقفی نے خبر دی ، کہا : ہمیں ایوب نے حدیث بیان کی ، عبدالوارث بن عبدالصمد نےکہا : ہمیں میرے والد نے میرے دادا کے واسطے سے ایوب سے حدیث بیان کی ، ہارون بن سعید ایلی نے کہا : ہمیں ابن وہب نے حدیث بیان کی ، کہا : مجھے اسامہ بن زید نے خبر دی ، ابو بکر اسحاق نے کہا : ہمیں ابو سلمہ خزاعی نے حدیث بیا ن کی ، کہا : ہمیں ماجثون کے بھتیجے عبدالعزیز نے عبیداللہ بن عمر سے خبر دی ، ان سب ( لیث بن سعد ، ایوب ، اسامہ بن زید اور عبیداللہ بن عمر ) نے نافع سے ، انھوں نے قاسم سے ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے یہ حدیث روایت کی ، ان میں سے بعض کی حدیث بعض کی نسبت زیادہ مکمل ہے اور ( ابو سلمہ خزاعی نے ) ابن ماجثون کے بھتیجے سے روایت کردہ حدیث میں یہ اضافہ کیا",
                "hadithArabic": "وَحَدَّثَنَاهُ قُتَيْبَةُ، وَابْنُ رُمْحٍ، عَنِ اللَّيْثِ بْنِ سَعْدٍ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا الثَّقَفِيُّ، حَدَّثَنَا أَيُّوبُ، ح وحَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ عَبْدِ الصَّمَدِ، حَدَّثَنَا أَبِي، عَنْ جَدِّي، عَنْ أَيُّوبَ، ح وَحَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي أُسَامَةُ بْنُ زَيْدٍ، ح وحَدَّثَنِي أَبُو بَكْرِ بْنُ إِسْحَاقَ، حَدَّثَنَا أَبُو سَلَمَةَ الْخُزَاعِيُّ، أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ أَخِي الْمَاجِشُونِ، عَنْ عُبَيْدِ اللهِ بْنِ عُمَرَ، كُلُّهُمْ عَنْ نَافِعٍ، عَنِ الْقَاسِمِ، عَنْ عَائِشَةَ، بِهَذَا الْحَدِيثِ، وَبَعْضُهُمْ أَتَمُّ حَدِيثًا لَهُ مِنْ بَعْضٍ، وَزَادَ فِي حَدِيثِ ابْنِ أَخِي الْمَاجِشُونِ قَالَتْ: فَأَخَذْتُهُ فَجَعَلْتُهُ مِرْفَقَتَيْنِ فَكَانَ يَرْتَفِقُ بِهِمَا فِي الْبَيْتِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13098,
                "hadithNumber": "5535",
                "englishNarrator": "Ibn 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) having said: Those who paint pictures would be punished on the Day of Resurrection and it would be said to them: Breathe soul into what you have created.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" جو لو گ تصویریں بنا تے ہیں انھیں قیامت کے دن عذاب دیا جا ئے گا ، ان سے کہا جا ئے گا جن کو تم نے تخلیق کیا ( اب ان کو زندہ کرو) ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے علی بن مشر نے بیان کیا، ہم سے ابن المثنیٰ نے بیان کیا، ہم سے یحییٰ نے جو القطان ہیں، ہم سے بیان کیا:عبید اللہ نے نافع سے حدیث بیان کی ، حضرت ابن عمر رضی اللہ عنہ نے انھیں خبر دیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ و حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا يَحْيَى وَهُوَ الْقَطَّانُ جَمِيعًا عَنْ عُبَيْدِ اللَّهِ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ وَاللَّفْظُ لَهُ حَدَّثَنَا أَبِي حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ أَنَّ ابْنَ عُمَرَ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الَّذِينَ يَصْنَعُونَ الصُّوَرَ يُعَذَّبُونَ يَوْمَ الْقِيَامَةِ يُقَالُ لَهُمْ أَحْيُوا مَا خَلَقْتُمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13099,
                "hadithNumber": "5536",
                "englishNarrator": null,
                "hadithEnglish": "It was narrated from Ibn 'Umar رضی اللہ عنہ from the prophet ﷺ.... a hadith like that of 'Ubaidullah, from Nafi, from Ibn 'Umar رضی اللہ عنہ, from the prophet ﷺ.",
                "hadithUrdu": "ہم سے ابو الربیع اور ابو کامل نے بیان کیا، انہوں نے کہا کہ ہم سے حماد نے بیان کیا، کہا کہ ہم سے زہیر بن حرب نے بیان کیا، کہا ہم سے اسماعیل نے بیان کیا، یعنی ہم سے ابن الیاس نے بیان کیا اور کہا کہ ہم سے ابن الیاس نے بیان کیا ابی عمر الثقفی نے ہم سب کو بتایا, ایو ب نے نافع سے ، انھوں نے حضرت ابن عمر رضی اللہ عنہ سے ، انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے ، اسی حدیث کے مانند روایت کی ، جس طرح عبید اللہ نے نافع سے ، انھوں نے عمر رضی اللہ عنہ سے اور انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا أَبُو الرَّبِيعِ وَأَبُو كَامِلٍ قَالَا حَدَّثَنَا حَمَّادٌ ح و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا إِسْمَعِيلُ يَعْنِي ابْنَ عُلَيَّةَ ح و حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا الثَّقَفِيُّ كُلُّهُمْ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13100,
                "hadithNumber": "5537",
                "englishNarrator": "Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Verity the most grievously tormented people on the Day of Resurrection would be the painters of pictures. Ashajj (one of the narrators) in the hadith narrated by him did not make mention of the word verity .",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" یقیناً قیامت کے دن سب سے زیادہ عذاب میں ( گرفتار تصویر بنانے والے ہو ں گے ۔ \" اشج نے یقیناً \" ( کا لفظ ) بیان نہیں کیا ۔",
                "urduNarrator": "عثمان بن ابی شیبہ نے کہا : ہمیں جریر نے اعمش سے حدیث بیان کی ، ابو سعید اشج نے کہا : ہمیں وکیع نے حدیث بیان کی ، کہا : ہمیں اعمش نے ابو ضحیٰ سے حدیث بیان کی ، انھوں نے مسروق سے انھوں نے حضرت عبد اللہ بن مسعد رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ ح و حَدَّثَنِي أَبُو سَعِيدٍ الْأَشَجُّ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي الضُّحَى عَنْ مَسْرُوقٍ عَنْ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَشَدَّ النَّاسِ عَذَابًا يَوْمَ الْقِيَامَةِ الْمُصَوِّرُونَ وَلَمْ يَذْكُرْ الْأَشَجُّ إِنَّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13101,
                "hadithNumber": "5538",
                "englishNarrator": "It was narrated from Abu Mu`awiya:",
                "hadithEnglish": "\"Among the people of hell who will be most severely punished on the day of Resurrection will be the image markers.\" The hadith of Sufyan is like the hadith of Waki' (5537).",
                "hadithUrdu": "\" قیامت کے دن سب سے زیادہ عذاب پانے والوں میں سے تصویر بنا نے والے ہیں ۔ \" اور سفیان کی حدیث وکیع کی حدیث کی طرح ہے ۔",
                "urduNarrator": "یحییٰ بن یحییٰ ابو بکر بن ابی شیبہ اور ابو کریب سب نے ابو معاویہ سے حدیث بیان کی ، کہا : ہمیں سفیان نے حدیث بیان کی ، ( ابو معاویہ اور سفیان ) دونوں نے اعمش سے اسی سند کے ساتھ حدیث بیان کی ، ابو معاویہ سے یحییٰ اور ابو کریب روایت میں ہے",
                "hadithArabic": "و حَدَّثَنَاه يَحْيَى بْنُ يَحْيَى وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ كُلُّهُمْ عَنْ أَبِي مُعَاوِيَةَ ح و حَدَّثَنَاه ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ كِلَاهُمَا عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ وَفِي رِوَايَةِ يَحْيَى وَأَبِي كُرَيْبٍ عَنْ أَبِي مُعَاوِيَةَ إِنَّ مِنْ أَشَدِّ أَهْلِ النَّارِ يَوْمَ الْقِيَامَةِ عَذَابًا الْمُصَوِّرُونَ وَحَدِيثُ سُفْيَانَ كَحَدِيثِ وَكِيعٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13102,
                "hadithNumber": "5539",
                "englishNarrator": "Muslim bin Subaih reported:",
                "hadithEnglish": "I was with Masriuq in the house which had the portrayals of Mary (hadrat Maryan). Thereupon Masriuq said: These are portraits of Kisra. I said: No, these are of Mary. Masruq said: I heard Abdullah bin Mas'ud رضی اللہ عنہ as saying Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had said: The most grievously tormented people on the Day of Resurrection would be the painters of pictures.",
                "hadithUrdu": "میں مسروق کے ساتھ ایک مکا ن میں تھا جس میں حضرت مریم علیہ السلام کی تصاویر تھیں ( یا مجسمے تھے ) مسروق نے کہا : یہ کسریٰ کی تصاویر ہیں ؟ میں نے کہا : نہیں یہ مریم علیہ السلام کی تصاویرہیں ۔ مسروق نے کہا : میں حضرت عبد اللہ بن مسعود رضی اللہ عنہ سے سنا وہ کہہ رہے تھے : رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" قیامت کے دن سب سے زیادہ عذاب تصویریں ( یا مجسمے ) بنا نے والوں کو ہو گا ۔ \"",
                "urduNarrator": "ہم سے نصر بن علی الجہمی نے بیان کیا، کہا ہم سے عبدالعزیز بن عبد الصمد نے بیان کیا، انہوں نے بیان کیا, منصور نے مسلم بن صبیح ( ابو ضحیٰ ) سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ الصَّمَدِ حَدَّثَنَا مَنْصُورٌ عَنْ مُسْلِمِ بْنِ صُبَيْحٍ قَالَ كُنْتُ مَعَ مَسْرُوقٍ فِي بَيْتٍ فِيهِ تَمَاثِيلُ مَرْيَمَ فَقَالَ مَسْرُوقٌ هَذَا تَمَاثِيلُ كِسْرَى فَقُلْتُ لَا هَذَا تَمَاثِيلُ مَرْيَمَ فَقَالَ مَسْرُوقٌ أَمَا إِنِّي سَمِعْتُ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَشَدُّ النَّاسِ عَذَابًا يَوْمَ الْقِيَامَةِ الْمُصَوِّرُونَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13103,
                "hadithNumber": "5540",
                "englishNarrator": "(Muslim said): I read this before Nasr bin 'Ali at-Jahdami and he read it before other narrators, the last one being Ibn Sa'id bin Abl at Hasan:",
                "hadithEnglish": "A person came to Ibn 'Abbas رضی اللہ عنہ and said: I am the person who paints pictures; give me a religious verdict about them. He (Ibn 'Abbas رضی اللہ عنہ ) said to him: Come near me (still further). He came near him so much so that he placed his hand upon his head and said: I am going to narrate to your what I heard from Allah's Messenger (ﷺ). I heard him say: All the painters who make pictures would be in the fire of Hell. The soul will be breathed in every picture prepared by him and it shall punish him in the Hell, and he (Ibn 'Abbas رضی اللہ عنہ ) said: If you have to do it at all, then paint the pictures of trees and lifeless things; and Nasr bin 'Ali confirmed it.",
                "hadithUrdu": "ایک شخص حضرت ابن عباس رضی اللہ عنہ کے پاس آیا اس نے کہا : میں یہ ( جانداروں کی ) تصویر یں بناتا ہوں ، آپ مجھے ان کے متعلق فتویٰ دیں ۔ حضرت ابن عباس رضی اللہ عنہ نے کہا : میرے قریب آؤ وہ قریب ہوا انھوں نے پھر فرما یا میرے قریب آؤوہ ( مزید قریب آیا آپ نے اس کے سر پر ہاتھ رکھ کر فرمایا : \"\" میں تم کو وہ بات بتاتاہوں جو میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنی ، میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ فرما رہے تھے : \"\" ہر تصویر بنانے والا جہنم میں ہو گا اور اس کی بنا ئی ہو ئی تصویر کے بدلے میں اللہ تعا لیٰ ایک جاندار بنائے گا وہ اسے جہنم میں عذاب دے گا ۔ \"\" اور حضرت ابن عباس رضی اللہ عنہ نے فرمایا : اگر تم نے ضرور ( یہی کا م ) کرنا ہے تو درختوں کی اور جن چیزوں میں جان نہیں ان کی تصویر بنا ؤ ۔ نصر بن علی نے ( جب میں نے ان کے سامنے یہ حدیث پڑھی ) اس کا اقرار کیا ( کہ انھوں نے عبد الاعلیٰ بن عبدالاعلیٰ سے اسی طرح روایت کی ۔ )",
                "urduNarrator": "امام مسلم نے کہا : میں نے نصر بن علی جہضمی کے ساتھ عبد الاعلی بن عبد الاعلیٰ سے حدیث پڑھی کہ ہمیں یحییٰ بن ابی اسحٰق نے ( حضرت حسن بصری کے بھا ئی ) سعید بن ابو حسن سے روایت بیان کی ، کہا",
                "hadithArabic": "قَالَ مُسْلِم قَرَأْتُ عَلَى نَصْرِ بْنِ عَلِيٍّ الْجَهْضَمِيِّ عَنْ عَبْدِ الْأَعْلَى بْنِ عَبْدِ الْأَعْلَى حَدَّثَنَا يَحْيَى بْنُ أَبِي إِسْحَقَ عَنْ سَعِيدِ بْنِ أَبِي الْحَسَنِ قَالَ جَاءَ رَجُلٌ إِلَى ابْنِ عَبَّاسٍ فَقَالَ إِنِّي رَجُلٌ أُصَوِّرُ هَذِهِ الصُّوَرَ فَأَفْتِنِي فِيهَا فَقَالَ لَهُ ادْنُ مِنِّي فَدَنَا مِنْهُ ثُمَّ قَالَ ادْنُ مِنِّي فَدَنَا حَتَّى وَضَعَ يَدَهُ عَلَى رَأْسِهِ قَالَ أُنَبِّئُكَ بِمَا سَمِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ كُلُّ مُصَوِّرٍ فِي النَّارِ يَجْعَلُ لَهُ بِكُلِّ صُورَةٍ صَوَّرَهَا نَفْسًا فَتُعَذِّبُهُ فِي جَهَنَّمَ و قَالَ إِنْ كُنْتَ لَا بُدَّ فَاعِلًا فَاصْنَعْ الشَّجَرَ وَمَا لَا نَفْسَ لَهُ فَأَقَرَّ بِهِ نَصْرُ بْنُ عَلِيٍّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13104,
                "hadithNumber": "5541",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ said:",
                "hadithEnglish": "I was sitting with Ibn 'Abbas رضی اللہ عنہ when he gave religious verdicts but he did not say that it was Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) who had said that. However when a man said to him (Ibn 'Abbas رضی اللہ عنہ): I am the painter of these pictures. Ibn 'Abbas رضی اللہ عنہ said: I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who painted pictures in the world would be compelled to breathe soul in them on the Day of Resurrection, but he would not be able to breathe soul (in them).",
                "hadithUrdu": "میں حضرت ابن عباس رضی اللہ عنہ کے پاس بیٹھا ہوا تھا ، آپ نے ( پوچھنے والوں کے مطالبے پر ) فتوے دینے شروع کیے اور یہ نہیں کہہ رہے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے اس طرح فر ما یا ہے حتیٰ کہ ایک شخص نے ان سے سوال کیا کہ میں یہ تصویریں بنا تا ہوں ، حضرت ابن عباس رضی اللہ عنہ نے اس سے کہا : قریب آؤ ۔ وہ شخص قریب آیا حضرت ابن عباس رضی اللہ عنہ نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ فرما رہے تھے ۔ \" جس شخص نے دنیا میں کو ئی تصویر بنا ئی اس کو اس بات کا مکلف بنا یا جا ئے گا کہ وہ قیامت کے دن اس میں روح پھونکے اور وہ اس میں روح نہیں پھونک سکے گا ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے علی بن مسہر نے بیان کیا, سعید بن ابی عروبہ نے نضر بن انس بن مالک رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ عَنْ النَّضْرِ بْنِ أَنَسِ بْنِ مَالِكٍ قَالَ كُنْتُ جَالِسًا عِنْدَ ابْنِ عَبَّاسٍ فَجَعَلَ يُفْتِي وَلَا يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى سَأَلَهُ رَجُلٌ فَقَالَ إِنِّي رَجُلٌ أُصَوِّرُ هَذِهِ الصُّوَرَ فَقَالَ لَهُ ابْنُ عَبَّاسٍ ادْنُهْ فَدَنَا الرَّجُلُ فَقَالَ ابْنُ عَبَّاسٍ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ صَوَّرَ صُورَةً فِي الدُّنْيَا كُلِّفَ أَنْ يَنْفُخَ فِيهَا الرُّوحَ يَوْمَ الْقِيَامَةِ وَلَيْسَ بِنَافِخٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13105,
                "hadithNumber": "5542",
                "englishNarrator": "Nadr bin Anas reported:",
                "hadithEnglish": "A person came to Ibn 'Abbas رضی اللہ عنہ and he narrated (the above mentioned hadith) from Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ).",
                "hadithUrdu": "حضرت ابن عباس رضی اللہ عنہ کے پاس ایک شخص آیا ۔ اور انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے اسی کے مانند حدیث بیان کی ۔",
                "urduNarrator": "ہم سے ابو غسان المسمعی اور محمد بن المثنیٰ نے بیان کیا، کہا: ہم سے معاذ بن ہشام نے بیان کیا, قتادہ نے نضر بن انس سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو غَسَّانَ الْمِسْمَعِيُّ وَمُحَمَّدُ بْنُ الْمُثَنَّى قَالَا حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنَا أَبِي عَنْ قَتَادَةَ عَنْ النَّضْرِ بْنِ أَنَسٍ أَنَّ رَجُلًا أَتَى ابْنَ عَبَّاسٍ فَذَكَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13106,
                "hadithNumber": "5543",
                "englishNarrator": "Abu Zur'a reported:",
                "hadithEnglish": "I visited the house of Marwan in the company of Abu Huraira رضی اللہ عنہ and he found pictures there. whereupon he said: I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Allah, the Glorious and Exalted, said: Who is a more wrongdoer than one who tries to create creation like Mine creation. Let him create an atom or a grain of wheat or that of barley.",
                "hadithUrdu": "میں حضرت ابو ہریرہ رضی اللہ عنہ کے ساتھ مروان کے گھر گیا نھوں نے اس گھر میں تصوریں دیکھیں تو کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ نے فرما یا : \" اللہ عزوجل نے فر ما یا اس شخص سے بڑا ظالم کو ن ہوگا جو میری مخلوق کی طرح مخلوق بنا نے چلا ہو ۔ وہ ایک ذرہ تو بنا ئیں یا ایک دانہ تو بنا ئیں یا ایک جو تو بنائیں ! \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، محمد بن عبداللہ بن نمیر اور ابو کریب نے بیان کیا اور ان کا قول بھی اسی طرح ہے, ابن فضیل نے عمارہ سے ، انھوں نے ابو زرعہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ وَأَبُو كُرَيْبٍ وَأَلْفَاظُهُمْ مُتَقَارِبَةٌ قَالُوا حَدَّثَنَا ابْنُ فُضَيْلٍ عَنْ عُمَارَةَ عَنْ أَبِي زُرْعَةَ قَالَ دَخَلْتُ مَعَ أَبِي هُرَيْرَةَ فِي دَارِ مَرْوَانَ فَرَأَى فِيهَا تَصَاوِيرَ فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ قَالَ اللَّهُ عَزَّ وَجَلَّ وَمَنْ أَظْلَمُ مِمَّنْ ذَهَبَ يَخْلُقُ خَلْقًا كَخَلْقِي فَلْيَخْلُقُوا ذَرَّةً أَوْ لِيَخْلُقُوا حَبَّةً أَوْ لِيَخْلُقُوا شَعِيرَةً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13107,
                "hadithNumber": "5544",
                "englishNarrator": "This hadith has been transmitted on the authority of Abu Zur'a and he said:",
                "hadithEnglish": "Abu Huraira went to the house of Sa'id رضی اللہ عنہ or Marwan which they had built in Medina and he (Abu Huraira رضی اللہ عنہ) saw a painter who had been painting pictures in his house, whereupon he told that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had said like this, but he made no mention of the words: Let him create the grain of barley.",
                "hadithUrdu": "میں اور حضرت ابو ہریرہ رضی اللہ عنہ مدینہ میں ایک گھر میں گئے جوسعید ( ابن عاص ) رضی اللہ عنہ یا مروان ( ابن حکم ) کے لیے بنا یا جا رہا تھا ، وہاں انھوں نے ایک مصور کو گھر میں تصویر بنا تے ہوئے دیکھا ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا ۔ اور اسی کے مانند روایت کی اور ( جریر نے ) \" یا ایک جَو تو بنائیں \" ( کے الفاظ ) بیان نہیں کیے ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، ہم سےجریر نے عمارہ سے ، انھوں نے ابو زرعہ سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ عَنْ عُمَارَةَ عَنْ أَبِي زُرْعَةَ قَالَ دَخَلْتُ أَنَا وَأَبُو هُرَيْرَةَ دَارًا تُبْنَى بِالْمَدِينَةِ لِسَعِيدٍ أَوْ لِمَرْوَانَ قَالَ فَرَأَى مُصَوِّرًا يُصَوِّرُ فِي الدَّارِ فَقَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ وَلَمْ يَذْكُرْ أَوْ لِيَخْلُقُوا شَعِيرَةً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13108,
                "hadithNumber": "5545",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Angels do not enter the house in which there are portrayals or pictures.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : اس گھر میں فرشتے داخل نہیں ہو تے جس میں مجسمے ( بت ) یاتصاویر ہوں ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے خالد بن مخلد نے بیان کیا، وہ سلیمان بن بلال سے، سہیل کے واسطہ سے، وہ اپنے والد سے, حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ عَنْ سُلَيْمَانَ بْنِ بِلَالٍ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَدْخُلُ الْمَلَائِكَةُ بَيْتًا فِيهِ تَمَاثِيلُ أَوْ تَصَاوِيرُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13109,
                "hadithNumber": "5546",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Angels do not accompany the travellers who have with them a dog and a bell.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" ( رحمت کے ) فرشتے ( سفرکے ) ان رفیقوں کے ساتھ نہیں چلتے جن کے درمیان کتا ہواور نہ ( ان کے ساتھ جن کے پاس ) گھنٹی ہو ۔ \"",
                "urduNarrator": "ہم سے ابو کامل فضیل بن حسین الجہدری نے بیان کیا, بشر بن مفضل نے کہا : ہمیں سہیل نے اپنے والد سے حدیث بیان کی ، انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو كَامِلٍ فُضَيْلُ بْنُ حُسَيْنٍ الْجَحْدَرِيُّ حَدَّثَنَا بِشْرٌ يَعْنِي ابْنَ مُفَضَّلٍ حَدَّثَنَا سُهَيْلٌ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَصْحَبُ الْمَلَائِكَةُ رُفْقَةً فِيهَا كَلْبٌ وَلَا جَرَسٌ.",
                "headingArabic": "كَرَاهَةِ الْكَلْبِ وَالْجَرَسِ فِي السَّفَرِ ‏.‏",
                "headingUrdu": "سفر پر کتے اور گھنٹیاں لے جانا ناپسندیدہ ہے۔",
                "headingEnglish": "It Is Disliked To Take Dogs And Bells On A Journey",
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13110,
                "hadithNumber": "5547",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been reported on the authority of Suhail with the same chain of transmitters.",
                "hadithUrdu": "مجھ سے زہیر بن حرب نے بیان کیا, جریر اور عبد العزیز دراوردی دونوں نے سہل سے اسی سند کے ساتھ حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ و حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي الدَّرَاوَرْدِيَّ كِلَاهُمَا عَنْ سُهَيْلٍ بِهَذَا الْإِسْنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13111,
                "hadithNumber": "5548",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The bell is the musical instrument of the Satan.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" گھنٹی شیطان کی بانسری ہے ۔",
                "urduNarrator": "اور ہم سے یحییٰ بن ایوب، قتیبہ اور ابن حجر نے بیان کیا، کہا کہ ہم سے اسماعیل نے بیان کیا، یعنی ابن جعفر نے، ہم سے  العلاء کی سند سے اپنے والد کی سند سے بیان کیا, حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "و حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ وَابْنُ حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَعِيلُ يَعْنُونَ ابْنَ جَعْفَرٍ عَنْ الْعَلَاءِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْجَرَسُ مَزَامِيرُ الشَّيْطَانِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13112,
                "hadithNumber": "5549",
                "englishNarrator": "Abu Bashir Ansari رضی اللہ عنہ reported:",
                "hadithEnglish": "He had had (the opportunity of accompanying Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) in some of his journeys. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) sent one of his messengers 'Abdullah bin Abi Bakr said: I think he said (these words) when the people were at the places of rest: No necklace of strings be left on the necks of the camels or the necklace kept unbroken. Imam Malik said: To my mind (this practice) of wearing necklace round the necks of camels or animals was because of the fact that they (wanted to save them) from the influence of the evil eye.",
                "hadithUrdu": "وہ ایک سفر میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے رسول اللہ صلی اللہ علیہ وسلم نے ایک قاصد کو بھیجا ۔ عبد اللہ ابو بکر نے کہا : میرا گمان ہے کہ انھوں نے کہا : لو گ اپنی اپنی سونے کی جگہ میں پہنچ چکے تھے ۔ ( اور حکم دیا ) : \"\" کسی اونٹ کی گردن میں تانت ( کمان کے دونوں سرے جوڑے نے والی مضبوط باریک چمڑے کی ڈوری ) کا ہا ر ۔ یا کو ئی بھی ہار ۔ نہ چھوڑ اجا ئے مگر اسے کاٹ دیا جا ئے ۔ \"\" امام مالک نے فرما یا : \"\" میراخیال ہے کہ یہ ( ہار ) نظر بد سے بچانے کے لیے ( گلے میں ڈالے جا تے ) تھے ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: امام مالک نے عبد اللہ بن ابی بکر سے ، انھوں نے عباد بن تمیم سے روایت کی کہ حضرت ابو بشیر انصاری رضی اللہ عنہ نے انھیں بتا یا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ عَبَّادِ بْنِ تَمِيمٍ أَنَّ أَبَا بَشِيرٍ الْأَنْصَارِيَّ أَخْبَرَهُ أَنَّهُ كَانَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَعْضِ أَسْفَارِهِ قَالَ فَأَرْسَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَسُولًا قَالَ عَبْدُ اللَّهِ بْنُ أَبِي بَكْرٍ حَسِبْتُ أَنَّهُ قَالَ وَالنَّاسُ فِي مَبِيتِهِمْ لَا يَبْقَيَنَّ فِي رَقَبَةِ بَعِيرٍ قِلَادَةٌ مِنْ وَتَرٍ أَوْ قِلَادَةٌ إِلَّا قُطِعَتْ قَالَ مَالِكٌ أُرَى ذَلِكَ مِنْ الْعَيْنِ.",
                "headingArabic": "كَرَاهَةِ قِلاَدَةِ الْوَتَرِ فِي رَقَبَةِ الْبَعِيرِ ‏.‏",
                "headingUrdu": "اونٹوں کے گلے میں مالا لٹکانا ناپسندیدہ ہے۔",
                "headingEnglish": "It Is Disliked To Hang Garlands On The Necks Of Camels",
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13113,
                "hadithNumber": "5550",
                "englishNarrator": "Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade striking on the face or branding on the face.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے اس بات سے منع فرما یا کہ ( جانور کو ) منہ پر مارا جا ئے یا منہ پر نشانی ثبت کی جائے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, ‏علی بن مسہر نے ابن جریج سے ، انھوں نے ابو زبیر سے ، انھوں نے حضرت جابر رضی اللہ عنہ سے روایت کی کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ ابْنِ جُرَيْجٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الضَّرْبِ فِي الْوَجْهِ وَعَنْ الْوَسْمِ فِي الْوَجْهِ.",
                "headingArabic": "النَّهْىِ عَنْ ضَرْبِ الْحَيَوَانِ، فِي وَجْهِهِ وَوَسْمِهِ فِيهِ",
                "headingUrdu": "جانوروں کے چہرے پر مارنے یا نشان لگانے کی ممانعت",
                "headingEnglish": "The Prohibition Of Striking Or Branding Animals On The Face",
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 12801,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=512",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=510",
                "label": "510",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=511",
                "label": "511",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=512",
                "label": "512",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=513",
                "label": "513",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=514",
                "label": "514",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=515",
                "label": "515",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=516",
                "label": "516",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=514",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=514",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=512",
        "to": 12825,
        "total": 40465
    }
}