{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 488,
        "data": [
            {
                "id": 12464,
                "hadithNumber": "4901",
                "englishNarrator": "It has been narrated on the authority of Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "A young man from Aslam tribe said: Messenger of Allah, I wish to fight (in the way of Allah) but I don't have anything to equip myself with for fighting. He (the Holy Prophet) said: Go to so and so, for he had equipped himself (for fighting) but he fell ill. So, he (the young man) went to him and said: The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) sends you his greetings and says that you should give me the equipage that you have provided yourself with. The man said (to his wife or maidservant): So and so, give him the equipage I have collected for myself and do not withhold anything from him. Do not withhold anything from him so that you may be blessed therein.",
                "hadithUrdu": "قبیلہ اسلم کے ایک نوجوان نے آ کر عرض کی : اللہ کے رسول! میں جہاد کرنا چاہتا ہوں اور میرے پاس استطاعت نہیں کہ اس کا سامان باندھ سکوں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" تم فلاں شخص کے پاس چلے جاؤ ، اس نے جہاد کا سامان تیار کیا تھا لیکن وہ بیمار ہو گیا ہے ۔ \" وہ نوجوان اس آدمی کے پاس گیا اور کہا : رسول اللہ صلی اللہ علیہ وسلم تم کو سلام کہتے ہیں اور فرماتے ہیں : وہ سارا سامان مجھے دے دوجو تم نے ( جہاد کے لیے ) تیار کیا ہے ۔ انہوں نے کہا : اے فلاں بی بی! میں نے جو کچھ ( جہاد کے لیے ) تیار کیا تھا اسے دے دو اور اس میں سے کوئی چیز بچا کے نہ رکھو ، اللہ کی قسم! ایسے نہیں ہو گا کہ تم اس میں سے کچھ بچا کے رکھو اور اس میں سے تمہارے لیے برکت ہو ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے عفان نے بیان کیا، ہم سے حماد بن سلمہ نے بیان کیا, ثابت نے حضرت انس بن مالک رضی اللہ عنہ سے حدیث سنائی کہ",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسِ بْنِ مَالِكٍ، ح وحَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ، وَاللَّفْظُ لَهُ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ فَتًى مِنْ أَسْلَمَ قَالَ: يَا رَسُولَ اللهِ، إِنِّي أُرِيدُ الْغَزْوَ وَلَيْسَ مَعِي مَا أَتَجَهَّزُ، قَالَ: «ائْتِ فُلَانًا، فَإِنَّهُ قَدْ كَانَ تَجَهَّزَ، فَمَرِضَ»، فَأَتَاهُ، فَقَالَ: إِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُقْرِئُكَ السَّلَامَ، وَيَقُولُ: أَعْطِنِي الَّذِي تَجَهَّزْتَ بِهِ، قَالَ: يَا فُلَانَةُ، أَعْطِيهِ الَّذِي تَجَهَّزْتُ بِهِ، وَلَا تَحْبِسِي عَنْهُ شَيْئًا، فَوَاللهِ، لَا تَحْبِسِي مِنْهُ شَيْئًا، فَيُبَارَكَ لَكِ فِيهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12465,
                "hadithNumber": "4902",
                "englishNarrator": "It has been narrated on the authority of Zaid bin Khalid al-Juhani رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Anybody who equips a warrior (going to fight) in the way of Allah (is like one who actually) fights. And anybody who looks well after his family in his absence (is also like one who actually) fights.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" جس شخص نے اللہ کے راستے میں جنگ کرنے والے کسی آدمی کو لیس کیا ( سامانِ جہاد مہیا کیا ) تو یقینا اس نے بھی جہاد کیا اور جس شخص نے غازی کے گھر والوں کی اچھی طرح دیکھ بھال کی تو یقینا اس نے بھی جہاد کیا ۔ \"",
                "urduNarrator": "ہم سے سعید بن منصور اور ابو الطاہر نے بیان کیا، کہا کہ ابو الطاہر نے کہا: ہم سے ابن وہب نے بیان کیا، اور سعید نے کہا: ہم سے عبداللہ بن وہب نے بیان کیا، مجھ سے عمرو بن حارث نے بیان کیا, بکیر بن اشج نے بسر بن سعید سے ، انہوں نے حضرت زید بن خالد جہنی رضی اللہ عنہ سے اور انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی",
                "hadithArabic": "وحَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، وَأَبُو الطَّاهِرِ، قَالَ أَبُو الطَّاهِرِ: أَخْبَرَنَا ابْنُ وَهْبٍ،، وقَالَ سَعِيدٌ: حَدَّثَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ بُكَيْرِ بْنِ الْأَشَجِّ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: «مَنْ جَهَّزَ غَازِيًا فِي سَبِيلِ اللهِ، فَقَدْ غَزَا، وَمَنْ خَلَفَهُ فِي أَهْلِهِ بِخَيْرٍ، فَقَدْ غَزَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12466,
                "hadithNumber": "4903",
                "englishNarrator": "The above tradition has been narrated on the authority of Khalid al-Juhani رضی اللہ عنہ who said:",
                "hadithEnglish": "The Prophet of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: He who equips a warrior in the way of Allah (is like one who actually fights) and he who looks after the family of a warrior in the way of Allah in fact participated in the battle.",
                "hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم نے فرمایا : \" جس شخص نے کسی مجاہد کے لیے سامان مہیا کیا تو یقینا اس نے جہاد کیا اور جس نے مجاہد کے پیچھے اس کے گھر والوں کی دیکھ بھال کی اس نے بھی جہاد کیا.",
                "urduNarrator": "ہم سے ابو الربیع الزہرانی نے بیان کیا، کہا ہم سے یزید نے بیان کیا، ہم سے ابن زریع نے بیان کیا، ہم سے حسین المعلم نے بیان کیا، ہم سے یحییٰ بن ابی کثیر نے بیان کیا, ابوسلمہ بن عبدالرحمٰن نے بسر بن سعید سے ، انہوں نے حضرت زید بن خالد جہنی رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ، حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ، حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، قَالَ: قَالَ نَبِيُّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ جَهَّزَ غَازِيًا، فَقَدْ غَزَا، وَمَنْ خَلَفَ غَازِيًا فِي أَهْلِهِ، فَقَدْ غَزَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12467,
                "hadithNumber": "4904",
                "englishNarrator": "It has been narrated on the authority of Abu Sa'id Khudri رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sent a force to Banu Lihyan (who are from Banu Hudhail, and said: One man from every two and the reward (will be divided) between the two.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے بنو لحیان کے خلاف ایک لشکر روانہ کیا اور فرمایا : \" ہر ( گھر کے ) دو مردوں میں سے ایک مرد اٹھے اور جائے ، ثواب میں دونوں شریک ہوں گے ۔ \"",
                "urduNarrator": "ہم سے زہیر بن حرب نے بیان کیا، ہم سے اسماعیل بن علیہ  نے بیان کیا، علی بن مبارک نے کہا : ہمیں یحییٰ بن ابی کثیر نے حدیث بیان کی ، کہا : مجھے مہری کے مولیٰ ابوسعید نے حضرت ابوسعید خدری رضی اللہ عنہ سے حدیث سنائی کہ",
                "hadithArabic": "وحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ عَلِيِّ بْنِ الْمُبَارَكِ، حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ، حَدَّثَنِي أَبُو سَعِيدٍ، مَوْلَى الْمَهْرِيِّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَعَثَ بَعْثًا إِلَى بَنِي لَحْيَانَ مِنْ هُذَيْلٍ، فَقَالَ: «لِيَنْبَعِثْ مِنْ كُلِّ رَجُلَيْنِ أَحَدُهُمَا، وَالْأَجْرُ بَيْنَهُمَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12468,
                "hadithNumber": "4905",
                "englishNarrator": null,
                "hadithEnglish": "Abu Sa'id Khudri رضی اللہ عنہ narrated that the Messenger of Allah ﷺ sent out  troop... a similar report (as no. 4904).",
                "hadithUrdu": "حسین نے یحییٰ ( بن ابی کثیر ) سے حدیث بیان کی ، کہا : مجھے مہری کے مولیٰ ابوسعید نے حدیث بیان کی ، کہا : مجھے حضرت ابو سعید خدری رضی اللہ عنہ نے حدیث بیان کی کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک لشکر بھیجا ، اسی ( سابقہ حدیث ) کے مانند ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنِيهِ إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا عَبْدُ الصَّمَدِ، - يَعْنِي ابْنَ عَبْدِ الْوَارِثِ - قَالَ سَمِعْتُ أَبِي يُحَدِّثُ، حَدَّثَنَا الْحُسَيْنُ، عَنْ يَحْيَى، حَدَّثَنِي أَبُو سَعِيدٍ، مَوْلَى الْمَهْرِيِّ حَدَّثَنِي أَبُو سَعِيدٍ الْخُدْرِيُّ، أَنَّ رَسُولَ اللَّهِ بَعَثَ بَعْثًا ‏.‏ بِمَعْنَاهُ ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12469,
                "hadithNumber": "4906",
                "englishNarrator": null,
                "hadithEnglish": "A similar report (as no. 4904) was narrated from Yahya with this chain of narrators.",
                "hadithUrdu": "مجھ سے اسحاق بن منصور نے بیان کیا، ہم سے عبید اللہ نے بیان کیا، یعنی ابن موسیٰ نے، ہم سے شیبان نے یحییٰ کی سند سے، اس سلسلہ اور اسی طرح کی سند سے بیان کیا۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا عُبَيْدُ اللهِ يَعْنِي ابْنَ مُوسَى، عَنْ شَيْبَانَ، عَنْ يَحْيَى، بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12470,
                "hadithNumber": "4907",
                "englishNarrator": "It has been narrated (through a still different chain of transmitters) on the authority of Abu Sa'id Khudri رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) dispatched a force to Banu Lihyan. (and said: ) One man from every two should join the force. Then he said to those who stayed behind: Those of you who will look well after the family and wealth of those who are going on the expedition will be getting half the reward of the warriors.",
                "hadithUrdu": "رسول اللہ نے بنولحیان کی طرف ایک لشکر روانہ کیا اور فرمایا : \" ہر دو آدمیوں میں سے ایک آدمی ( جہاد کے لیے نکلے ) اور فرمایا : \" تم میں سے جو شخص بھی ( جہاد کے لیے ) نکلنے والے کے اہل و عیال اور مال و متاع کی اچھی طرح دیکھ بھال کے لیے پیچھے رہے گا ، نکلنے والے کے اجر میں سے آدھا اسے ملے گا ۔ \" ( یعنی جہاد کرنے والے اور پیچھے خیال رکھنے والے دونوں کے لیے ثواب ہے ۔ پیچھے رہ کر خیال رکھنے والے کو بھی گھر میں رہتے ہوئے آدھا ثواب مل جائے گا ۔ )",
                "urduNarrator": "ہم سے سعید بن منصور نے بیان کیا، کہا ہم سے عبداللہ بن وہب نے بیان کیا، کہا کہ مجھ سے عمرو بن الحارث نے بیان کیا، وہ یزید بن ابی حبیب کی سند سے، انہوں نے یزید بن ابی حبیب کی سند سے,  ابو سعیدمہری کے آزاد کردہ غلام یزید بن ابی سعید نے اپنے والد سے ، انہوں نے حضرت ابوسعید خدری رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، حَدَّثَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ يَزِيدَ بْنِ أَبِي سَعِيدٍ، مَوْلَى الْمَهْرِيِّ، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَعَثَ إِلَى بَنِي لَحْيَانَ: «لِيَخْرُجْ مِنْ كُلِّ رَجُلَيْنِ رَجُلٌ»، ثُمَّ قَالَ لِلْقَاعِدِ: «أَيُّكُمْ خَلَفَ الْخَارِجَ فِي أَهْلِهِ وَمَالِهِ بِخَيْرٍ، كَانَ لَهُ مِثْلُ نِصْفِ أَجْرِ الْخَارِجِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12471,
                "hadithNumber": "4908",
                "englishNarrator": "It has been narrated on the authority of Sulaiman bin Buraida رضی اللہ عنہ who learnt the tradition from his father. The latter said:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: The sanctity of the wives of Mujahids is like the sanctity of their mothers for those who sit at home (i.e. do not go out for Jihad). Anyone who stays behind looking after the family of a Mujahid and betrays his trust will be made to stand on the Day of judgment before the Mujahid who will take away from his meritorious deeds whatever he likes. So what do you think (will he leave anything)?",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" گھر میں بیٹھنے والوں کے لیے مجاہدین کی عورتوں کی عزت و حرمت اسی طرح ہے جس طرح ان کی اپنی ماؤں کی حرمت و عزت ہے ۔ اور گھروں میں بیٹھنے والوں میں سے جو بھی شخص مجاہدین کے گھر والوں کی دیکھ بھال کا ذمہ دار ہے ، پھر ان کے معاملے میں ان کے ساتھ خیانت کرتا ہے ( پوری طرح دیکھ بھال نہیں کرتا ) تو اس کو قیامت کے دن اس ( مجاہد ) کے سامنے کھڑا کیا جائے گا اور وہ اس کے عمل میں سے جتنا چاہے گا لے لے گا ، اب تمہارا ( اس سزا کے بارے میں ) کیا خیال ہے؟ \" ( کوتاہی کرنے والے نے مجاہدین کے گھر والوں کی دیکھ بھال میں کوتاہی کر کے نیک اعمال بھی کیے ہوں گے تو وہ اس سے چھن جائیں گے اور ہو سکتا ہے اس کے پاس کچھ بھی نہ بچے ۔ )",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے وکیع نے بیان کیا, سفیان ( ثوری ) نے علقمہ بن مرثد سے ، انہوں نے سلیمان بن بریدہ سے ، انہوں نے اپنے والد حضرت بریدہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «حُرْمَةُ نِسَاءِ الْمُجَاهِدِينَ عَلَى الْقَاعِدِينَ كَحُرْمَةِ أُمَّهَاتِهِمْ، وَمَا مِنْ رَجُلٍ مِنَ الْقَاعِدِينَ يَخْلُفُ رَجُلًا مِنَ الْمُجَاهِدِينَ فِي أَهْلِهِ فَيَخُونُهُ فِيهِمْ، إِلَّا وُقِفَ لَهُ يَوْمَ الْقِيَامَةِ، فَيَأْخُذُ مِنْ عَمَلِهِ مَا شَاءَ، فَمَا ظَنُّكُمْ؟».",
                "headingArabic": "حُرْمَةِ نِسَاءِ الْمُجَاهِدِينَ وَإِثْمِ مَنْ خَانَهُمْ فِيهِنَّ ‏‏",
                "headingUrdu": "مجاہدین کی بیویوں کی حرمت اور ان کے ساتھ خیانت کرنے والے کا گناہ",
                "headingEnglish": "The sanctity of the wives of the Mujahidin, and the sin of the one who betrays them with regard to them",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12472,
                "hadithNumber": "4909",
                "englishNarrator": null,
                "hadithEnglish": "It was narrated from Ibn Buraidah رضی اللہ عنہ that his father said: \"The prophet ﷺ said..\" A hdith like that of Ath-Thawri (no. 4908).",
                "hadithUrdu": "مجھ سے محمد بن رافع نے بیان کیا، ہم سے یحییٰ بن آدم نے بیان کیا, مسعر نے ہمیں علقمہ بن مرثد سے حدیث بیان کی ، انہوں نے ابن بریدہ سے ، انہوں نے اپنے والد حضرت بریدہ رضی اللہ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ( پھر سفیان ) ثوری کی حدیث کے ہم معنی ( حدیث بیان کی ۔ )",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا مِسْعَرٌ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنِ ابْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، قَالَ: قَالَ: - يَعْنِي النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - بِمَعْنَى حَدِيثِ الثَّوْرِيِّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12473,
                "hadithNumber": "4910",
                "englishNarrator": "It was narrated from 'Alqama bin Murthad with this chin of narration (a similar report as no 4908), and he said:",
                "hadithEnglish": "Take from his noble deeds whatever you like. Then the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) turned to us and asked: What do you think (will he leave anything)? - (i.e. he will take away everything).",
                "hadithUrdu": "( اسے کہا جائے گا کہ ) تم اس کی نیکیوں میں سے جو چاہو لے لو \" پھر رسول اللہ صلی اللہ علیہ وسلم ہماری طرف متوجہ ہوئے اور فرمایا : \" تم کیا سمجھتے ہو؟ \"",
                "urduNarrator": "ہم سے سعید بن منصور نے بیان کیا، کہا ہم سے سفیان نے بیان کیا, قعنب نے علقمہ بن مرثد سے اسی سند کے ساتھ روایت کی : \" اور فرمایا",
                "hadithArabic": "وَحَدَّثَنَاهُ سَعِيدُ بْنُ مَنْصُورٍ، حَدَّثَنَا سُفْيَانُ، عَنْ قَعْنَبٍ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، بِهَذَا الْإِسْنَادِ، فَقَالَ: «فَخُذْ مِنْ حَسَنَاتِهِ مَا شِئْتَ»، فَالْتَفَتَ إِلَيْنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «فَمَا ظَنُّكُمْ؟».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12474,
                "hadithNumber": "4911",
                "englishNarrator": "It has been narrated on the authority of Abu Ishaq:",
                "hadithEnglish": "He heard Bara' رضی اللہ عنہ talking about the Qur'anic verse: Those who sit (at home) from among the believers and those who go out for Jihad in the way of Allah are not equal (iv. 95). (He said that) the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) ordered Zaid (to write the verse). He brought a shoulder-blade (of a slaughtered camel) and inscribed it (the verse) thereon. The son of Umm Maktum رضی اللہ عنہ complained of his blindness to the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). (At this) descended the revelation: Those of the believers who sit (at home) without any trouble (illness, incapacity, disability) (iv. 95). The tradition has been handed down through two other chains of transmitters",
                "hadithUrdu": "انہوں نے حضرت براء ( بن عازب رضی اللہ عنہ ) سے سنا ، وہ قرآن مجید کی آیت : \"\" مومنوں میں سے گھر بیٹھنے والے ، جو معذور نہیں اور اللہ کی راہ میں جہاد کرنے والے برابر نہیں \"\" کے بارے میں کہہ رہے تھے ( آیت ، درمیان والے حصے \"\" جو معذور نہیں \"\" کے بغیر نازل ہوئی ) تو رسول اللہ صلی اللہ علیہ وسلم نے حضرت زید بن ثابت رضی اللہ عنہ کو حکم دیا ، وہ ایک شانے کی ہڈی لے آئے اور اس پر یہ آیت لکھ دی ۔ اس موقع پر حضرت ابن ام مکتوم رضی اللہ عنہ نے اپنے نابینا ہونے کی شکایت کی ، تب یہ آیت ( درمیان کے حصے سمیت اس طرح ) اتری : \"\" مومنوں میں سے گھر بیٹھنے والے ، جو معذور نہیں اور اللہ کی راہ میں جہاد کرنے والے برابر نہیں ۔ \"\" شعبہ نے کہا : مجھے ایک شخص نے سعد بن ابراہیم سے ، انہوں نے زید بن ثابت رضی اللہ عنہ سے آیت : \"\" بیٹھنے والے برابر نہیں \"\" حضرت براء رضی اللہ عنہ کی حدیث کے مانند بیان کی ، ابن بشار نے اپنی روایت میں کہا : سعد بن ابراہیم نے اپنے والد سے ، انہوں نے ایک آدمی سے ، اس نے زید بن ثابت رضی اللہ عنہ سے روایت کی ، ( پہلی حدیث کی سند مکمل اور صحیح ہے ۔ یہ دونوں سندیں ضبط و تائید کے لیے ہیں ۔ )",
                "urduNarrator": "محمد بن مثنیٰ اور محمد بن بشار نے ہمیں حدیث بیان کی ۔ ۔ الفاظ ابن مثنیٰ کے ہیں ۔ ۔ دونوں نے کہا : ہمیں محمد بن جعفر نے حدیث بیان کی ، کہا : ہمیں شعبہ نے ابواسحٰق سے حدیث بیان کی",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، وَاللَّفْظُ لِابْنِ الْمُثَنَّى قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، أَنَّهُ سَمِعَ الْبَرَاءَ، يَقُولُ: فِي هَذِهِ الْآيَةِ {لَا يَسْتَوِي الْقَاعِدُونَ مِنَ الْمُؤْمِنِينَ وَالْمُجَاهِدُونَ فِي سَبِيلِ اللهِ}، فَأَمَرَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ زَيْدًا، فَجَاءَ بِكَتِفٍ يَكْتُبُهَا، فَشَكَا إِلَيْهِ ابْنُ أُمِّ مَكْتُومٍ ضَرَارَتَهُ، فَنَزَلَتْ: {لَا يَسْتَوِي الْقَاعِدُونَ مِنَ الْمُؤْمِنِينَ غَيْرُ أُولِي الضَّرَرِ} [النساء: 95] ، قَالَ شُعْبَةُ: وَأَخْبَرَنِي سَعْدُ بْنُ إِبْرَاهِيمَ، عَنْ رَجُلٍ، عَنْ زَيْدِ بْنِ ثَابِتٍ، فِي هَذِهِ الْآيَةِ {لَا يَسْتَوِي الْقَاعِدُونَ مِنَ الْمُؤْمِنِينَ} [النساء: 95] بِمِثْلِ حَدِيثِ الْبَرَاءِ، وقَالَ ابْنُ بَشَّارٍ فِي رِوَايَتِهِ: سَعْدُ بْنُ إِبْرَاهِيمَ، عَنْ أَبِيهِ، عَنْ رَجُلٍ، عَنْ زَيْدِ بْنِ ثَابِتٍ.",
                "headingArabic": "سُقُوطِ فَرْضِ الْجِهَادِ عَنِ الْمَعْذُورِينَ، ‏‏",
                "headingUrdu": "عذر والوں سے جہاد کا فرض ساقط ہے۔",
                "headingEnglish": "The duty of Jihad is waived for those who have excuses",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12475,
                "hadithNumber": "4912",
                "englishNarrator": "It has been narrated on the authority of Bara' رضی اللہ عنہ who said:",
                "hadithEnglish": "When the Qur'anic verse: Those who sit (at home) from among mu'min (iv. 94) was revealed, the son of Umm Maktum رضی اللہ عنہ spoke to him (the Holy Prophet). (At this). the words: other than those who have a trouble (illness) were revealed.",
                "hadithUrdu": "جب آیت : \" مومنوں میں سے گھر بیٹھنے والے مجاہدوں کے برابر نہیں \" نازل ہوئی تو ( عبداللہ ) ابن ام مکتوم رضی اللہ عنہ نے آپ صلی اللہ علیہ وسلم سے گفتگو کی ، تب ( غَيْرُ أُو۟لِى ٱلضَّرَرِ ) ( جو معذور نہیں ) کے الفاظ نازل ہوئے ۔",
                "urduNarrator": "ہم سے ابو کریب نے بیان کیا، کہا ہم سے ابن بشر نے بیان کیا, مسعر نے ابواسحاق سے ، انہوں نے حضرت براء رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا ابْنُ بِشْرٍ، عَنْ مِسْعَرٍ، حَدَّثَنِي أَبُو إِسْحَاقَ، عَنِ الْبَرَاءِ، قَالَ: لَمَّا نَزَلَتْ {لَا يَسْتَوِي الْقَاعِدُونَ مِنَ الْمُؤْمِنِينَ} [النساء: 95] كَلَّمَهُ ابْنُ أُمِّ مَكْتُومٍ، فَنَزَلَتْ {غَيْرُ أُولِي الضَّرَرِ} [النساء: 95].",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12476,
                "hadithNumber": "4913",
                "englishNarrator": "It has been reported on the authority of Jabir رضی اللہ عنہ :",
                "hadithEnglish": "A man said: Messenger of Allah, where shall I be if I am killed? He replied: In Paradise. The man threw away the dates he had in his hand and fought until he was killed (i. e. he did not wait until he could finish the dates). In the version of the tradition narrated by Suwaid we have the words: A man said to the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). on the day of Uhud......",
                "hadithUrdu": "ایک شخص نے عرض کی : اللہ کے رسول! اگر میں ( اللہ کی راہ میں لڑتے ہوئے ) شہید کر دیا جاؤں تو میں کہاں ہوں گا؟ فرمایا : \" جنت میں ۔ \" اس شخص کے ہاتھ میں جو کھجوریں تھیں اس نے ان کو پھینکا ، پھر لڑا حتی کہ شہید ہو گیا ۔ اور سوید کی روایت میں یہ ہے : ایک شخص نے اُحد کے دن نبی صلی اللہ علیہ وسلم سے عرض کی ۔",
                "urduNarrator": "سعید بن عمرو اشعثی اور سعید بن سعید نے ہمیں حدیث بیان کی : ۔ ۔ الفاظ سعید کے ہیں ۔ ۔ کہا : ہمیں سفیان نے عمرو سے خبر دی : انہوں نے حضرت جابر رضی اللہ عنہ کو یہ کہتے ہوئے سنا کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ عَمْرٍو الْأَشْعَثِيُّ، وَسُوَيْدُ بْنُ سَعِيدٍ، وَاللَّفْظُ لِسَعِيدٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ عَمْرٍو، سَمِعَ جَابِرًا، يَقُولُ: قَالَ رَجُلٌ: أَيْنَ أَنَا يَا رَسُولَ اللهِ إِنْ قُتِلْتُ؟ قَالَ: «فِي الْجَنَّةِ»، فَأَلْقَى تَمَرَاتٍ كُنَّ فِي يَدِهِ، ثُمَّ قَاتَلَ حَتَّى قُتِلَ، وَفِي حَدِيثِ سُوَيْدٍ: قَالَ رَجُلٌ لِلنَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَوْمَ أُحُدٍ.",
                "headingArabic": "ثُبُوتِ الْجَنَّةِ لِلشَّهِيدِ ‏‏",
                "headingUrdu": "شہید کے لیے جنت کا اثبات",
                "headingEnglish": "Affirmation of Paradise for the Martyr",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12477,
                "hadithNumber": "4914",
                "englishNarrator": "It has been reported on the authority of Bara رضی اللہ عنہ ' who stated:",
                "hadithEnglish": "A man from Banu Nabit (one of the Ansar tribes) came to the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and said: I testify that there is no god except Allah and that thou art His bondman and Messenger. Then he went forward and fought until he was killed. The Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: He has done a little but shall be given a great reward.",
                "hadithUrdu": "انصار کے ایک قبیلے ، بنو نبیت میں سے ایک شخص ( نبی صلی اللہ علیہ وسلم کی خدمت میں ) آیا اور اس نے کہا : میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی عبادت کا مستحق نہیں اور بلاشبہ آپ اللہ کے بندے اور اس کے رسول ہیں ، پھر آگے بڑھا ، ( خوب ) جنگ کی حتی کہ شہید کر دیا گیا ، نبی صلی اللہ علیہ وسلم نے فرمایا : \" اس شخص نے عمل بہت کم کیا اور اس کو اجر بہت زیادہ عطا کیا گیا ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے ابو اسامہ نے بیان کیا، انہوں نے زکریا سے اور ابواسحاق سے, حضرت براء رضی اللہ عنہ سے روایت ہے ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ زَكَرِيَّا، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ، قَالَ: جَاءَ رَجُلٌ مِنْ بَنِي النَّبِيتِ إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، ح وحَدَّثَنَا أَحْمَدُ بْنُ جَنَابٍ الْمِصِّيصِيُّ، حَدَّثَنَا عِيسَى يَعْنِي ابْنَ يُونُسَ، عَنْ زَكَرِيَّا، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ، قَالَ: جَاءَ رَجُلٌ مِنْ بَنِي النَّبِيتِ قَبِيلٍ مِنَ الْأَنْصَارِ، فَقَالَ: أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللهُ، وَأَنَّكَ عَبْدُهُ وَرَسُولُهُ، ثُمَّ تَقَدَّمَ فَقَاتَلَ حَتَّى قُتِلَ، فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «عَمِلَ هَذَا يَسِيرًا، وَأُجِرَ كَثِيرًا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12478,
                "hadithNumber": "4915",
                "englishNarrator": "It has been reported on the authority of Anas bin Malik رضی اللہ عنہ who said:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sent Busaisah as a scout to see what the caravan of Abu Sufyan was doing. He came (back and met the Prophet in his house) where there was nobody except myself and the Messenger of Allah. I do not remember whether he (Hadrat Anas رضی اللہ عنہ) made an exception of some wives of the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) or not and told him the news of the caravan. (Having heard the news), the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came out (hurriedly), spoke to the people and said: We are in need (of men); whoever has an animal to ride upon ready with him should ride with us. People began to ask him permission for bringing their riding animals which were grazing on the hillocks near Medina. He said: No. (I want) only those who have their riding animals ready. So the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and his Companions proceeded towards Badr and reached there forestalling the polytheists (of Mecca). When the polytheists (also) reached there, the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: None of you should step forward to (do) anything unless I am ahead of him. The polytheists (now) advanced (towards us), and the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said. Get up to enter Paradise which is equal in width to the heavens and the earth. 'Umair bin al- Humam al-Ansari رضی اللہ عنہ said: Messenger of Allah, is Paradise equal in extent to the heavens and the earth? He said: Yes. 'Umair رضی اللہ عنہ said: My goodness! The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) asked him: What prompted you to utter these words (i.e. my goodness! ')? He said: Messenger of Allah, nothing but the desire that I be among its residents. He said: Thou art (surely) among its residents. He took out dates from his bag and began to eat them. Then he said: If I were to live until I have eaten all these dates of mine, it would be a long life. (The narrator said): He threw away all the dates he had with him. Then he fought the enemies until he was killed.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ابوسفیان کی خبر لانے کے لئے بُسیسہ ( خزرجی انصاری ) رضی اللہ عنہ کو جاسوس بنا کر بھیجا کہ دیکھے ابوسفیان کے ( تجارتی ) قافلے کی کیا صورتِ حال ہے ۔ جس وقت وہ واپس آیا تو گھر میں میرے اور رسول اللہ صلی اللہ علیہ وسلم کے سوا اور کوئی نہیں تھا ، ۔ ۔ ( ثابت نے ) کہا : مجھے انس رضی اللہ عنہ کا کسی ام المومنین کو مستثنیٰ کرنا معلوم نہیں ۔ ۔ کہا : اس نے آ کر آپ کو ساری بات بتائی تو رسول اللہ صلی اللہ علیہ وسلم باہر تشریف لائے اور فرمایا : \" ہمیں کچھ ( کرنا ) مطلوب ہے ، سو جس کے پاس سواری موجود ہو وہ ہمارے ساتھ سوار ہو کر چلے ۔ \" کچھ لوگ بالائی مدینہ میں ( موجود ) اپنی سواریاں لانے کی اجازت طلب کرنے لگے ۔ آپ نے فرمایا : \" نہیں ، صرف وہی لوگ ( ساتھ چلیں ) جن کی سواریاں یہیں موجود ہوں ۔ \" پھر رسول اللہ صلی اللہ علیہ وسلم اور آپ کے اصحاب چل پڑے اور مشرکین سے پہلے \" بدر \" پہنچ گئے ، مشرکین بھی آ پہنچے ، نبی صلی اللہ علیہ وسلم نے فرمایا : \" کوئی شخص ، جب تک میں اس کے پیچھے نہ ہوں ، کسی چیز پر پیش قدمی نہ کرے ۔ \" مشرکین قریب آ گئے تو نبی صلی اللہ علیہ وسلم نے فرمایا : \" اس جنت کی طرف بڑھ جس کی چوڑائی آسمان اور زمین ہیں ۔ \" کہا : ( یہ سن کر ) حضرت عمیر بن حمام انصاری رضی اللہ عنہ کہنے لگے : یا رسول اللہ! جنت جس کا عرض آسمان اور زمین ہے؟ آپ نے فرمایا : \" ہاں ۔ \" اس نے کہا : واہ واہ! رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم نے یہ واہ واہ کس وجہ سے کہا؟ \" اس نے کہا : اللہ کے رسول! اس امید کے سوا اور کسی وجہ سے نہیں ( کہا ) کہ میں ( بھی ) جنت والوں میں سے ہو جاؤں ، آپ نے فرمایا : \" بلاشبہ تم اہل جنت میں سے ہو ۔ \" حضرت عمیر رضی اللہ عنہ نے اپنے ترکش سے کچھ کھجوریں نکال کر کھانی شروع کیں ، پھر کہنے لگے : اگر میں اپنی ان کھجوروں کو کھا لینے تک زندہ رہا تو پھر یہ بڑی لمبی زندگی ہو گی ( یعنی جنت ملنے میں دیر ہو جائے گی ) ، پھر انہوں نے ، جو کھجوریں ان کے پاس تھیں ، پھینکیں اور لڑائی شروع کر دی یہاں تک کہ شہید ہو گئے ۔",
                "urduNarrator": "ہم سے ابوبکر بن النضر بن ابی النضر، ہارون بن عبداللہ، محمد بن رافع اور عبد بن حمید نے بیان کیا اور ان کے الفاظ انہوں نے کہا: ہم سے ہاشم بن قاسم نے بیان کیا جو کہ ابن المغیرہ  , ثابت نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ النَّضْرِ بْنِ أَبِي النَّضْرِ، وَهَارُونُ بْنُ عَبْدِ اللهِ، وَمُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، وَأَلْفَاظُهُمْ مُتَقَارِبَةٌ، قَالُوا: حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، حَدَّثَنَا سُلَيْمَانُ وَهُوَ ابْنُ الْمُغِيرَةِ، عَنْ ثَابِتٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ: بَعَثَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بُسَيْسَةَ عَيْنًا يَنْظُرُ مَا صَنَعَتْ عِيرُ أَبِي سُفْيَانَ، فَجَاءَ وَمَا فِي الْبَيْتِ أَحَدٌ غَيْرِي، وَغَيْرُ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: لَا أَدْرِي مَا اسْتَثْنَى بَعْضَ نِسَائِهِ، قَالَ: فَحَدَّثَهُ الْحَدِيثَ، قَالَ: فَخَرَجَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَتَكَلَّمَ، فَقَالَ: «إِنَّ لَنَا طَلِبَةً، فَمَنْ كَانَ ظَهْرُهُ حَاضِرًا فَلْيَرْكَبْ مَعَنَا»، فَجَعَلَ رِجَالٌ يَسْتَأْذِنُونَهُ فِي ظُهْرَانِهِمْ فِي عُلْوِ الْمَدِينَةِ، فَقَالَ: «لَا، إِلَّا مَنْ كَانَ ظَهْرُهُ حَاضِرًا»، فَانْطَلَقَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابُهُ حَتَّى سَبَقُوا الْمُشْرِكِينَ إِلَى بَدْرٍ، وَجَاءَ الْمُشْرِكُونَ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يُقَدِّمَنَّ أَحَدٌ مِنْكُمْ إِلَى شَيْءٍ حَتَّى أَكُونَ أَنَا دُونَهُ»، فَدَنَا الْمُشْرِكُونَ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «قُومُوا إِلَى جَنَّةٍ عَرْضُهَا السَّمَوَاتُ وَالْأَرْضُ»، قَالَ: - يَقُولُ عُمَيْرُ بْنُ الْحُمَامِ الْأَنْصَارِيُّ: - يَا رَسُولَ اللهِ، جَنَّةٌ عَرْضُهَا السَّمَوَاتُ وَالْأَرْضُ؟ قَالَ: «نَعَمْ»، قَالَ: بَخٍ بَخٍ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَا يَحْمِلُكَ عَلَى قَوْلِكَ بَخٍ بَخٍ؟» قَالَ: لَا وَاللهِ يَا رَسُولَ اللهِ، إِلَّا رَجَاءَةَ أَنْ أَكُونَ مِنْ أَهْلِهَا، قَالَ: «فَإِنَّكَ مِنْ أَهْلِهَا»، فَأَخْرَجَ تَمَرَاتٍ مِنْ قَرَنِهِ، فَجَعَلَ يَأْكُلُ مِنْهُنَّ، ثُمَّ قَالَ: لَئِنْ أَنَا حَيِيتُ حَتَّى آكُلَ تَمَرَاتِي هَذِهِ إِنَّهَا لَحَيَاةٌ طَوِيلَةٌ، قَالَ: فَرَمَى بِمَا كَانَ مَعَهُ مِنَ التَّمْرِ، ثُمَّ قَاتَلَهُمْ حَتَّى قُتِلَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12479,
                "hadithNumber": "4916",
                "englishNarrator": "The tradition has been narrated on the authority of 'Abdullah bin Qais. He heard it from his father who, while facing the enemy, reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Surely, the gates of Paradise are under the shadows of the swords. A man in a shabby condition got up and said; Abu Musa, did you hear the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) say this? He said: Yes. (The narrator said): He returned to his friends and said: I greet you (a farewell greeting). Then he broke the sheath of his sword, threw it away, advanced with his (naked) sword towards the enemy and fought (them) with it until he was slain.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جنت کے دروازے تلواروں کے سائے تلے ( ہوتے ) ہیں ۔ \" یہ سن کر ایک خستہ حال شخص کھڑا ہوا اور کہنے لگا : ابوموسیٰ! کیا تم نے رسول اللہ صلی اللہ علیہ وسلم کو خود یہ فرماتے ہوئے سنا تھا؟ انہوں نے کہا : ہاں ۔ یہ سن کر وہ شخص واپس اپنے ساتھیوں کے پاس گیا اور کہنے لگا : میں تمہیں ( الوداعی ) سلام کہتا ہوں ، پھر اس نے اپنی تلوار کی نیام توڑ کر پھینک دی اور تلوار لے کر بڑھا ، اس سے شمشیر زنی کی یہاں تک کہ شہید کر دیا گیا ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ التمیمی اور قتیبہ بن سعید نے بیان کیا، اور لفظ یحییٰ ہے، قتیبہ نے کہا: ہم سے انہوں نے بیان کیا، اور یحییٰ نے کہا: ہم سے جعفر نے بیان کیا۔ بن سلیمان، ابو عمران الجونی کی طرف سے، ابوبکر بن عبداللہ بن قیس سے روایت ہے ، انہوں نے اپنے والد ( حضرت ابوموسیٰ اشعری رضی اللہ عنہ ) سے روایت کی ، کہا : میں نے اپنے والد سے ، جب وہ دشمن کا سامنا کر رہے تھے ، سنا : وہ کہہ رہے تھے",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَاللَّفْظُ لِيَحْيَى، قَالَ قُتَيْبَةُ: حَدَّثَنَا، وقَالَ يَحْيَى: أَخْبَرَنَا جَعْفَرُ بْنُ سُلَيْمَانَ، عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ اللهِ بْنِ قَيْسٍ، عَنْ أَبِيهِ، قَالَ: سَمِعْتُ أَبِي، وَهُوَ بِحَضْرَةِ الْعَدُوِّ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ أَبْوَابَ الْجَنَّةِ تَحْتَ ظِلَالِ السُّيُوفِ»، فَقَامَ رَجُلٌ رَثُّ الْهَيْئَةِ، فَقَالَ: يَا أَبَا مُوسَى، آنْتَ سَمِعْتَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ هَذَا؟ قَالَ: نَعَمْ، قَالَ: فَرَجَعَ إِلَى أَصْحَابِهِ، فَقَالَ: أَقْرَأُ عَلَيْكُمُ السَّلَامَ، ثُمَّ كَسَرَ جَفْنَ سَيْفِهِ فَأَلْقَاهُ، ثُمَّ مَشَى بِسَيْفِهِ إِلَى الْعَدُوِّ فَضَرَبَ بِهِ حَتَّى قُتِلَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12480,
                "hadithNumber": "4917",
                "englishNarrator": "It has been reported on the authority of Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "Some people came to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and said to him: Send with us some men who may teach us the Qur'an and the Sunnah. Accordingly, he sent seventy men from the Ansar. They were called the Reciters and among them was my maternal uncle. Haram. They used to recite the Qur'an, discuss and ponder over its meaning at night. In the day they brought water and poured it (in pitchers) in the mosque, collected wood and sold it, and with the sale proceeds bought food for the people of the Suffa and the needy. The Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) sent the Reciters with these people, but these (treacherous people) fell upon them and killed their before they reached their destination (While dying), they said: O Allah, convey from us the news to our Prophet that we have met Thee (in a way) that we are pleased with Thee and Thou art pleased with us. (The narrator said): A man attacked Haram (maternal uncle of Anas) ) from behind and smote him with a spear which pierced him. (While dying), Haram said: By the Lord of the Ka'ba, I have met with success. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said to his Companions: Your brethren have been slain grid they were saying: O Allah, convey from us to our Prophet the news that we have met Thee in a way that we are pleased with Thee and Thou art pleased with us.",
                "hadithUrdu": "کچھ لوگ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور کہنے لگے : ہمارے ساتھ کچھ آدمی بھیج دیں جو ( ہمیں ) قرآن اور سنت کی تعلیم دیں ۔ آپ نے ان کے ساتھ ستر انصاری بھیج دیے جنہیں قراء کہا جاتا تھا ، ان میں میرے ماموں حضرت حرام ( بن ملحان رضی اللہ عنہ ) بھی تھے ، یہ لوگ رات کے وقت قرآن پڑھتے تھے ، ایک دوسرے کو سناتے تھے ، قرآن کی تعلیم حاصل کرتے تھے ، اور دن کو مسجد میں پانی لا کر رکھتے تھے اور جنگل سے لکڑیاں لا کر فروخت کرتے اور اس سے اصحاب صفہ اور فقراء کے لیے کھانا خریدتے تھے ، نبی صلی اللہ علیہ وسلم نے انہیں ان ( آنے والے کافروں ) کی طرف بھیجا اور انہوں نے منزل پر پہنچنے سے پہلے ( راستے ہی میں دھوکے سے ) ان پر حملہ کر دیا اور انہیں شہید کر دیا ، اس وقت انہوں نے کہا : اے اللہ! ہماری طرف سے ہمارے نبی کو یہ پیغام پہنچا دے کہ ہماری تجھ سے ملاقات ہو گئی ہے ، ہم تجھ سے راضی ہو گئے ہیں اور تو ہم سے راضی ہو گیا ہے ۔ اس سانحے میں ایک شخص نے پیچھے سے آ کر انس رضی اللہ عنہ کے ماموں ، حرام ( بن ملحان ) رضی اللہ عنہ کو اس طرح نیزہ مارا کہ وہ آر پار ہو گیا تو انہوں نے کہا : رب کعبہ کی قسم! میں کامیاب ہو گیا ، اس وقت رسول اللہ صلی اللہ علیہ وسلم نے اپنے اصحاب سے فرمایا : \" تمہارے بھائی شہید کر دیے گئے ہیں اور انہوں نے کہا ہے : \" اے اللہ! ہمارے نبی کو یہ پیغام پہنچا دے کہ ہم نے تجھ سے ملاقات کر لی ہے ، ہم تجھ سے راضی ہو گئے ہیں اور تو ہم سے راضی ہو گیا ہے ۔ \"",
                "urduNarrator": "ہم سے محمد بن حاتم نے بیان کیا، کہا ہم سے عفان نے بیان کیا، کہا ہم سے حماد نے بیان کیا, ثابت نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادٌ، أَخْبَرَنَا ثَابِتٌ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ: جَاءَ نَاسٌ إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالُوا: أَنِ ابْعَثْ مَعَنَا رِجَالًا يُعَلِّمُونَا الْقُرْآنَ وَالسُّنَّةَ، فَبَعَثَ إِلَيْهِمْ سَبْعِينَ رَجُلًا مِنَ الْأَنْصَارِ، يُقَالُ لَهُمْ: الْقُرَّاءُ، فِيهِمْ خَالِي حَرَامٌ، يَقْرَءُونَ الْقُرْآنَ، وَيَتَدَارَسُونَ بِاللَّيْلِ يَتَعَلَّمُونَ، وَكَانُوا بِالنَّهَارِ يَجِيئُونَ بِالْمَاءِ فَيَضَعُونَهُ فِي الْمَسْجِدِ، وَيَحْتَطِبُونَ فَيَبِيعُونَهُ، وَيَشْتَرُونَ بِهِ الطَّعَامَ لِأَهْلِ الصُّفَّةِ وَلِلْفُقَرَاءِ، فَبَعَثَهُمُ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِلَيْهِمْ، فَعَرَضُوا لَهُمْ، فَقَتَلُوهُمْ قَبْلَ أَنْ يَبْلُغُوا الْمَكَانَ، فَقَالُوا: اللهُمَّ، بَلِّغْ عَنَّا نَبِيَّنَا أَنَّا قَدْ لَقِينَاكَ فَرَضِينَا عَنْكَ، وَرَضِيتَ عَنَّا، قَالَ: وَأَتَى رَجُلٌ حَرَامًا، خَالَ أَنَسٍ مِنْ خَلْفِهِ، فَطَعَنَهُ بِرُمْحٍ حَتَّى أَنْفَذَهُ، فَقَالَ حَرَامٌ: فُزْتُ وَرَبِّ الْكَعْبَةِ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِأَصْحَابِهِ: إِنَّ إِخْوَانَكُمْ قَدْ قُتِلُوا، وَإِنَّهُمْ قَالُوا: اللهُمَّ بَلِّغْ عَنَّا نَبِيَّنَا أَنَّا قَدْ لَقِينَاكَ فَرَضِينَا عَنْكَ، وَرَضِيتَ عَنَّا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12481,
                "hadithNumber": "4918",
                "englishNarrator": "It has been Deported on the authority of Anas رضی اللہ عنہ who said:",
                "hadithEnglish": "My uncle and I have been named after him was not present with the Messenger of Allah (ﷺ) on the Day of Badr. He felt distressed about it. He would say: I have missed the first battle fought by the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), and if God now gives me an opportunity to see a battlefield with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), God will see what I do therein. He was afraid to say more than this (lest he be unable to keep his word with God). He was present with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) on the Day of Uhud. He met Sa'd bin Mu'adh رضی اللہ عنہ (who was retreating). Anas رضی اللہ عنہ said to him: O Abu 'Amr, where (are you going)? Woe (to thee)! I find the smell of Paradise beside the Uhud mountain. (Reprimanding Sa'd in these words) he went forward and fought thein (the enemy) until he was killed. (The narrator says). More than eighty wounds inflicted with swords, spears and arrows were found on his body. His sister, my aunt, ar-Rubayyi' رضی اللہ عنہ , daughter of Nadr, said: I could not recognize my brother's body (it was so badly mutilated) except from his finger-tips. (It was on this occasion that) the Qur'anic verse: Among the Believers are men who have been true to their covenant with God. Of them some have completed their vow (to the extreme), and some still wait: but they have never changed (their determination) in the least (xxxiii. 23). The narrator said that the verse had been revealed about him (Anas bin Nadr رضی اللہ عنہ) and his Companions.",
                "hadithUrdu": "میرے چچا جن کے نام پر میرا نام رکھا گیا ہے ، وہ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ جنگ بدر میں حاضر نہیں ہو سکے تھے اور یہ بات ان پر بہت شاق گزری تھی ۔ انہوں نے کہا : یہ پہلا معرکہ تھا جس میں رسول اللہ صلی اللہ علیہ وسلم شریک ہوئے اور میں اس سے غیر حاضر رہا ، اس کے بعد اگر اللہ تعالیٰ نے رسول اللہ صلی اللہ علیہ وسلم کی معیت میں کوئی معرکہ مجھے دکھایا تو اللہ مجھے بھی دیکھے گا کہ میں کیا کرتا ہوں ۔ وہ ان کلمات کے علاوہ کوئی اور بات کہنے سے ڈرے ( دل میں بہت کچھ کر گزرنے کا عزم تھا لیکن اس فقرے سے زیادہ کچھ نہیں کہا ۔ ) ، پھر وہ غزوہ اُحد کے دن رسول اللہ صلی اللہ علیہ وسلم کے ساتھ شریک ہوئے ، کہا : پھر سعد بن معاذ رضی اللہ عنہ ان کے سامنے آئے تو ( میرے چچا ) انس ( بن نضر ) رضی اللہ عنہ نے ان سے کہا : ابوعمرو! کدھر؟ ( پھر کہا : ) جنت کی خوشبو کیسی عجیب ہے! جو مجھے کوہِ احد کے پیچھے سے آ رہی ہے ، پھر وہ کافروں سے لڑے یہاں تک کہ شہید ہو گئے ۔ ان کے جسم پر تلوار ، نیزے اور تیروں کے اَسی سے اوپر زخم پائے گئے ۔ ان کی بہن ، میری پھوپھی ، ربیع بنت نضر رضی اللہ عنہ نے کہا : میں نے اپنے بھائی ( کی لاش ) کو صرف ان کی انگلیوں کے پوروں سے پہچانا تھا ، ( اسی موقع پر ) یہ آیت نازل ہوئی : \" ( مومنوں میں سے ) کتنے مرد ہیں کہ جس ( قول ) پر انہوں نے اللہ سے عہد کیا تھا ، اسے سچ کر دکھایا ، ان میں سے کچھ ایسے ہیں جنہوں نے اپنا ذمہ پورا کر دیا ، اور ان میں سے کوئی ایسے ہیں جو منتظر ہیں ، وہ ذرہ برابر تبدیل نہیں ہوئے ( اپنے اللہ کے ساتھ کیے ہوئے عہد پر قائم ہیں ۔ ) \" صحابہ کرام کا خیال یہ تھا کہ یہ آیت حضرت انس ( بن نضر ) رضی اللہ عنہ اور ان کے ساتھیوں کے بارے میں نازل ہوئی ۔",
                "urduNarrator": "ہم سے محمد بن حاتم نے بیان کیا، ہم سے بہز نے بیان کیا، ہم سے سلیمان بن المغیرہ نے بیان کیا، ثابت کی سند سے، انہوں نے کہا, حضرت انس رضی اللہ عنہ نے کہا",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، عَنْ ثَابِتٍ، قَالَ: قَالَ أَنَسٌ: «عَمِّيَ الَّذِي سُمِّيتُ بِهِ لَمْ يَشْهَدْ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَدْرًا»، قَالَ: فَشَقَّ عَلَيْهِ، قَالَ: أَوَّلُ مَشْهَدٍ شَهِدَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ غُيِّبْتُ عَنْهُ، وَإِنْ أَرَانِيَ اللهُ مَشْهَدًا فِيمَا بَعْدُ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لَيَرَانِي اللهُ مَا أَصْنَعُ، قَالَ: «فَهَابَ أَنْ يَقُولَ غَيْرَهَا»، قَالَ: «فَشَهِدَ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَوْمَ أُحُدٍ»، قَالَ: فَاسْتَقْبَلَ سَعْدُ بْنُ مُعَاذٍ، فَقَالَ لَهُ أَنَسٌ: يَا أَبَا عَمْرٍو، أَيْنَ؟ فَقَالَ: وَاهًا لِرِيحِ الْجَنَّةِ أَجِدُهُ دُونَ أُحُدٍ، قَالَ: «فَقَاتَلَهُمْ حَتَّى قُتِلَ»، قَالَ: «فَوُجِدَ فِي جَسَدِهِ بِضْعٌ وَثَمَانُونَ مِنْ بَيْنِ ضَرْبَةٍ وَطَعْنَةٍ وَرَمْيَةٍ»، قَالَ: فَقَالَتْ أُخْتُهُ - عَمَّتِيَ الرُّبَيِّعُ بِنْتُ النَّضْرِ - فَمَا عَرَفْتُ أَخِي إِلَّا بِبَنَانِهِ، وَنَزَلَتْ هَذِهِ الْآيَةُ: {رِجَالٌ صَدَقُوا مَا عَاهَدُوا اللهَ عَلَيْهِ فَمِنْهُمْ مَنْ قَضَى نَحْبَهُ وَمِنْهُمْ مَنْ يَنْتَظِرُ وَمَا بَدَّلُوا تَبْدِيلًا} [الأحزاب: 23] ، قَالَ: «فَكَانُوا يُرَوْنَ أَنَّهَا نَزَلَتْ فِيهِ وَفِي أَصْحَابِهِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12482,
                "hadithNumber": "4919",
                "englishNarrator": "It has been narrated on the authority of Abu Musa Ash'ari رضی اللہ عنہ :",
                "hadithEnglish": "A desert Arab came to the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: Messenger of Allah, one man fights for the spoils of war; another fights that he may be remembered, and another fights that he may see his (high) position (achieved as a result of his valour in fighting). Which of these is fighting in the cause of God? The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Who fights so that the word of Allah is exalted is fighting in the way of Allah.",
                "hadithUrdu": "ایک اعرابی رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور کہا : اللہ کے رسول! کوئی شخص مال غنیمت کی خاطر لڑتا ہے ، کوئی شخص اس لئے لڑتا ہے کہ اس ( کے کارناموں ) کا ذکر ہو اور کوئی اس لیے لڑتا ہے کہ ( لڑائی اور شجاعت ) میں اس کے مقام کو دیکھا جائے ، ان میں سے اللہ کے راستے میں ( لڑنے والا ) کون ہے؟ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" وہ شخص جو اس لیے لڑے کہ اللہ کا کلمہ اونچا ہو ، وہی اللہ کے راستے میں ( لڑنے والا ) ہے ۔ \"",
                "urduNarrator": "ہم سے محمد بن مثنیٰ اور ابن بشار نے بیان کیا، اور یہ قول ابن المثنیٰ کا ہے، انہوں نے کہا: ہم سے محمد بن جعفر نے بیان کیا، ہم سے شعبہ نے بیان کیا, عمرو بن مرہ نے کہا : میں نے ابووائل ( شقیق ) سے سنا ، انہوں نے کہا : ہمیں ابو موسیٰ اشعری رضی اللہ عنہ نے حدیث بیان کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، وَاللَّفْظُ لِابْنِ الْمُثَنَّى، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، قَالَ: سَمِعْتُ أَبَا وَائِلٍ، قَالَ: حَدَّثَنَا أَبُو مُوسَى الْأَشْعَرِيُّ، أَنَّ رَجُلًا أَعْرَابِيًّا أَتَى النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: يَا رَسُولَ اللهِ، الرَّجُلُ يُقَاتِلُ لِلْمَغْنَمِ، وَالرَّجُلُ يُقَاتِلُ لِيُذْكَرَ، وَالرَّجُلُ يُقَاتِلُ لِيُرَى مَكَانُهُ، فَمَنْ فِي سَبِيلِ اللهِ؟ فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ قَاتَلَ لِتَكُونَ كَلِمَةُ اللهِ أَعْلَى، فَهُوَ فِي سَبِيلِ اللهِ».",
                "headingArabic": "مَنْ قَاتَلَ لِتَكُونَ كَلِمَةُ اللَّهِ هِيَ الْعُلْيَا فَهُوَ فِي سَبِيلِ اللَّهِ ‏‏",
                "headingUrdu": "جو شخص اس لیے لڑتا ہے کہ اللہ کا کلمہ بلند ہو وہ اللہ کی راہ میں لڑ رہا ہے۔",
                "headingEnglish": "One who fights so that the word of Allah will be supreme is fighting in the cause of Allah",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12483,
                "hadithNumber": "4920",
                "englishNarrator": "It was narrated that Abu Musa رضی اللہ عنہ said:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was asked which of the men fights in the way of Allah: (one who fights) for displaying his courage; (a man who) fights out of his family pride and (a man who) fights for the sake of show, who amongst these fights in the way of Allah? The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Who fights that the word of Allah be exalted fights in the way of Allah.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم سے ایسے شخص کے بارے میں سوال کیا گیا جو شجاعت کے لیے لڑتا ہے ، کوئی ( قومی ) حمیت کے لیے لڑتا ہے ، کوئی دکھاوے کے لیے لڑتا ہے ، ان میں سے اللہ کی راہ میں ( لڑنے والا ) کون ہے؟ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جو شخص اس لیے لڑا کہ اللہ کا کلمہ سب سے اونچا ہو تو وہی اللہ کے لئے لڑنے والا ہے ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، ابن نمیر، اسحاق بن ابراہیم اور محمد بن علاء نے بیان کیا، انہوں نے کہا: انہوں نے ہمیں خبر دی۔ ابومعاویہ نے اعمش سے ، انہوں نے شقیق سے ، انہوں نے ابوموسیٰ اشعری رضی اللہ عنہ سے حدیث بیان کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ نُمَيْرٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ الْعَلَاءِ، قَالَ إِسْحَاقُ: أَخْبَرَنَا، وقَالَ الْآخَرُونَ: حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ أَبِي مُوسَى، قَالَ: سُئِلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ الرَّجُلِ يُقَاتِلُ شَجَاعَةً، وَيُقَاتِلُ حَمِيَّةً، وَيُقَاتِلُ رِيَاءً، أَيُّ ذَلِكَ فِي سَبِيلِ اللهِ؟ فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ قَاتَلَ لِتَكُونَ كَلِمَةُ اللهِ هِيَ الْعُلْيَا، فَهُوَ فِي سَبِيلِ اللهِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12484,
                "hadithNumber": "4921",
                "englishNarrator": "It was narrated that Abu Musa رضی اللہ عنہ said:",
                "hadithEnglish": "We, came to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: Messenger of Allah, one of us who fights to display his valour... (followed by the same words as we have in the previous tradition).",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کی : اللہ کے رسول! ہم میں سے کوئی شخص اظہار شجاعت کے لیے لڑتا ہے ۔ پھر اسی کے مانند حدیث بیان کی ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا, عیسیٰ بن یونس نے کہا : ہمیں اعمش نے شقیق سے حدیث بیان کی ، انہوں نے حضرت ابوموسیٰ اشعری رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا الْأَعْمَشُ، عَنْ شَقِيقٍ، عَنْ أَبِي مُوسَى، قَالَ: أَتَيْنَا رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقُلْنَا: يَا رَسُولَ اللهِ، الرَّجُلُ يُقَاتِلُ مِنَّا شَجَاعَةً فَذَكَرَ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12485,
                "hadithNumber": "4922",
                "englishNarrator": "It was narrated from Abu Musa Ash'ari رضی اللہ عنہ :",
                "hadithEnglish": "A man asked the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) about fighting in the way of Allah, the Exalted and Majestic, a man who fights out of rage or out of family pride. He raised his head towards him-and he did so because the man was standing and said: Who fights that the word of Allah be exalted fights in the way of Allah.",
                "hadithUrdu": "ایک آدمی نے رسول اللہ صلی اللہ علیہ وسلم سے اللہ کی راہ میں جنگ کرنے کے متعلق سوال کیا اور کہا : ایک شخص غصے کی وجہ سے جنگ کرتا ہے ، ایک شخص ( قومی ) حمیت کی بنا پر جنگ کرتا ہے ۔ کہا : تو آپ صلی اللہ علیہ وسلم نے اس کی طرف اپنا سر مبارک اٹھایا اور صرف اس لیے اٹھایا کہ وہ آدمی کھڑا ہوا تھا اور فرمایا : \" جو شخص اس لیے لڑا کہ اللہ کا کلمہ سب سے اونچا ہو ، وہی اللہ کی راہ میں ( لڑنے والا ) ہے ۔ \"",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے جریر نے بیان کیا, منصور نے ابووائل سے ، انہوں نے حضرت ابوموسیٰ اشعری رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ، أَنَّ رَجُلًا سَأَلَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، عَنِ الْقِتَالِ فِي سَبِيلِ اللهِ عَزَّ وَجَلَّ، فَقَالَ الرَّجُلُ: يُقَاتِلُ غَضَبًا، وَيُقَاتِلُ حَمِيَّةً، قَالَ: فَرَفَعَ رَأْسَهُ إِلَيْهِ، وَمَا رَفَعَ رَأْسَهُ إِلَيْهِ إِلَّا أَنَّهُ كَانَ قَائِمًا، فَقَالَ: «مَنْ قَاتَلَ لِتَكُونَ كَلِمَةُ اللهِ هِيَ الْعُلْيَا، فَهُوَ فِي سَبِيلِ اللهِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12486,
                "hadithNumber": "4923",
                "englishNarrator": "It has been narrated on the authority of Sulaiman bin Yasar who said:",
                "hadithEnglish": "People dispersed from around Abu Huraira رضی اللہ عنہ , and Natil, who was from the Syrians. said to him: O Shaikh, relate (to us) a tradition you have heard from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). He said: Yes. I heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) say: The first of men (whose case) will be decided on the Day of Judgment will be a man who died as a martyr. He shall be brought (before the Judgment Seat). Allah will make him recount His blessings (i. e. the blessings which He had bestowed upon him) and he will recount them (and admit having enjoyed them in his life). (Then) will Allah say: What did you do (to requite these blessings)? He will say: I fought for Thee until I died as a martyr. Allah will say: You have told a lie. You fought that you might be called a brave warrior . And you were called so. (Then) orders will be passed against him and he will be dragged with his face downward and cast into Hell. Then will be brought forward a man who acquired knowledge and imparted it (to others) and recited the Qur'an. He will be brought And Allah will make him recount His blessings and he will recount them (and admit having enjoyed them in his lifetime). Then will Allah ask: What did you do (to requite these blessings)? He will say: I acquired knowledge and disseminated it and recited the Qur'an seeking Thy pleasure. Allah will say: You have told a lie. You acquired knowledge so that you might be called a scholar, and you recited the Qur'an so that it might be said: He is a Qari and such has been said. Then orders will be passed against him and he shall be dragged with his face downward and cast into the Fire. Then will be brought a man whom Allah had made abundantly rich and had granted every kind of wealth. He will be brought and Allah will make him recount His blessings and he will recount them and (admit having enjoyed them in his lifetime). Allah will (then) ask: What have you done (to requite these blessings)? He will say: I spent money in every cause in which Thou wished that it should be spent. Allah will say: You are lying. You did (so) that it might be said about (You): He is a generous fellow and so it was said. Then will Allah pass orders and he will be dragged with his face downward and thrown into Hell.",
                "hadithUrdu": "( جمگھٹے کے بعد ) لوگ حضرت ابوہریرہ رضی اللہ عنہ کے پاس سے چھٹ گئے تو اہل شام میں سے ناتل ( بن قیس جزامی رئیس اہل شام ) نے ان سے کہا : شیخ! مجھے ایسی حدیث سنائیں جو آپ نے رسول اللہ صلی اللہ علیہ وسلم سے سنی ہو ، کہا : ہاں ، میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا : \" قیامت کے روز سب سے پہلا شخص جس کے خلاف فیصلہ آئے گا ، وہ ہو گا جسے شہید کر دیا گیا ۔ اسے پیش کیا جائے گا ۔ اللہ تعالیٰ اسے اپنی ( عطا کردہ ) نعمت کی پہچان کرائے گا تو وہ اسے پہچان لے گا ۔ وہ پوچھے گا تو نے اس نعمت کے ساتھ کیا کیا؟ وہ کہے گا : میں نے تیری راہ میں لڑائی کی حتی کہ مجھے شہید کر دیا گیا ۔ ( اللہ تعالیٰ ) فرمائے گا تو نے جھوٹ بولا ۔ تم اس لیے لڑے تھے کہ کہا جائے : یہ ( شخص ) جری ہے ۔ اور یہی کہا گیا ، پھر اس کے بارے میں حکم دیا جائے گا تو اس آدمی کو منہ کے بل گھسیٹا جائے گا یہاں تک کہ آگ میں ڈال دیا جائے گا اور وہ آدمی جس نے علم پڑھا ، پڑھایا اور قرآن کی قراءت کی ، اسے پیش کیا جائے گا ۔ ( اللہ تعالیٰ ) اسے اپنی نعمتوں کی پہچان کرائے گا ، وہ پہچان کر لے گا ، وہ فرمائے گا : تو نے ان نعمتوں کے ساتھ کیا کیا؟ وہ کہے گا : میں نے علم پڑھا اور پڑھایا اور تیری خاطر قرآن کی قراءت کی ، ( اللہ ) فرمائے گا : تو نے جھوٹ بولا ، تو نے اس لیے علم پڑھا کہ کہا جائے ( یہ ) عالم ہے اور تو نے قرآن اس لیے پڑھا کہ کہا جائے : یہ قاری ہے ، وہ کہا گیا ، پھر اس کے بارے میں حکم دیا جائے گا ، اسے منہ کے بل گھسیٹا جائے گا حتی کہ آگ میں ڈال دیا جائے گا ۔ اور وہ آدمی جس پر اللہ نے وسعت کی اور ہر قسم کا مال عطا کیا ، اسے لایا جائے گا ۔ اللہ تعالیٰ اسے اپنی نعمتوں کی پہچان کرائے گا ، وہ پہچان لے گا ۔ اللہ فرمائے گا : تم نے ان میں کیا کیا؟ کہے گا : میں نے کوئی راہ نہیں چھوڑی جس میں تمہیں پسند ہے کہ مال خرچ کیا جائے مگر ہر ایسی راہ میں خرچ کیا ۔ اللہ فرمائے گا : تم نے جھوٹ بولا ہے ، تم نے ( یہ سب ) اس لیے کیا تاکہ کہا جائے ، وہ سخی ہے ، ایسا ہی کہا گیا ، پھر اس کے بارے میں حکم دیا جائے گا ، تو اسے منہ کے بل گھسیٹا جائے گا ، پھر آگ میں ڈال دیا جائے گا ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن حبیب الحارثی نے بیان کیا, خالد بن حارث نے کہا : ہمیں ابن جریج نے حدیث بیان کی ، کہا : مجھے یونس بن یوسف نے سلیمان بن یسار سے حدیث بیان کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا ابْنُ جُرَيْجٍ، حَدَّثَنِي يُونُسُ بْنُ يُوسُفَ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، قَالَ: تَفَرَّقَ النَّاسُ عَنْ أَبِي هُرَيْرَةَ، فَقَالَ لَهُ نَاتِلُ أَهْلِ الشَّامِ: أَيُّهَا الشَّيْخُ، حَدِّثْنَا حَدِيثًا سَمِعْتَهُ مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: نَعَمْ، سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: إِنَّ أَوَّلَ النَّاسِ يُقْضَى يَوْمَ الْقِيَامَةِ عَلَيْهِ رَجُلٌ اسْتُشْهِدَ، فَأُتِيَ بِهِ فَعَرَّفَهُ نِعَمَهُ فَعَرَفَهَا، قَالَ: فَمَا عَمِلْتَ فِيهَا؟ قَالَ: قَاتَلْتُ فِيكَ حَتَّى اسْتُشْهِدْتُ، قَالَ: كَذَبْتَ، وَلَكِنَّكَ قَاتَلْتَ لِأَنْ يُقَالَ: جَرِيءٌ، فَقَدْ قِيلَ، ثُمَّ أُمِرَ بِهِ فَسُحِبَ عَلَى وَجْهِهِ حَتَّى أُلْقِيَ فِي النَّارِ، وَرَجُلٌ تَعَلَّمَ الْعِلْمَ، وَعَلَّمَهُ وَقَرَأَ الْقُرْآنَ، فَأُتِيَ بِهِ فَعَرَّفَهُ نِعَمَهُ فَعَرَفَهَا، قَالَ: فَمَا عَمِلْتَ فِيهَا؟ قَالَ: تَعَلَّمْتُ الْعِلْمَ، وَعَلَّمْتُهُ وَقَرَأْتُ فِيكَ الْقُرْآنَ، قَالَ: كَذَبْتَ، وَلَكِنَّكَ تَعَلَّمْتَ الْعِلْمَ لِيُقَالَ: عَالِمٌ، وَقَرَأْتَ الْقُرْآنَ لِيُقَالَ: هُوَ قَارِئٌ، فَقَدْ قِيلَ، ثُمَّ أُمِرَ بِهِ فَسُحِبَ عَلَى وَجْهِهِ حَتَّى أُلْقِيَ فِي النَّارِ، وَرَجُلٌ وَسَّعَ اللهُ عَلَيْهِ، وَأَعْطَاهُ مِنْ أَصْنَافِ الْمَالِ كُلِّهِ، فَأُتِيَ بِهِ فَعَرَّفَهُ نِعَمَهُ فَعَرَفَهَا، قَالَ: فَمَا عَمِلْتَ فِيهَا؟ قَالَ: مَا تَرَكْتُ مِنْ سَبِيلٍ تُحِبُّ أَنْ يُنْفَقَ فِيهَا إِلَّا أَنْفَقْتُ فِيهَا لَكَ، قَالَ: كَذَبْتَ، وَلَكِنَّكَ فَعَلْتَ لِيُقَالَ: هُوَ جَوَادٌ، فَقَدْ قِيلَ، ثُمَّ أُمِرَ بِهِ فَسُحِبَ عَلَى وَجْهِهِ، ثُمَّ أُلْقِيَ فِي النَّارِ .",
                "headingArabic": "مَنَ قَاتَلَ لِلرِّيَاءِ وَالسُّمْعَةِ اسْتَحَقَّ النَّارَ",
                "headingUrdu": "جو شخص دکھاوے اور شہرت حاصل کرنے کے لیے لڑتا ہے وہ جہنم کا مستحق ہے۔",
                "headingEnglish": "One who fights to show off and gain a reputation deserves Hell",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12487,
                "hadithNumber": "4924",
                "englishNarrator": null,
                "hadithEnglish": "It was narrated from Abu Hurairah that Natil Ash-Shami said to him... and he narrated a hadith like that of Khalid bin Al-Harith (as no. 4923).",
                "hadithUrdu": "ہم سے علی بن خشرم نے بیان کیا, حجاج بن محمد نے ہمیں ابن جریج سے خبر دی ، کہا : مجھے یونس بن یوسف نے سلیمان بن یسار سے حدیث سنائی ، انہوں نے کہا : لوگ حضرت ابوہریرہ رضی اللہ عنہ کے پاس سے چھٹ گئے تو ناتل شامی نے کہا ۔ ۔ ۔ اور ( اس کے بعد ) خالد بن حارث کی طرح حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَاهُ عَلِيُّ بْنُ خَشْرَمٍ، أَخْبَرَنَا الْحَجَّاجُ يَعْنِي ابْنَ مُحَمَّدٍ، عَنِ ابْنِ جُرَيْجٍ، حَدَّثَنِي يُونُسُ بْنُ يُوسُفَ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، قَالَ: تَفَرَّجَ النَّاسُ، عَنْ أَبِي هُرَيْرَةَ، فَقَالَ لَهُ نَاتِلٌ الشَّامِىُّ: وَاقْتَصَّ الْحَدِيثَ بِمِثْلِ حَدِيثِ خَالِدِ بْنِ الْحَارِثِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12488,
                "hadithNumber": "4925",
                "englishNarrator": "It has been narrated on the authority of 'Abdullah bin 'Amr رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: A troop of soldiers who fight in tile way of Allah and get their share of the booty receive in advance two-thirds of their reward in the Hereafter and only one-third will remain (to their credit). If they do not receive any booty, they will get their full reward.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" لڑنے والی کوئی بھی جماعت جو اللہ کی راہ میں جنگ کرتی ہے ، پھر وہ لوگ مالِ غنیمت حاصل کر لیتے ہیں تو وہ آخرت کے اجر سے دو حصے فورا حاصل کر لیتے ہیں ، ان کے لیے ایک باقی رہ جاتا ہے اور اگر وہ غنیمت حاصل نہیں کرتے تو ( آخرت میں ) ان کا اجر پورا ہو گا ۔ \"",
                "urduNarrator": "ہم سے عبد بن حمید نے بیان کیا، کہا ہم سے عبداللہ بن یزید ابوعبدالرحمٰن نے بیان کیا, حیوہ بن شریح نے ابوہانی سے روایت کی ، انہوں نے ابوعبدالرحمٰن حبلی سے ، انہوں نے عبداللہ بن عمرو رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، حَدَّثَنَا عَبْدُ اللهِ بْنُ يَزِيدَ أَبُو عَبْدِ الرَّحْمَنِ، حَدَّثَنَا حَيْوَةُ بْنُ شُرَيْحٍ، عَنْ أَبِي هَانِئٍ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِيِّ، عَنْ عَبْدِ اللهِ بْنِ عَمْرٍو، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَا مِنْ غَازِيَةٍ تَغْزُو فِي سَبِيلِ اللهِ فَيُصِيبُونَ الْغَنِيمَةَ، إِلَّا تَعَجَّلُوا ثُلُثَيْ أَجْرِهِمْ مِنَ الْآخِرَةِ، وَيَبْقَى لَهُمُ الثُّلُثُ، وَإِنْ لَمْ يُصِيبُوا غَنِيمَةً، تَمَّ لَهُمْ أَجْرُهُمْ».",
                "headingArabic": "بَيَانِ قَدْرِ ثَوَابِ مَنْ غَزَا فَغَنِمَ وَمَنْ لَمْ يَغْنَمْ ‏‏",
                "headingUrdu": "ان لوگوں کا اجر جنہوں نے جنگ کی اور غنیمت حاصل کی اور جنہوں نے غنیمت حاصل نہیں کی۔",
                "headingEnglish": "The reward of those who fought and acquired spoils of war and those who did not acquire spoils of war",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 12176,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=487",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=485",
                "label": "485",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=486",
                "label": "486",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=487",
                "label": "487",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=488",
                "label": "488",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=489",
                "label": "489",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=490",
                "label": "490",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=491",
                "label": "491",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=489",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=489",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=487",
        "to": 12200,
        "total": 40465
    }
}