{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 336,
        "data": [
            {
                "id": 8664,
                "hadithNumber": "1100",
                "englishNarrator": "It was narrated from Al-'Abbas bin 'Abdul Muttalib ‌رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "He heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) say: When a person prostates, he prostates on seven part of the body: His face, his hands, his knees and his feet.",
                "hadithUrdu": "انہوں نے رسول اللہﷺ کو فرماتے ہوئے سنا : ’’جب بندہ سجدہ کرتا ہے تو اس کے ساتھ سات اطراف ( کنارے یا اعضاء ) اس کا چہرہ ، اس کی دونوں ہتھیلیاں ، اس کے دونوں گھٹنے اور اس کے دونوں قدم سجدہ کرتے ہیں ۔ ‘ ‘",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ان سے بکر نے جو ابن مضر ہیں، انہوں نے ابن الہدی کی سند سے، انہوں نے محمد بن ابراہیم کی سند سے، وہ عامر بن سعد کی سند سے, حضرت عباس بن عبد المطلب ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا بَكْرٌ وَهُوَ ابْنُ مُضَرَ، عَنِ ابْنِ الْهَادِ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ عَامِرِ بْنِ سَعْدٍ، عَنِ الْعَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ، أَنَّهُ سَمِعَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: إِذَا سَجَدَ الْعَبْدُ سَجَدَ مَعَهُ سَبْعَةُ أَطْرَافٍ: وَجْهُهُ، وَكَفَّاهُ، وَرُكْبَتَاهُ، وَقَدَمَاهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8665,
                "hadithNumber": "1101",
                "englishNarrator": "Abdullah bin Abbas رضی اللہ عنہما reported:",
                "hadithEnglish": "He saw 'Abdullah bin al-Harith observing the prayer and (his hair) was plaited behind his head. He ('Abdullah bin 'Abbas رضی اللہ عنہما) stood up and unfolded them. While going back (from the prayer) he met Ibn 'Abbas رضی اللہ عنہما and said to him: Why is it that you touched my head? He (Ibn 'Abbas) replied: (The man who observes prayer with plaited hair) is like one who prays with his hands tied behind.",
                "hadithUrdu": "عبد اللہ بن حارث ( بن نوفل ‌رضی ‌اللہ ‌عنہ ‌ ‌ بن عبد المطلب ) کو نماز پڑھتے دیکھا ، ان کے سر پر پیچھے سے بالوں کو جوڑا بنا ہوا تھا ، عبد اللہ بن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ کھڑے ہو کر اس کو کھولنے لگے ، جب ابن حارث نے سلام پھیرا تو ابن عباس رضی اللہ عنہما کی طرف متوجہ ہوئے اور کہا : میرے سر کے ساتھ آپ کا کیا معاملہ ہے ( میرے بال کیوں کھولے؟ ) انہوں نے جواب دیا : میں نے رسول اللہ ﷺ کو یہ فرماتے ہوئے سنا : ’’اس طرح ( جوڑا باندھ کر ) نماز پڑھنے والے کی مثال اس انسان کی طرح ہے جو اس حال میں نماز پڑھتا ہے کہ اس کی مشکیں کسی ہوئی ہوں ۔ ‘ ‘",
                "urduNarrator": "ہم سے عمرو بن سواد العامری نے بیان کیا, کہا ہم سے عبداللہ بن وہب نے بیان کیا، کہا ہم سے عمرو بن حارث نے بیان کیا، ان سے بکر نے بیان کیا کہ کریب نے,حضرت عبد اللہ بن عباس رضی اللہ عنہما نے",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ سَوَّادٍ الْعَامِرِيُّ، أَخْبَرَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، أَخْبَرَنَا عَمْرُو بْنُ الْحَارِثِ، أَنَّ بُكَيْرًا، حَدَّثَهُ أَنَّ كُرَيْبًا مَوْلَى ابْنِ عَبَّاسٍ، حَدَّثَهُ عَنْ عَبْدِ اللهِ بْنِ عَبَّاسٍ، أَنَّهُ رَأَى عَبْدَ اللهِ بْنَ الْحَارِثِ، يُصَلِّي وَرَأْسُهُ مَعْقُوصٌ مِنْ وَرَائِهِ فَقَامَ فَجَعَلَ يَحُلُّهُ، فَلَمَّا انْصَرَفَ أَقْبَلَ إِلَى ابْنِ عَبَّاسٍ، فَقَالَ: مَا لَكَ وَرَأْسِي؟ فَقَالَ: إِنِّي سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّمَا مَثَلُ هَذَا، مَثَلُ الَّذِي يُصَلِّي وَهُوَ مَكْتُوفٌ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8666,
                "hadithNumber": "1102",
                "englishNarrator": "Anas ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Observe moderation in prostration, and let none of you stretch out his forearms (on the ground) like a dog.",
                "hadithUrdu": "رسول اللہﷺ نے فرمایا : ’’ سجدے میں اعتدال اختیار کرو اور کوئی شخص اس طرح اپنے بازور ( زمین پر ) نہ بچھائے جس طرح کتا بچھاتا ہے ۔ ‘ ‘",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، انہوں نے کہاوکیع نے شعبہ سے ، انہوں نے قتادہ سے اور انہوں نے حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «اعْتَدِلُوا فِي السُّجُودِ وَلَا يَبْسُطْ أَحَدُكُمْ ذِرَاعَيْهِ انْبِسَاطَ الْكَلْبِ».",
                "headingArabic": "الاِعْتِدَالِ فِي السُّجُودِ وَوَضْعِ الْكَفَّيْنِ عَلَى الأَرْضِ وَرَفْعِ الْمِرْفَقَيْنِ عَنِ الْجَنْبَيْنِ وَرَفْعِ الْبَطْنِ عَنِ الْفَخِذَيْنِ فِي السُّجُودِ",
                "headingUrdu": "سجدے میں اعتدال؛ ہاتھوں کو زمین پر رکھنا، کہنیوں کو اوپر رکھنا، اطراف سے دور رکھنا، اور سجدہ کرتے وقت پیٹ کو رانوں سے اوپر اٹھانا۔",
                "headingEnglish": "Moderation In Prostration; Placing The Hands On The Ground, Keeping The Elbows Up, Away From The Sides, And Lifting The Belly Up Off The Thighs When Prostrating",
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8667,
                "hadithNumber": "1103",
                "englishNarrator": "This hadith has been narrated by Shu'ba with the same chain of transmitters. And in the hidith transmitted by Ibn Ja'far (the words are):",
                "hadithEnglish": "None of you should stretch out his forearms like the stretching out of a dog.",
                "hadithUrdu": "’’کوئی شخص تکلف کر کے اپنے بازو اس طرح نہ بچھائے جس طرح کتا بچھاتا ہے ۔ ‘ ‘",
                "urduNarrator": "ہم سے محمد بن المثنا اور ابن بشار نے بیان کیا، انہوں نے کہا,محمد بن جعفر اور خالد بن حارث نے کہا , ہمیں شعبہ نے اسی سند کے ساتھ روایت کی ہے , ابن جعفر کی روایت میں ہے",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ح قَالَ: وَحَدَّثَنِيهِ يَحْيَى بْنُ حَبِيبٍ، حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ، قَالَا: حَدَّثَنَا شُعْبَةُ، بِهَذَا الْإِسْنَادِ وَفِي حَدِيثِ ابْنِ جَعْفَرٍ وَلَا يَتَبَسَّطْ أَحَدُكُمْ ذِرَاعَيْهِ انْبِسَاطَ الْكَلْبِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8668,
                "hadithNumber": "1104",
                "englishNarrator": "Al-Bira' (bin 'Azib) ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said. When you prostrate yourself, place the palms of your hands on the ground and raise your elbows.",
                "hadithUrdu": "رسول اللہﷺ نے فرمایا : ’’ جب تم سجدہ کرو تو اپنی ہتھیلیاں ( زمین پر ) رکھو اور اپنی کہنیاں اوپر اٹھاؤ",
                "urduNarrator": "234- (494) ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا کہ ہم سے عبید اللہ بن عیاض نے عیاض کی سند سے بیان کیا,حضرت براء ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے ، انہوں نے کہا کہ",
                "hadithArabic": "234 - (494) حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: أَخْبَرَنَا عُبَيْدُ اللهِ بْنُ إِيَادٍ، عَنْ إِيَادٍ، عَنِ الْبَرَاءِ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا سَجَدْتَ، فَضَعْ كَفَّيْكَ وَارْفَعْ مِرْفَقَيْكَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8669,
                "hadithNumber": "1105",
                "englishNarrator": "Abdullah bin Malik ibn Bujainah رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "When the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) prostrated, lie spread out his arms so that the whiteness of his armpits was visible.",
                "hadithUrdu": "رسول اللہﷺ جب نماز پڑھتے تو اپنے ہاتھوں کو اچھی طرح کھول دیتے ( اپنے پہلوؤں سے الگ کر لیتے تھے ) یہاں تک کہ آپ کی بغلوں کی سفیدی ظاہر ہو جاتی تھی ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا,بکر بن مضر نے جعفر بن ربیعہ سے ، انہوں نے اعرج سے اور انہوں نے حضرت عبد اللہ بن ملک سے ، جو ابن بحینہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ ہیں ، روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا بَكْرٌ وَهُوَ ابْنُ مُضَرَ، عَنْ جَعْفَرِ بْنِ رَبِيعَةَ، عَنِ الْأَعْرَجِ، عَنْ عَبْدِ اللهِ بْنِ مَالِكٍ ابْنِ بُحَيْنَةَ: «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا صَلَّى فَرَّجَ بَيْنَ يَدَيْهِ، حَتَّى يَبْدُوَ بَيَاضُ إِبْطَيْهِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8670,
                "hadithNumber": "1106",
                "englishNarrator": "This hadith has been narrated by Ja'far bin Rabi' with the same chain of transmitters. And in the narration transmitted by 'Amr bin al-Harith (the words are):",
                "hadithEnglish": "When the Messenger of Allah (ﷺ) prostrated, he spread out his arms so that the whiteness of his armpits was visible. And in the narration transmitted by al-Laith (the words are: When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) prostrated. he spread his hands from the armpits so that I saw their whiteness.",
                "hadithUrdu": "رسول اللہﷺ جب سجدہ فرماتے تو سجدے میں اپنے بازو ( اس طرح ) پھیلا لیتے حتیٰ کہ آپ کی بغلوں کی سفیدی نظر آ جاتی ۔ اور لیث کی روایت میں ہے : رسول اللہ ﷺ جب سجدہ کرتے تو اپنے ہاتھ بغلوں سے جدا ر کھتے حتیٰ کہ میں آپ کی بغلوں کی سفیدی دیکھ لیتا ۔",
                "urduNarrator": "ہم سے عمرو بن سواد نے بیان کیا، کہا ہم سے عبداللہ بن وہب نے بیان کیا,عمرو بن حارث اور لیث بن سعد دونوں نے جعفر بن ربیعہ سے اسی سند کے ساتھ ( مذکورہ حدیث ) بیان کی ۔ عمرو بن حارث کی روایت میں ہے",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ سَوَّادٍ، أَخْبَرَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، أَخْبَرَنَا عمْرو بْنُ الْحَارِثِ، وَاللَّيْثُ بْنُ سَعْدٍ، كِلَاهُمَا عَنْ جَعْفَرِ بْنِ رَبِيعَةَ، بِهَذَا الْإِسْنَادِ وَفِي رِوَايَةِ عَمْرِو بْنِ الْحَارِثِ، «كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِذَا سَجَدَ يُجَنِّحُ فِي سُجُودِهِ، حَتَّى يُرَى وَضَحُ إِبِطَيْهِ» وَفِي رِوَايَةِ اللَّيْثِ، «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَإِذَا سَجَدَ فَرَّجَ يَدَيْهِ عَنْ إِبِطَيْهِ حَتَّى إِنِّي لَأَرَى بَيَاضَ إِبِطَيْهِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8671,
                "hadithNumber": "1107",
                "englishNarrator": "Maimuna رضی اللہ عنہا reported:",
                "hadithEnglish": "When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) prostrated himself, if a lamb wanted to pass between his arms, it could pass.",
                "hadithUrdu": "جب رسول اللہﷺ سجدہ کرتے توبکری کا بچہ اگر آپ کے دونوں ہاتھوں کے درمیان سے گزرنا چاہتا توگزر سکتا تھا ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ اور ابن ابی عمر نے بیان کیا,سفیان بن عیینہ نے عبید اللہ بن عبد اللہ بن اصم سے ، انہوں نے اپنے چچا یزید بن اصم سے ، انہوں نے حضرت میمونہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَابْنُ أَبِي عُمَرَ، جَمِيعًا عَنْ سُفْيَانَ، قَالَ يَحْيَى: أَخْبَرَنَا، سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عُبَيْدِ اللهِ بْنِ عَبْدِ اللهِ بْنِ الْأَصَمِّ، عَنْ عَمِّهِ يَزِيدَ بْنِ الْأَصَمِّ، عَنْ مَيْمُونَةَ، قَالَتْ: «كَانَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِذَا سَجَدَ لَوْ شَاءَتْ بَهْمَةٌ أَنْ تَمُرَّ بَيْنَ يَدَيْهِ لَمَرَّتْ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8672,
                "hadithNumber": "1108",
                "englishNarrator": "Maimuna رضی اللہ عنہا , the wife of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), reported:",
                "hadithEnglish": "When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) prostrated himself, he spread his arms, i. e. he separated them so much that the whiteness of his armpits became visible from behind and when he sat (for Jalsa) he rested on his left thigh.",
                "hadithUrdu": "رسول اللہﷺ جب سجدہ کرتے تو اپنے ہاتھوں کے درمیان فاصلہ کرتے ، ان کا مطلب تھا انہیں پھیلا لیتے یہاں تک کہ پیچھے سے آپ کی بغلوں کی سفیدی دیکھی جا سکتی تھی اور جب بیٹھتے تو بائیں ران پر اطیمنان سے بیٹھتے ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم الحنظَلی نے بیان کیا,مروان بن معاویہ فزاری نے ہمیں خبر دی ، کہا : عبید اللہ بن عبد اللہ بن اصم نے یزید بن اصم سے حدیث بیان کی کہ نبی اکرمﷺ کی زوجہ حضرت میمونہ رضی اللہ عنہا نے انہیں خبر دی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ الْفَزَارِيُّ، قَالَ: حَدَّثَنَا عُبَيْدُ اللهِ بْنُ عَبْدِ اللهِ بْنِ الْأَصَمِّ، عَنْ يَزِيدَ بْنِ الْأَصَمِّ، أَنَّهُ أَخْبَرَهُ عَنْ مَيْمُونَةَ زَوْجِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَتْ: «كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِذَا سَجَدَ خَوَّى بِيَدَيْهِ - يَعْنِي جَنَّحَ - حَتَّى يُرَى وَضَحُ إِبْطَيْهِ مِنْ وَرَائِهِ. وَإِذَا قَعَدَ اطْمَأَنَّ عَلَى فَخِذِهِ الْيُسْرَى».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8673,
                "hadithNumber": "1109",
                "englishNarrator": "Maimuna daughter of Harith رضی اللہ عنہا reported:",
                "hadithEnglish": "When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) prostrated, he kept his hands so much apart from each other that when it was seen from behind the armpits became visible. Waki' said: That is their whiteness.",
                "hadithUrdu": "رسول اللہﷺ جب سجدہ کرتے تو ( دونوں ہاتھوں کو پہلوؤں سے ) دور رکھتے یہاں تک کہ جو آپ کے پیچھے ہوتا وہ آپ کی بغلوں کی سفیدی دیکھ سکتا تھا ۔ وکیع نے کہا : ( وضح سے ) مراد بغلوں کی سفیدی ہے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، عمرو نقید، زہیر بن حرب اور اسحاق بن ابراہیم نے بیان کیا اور ہم سے یہ قول عمرو نے بیان کیا: اور دوسروں نے کہا,وکیع نے کہا : ہمیں جعفر بن برقان نے یزید بن اصم سے حدیث سنائی ، انہوں نے حضرت میمونہ بنت حارث رضی اللہ عنہا سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ - وَاللَّفْظُ لِعَمْرٍو قَالَ إِسْحَاقُ: أَخْبَرَنَا، وَقَالَ الْآخَرُونَ: - حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا جَعْفَرُ بْنُ بُرْقَانَ، عَنْ يَزِيدَ بْنِ الْأَصَمِّ، عَنْ مَيْمُونَةَ بِنْتِ الْحَارِثِ، قَالَتْ: كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «إِذَا سَجَدَ جَافَى حَتَّى يَرَى مَنْ خَلْفَهُ وَضَحَ إِبْطَيْهِ» قَالَ وَكِيعٌ: يَعْنِي بَيَاضَهُمَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8674,
                "hadithNumber": "1110",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) used to begin prayer with takbir (saying Allahu Akbar) and the recitation: Praise be to Allah, the Lord of the Universe. When he bowed he neither kept his head up nor bent it down, but kept it between these extremes; when he raised his head after bowing he did not prostrate himself till he had stood erect; when he raised his head after prostration he did not prostrate himself again till he sat up. At the end of every two rak'ahs he recited the tahiyya; and he used to place his left foot flat (on the ground) and raise up the right; he prohibited the devil's way of sitting on the heels, and he forbade people to spread out their arms like a wild beast. And he used to finish the prayer with the taslim.",
                "hadithUrdu": "رسول اللہﷺ نماز کا آغاز تکبیر سے اور قراءت کا آغاز ﴿الحمد لله رب العالمين﴾ سے کرتے اور جب رکوع کرتے تو اپنا سر نہ پشت سے اونچا کرتے اور نہ اسے نیچے کرتے بلکہ درمیان میں رکھتے اور جب رکوع سے اپنا سر اٹھاتے تو سجدے میں نہ جاتے حتیٰ کہ سیدھے کھڑے ہو جاتے اور جب سجدہ سے اپنا سر اٹھاتے تو ( دوسرا ) سجدہ نہ کرتے حتیٰ کہ سیدھے بیٹھ جاتے ۔ اور ہر دو رکعتوں کے بعد التحیات پڑھتے اور اپنا بایاں پاؤں بچھا لیتے اور دایاں پاؤں کھڑا رکھتے اور شیطان کی طرح ( دونوں پنڈلیاں کھڑی کر کے ) پچھلے حصے پر بیٹھنے سے منع فرماتے اور اس سے بھی منع فرماتے اور اس سے بھی منع فرماتے کہ انسان اپنے بازو اس طرح بچھا دے جس طرح درندہ بچھاتا ہے ، اور نماز کا اختتام سلام سے کرتے ۔",
                "urduNarrator": "محمد بن عبد اللہ بن نمیر نے ہمیں حدیث بیان کی ، کہا : ہمیں ابو خالد احمر نے حسین معلم سے حدیث سنائی ، نیز اسحاق بن ابراہیم نے کہا : ( الفاظ انہی کے ہیں ) ، ہمیں عیسیٰ بن یونس نے خبر دی ، کہا : ہمیں حسین معلم نے حدیث بیان کی ، انہوں نے بدیل بن میسرہ سے ، انہوں نے ابو جوزاء سے اور انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبُو خَالِدٍ يَعْنِي الْأَحْمَرَ، عَنْ حُسَيْنٍ الْمُعَلِّمِ، ح قَالَ: وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ - وَاللَّفْظُ لَهُ - قَالَ: أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ، عَنْ بُدَيْلِ بْنِ مَيْسَرَةَ، عَنْ أَبِي الْجَوْزَاءِ، عَنْ عَائِشَةَ، قَالَتْ: كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «يَسْتَفْتِحُ الصَّلَاةَ بِالتَّكْبِيرِ. وَالْقِرَاءَةِ، بِ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ، وَكَانَ إِذَا رَكَعَ لَمْ يُشْخِصْ رَأْسَهُ، وَلَمْ يُصَوِّبْهُ وَلَكِنْ بَيْنَ ذَلِكَ، وَكَانَ إِذَا رَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ لَمْ يَسْجُدْ، حَتَّى يَسْتَوِيَ قَائِمًا، وَكَانَ إِذَا رَفَعَ رَأْسَهُ مِنَ السَّجْدَةِ، لَمْ يَسْجُدْ حَتَّى يَسْتَوِيَ جَالِسًا، وَكَانَ يَقُولُ فِي كُلِّ رَكْعَتَيْنِ التَّحِيَّةَ، وَكَانَ يَفْرِشُ رِجْلَهُ الْيُسْرَى وَيَنْصِبُ رِجْلَهُ الْيُمْنَى، وَكَانَ يَنْهَى عَنْ عُقْبَةِ الشَّيْطَانِ. وَيَنْهَى أَنْ يَفْتَرِشَ الرَّجُلُ ذِرَاعَيْهِ افْتِرَاشَ السَّبُعِ، وَكَانَ يَخْتِمُ الصَّلَاةَ بِالتَّسْلِيمِ» وَفِي رِوَايَةِ ابْنِ نُمَيْرٍ، عَنْ أَبِي خَالِدٍ، وَكَانَ يَنْهَى عَنْ عَقِبِ الشَّيْطَانِ.",
                "headingArabic": "مَا يَجْمَعُ صِفَةَ الصَّلاَةِ وَمَا يُفْتَتَحُ بِهِ وَيُخْتَمُ بِهِ وَصِفَةَ الرُّكُوعِ وَالاِعْتِدَالِ مِنْهُ وَالسُّجُودِ وَالاِعْتِدَالِ مِنْهُ وَالتَّشَهُّدِ بَعْدَ كُلِّ رَكْعَتَيْنِ مِنَ الرُّبَاعِيَّةِ وَصِفَةَ الْجُلُوسِ بَيْنَ السَّجْدَتَيْنِ وَفِي التَّشَهُّدِ الأَوَّلِ",
                "headingUrdu": "نماز کی تفصیل، جس چیز سے شروع ہوتی ہے اور ختم ہوتی ہے۔ اس میں رکوع اور اعتدال کی تفصیل اور اس میں سجدہ اور اعتدال کی تفصیل۔ تشہد چار رکعت نمازوں میں سے ہر دو رکعت کے بعد۔ تفصیل اول دو سجدوں کے درمیان اور پہلے تشہد میں بیٹھنا",
                "headingEnglish": "The Description Of The Prayer, With What It Begins And Ends. The Description Of Bowing And Moderation Therein, And Of Prostration And Moderation Therein. Tashah-hud After Each Two Rak'ah Of Four Rak'ah Prayers. Description Ol Sitting Between The Two Prostrations, And In The First Tashah-hud",
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8675,
                "hadithNumber": "1111",
                "englishNarrator": "Musa bin Talha ‌رضی ‌اللہ ‌عنہ reported it on the authority of his father:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: When one of you places in front of him so me. thing such as the back of a saddle, he should pray without caring who passes on the other side of it.",
                "hadithUrdu": "رسول اللہﷺ نے فرمایا : ’’جب تم میں سے کوئی اپنا سامنے پالان کی پچھلی لکڑی کے برابر کوئی چیز رکھ لے تو نماز پڑھتا رہے اور اس سے آگے سے گزرنے والے کی پروا نہ کرے ۔ ‘ ‘",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ، قتیبہ بن سعید اور ابوبکر بن ابی شیبہ نے بیان کیا - یحییٰ نے کہا: ہم سے انہوں نے بیان کیا اور باقی دو نے کہا, ابو احوص نے سماک ( بن حرب ) سے ، انہوں نے موسیٰ بن طلحہ سے اور انہوں نے اپنے والد حضرت طلحہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ - قَالَ يَحْيَى: أَخْبَرَنَا، وَقَالَ الْآخَرَانِ: - حَدَّثَنَا أَبُو الْأَحْوَصِ، عَنْ سِمَاكٍ، عَنْ مُوسَى بْنِ طَلْحَةَ، عَنْ أَبِيهِ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا وَضَعَ أَحَدُكُمْ بَيْنَ يَدَيْهِ مِثْلَ مُؤْخِرَةِ الرَّحْلِ فَلْيُصَلِّ، وَلَا يُبَالِ مَنْ مَرَّ وَرَاءَ ذَلِكَ».",
                "headingArabic": "سُتْرَةِ الْمُصَلِّي ‏والندب إلى الصلاة إلى سترة، والنهي عن المروربين يدي المصلي،‏واحكم والمرور،ودفع المار،وجوازالاعتراض بين يدي  المصلي،والصلاة إلى الراحلة، والأ مربالدنو من السترة، وبيان قدراسترة، ومايتعلق بذلك",
                "headingUrdu": "نماز پڑھنے والے کے لیے سترہ (اسکرین)، اور سترہ کی طرف منہ کر کے نماز پڑھنے کی سفارش۔ نماز پڑھنے والے کے سامنے سے گزرنے کا حکم اور سامنے سے گزرنے والے کو روکنے کا حکم۔ نماز پڑھنے والے کے سامنے لیٹنا، پہاڑ کی طرف نماز پڑھنا جائز ہے۔ سترہ کے قریب کھڑے ہونے کا حکم۔ سورہ کی اونچائی، اور متعلقہ معاملات",
                "headingEnglish": "The Sutrah (Screen) For One Who Is Praying, And The Recommendation To Pray Facing A Sutrah. The Ruling On Passing In Front Of One Who Is Praying, And Preventing One Who Wants To Pass In Front. It Is Permissible To Lie Down In Front Of One Who Is Praying, Praying Towards One's Mount. The Command To Stand Close To The Sutrah. The Height Of The Suirah, And Related Matters",
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8676,
                "hadithNumber": "1112",
                "englishNarrator": "Musa bin Talha reported on the authority of his father:",
                "hadithEnglish": "We used to say prayer and the animals moved in front of us. We mentioned it to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) and he said: If anything equal to the back of a saddle is in front of you, then what walks in front, no harm would come to him. Ibn Numair said: No harm would come whosoever walks in front.",
                "hadithUrdu": "ہم نماز پڑھ رہے ہوتے اور جاندار ہمارے سامنے گزرتے ہم نے اس کا تذکرہ رسول اللہﷺ سے کیا تو آپ نے فرمایا : ’’ تم میں سے کسی شخص کے آگے پالان کی پچھلی لکڑی کے برابر کوئی چیز ہو تو پھر جو چیز بھی اس کے سامنے سے گزرے گی اسے اس کا کوئی نقصان نہیں ۔ ‘ ‘ ابن نمیر نے ، پھر جو چیز بھی اس کے سامنے سے گزرے گی ، کے بجائے ’’ تو جو کوئی بھی اس کے سامنے سے گزرے گی اسے اس کا کوئی نقصان نہیں ، کے الفاظ بیان کیے ۔",
                "urduNarrator": "محمد بن عبد اللہ بن نمیر اور اسحاق بن ابراہیم نے حدیث بیان کی ، اسحاق نے کہا : ’’عمر بن عبید طنافسی نے ہمیں خبر دی ‘ ‘ اور ابن نمیر نے کہا : ’’ہمیں حدیث سنائی ‘ ‘ انہوں نے سماک سے ، انہوں نے موسیٰ بن طلحہ سے اور انہوں نے اپنے والد ( حضرت طلحہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، - قَالَ إِسْحَاقُ: أَخْبَرَنَا، وَقَالَ ابْنُ نُمَيْرٍ: - حَدَّثَنَا عُمَرُ بْنُ عُبَيْدٍ الطَّنَافِسِيُّ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ مُوسَى بْنِ طَلْحَةَ، عَنْ أَبِيهِ، قَالَ: كُنَّا نُصَلِّي وَالدَّوَابُّ تَمُرُّ بَيْنَ أَيْدِينَا فَذَكَرْنَا ذَلِكَ لِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «مِثْلُ مُؤْخِرَةِ الرَّحْلِ تَكُونُ بَيْنَ يَدَيْ أَحَدِكُمْ، ثُمَّ لَا يَضُرُّهُ مَا مَرَّ بَيْنَ يَدَيْهِ» وَقَالَ ابْنُ نُمَيْرٍ: فَلَا يَضُرُّهُ مَنْ مَرَّ بَيْنَ يَدَيْهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8677,
                "hadithNumber": "1113",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was asked about sutra of a worshipper; he said: Equal to the back of the saddle.",
                "hadithUrdu": "رسول اللہﷺ سے نمازی کے سترے کے بارے میں پوچھا گیا تو آپ نے فرمایا : ’’پالان کی پچھلی لکڑی کے مثل ہو ۔ ‘ ‘",
                "urduNarrator": "ہم سے زہیر بن حرب نے بیان کیا، کہا ہم سے عبداللہ بن یزید نے بیان کیا, سعید بن ابی ایوب نے ابو اسود سے ، انہوں نے عروہ سے اور انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ اللهِ بْنُ يَزِيدَ، أَخْبَرَنَا سَعِيدُ بْنُ أَبِي أَيُّوبَ، عَنْ أَبِي الْأَسْوَدِ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ: سُئِلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ سُتْرَةِ الْمُصَلِّي؟ فَقَالَ: «مِثْلُ مُؤْخِرَةِ الرَّحْلِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8678,
                "hadithNumber": "1114",
                "englishNarrator": "A'isha reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was asked in the expedition of Tabuk about the sutra the worshipper; he said: Like the back of the saddle.",
                "hadithUrdu": "رسول اللہﷺ سے غزوہ تبوک میں نمازی کے سترے کے بارے میں سوال کیا گیا تو آپ نے فرمایا : ’’پالان کی پچھلی لکڑی کے مانند ہو ۔ ‘ ‘",
                "urduNarrator": "ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا، کہا ہم سے عبداللہ بن یزید نے بیان کیا,حیوہ نے ابو اسود محمد بن عبد الرحمن سے ، انہوں نے عروہ سے اور انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، حَدَّثَنَا عَبْدُ اللهِ بْنُ يَزِيدَ، أَخْبَرَنَا حَيْوَةُ، عَنْ أَبِي الْأَسْوَدِ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ سُئِلَ فِي غَزْوَةِ تَبُوكَ عَنْ سُتْرَةِ الْمُصَلِّي؟ فَقَالَ: «كَمُؤْخِرَةِ الرَّحْلِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8679,
                "hadithNumber": "1115",
                "englishNarrator": "Ibn Umar رضی اللہ عنہما reported:",
                "hadithEnglish": "When the Messenger of Allah (ﷺ) went out on the 'Id day, he ordered to carry a spear-and it was fixed in front of him, and he said prayer towards its (direction), and the people were behind him. And he did it in the journey, and that is the reason why the Amirs carried it.",
                "hadithUrdu": "جب رسول اللہﷺ عید کے دن نکلتے تو نیزے کا حکم دیتے ، وہ آپ کے آگے گاڑ دیا جاتا ، آپ اس کی طرف رخ کر کے نماز پڑھتے اور لوگ آپ کے پیچھے ہوتے ، سفر میں بھی آپ ایسا ہی کرتے ، اس بنا پر حکام نے اس ( نیزہ گاڑنے ) کو اپنا لیا ہے ۔",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا,عبد اللہ بن نمیر نے عبید اللہ سے ، انہوں نے نافع سے اور انہوں نے حضرت ابن عمر رضی اللہ عنہما سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ اللهِ بْنُ نُمَيْرٍ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ وَاللَّفْظُ لَهُ، حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا خَرَجَ يَوْمَ الْعِيدِ، أَمَرَ بِالْحَرْبَةِ فَتُوضَعُ بَيْنَ يَدَيْهِ، فَيُصَلِّي إِلَيْهَا. وَالنَّاسُ وَرَاءَهُ. وَكَانَ يَفْعَلُ ذَلِكَ فِي السَّفَرِ. فَمِنْ ثَمَّ اتَّخَذَهَا الْأُمَرَاءُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8680,
                "hadithNumber": "1116",
                "englishNarrator": "Ibn Umar رضی اللہ عنہما reported:",
                "hadithEnglish": "The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) set up (sutra), and Abu Bakr said: He implanted iron-tipped spear and said prayer towards its direction. Ibn Abu Shaiba made this addition to it: Ubaidullah said that it was a spear.",
                "hadithUrdu": "نبی اکرمﷺ نیزہ گاڑتے اور اس کی طرف رخ کر کے نماز پڑھتے ۔ امام مسلم ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے استد ابن نمیر نے يركز اور ابو بکر بن ابی شیبہ نے يغزر کا لفظ استعمال کیا ( دونوں کے معنیٰ ہیں : آپ گاڑتے تھے ۔ ) اور ابن ابی شیبہ کی روایت میں یہ اضافہ ہے : عبید اللہ نے کہا : اس ( عنزة ) سے مراد حربة ( برچھی ) ہے ۔",
                "urduNarrator": "ابو بکر بن ابی شیبہ نے اور ابن نمیر نے کہا : ہمیں محمد بن بشر نے حدیث سنائی ، کہا : ہمیں عبید اللہ نے نافع سے حدیث سنائی اور انہوں نے حضرت ابن عمر رضی اللہ عنہما سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ نُمَيْرٍ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا عُبَيْدُ اللهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ: أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ يَرْكُزُ - وَقَالَ أَبُو بَكْرٍ: يَغْرِزُ - الْعَنَزَةَ وَيُصَلِّي إِلَيْهَا زَادَ ابْنُ أَبِي شَيْبَةَ: قَالَ عُبَيْدُ اللهِ: وَهِيَ الْحَرْبَةُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8681,
                "hadithNumber": "1117",
                "englishNarrator": "Ibn 'Umar ‌رضی ‌اللہ ‌عنہ said:",
                "hadithEnglish": "The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) used to place his camel (towards the Ka'ba) and said prayer in its direction.",
                "hadithUrdu": "نبی اکرمﷺ ( بوقت ضرورت ) اپنی سواری کو سامنے کر کے ( بٹھا لیتے اور ) اس کی طرف ( منہ کر کے ) نماز پڑھ لیتے",
                "urduNarrator": "ہم سے احمد بن حنبل نے بیان کیا، انہوں نے کہامعتمر بن سلیمان نے عبید اللہ سے ، انہوں نے نافع سے اور انہوں نے حضرت ابن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ، عَنْ عُبَيْدِ اللهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ: «أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ يَعْرِضُ رَاحِلَتَهُ وَهُوَ يُصَلِّي إِلَيْهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8682,
                "hadithNumber": "1118",
                "englishNarrator": "Ibn 'Umar رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to say prayer towards his camel. Ibn Numair said: The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said prayer towards the camel.",
                "hadithUrdu": "نبی اکرمﷺ ( کبھی کبھی ) اپنی سواری کو سامنے رکھتے ہوئے نماز پڑھ لیتے تھے ۔ اور ( محمد ) بن نمیر نے کہا : نبی اکرمﷺ نے اونٹ کو سامنے رکھتے ہوئے ( قبلہ رو ہو کر ) نماز پڑھی ۔",
                "urduNarrator": "ابو بکر بن ابی شیبہ اور ابن نمیر نے کہا : ہمیں ابو خالد احمر نے عبید اللہ سے ، انہوں نے نافع سے اور انہوں نے حضرت ابن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ نُمَيْرٍ، قَالَا: حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ، عَنْ عُبَيْدِ اللهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ: «أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي إِلَى رَاحِلَتِهِ» وَقَالَ ابْنُ نُمَيْرٍ: «إِنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ صَلَّى إِلَى بَعِيرٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8683,
                "hadithNumber": "1119",
                "englishNarrator": "Abu Juhaifa reported it on the authority of his father:",
                "hadithEnglish": "I came to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) in Mecca and he was (at that time) at al- Abtah in a red leather tent. And Bilal ‌رضی ‌اللہ ‌عنہ ‌stepped out with ablution water for him. (And what was left out of that water) some of them got it (whereas others could not get it) and (those who got it) rubbed themselves with it. Then the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) stepped out with a red mantle on him and I was catching a glimpse of the whiteness of his shanks. The narrator said: He (the Holy Prophet) performed the ablution. and Bilal ‌رضی ‌اللہ ‌عنہ ‌pronounced Adhan and I followed his mouth (as he turned) this side and that as he said on the right and the left: Come to prayer, come to success. ' A spear was then fixed for him (on the ground). He stepped forward and said two rak'ahs of Zuhr, while there passed in front of him a donkey and a dog, and these were not checked. He then said two rak'ahs of the 'Asr prayer, and he then continued saying two rak'ahs till he came back to Medina.",
                "hadithUrdu": "میں مکہ میں نبی اکرمﷺ کے پاس آیا ، آپ ابطح کے مقام پر چمڑے کے ایک سرخ خیمے میں ( قیام پذیر ) تھے ۔ ( ابو جحیفہ نے ) کہا : بلال ‌رضی ‌اللہ ‌عنہ ‌ ‌ آپ کے وضو کا پانی لے کر باہر آئے ( بعد ازاں جب آپ نے وضو کر لیا تو ) اس میں سے کسی کو پانی مل گیا اور کسی نے ( دوسرے سے اس کی ) نمی لے لی ۔ انہوں نے کہا : پھر نبی اکرمﷺ سرخ حلہ ( لباس کے اوپر لمبا چوغہ ) پہنے ہوئے نکلے ، ( ایسا لگتا ہے ) جیسے ( آج بھی ) میں آپ کی پنڈلیوں کی سفیدی کو دیکھ رہا ہوں ۔ آپ نے وضو کیا اور بلال ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے اذان کہی ، انہوں نے کہا : میں بھی ان کے منہ پیچھے اس طرح اور اس طرف رخ کرنے لگا ، ( جب ) وہ حي على الصلاة اور حي على الفلاح کہہ رہے تھے تو انہوں نے دائیں بائیں رخ کیا ، کہا : پھر آپ کے لیے نیزہ گاڑا گیا اور آپ نے آگے بڑھ کر ظہری کی دو رکعتیں ( قصر ) پڑھائیں ، آپ کے آگے سے گدھا اور کتا گزر تا تھا ، انہیں روکا نہ جاتا تھا ، پھر آپ نے عصر کی دو رکعتیں پڑھائیں اور پھر مدینہ واپسی تک مسلسل دو رکعتیں ہی پڑھاتے رہے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور زہیر بن حرب نے وکیع کی سند سے بیان کیا، انہوں نے کہا: ہم سے زہیر وکیع نے بیان کیا, سفیان نے بیان کیا : ہمیں عون بن ابی جحیفہ نے اپنے والد ( حضرت ابو جحیفہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) سے حدیث بیان کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، جَمِيعًا عَنْ وَكِيعٍ، قَالَ: زُهَيْرٌ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا عَوْنُ بْنُ أَبِي جُحَيْفَةَ، عَنْ أَبِيهِ، قَالَ: أَتَيْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمَكَّةَ وَهُوَ بِالْأَبْطَحِ فِي قُبَّةٍ لَهُ حَمْرَاءَ مِنْ أَدَمٍ، قَالَ: فَخَرَجَ بِلَالٌ بِوَضُوئِهِ، فَمِنْ نَائِلٍ وَنَاضِحٍ، قَالَ: «فَخَرَجَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَيْهِ حُلَّةٌ حَمْرَاءُ كَأَنِّي أَنْظُرُ إِلَى بَيَاضِ سَاقَيْهِ»، قَالَ: «فَتَوَضَّأَ» وَأَذَّنَ بِلَالٌ، قَالَ: فَجَعَلْتُ أَتَتَبَّعُ فَاهُ هَا هُنَا وَهَا هُنَا - يَقُولُ: يَمِينًا وَشِمَالًا - يَقُولُ: حَيَّ عَلَى الصَّلَاةِ حَيَّ عَلَى الْفَلَاحِ. قَالَ: «ثُمَّ رُكِزَتْ لَهُ عَنَزَةٌ، فَتَقَدَّمَ فَصَلَّى الظُّهْرَ رَكْعَتَيْنِ، يَمُرُّ بَيْنَ يَدَيْهِ الْحِمَارُ وَالْكَلْبُ، لَا يُمْنَعُ ثُمَّ صَلَّى الْعَصْرَ رَكْعَتَيْنِ، ثُمَّ لَمْ يَزَلْ يُصَلِّي رَكْعَتَيْنِ حَتَّى رَجَعَ إِلَى الْمَدِينَةِ» حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، جَمِيعًا عَنْ وَكِيعٍ، قَالَ: زُهَيْرٌ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا عَوْنُ بْنُ أَبِي جُحَيْفَةَ، عَنْ أَبِيهِ، قَالَ: أَتَيْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمَكَّةَ وَهُوَ بِالْأَبْطَحِ فِي قُبَّةٍ لَهُ حَمْرَاءَ مِنْ أَدَمٍ، قَالَ: فَخَرَجَ بِلَالٌ بِوَضُوئِهِ، فَمِنْ نَائِلٍ وَنَاضِحٍ، قَالَ: «فَخَرَجَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَيْهِ حُلَّةٌ حَمْرَاءُ كَأَنِّي أَنْظُرُ إِلَى بَيَاضِ سَاقَيْهِ»، قَالَ: «فَتَوَضَّأَ» وَأَذَّنَ بِلَالٌ، قَالَ: فَجَعَلْتُ أَتَتَبَّعُ فَاهُ هَا هُنَا وَهَا هُنَا - يَقُولُ: يَمِينًا وَشِمَالًا - يَقُولُ: حَيَّ عَلَى الصَّلَاةِ حَيَّ عَلَى الْفَلَاحِ. قَالَ: «ثُمَّ رُكِزَتْ لَهُ عَنَزَةٌ، فَتَقَدَّمَ فَصَلَّى الظُّهْرَ رَكْعَتَيْنِ، يَمُرُّ بَيْنَ يَدَيْهِ الْحِمَارُ وَالْكَلْبُ، لَا يُمْنَعُ ثُمَّ صَلَّى الْعَصْرَ رَكْعَتَيْنِ، ثُمَّ لَمْ يَزَلْ يُصَلِّي رَكْعَتَيْنِ حَتَّى رَجَعَ إِلَى الْمَدِينَةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8684,
                "hadithNumber": "1120",
                "englishNarrator": "Abu Juhaifa reported on the authority of his father:",
                "hadithEnglish": "I saw the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) (in Mecca at al-Abtah) in a red leather tent. and I saw Bilal take the ablution water (left by Allah's Messenger), and I saw the people racing, with one another to get that ablution water. If anyone got some of it, he rubbed himself with it, and anyone who did not get any got some of the moisture from his companion's hand. I then saw Bilal take a staff and fix it in the ground, after which the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came out quickly in a red mantle and led the people in two rak'ahs facing the staff, and I saw people and animals passing in front of the staff.",
                "hadithUrdu": "ان کے والد نے رسول اللہﷺ کو چمڑے کے سرخ خیمے میں دیکھا ( کہا : ) اور میں نے بلال ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو دیکھا وہ آپ کے وضو کا پانی باہر لے آئے تو میں نے دیکھا لوگ اس پانی کو لینے کے لیے ایک دوسرے سے سبقت لے جانے کی کوشش کر رہے ہیں ، جس کو اس سے کچھ پانی مل گیا اس نے اس کو بدن پر مل لیا اور جس کو اس سے نہ ملا تو اس نے اپنے ساتھ کے ہاتھ کی نمی سے نمی حاصل کر لی ، پھر میں نے بلال کو دیکھا انہوں نے ایک نیزہ نکالا اور کو گاڑ دیا ، رسول اللہﷺ سرخ حلہ پہنے ہوئے نکلے جو آپ نے پنڈلیوں تک اونچا کیا ہوا تھا ، آپ نے نیزے کی طرف رخ کر کے لوگوں کو دو رکعت نماز پڑھائی اور میں نے لوگوں اور چوپایوں کو نیزے کے سامنے سے گزرتے ہوئے دیکھا ۔",
                "urduNarrator": "مجھ سے محمد بن حاتم نے بیان کیا، انہوں نے ہم سے اس کے متعلق بیان کیا, عمر بن ابی زائدہ سے روایت ہے کہ مجھے عون بن ابی جحیفہ نے حدیث بیان کی کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا عُمَرُ بْنُ أَبِي زَائِدَةَ، حَدَّثَنَا عَوْنُ بْنُ أَبِي جُحَيْفَةَ، أَنَّ أَبَاهُ رَأَى رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي قُبَّةٍ حَمْرَاءَ مِنْ أَدَمٍ، وَرَأَيْتُ بِلَالًا أَخْرَجَ وَضُوءًا، فَرَأَيْتُ النَّاسَ يَبْتَدِرُونَ ذَلِكَ الْوَضُوءَ، فَمَنْ أَصَابَ مِنْهُ شَيْئًا تَمَسَّحَ بِهِ، وَمَنْ لَمْ يُصِبْ مِنْهُ أَخَذَ مِنْ بَلَلِ يَدِ صَاحِبِهِ، ثُمَّ رَأَيْتُ بِلَالًا أَخْرَجَ عَنَزَةً فَرَكَزَهَا «وَخَرَجَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي حُلَّةٍ حَمْرَاءَ مُشَمِّرًا فَصَلَّى إِلَى الْعَنَزَةِ بِالنَّاسِ رَكْعَتَيْنِ، وَرَأَيْتُ النَّاسَ وَالدَّوَابَّ يَمُرُّونَ بَيْنَ يَدَيِ الْعَنَزَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8685,
                "hadithNumber": "1121",
                "englishNarrator": "Aun bin Abu Juhaifa narrated from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) on the authority of his father a hadith like that of Sufyan, and 'Umar bin Abu Za'ida made this addition: Some of them tried to excel the others (in obtaining water), and in the hadith transmitted by Malik bin Mighwal (the words are):",
                "hadithEnglish": "When it was noon, Bilal came out and summoned (people) to (noon) prayer.",
                "hadithUrdu": "جب دوپہر کا وقت ہوا تو بلال نکلے اور نماز کے لیے اذان دی ۔",
                "urduNarrator": "مجھ سے اسحاق بن منصور اور عبد بن حمید نے بیان کیا، کہا کہ ہم سے جعفر بن عون نے بیان کیا,ابو عمیس نے اور مالک بن مغول دونوں نے اپنی اپنی سند سے عون بن ابی جحفہ سے ، انہوں نے اپنے والد سے اور انہوں نے نبی اکرمﷺ سے سفیان اور عمرو بن ابی زائدہ کی حدیث کی طرح بیان کیا ہے ۔ ان ( چاروں سفیان ، عمر ، ابو عمیس اور مالک ) میں بعض دوسروں سے زائد الفاظ بیان کرتے ہیں ۔ مالک بن مغول کی حدیث میں ہے",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَا: أَخْبَرَنَا جَعْفَرُ بْنُ عَوْنٍ، أَخْبَرَنَا أَبُو عُمَيْسٍ، ح قَالَ: وَحَدَّثَنِي الْقَاسِمُ بْنُ زَكَرِيَّا، حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ، عَنْ زَائِدَةَ، قَالَ: حَدَّثَنَا مَالِكُ بْنُ مِغْوَلٍ، كِلَاهُمَا عَنْ عَوْنِ بْنِ أَبِي جُحَيْفَةَ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِ حَدِيثِ سُفْيَانَ، وَعُمَرَ بْنِ أَبِي زَائِدَةَ يَزِيدُ بَعْضُهُمْ عَلَى بَعْضٍ. وَفِي حَدِيثِ مَالِكِ بْنِ مِغْوَلٍ فَلَمَّا كَانَ بِالْهَاجِرَةِ خَرَجَ بِلَالٌ فَنَادَى بِالصَّلَاةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8686,
                "hadithNumber": "1122",
                "englishNarrator": "Abu Juhaifa رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) went at noon towards al-Batha', he performed ablution, and said two rak'ahs of the Zuhr prayer and two of the 'Asr prayer, and there was a spear in front of him. Shu'ba said and Aun made this addition to it on the authority of his father Abu Juhaifa: And the woman and the donkey passed behind it.",
                "hadithUrdu": "سخت گرمی کے وقت رسول اللہﷺ بطحا کی طرف نکلے ، وضو کر کے اس عالم میں ظہر اور عصر کی دو دو رکعتیں پڑھیں اور آپ کے سامنے نیزہ تھا ۔ شعبہ نے کہا : عون نے اپنے والد ابو جحیفہ سے ( روایت کرتے ہوئے ) یہ اضافہ کیا کہ نیزے کی دوسری طرف سے عورتیں اور گدھے گزر رہے تھے ۔",
                "urduNarrator": "ہم سے محمد بن المثنی اور محمد بن بشار نے بیان کیا, محمد بن جعفر نے کہا : ہمیں شعبہ نے حکم سے حدیث سنائی ، انہوں نے کہا : میں نے حضرت ابو جحیفہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنا ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالَ ابْنُ الْمُثَنَّى: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، قَالَ: سَمِعْتُ أَبَا جُحَيْفَةَ، قَالَ: «خَرَجَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِالْهَاجِرَةِ إِلَى الْبَطْحَاءِ فَتَوَضَّأَ فَصَلَّى الظُّهْرَ رَكْعَتَيْنِ، وَالْعَصْرَ رَكْعَتَيْنِ وَبَيْنَ يَدَيْهِ عَنَزَةٌ» قَالَ شُعْبَةُ: وَزَادَ فِيهِ عَوْنٌ، عَنْ أَبِيهِ أَبِي جُحَيْفَةَ: وَكَانَ يَمُرُّ مِنْ وَرَائِهَا الْمَرْأَةُ وَالْحِمَارُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8687,
                "hadithNumber": "1123",
                "englishNarrator": "Shu'ba narrated the same on the basis of two authorities and in the hadith transmitted by Hakam (the words are):",
                "hadithEnglish": "The people began to get water that was left out of his (the Prophet's) ablution.",
                "hadithUrdu": "تو لوگ آپ کے وضو کے بچے ہوئے پانی میں سے ( پانی ) لینے لگے ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب اور محمد بن حاتم نے بیان کیا، کہا, ( عبد الرحمان ) بن مہدی نے ہمیں حدیث بیان کی ، ( کہا : ) شعبہ نے ہمیں ( حکم اور عون کی ) دونوں سندوں کے ساتھ سابقہ حدیث کی مانند حدیث بیان کی اور انہوں نے ( ابن مہدی ) نے حکم کی حدیث میں یہ اضافہ کیا",
                "hadithArabic": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ حَاتِمٍ، قَالَا: حَدَّثَنَا ابْنُ مَهْدِيٍّ، حَدَّثَنَا شُعْبَةُ، بِالْإِسْنَادَيْنِ جَمِيعًا مِثْلَهُ وَزَادَ فِي حَدِيثِ الْحَكَمِ فَجَعَلَ النَّاسُ يَأْخُذُونَ مِنْ فَضْلِ وَضُوئِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8688,
                "hadithNumber": "1124",
                "englishNarrator": "Ibn 'Abbas رضی اللہ عنہما reported:",
                "hadithEnglish": "I came riding on a she-ass, and I was on the threshold of maturity, and the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was leading people in prayer at Mina. I passed in front of the row and got down, and sent the she-ass for grazing and joined the row, and nobody made any objection to it.",
                "hadithUrdu": "میں گدھی پر سوار ہو کر آیا ، ان دنوں میں بلوغت کے قریب تھا ، رسول اللہﷺ منیٰ میں لوگوں کو نماز پڑھا رہے تھے ، میں صف کے سامنے سے گزرا اور اتر کر گدھی کو چرنے کے لیے چھوڑ دیا اور صف میں داخل ہو گیا تو مجھے کسی نے اس پر نہیں ٹوکا ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا,مالک نے ابن شاب سے ، انہوں نے عبید اللہ بن عبد اللہ سے اور انہوں نے حضرت ابن عباس رضی اللہ عنہما سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللهِ بْنِ عَبْدِ اللهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ: أَقْبَلْتُ رَاكِبًا عَلَى أَتَانٍ وَأَنَا يَوْمَئِذٍ قَدْ نَاهَزْتُ الِاحْتِلَامَ وَرَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «يُصَلِّي بِالنَّاسِ بِمِنًى» فَمَرَرْتُ بَيْنَ يَدَيِ الصَّفِّ، فَنَزَلْتُ فَأَرْسَلْتُ الْأَتَانَ تَرْتَعُ وَدَخَلْتُ فِي الصَّفِّ، فَلَمْ يُنْكِرْ ذَلِكَ عَلَيَّ أَحَدٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 8376,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=335",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=333",
                "label": "333",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=334",
                "label": "334",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=335",
                "label": "335",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=336",
                "label": "336",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=337",
                "label": "337",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=338",
                "label": "338",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=339",
                "label": "339",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=337",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=337",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=335",
        "to": 8400,
        "total": 40465
    }
}