{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 358,
        "data": [
            {
                "id": 9214,
                "hadithNumber": "1650",
                "englishNarrator": "Ibn Buhaina رضی اللہ عنہ reported:",
                "hadithEnglish": "The dawn prayer had commenced when the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saw a person observing prayer, whereas the Mu'adhdhin had pronounced the Iqama. Upon this he (the Holy Prophet) remarked: Do you say four (rak'ahs) of Fard in the dawn prayer?",
                "hadithUrdu": "صبح کی نماز کی اقامت ( شروع ) ہوئی تو رسول اللہ صلی اللہ علیہ وسلم نے ایک شخص کو نماز پڑھتے دیکھا جبکہ موذن اقامت کہہ رہا ہے تو آپ نے فرمایا : \" کیا تم صبح کی چار رکعتیں پڑھو گے؟ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, ابو عوانہ نے سعد بن ابراہیم سے ، انہوں نے حفص بن عاصم سے ، اورانہوں نے حضرت ( عبداللہ ) ابن بحینہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ عَنْ حَفْصِ بْنِ عَاصِمٍ عَنْ ابْنِ بُحَيْنَةَ قَالَ أُقِيمَتْ صَلَاةُ الصُّبْحِ فَرَأَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا يُصَلِّي وَالْمُؤَذِّنُ يُقِيمُ فَقَالَ أَتُصَلِّي الصُّبْحَ أَرْبَعًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9215,
                "hadithNumber": "1651",
                "englishNarrator": "Abdullah bin Sarjis reported:",
                "hadithEnglish": "A person entered the mosque, while the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was leading the dawn prayer. He observed two rak'ahs in a corner of the mosque, and then joined the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) in prayer. When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had pronounced salutations (he had concluded the prayer), he said: O, so and so, which one out of these two prayers did you count (as your Fard prayer), the one that you observed alone or the prayer that you observed with us?",
                "hadithUrdu": "ایک آدمی مسجد میں آیا جبکہ رسول اللہ صلی اللہ علیہ وسلم صبح کی نماز پڑھا رہے تھے ، اس نے مسجد کے ایک کونے میں دو رکعتیں پڑھیں ، پھر رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نماز میں شریک ہوگیا ، جب ر سول اللہ صلی اللہ علیہ وسلم نے سلام پھیرا تو فرمایا : \" اے فلاں! تو نے دو نمازوں میں سے کون سی نماز کو شمار کیا ہے؟اپنی اس نماز کو جو تم نے اکیلے پڑھی ہے یا اس کو جو ہمارے ساتھ پڑھی ہے؟ \"",
                "urduNarrator": "ہم سے ابو کامل الجحْدری نے بیان کیا، ہم سے مریم نے بیان کیا، ابو معاویہ نے، ان سب نے عاصم اور زہیر بن حرب کے بارے میں بیان کیا اور ان کے حافظ مروان بن معاویہ حضرت عبداللہ بن سرجس ( المزنی حلیف بنی مخزوم رضی اللہ عنہ ) سے روایت ہے ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ ح و حَدَّثَنِي حَامِدُ بْنُ عُمَرَ الْبَكْرَاوِيُّ حَدَّثَنَا عَبْدُ الْوَاحِدِ يَعْنِي ابْنَ زِيَادٍ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ كُلُّهُمْ عَنْ عَاصِمٍ ح و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ وَاللَّفْظُ لَهُ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ الْفَزَارِيُّ عَنْ عَاصِمٍ الْأَحْوَلِ عَنْ عَبْدِ اللَّهِ بْنِ سَرْجِسَ قَالَ دَخَلَ رَجُلٌ الْمَسْجِدَ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي صَلَاةِ الْغَدَاةِ فَصَلَّى رَكْعَتَيْنِ فِي جَانِبِ الْمَسْجِدِ ثُمَّ دَخَلَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا سَلَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَا فُلَانُ بِأَيِّ الصَّلَاتَيْنِ اعْتَدَدْتَ أَبِصَلَاتِكَ وَحْدَكَ أَمْ بِصَلَاتِكَ مَعَنَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9216,
                "hadithNumber": "1652",
                "englishNarrator": "Abu Usaid رضی اللہ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: When any one of you enters the mosque, he should say: O Allah! open for me the doors of Thy mercy ; and when he steps out he should say: 'O Allah! I beg of Thee Thy Grace. (Imam Muslim said: I heard Yahya saying: I transcribed this hadith from the compilation of Sulaiman bin Bilal.)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا \"\" جب تم میں سے کوئی شخص مسجد میں داخل ہوتو کہے \"\" اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ \"\" اے اللہ! میرے لئے اپنی رحمت کے دروازے کھول دے ۔ اور جب مسجد سے نکلے تو کہے \"\" اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ \"\" اے اللہ! میں تجھ سے تیرے فضل کا سوال کرتاہوں ۔ \"\" امام مسلم ؒ نے کہا : میں نے یحییٰ بن یحییٰ س سنا ، وہ کہتے تھے ، میں نے یہ حدیث سلیمان بن بلال کی کتاب سے لکھی ہے ، انھوں نے کہا : مجھے یہ خبر پہنچی ہے ۔ کہ یحییٰ حمانی شک کے بغیر ) \"\" وأبي أسيداور ابو اسید \"\" سے کہتے تھے ۔",
                "urduNarrator": "یحییٰ بن یحییٰ نے کہا : ہمیں سلمان بن بلال نے ربعیہ بن عبدالرحمان سے خبر دی ، انھوں نے عبدالملک بن سعید سے ، اور انھوں نے حضرت ابو حمید رضی اللہ عنہ  یا حضرت ابو اسید رضی اللہ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا سُلَيْمَانُ بْنُ بِلَالٍ عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ الْمَلِكِ بْنِ سَعِيدٍ عَنْ أَبِي حُمَيْدٍ أَوْ عَنْ أَبِي أُسَيْدٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَخَلَ أَحَدُكُمْ الْمَسْجِدَ فَلْيَقُلْ اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ وَإِذَا خَرَجَ فَلْيَقُلْ اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ قَالَ مُسْلِم سَمِعْتُ يَحْيَى بْنَ يَحْيَى يَقُولُ كَتَبْتُ هَذَا الْحَدِيثَ مِنْ كِتَابِ سُلَيْمَانَ بْنِ بِلَالٍ قَالَ بَلَغَنِي أَنَّ يَحْيَى الْحِمَّانِيَّ يَقُولُ وَأَبِي أُسَيْدٍِ.",
                "headingArabic": "مَا يَقُولُ إِذَا دَخَلَ الْمَسْجِدَ ‏‏",
                "headingUrdu": "مسجد میں داخل ہوتے وقت کیا کہنا چاہیے؟",
                "headingEnglish": "What to say when entering the masjid",
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9217,
                "hadithNumber": "1653",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been narrated from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) by Abu Usaid رضی اللہ عنہ .",
                "hadithUrdu": "ہم سے حمید بن عمر البکراوی نے بیان کیا، ہم سے بشر بن المفضل نے بیان کیا، عمارہ بن غزیہ نے ربیعہ بن ابی عبدالرحمان سے روایت کی ، انھوں نے عبدالملک بن سعید بن سوید انصاری سے ۔ انھوں نے حضرت ابو حمید ۔ ۔ ۔ یا حضرت ابو اسید رضی اللہ عنہ سے اور ا نھوں نے نبی کریم صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا حَامِدُ بْنُ عُمَرَ الْبَكْرَاوِيُّ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ حَدَّثَنَا عُمَارَةُ بْنُ غَزِيَّةَ عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ الْمَلِكِ بْنِ سَعِيدِ بْنِ سُوَيْدٍ الْأَنْصَارِيِّ عَنْ أَبِي حُمَيْدٍ أَوْ عَنْ أَبِي أُسَيْدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِه.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9218,
                "hadithNumber": "1654",
                "englishNarrator": "Abu Qatada رضی اللہ عنہ (a Companion of the Prophet) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When any one of you enters the mosque, he should observe two rak'ahs (of Nafl prayer) before sitting.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم میں سے کوئی شخص مسجد میں داخل ہوتو بیٹھنے سے پہلے دو رکعت نماز پڑھے ۔ \"",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ بن قعنب اور قتیبہ بن سعید نے بیان کیا، کہا کہ ہم سے مالک نے بیان کیا اور ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا: میں نے مالک رضی اللہ عنہ کو پڑھا, عامر بن عبداللہ بن زبیر نے عمرو بن سلیم زرقی سے اور انھوں نے حضرت ابو قتادہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ وَقُتَيْبَةُ بْنُ سَعِيدٍ قَالَا حَدَّثَنَا مَالِكٌ ح و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ عَمْرِو بْنِ سُلَيْمٍ الزُّرَقِيِّ عَنْ أَبِي قَتَادَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا دَخَلَ أَحَدُكُمْ الْمَسْجِدَ فَلْيَرْكَعْ رَكْعَتَيْنِ قَبْلَ أَنْ يَجْلِسَ.",
                "headingArabic": "اسْتِحْبَابِ تَحِيَّةِ الْمَسْجِدِ بِرَكْعَتَيْنِ وَكَرَاهَةِ الْجُلُوسِ قَبْلَ صَلاَتِهِمَا وَأَنَّهَا مَشْرُوعَةٌ فِي جَمِيعِ الأَوْقَاتِ",
                "headingUrdu": "دو رکعت نماز پڑھ کر مسجد میں سلام پھیرنا مستحب ہے اور ان دو رکعتوں سے پہلے بیٹھنا مکروہ ہے اور یہ ہر وقت مشروع ہے۔",
                "headingEnglish": "It is recommended to greet the masjid by praying two rak`ah, and it is disliked to sit before praying these two rak`ah, and this is prescribed at all times",
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9219,
                "hadithNumber": "1655",
                "englishNarrator": "Abu Qatada رضی اللہ عنہ :",
                "hadithEnglish": "A Companion of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), said: I entered the mosque, when the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had been sitting among people, and I also sat down among them. Upon this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: What prevented you from offering two rak'ahs (of Nafl prayer) before sitting down? I said: Messenger of Allah, I saw you sitting and people sitting (around you and I, therefore, sat in your company). He (the Holy Prophet) then said: When anyone among you enters the mosque, he should not sit till he has observed two rak'ahs.",
                "hadithUrdu": "میں مسجد میں داخل ہوا جبکہ رسول اللہ صلی اللہ علیہ وسلم لوگوں کے درمیان تشریف فرما تھے کہا : تو میں بھی بیٹھ گیا ، اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تمھیں بیٹھنے سے پہلے دو رکعات نماز پڑھنے سے کس چیز نے روکا ہے؟ \" میں نے عرض کی : اےا للہ کے رسول صلی اللہ علیہ وسلم !میں نے آپ کو بیٹھتے دیکھا ہے اور لوگ بھی بیٹھے تھے ( اس لئے میں بھی بیٹھ گیا ) آپ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم میں سے کوئی شخص مسجد میں آئے تو دو رکعت نماز پڑھےبغير نہ بیٹھے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے حسین بن علی نے بیان کیا، انہوں نے زیدہ رضی اللہ عنہ سے، کہا کہ مجھ سے عمرو بن یحییٰ انصاری نے بیان کیا، مجھ سے بیان کیا,محمد بن یحییٰ بن حبان نے عمرو بن سلیم بن خلدہ انصاری سے اور انھوں نے رسول اللہ صلی اللہ علیہ وسلم کے صحابی حضرت ابو قتادہ رضی اللہ عنہ سے ر وایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ عَنْ زَائِدَةَ قَالَ حَدَّثَنِي عَمْرُو بْنُ يَحْيَى الْأَنْصَارِيُّ حَدَّثَنِي مُحَمَّدُ بْنُ يَحْيَى بْنِ حَبَّانَ عَنْ عَمْرِو بْنِ سُلَيْمِ بْنِ خَلْدَةَ الْأَنْصَارِيِّ عَنْ أَبِي قَتَادَةَ صَاحِبِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ دَخَلْتُ الْمَسْجِدَ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَالِسٌ بَيْنَ ظَهْرَانَيْ النَّاسِ قَالَ فَجَلَسْتُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مَنَعَكَ أَنْ تَرْكَعَ رَكْعَتَيْنِ قَبْلَ أَنْ تَجْلِسَ قَالَ فَقُلْتُ يَا رَسُولَ اللَّهِ رَأَيْتُكَ جَالِسًا وَالنَّاسُ جُلُوسٌ قَالَ فَإِذَا دَخَلَ أَحَدُكُمْ الْمَسْجِدَ فَلَا يَجْلِسْ حَتَّى يَرْكَعَ رَكْعَتَيْنِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9220,
                "hadithNumber": "1656",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ  عنہ reported:",
                "hadithEnglish": "The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) owed me a debt; he paid me back and made an addition (of this). I entered the mosque and he (the Holy Prophet) said to me: Observe two rak'ahs of prayer.",
                "hadithUrdu": "میرا نبی اکرم صلی اللہ علیہ وسلم کے ذمے قرض تھا ، آپ نے اسے ادا کیا اور مجھے زائد رقم دی اور جب میں آپ کی مسجد میں داخل ہوا تو آپ صلی اللہ علیہ وسلم نے مجھ سے فرمایا : \" دو رکعت نماز ادا کرلو ۔ \"",
                "urduNarrator": "ہم سے احمد بن جواس الحنفی ابو عاصم نے بیان کیا، کہا کہ ہم سے عبید اللہ اشجعی نے بیان کیا, سفیان بن محارب بن وثار سے اور انھوں نے حضرت جابر بن عبداللہ رضی اللہ  عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ جَوَّاسٍ الْحَنَفِيُّ أَبُو عَاصِمٍ حَدَّثَنَا عُبَيْدُ اللَّهِ الْأَشْجَعِيُّ عَنْ سُفْيَانَ عَنْ مُحَارِبِ بْنِ دِثَارٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ كَانَ لِي عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَيْنٌ فَقَضَانِي وَزَادَنِي وَدَخَلْتُ عَلَيْهِ الْمَسْجِدَ فَقَالَ لِي صَلِّ رَكْعَتَيْنِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9221,
                "hadithNumber": "1657",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) bought a camel from me. When he came back to Medina, he ordered me to come to the mosque and observed two rak'ahs of prayer.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے ایک اونٹ خریدا ، جب آپ صلی اللہ علیہ وسلم مدینہ پہنچے تو آپ صلی اللہ علیہ وسلم نے مجھے حکم دیا کہ میں مسجد میں آؤں ، اور دو رکعتیں پڑھوں ۔",
                "urduNarrator": "ہم سے عبید اللہ بن معاذ نے بیان کیا، کہا ہم سے میرے والد نے بیان کیا، انہوں نے کہا,شعبہ نے محارب سے روایت کی ، انھوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے سنا ، کہہ رہے تھے کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ مُحَارِبٍ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ اشْتَرَى مِنِّي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعِيرًا فَلَمَّا قَدِمَ الْمَدِينَةَ أَمَرَنِي أَنْ آتِيَ الْمَسْجِدَ فَأُصَلِّي رَكْعَتَيْنِ.",
                "headingArabic": "اسْتِحْبَابِ الرَّكْعَتَيْنِ فِي الْمَسْجِدِ لِمَنْ قَدِمَ مِنْ سَفَرٍ أَوَّلَ قُدُومِهِ ‏‏",
                "headingUrdu": "سفر سے آنے والے کے لیے مسجد میں دو رکعت نماز پڑھنا مستحب ہے جب وہ پہلی بار پہنچے۔",
                "headingEnglish": "It is recommended to pray two rak`ah in the masjid for one who has come from a journey, when he first arrives",
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9222,
                "hadithNumber": "1658",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "I went with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) on an expedition and my camel delayed me and I was exhausted. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) thus came earlier than I, whereas I came on the next day and went to the mosque and found him (the Holy Prophet) at the gate of the mosque. He said: It is now that you have come. I said. Yes. He said: Leave your camel and enter (the mosque) and observe two rak'ahs. He (the narrator) said: So I entered and observed (two rak'ahs) of prayer and then went back.",
                "hadithUrdu": "میں ایک غزوے میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نکلا ، میرے اونٹ نے مجھے دیر کرادی اور تھک گیا ۔ رسول اللہ صلی اللہ علیہ وسلم مجھ سے پہلے مدینہ میں آگئے اور میں اگلے دن پہنچا ، میں مسجد میں آیا تو میں نے آپ صلی اللہ علیہ وسلم کو مسجد کے دروازے پر پایا ۔ آپ صلی اللہ علیہ وسلم نے پوچھا : \" تم اب اس وقت تک پہنچے ہو؟ \" میں نے کہا : جی ہاں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" اپنا اونٹ چھوڑ دو اور مسجد میں داخل ہوکر دو رکعتیں پڑھو ۔ \" میں مسجد میں داخل ہوا ، نماز پڑھی ، پر واپس ( آپ صلی اللہ علیہ وسلم کے پاس ) آیا ۔",
                "urduNarrator": "اور ہم سے محمد بن المثنیٰ نے بیان کیا، کہا کہ ہم سے عبدالوہاب یعنی ثقفی نے بیان کیا، کہا ہم سے عبید اللہ نے بیان کیا,وہب بن کیسان نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْوَهَّابِ يَعْنِي الثَّقَفِيَّ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ وَهْبِ بْنِ كَيْسَانَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ خَرَجْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزَاةٍ فَأَبْطَأَ بِي جَمَلِي وَأَعْيَا ثُمَّ قَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَبْلِي وَقَدِمْتُ بِالْغَدَاةِ فَجِئْتُ الْمَسْجِدَ فَوَجَدْتُهُ عَلَى بَابِ الْمَسْجِدِ قَالَ الْآنَ حِينَ قَدِمْتَ قُلْتُ نَعَمْ قَالَ فَدَعْ جَمَلَكَ وَادْخُلْ فَصَلِّ رَكْعَتَيْنِ قَالَ فَدَخَلْتُ فَصَلَّيْتُ ثُمَّ رَجَعْتُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9223,
                "hadithNumber": "1659",
                "englishNarrator": "Ka'b bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) did not come back from the journey but by day in the forenoon, and when he arrived, he went first to the mosque, and having prayed two rak'ahs in it he sat down in it.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم دن میں چاشت کے وقت کے سوا ( کسی اور وقت ) سفر سے واپس تشریف نہ لاتے ، پھر جب تشریف لاتے تو مسجد جاتے ، اس میں دو رکعتیں ادا کرتے ، پھر ( کچھ دیر ) وہیں تشریف رکھتے ( تاکہ گھر والوں کو آپ صلی اللہ علیہ وسلم کی آمد کا علم ہوجائے ) ۔",
                "urduNarrator": "ہم سے محمد بن المثنیٰ نے بیان کیا، کہا ہم سے الضحاک نے بیان کیا، کہا ہم سے ابو عاصم نے بیان کیا، اور کہا کہ ہم سے محمود بن غیلان نے بیان کیا، کہا کہ ہم سے عبد الرزاق نے بیان کیا، کہا کہ ہم سے ابن جریج نے بیان کیا کہ مجھ سے ابن شہاب نے بیان کیا کہ عبدالرحمٰن بن عبداللہ بن کعب نے ان سے اپنے والد عبداللہ بن کعب اور اپنے چچا عبید اللہ بن کعب کی روایت سے اس کے بارے میں بتایا, حضرت کعب بن مالک رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا الضَّحَّاكُ يَعْنِي أَبَا عَاصِمٍ ح و حَدَّثَنِي مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَا جَمِيعًا أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي ابْنُ شِهَابٍ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَبْدِ اللَّهِ بْنِ كَعْبٍ أَخْبَرَهُ عَنْ أَبِيهِ عَبْدِ اللَّهِ بْنِ كَعْبٍ وَعَنْ عَمِّهِ عُبَيْدِ اللَّهِ بْنِ كَعْبٍ عَنْ كَعْبِ بْنِ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ لَا يَقْدَمُ مِنْ سَفَرٍ إِلَّا نَهَارًا فِي الضُّحَى فَإِذَا قَدِمَ بَدَأَ بِالْمَسْجِدِ فَصَلَّى فِيهِ رَكْعَتَيْنِ ثُمَّ جَلَسَ فِيهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9224,
                "hadithNumber": "1660",
                "englishNarrator": "Abdullah bin Shaqiq reported:",
                "hadithEnglish": "I asked 'A'isha رضی اللہ عنہا whether the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) used to observe the forenoon prayer. She said: No, but when he came back from the journey.",
                "hadithUrdu": "میں نے حضرت عائشہ رضی اللہ عنہا سے پوچھا : کیا نبی اکرم صلی اللہ علیہ وسلم چاشت کی نماز پڑھتے تھے؟انھوں نے کہا : نہیں ، الا یہ کہ باہر ( سفر ) سے واپس آئے ہوں ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا ہم سے یزید بن زرعی نے بیان کیا، انہوں نے سعید الجریری کی سند سے، انہوں نے عبداللہ بن شقیق کی سند سے، انہوں نے کہاسعید جریری نے عبداللہ بن شقیق سے روایت کی ، انھوں نےکہا",
                "hadithArabic": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا يَزِيدُ بْنُ زُرَيْعٍ عَنْ سَعِيدٍ الْجُرَيْرِيِّ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ قَالَ قُلْتُ لِعَائِشَةَ هَلْ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي الضُّحَى قَالَتْ لَا إِلَّا أَنْ يَجِيءَ مِنْ مَغِيبِهِ.",
                "headingArabic": "اسْتِحْبَابِ صَلاَةِ الضُّحَى وَأَنَّ أَقَلَّهَا رَكْعَتَانِ وَأَكْمَلَهَا ثَمَانِ رَكَعَاتٍ وَأَوْسَطَهَا أَرْبَعُ رَكَعَاتٍ أَوْ سِتٌّ وَالْحَثِّ عَلَى الْمُحَافَظَةِ عَلَيْهَا",
                "headingUrdu": "دوحہ پڑھنا مستحب ہے، جس میں سے کم از کم دو رکعت ہے، جس میں سے بہترین آٹھ ہے، اور جس کی اوسط چار یا چھ ہے، اور اسے باقاعدگی سے پڑھنے کی ترغیب دی گئی ہے۔",
                "headingEnglish": "It is recommended to pray Duha, the least of which is two rak`ah, the best of which is eight, and the average of which is four or six, and encouragement to do so regularly",
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9225,
                "hadithNumber": "1661",
                "englishNarrator": "Abdullah bin Shaqiq reported:",
                "hadithEnglish": "I aksed 'A'isha رضی اللہ عنہا whether the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) used to observe the forenoon prayer. She said: No, except when he came back from a journey.",
                "hadithUrdu": "میں نے حضرت عائشہ رضی اللہ عنہا سے پوچھا : کیانبی اکرم صلی اللہ علیہ وسلم چاشت کی نماز پڑھا کرتے تھے؟ انھوں نے جواب دیا : نہیں الا یہ کہ سفر سے واپس آئے ہوں ۔",
                "urduNarrator": "ہم سے عبید اللہ بن معاذ نے بیان کیا، ہم سے میرے والد نے بیان کیا,کمس بن حسن قیسی نے عبداللہ بن شقیق سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا كَهْمَسُ بْنُ الْحَسَنِ الْقَيْسِيُّ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ قَالَ قُلْتُ لِعَائِشَةَ أَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي الضُّحَى قَالَتْ لَا إِلَّا أَنْ يَجِيءَ مِنْ مَغِيبِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9226,
                "hadithNumber": "1662",
                "englishNarrator": "Urwa reported 'A'isha رضی اللہ عنہا to be saying:",
                "hadithEnglish": "I have never seen the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) observing the supererogatory prayer of the forenoon, but I observed it. And if the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) abandoned any act which he in fact loved to do, it was out of fear that if the people practised it constantly, it might become obligatory for them.",
                "hadithUrdu": "میں نے کبھی ر سول اللہ صلی اللہ علیہ وسلم کو ( گھر میں قیام کے دوران میں ) چاشت کے نفل پڑھتے نہیں دیکھا ، جبکہ میں چاشت کی نماز پڑھتی ہوں ۔ یہ بات یقینی ہے کہ رسول اللہ صلی اللہ علیہ وسلم کسی کام کو کرنا پسند فرماتے تھے ۔ لیکن اس ڈر سے کہ لوگ ( بھی آپ کو دیکھ کر ) وہ کام کریں گےاور ( ان کی د لچسپی کی بناء پر ) وہ کام ان پر فرض کردیا جائے گا ، آپ صلی اللہ علیہ وسلم اس کام کو چھوڑ دیتے تھے ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے مالک رضی اللہ عنہ سے، ابن شہاب سے، عروہ رضی اللہ عنہ سے، انہوں نے کہاحضرت عائشہ رضی اللہ عنہا سے روایت ہے ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّهَا قَالَتْ مَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي سُبْحَةَ الضُّحَى قَطُّ وَإِنِّي لَأُسَبِّحُهَا وَإِنْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيَدَعُ الْعَمَلَ وَهُوَ يُحِبُّ أَنْ يَعْمَلَ بِهِ خَشْيَةَ أَنْ يَعْمَلَ بِهِ النَّاسُ فَيُفْرَضَ عَلَيْهِمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9227,
                "hadithNumber": "1663",
                "englishNarrator": "Mu'adha asked 'A'isha ( رضی اللہ عنہا ):",
                "hadithEnglish": "How many rak'ahs Allah's Messenger ( ﷺ) prayed at the forenoon prayer. She replied: Four rak'ahs, but sometimes more as he pleased.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم چاشت کی نماز کتنی ( رکعتیں ) پڑھتے تھے؟انھوں نے جواب دیا چار رکعتیں اور جس قدر زیادہ پڑھنا چاہتے ( پڑھ لیتے ) ۔",
                "urduNarrator": "ہم سے شیبان بن فرخ نے بیان کیا,عبدالوارث نے کہا : ہمیں یزید رشک نے حدیث سنائی ، انھوں نے کہا ، مجھے معاذہ نے حدیث سنائی ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے سوال کیا کہ",
                "hadithArabic": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا عَبْدُ الْوَارِثِ حَدَّثَنَا يَزِيدُ يَعْنِي الرِّشْكَ حَدَّثَتْنِي مُعَاذَةُ أَنَّهَا سَأَلَتْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا كَمْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي صَلَاةَ الضُّحَى قَالَتْ أَرْبَعَ رَكَعَاتٍ وَيَزِيدُ مَا شَاءَُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9228,
                "hadithNumber": "1664",
                "englishNarrator": "A similar report (as no. 1663) was narrated from Yazid with this chain:",
                "hadithEnglish": "And Yazid said: As Allah pleased.",
                "hadithUrdu": "اور  یزید نے ( ماشاء کے بجائے ) ماشاء اللہ ( جتنی اللہ چاہتا ) کہا ۔",
                "urduNarrator": "ہم سے محمد بن المثنیٰ اور ابن بشار نے بیان کیا، کہا: ہم سے محمد بن جعفر نے بیان کیا، ہم سےشعبہ نے یزید سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ يَزِيدَ بِهَذَا الْإِسْنَادِ مِثْلَهُ وَقَالَ يَزِيدُ مَا شَاءَ اللَّه.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9229,
                "hadithNumber": "1665",
                "englishNarrator": "Mua'ada 'Adawiyya reported 'A'isha رضی اللہ عنہا as saying:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) used to observe four rak'ahs in the forenoon prayer and he sometimes observed more as Allah pleased.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم چاشت کی نماز چار رکعتیں پڑھتے تھے ۔ اور اللہ تعالیٰ جس قدر چاہتا زیادہ ( بھی ) پڑھ لیتے ۔",
                "urduNarrator": "مجھ سے یحییٰ بن حبیب الحارث نے بیان کیا، ہم سے خالد بن حارث نے بیان کیا, سعید نے کہا : قتادہ نے ہمیں حدیث بیان کی کہ معاذہ عدویہ نے ان ( حدیث سننے والوں ) کو حضرت عائشہ رضی اللہ عنہا سے حدیث سنائی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنِي يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ عَنْ سَعِيدٍ حَدَّثَنَا قَتَادَةُ أَنَّ مُعَاذَةَ الْعَدَوِيَّةَ حَدَّثَتْهُمْ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي الضُّحَى أَرْبَعًا وَيَزِيدُ مَا شَاءَ اللَّهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9230,
                "hadithNumber": "1666",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been narrated by Qatada with the same chain of transmitters.",
                "hadithUrdu": "ہم سب سے اسحاق بن ابراہیم اور ابن بشار نے معاذ بن ہشام نے روایت کی ، کہا : مجھے میرے والد نے قتادہ سے اسی سند کےساتھ یہی حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَابْنُ بَشَّارٍ جَمِيعًا عَنْ مُعَاذِ بْنِ هِشَامٍ قَالَ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9231,
                "hadithNumber": "1667",
                "englishNarrator": "Abdul-Rahman bin Abu Laila reported:",
                "hadithEnglish": "No one has ever narrated to me that he saw the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) observing the forenoon prayer, except Umm Hani  رضی اللہ عنہا . She, however, narrated that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) entered her house on the day of the Conquest of Mecca and prayed eight rak'ahs (adding): I never saw a shorter prayer than it except that he performed the bowing and prostration completely. But (one of the narrators) Ibn Bashshar in his narration made no mention of the word: Never .",
                "hadithUrdu": "مجھے ام ہانی رضی اللہ عنہا کے سوا کسی نے یہ نہیں بتایا کہ اس نے نبی اکرم صلی اللہ علیہ وسلم کو چاشت کی نماز پڑھتے دیکھا ۔ انھوں نے بتایا کہ فتح مکہ کے دن نبی اکرم صلی اللہ علیہ وسلم ان کے گھر میں تشریف لائے اور آپ نے آٹھ رکعتیں پڑھیں ، میں نے آپ کو کبھی اس سے ہلکی نمازپڑھتے نہیں دیکھا ، ہاں آپ رکوع اور سجود مکمل طریقے سے کررہے تھے ۔ ابن بشار نے اپنی روایات میں قط ( کبھی ) کا لفظ بیان نہیں کیا ۔",
                "urduNarrator": "محمد بن مثنیٰ اور ابن بشار نے ہمیں حدیث بیان کی ، کہا : ہمیں محمد بن جعفر نے حدیث سنائی ، کہا : ہمیں شعبہ نے عمرو بن مرہ سے انھوں نے عبدالرحمان بن ابی لیلیٰ سے حدیث سنائی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى قَالَ مَا أَخْبَرَنِي أَحَدٌ أَنَّهُ رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي الضُّحَى إِلَّا أُمُّ هَانِئٍ فَإِنَّهَا حَدَّثَتْ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ بَيْتَهَا يَوْمَ فَتْحِ مَكَّةَ فَصَلَّى ثَمَانِي رَكَعَاتٍ مَا رَأَيْتُهُ صَلَّى صَلَاةً قَطُّ أَخَفَّ مِنْهَا غَيْرَ أَنَّهُ كَانَ يُتِمُّ الرُّكُوعَ وَالسُّجُودَ وَلَمْ يَذْكُرْ ابْنُ بَشَّارٍ فِي حَدِيثِهِ قَوْلَهُ قَطُّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9232,
                "hadithNumber": "1668",
                "englishNarrator": "Abdullah bin Harith bin Naufal reported:",
                "hadithEnglish": "I had been asking about, as I was desirous to find one among people who should inform me, whether the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) observed the forenoon prayer, but I found none to narrate that to me except Umm Hani, daughter of Abu Talib رضی اللہ عنہا (the real sister of Hadrat 'Ali), who told me that on the day of the Conquest the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came (to our house) after the dawn had (sufficiently) arisen. A cloth was brought and privacy was provided for him (the Holy Prophet). He took a bath and then stood up and observed eight rak'ahs. I do not know whether his Qiyam (standing posture) was longer, or bending or prostration or all of them were of equal duration. She (Umm Hani) further said: I never saw him saying this Nafl prayer prior to it or subsequently. (Al-Muradi narrated on the authority of Yunus that he made no mention of the words: He informed me. )",
                "hadithUrdu": "میں نے ( سب سے ) پوچھا اور میری یہ شدید خواہش تھی کہ مجھے کوئی ایک شخص مل جائے جو مجھے بتائے کہ رسول اللہ صلی اللہ علیہ وسلم نے چاشت کی نماز پڑھی ہے ۔ مجھے ام ہانی بنت ابی طالب رضی اللہ عنہا کے سوا کوئی نہ ملا جو مجھے یہ بتاتا ۔ انھوں نے مجھے خبر دی کہ فتح مکہ کے دن رسول اللہ صلی اللہ علیہ وسلم دن بلند ہونے کے بعد تشریف لائے ، ایک کپڑا لا کر آپ کو پردہ مہیا کیاگیا ، آپ نے غسل فرمایا ، پھر آپ کھڑ اہوئے اور آٹھ رکعتیں پڑھیں ۔ میں نہیں جانتی کہ ان میں آپ کا قیام ( نسبتاً ) زیادہ لمبا تھا یا آپ کا رکوع یا آپ کا سجود یہ سب ( ارکان ) قریب قریب تھے اور انھوں نے ( ام ہانی رضی اللہ تعالیٰ عنہا ) نے بتایا ، میں نے ا س سے پہلے اور اس کے بعد آپ کو نہیں دیکھا کہ آپ نے یہ نماز پڑھی ہو ۔ ( محمد بن مسلمہ ) مرادی نے اپنی روایت میں \"\" یونس سے روایت ہے \"\" کہا ۔ \"\" مجھے یونس نے خبر دی \"\" نہیں کہا ۔",
                "urduNarrator": "حرملہ بن یحیٰٰ اور محمد بن سلمہ مرادی دونوں نے مجھے حدیث بیان کی ، کہا : ہمیں عبداللہ بن وہب نے خبر دی ، انھوں نے کہا : مجھے یونس نے ابن شہاب سے خبر دی ، کہا : مجھے عبداللہ بن حارث کے بیٹے نے حدیث سنائی کہ ان کے والد عبداللہ بن حارث بن نوفل نے کہا",
                "hadithArabic": "و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى وَمُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِيُّ قَالَا أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ قَالَ حَدَّثَنِي ابْنُ عَبْدِ اللَّهِ بْنِ الْحَارِثِ أَنَّ أَبَاهُ عَبْدَ اللَّهِ بْنَ الْحَارِثِ بْنِ نَوْفَلٍ قَالَ سَأَلْتُ وَحَرَصْتُ عَلَى أَنْ أَجِدَ أَحَدًا مِنْ النَّاسِ يُخْبِرُنِي أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَبَّحَ سُبْحَةَ الضُّحَى فَلَمْ أَجِدْ أَحَدًا يُحَدِّثُنِي ذَلِكَ غَيْرَ أَنَّ أُمَّ هَانِئٍ بِنْتَ أَبِي طَالِبٍ أَخْبَرَتْنِي أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَى بَعْدَ مَا ارْتَفَعَ النَّهَارُ يَوْمَ الْفَتْحِ فَأُتِيَ بِثَوْبٍ فَسُتِرَ عَلَيْهِ فَاغْتَسَلَ ثُمَّ قَامَ فَرَكَعَ ثَمَانِيَ رَكَعَاتٍ لَا أَدْرِي أَقِيَامُهُ فِيهَا أَطْوَلُ أَمْ رُكُوعُهُ أَمْ سُجُودُهُ كُلُّ ذَلِكَ مِنْهُ مُتَقَارِبٌ قَالَتْ فَلَمْ أَرَهُ سَبَّحَهَا قَبْلُ وَلَا بَعْدُ قَالَ الْمُرَادِيُّ عَنْ يُونُسَ وَلَمْ يَقُلْ أَخْبَرَنِي.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9233,
                "hadithNumber": "1669",
                "englishNarrator": "Abu Murra, the freed slave of Umm Hani رضی اللہ عنہا , daughter of Abu Talib, reported Umm Hani رضی اللہ عنہا to be saying:",
                "hadithEnglish": "I went to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) on the day of the Conquest of Mecca and found him taking a bath, and Fatimah رضی اللہ عنہا , his daughter, had provided him privacy with the help of a cloth. I gave him salutation and he said: Who is she? I said: It is Umm Hani, daughter of Abu Talib. He (the Holy Prophet) said: Greeting for Umm Hani. When he had completed the bath, he stood up and observed eight rak'ahs wrapped up in one cloth. When he turned back (after the prayer), I said to him: Messenger of Allah, the son of my mother 'Ali bin Abu Talib رضی اللہ عنہ is going to kill a person, Fulan bin Hubaira whom I have given protection. Upon this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: We too have given protection whom you have given protection, O Umm Hani. Umm Hani said: It was the forenoon (prayer).",
                "hadithUrdu": "میں فتح مکہ کے سال رسول اللہ صلی اللہ علیہ وسلم کی طرف گئی تو میں نے آپ صلی اللہ علیہ وسلم کو نہاتے ہوئے پایا جبکہ آپ کی بیٹی فاطمہ رضی اللہ عنہا آپ کو کپڑے سےچھپائے ہوئے تھیں ( آگے پردہ کیا ہوا تھا ) میں نے سلام عرض کیا ، آپ صلی اللہ علیہ وسلم نے پوچھا یہ کون ہے؟میں نے کہا : ام ہانی بنت ابی طالب ہوں ۔ آپ نے فرمایا : \" ام ہانی کو خوش آمدید! \" جب آپ نہانے سے فارغ ہوئے تو کھڑے ہوئے اور صرف ایک کپڑے میں لپٹے ہوئے آٹھ رکعتیں پڑھیں ، جب آپ نماز سے فارغ ہوگئے تو میں نے کہا : اے اللہ کے رسول صلی اللہ علیہ وسلم میرا ماں جایا بھائی علی بن ابی طالب رضی اللہ عنہ چاہتا ہے کہ ایک ایسے آدمی کو قتل کردے جسے میں نے پناہ دے چکی ہوں ۔ یعنی ہبیرہ کا بیٹا ، فلاں ، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : امی ہانی! جس کو تم نے پناہ دی اسے ہم نے بھی پناہ دی ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے مالک رضی اللہ عنہ سے اس کے متعلق پڑھا,ابو نضر سے روایت ہے کہ ام ہانی بنت ابی طالب رضی اللہ عنہا کو یہ کہتے ہوئے سنا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ أَبِي النَّضْرِ أَنَّ أَبَا مُرَّةَ مَوْلَى أُمِّ هَانِئٍ بِنْتِ أَبِي طَالِبٍ أَخْبَرَهُ أَنَّهُ سَمِعَ أُمَّ هَانِئٍ بِنْتَ أَبِي طَالِبٍ تَقُولُ ذَهَبْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ الْفَتْحِ فَوَجَدْتُهُ يَغْتَسِلُ وَفَاطِمَةُ ابْنَتُهُ تَسْتُرُهُ بِثَوْبٍ قَالَتْ فَسَلَّمْتُ فَقَالَ مَنْ هَذِهِ قُلْتُ أُمُّ هَانِئٍ بِنْتُ أَبِي طَالِبٍ قَالَ مَرْحَبًا بِأُمِّ هَانِئٍ فَلَمَّا فَرَغَ مِنْ غُسْلِهِ قَامَ فَصَلَّى ثَمَانِيَ رَكَعَاتٍ مُلْتَحِفًا فِي ثَوْبٍ وَاحِدٍ فَلَمَّا انْصَرَفَ قُلْتُ يَا رَسُولَ اللَّهِ زَعَمَ ابْنُ أُمِّي عَلِيُّ بْنُ أَبِي طَالِبٍ أَنَّهُ قَاتِلٌ رَجُلًا أَجَرْتُهُ فُلَانُ ابْنُ هُبَيْرَةَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ أَجَرْنَا مَنْ أَجَرْتِ يَا أُمَّ هَانِئٍ قَالَتْ أُمُّ هَانِئٍ وَذَلِكَ ضُحًى.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9234,
                "hadithNumber": "1670",
                "englishNarrator": "",
                "hadithEnglish": "Abu Murra narrated on the authority of Umm Hani that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) on the day of the Conquest of Mecca observed in her house eight rak'ahs of prayer in one cloth, its opposite corners having been tied from the opposite sides.",
                "hadithUrdu": "جعفر بن محمد ؒ کے والد محمد باقرؒ نے عقیل کے آزاد کردہ غلام ابو مرہ سے اور انھوں نے حضرت ام ہانی رضی اللہ تعالیٰ عنہا سے روایت کی کہ فتح مکہ کے سال رسول اللہ صلی اللہ علیہ وسلم نے ان کے گھر میں ایک کپڑے میں جس کے دونوں کنارے ایک دوسرے کی مخالف جانب ڈالے گئے تھے ، آٹھ رکعتیں پڑھیں ۔",
                "urduNarrator": "",
                "hadithArabic": "و حَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ حَدَّثَنَا وُهَيْبُ بْنُ خَالِدٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ أَبِي مُرَّةَ مَوْلَى عَقِيلٍ عَنْ أُمِّ هَانِئٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى فِي بَيْتِهَا عَامَ الْفَتْحِ ثَمَانِيَ رَكَعَاتٍ فِي ثَوْبٍ وَاحِدٍ قَدْ خَالَفَ بَيْنَ طَرَفَيْهِ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9235,
                "hadithNumber": "1671",
                "englishNarrator": "Abu Dharr رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: In the morning charity is due from every bone in the body of every one of you. Every utterance of Allah's glorification is an act of charity. Every utterance of praise of Him is an act of charity, every utterance of profession of His Oneness is an act of charity, every utterance of profession of His Greatness is an act of charity, enjoining good is an act of charity, forbidding what is distreputable is an act of charity, and two rak'ahs which one prays in the forenoon will suffice.",
                "hadithUrdu": "آپ نے فرمایا : \" صبح کو تم میں سے ہر ایک شخص کے ہر جوڑ پر ایک صدقہ ہوتا ہے ۔ پس ہر ایک تسبیح ( ایک دفعہ \" سبحا ن الله \" کہنا ) صدقہ ہے ۔ ہر ایک تمحید ( الحمد لله کہنا ) ) صدقہ ہے ، ہر ایک تہلیل ( لااله الا الله کہنا ) صدقہ ہے ہرہر ایک تکبیر ( الله اكبرکہنا ) بھی صدقہ ہے ۔ ( کسی کو ) نیکی کی تلقین کرنا صدقہ ہے اور ( کسی کو ) برائی سے روکنا بھی صدقہ ہے ۔ اور ان تمام امور کی جگہ دو رکعتیں جو انسان چاشت کے وقت پڑھتا ہے کفایت کرتی ہیں ۔ \"",
                "urduNarrator": "ہم سے عبداللہ بن محمد بن اسماء الضّعبی نے بیان کیا، کہا کہ ہم سے مہدی نے جو ابن میمون ہیں، انہوں نے کہا کہ ہم سے ابی عیینہ کے مؤکل واصل نے بیان کیا، انہوں نے یحییٰ بن عقیل کی سند سے بیان کیا۔ یحییٰ بن یمار، ابو الاسود الدولی کی سند پر، حضرت ابو زر رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ الضُّبَعِيُّ حَدَّثَنَا مَهْدِيٌّ وَهُوَ ابْنُ مَيْمُونٍ حَدَّثَنَا وَاصِلٌ مَوْلَى أَبِي عُيَيْنَةَ عَنْ يَحْيَى بْنِ عُقَيْلٍ عَنْ يَحْيَى بْنِ يَعْمَرَ عَنْ أَبِي الْأَسْوَدِ الدُّؤَلِيِّ عَنْ أَبِي ذَرٍّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ يُصْبِحُ عَلَى كُلِّ سُلَامَى مِنْ أَحَدِكُمْ صَدَقَةٌ فَكُلُّ تَسْبِيحَةٍ صَدَقَةٌ وَكُلُّ تَحْمِيدَةٍ صَدَقَةٌ وَكُلُّ تَهْلِيلَةٍ صَدَقَةٌ وَكُلُّ تَكْبِيرَةٍ صَدَقَةٌ وَأَمْرٌ بِالْمَعْرُوفِ صَدَقَةٌ وَنَهْيٌ عَنْ الْمُنْكَرِ صَدَقَةٌ وَيُجْزِئُ مِنْ ذَلِكَ رَكْعَتَانِ يَرْكَعُهُمَا مِنْ الضُّحَى.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9236,
                "hadithNumber": "1672",
                "englishNarrator": "Abu Huraira رضی اللہ  عنہ reported:",
                "hadithEnglish": "My friend (the Holy Prophet ﷺ) has instructed me to do three things: three fasts during every month, two rak'ahs of the forenoon prayer, and observing Witr prayer before going to bed.",
                "hadithUrdu": "مجھے میر ےخلیل صلی اللہ علیہ وسلم نے تین چیزوں کی تلقین فرمائی ، ہر ماہ تین روزے رکھنے کی ، چاشت کی دورکعتوں کی اور اس بات کی کہ سونے سے پہلے وتر پڑھ لیا کروں ۔",
                "urduNarrator": "ہم سے شیبان بن فرخ نے بیان کیا، ہم سے عبد الوارث نے بیان کیا، ہم سے بیان کیا, ابو تیاح نے کہا : ہمیں ابو عثمان نہدی نے حضرت ابو ہریرہ  رضی اللہ  عنہ سے حدیث سنائی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا عَبْدُ الْوَارِثِ حَدَّثَنَا أَبُو التَّيَّاحِ حَدَّثَنِي أَبُو عُثْمَانَ النَّهْدِيُّ عَنْ أَبِي هُرَيْرَةَ قَالَ أَوْصَانِي خَلِيلِي صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِثَلَاثٍ بِصِيَامِ ثَلَاثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ وَرَكْعَتَيْ الضُّحَى وَأَنْ أُوتِرَ قَبْلَ أَنْ أَرْقُدََ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9237,
                "hadithNumber": "1673",
                "englishNarrator": null,
                "hadithEnglish": "A similar (as no. 1672) was narrated from Abu Hurairah رضی اللہ عنہ , from the prophet ﷺ.",
                "hadithUrdu": "ہم سے محمد بن المثنیٰ اور ابن بشار نے بیان کیا، کہا: ہم سے محمد بن جعفر نے بیان کیا، ہم سے شعبہ نے بیان کیا، ان سےعباس ، جریری ، اور ابو شمرضبعی ، دونوں نے کہا : ہم نے ابو عثمان نہدی سے سنا ، وہ حضرت ابوہریرہ رضی اللہ عنہ سے حدیث بیان کررہے تھے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے اسی سابقہ حدیث کی مانند حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ عَبَّاسٍ الْجُرَيْرِيِّ وَأَبِي شِمْرٍ الضُّبَعِيِّ قَالَا سَمِعْنَا أَبَا عُثْمَانَ النَّهْدِيَّ يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9238,
                "hadithNumber": "1674",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "My friend Abu'l-Qasim ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) instructed me to do three things, and the rest of the hadith is the same.",
                "hadithUrdu": "مجھے میرے خلیل ابو القاسم صلی اللہ علیہ وسلم نے تین باتوں کی تلقین فرمائی ۔ ۔ ۔ آگے حضرت ابو ہریرہ رضی اللہ عنہ سے ابو عثمان نہدی کی حدیث کی طرح بیان کیا ۔",
                "urduNarrator": "مجھ سے سلیمان بن معبد نے بیان کیا، ہم سے معالی بن اسد نے بیان کیا، ہم سے عبدالعزیز بن مختار نے بیان کیا، ان سے عبداللہ الداناج نے بیان کیا، انہوں نے کہا کہ مجھ سے بیان کرو, ابو رافع الصائغ نے کہا : میں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنِي سُلَيْمَانُ بْنُ مَعْبَدٍ حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُخْتَارٍ عَنْ عَبْدِ اللَّهِ الدَّانَاجِ قَالَ حَدَّثَنِي أَبُو رَافِعٍ الصَّائِغُ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ قَالَ أَوْصَانِي خَلِيلِي أَبُو الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِثَلَاثٍ فَذَكَرَ مِثْلَ حَدِيثِ أَبِي عُثْمَانَ عَنْ أَبِي هُرَيْرَة.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 8926,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=357",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=355",
                "label": "355",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=356",
                "label": "356",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=357",
                "label": "357",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=358",
                "label": "358",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=359",
                "label": "359",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=360",
                "label": "360",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=361",
                "label": "361",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=359",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=359",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=357",
        "to": 8950,
        "total": 40465
    }
}