{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 510,
        "data": [
            {
                "id": 13014,
                "hadithNumber": "5451",
                "englishNarrator": null,
                "hadithEnglish": "Sufyan narrated it with this chain of narrators (a similar hadith as no. 5450) and added: \"And I let her (keep it ).",
                "hadithUrdu": "مجھ سے محمد بن المثنیٰ نے بیان کیا, عبد الرحمن نے کہا : ہمیں سفیان نے اسی سند کے ساتھ حدیث بیان کی اور اور یہ اضا فہ کیا : تو میں اسے ( اس کے حال پر ) چھوڑ دیتا ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنِيهِ مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الرَّحْمَنِ حَدَّثَنَا سُفْيَانُ بِهَذَا الْإِسْنَادِ وَزَادَ فَأَدَعُهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13015,
                "hadithNumber": "5452",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: There should be a bedding for a man. a bedding for his wife and the third one for the guest, and the fourth one is for the Satan.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ان سے فرما یا : \" ایک بستر مرد کے لیے ہے ایک اس کی بیوی کے لیے تیسرا بستر مہمان کے لیے اور چوتھا بستر شیطان کے لیے ہے ۔",
                "urduNarrator": "مجھ سے ابو الطاہر احمد بن عمرو بن سرح نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، کہا کہ مجھ سے ابو ہانی نے بیان کیا کہ انہوں نے ابو عبدالرحمٰن رضی اللہ عنہ کو یہ کہتے سنا, حضرت جابر بن عبد اللہ رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ أَخْبَرَنَا ابْنُ وَهْبٍ حَدَّثَنِي أَبُو هَانِئٍ أَنَّهُ سَمِعَ أَبَا عَبْدِ الرَّحْمَنِ يَقُولُ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهُ فِرَاشٌ لِلرَّجُلِ وَفِرَاشٌ لِامْرَأَتِهِ وَالثَّالِثُ لِلضَّيْفِ وَالرَّابِعُ لِلشَّيْطَانِ.",
                "headingArabic": "كَرَاهَةِ مَا زَادَ عَلَى الْحَاجَةِ مِنَ الْفِرَاشِ وَاللِّبَاسِ ‏‏",
                "headingUrdu": "ایک ضرورت سے زیادہ فرنیچر اور بستر رکھنا ناپسندیدہ ہے۔",
                "headingEnglish": "It Is Disliked To Have More Furniture And Bedding Than One Needs",
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13016,
                "hadithNumber": "5453",
                "englishNarrator": "Ibn 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) having said: Allah will not look upon him who trails his garment out of pride.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" جو شخص تکبر سے کپڑا گھسیٹ کرچلے اللہ تعا لیٰ اس کی طرف نظر تک نہیں کرے گا ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا: امام مالک نے نافع عبد اللہ بن دینا اور زید بن اسلم سے روایت کی ، ان سب نے انھیں حضرت ابن عمر رضی اللہ عنہ سے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ وَعَبْدِ اللَّهِ بْنِ دِينَارٍ وَزَيْدِ بْنِ أَسْلَمَ كُلُّهُمْ يُخْبِرُهُ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَنْظُرُ اللَّهُ إِلَى مَنْ جَرَّ ثَوْبَهُ خُيَلَاءَ.",
                "headingArabic": "تَحْرِيمِ جَرِّ الثَّوْبِ خُيَلاَءَ وَبَيَانِ حَدِّ مَا يَجُوزُ إِرْخَاؤُهُ إِلَيْهِ وَمَا يُسْتَحَبّ",
                "headingUrdu": "لباس تکبر سے گھسیٹنے کی ممانعت اور کس حد تک لٹکانا جائز ہے اور کس حد تک مستحب ہے",
                "headingEnglish": "The Prohibition Of Letting One's Garment Drag Out Of Pride, And The Extent To Which It Is Permissible To Let It Hang Down And The Extent To Which It Is Recommended",
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13017,
                "hadithNumber": "5454",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Ibn 'Umar رضی اللہ عنہ through other chains of transmitters also with the addition of these words: On the Day of Resurrection.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے عبداللہ بن نمیر اور ابو اسامہ نے بیان کیا، ہم سے ابن نمیر نے بیان کیا، ہم سے میرے والد نے بیان کیا اور ہم سے محمد بن نے بیان کیا۔ المثنیٰ اور عبید اللہ بن سعید نے کہا: ہم سے یحییٰ نے جو القطان ہیں، بیان کیا، ان سب نے عبید اللہ کی سند سے، اور ہم سے ابو الربیع اور ابو کامل نے بیان کیا، کہا:ہم سے حماد نے بیان کیا، کہا ہم سے زہیر بن حرب نے بیان کیا، کہا ہم سے اسماعیل نے بیان کیا، ان دونوں نے ایوب کی سند سے اور ہم سے قتیبہ اور ابن روم نے لیث بن سعد کی سند سے بیان کیا۔ اور ہم سے ہارون العیلی نے بیان کیا، کہا کہ ہم سے ابن وہب نے بیان کیا، کہا کہ مجھ سے اسامہ نے بیان کیا، مجھ سے ان سب لوگوں نے بیان کیا، نافع کی سند سے، ابن عمر رضی اللہ عنہما سے، انہوں نے نبی کریم صلی اللہ علیہ وسلم سے بیان کیا۔ جیسا کہ مالک کی حدیث ہے،\" قیامت کے دن ( نظر نہیں کرے گا ۔ ) \"",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ وَأَبُو أُسَامَةَ و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي  و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَعُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَا حَدَّثَنَا يَحْيَى وَهُوَ الْقَطَّانُ كُلُّهُمْ عَنْ عُبَيْدِ اللَّهِ ح و حَدَّثَنَا أَبُو الرَّبِيعِ وَأَبُو كَامِلٍ قَالَا حَدَّثَنَا حَمَّادٌ ح و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا إِسْمَعِيلُ كِلَاهُمَا عَنْ أَيُّوبَ ح و حَدَّثَنَا قُتَيْبَةُ وَابْنُ رُمْحٍ عَنْ اللَّيْثِ بْنِ سَعْدٍ ح و حَدَّثَنَا هَارُونُ الْأَيْلِيُّ حَدَّثَنَا ابْنُ وَهْبٍ حَدَّثَنِي أُسَامَةُ كُلُّ هَؤُلَاءِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ مَالِكٍ وَزَادُوا فِيهِ يَوْمَ الْقِيَامَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13018,
                "hadithNumber": "5455",
                "englishNarrator": "Ibn 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) having said: He who trails his (lower) garment out of pride, Allah will not look toward him on the Day of Resurrection.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" جو شخص تکبر سے کپڑا گھسیٹ کر چلتا ہے قیامت کے دن اللہ تعا لیٰ اس کی طرف نظر نہیں فرما ئے گا ۔ \"",
                "urduNarrator": "مجھ سے ابو الطاہر نے بیان کیا، ہم سے عبداللہ بن وہب نے بیان کیا,عمربن محمد نے اپنے والد سالم بن عبد اللہ اور نافع سے روایت کی ، انھوں نے نے حضرت عبد اللہ بن عمر رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنِي أَبُو الطَّاهِرِ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي عُمَرُ بْنُ مُحَمَّدٍ عَنْ أَبِيهِ وَسَالِمِ بْنِ عَبْدِ اللَّهِ وَنَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الَّذِي يَجُرُّ ثِيَابَةُ مِنْ الْخُيَلَاءِ لَا يَنْظُرُ اللَّهُ إِلَيْهِ يَوْمَ الْقِيَامَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13019,
                "hadithNumber": "5456",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Ibn 'Umar رضی اللہ عنہ through another chain of transmitters.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے علی بن مشر نے بیان کیا، ان سے الشیبانی نے بیان کیا، ہم سے ابن المثنیٰ نے بیان کیا، ہم سے محمد بن جعفر نے بیان کیا، دونوں کی تقسیم ,محارب بن دثاراور جبلہ بن سحیم نے ابن عمر رضی اللہ عنہ سے ، انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے ان سب کی حدیث کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ الشَّيْبَانِيِّ  و حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ كِلَاهُمَا عَنْ مُحَارِبِ بْنِ دِثَارٍ وَجَبَلَةَ بْنِ سُحَيْمٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِهِمْ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13020,
                "hadithNumber": "5457",
                "englishNarrator": "Ibn 'Umar رضی اللہ عنہ reported",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) having said: He who trailed his garment out of pride, Allah would not look toward him on the Day of Resurrection.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" جس شخص نے تکبر سے کپڑا گھسیٹا اللہ تعا لیٰ قیامت کے دن اس کی طرف نظر تک نہیں فرما ئے گا ۔ \"",
                "urduNarrator": "عبد اللہ بن نمیر نے کہا , ہمیں حنظلہ نے حدیث بیان کی ، کہا : میں نے سالم سے انھوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی : کہا",
                "hadithArabic": "و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا حَنْظَلَةُ قَالَ سَمِعْتُ سَالِمًا عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ جَرَّ ثَوْبَهُ مِنْ الْخُيَلَاءِ لَمْ يَنْظُرْ اللَّهُ إِلَيْهِ يَوْمَ الْقِيَامَةِ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13021,
                "hadithNumber": "5458",
                "englishNarrator": "Salim reported:",
                "hadithEnglish": "I heard Ibn Umar رضی اللہ  عنہ as saying that he had heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying like this (as mentioned above) but with a slight variation of wording [that instead of the word thaub (cloth) there is the word thiyab (the clothes) ].",
                "hadithUrdu": "میں نے ابن عمر رضی اللہ عنہما کو یہ کہتے ہوئے سنا کہ میں رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ فرما رہےتھےاسی کے مانند مگر انھوں نے ( کپڑا گھسیٹا کے بجا ئے ) \" کپڑے ( گھسیٹے ) \" کہا ۔",
                "urduNarrator": "ہم سے ابن نمیر نے بیان کیا، کہا ہم سے اسحاق بن سلیمان نے بیان کیا، کہا ہم سے حنظلہ بن ابی سفیان نے بیان کیا، انہوں نے کہا کہ",
                "hadithArabic": "و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا إِسْحَقُ بْنُ سُلَيْمَانَ حَدَّثَنَا حَنْظَلَةُ بْنُ أَبِي سُفْيَانَ قَالَ سَمِعْتُ ابْنَ عُمَرَ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مِثْلَهُ غَيْرَ أَنَّهُ قَالَ ثِيَابَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13022,
                "hadithNumber": "5459",
                "englishNarrator": "Muslim bin Yannaq reported:",
                "hadithEnglish": "Ibn Umar رضی اللہ عنہ saw a person trailing his lower garment, whereupon he said: From whom do you come? He described his relationship (with the tribe he belonged) and it was found that he belonged to the tribe of Laith. Ibn Umar رضی اللہ عنہ recognised him and said: I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) with these two ears of mine saying: He who trailed his lower garment with no other intention but pride, Allah would not look toward him on the Day of Resurrection.",
                "hadithUrdu": "وہ حضرت ابن عمر رضی اللہ عنہ سے حدیث بیان کررہے تھے کہ انھوں نے ایک شخص کو چادر گھسیٹ کر چلتے ہوئے دیکھا انھوں نے اس سے پو چھا : تم کس قبیلے سے ہو ؟ اس نے نسب بتا یا وہ شخص بنو لیث سے تھا ، حضرت ابن عمر رضی اللہ عنہ نے اس کو پہچان لیا اور کہا : میں نے اپنے ان دونوں کانوں سے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے کہ آپ فرما رہے تھے ۔ \" جس شخص نے اپنی ازار ( کمر سے نیچے کی چادر وغیرہ ) گھسیٹی اس سے اس کا ارادہ تکبر کے سوا اور نہ تھا تو قیامت کے دن اللہ تعا لیٰ اس کی طرف نظر تک نہیں فرما ئے گا ۔ \"",
                "urduNarrator": "ہم سے محمد بن المثنیٰ نے بیان کیا، ہم سے محمد بن جعفر نے بیان کیا, شعبہ نے کہا : میں نے مسلم بن یناق سے سنا",
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ مُسْلِمَ بْنَ يَنَّاقَ يُحَدِّثُ عَنْ ابْنِ عُمَرَ أَنَّهُ رَأَى رَجُلًا يَجُرُّ إِزَارَهُ فَقَالَ مِمَّنْ أَنْتَ فَانْتَسَبَ لَهُ فَإِذَا رَجُلٌ مِنْ بَنِي لَيْثٍ فَعَرَفَهُ ابْنُ عُمَرَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِأُذُنَيَّ هَاتَيْنِ يَقُولُ مَنْ جَرَّ إِزَارَهُ لَا يُرِيدُ بِذَلِكَ إِلَّا الْمَخِيلَةَ فَإِنَّ اللَّهَ لَا يَنْظُرُ إِلَيْهِ يَوْمَ الْقِيَامَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13023,
                "hadithNumber": "5460",
                "englishNarrator": null,
                "hadithEnglish": "A similar report (as no. 5459) was narrated from Ibn Umar from the prophet ,but in the Hadith of Abu Yonus it says: From Muslim Abul-Hassan,\" and in both their reports it says: \"Whoever lets his Iazr drag,' and they did not say: \"His garment.'\"",
                "hadithUrdu": "ہم سے ابن نمیر نے بیان کیا، ہم سے میرے والد نے بیان کیا, عبد الملک بن ابی سلیمان ابو یو نس اور ابرا ہیم بن نافع ان سب نے مسلم بن یناق سے ، انھوں نے حضرت ابن عمر رضی اللہ عنہ سے انھوں نے نبی صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی مگر ابو یونس کی حدیث میں ہے : ابو الحسن مسلم روایت ہے اور ان سب کی روایت میں ہے ، \" جس نے اپنی ازارگھسیٹی \" انھوں نے \" اپنا کپڑا \" نہیں کہا ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا عَبْدُ الْمَلِكِ يَعْنِي ابْنَ أَبِي سُلَيْمَانَ ح و حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا أَبُو يُونُسَ ح و حَدَّثَنَا ابْنُ أَبِي خَلَفٍ حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ حَدَّثَنِي إِبْرَاهِيمُ يَعْنِي ابْنَ نَافِعٍ كُلُّهُمْ عَنْ مُسْلِمِ بْنِ يَنَّاقَ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ غَيْرَ أَنَّ فِي حَدِيثِ أَبِي يُونُسَ عَنْ مُسْلِمٍ أَبِي الْحَسَنِ وَفِي رِوَايَتِهِمْ جَمِيعًا مَنْ جَرَّ إِزَارَهُ وَلَمْ يَقُولُوا ثَوْبَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13024,
                "hadithNumber": "5461",
                "englishNarrator": "Muhammad bin 'Abbad bin Ja'far reported:",
                "hadithEnglish": "I ordered Muslim bin Yasar, the freed slave of Nafi' bin 'Abdul-Harith, while I was sitting between them, that he should ask Ibn 'Umar رضی اللہ عنہ  if he had heard anything from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) pertaining to one who trails his lower garment out of pride. He said: I heard him (the Holy Prophet) as saying: Allah will not look toward him on the Day of Resurrection.",
                "hadithUrdu": "میں نے نافع بن عبد الحارث کے غلام مسلم بن یسار سے کہا کہ وہ حضرت ابن عمر رضی اللہ عنہ سے سوال کریں کہا : اور میں ان دونوں کے درمیان بیٹھا تھا ( انھوں نے سوال کیا : ) کیا آپ نے نبی صلی اللہ علیہ وسلم سے اس شخص کے بارے میں کو ئی بات سنی جو تکبر سے اپنی ازارگھیسٹتا ہے؟ انھوں نے کہا : میں نے آپ صلی اللہ علیہ وسلم کو یہ فرما تے ہو ئے سنا تھا : \" قیامت کے دن اللہ تعا لیٰ اس کی طرف نظر تک نہیں فر ما ئے گا.",
                "urduNarrator": "اور مجھ سے محمد بن حاتم، ہارون بن عبداللہ اور ابن ابی خلف نے بیان کیا، اور ان کا قول اسی طرح ہے، انہوں نے کہا کہ ہم سے روح بن عبادہ نے بیان کیا, ہمیں ابن جریج نے حدیث بیان کی ، کہا : میں نے محمد بن عباد بن جعفر سے سنا ، کہہ رہے تھے",
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ وَهَارُونُ بْنُ عَبْدِ اللَّهِ وَابْنُ أَبِي خَلَفٍ وَأَلْفَاظُهُمْ مُتَقَارِبَةٌ قَالُوا حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ حَدَّثَنَا ابْنُ جُرَيْجٍ قَالَ سَمِعْتُ مُحَمَّدَ بْنَ عَبَّادِ بْنِ جَعْفَرٍ يَقُولُ أَمَرْتُ مُسْلِمَ بْنَ يَسَارٍ مَوْلَى نَافِعِ بْنِ عَبْدِ الْحَارِثِ أَنْ يَسْأَلَ ابْنَ عُمَرَ قَالَ وَأَنَا جَالِسٌ بَيْنَهُمَا أَسَمِعْتَ مِنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الَّذِي يَجُرُّ إِزَارَهُ مِنْ الْخُيَلَاءِ شَيْئًا قَالَ سَمِعْتُهُ يَقُولُ لَا يَنْظُرُ اللَّهُ إِلَيْهِ يَوْمَ الْقِيَامَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13025,
                "hadithNumber": "5462",
                "englishNarrator": "Ibn 'Umar reported:",
                "hadithEnglish": "I happened to pass before Allah's Messenger (ﷺ) with my lower garment trailing (upon the ground). He said: 'Abdullah, tug up your lower garment,, I tugged it up, and he again said: Tug it still further, and I tugged it still further and I went on tugging it afterward, whereupon some of the people said: To what extent? Thereupon he said: To the middle of the shanks.",
                "hadithUrdu": "میں رسول اللہ صلی اللہ علیہ وسلم کے قریب سے گزرا میری کمر کی چادر کسی حد تک لٹک رہی تھی توآپ نے فرما یا \" عبد اللہ ! اپنی چادر اوپر کرلو ۔ \" میں نے اپنی چادر اوپر کرلی ۔ آپ نے فر ما یا : \" اور زیادہ کر لو \" میں نے ااورزیادہ اوپر کی ، پھر میں اس کواوپر کرتا رہا حتی کہ بعض لو گوں نے عرض کی کہاں تک ( اوپر کرے ) ؟ آپ صلی اللہ علیہ وسلم نےفر ما یا : \" پنڈلیوں کے آدھے حصوں تک ۔ \"",
                "urduNarrator": "مجھ سے ابو الطاہر نے بیان کیا، مجھ سے ابن وہب نے بیان کیا، مجھ سے عمر بن محمد نے بیان کیا, عبد اللہ بن واقد نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عُمَرُ بْنُ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ وَاقِدٍ عَنْ ابْنِ عُمَرَ قَالَ مَرَرْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَفِي إِزَارِي اسْتِرْخَاءٌ فَقَالَ يَا عَبْدَ اللَّهِ ارْفَعْ إِزَارَكَ فَرَفَعْتُهُ ثُمَّ قَالَ زِدْ فَزِدْتُ فَمَا زِلْتُ أَتَحَرَّاهَا بَعْدُ فَقَالَ بَعْضُ الْقَوْمِ إِلَى أَيْنَ فَقَالَ أَنْصَافِ السَّاقَيْنِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13026,
                "hadithNumber": "5463",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "He saw a person whose lower garment bad been trail in. and he was striking the ground with his foot (conceitedly). He was the Amir of Bahrain and it was being said: Here comes the Amir, here comes the Amir. He (Abu Huraira رضی اللہ عنہ) reported that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Allah will not look toward him who trails his lower garment out of pride.",
                "hadithUrdu": "انھوں نے ایک شخص کو چادر گھسیٹ کر چلتے ہو ئے دیکھا اس شخص نے زمین پر پاؤں مار مار کہنا شروع کر دیا : امیر آگئے امیرآگئے ۔ وہ ( ابو ہریرہ رضی اللہ تعالیٰ عنہ ) بحرین کے امیر تھے ۔ ( یہ دیکھ کر ابو ہریرہ رضی اللہ عنہ نے کہا ) رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا تھا \" جو شخص اتراتے ہو ئے زمین پر اپنی ازار گھسیٹتا ہے اللہ تعا لیٰ اس کی طرف نظر تک نہ فرمائے گا ۔",
                "urduNarrator": "عبید اللہ کے والد معاذ نے کہا : ہمیں شعبہ نے محمد بن زیاد سے روایت کی ، کہا : میں نے حضرت ابو ہریرہ رضی اللہ عنہ سے سنا ، اور",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ مُحَمَّدٍ وَهُوَ ابْنُ زِيَادٍ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ وَرَأَى رَجُلًا يَجُرُّ إِزَارَهُ فَجَعَلَ يَضْرِبُ الْأَرْضَ بِرِجْلِهِ وَهُوَ أَمِيرٌ عَلَى الْبَحْرَيْنِ وَهُوَ يَقُولُ جَاءَ الْأَمِيرُ جَاءَ الْأَمِيرُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ لَا يَنْظُرُ إِلَى مَنْ يَجُرُّ إِزَارَهُ بَطَرًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13027,
                "hadithNumber": "5464",
                "englishNarrator": "This hadith has been reported on the authority of Shu'ba with the same chain of transmitters and in the hadith transmitted on the authority of Ibn ja'far (the words are): Marwan had made Abu Huraira رضی اللہ عنہ as his deputy. and in the hadith transmitted on the authority of Ibn Muthanna (the words are):",
                "hadithEnglish": "Abu Huraira رضی اللہ عنہ was the Governor of Medina.",
                "hadithUrdu": "حضرت ابو ہریرہ رضی اللہ عنہ کو ( حاکم کی غیرحاضر ی میں ) مدینہ کا حاکم بنا یا جا تا تھا ۔",
                "urduNarrator": "محمد بن بشار نے کہا : ہمیں محمد بن جعفر نے حدیث بیان کی ۔ اور ابن مثنیٰ نے کہا : ہمیں ابن ابی عدی نے حدیث سنائی ، ان دونوں نے شعبہ سے اسی سند کے ساتھ حدیث بیان کی ، ابن جعفر کی روایت میں ہے : مروان ابو ہریرہ رضی اللہ عنہ کو اپنی غیر حاضری میں مدینہ کا ( قائم مقام ) حاکم بنا یا کرتا تھا ۔ اور ابن مثنیٰ کی حدیث میں ہے",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدٌ يَعْنِي ابْنَ جَعْفَرٍ ح و حَدَّثَنَاه ابْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ كِلَاهُمَا عَنْ شُعْبَةَ بِهَذَا الْإِسْنَادِ وَفِي حَدِيثِ ابْنِ جَعْفَرٍ كَانَ مَرْوَانُ يَسْتَخْلِفُ أَبَا هُرَيْرَةَ وَفِي حَدِيثِ ابْنِ الْمُثَنَّى كَانَ أَبُو هُرَيْرَةَ يُسْتَخْلَفُ عَلَى الْمَدِينَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13028,
                "hadithNumber": "5465",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said that there was a person who used to walk with pride because of his thick hair and fine mantles. He was made to sink in the earth and he would go on sinking in the earth until the Last Hour would come.",
                "hadithUrdu": "آپ نے فر ما یا : \" ایک شخص اپنے بالوں اور اپنی چادروں پر اتراتا ہو ا چل رہا تھا کہاچا نک اس کو زمین میں دھنسا دیا گیا اور وہ قیامت تک زمین میں دھنستا چلا جا ئے گا ۔",
                "urduNarrator": "ہم سے عبدالرحمٰن بن سلام الجمحی نے بیان کیا, ربیع بن مسلم نے محمد بن زیا د سے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَلَّامٍ الْجُمَحِيُّ حَدَّثَنَا الرَّبِيعُ يَعْنِي ابْنَ مُسْلِمٍ عَنْ مُحَمَّدِ بْنِ زِيَادٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ بَيْنَمَا رَجُلٌ يَمْشِي قَدْ أَعْجَبَتْهُ جُمَّتُهُ وَبُرْدَاهُ إِذْ خُسِفَ بِهِ الْأَرْضُ فَهُوَ يَتَجَلْجَلُ فِي الْأَرْضِ حَتَّى تَقُومَ السَّاعَةُ.",
                "headingArabic": "تَحْرِيمِ التَّبَخْتُرِ فِي الْمَشْىِ مَعَ إِعْجَابِهِ بِثِيَابِهِ",
                "headingUrdu": "تکبر سے لڑنے اور کپڑوں سے تعجب کرنے کی ممانعت",
                "headingEnglish": "The Prohibition Against Strutting With Pride, And Being Amazed With One's Clothes",
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13029,
                "hadithNumber": "5466",
                "englishNarrator": null,
                "hadithEnglish": "A similar report was narrated from Abu Huraira رضی اللہ عنہما, from the prophet ﷺ.",
                "hadithUrdu": "ہم سے عبید اللہ بن معاذ نے بیان کیا، ہم سے ابوحنیفہ نے بیان کیا، ہم سے محمد بن بشار نے بیان کیا، ان سے محمد بن جعفر  کی سند سے، ہم سے محمد بن المثنیٰ نے بیان کیا، ان سے ابن عباس رضی اللہ عنہما نے بیان کیا۔ سب نے کہا, شعبہ نے ہمیں محمد بن زیاد سے حدیث بیان کی ، انھوں نے ابوہریرہ رضی اللہ عنہ سے انھوں نے نبی صلی اللہ علیہ وسلم سے اسی کے ما نند حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي ح و حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ قَالُوا جَمِيعًا حَدَّثَنَا شُعْبَةُ عَنْ مُحَمَّدِ بْنِ زِيَادٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِ هَذَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13030,
                "hadithNumber": "5467",
                "englishNarrator": "It was narrated from Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of  Allah ﷺ said: \"While a man was strutting proudly in his two Rida's Admiring himself, Allah cused the earth to swallow him up, nd he will continue sinking into it until the day of Resurrection.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" ایک شخص اکڑتا ہوا اپنی دو چادروں میں چلا جا رہا تھا اپنے آپ پر اترارہا تھا اللہ تعا لیٰ نے اسے زمین میں دھنسا دیا وہ قیامت تک زمین میں دھنستا چلا جا ئے گا ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ان سے المغیرہ یعنی الحزامی نے، ہم سے ابو الزناد کی سند سے بیان کیا اعرج نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا الْمُغِيرَةُ يَعْنِي الْحِزَامِيَّ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ بَيْنَمَا رَجُلٌ يَتَبَخْتَرُ يَمْشِي فِي بُرْدَيْهِ قَدْ أَعْجَبَتْهُ نَفْسُهُ فَخَسَفَ اللَّهُ بِهِ الْأَرْضَ فَهُوَ يَتَجَلْجَلُ فِيهَا إِلَى يَوْمِ الْقِيَامَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13031,
                "hadithNumber": "5468",
                "englishNarrator": "Mamar narrated that Hammam bin Munabbih said: \"This is what Abu Huraira رضی اللہ عنہ narrated to us from the Messenger of Allah ﷺ,\" and he mentioned a number of Ahadith, including the following:",
                "hadithEnglish": "The Messenger of Allah ﷺ said: While there was a man who strutted in his two mantles. Then he mentioned something similar (to Hadith no. 5467).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" ایک شخص دوچادروں میں اتراتا ہوا جا رہا تھا \" پھر اسی کے مانند بیان کیا ۔",
                "urduNarrator": "ہم سے محمد بن رافع نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا, معمر نے ہمام بن منبہ سے خبر دی کہا : یہ اھادیث ہیں جو حضرت ابو ہریرہ رضی اللہ عنہ نے ہمیں سنا ئیں ، پھر انھوں نے کچھ اھادیث سنائیں ، ان میں سے ( ایک ) یہ تھی اور",
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَمَا رَجُلٌ يَتَبَخْتَرُ فِي بُرْدَيْنِ ثُمَّ ذَكَرَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13032,
                "hadithNumber": "5469",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: There was a person (living before you) who took pride in his cloak. the rest of the hadith is the same.",
                "hadithUrdu": "آپ ﷺ فر ما رہے تھے ۔ \" تم سے پہلے کی ایک امت میں ایک شخص چادروں کے ایک جوڑے میں اتراتا ہوا جا رہاتھا \" پھر ان سب کی حدیث کے مانند ذکر کیا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے عفان نے بیان کیا، کہا ہم سے حماد بن سلمہ نے بیان کیا، ثابت کی سند سے, ابو رفع نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی کہا میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ ثَابِتٍ عَنْ أَبِي رَافِعٍ عَنْ أَبِي هُرَيْرَةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ رَجُلًا مِمَّنْ كَانَ قَبْلَكُمْ يَتَبَخْتَرُ فِي حُلَّةٍ ثُمَّ ذَكَرَ مِثْلَ حَدِيثِهِمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13033,
                "hadithNumber": "5470",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) forbade the wearing of gold signet ring.",
                "hadithUrdu": "آپﷺ نے سونے کی انگوٹھی ( پہننے ، استعمال کرنے ) سے منع فرما یا ۔",
                "urduNarrator": "عبید اللہ کے والد معاذ نے کہا : ہمیں شعبہ نے قتادہ سے حدیث بیان کی ، انھوں نے نضر بن انس سے ، انھوں نے بشیر نہیک سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ النَّضْرِ بْنِ أَنَسٍ عَنْ بَشِيرِ بْنِ نَهِيكٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ نَهَى عَنْ خَاتَمِ الذَّهَبِ.",
                "headingArabic": "تَحْرِيمِ خَاتَمِ الذَّهَبِ عَلَى الرِّجَالِ وَنَسْخِ مَا كَانَ مِنْ إِبَاحَتِهِ فِي أَوَّلِ الْإِسْلَامِ",
                "headingUrdu": "مردوں کے لیے سونے کی انگوٹھیوں کی ممانعت، اور ابتدائے اسلام کے بعد ان کے الاؤنس کی منسوخی",
                "headingEnglish": "The Prohibition Of Gold Rings For Men, And Abrogation Of Their Allowance After The Beginning Of Islam",
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13034,
                "hadithNumber": "5471",
                "englishNarrator": null,
                "hadithEnglish": "Shabh narrated it with this chain of narrators.",
                "hadithUrdu": "محمد بن مثنیٰ اور ابن بشار نے کہا : ہمیں محمد بن جعفر نے حدیث بیان کی ، کہا : ہمیں شعبہ نے اسی سند کے ساتھ حدیث سنائی ۔ اور ابن مثنیٰ کی حدیث میں ہے ، کہا : میں نے نضر بن انس سے سنا ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَاه مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ بِهَذَا الْإِسْنَادِ وَفِي حَدِيثِ ابْنِ الْمُثَنَّى قَالَ سَمِعْتُ النَّضْرَ بْنَ أَنَسٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13035,
                "hadithNumber": "5472",
                "englishNarrator": "Abdullah bin 'Abbas رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saw a person wearing a gold signet ring in his hand. He (the Holy Prophet) pulled it off and threw it away, saying: One of you is wishing live coal from Hell. and putting it on his hand. It was said to the person after Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had left: Take your signet ring (of gold) and derive benefit out of it. whereupon he said: No, by Allah, I would never take it when Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) has thrown it away.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ایک شخص کے ہا تھا ( کی انگلی ) میں سونے کی انگوٹھی دیکھی ، آپ نے اس کو اتار کر پھینک دیا اور فرما یا \" تم میں سے کوئی شخص آگ کا انگارہ اٹھا تا ہے اور اسے اپنے ہاتھ میں ڈال لیتا ہے ۔ \" رسول اللہ صلی اللہ علیہ وسلم کے تشریف لے جا نے کے بعد اس شخص سے کہا گیا : اپنی انگوٹھی لے لو اور اس سے کو ئی فائدہ اٹھا لو ۔ اس نے کہا : اللہ کی قسم !میں اسے کبھی نہیں اٹھا ؤں گا ۔ جبکہ رسول اللہ صلی اللہ علیہ وسلم نے اسے پھینک دیا ہے ۔",
                "urduNarrator": "مجھ سے محمد بن سہل تمیمی نے بیان کیا، مجھ سے ابن ابی مریم نے بیان کیا، مجھ سے محمد بن جعفر نے بیان کیا، مجھ سے ابراہیم بن عقبہ نے کریب کی سند سے بیان کیا۔ صاحب حضرت ابن عباس رضی اللہ عنہ کے آزاد غلام کریب نے حضرت عبد اللہ بن عباس رضی اللہ عنہ سے روایت کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ سَهْلٍ التَّمِيمِيُّ حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ أَخْبَرَنِي مُحَمَّدُ بْنُ جَعْفَرٍ أَخْبَرَنِي إِبْرَاهِيمُ بْنُ عُقْبَةَ عَنْ كُرَيْبٍ مَوْلَى ابْنِ عَبَّاسٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى خَاتَمًا مِنْ ذَهَبٍ فِي يَدِ رَجُلٍ فَنَزَعَهُ فَطَرَحَهُ وَقَالَ يَعْمِدُ أَحَدُكُمْ إِلَى جَمْرَةٍ مِنْ نَارٍ فَيَجْعَلُهَا فِي يَدِهِ فَقِيلَ لِلرَّجُلِ بَعْدَ مَا ذَهَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُذْ خَاتِمَكَ انْتَفِعْ بِهِ قَالَ لَا وَاللَّهِ لَا آخُذُهُ أَبَدًا وَقَدْ طَرَحَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13036,
                "hadithNumber": "5473",
                "englishNarrator": "Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger (ﷺ) got fashioned a signet ring of gold but he kept its stone on the inner side of his palm as he wore it, so the people (following his example) got fashioned (such rings). Then one day as he sat on the pulpit he pulled it away saying: I wore this ring and kept its stone towards the inner side. He then threw it away, and said: By Allah, I will never wear it; so the people threw their rings away.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے سونے کی ایک انگوٹھی بنوائی آپ اسے پہنتے تو اس کا نگینہ ہتھیلی کے اندر کی طرف کر لیا کرتے تھے تو لوگوں نے بھی سونے کی انگوٹھیاں بنوالیں ، پھر آپ صلی اللہ علیہ وسلم منبر پر تشریف فرما ہو ئے ۔ اس انگوٹھی کو اتار دیا اور فرما یا : \" میں اس انگوٹھی کو پہنتا تھا تو نگینے کو اندر کی طرف کر لیتا تھا : \" پھر آپ نے اسے پھینک دیااور فر ما یا : \" اللہ کی قسم! میں اس کو کبھی نہیں پہنوں گا ۔ \" پھر لو گوں نے بھی اپنی اپنی انگوٹھیا ں پھینک دیں ۔( حدیث کے الفا ظ یحییٰ کے بیا ن کردہ ) ہیں ۔",
                "urduNarrator": "یحییٰ بن یحییٰ تمیمی محمد بن رمح اور قتیبہ نے کہا : ہمیں لیث نے نافع سے خبر دی ، انھوں نے حضرت عبد اللہ ( بن عمر رضی اللہ عنہ ) سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ وَمُحَمَّدُ بْنُ رُمْحٍ قَالَا أَخْبَرَنَا اللَّيْثُ ح و حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا لَيْثٌ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اصْطَنَعَ خَاتَمًا مِنْ ذَهَبٍ فَكَانَ يَجْعَلُ فَصَّهُ فِي بَاطِنِ كَفِّهِ إِذَا لَبِسَهُ فَصَنَعَ النَّاسُ ثُمَّ إِنَّهُ جَلَسَ عَلَى الْمِنْبَرِ فَنَزَعَهُ فَقَالَ إِنِّي كُنْتُ أَلْبَسُ هَذَا الْخَاتَمَ وَأَجْعَلُ فَصَّهُ مِنْ دَاخِلٍ فَرَمَى بِهِ ثُمَّ قَالَ وَاللَّهِ لَا أَلْبَسُهُ أَبَدًا فَنَبَذَ النَّاسُ خَوَاتِيمَهُمْ وَلَفْظُ الْحَدِيثِ لِيَحْيَى.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13037,
                "hadithNumber": "5474",
                "englishNarrator": "This hadith was narrated from Ibn 'Umar رضی اللہ عنہ, from the prophet ﷺconcerning gold rings (a narration similar to no. 5473), and in the Hadith of 'Uqbah bin Khalid it adds:",
                "hadithEnglish": "\"He wrote it on his righthand.\"",
                "hadithUrdu": "آپ نے اسے دا ئیں ہاتھ میں پہنا ۔",
                "urduNarrator": "اور ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, محمد بن بشر یحییٰ بن سعید خالد بن حارث اور عقبہ بن خا لد سب نے عبید اللہ سے ، انھوں نے نافع سے ، انھوں نے حضرت ابن عمر رضی اللہ عنہ سے اور انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے سونے کی انگوٹھی کے بارے میں حدیث روایت کی ، عقبہ بن خالد کی روایت میں ( عبید اللہ نے ) یہ اضافہ کیا  اور",
                "hadithArabic": "و حَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ ح و حَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ ح و حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ ح و حَدَّثَنَا سَهْلُ بْنُ عُثْمَانَ حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ كُلُّهُمْ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْحَدِيثِ فِي خَاتَمِ الذَّهَبِ وَزَادَ فِي حَدِيثِ عُقْبَةَ بْنِ خَالِدٍ وَجَعَلَهُ فِي يَدِهِ الْيُمْنَى.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13038,
                "hadithNumber": "5475",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has also been likewise narrated on the authority of Ibn 'Umar رضی اللہ عنہ from the prophet ﷺ, concerning gold rings.",
                "hadithUrdu": "مجھ سے احمد بن عبدہ نے بیان کیا، ہم سے عبد الوارث نے بیان کیا, ایو ب مو سیٰ بن عقبہ اور اسامہ سب نے نافع سے ، انھوں نے ابن عمر رضی اللہ عنہ سے ، انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے سونے کی انگوٹھی کے بارے میں لیث کی حدیث کی طرح روایت کی .",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنِيهِ أَحْمَدُ بْنُ عَبْدَةَ حَدَّثَنَا عَبْدُ الْوَارِثِ حَدَّثَنَا أَيُّوبُ ح و حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ الْمُسَيَّبِيُّ حَدَّثَنَا أَنَسٌ يَعْنِي ابْنَ عِيَاضٍ عَنْ مُوسَى بْنِ عُقْبَةَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ عَبَّادٍ حَدَّثَنَا حَاتِمٌ ح و حَدَّثَنَا هَارُونُ الْأَيْلِيُّ حَدَّثَنَا ابْنُ وَهْبٍ كُلُّهُمْ عَنْ أُسَامَةَ جَمَاعَتُهُمْ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي خَاتَمِ الذَّهَبِ نَحْوَ حَدِيثِ اللَّيْثِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 12726,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=509",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=507",
                "label": "507",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=508",
                "label": "508",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=509",
                "label": "509",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=510",
                "label": "510",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=511",
                "label": "511",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=512",
                "label": "512",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=513",
                "label": "513",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=511",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=511",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=509",
        "to": 12750,
        "total": 40465
    }
}