{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 562,
        "data": [
            {
                "id": 14314,
                "hadithNumber": "6751",
                "englishNarrator": "Tawus reported:",
                "hadithEnglish": "I found some Companions of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Everything is by measure. And he further said: I heard Abdullah bin 'Umar رضی اللہ عنہ as saying: There is a measure for everything-even for incapacity and-capability.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کے متعدد صحابہ کو پایا وہ سب کے سب یہ کہتے تھے کہ ہر چیز ( اللہ کی مقرر کردہ ) مقدار سے ہے اور میں نے حضرت عبداللہ بن عمر رضی اللہ عنہ سے سنا ، کہہ رہے تھے : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ہر چیز ( اللہ کی مقرر کردہ ) مقدار سے ہے یہاں تک کہ ( کسی کام کو ) نہ کر سکنا اور کر سکنا بھی ، یا کہا : ( کسی کام کو ) کر سکنا اور نہ کر سکنا ( بھی اسی مقدار سے ہے ۔ ) \"",
                "urduNarrator": "مجھ سے عبد الاعلی  بن حماد نے بیان کیا، انہوں نے کہا: میں نے مالک بن انس رضی اللہ عنہ سے پڑھا، اور ہم سے قتیبہ بن سعید نے مالک رضی اللہ عنہ سے بیان کیا کہ زیاد رضی اللہ عنہ سے جو کچھ پڑھا گیا تھا۔ ابن سعد, عمرو بن مسلم نے طاوس سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنِي عَبْدُ الْأَعْلَى بْنُ حَمَّادٍ قَالَ قَرَأْتُ عَلَى مَالِكِ بْنِ أَنَسٍ ح و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكٍ فِيمَا قُرِئَ عَلَيْهِ عَنْ زِيَادِ بْنِ سَعْدٍ عَنْ عَمْرِو بْنِ مُسْلِمٍ عَنْ طَاوُسٍ أَنَّهُ قَالَ أَدْرَكْتُ نَاسًا مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُونَ كُلُّ شَيْءٍ بِقَدَرٍ قَالَ وَسَمِعْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُّ شَيْءٍ بِقَدَرٍ حَتَّى الْعَجْزِ وَالْكَيْسِ أَوْ الْكَيْسِ وَالْعَجْزِ.",
                "headingArabic": "كُلُّ شَىْءٍ بِقَدَرٍ ‏ ‏",
                "headingUrdu": "سب کچھ طے شدہ اور طے شدہ ہے۔",
                "headingEnglish": "Everything Is Decided And Decreed",
                "chapterId": "47",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 147,
                    "chapterNumber": "47",
                    "chapterEnglish": "The Book of Destiny",
                    "chapterUrdu": "تقدیر کا بیان",
                    "chapterArabic": "كتاب الْقَدَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14315,
                "hadithNumber": "6752",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "The polytheists of the Quraish came to have an argument with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) in regard to Destiny and then this verse was revealed: On the day when they are dragged into the Fire upon their faces, taste the touch of Fire. Surely, We have created everything according to a measure (liv. 48).",
                "hadithUrdu": "مشرکین قریش تقدیر کے بارے میں رسول اللہ صلی اللہ علیہ وسلم سے بحث کرنے کے لیے آئے ، اس وقت ( یہ آیت ) نازل ہوئی : \" جس دن وہ جہنم میں اوندھے منہ گھسیٹے جائیں گے ، ( کہا جائے گا : ) دوزخ کا عذاب چکھو ، بےشک ہم نے ہر چیز کو ( طے شدہ ) مقدار کے مطابق بنایا ہے ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، کہا: ہم سے وکیع نے، سفیان کی سند سے، زیاد بن اسماعیل کی سند سے بیان کیا, محمد بن عباد بن جعفر مخزومی نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ زِيَادِ بْنِ إِسْمَعِيلَ عَنْ مُحَمَّدِ بْنِ عَبَّادِ بْنِ جَعْفَرٍ الْمَخْزُومِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَ جَاءَ مُشْرِكُو قُرَيْشٍ يُخَاصِمُونَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْقَدَرِ فَنَزَلَتْ يَوْمَ يُسْحَبُونَ فِي النَّارِ عَلَى وُجُوهِهِمْ ذُوقُوا مَسَّ سَقَرَ إِنَّا كُلَّ شَيْءٍ خَلَقْنَاهُ بِقَدَرٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "47",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 147,
                    "chapterNumber": "47",
                    "chapterEnglish": "The Book of Destiny",
                    "chapterUrdu": "تقدیر کا بیان",
                    "chapterArabic": "كتاب الْقَدَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14316,
                "hadithNumber": "6753",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Verily Allah has fixed the very portion of adultery which a man will indulge in, and which he of necessity must commit. The adultery of the eye is the lustful look, and the adultery of the tongue is the licentious speech, the heart desires and yearns, which the parts may or may not put into effect.",
                "hadithUrdu": "میں نے اس سے بڑھ کر ( قرآن کے لفظ ) \"\" اللمم \"\" سے مشابہ کوئی اور چیز نہیں دیکھی ، نبی صلی اللہ علیہ وسلم نے فرمایا : \"\" اللہ تعالیٰ نے ابن آدم پر اس کے حصے کا زنا لکھ دیا ہے ، وہ لامحالہ اپنا حصہ لے گا ۔ آنکھ کا زنا ( جس کا دیکھنا حرام ہے اس کو ) دیکھنا ہے ۔ زبان کا زنا ( حرام بات ) کہنا ہے ، دل تمنا رکھتا ہے ، خواہش کرتا ہے ، پھر شرم گاہ اس کی تصدیق کرتی ہے ( اور وہ زنا کا ارتکاب کر لیتاہے ) یا تکذیب کرنی ہے ( اور وہ اس کا ارتکاب نہیں کرتا ۔ ) \"\" عبد نے اپنی روایت میں کہا : ابن طاوس نے اپنے والد سے روایت کی ( کہا : ) میں نے حضرت ابن عباس رضی اللہ عنہ سے سنا ، ( اس سند میں سماع کی صراحت ہے ۔ )",
                "urduNarrator": "اسحٰق بن ابراہیم اور عبد بن حمید نے ہمیں حدیث بیان کی ۔ ۔ الفاظ اسحٰق کے ہیں ۔ ۔ دونوں نے کہا : ہمیں عبدالرزاق نے خبر دی ، انہوں نے کہا؛ ہمیں معمر نے ابن طاوس سے حدیث بیان کی ، انہوں نے اپنے والد سے اور انہوں نے حضرت ابن عباس رضی اللہ عنہ سے روایت کی ، کہا : جو ابوہریرہ رضی اللہ عنہ نے کہا",
                "hadithArabic": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَعَبْدُ بْنُ حُمَيْدٍ وَاللَّفْظُ لِإِسْحَقَ قَالَا أَخْبَرَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ قَالَ مَا رَأَيْتُ شَيْئًا أَشْبَهَ بِاللَّمَمِ مِمَّا قَالَ أَبُو هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ كَتَبَ عَلَى ابْنِ آدَمَ حَظَّهُ مِنْ الزِّنَا أَدْرَكَ ذَلِكَ لَا مَحَالَةَ فَزِنَا الْعَيْنَيْنِ النَّظَرُ وَزِنَا اللِّسَانِ النُّطْقُ وَالنَّفْسُ تَمَنَّى وَتَشْتَهِي وَالْفَرْجُ يُصَدِّقُ ذَلِكَ أَوْ يُكَذِّبُهُ قَالَ عَبْدٌ فِي رِوَايَتِهِ ابْنِ طَاوُسٍ عَنْ أَبِيهِ سَمِعْتُ ابْنَ عَبَّاسٍ.",
                "headingArabic": "قُدِّرَ عَلَى ابْنِ آدَمَ حَظُّهُ مِنَ الزِّنَى وَغَيْرِهِ ‏ ‏",
                "headingUrdu": "ابن آدم کے لیے زنا وغیرہ کا حصہ مقرر ہے۔",
                "headingEnglish": "The Son Of Adam's Share Of Zina Etc. Is Decreed For Him",
                "chapterId": "47",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 147,
                    "chapterNumber": "47",
                    "chapterEnglish": "The Book of Destiny",
                    "chapterUrdu": "تقدیر کا بیان",
                    "chapterArabic": "كتاب الْقَدَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14317,
                "hadithNumber": "6754",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying. Allah fixed the very portion of adultery which a man will indulge in. There would be no escape from it. The adultery of the eye is the lustful look and the adultery of the ears is listening to voluptuous (song or talk) and the adultery of the tongue is licentious speech and the adultery of the hand is the lustful grip (embrace) and the adultery of the feet is to walk (to the place) where he intends to commit adultery and the heart yearns and desires which he may or may not put into effect.",
                "hadithUrdu": "آپ نے فرمایا : \" ابن آدم کے متعلق زنا میں سے اس کا حصہ لکھ دیا گیا ہے ۔ وہ لا محالہ اس کو حاصل کرنے والا ہے ، پس دونوں آنکھیں ، ان کا زنا دیکھنا ہے اور دونوں کان ، ان کا زنا سننا ہے اور زبان ، اس کا زنا بات کرنا ہے اور ہاتھ ، اس کا زنا پکڑنا ہے اور پاؤں ، اس کا زنا چل کر جانا ہے اور دل تمنا رکھتا ہے اور خواہش کرتا ہے اور شرم گاہ ان تمام باتوں کی تصدیق کرتی ہے ( اسے عملا سچ کر دکھاتی ہے اور حرام کا ارتکاب ہو جاتا ہے ) یا اس کی تکذیب کرتی ہے ( حقیقی زنا سے بچاؤ ہو جاتا ہے ۔ ) \"",
                "urduNarrator": "ہم سے اسحاق بن منصور نے بیان کیا، کہا ہم سے ابو ہشام المخزومی نے بیان کیا، کہا ہم سے وہیب نے بیان کیا، ہم سے سہیل بن ابوصالح نے حضرت ابوہریرہ رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ أَخْبَرَنَا أَبُو هِشَامٍ الْمَخْزُومِيُّ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا سُهَيْلُ بْنُ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كُتِبَ عَلَى ابْنِ آدَمَ نَصِيبُهُ مِنْ الزِّنَا مُدْرِكٌ ذَلِكَ لَا مَحَالَةَ فَالْعَيْنَانِ زِنَاهُمَا النَّظَرُ وَالْأُذُنَانِ زِنَاهُمَا الِاسْتِمَاعُ وَاللِّسَانُ زِنَاهُ الْكَلَامُ وَالْيَدُ زِنَاهَا الْبَطْشُ وَالرِّجْلُ زِنَاهَا الْخُطَا وَالْقَلْبُ يَهْوَى وَيَتَمَنَّى وَيُصَدِّقُ ذَلِكَ الْفَرْجُ وَيُكَذِّبُهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "47",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 147,
                    "chapterNumber": "47",
                    "chapterEnglish": "The Book of Destiny",
                    "chapterUrdu": "تقدیر کا بیان",
                    "chapterArabic": "كتاب الْقَدَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14318,
                "hadithNumber": "6755",
                "englishNarrator": "It was narrated from Abu Hurairah رضی اللہ عنہ :",
                "hadithEnglish": "He used to say the Messenger of Allah ﷺ said: \"There is no child who is not born in the state of Fitrah, then his parents make him a Jew or a Christian or a Magian, just as animals bring fourth animals with their limbs intact, do you see any deformed one among them?'\" Then Abu Hurairah رضی اللہ عنہ said: \"Recite, if you wish: Allah's Fitrah with which He has created He has created mankind. No change let there be in Khalqillah.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ہر پیدا ہونے والا بچہ فطرت ( اللہ پر ایمان اور اچھائی کی محبت ) پر پیدا ہوتا ہے ، پھر اس کے ماں باپ اس کو یہودی ، نصرانی اور مجوسی بنا دیتے ہیں ، جیسے ایک جانور ( ماں ) کامل الاعضاء جانور ( بچے ) کو جنم دیتی ہے ، کیا تمہیں ان میں کوئی عضو کٹا ہوا جانور نظر آتا ہے؟ \" پھر حضرت ابوہریرہ رضی اللہ عنہ کہتے تھے : تم چاہو تو یہ آیت پڑھ لو : \" یہی اللہ کی ( عطا کردہ ) فطرت ہے جس پر اس نے لوگوں کی تخلیق فرمائی ، اللہ کی تخلیق میں ردوبدل نہیں ہوتا ۔ \"",
                "urduNarrator": "ہم سے حاجب بن ولید نے بیان کیا، ہم سے محمد بن حرب نے بیان کیا, زُبیدی نے زہری سے روایت کی ، انہوں نے کہا : مجھے سعید بن مسیب نے حضرت ابوہریرہ رضی اللہ عنہ سے خبر دی کہ وہ کہا کرتے تھے",
                "hadithArabic": "حَدَّثَنَا حَاجِبُ بْنُ الْوَلِيدِ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ عَنْ الزُّبَيْدِيِّ عَنْ الزُّهْرِيِّ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ أَنَّهُ كَانَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ مَوْلُودٍ إِلَّا يُولَدُ عَلَى الْفِطْرَةِ فَأَبَوَاهُ يُهَوِّدَانِهِ وَيُنَصِّرَانِهِ وَيُمَجِّسَانِهِ كَمَا تُنْتَجُ الْبَهِيمَةُ بَهِيمَةً جَمْعَاءَ هَلْ تُحِسُّونَ فِيهَا مِنْ جَدْعَاءَ ثُمَّ يَقُولُ أَبُو هُرَيْرَةَ وَاقْرَءُوا إِنْ شِئْتُمْ فِطْرَةَ اللَّهِ الَّتِي فَطَرَ النَّاسَ عَلَيْهَا لَا تَبْدِيلَ لِخَلْقِ اللَّهِ الْآيَةَ.",
                "headingArabic": "مَعْنَى كُلِّ مَوْلُودٍ يُولَدُ عَلَى الْفِطْرَةِ وَحُكْمِ مَوْتِ أَطْفَالِ الْكُفَّارِ وَأَطْفَالِ الْمُسْلِمِينَ",
                "headingUrdu": "\"ہر بچہ فطرہ کی حالت میں پیدا ہوتا ہے\" کا مفہوم اور کافروں اور مسلمانوں کے مردہ بچوں کا حکم۔",
                "headingEnglish": "The Meaning Of \"Every Child Is Born In A State Of Fitrah\" And The Ruling On The Dead Children Of The Disbelievers And Of The Muslims.",
                "chapterId": "47",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 147,
                    "chapterNumber": "47",
                    "chapterEnglish": "The Book of Destiny",
                    "chapterUrdu": "تقدیر کا بیان",
                    "chapterArabic": "كتاب الْقَدَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14319,
                "hadithNumber": "6756",
                "englishNarrator": "It was narrated from Zuhri with this chain of narrators (a Hadith similar to no. 6755) , and he said:",
                "hadithEnglish": "\"As animals bring fourth other animals\" with their limbs intact.\"",
                "hadithUrdu": "\" جس طرح ایک ( مادہ ) جانور بچے کو جنم دیتی ہے ۔ \" انہوں نے \" کامل الاعضاء \" ذکر نہیں کیا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے عبد الاعلٰی نے بیان کیا، ہم سے عبد بن حمید نے بیان کیا، ہم سے عبد الرزاق نے بیان کیا, معمر نے زہری سے اسی سند کے ساتھ روایت کی اور کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الْأَعْلَى ح و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ كِلَاهُمَا عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ بِهَذَا الْإِسْنَادِ وَقَالَ كَمَا تُنْتَجُ الْبَهِيمَةُ بَهِيمَةً وَلَمْ يَذْكُرْ جَمْعَاءَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "47",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 147,
                    "chapterNumber": "47",
                    "chapterEnglish": "The Book of Destiny",
                    "chapterUrdu": "تقدیر کا بیان",
                    "chapterArabic": "كتاب الْقَدَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14320,
                "hadithNumber": "6757",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: No child is born but upon Fitra. He then said. Recite: The nature made by Allah in which He created man, there is no altering of Allah's nature; that is the right religion.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کوئی پیدا ہونے والا بچہ نہیں مگر اس کی ولادت فطرت پر ہوتی ہے ۔ \" پھر ( ابوہریرہ رضی اللہ عنہ ) کہتے : یہ آیت پڑھ لو : \" یہی اللہ کی ( عطا کردہ ) فطرت ہے جس پر اس نے لوگوں کی تخلیق کی ، اللہ کی تخلیق میں تبدیلی نہیں ہو گی ، یہی سیدھا مستحکم دین ہے ( جس کی انسانی فطرت امانت دار ہے ۔ ) \"",
                "urduNarrator": "مجھ سے ابو الطاہر اور احمد بن عیسیٰ نے بیان کیا، انہوں نے کہا: ہم سے ابن وہب نے بیان کیا, یونس بن یزید نے ابن شہاب سے روایت کی ، انہیں ابوسلمہ بن عبدالرحمٰن نے بتایا کہ حضرت ابوہریرہ رضی اللہ عنہ نے کہا",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ وَأَحْمَدُ بْنُ عِيسَى قَالَا حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ بْنُ يَزِيدَ عَنْ ابْنِ شِهَابٍ أَنَّ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ أَخْبَرَهُ أَنَّ أَبَا هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ مَوْلُودٍ إِلَّا يُولَدُ عَلَى الْفِطْرَةِ ثُمَّ يَقُولُ اقْرَءُوا فِطْرَةَ اللَّهِ الَّتِي فَطَرَ النَّاسَ عَلَيْهَا لَا تَبْدِيلَ لِخَلْقِ اللَّهِ ذَلِكَ الدِّينُ الْقَيِّمُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "47",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 147,
                    "chapterNumber": "47",
                    "chapterEnglish": "The Book of Destiny",
                    "chapterUrdu": "تقدیر کا بیان",
                    "chapterArabic": "كتاب الْقَدَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14321,
                "hadithNumber": "6758",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: No babe is born but upon Fitra. It is his parents who make him a Jew or a Christian or a Polytheist. A person said: Allah's Messenger, what is your opinion if they were to die before that (before reaching the age of adolescence when they can distinguish between right and wrong)? He said: It is Allah alone Who knows what they would be doing.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کوئی ولادت پانے والا نہیں مگر وہ فطرت ہی پر پیدا ہوا ہے ، پھر اس کے والدین اسے یہودی ، نصرانی اور مشرک بنا دیتے ہیں ۔ \" ایک آدمی نے کہا : اللہ کے رسول! اگر وہ اس سے پہلے مر جائے؟ آپ نے فرمایا : \" اللہ ہی زیادہ جاننے والا ہے کہ ( بڑے ہو کر ) وہ بچے کیا عمل کرنے والے تھے ۔ \"",
                "urduNarrator": "ہم سے زہیر بن حرب نے بیان کیا, جریر نے اعمش سے ، انہوں نے ابوصالح سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ مَوْلُودٍ إِلَّا يُولَدُ عَلَى الْفِطْرَةِ فَأَبَوَاهُ يُهَوِّدَانِهِ وَيُنَصِّرَانِهِ وَيُشَرِّكَانِهِ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ أَرَأَيْتَ لَوْ مَاتَ قَبْلَ ذَلِكَ قَالَ اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "47",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 147,
                    "chapterNumber": "47",
                    "chapterEnglish": "The Book of Destiny",
                    "chapterUrdu": "تقدیر کا بیان",
                    "chapterArabic": "كتاب الْقَدَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14322,
                "hadithNumber": "6759",
                "englishNarrator": "It was narrated from Al-A'mash with this chain of narrators (a Hadith similar to no. 6758). In the Hadith of Ibn Numair it says:",
                "hadithEnglish": "Every new-born babe is born on the millat (of Islam and he) remains on this until his tongue is enabled to express himself. This hadith has been narrated on the authority of Abu Mu'awiya through another chain of transmitters (and the words are): Every child is born but on this Fitra so long as he does not express himself with his tongue.",
                "hadithUrdu": "\"\" کوئی بچہ پیدا ہونے والا بچہ نہیں مگر وہ ملت پر ہوتا ہے ۔ \"\" اور ابومعاویہ سے ابوبکر نے جو روایت کی اس میں ہے : \"\" مگر وہ اس ملت ( ملت اسلامی ) پر ہوتا ہے یہاں تک کہ اس کی زبان اس ( کے کفر یا ایمان ) کو بیان کر دیتی ہے ۔ \"\" اور ابومعاویہ سے ابوکریب کی روایت میں ہے : \"\" کوئی ولادت پانے والا نومولود نہیں مگر وہ اسی فطرت پر ہوتا ہے یہاں تک کہ اس کی زبان اس کے ( ماحول سے اخذ کردہ ) خیالات کی ترجمانی کرتی ہے ۔ \"\"",
                "urduNarrator": "ابوبکر بن ابی شیبہ اور ابوکریب نے ہمیں حدیث بیان کی ، دونوں نے کہا : ہمیں ابومعاویہ نے حدیث بیان کی ، نیز ہمیں ابن نمیر نے بھی ( یہی ) حدیث بیان کی ، انہوں نے کہا : ہمیں میرے والد نے حدیث بیان کی ، ( ابومعاویہ اور ابن نمیر کے والد ) دونوں نے اعمش سے اسی سند کے ساتھ حدیث بیان کی ۔ ابن نمیر کی حدیث میں ہے",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي كِلَاهُمَا عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ فِي حَدِيثِ ابْنِ نُمَيْرٍ مَا مِنْ مَوْلُودٍ يُولَدُ إِلَّا وَهُوَ عَلَى الْمِلَّةِ وَفِي رِوَايَةِ أَبِي بَكْرٍ عَنْ أَبِي مُعَاوِيَةَ إِلَّا عَلَى هَذِهِ الْمِلَّةِ حَتَّى يُبَيِّنَ عَنْهُ لِسَانُهُ وَفِي رِوَايَةِ أَبِي كُرَيْبٍ عَنْ أَبِي مُعَاوِيَةَ لَيْسَ مِنْ مَوْلُودٍ يُولَدُ إِلَّا عَلَى هَذِهِ الْفِطْرَةِ حَتَّى يُعَبِّرَ عَنْهُ لِسَانُهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "47",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 147,
                    "chapterNumber": "47",
                    "chapterEnglish": "The Book of Destiny",
                    "chapterUrdu": "تقدیر کا بیان",
                    "chapterArabic": "كتاب الْقَدَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14323,
                "hadithNumber": "6760",
                "englishNarrator": "It was narrated that Hammam bin Munnabbih said:",
                "hadithEnglish": "Abu Huraira رضی اللہ عنہ reported from Allah's Messenger (ﷺ) many a hadith and one amongst them is that he is reported to have said: An infant is born according to his (true) nature. It is his parents Who make him a Jew, a Christian, just as a she-camel gives birth to its young ones. Do you find any deficiency in their limbs? You cut their ears (i.e. after birth). They (the Companions of the Holy Prophet) said: What is your opinion about him who dies in infancy? Thereupon Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: It is Allah alone Who knows best what they would be doing.",
                "hadithUrdu": "یہ احادیث ہیں جو حضرت ابوہریرہ رضی اللہ عنہ نے ہمیں رسول اللہ صلی اللہ علیہ وسلم سے سنائیں ، پھر انہوں نے کئی احادیث بیان کیں ، ان میں سے ایک حدیث یہ ہے : اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جو ( بچہ ) پیدا ہوتا ہے ، وہ اسی فطرت پر پیدا ہوتا ہے ، پھر اس کے والدین اس کو یہودی اور نصرانی بنا دیتے ہیں جس طرح تم اونٹوں کے بچوں کو جنم دلواتے ہو ۔ کیا تم ان میں سے کسی کو کان کٹا ہوا پاتے ہو؟ یہاں تک کہ تم خود اس کا کان کاٹ دو \" لوگوں نے کہا : اللہ کے رسول! کیا آپ نے دیکھا کہ اگر وہ چھوٹا ہی فوت ہو جائے؟ فرمایا : \" اللہ ہی زیادہ جاننے والا ہے وہ ( چھوٹی عمر میں فوت ہونے والے بچے ) کیا عمل کرنے والے تھے ۔ \"",
                "urduNarrator": "ہم سے محمد بن رافع نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا, معمر نے ہمیں ہمام بن منبہ سے حدیث بیان کی ، کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ يُولَدُ يُولَدُ عَلَى هَذِهِ الْفِطْرَةِ فَأَبَوَاهُ يُهَوِّدَانِهِ وَيُنَصِّرَانِهِ كَمَا تَنْتِجُونَ الْإِبِلَ فَهَلْ تَجِدُونَ فِيهَا جَدْعَاءَ حَتَّى تَكُونُوا أَنْتُمْ تَجْدَعُونَهَا قَالُوا يَا رَسُولَ اللَّهِ أَفَرَأَيْتَ مَنْ يَمُوتُ صَغِيرًا قَالَ اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "47",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 147,
                    "chapterNumber": "47",
                    "chapterEnglish": "The Book of Destiny",
                    "chapterUrdu": "تقدیر کا بیان",
                    "chapterArabic": "كتاب الْقَدَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14324,
                "hadithNumber": "6761",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The mother of every person gives him birth according to his true nature. It is subsequently his parents who make him a Jew or a Christian or a Magian. Had his parents been Muslim he would have also remained a Muslim. Every person to whom his mother gives birth (has two aspects of his life) ; when his mother gives birth Satan strikes him but it was not the case with Mary and her son (Jesus Christ).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ہر انسان کو اس کی ماں فطرت پر جنم دیتی ہے اور اس کے ماں باپ بعد میں اس کو یہودی یا نصرانی یا مجوسی بنا دیتے ہیں ۔ اگر وہ دونوں ( صحیح ) مسلمان ہوں تو وہ مسلمان رہتا ہے اور ہر انسان کو جب اس کی ماں جنم دیتی ہے تو شیطان اس کے دونوں پہلوؤں میں ہاتھ سے مارتا ہے سوائے حضرت مریم علیہ السلام اور ان کے بیٹے کے ( انہیں اللہ نے اس سے محفوظ رکھا ۔ ) \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا کہ ہم سے عبدالعزیز نے بیان کیا، یعنی الدراوردی نے، العلا کے والد عبدالرحمٰن نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي الدَّرَاوَرْدِيَّ عَنْ الْعَلَاءِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كُلُّ إِنْسَانٍ تَلِدُهُ أُمُّهُ عَلَى الْفِطْرَةِ وَأَبَوَاهُ بَعْدُ يُهَوِّدَانِهِ وَيُنَصِّرَانِهِ وَيُمَجِّسَانِهِ فَإِنْ كَانَا مُسْلِمَيْنِ فَمُسْلِمٌ كُلُّ إِنْسَانٍ تَلِدُهُ أُمُّهُ يَلْكُزُهُ الشَّيْطَانُ فِي حِضْنَيْهِ إِلَّا مَرْيَمَ وَابْنَهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "47",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 147,
                    "chapterNumber": "47",
                    "chapterEnglish": "The Book of Destiny",
                    "chapterUrdu": "تقدیر کا بیان",
                    "chapterArabic": "كتاب الْقَدَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14325,
                "hadithNumber": "6762",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was asked about the children of the polytheists, whereupon he said: It is Allah Who knows best what they would be doing.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم سے مشرکین کی اولاد کے بارے میں سوال کیا گیا تو آپ نے فرمایا : \" اللہ ہی زیادہ جانتا ہے کہ ( بڑے ہو کر ) وہ کیا عمل کرنے والے تھے ۔ \"",
                "urduNarrator": "ہم سے ابو الطاہر نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا, ابن ابی ذئب اور یونس نے ابن شہاب سے روایت کی ، انہوں نے عطاء بن یزید سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الطَّاهِرِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي ابْنُ أَبِي ذِئْبٍ وَيُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ عَطَاءِ بْنِ يَزِيدَ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْ أَوْلَادِ الْمُشْرِكِينَ فَقَالَ اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "47",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 147,
                    "chapterNumber": "47",
                    "chapterEnglish": "The Book of Destiny",
                    "chapterUrdu": "تقدیر کا بیان",
                    "chapterArabic": "كتاب الْقَدَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14326,
                "hadithNumber": "6763",
                "englishNarrator": null,
                "hadithEnglish": "A similar hadith (as no. 6762) was narrated from Az-Zuhri with the chain of narrators of Yunus and Ibn Abi Dhi'b, except that in the Hadith of of Shu'aib nd Mu'qil it says: \"He was asked about the offspring of the idolaters.\"",
                "hadithUrdu": "ہم سے عبد بن حمید نے بیان کیا, معمر ، شعیب اور معقل بن عبیداللہ نے زہری سے یونس اور ابن ابی ذئب کی سند کے ساتھ ان دونوں کی حدیث کے مانند حدیث بیان کی ، مگر شعیب اور معقل کی حدیث میں ( مشرکین کی اولاد کی بجائے ) \" مشرکین کے چھوٹے بچوں \" کے الفاظ ہیں ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ ح و حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ بِهْرَامَ أَخْبَرَنَا أَبُو الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ ح و حَدَّثَنَا سَلَمَةُ بْنُ شَبِيبٍ حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ حَدَّثَنَا مَعْقِلٌ وَهُوَ ابْنُ عُبَيْدِ اللَّهِ كُلُّهُمْ عَنْ الزُّهْرِيِّ بِإِسْنَادِ يُونُسَ وَابْنِ أَبِي ذِئْبٍ مِثْلَ حَدِيثِهِمَا غَيْرَ أَنَّ فِي حَدِيثِ شُعَيْبٍ وَمَعْقِلٍ سُئِلَ عَنْ ذَرَارِيِّ الْمُشْرِكِينَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "47",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 147,
                    "chapterNumber": "47",
                    "chapterEnglish": "The Book of Destiny",
                    "chapterUrdu": "تقدیر کا بیان",
                    "chapterArabic": "كتاب الْقَدَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14327,
                "hadithNumber": "6764",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger (ﷺ) was asked about the children of the polytheists who die young. Thereupon Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: It is Allah Who knows what they would be doing.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم سے مشرکین کے بچوں کے بارے میں سوال کیا گیا ، ان میں سے جو چھوٹی عمر میں فوت ہو جائیں ( تو ان کا انجام کیا ہو گا؟ ) آپ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ تعالیٰ زیادہ جانتا ہے کہ وہ کیا عمل کرنے والے تھے ۔ \"",
                "urduNarrator": "ہم سے ابن ابی عمر نے بیان کیا، ہم سے سفیان نے ابو الزناد سے بیان کیا, اعرج نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَ سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَطْفَالِ الْمُشْرِكِينَ مَنْ يَمُوتُ مِنْهُمْ صَغِيرًا فَقَالَ اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "47",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 147,
                    "chapterNumber": "47",
                    "chapterEnglish": "The Book of Destiny",
                    "chapterUrdu": "تقدیر کا بیان",
                    "chapterArabic": "كتاب الْقَدَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14328,
                "hadithNumber": "6765",
                "englishNarrator": "Ibn Abbas رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was asked about the children of the polytheists, whereupon he said: It is Allah alone Who knows what they would be doing according to their creation.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم سے مشرکین کے بچوں کے متعلق سوال کیا گیا تو آپ نے فرمایا : \" اللہ تعالیٰ نے جب ان کو پیدا کیا تو وہ زیادہ جاننے والا ہے کہ وہ کیا عمل کرنے والے تھے ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا ہم سے ابو عونہ نے بیان کیا، ابو بشر کی سند سے, سعید بن جبیر نے حضرت ابن عباس رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو عَوَانَةَ عَنْ أَبِي بِشْرٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَ سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَطْفَالِ الْمُشْرِكِينَ قَالَ اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ إِذْ خَلَقَهُمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "47",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 147,
                    "chapterNumber": "47",
                    "chapterEnglish": "The Book of Destiny",
                    "chapterUrdu": "تقدیر کا بیان",
                    "chapterArabic": "كتاب الْقَدَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14329,
                "hadithNumber": "6766",
                "englishNarrator": "Ubayy bin Ka'b رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: The young man whom Khadir killed was a non-believer by his very nature and had he survived he would have involved his parents in defiance and unbelief.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جس لڑکے کو حضرت خضر علیہ السلام نے قتل کیا تھا وہ طبعا کافر بنایا گیا تھا ، اگر وہ زندہ رہتا تو زبردستی اپنے ماں باپ کو سرکشی اور کفر کی طرف لے جاتا ۔ \"",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ بن قعنب نے بیان کیا، کہا ہم سے معتمر بن سلیمان نے اپنے والد سے، رقبہ بن مسقلہ نے ابواسحاق کی سند سے, سعید بن جبیر نے حضرت ابن عباس رضی اللہ عنہ سے اور انہوں نے حضرت ابی بن کعب رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ عَنْ أَبِيهِ عَنْ رَقَبَةَ بْنِ مَسْقَلَةَ عَنْ أَبِي إِسْحَقَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ عَنْ أُبَيِّ بْنِ كَعْبٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الْغُلَامَ الَّذِي قَتَلَهُ الْخَضِرُ طُبِعَ كَافِرًا وَلَوْ عَاشَ لَأَرْهَقَ أَبَوَيْهِ طُغْيَانًا وَكُفْرًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "47",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 147,
                    "chapterNumber": "47",
                    "chapterEnglish": "The Book of Destiny",
                    "chapterUrdu": "تقدیر کا بیان",
                    "chapterArabic": "كتاب الْقَدَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14330,
                "hadithNumber": "6767",
                "englishNarrator": "A'isha رضی اللہ عنہا the mother of the believers, reported:",
                "hadithEnglish": "A child died and I said: There is happiness for this child who is a bird from amongst the birds of Paradise. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Don't you know that Allah created the Paradise and He created the Hell and He created the dwellers for this (Paradise) and the denizens for this (Hell)?",
                "hadithUrdu": "ایک بچہ فوت ہوا تو میں نے کہا : اس کے لیے خوش خبری ہو ، وہ تو جنت کی چڑیوں میں سے ایک چڑیا ہے ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کیا تم نہیں جانتی کہ اللہ تعالیٰ نے جنت کو پیدا کیا اور دوزخ کو پیدا کیا اور اس کے لیے بھی اس میں جانے والے بنائے اور اُس کے لیے بھی اس میں رہنے والے بنائے؟ \"",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، ہم سے جریر نے علاء بن المسیب کی سند سے بیان کیا, فضیل بن عمرو نے عائشہ بنت طلحہ سے اور انہوں نے ام المومنین حضرت عائشہ صدیقہ رضی اللہ عنہا سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ عَنْ الْعَلَاءِ بْنِ الْمُسَيَّبِ عَنْ فُضَيْلِ بْنِ عَمْرٍو عَنْ عَائِشَةَ بِنْتِ طَلْحَةَ عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ قَالَتْ تُوُفِّيَ صَبِيٌّ فَقُلْتُ طُوبَى لَهُ عُصْفُورٌ مِنْ عَصَافِيرِ الْجَنَّةِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوَ لَا تَدْرِينَ أَنَّ اللَّهَ خَلَقَ الْجَنَّةَ وَخَلَقَ النَّارَ فَخَلَقَ لِهَذِهِ أَهْلًا وَلِهَذِهِ أَهْلًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "47",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 147,
                    "chapterNumber": "47",
                    "chapterEnglish": "The Book of Destiny",
                    "chapterUrdu": "تقدیر کا بیان",
                    "chapterArabic": "كتاب الْقَدَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14331,
                "hadithNumber": "6768",
                "englishNarrator": "A'isha رضی اللہ عنہا the mother of the believers, said:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was called to lead the funeral prayer of a child of the Ansar. I said: Allah's Messenger, there is happiness for this child who is a bird from the birds of Paradise for it committed no sin nor has he reached the age when one can commit sin. He said: 'A'isha رضی اللہ عنہا per adventure, it may be otherwise, because God created for Paradise those who are fit for it while they were yet in their father's loins and created for Hell those who are to go to Hell. He created them for Hell while they were yet in their father's loins.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کو انصار کے ایک بچے کے جنازے کے لیے بلایا گیا ، میں نے کہا : اللہ کے رسول! اس کے لیے خوش خبری ہو یہ جنت کی چڑیوں میں سے ایک چڑیا ہے ، اس نے کوئی گناہ کیا ، نہ گناہ کرنے کی عمر پائی ، آپ صلی اللہ علیہ وسلم نے فرمایا : \" یا اس کے علاوہ کچھ اور؟ عائشہ! اللہ تعالیٰ نے جنت میں رہنے والے لوگ پیدا فرمائے ، انہیں اس وقت جنت کے لیے تخلیق کیا جب وہ اپنے باپوں کی پشتوں میں تھے اور دوزخ کے لیے بھی رہنے والے بنائے ، انہیں اس وقت دوزخ کے لیے تخلیق کیا جب وہ اپنے باپوں کی پشتوں میں تھے ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, وکیع نے طلحہ بن یحییٰ سے ، انہوں نے اپنی پھوپھی عائشہ بنت طلحہ سے اور انہوں نے ام المومنین حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ طَلْحَةَ بْنِ يَحْيَى عَنْ عَمَّتِهِ عَائِشَةَ بِنْتِ طَلْحَةَ عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ قَالَتْ دُعِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى جَنَازَةِ صَبِيٍّ مِنْ الْأَنْصَارِ فَقُلْتُ يَا رَسُولَ اللَّهِ طُوبَى لِهَذَا عُصْفُورٌ مِنْ عَصَافِيرِ الْجَنَّةِ لَمْ يَعْمَلْ السُّوءَ وَلَمْ يُدْرِكْهُ قَالَ أَوَ غَيْرَ ذَلِكَ يَا عَائِشَةُ إِنَّ اللَّهَ خَلَقَ لِلْجَنَّةِ أَهْلًا خَلَقَهُمْ لَهَا وَهُمْ فِي أَصْلَابِ آبَائِهِمْ وَخَلَقَ لِلنَّارِ أَهْلًا خَلَقَهُمْ لَهَا وَهُمْ فِي أَصْلَابِ آبَائِهِمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "47",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 147,
                    "chapterNumber": "47",
                    "chapterEnglish": "The Book of Destiny",
                    "chapterUrdu": "تقدیر کا بیان",
                    "chapterArabic": "كتاب الْقَدَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14332,
                "hadithNumber": "6769",
                "englishNarrator": null,
                "hadithEnglish": "A similar Hadith (as no. 6768) was narrated from Talha bin Yahya with this chain of Waki'.",
                "hadithUrdu": "ہم سے محمد بن صباح نے بیان کیا، ہم سے اسماعیل بن زکریا نے بیان کیا، ان سے طلحہ بن یحییٰ نے بیان کیا، مجھ سے سلیمان بن معبد نے بیان کیا، ان سے حسین بن عن مجھ سے حفص  اور اسحاق بن منصور نے بیان کیا، ان دونوں نے سفیان الثوری کی سند سے، طلحہ بن یحییٰ کی سند سے وکیع کی سند سے۔ جیسا کہ اس کی حدیث ہے۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ حَدَّثَنَا إِسْمَعِيلُ بْنُ زَكَرِيَّاءَ عَنْ طَلْحَةَ بْنِ يَحْيَى ح و حَدَّثَنِي سُلَيْمَانُ بْنُ مَعْبَدٍ حَدَّثَنَا الْحُسَيْنُ بْنُ حَفْصٍ ح و حَدَّثَنِي إِسْحَقُ بْنُ مَنْصُورٍ أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ كِلَاهُمَا عَنْ سُفْيَانَ الثَّوْرِيِّ عَنْ طَلْحَةَ بْنِ يَحْيَى بِإِسْنَادِ وَكِيعٍ نَحْوَ حَدِيثِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "47",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 147,
                    "chapterNumber": "47",
                    "chapterEnglish": "The Book of Destiny",
                    "chapterUrdu": "تقدیر کا بیان",
                    "chapterArabic": "كتاب الْقَدَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14333,
                "hadithNumber": "6770",
                "englishNarrator": "Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Umm Habiba رضی اللہ عنہا , the wife of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), said: O Allah, enable me to derive benefit from my husband, the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), and from my father Abu Sufyan رضی اللہ عنہ and from my brother Mu'awiya رضی اللہ عنہ . Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: You have asked from Allah about durations of life already set, and the length of days already allotted and the sustenances the share of which has been fixed. Allah would not do anything earlier before its due time, or He would not delay anything beyond its due time. And if you were to ask Allah to provide you refuge from the torment of the HellFire, or from the torment of the grave, it would have good in store for you and better for you also. He (the narrator) further said: Mention was made before him about monkeys, and Mis'ar (one of the narrators) said: I think that (the narrator) also (made a mention) of the swine, which had suffered metamorphosis. Thereupon he (the Holy Prophet) said: Verily, Allah did not cause the race of those which suffered metamorphosis to grow or they were not survived by young ones. Monkeys and swine had been in existence even before (the metamorphosis of the human beings).",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم کی اہلیہ حضرت ام حبیبہ رضی اللہ عنہا نے یہ دعا کی : اے اللہ! مجھے اپنے خاوند رسول اللہ صلی اللہ علیہ وسلم اپنے والد حضرت ابوسفیان رضی اللہ عنہ اور اپنے بھائی حضرت معاویہ رضی اللہ عنہ ( کی زندگیوں ) سے مستفید فرما! ( حضرت عبداللہ رضی اللہ عنہ نے ) کہا : تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" تم نے عمروں کی ایسی مدتوں کا ، جو مقرر کر دی گئی ہیں اور ان دنوں کا جو گنے جا چکے ہیں اور ایسے رزقوں کا جو بانٹے جا چکے ہیں ، سوال کیا ہے ۔ اگر تم اللہ سے یہ مانگتی کہ تمہیں آگ میں دیے جانے والے یا قبر میں دیے جانے والے عذاب سے پناہ عطا فرما دے تو یہ زیادہ اچھا اور زیادہ افضل ہوتا ۔ \"\" ( عبداللہ بن مسعود رضی اللہ عنہ نے ) کہا : آپ کے سامنے بندروں کے بارے میں بات چیت ہوئی ، مسعر نے کہا : میرا خیال ہے کہ انہوں ( حضرت عبداللہ رضی اللہ عنہ ) نے کہا : خنزیروں کا بھی ( ذکر کیا گیا کہ وہ ) مسخ ہو کر بنے ہیں تو آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" اللہ تعالیٰ نے مسخ ہونے والوں کی نہ نسل بنائی ہے نہ اولاد ، بندر اور خنزیر اس ( مسخ ہونے کے واقعے ) سے پہلے بھی ہوتے تھے ( جو موجودہ ہیں وہ انہی کی نسلیں ہیں ۔ )",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، اور انہوں نے کہا: وکیع نے ہمیں معمر سے حدیث بیان کی ، انہوں نے علقمہ بن مرثد سے ، انہوں نے مغیرہ بن عبداللہ یشکری سے ، انہوں نے معرور بن سوید سے اور انہوں نے حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ وَاللَّفْظُ لِأَبِي بَكْرٍ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ مِسْعَرٍ عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ عَنْ الْمُغِيرَةِ بْنِ عَبْدِ اللَّهِ الْيَشْكُرِيِّ عَنْ الْمَعْرُورِ بْنِ سُوَيْدٍ عَنْ عَبْدِ اللَّهِ قَالَ قَالَتْ أُمُّ حَبِيبَةَ زَوْجُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُمَّ أَمْتِعْنِي بِزَوْجِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبِأَبِي أَبِي سُفْيَانَ وَبِأَخِي مُعَاوِيَةَ قَالَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ سَأَلْتِ اللَّهَ لِآجَالٍ مَضْرُوبَةٍ وَأَيَّامٍ مَعْدُودَةٍ وَأَرْزَاقٍ مَقْسُومَةٍ لَنْ يُعَجِّلَ شَيْئًا قَبْلَ حِلِّهِ أَوْ يُؤَخِّرَ شَيْئًا عَنْ حِلِّهِ وَلَوْ كُنْتِ سَأَلْتِ اللَّهَ أَنْ يُعِيذَكِ مِنْ عَذَابٍ فِي النَّارِ أَوْ عَذَابٍ فِي الْقَبْرِ كَانَ خَيْرًا وَأَفْضَلَ قَالَ وَذُكِرَتْ عِنْدَهُ الْقِرَدَةُ قَالَ مِسْعَرٌ وَأُرَاهُ قَالَ وَالْخَنَازِيرُ مِنْ مَسْخٍ فَقَالَ إِنَّ اللَّهَ لَمْ يَجْعَلْ لِمَسْخٍ نَسْلًا وَلَا عَقِبًا وَقَدْ كَانَتْ الْقِرَدَةُ وَالْخَنَازِيرُ قَبْلَ ذَلِكَ.",
                "headingArabic": "بَيَانِ أَنَّ الْآجَالَ وَالْأَرْزَاقَ وَغَيْرَهَا لَا تَزِيدُ وَلَا تَنْقُصُ عَمَّا سَبَقَ بِهِ الْقَدَرُ",
                "headingUrdu": "عمر، رزق وغیرہ جو پہلے سے طے شدہ ہے اس سے نہ بڑھیں اور نہ گھٹائیں",
                "headingEnglish": "Lifespans, Provisions, Etc. Do Not Increase Or Decrease From What Has Already Been Decreed",
                "chapterId": "47",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 147,
                    "chapterNumber": "47",
                    "chapterEnglish": "The Book of Destiny",
                    "chapterUrdu": "تقدیر کا بیان",
                    "chapterArabic": "كتاب الْقَدَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14334,
                "hadithNumber": "6771",
                "englishNarrator": "It was narrated from both Ibn Bishr and Waki':",
                "hadithEnglish": "From punishment in the fire and from punishment in the grave.",
                "hadithUrdu": "جہنم کے عذاب اور عذاب قبر کو ایک ساتھ بیان کیا گیا ہے (اور ان کے درمیان کوئی تعامل نہیں ہے)۔",
                "urduNarrator": "ہم سے ابو کریب نے بیان کیا, ابن بشر نے مسعر سے اسی سند کے ساتھ خبر دی ، مگر ابن بشر اور وکیع دونوں سے ان کی ( روایت کردہ ) حدیث میں یہ الفاظ منقول ہیں",
                "hadithArabic": "حَدَّثَنَاه أَبُو كُرَيْبٍ حَدَّثَنَا ابْنُ بِشْرٍ عَنْ مِسْعَرٍ بِهَذَا الْإِسْنَادِ غَيْرَ أَنَّ فِي حَدِيثِهِ عَنْ ابْنِ بِشْرٍ وَوَكِيعٍ جَمِيعًا مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "47",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 147,
                    "chapterNumber": "47",
                    "chapterEnglish": "The Book of Destiny",
                    "chapterUrdu": "تقدیر کا بیان",
                    "chapterArabic": "كتاب الْقَدَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14335,
                "hadithNumber": "6772",
                "englishNarrator": "Ibn Mas'dd رضی اللہ عنہ reported:",
                "hadithEnglish": "Umm Habiba رضی اللہ عنہا said: O Allah, enable me to derive benefit from my husband, Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), and from my father Abu Sufyan, and from my brother Mu'awiya. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said to her: Verily, you have asked Allah about the durations of life already set, and the steps which you would take, and the sustenances the share of which is fixed. Nothing would take place earlier than its due time, and nothing would be deferred beyond that when it is due. So, if you were to ask Allah about your safety from the torment of Hell-Fire and from the torment of the grave, it would have been better for you. A person said: Allah's Messenger, what about those apes and swine which suffered metamorphosis? Thereupon Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Verily, Allah, the Exalted and Glorious, did not destroy a people or did not torment a people, and let their race grow. Apes and swine had been even before that (when the deniers of truth were tormented and suffered metamorphosis).",
                "hadithUrdu": "حضرت ام حبیبہ رضی اللہ عنہا نے ( دعا کرتے ہوئے ) کہا : اے اللہ! مجھے میرے خاوند رسول اللہ صلی اللہ علیہ وسلم ، میرے والد ابوسفیان اور میرے بھائی ( کی درازی عمر ) سے مستفید فرما! تو رسول اللہ صلی اللہ علیہ وسلم نے ان سے فرمایا : \"\" تم نے اللہ تعالیٰ سے ان مدتوں کا سوال کیا ہے جو مقرر کی جا چکیں اور قدموں کے ان نشانوں کا جن پر قدم رکھے جا چکے اور ایسے رزقوں کو جو تقسیم کیے جا چکے ۔ نہ ان میں سے کوئی چیز اپنا وقت آنے سے پہلے آ سکتی ہے اور نہ آنے کے بعد مؤخر ہو سکتی ہے ۔ اگر تم اللہ تعالیٰ سے یہ مانگتی کہ وہ تمہیں جہنم میں دیے جانے والے عذاب اور قبر میں دیے جانے والے عذاب سے بچا لے تو تمہارے لیے بہتر ہوتا ۔ \"\" ( عبداللہ بن مسعود رضی اللہ عنہ نے ) کہا : ایک آدمی نے پوچھا : اللہ کے رسول! یہ بندر اور خنزیر کیا انہی میں سے ہیں جو مسخ ہو کر بنے تھے؟ تو نبی صلی اللہ علیہ وسلم نے فرمایا : \"\" اللہ تعالیٰ نے کسی قوم کو ہلاک نہیں کیا یا ( فرمایا : ) کسی قوم کو عذاب نہیں دیا کہ پھر ان ( لوگوں ) کی نسل بنائے ( ان کے بچے پیدا کر کے انہیں آگے چلائے ۔ ) اور بلاشبہ بندر اور خنزیر پہلے بھی موجود تھے ۔ \"\" ( آگے انہی کی نسلیں چلی ہیں ۔ )",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم الحنظَلی اور حجاج بن الشاعر نے بیان کیا، اور یہ قول حجاج کا ہے، اسحاق نے کہا کہ ہمیں حجاج نے خبر دی, عبدالرزاق نے کہا : ہمیں ثوری نے علقمہ بن مرثد سے خبر دی ، انہوں نے مغیرہ بن عبداللہ یشکری سے ، انہوں نے معرور بن سوید سے اور انہوں نے حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ وَحَجَّاجُ بْنُ الشَّاعِرِ وَاللَّفْظُ لِحَجَّاجٍ قَالَ إِسْحَقُ أَخْبَرَنَا و قَالَ حَجَّاجٌ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا الثَّوْرِيُّ عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ عَنْ الْمُغِيرَةِ بْنِ عَبْدِ اللَّهِ الْيَشْكُرِيِّ عَنْ مَعْرُورِ بْنِ سُوَيْدٍ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ قَالَتْ أُمُّ حَبِيبَةَ اللَّهُمَّ مَتِّعْنِي بِزَوْجِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبِأَبِي أَبِي سُفْيَانَ وَبِأَخِي مُعَاوِيَةَ فَقَالَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّكِ سَأَلْتِ اللَّهَ لِآجَالٍ مَضْرُوبَةٍ وَآثَارٍ مَوْطُوءَةٍ وَأَرْزَاقٍ مَقْسُومَةٍ لَا يُعَجِّلُ شَيْئًا مِنْهَا قَبْلَ حِلِّهِ وَلَا يُؤَخِّرُ مِنْهَا شَيْئًا بَعْدَ حِلِّهِ وَلَوْ سَأَلْتِ اللَّهَ أَنْ يُعَافِيَكِ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ لَكَانَ خَيْرًا لَكِ قَالَ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ الْقِرَدَةُ وَالْخَنَازِيرُ هِيَ مِمَّا مُسِخَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ عَزَّ وَجَلَّ لَمْ يُهْلِكْ قَوْمًا أَوْ يُعَذِّبْ قَوْمًا فَيَجْعَلَ لَهُمْ نَسْلًا وَإِنَّ الْقِرَدَةَ وَالْخَنَازِيرَ كَانُوا قَبْلَ ذَلِكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "47",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 147,
                    "chapterNumber": "47",
                    "chapterEnglish": "The Book of Destiny",
                    "chapterUrdu": "تقدیر کا بیان",
                    "chapterArabic": "كتاب الْقَدَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14336,
                "hadithNumber": "6773",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Sufyan through another chain of transmitters but with a slight variation of wording.",
                "hadithUrdu": "ابوداود سلیمان بن معبد نے کہا : ہمیں حسین بن حفص نے حدیث بیان کی ، انہوں نے کہا : ہمیں سفیان نے اسی سند کے ساتھ حدیث بیان کی ، مگر انہوں نے کہا : \"\" اور قدموں کے ایسے نشان جن تک قدم پہنچ چکے ہیں ۔ \"\" ابن معبد نے کہا : ان ( اساتذہ ) میں سے بعض نے ( آپ صلی اللہ علیہ وسلم کے فرمان ) : \"\" اس کے حل ہونے سے پہلے ۔ \"\" یعنی اس کے اترنے سے پہلے ( وضاحتی الفاظ کے ساتھ ) روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنِيهِ أَبُو دَاوُدَ سُلَيْمَانُ بْنُ مَعْبَدٍ حَدَّثَنَا الْحُسَيْنُ بْنُ حَفْصٍ حَدَّثَنَا سُفْيَانُ بِهَذَا الْإِسْنَادِ غَيْرَ أَنَّهُ قَالَ وَآثَارٍ مَبْلُوغَةٍ قَالَ ابْنُ مَعْبَدٍ وَرَوَى بَعْضُهُمْ قَبْلَ حِلِّهِ أَيْ نُزُولِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "47",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 147,
                    "chapterNumber": "47",
                    "chapterEnglish": "The Book of Destiny",
                    "chapterUrdu": "تقدیر کا بیان",
                    "chapterArabic": "كتاب الْقَدَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14337,
                "hadithNumber": "6774",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: A strong believer is better and is more lovable to Allah than a weak believer, and there is good in everyone, (but) cherish that which gives you benefit (in the Hereafter) and seek help from Allah and do not lose heart, and if anything (in the form of trouble) comes to you, don't say: If I had not done that, it would not have happened so and so, but say: Allah did that what He had ordained to do and your if opens the (gate) for the Satan.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" طاقت ور مومن اللہ کے نزدیک کمزور مومن کی نسبت بہتر اور زیادہ محبوب ہے ، جبکہ خیر دونوں میں ( موجود ) ہے ۔ جس چیز سے تمہیں ( حقیقی ) نفع پہنچے اس میں حرص کرو اور اللہ سے مدد مانگو اور کمزور نہ پڑو ( مایوس ہو کر نہ بیٹھ ) جاؤ ، اگر تمہیں کوئی ( نقصان ) پہنچے تو یہ نہ کہو : کاش! میں ( اس طرح ) کرتا تو ایسا ایسا ہوتا ، بلکہ یہ کہو : ( یہ ) اللہ کی تقدیر ہے ، وہ جو چاہتا ہے کرتا ہے ، اس لیے کہ ( حشرت کرتے ہوئے ) کاش ( کہنا ) شیطان کے عمل ( کے دروازے ) کو کھول دیتا ہے ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابن نمیر نے بیان کیا، کہا کہ ہم سے عبداللہ بن ادریس نے ربیعہ بن عثمان سے اور محمد بن یحییٰ کی سند سے بیان کیا۔ ابن حبان، العرج کی سند پر, حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَابْنُ نُمَيْرٍ قَالَا حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ رَبِيعَةَ بْنِ عُثْمَانَ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُؤْمِنُ الْقَوِيُّ خَيْرٌ وَأَحَبُّ إِلَى اللَّهِ مِنْ الْمُؤْمِنِ الضَّعِيفِ وَفِي كُلٍّ خَيْرٌ احْرِصْ عَلَى مَا يَنْفَعُكَ وَاسْتَعِنْ بِاللَّهِ وَلَا تَعْجَزْ وَإِنْ أَصَابَكَ شَيْءٌ فَلَا تَقُلْ لَوْ أَنِّي فَعَلْتُ كَانَ كَذَا وَكَذَا وَلَكِنْ قُلْ قَدَرُ اللَّهِ وَمَا شَاءَ فَعَلَ فَإِنَّ لَوْ تَفْتَحُ عَمَلَ الشَّيْطَانِ.",
                "headingArabic": "فِي الْأَمْرِ بِالْقُوَّةِ وَتَرْكِ الْعَجْزِ وَالِاسْتِعَانَةِ بِاللَّهِ وَتَفْوِيضِ الْمَقَادِيرِ لِلَّهِ",
                "headingUrdu": "حکم الٰہی پر ایمان اور اس کے آگے سر تسلیم خم کرنا",
                "headingEnglish": "Belief In The Divine Decree And Submission To It",
                "chapterId": "47",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 147,
                    "chapterNumber": "47",
                    "chapterEnglish": "The Book of Destiny",
                    "chapterUrdu": "تقدیر کا بیان",
                    "chapterArabic": "كتاب الْقَدَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14338,
                "hadithNumber": "6775",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) recited (these verses of the Qur'an): He it is Who revealed to thee (Muhammad) the Book (the Qur'an) wherein there are clear revelations-these are the substance of the Book and others are allegorical (verses). And as for those who have a yearning for error they go after the allegorical verses seeking (to cause) dissension, by seeking to explain them. And none knows their implications but Allah, and those who are sound in knowledge say: We affirm our faith in everything which is from our Lord. It is only the persons of understanding who really heed (iii. 6). 'A'isha رضی اللہ عنہا (further) reported that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said (in connection with these verses): When you see such verses, avoid them, for it is they whom Allah has pointed out (in the mentioned verses).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ( یہ آیات ) تلاوت فرمائیں : \" وہی ہے جس نے آپ پر کتاب نازل فرمائی ، اس میں سے محکم ( معنی میں واضح ) آیتیں ہیں ، وہی اصل کتاب ہیں اور دوسری متشابہ آیات ہیں ، پھر وہ لوگ جن کے دلوں میں کجی ہے ، وہ فتنے کی تلاش میں ان آیتوں کے پیچھے پڑے رہتے ہیں جو ان ( آیات قرآنی ) میں سے متشابہ ہیں ۔ ان ( متشابہ آیات ) کا حقیقی معنی اللہ اور ان لوگوں کے علاوہ اور کوئی نہیں جانتا جو علم میں راسخ ہیں ۔ وہ ( یہی ) کہتے ہیں : ہم ان ( آیات ) پر ایمان لائے ، سب ( آیتیں ) ہمارے رب کی طرف سے ہیں اور دانائی رکھنے والوں کے سوا کوئی ( ان سے ) نصیحت حاصل نہیں کرتا ۔ \" ( حضرت عائشہ رضی اللہ عنہا نے ) کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم ایسے لوگوں کو دیکھو جو قرآن میں سے متشابہ ( آیات ) کے پیچھے پڑتے ہیں ، تو یہی لوگ ہیں جن کا اللہ نے ( سابقہ آیات میں ) ذکر کیا ہے ، لہذا ان سے بچ کر رہو ۔ \"",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ بن قعنب نے بیان کیا، کہا ہم سے یزید بن ابراہیم التستری نے بیان کیا، انہوں نے عبداللہ بن ابی ملیکہ کی سند سے, قاسم بن محمد نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ حَدَّثَنَا يَزِيدُ بْنُ إِبْرَاهِيمَ التُّسْتَرِيُّ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَائِشَةَ قَالَتْ تَلَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هُوَ الَّذِي أَنْزَلَ عَلَيْكَ الْكِتَابَ مِنْهُ آيَاتٌ مُحْكَمَاتٌ هُنَّ أُمُّ الْكِتَابِ وَأُخَرُ مُتَشَابِهَاتٌ فَأَمَّا الَّذِينَ فِي قُلُوبِهِمْ زَيْغٌ فَيَتَّبِعُونَ مَا تَشَابَهَ مِنْهُ ابْتِغَاءَ الْفِتْنَةِ وَابْتِغَاءَ تَأْوِيلِهِ وَمَا يَعْلَمُ تَأْوِيلَهُ إِلَّا اللَّهُ وَالرَّاسِخُونَ فِي الْعِلْمِ يَقُولُونَ آمَنَّا بِهِ كُلٌّ مِنْ عِنْدِ رَبِّنَا وَمَا يَذَّكَّرُ إِلَّا أُولُو الْأَلْبَابِ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا رَأَيْتُمْ الَّذِينَ يَتَّبِعُونَ مَا تَشَابَهَ مِنْهُ فَأُولَئِكَ الَّذِينَ سَمَّى اللَّهُ فَاحْذَرُوهُمْ.",
                "headingArabic": "النَّهْيِ عَنْ اتِّبَاعِ مُتَشَابِهِ الْقُرْآنِ وَالتَّحْذِيرِ مِنْ مُتَّبِعِيهِ وَالنَّهْيِ عَنْ الِاخْتِلَافِ فِي الْقُرْآنِ",
                "headingUrdu": "قرآن کی ان آیات کو تلاش کرنے کے خلاف جن کے معانی فیصلہ کن نہیں ہیں کی ممانعت، اور تنبیہ؛ قرآن کے بارے میں بحث کرنے کی ممانعت",
                "headingEnglish": "The Prohibition Of, And Warning Against Seeking Out Verses Of The Quran Whose Meanings Are Not Decisive; The Prohibition Of Arguing About The Qur'an",
                "chapterId": "48",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 148,
                    "chapterNumber": "48",
                    "chapterEnglish": "The Book of Knowledge",
                    "chapterUrdu": "علم کا بیان",
                    "chapterArabic": "كتاب الْعِلْمِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 14026,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=561",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=559",
                "label": "559",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=560",
                "label": "560",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=561",
                "label": "561",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=562",
                "label": "562",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=563",
                "label": "563",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=564",
                "label": "564",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=565",
                "label": "565",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=563",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=563",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=561",
        "to": 14050,
        "total": 40465
    }
}