{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 579,
        "data": [
            {
                "id": 14739,
                "hadithNumber": "7178",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Anas رضی اللہ عنہ through another chain of transmitters.",
                "hadithUrdu": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے عبد الصمد بن عبد الوارث نے بیان کیا, ابان بن یزید عطار نے ہمیں حدیث بیان کی ، کہا : ہمیں قتادہ نے حضرت انس رضی اللہ عنہ سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے شیبان کی حدیث کے ہم معنی روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ حَدَّثَنَا أَبَانُ بْنُ يَزِيدَ الْعَطَّارِ حَدَّثَنَا قَتَادَةُ عَنْ أَنَسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَى حَدِيثِ شَيْبَانَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14740,
                "hadithNumber": "7179",
                "englishNarrator": "Abdul-Wahhab bin Ata' reported:",
                "hadithEnglish": "In connection with the words of Allah, the Exalted and the Glorious: We would say to Hell on the Day of Ressurection: Have you been completely filled up? and it would say: Is there anything -more? And he stated on the authority of Anas bin Malik رضی اللہ عنہ that Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: (The sinners) would be thrown therein and it would continue to say: Is there anything more, until Allah, the Exalted and Glorious, would keep His foot there- in and some of its part would draw close to the other and it would say: Enough, enough, by Thy Honour and by Thy Dignity, and there would be enough space in Paradise until Allah would create a new creation and He would make them accommodate that spare place in Paradise.",
                "hadithUrdu": "اس ( اللہ ) عزوجل کے اس فرمان؛ \" جس دن ہم جہنم سے کہیں کے کیا تو بھر گئی اور وہ کہے گی : کیا اور زیادہ ہے؟ \" کے بارے میں حدیث بیان کی ، انھوں نے ہمیں سعید سے خبر دی ، انھوں نے قتادہ سے ، انھوں نے حضرت انس بن مالک رضی اللہ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی کہ آپ صلی اللہ علیہ وسلم نے فرمایا \" جہنم میں مسلسل ( لوگوں کو ) ڈالا جاتا رہے گا اور ہو کہتی رہے گی : کیا اور ہے؟یہاں تک کہ رب العزت اس میں اپنا پاؤں رکھ دے گا ، تو اس کا بعض بعض کی طرف سمٹ جائے گا اور وہ کہے گی : تیری عزت اور تیرے کرم کی قسم! بس بس اور جنت میں مسلسل گنجائش رہے گی یہاں تک کہ اللہ تعالیٰ اس کے لیے ایک خلقت پیدا کردے گا اور انھیں جنت کی بچی ہوئی جگہ میں بسا دے گا ۔ \"",
                "urduNarrator": "ہم سے محمد بن عبداللہ الرازی نے بیان کیا, عبدالوہاب بن عطا نے ہمیں",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرُّزِّيُّ حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ عَطَاءٍ فِي قَوْلِهِ عَزَّ وَجَلَّ يَوْمَ نَقُولُ لِجَهَنَّمَ هَلْ امْتَلَأْتِ وَتَقُولُ هَلْ مِنْ مَزِيدٍ فَأَخْبَرَنَا عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ لَا تَزَالُ جَهَنَّمُ يُلْقَى فِيهَا وَتَقُولُ هَلْ مِنْ مَزِيدٍ حَتَّى يَضَعَ رَبُّ الْعِزَّةِ فِيهَا قَدَمَهُ فَيَنْزَوِي بَعْضُهَا إِلَى بَعْضٍ وَتَقُولُ قَطْ قَطْ بِعِزَّتِكَ وَكَرَمِكَ وَلَا يَزَالُ فِي الْجَنَّةِ فَضْلٌ حَتَّى يُنْشِئَ اللَّهُ لَهَا خَلْقًا فَيُسْكِنَهُمْ فَضْلَ الْجَنَّةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14741,
                "hadithNumber": "7180",
                "englishNarrator": "Anas رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: There would be left some space in Paradise as Allah would like that to be left. Then Allah would create another creation as He would like.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا : \" جنت میں سے جس حصے کے بارے میں اللہ تعالیٰ چاہے گا کہ باقی بچ جائے وہ باقی بچ جائے گا ، پھر اللہ تعالیٰ اس کے لیے ، جہاں سے چاہے گا ، مخلوق پیدا کردے گا ۔ \"",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے عفان نے بیان کیا، ہم سے حماد نے بیان کیا، یعنی ابن سلمہ نے, ثابت نے کہا : میں نے حضرت انس رضی اللہ عنہ کو کہتے ہوئے سنا کہ",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ سَلَمَةَ أَخْبَرَنَا ثَابِتٌ قَالَ سَمِعْتُ أَنَسًا يَقُولُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَبْقَى مِنْ الْجَنَّةِ مَا شَاءَ اللَّهُ أَنْ يَبْقَى ثُمَّ يُنْشِئُ اللَّهُ تَعَالَى لَهَا خَلْقًا مِمَّا يَشَاءُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14742,
                "hadithNumber": "7181",
                "englishNarrator": "Abu Sa'id رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Death would be brought on the Day of Resurrection. in the form of a white-coloured ram. Abu Kuraib made this addition: Then it would be made to stand between the Paradise and the Hell. So far as the rest of the hadith is concerned there is perfect agreement (between the two narrators) and it would be said to the inmates of Paradise: Do you recognise this? They would raise up their necks and look towards it and say: Yes, ' it is death. Then it would be said to the inmates of Hell-Fire.. Do you recognise this? And they would raise up their necks and look and say: Yes, it is death. Then command would be given for slaughtering that and then it would be said: O inmates of Paradise,, there is an everlasting life for you and no death. And then (addressing) to the inmates of the Hell-Fire, it would be said: 0 inmates of Hell-Fire, there is an everlasting living for you and no death. Allah's Messenger (may peace be [email protected] him) then recited this verse pointing with his hand to this (material) world: Warn them, this Day of dismay, and when their affairs would be decided and they would be un- mindful and they believe not (xix. 39).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" قیامت کے دن موت کو اس طرح لایاجائے گا جیسے وہ سیاہ وسفید مینڈھا ہو ۔ ابو کریب نے مزید یہ کہا ۔ چنانچہ اسے جنت اور جہنم کے درمیان میں کھڑا کردیا جائے گا ۔ باقی ماندہ حدیث ( کے الفاظ ) میں دونوں متفق ہیں ۔ تو ( اعلان کرنے والا پکار کر ) کہے گا : اے جنت والو! کیا اسے پہچانتے ہو؟تو وہ جھانکیں گے ، دیکھیں گے اور کہیں گے : ہاں ۔ یہ موت ہے ۔ فرمایا : پھر کہا جائے گا : اے جہنم والو! کیا اسے پہچانتے ہو؟تو وہ جھانکیں گے ، دیکھیں گے اور کہیں گے ، ہاں ، یہ موت ہے ۔ فرمایا : پھر اس کے بارے میں حکم دیا جائے گا اور اسے ذبح کردیا جائے گا ۔ فرمایا : پھر کہاجائے گا : اے جنت والو! ( اب ) دوام ہی دوام ہے موت نہیں ہےاور اے جہنم والو! ( اب ) دوام ہی دوام ہے ، موت نہیں ہے ۔ \" کہا : پھر رسول اللہ صلی اللہ علیہ وسلم نے ( یہ آیت ) پڑھی : \" ان کو حسرت کے دن سے ڈرائیے جب معاملہ نپٹا دیا جائے گا اور وہ سراسر غفلت میں ہیں اور وہ ایمان نہیں لاتے ۔ \" اور آپ نے اپنے ہاتھ سے دنیا کی طرف اشارہ فرمایا ۔",
                "urduNarrator": "ابو بکر بن ابی شیبہ اور ابو کریب نے ہمیں حدیث بیان کی ۔ دونوں کے الفاظ ملتے جلتے ہیں ۔ دونوں نے کہا : ہمیں ابو معاویہ نے اعمش سے حدیث بیان کی ۔ انھوں نے ابوصالح سے اور انھوں نے حضرت ابوسعید خدری رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ وَتَقَارَبَا فِي اللَّفْظِ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي سَعِيدٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُجَاءُ بِالْمَوْتِ يَوْمَ الْقِيَامَةِ كَأَنَّهُ كَبْشٌ أَمْلَحُ زَادَ أَبُو كُرَيْبٍ فَيُوقَفُ بَيْنَ الْجَنَّةِ وَالنَّارِ وَاتَّفَقَا فِي بَاقِي الْحَدِيثِ فَيُقَالُ يَا أَهْلَ الْجَنَّةِ هَلْ تَعْرِفُونَ هَذَا فَيَشْرَئِبُّونَ وَيَنْظُرُونَ وَيَقُولُونَ نَعَمْ هَذَا الْمَوْتُ قَالَ وَيُقَالُ يَا أَهْلَ النَّارِ هَلْ تَعْرِفُونَ هَذَا قَالَ فَيَشْرَئِبُّونَ وَيَنْظُرُونَ وَيَقُولُونَ نَعَمْ هَذَا الْمَوْتُ قَالَ فَيُؤْمَرُ بِهِ فَيُذْبَحُ قَالَ ثُمَّ يُقَالُ يَا أَهْلَ الْجَنَّةِ خُلُودٌ فَلَا مَوْتَ وَيَا أَهْلَ النَّارِ خُلُودٌ فَلَا مَوْتَ قَالَ ثُمَّ قَرَأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنْذِرْهُمْ يَوْمَ الْحَسْرَةِ إِذْ قُضِيَ الْأَمْرُ وَهُمْ فِي غَفْلَةٍ وَهُمْ لَا يُؤْمِنُونَ وَأَشَارَ بِيَدِهِ إِلَى الدُّنْيَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14743,
                "hadithNumber": "7182",
                "englishNarrator": "Abu Sa'id رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When the inmates of Paradise would be admitted to Paradise and the inmates of Hell would be admitted to Hell, it would be said (to the inmates of Paradise): O inmates of Paradise. The rest of the hadith is the same but with this variation (that he only) said. That is the word of Allah, the Exalted. And he did not say: Then Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) recited, and he did not make a mention of his having pointed with his hand towards the (material) world.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب جنت والے جنت میں اور جہنم والے جہنم میں داخل کردیے جائیں گے ۔ تو کہا جائے گا اے اہل جنت! \" اس کے بعد ابو معاویہ کی حدیث کے ہم معنی بیان کیا ، مگر انھوں نے کہا : \" یہی ( اسی کے مطابق ) ہے اس ( اللہ ) عزوجل کا فرمان ۔ \" اورانھوں نے نہیں کہا ، پھر رسول اللہ صلی اللہ علیہ وسلم نے ( یہ آیت ) پڑھی اور ( اسی طرح ) انھوں نے یہ بھی ذکر نہیں کیا کہ آپ کے اپنے ہاتھ سے د نیا کی طرف اشارہ فرمایا ۔",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ نے بیان کیا, ہمیں جریر نے اعمش سے حدیث بیان کی ، انھوں نے ابو صالح سے ، اور انھوں نے ابو سعیدخدری رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي سَعِيدٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أُدْخِلَ أَهْلُ الْجَنَّةِ الْجَنَّةَ وَأَهْلُ النَّارِ النَّارَ قِيلَ يَا أَهْلَ الْجَنَّةِ ثُمَّ ذَكَرَ بِمَعْنَى حَدِيثِ أَبِي مُعَاوِيَةَ غَيْرَ أَنَّهُ قَالَ فَذَلِكَ قَوْلُهُ عَزَّ وَجَلَّ وَلَمْ يَقُلْ ثُمَّ قَرَأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يَذْكُرْ أَيْضًا وَأَشَارَ بِيَدِهِ إِلَى الدُّنْيَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14744,
                "hadithNumber": "7183",
                "englishNarrator": "Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Allah would admit the inmates of Paradise into Paradise and the inmates of Hell into Hell. Then the announcer would stand between them and say: O inmates of Paradise, there is no death for you, O inmates of Hell, there is no death for you. You would live for ever therein.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ تعالیٰ اہل جنت کو جنت میں داخل کرے گا اور اہل جہنم کو جہنم میں داخل کرے گا ۔ پھر ان کےدرمیان ایک اعلان کرنے والا کھڑا ہوکر اعلان کرے گا : اے اہل جنت!اب موت نہیں ہے ، اور اے اہل دوزخ !اب موت نہیں ہے ہر شخص جہاں ہے وہیں ہمیشہ رہنے والا ہے ۔ \"",
                "urduNarrator": "ہم سے زہیر بن حرب، حسن بن علی الحلوانی اور عبد بن حمید نے بیان کیا۔ عبد نے کہا: مجھے عبد نے خبر دی، اور باقی دو نے کہا: یعقوب نے جو ابراہیم بن سعد کے بیٹے ہیں، بیان کیا۔ میرے والد نے ہم سے صالح کی روایت سے بیان کیا,  نافع نے ہمیں حدیث بیان کی کہ حضرت عبداللہ ( ابن عمر رضی اللہ عنہ ) نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَالْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ وَعَبْدُ بْنُ حُمَيْدٍ قَالَ عَبْدٌ أَخْبَرَنِي و قَالَ الْآخَرَانِ حَدَّثَنَا يَعْقُوبُ وَهُوَ ابْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنَا أَبِي عَنْ صَالِحٍ حَدَّثَنَا نَافِعٌ أَنَّ عَبْدَ اللَّهِ قَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يُدْخِلُ اللَّهُ أَهْلَ الْجَنَّةِ الْجَنَّةَ وَيُدْخِلُ أَهْلَ النَّارِ النَّارَ ثُمَّ يَقُومُ مُؤَذِّنٌ بَيْنَهُمْ فَيَقُولُ يَا أَهْلَ الْجَنَّةِ لَا مَوْتَ وَيَا أَهْلَ النَّارِ لَا مَوْتَ كُلٌّ خَالِدٌ فِيمَا هُوَ فِيهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14745,
                "hadithNumber": "7184",
                "englishNarrator": "`Umar bin Muhammad bin Zaid bin `Abdullah bin `Umar bin al-Khattab reported on the authority of his father `Abdullah bin `Umar  رضی اللہ عنہ that:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: When the inmates of Paradise would go to Paradise and the inmates of Hell would go to Hell, death would be called and it would be placed between the Paradise and the Hell and then slaughtered and then the announcer would announce: O inmates of Paradise, no death. O inmates of Hell-Fire, no death. And it would increase the delight of the inmates of Paradise and it would increase the grief of the inmates of Hell-Fire.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب جنت والے جنت میں اور جہنم والے جہنم میں چلے جائیں گے تو موت کو ذبح کیا جائے گا اور اس کو جنت اوردوزخ کے درمیان کھڑا کیاجائے گا پھر اسے ذبح کردیا جائے گا ، پھر اعلان کرنے والا اعلان کرے گا : اے جنت والو! ( اب ) موت نہیں ہے ( اور ) اے جہنم والو! ( اب ) موت نہیں ہے ۔ اہل جنت کو اپنی خوشی پر مزید خوشی حاصل ہوجائے گی اور جہنم و الوں کو اپنے غم پر مزید غم لاحق ہوگا ۔ \"",
                "urduNarrator": "مجھ سے ہارون بن سعید الایلی اور حرملہ بن یحییٰ نے بیان کیا, ابن وہب نے کہا : مجھے عمر بن محمد بن زید بن عبداللہ بن عمر بن خطاب نےحدیث بیان کی کہ انھیں ان کے والد نے حضرت عبداللہ بن عمر رضی اللہ عنہ سے ر وایت کی کہ",
                "hadithArabic": "حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ وَحَرْمَلَةُ بْنُ يَحْيَى قَالَا حَدَّثَنَا ابْنُ وَهْبٍ حَدَّثَنِي عُمَرُ بْنُ مُحَمَّدِ بْنِ زَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ بْنِ الْخَطَّابِ أَنَّ أَبَاهُ حَدَّثَهُ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا صَارَ أَهْلُ الْجَنَّةِ إِلَى الْجَنَّةِ وَصَارَ أَهْلُ النَّارِ إِلَى النَّارِ أُتِيَ بِالْمَوْتِ حَتَّى يُجْعَلَ بَيْنَ الْجَنَّةِ وَالنَّارِ ثُمَّ يُذْبَحُ ثُمَّ يُنَادِي مُنَادٍ يَا أَهْلَ الْجَنَّةِ لَا مَوْتَ وَيَا أَهْلَ النَّارِ لَا مَوْتَ فَيَزْدَادُ أَهْلُ الْجَنَّةِ فَرَحًا إِلَى فَرَحِهِمْ وَيَزْدَادُ أَهْلُ النَّارِ حُزْنًا إِلَى حُزْنِهِمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14746,
                "hadithNumber": "7185",
                "englishNarrator": "It is transmitted on the authority of Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: The molar tooth of an unbeliever or the canine teeth of an unbeliever will be like Uhud and the thickness of his skin a three night's journey.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کافر کی داڑھ یا ( فرمایا : ) کافر کا کچلی دانت اُحد پہاڑ جتنا ہوجائے گا اور اس کی کھال کی موٹائی تین دن چلنے کی مسافت کے برابر ہوگی ۔ \"",
                "urduNarrator": "مجھ سے سریج بن یونس نے بیان کیا، ہم سے حمید بن عبدالرحمٰن نے بیان کیا، وہ حسن بن صالح سے، ہارون بن سعد نے ابوحازم کی سند سے, حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے ، کہا",
                "hadithArabic": "حَدَّثَنِي سُرَيْجُ بْنُ يُونُسَ حَدَّثَنَا حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ الْحَسَنِ بْنِ صَالِحٍ عَنْ هَارُونَ بْنِ سَعْدٍ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضِرْسُ الْكَافِرِ أَوْ نَابُ الْكَافِرِ مِثْلُ أُحُدٍ وَغِلَظُ جِلْدِهِ مَسِيرَةُ ثَلَاثٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14747,
                "hadithNumber": "7186",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported directly from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) that he said:",
                "hadithEnglish": "The distance of the two shoulders of the non-believer in Hell will be a three-day journey for a swift rider.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" جہنم میں کافر کے دو کندھوں کے درمیان تیز رفتار سوار کی تین دن کی مسافت کےبرابر فاصلہ ہوگا ۔ \"\" وکیعی نے \"\" جہنم میں \"\" کے الفاظ بیان نہیں کیے ۔",
                "urduNarrator": "ابو کریب اور احمد بن عمر وکیعی نےہمیں حدیث بیان کی ، دونوں نے کہا : ہمیں ابن فضیل نے اپنے والد سے ، انھوں نے ابوحازم سے اور انھوں نےحضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی ، انھوں نے اسے مرفوع بیان کرتے ہوئے کہا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو كُرَيْبٍ وَأَحْمَدُ بْنُ عُمَرَ الْوَكِيعِيُّ قَالَ حَدَّثَنَا ابْنُ فُضَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ يَرْفَعُهُ قَالَ مَا بَيْنَ مَنْكِبَيْ الْكَافِرِ فِي النَّارِ مَسِيرَةُ ثَلَاثَةِ أَيَّامٍ لِلرَّاكِبِ الْمُسْرِعِ وَلَمْ يَذْكُرْ الْوَكِيعِيُّ فِي النَّارِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14748,
                "hadithNumber": "7187",
                "englishNarrator": "Haritha bin Wahb رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: May I not inform you about the inmates of Paradise? They said: Do this, of course. Thereupon Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Every humble person who is considered to be humble if he were to adjure In the name of Allah, He would fulfil it. He then said: May I not inform you about the denizens of Hell-Fire? They said: Yes. And he said: Every haughty, fat and proud (person).",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" کیا میں تمھیں اہل جنت کے بارے میں خبر نہ دوں؟انھوں ( صحابہ رضوان اللہ عنھم اجمعین ) نے عرض کی : کیوں نہیں! آپ صلی اللہ علیہ وسلم نے فرمایا؛ \" ہر کمزور جسے کمزور سمجھا جاتاہے ۔ ( مگر ایسا کہ ) اگر ( کسی معاملے میں ) اللہ پر قسم کھا لے تو وہ اس کی قسم پوری کردے ۔ \" پھر آپ صلی اللہ علیہ وسلم نے فرمایا! \" کیا میں تمھیں اہل جہنم کے بارے میں خبر نہ دوں؟ \" لوگوں نے کہا : کیوں نہیں! آپ صلی اللہ علیہ وسلم نے فرمایا : \" ہراجذ ، مال اکھٹا کرنے والا اسے خرچ نہ کرنے والا اور تکبر اختیار کرنے والا ۔ \"",
                "urduNarrator": "عبید اللہ بن معاذ عنبری نے کہا : ہمیں شعبہ نے حدیث بیان کی ، انھوں نے کہا : مجھے معبد بن خالد نے حدیث بیان کی ، انھوں نے حضرت حارثہ بن وہب رضی اللہ عنہ سے سنا کہ انھوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ حَدَّثَنِي مَعْبَدُ بْنُ خَالِدٍ أَنَّهُ سَمِعَ حَارِثَةَ بْنَ وَهْبٍ أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَلَا أُخْبِرُكُمْ بِأَهْلِ الْجَنَّةِ قَالُوا بَلَى قَالَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُّ ضَعِيفٍ مُتَضَعِّفٍ لَوْ أَقْسَمَ عَلَى اللَّهِ لَأَبَرَّهُ ثُمَّ قَالَ أَلَا أُخْبِرُكُمْ بِأَهْلِ النَّارِ قَالُوا بَلَى قَالَ كُلُّ عُتُلٍّ جَوَّاظٍ مُسْتَكْبِرٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14749,
                "hadithNumber": "7188",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters but with a slight variation of wording.",
                "hadithUrdu": "ہم سے محمد بن المثنی نے بیان کیا, محمد بن جعفر نے کہا : ہمیں شعبہ نے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی مگر اس میں کہا : \" کیا میں تمہاری رہنمائی نہ کروں؟ \"",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ بِهَذَا الْإِسْنَادِ بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ أَلَا أَدُلُّكُمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14750,
                "hadithNumber": "7189",
                "englishNarrator": "Haritha bin Wahb al-Khuzai رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: May I not inform you about the inmates of Paradise? (And then informing about them) said: Every meek person who is considered to be humble and if they were to adjure in the name of Allah, Allah would certainly fulfil it. May I not inform you about the inmates of Hell-Fire? They are all proud, mean and haughty.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کیا میں تمھیں اہل جنت کی خبر نہ دوں؟ہر کمزور جسے کمزور اور لاچار سمجھا جاتا ہے ۔ ( لیکن ایساکہ ) اگر اللہ پر ( اعتماد کرتے ہوئے ) قسم کھالے تو وہ اسے پوری کردے ۔ کیا میں تمھیں اہل جہنم کے بارے میں خبر نہ دوں؟ہر مال سمیٹنے والا اور اسے خرچ نہ کرنے والا ، بد اصل ، متکبر ۔ \"",
                "urduNarrator": "ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا، ہم سے وکیع نے بیان کیا, سفیان نے ہمیں معبد بن خالد سے حدیث بیان کی ، انھوں نے کہا : میں نے حضرت حارثہ بن وہب خزاعی رضی اللہ عنہ سے سنا ، وہ کہتے ہیں کہ",
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ مَعْبَدِ بْنِ خَالِدٍ قَالَ سَمِعْتُ حَارِثَةَ بْنَ وَهْبٍ الْخُزَاعِيَّ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا أُخْبِرُكُمْ بِأَهْلِ الْجَنَّةِ كُلُّ ضَعِيفٍ مُتَضَعِّفٍ لَوْ أَقْسَمَ عَلَى اللَّهِ لَأَبَرَّهُ أَلَا أُخْبِرُكُمْ بِأَهْلِ النَّارِ كُلُّ جَوَّاظٍ زَنِيمٍ مُتَكَبِّرٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14751,
                "hadithNumber": "7190",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Many a people with dishevelled hair are driven away from the door (but they are so pious) that if they are to swear in the name of Allah, He would definitely fulfil that.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \" بسا اوقات پراگندہ بالوں والا جسےدروازے پر سے لوٹا دیا جاتاہے ۔ ( ایسا ہوتا ہے ) کہ اللہ پر ( اعتماد کرتے ہوئے ) قسم کھالے تو وہ ( اللہ ) اسے پوری کردیتا ہے ۔ \"",
                "urduNarrator": "مجھ سے سوید بن سعید نے بیان کیا، مجھ سے حفص بن میسرہ نے علاء بن عبدالرحمٰن سے اپنے والد کی سند سے بیان کیا, حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنِي سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنِي حَفْصُ بْنُ مَيْسَرَةَ عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رُبَّ أَشْعَثَ مَدْفُوعٍ بِالْأَبْوَابِ لَوْ أَقْسَمَ عَلَى اللَّهِ لَأَبَرَّهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14752,
                "hadithNumber": "7191",
                "englishNarrator": "Abdullah bin Zam'a رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) delivered an address and he made a mention of the dromedary and also made a mention of one (base person) who cut off Its hind legs, and he recited: When the basest of them broke forth with mischief. When A mischievous person, strong even because of the strength of a family like Abu Zam'a, broke forth. He then delivered instruction in regard to the women saying: There is amongst you who beats his woman, and in the narration on the authority of Abu Bakr, the words are: He flogs her like a slave-girl. And in the narration of Abu Kuraib (the words are): He flogs like a slave and then comforts his bed with the help of that at the end of the day, and he then advised in regard to laughing of people at the breaking of wind and said: One of you laughs at that which you yourself do.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے خطبہ ارشاد فرمایا تو ( حضرت صالح علیہ السلام کی اونٹنی کا اور اس کی کونچیں کاٹنے والے شخص کا ذکر فرمایا ، پھر آپ نے پڑھا : \" جب اس ( قبیلے ) کابدبخت ترین شخص اٹھا \" ( آپ نے فرمایا : قبیلہ ثمود کا ) سب سے طاقتور ، شر پھیلانے والا ، جس کو ا پنی قوم کا پورا تحفظ حاصل تھا ، جس طرح ابوزمعہ ( اسود بن مطلب ) ہے ، ( کونچیں کاٹنے کے لئے ) اٹھا ۔ \" پھر آپ صلی اللہ علیہ وسلم نے اس سلسلے میں عورتوں کا بھی ذکر کیا ، ( صحابہ رضوان اللہ عنھم اجمعین کو ) ان کے بارے میں وعظ ونصیحت فرمائی ، پھر فرمایا؛ \" کیا وجہ ہے کہ تم میں سے کوئی اپنی بیوی کو ( اس طرح ) کوڑے سے مارتا ہے \" ابو بکر کی روایت میں ہے : \" جس طرح لونڈی کو مارتا ہے \" اور ابو کریب کی روایت میں ہے؛ \" جس طرح غلام کو مارتا ہے ۔ پھر شاید دن کے آخر میں اسی کےساتھ ہم بستری کرے گا ۔ \" پھران ( صحابہ رضوان اللہ عنھم اجمعین ) کو گوز پر ہنسنے کے بارے میں نصیحت فرمائی : \" تم میں سے کوئی کب تک اس کام پر ہنستا رہے گا جسے وہ خود کرتا ہے ۔ \"",
                "urduNarrator": "ابو بکر بن ابی شیبہ اور ابو کریب نے ہمیں حدیث بیان کی ، دونوں نے کہا : ہمیں ابن نمیر کےنے ہشام بن عروہ سے حدیث بیان کی ، انھوں نے اپنے والد سے اورانھوں نے حضرت عبداللہ بن زمعہ رضی اللہ عنہ سےروایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا ابْنُ نُمَيْرٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ زَمْعَةَ قَالَ خَطَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ النَّاقَةَ وَذَكَرَ الَّذِي عَقَرَهَا فَقَالَ إِذْ انْبَعَثَ أَشْقَاهَا انْبَعَثَ بِهَا رَجُلٌ عَزِيزٌ عَارِمٌ مَنِيعٌ فِي رَهْطِهِ مِثْلُ أَبِي زَمْعَةَ ثُمَّ ذَكَرَ النِّسَاءَ فَوَعَظَ فِيهِنَّ ثُمَّ قَالَ إِلَامَ يَجْلِدُ أَحَدُكُمْ امْرَأَتَهُ فِي رِوَايَةِ أَبِي بَكْرٍ جَلْدَ الْأَمَةِ وَفِي رِوَايَةِ أَبِي كُرَيْبٍ جَلْدَ الْعَبْدِ وَلَعَلَّهُ يُضَاجِعُهَا مِنْ آخِرِ يَوْمِهِ ثُمَّ وَعَظَهُمْ فِي ضَحِكِهِمْ مِنْ الضَّرْطَةِ فَقَالَ إِلَامَ يَضْحَكُ أَحَدُكُمْ مِمَّا يَفْعَلُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14753,
                "hadithNumber": "7192",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: I saw 'Amr bin Luhayy bin Qam'a bin Khindif, brother of Bani Ka'b, dragging his Intestines in Fire.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" میں نے عروہ بن لحی بن قمعہ بن خندف ، ان بنو کعب والوں کے جذ اعلیٰ کو دیکھا ، وہ جہنم میں اپنی انتڑیاں گھسیٹ رہا تھا ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے جریر نے بیان کیا, سہیل کے والد ( ابوصالح ) نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَيْتُ عَمْرَو بْنَ لُحَيِّ بْنِ قَمْعَةَ بْنِ خِنْدِفَ أَبَا بَنِي كَعْبٍ هَؤُلَاءِ يَجُرُّ قُصْبَهُ فِي النَّارِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14754,
                "hadithNumber": "7193",
                "englishNarrator": "Sa'id bin Musayyib said:",
                "hadithEnglish": "Explained al-bahira as that animal which is not milked but for the idols. and none amongst the people milks them, and as-sa'iba as that animal which is let loose for the deities. Nothing is loaded over it, and Ibn Musayyib narrated that Abu Huraira رضی اللہ عنہ stated that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: I saw 'Amr bin 'Amir al-Khuzai dragging his intestines in fire and he was the first who devoted animals to deity.",
                "hadithUrdu": "بحیرہ وہ جانور ہے جس کا دودھ جھوٹے خداؤں ( بتوں ) کے چڑھاوے کے لیے دوہنا بند کردیا جاتا ہے ، اس لئے کوئی شخص ان کو نہیں دوہتا تھا ، اورسائبہ وہ جانور ہے جسے جھوٹے خداؤں ( کی سواری کے لئے ) کھلا چھوڑ دیاجاتا ہے ۔ اس پر کوئی چیز تک نہیں لادی جاتی ۔ اور ابن مسیب نے کہا : حضرت ابو ہریرہ رضی اللہ عنہ نے بیان کیاکہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" میں نے عمرو بن عامر خزاعی کو دیکھا ، وہ جہنم میں اپنی انتڑیاں گھسیٹ رہا تھا ، وہ پہلا شخص تھا جس نے سب سےپہلے ( بتوں کے نام پر ) کھلاچھوڑا جانے والا جانور چھوڑاتھا ۔ \"\"",
                "urduNarrator": "مجھے عمرو ناقد، حسن الحلوانی اور عبد بن حمید نے بیان کیا۔ عبد نے کہا: مجھے عبد نے بتایا، اور باقی دو نے کہا: یعقوب نے، جو ابراہیم بن سعد کے بیٹے ہیں، بیان کیا۔ میرے والد نے ہمیں صالح کے حکم پر بتایا, ابن شہاب نے کہا : میں نے سعید بن مسیب سےسنا ، وہ کہتے ہیں",
                "hadithArabic": "حَدَّثَنِي عَمْرٌو النَّاقِدُ وَحَسَنٌ الْحُلْوَانِيُّ وَعَبْدُ بْنُ حُمَيْدٍ قَالَ عَبْدٌ أَخْبَرَنِي و قَالَ الْآخَرَانِ حَدَّثَنَا يَعْقُوبُ وَهُوَ ابْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنَا أَبِي عَنْ صَالِحٍ عَنْ ابْنِ شِهَابٍ قَالَ سَمِعْتُ سَعِيدَ بْنَ الْمُسَيَّبِ يَقُولُ إِنَّ الْبَحِيرَةَ الَّتِي يُمْنَعُ دَرُّهَا لِلطَّوَاغِيتِ فَلَا يَحْلُبُهَا أَحَدٌ مِنْ النَّاسِ وَأَمَّا السَّائِبَةُ الَّتِي كَانُوا يُسَيِّبُونَهَا لِآلِهَتِهِمْ فَلَا يُحْمَلُ عَلَيْهَا شَيْءٌ وَقَالَ ابْنُ الْمُسَيَّبِ قَالَ أَبُو هُرَيْرَةَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَيْتُ عَمْرَو بْنَ عَامِرٍ الْخُزَاعِيَّ يَجُرُّ قُصْبَهُ فِي النَّارِ وَكَانَ أَوَّلَ مَنْ سَيَّبَ السُّيُوبَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14755,
                "hadithNumber": "7194",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Two are the types amongst the denizens of Hell, the one possessing whips like the tail of an ox and they flog people with their help. (The second one) the women who would be naked in spite of their being dressed, who are seduced (to wrong paths) and seduce others with their hair high like humps. These women would not get into Paradise and they would not perceive the odour of Paradise, although its fragrance can be perceived from such and such distance (from great distance).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اہل جہنم کے دو قسمیں ایسی ہیں جن کو ( دنیوی زندگی میں ) میں نے ( خود ) نہیں دیکھا ۔ ایک گروہ وہ ہے جس کے پاس گایوں کی دموں کی طرح سے کوڑے ہوں گے جن سے وہ لوگوں کوماریں گے اور ( دوسرے گروہ میں ) وہ عورتیں ہیں جو لباس پہنے ہوئے ( بھی ) ننگی ہوں گی ، دوسروں کو ( گناہ پر ) مائل کرنے والی ، خود مائل ہونے والی ہوں گی ان کے سر ( علاقہ ) بخت کی اونٹنیوں کے ایک طرف جھکے ہوئے کوہانوں جیسے ہوں گے ۔ یہ عورتیں جنت میں داخل ہوں گی نہ اسکی خوشبو سونگھیں گی ۔ حالانکہ اس کی خوشبو اتنے اتنے ( لمبے ) فاصلے سےمحسوس ہوتی ہوگی ۔ \"",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے جریر نے بیان کیا, سہیل کے والد ( ابو صالح ) نے حضرت ابو ہریرۃ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صِنْفَانِ مِنْ أَهْلِ النَّارِ لَمْ أَرَهُمَا قَوْمٌ مَعَهُمْ سِيَاطٌ كَأَذْنَابِ الْبَقَرِ يَضْرِبُونَ بِهَا النَّاسَ وَنِسَاءٌ كَاسِيَاتٌ عَارِيَاتٌ مُمِيلَاتٌ مَائِلَاتٌ رُءُوسُهُنَّ كَأَسْنِمَةِ الْبُخْتِ الْمَائِلَةِ لَا يَدْخُلْنَ الْجَنَّةَ وَلَا يَجِدْنَ رِيحَهَا وَإِنَّ رِيحَهَا لَيُوجَدُ مِنْ مَسِيرَةِ كَذَا وَكَذَا",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14756,
                "hadithNumber": "7195",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: If you survive for a time you would certainly see people who would have whips in their hands like the tail of an ox. They would get up in the morning under the wrath of Allah and they would get into the evening with the anger of Allah.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \" قریب ہے کہااگر تمھیں لمبی مدت مل گئی تو تم ایسے لوگوں کودیکھو گے جن کے ہاتھ میں گایوں کی دموں جیسے ( کوڑے ) ہوں گے ، وہ اللہ کےغضب میں صبح گزاریں گے اور اللہ کی سخت ناراضگی میں شام بسر کریں گے ۔ \"",
                "urduNarrator": "ہمیں ابن نمیر نے بیان کیا, زید بن حباب نے کہا : ہمیں افلح بن سعید نے حدیث بیان کی ، کہا : ہمیں حضرت ام سلمہ رضی اللہ عنہا کےآزاد کردہ غلام عبداللہ بن رافع نے حدیث بیان کی ، انھوں نے کہا : میں نے حضرت ابو ہریرہ رضی اللہ عنہ سے سنا ، وہ کہتے کہ",
                "hadithArabic": "حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا زَيْدٌ يَعْنِي ابْنَ حُبَابٍ حَدَّثَنَا أَفْلَحُ بْنُ سَعِيدٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ رَافِعٍ مَوْلَى أُمِّ سَلَمَةَ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُوشِكُ إِنْ طَالَتْ بِكَ مُدَّةٌ أَنْ تَرَى قَوْمًا فِي أَيْدِيهِمْ مِثْلُ أَذْنَابِ الْبَقَرِ يَغْدُونَ فِي غَضَبِ اللَّهِ وَيَرُوحُونَ فِي سَخَطِ اللَّهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14757,
                "hadithNumber": "7196",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "I heard the Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) as saying: If you live for a time, you would certainly see people get up (in the morning) in the wrath of Allah and getting into the evening under the curse of Allah, and there would be in their hands (whips) like the tail of an ox.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : \" اگر تمھیں طویل مدت مل گئی تو قریب ہے کہ تم ایسے لوگوں کو دیکھو گے جن کی صبح اللہ کی سخت ناراضی میں اور جن کی شام اللہ کی لعنت کے سائے میں ہوگی ۔ ان کے ہاتھوں میں گایوں کی دموں کی مانند ( کوڑے ) ہوں گے ۔ \"",
                "urduNarrator": "ہم سے عبید اللہ بن سعید، ابوبکر بن نافع اور عبد بن حمید نے بیان کیا, ابو عامر عقدی نے کہا : ہمیں افلح بن سعید نے حدیث بیان کی ، کہا : مجھے حضرت ام سلمہ رضی اللہ عنہ کے آزاد کردہ غلام عبداللہ بن رافع نے حدیث بیان کی ، کہا : میں نے حضرت ابو ہریرۃ رضی اللہ عنہ سے سنا ، وہ کہتے کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ وَأَبُو بَكْرِ بْنُ نَافِعٍ وَعَبْدُ بْنُ حُمَيْدٍ قَالُوا حَدَّثَنَا أَبُو عَامِرٍ الْعَقَدِيُّ حَدَّثَنَا أَفْلَحُ بْنُ سَعِيدٍ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ رَافِعٍ مَوْلَى أُمِّ سَلَمَةَ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنْ طَالَتْ بِكَ مُدَّةٌ أَوْشَكْتَ أَنْ تَرَى قَوْمًا يَغْدُونَ فِي سَخَطِ اللَّهِ وَيَرُوحُونَ فِي لَعْنَتِهِ فِي أَيْدِيهِمْ مِثْلُ أَذْنَابِ الْبَقَرِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14758,
                "hadithNumber": "7197",
                "englishNarrator": "This hadith has been narrated through five different chains of transmitters and all of them are narrated on the authority of Mustaurid, brother of Bani Fihr رضی اللہ عنہ , that:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: By Allah, this world (is so insignificant in comparison) to the Hereafter that if one of you should dip his finger- (and while saying this Yahya pointed with his forefinger) -in the ocean and then he should see as to what has stuck to it. This hadith has been narrated through another chain of transmitters also but with a slight variation of wording.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" اللہ کی قسم!آخرت ( کے مقابلے ) میں دنیا کی حیثیت اس سے زیادہ نہیں جس طرح تم میں سے کوئی شخص اپنی ایک انگلی سمندر میں ڈالے ۔ یحییٰ نے اپنی انگشت شہادت کی طرف اشارہ کیا ۔ پھر دیکھے وہ ( انگلی ) اس میں سے کیا ( نکال کر ) لاتی ہے ۔ \"\" یحییٰ ( بن سعید قطان کی روایت ) کے علاوہ باقی سب کی حدیث میں ( صراحت سے ) یہ الفاظ ہیں میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا ۔ اور حضرت مستورد بن شدادفہری رضی اللہ عنہ سے ابو اسامہ کی حدیث میں بھی ( یہی الفاظ ہیں ) اور ان کی حدیث میں یہ بھی ہے کہ ( ابو اسامہ نے ) اور اسماعیل ( بن ابی خالد ) نے انگوٹھے کے ساتھ اشارہ کیا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, عبد اللہ بن ادریس محمد بن نمیر محمد بن بشیر موسیٰ بن اعین اور ابواسامہ اور یحییٰ بن سعید سب نے ہمیں اسماعیل بن ابی خالد سے حدیث بیان کی ، انھوں نے کہا : ہمیں قیس نے حدیث سنائی : انھوں نے کہا : میں نے حضرت مستورد ( بن شدادقرشی ) فہری رضی اللہ عنہ سے سنا : وہ کہتے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي وَمُحَمَّدُ بْنُ بِشْرٍ ح و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا مُوسَى بْنُ أَعْيَنَ ح و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا أَبُو أُسَامَةَ كُلُّهُمْ عَنْ إِسْمَعِيلَ بْنِ أَبِي خَالِدٍ ح و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ وَاللَّفْظُ لَهُ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا إِسْمَعِيلُ حَدَّثَنَا قَيْسٌ قَالَ سَمِعْتُ مُسْتَوْرِدًا أَخَا بَنِي فِهْرٍ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاللَّهِ مَا الدُّنْيَا فِي الْآخِرَةِ إِلَّا مِثْلُ مَا يَجْعَلُ أَحَدُكُمْ إِصْبَعَهُ هَذِهِ وَأَشَارَ يَحْيَى بِالسَّبَّابَةِ فِي الْيَمِّ فَلْيَنْظُرْ بِمَ تَرْجِعُ وَفِي حَدِيثِهِمْ جَمِيعًا غَيْرَ يَحْيَى سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ ذَلِكَ وَفِي حَدِيثِ أَبِي أُسَامَةَ عَنْ الْمُسْتَوْرِدِ بْنِ شَدَّادٍ أَخِي بَنِي فِهْرٍ وَفِي حَدِيثِهِ أَيْضًا قَالَ وَأَشَارَ إِسْمَعِيلُ بِالْإِبْهَامِ.",
                "headingArabic": "فَنَاءِ الدُّنْيَا وَبَيَانِ الْحَشْرِ يَوْمَ الْقِيَامَةِ",
                "headingUrdu": "اس دنیا سے رخصت ہونا، اور قیامت کے دن جمع ہونا",
                "headingEnglish": "The Passing Away Of This World, And The Gathering On The Day Of Resurrection",
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14759,
                "hadithNumber": "7198",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "She heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The people would be assembled on the Day of Resurrection barefooted, naked and uncircumcised. I said: Allah's Messenger, will the male and the female be together on the Day and would they be looking at one another? Upon this Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: 'A'isha رضی اللہ عنہا , the matter would be too serious for them to look to one another.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”لوگ قیامت کے دن ننگے پاؤں، ننگے بدن اور غیر ختنہ کیے ہوئے ہوں گے۔ میں نے عرض کیا: یا رسول اللہ، کیا اس دن مرد اور عورت ایک ساتھ ہوں گے اور ایک دوسرے کو دیکھ رہے ہوں گے؟ اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: عائشہ رضی اللہ عنہا معاملہ اتنا سنگین ہو گا کہ وہ ایک دوسرے کی طرف نہ دیکھیں۔",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے یحییٰ بن سعید نے بیان کیا، وہ حاتم بن ابی صغیرہ سے، وہ ابن ابی ملیکہ سے، انہوں نے قاسم بن محمد سے اور عائشہ رضی اللہ عنہا سے کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا",
                "hadithArabic": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ حَاتِمِ بْنِ أَبِي صَغِيرَةَ حَدَّثَنِي ابْنُ أَبِي مُلَيْكَةَ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَائِشَةَ قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يُحْشَرُ النَّاسُ يَوْمَ الْقِيَامَةِ حُفَاةً عُرَاةً غُرْلًا قُلْتُ يَا رَسُولَ اللَّهِ النِّسَاءُ وَالرِّجَالُ جَمِيعًا يَنْظُرُ بَعْضُهُمْ إِلَى بَعْضٍ قَالَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا عَائِشَةُ الْأَمْرُ أَشَدُّ مِنْ أَنْ يَنْظُرَ بَعْضُهُمْ إِلَى بَعْضٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14760,
                "hadithNumber": "7199",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Hatim bin Abi Saghira with the same chain of transmitters and there is no mention of the word uncircumcised.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ اور ابن نمیر نے بیان کیا, ابو خالد احمرنے ہمیں حاتم بن ابی صغیرہ سے اسی سند کے ساتھ حدیث بیان کی اور انھوں نے اپنی روایت میں \" بے ختنہ \" ذکرنہیں کیا ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَابْنُ نُمَيْرٍ قَالَا حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ عَنْ حَاتِمِ بْنِ أَبِي صَغِيرَةَ بِهَذَا الْإِسْنَادِ وَلَمْ يَذْكُرْ فِي حَدِيثِهِ غُرْلًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14761,
                "hadithNumber": "7200",
                "englishNarrator": "Ibn Abbas رضی اللہ عنہما reported:",
                "hadithEnglish": "He heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) deliver an address and he was saying that they would meet Allah barefooted, naked and uncircumcised.",
                "hadithUrdu": "انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو سنا، جب آپ صلی اللہ علیہ وسلم خطبہ دے رہے تھے۔وہ کہتا ہے، ’’تم خدا سے ملو گے چلتے پھرتے، ننگے پاؤں، ننگے اور غیر مختون۔‘‘ \r\nلیکن زہیر کا ذکر ان کی حدیث میں بطور مبلغ نہیں ہے۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، زہیر بن حرب، اسحاق بن ابراہیم اور ابن ابی عمر نے بیان کیا۔ اسحاق نے کہا: انہوں نے ہمیں خبر دی، اور دوسروں نے کہا: ہم سے سفیان بن عیینہ نے عمرو کی سند سے، سعید بن جبیر سے، ابن عباس رضی اللہ عنہما سے بیان کیا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ وَابْنُ أَبِي عُمَرَ قَالَ إِسْحَقُ أَخْبَرَنَا و قَالَ الْآخَرُونَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرٍو عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ وَهُوَ يَقُولُ إِنَّكُمْ مُلَاقُو اللَّهِ مُشَاةً حُفَاةً عُرَاةً غُرْلًا وَلَمْ يَذْكُرْ زُهَيْرٌ فِي حَدِيثِهِ يَخْطُبُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14762,
                "hadithNumber": "7201",
                "englishNarrator": "This hadith has been narrated through other chains of transmitters on the authority of Ibn Abbas رضی اللہ عنہ, (and) the words are:",
                "hadithEnglish": "While Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) stood up to deliver a sermon, he said: O people, Allah would make you assemble barefooted, naked and uncircumcised (and then recited the words of the Qur'an): As We created you for the first time, We shall repeat it. (It is) a promise (binding) upon us. Lo! We are to perform it, and the first person who would be clothed on the Day of Resurrection would be (Hadrat) Ibrahim (peace be upon him) and, behold! some persons of my Ummah would be brought and taken to the left and I would say: My Lord, they are my companions, and it would be said: You do not know what they did after you, and I would say just as the pious servant (Hadrat 'Isa) said:, I was a witness regarding them as I remained among them and Thou art a witness over everything, so if Thou chastisest them, they are Thy servants and if Thou forgivest them, Thou art Mighty, Wise (v. 117-118). And it would be said to him: They constantly turned to their heels since you left them. This hadith has been transmitted on the authority of Waki' and Mu'adh (and the words are): What new things they fabricated.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ہمارے درمیان نصیحت آموز خطبہ دینے کے لیے کھڑے ہوئے اور فرمایا : \" اے لوگو! تم کو اللہ کے سامنے ننگے پاؤں بے لباس بے ختنہ اکٹھا کیا جا ئے گا ۔ ( قرآن مجید میں ہے ) : \" جس طرح ہم نے پہلی پیدائش کا آغاز کیا تھا اسی کو دوبارہ لو ٹائیں گے ۔ یہ ہم پر ( پختہ ) وعدہ ہے ہم یہی کرنے والے ہیں ۔ \" یاد رکھو!مخلوقات میں سے سب سے پہلے جنھیں لباس پہنایا جا ئے گا وہ ابراہیم علیہ السلام ہوں گے ۔ اور یاد رکھو!میری امت میں سے کچھ لوگ لائے جائیں گے ، پھر انھیں پکڑکر بائیں ( جہنم کی ) طرف لے جایا جائے گا ۔ میں کہوں گا ۔ میرے رب! میرے ساتھی ہیں ۔ تو کہا جا ئےگا ۔ آپ کو معلوم نہیں انھوں نے آپ کے بعد ( دین میں ) کیانئی باتیں نکالی تھیں ۔ تو وہی کچھ کہوں گا جو نیک بندے ( عیسیٰ علیہ السلام ) کہیں گے : \" میں ان پر گواہ تھا جب تک میں ان کے درمیان رہا جب تونے مجھے اٹھالیا تو ان پر تو نگہبان تھا ۔ اگر تو انھیں عذاب دے تو بے شک یہ تیرے بندے ہیں اور اگر توانھیں بخش دے تو یقیناً تو ہی بڑا غالب اور بڑا دانا ہے ۔ \" فرمایا : \" تومجھ سے کہا جا ئے گا جب سے آپ ان سے جدا ہوئے تھے ۔ یہ مسلسل اپنی ایڑیوں پر لوٹتے چلے گئے ۔ اور وکیع اور معاذ کی حدیث میں ہے : \" تو کہا جائے گا ۔ آپ نہیں جا نتے کہ انھوں نے آپ کے بعد ( دین میں ) کیا نئی باتیں نکالی تھیں ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, وکیع اور معاذ دونوں نے ہمیں شعبہ سے حدیث بیان کی ، نیز محمد بن مثنیٰ اور محمد بن بشار نے ,  الفاظ ابن مثنیٰ کے ہیں ۔ کہا : ہمیں محمد بن جعفرنے شعبہ سے حدیث بیان کی ، انھوں نے مغیرہ بن نعمان سے ، انھوں نے سعید بن جبیر سے اور انھوں نے حضرت ابن عباس رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ و حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي كِلَاهُمَا عَنْ شُعْبَةَ و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ وَاللَّفْظُ لِابْنِ الْمُثَنَّى قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ الْمُغِيرَةِ بْنِ النُّعْمَانِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَ قَامَ فِينَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطِيبًا بِمَوْعِظَةٍ فَقَالَ يَا أَيُّهَا النَّاسُ إِنَّكُمْ تُحْشَرُونَ إِلَى اللَّهِ حُفَاةً عُرَاةً غُرْلًا كَمَا بَدَأْنَا أَوَّلَ خَلْقٍ نُعِيدُهُ وَعْدًا عَلَيْنَا إِنَّا كُنَّا فَاعِلِينَ أَلَا وَإِنَّ أَوَّلَ الْخَلَائِقِ يُكْسَى يَوْمَ الْقِيَامَةِ إِبْرَاهِيمُ عَلَيْهِ السَّلَام أَلَا وَإِنَّهُ سَيُجَاءُ بِرِجَالٍ مِنْ أُمَّتِي فَيُؤْخَذُ بِهِمْ ذَاتَ الشِّمَالِ فَأَقُولُ يَا رَبِّ أَصْحَابِي فَيُقَالُ إِنَّكَ لَا تَدْرِي مَا أَحْدَثُوا بَعْدَكَ فَأَقُولُ كَمَا قَالَ الْعَبْدُ الصَّالِحُ وَكُنْتُ عَلَيْهِمْ شَهِيدًا مَا دُمْتُ فِيهِمْ فَلَمَّا تَوَفَّيْتَنِي كُنْتَ أَنْتَ الرَّقِيبَ عَلَيْهِمْ وَأَنْتَ عَلَى كُلِّ شَيْءٍ شَهِيدٌ إِنْ تُعَذِّبْهُمْ فَإِنَّهُمْ عِبَادُكَ وَإِنْ تَغْفِرْ لَهُمْ فَإِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ قَالَ فَيُقَالُ لِي إِنَّهُمْ لَمْ يَزَالُوا مُرْتَدِّينَ عَلَى أَعْقَابِهِمْ مُنْذُ فَارَقْتَهُمْ وَفِي حَدِيثِ وَكِيعٍ وَمُعَاذٍ فَيُقَالُ إِنَّكَ لَا تَدْرِي مَا أَحْدَثُوا بَعْدَكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14763,
                "hadithNumber": "7202",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying, The people will be assembled in three categories. Those desirous (of Paradise), fearing (Hell), coming two upon the came], three upon the camel, four upon the camel, ten upon the camel and the rest will be assembled, Hell-Fire being with them when they are at midday where they would spend the night and where they would spend the morning and where they would spend the evening.",
                "hadithUrdu": "آپ نے فرمایا : \" ( قیامت کے دن ) لوگوں کو تین طریقوں سے ( اللہ کے سامنے ) اکٹھا کیا جائے گا ۔ ( کچھ لوگ ) خوف ورجا کے عالم میں ہوں گے اور ( وہ لوگ جنھیں حاضری کے وقت بھی عزت نصیب ہوگی ۔ حسب مراتب ) وہ ( افراد ) ایک اونٹ پر ( سوار ) ہوں گے اور تین ایک اونٹ پر اور چار ایک اونٹ پر اور دس ایک اونٹ پر ( سوارہوکر میدان حشر میں آئیں گے ) اور باقی سب لوگوں کو آگ ( اپنے گھیرے میں ) اکٹھا کر کے لائے گی ۔ جہاں ان پر رات آئے گی ، وہ ( آگ ) رات کو بھی ان کے ساتھ ہو گی ، جہاں انھیں دوپہر ہوگی وہ دوپہر کو بھی ان کو ساتھ رکے گی ، وہ جہاں صبح کریں گےوہ صبح کے وقت بھی ان کے ساتھ ہوگی ۔ اور جہاں وہ لوگ شام کریں گے وہ شام کو بھی ان کے ساتھ ہوگی ۔",
                "urduNarrator": "ہم سے زہیر بن حرب نے بیان کیا، کہا ہم سے احمد بن اسحاق نے بیان کیا، کہا کہ ہم سے محمد بن حاتم نے بیان کیا، کہا کہ ہم سے بہز نے بیان کیا، ان دونوں نے کہا، ہم سے وہیب نے بیان کیا، کہا ہم سے عبداللہ بن طاؤس نے بیان کیا، وہ اپنے والد کی سند سے, حضرت ابو ہریرہ رضی اللہ عنہ نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا أَحْمَدُ بْنُ إِسْحَقَ و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا بَهْزٌ قَالَا جَمِيعًا حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ طَاوُسٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يُحْشَرُ النَّاسُ عَلَى ثَلَاثِ طَرَائِقَ رَاغِبِينَ رَاهِبِينً وَاثْنَانِ عَلَى بَعِيرٍ وَثَلَاثَةٌ عَلَى بَعِيرٍ وَأَرْبَعَةٌ عَلَى بَعِيرٍ وَعَشَرَةٌ عَلَى بَعِيرٍ وَتَحْشُرُ بَقِيَّتَهُمْ النَّارُ تَبِيتُ مَعَهُمْ حَيْثُ بَاتُوا وَتَقِيلُ مَعَهُمْ حَيْثُ قَالُوا وَتُصْبِحُ مَعَهُمْ حَيْثُ أَصْبَحُوا وَتُمْسِي مَعَهُمْ حَيْثُ أَمْسَوْا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 14451,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=578",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=576",
                "label": "576",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=577",
                "label": "577",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=578",
                "label": "578",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=579",
                "label": "579",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=580",
                "label": "580",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=581",
                "label": "581",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=582",
                "label": "582",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=580",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=580",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=578",
        "to": 14475,
        "total": 40465
    }
}