{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 528,
        "data": [
            {
                "id": 13464,
                "hadithNumber": "5901",
                "englishNarrator": "Abu Salama reported:",
                "hadithEnglish": "I used to see dreams, but the hadith transmitted on the authority of Laith b. Nu`man, the words of Abu Salama at the concluding part of the hadith are not mentioned. Ibn Rumh has reported in the hadith: He (one who sleeps) should change the side on which he had been lying before.",
                "hadithUrdu": "میں خواب دیکھا کرتا تھا ۔ لیث اور ابن نمیر کی روایت میں حدیث کے آخر تک ابو سلمہ کا جو قول ( منقول ) ہے وہ موجود نہیں ، ابن رمح نے اس حدیث کی روایت میں مزید یہ کہا : ہے : \" وہ جس کروٹ پر لیٹا ہواتھا اس سے دوسری کروٹ ہو جائے ۔ \"",
                "urduNarrator": "قتیبہ اور محمد بن رمح نے لیث بن سعد سے روایت کی ، محمد بن مثنیٰ نے کہا : ہمیں عبد لواہاب ثقفی نے حدیث بیان کی ، ابو بکر بن ابی شیبہ نے کہا : ہمیں عبد اللہ بن نمیر نے حدیث بیان کی ، ان سب ( لیث عبدالوہاب ثقفی ٰاور عبد اللہ بن نمیر ) نے یحییٰ بن سعید سے اسی سند کے ساتھ روایت بیان کی ، ثقفیٰ کی روایت میں ہے کہ ابو سلمہ نے کہا",
                "hadithArabic": "وَحَدَّثَنَاهُ قُتَيْبَةُ، وَمُحَمَّدُ بْنُ رُمْحٍ، عَنِ اللَّيْثِ بْنِ سَعْدٍ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ يَعْنِي الثَّقَفِيَّ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللهِ بْنُ نُمَيْرٍ كُلُّهُمْ، عَنْ يَحْيَى بْنِ سَعِيدٍ، بِهَذَا الْإِسْنَادِ. وَفِي حَدِيثِ الثَّقَفِيِّ: قَالَ أَبُو سَلَمَةَ: فَإِنْ كُنْتُ لَأَرَى الرُّؤْيَا، وَلَيْسَ فِي حَدِيثِ اللَّيْثِ، وَابْنِ نُمَيْرٍ قَوْلُ أَبِي سَلَمَةَ إِلَى آخِرِ الْحَدِيثِ وَزَادَ ابْنُ رُمْحٍ فِي رِوَايَةِ هَذَا الْحَدِيثِ: «وَلْيَتَحَوَّلْ عَنْ جَنْبِهِ الَّذِي كَانَ عَلَيْهِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "43",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 143,
                    "chapterNumber": "43",
                    "chapterEnglish": "The Book of Dreams",
                    "chapterUrdu": "خواب کا بیان",
                    "chapterArabic": "كتاب الرُّؤْيَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13465,
                "hadithNumber": "5902",
                "englishNarrator": "Abu Qatada رضی اللہ  عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: The good vision are from Allah and the evil dreams are from the satan. If one sees a dream which one does not like, one should spit on one's left side and seek the refuge of Allah from the satan; it will not do one any harm, and one should not disclose it to anyone and if one sees a good vision one should feel pleased but should not disclose it to anyone but whom one loves.",
                "hadithUrdu": "آپ نے فر ما یا : \" اچھا خواب اللہ تعا لیٰ کی طرف سے ہے ، اور برا خواب شیطان کی جانب سے ہے ، جس شخص نے کو ئی خواب دیکھا اور اس میں سے کو ئی چیز اس کو بری لگی تو وہ ( تین بار ) اپنی بائیں جانب تھوکے اور شیطان کے شر سے اللہ کی پناہ مانگے تو وہ خواب اس کو کو ئی نقصان نہیں پہنچا ئے گا اور یہ خواب وہ کسی کو بیان نہ کرے ۔ اگر اچھا خواب دیکھے تو خوش ہو اورصرف اس کو بتا ئے جو اس سے محبت کرتا ہے ۔ \"",
                "urduNarrator": "مجھ سے ابو الطاہر نے بیان کیا، کہا ہم سے عبداللہ بن وہب نے بیان کیا,عمرو بن حارث نے عبد ربہ بن سعید سے ، انھوں نے ابو سلمہ بن عبد الرحمٰن سے ، انھوں نے حضرت ابوقتادہ رضی اللہ  عنہ سے اور انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی ، کہ",
                "hadithArabic": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي قَتَادَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: «الرُّؤْيَا الصَّالِحَةُ مِنَ اللهِ، وَالرُّؤْيَا السَّوْءُ مِنَ الشَّيْطَانِ، فَمَنْ رَأَى رُؤْيَا فَكَرِهَ مِنْهَا شَيْئًا فَلْيَنْفُثْ عَنْ يَسَارِهِ، وَلْيَتَعَوَّذْ بِاللهِ مِنَ الشَّيْطَانِ، لَا تَضُرُّهُ وَلَا يُخْبِرْ بِهَا أَحَدًا، فَإِنْ رَأَى رُؤْيَا حَسَنَةً، فَلْيُبْشِرْ وَلَا يُخْبِرْ إِلَّا مَنْ يُحِبُّ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "43",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 143,
                    "chapterNumber": "43",
                    "chapterEnglish": "The Book of Dreams",
                    "chapterUrdu": "خواب کا بیان",
                    "chapterArabic": "كتاب الرُّؤْيَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13466,
                "hadithNumber": "5903",
                "englishNarrator": "Abu Salama reported:",
                "hadithEnglish": "I used to see (such horrible dreams) that I fell ill. I saw Abu Qatada رضی اللہ عنہ who also said: I used to see dreams which made me sick until I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Good dreams are from Allah, so if any one of you sees which he likes he should not disclose it to one but whom he loves, but if he sees something which he does not like he should spit on his left side thrice and seek refuge with Allah from the mischief of the Satan and its mischief (i.e. of the dream), and he should not relate it to anyone, then it would not harm him.",
                "hadithUrdu": "بعض اوقات میں ایسا خواب دیکھتا تھا جس سے میں بیمار پڑجاتا تھا ، یہاں تک کہ میری حضرت ابو قتادہ رضی اللہ عنہ سے ملا قات ہو ئی تو انھوں نے کہا : میں بھی بعض اوقات خواب دیکھتا تھا جو مجھے بیمار کر دیتے تھے ، یہاں تک کہ میں رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہو ئے سنا ، \" اچھا خواب اللہ کی جانب سے ہو تا ہے ، جب تم میں سے کو ئی شخص اچھا خواب دیکھےتو وہ صرف اس شخص کو بتا ئے جو ( اس سے ) محبت کرتا ہو اور اگر ناپسندیدہ خواب دیکھےتو تین بار اپنی بائیں جا نب تھوکےاور تین بار شیطان اور اس خواب کے شر سے اللہ کی پناہ مانگے اور وہ خواب کسی کو نہ بتا ئے تو وہ اسے کو ئی نقصان نہیں پہنچا ئے گا ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن خلاد باہلی اور احمد بن عبداللہ بن الحکم نے بیان کیا، کہا کہ ہم سے محمد بن جعفر نے بیان کیا، شعبہ نے عبدربہ بن سعید سے ، انھوں نے ابو سلمہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلَّادٍ الْبَاهِلِيُّ، وَأَحْمَدُ بْنُ عَبْدِ اللهِ بْنِ الْحَكَمِ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ، عَنْ أَبِي سَلَمَةَ، قَالَ: إِنْ كُنْتُ لَأَرَى الرُّؤْيَا تُمْرِضُنِي، قَالَ: فَلَقِيتُ أَبَا قَتَادَةَ، فَقَالَ: وَأَنَا كُنْتُ لَأَرَى الرُّؤْيَا فَتُمْرِضُنِي، حَتَّى سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «الرُّؤْيَا الصَّالِحَةُ مِنَ اللهِ، فَإِذَا رَأَى أَحَدُكُمْ مَا يُحِبُّ، فَلَا يُحَدِّثْ بِهَا إِلَّا مَنْ يُحِبُّ، وَإِنْ رَأَى مَا يَكْرَهُ فَلْيَتْفُلْ عَنْ يَسَارِهِ ثَلَاثًا وَلْيَتَعَوَّذْ بِاللهِ مِنْ شَرِّ الشَّيْطَانِ وَشَرِّهَا، وَلَا يُحَدِّثْ بِهَا أَحَدًا فَإِنَّهَا لَنْ تَضُرَّهُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "43",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 143,
                    "chapterNumber": "43",
                    "chapterEnglish": "The Book of Dreams",
                    "chapterUrdu": "خواب کا بیان",
                    "chapterArabic": "كتاب الرُّؤْيَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13467,
                "hadithNumber": "5904",
                "englishNarrator": "Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: If anyone sees a dream which he does not like, he should spit on his left side three times, and seek refuge with Allah from the Satan three times, and let him turn over from the side on which he was sleeping.",
                "hadithUrdu": "آپ نے فرما یا : \" جب تم میں سے کو ئی شخص ایسا خواب دیکھے جو اسے برا لگے تو تین بار اپنی بائیں جانب تھوکے اور تین بار شیطان سے اللہ کی پناہ مانگے اور جس کروٹ لیٹا ہوا تھا اسے بدل لے ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ہم سے لیث نے بیان کیا، ان سے حذیفہ نے بیان کیا، اور ہم سے ابن روم نے بیان کیا، ہم سے لیث نے بیان کیا، ابو الزبیر رضی اللہ عنہ سے, حضرت جا بر رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا ابْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: «إِذَا رَأَى أَحَدُكُمُ الرُّؤْيَا يَكْرَهُهَا، فَلْيَبْصُقْ عَنْ يَسَارِهِ ثَلَاثًا وَلْيَسْتَعِذْ بِاللهِ مِنَ الشَّيْطَانِ ثَلَاثًا، وَلْيَتَحَوَّلْ عَنْ جَنْبِهِ الَّذِي كَانَ عَلَيْهِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "43",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 143,
                    "chapterNumber": "43",
                    "chapterEnglish": "The Book of Dreams",
                    "chapterUrdu": "خواب کا بیان",
                    "chapterArabic": "كتاب الرُّؤْيَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13468,
                "hadithNumber": "5905",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When the time draws near (when the Resurrection is near) a believer's dream can hardly be false. And the truest vision will be of one who is himself the most truthful in speech, for the vision of a Muslim is the forty-fifth part of Prophecy, and dreams are of three types: one good dream which is a sort of good tidings from Allah; the evil dream which causes pain is from the satan; and the third one is a suggestion of one's own mind; so if any one of you sees a dream which he does not like he should stand up and offer prayer and he should not relate it to people, and he said: I would love to see fetters (in the dream), but I dislike wearing of necklace, for the fetters is (an indication of) one's steadfastness in religion. The narrator said: I do not know whether this is a part of the hadith or the words of Ibn Sirin.",
                "hadithUrdu": "آپ نے فرما یا : \" ( قیامت کا ) زمانہ قریب آجا ئے گا تو کسی مسلمان کا خواب جھوٹا نہ نکلے گا ۔ تم میں سے ان کے خواب زیادہ سچے ہوں گے جو بات میں زیادہ سچے ہوں گے ۔ ۔ مسلمان کا خواب نبوت کے پنتالیس حصوں میں سے ایک ( پنتالیسواں ) حصہ ہے خواب تین طرح کے ہو تے ہیں ۔ اچھا خواب اللہ کی طرف سے خوش خبری ہو تی ہے ۔ ایک خواب شیطان کی طرف سے غمگین کرنے کے لیے ہوتا ہے ۔ اور ایک خواب وہ جس میں انسان خود اپنے آپ سے بات کرتا ہے ۔ ( اس کے اپنے تخیل کی کا ر فرما ئی ہو تی ہے ۔ ) اگر تم میں سے کو ئی شخص ناپسندیدہ سخواب دیکھے تو کھڑا ہو جا ئے اور نماز پڑھے اور لوگوں کو اس کے بارے میں کچھ نہ بتا ئے ۔ \" فرما یا : \" ( پاؤں کی ) بیڑی خواب میں دیکھنا ) مجھے پسند ہے اور گلے کا ) طوق ناپسند ہے ۔ بیڑی دین میں ثابت قدمی ( کی علامت ) ہے ۔ \" ( ثقفی نے ایوب سختیانی سے نقل کرتے ہو ئے کہا : ) تو مجھے معلوم نہیں کہ یہ بات حدیث ( نبوی ) میں ہے یا بن سیرین نے کہی ہے ۔",
                "urduNarrator": "ہم سے محمد بن ابی عمر المکی نے بیان کیا, عبد الو ہاب ثقفیٰ نے ایوب سختیانی سے ، انھوں نے محمد بن سیرین سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے ، انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْمَكِّيُّ، حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، عَنْ أَيُّوبَ السَّخْتِيَانِيِّ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: إِذَا اقْتَرَبَ الزَّمَانُ لَمْ تَكَدْ رُؤْيَا الْمُسْلِمِ تَكْذِبُ، وَأَصْدَقُكُمْ رُؤْيَا أَصْدَقُكُمْ حَدِيثًا، وَرُؤْيَا الْمُسْلِمِ جُزْءٌ مِنْ خَمْسٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ، وَالرُّؤْيَا ثَلَاثَةٌ: فَرُؤْيَا الصَّالِحَةِ بُشْرَى مِنَ اللهِ، وَرُؤْيَا تَحْزِينٌ مِنَ الشَّيْطَانِ، وَرُؤْيَا مِمَّا يُحَدِّثُ الْمَرْءُ نَفْسَهُ، فَإِنْ رَأَى أَحَدُكُمْ مَا يَكْرَهُ فَلْيَقُمْ فَلْيُصَلِّ، وَلَا يُحَدِّثْ بِهَا النَّاسَ قَالَ: «وَأُحِبُّ الْقَيْدَ وَأَكْرَهُ الْغُلَّ وَالْقَيْدُ ثَبَاتٌ فِي الدِّينِ» فَلَا أَدْرِي هُوَ فِي الْحَدِيثِ أَمْ قَالَهُ ابْنُ سِيرِينَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "43",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 143,
                    "chapterNumber": "43",
                    "chapterEnglish": "The Book of Dreams",
                    "chapterUrdu": "خواب کا بیان",
                    "chapterArabic": "كتاب الرُّؤْيَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13469,
                "hadithNumber": "5906",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "I love to see fetters but I hate necklace (in a dream), for fetters signifies one's steadfastness in religion, and he also reported Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: The vision of a believer is forty-sixth part of Prophecy.",
                "hadithUrdu": "تو مجھے بیڑی ( خواب میں دیکھنی ) اچھی لگتی ہے ۔ اور طوق ناپسند ہے ۔ بیڑی دین میں ثابت قدمی ( کو طاہر کرتی ) ہے اور نبی صلی اللہ علیہ وسلم نے فر ما یا : \" مسلمان کا ( سچا ) خواب نبوت کے چھیالیس حصوں میں سے ایک ( چھیا لیسواں ) حصہ ہے ۔",
                "urduNarrator": "مجھ سے محمد بن رافع نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا, معمر نے ایوب سے اسی سند کے ساتھ خبر دی اور حدیث میں کہا کہ حضرت ابو ہریرہ رضی اللہ عنہ نے کہا",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ أَيُّوبَ، بِهَذَا الْإِسْنَادِ، وَقَالَ فِي الْحَدِيثِ: قَالَ أَبُو هُرَيْرَةَ: فَيُعْجِبُنِي الْقَيْدُ، وَأَكْرَهُ الْغُلَّ، وَالْقَيْدُ ثَبَاتٌ فِي الدِّينِ. وَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «رُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "43",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 143,
                    "chapterNumber": "43",
                    "chapterEnglish": "The Book of Dreams",
                    "chapterUrdu": "خواب کا بیان",
                    "chapterArabic": "كتاب الرُّؤْيَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13470,
                "hadithNumber": "5907",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been transmitted on the authority of Abu Huraira رضی اللہ عنہ and the words are: When the time draws near, the rest of the hadith is the same.",
                "hadithUrdu": "ابو الربیع نے مجھ سے کہا, حماد بن زید نے کہا : ہمیں ایو ب اور ہشام نے محمد ( بن سیرین ) سے حدیث بیان کی ، انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی ، کہا : جب ( قیامت کا ) زمانہ قریب آجا ئے گا ۔ اور حدیث بیان کی اور ( محمد بن سیرین نے ) اس میں نبی صلی اللہ علیہ وسلم کا ذکر نہیں کیا ( حضرت ابو ہریرہ رضی اللہ عنہ سے موقوف روایت بیان کی).",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنِي أَبُو الرَّبِيعِ، حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ، حَدَّثَنَا أَيُّوبُ، وَهِشَامٌ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: إِذَا اقْتَرَبَ الزَّمَانُ وَسَاقَ الْحَدِيثَ وَلَمْ يَذْكُرْ فِيهِ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "43",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 143,
                    "chapterNumber": "43",
                    "chapterEnglish": "The Book of Dreams",
                    "chapterUrdu": "خواب کا بیان",
                    "chapterArabic": "كتاب الرُّؤْيَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13471,
                "hadithNumber": "5908",
                "englishNarrator": "Muhammad bin Sirin reported from Abu Huraira رضی اللہ عنہ a hadith from Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and he mentioned in his hadith his words:",
                "hadithEnglish": "I dislike shackles, up to the end of his statement, but he made no mention of this: A vision is a forty-sixth part of Prophecy.",
                "hadithUrdu": "\" مجھے طوق ناپسند ہے \" حدیث کے آخر تک اور انھوں نے یہ نہیں کہا : \" ( اچھا ) کواب نبوت کے چھیالیس حصوں میں سے ایک حصہ ہے ۔ \"",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے معاذ بن ہشام نے بیان کیا، ہم سے میرے والد نے بیان کیا, قتادہ نے محمد بن سیرین سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے ، انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ، انھوں نے ( قتادہ ) نے ان ( حضرت ابوہریرہ رضی اللہ تعالیٰ عنہ ) کے اس قول کو حدیث کے ساتھ ملا دیا",
                "hadithArabic": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنَا أَبِي، عَنْ قَتَادَةَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَأَدْرَجَ فِي الْحَدِيثِ قَوْلَهُ: وَأَكْرَهُ الْغُلَّ، إِلَى تَمَامِ الْكَلَامِ، وَلَمْ يَذْكُرْ «الرُّؤْيَا جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "43",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 143,
                    "chapterNumber": "43",
                    "chapterEnglish": "The Book of Dreams",
                    "chapterUrdu": "خواب کا بیان",
                    "chapterArabic": "كتاب الرُّؤْيَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13472,
                "hadithNumber": "5909",
                "englishNarrator": "Ubada bin as-Samit رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The vision of a believer is the forty-sixth part of Prophecy.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : ایک مو من کا رؤیا نبوت کے چھیالیس حصوں میں سے ایک حصہ ہے ۔",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا, محمد بن جعفر ، ابو داود عبد الرحمٰن بن مہدی اور معاذ عنبری ۔ الفاظ انھی کے ہیں ۔ ان سب نے شعبہ سے روایت کی ، انھوں نے قتادہ سے انھوں نے حضرت انس بن مالک رضی اللہ عنہ سے ، انھوں نے عباد د بن صامت رضی اللہ عنہ سے روایت کی ، انھوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، وَأَبُو دَاوُدَ، وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، كُلُّهُمْ عَنْ شُعْبَةَ، ح وَحَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ - وَاللَّفْظُ لَهُ - حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «رُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "43",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 143,
                    "chapterNumber": "43",
                    "chapterEnglish": "The Book of Dreams",
                    "chapterUrdu": "خواب کا بیان",
                    "chapterArabic": "كتاب الرُّؤْيَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13473,
                "hadithNumber": "5910",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Anas bin Malik رضی اللہ عنہ through another chain of transmitters.",
                "hadithUrdu": "ہم سے عبید اللہ بن معاذ نے بیان کیا، کہا ہم سے میرے والد نے بیان کیا، ہم سے شعبہ نے بیان کیا, ثابت بُنانی نے انس بن مالک رضی اللہ عنہ سے انھوں نے نبی صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی .",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِثْلَ ذَلِكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "43",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 143,
                    "chapterNumber": "43",
                    "chapterEnglish": "The Book of Dreams",
                    "chapterUrdu": "خواب کا بیان",
                    "chapterArabic": "كتاب الرُّؤْيَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13474,
                "hadithNumber": "5911",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Verily the vision of a believer is one of the forty-sixth part of Prophecy.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے فرما یا : \" بلا شبہ مو من کا ( سچا ) خواب نبوت کے چھیالیس حصوں میں سے ایک حصہ ہے ۔ \"",
                "urduNarrator": "ہم سے عبد بن حمید نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، کہا ہم سے معمر نے بیان کیا، زہری کی سند سے, ابن مسیب نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنِ ابْنِ الْمُسَيِّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ رُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "43",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 143,
                    "chapterNumber": "43",
                    "chapterEnglish": "The Book of Dreams",
                    "chapterUrdu": "خواب کا بیان",
                    "chapterArabic": "كتاب الرُّؤْيَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13475,
                "hadithNumber": "5912",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The vision of a Muslim which he sees or which is shown to him, and in the hadith transmitted on the authority of Ibn Mushir (the words are): The pious dream is the forty-sixth part of Prophecy.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" مسلمان کا ( سچا ) خواب خواہ وہ خود دیکھے یا اس کے متعلق ( کو ئی اور ) دیکھے ۔ \" اور ابن مسہر کی روایت میں ہے : \" اچھا خواب نبوت کے چھیالیس حصوں میں سے ایک حصہ ہے ۔ \"",
                "urduNarrator": "ہم سے اسماعیل بن الخلیل نے بیان کیا, علی بن مسہر اور عبدا للہ بن نمیر نے اعمش سے ، انھوں نے ابو صالح سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنَا إِسْمَاعِيلُ بْنُ الْخَلِيلِ، أَخْبَرَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنِ الْأَعْمَشِ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الْأَعْمَشُ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «رُؤْيَا الْمُسْلِمِ يَرَاهَا أَوْ تُرَى لَهُ» وَفِي حَدِيثِ ابْنِ مُسْهِرٍ «الرُّؤْيَا الصَّالِحَةُ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "43",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 143,
                    "chapterNumber": "43",
                    "chapterEnglish": "The Book of Dreams",
                    "chapterUrdu": "خواب کا بیان",
                    "chapterArabic": "كتاب الرُّؤْيَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13476,
                "hadithNumber": "5913",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The vision of a pious man is the forty-sixth part of Prophecy.",
                "hadithUrdu": "آپ نے فرما یا : \" نیک انسان کا خواب نبوت کے چھیالیس حصوں میں سے ایک حصہ ہے ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا, عبد اللہ بن یحییٰ بن ابی کثیر نے کہا , میں نے اپنے والد سے سنا ، وہ کہہ رہے تھے , ہمیں ابو سلمہ نے حضرت ابو ہریرہ رضی اللہ عنہ سے حدیث بیان کی ، انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا عَبْدُ اللهِ بْنُ يَحْيَى بْنِ أَبِي كَثِيرٍ، قَالَ: سَمِعْتُ أَبِي، يَقُولُ: حَدَّثَنَا أَبُو سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «رُؤْيَا الرَّجُلِ الصَّالِحِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "43",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 143,
                    "chapterNumber": "43",
                    "chapterEnglish": "The Book of Dreams",
                    "chapterUrdu": "خواب کا بیان",
                    "chapterArabic": "كتاب الرُّؤْيَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13477,
                "hadithNumber": "5914",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Yahya bin Abu Kathir with the same chain of transmitters.",
                "hadithUrdu": "ہم سے محمد بن المثنی نے بیان کیا، کہا ہم سے عثمان بن عمر نے بیان کیا, علی بن مبارک اور حرب بن شداددونوں نے یحییٰ بن ابی کثیر سے اسی سند کے ساتھ روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، حَدَّثَنَا عَلِيٌّ يَعْنِي ابْنَ الْمُبَارَكِ، ح وَحَدَّثَنَا أَحْمَدُ بْنُ الْمُنْذِرِ، حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا حَرْبٌ يَعْنِي ابْنَ شَدَّادٍ كِلَاهُمَا، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، بِهَذَا الْإِسْنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "43",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 143,
                    "chapterNumber": "43",
                    "chapterEnglish": "The Book of Dreams",
                    "chapterUrdu": "خواب کا بیان",
                    "chapterArabic": "كتاب الرُّؤْيَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13478,
                "hadithNumber": "5915",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Abu Huraira رضی اللہ عنہ through another chain of transmitters.",
                "hadithUrdu": "ہم سے محمد بن رافع نے بیان کیا، ہم سے عبدالرزاق نے بیان کیا، ہم سے معمر نے بیان کیا, ہمام بن منبہ نے حضرت ابو ہریرہ رضی اللہ عنہ سے ، انھوں نے نبی صلی اللہ علیہ وسلم سے ، عبد اللہ بن یحییٰ بن ابی کثیرکی اپنے والد سے روایت کردہ حدیث کے مطا بق روایت کی ،",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، بِمِثْلِ حَدِيثِ عَبْدِ اللهِ بْنِ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِيهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "43",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 143,
                    "chapterNumber": "43",
                    "chapterEnglish": "The Book of Dreams",
                    "chapterUrdu": "خواب کا بیان",
                    "chapterArabic": "كتاب الرُّؤْيَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13479,
                "hadithNumber": "5916",
                "englishNarrator": "Ibn `Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: The pious dreams are the seventieth part of Prophecy.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" اچھا خواب نبوت کے ستر حصوں میں سے ایک حصہ ( سترواں 70/1حصہ ) ہے ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, ابو اسامہ اور عبد اللہ بن نمیردونوں نے کہا : ہمیں عبید اللہ نے نافع سے حدیث بیان کی ، انھوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی ،",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي قَالَا: جَمِيعًا حَدَّثَنَا عُبَيْدُ اللهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الرُّؤْيَا الصَّالِحَةُ جُزْءٌ مِنْ سَبْعِينَ جُزْءًا مِنَ النُّبُوَّةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "43",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 143,
                    "chapterNumber": "43",
                    "chapterEnglish": "The Book of Dreams",
                    "chapterUrdu": "خواب کا بیان",
                    "chapterArabic": "كتاب الرُّؤْيَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13480,
                "hadithNumber": "5917",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been reported on the authority of `Ubaidullah with the same chain of transmitters.",
                "hadithUrdu": "ہم سے ابن المثنی اور عبید اللہ بن سعید نے بیان کیا، انہوں نے کہا: یحییٰ نے عبید اللہ سے اسی سند کے ساتھ ( یہی ) حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَاهُ ابْنُ الْمُثَنَّى، وَعُبَيْدُ اللهِ بْنُ سَعِيدٍ، قَالَا: حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللهِ بِهَذَا الْإِسْنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "43",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 143,
                    "chapterNumber": "43",
                    "chapterEnglish": "The Book of Dreams",
                    "chapterUrdu": "خواب کا بیان",
                    "chapterArabic": "كتاب الرُّؤْيَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13481,
                "hadithNumber": "5918",
                "englishNarrator": "A hadith like this has been reported on the authority of Nafi` with the same chain of transmitters (and the words are):",
                "hadithEnglish": "I think Ibn `Umar رضی اللہ عنہ said: The seventieth part from Prophecy.",
                "hadithUrdu": "حضرت ابن عمر رضی اللہ عنہ نے \" نبوت کےستر حصوں میں سے ایک حصہ کہا تھا ۔",
                "urduNarrator": "ہم سے قتیبہ اور ابن رومح نے بیان کیا، ان سے لیث بن سعد نے بیان کیا، ہم سے ابن رافع نے بیان کیا، ہم سے ابن ابی فدائک نے بیان کیا، انہیں ضحاک نے خبر دی، یعنی ابن عثمان دونوں , نافع نے کہا : میں سمجھتا ہوں کہ",
                "hadithArabic": "وَحَدَّثَنَاهُ قُتَيْبَةُ، وَابْنُ رُمْحٍ، عَنِ اللَّيْثِ بْنِ سَعْدٍ، ح وَحَدَّثَنَا ابْنُ رَافِعٍ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، أَخْبَرَنَا الضَّحَّاكُ يَعْنِي ابْنَ عُثْمَانَ كِلَاهُمَا، عَنْ نَافِعٍ بِهَذَا الْإِسْنَادِ. وَفِي حَدِيثِ اللَّيْثِ، قَالَ نَافِعٌ: حَسِبْتُ أَنَّ ابْنَ عُمَرَ قَالَ: «جُزْءٌ مِنْ سَبْعِينَ جُزْءًا مِنَ النُّبُوَّةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "43",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 143,
                    "chapterNumber": "43",
                    "chapterEnglish": "The Book of Dreams",
                    "chapterUrdu": "خواب کا بیان",
                    "chapterArabic": "كتاب الرُّؤْيَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13482,
                "hadithNumber": "5919",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who saw me in a dream in fact saw me, for the satan does not appear in my form.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" جس نے خواب میں مجھے دیکھا تو اس نے مجھی کو دیکھا کیونکہ شیطان میری شکل اختیار نہیں کر سکتا ۔ \"",
                "urduNarrator": "ہم سے ابو الربیع سلیمان بن داؤد العتکی نے بیان کیا، ان سے حماد نے بیان کیا، ان سے ابن زید نے بیان کیا، ہم سے ایوب اور ہشام نے بیان کیا، محمد ( بن سیرین ) نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو الرَّبِيعِ سُلَيْمَانُ بْنُ دَاوُدَ الْعَتَكِيُّ، حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ، حَدَّثَنَا أَيُّوبُ، وَهِشَامٌ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ رَآنِي فِي الْمَنَامِ فَقَدْ رَآنِي، فَإِنَّ الشَّيْطَانَ لَا يَتَمَثَّلُ بِي».",
                "headingArabic": "قَوْلِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ مَنْ رَآنِي فِي الْمَنَامِ فَقَدْ رَآنِي ‏\"‏ ‏",
                "headingUrdu": "رسول اللہ صلی اللہ علیہ وسلم کا ارشاد ہے: جس نے مجھے خواب میں دیکھا اس نے مجھے ہی دیکھا۔",
                "headingEnglish": "The Words Of The Prophet (SAW): \"Whoever Sees Me In A Dream Has Indeed Seen Me.\"",
                "chapterId": "43",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 143,
                    "chapterNumber": "43",
                    "chapterEnglish": "The Book of Dreams",
                    "chapterUrdu": "خواب کا بیان",
                    "chapterArabic": "كتاب الرُّؤْيَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13483,
                "hadithNumber": "5920",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: He who saw me in a dream would soon see me in the state of wakefulness, or as if he saw me in a state of wakefulness, for the satan does not appear in my form.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہو ئے سنا ، \" جس شخص نے خواب میں مجھے دیکھا وہ عنقریب بیداری میں بھی مجھے دیکھ لے گا یا ( فرما یا : ) گو یا اس نے مجھ کو بیداری کے عالم میں دیکھا ، شیطان میری صورت اختیار نہیں کر سکتا ۔ \"",
                "urduNarrator": "مجھ سے ابو الطاہر اور حرملہ نے بیان کیا، کہا کہ ہم سے ابن وہب نے بیان کیا, یو نس نے ابن شہاب سے روایت کی ، کہا : مجھے ابو سلمہ بن عبدالرحمٰن نے حدیث بیان کی کہ حضرت ابو ہریرہ رضی اللہ عنہ نے کہا",
                "hadithArabic": "وحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، قَالَا: أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ رَآنِي فِي الْمَنَامِ فَسَيَرَانِي فِي الْيَقَظَةِ، أَوْ لَكَأَنَّمَا رَآنِي فِي الْيَقَظَةِ، لَا يَتَمَثَّلُ الشَّيْطَانُ بِي».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "43",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 143,
                    "chapterNumber": "43",
                    "chapterEnglish": "The Book of Dreams",
                    "chapterUrdu": "خواب کا بیان",
                    "chapterArabic": "كتاب الرُّؤْيَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13484,
                "hadithNumber": "5921",
                "englishNarrator": "Abu Qatada رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who saw me in dream in fact saw the truth (what is true).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" جس نے مجھے دیکھا اس نے سچ مچ ( سچا خواب ) دیکھا ۔ \"",
                "urduNarrator": "( ابن شہاب نے ) کہا : ابو سلمہ نے کہا : حضرت ابوقتادہ رضی اللہ عنہ نے کہا کہ",
                "hadithArabic": "وَقَالَ فَقَالَ أَبُو سَلَمَةَ: قَالَ أَبُو قَتَادَةَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ رَآنِي فَقَدْ رَأَى الْحَقَّ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "43",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 143,
                    "chapterNumber": "43",
                    "chapterEnglish": "The Book of Dreams",
                    "chapterUrdu": "خواب کا بیان",
                    "chapterArabic": "كتاب الرُّؤْيَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13485,
                "hadithNumber": "5922",
                "englishNarrator": null,
                "hadithEnglish": "The above two hadith have been narrated likewise through another chain of transmitters.",
                "hadithUrdu": "مجھ سے زہیر بن حرب نے بیان کیا، ہم سے یعقوب بن ابراہیم نے بیان کیا، ہم سے میرےزہری کے بھتیجے نے کہا : مجھے میرے چچا نے حدیث بیان کی ، پھر دونوں احادیث اکٹھی ان کی دونوں سندوں سمیت بیان کیں ، بالکل یونس کی حدیث  کی طرح ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ أَخِي الزُّهْرِيِّ، حَدَّثَنَا عَمِّي، فَذَكَرَ الْحَدِيثَيْنِ جَمِيعًا بِإِسْنَادَيْهِمَا، سَوَاءً مِثْلَ حَدِيثِ يُونُسَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "43",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 143,
                    "chapterNumber": "43",
                    "chapterEnglish": "The Book of Dreams",
                    "chapterUrdu": "خواب کا بیان",
                    "chapterArabic": "كتاب الرُّؤْيَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13486,
                "hadithNumber": "5923",
                "englishNarrator": "Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who saw me in sleep in fact saw me, for it is not possible for the satan to appear in my form; and he also said: When any one of you sees a hulm he should not inform anyone, for it is a sort of vain sport of devil in the state of sleep.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جس شخص نے مجھے خواب میں دیکھا اس نے مجھی کو دیکھا ، کیونکہ شیطان میری صورت اختیار نہیں کرسکتا ۔ \" اور آپ صلی اللہ علیہ وسلم نے ( یہ بھی ) فرمایا : \" جب تم میں سے کوئی شخص برا خواب دیکھے تو وہ نیند کے عالم میں اپنے ساتھ شیطان کے کھیلنے کی کسی دوسرے کوخبر نہ دے ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, لیث نے ابو زبیر سے ، انھوں نے حضرت جابر رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، وَحَدَّثَنَا ابْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ رَآنِي فِي النَّوْمِ فَقَدْ رَآنِي، إِنَّهُ لَا يَنْبَغِي لِلشَّيْطَانِ أَنْ يَتَمَثَّلَ فِي صُورَتِي» وَقَالَ: «إِذَا حَلَمَ أَحَدُكُمْ فَلَا يُخْبِرْ أَحَدًا بِتَلَعُّبِ الشَّيْطَانِ بِهِ فِي الْمَنَامِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "43",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 143,
                    "chapterNumber": "43",
                    "chapterEnglish": "The Book of Dreams",
                    "chapterUrdu": "خواب کا بیان",
                    "chapterArabic": "كتاب الرُّؤْيَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13487,
                "hadithNumber": "5924",
                "englishNarrator": "Jabir bin `Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who saw me in a dream in fact saw me, for the satan cannot assume my form.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جس شخص نے نیند میں مجھے دیکھا تو اس نے مجھی کو دیکھا کیونکہ شیطان کے بس میں نہیں کہ وہ میری مشابہت اختیار کرسکے ۔ \"",
                "urduNarrator": "اور مجھ سے محمد بن حاتم نے بیان کیا، ہم سے ایک روح نے بیان کیا، زکریا بن اسحاق نے کہا : مجھے ابو زبیر نے حدیث بیان کی کہ انھوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے کہ",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا رَوْحٌ، حَدَّثَنَا زَكَرِيَّاءُ بْنُ إِسْحَاقَ، حَدَّثَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ رَآنِي فِي النَّوْمِ فَقَدْ رَآنِي، فَإِنَّهُ لَا يَنْبَغِي لِلشَّيْطَانِ أَنْ يَتَشَبَّهَ بِي».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "43",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 143,
                    "chapterNumber": "43",
                    "chapterEnglish": "The Book of Dreams",
                    "chapterUrdu": "خواب کا بیان",
                    "chapterArabic": "كتاب الرُّؤْيَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13488,
                "hadithNumber": "5925",
                "englishNarrator": "Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: There came to him (the Holy Prophet) a desert Arab and said: I saw in a dream that I had been beheaded and I had been following it (the severed head). Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) reprimanded him saying: Do not inform about the vain sporting of devil with you during the night.",
                "hadithUrdu": "اعرابی ( بدوی ) نے ، جو آپ کے پاس آیا تھا ، آپ سے عرض کی : میں نے خواب میں دیکھا ہے کہ میرا سرکٹ گیا ہے اور میں اس کے پیچھے بھاگ رہا ہوں ۔ رسول اللہ صلی اللہ علیہ وسلم نے اسے ڈانٹا اورفرمایا : \" نیند کے عالم میں اپنے ساتھ شیطان کے کھیلنے کے بارے میں کسی کو مت بتاؤ ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ہم سے لیث نے بیان کیا، ان سے حذیفہ نے، اور ہم سے ابن روم نے بیان کیا، ہم سے لیث نے بیان کیا، ابو زبیر نے حضرت جابر رضی اللہ عنہ سے اور انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا ابْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ لِأَعْرَابِيٍّ جَاءَهُ فَقَالَ: إِنِّي حَلَمْتُ أَنَّ رَأْسِي قُطِعَ فَأَنَا أَتَّبِعُهُ، فَزَجَرَهُ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَقَالَ: «لَا تُخْبِرْ بِتَلَعُّبِ الشَّيْطَانِ بِكَ فِي الْمَنَامِ».",
                "headingArabic": "لاَ يُخْبِرُ بِتَلَعُّبِ الشَّيْطَانِ بِهِ فِي الْمَنَامِ ‏‏",
                "headingUrdu": "کسی کو یہ نہیں کہنا چاہئے کہ شیطان نے نیند میں اس کے ساتھ کیسے کھلواڑ کیا۔",
                "headingEnglish": "No One Should Speak Of How The Shaitan Toyed With Him In His Sleep",
                "chapterId": "43",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 143,
                    "chapterNumber": "43",
                    "chapterEnglish": "The Book of Dreams",
                    "chapterUrdu": "خواب کا بیان",
                    "chapterArabic": "كتاب الرُّؤْيَا",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 13176,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=527",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=525",
                "label": "525",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=526",
                "label": "526",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=527",
                "label": "527",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=528",
                "label": "528",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=529",
                "label": "529",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=530",
                "label": "530",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=531",
                "label": "531",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=529",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=529",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=527",
        "to": 13200,
        "total": 40465
    }
}