{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 551,
        "data": [
            {
                "id": 14039,
                "hadithNumber": "6476",
                "englishNarrator": "It was narrated from Shubah with this chain of narrators (a Hadith similar to no. 6775). In their hadith it says:",
                "hadithEnglish": "I do not know whether he made a mention of two generations after his generation or of the third one too. Shababa said: I heard this from Zahdam bin Mudarrib as he came to me riding a horse for some need and he narrated it to me that he had heard it from 'Imran bin Husain رضی اللہ عنہ , and in the hadith transmitted on the authority of Yahya and Shababa (the words are): They take an oath but they do not fulfil it, and in the hadith transmitted on the authority of Bahz there the word is Yafun as transmitted on the authority of Ibn Ja'far.",
                "hadithUrdu": "مجھے یاد نہیں کہ  آپ صلی اللہ علیہ وسلم نے اپنے زمانے کےبعد دو زمانوں کا ذکر کیا یا تین کا ، شبابہ کی حدیث میں ہے کہ ( ابو جمرہ نے ) کہا : میں نے زہدم بن مضرب سےسنا ، وہ گھوڑے پرسوارہوکرمیرے پاس ایک کام کے لئے آئے تھے ، انھوں نے مجھے حدیث سنائی کہ انھوں نے حضرت عمران بن حصین رضی اللہ عنہ سے سنا ، نیز یحییٰ ( بن سعید ) اورشبابہ کی حدیث میں ہے : \" وہ نذریں مانیں گے لیکن وفا نہیں کریں گے ۔ \" اور بہز کی حدیث میں اسی طرح ہے جس طرح ابن جعفر کی حدیث میں ہے : \" وہ ( اپنی نذریں ) پوری نہیں کریں گے ۔ \"",
                "urduNarrator": "مجھ سے محمد بن حاتم نے کہا, یحییٰ بن سعید ، بہز اور شبابہ سب نے شعبہ سے اسی سند کے ساتھ حدیث بیان کی اور ان سب کی حدیث میں ہے ( حضرت عمران بن حصین رضی اللہ تعالیٰ عنہ نے ) کہا",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، ح وَحَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ بِشْرٍ الْعَبْدِيُّ، حَدَّثَنَا بَهْزٌ، ح وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا شَبَابَةُ، كُلُّهُمْ، عَنْ شُعْبَةَ، بِهَذَا الْإِسْنَادِ، وَفِي حَدِيثِهِمْ: قَالَ: لَا أَدْرِي أَذَكَرَ بَعْدَ قَرْنِهِ قَرْنَيْنِ أَوْ ثَلَاثَةً، وَفِي حَدِيثِ شَبَابَةَ قَالَ: سَمِعْتُ زَهْدَمَ بْنَ مُضَرِّبٍ، وَجَاءَنِي فِي حَاجَةٍ عَلَى فَرَسٍ، فَحَدَّثَنِي أَنَّهُ سَمِعَ عِمْرَانَ بْنَ حُصَيْنٍ، وَفِي حَدِيثِ يَحْيَى، وَشَبَابَةَ «يَنْذُرُونَ وَلَا يَفُونَ» وَفِي حَدِيثِ بَهْزٍ «يُوفُونَ» كَمَا قَالَ ابْنُ جَعْفَرٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14040,
                "hadithNumber": "6477",
                "englishNarrator": "This hadith has been narrated on the authority of 'Imran bin Husain رضی اللہ عنہ through another chain of transmitters (and the words are):",
                "hadithEnglish": "The best generation of this Umma is the generation to which I have been sent, then the next one, and there is an addition in the hadith transmitted on the authority of Abu 'Awana (and the words are): And Allah knows best whether he made a mention of the third (generation) or not; the rest of the hadith is the same as transmitted by Zahdam on the authority of 'Imran رضی اللہ عنہ . And in the hadith transmitted by Hisham on the authority of Qatada there is an addition of these words: They take an oath whereas they are not asked to take.",
                "hadithUrdu": "\" اس امت کے بہترین لوگ اس دور کے ہیں جس میں مجھے ان میں بھیجاگیا ہے ، پھر وہ جوان کےساتھ ( کے دور میں ) ہوں گے ۔ \" ۔ ۔ ۔ ابو عوانہ کی حدیث میں مزید یہ ہے کہ ( حضرت عمران رضی اللہ تعالیٰ عنہ نے ) کہا : اللہ زیادہ جاننے والا ہے کہ آپ صلی اللہ علیہ وسلم نے تیسرے ( دور ) کا ذکر کیا یا نہیں ، جس طرح حضرت عمران بن حصین رضی اللہ عنہ سےزہدم کی روایت کردہ حدیث ہے ۔ اور قتادہ سے ہشام کی روایت کردہ حدیث میں یہ الفاظ زائد ہیں : \" وہ قسمیں کھائیں گے جبکہ ان سے قسم کھانے کا مطالبہ نہیں کیا جائے گا ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید اور محمد بن عبد الملک اموی نے بیان کیا، کہا: ابو عوانہ اور ہشام دونوں نے قتادہ سے ، انھوں نے زرارہ بن اوفیٰ سے ، انھوں نے حضرت عمران بن حصین رضی اللہ عنہ سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے یہ حدیث ( ان الفاظ میں ) روایت کی",
                "hadithArabic": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ الْأُمَوِيُّ، قَالَا: حَدَّثَنَا أَبُو عَوَانَةَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنَا أَبِي، كِلَاهُمَا عَنْ قَتَادَةَ، عَنْ زُرَارَةَ بْنِ أَوْفَى، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، بِهَذَا الْحَدِيثِ «خَيْرُ هَذِهِ الْأُمَّةِ الْقَرْنُ الَّذِينَ بُعِثْتُ فِيهِمْ، ثُمَّ الَّذِينَ يَلُونَهُمْ» زَادَ فِي حَدِيثِ أَبِي عَوَانَةَ، قَالَ: وَاللهُ أَعْلَمُ، أَذَكَرَ الثَّالِثَ أَمْ لَا، بِمِثْلِ حَدِيثِ زَهْدَمٍ، عَنْ عِمْرَانَ، وَزَادَ فِي حَدِيثِ هِشَامٍ، عَنْ قَتَادَةَ «وَيَحْلِفُونَ وَلَا يُسْتَحْلَفُونَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14041,
                "hadithNumber": "6478",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "A person asked Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as to who amongst the people were the best. He said: Of the generation to which I belong, then of the second generation (generation adjacent to my generation), then of the third generation (generation adjacent to the second generation).",
                "hadithUrdu": "ایک آدمی نے نبی کریم صلی اللہ علیہ وسلم سے سوال کیا کہ کون سے لوگ سب سے بہتر ہیں؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" اس دور میں جس میں ہوں ، پھر دوسرے ( دورکے ) ، پھر تیسرے ( دور کے ۔ ) \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور شجاع بن مخلد نے بیان کیا - اور یہ لفظ ابوبکر کے لیے ہے - انہوں نے کہا: حسین نے جو علی کے بیٹے ہیں، بیان کیا۔ الجوفی، زیدہ کے اختیار پر، السدی کے اختیار پر، عبداللہ بہی نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَشُجَاعُ بْنُ مَخْلَدٍ - وَاللَّفْظُ لِأَبِي بَكْرٍ - قَالَا: حَدَّثَنَا حُسَيْنٌ وَهُوَ ابْنُ عَلِيٍّ الْجُعْفِيُّ، عَنْ زَائِدَةَ، عَنِ السُّدِّيِّ، عَنْ عَبْدِ اللهِ الْبَهِيِّ، عَنْ عَائِشَةَ، قَالَتْ: سَأَلَ رَجُلٌ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَيُّ النَّاسِ خَيْرٌ؟ قَالَ: «الْقَرْنُ الَّذِي أَنَا فِيهِ، ثُمَّ الثَّانِي، ثُمَّ الثَّالِثُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14042,
                "hadithNumber": "6479",
                "englishNarrator": "Abdullah bin Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) led us 'Isha' prayer at the latter part of the night and when he had concluded it by salutations he stood up and said: Have you seen this night of yours? At the end of one hundred years after this none would survive on the surface of the earth (from amount my Companions). Ibn Umar رضی اللہ عنہ said: People were (not understanding) these words of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) which had been uttered pertaining to one hundred years. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) in fact meant (by these words) that on that day none from amongst those who had been living upon the earth (from amongst his Companions) would survive (after one hundred years) and that would be the end of this generation.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے اپنی حیات مبا رکہ کے آخری حصے میں ایک را ت ہمیں عشاء کی نما ز پڑھا ئی ، جب آپ صلی اللہ علیہ وسلم نے سلا م پھیرا تو کھڑے ہو گئے تو فرما یا : \" کیا تم لوگوں نے اپنی اس را ت کو دیکھا ہے؟ ( اسے یا د رکھو ) بلا شبہ اس رات سے سو سال کے بعد جو لو گ ( اس را ت میں ) روئے زمین پر مو جودہیں ان میں سے کو ئی بھی باقی نہیں ہو گا ۔ \" حضرت عمر رضی اللہ عنہ نے کہا : ( بعض ) لو گ رسول اللہ صلی اللہ علیہ وسلم کے فر ما ن کے متعلق غلط فہمیوں میں مبتلا ہوئے ہیں جو اس میں سو سال کے حوالے سے مختلف باتیں کر رہے ہیں ( کہ سو سال بعد زندگی کا خاتمہ ہو جا ئے گا ۔ ) رسول اللہ صلی اللہ علیہ وسلم نے یہ فرما یا تھا ۔ \" آج جو لوگ روئےزمین پر مو جو د ہیں ان میں سے کو ئی باقی نہیں ہو گا ۔ \" آپ کا مقصود یہ تھا کہ اس قرن ( اس دور میں رہنے والے لوگوں ) کا خاتمہ ہو جائے گا ۔",
                "urduNarrator": "ہم سے محمد بن رافع نے بیان کیا، اور ہم سے عبد بن حمید نے بیان کیا، انہوں نے کہا: ہم سے محمد بن رافع نے بیان کیا، اور ہم سے عبدالرزاق نے بیان کیا، انہوں نے کہا: معمر نے زہری سے روایت کی ، انھوں نے کہا : مجھے سالم بن عبداللہ اور ابو بکر بن سلیمان نے بتا یا کہ عبد اللہ بن عمر رضی اللہ عنہ نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ - قَالَ: مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا، وقَالَ عَبْدٌ أَخْبَرَنَا - عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللهِ، وَأَبُو بَكْرِ بْنُ سُلَيْمَانَ أَنَّ عَبْدَ اللهِ بْنَ عُمَرَ، قَالَ: صَلَّى بِنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ذَاتَ لَيْلَةٍ، صَلَاةَ الْعِشَاءِ، فِي آخِرِ حَيَاتِهِ، فَلَمَّا سَلَّمَ قَامَ فَقَالَ: «أَرَأَيْتَكُمْ لَيْلَتَكُمْ هَذِهِ؟ فَإِنَّ عَلَى رَأْسِ مِائَةِ سَنَةٍ مِنْهَا لَا يَبْقَى مِمَّنْ هُوَ عَلَى ظَهْرِ الْأَرْضِ أَحَدٌ» قَالَ ابْنُ عُمَرَ: فَوَهَلَ النَّاسُ فِي مَقَالَةِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ تِلْكَ، فِيمَا يَتَحَدَّثُونَ مِنْ هَذِهِ الْأَحَادِيثِ، عَنْ مِائَةِ سَنَةٍ، وَإِنَّمَا قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يَبْقَى مِمَّنْ هُوَ الْيَوْمَ عَلَى ظَهْرِ الْأَرْضِ أَحَدٌ» يُرِيدُ بِذَلِكَ أَنْ يَنْخَرِمَ ذَلِكَ الْقَرْنُ.",
                "headingArabic": "قَوْلِهِ صلى الله عليه وسلم ‏\"‏ لاَ تَأْتِي مِائَةُ سَنَةٍ وَعَلَى الأَرْضِ نَفْسٌ مَنْفُوسَةٌ الْيَوْ",
                "headingUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے ارشاد کا مفہوم: \"سو سال کے بعد کوئی روح زندہ نہیں رہے گی جو اب زندہ ہو\"",
                "headingEnglish": "The Meaning Of The Words Of The Prophet (SAW): \"After One Hundred Years There Will Be No Soul Left Alive That Is Living Now\"",
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14043,
                "hadithNumber": "6480",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been transmitted by Zuhri on the authority of Ma'mar.",
                "hadithUrdu": "مجھ سے عبداللہ بن عبدالرحمٰن دارمی نے بیان کیا، کہا ہم سے ابوالیمان نے بیان کیا, شعیب اور عبد الرحمٰن بن خالد بن مسافر دونوں نے زہری سے معمر کی سند کے ساتھ انھی کی حدیث کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، وَرَوَاهُ اللَّيْثُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ خَالِدِ بْنِ مُسَافِرٍ، كِلَاهُمَا عَنِ الزُّهْرِيِّ، بِإِسْنَادِ مَعْمَرٍ كَمِثْلِ حَدِيثِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14044,
                "hadithNumber": "6481",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying this one month before his death: You asked me about the Last Hour whereas its knowledge is with Allah. I, however, take an oath and say that none upon the earth, the created beings (from amongst my Companions), would survive at the end of one hundred years.",
                "hadithUrdu": "میں نے نبی صلی اللہ علیہ وسلم کو اپنی وفات سے ایک مہینہ قبل یہ فر ما تے ہو ئے سنا : \" تم مجھ سے قیامت کے بارے میں سوال کرتے ہو ؟اس کا علم صرف اور صرف اللہ تعالیٰ کے پاس ہے ( البتہ اس بات پر ) میں اللہ کی قسم کھا تا ہوں کہ اس وقت کو ئی زندہ نفس موجود نہیں جس پر سوسال پورے ہوں ۔ \"",
                "urduNarrator": "مجھ سے ہارون بن عبداللہ نے کہا, حجاج بن محمد نے کہا : ابن جریج نے کہا : مجھے ابو زبیر نے بتا یا ، انھوں نے حضرت جا بر بن عبد اللہ رضی اللہ عنہ کو کہتے ہو ئے سناکہ",
                "hadithArabic": "حَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللهِ، وَحَجَّاجُ بْنُ الشَّاعِرِ، قَالَا: حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ: قَالَ ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ، يَقُولُ: سَمِعْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ قَبْلَ أَنْ يَمُوتَ بِشَهْرٍ: «تَسْأَلُونِي عَنِ السَّاعَةِ؟، وَإِنَّمَا عِلْمُهَا عِنْدَ اللهِ، وَأُقْسِمُ بِاللهِ مَا عَلَى الْأَرْضِ مِنْ نَفْسٍ مَنْفُوسَةٍ تَأْتِي عَلَيْهَا مِائَةُ سَنَةٍ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14045,
                "hadithNumber": "6482",
                "englishNarrator": "This hadith has been narrated on the authority of Ibn Juraij with the same chain of transmitters, but there is no mention of the words:",
                "hadithEnglish": "one month before his death .",
                "hadithUrdu": "( آپ نے ) اپنی وفات سے ایک ماہ قبل ( یہ ارشاد فرمایا تھا ۔ )",
                "urduNarrator": "مجھ سے محمد بن حاتم نے بیان کیا، ہم سے محمد بن بکر نے بیان کیا، ابن جریج نے اسی سند کے ساتھ ہمیں خبر دی اور اس بات کا ذکر نہیں کیا کہ",
                "hadithArabic": "حَدَّثَنِيهِ مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، بِهَذَا الْإِسْنَادِ، وَلَمْ يَذْكُرْ: قَبْلَ مَوْتِهِ بِشَهْرٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14046,
                "hadithNumber": "6483",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying one mouth before his death (or something like it): None amongst the created beings who had been living by that time (during the lifetime of Allah's Apostle).... 'Abdul-Rahman has interpreted these words of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as: The ages (of the people) would be diminished.",
                "hadithUrdu": "آپ نے اپنی وفات سے ایک مہینہ یا قریباًاتنا عرصہ پہلے فرما یا : \" آج کو ئی ایسا سانس لیتا ہوا انسان موجود نہیں کہ اس پر سوسال گزریں تو وہ اس دن بھی زندہ ہو ۔ اور لوگوں کو پانی پلا نے والے عبدالرحمن ( بن آدم ) سے روایت ہے انھوں نے حضرت جابر بن عبد اللہ رضی اللہ عنہ سے انھوں نے نبی صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ۔ عبدالرحمان نے اس کا مفہوم بتا یا اور کہا : عمر کی کمی ( مراد ہے )",
                "urduNarrator": "مجھ سے یحییٰ بن حبیب اور محمد بن عبد الاعلی نے کہا, معتمر بن سلیمان نے کہا : میں نے اپنے والد سے سنا ، کہا : ابو نضرہ نے ہمیں حضرت جابر بن عبد اللہ رضی اللہ عنہ سے ، انھوں نے نبی صلی اللہ علیہ وسلم سے حدیث بیان کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنِي يَحْيَى بْنُ حَبِيبٍ، وَمُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى، كِلَاهُمَا عَنِ الْمُعْتَمِرِ، قَالَ ابْنُ حَبِيبٍ: حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ، قَالَ: سَمِعْتُ أَبِي، حَدَّثَنَا أَبُو نَضْرَةَ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، أَنَّهُ قَالَ ذَلِكَ قَبْلَ مَوْتِهِ بِشَهْرٍ أَوْ نَحْوِ ذَلِكَ: «مَا مِنْ نَفْسٍ مَنْفُوسَةٍ الْيَوْمَ، تَأْتِي عَلَيْهَا مِائَةُ سَنَةٍ، وَهِيَ حَيَّةٌ يَوْمَئِذٍ» وَعَنْ عَبْدِ الرَّحْمَنِ، صَاحِبِ السِّقَايَةِ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، بِمِثْلِ ذَلِكَ. وَفَسَّرَهَا عَبْدُ الرَّحْمَنِ قَالَ: نَقْصُ الْعُمُرِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14047,
                "hadithNumber": "6484",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been reported on the authority of Sulaiman Taimi through other chains of transmitters.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, یزید بن ہارون نے کہا : ہمیں سلیمان تیمی نے دونوں سندوں سے اسی کے مانند حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا سُلَيْمَانُ التَّيْمِيُّ، بِالْإِسْنَادَيْنِ جَمِيعًا، مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14048,
                "hadithNumber": "6485",
                "englishNarrator": "Abu Sa'id رضی اللہ عنہ reported:",
                "hadithEnglish": "When Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came back from Tabuk they (his Companions) asked about the Last Hour. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: There would be none amongst the created beings living on the earth (who would survive this century).",
                "hadithUrdu": "جب نبی صلی اللہ علیہ وسلم غزوہ تبوک سے واپس آئے تو اس کے بعد لوگوں نے آپ سے قیامت کے بارے میں سوال کیا رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" سو سال نہیں گزریں گے ۔ کہ آج زمین پر سانس لیتا ہوا کو ئی شخص موجود ہو ۔ \" ( اس سے پہلے یہ سب ختم ہو جا ئیں گے ۔ )",
                "urduNarrator": "ہم سے ابن نمیر نے بیان کیا، ہم سے ابوخالد نے بیان کیا، داؤد کی سند سے اور ان کا تلفظ ہ ہے، اور ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ان سے سلیمان بن حیان، داود کے اختیار پر، ابو نضر ہ نے حضرت ابو سعید رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبُو خَالِدٍ، عَنْ دَاوُدَ - وَاللَّفْظُ لَهُ - ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُلَيْمَانُ بْنُ حَيَّانَ، عَنْ دَاوُدَ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ، قَالَ: لَمَّا رَجَعَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنْ تَبُوكَ، سَأَلُوهُ عَنِ السَّاعَةِ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تَأْتِي مِائَةُ سَنَةٍ، وَعَلَى الْأَرْضِ نَفْسٌ مَنْفُوسَةٌ الْيَوْمَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14049,
                "hadithNumber": "6486",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: None amongst the created beings (from my Companions) would survive after one hundred years. Salim said: We made a mention of it to him (Jabir رضی اللہ عنہ ), whereupon he said: It means those who had been living on that day.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے فرما یا : \" ( آج ) سانس لیتا ہوا شخص سو سال ( کی مدت ) تک نہیں پہنچےگا ۔ \" سالم نے کہا : ہم نے ان ( حضرت جابر رضی اللہ عنہ ) کے سامنے اس کے بارے میں گفتگو کی اس سے مراد ہر وہ شخص ہے جو اس وقت پیدا ہو چکا تھا ۔",
                "urduNarrator": "مجھ سے اسحاق بن منصور نے بیان کیا، کہا ہم سے ابو الولید نے بیان کیا، ہم سے ابو عوانہ نے بیان کیا, حصین نے سالم سے ، انھوں نے حضرت جابر بن عبد اللہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا أَبُو الْوَلِيدِ، أَخْبَرَنَا أَبُو عَوَانَةَ، عَنْ حُصَيْنٍ، عَنْ سَالِمٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، قَالَ: قَالَ نَبِيُّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَا مِنْ نَفْسٍ مَنْفُوسَةٍ، تَبْلُغُ مِائَةَ سَنَةٍ» فَقَالَ سَالِمٌ: تَذَاكَرْنَا ذَلِكَ عِنْدَهُ، إِنَّمَا هِيَ كُلُّ نَفْسٍ مَخْلُوقَةٍ يَوْمَئِذٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14050,
                "hadithNumber": "6487",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Do not revile my Companions, do not revile my Companions. By Him in Whose Hand is my life, if one amongst you would have spent as much gold as Uhud it would not amount to as much as one much on behalf of one of them or half of it.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" میرے صحابہ کرام رضوان اللہ عنھم اجمعین کو برا مت کہو ، میرے صحابہ کرام رضوان اللہ عنھم اجمعین کہو ، اس ذات کی قسم جس کے ہاتھ میں میری جان ہے ۔ !اگر تم میں سے کو ئی شخص اُحد پہا ڑ جتنا سونا بھی خرچ کرے تو وہ ( صحابہ کرام رضوان اللہ عنھم اجمعین ) میں سے کسی ایک کے دیے ہو ئے مد بلکہ اس کے آدھے کے برابر بھی ( اجر ) نہیں پاسکتا ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ التمیمی، ابوبکر بن ابی شیبہ اور محمد بن علاء نے بیان کیا - یحییٰ نے کہا: ہم سے انہوں نے بیان کیا اور باقی دو نے کہا, ابو معاویہ نے اعمش سے ، انھوں نے ابو صالح سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ الْعَلَاءِ - قَالَ يَحْيَى: أَخْبَرَنَا، وقَالَ الْآخَرَانِ: حَدَّثَنَا - أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تَسُبُّوا أَصْحَابِي، لَا تَسُبُّوا أَصْحَابِي، فَوَالَّذِي نَفْسِي بِيَدِهِ لَوْ أَنَّ أَحَدَكُمْ أَنْفَقَ مِثْلَ أُحُدٍ ذَهَبًا، مَا أَدْرَكَ مُدَّ أَحَدِهِمْ، وَلَا نَصِيفَهُ».",
                "headingArabic": "حْرِيمِ سَبِّ الصَّحَابَةِ رضى الله عنهم ‏‏",
                "headingUrdu": "صحابہ کرام رضی اللہ عنہم کو گالی دینے کی ممانعت",
                "headingEnglish": "The Prohibition Of Reviling The Companions (RA)",
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14051,
                "hadithNumber": "6488",
                "englishNarrator": "Abu Sa'id رضی اللہ عنہ reported:",
                "hadithEnglish": "There was some altercation between Khalid bin Walid and Abd al-Rahman bin 'Auf رضی اللہ عنہ and Khalid رضی اللہ عنہ reviled him. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: None should revile my Companions. for if one amongst you were to spend as much gold as Uhud, it would not amount to as much as one mudd of one of them or half of it.",
                "hadithUrdu": "حضرت خالد بن ولید اور عبدالرحمن بن عوف رضی اللہ عنہ کے درمیان کو ئی مناقشہ تھا ، حضرت خالد رضی اللہ تعالیٰ عنہ نے ان کو برا کہا : تو رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" میرے صحابہ کرام رضوان اللہ عنھم اجمعین میں سے کسی کو برا نہ کہو ، کیونکہ تم میں سے کسی شخص نے اگر اُحدپہاڑ کے برابرسونا بھی خرچ کیاتو وہ ان میں سے کسی کے دیے ہو ئے ایک مدکے برابر بلکہ اس کے آدھے کے برابر بھی ( اجر ) نہیں پاسکتا ۔ \"",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ نے بیان کیا, جریر نے اعمش سے ، انھوں نے ابو صالح سے ، انھوں نے حضرت ابو سعید ( خدری ) رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنِ الْأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي سَعِيدٍ، قَالَ: كَانَ بَيْنَ خَالِدِ بْنِ الْوَلِيدِ، وَبَيْنَ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ شَيْءٌ، فَسَبَّهُ خَالِدٌ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تَسُبُّوا أَحَدًا مِنْ أَصْحَابِي، فَإِنَّ أَحَدَكُمْ لَوْ أَنْفَقَ مِثْلَ أُحُدٍ ذَهَبًا، مَا أَدْرَكَ مُدَّ أَحَدِهِمْ، وَلَا نَصِيفَهُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14052,
                "hadithNumber": "6489",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been transmitted on the authority of al-A'mash and there is no mention by Shu'ba and Waki' of 'Abdul-Rahman bin Auf and Khalid رضی اللہ عنہ.",
                "hadithUrdu": "ہم سے ابو سعید اشجج اور ابو کریب نے بیان کیا، کہا: ہم سے وکیع نے بیان کیا، ان سے اعمش نے بیان کیا، ہم سے عبید اللہ بن معاذ نے بیان کیا، ہم سے ابی نے بیان کیا، انہوں نے کہا: ہم سے ابن المثنیٰ اور ابن بشار نے بیان کیا، کہتے ہیں۔ابن ابی عدی نے شعبہ کی سند سے، الاعمش کی سند سے، جریر کی سند سے اور ابو معاویہ نے اسی حدیث سے بیان کیا، نہ کہ کسی حدیث میں۔ شعبہ اور وکیع، عبدالرحمٰن بن عوف اور خالد بن ولید  کا تذکرہ نہیں ہے۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ، وَأَبُو كُرَيْبٍ، قَالَا: حَدَّثَنَا وَكِيعٌ، عَنِ الْأَعْمَشِ، ح وَحَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، ح وَحَدَّثَنَا ابْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، جَمِيعًا عَنْ شُعْبَةَ، عَنِ الْأَعْمَشِ، بِإِسْنَادِ جَرِيرٍ، وَأَبِي مُعَاوِيَةَ، بِمِثْلِ حَدِيثِهِمَا، وَلَيْسَ فِي حَدِيثِ شُعْبَةَ، وَوَكِيعٍ، ذِكْرُ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ وَخَالِدِ بْنِ الْوَلِيدِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14053,
                "hadithNumber": "6490",
                "englishNarrator": "Usair bin Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "A delegation from Kufa came to 'Umar رضی اللہ عنہ and there was a person amongst them who jeered at Uwais رضی اللہ عنہ. Thereupon Umar رضی اللہ عنہ said: Is there amongst us one from Qaran? That person came and Umar رضی اللہ عنہ said: Verily Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) has said: There would come to you a person from Yemen who would be called Uwais and he would leave none in Yemen (behind him) except his mother, and he would have the whiteness (due to leprosy) and he supplicated Allah and it was cured except for the size of a dinar or dirham. He who amongst you meets him should ask him to supplicate for forgiveness (from Allah) for you.",
                "hadithUrdu": "اہل کوفہ ایک وفد میں حضرت عمر فاروق رضی اللہ عنہ کے پاس آئے ، ان میں ایک ایسا آدمی بھی تھا جو حضرت اویس رضی اللہ عنہ کا ٹھٹا اڑاتا تھا ، حضرت عمر رضی اللہ عنہ نے پوچھا : یہاں قرن کے رہنے والوں میں سے کوئی ہے؟وہ شخص ( آگے ) آگیاتوحضرت عمر رضی اللہ عنہ نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا : \" تمھارے پاس یمن سے ایک شخص آئے گا ، اس کا نام اویس ہوگا ، یمن میں اس کی والدہ کےسوا کوئی نہیں جسے وہ چھوڑ کرآئے ۔ اس ( کے جسم ) پرسفید ( برص کے ) نشان ہیں ۔ اس نے اللہ سے دعا کی تو اللہ نے ایک دینار یا درہم کے برابر چھوڑ کر باقی سارا نشان ہٹادیا ، وہ تم میں سے جس کو ملے ( وہ اس سے درخواست کرےکہ ) وہ تم لوگوں کےلیے مغفرت کی دعاکرے ۔ \"",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے ہاشم بن القاسم نے بیان کیا, سلیمان بن مغیرہ نے کہا : مجھے سعید جریری نے ابو نضرہ سے حدیث بیان کی ، انھوں نے اُسیر بن جابر رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، حَدَّثَنِي سَعِيدٌ الْجُرَيْرِيُّ، عَنْ أَبِي نَضْرَةَ، عَنْ أُسَيْرِ بْنِ جَابِرٍ، أَنَّ أَهْلَ الْكُوفَةِ وَفَدُوا إِلَى عُمَرَ، وَفِيهِمْ رَجُلٌ مِمَّنْ كَانَ يَسْخَرُ بِأُوَيْسٍ، فَقَالَ عُمَرُ: هَلْ هَاهُنَا أَحَدٌ مِنَ الْقَرَنِيِّينَ؟ فَجَاءَ ذَلِكَ الرَّجُلُ فَقَالَ عُمَرُ: إِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَدْ قَالَ: «إِنَّ رَجُلًا يَأْتِيكُمْ مِنَ الْيَمَنِ يُقَالُ لَهُ أُوَيْسٌ، لَا يَدَعُ بِالْيَمَنِ غَيْرَ أُمٍّ لَهُ، قَدْ كَانَ بِهِ بَيَاضٌ، فَدَعَا اللهَ فَأَذْهَبَهُ عَنْهُ، إِلَّا مَوْضِعَ الدِّينَارِ أَوِ الدِّرْهَمِ، فَمَنْ لَقِيَهُ مِنْكُمْ فَلْيَسْتَغْفِرْ لَكُمْ».",
                "headingArabic": "مِنْ فَضَائِلِ أُوَيْسٍ الْقَرَنِيِّ رضى الله عنه ‏‏",
                "headingUrdu": "اویس القرانی رضی اللہ عنہ کے فضائل",
                "headingEnglish": "The Virtues Of Uwais Al-Qarani (RA)",
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14054,
                "hadithNumber": "6491",
                "englishNarrator": "Umar bin Khattab رضی اللہ عنہ reported:",
                "hadithEnglish": "I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Worthy amongst the successors would be a person who would be called Uwais. He would have his mother (living with him) and he would have (a small) sign of leprosy. Ask him to beg pardon for you (from Allah).",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم فرماتے تھے کہ تابعین میں ایک بہترین شخص ہے جس کو اویس کہتے ہیں ، اس کی ایک ماں ہے ( یعنی رشتہ داروں میں سے صرف ماں زندہ ہو گی ) اور اس کو ایک سفیدی ہو گی ۔ تم اس سے کہنا کہ تمہارے لئے دعا کرے ۔",
                "urduNarrator": "ہم سے زہیر بن حرب اور محمد بن المثنیٰ نے بیان کیا، کہا کہ ہم سے عفان بن مسلم نے بیان کیا، حماد بن سلمہ نے سعید جریری سے اسی سند کےساتھ حدیث بیان کی ، کہا : سیدنا عمر بن خطاب رضی اللہ عنہ سے روایت ہے کہا : کہ",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالَا: حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ، حَدَّثَنَا حَمَّادٌ وَهُوَ ابْنُ سَلَمَةَ، عَنْ سَعِيدٍ الْجُرَيْرِيِّ، بِهَذَا الْإِسْنَادِ، عَنْ عُمَرَ بْنِ الْخَطَّابِ، قَالَ: إِنِّي سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّ خَيْرَ التَّابِعِينَ رَجُلٌ يُقَالُ لَهُ أُوَيْسٌ، وَلَهُ وَالِدَةٌ وَكَانَ بِهِ بَيَاضٌ فَمُرُوهُ فَلْيَسْتَغْفِرْ لَكُمْ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14055,
                "hadithNumber": "6492",
                "englishNarrator": "Usair bin Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "When people from Yemen came to help (the Muslim army at the time of jihad) he asked them: Is there amongst you Uwais bin 'Amir? (He continued finding him out) until he met Uwais. He said: Are you Uwais bin Amir? He said: Yes. He said: Are you from the tribe of Qaran? He said: Yes. He (Hadrat) 'Umar رضی اللہ عنہ (again) said: Did you suffer from leprosy and then you were cured from it but for the space of a dirham? He said: Yes. He ('Umar رضی اللہ عنہ ) said: Is your mother (living)? He said: Yes. He ('Umar رضی اللہ عنہ ) said: I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) say: There would come to you Uwais bin Amir with the reinforcement from the people of Yemen. (He would be) from Qaran, (the branch) of Murid. He had been suffering from leprosy from which he was cured but for a spot of a dirham. His treatment with his mother would have been excellent. If he were to take an oath in the name of Allah, He would honour that. And if it is possible for you, then do ask him to beg forgiveness for you (from your Lord). So he (Uwais) begged forgiveness for him. Umar رضی اللہ عنہ said: Where do you intend to go? He said: To Kufa. He ('Umar رضی اللہ عنہ ) said: Let me write a letter for you to its governor, whereupon he (Uwais) said: I love to live amongst the poor people. When it was the next year, a person from among the elite (of Kufa) performed Hajj and he met Umar رضی اللہ عنہ . He asked him about Uwais. He said: I left him in a state with meagre means of sustenance. (Thereupon) Umar رضی اللہ عنہ said: I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: There would come to you Uwais bin 'Amir, of Qaran, a branch (of the tribe) of Murid, along with the reinforcement of the people of Yemen. He had been suffering from leprosy which would have been cured but for the space of a dirham. His treatment with his mother would have been very kind. If he would take an oath in the name of Allah (for something) He would honour it. Ask him to beg forgiveness for you (from Allah) in case it is possible for you. So he came to Uwais and said.: Beg forgiveness (from Allah) for me. He (Uwais) said: You have just come from a sacred journey (Hajj) ; you, therefore, ask forgiveness for me. He (the person who had performed Hajj) said: Ask forgiveness for me (from Allah). He (Uwais again) said: You have just come from the sacred journey, so you ask forgiveness for me. (Uwais further) said: Did you meet Umar رضی اللہ عنہ ? He said: Yes. He (Uwais) then begged forgiveness for him (from Allah). So the people came to know about (the status of religious piety) of Uwais. He went away (from that place). Usair said: His clothing consisted of a mantle, and whosoever saw him said: From where did Uwais get this mantle?",
                "hadithUrdu": "سیدنا عمر بن خطاب رضی اللہ عنہ کے پاس جب یمن سے مدد کے لوگ آتے ( یعنی وہ لوگ جو ہر ملک سے اسلام کے لشکر کی مدد کے لئے جہاد کرنے کو آتے ہیں ) تو وہ ان سے پوچھتے کہ تم میں اویس بن عامر بھی کوئی شخص ہے؟ یہاں تک کہ سیدنا عمر رضی اللہ عنہ خود اویس کے پاس آئے اور پوچھا کہ تمہارا نام اویس بن عامر ہے؟ انہوں نے کہا کہ ہاں ۔ سیدنا عمر رضی اللہ عنہ نے کہا کہ تم مراد قبیلہ کی شاخ قرن سے ہو؟ انہوں نے کہا کہ ہاں ۔ انہوں نے پوچھا کہ تمہیں برص تھا وہ اچھا ہو گیا مگر درہم برابر باقی ہے؟ انہوں نے کہا کہ ہاں ۔ سیدنا عمر رضی اللہ عنہ نے کہا کہ تمہاری ماں ہے؟ انہوں نے کہا کہ ہاں ۔ تب سیدنا عمر رضی اللہ عنہ نے کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم فرماتے تھے کہ تمہارے پاس اویس بن عامر یمن والوں کی کمکی فوج کے ساتھ آئے گا ، وہ قبیلہ مراد سے ہے جو قرن کی شاخ ہے ۔ اس کو برص تھا وہ اچھا ہو گیا مگر درہم باقی ہے ۔ اس کی ایک ماں ہے ۔ اس کا یہ حال ہے کہ اگر اللہ کے بھروسے پر قسم کھا بیٹھے تو اللہ تعالیٰ اس کو سچا کرے ۔ پھر اگر تجھ سے ہو سکے تو اس سے اپنے لئے دعا کرانا ۔ تو میرے لئے دعا کرو ۔ پس اویس نے سیدنا عمر رضی اللہ عنہ کے لئے بخشش کی دعا کی ۔ تو سیدنا عمر رضی اللہ عنہ نے کہا کہ تم کہاں جانا چاہتے ہو؟ انہوں نے کہا کہ کوفہ میں ۔ سیدنا عمر رضی اللہ عنہ نے کہا کہ میں تمہیں کوفہ کے حاکم کے نام ایک خط لکھ دوں؟ انہوں نے کہا کہ مجھے خاکساروں میں رہنا اچھا معلوم ہوتا ہے ۔ جب دوسرا سال آیا تو ایک شخص نے کوفہ کے رئیسوں میں سے حج کیا ۔ وہ سیدنا عمر رضی اللہ عنہ سے ملا تو سیدنا عمر رضی اللہ عنہ نے اس سے اویس کا حال پوچھا تو وہ بولا کہ میں نے اویس کو اس حال میں چھوڑا کہ ان کے گھر میں اسباب کم تھا اور ( خرچ سے ) تنگ تھے ۔ سیدنا عمر رضی اللہ عنہ نے کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم فرماتے تھے کہ اویس بن عامر تمہارے پاس یمن والوں کے امدادی لشکر کے ساتھ آئے گا ، وہ مراد قبیلہ کی شاخ قرن میں سے ہے ۔ اس کو برص تھا وہ اچھا ہو گیا صرف درہم کے برابر باقی ہے ۔ اس کی ایک ماں ہے جس کے ساتھ وہ نیکی کرتا ہے ۔ اگر وہ اللہ پر قسم کھا بیٹھے تو اللہ تعالیٰ اس کو سچا کرے ۔ پھر اگر تجھ سے ہو سکے کہ وہ تیرے لئے دعا کرے تو اس سے دعا کرانا ۔ وہ شخص یہ سن کر اویس کے پاس آیا اور کہنے لگا کہ میرے لئے دعا کرو ۔ اویس نے کہا کہ تو ابھی نیک سفر کر کے آ رہا ہے ( یعنی حج سے ) میرے لئے دعا کر ۔ پھر وہ شخص بولا کہ میرے لئے دعا کر ۔ اویس نے یہی جواب دیا پھر پوچھا کہ تو سیدنا عمر رضی اللہ عنہ سے ملا؟ وہ شخص بولا کہ ہاں ملا ۔ اویس نے اس کے لئے دعا کی ۔ اس وقت لوگ اویس کا درجہ سمجھے ۔ وہ وہاں سے سیدھے چلے ۔ اسیر نے کہا کہ میں نے ان کو ان کا لباس ایک چادر پہنائی جب کوئی آدمی ان کو دیکھتا تو کہتا کہ اویس کے پاس یہ چادر کہاں سے آئی ہے؟ ( وہ ایسے تھے کہ ایک مناسب چادر بھی ان کے پاس ہونا باعث تعجب تھا ۔ )",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم الحنظَلی، محمد بن المثنیٰ اور محمد بن بشار نے بیان کیا - کہا کہ ہم سے اسحاق بن ابراہیم نے بیان کیا اور باقی دو نے کہا: ہم سے اس نے بیان کیا اور یہ قول ابن المثنیٰ کا ہے، ہم سے معاذ بن ہشام نے بیان کیا، مجھ سے میرے والد نے قتادہ کی سند سے بیان کیا, زرارہ بن اوفیٰ نے اُسیر بن جابر رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، - قَالَ إِسْحَاقُ أَخْبَرَنَا، وقَالَ الْآخَرَانِ: حَدَّثَنَا وَاللَّفْظُ لِابْنِ الْمُثَنَّى - حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ بْنِ أَوْفَى، عَنْ أُسَيْرِ بْنِ جَابِرٍ، قَالَ: كَانَ عُمَرُ بْنُ الْخَطَّابِ إِذَا أَتَى عَلَيْهِ أَمْدَادُ أَهْلِ الْيَمَنِ، سَأَلَهُمْ: أَفِيكُمْ أُوَيْسُ بْنُ عَامِرٍ؟ حَتَّى أَتَى عَلَى أُوَيْسٍ فَقَالَ: أَنْتَ أُوَيْسُ بْنُ عَامِرٍ؟ قَالَ: نَعَمْ، قَالَ: مِنْ مُرَادٍ ثُمَّ مِنْ قَرَنٍ؟ قَالَ: نَعَمْ، قَالَ: فَكَانَ بِكَ بَرَصٌ فَبَرَأْتَ مِنْهُ إِلَّا مَوْضِعَ دِرْهَمٍ؟ قَالَ: نَعَمْ، قَالَ: لَكَ وَالِدَةٌ؟ قَالَ: نَعَمْ، قَالَ سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: «يَأْتِي عَلَيْكُمْ أُوَيْسُ بْنُ عَامِرٍ مَعَ أَمْدَادِ أَهْلِ الْيَمَنِ، مِنْ مُرَادٍ، ثُمَّ مِنْ قَرَنٍ، كَانَ بِهِ بَرَصٌ فَبَرَأَ مِنْهُ إِلَّا مَوْضِعَ دِرْهَمٍ، لَهُ وَالِدَةٌ هُوَ بِهَا بَرٌّ، لَوْ أَقْسَمَ عَلَى اللهِ لَأَبَرَّهُ، فَإِنِ اسْتَطَعْتَ أَنْ يَسْتَغْفِرَ لَكَ فَافْعَلْ» فَاسْتَغْفِرْ لِي، فَاسْتَغْفَرَ لَهُ، فَقَالَ لَهُ عُمَرُ: أَيْنَ تُرِيدُ؟ قَالَ: الْكُوفَةَ، قَالَ: أَلَا أَكْتُبُ لَكَ إِلَى عَامِلِهَا؟ قَالَ: أَكُونُ فِي غَبْرَاءِ النَّاسِ أَحَبُّ إِلَيَّ. قَالَ: فَلَمَّا كَانَ مِنَ الْعَامِ الْمُقْبِلِ حَجَّ رَجُلٌ مِنْ أَشْرَافِهِمْ، فَوَافَقَ عُمَرَ، فَسَأَلَهُ عَنْ أُوَيْسٍ، قَالَ: تَرَكْتُهُ رَثَّ الْبَيْتِ، قَلِيلَ الْمَتَاعِ، قَالَ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: «يَأْتِي عَلَيْكُمْ أُوَيْسُ بْنُ عَامِرٍ مَعَ أَمْدَادِ أَهْلِ الْيَمَنِ مِنْ مُرَادٍ، ثُمَّ مِنْ قَرَنٍ، كَانَ بِهِ بَرَصٌ فَبَرَأَ مِنْهُ، إِلَّا مَوْضِعَ دِرْهَمٍ لَهُ وَالِدَةٌ هُوَ بِهَا بَرٌّ، لَوْ أَقْسَمَ عَلَى اللهِ لَأَبَرَّهُ، فَإِنِ اسْتَطَعْتَ أَنْ يَسْتَغْفِرَ لَكَ فَافْعَلْ» فَأَتَى أُوَيْسًا فَقَالَ: اسْتَغْفِرْ لِي، قَالَ: أَنْتَ أَحْدَثُ عَهْدًا بِسَفَرٍ صَالِحٍ، فَاسْتَغْفِرْ لِي، قَالَ: اسْتَغْفِرْ لِي، قَالَ: أَنْتَ أَحْدَثُ عَهْدًا بِسَفَرٍ صَالِحٍ، فَاسْتَغْفِرْ لِي، قَالَ: لَقِيتَ عُمَرَ؟ قَالَ: نَعَمْ، فَاسْتَغْفَرَ لَهُ، فَفَطِنَ لَهُ النَّاسُ، فَانْطَلَقَ عَلَى وَجْهِهِ، قَالَ أُسَيْرٌ: وَكَسَوْتُهُ بُرْدَةً، فَكَانَ كُلَّمَا رَآهُ إِنْسَانٌ قَالَ: مِنْ أَيْنَ لِأُوَيْسٍ هَذِهِ الْبُرْدَةُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14056,
                "hadithNumber": "6493",
                "englishNarrator": "Abu Dharr رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: You would soon conquer a land where people are in the habit of using foul language. They have a right of kinship upon you. And when you see two persons fighting for the space of a brick, then get out of that. He (Abu Dharr) then happened to pass by Rabila and 'Abd al-Rahman, the two sons of Shurahbil bin Hasana رضی اللہ عنہ, and they had been disputing for the space of a brick. So he left the land.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \"\" تم عنقریب ایک زمین کو فتح کرو گےجس میں قیراط کا نام لیا جاتا ہوگا ( یہ ان کے چھوٹے سکے کا نام ہوگا ) تم اس سرزمین کے رہنے والوں کے ساتھ اچھا سلوک کرنے کی بات سن رکھو ، کیونکہ ان کا ( ہم پر ) حق بھی ہے اور رشتہ بھی ، پھر جب تم دو انسانوں کو ایک اینٹ کی جگہ کے لئے قتال پر آمادہ دیکھو تو وہاں سے چلے آنا ۔ \"\" ( حرملہ بن عمران نے ) کہا : تو ( عبدالرحمان بن شماسہ ) حضرت شرحبیل بن حسنہ رضی اللہ عنہ کے دو بیٹوں ربیعہ اور عبدالرحمان کے قریب سے گزرے ، وہ ایک اینٹ کی جگہ پر جھگڑ رہے تھے تو وہ وہاں ( مصر ) سے نکل آئے ۔",
                "urduNarrator": "ابو الطاہر نے مجھ سے کہا, ابن وہب نے کہا : ہمیں حرملہ بن عمران تحبیی نے عبدالرحمٰن بن شماسہ مہری سے حدیث بیان کی ، انھوں نے کہا : میں نے حضرت ابوذر رضی اللہ تعالیٰ عنہ سے سنا ، کہتے تھے",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي حَرْمَلَةُ، وحَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، حَدَّثَنِي حَرْمَلَةُ وَهُوَ ابْنُ عِمْرَانَ التُّجِيبِيُّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ شِمَاسَةَ الْمَهْرِيِّ، قَالَ: سَمِعْتُ أَبَا ذَرٍّ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّكُمْ سَتَفْتَحُونَ أَرْضًا يُذْكَرُ فِيهَا الْقِيرَاطُ، فَاسْتَوْصُوا بِأَهْلِهَا خَيْرًا، فَإِنَّ لَهُمْ ذِمَّةً وَرَحِمًا، فَإِذَا رَأَيْتُمْ رَجُلَيْنِ يَقْتَتِلَانِ فِي مَوْضِعِ لَبِنَةٍ، فَاخْرُجْ مِنْهَا» قَالَ: فَمَرَّ بِرَبِيعَةَ، وَعَبْدِ الرَّحْمَنِ، ابْنَيْ شُرَحْبِيلَ ابْنِ حَسَنَةَ، يَتَنَازَعَانِ فِي مَوْضِعِ لَبِنَةٍ، فَخَرَجَ مِنْهَا.",
                "headingArabic": "وَصِيَّةِ النَّبِيِّ صلى الله عليه وسلم بِأَهْلِ مِصْرَ",
                "headingUrdu": "اہل مصر کے بارے میں رسول اللہ صلی اللہ علیہ وسلم کی نصیحت",
                "headingEnglish": "The Advice Of The Prophet (SAW) Concerning The People Of Egypt",
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14057,
                "hadithNumber": "6494",
                "englishNarrator": "Abu Dharr reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: You would soon conquer Egypt and that is a land which is known (as the land of al-qirat). So when you conquer it, treat its inhabitants well. For there lies upon you the responsibility because of blood-tie or relationship of marriage (with them). And when you see two persons falling into dispute amongst themselves for the space of a brick, than get out of that. He (Abu Dharr رضی اللہ عنہ ) said: I saw Abdul-Rahman bin Shurahbil bin Hasana and his brother Rabi'a disputing with one another for the space of a brick. So I left that (land).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم عنقریب مصر کو فتح کر لو گے اور وہ ایک ایسی سرزمین ہے جو (قیراط کی سرزمین کے نام سے) مشہور ہے۔ پس جب تم اسے فتح کر لو تو اس کے باشندوں کے ساتھ اچھا سلوک کرو۔ کیونکہ خونی رشتہ یا رشتہ ازدواج کی وجہ سے (ان کے ساتھ) ذمہ داری تم پر ہے۔ اور جب تم دو آدمیوں کو دیکھو کہ ایک اینٹ کی جگہ پر آپس میں جھگڑ رہے ہیں تو وہاں سے نکل جاؤ۔ ابوذر رضی اللہ عنہ نے کہا: میں نے عبدالرحمٰن کو دیکھا۔ شورابیل بی۔ حسنہ اور اس کا بھائی ربیعہ ایک اینٹ کی جگہ کے لیے ایک دوسرے سے جھگڑ رہے ہیں۔ چنانچہ میں نے وہ زمین چھوڑ دی۔",
                "urduNarrator": "مجھ سے زہیر بن حرب اور عبید اللہ بن سعید نے بیان کیا، انہوں نے کہا: ہم سے وہب بن جریر نے بیان کیا، کہا ہم سے میرے والد نے بیان کیا، میں نے حرملہ المصری رضی اللہ عنہ سے سنا۔ عبدالرحمٰن بن شماسہ، ابو بصرہ سے، ابوذر کی سند سے، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَعُبَيْدُ اللهِ بْنُ سَعِيدٍ، قَالَا: حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا أَبِي، سَمِعْتُ حَرْمَلَةَ الْمِصْرِيَّ، يُحَدِّثُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ شِمَاسَةَ، عَنْ أَبِي بَصْرَةَ، عَنْ أَبِي ذَرٍّ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّكُمْ سَتَفْتَحُونَ مِصْرَ وَهِيَ أَرْضٌ يُسَمَّى فِيهَا الْقِيرَاطُ، فَإِذَا فَتَحْتُمُوهَا فَأَحْسِنُوا إِلَى أَهْلِهَا، فَإِنَّ لَهُمْ ذِمَّةً وَرَحِمًا» أَوْ قَالَ «ذِمَّةً وَصِهْرًا، فَإِذَا رَأَيْتَ رَجُلَيْنِ يَخْتَصِمَانِ فِيهَا فِي مَوْضِعِ لَبِنَةٍ، فَاخْرُجْ مِنْهَا» قَالَ: فَرَأَيْتُ عَبْدَ الرَّحْمَنِ بْنَ شُرَحْبِيلَ بْنِ حَسَنَةَ، وَأَخَاهُ رَبِيعَةَ يَخْتَصِمَانِ فِي مَوْضِعِ لَبِنَةٍ فَخَرَجْتُ مِنْهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14058,
                "hadithNumber": "6495",
                "englishNarrator": "Abu Barza رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sent a person to a tribe amongst the tribes of Arabia. They reviled him and beat him. He came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and narrated to him (the story of atrocities perpetrated upon him by the people of the tribe). Thereupon he (the Holy Prophet) said: If you were to come to the people of 'Uman, they would have neither reviled you nor beaten you.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ایک شخص کو قبائل عرب میں سے ایک قبیلے کے پاس بھیجا تو ان لوگوں نے ان کو گالیاں دیں اور مارا ، وہ رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور آپ کوخبر دی تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اگر تم اہل عمان کے پاس جاتے تو وہ تمھیں گالیاں دیتے نہ مارتے ۔ \"",
                "urduNarrator": "ہم سے سعید بن منصور نے بیان کیا، کہا ہم سے مہدی بن میمون نے بیان کیا، ابو الوازی کی سند سے, جابر بن عمرو راسبی نے کہا : میں نے حضرت ابو برزہ رضی اللہ عنہ کو یہ کہتے ہوئے سنا",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، حَدَّثَنَا مَهْدِيُّ بْنُ مَيْمُونٍ، عَنْ أَبِي الْوَازِعِ جَابِرِ بْنِ عَمْرٍو الرَّاسِبِيِّ، سَمِعْتُ أَبَا بَرْزَةَ، يَقُولُ: بَعَثَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، رَجُلًا إِلَى حَيٍّ مِنْ أَحْيَاءِ الْعَرَبِ، فَسَبُّوهُ وَضَرَبُوهُ، فَجَاءَ إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَأَخْبَرَهُ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَوْ أَنَّ أَهْلَ عُمَانَ أَتَيْتَ، مَا سَبُّوكَ وَلَا ضَرَبُوكَ».",
                "headingArabic": "فَضْلِ أَهْلِ عُمَانَ ‏‏",
                "headingUrdu": "عمان کے لوگوں کے فضائل",
                "headingEnglish": "The Virtues Of The People Of Oman",
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14059,
                "hadithNumber": "6496",
                "englishNarrator": "Abu Naufal reported:",
                "hadithEnglish": "I saw (the dead body) of Abdullah bin Zubair رضی اللہ عنہ hanging on the road of Medina (leading to Mecca). The Quraish passed by it and other people too, that Abdullah bin Umar رضی اللہ عنہ happened to pass by it. He stood up there and said: May there be peace upon you, Abu Khubaib (the Kunya of Hadrat 'Abdullah bin Zubair رضی اللہ عنہ ), may there be peace upon you Abu Khubaib, may there be peace upon you, Abu Khubaib! By Allah, I used to forbid you from this; by Allah, I used to forbid you from this, by Allah I used to forbid you from this. By Allah, so far as I know, you had been very much devoted to fasting and prayer and you had been paying very much care to cementing the ties of blood. By Allah, the group to which you belong (are labelled) as (a) wicked (person) is indeed a fine group. Then 'Abdullah bin 'Umar رضی اللہ عنہ went away. The stand 'Abdullah (bin 'Umar رضی اللہ عنہ ) took in regard to the inhuman treatment (meted out to 'Abdullah bin Zubair رضی اللہ عنہ ) and his words (in that connection) were conveyed to Hajjaj (bin Yusuf) and (as a consequence of that) he (the body of Abdullah bin Zubair رضی اللہ عنہ ) was brought down from the stump (the scaffold) by which it was hanging and thrown into the graves of the Jews. He (Hajjaj) sent (his messenger) to Asma' رضی اللہ عنہا (bint Abu Bakr, 'Abdullah's mother). But she refused to come. He again sent the messenger to her with the message that she must come, otherwise he would bring her forcibly catching hold of her hair. But she again refused and said: By Allah, I will not come to you until you send one to me who would drag me by pulling my hair. Thereupon he said: Bring me my shoes. He put on his shoes and walked on quickly swollen with vanity and pride until he came to her and said: How do you find what I have done with the enemy of Allah? She said: I find that you wronged him in this world, whereas he has spoiled your next life. It has been conveyed to me that you used to call him ('Abdullah bin Zubair رضی اللہ عنہ ) as the son of one having two belts. By Allah, I am indeed (a woman) of two belts. One is that with the help of which I used to suspend high the food of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and that of Abu Bakr رضی اللہ عنہ (making it out of the reach) of animals and, so far as the second belt is concerned, that is the belt which no woman can dispense with. Verily Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) told us that in Thaqif, there would be born a great liar and great murderer. The liar we have seen, and as far as the murderer is concerned, I do not find anyone else besides you. 'Thereupon he (Hajjaj) stood up and did not give any reply to her.",
                "hadithUrdu": "میں نے حضرت عبداللہ بن زبیر رضی اللہ عنہ ( کے جسد خاکی ) کو شہر کی گھاٹی میں ( کھجور کے ایک تنے سے لٹکا ہوا ) دیکھا ، کہا : تو قریش اور دوسرے لوگوں نے وہاں سے گزرنا شروع کردیا ، یہاں تک کہ حضرت عبداللہ بن عمر رضی اللہ تعالیٰ عنہ وہاں سے گزرے تو وہ ان ( ابن زبیر رضی اللہ تعالیٰ عنہ ) کے پاس کھڑے ہوگئے ، اور ( انھیں مخاطب کرتے ہوئے ) کہا : ابو خبیب!آپ پر سلام! ابو خبیب!آپ پر سلام! ابو خبیب!آپ پر سلام!اللہ گواہ ہے کہ میں آپ کو اس سے روکتا تھا ، اللہ گواہ ہے کہ میں آپ کو اس سے روکتا تھا ، اللہ گواہ ہے کہ میں آپ کو اس سے روکتا تھا ، اللہ کی قسم!آپ ، جتنا مجھے علم ہے بہت روزے رکھنے والے ، بہت قیام کرنے والے ، بہت صلہ رحمی کرنے و الے تھے ۔ اللہ کی قسم!وہ امت جس میں آپ سب سے بُرے ( قرار دیے گئے ) ہوں ، وہ امت تو پوری کی پوری بہترین ہوگی ( جبکہ اس میں تو بڑے بڑے ظالم ، قاتل اور مجرم موجود ہیں ۔ آپ کسی طور پر اس سلوک کے مستحق نہ تھے ۔ ) پھر عبداللہ بن عمر رضی اللہ عنہ وہاں سے چلے گئے ۔ حجاج کو عبداللہ بن عمر رضی اللہ تعالیٰ عنہ کے وہاں کھڑے ہونے کی خبر پہنچی تو اس نے کارندے بھیجے ، ان ( کے جسدخاکی ) کو کھجور کے تنے سے اتارا گیا اور انھیں جاہلی دور کی یہود کی قبروں میں پھینک دیا گیا ، پھر اس نے ( ابن زبیر رضی اللہ تعالیٰ عنہ کی والدہ ) حضرت اسماء بنت ابی بکر رضی اللہ تعالیٰ عنہا کے پاس کارندہ بھیجا ۔ انھوں نے اس کے پاس جانے سے انکار کردیا ۔ اس نے دوبارہ قاصد بھیجا کہ یا تو تم میرے پاس آؤ گی یا پھر میں تمھارے پاس ان لوگوں کو بھیجو ں گا جو تمھیں تمھارے بالوں سے پکڑ کر گھسیٹتے ہوئے لے آئیں گے ۔ حضرت اسماء رضی اللہ عنہا نے پھر انکار کردیا اورفرمایا : میں ہرگز تیرے پاس نہ آؤں گی یہاں تک کہ تو میرے پاس ایسے شخص کو بھیجے جو مجھے میرے بالوں سے پکڑ کر گھسیٹتے ہوئے لےجائے ۔ کہا : توحجاج کہنے لگا : مجھے میرے جوتے دکھاؤ ، اس نے جوتے پہنے اور اکڑتا ہوا تیزی سے چل پڑا ، یہاں تک کہ ان کے ہاں پہنچا اور کہا : تم نے مجھے دیکھا کہ میں نے اللہ کے دشمن کے ساتھ کیا کیا؟انھوں نے جواب دیا : میں نے تمھیں دیکھا ہے کہ تم نے اس پر اس کی دنیا تباہ کردی جبکہ اس نے تمھاری آخرت برباد کردی ، مجھے یہ بات پہنچی ہے کہ تو اسے دو پیٹیوں والی کا بیٹا ( ابن ذات النطاقین ) کہتا ہے ۔ ہاں ، اللہ کی قسم!میں دو پیٹیوں والی ہوں ۔ ایک پیٹی کے ساتھ میں رسول اللہ صلی اللہ علیہ وسلم اور ابو بکر رضی اللہ تعالیٰ عنہ کا کھانا سواری کے جانور پر باندھتی تھی اور دوسری پیٹی وہ ہے جس سے کوئی عورت مستغنی نہیں ہوسکتی ( سب کو لباس کے لیے اس کی ضرورت ہوتی ہے ۔ ) اور سنو!رسول اللہ صلی اللہ علیہ وسلم نے ہمیں بتایا تھا کہ بنو ثقیف میں ایک بہت بڑا کذاب ہوگا اور ایک بہت بڑا سفاک ہوگا ۔ کذاب ( مختار ثقفی ) کو تو ہم نے دیکھ لیا اور رہا سفاک تو میں نہیں سمجھتی کہ تیرے علاوہ کوئی اورہوگا ، کہا : تو وہ وہاں سے اٹھ کھڑا ہوا اور انھیں کوئی جواب نہ دے سکا ۔",
                "urduNarrator": "ہم سے عقبہ بن مکرم العمی نے بیان کیا، کہا ہم سے یعقوب نے بیان کیا، یعنی ابن اسحاق الحدرمی نے, ہمیں اسود بن شیبان نے ابو نوافل سے خبردی ، کہا",
                "hadithArabic": "حَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ الْعَمِّيُّ، حَدَّثَنَا يَعْقُوبُ يَعْنِي ابْنَ إِسْحَاقَ الْحَضْرَمِيَّ، أَخْبَرَنَا الْأَسْوَدُ بْنُ شَيْبَانَ، عَنْ أَبِي نَوْفَلٍ، رَأَيْتُ عَبْدَ اللهِ بْنَ الزُّبَيْرِ عَلَى عَقَبَةِ الْمَدِينَةِ، قَالَ: فَجَعَلَتْ قُرَيْشٌ تَمُرُّ عَلَيْهِ، وَالنَّاسُ حَتَّى مَرَّ عَلَيْهِ عَبْدُ اللهِ بْنُ عُمَرَ، فَوَقَفَ عَلَيْهِ فَقَالَ: السَّلَامُ عَلَيْكَ، أَبَا خُبَيْبٍ السَّلَامُ عَلَيْكَ أَبَا خُبَيْبٍ السَّلَامُ عَلَيْكَ أَبَا خُبَيْبٍ أَمَا وَاللهِ لَقَدْ كُنْتُ أَنْهَاكَ عَنْ هَذَا، أَمَا وَاللهِ لَقَدْ كُنْتُ أَنْهَاكَ عَنْ هَذَا، أَمَا وَاللهِ لَقَدْ كُنْتُ أَنْهَاكَ عَنْ هَذَا، أَمَا وَاللهِ إِنْ كُنْتَ، مَا عَلِمْتُ، صَوَّامًا، قَوَّامًا، وَصُولًا لِلرَّحِمِ، أَمَا وَاللهِ لَأُمَّةٌ أَنْتَ أَشَرُّهَا لَأُمَّةٌ خَيْرٌ، ثُمَّ نَفَذَ عَبْدُ اللهِ بْنُ عُمَرَ، فَبَلَغَ الْحَجَّاجَ مَوْقِفُ عَبْدِ اللهِ وَقَوْلُهُ، فَأَرْسَلَ إِلَيْهِ، فَأُنْزِلَ عَنْ جِذْعِهِ، فَأُلْقِيَ فِي قُبُورِ الْيَهُودِ، ثُمَّ أَرْسَلَ إِلَى أُمِّهِ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ، فَأَبَتْ أَنْ تَأْتِيَهُ، فَأَعَادَ عَلَيْهَا الرَّسُولَ: لَتَأْتِيَنِّي أَوْ لَأَبْعَثَنَّ إِلَيْكِ مَنْ يَسْحَبُكِ بِقُرُونِكِ، قَالَ: فَأَبَتْ وَقَالَتْ: وَاللهِ لَا آتِيكَ حَتَّى تَبْعَثَ إِلَيَّ مَنْ يَسْحَبُنِي بِقُرُونِي، قَالَ: فَقَالَ: أَرُونِي سِبْتَيَّ فَأَخَذَ نَعْلَيْهِ، ثُمَّ انْطَلَقَ يَتَوَذَّفُ، حَتَّى دَخَلَ عَلَيْهَا، فَقَالَ: كَيْفَ رَأَيْتِنِي صَنَعْتُ بِعَدُوِّ اللهِ؟ قَالَتْ: رَأَيْتُكَ أَفْسَدْتَ عَلَيْهِ دُنْيَاهُ، وَأَفْسَدَ عَلَيْكَ آخِرَتَكَ، بَلَغَنِي أَنَّكَ تَقُولُ لَهُ: يَا ابْنَ ذَاتِ النِّطَاقَيْنِ أَنَا، وَاللهِ ذَاتُ النِّطَاقَيْنِ، أَمَّا أَحَدُهُمَا فَكُنْتُ أَرْفَعُ بِهِ طَعَامَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَطَعَامَ أَبِي بَكْرٍ مِنَ الدَّوَابِّ، وَأَمَّا الْآخَرُ فَنِطَاقُ الْمَرْأَةِ الَّتِي لَا تَسْتَغْنِي عَنْهُ، أَمَا إِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حَدَّثَنَا، «أَنَّ فِي ثَقِيفٍ كَذَّابًا وَمُبِيرًا» فَأَمَّا الْكَذَّابُ فَرَأَيْنَاهُ، وَأَمَّا الْمُبِيرُ فَلَا إِخَالُكَ إِلَّا إِيَّاهُ، قَالَ: فَقَامَ عَنْهَا وَلَمْ يُرَاجِعْهَا.",
                "headingArabic": "ذِكْرِ كَذَّابِ ثَقِيفٍ وَمُبِيرِهَا",
                "headingUrdu": "ثقیف کا جھوٹا اور عظیم ذبح کرنے والا",
                "headingEnglish": "The Liar And Great Slaughterer Of Thaqif",
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14060,
                "hadithNumber": "6497",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: If the din were at the Pleiades, even then a person from Persia would have taken hold of it, or one amongst the Persian descent would have surely found it.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \" اگر دین ثریا پر ہوتا تب بھی فارس کا کوئی شخص ۔ ۔ ۔ یا آپ نے فرمایا ۔ ۔ ۔ فرزندان فارس میں سے کوئی شخص اس تک پہنچتا اور اسے حاصل کرلیتا ۔ \"",
                "urduNarrator": "مجھ سے محمد بن رافع اور عبد بن حمید نے بیان کیا - عبد نے کہا : ہم سے انہوں نے بیان کیا اور ابن رافع نے کہا : ہم سے عبد الرزاق نے بیان کیا ، ہم سے معمر نے ، جعفر الجزری، یزید بن اصم جزری نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، - قَالَ عَبْدٌ: أَخْبَرَنَا وقَالَ ابْنُ رَافِعٍ حَدَّثَنَا - عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ جَعْفَرٍ الْجَزَرِيِّ، عَنْ يَزِيدَ بْنِ الْأَصَمِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَوْ كَانَ الدِّينُ عِنْدَ الثُّرَيَّا، لَذَهَبَ بِهِ رَجُلٌ مِنْ فَارِسَ - أَوْ قَالَ - مِنْ أَبْنَاءِ فَارِسَ حَتَّى يَتَنَاوَلَهُ».",
                "headingArabic": "فَضْلِ فَارِسَ ‏‏",
                "headingUrdu": "فارسیوں کے فضائل",
                "headingEnglish": "The Virtues Of The Persians",
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14061,
                "hadithNumber": "6498",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "We were sitting in the company of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) that Sura al-Jumu'a was revealed to him and when he recited (these words): Others from amongst them who have not yet joined them, a person amongst them (those who were sitting there) said: Allah's Messenger! But Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) made no reply, until he questioned him once, twice or thrice. And there was amongst us Salman رضی اللہ عنہ the Persian. The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) placed his hand on Salman رضی اللہ عنہ and then said: Even if faith were near the Pleiades, a man from amongst these would surely find it.",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے پاس بیٹھے ہوئے تھے  جب نبی کریم صلی اللہ علیہ وسلم پر سورۃ الجمعہ   نازل ہوئی اور آپ نے یہ پڑھا : ﴿ وَآخَرِينَ مِنْهُمْ لَمَّا يَلْحَقُوا﴾ \"\" ان میں اور بھی لوگ ہیں جو اب تک آکر ان سے نہیں ملے ہیں ۔ \"\" ( الجمعۃ 62 : 3 ) تو ایک نے عرض کی : اللہ کے رسول صلی اللہ علیہ وسلم !وہ کون لوگ ہیں؟نبی کریم صلی اللہ علیہ وسلم نے اس کا کوئی جواب نہ دیا ، حتیٰ کہ اس نے آپ سے ایک یا دو یا تین بار سوال کیا ، کہا : اس وقت ہم میں حضرت سلمان فارسی رضی اللہ تعالیٰ عنہ بھی موجود تھے ، نبی کریم صلی اللہ علیہ وسلم نے حضرت سلمان رضی اللہ تعالیٰ عنہ پر ہاتھ رکھا ، پھر فرمایا؛ \"\" اگر ایمان ثریا کے قریب بھی ہوتا تو ان میں سے کچھ لوگ اس کو حاصل کرلیتے ۔ \"\"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، انہیں عبدالعزیز نے، یعنی ابن محمد نے، ہم سے ایک بیل کے بارے میں بیان کیا, ابو غیث نے حضرت ابو ہریر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُحَمَّدٍ، عَنْ ثَوْرٍ، عَنْ أَبِي الْغَيْثِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: كُنَّا جُلُوسًا عِنْدَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، إِذْ نَزَلَتْ عَلَيْهِ سُورَةُ الْجُمُعَةِ، فَلَمَّا قَرَأَ: {وَآخَرِينَ مِنْهُمْ لَمَّا يَلْحَقُوا بِهِمْ} [الجمعة: 3] قَالَ رَجُلٌ: مَنْ هَؤُلَاءِ؟ يَا رَسُولَ اللهِ فَلَمْ يُرَاجِعْهُ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حَتَّى سَأَلَهُ مَرَّةً أَوْ مَرَّتَيْنِ أَوْ ثَلَاثًا، قَالَ: وَفِينَا سَلْمَانُ الْفَارِسِيُّ قَالَ: فَوَضَعَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَدَهُ عَلَى سَلْمَانَ، ثُمَّ قَالَ: «لَوْ كَانَ الْإِيمَانُ عِنْدَ الثُّرَيَّا، لَنَالَهُ رِجَالٌ مِنْ هَؤُلَاءِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14062,
                "hadithNumber": "6499",
                "englishNarrator": "Ibn 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: You would find people like one hundred camels and you would not find even one (camel) fit for riding.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم لوگوں کو ایسے سواونٹوں کی مثل پاؤ گے کہ آدمی ان میں سے ایک بھی سواری کے لائق نہیں پاتا ۔ \"",
                "urduNarrator": "مجھ سے محمد بن رافع اور عبد بن حمید نے بیان کیا - اور یہ لفظ محمد کے لیے ہے عبد نے کہا : اس نے ہمیں خبر دی ، اور ابن رافع نے کہا : ہم سے عبد الرزاق نے بیان کیا ۔ ہم سے معمر نے الزہری کی سند سے بیان کیا, سالم نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ - وَاللَّفْظُ لِمُحَمَّدٍ قَالَ عَبْدٌ: أَخْبَرَنَا، وقَالَ ابْنُ رَافِعٍ: حَدَّثَنَا - عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «تَجِدُونَ النَّاسَ كَإِبِلٍ مِائَةٍ، لَا يَجِدُ الرَّجُلُ فِيهَا رَاحِلَةً».",
                "headingArabic": "قَوْلِهِ صلى الله عليه وسلم ‏\"‏ النَّاسُ كَإِبِلٍ مِائَةٍ لاَ تَجِدُ فِيهَا رَاحِلَةً ‏\"‏",
                "headingUrdu": "رسول اللہ صلی اللہ علیہ وسلم کا ارشاد ہے: \"لوگ سو اونٹوں کی مانند ہیں جن میں سے ایک بھی سواری کے قابل نہیں ہے\"",
                "headingEnglish": "The Words Of The Prophet (SAW): \"People Are Like A Hundred Camels Among Whom You Cannot Find One That Is Fit For Riding\"",
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14063,
                "hadithNumber": "6500",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "A person came to Allah, 's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and said: Who among the people is most deserving of a fine treatment from my hand? He said: Your mother. He again said: Then who (is the next one)? He said: Again it is your mother (who deserves the best treatment from you). He said: Then who (is the next one)? He (the Holy Prophet) said: Again, it is your mother. He (again) said: Then who? Thereupon he said: Then it is your father. In the hadith transmitted on the authority of Qutalba, there is no mention of the word the people .",
                "hadithUrdu": "ایک شخص رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور عرض کی : لوگوں میں سے حسنِ معاشرت ( خدمت اور حسن سلوک ) کا سب سے زیادہ حقدار کون ہے؟ آپ نے فرمایا : تمہاری ماں ۔ \"\" اس نے کہا : پھر کون؟ فرمایا : \"\" پھر تمہاری ماں ۔ \"\" اس نے پوچھا : اس کے بعد کون؟ فرمایا : \"\" پھر تمہاری ماں ۔ \"\" اس نے پوچھا : پھر کون؟ فرمایا : \"\" پھر تمہارا والد ۔ \"\" اور قتیبہ کی حدیث میں ہے : میرے اچھے برتاؤ کا زیادہ حقدار کون ہے؟ اور انہوں نے \"\" لوگوں میں سے \"\" کا ذکر نہیں کیا ۔",
                "urduNarrator": "قتیبہ بن سعید بن جمیل بن طریف ثقفی اور زہیر بن حرب نے کہا : ہمیں جریر نے عمارہ بن قعقاع سے حدیث بیان کی ، انہوں نے ابوزرعہ سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدِ بْنِ جَمِيلِ بْنِ طَرِيفٍ الثَّقَفِيُّ وَزُهَيْرُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا جَرِيرٌ عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ عَنْ أَبِي زُرْعَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَنْ أَحَقُّ النَّاسِ بِحُسْنِ صَحَابَتِي قَالَ أُمُّكَ قَالَ ثُمَّ مَنْ قَالَ ثُمَّ أُمُّكَ قَالَ ثُمَّ مَنْ قَالَ ثُمَّ أُمُّكَ قَالَ ثُمَّ مَنْ قَالَ ثُمَّ أَبُوكَ وَفِي حَدِيثِ قُتَيْبَةَ مَنْ أَحَقُّ بِحُسْنِ صَحَابَتِي وَلَمْ يَذْكُرْ النَّاسَ.",
                "headingArabic": "بِرِّ الْوَالِدَيْنِ وَأَنَّهُمَا أَحَقُّ بِهِ ‏‏",
                "headingUrdu": "والدین کے ساتھ حسن سلوک کرنا، اور ان میں سے کون اس کا زیادہ حقدار ہے۔",
                "headingEnglish": "Being Dutiful To One's Parents, And Which Of Them Is More Entitled To It",
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 13751,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=550",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=548",
                "label": "548",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=549",
                "label": "549",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=550",
                "label": "550",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=551",
                "label": "551",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=552",
                "label": "552",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=553",
                "label": "553",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=554",
                "label": "554",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=552",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=552",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=550",
        "to": 13775,
        "total": 40465
    }
}