{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 319,
        "data": [
            {
                "id": 8239,
                "hadithNumber": "675",
                "englishNarrator": "Asma (daughter of Abu Bakr) reported:",
                "hadithEnglish": "A woman came to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: What should one do if the blood of menses smears the garment of one amongst us? He (the Holy Prophet) replied: She should scrape it, then rub it with water, then pour water over it and then offer prayer in it.",
                "hadithUrdu": "ایک عورت نبی کریم ﷺ کے پاس آئی اور پوچھا : ہم میں سے کسی کو کپڑے کو حیض کا خون لگ جاتا ہے تو وہ اس کے بارے میں کیا کرے ؟ آپ نے فرمایا : ’’اسے کھرچ ڈالے ، پھر پانی ڈال کر اسے رگڑے ، پھر اس پر پانی بہا دے ( دھولے ) ، پھر اس میں نماز پڑھ لے ۔ ‘ ‘",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا,وکیع نے بیان کیا ، ہمیں ہشام نے حدیث سنائی : اور یحییٰ بن سعید نے ہشام بن عروہ سے روایت کی ، کہا ,مجھے فاطمہ ( بنت منذر ) نے حدیث سنائی ، انہوں نے ( اپنی اور ہشام دونوں کی دادی ) حضرت اسماء ؓ سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ ح، وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ - وَاللَّفْظُ لَهُ - حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ قَالَ: حَدَّثَتْنِي فَاطِمَةُ، عَنْ أَسْمَاءَ قَالَتْ: جَاءَتِ امْرَأَةٌ إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَتْ: إِحْدَانَا يُصِيبُ ثَوْبَهَا مِنْ دَمِ الْحَيْضَةِ، كَيْفَ تَصْنَعُ بِهِ، قَالَ: «تَحُتُّهُ، ثُمَّ تَقْرُصُهُ بِالْمَاءِ، ثُمَّ تَنْضَحُهُ، ثُمَّ تُصَلِّي فِيهِ».",
                "headingArabic": "نَجَاسَةِ الدَّمِ وَكَيْفِيَّةِ غَسْلِهِ ‏‏",
                "headingUrdu": "خون کی نجاست اور اسے دھونے کا طریقہ",
                "headingEnglish": "The impurity of blood and how to wash it",
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8240,
                "hadithNumber": "676",
                "englishNarrator": null,
                "hadithEnglish": "This tradition is narrated by Abu Kuraib, Ibn Numair, Abu Tahir, Ibn Wahb, Yahya bin 'Abdullah bin Salim, Malik bin Anas, 'Amr bin Harith on the authority of Hisham bin 'Urwa, with the same chain of transmitters like one transmitted by Yahya bin Sa'id like the above-mentioned.",
                "hadithUrdu": "ہم سے ابو کریب نے بیان کیا، کہا ہم سے ابن نمیر نے بیان کیا، کہا کہ مجھ سے ابو الطاہر نے بیان کیا، مجھ سے ابن وہب نے بیان کیا,یحییٰ بن عبد اللہ بن سالم ، مالک بن انس اور عمرو بن حارث تینوں نے ہشام بن عروہ کی مذکورہ بالا سند کے ساتھ یہی روایت اسی طرح بیان کی جس طرح یحییٰ بن سعید نے بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا ابْنُ نُمَيْرٍ ح، وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنِي ابْنُ وَهْبٍ، أَخْبَرَنِي يَحْيَى بْنُ عَبْدِ اللهِ بْنِ سَالِمٍ، وَمَالِكُ بْنُ أَنَسٍ، وَعَمْرُو بْنُ الْحَارِثِ، كُلُّهُمْ عَنْ هِشَامِ بْنِ عُرْوَةَ بِهَذَا الْإِسْنَادِ مِثْلَ حَدِيثِ يَحْيَى بْنِ سَعِي.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8241,
                "hadithNumber": "677",
                "englishNarrator": "Ibn Abbas reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) happened to pass by two graves and said: They (their occupants) are being tormented, but they are not tormented for a grievous sin. One of them carried tales and the other did not keep himself safe from being defiled by urine. He then called for a fresh twig and split it into two parts, and planted them on each grave and then said: Perhaps, their punishment way be mitigated as long as these twigs remain fresh.",
                "hadithUrdu": "رسو ل اللہ ﷺ کا گزر دو قبروں پر ہوا تو آپ نے فرمایا : ’’ان دونوں کو عذاب ہو رہا ہے اور کسی بڑی غلطی کی بناپر عذاب نہیں ہو رہا ( جس سے بچنا دشوار ہوتا ۔ ) ان میں ایک تو چغل خوری کرتا تھا اور دوسرا اپنے پیشاب سے بچنے کا اہتمام نہیں کرتا تھا ۔ ‘ ‘ ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : پھر آپ نے ایک تازہ کھجور کی چھڑی منگوائی اور اس کو دوحصوں میں چیر دیا ، پھر ایک حصہ اس قبر پر گاڑ دیا اور دوسرا اس ( دوسری قبر ) پر ، پھر آپ نے فرمایا : ’’امید ہے جب تک یہ دو ٹہنیاں سوکھیں گی نہیں ، ان کا عذاب ہلکا رہے گا ۔ ‘ ‘",
                "urduNarrator": "وکیع نے بیان کیا ، ( کہا : ) ہمیں اعمش نے حدیث سنائی ، انہوں نے کہا : میں نے مجاہد کو طاؤس سے حدیث بیان کرتے ہوئے سنا ، انہوں نے حضرت ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ، وَأَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، - قَالَ إِسْحَاقُ: أَخْبَرَنَا وَقَالَ الْآخَرَانِ - حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا الْأَعْمَشُ، قَالَ: سَمِعْتُ مُجَاهِدًا، يُحَدِّثُ عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ قَالَ: مَرَّ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى قَبْرَيْنِ فَقَالَ: «أَمَا إِنَّهُمَا لَيُعَذَّبَانِ وَمَا يُعَذَّبَانِ فِي كَبِيرٍ، أَمَّا أَحَدُهُمَا فَكَانَ يَمْشِي بِالنَّمِيمَةِ، وَأَمَّا الْآخَرُ فَكَانَ لَا يَسْتَتِرُ مِنْ بَوْلِهِ»، قَالَ فَدَعَا بِعَسِيبٍ رَطْبٍ فَشَقَّهُ بِاثْنَيْنِ ثُمَّ غَرَسَ عَلَى هَذَا وَاحِدًا وَعَلَى هَذَا وَاحِدًا ثُمَّ قَالَ: «لَعَلَّهُ أَنْ يُخَفَّفُ عَنْهُمَا مَا لَمْ يَيْبَسَا».",
                "headingArabic": "الدَّلِيلِ عَلَى نَجَاسَةِ الْبَوْلِ وَوُجُوبِ الاِسْتِبْرَاءِ مِنْهُ",
                "headingUrdu": "پیشاب کے نجس ہونے کی دلیل اور اس سے متعلق احتیاطی تدابیر",
                "headingEnglish": "The evidence that urine is impure and the obligation to take precautions concerning it",
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8242,
                "hadithNumber": "678",
                "englishNarrator": "This hadith is transmitted from A'mash by Abmad bin Yusuf al-Azdi, Mu'alla bin Asad, Abd al-Wahid, Sulaiman with the same chain of transmitters but for the words:",
                "hadithEnglish": "The other did not keep himself safe from being defiled by urine.",
                "hadithUrdu": "انہوں نے کہا اور دوسرے نے اسے پیشاب سے یا پیشاب سے نہیں نکالا۔",
                "urduNarrator": "مجھ سے احمد بن یوسف ازدی نے بیان کیا، ہم سے معاذ بن اسد نے بیان کیا، انہیں عبد الواحد نے، سلیمان العمش کی سند سے، اس سند کے ساتھ، سوائے اس کے کہ",
                "hadithArabic": "حَدَّثَنِيهِ أَحْمَدُ بْنُ يُوسُفَ الْأَزْدِيُّ، حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، عَنْ سُلَيْمَانَ الْأَعْمَشِ، بِهَذَا الْإِسْنَادِ غَيْرَ أَنَّهُ قَالَ: وَكَانَ الْآخَرُ لَا يَسْتَنْزِهُ عَنِ الْبَوْلِ - أَوْ مِنَ الْبَوْلِ -.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8243,
                "hadithNumber": "679",
                "englishNarrator": "A'isha reported:",
                "hadithEnglish": "When anyone amongst us (amongst the wives of the Holy Prophet) menstruated, the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) asked her to tie a waist-wrapper over her (body) and then embraced her.",
                "hadithUrdu": "ہم ( ازواد نبی ﷺ ) میں سے کسی ایک کے خصوصی ایام ہوتے ہیں تو رسول اللہ ﷺ چادر باندھنے کا حکم دیتے ، وہ چادر باندھ لیتی تو پھر آپ اس کےساتھ لیٹ جاتے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور زہیر بن حرب نے بیان کیا,ابراہیم نے اسو د سے انہوں نے حضرت عائشہ ؓ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، - قَالَ إِسْحَاقُ: أَخْبَرَنَا، وَقَالَ الْآخَرَانِ - حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الْأَسْوَدِ، عَنْ عَائِشَةَ قَالَتْ: «كَانَ إِحْدَانَا إِذَا كَانَتْ حَائِضًا أَمَرَهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَتَأْتَزِرُ بِإِزَارٍ ثُمَّ يُبَاشِرُهَا».",
                "headingArabic": "مُبَاشَرَةِ الْحَائِضِ فَوْقَ الإِزَارِ ‏‏",
                "headingUrdu": "حیض والی عورت کو ازار کے اوپر چھونا (کمر کی چادر)",
                "headingEnglish": "Touching a menstruating woman above the izar (waist wrapper)",
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8244,
                "hadithNumber": "680",
                "englishNarrator": null,
                "hadithEnglish": "A'isha reported: When anyone amongst us was menstruating the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) asked her to tie waist-wrapper daring the time when the menstrual blood profusely flowed and then embraced her; and she ('A'isha) observed: And who amongst you can have control over his desires as the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had over his desires.",
                "hadithUrdu": "عبد الرحمان بن اسود نے اپنے والد سے ، انہوں نے حضرت عائشہ ؓ سے روایت کی ، کہا : ہم میں سے کسی کے خصوصی ایام ہوتے توآپﷺ اس کے جوش و کثرت کےدنوں میں اسے تہبند باندھنے کا حکم دیتے ، پھر اس کے ساتھ لیٹ جاتے ۔ حضرت عائشہ ؓ نے فرمایا : تم میں سے کون ہے جو اپنی خواہش پر اس قدر ضبط رکھتا ہو جس قدر رسول اللہ ﷺ اپنی خواہش پر قابو رکھتے تھے ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا أَبُو بكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عليُّ بْنُ مُسْهرٍ، عَنِ الشَّيْبانيِّ ح، وَحَدَّثَنِي عليُّ بْنُ حُجْرٍ السَّعْديُّ، - واللَّفْظُ لهُ - أَخْبَرَنَا عليُّ بْنُ مُسْهرٍ، أَخْبَرَنَا أَبُو إِسْحَاقَ، عَنْ عَبْدِ الرَّحْمنِ بْنِ الْأَسْودِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ قَالَتْ: «كَانَ إِحْدَانَا إِذَا كَانَتْ حَائِضًا أَمَرَهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ تَأْتَزِرَ فِي فَوْرِ حَيْضَتِها، ثُمَّ يُبَاشِرُهَا» قَالَتْ: «وَأَيُّكُمْ يَمْلِكُ إِرْبَهُ كَمَا كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَمْلِكُ إِرْبَهُ»",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8245,
                "hadithNumber": "681",
                "englishNarrator": "Maimuna (the wife of the Holy Prophet) reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) contacted and embraced his wives over the waist-wrapper when they were menstruating.",
                "hadithUrdu": "رسول اللہ ﷺ اپنی بیویوں کے مخصوص ایام میں کپڑے کے اوپر ان کے ساتھ لگ کر لیٹ جاتے ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا ہم سے خالد بن عبداللہ نے بیان کیا، انہوں نے شیبانی کی سند سے، وہ عبداللہ بن شداد سے,حضرت میمونہؓ سے روایت ہے ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللهِ، عَنِ الشَّيْبَانِيِّ، عَنْ عَبْدِ اللهِ بْنِ شَدَّادٍ، عَنْ مَيْمُونَةَ قَالَتْ: «كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُبَاشِرُ نِسَاءَهُ فَوْقَ الْإِزَارِ وَهُنَّ حُيَّضٌ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8246,
                "hadithNumber": "682",
                "englishNarrator": "Kuraibthe freed slave of Ibn Abbas رضی ‌اللہ ‌عنہ , reported:",
                "hadithEnglish": "I heard it from Maimuna, the wife of the Messenger of Allah (way peace be upon him): The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to lie with me when I menstruated, and there was a cloth between me and him.",
                "hadithUrdu": "میں نے رسول اللہ ﷺ کی زوجہ حضرت میمونہ ؓ سے سنا ، کہا : جب میرے مخصوص ایام ہوتے تو رسول اللہ ﷺ میرے ساتھ لیٹ جاتے ( اس وقت ) میرے اور آپ کے درمیان کپڑا حائل ہوتا تھا ۔",
                "urduNarrator": "مجھ سے ابو الطاہر نے بیان کیا، ہم سے ابن وہب نے بیان کیا، وہ مخرمہ کی سند سے، ہم سے ہارون بن سعید العیلی اور احمد بن عیسیٰ نے بیان کیا، انہوں نے کہا: ہم سے ابن ڈبلیو نے بیان کیا، آؤ، مخرمہ نے کہا۔ میں اس کے والد کے بارے میں ,حضرت ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے آزاد کر دہ غلام ابو کریب نے کہا",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، عَنْ مَخْرَمَةَ، ح، وَحَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ، وَأَحْمَدُ بْنُ عِيسَى، قَالَا: حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي مَخْرَمَةُ، عَنْ أَبِيهِ، عَنْ كُرَيْبٍ مَوْلَى ابْنِ عبَّاسٍ، قَالَ: سَمِعْتُ مَيْمُونَةَ زَوْجَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَتْ: «كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَضْطَجِعُ مَعِي وَأَنَا حَائِضٌ، وَبَيْنِي وَبَيْنَهُ ثَوْبٌ».",
                "headingArabic": "الاِضْطِجَاعِ مَعَ الْحَائِضِ فِي لِحَافٍ وَاحِدٍ ‏‏",
                "headingUrdu": "حیض والی عورت کے ساتھ ایک ہی غلاف کے نیچے لیٹنا",
                "headingEnglish": "Lying down with a menstruating woman under a single cover",
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8247,
                "hadithNumber": "683",
                "englishNarrator": "Umm Salama reported:",
                "hadithEnglish": "While I was lying with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) in a bed cover I menstruated, so I slipped away and I took up the clothes (which I wore) in menses. Upon this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Have you menstruated? I said: Yes. He called me and I lay down",
                "hadithUrdu": "میں رسول اللہ ﷺ کے ساتھ رؤئیں دار چادر میں لیٹی ہوئی تھی ، اس اثنا میں میرے ایام کا آغاز ہو گیا اور میں کھسک گئی اور ان ایام کے کپڑے لے لیے تو رسو ل اللہ ﷺ نے دریافت فرمایا : ’’کیا تمہارے ایام شروع ہو گئے ؟ ‘ ‘ میں نے جواب دیا : جی ہاں ۔ تو آپ نےمجھے پاس بلا لیا اور میں آپ کے ساتھ اوڑھنے کی ایک ہی روئیں دار چادر میں لیٹ گئی ۔ ام سلمہ نے بتایاکہ وہ اور رسول اللہﷺ اکٹھے ایک برتن میں غسل جنابت کر لیتے تھے ۔",
                "urduNarrator": "ہم سے محمد بن المثنیٰ نے بیان کیا، ہم سے معاذ بن ہشام نے بیان کیا، مجھ سے میرے والد نے یحییٰ بن ابی کثیر کی سند سے بیان کیا,ابو سلمہ بن عبد الرحمن نے بیان کیا کہ حضرت ام سلمہ ؓ نے انہیں بتایا ، کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنِي أَبِي، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، حَدَّثَنَا أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ زَيْنَبَ بِنْتَ أُمِّ سَلَمَةَ حَدَّثَتْهُ أَنَّ أُمَّ سَلَمَةَ، حَدَّثَتْهَا قَالَتْ: بَيْنَمَا أَنَا مُضْطَجِعَةٌ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي الْخَمِيلَةِ، إِذْ حِضْتُ، فَانْسَلَلْتُ، فَأَخَذْتُ ثِيَابَ حِيْضَتِي فَقَالَ لِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَنَفِسْتِ؟» قُلْتُ: نَعَمْ، فَدَعَانِي فَاضْطَجَعْتُ مَعَهُ فِي الْخَمِيلَةِ. قَالَتْ: «وَكَانَتْ هِيَ وَرَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَغْتَسِلَانِ فِي الْإِنَاءِ الْوَاحِدِ، مِنَ الْجَنَابَةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8248,
                "hadithNumber": "684",
                "englishNarrator": "It is reported from 'A'isha: She observed:",
                "hadithEnglish": "When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was in I'tikaf, he inclined his head towards me and I combed his hair, and he did not enter the house but for the natural calls (for relieving himself).",
                "hadithUrdu": "جب رسول اللہ ﷺ اعتکاف کرتے تو اپنا سر ( گھر کے دروازے سے ) میرے قریب کر دیتے ، میں اس میں کنگھی کر دیتی اور آپ انسانی ضرورت کے بغیر گھر میں تشریف نہ لاتے تھے ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا,مالک نے ابن شہاب سے ، انہوں نے عروہ سے ، انہوں نے عمرہ سے اور انہوں نے حضرت عائشہ ؓ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، قَالَتْ: «كَانَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، إِذَا اعْتَكَفَ، يُدْنِي إِلَيَّ رَأْسَهُ فَأُرَجِّلُهُ، وَكَانَ لَا يَدْخُلُ الْبَيْتَ إِلَّا لِحَاجَةِ الْإِنْسَانِ».",
                "headingArabic": "جَوَازِ غَسلِ الْحَائِضِ رَأْسَ زَوْجِهَا وَتَرْجِيلِهِ وَطَهَارَةِ سُؤْرِهَا وَالاِتِّكَاءِ فِي حِجْرِهَا وَقِرَاءَةِ الْقُرْآنِ فِيهِ",
                "headingUrdu": "حیض والی عورت کے لیے شوہر کا سر دھونا اور بالوں میں کنگھی کرنا جائز ہے۔ اس کا بچا ہوا حصہ پاک ہے۔ اور اس کی گود میں بیٹھنے اور قرآن کی تلاوت کرنے کے بارے میں",
                "headingEnglish": "It is permissible for a menstruating woman to wash her husband’s head, and comb his hair; her leftovers are pure (tahir); and regarding reclining in her lap and reciting Qur’an",
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8249,
                "hadithNumber": "685",
                "englishNarrator": "Amra daughter of 'Abd al-Rahman reported:",
                "hadithEnglish": "'A'isha, wife of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) observed: When I was (in I'tikaf), I entered the house for the call of nature, and while passing I inquired after the health of the sick (in the. family), and when the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was (in I'tikaf), he put out his head towards me, while he himself was in the mosque, and I combed his hair; and he did not enter the house except for the call of nature so long as he was In I'tikaf; and Ibn Rumh stated: As long as they (the Prophet and his wives) were among the observers of I'tikaf.",
                "hadithUrdu": "( جب میں اعتکاف میں ہوتی تو ) قضائے حاجت کے لیے گھر میں داخل ہوتی ، اس میں کوئی بیمارہوتا تو میں بس گزرتے گزرتے ہی اس سے ( حال ) پوچھ لیتی اوراگر رسول اللہ ﷺ مسجدسے میرے پاس ( حجرے میں ) سر داخل فرماتے تو میں اس میں کنگھی کر دیتی ، جب آپ اعتکاف میں ہوتے تو گھر میں کسی ( حقیقی ) ضرورت کے بغیر داخل نہ ہوتے ۔ ابن رمح نے ( ’’جب آپ ﷺ معتکف ہوتے ‘ ‘ کے بجائے ) ’’جب سب لوگ اعتکاف میں ہوتے ‘ ‘ کہا ۔",
                "urduNarrator": "قتیبہ بن سعید اور محمد بن رمح نے لیث سے ، انہوں نے ابن شہاب سے ، انہوں نے عروہ اور عمرہ بنت عبد الرحمن سے روایت کی کہ رسول اللہﷺکی زوجہ حضرت عائشہ ؓ نے فرمایا",
                "hadithArabic": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح، وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، قَالَ: أَخْبَرَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، وَعَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، أَنَّ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَتْ: «إِنْ كُنْتُ لَأَدْخُلُ الْبَيْتَ لِلْحَاجَةِ، وَالْمَرِيضُ فِيهِ، فَمَا أَسْأَلُ عَنْهُ إِلَّا وَأَنَا مَارَّةٌ، وَإِنْ كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لَيُدْخِلُ عَلَيَّ رَأْسَهُ وَهُوَ فِي الْمَسْجِدِ فَأُرَجِّلُهُ، وَكَانَ لَا يَدْخُلُ الْبَيْتَ إِلَّا لِحَاجَةٍ، إِذَا كَانَ مُعْتَكِفًا» وقَالَ ابْنُ رُمْحٍ: إِذَا كَانُوا مُعْتَكِفِينَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8250,
                "hadithNumber": "686",
                "englishNarrator": "A'isha, the wife of the Apostle (may peace he upon him), reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) put out from the mosque his head for me as he was in I'tikaf, and I washed it in the state that I was menstruating.",
                "hadithUrdu": "رسول اللہ ﷺ حالت اعتکاف میں مسجد سے میری طرف سر نکالتے تو میں ایام خصوصی میں ہوتے ہوئے اس کو دھو دیتی ۔",
                "urduNarrator": "مجھ سے ہارون بن سعید العیلی نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، مجھ سے عمرو بن حارث نے بیان کیا,محمدبن عبد الرحمن بن نوفل نے عروہ بن زبیر سے ، انہوں نے رسول اللہﷺ کی زوجہ حضرت عائشہ ؓ سے روایت کی کہ انہوں نے کہا",
                "hadithArabic": "وَحَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ نَوْفَلٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهَا قَالَتْ: «كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُخْرِجُ إِلَيَّ رَأْسَهُ مِنَ الْمَسْجِدِ، وَهُوَ مُجَاوِرٌ، فَأَغْسِلُهُ وَأَنَا حَائِضٌ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8251,
                "hadithNumber": "687",
                "englishNarrator": "Urwa reported it from 'A'isha that she observed:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) inclined his head towards me (from the mosque) while I was in my apartment and I combed it in a state of menstruation.",
                "hadithUrdu": "رسول اللہ ﷺ ( اعتکاف کی حالت میں ) اپنا سر میرے قریب کر دیتے جبکہ میں اپنے حجرے میں ہوتی اور میں حیض کی حالت میں آپ کے سر میں کنگھی کر دیتی تھی ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا ہم سے ابو خیثمہ نے بیان کیا,ہشام نے کہا , عروہ بن ہمیں حضرت عائشہ ؓ سے خبر دی کہ انہوں نے کہا",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو خَيْثَمَةَ، عَنْ هِشَامٍ، أَخْبَرَنَا عُرْوَةُ، عَنْ عَائِشَةَ أَنَّهَا قَالَتْ: «كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُدْنِي إِلَيَّ رَأْسَهُ وَأَنَا فِي حُجْرَتِي، فَأُرَجِّلُ رَأْسَهُ وَأَنَا حَائِضٌ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8252,
                "hadithNumber": "688",
                "englishNarrator": "Al-Aswad narrated it from 'A'isha:",
                "hadithEnglish": "She observed: I used to wash the head of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), while I was in a state of menstruation.",
                "hadithUrdu": "انہوں نےکہا : میں ایام مخصوصہ میں رسول اللہ ﷺ کاسر دھودیتی تھی ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے حسین بن علی نے بیان کیا، انہوں نے زیدہ سے، منصور کی سند سے، ابراہیم کی سند سے,اسود نے حضرت عائشہ ؓ سے روایت کی",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ، عَنْ زَائِدَةَ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الْأَسْوَدِ، عَنْ عَائِشَةَ قَالَتْ: «كُنْتُ أَغْسِلُ رَأْسَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَأَنَا حَائِضٌ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8253,
                "hadithNumber": "689",
                "englishNarrator": "A'isha reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to me: Get me the mat from the mosque. I said: I am menstruating. Upon this he remarked: Your menstruation is not in your hand.",
                "hadithUrdu": "رسول ا للہ ﷺ نے مجھ سے فرمایا : ’’مجھے مسجد میں سے جائے نماز پکڑا دو ۔ ‘ ‘ کہا : میں نے عرض کی : میں حائضہ ہوں ۔ آپ نے فرمایا : ’’تمہار ا حیض تمہارے ہاتھ میں نہیں ہے ۔ ‘ ‘",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ، ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، انہوں نے کہا کہ ہم سے یحییٰ نے بیان کیا اور باقی دو نے کہا کہ ہم سے ابو معاویہ نے بیان کیا،اعمش نے ثابت بن عبید سے ، انہوں نے قاسم بن محمد سے اور انہوں نے حضرت عائشہ ؓ سے روایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، - قَالَ: يَحْيَى، أَخْبَرَنَا وَقَالَ الْآخَرَانِ - حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ ثَابِتِ بْنِ عُبَيْدٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ قَالَتْ: قَالَ لِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «نَاوِلِينِي الْخُمْرَةَ مِنَ الْمَسْجِدِ»، قَالَتْ فَقُلْتُ: إِنِّي حَائِضٌ، فَقَالَ: «إِنَّ حَيْضَتَكِ لَيْسَتْ فِي يَدِكِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8254,
                "hadithNumber": "690",
                "englishNarrator": "A'isha reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) ordered me that I should get him the mat from the mosque. I said: I am menstruating. He (the Holy Prophet) said: Do get me that, for menstruation is not in your hand.",
                "hadithUrdu": "رسول اللہ ﷺ نے مجھے حکم دیا کہ میں مسجدسے آپ کو جائے نماز پکڑا دوں ، میں نےعرض کی : میں حائضہ ہوں ۔ آپ نے فرمایا : ’’حیض تمہارےہاتھ میں نہیں ہے ۔ ‘ ‘",
                "urduNarrator": "ہم سے ابو کریب نے بیان کیا، کہا ہم سے ابن ابی زیدہ نے بیان کیا,حجاج اور ابن ابی غنیہ نے ثابت سے ، انہوں نے قاسم بن محمد سے ، انہوں نے حضرت عائشہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ، عَنْ حَجَّاجٍ، وَابْنِ أَبِي غَنِيَّةَ، عَنْ ثَابِتِ بْنِ عُبَيْدٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ قَالَتْ: أَمَرَنِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ أُنَاوِلَهُ الْخُمْرَةَ مِنَ الْمَسْجِدِ، فَقُلْتُ: إِنِّي حَائِضٌ، فَقَالَ: «تَنَاوَلِيهَا فَإِنَّ الْحَيْضَةَ لَيْسَتْ فِي يَدِكِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8255,
                "hadithNumber": "691",
                "englishNarrator": "Abu Huraira reported:",
                "hadithEnglish": "While the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was in the mosque, he said: O 'A'isha, get me that garment. She said: I am menstruating. Upon this he remarked: Your menstruation is not in your hand, and she, therefore, got him that.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم مسجد میں تھے۔ اتنے میں آپ صلی اللہ علیہ وسلم نے فرمایا: ”اے عائشہ! مجھ کو کپڑا اٹھا دے“، انہوں نے کہا: میں حائضہ ہوں، آپ صلی اللہ علیہ وسلم نے فرمایا: ”تیرا حیض تیرے ہاتھ میں نہیں ہے“ پھر انہوں نے کپڑا اٹھا دیا۔",
                "urduNarrator": "مجھ سے زہیر بن حرب، ابو کامل اور محمد بن حاتم نے بیان کیا، وہ سب نے یحییٰ بن سعید کی سند سے بیان کیا، انہوں نے کہا: ہم سے زہیر، یحییٰ نے، یزید بن کیسان سے، ابوحازم کی سند سے,سیدنا ابوہریرہ رضی اللہ عنہ سے روایت ہے",
                "hadithArabic": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَأَبُو كَامِلٍ، وَمُحَمَّدُ بْنُ حَاتِمٍ، كُلُّهُمْ عَنْ يَحْيَى بْنِ سَعِيدٍ، قَالَ: زُهَيْرٌ، حَدَّثَنَا يَحْيَى، عَنْ يَزِيدَ بْنِ كَيْسَانَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: بَيْنَمَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي الْمَسْجِدِ، فَقَالَ يَا عَائِشَةُ: نَاوِلِينِي الثَّوْبَ فَقَالَتْ: إِنِّي حَائِضٌ، فَقَالَ: «إِنَّ حَيْضَتَكِ لَيْسَتْ فِي يَدِكِ» فَنَاوَلَتْهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8256,
                "hadithNumber": "692",
                "englishNarrator": "A'isha reported:",
                "hadithEnglish": "I would drink when I was menstruating, then I would hand it (the vessel) to the Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and he would put his mouth where mine had been, and drink, and I would eat flesh from a bone when I was menstruating, then hand it over to the Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and he would put his mouth where mine had been. Zuhair made no mention of (the Holy Prophet's) drinking.",
                "hadithUrdu": "میں ایام مخصوصہ کے دوران میں پانی پی کر نبی اکرمﷺ کو پکڑا دیتی تو آپ اپنا منہ میرے منہ کی جگہ پر رکھ کر پانی پی لیتے ، اور میں دانتوں کےساتھ ہڈی سےگوشت نوچتی جبکہ میرے مخصوص ایام ہوتے ، پھر وہ ( ہڈی ) نبی ﷺ کو دیتی تو آپ میرے منہ والی جگہ پر اپنا منہ رکھتے ( اور بوٹی توڑتے ۔ ) زہیر نے فیشرب ( پانی پینے ) کا لفظ ذکر نہیں کیا ۔",
                "urduNarrator": "ابو بکر بن ابی شیبہ اور زہیر بن حرب نے کہا , ہمیں وکیع نے مسعر اور سفیان سے حدیث بیان کی ، انہوں نے مقدام بن شریح سے ، انہوں نے اپنے والد سے اور انہوں نے حضرت عائشہؓ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالَا: حَدَّثَنَا وَكِيعٌ، عَنْ مِسْعَرٍ، وَسُفْيَانَ، عَنِ الْمِقْدَامِ بْنِ شُرَيْحٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ قَالَتْ: «كُنْتُ أَشْرَبُ وَأَنَا حَائِضٌ، ثُمَّ أُنَاوِلُهُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَيَضَعُ فَاهُ عَلَى مَوْضِعِ فِيَّ، فَيَشْرَبُ، وَأَتَعَرَّقُ الْعَرْقَ وَأَنَا حَائِضٌ، ثُمَّ أُنَاوِلُهُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَيَضَعُ فَاهُ عَلَى مَوْضِعِ فِيَّ» وَلَمْ يَذْكُرْ زُهَيْرٌ فَيَشْرَبُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8257,
                "hadithNumber": "693",
                "englishNarrator": "A'isha reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) would recline in my lap when I was menstruating, and recite the Qur'an.",
                "hadithUrdu": "میں حیض کی حالت میں ہوتی تو رسول اللہ ﷺ میری گود کو تکیہ بناتے اور قرآن پڑھتے.",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا ہم سے داؤد بن عبدالرحمٰن مکی نے بیان کیا، انہوں نے منصور کے واسطہ سے، ان کی والدہ سے,حضرت عائشہ ؓ سے روایت کی کہ انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا دَاوُدُ بْنُ عَبْدِ الرَّحْمَنِ الْمَكِّيُّ، عَنْ مَنْصُورٍ، عَنْ أُمِّهِ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ: «كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَتَّكِئُ فِي حِجْرِي وَأَنَا حَائِضٌ، فَيَقْرَأُ الْقُرْآنَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8258,
                "hadithNumber": "694",
                "englishNarrator": "Thabit narrated it from Anas:",
                "hadithEnglish": "Among the Jews, when a woman menstruated, they did not dine with her, nor did they live with them in their houses; so the Companions of the Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) asked The Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), and Allah, the Exalted revealed: And they ask you about menstruation; say it is a pollution, so keep away from woman during menstruation to the end (Qur'an, ii. 222). The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Do everything except intercourse. The Jews heard of that and said: This man does not want to leave anything we do without opposing us in it. Usaid bin Hudair and Abbad b. Bishr came and said: Messenger of Allah, the Jews say such and such thing. We should not have, therefore, any contactwith them (as the Jews do). The face of the Messenger of Allah (way peace be upon him) underwent such a change that we thought he was angry with them, but when they went out, they happened to receive a gift of milk which was sent to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). He (the Holy Prophet) called for them and gave them drink, whereby they knew that he was not angry with them.",
                "hadithUrdu": "یہودی ، جب ان کی کوئی عورت حائضہ ہوتی تو نہ وہ اس کے ساتھ کھانا کھاتے اور نہ اس کے ساتھ گھر ہی میں اکٹھے رہتے ۔ چنانچہ نبی اکرمﷺ کے صحابہ نے آپ سے اس بارے میں پوچھا ، اس پر اللہ تعالیٰ نےآیت تاری : ’’یہ آپ سے حیض کے بارے میں سوال کرتے ہیں ، آپ فرما دیجیے ، یہ اذیت ( کاوقت ) ہے ، اس لیے محیض ( مقام حیض ) میں عورتوں ( کے ساتھ مجامعت ) سے دور ہو ‘ ‘ آخر تک ۔ تو رسول اللہ ﷺ نے فرمایا : ’’جماع کے سوا سب کچھ کرو ۔ ‘ ‘ یہودیوں تک یہ بات پہنچی تو کہنے لگے : یہ آدمی ہمارے دین کی ہر بات کی مخالفت ہی کرنا چاہتا ہے ۔ ( یہ سن کر ) اسید بن حضیر اور عباد بن بشر ‌رضی ‌اللہ ‌عنہ ‌ ‌ رسول اللہ ﷺ کی خدمت میں حاضر ہوئے اور دونوں نے کہا : اے اللہ کے رسول! یہود اس اس طرح کہتے ہیں تو یکا ہم ان ( عورتوں ) سے جماع بھی نہ کر لیا کریں ؟ اس پر رسول اللہ ﷺ کے چہرے کا رنگ بدل گیا حتی کہ ہم نے سمجھا کہ آپ دونوں سے ناراض ہو گئے ہیں ۔ وہ دونوں نکل گئے ، آگے سے رسول اللہ ﷺ کے لیے دودھ کا ہدیہ آرہا تھا ، آپ نے کسی کو ان کے پیچھے بھیجا اور ان کو ( بلواکر ) دودھ پلایا ، وہ سمجھ گئے کہ آپ ان سے ناراض نہیں ہوئے ۔",
                "urduNarrator": "ہم سے زہیر بن حرب نے بیان کیا، کہا ہم سے عبدالرحمٰن بن مہدی نے بیان کیا، کہا ہم سے حماد بن سلمہ نے بیان کیا، کہا ہم سے ثابت نے بیان کیا,حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سےروایت ہے کہ",
                "hadithArabic": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ أَنَّ الْيَهُودَ كَانُوا إِذَا حَاضَتِ الْمَرْأَةُ فِيهِمْ لَمْ يُؤَاكِلُوهَا، وَلَمْ يُجَامِعُوهُنَّ فِي الْبُيُوتِ فَسَأَلَ أَصْحَابُ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَأَنْزَلَ اللهُ تَعَالَى {وَيَسْأَلُونَكَ عَنِ الْمَحِيضِ قُلْ هُوَ أَذًى فَاعْتَزِلُوا النِّسَاءَ فِي الْمَحِيضِ} [البقرة: 222] إِلَى آخِرِ الْآيَةِ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «اصْنَعُوا كُلَّ شَيْءٍ إِلَّا النِّكَاحَ» فَبَلَغَ ذَلِكَ الْيَهُودَ، فَقَالُوا: مَا يُرِيدُ هَذَا الرَّجُلُ أَنْ يَدَعَ مِنْ أَمْرِنَا شَيْئًا إِلَّا خَالَفَنَا فِيهِ، فَجَاءَ أُسَيْدُ بْنُ حُضَيْرٍ، وَعَبَّادُ بْنُ بِشْرٍ فَقَالَا يَا رَسُولَ اللهِ، إِنَّ الْيَهُودَ تَقُولُ: كَذَا وَكَذَا، فَلَا نُجَامِعُهُنَّ؟ فَتَغَيَّرَ وَجْهُ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حَتَّى ظَنَنَّا أَنْ قَدْ وَجَدَ عَلَيْهِمَا، فَخَرَجَا فَاسْتَقْبَلَهُمَا هَدِيَّةٌ مِنْ لَبَنٍ إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَأَرْسَلَ فِي آثَارِهِمَا فَسَقَاهُمَا، فَعَرَفَا أَنْ لَمْ يَجِدْ عَلَيْهِمَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8259,
                "hadithNumber": "695",
                "englishNarrator": "Ali رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "I was one whose prostatic fluid flowed readily and I was ashamed to ask the Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) about it, because of the position of his daughter. I, therefore, asked Miqdad. bin al-Asad and he inquired of him (the Holy Prophet ﷺ). He (the Holy Prophet ﷺ) said: He should wash his male organ and perform ablution.",
                "hadithUrdu": "مجھے مذی ( منی سے مختلف رطوبت جو اسی راستے سے خارج ہوتی ہے ) زیادہ آتی تھی اور میں آپ کی بیٹی کے ( ساتھ ) رشتے کی وجہ سے براہ راست نبی کریم ﷺ سے پوچھنے میں شرم محسوس کرتا تھا ۔ میں نے مقداد بن اسود سے کہا ، انہوں نےآپ سے پوچھا ، آپ نے فرمایا : ’’ ( اس میں متبلا آدمی ) اپنا عضو مخصوص دھوئے اور وضو کر لے ۔ ‘ ‘",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا,وکیع ، ابو معاویہ اور ہشیم نے اعمش سے حدیث بیان کی ، انہوں نے منذر بن یعلیٰ سے ( جن کی کنیت ابو یعلیٰ ہے ) انہوں نے ابن حنفیہ سے ، انہوں نے ( اپنے والد ) حضرت علی ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، وَأَبُو مُعَاوِيَةَ، وَهُشَيْمٌ، عَنِ الْأَعْمَشِ، عَنْ مُنْذِرِ بْنِ يَعْلَى، - وَيُكْنَى أَبَا يَعْلَى - عَنِ ابْنِ الْحَنَفِيَّةِ، عَنْ عَلِيٍّ قَالَ: كُنْتُ رَجُلًا مَذَّاءً وَكُنْتُ أَسْتَحْيِي أَنْ أَسْأَلَ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِمَكَانِ ابْنَتِهِ فَأَمَرْتُ الْمِقْدَادَ بْنَ الْأَسْوَدِ فَسَأَلَهُ فَقَالَ: «يَغْسِلُ ذَكَرَهُ وَيَتَوَضَّأُ».",
                "headingArabic": "الْمَذْىِ ‏",
                "headingUrdu": "مدھی (پروسٹیٹک سیال)",
                "headingEnglish": "Madhi (prostatic fluid)",
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8260,
                "hadithNumber": "696",
                "englishNarrator": "Ali reported:",
                "hadithEnglish": "I felt shy of asking about prostatic fluid from the Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) because of Fatimah. I, therefore, asked al-Miqdad (to ask on my behalf) and he asked. He (the Holy Prophet) said: Ablution is obligatory in such a case.",
                "hadithUrdu": "میں نے حضرت فاطمہ ؓ ( کے ساتھ رشتے ) کی وجہ سے نبی اکرم ﷺ سے مذی کےبارے میں پوچھنے میں شرم محسوس کی تو میں نے مقداد کو کہا ، انہوں نے آپ ﷺ سے پوچھا ، آپ نے فرمایا : ’’اس سے وضو ( کرنا پڑتا ) ہے ۔ ‘ ‘",
                "urduNarrator": "ہم سے یحییٰ بن حبیب الحارث نے بیان کیا، ان سے خالد نے، یعنی ہم سے ابن حارث نے بیان کیا,شعبہ نے سلیمان اعمش سے باقی ماندہ سابقہ سند کے ساتھ حضرت علی ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ انہوں نے کہا",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ، حَدَّثَنَا شُعْبَةُ، أَخْبَرَنِي سُلَيْمَانُ، قَالَ: سَمِعْتُ مُنْذِرًا، عَنْ مُحَمَّدِ بْنِ عَلِيٍّ، عَنْ عَلِيٍّ أَنَّهُ قَالَ: اسْتَحْيَيْتُ أَنْ أَسْأَلَ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ الْمَذْيِ مِنْ أَجْلِ فَاطِمَةَ، فَأَمَرْتُ الْمِقْدَادَ فَسَأَلَهُ فَقَالَ: «مِنْهُ الْوُضُو.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8261,
                "hadithNumber": "697",
                "englishNarrator": "Ibn 'Abbas reported it from 'Ali ‌رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "We sent al-Miqdad bin al-Aswad ‌رضی ‌اللہ ‌عنہ to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) to ask him what must be done about prostatic fluid which flows from (the private part of) a person. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Perform ablution and wash your sexual organ.",
                "hadithUrdu": "ہم نے مقداد بن اسود ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو رسول اللہ ﷺ کی خدمت میں بھیجا ، انہوں نے آپ سے مذی کے بارے میں پوچھا جو انسان ( کے عضو مخصوص ) سے خارج ہوتی ہے کہ وہ اس کا کیا کرے ؟ تو رسول اللہ ﷺ نے فرمایا : ’’وضو کرو اور شرم گاہ کو دھو لو ۔ ‘ ‘ ( ترتیب میں پہلے دھونا ، پھر وضو کرنا ہے جس طرح حدیث : 695میں ہے ۔ )",
                "urduNarrator": "مجھ سے ہارون بن سعید العیلی اور احمد بن عیسیٰ نے بیان کیا، کہا کہ ہم سے ابن وہب نے بیان کیا، مجھ سے مخرمہ بن بکیر نے اپنے والد سے اور سلیمان بن یسار سے,حضرت ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے ، کہا حضرت علی ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے فرمایا",
                "hadithArabic": "وَحَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ، وَأَحْمَدُ بْنُ عِيسَى، قَالَا: حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي مَخْرَمَةُ بْنُ بُكَيْرٍ، عَنْ أَبِيهِ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ: قَالَ عَلِيُّ بْنُ أَبِي طَالِبٍ: أَرْسَلْنَا الْمِقْدَادَ بْنَ الْأَسْوَدِ إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَهُ عَنِ الْمَذْيِ يَخْرُجُ مِنَ الْإِنْسَانِ كَيْفَ يَفْعَلُ بِهِ؟ فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «تَوَضَّأْ وَانْضَحْ فَرْجَكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8262,
                "hadithNumber": "698",
                "englishNarrator": "Ibn 'Abbas ‌رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "The Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) woke up at night; relieved himself, and then washed his face and hands and then again slept.",
                "hadithUrdu": "نبی اکرمﷺ رات کو اٹھے ، قضائے حاجت کی ، پھر اپنا چہرہ اور دونوں ہاتھ دھوئے ، پھر سو گئے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، کہا: ہم سے وکیع نے سفیان کی سند سے، سلمہ بن کحیل سے، کریب کی سند سے,حضرت ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، قَالَا: حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ: «أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَامَ مِنَ اللَّيْلِ، فَقَضَى حَاجَتَهُ، ثُمَّ غَسَلَ وَجْهَهُ وَيَدَيْهِ، ثُمَّ نَامَ».",
                "headingArabic": "غَسْلِ الْوَجْهِ وَالْيَدَيْنِ إِذَا اسْتَيْقَظَ مِنَ النَّوْمِ",
                "headingUrdu": "نیند سے بیدار ہوتے وقت منہ اور ہاتھ دھونا",
                "headingEnglish": "Washing the face and hands when waking from sleep",
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8263,
                "hadithNumber": "699",
                "englishNarrator": "A'isha reported:",
                "hadithEnglish": "Whenever the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) intended to sleep after having sexual intercourse, he performed ablution as for the prayer before going to sleep.",
                "hadithUrdu": "رسول اللہﷺ جب جنابت کی حالت میں سونا چاہتے توسونے سے پہلے نماز کے وضو کی طرح وضو کر لیتے تھے ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ التمیمی اور محمد بن روم نے بیان کیا، انہوں نے کہا: لیث، ح، ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے لیث نے بیان کیا,ابوسلمہ بن عبد الرحمن نے حضرت عائشہ ؓ سےروایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَمُحَمَّدُ بْنُ رُمْحٍ، قَالَا: أَخْبَرَنَا اللَّيْثُ، ح، وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ: «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَرَادَ أَنْ يَنَامَ، وَهُوَ جُنُبٌ، تَوَضَّأَ وُضُوءَهُ لِلصَّلَاةِ، قَبْلَ أَنْ يَنَامَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 7951,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=318",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=316",
                "label": "316",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=317",
                "label": "317",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=318",
                "label": "318",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=319",
                "label": "319",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=320",
                "label": "320",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=321",
                "label": "321",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=322",
                "label": "322",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=320",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=320",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=318",
        "to": 7975,
        "total": 40465
    }
}