{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 564,
        "data": [
            {
                "id": 14364,
                "hadithNumber": "6801",
                "englishNarrator": "Jarir ‌رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) delivered an address in which he exhorted people to give charity\" -a hadith lie that of Jarir (no. 6800).",
                "hadithUrdu": "نبی ‌اکرم ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌نے ‌خطبہ ‌پڑھا ‌اور ‌لوگوں ‌کو ‌ترغیب ‌دی ‌صدقہ ‌دینے ‌کی ‌پھر ‌بیان ‌کیا ‌اسی ‌طرح ‌جیسے ‌اوپر ‌گزرا .",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ، ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، ابو معاویہ کی سند سے، الاعمش کی سند سے، مسلم کی سند سے، عبد کی سند سے۔ رحمن بن ہلال کی سند پر, جریر ‌رضی ‌اللہ ‌عنہ ‌سے ‌روایت ‌ہے ‌",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ جَمِيعًا عَنْ أَبِي مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ مُسْلِمٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ هِلَالٍ عَنْ جَرِيرٍ قَالَ خَطَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَحَثَّ عَلَى الصَّدَقَةِ بِمَعْنَى حَدِيثِ جَرِيرٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "48",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 148,
                    "chapterNumber": "48",
                    "chapterEnglish": "The Book of Knowledge",
                    "chapterUrdu": "علم کا بیان",
                    "chapterArabic": "كتاب الْعِلْمِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14365,
                "hadithNumber": "6802",
                "englishNarrator": "Jarir bin 'Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: The servant does not introduce good practice which is followed after him.... The rest of the hadith is the same.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جو بندہ بھی کسی نیک کام کا آغاز کرے جس پر اس کے بعد عمل کیا جائے ۔ \" پھر پوری حدیث بیان کی ۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا، کہا ہم سے یحییٰ نے بیان کیا، یعنی ابن سعید نے, محمد بن ابی اسماعیل نے کہا : ہمیں عبدالرحمٰن بن ہلال عبسی نے حدیث بیان کی ، انہوں نے کہا : حضرت جریر بن عبداللہ رضی اللہ عنہ نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى يَعْنِي ابْنَ سَعِيدٍ حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي إِسْمَعِيلَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ هِلَالٍ الْعَبْسِيُّ قَالَ قَالَ جَرِيرُ بْنُ عَبْدِ اللَّهِ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَسُنُّ عَبْدٌ سُنَّةً صَالِحَةً يُعْمَلُ بِهَا بَعْدَهُ ثُمَّ ذَكَرَ تَمَامَ الْحَدِيثِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "48",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 148,
                    "chapterNumber": "48",
                    "chapterEnglish": "The Book of Knowledge",
                    "chapterUrdu": "علم کا بیان",
                    "chapterArabic": "كتاب الْعِلْمِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14366,
                "hadithNumber": "6803",
                "englishNarrator": null,
                "hadithEnglish": "This Hadith was narrated from Al-Mundir Jarir, from his father, from the prophet ﷺ \r\n(a narration similar to no. 6800).",
                "hadithUrdu": "مجھ سے عبید اللہ بن عمر القواریری ، ابو کامل اور محمد بن عبد الملک امیہ نے بیان کیا، انہوں نے کہا: ہم سے ابو عونہ نے بیان کیا, عبدالملک بن عمیر اور عون بن ابی الجحیفہ نے مُنذِر بن جریر سے ، انہوں نے اپنے والد ( جریر بن عبداللہ رضی اللہ عنہ ) سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے یہی حدیث روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ وَأَبُو كَامِلٍ وَمُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ الْأُمَوِيُّ قَالُوا حَدَّثَنَا أَبُو عَوَانَةَ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ الْمُنْذِرِ بْنِ جَرِيرٍ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ ح و حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي قَالُوا حَدَّثَنَا شُعْبَةُ عَنْ عَوْنِ بْنِ أَبِي جُحَيْفَةَ عَنْ الْمُنْذِرِ بْنِ جَرِيرٍ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْحَدِيثِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "48",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 148,
                    "chapterNumber": "48",
                    "chapterEnglish": "The Book of Knowledge",
                    "chapterUrdu": "علم کا بیان",
                    "chapterArabic": "كتاب الْعِلْمِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14367,
                "hadithNumber": "6804",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who called (people) to righteousness, there would be reward (assured) for him like the rewards of those who adhered to it, without their rewards being diminished in any respect. And he who called (people) to error, he shall have to carry (the burden) of its sin, like those who committed it, without their sins being diminished in any respect.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جس شخص نے ہدایت کی دعوت دی اسے اس ہدایت کی پیروی کرنے والوں کے اجر کے برابر اجر ملے گا اور ان کے اجر میں کوئی کمی نہیں ہو گی اور جس شخص نے کسی گمراہی کی دعوت دی ، اس پر اس کی پیروی کرنے والوں کے برابر گناہ ( کا بوجھ ) ہو گا اور ان کے گناہوں میں کوئی کمی نہیں ہو گی ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن ایوب، قتیبہ بن سعید اور ابن حجر نے بیان کیا، کہا: ہم سے اسماعیل نے بیان کیا، یعنی ہم سے ابن جعفر نے علاء کی سند سے، اپنے والد کی سند سے, حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ بْنُ سَعِيدٍ وَابْنُ حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَعِيلُ يَعْنُونَ ابْنَ جَعْفَرٍ عَنْ الْعَلَاءِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ دَعَا إِلَى هُدًى كَانَ لَهُ مِنْ الْأَجْرِ مِثْلُ أُجُورِ مَنْ تَبِعَهُ لَا يَنْقُصُ ذَلِكَ مِنْ أُجُورِهِمْ شَيْئًا وَمَنْ دَعَا إِلَى ضَلَالَةٍ كَانَ عَلَيْهِ مِنْ الْإِثْمِ مِثْلُ آثَامِ مَنْ تَبِعَهُ لَا يَنْقُصُ ذَلِكَ مِنْ آثَامِهِمْ شَيْئًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "48",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 148,
                    "chapterNumber": "48",
                    "chapterEnglish": "The Book of Knowledge",
                    "chapterUrdu": "علم کا بیان",
                    "chapterArabic": "كتاب الْعِلْمِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14368,
                "hadithNumber": "6805",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying that Allah, the Exalted and Glorious, thus stated: I am near to the thought of My servant as he thinks about Me, and I am with him as he remembers Me. And if he remembers Me in his heart, I also remember him in My Heart, and if he remembers Me in assembly I remember him in assembly, better than his (remembrance), and if he draws near Me by the span of a palm, I draw near him by the cubit, and if he draws near Me by the cubit I draw near him by the space (covered by) two hands. And if he walks towards Me, I rush towards him.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ عزوجل فرماتا ہے : میرے بارے میں میرا بندہ جو گمان کرتا ہے میں ( اس کو پورا کرنے کے لیے ) اس کے پاس ہوتا ہوں ۔ جب وہ مجھے یاد کرتا ہے تو میں اس کے ساتھ ہوتا ہوں ۔ اگر وہ مجھے اپنے دل میں یاد کرتا ہے تو میں اسے دل میں یاد کرتا ہوں اور اگر وہ مجھے ( بھری ) مجلس میں یاد کرتا ہے تو میں ان کی مجلس سے اچھی مجلس میں اسے یاد کرتا ہوں ، اگر وہ ایک بالشت میرے قریب آتا ہے تو میں ایک ہاتھ اس کے قریب جاتا ہوں اور اگر وہ ایک ہاتھ میر قریب آتا ہے تو میں دونوں ہاتھوں کی پوری لمبارئی کے برابر اس کے قریب آتا ہوں ، اگر وہ میرے پاس چلتا ہوا آتا ہے تو میں دوڑتا ہوا اس کے پاس جاتا ہوں ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید اور زہیر بن حرب نے بیان کیا اور قتیبہ نے کہا , جریر نے اعمش سے ، انہوں نے ابوصالح سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَزُهَيْرُ بْنُ حَرْبٍ وَاللَّفْظُ لِقُتَيْبَةَ قَالَا حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ اللَّهُ عَزَّ وَجَلَّ أَنَا عِنْدَ ظَنِّ عَبْدِي بِي وَأَنَا مَعَهُ حِينَ يَذْكُرُنِي إِنْ ذَكَرَنِي فِي نَفْسِهِ ذَكَرْتُهُ فِي نَفْسِي وَإِنْ ذَكَرَنِي فِي مَلَإٍ ذَكَرْتُهُ فِي مَلَإٍ هُمْ خَيْرٌ مِنْهُمْ وَإِنْ تَقَرَّبَ مِنِّي شِبْرًا تَقَرَّبْتُ إِلَيْهِ ذِرَاعًا وَإِنْ تَقَرَّبَ إِلَيَّ ذِرَاعًا تَقَرَّبْتُ مِنْهُ بَاعًا وَإِنْ أَتَانِي يَمْشِي أَتَيْتُهُ هَرْوَلَةً.",
                "headingArabic": "الْحَثِّ عَلَى ذِكْرِ اللَّهِ تَعَالَى",
                "headingUrdu": "اللہ کو یاد کرنے کی ترغیب، وہ بہت بلند ہے۔",
                "headingEnglish": "Encouragement To Remember Allah, Exalted is He",
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14369,
                "hadithNumber": "6806",
                "englishNarrator": "This hadith has been narrated on the authority of A'mash with the same chain of transmitters, but there is no mention of these words:",
                "hadithEnglish": "He draws near Me by the space of a hand, I draw near him by the space (covered) by two hands.",
                "hadithUrdu": "\" اگر وہ ایک ہاتھ میرے قریب آتا ہے تو میں دونوں ہاتھوں کی پوری لمبائی کے برابر اس کے قریب آتا ہوں ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، کہا: ابومعاویہ نے اعمش سے اسی سند کے ساتھ حدیث بیان کی ، اور انہوں نے یہ بیان نہیں کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ وَلَمْ يَذْكُرْ وَإِنْ تَقَرَّبَ إِلَيَّ ذِرَاعًا تَقَرَّبْتُ مِنْهُ بَاعً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14370,
                "hadithNumber": "6807",
                "englishNarrator": "It was narrated that Hammam bin Munabbih said: \"This is what Abu Huraira رضی اللہ عنہ narrated to us from the Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) \"and he mentioned a number of ahadith, including the following:",
                "hadithEnglish": "\"Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said that Allah thus stated: When My servant draws close to me by the span of a palm, I draw close to him by the space of a cubit, and when he draws close to Me by the space of a cubit, I draw close to him by the space (covered) by two hands, and when he draws close to Me by the space (covered by) two hands, I go in hurry towards him.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے کہا : \" اللہ تعالیٰ نے فرمایا : \" جب بندہ ایک بالشت ( بڑھ کر ) میرے پاس آتا ہے تو میں ایک ہاتھ ( بڑھ کر ) اس کے پاس جاتا ہوں اور جب وہ ایک ہاتھ ( بڑھ کر ) میرے پاس آتا ہے تو میں دونوں ہاتھوں کی لمبائی کے برابر ( بڑھ کر ) اس کے پاس جاتا ہوں اور اگر وہ دونوں ہاتھوں کی لمبائی کے برابر بڑھ کر میرے پاس آتا ہے تو میں اس کے پاس پہنچ جاتا ہوں ، اس سے زیادہ تیزی سے آتا ہوں ۔ \"",
                "urduNarrator": "ہم سے محمد بن رافع نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا,  ہمیں معمر نے ہمام بن منبہ سے حدیث بیان کی ، کہا : یہ احادیث ابوہریرہ رضی اللہ عنہ نے ہمیں رسول اللہ صلی اللہ علیہ وسلم سے بیان کیں ، پھر انہوں نے متعدد احادیث بیان کیں ، ان میں سے ایک یہ تھی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ قَالَ إِذَا تَلَقَّانِي عَبْدِي بِشِبْرٍ تَلَقَّيْتُهُ بِذِرَاعٍ وَإِذَا تَلَقَّانِي بِذِرَاعٍ تَلَقَّيْتُهُ بِبَاعٍ وَإِذَا تَلَقَّانِي بِبَاعٍ أَتَيْتُهُ بِأَسْرَعَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14371,
                "hadithNumber": "6808",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was travelling along the path leading to Mecca that he happened to pass by a mountain called Jumdan. He said: Proceed on, it is Jumdan, Mufarradun have gone ahead. They (the Companions of the Holy Prophet) said: Allah's Messenger, who are Mufarradun? He said: They are those males and females who remember Allah much.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم مکہ کے ایک راستے پر چلے جا رہے تھے کہ آپ کا ایک پہاڑ کے قریب سے گزر ہوا جس کو جمدان کہا جاتا ہے ، آپ نے فرمایا : \" چلتے رہو ، یہ جُمدان ہے ۔ مفردون 0لوگوں سے الگ ہو کر تنہا ہو جانے والے ) بازی لے گئے ۔ \" لوگوں نے پوچھا : اللہ کے رسول! مفردون سے کیا مراد ہے؟ فرمایا : \" کثرت سے اللہ کو یاد کرنے والے ( مرد ) اور اللہ کو یاد کرنے والی ( عورتیں ۔ ) \"",
                "urduNarrator": "ہم سے امیہ بن بسطام العیشی نے بیان کیا، کہا ہم سے یزید نے، ان سے ابن زرعی نے بیان کیا، ہم سے روح بن قاسم نے بیان کیا، ان سے العلا کی سند سے، اپنے والد کی سند سے, حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے ، کہا",
                "hadithArabic": "حَدَّثَنَا أُمَيَّةُ بْنُ بِسْطَامَ الْعَيْشِيُّ حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ حَدَّثَنَا رَوْحُ بْنُ الْقَاسِمِ عَنْ الْعَلَاءِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسِيرُ فِي طَرِيقِ مَكَّةَ فَمَرَّ عَلَى جَبَلٍ يُقَالُ لَهُ جُمْدَانُ فَقَالَ سِيرُوا هَذَا جُمْدَانُ سَبَقَ الْمُفَرِّدُونَ قَالُوا وَمَا الْمُفَرِّدُونَ يَا رَسُولَ اللَّهِ قَالَ الذَّاكِرُونَ اللَّهَ كَثِيرًا وَالذَّاكِرَاتُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14372,
                "hadithNumber": "6809",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: There are ninety-nine names of Allah; he who commits them to memory would get into Paradise. Verily, Allah is Odd (He is one, and it is an odd number) and He loves odd number. And in the narration of Ibn 'Umar (the words are): He who enumerated them.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ تعالیٰ کے ننانوے نام ہیں ، جس نے ان کی حفاظت کی وہ جنت میں داخل ہو جائے گا اور اللہ وتر ( طاق ) ہے ، وتر کو پسند کرتا ہے ۔ \" اور ابن ابی عمر کی روایت میں ہے : \" جس نے ان کو شمار کیا ۔ \"",
                "urduNarrator": "عمرو ناقد ، زُہیر بن حرب اور ابن ابی عمر نے ہمیں سفیان سے حدیث بیان کی ۔ ۔ الفاظ عمرو کے ہیں ۔ ۔ انہوں نے کہا : ہمیں سفیان بن عیینہ نے ابوزناد سے حدیث بیان کی ، انہوں نے اعرج سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ وَابْنُ أَبِي عُمَرَ جَمِيعًا عَنْ سُفْيَانَ وَاللَّفْظُ لِعَمْرٍو حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِلَّهِ تِسْعَةٌ وَتِسْعُونَ اسْمًا مَنْ حَفِظَهَا دَخَلَ الْجَنَّةَ وَإِنَّ اللَّهَ وِتْرٌ يُحِبُّ الْوِتْرَ وَفِي رِوَايَةِ ابْنِ أَبِي عُمَرَ مَنْ أَحْصَاهَا.",
                "headingArabic": "فِي أَسْمَاءِ اللَّهِ تَعَالَى وَفَضْلِ مَنْ أَحْصَاهَا",
                "headingUrdu": "اللہ کے نام، وہ بلند ہے، اور اس کی فضیلت جو انہیں دل سے سیکھے",
                "headingEnglish": "The Names Of Allah, Exalted is He, And The Virtue Of The One Who Learns Them By Heart",
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14373,
                "hadithNumber": "6810",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Verily, there are ninety-nine names for Allah, i.e. hundred excepting one. He who enumerates them would get into Paradise. And Hammam has made this addition on the authority of Abu Huraira رضی اللہ عنہ who reported it from Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) that he said: He is Odd (one) and loves odd number.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" اللہ تعالیٰ کے ننانوے ، ایک کم سو نام ہیں ، جس نے ان ( سب ) کو شمار کیا وہ جنت میں داخل ہو گا ۔ \"\" اور ہمام نے ابوہریرہ رضی اللہ عنہ سے مزید یہ بیان کیا \"\" بےشک وہ ( اللہ ) طاق ہے ، طاق ہی کو پسند کرتا ہے ۔ \"\"",
                "urduNarrator": "مجھ سے محمد بن رافع نے بیان کیا، ہم سے عبدالرزاق نے بیان کیا, معمر نے ہمیں ایوب سے خبر دی ، انہوں نے ابن سیرین سے ، انہوں نے ابوہریرہ رضی اللہ عنہ سے ، نیز ( ایوب نے ) ہمام بن منبہ سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ أَيُّوبَ عَنْ ابْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ وَعَنْ هَمَّامِ بْنِ مُنَبِّهٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ لِلَّهِ تِسْعَةً وَتِسْعِينَ اسْمًا مِائَةً إِلَّا وَاحِدًا مَنْ أَحْصَاهَا دَخَلَ الْجَنَّةَ وَزَادَ هَمَّامٌ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّهُ وِتْرٌ يُحِبُّ الْوِتْرَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14374,
                "hadithNumber": "6811",
                "englishNarrator": "Anas رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When one of you makes supplication, he should supplicate with a will and should not say: O Allah, confer upon me if Thou likest, for there is none to coerce Allah.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تک تم میں سے کوئی شخص دعا کرے تو قطعیت کے ساتھ ( اصرار کرتے ہوئے ) دعا کرے اور یہ نہ کہے : اے اللہ! اگر تو چاہے تو مجھے دے دے ، کیونکہ اللہ کو مجبور کرنے والا کوئی نہیں ہے ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور زہیر بن حرب نے ابن الیہ کی سند سے بیان کیا، ابوبکر نے کہا: ہم سے اسماعیل بن اولیاء نے روایت کی ہے,  عبدالعزیز بن صُہیب نے حضرت انس رضی اللہ عنہ سے روایت کی ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ جَمِيعًا عَنْ ابْنِ عُلَيَّةَ قَالَ أَبُو بَكْرٍ حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ عَنْ أَنَسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَعَا أَحَدُكُمْ فَلْيَعْزِمْ فِي الدُّعَاءِ وَلَا يَقُلْ اللَّهُمَّ إِنْ شِئْتَ فَأَعْطِنِي فَإِنَّ اللَّهَ لَا مُسْتَكْرِهَ لَهُ.",
                "headingArabic": "الْعَزْمِ بِالدُّعَاءِ وَلاَ يَقُلْ إِنْ شِئْتَ",
                "headingUrdu": "دعا میں ثابت قدم رہنا اور یہ نہ کہنا: \"اگر تم چاہو گے\"",
                "headingEnglish": "Being Firm In Supplication And Not Saying: \"If You Will\"",
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14375,
                "hadithNumber": "6812",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When one of you makes a supplication (to his Lord) one should not say: O Allah, grant me pardon, if Thou so likest, but one should beg one's (Lord) with a will and full devotion, for there is nothing so great in the eye of Allah which He cannot grant.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم میں سے کوئی شخص دعا کرے تو یہ نہ کہے : اے اللہ! اگر تو چاہے تو مجھے بخش دے ، بلکہ وہ پختگی اور اصرار سے سوال کرے اور بڑی رغبت کا اظہار کرے ، کیونکہ دینے کے لیے اللہ تعالیٰ کے لیے کوئی چیز بڑی نہیں ہے ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن ایوب، قتیبہ اور ابن حجر نے بیان کیا، کہا: ہم سے اسماعیل، یعنی ابن جعفر نے بیان کیا، ان کی سند سے, العلاء کے والد ( عبدالرحمٰن ) نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ وَابْنُ حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَعِيلُ يَعْنُونَ ابْنَ جَعْفَرٍ عَنْ الْعَلَاءِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا دَعَا أَحَدُكُمْ فَلَا يَقُلْ اللَّهُمَّ اغْفِرْ لِي إِنْ شِئْتَ وَلَكِنْ لِيَعْزِمْ الْمَسْأَلَةَ وَلْيُعَظِّمْ الرَّغْبَةَ فَإِنَّ اللَّهَ لَا يَتَعَاظَمُهُ شَيْءٌ أَعْطَاهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14376,
                "hadithNumber": "6813",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: None of you should say to Allah (like this): O Allah, grant me mercy, if thou so likest. The supplication (of his) should (be permeated with) conviction (that it would be accepted by the Lord), for Allah is the Doer of (everything) He likes to do, and there is none to force Him (to do or not to do this or that).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم میں سے کوئی شخص اس طرح نہ کہے : اے اللہ! اگر تو چاہے تو مجھے بخش دے ، اے اللہ! اگر تو چاہے تو مجھ پر رحم فرما ۔ وہ دعا میں پختگی اور قطعیت سے کام لے کیونکہ اللہ جو چاہے وہی کرتا ہے ، کوئی نہیں جو اسے مجبور کر سکے ۔ \"",
                "urduNarrator": "ہم سے اسحاق بن موسیٰ الانصاری نے بیان کیا، ہم سے انس بن عیاض نے بیان کیا، ان سے حارث نے جو عبدالرحمٰن بن ابی ذباب کے بیٹے ہیں، انہوں نے بیان کیا کہ , عطاء بن میناء نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا إِسْحَقُ بْنُ مُوسَى الْأَنْصَارِيُّ حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ حَدَّثَنَا الْحَارِثُ وَهُوَ ابْنُ عَبْدِ الرَّحْمَنِ بْنِ أَبِي ذُبَابٍ عَنْ عَطَاءِ بْنِ مِينَاءَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَقُولَنَّ أَحَدُكُمْ اللَّهُمَّ اغْفِرْ لِي إِنْ شِئْتَ اللَّهُمَّ ارْحَمْنِي إِنْ شِئْتَ لِيَعْزِمْ فِي الدُّعَاءِ فَإِنَّ اللَّهَ صَانِعٌ مَا شَاءَ لَا مُكْرِهَ لَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14377,
                "hadithNumber": "6814",
                "englishNarrator": "Anas (bin Malik) رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying. None of you should make a request for death because of the trouble in which he is involved, but if there is no other help to it, then say: O Allah, keep me alive as long as there is goodness in life for me and bring death to me when there is goodness in death for me.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم میں سے کوئی شخص کسی نقصان ( مصیبت ) کی وجہ سے ، جو اس پر نازل ہو ، موت کی تمنا نہ کرے ۔ اگر اسنے لامحالہ موت مانگنی بھی ہو تو یوں کہے : اے اللہ! مجھے اس وقت تک زندہ رکھ جب تک زندگی میرے لیے بہتر ہو اور مجھے وفات دے جب موت میرے لیے بہتر ہو ۔ \"",
                "urduNarrator": "ہم سے زہیر بن حرب نے بیان کیا، کہا ہم سے اسماعیل نے بیان کیا، یعنی ابن اُلیّہ نے, عبدالعزیز نے حضرت انس رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا إِسْمَعِيلُ يَعْنِي ابْنَ عُلَيَّةَ عَنْ عَبْدِ الْعَزِيزِ عَنْ أَنَسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَتَمَنَّيَنَّ أَحَدُكُمْ الْمَوْتَ لِضُرٍّ نَزَلَ بِهِ فَإِنْ كَانَ لَا بُدَّ مُتَمَنِّيًا فَلْيَقُلْ اللَّهُمَّ أَحْيِنِي مَا كَانَتْ الْحَيَاةُ خَيْرًا لِي وَتَوَفَّنِي إِذَا كَانَتْ الْوَفَاةُ خَيْرًا لِيُ.",
                "headingArabic": "كَرَاهَةِ تَمَنِّي الْمَوْتِ لِضُرٍّ نَزَلَ بِهِ",
                "headingUrdu": "موت کی تمنا کرنا ناپسندیدہ ہے کیونکہ کسی کو پہنچنے والے نقصان کی وجہ سے",
                "headingEnglish": "It Is Disliked To Wish For Death Because Of Some Harm That Has Befallen One",
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14378,
                "hadithNumber": "6815",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Anas رضی اللہ عنہ through another chain of transmitters, but with a small variation of wording.",
                "hadithUrdu": "ہم سے ابن ابی خلف نے بیان کیا، ہم سے روح نے بیان کیا، ہم سے شعبہ نے بیان کیا، مجھ سے زہیر بن حرب نے بیان کیا، ہم سے عفان نے بیان کیا، ہم سے حماد نے بیان کیا، یعنی ان دونوں سے ابن سلمہ نے, ثابت نے حضرت انس رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ، مگر انہوں نے کہا : \" کسی نقصان کی وجہ سے جو اسے پہنچے ۔ \" ( نازل ہو نہیں کہا ۔ )",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا ابْنُ أَبِي خَلَفٍ حَدَّثَنَا رَوْحٌ حَدَّثَنَا شُعْبَةُ ح و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ سَلَمَةَ كِلَاهُمَا عَنْ ثَابِتٍ عَنْ أَنَسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ مِنْ ضُرٍّ أَصَابَه.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14379,
                "hadithNumber": "6816",
                "englishNarrator": "Nadr bin Anas reported:",
                "hadithEnglish": "When Anas رضی اللہ عنہ was alive, that he said: Had Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) not stated this.. None should make a request for death, I would have definitely done that.",
                "hadithUrdu": "حضرت انس رضی اللہ عنہ ان دنوں زندہ تھے ۔ ( نضر نے ) کہا : انس رضی اللہ عنہ نے کہا : اگر نبی صلی اللہ علیہ وسلم نے فرمایا نہ ہوتا : \" تم میں سے کوئی شخص موت کی تمنا نہ کرے \" تو میں موت کی تمنا کرتا ۔",
                "urduNarrator": "مجھ سے حمید بن عمر نے بیان کیا، کہا ہم سے عبد الواحد نے بیان کیا, عاصم نے ہمیں نضر بن انس سے حدیث بیان کی کہ",
                "hadithArabic": "حَدَّثَنِي حَامِدُ بْنُ عُمَرَ حَدَّثَنَا عَبْدُ الْوَاحِدِ حَدَّثَنَا عَاصِمٌ عَنْ النَّضْرِ بْنِ أَنَسٍ وَأَنَسٌ يَوْمَئِذٍ حَيٌّ قَالَ أَنَسٌ لَوْلَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَتَمَنَّيَنَّ أَحَدُكُمْ الْمَوْتَ لَتَمَنَّيْتُهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14380,
                "hadithNumber": "6817",
                "englishNarrator": "Abu Hazim reported:",
                "hadithEnglish": "I visited Khabbab رضی اللہ عنہ who had seven cauteries on his stomach and he said: Had Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) not forbidden us to call for death, I would have done so.",
                "hadithUrdu": "ہم حضرت خباب رضی اللہ عنہ کے پاس گئے ، اس وقت ان کے پیٹ پر ( علاج کے لئے ) سات جگہ ( تپتی ہوئی دھات سے ) داغ لگائے گئے تھے ۔ انہوں نے کہا : اگر یہ نہ ہوتا کہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں موت کی دعا سے منع فرمایا تھا ، تو میں اس ( موت ) کی دعا کرتا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, عبداللہ بن ادریس نے اسماعیل بن ابی خالد سے ، انہوں نے قیس بن ابی حازم سے روایت کی کہ انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ إِسْمَعِيلَ بْنِ أَبِي خَالِدٍ عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ قَالَ دَخَلْنَا عَلَى خَبَّابٍ وَقَدْ اكْتَوَى سَبْعَ كَيَّاتٍ فِي بَطْنِهِ فَقَالَ لَوْ مَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَانَا أَنْ نَدْعُوَ بِالْمَوْتِ لَدَعَوْتُ بِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14381,
                "hadithNumber": "6818",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been transmitted on the authority of Isma'il through other chains of narrators.",
                "hadithUrdu": "ہم سے اسحاق بن ابراہیم نے بیان کیا, سفیان بن عیینہ ، جریر بن عبدالحمید ، وکیع ، عبداللہ بن نمیر ، معتمر بن سلیمان اور ابواسامہ سب نے اسماعیل سے اسی سند کے ساتھ ( یہی ) روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَاه إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا سُفْيَانُ بْنُ عُيَيْنَةَ وَجَرِيرُ بْنُ عَبْدِ الْحَمِيدِ وَوَكِيعٌ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي ح و حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ وَيَحْيَى بْنُ حَبِيبٍ قَالَا حَدَّثَنَا مُعْتَمِرٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا أَبُو أُسَامَةَ كُلُّهُمْ عَنْ إِسْمَعِيلَ بِهَذَا الْإِسْنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14382,
                "hadithNumber": "6819",
                "englishNarrator": "Hammam bin Munabbih said:",
                "hadithEnglish": "Abu Huraira رضی اللہ عنہ narrated to us ahadith from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and out of these one is that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: None amongst you should make a request for death, and do not call for it before it comes, for when any one of you dies, he ceases (to do good) deeds and the life of a believer is not prolonged but for goodness",
                "hadithUrdu": "یہ احادیث ہمیں ابوہریرہ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے بیان کیں ، انہوں نے کئی احادیث بیان کیں ، ان میں سے یہ ( بھی ) تھی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم میں سے کوئی شخص ہرگز موت کی تمنا نہ کرے ، نہ موت آنے سے پہلے اس کے لیے دعا کرے کیونکہ جب تم میں سے کوئی شخص مر گیا تو اس کا عمل منقطع ہو گیا ( مزید عمل کی مہلت ختم ہو گئی ) اور مومن کی عمر اس کی بھلائی ہی میں اضافہ کرتی ہے ۔ \"",
                "urduNarrator": "ہم سے محمد بن رافع نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا, معمر نے ہمیں ہمام بن منبہ سے حدیث بیان کی ، کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَتَمَنَّى أَحَدُكُمْ الْمَوْتَ وَلَا يَدْعُ بِهِ مِنْ قَبْلِ أَنْ يَأْتِيَهُ إِنَّهُ إِذَا مَاتَ أَحَدُكُمْ انْقَطَعَ عَمَلُهُ وَإِنَّهُ لَا يَزِيدُ الْمُؤْمِنَ عُمْرُهُ إِلَّا خَيْرًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14383,
                "hadithNumber": "6820",
                "englishNarrator": "Ubida bin Samit رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who loves to meet Allah, Allah also loves to meet him, and he who dislikes to meet Allah, Allah also abhors to meet him.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے فرمایا : \" جو شخص اللہ سے ملنے کو محبوب رکھے ، اللہ اس سے ملنے کو محبوب رکھتا ہے اور جو اللہ سے ملنے کو ناپسند کرے ، اللہ بھی اس سے ملنے کو ناپسند کرتا ہے ۔ \"",
                "urduNarrator": "ہم سے حداب بن خالد نے بیان کیا, ہمام نے کہا : ہمیں قتادہ نے انس بن مالک رضی اللہ عنہ سے حدیث بیان کی ، انہوں نے حضرت عبادہ بن صامت رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ عُبَادَةَ بْنِ الصَّامِتِ أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَحَبَّ لِقَاءَ اللَّهِ أَحَبَّ اللَّهُ لِقَاءَهُ وَمَنْ كَرِهَ لِقَاءَ اللَّهِ كَرِهَ اللَّهُ لِقَاءَهُ.",
                "headingArabic": "جو اللہ سے ملنا پسند کرتا ہے اللہ اس سے ملنا پسند کرتا ہے اور جو اللہ سے ملاقات کو ناپسند کرتا ہے اللہ اس سے ملاقات کو ناپسند کرتا ہے۔",
                "headingUrdu": "جو اللہ سے ملنا پسند کرتا ہے اللہ اس سے ملنا پسند کرتا ہے اور جو اللہ سے ملاقات کو ناپسند کرتا ہے اللہ اس سے ملاقات کو ناپسند کرتا ہے۔",
                "headingEnglish": "Whoever Loves To Meet Allah, Allah Loves To Meet Him, And Whoever Hates To Meet Allah, Allah Hates To Meet Him",
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14384,
                "hadithNumber": "6821",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of 'Ubada bin Samit رضی اللہ عنہ through another chain of transmitters.",
                "hadithUrdu": "ہم سے محمد بن المثنیٰ اور ابن بشار نے بیان کیا، کہا: ہم سے محمد بن جعفر نے بیان کیا, شعبہ نے قتادہ سے روایت کی ، انہوں نے کہا : میں نے حضرت انس بن مالک رضی اللہ عنہ کو حضرت عبادہ بن صامت رضی اللہ عنہ سے حدیث بیان کرتے ہوئے سنا ، انہوں نے نبی صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يُحَدِّثُ عَنْ عُبَادَةَ بْنِ الصَّامِتِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14385,
                "hadithNumber": "6822",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: He who loves to meet Allah, Allah loves to meet him, and he who dislikes to meet Allah, Allah abhors to meet him. I ('A'isha رضی اللہ عنہا) said: Allah's Apostle, so far as the feeling of aversion against death is concerned, we all have this feeling. Thereupon he (the Holy Prophet) said: It is not that (which you construe), but (this) that when a believer (at the time of death) is given the glad tidings of the mercy of Allah, His Pleasure, and of Paradise, he loves to meet Allah, and Allah also loves to meet him, and when an unbeliever is given the news of the torment at the Hand of Allah, and Hardship to be imposed by Him, he dislikes to meet Allah and Allah also abhors to meet him.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جو شخص اللہ سے ملاقات کو پسند کرے ، اللہ اس سے ملاقات کو پسند فرماتا ہے اور جو شخص اللہ سے ملاقات کو ناپسند کرے ، اللہ اس سے ملاقات کو ناپسند کرتا ہے ۔ \" میں نے کہا : اللہ کے نبی! کیا اس سے موت کی ناپسندیدگی مراد ہے؟ ہم میں سے ہر شخص ( طبعا ) موت کو ناپسند کرتا ہے ، تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" یہ بات نہیں ہے ، لیکن جب مومن کو اللہ کی رحمت ، اس کی رضامندی اور جنت کی بشارت دی جاتی ہے تو وہ اللہ سے ملاقات کو پسند کرتا ہے اور کافر کو جب اللہ کے عذاب اور اس کی ناراضی کی خبر دی جاتی ہے تو وہ اللہ سے ملاقات کو ناپسند کرتا ہے اور اللہ بھی اس ( ناشکرے اور متکبر ) سے ملاقات کو ناپسند کرتا ہے ۔ \"",
                "urduNarrator": "ہم سے محمد بن عبداللہ الرازی نے بیان کیا, خالد بن حارث بجیمی نے کہا : ہمیں سعید نے قتادہ سے حدیث بیان کی ، انہوں نے زُرارہ سے ، انہوں نے سعد بن ہشام سے اور انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرُّزِّيُّ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ الْهُجَيْمِيُّ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ زُرَارَةَ عَنْ سَعْدِ بْنِ هِشَامٍ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَحَبَّ لِقَاءَ اللَّهِ أَحَبَّ اللَّهُ لِقَاءَهُ وَمَنْ كَرِهَ لِقَاءَ اللَّهِ كَرِهَ اللَّهُ لِقَاءَهُ فَقُلْتُ يَا نَبِيَّ اللَّهِ أَكَرَاهِيَةُ الْمَوْتِ فَكُلُّنَا نَكْرَهُ الْمَوْتَ فَقَالَ لَيْسَ كَذَلِكِ وَلَكِنَّ الْمُؤْمِنَ إِذَا بُشِّرَ بِرَحْمَةِ اللَّهِ وَرِضْوَانِهِ وَجَنَّتِهِ أَحَبَّ لِقَاءَ اللَّهِ فَأَحَبَّ اللَّهُ لِقَاءَهُ وَإِنَّ الْكَافِرَ إِذَا بُشِّرَ بِعَذَابِ اللَّهِ وَسَخَطِهِ كَرِهَ لِقَاءَ اللَّهِ وَكَرِهَ اللَّهُ لِقَاءَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14386,
                "hadithNumber": "6823",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been reported on the authority of Qatida with the same chain of transmitters.",
                "hadithUrdu": "اور ہم سے محمد بن بشار نے بیان کیا, محمد بن بکر نے کہا , ہمیں سعید نے قتادہ سے اسی سند کے ساتھ حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَاه مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ بِهَذَا الْإِسْنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14387,
                "hadithNumber": "6824",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: He who loves to meet Allah, Allah also loves to meet him, and who dislikes to meet Allah, Allah abhors to meet him. There is death before (one is able to) meet Allah.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جو شخص اللہ سے ملاقات کو پسند کرتا ہے ، اللہ اس سے ملاقات کو پسند کرتا ہے اور جو شخص اللہ سے ملاقات کو ناپسند کرتا ہے ، اللہ بھی اس سے ملاقات کو ناپسند کرتا ہے اور موت اللہ کی ملاقات سے پہلے ہے ۔ \" ( ملاقات کا معاملہ اس کے بعد آئے گا ۔ )",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, علی بن مسہر نے زکریا سے ، انہوں نے شعبی سے ، انہوں نے شریح بن بانی سے اور انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ زَكَرِيَّاءَ عَنْ الشَّعْبِيِّ عَنْ شُرَيْحِ بْنِ هَانِئٍ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَحَبَّ لِقَاءَ اللَّهِ أَحَبَّ اللَّهُ لِقَاءَهُ وَمَنْ كَرِهَ لِقَاءَ اللَّهِ كَرِهَ اللَّهُ لِقَاءَهُ وَالْمَوْتُ قَبْلَ لِقَاءِ اللَّهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14388,
                "hadithNumber": "6825",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been narrated on the authority of A'isha رضی اللہ عنہا through another chain of transmitters.",
                "hadithUrdu": "عیسیٰ بن یونس نے کہا : ہمیں زکریا نے عامر ( شعبی ) سے حدیث بیان کی ، انہوں نے کہا : مجھے شُریح بن بانی نے حدیث بیان کی کہ حضرت عائشہ رضی اللہ عنہا نے انہیں بتایا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، اسی ( گزشتہ روایت ) کے مانند ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَاه إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ حَدَّثَنَا زَكَرِيَّاءُ عَنْ عَامِرٍ حَدَّثَنِي شُرَيْحُ بْنُ هَانِئٍ أَنَّ عَائِشَةَ أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ بِمِثْلِهِ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 14076,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=563",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=561",
                "label": "561",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=562",
                "label": "562",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=563",
                "label": "563",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=564",
                "label": "564",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=565",
                "label": "565",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=566",
                "label": "566",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=567",
                "label": "567",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=565",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=565",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=563",
        "to": 14100,
        "total": 40465
    }
}