{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 451,
        "data": [
            {
                "id": 11539,
                "hadithNumber": "3975",
                "englishNarrator": "Jabir bin Abdullah ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saying: If You sell fruits to your brother (and Jabir bin Abdullah رضی اللہ عنہ reported through another chain of narrators: If you were to sell fruits to your brother) and these is a stricken with Calamity, it is not permissible for you to get anything from him. Why do you get the wealth of your brother, without jutification?",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اگر تم نے اپنے بھائی کو پھل بیچا ہے ۔ \" نیز ابوضمرہ نے ہمیں ابن جریج سے حدیث بیان کی ، انہوں نے ابوزبیر سے روایت کی کہ انہوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے سنا ، کہہ رہے تھے : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اگر تم اپنے بھائی کو پھل بیچو اور وہ کسی قدرتی آفات کا شکار ہو جائے تو تمہارے لیے حلال نہیں کہ تم اس سے کچھ وصول کرو ۔ تم ناحق اپنے بھائی کا مال کس بنا پر وصول کرو گے.",
                "urduNarrator": "ابو الطاہر نے مجھ سے کہا,ابن وہب نے ہمیں ابن جریج سے خبر دی کہ ابوزبیر نے انہیں جابر بن عبداللہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، عَنِ ابْنِ جُرَيْجٍ، أَنَّ أَبَا الزُّبَيْرِ، أَخْبَرَهُ عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنْ بِعْتَ مِنْ أَخِيكَ ثَمَرًا»، ح وحَدَّثَنَا مُحَمَّدُ بْنُ عَبَّادٍ، حَدَّثَنَا أَبُو ضَمْرَةَ، عَنِ ابْنِ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَوْ بِعْتَ مِنْ أَخِيكَ ثَمَرًا، فَأَصَابَتْهُ جَائِحَةٌ، فَلَا يَحِلُّ لَكَ أَنْ تَأْخُذَ مِنْهُ شَيْئًا، بِمَ تَأْخُذُ مَالَ أَخِيكَ بِغَيْرِ حَقٍّ.",
                "headingArabic": "وَضْعِ الْجَوَائِحِ ‏‏",
                "headingUrdu": "وبائی بیماریاں کی صورت میں ادائیگی معاف کرنا",
                "headingEnglish": "Waiving Payment in the case of Blight",
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11540,
                "hadithNumber": "3976",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been narrated on the authority of Juraij with the same chain of transmitters.",
                "hadithUrdu": "ہم سے حسن الحلوانی نے بیان کیا، انہوں نے کہا ابوعاصم نے ابن جریج سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی.",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا حَسَنٌ الْحُلْوَانِيُّ، حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11541,
                "hadithNumber": "3977",
                "englishNarrator": "Anas (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade the sale of the fruit of date-palms until it becomes mellow. We (some of the other narrators in the chain of transmitters) said: What does the word mellow mean? He said: (There the fruit) turns red or yellow. Don't you see if Allah had checked (the growth of) fruits; then what for the wealth of your brother would be permissible for you?",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے رنگ بدلنے تک کھجور کا پھل بیچنے سے منع فرمایا ۔ ہم نے حضرت انس رضی اللہ عنہ سے پوچھا : اس کے رنگ بدلنے ( زھو ) سے کیا مراد ہے؟ انہوں نے کہا : وہ سرخ ہو جائے اور زرد ہو جائے ، تمہاری کیا رائے ہے اگر اللہ تعالیٰ نے پھل روک دیا ، تو تم کس بنیاد پر اپنے بھائی کا مال اپنے لیے حلال سمجھو گے.",
                "urduNarrator": "ہم سے یحییٰ بن ایوب، قتیبہ اور علی بن حجر نے بیان کیا، انہوں نے کہا اسماعیل بن جعفر نے حمید سے اور انہوں نے حضرت انس رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَعَلِيُّ بْنُ حُجْرٍ، قَالُوا: حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، «أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ ثَمَرِ النَّخْلِ حَتَّى تَزْهُوَ»، فَقُلْنَا لِأَنَسٍ: مَا زَهْوُهَا؟ قَالَ: «تَحْمَرُّ وَتَصْفَرُّ، أَرَأَيْتَكَ إِنْ مَنَعَ اللهُ الثَّمَرَةَ بِمَ تَسْتَحِلُّ مَالَ أَخِيكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11542,
                "hadithNumber": "3978",
                "englishNarrator": "Anas bin Malik ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) forbade the sale of fruits until these are mellow. They (the companions of Anas) said: What is meant by mellow ? He said: It implies that these became red. He said: When Allah hinders the growth of fruits, (then) what for the wealth of your brother would become permissible for you?",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے رنگ پکڑنے سے پہلے پھل کی بیع سے منع فرمایا ۔ لوگوں نے پوچھا : رنگ پکڑنے سے کیا مراد ہے؟ انہوں نے جواب دیا : وہ سرخ ہو جائے اور کہا : جب اللہ تعالیٰ پھلوں سے محروم کر دے تو تم کس بنیاد پر اپنے بھائی کا مال اپنے لیے حلال سمجھو گے.",
                "urduNarrator": "مجھ سے ابو الطاہر نے بیان کیا، ہم سے ابن وہب نے بیان کیا,امام مالک نے حمید الطویل سے اور انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي مَالِكٌ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسِ بْنِ مَالِكٍ، «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الثَّمَرَةِ حَتَّى تُزْهِيَ»، قَالُوا: وَمَا تُزْهِيَ؟ قَالَ: «تَحْمَرُّ»، فَقَالَ: «إِذَا مَنَعَ اللهُ الثَّمَرَةَ فَبِمَ تَسْتَحِلُّ مَالَ أَخِيكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11543,
                "hadithNumber": "3979",
                "englishNarrator": "Anas ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: If Allah does not fructify them, then what is permissible for one of you to take the wealth of his brother?",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے فرمایا : \" اگر اللہ تعالیٰ اسے بارآور نہ کرے تو تم میں سے کوئی اپنے بھائی کے مال کو کس بنیاد پر اپنے یے حلال سمجھے گا.",
                "urduNarrator": "محمد بن عباد نے مجھ سے کہا,عبدالعزیز بن محمد نے حمید کے واسطے سے حضرت انس رضی اللہ عنہ سے حدیث بیان کی کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبَّادٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنْ لَمْ يُثْمِرْهَا اللهُ، فَبِمَ يَسْتَحِلُّ أَحَدُكُمْ مَالَ أَخِيهِ؟",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11544,
                "hadithNumber": "3980",
                "englishNarrator": "Jabir (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) commanded to make deductions in the payment of that stricken with a Calamity. \r\nAbu Ishaq said: \"Ibrahim (who was the companion of Muslims) said: ' \"Abdur Rahman bin Bishr narrated this to me from Sufyan. '\"",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے آفات سے پہنچنے والے نقصان کی صورت میں ( قیمت ) ساقط کر دینے کا حکم دیا ہے ۔ ابواسحاق ابراہیم نے ، وہ امام مسلم کے شاگرد ہیں ، کہا : مجھے عبدالرحمٰن بن بشر نے بھی سفیان سے یہی حدیث بیان کی.",
                "urduNarrator": "بشر بن حکم ، ابراہیم بن دینار اور عبدالجبار بن علاء سے روایت ہے ، الفاظ بشر کے ہیں ، سب نے کہا : ہمیں سفیان بن عیینہ نے حمید اعرج سے حدیث بیان کی ، انہوں نے سلیمان بن عتیق سے اور انہوں نے حضرت جابر رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا بِشْرُ بْنُ الْحَكَمِ، وَإِبْرَاهِيمُ بْنُ دِينَارٍ، وَعَبْدُ الْجَبَّارِ بْنُ الْعَلَاءِ، وَاللَّفْظُ لِبِشْرٍ، قَالُوا: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ حُمَيْدٍ الْأَعْرَجِ، عَنْ سُلَيْمَانَ بْنِ عَتِيقٍ، عَنْ جَابِرٍ، «أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِوَضْعِ الْجَوَائِحِ»، قَالَ أَبُو إِسْحَاقَ - وَهُوَ صَاحِبُ مُسْلِمٍ -: حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ بِشْرٍ، عَنْ سُفْيَانَ، بِهَذَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11545,
                "hadithNumber": "3981",
                "englishNarrator": "Abu Sa'id al-Khudri (رضی اللہ عنہ) reported:",
                "hadithEnglish": "In the time of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) a man suffered loss in fruits he had bought and his debt increased; so Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) told (the people) to give him charity and they gave him charity, but that was not enough to pay the debt in full, whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to his creditors: Take what you find, you will have nothing but alms.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں ایک آدمی کا ان پھلوں میں نقصان ہو گیا جو اس نے خریدے تھے ، اس کا قرض بڑھ گیا تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اس پر صدقہ کرو ۔ \" لوگوں نے اس پر صدقہ کیا لیکن وہ بھی قرض کی ادائیگی ( جتنی مالیت ) تک نہ پہنچا ، تو رسول اللہ صلی اللہ علیہ وسلم نے اس کے قرض داروں سے فرمایا : \" جو تمہیں مل جائے ، وہ لے لو ، تمہارے لیے اس کے علاوہ اور کچھ نہیں.",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, لیث نے ہمیں بکیر سے حدیث بیان کی ، انہوں نے عیاض بن عبداللہ سے اور انہوں نے حضرت ابوسعید خدری رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ بُكَيْرٍ، عَنْ عِيَاضِ بْنِ عَبْدِ اللهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ: أُصِيبَ رَجُلٌ فِي عَهْدِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي ثِمَارٍ ابْتَاعَهَا، فَكَثُرَ دَيْنُهُ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «تَصَدَّقُوا عَلَيْهِ»، فَتَصَدَّقَ النَّاسُ عَلَيْهِ، فَلَمْ يَبْلُغْ ذَلِكَ وَفَاءَ دَيْنِهِ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِغُرَمَائِهِ: «خُذُوا مَا وَجَدْتُمْ، وَلَيْسَ لَكُمْ إِلَّا ذَلِكَ.",
                "headingArabic": "اسْتِحْبَابِ الْوَضْعِ مِنَ الدَّيْنِ",
                "headingUrdu": "قرض معاف کرنے کی سفارش کی جاتی ہے۔",
                "headingEnglish": "It is recommended to waive debts",
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11546,
                "hadithNumber": "3982",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Bukair bin al-Ashajj with the same chain of transmitters.",
                "hadithUrdu": "مجھ سے یونس بن عبداللہ نے بیان کیا، کہا ہم سے عبداللہ بن وہب نے بیان کیا، انہوں نے کہاعمرو بن حارث نے بکیر بن اشج سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی.",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنِي يُونُسُ بْنُ عَبْدِ الْأَعْلَى، أَخْبَرَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ بُكَيْرِ بْنِ الْأَشَجِّ بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11547,
                "hadithNumber": "3983",
                "englishNarrator": "A'isha (رضی اللہ عنہا) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) heard the voices of altercation of two disputants at the door; both the voices were quite loud. The one demanded some remission and desired that the other one should show leniency to him, whereupon the (other one) was saying: By Allah will not do that. Then there came Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) to them and said: Where is he who swears by Allah that he would not do good? He said: Messenger of Allah, it is I. He may do as he desires.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے دروازے کے پاس جھگڑا کرنے والوں کی آواز سنی ، ان دونوں کی آوازیں بلند تھیں اور ان میں سے ایک دوسرے سے کچھ کمی کرنے کی اور کسی چیز میں نرمی کی درخواست کر رہا تھا اور وہ ( دوسرا ) کہہ رہا تھا : اللہ کی قسم! میں ایسا نہیں کروں گا ۔ رسول اللہ صلی اللہ علیہ وسلم ان دونوں کے پاس باہر تشریف لے گئے اور فرمانے لگے : \" اللہ ( کے نام ) پر قسم اٹھانے والا کہاں ہے کہ وہ نیکی کا کام نہیں کرے گا؟ \" اس نے عرض کی : اے اللہ کے رسول! میں ہوں ، اس شخص کے لیے وی صورت ہے جو یہ پسند کرے ۔ ( وہ فورا اپنے بھائی کا مطالبہ مان گیا).",
                "urduNarrator": "مجھ سے ہمارے ایک سے زیادہ اصحاب نے بیان کیا، انہوں نے کہا: ہم سے اسماعیل بن ابی اویس نے بیان کیا، مجھ سے میرے بھائی نے، سلیمان سے، جو ابن بلال ہیں، یحییٰ کی سند سے بیان کیا۔ بن سعید، ابو الرجال محمد بن عبدالرحمٰن کی طرف سے، کہ ان کی والدہ ,عمرہ بنت عبدالرحمن ( بن عوف ) نے کہا : میں نے حضرت عائشہ رضی اللہ عنہا کو کہتے ہوئے سنا",
                "hadithArabic": "وحَدَّثَنِي غَيْرُ وَاحِدٍ مِنْ أَصْحَابِنَا، قَالُوا: حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، حَدَّثَنِي أَخِي، عَنْ سُلَيْمَانَ وَهُوَ ابْنُ بِلَالٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ أَبِي الرِّجَالِ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّ أُمَّهُ عَمْرَةَ بِنْتَ عَبْدِ الرَّحْمَنِ، قَالَتْ: سَمِعْتُ عَائِشَةَ، تَقُولُ: سَمِعَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ صَوْتَ خُصُومٍ بِالْبَابِ، عَالِيَةٍ أَصْوَاتُهُمَا، وَإِذَا أَحَدُهُمَا يَسْتَوْضِعُ الْآخَرَ وَيَسْتَرْفِقُهُ فِي شَيْءٍ، وَهُوَ يَقُولُ: وَاللهِ لَا أَفْعَلُ، فَخَرَجَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَيْهِمَا، فَقَالَ: «أَيْنَ الْمُتَأَلِّي عَلَى اللهِ لَا يَفْعَلُ الْمَعْرُوفَ؟» قَالَ: أَنَا، يَا رَسُولَ اللهِ، فَلَهُ أَيُّ ذَلِكَ أَحَبَّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11548,
                "hadithNumber": "3984",
                "englishNarrator": "Abdullah bin Ka'ab bin Malik reported from his father:",
                "hadithEnglish": "He pressed in the mosque Ibn Abu Hadrad رضی اللہ عنہ for the payment of the debt that he owed to him during the lifetime of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). (In this altercation) their voices became loud, until Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) heard them, while he was in the house, so Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came out towards them, and he lifted the curtain of his apartment and he called upon Ka'b b. Malik and said: O Ka'b. He said: At thy beck and call, Allah's Messenger. He pointed out with the help of his hand to remit half of the loan due to him. Ka'b said: Allah's Messenger, I am ready to do that, whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said (to Ibn Abu Hadrad): Stand up and make him the payment (of the rest).",
                "hadithUrdu": "انہوں نے رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں ، مسجد میں ، ابن ابی حدرد رضی اللہ عنہ سے قرض کا مطالبہ کیا جو ان کے ذمے تھا تو ان کی آوازیں بلند ہو گئیں ، یہاں تک کہ رسول اللہ صلی اللہ علیہ وسلم نے گھر کے اندر ان کی آوازیں سنیں تو رسول اللہ صلی اللہ علیہ وسلم ان کی طرف گئے یہاں تک کہ آپ نے اپنے حجرے کا پردہ ہٹایا اور کعب بن مالک کو آواز دی : \" کعب! \" انہوں نے عرض کی : حاضر ہوں ، اے اللہ کے رسول! آپ نے اپنے ہاتھ سے انہیں اشارہ کیا کہ اپنے قرض کا آدھا حصہ معاف کر دو ۔ کعب نے کہا : اللہ کے رسول! کر دیا ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے ( دوسرے سے ) فرمایا : \" اٹھو اور اس کا قرض چکا دو.",
                "urduNarrator": "ہم سے حرملہ بن یحییٰ نے بیان کیا، انہوں نے بیان کیا عبداللہ بن وہب نے ہمیں خبر دی ، کہا : مجھے یونس نے ابن شہاب سے خبر دی ، کہا : مجھے عبداللہ بن کعب بن مالک نے حدیث بیان کی ، انہوں نے اپنے والد سے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي عَبْدُ اللهِ بْنُ كَعْبِ بْنِ مَالِكٍ، أَخْبَرَهُ، عَنْ أَبِيهِ، أَنَّهُ تَقَاضَى ابْنَ أَبِي حَدْرَدٍ دَيْنًا كَانَ لَهُ عَلَيْهِ فِي عَهْدِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي الْمَسْجِدِ، فَارْتَفَعَتْ أَصْوَاتُهُمَا حَتَّى سَمِعَهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَهُوَ فِي بَيْتِهِ، فَخَرَجَ إِلَيْهِمَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حَتَّى كَشَفَ سِجْفَ حُجْرَتِهِ، وَنَادَى كَعْبَ بْنَ مَالِكٍ، فَقَالَ: «يَا كَعْبُ»، فَقَالَ: لَبَّيْكَ يَا رَسُولَ اللهِ، «فَأَشَارَ إِلَيْهِ بِيَدِهِ أَنْ ضَعِ الشَّطْرَ مِنْ دَيْنِكَ»، قَالَ كَعْبٌ: قَدْ فَعَلْتُ يَا رَسُولَ اللهِ، قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «قُمْ فَاقْضِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11549,
                "hadithNumber": "3985",
                "englishNarrator": null,
                "hadithEnglish": "Kab bin Malik رضی اللہ عنہ narrated that he asked Ibn Abi Hadard رضی اللہ عنہ to pay off a debt that he owed him.. a Hadith like that of Ibn Wahb (3984).",
                "hadithUrdu": "ہم سے اسحاق بن ابراہیم نے بیان کیا,عثمان بن عمر نے ہمیں خبر دی ، انہوں نے کہا : ہمیں یونس نے زہری سے خبر دی ، انہوں نے عبداللہ بن کعب بن مالک سے روایت کی کہ انہیں کعب بن مالک رضی اللہ عنہ نے بتایا کہ انہوں نے ابن ابی حدرد رضی اللہ عنہ سے اپنے قرض کا مطالبہ کیا ۔ ۔ ۔ ( آگے ) ابن وہب کی حدیث کی طرح ہے.",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عُثْمَانُ بْنُ عُمَرَ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، عَنْ عَبْدِ اللهِ بْنِ كَعْبِ بْنِ مَالِكٍ، أَنَّ كَعْبَ بْنَ مَالِكٍ، أَخْبَرَهُ أَنَّهُ تَقَاضَى دَيْنًا لَهُ عَلَى ابْنِ أَبِي حَدْرَدٍ بِمِثْلِ حَدِيثِ ابْنِ وَهْبٍ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11550,
                "hadithNumber": "3986",
                "englishNarrator": "Ka'b bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "He made a demand for the payment of the debt that Ibn Abu Hadrad رضی اللہ عنہ owed to him. This hadith is narrated through another chain of transmitters and (the words are): He had to get the loan from Abdullah bin Hadrad al-Aslami رضی اللہ عنہ . He met him and pressed him for payment. There was an altercation between them, until their voices became loud. There happened to pass by them Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and he said: O Ka'b, and pointed out with his hand in such a way as he meant half. So he got half of what he (Ibn Abu Hadrad رضی اللہ عنہ ) owed to him and remitted the half.",
                "hadithUrdu": "ان کا کچھ مال عبداللہ بن ابی حدرد اسلمی رضی اللہ عنہ کے ذمے تھا ۔ وہ انہیں ملے تو کعب رضی اللہ عنہ ان کے ساتھ لگ گئے ، ان کی باہم تکرار ہوئی حتی کہ ان کی آوازیں بلند ہو گئیں ۔ رسول اللہ صلی اللہ علیہ وسلم کا ان سے پاس سے گزرا تو آپ نے فرمایا : \" کعب! \" پھر آپ نے اپنے ہاتھ سے اشارہ کیا ، گویا آپ فرما رہے تھے کہ آدھا لے لو ، چنانچہ انہوں نے اس مال میں سے جو اس ( ابن ابی حدرد اسلمی رضی اللہ عنہ ) کے ذمے تھا ، آدھا لے لیا اور آدھا چھوڑ دیا.",
                "urduNarrator": "مسلم نے کہا: لیث بن سعد نے بیان کیا، مجھ سے جعفر بن ربیعہ نے بیان کیا,عبدالرحمٰن بن ہُرمز نے عبداللہ بن کعب بن مالک سے اور انہوں نے حضرت کعب بن مالک رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "قَالَ مُسْلِمٌ: وَرَوَى اللَّيْثُ بْنُ سَعْدٍ، حَدَّثَنِي جَعْفَرُ بْنُ رَبِيعَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ، عَنْ عَبْدِ اللهِ بْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ كَعْبِ بْنِ مَالِكٍ، أَنَّهُ كَانَ لَهُ مَالٌ عَلَى عَبْدِ اللهِ بْنِ أَبِي حَدْرَدٍ الْأَسْلَمِيِّ، فَلَقِيَهُ، فَلَزِمَهُ، فَتَكَلَّمَا حَتَّى ارْتَفَعَتْ أَصْوَاتُهُمَا، فَمَرَّ بِهِمَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «يَا كَعْبُ»، «فَأَشَارَ بِيَدِهِ كَأَنَّهُ يَقُولُ النِّصْفَ»، فَأَخَذَ نِصْفًا مِمَّا عَلَيْهِ، وَتَرَكَ نِصْفًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11551,
                "hadithNumber": "3987",
                "englishNarrator": "Abu Huraira (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: He who found his property intact with a person (who bought it but who later on) became insolvent (or a person who became insolvent), he (the seller) is entitled to get it more than anyone else. '",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ۔ ۔ یا ( اس طرح کہا : ) میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ فرما رہے تھے ۔ ۔ : \" جس نے اپنا مال جوں کا توں اس شخص کے پاس پایا جو مفلس ہو چکا ہے ۔ ۔ یا اس انسان کے پاس جو مفلس ہو چکا ہے ۔ ۔ تو وہ دوسروں کی نسبت اس ( مال ) کا زیادہ حق دار ہے.",
                "urduNarrator": "ہم سے احمد بن عبداللہ بن یونس نے بیان کیا,زہیر بن حرب نے کہا : ہمیں یحییٰ بن سعید نے حدیث بیان کی ، کہا : مجھے ابوبکر بن محمد بن عمرو بن حزم نے خبر دی کہ انہیں عمر بن عبدالعزیز نے خبر دی ، انہیں ابوبکر بن عبدالرحمٰن بن حارث بن ہشام نے بتایا کہ انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللهِ بْنِ يُونُسَ، حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، أَخْبَرَنِي أَبُو بَكْرِ بْنُ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، أَخْبَرَهُ، أَنَّ أَبَا بَكْرِ بْنَ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، أَخْبَرَهُ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: - أَوْ سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: - «مَنْ أَدْرَكَ مَالَهُ بِعَيْنِهِ عِنْدَ رَجُلٍ قَدْ أَفْلَسَ - أَوْ إِنْسَانٍ قَدْ أَفْلَسَ - فَهُوَ أَحَقُّ بِهِ مِنْ غَيْرِهِ».",
                "headingArabic": "مَنْ أَدْرَكَ مَا بَاعَهُ عِنْدَ الْمُشْتَرِي وَقَدْ أَفْلَسَ فَلَهُ الرُّجُوعُ فِيهِ ‏‏",
                "headingUrdu": "اگر کسی شخص کو خریدار کے پاس بیچی ہوئی چیز مل جائے جو دیوالیہ ہو گیا ہو تو اسے واپس لینے کا حق ہے",
                "headingEnglish": "If a man finds what he sold with the purchaser, who has become bankrupt, then he has the right to take it back",
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11552,
                "hadithNumber": "3988",
                "englishNarrator": "A hadith like that of Zubair (no. 3988) was narrated from Yahya bin Saeed with this chain. Ibn Rumh said in his report:",
                "hadithEnglish": "\"Any man who becomes bnkrupt.\"",
                "hadithUrdu": "\" جس کسی آدمی کو مفلس قرار دیا گیا ہو.",
                "urduNarrator": "یحییٰ بن یحییٰ نے ہمیں حدیث بیان کی ، کہا : ہمیں ہشیم نے خبر دی ، ( اسی طرح ) قتیبہ بن سعید اور محمد بن رمح دونوں نے لیث بن سعد سے روایت کی اور ( اسی طرح ) ابوربیع اور یحییٰ بن حبیب حارثی نے کہا : ہمیں حماد بن زید نے حدیث بیان کی ۔ ابوبکر بن ابی شیبہ نے کہا : ہمیں سفیان بن عیینہ نے حدیث سنائی ۔ محمد بن مثنیٰ نے بیان کیا : ہمیں عبدالوہاب ، یحییٰ بن سعید ( القطان ) اور حفص بن غیاث ، سب نے یحییٰ بن سعید سے ، اسی سند کے ساتھ زہیر کی حدیث کے ہم معنی حدیث بیان کی ، البتہ ان میں سے ابن رمح نے اپنی روایت میں کہا :",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، ح وحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ رُمْحٍ، جَمِيعًا عَنِ اللَّيْثِ بْنِ سَعْدٍ، ح وحَدَّثَنَا أَبُو الرَّبِيعِ، وَيَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، قَالَا: حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ، ح وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، وَيَحْيَى بْنُ سَعِيدٍ، وَحَفْصُ بْنُ غِيَاثٍ، كُلُّ هَؤُلَاءِ، عَنْ يَحْيَى بْنِ سَعِيدٍ، فِي هَذَا الْإِسْنَادِ بِمَعْنَى حَدِيثِ زُهَيْرٍ، وقَالَ ابْنُ رُمْحٍ مِنْ بَيْنِهِمْ فِي رِوَايَتِهِ: «أَيُّمَا امْرِئٍ فُلِّسَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11553,
                "hadithNumber": "3989",
                "englishNarrator": "Abu Huraira (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saying about a person who becomes insolvent and (the thing bought by him) is found intact with him, that belongs to one who sold it.",
                "hadithUrdu": "انہوں نے نبی صلی اللہ علیہ وسلم سے اس شخص کے بارے میں روایت کی جو کنگال ہو جائے ، جب اس کے پاس سامان ملے اور اس نے اس میں تصرف نہ کیا ہو ، ( فرمایا : ) \" تو وہ اس کے مالک کا ہے ، جس نے اسے فروخت کیا تھا.",
                "urduNarrator": "ہم سے ابن ابی عمر نے بیان کیا، کہا ہم سے ہشام بن سلیمان نے جو ابن عکرمہ بن خالد المخزومی ہیں، انہوں نے ابن جریج کی سند سے بیان کیا, ابن ابی حسین نے مجھے حدیث بیان کی کہ انہیں ابوبکر بن محمد بن عمرو بن حزم نے خبر دی کہ انہیں عمر بن عبدالعزیز نے ابوبکر بن عبدالرحمٰن کی ( روایت کردہ ) حدیث سنائی ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ کی ( روایت کردہ ) حدیث بیان کی",
                "hadithArabic": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا هِشَامُ بْنُ سُلَيْمَانَ وَهُوَ ابْنُ عِكْرِمَةَ بْنِ خَالِدٍ الْمَخْزُومِيُّ، عَنِ ابْنِ جُرَيْجٍ، حَدَّثَنِي ابْنُ أَبِي حُسَيْنٍ، أَنَّ أَبَا بَكْرِ بْنَ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، أَخْبَرَهُ، أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، حَدَّثَهُ، عَنْ حَدِيثِ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ حَدِيثِ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فِي الرَّجُلِ الَّذِي يُعْدِمُ، إِذَا وُجِدَ عِنْدَهُ الْمَتَاعُ، وَلَمْ يُفَرِّقْهُ: «أَنَّهُ لِصَاحِبِهِ الَّذِي بَاعَهُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11554,
                "hadithNumber": "3990",
                "englishNarrator": "Abu Huraira (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When a man becomes insolvent (and the other) man (the seller) finds his commodity intact with him, he is more entitled to get it (than anyone else)",
                "hadithUrdu": "آپ نے فرمایا : \" جب کوئی آدمی مفلس ہو جائے اور کوئی آدمی ( اس کے پاس ) اپنا مال جوں کا توں پائے تو وہ اس کا زیادہ حق دار ہے.",
                "urduNarrator": "ہم سے محمد بن المثنیٰ نے بیان کیا، ہم سے محمد بن جعفر اور عبدالرحمٰن بن مہدی نے بیان کیا، انہوں نے کہا:شعبہ نے ہمیں قتادہ سے حدیث بیان کی ، انہیں نے نضر بن انس سے ، انہوں نے بشیر بن نہیک سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، قَالَا: حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنِ النَّضْرِ بْنِ أَنَسٍ، عَنْ بَشِيرِ بْنِ نَهِيكٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا أَفْلَسَ الرَّجُلُ، فَوَجَدَ الرَّجُلُ مَتَاعَهُ بِعَيْنِهِ، فَهُوَ أَحَقُّ بِهِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11555,
                "hadithNumber": "3991",
                "englishNarrator": "This hadith has been narrated on the authority of Qatada with the same chain of transmitters (but with a change of these words):",
                "hadithEnglish": "He is more entitled to get it than any other creditor.",
                "hadithUrdu": "\" تو وہ ( دیگر ) قرض خواہوں کی نسبت اس ( مال ) کا زیادہ حقدار ہے ۔ \"",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، ہم سے اسماعیل بن ابراہیم نے بیان کیا، انہوں نے ہم سے بیان کیا,سعید اور ہشام دونوں نے قتادہ سے اسی سند کے ساتھ اسی کی مانند روایت کی اور کہا",
                "hadithArabic": "وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا سَعِيدٌ، ح وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، أَيْضًا حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنِي أَبِي، كِلَاهُمَا عَنْ قَتَادَةَ، بِهَذَا الْإِسْنَادِ مِثْلَهُ، وَقَالَا: «فَهُوَ أَحَقُّ بِهِ مِنَ الْغُرَمَاءِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11556,
                "hadithNumber": "3992",
                "englishNarrator": "Abu Huraira ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When a man becomes insolvent, and the other person (seller) finds his goods intact with him, he is more entitled to get them than anyone else.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب کوئی آدمی مفلس قرار دیا جائے اور ( کسی بیچنےوالے ) شخص کو اس کے ہاں اپنا سامان جوں کا توں مل جائے تو وہ اس کا زیادہ حقدار ہے ۔ \"",
                "urduNarrator": "مجھ سے محمد بن احمد بن ابی خلف اور حجاج بن الشعر نے بیان کیا، کہا کہ ہم سے ابوسلمہ الخزاعی نے بیان کیا، حجاج نے کہا: منصور بن سلمہ، ہمیں سلیمان بن بلال نے خثیم بن کی سند سے خبر دی, عراک بن مالک نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ، وَحَجَّاجُ بْنُ الشَّاعِرِ، قَالَا: حَدَّثَنَا أَبُو سَلَمَةَ الْخُزَاعِيُّ، قَالَ حَجَّاجٌ: مَنْصُورُ بْنُ سَلَمَةَ، أَخْبَرَنَا سُلَيْمَانُ بْنُ بِلَالٍ، عَنْ خُثَيْمِ بْنِ عِرَاكٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا أَفْلَسَ الرَّجُلُ، فَوَجَدَ الرَّجُلُ عِنْدَهُ سِلْعَتَهُ بِعَيْنِهَا، فَهُوَ أَحَقُّ بِهَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11557,
                "hadithNumber": "3993",
                "englishNarrator": "Hudhaifa رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying The angels took away the soul of a person who had lived among people who were before you. They (the angels) said: Did you do anything good? He said: No. they said: Try to recall. He said: I used to lend to people and order my servants to give respite to one in straitened circumstances and give allowance to the solvent, for Allah, the Exalted and Majestic, said (to the angels): You should ignore (his failing).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم سے پہلے لوگوں میں سے ایک آدمی کی روح کا فرشتوں نے استقبال کیا تو انہوں نے پوچھا : \" کیا تو نے کوئی نیکی کی ہے؟ اس نے کہا : نہیں ، انہوں نے کہا : یاد کر ، اس نے کہا : میں ( دنیا میں ) لوگوں کے ساتھ قرض کا معاملہ کرتا تو اپنے خادموں کو حکم دیتا تھا کہ وہ تنگدست کو مہلت دیں اور خوشحال سے نرمی برتیں ۔ ( انہوں نے ) کہا : اللہ عزوجل نے فرمایا ہے : ( تم بھی ) اس کے ساتھ نرمی کا سلوک کرو ۔",
                "urduNarrator": "ہم سے احمد بن عبداللہ بن یونس نے بیان کیا، کہا ہم سے زہیر نے بیان کیا,منصور نے ہمیں ربعی بن حراش سے حدیث بیان کی کہ حضرت حذیفہ ( بن یمان رضی اللہ عنہ ) نے انہیں حدیث بیان کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللهِ بْنِ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا مَنْصُورٌ، عَنْ رِبْعِيِّ بْنِ حِرَاشٍ، أَنَّ حُذَيْفَةَ، حَدَّثَهُمْ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: تَلَقَّتِ الْمَلَائِكَةُ رُوحَ رَجُلٍ مِمَّنْ كَانَ قَبْلَكُمْ، فَقَالُوا: أَعَمِلْتَ مِنَ الْخَيْرِ شَيْئًا؟ قَالَ: لَا، قَالُوا: تَذَكَّرْ، قَالَ: كُنْتُ أُدَايِنُ النَّاسَ فَآمُرُ فِتْيَانِي أَنْ يُنْظِرُوا الْمُعْسِرَ، وَيَتَجَوَّزُوا عَنِ الْمُوسِرِ، قَالَ: قَالَ اللهُ عَزَّ وَجَلَّ: تَجَوَّزُوا عَنْهُ.",
                "headingArabic": "فضل إنظارالمعسروالتجاوز في الاقتضا‏‏ء من الموسر والمعسر",
                "headingUrdu": "مشکل میں مبتلا افراد کو زیادہ وقت دینے کی فضیلت، اور ان لوگوں کو چھوڑ دینا جو مشکل میں ہیں اور جو صحت مند ہیں۔",
                "headingEnglish": "The virute of giving more time to one who is suffering difficulty, and letting those go who are suffering difficulty and those who are well off",
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11558,
                "hadithNumber": "3994",
                "englishNarrator": "Hudhaifa رضی اللہ عنہ reported:",
                "hadithEnglish": "A person met his Lord (after death) and He said: What (good) did you do? He said: I did no good except this that I was a rich man, and I demanded from the people (the repayment of debt that I advanced to them). I, however, accepted that which the solvent gave and remitted (the debt) of the insolvent, whereupon He (the Lord) said: You should ignore (the faults) of My servant. Abu Mas'ud ( رضی اللہ عنہ) said: This is what I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying.",
                "hadithUrdu": "ایک آدمی اللہ عزوجل کے حضور پیش ہوا تو اللہ نے پوچھا : \" تو نے کیا عمل کیا؟ \" اس نے کہا : میں نے کوئی نیکی نہیں کی ، سوائے اس کے کہ میں مالدار آدمی تھا ، میں لوگوں سے اس ( میں سے دیے ہوئے قرض ) کا مطالبہ کرتا تو مالدار سے خوش دلی سے قبول کرتا اور تنگ دست سے درگزر ( مزید مہلت دیتا یا نہ دے سکتا تو معاف ) کرتا ۔ فرمایا : \" ( تم بھی ) میرے بندے سے درگزر کرو ۔ \" ( یہ سن کر ) حضرت ابومسعود رضی اللہ عنہ نے کہا : میں نے بھی رسول اللہ صلی اللہ علیہ وسلم کو اس طرح فرماتے ہوئے سنا ہے ۔",
                "urduNarrator": "ہم سے علی بن حجر اور اسحاق بن ابراہیم نے بیان کیا، اور یہ قول ابن حجر کا ہے، انہوں نے کہا: ہم سے جریر نے المغیرہ کی سند سے بیان کیا،نُعَیم بن ابی ہند نے ربعی بن حراش سے روایت کی ، انہوں نے کہا : حضرت حذیفہ اور حضرت ابومسعود ( انصاری ) رضی اللہ عنہ اکٹھے ہوئے تو حضرت حذیفہ رضی اللہ عنہ نے کہا",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَاللَّفْظُ لِابْنِ حُجْرٍ، قَالَا: حَدَّثَنَا جَرِيرٌ، عَنِ الْمُغِيرَةِ، عَنْ نُعَيْمِ بْنِ أَبِي هِنْدٍ، عَنْ رِبْعِيِّ بْنِ حِرَاشٍ، قَالَ: اجْتَمَعَ حُذَيْفَةُ، وَأَبُو مَسْعُودٍ، فَقَالَ حُذَيْفَةُ: رَجُلٌ لَقِيَ رَبَّهُ، فَقَالَ: مَا عَمِلْتَ؟ قَالَ: مَا عَمِلْتُ مِنَ الْخَيْرِ إِلَّا أَنِّي كُنْتُ رَجُلًا ذَا مَالٍ، فَكُنْتُ أُطَالِبُ بِهِ النَّاسَ فَكُنْتُ أَقْبَلُ الْمَيْسُورَ، وَأَتَجَاوَزُ عَنِ الْمَعْسُورِ، فَقَالَ: تَجَاوَزُوا عَنْ عَبْدِي ، قَالَ أَبُو مَسْعُودٍ: هَكَذَا سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11559,
                "hadithNumber": "3995",
                "englishNarrator": "Hudhaifa ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: A person died and he entered Paradise. It was said to him What (act) did you do? (Either he recalled it himself or he was made to recall), he said I used to enter into transactions with people and I gave respite to the insolvent and did not show any strictness in case of accepting a coin or demanding cash payment. (For these acts of his) he was granted pardon. Abu Mas'ud  رضی اللہ عنہ said: I heard this from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \" ایک آدمی فوت ہوا اور جنت میں داخل ہوا تو اس سے کہا گیا : تو کیا عمل کرتا تھا؟ ۔ ۔ کہا : اس نے خود یاد کیا یا اسے یاد کرایا گیا ۔ ۔ اس نے کہا : ( اے میرے پروردگار! ) میں لوگوں سے ( قرض پر ) خرید و فروخت کرتا تھا ، تو میں تنگ دست کو مہلت دیتا اور سکہ اور نقدی وصول کرنے میں نرمی کرتا تھا ، تو اس کی مغفرت کر دی گئی \" اس پر حضرت ابومسعود رضی اللہ عنہ نے کہا : میں نے بھی یہی حدیث رسول اللہ صلی اللہ علیہ وسلم سے سنی تھی ۔",
                "urduNarrator": "ہم سے محمد بن مثنیٰ نے بیان کیا، ہم سے محمد بن جعفر نے بیان کیا، ہم سے شعبہ نے بیان کیا، ان سےعبدالملک بن عمیر نے ربعی بن حراش سے ، انہوں نے حضرت حذیفہ رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی :",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ رِبْعِيِّ بْنِ حِرَاشٍ، عَنْ حُذَيْفَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، أَنَّ رَجُلًا مَاتَ، فَدَخَلَ الْجَنَّةَ، فَقِيلَ لَهُ: مَا كُنْتَ تَعْمَلُ؟ - قَالَ: فَإِمَّا ذَكَرَ وَإِمَّا ذُكِّرَ - فَقَالَ: إِنِّي كُنْتُ أُبَايِعُ النَّاسَ، فَكُنْتُ أُنْظِرُ الْمُعْسِرَ، وَأَتَجَوَّزُ فِي السِّكَّةِ - أَوْ فِي النَّقْدِ - فَغُفِرَ لَهُ ، فَقَالَ أَبُو مَسْعُودٍ: وَأَنَا سَمِعْتُهُ مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11560,
                "hadithNumber": "3996",
                "englishNarrator": "Hudhaifa (رضی اﷲ عنہ) reported:",
                "hadithEnglish": "A servant from amongst the servants of Allah was brought to Him whom Allah had endowed with riches. He (Allah) said to him: What (did you do) in the world? (They cannot conceal anything from Allah) He (the person) said: O my Lord, You endowed me with Your riches. I used to enter into transactions with people. It was my nature to be lenient to (my debtors). I showed leniency to the solvent and gave respite to the insolvent, whereupon Allah said: I have more right than you to do this to connive at My servant. 'Uqba bin 'Amir al-Juhani and Abu Mas'ud رضی اﷲ عنہ said: This is what we heard from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌).",
                "hadithUrdu": "ﷲ عزوجل کے پس اس کا ایک بندہ لایا گیا جس کو اس نے مال دیا تھا تو اﷲ تعالیٰ نے اس سے پوچھا تو نے دنیا میں کیا عمل کیا؟ اور اﷲ سے کچھ نہیں چھپا سکتے ۔ بندے نے کہا اے میرے مالک! تونے اپنامال مجھ کو دیا تھا میں لوگوں کے ہاتھ بیچتا تھا اور میری عادت تھی درگزر کرنے کی ( اور معاف کرنے کی ) تو میں آسانی کرتا تھا مالدار پر اور مہلت دیتا تھا نادار کو ۔ تب ﷲا نے فرمایا پھر میں تو زیادہ لائق ہوں معاف کرنے کے لیے تجھ سے ، درگزر کرو میرے بندے سے ۔ پھر عقبہ بن عامرجہنیؓ اور ابومسعود انصاری رضی اﷲ عنہ نے کہا ہم نے ایسا ہی سُنا ہے رسول اﷲ ﷺ کے منہ مبارک سے ۔",
                "urduNarrator": "ہم سے ابو سعید اشجج نے بیان کیا، کہا ہم سے ابو خالد الاحمر نے بیان کیا، ان سے سعد بن طارق نے، وہ رباعی بن حارث کی سند سے,حذیفہ رضی اﷲ عنہ سے روایت ہے",
                "hadithArabic": "حَدَّثَنَا أَبُو سَعِيدٍ الأَشَجُّ، حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، عَنْ سَعْدِ بْنِ طَارِقٍ، عَنْ رِبْعِيِّ، بْنِ حِرَاشٍ عَنْ حُذَيْفَةَ، قَالَ ‏ ‏ أُتِيَ اللَّهُ بِعَبْدٍ مِنْ عِبَادِهِ آتَاهُ اللَّهُ مَالاً فَقَالَ لَهُ مَاذَا عَمِلْتَ فِي الدُّنْيَا - قَالَ وَلاَ يَكْتُمُونَ اللَّهَ حَدِيثًا - قَالَ يَا رَبِّ آتَيْتَنِي مَالَكَ فَكُنْتُ أُبَايِعُ النَّاسَ وَكَانَ مِنْ خُلُقِي الْجَوَازُ فَكُنْتُ أَتَيَسَّرُ عَلَى الْمُوسِرِ وَأُنْظِرُ الْمُعْسِرَ ‏.‏ فَقَالَ اللَّهُ أَنَا أَحَقُّ بِذَا مِنْكَ تَجَاوَزُوا عَنْ عَبْدِي ‏ ‏ ‏.‏ فَقَالَ عُقْبَةُ بْنُ عَامِرٍ الْجُهَنِيُّ وَأَبُو مَسْعُودٍ الأَنْصَارِيُّ هَكَذَا سَمِعْنَاهُ مِنْ فِي رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11561,
                "hadithNumber": "3997",
                "englishNarrator": "Abu Mas'ud (رضی اﷲ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: A person from people who lived before you was called to account (by Allah at the Day of Judgment) and no good was found in his account except this that lie being a rich man had (financial) dealings with people and had commanded his servants to show leniency to the straitened ones. Upon this Allah, the Exalted and Majestic, said: We have more right to this, so overlook (his faults).",
                "hadithUrdu": "رسول اﷲ ﷺ نے فرمایا تم سے پہلے ایک شخص کا حساب ہوا تو اس کی کوئی نیکی نہ نکلی مگر اتنی کہ وہ لوگوں سے معاملہ کرتا تھا اور مالدار تھا تو اپنے غلاموں کو حکم کرتا نادار کو معاف کردینے کا ۔ تب اﷲ تعالیٰ نے فرمایا ہم زیادہ حق رکھتے ہیں معاف کرنے کا تجھ سے اور حکم دیا کہ معاف کرو اس کے گناہوں کو ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ، ابوبکر بن ابی شیبہ، ابو کریب، اور اسحاق بن ابراہیم نے بیان کیا - اور تلفظ یحییٰ ہے - یحییٰ نے کہا۔ اس نے ہم سے بیان کیا اور دوسروں نے کہا کہ ہم سے ابو معاویہ نے الاعمش سے اور ایک بھائی کی سند سے بیان کیا,حضرت ابی مسعود رضی اﷲ عنہ سے روایت ہے",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ - وَاللَّفْظُ لِيَحْيَى - قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرُونَ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ أَبِي مَسْعُودٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ ‏ حُوسِبَ رَجُلٌ مِمَّنْ كَانَ قَبْلَكُمْ فَلَمْ يُوجَدْ لَهُ مِنَ الْخَيْرِ شَىْءٌ إِلاَّ أَنَّهُ كَانَ يُخَالِطُ النَّاسَ وَكَانَ مُوسِرًا فَكَانَ يَأْمُرُ غِلْمَانَهُ أَنْ يَتَجَاوَزُوا عَنِ الْمُعْسِرِ قَالَ قَالَ اللَّهُ عَزَّ وَجَلَّ نَحْنُ أَحَقُّ بِذَلِكَ مِنْهُ تَجَاوَزُوا عَنْهُ.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11562,
                "hadithNumber": "3998",
                "englishNarrator": "Abu Huraira (رضی اﷲ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: There was a person who gave loans to the people and said to his men: When an insolvent comes to you show him leniency that Allah may overlook our (faults). So when he met Allah, He overlooked his faults (forgave him).",
                "hadithUrdu": "رسول اﷲ ﷺ نے فرمایا ایک شخص لوگوں کو قرض دیا کرتا اور وہ اپنے نوکروں سے کہتا جو مفلس ہو اس کو معاف کردینا شاید اﷲ تعالیٰ اس کے بدلے ہم کو معاف کرے ۔ پھر وہ اﷲ تعالیٰ سے ملا اﷲ نے اس کو بخش دیا ۔ باب : حد لگانے سے گناہ مٹ جاتا ہے ۔",
                "urduNarrator": "ہم سے منصور بن ابی مزاحم اور محمد بن جعفر بن زیاد نے بیان کیا - منصور نے کہا: ہم سے ابراہیم بن سعد نے، الزہری اور ابن ابن کثیر کی سند سے بیان کیا جعفر، ابراہیم، جو ابن سعد ہیں، نے ہمیں ابن شہاب کی سند سے اور عبید اللہ بن عبداللہ بن عتبہ کی سند سے، ابوہریرہ رضی اﷲ عنہ سے روایت ہے",
                "hadithArabic": "حَدَّثَنَا مَنْصُورُ بْنُ أَبِي مُزَاحِمٍ، وَمُحَمَّدُ بْنُ جَعْفَرِ بْنِ زِيَادٍ، - قَالَ مَنْصُورٌ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ الزُّهْرِيِّ، وَقَالَ ابْنُ جَعْفَرٍ، أَخْبَرَنَا إِبْرَاهِيمُ، وَهُوَ ابْنُ سَعْدٍ عَنِ ابْنِ، شِهَابٍ عَنِ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ ‏ كَانَ رَجُلٌ يُدَايِنُ النَّاسَ فَكَانَ يَقُولُ لِفَتَاهُ إِذَا أَتَيْتَ مُعْسِرًا فَتَجَاوَزْ عَنْهُ لَعَلَّ اللَّهَ يَتَجَاوَزُ عَنَّا ‏.‏ فَلَقِيَ اللَّهَ فَتَجَاوَزَ عَنْهُ.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11563,
                "hadithNumber": "3999",
                "englishNarrator": null,
                "hadithEnglish": "Abu Hurairah رضی اللہ عنہ said: \"I heard the Messenger of Allah ﷺ say...: a similar report (as no. 3998).",
                "hadithUrdu": "یونس نے ابن شہاب سے خبر دی کہ انہیں عبیداللہ بن عبداللہ بن عتبہ نے حدیث بیان کی کہ انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے : میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ فرما رہے تھے ۔ ۔ ۔ اسی ( سابقہ حدیث ) کے مانند ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَنَّ عُبَيْدَ اللهِ بْنَ عَبْدِ اللهِ بْنِ عُتْبَةَ، حَدَّثَهُ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 123,
                    "chapterNumber": "23",
                    "chapterEnglish": "The Book Of Musaqah",
                    "chapterUrdu": "سیرابی کے عوض پیدوار میں حصہ داری اور مزارعت",
                    "chapterArabic": "كتاب الْمُسَاقَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 11251,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=450",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=448",
                "label": "448",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=449",
                "label": "449",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=450",
                "label": "450",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=451",
                "label": "451",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=452",
                "label": "452",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=453",
                "label": "453",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=454",
                "label": "454",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=452",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=452",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=450",
        "to": 11275,
        "total": 40465
    }
}