{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 512,
        "data": [
            {
                "id": 13064,
                "hadithNumber": "5501",
                "englishNarrator": "Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade the wrapping of oneself completely leaving no room for the arm and supporting oneself when sitting with a single garment wrapped round one's knees and a person raising one of his feet and placing it on the other while lying on his back.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ہاتھ پاؤں وغیرہ کو بندکردینے والا لباس پہننے ، ایک کپڑے سےکمر اور گھٹنوں کو باندھنے اور چت لیٹ کر ایک پاؤں کو دوسرے کے اوپر ( رکھتے ہوئے اس کو ) اٹھانے سے منع فرمایا ۔",
                "urduNarrator": "ہم سے قتیبہ نے بیان کیا، ہم سے لیث نے بیان کیا اور ہم سے ابن روم نے بیان کیا, لیث نے ابو زبیر سے ، انھوں نے حضرت جابر رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا لَيْثٌ ح و حَدَّثَنَا ابْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ اشْتِمَالِ الصَّمَّاءِ وَالِاحْتِبَاءِ فِي ثَوْبٍ وَاحِدٍ وَأَنْ يَرْفَعَ الرَّجُلُ إِحْدَى رِجْلَيْهِ عَلَى الْأُخْرَى وَهُوَ مُسْتَلْقٍ عَلَى ظَهْرِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13065,
                "hadithNumber": "5502",
                "englishNarrator": "Jabir bin Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Do not walk in one sandal and do not wrap the lower garment round your knees and do not eat with your left hand and do not wrap yourself completely leaving no room for the arms (to draw out) and do not place one of your feet upon the other while lying on your back.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا : \" ایک جوتا پہن کر نہ چلو اور ایک چادر ( ہوتواس ) کو گھٹنے کھڑے کرکے ان کے اور کمر کے گرد نہ باندھو ، بائیں ہاتھ سے نہ کھاؤ ، ہاتھ پاؤں بند کردینے والا کپڑا نہ پہنو اور جب چت لیٹے ہوتو ایک ٹانگ کو دوسری ٹانگ ( کھڑی کر کے اس ) پر نہ رکھو ۔ \"",
                "urduNarrator": "اور ہم سے اسحاق بن ابراہیم اور محمد بن حاتم نے بیان کیا اور ان سے ابن حاتم نے کہا: ہم سے محمد بن بکر نے بیان کیا, ابن جریج نے کہا : مجھے ابو زبیر نے بتایا کہ انھوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے سنا ، وہ حدیث بیان کررہے تھے کہ",
                "hadithArabic": "و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَمُحَمَّدُ بْنُ حَاتِمٍ قَالَ إِسْحَقُ أَخْبَرَنَا وَقَالَ ابْنُ حَاتِمٍ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يُحَدِّثُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَمْشِ فِي نَعْلٍ وَاحِدٍ وَلَا تَحْتَبِ فِي إِزَارٍ وَاحِدٍ وَلَا تَأْكُلْ بِشِمَالِكَ وَلَا تَشْتَمِلْ الصَّمَّاءَ وَلَا تَضَعْ إِحْدَى رِجْلَيْكَ عَلَى الْأُخْرَى إِذَا اسْتَلْقَيْتَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13066,
                "hadithNumber": "5503",
                "englishNarrator": "Jabir bin Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: None of you should lie on his back and place one of his feet upon the other.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا : \" تم میں سے کوئی شخص چٹ لیٹ کر اپنی ٹانگ کودوسری ٹانگ ( کھڑی کرکے اس ) پر نہ رکھے ۔ \"",
                "urduNarrator": "اور مجھ سے اسحاق بن منصور نے بیان کیا، کہا ہم سے روح بن عبادہ نے بیان کیا, عبیداللہ بن اخنس نے ابو زبیر سے ، انھوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنِي إِسْحَقُ بْنُ مَنْصُورٍ أَخْبَرَنَا رَوْحُ بْنُ عُبَادَةَ حَدَّثَنِي عُبَيْدُ اللَّهِ يَعْنِي ابْنَ أَبِي الْأَخْنَسِ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَسْتَلْقِيَنَّ أَحَدُكُمْ ثُمَّ يَضَعُ إِحْدَى رِجْلَيْهِ عَلَى الْأُخْرَى.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13067,
                "hadithNumber": "5504",
                "englishNarrator": "Abbad bin Tamim reported from his uncle:",
                "hadithEnglish": "He saw Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) lying in the mosque and placing his one foot upon the other.",
                "hadithUrdu": "انھوں نے رسول اللہ صلی اللہ علیہ وسلم کو مسجد میں اس حالت میں چت لیٹے ہوئے دیکھا کہ آپ نے ( دونوں ٹانگوں زمین پر بچھائے ہوئے ) ایک پاؤں دوسرے پاؤں پر رکھا ہوا تھا ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا: مالک نے ابن شہاب سے ، انہوں نے عباد بن تمیم سے ، انھوں نے اپنے چچا ( عبداللہ بن زید بن عاصم انصاری رضی اللہ عنہ ) سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ عَبَّادِ بْنِ تَمِيمٍ عَنْ عَمِّهِ أَنَّهُ رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُسْتَلْقِيًا فِي الْمَسْجِدِ وَاضِعًا إِحْدَى رِجْلَيْهِ عَلَى الْأُخْرَى.",
                "headingArabic": "فِي إِبَاحَةِ الاِسْتِلْقَاءِ وَوَضْعِ إِحْدَى الرِّجْلَيْنِ عَلَى الأُخْرَى ‏.‏",
                "headingUrdu": "لیٹنا اور ایک ٹانگ دوسری ٹانگ پر رکھنا جائز ہے۔",
                "headingEnglish": "The Permissibility Of Lying Down And Placing One Leg On Top Of The Other",
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13068,
                "hadithNumber": "5505",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Zuhri with the same chain of transmitter.",
                "hadithUrdu": "ہم سے یحییٰ بن یحییٰ، ابوبکر بن ابی شیبہ، ابن نمیر، زہیر بن حرب اور اسحاق بن ابراہیم نے بیان کیا, ابن عینیہ ، یونس اور معمر سب نے زہری سے اسی سند کے ساتھ اسی کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَابْنُ نُمَيْرٍ وَزُهَيْرُ بْنُ حَرْبٍ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ كُلُّهُمْ عَنْ ابْنِ عُيَيْنَةَ ح و حَدَّثَنِي أَبُو الطَّاهِرِ وَحَرْمَلَةُ قَالَا أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ ح و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَعَبْدُ بْنُ حُمَيْدٍ قَالَا أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ كُلُّهُمْ عَنْ الزُّهْرِيِّ بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13069,
                "hadithNumber": "5506",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle (ﷺ) forbade dyeing (one's cloth or hair) in saffron. Hammad said that it pertains to men only.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے زعفرانی رنگ ( سے رنگے کپڑے پہننے ) سے منع فرمایا ۔ قتیبہ نے کہا کہ حماد نے کہا : یعنی مردوں کو ( منع فرمایا )",
                "urduNarrator": "یحییٰ بن یحییٰ ، ابو ربیع اور قتیبہ بن سعید نے ہمیں حدیث بیان کی ۔ یحییٰ نے کہا : ہمیں خبر دی اور دوسرے دونوں نے کہا : ہمیں حماد بن زید نے عبدالعزیز بن صہیب سے حدیث بیان کی ، انھوں نے حضرت انس بن مالک رضی اللہ عنہ سےروایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو الرَّبِيعِ وَقُتَيْبَةُ بْنُ سَعِيدٍ قَالَ يَحْيَى أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ و قَالَ الْآخَرَانِ حَدَّثَنَا حَمَّادٌ عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ التَّزَعْفُرِ قَالَ قُتَيْبَةُ قَالَ حَمَّادٌ يَعْنِي لِلرِّجَالِ.",
                "headingArabic": "نَهْيِ الرَّجُلِ عَنْ التَّزَعْفُرِ",
                "headingUrdu": "زعفران سے رنگنے والے آدمی کی ممانعت",
                "headingEnglish": "The Prohibition Of A Man Dyeing From With Saffron",
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13070,
                "hadithNumber": "5507",
                "englishNarrator": "Anas رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade that a person should (wear) clothes dyed in saffron.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے مرد کو زعفرانی رنگ ( پہننے ) سے منع فرمایا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، عمرو ناقد، زہیر بن حرب، ابن نمیر اور ابو کریب نے بیان کیا، انہوں نے کہا: اسماعیل بن علیہ نے ہمیں عبدالعزیز بن صہیب سے حدیث بیان کی ، انھوں نے حضرت انس رضی اللہ عنہ سے ر وایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ وَابْنُ نُمَيْرٍ وَأَبُو كُرَيْبٍ قَالُوا حَدَّثَنَا إِسْمَعِيلُ وَهُوَ ابْنُ عُلَيَّةَ عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ عَنْ أَنَسٍ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَتَزَعْفَرَ الرَّجُلُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13071,
                "hadithNumber": "5508",
                "englishNarrator": "Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "When Abu Qubafa رضی اللہ عنہ (father of Abu Bakr) came in the yeu of Victory or on the Day of Victory (to the Prophet to pledge his allegiance to him) his head and his beard were white like hyssop. He (the Holy Prophet ﷺ) commanded or the women were commanded by him that they should change this with something (that the colour of his hair should be changed).",
                "hadithUrdu": "فتح مکہ کے سال یا فتح مکہ کے دن حضرت ابو قحافہ رضی اللہ عنہ کو لایاگیا ، وہ آئے اور ان کے سر اور داڑھی کےبال ثغام یا ثغامہ ( کے سفید پھولوں ) کی طرح تھے ، تو آپ صلی اللہ علیہ وسلم نے ان کے گھر کی عورتوں کوحکم دیا ، یا ان کے بارے میں ( ان کےگھر کی عورتوں کو ) حکم دیا گیا ، فرمایا : \" اس ( سفیدی ) کو کسی چیز ( اور رنگ ) سے بدل د یں ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا, ابوخیثمہ نے ابو زبیر سے ، انھوں نے حضرت جابر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو خَيْثَمَةَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ أُتِيَ بِأَبِي قُحَافَةَ أَوْ جَاءَ عَامَ الْفَتْحِ أَوْ يَوْمَ الْفَتْحِ وَرَأْسُهُ وَلِحْيَتُهُ مِثْلُ الثَّغَامِ أَوْ الثَّغَامَةِ فَأَمَرَ أَوْ فَأُمِرَ بِهِ إِلَى نِسَائِهِ قَالَ غَيِّرُوا هَذَا بِشَيْءٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13072,
                "hadithNumber": "5509",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Abu Quhafa رضی اللہ عنہ was led (to the andience of the Holy Prophet ﷺ) on the day of the Conquest of Mecca and his head and beard were white like hyssop, whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Change it with something but avoid black.",
                "hadithUrdu": "فتح کہ کے دن حضرت ابوقحافہ رضی اللہ عنہ کو لایا گیا ، ان کے سر اورداڑھی کے بال سفیدی میں ثغامہ ( کے سفید پھولوں ) کی طرح تھے تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا: \" اس ( سفیدی ) کو کسی چیز سے تبدیل کردو اور سیاہ رنگ سے اجتناب کرو ۔ \"",
                "urduNarrator": "مجھ سے ابو الطاہر نے بیان کیا، ہم سے عبداللہ بن وہب نے بیان کیا,ابن جریج نے ابو زبیر سے ، انھوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنِي أَبُو الطَّاهِرِ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ عَنْ ابْنِ جُرَيْجٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ أُتِيَ بِأَبِي قُحَافَةَ يَوْمَ فَتْحِ مَكَّةَ وَرَأْسُهُ وَلِحْيَتُهُ كَالثَّغَامَةِ بَيَاضًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَيِّرُوا هَذَا بِشَيْءٍ وَاجْتَنِبُوا السَّوَادَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13073,
                "hadithNumber": "5510",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The Jews and the Christians do not dye (their hair), so oppose them.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے فرمایا : \" یہود اوراور نصاریٰ ( بالوں کو ) رنگ نہیں لگا تے تم ان کی مخالفت کرو ( بالوں کو رنگ لگا ؤ ۔ )",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ، ابوبکر بن ابی شیبہ، عمرو ناقد اور زہیر بن حرب نے بیان کیا اور تلفظ یحییٰ کا ہے کہ ہمیں اطلاع دیں۔ دوسرے نے کہا: ہم سے سفیان بن عیینہ نے زہری کی سند سے، ابوسلمہ اور سلیمان بن یسار کی سند سے بیان کیا, حضرت ابو ہریرۃ رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ وَاللَّفْظُ لِيَحْيَى قَالَ يَحْيَى أَخْبَرَنَا و قَالَ الْآخَرُونَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ وَسُلَيْمَانَ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الْيَهُودَ وَالنَّصَارَى لَا يَصْبُغُونَ فَخَالِفُوهُمْ.",
                "headingArabic": "فِي مُخَالَفَةِ الْيَهُودِ فِي الصَّبْغِ",
                "headingUrdu": "رنگنے کے حوالے سے یہودیوں سے اختلاف",
                "headingEnglish": "Differing From The Jews With Regard To Dyeing",
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13074,
                "hadithNumber": "5511",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "Gabriel ( علیہ السلام) made a promise with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) to come at a definite hour; that hour came but he did not visit him. And there was in his hand (in the hand of Allah's Apostle) a staff. He threw it from his hand and said: Never has Allah or His messengers (angels) ever broken their promise. Then he cast a glance (and by chance) found a puppy under his cot and said: 'A'isha رضی اللہ عنہا , when did this dog enter here? She said: By Allah, I don't know He then commanded and it was turned out. Then Gabriel came and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said to him: You promised me and I waited for you, but you did not come, whereupon he said: It was the dog in your house which prevented me (to come), for we (angels) do not enter a house in which there is a dog or a picture.",
                "hadithUrdu": "جبرئیل علیہ السلام نے رسول اللہ صلی اللہ علیہ وسلم سے وعدہ کیا کہ وہ ایک خاص گھڑی میں ان کے پاس آئیں گے ، چنانچہ وہ گھڑی آگئی لیکن جبرئیل علیہ السلام نہ آئے ۔ ( اس وقت ) آپ کے دست مبارک میں ایک عصاتھا ۔ آپ نے اسے اپنے ہا تھا سے ( نیچے پھینکا اور فرمایا : \" نہ اللہ تعا لیٰ اپنے وعدے کی خلا ف ورزی کرتا ہے نہ رسول ( خلا ف ورزی کرتے ہیں ۔ ) \" جبریل امین علیہ السلام بھی وحی لے کر انبیا ء علیہ السلام کی طرف آنے والے اللہ کے رسول تھے ) پھر آپ نے دھیان دیا تو ایک چار پا ئی کے نیچے کتے \" کا ایک پلا تھا ۔ آپ نے فرما یا : \" عائشہ رضی اللہ عنہا ! یہ کتا یہاں کب گھسا ؟ \" انھوں نے کہا : واللہ !مجھے بالکل پتہ نہیں چلا ۔ آپ نے حکم دیا تو اس ( پلے ) کو نکال دیا گیا ، پھر جبریل علیہ السلام تشریف لے آئے تو رسول اللہ صلی اللہ علیہ وسلم فرما یا : \" آپ نے میرے ساتھ وعدہ کیا تھا میں آپ کی خاطر بیٹھا رہا لیکن آپ نہیں آئے ۔ \" انھوں نے کہا آپ کے گھر میں جو کتا تھا ، مجھے اس نے روک لیا ہم ایسے گھر میں دا خخل نہیں ہو تے جس میں کتا ہو ۔ نہ ( اس میں جہاں تصویر ہو) ۔",
                "urduNarrator": "مجھ سے سوید بن سعید نے بیان کیا, عبد العزیز بن ابی حازم نے اپنے والد سے ، انھوں نے ابو سلمہ بن عبد الرحمٰن سے ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ عَنْ أَبِيهِ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ أَنَّهَا قَالَتْ وَاعَدَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جِبْرِيلُ عَلَيْهِ السَّلَام فِي سَاعَةٍ يَأْتِيهِ فِيهَا فَجَاءَتْ تِلْكَ السَّاعَةُ وَلَمْ يَأْتِهِ وَفِي يَدِهِ عَصًا فَأَلْقَاهَا مِنْ يَدِهِ وَقَالَ مَا يُخْلِفُ اللَّهُ وَعْدَهُ وَلَا رُسُلُهُ ثُمَّ الْتَفَتَ فَإِذَا جِرْوُ كَلْبٍ تَحْتَ سَرِيرِهِ فَقَالَ يَا عَائِشَةُ مَتَى دَخَلَ هَذَا الْكَلْبُ هَاهُنَا فَقَالَتْ وَاللَّهِ مَا دَرَيْتُ فَأَمَرَ بِهِ فَأُخْرِجَ فَجَاءَ جِبْرِيلُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاعَدْتَنِي فَجَلَسْتُ لَكَ فَلَمْ تَأْتِ فَقَالَ مَنَعَنِي الْكَلْبُ الَّذِي كَانَ فِي بَيْتِكَ إِنَّا لَا نَدْخُلُ بَيْتًا فِيهِ كَلْبٌ وَلَا صُورَةٌ.",
                "headingArabic": "تحريم تصوير صورة الحيوان وتحرم اتخاذ ما فيه صورة غير ممتهنة بالفرش ونحوه، وأن الملائكة عليهم السلام لا يدخلون بيتًا فيه صورة أو كلب",
                "headingUrdu": "جانداروں کی تصویریں بنانے کی ممانعت، اور ایسی تصویروں کے استعمال کی ممانعت جو فرنشننگ وغیرہ میں بے عزتی کا شکار نہ ہوں۔ فرشتے اس گھر میں داخل نہ ہوں جس میں تصویر یا کتا ہو۔",
                "headingEnglish": "The Prohibition Of Making Images Of Living Beings, And The Prohibition Of Using Images That Are Not Subjected To Disrespect In Furnishings And The Like; The Angels (Peace Be Upon Them) Do Not Enter A House In Which There Is An Image Or A Dog",
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13075,
                "hadithNumber": "5512",
                "englishNarrator": "This hadith has been narrated on the authority of Abu Hazim with the same chain of transmitters:",
                "hadithEnglish": "Gabriel had promised Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) that he would come; the rest of the hadith is the same, but it is not so lengthy as the other one.",
                "hadithUrdu": "جبرا ئیل علیہ السلام نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ وعدہ کیا کہ وہ آپ کے پاس آئیں گے پھر حدیث بیان کی اور ابو حازم کے بیٹے کی طرح لمبی تفصیل نہیں بتا ئی ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم الحنظَلی نے بیان کیا, ہمیں وہب نے اسی سند کے ساتھ ابو حازم سے حدیث سنا ئی کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ أَخْبَرَنَا الْمَخْزُومِيُّ حَدَّثَنَا وُهَيْبٌ عَنْ أَبِي حَازِمٍ بِهَذَا الْإِسْنَادِ أَنَّ جِبْرِيلَ وَعَدَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَأْتِيَهُ فَذَكَرَ الْحَدِيثَ وَلَمْ يُطَوِّلْهُ كَتَطْوِيلِ ابْنِ أَبِي حَازِمٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13076,
                "hadithNumber": "5513",
                "englishNarrator": "Maimuna رضی اللہ عنہا reported:",
                "hadithEnglish": "One morning Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was silent with grief. Maimuna رضی اللہ عنہا said: Allah's Messenger, I find a change in your mood today. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Gabriel had promised me that he would meet me tonight, but he did not meet me. By Allah, he never broke his promises, and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) spent the day in this sad (mood). Then it occurred to him that there had been a puppy under their cot. He commanded and it was turned out. He then took some water in his hand and sprinkled it at that place. When it was evening Gabriel met him and he said to him: you promised me that you would meet me the previous night. He said: Yes, but we do not enter a house in which there is a dog or a picture. Then on that very morning he commanded the killing of the dogs until he announced that the dog kept for the orchards should also be killed, but he spared the dog meant for the protection of extensive fields (or big gardens).",
                "hadithUrdu": "ایک دن رسول اللہ صلی اللہ علیہ وسلم نے فکر مندی کی حالت میں صبح کی ۔ حضرت میمونہ رضی اللہ عنہا نے کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! میں آج دن ( کے آغاز ) سے آپ کی حالت معمول کے خلا ف دیکھ رہی ہوں ۔ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" جبرائیل علیہ السلام نے مجھ سے وعدہ کیا تھا کہ آج رات مجھ سے ملیں گے لیکن وہ نہیں ملے ۔ بات یہ ہے کہ انھوں نے کبھی مجھ سے وعدہ خلا فی نہیں کی ، \" کہا : تو اس روز پورا دن رسول اللہ صلی اللہ علیہ وسلم کی کیفیت یہی رہی پھر ان کے دل میں کتے کے ایک پلے کا خیال بیٹھ گیا ۔ جو ہمارے ( ایک بستر کے نیچے بن جا نے والے ) ایک خیمہ ( نما حصے ) میں تھا ۔ آپ نے اس کے بارے میں حکم دیا تو اسے نکا ل دیا گیا ، پھر آپ نے اپنے دست مبارک سے پانی لیا اور اس جگہ پر چھڑک دیا ۔ جب شام ہو ئی تو جبرائیل علیہ السلام آ کر آپ سے ملے ۔ آپ صلی اللہ علیہ وسلم نے ان سے کہا : آپ نے مجھ سے وعدہ کیا تھا کہ آپ مجھے کل رات ملیں گے؟انھوں نے کہا ہاں بالکل لیکن ہم ایسے گھر میں ادا خل نہیں ہو تے جس میں کتا یا تصویر ہو ۔ پھر جب صبح ہو ئی تو رسول اللہ صلی اللہ علیہ وسلم نے ( آوارہ یا بے کا ر ) کتوں کو مارنے دینے کا حکم دیا ، یہاں تک کہ آپ باغ یا کھیت کے چھوٹے کتے کو بھی ( جورکھوالی نہیں کر سکتا ) مارنے کا حکم دے رہے تھے اور باغ کھیت کے بڑے کتے کو چھوڑ رہے تھے ۔ ( ایسے کتے گھروں سے باہر ہی رہتے ہیں اور واقعی رکھوالی کی ضرورت پو ری کرتے ہیں )",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، مجھ سے ابن وہب نے بیان کیا، مجھ سے یونس نے بیان کیا، ابن شہاب نے اور ابن سبق نے بیان کیا کہ , عبد اللہ بن عباس رضی اللہ عنہ نے کہا : حضرت میمونہ رضی اللہ عنہا نے مجھے بتا یا کہ",
                "hadithArabic": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ ابْنِ السَّبَّاقِ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ قَالَ أَخْبَرَتْنِي مَيْمُونَةُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَصْبَحَ يَوْمًا وَاجِمًا فَقَالَتْ مَيْمُونَةُ يَا رَسُولَ اللَّهِ لَقَدْ اسْتَنْكَرْتُ هَيْئَتَكَ مُنْذُ الْيَوْمِ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ جِبْرِيلَ كَانَ وَعَدَنِي أَنْ يَلْقَانِي اللَّيْلَةَ فَلَمْ يَلْقَنِي أَمَ وَاللَّهِ مَا أَخْلَفَنِي قَالَ فَظَلَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَهُ ذَلِكَ عَلَى ذَلِكَ ثُمَّ وَقَعَ فِي نَفْسِهِ جِرْوُ كَلْبٍ تَحْتَ فُسْطَاطٍ لَنَا فَأَمَرَ بِهِ فَأُخْرِجَ ثُمَّ أَخَذَ بِيَدِهِ مَاءً فَنَضَحَ مَكَانَهُ فَلَمَّا أَمْسَى لَقِيَهُ جِبْرِيلُ فَقَالَ لَهُ قَدْ كُنْتَ وَعَدْتَنِي أَنْ تَلْقَانِي الْبَارِحَةَ قَالَ أَجَلْ وَلَكِنَّا لَا نَدْخُلُ بَيْتًا فِيهِ كَلْبٌ وَلَا صُورَةٌ فَأَصْبَحَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَئِذٍ فَأَمَرَ بِقَتْلِ الْكِلَابِ حَتَّى إِنَّهُ يَأْمُرُ بِقَتْلِ كَلْبِ الْحَائِطِ الصَّغِيرِ وَيَتْرُكُ كَلْبَ الْحَائِطِ الْكَبِيرِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13077,
                "hadithNumber": "5514",
                "englishNarrator": "Abu Talha رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) having said: Angels do not enter a house in which there is a dog or a picture.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرما یا : \" فرشتے اس گھر میں دا خل نہیں ہو تے جس میں کتا ہو نہ ( اس گھر میں جس میں ) کو ئی تصویر ہو ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ، ابوبکر بن ابی شیبہ، عمرو الناقد نے اور ہم سے اسحاق بن ابراہیم نے بیان کیا اور کہا باقی دو, سفیان بن عیینہ نے زہری سے ، انھوں نے عبید اللہ سے ، انھوں نے ابن عباس رضی اللہ عنہ سے ، انھوں نے حضرت ابو طلحہ رضی اللہ عنہ سے انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ يَحْيَى وَإِسْحَقُ أَخْبَرَنَا و قَالَ الْآخَرَانِ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ عَنْ أَبِي طَلْحَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَدْخُلُ الْمَلَائِكَةُ بَيْتًا فِيهِ كَلْبٌ وَلَا صُورَةٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13078,
                "hadithNumber": "5515",
                "englishNarrator": "Abu Talha رضی اللہ عنہ reported:",
                "hadithEnglish": "I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Angels do not enter the house in which there is a dog or a statue.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ فر ما رہے تھے : \" فرشتے اس گھر میں دا خل نہیں ہو تے جس میں کتا ہو نہ ( اس گھر میں جس میں ) کو ئی تصویر ہو ۔ \"",
                "urduNarrator": "مجھ سے ابو الطاہر اور حرملہ بن یحییٰ نے بیان کیا، کہا کہ ہم سے ابن وہب نے بیان کیا, یو نس نے مجھے ابن شہا ب سے ، خبر دی انھوں نے عبید اللہ بن عبد اللہ بن عتبہ سئے روایت کی کہ انھوں نے حضرت عبد اللہ بن عباس رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے , میں نے حضرت ابو طلحہ رضی اللہ عنہ سے سنا ، آپ فرما رہے تھے",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ وَحَرْمَلَةُ بْنُ يَحْيَى قَالَا أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ يَقُولُ سَمِعْتُ أَبَا طَلْحَةَ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تَدْخُلُ الْمَلَائِكَةُ بَيْتًا فِيهِ كَلْبٌ وَلَا صُورَةٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13079,
                "hadithNumber": "5516",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like that of Yunus (no. 5515) was narrated from Az-zuhri with this chain of narrators.",
                "hadithUrdu": "اور ہم سے اسحاق بن ابراہیم اور عبد بن حمید نے بیان کیا، کہا کہ ہمیں عبد الرزاق نے خبر دی , معمر نے زہری سے اسی سند کے ساتھ یونس کی حدیث کے مانند اور سند میں خبر دینے کی صرا حت کرتے ہو ئے روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَاه إِسْحَقُ بْنُ إِبْرَاهِيمَ وَعَبْدُ بْنُ حُمَيْدٍ قَالَا أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ بِهَذَا الْإِسْنَادِ مِثْلَ حَدِيثِ يُونُسَ وَذِكْرِهِ الْأَخْبَارَ فِي الْإِسْنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13080,
                "hadithNumber": "5517",
                "englishNarrator": "Abu Tilha, the Companion of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) having said: Verily, angels do not enter the house in which there is a picture. Busr reported: Zaid fell ill and we went to inquire after his health and (found) that there was hanging at his door a curtain with a picture on it. I said to 'Ubaidullah Khaulani who had been under the patronage of Maimuna رضی اللہ عنہا , the wife of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ): Did not Zaid himself inform us before about (the Holy Prophet's command pertaining to the pictures), whereupon 'Ubaidullah said: Did you not hear when he said: Except the prints on the cloth ?",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \"\" فرشتے اس گھر میں دا خل نہیں ہو تے جس میں کو ئی تصویر ہو ۔ \"\" بسر نے کہا : پھر اس اس کے بعد حضرت زید بن خالد بیمار ہو گئے ۔ ہم ان کی عیادت کے لیے گئے تو ( دیکھا ) ان کے دروازے پر ایک پردہ تھا جس میں تصویر ( بنی ہو ئی ) تھی میں نے رسول اللہ صلی اللہ علیہ وسلم کی زوجہ حضرت میمونہ رضی اللہ عنہا کے لے پا لک عبید اللہ خولا نی سے کہا : کیا حضرت زید نے پہلےدن ( جب ملا قات ہو ئی تھی ۔ ) ہمیں تصویر ( کی ممانعت ) کے بارے میں خبر ( حدیث ) بیان نہیں کی تھی؟ تو عبید اللہ نے کہا : جب انھوں نے \"\" کپڑے پربنے ہو ئے نقش کے سوا \"\" کے الفاظ کہے تھے تو کیا تم نے نہیں سنے تھے؟",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, لیث نے ہمیں بکیر سے حدیث سنا ئی انھوں نے بسربن سعید سے ، انھوں نے زید بن خالد سے ، انھوں نے رسول اللہ صلی اللہ علیہ وسلم کے صحابی حضرت ابو طلحہ سے روایت کی کہ انھوں نے کہا : بلا شبہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ عَنْ بُكَيْرٍ عَنْ بُسْرِ بْنِ سَعِيدٍ عَنْ زَيْدِ بْنِ خَالِدٍ عَنْ أَبِي طَلْحَةَ صَاحِبِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الْمَلَائِكَةَ لَا تَدْخُلُ بَيْتًا فِيهِ صُورَةٌ قَالَ بُسْرٌ ثُمَّ اشْتَكَى زَيْدٌ بَعْدُ فَعُدْنَاهُ فَإِذَا عَلَى بَابِهِ سِتْرٌ فِيهِ صُورَةٌ قَالَ فَقُلْتُ لِعُبَيْدِ اللَّهِ الْخَوْلَانِيِّ رَبِيبِ مَيْمُونَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَمْ يُخْبِرْنَا زَيْدٌ عَنْ الصُّوَرِ يَوْمَ الْأَوَّلِ فَقَالَ عُبَيْدُ اللَّهِ أَلَمْ تَسْمَعْهُ حِينَ قَالَ إِلَّا رَقْمًا فِي ثَوْبٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13081,
                "hadithNumber": "5518",
                "englishNarrator": "Abu Talha رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Angels do not enter a house in which there is a picture. Busr said: Zaid bin Khalid fell sick and we visited him to inquire after his health. As we were in his house (we saw) a curtain having pictures on it. I said to 'Ubaidullah Khaulani: Did he not narrate to us (the Holy Prophet's command pertaining to pictures)? Thereupon he said: He in fact did that (but he also said): Except the prints upon the cloth. Did you not hear this? I said: No, whereupon He said: He had in fact made a mention of this.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" فرشتے اس گھر میں دا خل نہیں ہو تے جس میں تصویر ہو ۔ بسر نے کہا : پھر حضرت زید بن خالد بیمار ہو گئے ، ہم ان کی عیا دت کے لیے گئے تو ہم نے ان گھر میں ایک پردہ دیکھا جس میں تصویریں تھیں میں نے عبید اللہ خولا نی سے کہا : کیا ( حضرت زید بن خالد نے ) ہمیں تصاویر کے متعلق حدیث بیان نہیں کی تھی ؟ ( عبید اللہ نے ) کہا : انھوں نے ( ساتھ ہی یہ ) کہا تھا : \" سوائے کپڑے کے نقش کے \" کیا آپ نے نہیں سنا تھا \" میں نے کہا : نہیں انھوں نے کہا : کیوں نہیں ! انھوں نے اس کا ذکر کیا تھا ۔",
                "urduNarrator": "ہم سے ابو الطاہر نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا, مجھے عمرو بن حارث نے خبر دی کہ انھیں بکیر بن اشج نے حدیث سنا ئی ، انھیں بسر بن سعید نے حدیث سنائی کہ زید بن خالد جہنی نے انھیں حدیث سنائی اور ( اس وقت ) بسر کے ساتھ عبید اللہ خولا نی تھے ۔ ( کہا ) حضرت ابو طلحہ رضی اللہ عنہ نے انھیں یہ حدیث بیان کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الطَّاهِرِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ أَنَّ بُكَيْرَ بْنَ الْأَشَجِّ حَدَّثَهُ أَنَّ بُسْرَ بْنَ سَعِيدٍ حَدَّثَهُ أَنَّ زَيْدَ بْنَ خَالِدٍ الْجُهَنِيَّ حَدَّثَهُ وَمَعَ بُسْرٍ عُبَيْدُ اللَّهِ الْخَوْلَانِيُّ أَنَّ أَبَا طَلْحَةَ حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَدْخُلُ الْمَلَائِكَةُ بَيْتًا فِيهِ صُورَةٌ قَالَ بُسْرٌ فَمَرِضَ زَيْدُ بْنُ خَالِدٍ فَعُدْنَاهُ فَإِذَا نَحْنُ فِي بَيْتِهِ بِسِتْرٍ فِيهِ تَصَاوِيرُ فَقُلْتُ لِعُبَيْدِ اللَّهِ الْخَوْلَانِيِّ أَلَمْ يُحَدِّثْنَا فِي التَّصَاوِيرِ قَالَ إِنَّهُ قَالَ إِلَّا رَقْمًا فِي ثَوْبٍ أَلَمْ تَسْمَعْهُ قُلْتُ لَا قَالَ بَلَى قَدْ ذَكَرَ ذَلِكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13082,
                "hadithNumber": "5519",
                "englishNarrator": "It was narrated from Zaid bin Khalid Al-Juhni, from Abu Talhah Al-Ansari who said:",
                "hadithEnglish": "\"I heard the Messenger of Allah ﷺ say: 'The angles do not enter a house in which there is a dog or image.'\"",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ فرما رہے تھے \" اس گھر میں فرشتے داخل نہیں ہو تے جس میں کتا ہو ، نہ ( اس میں جہاں ) مجسمے ہوں ۔ \"",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے جریر نے سہیل بن ابی صالح کی سند سے، وہ سعید بن یسار ابی الحباب کی سند سے, بنو نجار کے آزاد کردہ غلا م ابو حباب سعید بن یسار نے حضرت زید بن خالد جہنی سے ، انھوں نے حضرت ابو طلحہ انصاری رضی اللہ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا جَرِيرٌ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ سَعِيدِ بْنِ يَسَارٍ أَبِي الْحُبَابِ مَوْلَى بَنِي النَّجَّارِ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ عَنْ أَبِي طَلْحَةَ الْأَنْصَارِيِّ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تَدْخُلُ الْمَلَائِكَةُ بَيْتًا فِيهِ كَلْبٌ وَلَا تَمَاثِيلُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13083,
                "hadithNumber": "5520",
                "englishNarrator": "Abu Talha Ansari رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Angels do not enter the house in which there is a picture or portraits. I came to 'A'isha رضی اللہ عنہا and said to her: This is a news that I have received that Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had said: Angels do not enter the house in which there is a picture or a dog, (and further added) whether she had heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) making a mention of it. She said: No (I did not hear this myself), but I narrate to you what I saw him doing. I bear testimony to the fact that he (the Holy Prophet ﷺ) set out for an expedition. I took a carpet and screened the door with it. When he (the Holy Prophet ﷺ) came back he saw that carpet and I perceived signs of disapproval on his face. He pulled it until it was torn or it was cut (into pieces) and he said: God has not commanded us to clothe stones and clay. We cut it (the curtain) and prepared two pillow out of it by stuffing them with the fibre of date-palms and he (the Holy Prophet ﷺ) did not find fault with it.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" اس گھر میں فرشتے داخل نہیں ہو تے جس میں کتا ہو ۔ نہ ( اس میں ( جہاں کسی طرح کی تصویر یں ہوں ۔ \" کیا آپ نے بھی رسول اللہ صلی اللہ علیہ وسلم سے یہ بات سنی جو انھوں نے بیان کی ؟ حضرت عائشہ رضی اللہ عنہا نے کہا : نہیں ۔ ( میں نے اس طرح یہ الفاظ نہیں سنے ) لیکن میں تمھیں ہو بتا تی ہو ں جو میں نے آپ صلی اللہ علیہ وسلم کو کرتے ہو ئے دیکھا ۔ میں نے آپ کو دیکھا کہ آپ اپنے غزوے میں تشریف لے گئے تو میں نے نیچے بچھانے کا ایک مو ٹا ساکپڑا لیا اور دروازے پر اس کا پردہ بنادیا جب آپ آئے اور آپ نے وہ کپڑا دیکھا تو میں نے آپ کے چہرہ انور پر ناپسندیدگی کے آثار محسوس کیے ، پھر آپ نے اسے پکڑ کر کھینچا اور اسے پھاڑ دیا اس کے ( دو ٹکرے کر دیے اور فرما یا : اللہ نے ہمیں پتھروں اور مٹی کو کپڑے پہنانے کا حکم نہیں دیا ۔ \" ( حضرت عائشہ رضی اللہ عنہا نے ) کہا : پھر ہم نے اس کپڑے میں سے دو تکیے ( بنانے کے لیے دو ٹکڑے ) کاٹ لیے اور میں نے ان دونوں کے اندر کھجوروں کی چھا ل بھر دی ۔ آپ نے اس کے سبب سے مجھ پر کو ئی اعترا ض نہیں فرمایا.",
                "urduNarrator": "( سعید بن یسار نے ) کہا : ( یہ حدیث سن کر ) میں حضرت عائشہ رضی اللہ عنہا کے پاس گیا اور کہا : انھوں ( ابو طلحہ رضی اللہ عنہ ) نےکہا ہے کہ",
                "hadithArabic": "قَالَ فَأَتَيْتُ عَائِشَةَ فَقُلْتُ إِنَّ هَذَا يُخْبِرُنِي أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَدْخُلُ الْمَلَائِكَةُ بَيْتًا فِيهِ كَلْبٌ وَلَا تَمَاثِيلُ فَهَلْ سَمِعْتِ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَكَرَ ذَلِكَ فَقَالَتْ لَا وَلَكِنْ سَأُحَدِّثُكُمْ مَا رَأَيْتُهُ فَعَلَ رَأَيْتُهُ خَرَجَ فِي غَزَاتِهِ فَأَخَذْتُ نَمَطًا فَسَتَرْتُهُ عَلَى الْبَابِ فَلَمَّا قَدِمَ فَرَأَى النَّمَطَ عَرَفْتُ الْكَرَاهِيَةَ فِي وَجْهِهِ فَجَذَبَهُ حَتَّى هَتَكَهُ أَوْ قَطَعَهُ وَقَالَ إِنَّ اللَّهَ لَمْ يَأْمُرْنَا أَنْ نَكْسُوَ الْحِجَارَةَ وَالطِّينَ قَالَتْ فَقَطَعْنَا مِنْهُ وِسَادَتَيْنِ وَحَشَوْتُهُمَا لِيفًا فَلَمْ يَعِبْ ذَلِكَ عَلَيَّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13084,
                "hadithNumber": "5521",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "We had a curtain with us which had portraits of birds upon it. Whenever a visitor came, he found them in front of him. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to me: Change them, for whenever I enter the room) I see them and it brings to my mind (the pleasures) of worldly life. She said: We had with us a sheet which had silk badges upon it and we used to wear it. This hadith has been transmitted on the authority of Ibn Muthanna but with this addition: 'Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) did not command us to tear that.",
                "hadithUrdu": "ہمارے ہاں ایک پردہ تھا جس میں پرندے کی تصویر تھی ، جب کوئی شخص اندر آتا یہ تصویر اس کےسامنے آجاتی تو رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فرمایا : \" اس پردے کو ہٹا دو کیونکہ میں جب بھی اندر آتا ہوں ۔ اور اس پردے کو دیکھتا ہوں تو دنیا کو یاد کرتا ہوں ۔ \" حضرت عائشہ رضی اللہ عنہا نے کہا : ہمارے پاس ایک چادر تھی ، ہم کہتےتھے کہ اس کے کناروں پر سلا ہوا کپڑا ریشم ہے ، ہم اس چادر کو پہنتے تھے ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا, اسماعیل بن ابراہیم نے داود سے ، انھوں نے عزرہ سے ، انھوں نے حمید بن عبدالرحمن سے ، انھوں نے سعد بن ہشام سے ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ عَنْ دَاوُدَ عَنْ عَزْرَةَ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ سَعْدِ بْنِ هِشَامٍ عَنْ عَائِشَةَ قَالَتْ كَانَ لَنَا سِتْرٌ فِيهِ تِمْثَالُ طَائِرٍ وَكَانَ الدَّاخِلُ إِذَا دَخَلَ اسْتَقْبَلَهُ فَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَوِّلِي هَذَا فَإِنِّي كُلَّمَا دَخَلْتُ فَرَأَيْتُهُ ذَكَرْتُ الدُّنْيَا قَالَتْ وَكَانَتْ لَنَا قَطِيفَةٌ كُنَّا نَقُولُ عَلَمُهَا حَرِيرٌ فَكُنَّا نَلْبَسُهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13085,
                "hadithNumber": "5522",
                "englishNarrator": "Ibn Abi Adiyy and Abdul-A'la narrated it with this chain of narrators (a hadith similar to no. 5421). Ibn Al-Muthanna said: \"And he\" -Meaning 'Abdullah \"Added:",
                "hadithEnglish": "'The Messenger of Allah ﷺ did not tell us to cut it.'\"",
                "hadithUrdu": "تو رسول اللہ صلی اللہ علیہ وسلم نے ہمیں اس چادر کو کاٹنے کا حکم نہیں دیا ۔",
                "urduNarrator": "محمد بن مثنیٰ نے کہا : ہمیں ابن ابی عدی اور عبدالاعلیٰ نے اسی سند کے ساتھ ( داود سے ) حدیث بیان کی ، ابن مثنیٰ نے کہا : اور اس میں انہوں نے ۔ ۔ ۔ ان کی مراد عبدالاعلیٰ سے ہے ۔ یہ اضافہ کیا",
                "hadithArabic": "و حَدَّثَنِيهِ مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ وَعَبْدُ الْأَعْلَى بِهَذَا الْإِسْنَادِ قَالَ ابْنُ الْمُثَنَّى وَزَادَ فِيهِ يُرِيدُ عَبْدَ الْأَعْلَى فَلَمْ يَأْمُرْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَطْعِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13086,
                "hadithNumber": "5523",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came back from the journey and I had screened my door with a curtain having portraits of winged horses upon it. He commanded me and I pulled it away.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ایک سفر سے واپس آئے ، میں نےروئیں دار کپڑا دروازے کا پردہ بنایا ہوا تھا جس پر پروں والے گھوڑوں کی تصویریں تھیں تو آپ نے مجھے ( اتار نے کا ) حکم دیا تو میں نے اس کو اتاردیا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا, ابو اسامہ نے ہشام ( بن عروہ ) سے ، انھوں نے اپنے والد سے ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا أَبُو أُسَامَةَ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ قَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ سَفَرٍ وَقَدْ سَتَّرْتُ عَلَى بَابِي دُرْنُوكًا فِيهِ الْخَيْلُ ذَوَاتُ الْأَجْنِحَةِ فَأَمَرَنِي فَنَزَعْتُهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13087,
                "hadithNumber": "5524",
                "englishNarrator": null,
                "hadithEnglish": "Waki narrated it with this chain of narrator (a similar hadith to no. 5523), nd in the Hadith of Abdah it does not say: He came from a journey.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, عبدہ اور وکیع نے اسی سند کے ساتھ ہمیں ( ہشام بن عروہ سے ) حدیث بیان کی ، عبدہ کی حدیث میں \" آپ صلی اللہ علیہ وسلم سفر سے آئے \" کے الفاظ نہیں ہیں ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدَةُ ح و حَدَّثَنَاه أَبُو كُرَيْبٍ حَدَّثَنَا وَكِيعٌ بِهَذَا الْإِسْنَادِ وَلَيْسَ فِي حَدِيثِ عَبْدَةَ قَدِمَ مِنْ سَفَرٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13088,
                "hadithNumber": "5525",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) entered (my apartment) and I had hung (on the door of my apartment) a thin curtain having pictures on it. The colour of his face underwent a change. He then took hold of that curtain and tore it and then said: The most grievous torfnent for the people on the Day of Resurrection would be for those who try to imitate Allah in the act of creation.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم میرے ہاں تشریف لائے اور میں نے ایک موٹے سے کپڑے کا پردہ لٹکایا ہوا تھا ، اس پر تصویر تھی تو آپ کے چہرہ انور کا رنگ بدل گیا ۔ پھر آپ نے پردہ کو پکڑا اور پھاڑ دیا ، پھر فرمایا؛ \" قیامت کے دن شدید ترین عذاب میں پڑے ہوئے لوگوں میں سے وہ ( بھی ) ہوں گے جو اللہ تعالیٰ کی پیدا کی ہوئی ( جاندار ) اشیاء کے جیسی ( مشابہ ) بنانے کی کوشش کرتے ہیں ۔ \"",
                "urduNarrator": "ہم سے منصور بن ابی مزاحم نے بیان کیا, ابراہیم بن سعد نے زہری سے ، انہوں نے قاسم بن محمد سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا مَنْصُورُ بْنُ أَبِي مُزَاحِمٍ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ الزُّهْرِيِّ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَائِشَةَ قَالَتْ دَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا مُتَسَتِّرَةٌ بِقِرَامٍ فِيهِ صُورَةٌ فَتَلَوَّنَ وَجْهُهُ ثُمَّ تَنَاوَلَ السِّتْرَ فَهَتَكَهُ ثُمَّ قَالَ إِنَّ مِنْ أَشَدِّ النَّاسِ عَذَابًا يَوْمَ الْقِيَامَةِ الَّذِينَ يُشَبِّهُونَ بِخَلْقِ اللَّهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 12776,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=511",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=509",
                "label": "509",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=510",
                "label": "510",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=511",
                "label": "511",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=512",
                "label": "512",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=513",
                "label": "513",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=514",
                "label": "514",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=515",
                "label": "515",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=513",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=513",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=511",
        "to": 12800,
        "total": 40465
    }
}