{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 323,
        "data": [
            {
                "id": 8339,
                "hadithNumber": "775",
                "englishNarrator": "Sa'id al-Khudri narrated it from his father:",
                "hadithEnglish": "I went to Quba' with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) on Monday till we reached (the habitation) of Banu Salim. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) stood at the door of 'Itban and called him loudly. So he came out dragging his lower garnment. Upon this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: We have made this man to make haste 'Itban said: Messenger of Allah, if a man parts with his wife suddenly without seminal emission, what is he required to do (with regard to bath)? The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: It is with the seminal emission that bath becomes obligatory.",
                "hadithUrdu": "میں سوموار کے دن رسول اللہ ﷺ کےساتھ قباء گیا ، جب ہم بنو سالم کے محلے میں پہنچے تو رسول اللہ ﷺ عتبان ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے دروازے پر رک گئے اور اسے آواز دی تو وہ اپنا تہبند گھسیٹتےہوئے نکلے ۔ رسول اللہ ﷺ نے فرمایا : ’’ہم نے اس آدمی کو جلدی میں ڈال دیا ۔ ‘ ‘ عتبان ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : اے اللہ کے رسول ! آپ کی اس مرد کے بارے میں کیا رائے ہے جو بیوی سے جلدی ہٹا دیا جائے ، حالانکہ اس نے منی خارج نہ کی تو اسے کیا کرنا چاہیے ؟ رسول اللہ ﷺ نے فرمایا : ’’پانی ، صرف پانی سے ہے ۔ ‘ ‘",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ، یحییٰ بن ایوب، قتیبہ اور ابن حجر نے بیان کیا، کہا: ہم سے یحییٰ بن یحییٰ نے بیان کیا، اور دوسروں نے کہا، انہوں نے بیان کیا کہ ہمارے پاس اسماعیل ہے اور وہ ابن جعفر رضی اللہ عنہ ہیں۔ یعنی ابن ابی نمر,عبد الرحمن بن ابی سعید خدری نے اپنے والد سے روایت کی ، انہوں نےکہا کہ",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَيَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ حُجْرٍ، - قَالَ يَحْيَى بْنُ يَحْيَى: أَخْبَرَنَا، وَقَالَ الْآخَرُونَ - حَدَّثَنَا إِسْمَاعِيلُ وَهُوَ ابْنُ جَعْفَرٍ، عَنْ شَرِيكٍ يَعْنِي ابْنَ أَبِي نَمِرٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنْ أَبِيهِ، قَالَ خَرَجْتُ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الِاثْنَيْنِ إِلَى قُبَاءَ حَتَّى إِذَا كُنَّا فِي بَنِي سَالِمٍ. وَقَفَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى بَابِ عِتْبَانَ فَصَرَخَ بِهِ، فَخَرَجَ يَجُرُّ إِزَارَهُ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَعْجَلْنَا الرَّجُلَ» فَقَالَ عِتْبَانُ: يَا رَسُولَ اللهِ، أَرَأَيْتَ الرَّجُلَ يُعْجَلُ عَنِ امْرَأَتِهِ وَلَمْ يُمْنِ، مَاذَا عَلَيْهِ؟ قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّمَا الْمَاءُ مِنَ الْمَاءِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8340,
                "hadithNumber": "776",
                "englishNarrator": "Abu Sa'id al-Khudri رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) observed: Bathing is obligatory in case of seminal emission.",
                "hadithUrdu": "آپ نے فرمایا : ’’پانی ، بس پانی سے ہے",
                "urduNarrator": "ہم سے ہارون بن سعید العیلی نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، کہا کہ مجھ سے عمرو بن حارث نے بیان کیا، وہ ابن شہاب کی سند سے,ابو سلمہ بن عبد الرحمان نے حضرت ابو سعید خدری ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے حدیث بیان کی ، انہوں نے نبی کریم ﷺ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنِ ابْنِ شِهَابٍ، حَدَّثَهُ أَنَّ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ، حَدَّثَهُ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: «إِنَّمَا الْمَاءُ مِنَ الْمَاءِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8341,
                "hadithNumber": "777",
                "englishNarrator": "Abu al. 'Ala' bin al-Shikhkhir رضی ‌اللہ ‌عنہ ‌said:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) abrogated some of his commands by others, just as the Qur'an abrogates some part with the other.",
                "hadithUrdu": "رسول اللہ ﷺ کی ایک حدیث دوسری کو منسوخ کر دیتی ہے ، جیسے قرآن کی ایک آیت دوسری آیت کو منسوخ کر دیتی ہے ۔ ( یعنی اس مفہوم کی احادیث ، آپ ہی کے اس فرمان کے ذریعے سے منسوخ ہو چکی ہیں جو بعد میں آئے گا ۔ )",
                "urduNarrator": "ہم سے عبید اللہ بن معاذ الانباری نے بیان کیا، کہا ہم سے المعتمر نے بیان کیا، ہم سے میرے والد نے بیان کیا,ابو علاء بن شخیر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے ، کہا کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا الْمُعْتَمِرُ، حَدَّثَنَا أَبِي، حَدَّثَنَا أَبُو الْعَلَاءِ بْنُ الشِّخِّيرِ، قَالَ: «كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَنْسَخُ حَدِيثُهُ بَعْضُهُ بَعْضًا، كَمَا يَنْسَخُ الْقُرْآنُ بَعْضُهُ بَعْضًا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8342,
                "hadithNumber": "778",
                "englishNarrator": "Abu Sa'id al-Khudri رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) happened to pass by (the house) of a man amongst the Ansar, and he sent for him. He came out and water was trickling down from his head. Upon this he (the Holy Prophet) said: Perhaps we put you to haste. He said: Yes. Messenger of Allah. He (the Holy Prophet) said: When you made haste or semen is not emitted, bathing is not obligatory for you, but ablution is binding. Ibn Bashshir has narrated it with a minor alteration.",
                "hadithUrdu": "رسول اللہ ﷺ ایک انصاری آدمی کے ( مکان کے ) پاس اسے گزرے تو سے بلوایا ، وہ اس حال میں نکلا کہ اس کے سر سے پانی ٹپک رہا تھا تو آپ نے فرمایا : ’’ شاید ہم نے تمہیں جلدی میں ڈالا ۔ ‘ ‘ اس نے کہا : جی ہاں ، اے اللہ کے رسول ! آپ نے فرمایا : ’’ جب تمہیں جلدی میں ڈال دیا جائے یا تم انزال نہ کر سکو تو تم پر غسل لازم نہیں ہے ، البتہ وضو ضروری ہے ۔ ‘ ‘ ابن بشار نے کہا : جب تمہیں جلدی میں ڈال دیا جائے یا تجھے ( انزال سے ) روک دیا جائے ۔",
                "urduNarrator": "ابوبکر بن ابی شیبہ ، محمد بن مثنی اور ابن بشار نےمحمد بن جعفر غندر سے ، انہوں نے شعبہ سے ، انہوں نے حکم کے حوالے سے ذکوان سے اور انہوں نے حضرت ابوسعید خدری ‌رضی ‌اللہ ‌عنہ ‌ ‌ سےروایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا غُنْدَرٌ، عَنْ شُعْبَةَ، ح، وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ ذَكْوَانَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مَرَّ عَلَى رَجُلٍ مِنَ الْأَنْصَارِ. فَأَرْسَلَ إِلَيْهِ. فَخَرَجَ وَرَأْسُهُ يَقْطُرُ، فَقَالَ: «لَعَلَّنَا أَعْجَلْنَاكَ؟» قَالَ: نَعَمْ يَا رَسُولَ اللهِ، قَالَ: «إِذَا أُعْجِلْتَ أَوْ أَقْحَطْتَ فَلَا غُسْلَ عَلَيْكَ، وَعَلَيْكَ الْوُضُوءُ» وَقَالَ ابْنُ بَشَّارٍ: إِذَا أُعْجِلْتَ، أَوْ أُقْحِطْتَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8343,
                "hadithNumber": "779",
                "englishNarrator": "Ubayy Ibn Ka'b reported:",
                "hadithEnglish": "I arked the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) about a man who has sexual intercourse with his wife, but leaves her before orgasm. Upon this he (the Holy Prophet) said: He should wash the secretion of his wife, and then perform ablution and ofier prayer.",
                "hadithUrdu": "میں رسول اللہ ﷺ سے اس مرد کے بارے میں پوچھا جو اپنی بیوی کے پاس جاتا ہے ، پھر اسے انزال نہیں ہوتا ۔ تو آپ نے فرمایا : ’’ بیوی سے اسے جو کچھ لگ جائے اس کو دھو ڈالے ، پھر وضو کر کے نماز پڑھ لے ۔ ‘ ‘",
                "urduNarrator": "ہم سے ابو الربیع الزہرانی نے بیان کیا,حماد اور ابو معاویہ نےہشام بن عروہ سے ، انہوں نے اپنےوالد سے ، انہوں نے ابو ایوب سے ، انہوں نے حضرت ابی بن کعب ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ ح، وَحَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ، - وَاللَّفْظُ لَهُ -، حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ أَبِي أَيُّوبَ، عَنْ أُبَيِّ بْنِ كَعْبٍ، قَالَ: سَأَلْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ الرَّجُلِ يُصِيبُ مِنَ الْمَرْأَةِ ثُمَّ يُكْسِلُ؟ فَقَالَ: «يَغْسِلُ مَا أَصَابَهُ مِنَ الْمَرْأَةِ ثُمَّ يَتَوَضَّأُ، وَيُصَلِّي».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8344,
                "hadithNumber": "780",
                "englishNarrator": "Ubayy ibn Ka'b ‌رضی ‌اللہ ‌عنہ ‌narrated it from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ):",
                "hadithEnglish": "He said: If a person has sexual intercourse with his wife, but does not experience orgasm, he should wash his organ and perform an ablution.",
                "hadithUrdu": "آپ نے اس مرد کے بارے میں جواپنی بیوی کے پاس جاتا ہے پھر اسے انزال نہیں ہوتا ، فرمایا : ’’ وہ اپنے عضو کو دھو لے اور وضو کرے ۔ ‘ ‘",
                "urduNarrator": "ہم سے محمد بن المثنیٰ نے بیان کیا، ہم سے محمد بن جعفر نے بیان کیا,شعبہ نے ہشام بن عروہ سے باقی ماندہ سابقہ سند کےساتھ حضرت ابی بن کعب ‌رضی ‌اللہ ‌عنہ ‌ ‌ سےروایت کی ، انہوں نے رسول اللہ ﷺسے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مَحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، حَدَّثَنِي أَبِي، عَنْ - الْمَلِيِّ عَنِ الْمَلِيِّ يَعْنِي بِقَوْلِهِ الْمَلِيِّ عَنِ الْمَلِيِّ - أَبُو أَيُّوبَ، عَنْ أُبَيِّ بْنِ كَعْبٍ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: فِي الرَّجُلِ يَأْتِي أَهْلَهُ ثُمَّ لَا يُنْزِلُ قَالَ: «يَغْسِلُ ذَكَرَهُ، وَيَتَوَضَّأُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8345,
                "hadithNumber": "781",
                "englishNarrator": "Zaid bin Khalid al-Jubani رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "He askad Uthman bin 'Affan رضی ‌اللہ ‌عنہ ‌: What is your opinion about the man who has sexual intercourse with his wife, but does not experience orgasm? Uthman said: He should perform ablution as he does for prayer, and wash his organ. 'Uthmin also said: I have heard it from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ).",
                "hadithUrdu": "انہوں نے حضرت عثمان بن عفان ‌رضی ‌اللہ ‌عنہ ‌ ‌ سےپوچھا : آپ کی کیا رائے ہے ، جب کسی مرد نے اپنی بیوی سے مجامعت کی اور اس نے منی خارج نہ کی ؟ حضرت عثمان ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ( جواب میں ) کہا : نماز کے وضو کی طرح وضو کرے اور اپنےعضو کو دھولے ۔ حضرت عثمان ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : میں نے یہ بات رسول اللہ ﷺ سے سنی ۔",
                "urduNarrator": "ہم سے زہیر بن حرب اور عبد بن حمید نے بیان کیا، کہا ہم سے عبد الصمد بن عبد الوارث نے بیان کیا، اور ہم سے عبد الوارث بن عبد الصمد نے اور ہم سے اللہ تعالیٰ نے اپنا کلام بیان کیا، مجھ سے میرے والد نے بیان کیا۔ میرے دادا، الحسین بن ذکوان کی سند سے، یحییٰ بن ابی کثیر کی سند پر،ابو سلمہ نے عطاء بن یسار سے خبر دی کہ انہیں حضرت زید بن خالد جہنی ‌رضی ‌اللہ ‌عنہ ‌ ‌ نےبیان کیا کہ",
                "hadithArabic": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَعَبْدُ بْنُ حُمَيْدٍ قَالَا: حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ ح، وَحَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ عَبْدِ الصَّمَدِ - وَاللَّفْظُ لَهُ - حَدَّثَنِي أَبِي، عَنْ جَدِّي، عَنِ الْحُسَيْنِ بْنِ ذَكْوَانَ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، أَخْبَرَنِي أَبُو سَلَمَةَ، أَنَّ عَطَاءَ بْنَ يَسَارٍ، أَخْبَرَهُ أَنَّ زَيْدَ بْنَ خَالِدٍ الْجُهَنِيَّ، أَخْبَرَهُ أَنَّهُ سَأَلَ عُثْمَانَ بْنَ عَفَّانَ، قَالَ: قُلْتُ: أَرَأَيْتَ إِذَا جَامَعَ الرَّجُلُ امْرَأَتَهُ، وَلَمْ يُمْنِ؟ قَالَ عُثْمَانُ: «يَتَوَضَّأُ كَمَا يَتَوَضَّأُ لِلصَّلَاةِ، وَيَغْسِلُ ذَكَرَهُ» قَالَ عُثْمَانُ سَمِعْتُهُ مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8346,
                "hadithNumber": "782",
                "englishNarrator": "Abu Ayyub رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "He had heard like this from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ).",
                "hadithUrdu": "انہوں نے یہ بات رسول اللہ ﷺ سے سنی تھی ۔",
                "urduNarrator": "ہم سے عبد الوارث بن عبد الصمد نے بیان کیا، مجھ سے میرے والد نے بیان کیا، میرے دادا نے، حسین رضی اللہ عنہ سے، یحییٰ نے کہا,ابوسلمہ نے عطاء بن یسار کےبجائے عروہ بن زبیر سے اور انہوں نےابو ایوب ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے خبر دی کہ",
                "hadithArabic": "وَحَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ عَبْدِ الصَّمَدِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، عَنِ الْحُسَيْنِ، قَالَ يَحْيَى: وَأَخْبَرَنِي أَبُو سَلَمَةَ، أَنَّ عُرْوَةَ بْنَ الزُّبَيْرِ، أَخْبَرَهُ أَنَّ أَبَا أَيُّوبَ، أَخْبَرَهُ أَنَّهُ سَمِعَ ذَلِكَ مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8347,
                "hadithNumber": "783",
                "englishNarrator": "Abu Huraira رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: When a man has sexual intercourse, bathing becomes obligatory (both for the male and the female). In the hadith of Matar the words are: Even if there is no orgasm. Zuhair has narrated it with a minor alteration of words.",
                "hadithUrdu": "اللہ کے نبیﷺ نے فرمایا : ’’ جب وہ ( مرد ) اس ( عورت ) کی چا شاخوں کے درمیان بیٹھے ، پھر اس سے مجامعت کرے تو اس پر غسل واجب ہو جاتا ہے ۔ ‘ ‘ مطر کی حدیث میں یہ اضافہ ہے : ’’اگرچہ انزال نہ ہو ۔ ‘ ‘ اور امام مسلم کے اساتذہ میں سے ( صرف ) زہیر نے شعبہا کی جگہ أشعبها کہا ۔ ( دونوں ایک ہی لفظ شعبہ ( شاخ ) کی جمع ہیں ۔ )",
                "urduNarrator": "زہیر بن حرب ، ابو غسان مسمعی ، محمد بن مثنیٰ اور ابن بشار نے کہا : ہم سے معاذ بن ہشام نے حدیث بیان کی ، انہوں نے اپنے والد سے ، انہوں نے قتادہ اور مطر نے حسن سے ، انہوں نے ابو رافع سے ، انہوں نے حضرت ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَأَبُو غَسَّانَ الْمِسْمَعِيُّ، ح، وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ قَالُوا: حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ: حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، وَمَطَرٌ، عَنِ الْحَسَنِ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ نَبِيَّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا جَلَسَ بَيْنَ شُعَبِهَا الْأَرْبَعِ ثُمَّ جَهَدَهَا، فَقَدْ وَجَبَ عَلَيْهِ الْغُسْلُ» وَفِي حَدِيثِ مَطَرٍ وَإِنْ لَمْ يُنْزِلْ قَالَ زُهَيْرٌ: مِنْ بَيْنِهِمْ بَيْنَ أَشْعُبِهَا الْأَرْبَعِ.",
                "headingArabic": "نَسْخِ ‏\"‏ الْمَاءُ مِنَ الْمَاءِ ‏\"‏ ‏وَوُجُوبِ الْغُسْلِ بِالْتِقَاءِ الْخِتَانَيْنِ ‏",
                "headingUrdu": "\"پانی پانی کے لیے ہے\" کی منسوخی، اور یہ کہ جب ختنہ کے دونوں حصے مل جائیں تو غسل واجب ہے۔",
                "headingEnglish": "Abrogation of “water is for water”, and that it is obligatory to perform ghusl when the two circumcised parts meet",
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8348,
                "hadithNumber": "784",
                "englishNarrator": null,
                "hadithEnglish": "This hadith is narrated by Qatida with the same chain of transmitters, but with minor alterations. Here instead of the word - (jahada, (ijtahada) has been used, and the words; Even if there is no orgasm have been omitted.",
                "hadithUrdu": "ہم سے محمد بن عمرو بن عباد بن جبلہ نے بیان کیا، ہم سے محمد بن ابی عدی، ح، نے بیان کیا، ہم سے محمد بن المثنیٰ نے بیان کیا، مجھ سے وہب بن جریر نے بیان کیا،شعبہ نے قتادہ سے باقی ماندہ اسی سند سے روایت کی ۔ فرق یہ ہے کہ شعبہ کی اس روایت میں ثم جهدها کی جگہ ثم اجتهد ( پھر سعی کی ) ہےت اور و إن لم ينزل ( اگرچہ انزال نہ ہو ) کے الفاظ نہیں ہیں ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرِو بْنِ عَبَّادِ بْنِ جَبَلَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عَدِيٍّ، ح، وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنِي وَهْبُ بْنُ جَرِيرٍ، كِلَاهُمَا عَنْ شُعْبَةَ، عَنْ قَتَادَةَ بِهَذَا الْإِسْنَادِ مِثْلَهُ، غَيْرَ أَنَّ فِي حَدِيثِ شُعْبَةَ ثُمَّ اجْتَهَدَ وَلَمْ يَقُلْ «وَإِنْ لَمْ يُنْزِلْ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8349,
                "hadithNumber": "785",
                "englishNarrator": "Abu Musa رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "There cropped up a difference of opinion between a group of Muhajirs (Emigrants and a group of Ansar (Helpers) (and the point of dispute was) that the Ansar said: The bath (because of sexual intercourse) becomes obligatory only-when the semen spurts out or ejaculates. But the Muhajirs said: When a man has sexual intercourse (with the woman), a bath becomes obligatory (no matter whether or not there is seminal emission or ejaculation). Abu Musa ‌رضی ‌اللہ ‌عنہ ‌said: Well, I satisfy you on this (issue). He (Abu Musa, the narrator) said: I got up (and went) to 'A'isha and sought her permission and it was granted, and I said to her: Mother, or Mother of the Faithful, I want to ask you about a matter on which I feel shy. She said: Don't feel shy of asking me about a thing which you can ask your mother, who gave you birth, for I am too your mother. Upon this I said: What makes a bath obligatory for a person? She replied: You have come across one well informed! The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: When anyone sits amidst four parts (of the woman) and the circumcised parts touch each other a bath becomes obligatory.",
                "hadithUrdu": "اس مسئلے میں مہاجرین اور انصار کے ایک گروہ نے اختلاف کیا ۔ انصار نے کہا : غسل صرف ( منی کے ) زور سے نکلنے یا پانی ( کے انزال ) سے فرض ہوتا ہے او رمہاجرین نے کہا : بلکہ جب اختلاط ہو تو غسل واجب ہو جاتا ہے ۔ ( ابو بردہ نے ) کہا : حضرت ابو موسیٰ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : میں تمہیں اس مسئلے سے چھٹکارا دلاتا ہوں ، میں اٹھا اور حضرت عائشہؓ کی خدمت میں حاضری کی اجازت طلب کی ، مجھے اجازت دے دی گئی تو میں نے کہا : میری ماں ، یا کہا : ام المؤمنین! میں آپ سے ایک چیز کے بارے میں پوچھنا چاہتا ھوں او رمجھے آپ سے شرم ( بھی ) آر ہی ہے ۔ تو انہوں نے کہا : جو بات تم اپنی اس ماں سے جس نے ( اپنے پیٹ سے ) تمہیں جنم دیا ، پوچھ سکتے تھے ، وہ مجھ سے پوچھناے میں شرم نہ کرو کیونکہ میں بھی تمہاری ماں ہوں ۔ میں نے کہا : تو کون سا ( کام ) غسل کو واجب کرتا ہے؟ انہوں نے کہا : تم ( اس مسئلے کے متعلق ) اس سے ملے ہو جو ( اس سے ) اچھی طرح باخبر ہے ۔ رسول اللہﷺ نے فرمایا : ’’جب وہ ( مرد ) اس ( عورت ) کی چا رشاخوں کے درمیان بیٹھا اور ختنے کی جگہ ختنے کی جگہ سے مَس ہوئی تو غسل واجب ہو گیا ۔ ‘ ‘",
                "urduNarrator": "ہم سے محمد بن المثنیٰ نے بیان کیا، ہم سے محمد بن عبداللہ الانصاری نے بیان کیا، ہم سے ہشام بن حسن نے بیان کیا، ہم سے حمید بن ہلال نے بیان کیا،دو مختلف سندوں کے ساتھ ابو بردہ کے حوالے سے ( ان کے والد ) حضرت ابو موسیٰ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ عِبْدِ اللهِ الْأَنْصَارِيُّ، حَدَّثَنَا هِشَامُ بْنُ حَسَّانَ، حَدَّثَنَا حُمَيْدُ بْنُ هِلَالٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ ح، وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْأَعْلَى، وَهَذَا حَدِيثُهُ حَدَّثَنَا هِشَامٌ، عَنْ حُمَيْدِ بْنِ هِلَالٍ، قَالَ: - وَلَا أَعْلَمُهُ إِلَّا عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ: اخْتَلَفَ فِي ذَلِكَ رَهْطٌ مِنَ الْمُهَاجِرِينَ، وَالْأَنْصَارِ فَقَالَ الْأَنْصَارِيُّونَ: لَا يَجِبُ الْغُسْلُ إِلَّا مِنَ الدَّفْقِ أَوْ مِنَ الْمَاءِ. وَقَالَ الْمُهَاجِرُونَ: بَلْ إِذَا خَالَطَ فَقَدْ وَجَبَ الْغُسْلُ، قَالَ: قَالَ أَبُو مُوسَى: فَأَنَا أَشْفِيكُمْ مِنْ ذَلِكَ فَقُمْتُ فَاسْتَأْذَنْتُ عَلَى عَائِشَةَ فَأُذِنَ لِي، فَقُلْتُ لَهَا: يَا أُمَّاهْ - أَوْ يَا أُمَّ الْمُؤْمِنِينَ - إِنِّي أُرِيدُ أَنْ أَسْأَلَكِ عَنْ شَيْءٍ وَإِنِّي أَسْتَحْيِيكِ، فَقَالَتْ: لَا تَسْتَحْيِي أَنْ تَسْأَلَنِي عَمَّا كُنْتَ سَائِلًا عَنْهُ أُمَّكَ الَّتِي وَلَدَتْكَ، فَإِنَّمَا أَنَا أُمُّكَ، قُلْتُ: فَمَا يُوجِبُ الْغُسْلَ؟ قَالَتْ عَلَى الْخَبِيرِ سَقَطْتَ، قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا جَلَسَ بَيْنَ شُعَبِهَا الْأَرْبَعِ وَمَسَّ الْخِتَانُ الْخِتَانَ فَقَدْ وَجَبَ الْغُسْلُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8350,
                "hadithNumber": "786",
                "englishNarrator": "A'isha the wife of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) reported:",
                "hadithEnglish": "A person asked the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) about one who has sexual intercourse with his wife and parts away (without orgasm) whether bathing is obligatory for him. 'A'isha was sitting by him. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: I and she (the Mother of the Faithful) do it and then take a bath.",
                "hadithUrdu": "ایک آدمی رسول اللہﷺ سے ایسے مرد کے بارے میں پوچھا جو اپنی اپنی بیوی سے صحبت کرتا ہے ، پھر انزال نہیں ہوتا ، کیا ان ( دونوں ) پر غسل ہے؟ اور ( اندر ) حضرت عائشہؓ بھی بیٹھی ہوئی تھیں تو رسول اللہﷺ نے فرمایا : ’’میں اور یہ ( ہم دونوں میاں بیوی ) یہ کرتے ہیں ، پھر ہم ( دونوں ) نہاتے ہیں ۔ ‘ ‘",
                "urduNarrator": "ہم سے ہارون بن معروف اور ہارون بن سعید الایلی نے بیان کیا، کہا کہ ہم سے ابن وہب نے بیان کیا، کہا کہ مجھ سے عیاض بن عبداللہ نے بیان کیا، وہ ابو الزبیر سے، انہوں نے جابر بن عبداللہ کی سند سے,ام کلثوم نے نبیﷺ کی زوجہ حضرت عائشہؓ سے روایت کی ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، وَهَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ، قَالَا: حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عِيَاضُ بْنُ عَبْدِ اللهِ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، عَنْ أُمِّ كُلْثُومٍ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَتْ: إِنَّ رَجُلًا سَأَلَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ الرَّجُلِ يُجَامِعُ أَهْلَهُ ثُمَّ يُكْسِلُ هَلْ عَلَيْهِمَا الْغُسْلُ؟ وَعَائِشَةُ جَالِسَةٌ. فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنِّي لَأَفْعَلُ ذَلِكَ، أَنَا وَهَذِهِ، ثُمَّ نَغْتَسِلُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8351,
                "hadithNumber": "787",
                "englishNarrator": "Zaid bin Thabit رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "I heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) say this: Ablution is obligatory (for one who takes anything) touched by fire.",
                "hadithUrdu": "میں نے رسول اللہﷺ کو فرماتے ہوئے سنا : ایسی چیز ( کے کھانے ) س وضو ( لازم ہو جاتا ) ہے جسے آگ نے چھوا ہو ۔ ‘ ‘",
                "urduNarrator": "ہم سے عبدالملک بن شعیب بن لیث نے بیان کیا، انہوں نے کہا: مجھ سے میرے والد نے بیان کیا، میرے دادا عقیل بن خالد نے بیان کیا، انہوں نے کہا کہ ابن شہاب نے کہا: انہوں نے مجھے مالک بن ابی بکر بن عبد اللہ رضی اللہ عنہ نے بیان کیا۔ رحمن بن الحارث بن ہشام چاہتے تھے کہ خارجہ بن زید الانصاری انہیں بتائیں کہ ان کے والد زید بن ثابت نے کہا کہ",
                "hadithArabic": "وَحَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، قَالَ: حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي عُقَيْلُ بْنُ خَالِدٍ، قَالَ: قَالَ ابْنُ شِهَابٍ: أَخْبَرَنِي عَبْدُ الْمَلِكِ بْنُ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، أَنَّ خَارِجَةَ بْنَ زَيْدٍ الْأَنْصَارِيَّ، أَخْبَرَهُ أَنَّ أَبَاهُ زَيْدَ بْنَ ثَابِتٍ قَالَ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «الْوُضُوءُ مِمَّا مَسَّتِ النَّارُ».",
                "headingArabic": "الْوُضُوءِ مِمَّا مَسَّتِ النَّارُ ‏",
                "headingUrdu": "آگ لگنے والی چیز کھانے کے بعد وضو کرنا",
                "headingEnglish": "Performing wudu’ after eating something that has been touched by fire",
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8352,
                "hadithNumber": "788",
                "englishNarrator": "Abdullah bin Ibrahim bin Qariz reported:",
                "hadithEnglish": "He found Abu Huraira ‌رضی ‌اللہ ‌عنہ ‌performing ablution in the mosque, who said: I am performing ablution because of having eaten pieces of cheese, for I heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) say: Perform ablution (after eating anything) touched by fire.",
                "hadithUrdu": "انہوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو مسجد میں وضو کرتے ہوئے پایا تو ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : میں تو پنیر کے ٹکڑوں کی بنا پر وضو کر رہا ہوں جنہیں میں نے کھایا ہے کیونکہ میں نے رسول اللہﷺ کو سنا ، آپ فرما رہے تھے : ایسی چیز سے وضو کرو جسے آگ نے چھوا ہو ۔ ‘ ‘",
                "urduNarrator": "ابن شہاب نے کہا, مجھ سے عمر بن عبدالعزیز نے بیان کیا,عبد اللہ بن ابراہیم بن قارظ نے بتایا کہ",
                "hadithArabic": "قَالَ ابْنُ شِهَابٍ أَخْبَرَنِي عُمَرُ بْنُ عَبْدِ الْعَزِيزِ، أَنَّ عَبْدَ اللَّهِ بْنَ إِبْرَاهِيمَ بْنِ قَارِظٍ، أَخْبَرَهُ أَنَّهُ، وَجَدَ أَبَا هُرَيْرَةَ يَتَوَضَّأُ عَلَى الْمَسْجِدِ فَقَالَ إِنَّمَا أَتَوَضَّأُ مِنْ أَثْوَارِ أَقِطٍ أَكَلْتُهَا لأَنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ تَوَضَّئُوا مِمَّا مَسَّتِ النَّارُ ‏\"‏ ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8353,
                "hadithNumber": "789",
                "englishNarrator": "Urwa رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "On the authority of'A'isha, the wife of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), saying this: The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said. Perform ablution (after eating) anything touched by fire.",
                "hadithUrdu": "میں نے نبیﷺ کی اہلیہ حضرت عائشہؓ سے سنا ، انہوں نے کہا : رسول اللہﷺ نے فرمایا : ’’ایسی چیز سے وضو کرو جسے آگ نے چھوا ہو",
                "urduNarrator": "ابن شہاب نے کہا : مجھے سعید بن خالد بن عمرو بن عثمان نے ، جب میں اسے ( سابقہ سند سے ) یہ حدیث سنا رہا تھا ، بتایا کہ اس نے عروہ بن زبیر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے ایسی چیز ( کھانے ) سے وضو کے بارے میں پوچھا جسے آگ نے چھوا ہے ، تو عروہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا",
                "hadithArabic": "قَالَ ابْنُ شِهَابٍ: أَخْبَرَنِي سَعِيدُ بْنُ خَالِدِ بْنِ عَمْرِو بْنِ عُثْمَانَ، وَأَنَا أُحَدِّثُهُ هَذَا الْحَدِيثَ أَنَّهُ سَأَلَ عُرْوَةَ بْنَ الزُّبَيْرِ، عَنِ الْوُضُوءِ مِمَّا مَسَّتِ النَّارُ؟ فَقَالَ: عُرْوَةُ، سَمِعْتُ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ تَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «تَوَضَّئُوا مِمَّا مَسَّتِ النَّارُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8354,
                "hadithNumber": "790",
                "englishNarrator": "Ibn 'Abbas ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) took (meat of) goat's shoulder and offered prayer and did not perform ablution.",
                "hadithUrdu": "رسول اللہﷺ نے بکری کا شانہ تناول فرمایا ، پھر نماز پڑھی اور وضو نہیں کیا ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ بن کناب نے بیان کیا، کہا ہم سے مالک نے بیان کیا، زید بن اسلم سے,عطاء بن یسار نے حضرت ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنِ ابْنِ عَبَّاسٍ: «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَكَلَ كَتِفَ شَاةٍ ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ.",
                "headingArabic": "نَسْخِ ‏\"‏ الْوُضُوءِ مِمَّا مَسَّتِ النَّارُ ‏\"",
                "headingUrdu": "جس چیز کو آگ لگ گئی ہو اس کا وضو منسوخ کرنا",
                "headingEnglish": "Abrogation of wudu’ for that which has been touched by fire",
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8355,
                "hadithNumber": "791",
                "englishNarrator": "Ibn 'Abbas ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) took flesh from the bone or meat, and then offered prayer and did not perform ablution, and (in fact) he did not touch water.",
                "hadithUrdu": "نبیﷺ نے گوشت والی ہڈی یا کچھ گوشت کھایا ، پھر نماز پڑھی اور وضو نہیں کیا یا پانی کو نہیں چھوا",
                "urduNarrator": "ہم سے زہیر بن حرب نے بیان کیا، کہا ہم سے یحییٰ بن سعید نے بیان کیا، ان سے ہشام بن عروہ نے کہا کہ مجھ سے وہب بن کیسان نے بیان کیا,محمد بن عمرو بن عطاء اور علی بن عبد اللہ بن عباس نے حضرت ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، أَخْبَرَنِي وَهْبُ بْنُ كَيْسَانَ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، ح، وَحَدَّثَنِي الزُّهْرِيُّ، عَنْ عَلِيِّ بْنِ عَبْدِ اللهِ بْنِ عَبَّاسٍ، عَنِ ابْنِ عَبَّاسٍ، ح، وَحَدَّثَنِي مُحَمَّدُ بْنُ عَلِيٍّ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ: «أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَكَلَ عَرْقًا، أَوْ لَحْمًا، ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ، وَلَمْ يَمَسَّ مَاءً».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8356,
                "hadithNumber": "792",
                "englishNarrator": "Ja'far bin Amr bin Umayya al-Damari reported on the authority of his father who said:",
                "hadithEnglish": "I saw the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) take slices from goat's shoulder, and then eat them, and then offer prayer without having performed ablution.",
                "hadithUrdu": "انہوں نے رسول اللہﷺ کو ایک شانے سے ( گوشت ) کاٹ کر کھاتے ہوئے دیکھا ، پھر آپ نے نماز پڑھی اور وضو نہیں کیا ۔",
                "urduNarrator": "ہم سے محمد بن الصباح نے بیان کیا,ابراہیم بن سعد نے کہا , ہمیں زہری نے جعفر بن عمرو بن امیہ ضمیری سے حدیث بیان کی ، انہوں نے اپنے والد سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، حَدَّثَنَا الزُّهْرِيُّ، عَنْ جَعْفَرِ بْنِ عَمْرِو بْنِ أُمَيَّةَ الضَّمْرِيِّ، عَنْ أَبِيهِ، «أَنَّهُ رَأَى رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَحْتَزُّ مِنْ كَتِفٍ يَأْكُلُ مِنْهَا، ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8357,
                "hadithNumber": "793",
                "englishNarrator": "Ja'far bin 'Amr bin Umayya al-Damari reported on the authority of his father who said:",
                "hadithEnglish": "I saw the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) take slices from goat's shoulder and then eat them. He was called for prayer and he got'up, leaving aside the knife, and offered prayer but did not perform ablution.",
                "hadithUrdu": "میں نے رسول اللہﷺ کو بکری کے ایک شانے سے ( گوشت ) کاٹتے ہوئے دیکھا ، پھر آپ نے اس میں سے کھایا ، پھر آپ کو نماز کی طرف بلایا گیا تو آپ کھڑے ہوئے اور چھری پھینک دی ، آپ نے نماز پڑھی اور وضو نہیں کیا ۔",
                "urduNarrator": "مجھ سے احمد بن عیسیٰ نے بیان کیا، کہا کہ ہم سے ابن وہب نے بیان کیا، کہا کہ مجھ سے عمرو بن الحارث نے بیان کیا، وہ ابن شہاب سے، وہ جعفر بن عمرو بن امیہ الدمری کے واسطہ سے، انہوں نے اپنے والد سے",
                "hadithArabic": "حَدَّثَنِي أَحْمَدُ بْنُ عِيسَى، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنِ ابْنِ شِهَابٍ، عَنْ جَعْفَرِ بْنِ عَمْرِو بْنِ أُمَيَّةَ الضَّمْرِيِّ، عَنْ أَبِيهِ، قَالَ: «رَأَيْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَحْتَزُّ مِنْ كَتِفِ شَاةٍ، فَأَكَلَ مِنْهَا، فَدُعِيَ إِلَى الصَّلَاةِ، فَقَامَ وَطَرَحَ السِّكِّينَ، وَصَلَّى وَلَمْ يَتَوَضَّأْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8358,
                "hadithNumber": "794",
                "englishNarrator": null,
                "hadithEnglish": "A similar hadith was narrated by 'Ali bin Abdullah bin Abbas رضی ‌اللہ ‌عنہ ‌from his father, from the Messenger of Allah ﷺ.",
                "hadithUrdu": "ابن شہاب نے کہا : مجھے علی بن عبد اللہ بن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے اپنے والد ( عبد اللہ بن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) سے اور انہوں نے رسول اللہﷺ سے یہی حدیث بیان کی ہے ۔",
                "urduNarrator": null,
                "hadithArabic": "قَالَ ابْنُ شِهَابٍ: وَحَدَّثَنِي عَلِيُّ بْنُ عَبْدِ اللهِ بْنِ عَبَّاسٍ، عَنْ أَبِيهِ عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8359,
                "hadithNumber": "795",
                "englishNarrator": "Ibn 'Abbas ‌رضی ‌اللہ ‌عنہ reported it on the authority of Maimuana, the wife of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ):",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) took (a piece of goat's) shoulder at her place, and then offered prayer but did not perform ablution.",
                "hadithUrdu": "نبیﷺ نے ان کے ہاں شانے کا گوشت کھایا ، پھر نماز پڑھی اور وضو نہ کیا ۔",
                "urduNarrator": "عمرو نے کہا,بکیر بن اشج نے ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے مولیٰ کریب سے ، انہوں نے نبیﷺ کی زوجہ حضرت میمونہؓ سے روایت کی کہ",
                "hadithArabic": "قَالَ عَمْرٌو وَحَدَّثَنِي بُكَيْرُ بْنُ الأَشَجِّ، عَنْ كُرَيْبٍ، مَوْلَى ابْنِ عَبَّاسٍ عَنْ مَيْمُونَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ النَّبِيَّ صلى الله عليه وسلم أَكَلَ عِنْدَهَا كَتِفًا ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8360,
                "hadithNumber": "796",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated by Ibn 'Abbas ‌رضی ‌اللہ ‌عنہ ‌on the authority of Maimuna. the wife of the Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), by another chain of transmitters.",
                "hadithUrdu": "مجھے جعفر بن ربیعہ نے بیان کیا,یعقوب بن اشج نے ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے آزاد کردہ غلام کریب سے ، انہوں نے نبیﷺ کی زوجہ حضرت میمونہؓ سے یہی حدیث بیان کی ہے ۔",
                "urduNarrator": null,
                "hadithArabic": "قَالَ عَمْرٌو حَدَّثَنِي جَعْفَرُ بْنُ رَبِيعَةَ، عَنْ يَعْقُوبَ بْنِ الأَشَجِّ، عَنْ كُرَيْبٍ، مَوْلَى ابْنِ عَبَّاسٍ عَنْ مَيْمُونَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم بِذَلِكَ ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8361,
                "hadithNumber": "797",
                "englishNarrator": "Abu Rafi' رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "I testify that I used to roast the liver of the goat for the Messenger of Allah (ﷺ) and then he offered prayer but did not perform ablution.",
                "hadithUrdu": "میں گواہی دیتا ہوں کہ میں رسول اللہﷺ کے لیے بکری کے پیٹ ( کا گوشت ، جگر ، گردے وغیرہ ) بھونتا تھا ( آپ اسے کھاتے ) ، اس کے بعد آپﷺ نماز پڑھتے اور وضو نہ کرتے تھے ۔",
                "urduNarrator": "عمرو نے کہا کہ مجھ سے سعید بن ابی ہلال نے عبداللہ بن عبید اللہ بن ابی رافع کی روایت سے اور ابو غطفان کی روایت سے بیان کیا ,حضرت ابو رافع ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے ، انہوں نے کہا کہ",
                "hadithArabic": "قَالَ عَمْرٌو، وَحَدَّثَنِي سَعِيدُ بْنُ أَبِي هِلَالٍ، عَنْ عَبْدِ اللهِ بْنِ عُبَيْدِ اللهِ بْنِ أَبِي رَافِعٍ، عَنْ أَبِي غَطَفَانَ، عَنْ أَبِي رَافِعٍ، قَالَ: «أَشْهَدُ لَكُنْتُ أَشْوِي لِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَطْنَ الشَّاةِ، ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8362,
                "hadithNumber": "798",
                "englishNarrator": "Ibn Abbas ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) took milk and then called for water and rinsed (his mouth) and said: It contains greasiness.",
                "hadithUrdu": "نبیﷺ نے دودھ نوش فرمایا : پھر پانی طلب کیا ، کلی کی اور فرمایا : یقیناً اس میں کچھ چکناہٹ ہے ۔ ‘ ‘",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے لیث نے بیان کیا, عقیل نے زہری سے ، انہوں نے عبید اللہ بن عبد اللہ سے اور انہوں نے حضرت ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ عُقَيْلٍ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللهِ بْنِ عَبْدِ اللهِ، عَنِ ابْنِ عَبَّاسٍ: «أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ شَرِبَ لَبَنًا، ثُمَّ دَعَا بِمَاءٍ فَتَمَضْمَضَ»، وَقَالَ: «إِنَّ لَهُ دَسَمًا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8363,
                "hadithNumber": "799",
                "englishNarrator": null,
                "hadithEnglish": "A similar report was narrated with the chain 'Uqayl, from Az-Zuhri.",
                "hadithUrdu": "مجھ سے احمد بن عیسیٰ نے بیان کیا، کہا کہ مجھ سے ابن وہب نے بیان کیا، مجھ سے عمرو  نے بیان کیا، مجھ سے زہیر بن حرب نے بیان کیا، کہا کہ ہم سے یحییٰ بن سعید نے بیان کیا، وہ الاوزاعی ح، ح کی روایت سے، اور مجھ سے حرملہ بن یحییٰ نے بیان کیا، ان سے ابن وہب نے بیان کیا۔ ہم سے یونس نے بیان کیا، مجھ سے یہ سب ابن شہاب کی سند سے، عقیل کی سند کے ساتھ، زہری کی سند سے اسی طرح بیان کیا۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنِي أَحْمَدُ بْنُ عِيسَى، حَدَّثَنَا ابْنُ وَهْبٍ وَأَخْبَرَنِي عَمْرٌو ح، وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنِ الْأَوْزَاعِيِّ، ح، وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، حَدَّثَنِي يُونُسُ كُلُّهُمْ عَنِ ابْنِ شِهَابٍ بِإِسْنَادِ عَقِيلٍ، عَنِ الزُّهْرِيِّ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 8051,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=322",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=320",
                "label": "320",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=321",
                "label": "321",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=322",
                "label": "322",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=323",
                "label": "323",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=324",
                "label": "324",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=325",
                "label": "325",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=326",
                "label": "326",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=324",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=324",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=322",
        "to": 8075,
        "total": 40465
    }
}