{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 408,
        "data": [
            {
                "id": 10464,
                "hadithNumber": "2900",
                "englishNarrator": "Sa`id bin Jubair reported on the authority of Ibn `Abbas ( رضی اللہ تعالیٰ عنہ):",
                "hadithEnglish": "The camel of a person broke his neck as he was in the company of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ). The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) commanded them (Companions) to wash him with water mixed (with the leaves of) the lote (tree) and to keep his face exposed; (he, the narrator) said: And his head (too), for he would be raised on the Day of Resurrection pronouncing Talbiya.",
                "hadithUrdu": "ایک شخص کی اس کی سواری نے گرا کر گردن توڑ دی وہ رسول اللہ صلی اللہ علیہ وسلم کے ہمراہ تھا رسول اللہ صلی اللہ علیہ وسلم نے ان ( صحابہ کرا م رضوان اللہ عنھم اجمعین ) کو حکم دیا کہ اسے پانی اور بیری کے پتوں سے غسل دیں اس کا چہرہ ۔ ۔ ۔ اور میرا خیال ہے کہا ۔ ۔ ۔ اور سر برہنہ رکھیں ۔ بلا شبہ قیامت کے دن اسے اس طرح اٹھا یا جا ئے گا کہ وہ بلند آواز سے تلبیہ پکا ر رہا ہو گا ۔",
                "urduNarrator": "ہم سے ہارون بن عبداللہ نے بیان کیا، کہا ہم سے اسود بن عامر نے بیان کیا، انہوں نے زہیر کی سند سے, ابو زبیر نے کہا میں نے سعید بن جبیر کو کہتے ہو ئے سنا کہ ابن عباس رضی اللہ تعالیٰ عنہ نے کہا",
                "hadithArabic": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللهِ، حَدَّثَنَا الْأَسْوَدُ بْنُ عَامِرٍ، عَنْ زُهَيْرٍ، عَنْ أَبِي الزُّبَيْرِ، قَالَ: سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ، يَقُولُ: قَالَ ابْنُ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا، وَقَصَتْ رَجُلًا رَاحِلَتُهُ، وَهُوَ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، «فَأَمَرَهُمْ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ يَغْسِلُوهُ بِمَاءٍ وَسِدْرٍ وَأَنْ يَكْشِفُوا وَجْهَهُ - حَسِبْتُهُ قَالَ - وَرَأْسَهُ، فَإِنَّهُ يُبْعَثُ يَوْمَ الْقِيَامَةِ وَهُوَ يُهِلُّ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10465,
                "hadithNumber": "2901",
                "englishNarrator": "Ibn 'Abbas (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "There was a person in the company of Allah's Messenger (may peace' be upon him) whose camel broke his neck and he died. thereupon Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Wash him, but do not apply perfume and do not cover his face, for he would be raised (on the Day of Resurrection) pronouncing Talbiya.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم کے ساتھ ایک شخص ( سفر حج میں شریک ) تھا اسے اس کی اونٹنی نے گرا کر اس کی گردن تو ڑ دی اور وہ فوت ہو گیا نبی صلی اللہ علیہ وسلم نے فر ما یا : \" اسے غسل دو اور خوشبو اس کے قریب نہ لاؤ نہ ہی اس کا سر ڈھانپو ۔ بلا شبہ وہ قیامت کے دن اس طرح اٹھا یا جا ئے گا کہ وہ تلبیہ کہہ رہا ہو گا ۔",
                "urduNarrator": "ہم سے عبد بن حمید نے بیان کیا، کہا ہم سے عبید اللہ بن موسیٰ نے بیان کیا، کہا ہم سے اسرائیل نے بیان کیا, منصور نے سعید بن جبیر سے انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی کہا",
                "hadithArabic": "وحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عُبَيْدُ اللهِ بْنُ مُوسَى، حَدَّثَنَا إِسْرَائِيلُ، عَنْ مَنْصُورٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا، قَالَ: كَانَ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ رَجُلٌ فَوَقَصَتْهُ نَاقَتُهُ فَمَاتَ، فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «اغْسِلُوهُ وَلَا تُقَرِّبُوهُ طِيبًا وَلَا تُغَطُّوا وَجْهَهُ، فَإِنَّهُ يُبْعَثُ يُلَبِّي».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10466,
                "hadithNumber": "2902",
                "englishNarrator": "`A'isha ( رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) went (into the house of) Duba`a bint Zubair رضی اللہ تعالیٰ عنہا and said to her: Did you intend to perform Hajj? She said: By Allah, (I intend to do so) but I often remain ill, whereupon he (the Holy Prophet) said to her: Perform Hajj but with condition, and say: O Allah, I shall be free from Ihram where you detain me. And she (Duba`a) was the wife of Miqdad رضی اللہ تعالیٰ عنہ .",
                "hadithUrdu": "\" رسول اللہ صلی اللہ علیہ وسلم ضباعہ بنت زبیر رضی اللہ تعالیٰ عنہا ( بن عبد المطلب ) کے ہاں تشریف لے گئے اور دریافت کیا : \" تم حج کا ارادہ رکھتی ہو ۔ ؟ انھوں نے کہا : اللہ کی قسم میں خود کو بیماری کی حا لت میں پا تی ہوں ۔ آپ صلی اللہ علیہ وسلم نے ان سے فر ما یا : \" حج ( کی نیت ) کرو اور شر ط کرلو اور یوں کہو : اللهم مَحِلِّي حيث حبستني \" \" اے اللہ !میں وہاں احرا م کھول دوں گی جہاں تو مجھے روک دے گا ۔ وہ حضرت مقداد رضی اللہ تعالیٰ عنہ کی اہلیہ تھیں ۔",
                "urduNarrator": "ہم سے ابو کریب محمد بن علاء الہمدانی نے بیان کیا، انہوں نے کہا ابو اسامہ نے ہشام سے انھوں نے اپنے والد ( عروہ بن زبیر ) سے انھوں نے حضر ت عائشہ رضی اللہ تعالیٰ عنہا سے اور انھوں نے فر ما یا",
                "hadithArabic": "حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ الْهَمْدَانِيُّ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ رَضِيَ اللهُ عَنْهَا، قَالَتْ: دَخَلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى ضُبَاعَةَ بِنْتِ الزُّبَيْرِ، فَقَالَ لَهَا: «أَرَدْتِ الْحَجَّ؟» قَالَتْ: وَاللهِ، مَا أَجِدُنِي إِلَّا وَجِعَةً، فَقَالَ لَهَا: «حُجِّي وَاشْتَرِطِي، وَقُولِي اللهُمَّ، مَحِلِّي حَيْثُ حَبَسْتَنِي» وَكَانَتْ تَحْتَ الْمِقْدَادِ.",
                "headingArabic": "جَوَازِ اشْتِرَاطِ الْمُحْرِمِ التَّحَلُّلَ بِعُذْرِ الْمَرَضِ وَنَحْوِهِ ‏",
                "headingUrdu": "محرم کے لیے بیماری وغیرہ کی وجہ سے احرام سے نکلنے کی شرط لگانا جائز ہے۔",
                "headingEnglish": "It is permissible for the Muhrim to stipulate a condition for exiting Ihram because of sickness and the like",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10467,
                "hadithNumber": "2903",
                "englishNarrator": "A'isha (رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) went (to the house of) Duba'a bint al-Zubair bin Abd al-Muttalib رضی اللہ تعالیٰ عنہا . She said: Messenger of Allah, I intend to perform Hajj, but I am ill. Thereupon Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) said: Enter Into the state of Ihram on condition that you would abandon it when Allah would detain you.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم ضباعہ بنت زبیر بن عبدالمطلب رضی اللہ تعالیٰ عنہا کے ہاں تشریف لے گئے انھوں نے کہا : اے اللہ کے رسول صلی اللہ علیہ وسلم ! میں حج کرنا چا ہتی ہوں جبکہ میں بیما ر ( بھی ) ہوں تو نبی صلی اللہ علیہ وسلم نے فر ما یا : \" تم حج کے لیے نکل پڑو اور یہ شر ط کر لو کہ ( اے اللہ ! ) میں اسی جگہ احرا م کھول دوں گی جہا ں تو مجھے رو ک دے گا ۔",
                "urduNarrator": "ہم سے عبد بن حمید نے بیان کیا، کہا ہم سے عبد الرزاق نے بیان کیا، کہا ہم سے معمر نے بیان کیا, زہری نے عروہ سے انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ رَضِيَ اللهُ عَنْهَا، قَالَتْ: دَخَلَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى ضُبَاعَةَ بِنْتِ الزُّبَيْرِ بْنِ عَبْدِ الْمُطَّلِبِ، فَقَالَتْ: يَا رَسُولَ اللهِ، إِنِّي أُرِيدُ الْحَجَّ، وَأَنَا شَاكِيَةٌ، فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «حُجِّي، وَاشْتَرِطِي أَنَّ مَحِلِّي حَيْثُ حَبَسْتَنِي».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10468,
                "hadithNumber": "2904",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been reported on the authority of A'isha رضی اللہ تعالیٰ عنہا through another chain of transmitters.",
                "hadithUrdu": "ہم سے عبد بن حمید نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا, معمر نے ہشام بن عروہ سے انھوں نے اپنے والد ( عروہ بن زبیر ) سے انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے اسی ( گزشتہ حدیث ) کے مطابق حدیث روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ رَضِيَ اللهُ عَنْهَا مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10469,
                "hadithNumber": "2905",
                "englishNarrator": "Ibn Abbas رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Duba'a bint al-Zubair bin 'Abdul-Muttalib ( رضی اللہ تعالیٰ عنہا) came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: I am an ailing woman but I intend to perform Hajj; what you command me (to do)? He (the Holy Prophet) said: Enter into the state of Ihram (uttering these words) of condition: I would be free from it when Thou wouldst detain me. 'He (the narrator) said: But she was able to complete (the Hajj without breaking down).",
                "hadithUrdu": "ضباعہ بنت زبیر بن اعبد المطلب رضی اللہ تعالیٰ عنہا رسول اللہ صلی اللہ علیہ وسلم کے پاس آئیں ۔ اور کہا میں ( بیماری کی وجہ سے ) خود کو مشکل سے اٹھا پاتی ہوں اور حج بھی کرنا چا ہتی ہوں ۔ آپ نے فر ما یا \" حج کا احرا م باندھ لو اور شرط لگا کو کہ ( اے اللہ ! ) جہاں تو مجھے روک دے گا وہی میرے احرام کھول دینے کا مقام ہو گا ( ابن عباس رضی اللہ تعالیٰ عنہ نے ) کہا : کہ ضباعہ رضی اللہ تعالیٰ عنہا نے ) حج کر لیا ۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا، کہا کہ ہم سے عبدالوہاب بن عبدالمجید، ابو عاصم اور محمد بن بکر نے بیان کیا، وہ ابن جریج، ایچ، اور اسحاق بن ابراہیم کی سند سے اور ان کا تلفظ محمد بن بکر نے بیان کیا، ہم سے ابن جریج نے بیان کیا۔ جریج نے ہم سے کہا، اس نے مجھے بتایا ابو زبیر نے طاوس کو اور ابن عباس رضی اللہ تعالیٰ عنہ کے آزاد کردہ غلام عکرمہ کو ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کرتے ہو ئے سنا کہ",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ عَبْدِ الْمَجِيدِ، وَأَبُو عَاصِمٍ، وَمُحَمَّدُ بْنُ بَكْرٍ، عَنِ ابْنِ جُرَيْجٍ، ح وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ - وَاللَّفْظُ لَهُ - أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ طَاوُسًا، وَعِكْرِمَةَ، مَوْلَى ابْنِ عَبَّاسٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ ضُبَاعَةَ بِنْتَ الزُّبَيْرِ بْنِ عَبْدِ الْمُطَّلِبِ رَضِيَ اللهُ عَنْهَا، أَتَتْ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَتْ: إِنِّي امْرَأَةٌ ثَقِيلَةٌ، وَإِنِّي أُرِيدُ الْحَجَّ، فَمَا تَأْمُرُنِي؟ قَالَ: «أَهِلِّي بِالْحَجِّ، وَاشْتَرِطِي أَنَّ مَحِلِّي حَيْثُ تَحْبِسُنِي» قَالَ: فَأَدْرَكَتْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10470,
                "hadithNumber": "2906",
                "englishNarrator": "Ibn `Abbas ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Duba`a رضی اللہ تعالیٰ عنہا intended to perform Hajj, and the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) commanded her (to enter into the state of Ihram) with condition. She did it in compliance with the command of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌).",
                "hadithUrdu": "ضباعہ رضی اللہ تعالیٰ عنہا نے حج کرنا چا ہا تو رسول اللہ صلی اللہ علیہ وسلم نے انھیں حکم دیا کہ وہ شرط لگا لیں انھوں نے رسول اللہ صلی اللہ علیہ وسلم کے حکم پر ایسا ہی کیا ۔",
                "urduNarrator": "ہم سے ہارون بن عبداللہ نے بیان کیا، ہم سے ابوداؤد طیالسی نے بیان کیا، ہم سے حبیب بن یزید نے بیان کیا،عمرو بن ہرم نے سعید بن جبیر اور عکرمہ سے انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی",
                "hadithArabic": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللهِ، حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ، حَدَّثَنَا حَبِيبُ بْنُ يَزِيدَ، عَنْ عَمْرِو بْنِ هَرِمٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، وَعِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا، أَنَّ ضُبَاعَةَ أَرَادَتِ الْحَجَّ: «فَأَمَرَهَا النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ تَشْتَرِطَ، فَفَعَلَتْ ذَلِكَ عَنْ أَمْرِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10471,
                "hadithNumber": "2907",
                "englishNarrator": "It was narrated from Ibn Abbas رضی اللہ تعالیٰ عنہما:",
                "hadithEnglish": "The prophet said to Dubaah رضی اللہ تعالیٰ عنہا \"Go for Hajj, but stipulate the condition that Mahilli haithu habastani (My place of exiting Ihram is wherever you prevent me).'\" \r\nAccording to the report of Ishaq: \"He commanded Dubaah رضی اللہ تعالیٰ عنہا .\"",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے ضبا عہ رضی اللہ تعالیٰ عنہا سے فرما یا حج ( کی نیت ) کرو اور ( احرا م بند ھتے ہو ئے ) شرط کرلو کہ ( اے اللہ ! ) تو نے جہاں مجھے روک دیا وہیں میرا احرا م ختم ہو جا ئے گا ۔ اور اسحاق کی روایت کے الفا ظ ہیں ( آپ نے ضبا عہ رضی اللہ تعالیٰ عنہا کو حکم دیا ۔",
                "urduNarrator": "ہمیں اسحاق بن ابرا ہیم ابو ایوب غیلا نی اور احمد بن خراش نے حدیث بیان کی ۔ ۔ ۔ اسھاق نے کہا : ہم کو خبر دی اور دوسروں نے کہا : ہمیں حدیث بیان کی ۔ ۔ ۔ ابو عامر نے جو عبد الملک بن عمر و ہیں انھوں نے کہا ہمیں رباح نے جو ابن ابی معروف ہیں عطا ء سے حدیث بیان کی انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہما سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَأَبُو أَيُّوبَ الْغَيْلَانِيُّ، وَأَحْمَدُ بْنُ خِرَاشٍ، - قَالَ إِسْحَاقُ: أَخْبَرَنَا وقَالَ الْآخَرَانِ: - حَدَّثَنَا أَبُو عَامِرٍ وَهُوَ عَبْدُ الْمَلِكِ بْنُ عَمْرٍو، حَدَّثَنَا رَبَاحٌ وَهُوَ ابْنُ أَبِي مَعْروفٍ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ لِضُبَاعَةَ رَضِيَ اللهُ عَنْهَا: «حُجِّي، وَاشْتَرِطِي أَنَّ مَحِلِّي حَيْثُ تَحْبِسُنِي» وَفِي رِوَايَةِ إِسْحَاقَ: أَمَرَ ضُبَاعَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10472,
                "hadithNumber": "2908",
                "englishNarrator": "`A'isha (رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "Asma' bint `Umais رضی اللہ تعالیٰ عنہا gave birth to Muhammad bin Abu Bakr رضی اللہ تعالیٰ عنہ near Dhu'l-Hulaifa. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) commanded Abu Bakr رضی اللہ تعالیٰ عنہ to convey to her that she should take a bath and then enter into the state of Ihram.",
                "hadithUrdu": "ذوالحلیفہ کے مقام پر واقع ) درخت کے قریب ( قیام کے دورا ن میں ) حضرت اسماءبنت عمیس رضی اللہ تعالیٰ عنہا کو محمد بن ابی بکر کی ( پیدائش کی ) وجہ سے نفاس کا خون آنا شروع ہو گیا تو رسول اللہ صلی اللہ علیہ وسلم نے حضرت ابو بکر صدیق رضی اللہ تعالیٰ عنہ کو حکم دیا کہ ان ( اپنی اہلیہ اسماء رضی اللہ تعالیٰ عنہا ) سے کہیں کہ وہ غسل کر لیں اور احرا م باندھ لیں ۔",
                "urduNarrator": "ہم سے ہناد بن السری، زہیر بن حرب اور عثمان بن ابی شیبہ نے بیان کیا، ان سب نے عبدہ بن زہیر سے کہا: سلیمان، عبید اللہ بن عمر کی سند سے، عبدالرحمٰن بن القاسم کی سند سے، اپنے والد کی سند سے،حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت ہے انھوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، وَزُهَيْرُ بْنُ حَرْبٍ، وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ، كُلُّهُمْ عَنْ عَبْدَةَ، قَالَ زُهَيْرٌ: حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ عُبَيْدِ اللهِ بْنِ عُمَرَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ رَضِيَ اللهُ عَنْهَا، قَالَتْ: نُفِسَتْ أَسْمَاءُ بِنْتُ عُمَيْسٍ بِمُحَمَّدِ بْنِ أَبِي بَكْرٍ بِالشَّجَرَةِ، فَأَمَرَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَبَا بَكْرٍ، «يَأْمُرُهَا أَنْ تَغْتَسِلَ وَتُهِلَّ».",
                "headingArabic": "إِحْرَامِ النُّفَسَاءِ وَاسْتِحْبَابِ اغْتِسَالِهَا لِلإِحْرَامِ وَكَذَا الْحَائِضِ ‏",
                "headingUrdu": "نفاس میں عورت کے لیے احرام کا صحیح ہونا۔ اس کے لیے احرام باندھنے سے پہلے غسل کرنا مستحب ہے، اور حیض والی عورت پر بھی یہی بات لاگو ہوتی ہے۔",
                "headingEnglish": "The soundness of Ihram for the woman in Nifas; It is recommended for her to perform Ghusl before entering Ihram, and the same applies to one who is menstruating",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10473,
                "hadithNumber": "2909",
                "englishNarrator": "Jabir bin `Abdullah (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "When Asma' bint `Umais رضی اللہ تعالیٰ عنہا gave birth (to a child) in Dhu'l-Hulaifa. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) commanded Abu Bakr رضی اللہ تعالیٰ عنہ (to convey to her) that she should take a bath and enter into the state of Ihram.",
                "hadithUrdu": "اسماء بنت عمیس رضی اللہ تعالیٰ عنہا کی حدیث ( کے بارے ) میں روایت کی کہ جب انھیں ذوالحلیفہ میں نفا س آگیا تو رسول اللہ صلی اللہ علیہ وسلم نے حضرت ابو بکر رضی اللہ تعالیٰ عنہ کو حکم دیا انھوں نے ان ( اسماءبنت عمیس رضی اللہ تعالیٰ عنہا ) سے کہا کہ وہ غسل کر لیں اور احرا م باندھ لیں ۔",
                "urduNarrator": "ہم سے ابو غسان محمد بن عمرو نے بیان کیا، کہا ہم سے جریر بن عبدالحمید نے بیان کیا، وہ یحییٰ بن سعید کی سند سے, جعفر ( صادق ) نے اپنے والد محمد ( باقر بن علی زین العابدین بن حسین بن علی رضی اللہ تعالیٰ عنہ ) سے انھوں نے حضرت جا بر عبد اللہ رضی اللہ تعالیٰ عنہ سے",
                "hadithArabic": "حَدَّثَنَا أَبُو غَسَّانَ مُحَمَّدُ بْنُ عَمْرٍو، حَدَّثَنَا جَرِيرُ بْنُ عَبْدِ الْحَمِيدِ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ رَضِيَ اللهُ عَنْهُمَا، فِي حَدِيثِ أَسْمَاءَ بِنْتِ عُمَيْسٍ حِينَ نُفِسَتْ بِذِي الْحُلَيْفَةِ أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، أَمَرَ أَبَا بَكْرٍ رَضِيَ اللهُ عَنْهُ، «فَأَمَرَهَا أَنْ تَغْتَسِلَ وَتُهِلَّ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10474,
                "hadithNumber": "2910",
                "englishNarrator": "A'isha ( رضی اللہ تعالیٰ عنہا) said:",
                "hadithEnglish": "We went with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) during the year of the Farewell Pilgrimage. We entered into the state of Ihram for Umra. Then the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Who has the sacrificial animal with him, he should put on Ihram for Hajj along with Umra. and should not put it off till he has completed them (both Hajj and Umra). She said: When I came to Mecca. I was having menses, I neither circumambulated the House, nor ran between as-safa' and al-Marwa. I complained about it to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and he said: Undo your hair, comb it, and pronounce Talbiya for Hajj, and give up Umra (for the time being), which I did. When we had performed the Hajj, the Messenger of Allah (way peace he upon him) sent me with Abdul-Rabman bin Abu Bakr رضی اللہ تعالیٰ عنہ to Tan'im saying: This is the place for your Umra. Those who had put on Ihram for Umra circumambulated the House, and ran between al-safa' and al-Marwa. They then put off Ihram and then made the last circuit after they had returned from Mina after performing their Hajj, but those who had combined the Hajj and the Umra made only one circuit (as they had combined Hajj and 'Umra).",
                "hadithUrdu": "ہم حجۃالوداع کے سال ( اس کی ادائیگی کے لیے ) اللہ کے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ روانہ ہو ئے اور ہم ( میں سے کچھ ) نے عمرے کے لیے ( احرام باندھ کر ) تلبیہ کہا پھر رسول اللہ صلی اللہ علیہ وسلم نے ارشاد فر ما یا : \" قربانی کا جا نور جس کے ساتھ ہو وہ عمرے کے ساتھ ہی حج کا بھی تلبیہ پکا رے اور اس وقت تک احرام نہ کھولے جب تک دونوں ( کے لیے عائد کردہ احرا م کی پابندیوں ) سے آزاد نہ ہو جا ئے ۔ حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا جب میں مکہ پہنچی تو ایا م مخصوصہ میں تھی میں نے حج کا طواف کیا اور نہ صفا مروہ کے درمیان سعی کی میں نے اس ( صورت حال ) کا شکوہ رسول اللہ صلی اللہ علیہ وسلم سے کیا تو آپ نے فر ما یا : \" اپنے سر کے بال کھولو اور کنگھی کرو ( پھر ) حج کا تلبیہ پکارنا شروع کردو اور عمرے کو چھوڑدو ۔ انھوں نے کہا : میں نے ایسا ہی کیا پھر جب ہم نے حج ادا کر لیا تو رسول اللہ صلی اللہ علیہ وسلم نے مجھے ( میرے بھا ئی ) عبد الرحمٰن بن ابی بکر رضی اللہ تعالیٰ عنہ کے ساتھ تنعیم بھیجا میں نے ( وہاں سے احرا م باندھ کر ) عمرہ کیا ۔ آپ نے فر ما یا : \" یہ ( عمرہ ) تمھا رے ( اس رہ جا نے والے ) عمرے کی جگہ ہے ۔ جن لوگوں نے عمرے کے لیے تلبیہ پکارا تھا ۔ انھوں نے بیت اللہ اور صفامروہ کا طواف کیا اور پھر احرام کھول دیے ۔ پھر جب وہ لو گ ( حج کے دورا ن میں ) منیٰ سے لوٹے تو انھوں نے اپنے حج کے لیے دوسری بار طواف کیا البتہ وہ لوگ جنھوں نے حج اور عمرے کو جمع کیا تھا ( حج قران کیا تھا ) تو انھوں نے ( صفامروہ کا ) ایک ہی طواف کیا ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ التمیمی نے بیان کیا، کہا: میں نے پڑھا مالک نے ابن شہاب سے انھوں نے عروہ سے انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ رَضِيَ اللهُ عَنْهَا، أَنَّهَا قَالَتْ: خَرَجْنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَامَ حَجَّةِ الْوَدَاعِ، فَأَهْلَلْنَا بِعُمْرَةٍ، ثُمَّ قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ كَانَ مَعَهُ هَدْيٌ فَلْيُهِلَّ بِالْحَجِّ مَعَ الْعُمْرَةِ، ثُمَّ لَا يَحِلُّ حَتَّى يَحِلَّ مِنْهُمَا جَمِيعًا» قَالَتْ: فَقَدِمْتُ مَكَّةَ وَأَنَا حَائِضٌ، لَمْ أَطُفْ بِالْبَيْتِ، وَلَا بَيْنَ الصَّفَا وَالْمَرْوَةِ، فَشَكَوْتُ ذَلِكَ إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «انْقُضِي رَأْسَكِ وَامْتَشِطِي وَأَهِلِّي بِالْحَجِّ وَدَعِي الْعُمْرَةَ» قَالَتْ: فَفَعَلْتُ، فَلَمَّا قَضَيْنَا الْحَجَّ أَرْسَلَنِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مَعَ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ إِلَى التَّنْعِيمِ، فَاعْتَمَرْتُ، فَقَالَ: «هَذِهِ مَكَانُ عُمْرَتِكِ» فَطَافَ، الَّذِينَ أَهَلُّوا بِالْعُمْرَةِ، بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ، ثُمَّ حَلُّوا، ثُمَّ طَافُوا طَوَافًا آخَرَ، بَعْدَ أَنْ رَجَعُوا مِنْ مِنًى لِحَجِّهِمْ، وَأَمَّا الَّذِينَ كَانُوا جَمَعُوا الْحَجَّ وَالْعُمْرَةَ، فَإِنَّمَا طَافُوا طَوَافًا وَاحِدًا.",
                "headingArabic": "بَيَانِ وُجُوهِ الإِحْرَامِ وَأَنَّهُ يَجُوزُ إِفْرَادُ الْحَجِّ وَالتَّمَتُّعِ وَالْقِرَانِ وَجَوَازِ إِدْخَالِ الْحَجِّ عَلَى الْعُمْرَةِ وَمَتَى يَحِلُّ الْقَارِنُ مِنْ نُسُكِهِ",
                "headingUrdu": "احرام کی اقسام کی وضاحت؛ اور یہ کہ افراد، تمتع اور قرآن کا حج کرنا جائز ہے۔ حج سے عمرہ تک جانا جائز ہے۔ اور جب قرآن پڑھنے والا احرام سے نکلے۔",
                "headingEnglish": "Clarifying the types of Ihram; and that it is permissible to perfom Hajj that is Ifrad, Tamattu and Qiran. It is permissible to join Hajj to Umrah. And when the pilgrim who is performing Qiran should exit Ihram",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10475,
                "hadithNumber": "2911",
                "englishNarrator": "A'isha رضی اللہ تعالیٰ عنہا the wife of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), said:",
                "hadithEnglish": "We went out with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) during the year of the Farewell Pilgrimage. There were some amongst us who had put on Ihram for Umra and there were some who had put on Ihram for Hajj. (We proceeded on till) we came to Mecca. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: He who put on Ihram for 'Umra but did not bring the sacrificial animal with him should put it off. and he who put on Ihram for Umra and he who had brought the sacrificial animal with him should not put it off until he had slaughtered the animal; and he who put on lhram for Hajj should complete it. A'isha ( رضی اللہ تعالیٰ عنہا ) said: I was in the monthlyperiod, and I remained In this state till the day of 'Arafa, and I had entered into the state of Ihram for 'Umra. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) thus commanded me to undo my hair and comb them (again) and enter into the state of Ihram for Hajj, and abandon (the rites of 'Umra). She ('A'isha) said: I did so, and when I had completed my Pilgrimage, the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sent with me 'Abdul-Rabman bin Abu Bakr رضی اللہ تعالیٰ عنہا and commanded me to (resume the rites of) 'Umra at Tan'im. the place where (I abandoned) 'Umra and put on Ihram for Hajj (before completing Umra).",
                "hadithUrdu": "ہم حجۃالوداع کے سال رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نکلے ہم میں سے بعض نے عمرے کے لیے تلبیہ پکارا اور بعض نے ( صرف ) حج کے لیے حتیٰ کہ ہم مکہ پہنچ گئے رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \"\" جس نے عمرے کے لیے تلبیہ پکارا تھا وہ قربانی نہیں لا یا ۔ وہ احرا م کھو ل دے ۔ اور جس نے عمرے کا احرا م باندھا تھا اور ساتھ قربانی بھی لا یا ہے وہ جب تک قربانی ذبح نہ کر لے احرا م ختم نہ کرے ۔ اور جس نے صرف حج کے لیے تلبیہ کہا تھا وہ اپنا حج مکمل کرے ۔ حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا مجھے ( راستے میں ) ایام شروع ہو گئے ۔ میں عرفہ کے دن تک ایام ہی میں رہی اور میں نے صرف عمرے کے لیے تلبیہ پکا را تھا رسول اللہ صلی اللہ علیہ وسلم نے مجھے حکم دیا کہ میں اپنے سر کے بال کھولوں لنگھی کروں اور حج کے لیے تلبیہ پکاروں اور عمرے ( کے اعمال ) چھوڑدوں تو میں نے یہی کیا ۔ جب میں نے اپنا حج ادا کر لیا تو رسول اللہ صلی اللہ علیہ وسلم نے میرے ساتھ ( میرے بھا ئی ) عبد الرحمٰن بن ابی بکر رضی اللہ تعالیٰ عنہ کو بھیجا اور مجھے حکم دیا کہ میں اس عمرے کی جگہ عمرہ کرلوں جسے حج کا دن آجا نے کی بنا پر مکمل کر کے میں اس کاا حرا م نہ کھول پا ئی تھی ۔",
                "urduNarrator": "ہم سے عبد الملک بن شعیب بن لیث نے بیان کیا، مجھ سے میرے والد نے بیان کیا، میرے دادا نے مجھ سے بیان کیا, عقیل بن خالد نے ابن شہاب سے انھوں نے عروہ بن زبیر سے انھوں نے رسول اللہ صلی اللہ علیہ وسلم کی زوجہ حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي عُقَيْلُ بْنُ خَالِدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، أَنَّهَا قَالَتْ: خَرَجْنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَامَ حَجَّةِ الْوَدَاعِ، فَمِنَّا مَنْ أَهَلَّ بِعُمْرَةٍ وَمِنَّا مَنْ أَهَلَّ بِحَجٍّ، حَتَّى قَدِمْنَا مَكَّةَ، فَقَالَ رَسُولُ اللهِ: صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَحْرَمَ بِعُمْرَةٍ، وَلَمْ يُهْدِ فَلْيَحْلِلْ، وَمَنْ أَحْرَمَ بِعُمْرَةٍ، وَأَهْدَى، فَلَا يَحِلُّ حَتَّى يَنْحَرَ هَدْيَهُ، وَمَنْ أَهَلَّ بِحَجٍّ، فَلْيُتِمَّ حَجَّهُ» قَالَتْ عَائِشَةُ رَضِيَ اللهُ عَنْهَا: فَحِضْتُ، فَلَمْ أَزَلْ حَائِضًا حَتَّى كَانَ يَوْمُ عَرَفَةَ، وَلَمْ أُهْلِلْ إِلَّا بِعُمْرَةٍ، فَأَمَرَنِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ أَنْقُضَ رَأْسِي، وَأَمْتَشِطَ، وَأُهِلَّ بِحَجٍّ، وَأَتْرُكَ الْعُمْرَةَ، قَالَتْ: فَفَعَلْتُ ذَلِكَ، حَتَّى إِذَا قَضَيْتُ حَجَّتِي، بَعَثَ مَعِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرٍ، وَأَمَرَنِي أَنْ أَعْتَمِرَ مِنَ التَّنْعِيمِ، مَكَانَ عُمْرَتِي، الَّتِي أَدْرَكَنِي الْحَجُّ وَلَمْ أَحْلِلْ مِنْهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10476,
                "hadithNumber": "2912",
                "englishNarrator": "A'isha (رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "We went with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) during the year of the Farewell Pilgrimage. I put on Ihram for Umra and did not bring the sacrificial animal. The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: He who has the sacrihcial animal with him should enter into the state of Ihram for Hajj along with 'Umra, and. he should not put the Ihram off till he has completed both of them. She (Hadrat A'isha) said: The monthly period began. When it was the night of Arafa, I said to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌): I entered into the state of Ihram for 'Umra. but now how should I perform the Hajj? Thereupon he said: Undo your hair and comb them, and desist from performing Umra, and put on Ihram for Hajj She (A'isha رضی اللہ تعالیٰ عنہا said: When I had completed my Hajj he commanded 'Abdul-Rahman bin Abu Bakr رضی اللہ تعالیٰ عنہا to carry me behind him (on boneback) in order to enable me to resume the rituals of Umra from Tan'im, the place where I abandoned its rituals.",
                "hadithUrdu": "انھوں نے کہا حجۃ الوداع کے سال ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ( حج کے سفر کے لیے ) نکلے ۔ میں نے عمرے کے لیے تلبیہ پکارا تھا لیکن ( اپنے ) ساتھ قر بانی نہیں لا ئی تھی نبی صلی اللہ علیہ وسلم نے فر ما یا : \" جس کے ساتھ قربانی کے جا نور ہوں وہ اپنے عمرے کے ساتھ حج کا تلبیہ پکا رے اور اس وقت تک احرا م نہ کھو لے جب تک ان دونوں سے فارغ نہ ہو جا ئے ، حضرت عائشہ رضی اللہ تعالیٰ عنہا نے فر ما یا : مجھے ایا م شروع ہو گئے جب عرفہ کی رات آگئی میں نے کہا : اے اللہ کے رسول اللہ صلی اللہ علیہ وسلم !میں نے تو عمرے کے لیے تلبیہ پکارا تھا ۔ اب میں اپنے حج کا کیا کروں ؟آپ نے فر ما یا : \" اپنے سر کے بال کھو لو کنگھی کرو اور عمرے سے رک جا ؤ حج کے لیے تلبیہ پکا رو ۔ انھوں نے کہا : جب میں نے اپنا حج مکمل کر لیا ( تو آپ نے میرے بھا ئی ) عبد الرحمٰن بن ابی بکر رضی اللہ تعالیٰ عنہ کو حکم دیا انھوں نے مجھے سواری پر اپنے پیچھے بٹھا یا اور مقام تنعیم سے اس عمرے کی جگہ جس سے میں رک گئی تھی ( دوسرا ) عمرہ کروا دیا ۔",
                "urduNarrator": "ہم سے عبد بن حمید نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، انہوں نے بیان کیا معمر نے زہری سے انھوں نے عروہ سے انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی",
                "hadithArabic": "وحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ رَضِيَ اللهُ عَنْهَا، قَالَتْ: خَرَجْنَا مَعَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَامَ حَجَّةِ الْوَدَاعِ، فَأَهْلَلْتُ بِعُمْرَةٍ، وَلَمْ أَكُنْ سُقْتُ الْهَدْيَ، فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ كَانَ مَعَهُ هَدْيٌ، فَلْيُهْلِلْ بِالْحَجِّ مَعَ عُمْرَتِهِ، ثُمَّ لَا يَحِلَّ حَتَّى يَحِلَّ مِنْهُمَا جَمِيعًا» قَالَتْ: فَحِضْتُ، فَلَمَّا دَخَلَتْ لَيْلَةُ عَرَفَةَ، قُلْتُ: يَا رَسُولَ اللهِ، إِنِّي كُنْتُ أَهْلَلْتُ بِعُمْرَةٍ، فَكَيْفَ أَصْنَعُ بِحَجَّتِي؟ قَالَ: «انْقُضِي رَأْسَكِ، وَامْتَشِطِي، وَأَمْسِكِي عَنِ الْعُمْرَةِ، وَأَهِلِّي بِالْحَجِّ» قَالَتْ: فَلَمَّا قَضَيْتُ حَجَّتِي أَمَرَ عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرٍ، فَأَرْدَفَنِي، فَأَعْمَرَنِي مِنَ التَّنْعِيمِ، مَكَانَ عُمْرَتِي الَّتِي أَمْسَكْتُ عَنْهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10477,
                "hadithNumber": "2913",
                "englishNarrator": "`A'isha (رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "'We went with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) (to Mecca). He said: He who intended among you to put on Ihram for Hajj and `Umra should do so. And he who intended to put on Ihram for Hajj may do so. And he who intended to put on Ihram for `Umra only may do so. `A'isha (رضی اللہ تعالیٰ عنہا) said: The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) put on Ihram for Hajj and some people did that along with him. And some people put on Ihram for `Umra and Hajj (both), and some persons put on Ihram for `Umra only, and I was among those who put on Ihram for `Umra (only).",
                "hadithUrdu": "ہم ( رسول اللہ صلی اللہ علیہ وسلم کے ساتھ سفر حج کے لیے ) نکلے آپ صلی اللہ علیہ وسلم نے فر ما یا : \" تم میں سے جو اکٹھے عمرے اور حج کے لیے تلبیہ پکارنا چا ہے پکا رے ۔ جو ( صرف ) حج کے لیے تلبیہ پکارنا چا ہے پکارے اور جو ( صرف ) عمرے کے لیے پکا رنا چاہے وہ ایسا کر لے ۔ حضرت عائشہ رضی اللہ تعالیٰ عنہا نے فر ما یا : رسول اللہ صلی اللہ علیہ وسلم نے حج کے لیے تلبیہ پکارا اور آپ کے ساتھ کئی لوگوں نے ( اکیلے حج کے لیے ) تلبیہ کہا کئی لوگوں نے عمرے اور حج ( دونوں ) کے لیے تلبیہ کہا اور کئی لوگوں نے صرف عمرے کے لیے کہا اور میں ان لوگوں میں شامل تھی جنھوں نے صرف عمرے کا تلبیہ کہا ۔",
                "urduNarrator": "ہم سے ابن ابی عمر نے بیان کیا، انہوں نے کہا سفیان نے زہری سے انھوں نے عروہ سے انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ رَضِيَ اللهُ عَنْهَا، قَالَتْ: خَرَجْنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «مَنْ أَرَادَ مِنْكُمْ أَنْ يُهِلَّ بِحَجٍّ وَعُمْرَةٍ، فَلْيَفْعَلْ، وَمَنْ أَرَادَ أَنْ يُهِلَّ بِحَجٍّ فَلْيُهِلَّ، وَمَنْ أَرَادَ أَنْ يُهِلَّ بِعُمْرَةٍ، فَلْيُهِلَّ» قَالَتْ عَائِشَةُ رَضِيَ اللهُ عَنْهَا: فَأَهَلَّ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِحَجٍّ، وَأَهَلَّ بِهِ نَاسٌ مَعَهُ، وَأَهَلَّ نَاسٌ بِالْعُمْرَةِ وَالْحَجِّ، وَأَهَلَّ نَاسٌ بِعُمْرَةٍ، وَكُنْتُ فِيمَنْ أَهَلَّ بِالْعُمْرَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10478,
                "hadithNumber": "2914",
                "englishNarrator": "`A'isha ( رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "We went with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) (in his) Farewell Pilgrimage near the time of the appearance of the new moon of Dhul-Hijja. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: He who amongst you intends to put on Ihram for `Umra may do so; had I not brought sacrificial animals along with me, I would have put on Ihram for `Umra. She (further said). There were some persons who put on Ihram for `Umra, and some persons who put on Ihram for Hajj, and I was one of those who put on Ihram for `Umra. We went on till we reached Mecca, and on the day of `Arafa I found myself in a state of menses, but I did not put off the Ihram for `Umra. I told about (this state of mine) to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), whereupon he said: Abandon your `Umra, and undo the hair of your head and comb (them), and put on Ihram for Hajj. She (`A'isha) said: I did accordingly. When it was the night at Hasba and Allah enabled us to complete our Hajj, he (the Holy Prophet) sent with me `Abdul-Rahman bin Abu Bakr رضی اللہ عنہ , and he mounted me behind him on his camel and took me to Tan`im and I put on Ihram for `Umra, and thus Allah enabled us to complete our Hajj and `Umra and (we were required to observe) neither sacrifice nor alms nor fasting.",
                "hadithUrdu": "ہم حجۃ الوداع کے موقع پر ذوالحجہ کا چاند نکلنے کے قریب قریب رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نکلے کہا : تو رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \"\" تم میں سے جو صرف عمرے کے لیے تلبیہ کہنا چا ہے کہے ۔ اگر یہ بات نہ ہو تی کہ میں قر بانی ساتھ لا یا ہوں تو میں بھی عمرے کا تلبیہ کہتا ۔ ( حضرت عائشہ رضی اللہ تعالیٰ عنہا نے ) کہا : لوگوں میں کچھ ایسے تھے جنھوں نے صرف عمرے کا تلبیہ کہا اور کچھ ایسے تھے جنھوں نے صرف حج کا تلبیہ کہا اور میں ان لوگوں میں سے تھی جنھوں نے صرف عمرے کا تلبیہ کہا ۔ ہم نکل پڑے حتی کہ مکہ آگئے میرے لیے عرفہ کا دن اس طرح آیا کہ میں ایا م میں تھی اور میں نے ( ابھی ) عمرے ( کی تکمیل کر کے اس ) کا احرا م کھو لا نہیں تھا میں نے اس ( بات ) کا شکوہ نبی صلی اللہ علیہ وسلم سے کیا تو آپ صلی اللہ علیہ وسلم نے فر ما یا : \"\" اپنا عمرہ چھوڑدو اپنے سرکی مینڈھیاں کھول دو کنگھی کر لو اور حج کا تلبیہ کہنا شروع کر دو ۔ انھوں نے کہا : میں نے یہی کیا جب حصبہ کی رات آگئی اور اللہ تعا لیٰ نے ہمارا حج مکمل فر ما دیا تھا تو ( آپ نے ) میرے ساتھ ( میرے بھا ئی ) عبد الرحمٰن بن ابی بکر رضی اللہ عنہ کو بھیجا انھوں نے نجھے ساتھ بٹھا یا اور مجھے لے کر تنعیم کی طرف نکل پڑے وہاں سے میں نے عمرے کا تلبیہ کہا ۔ اس طرح اللہ نے ہمارا حج پورا کرادیا اور عمرہ بھی ۔ ( ہشام نے کہا : اس ( الگ عمرے ) کے لیے نہ قر بانی کا کو ئی جا نور ( ساتھ لا یا گیا ) تھا نہ صدقہ تھا اور نہ روزہ ( حضرت عائشہ رضی اللہ تعالیٰ عنہا کو ان میں سے کو ئی کا م کرنے کی ضرورت پیش نہیں آئی ۔ )",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، انہوں نے بیان کیا عبدہ بن سلمیان نے ہشام سے انھوں نے اپنے والد ( عرو ) سے انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ رَضِيَ اللهُ عَنْهَا، قَالَتْ: خَرَجْنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ، مُوَافِينَ لِهِلَالِ ذِي الْحِجَّةِ، قَالَتْ: فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَرَادَ مِنْكُمْ أَنْ يُهِلَّ بِعُمْرَةٍ فَلْيُهِلَّ، فَلَوْلَا أَنِّي أَهْدَيْتُ لَأَهْلَلْتُ بِعُمْرَةٍ» قَالَتْ: فَكَانَ مِنَ الْقَوْمِ مَنْ أَهَلَّ بِعُمْرَةٍ، وَمِنْهُمْ مَنْ أَهَلَّ بِالْحَجِّ، قَالَتْ: فَكُنْتُ أَنَا مِمَّنْ أَهَلَّ بِعُمْرَةٍ، فَخَرَجْنَا حَتَّى قَدِمْنَا مَكَّةَ، فَأَدْرَكَنِي يَوْمُ عَرَفَةَ وَأَنَا حَائِضٌ، لَمْ أَحِلَّ مِنْ عُمْرَتِي، فَشَكَوْتُ ذَلِكَ إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «دَعِي عُمْرَتَكِ، وَانْقُضِي رَأْسَكِ وَامْتَشِطِي، وَأَهِلِّي بِالْحَجِّ» قَالَتْ: فَفَعَلْتُ، فَلَمَّا كَانَتْ لَيْلَةُ الْحَصْبَةِ وَقَدْ قَضَى اللهُ حَجَّنَا، أَرْسَلَ مَعِي عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرٍ، فَأَرْدَفَنِي وَخَرَجَ بِي إِلَى التَّنْعِيمِ، فَأَهْلَلْتُ بِعُمْرَةٍ، فَقَضَى اللهُ حَجَّنَا وَعُمْرَتَنَا، وَلَمْ يَكُنْ فِي ذَلِكَ هَدْيٌ وَلَا صَدَقَةٌ وَلَا صَوْمٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10479,
                "hadithNumber": "2915",
                "englishNarrator": "`A'isha ( رضی اللہ تعالیٰ عنہا) said:",
                "hadithEnglish": "We set out with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) just at the appearance of the new moon of Dhul- Hijja. We had no other intention but that of performing the Hajj, whereupon the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: He who among you intends to put on Ihram for `Umra should do so for `Umra. The rest of the hadith is the same.",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ذوالحجہ کا چاند نکلنے کے قریب قریب ( حج کے لیے ) نکلے اور ہمارے پیش نظر صرف حج ہی تھا ۔ ( لیکن ) رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" تم میں سے جو عمرے کا تلبیہ پکارنا چاہے وہ ( اکیلے ) عمرے کا تلبیہ پکا رے ۔ پھر عبد ہ کی حدیث کی طرح حدیث بیان کی ۔",
                "urduNarrator": "ہم سے ابو کریب نے بیان کیا، انہوں نے کہا ابن نمیر نے ہشام سے سابقہ سند کے ساتھ روایت کی حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا",
                "hadithArabic": "وحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ رَضِيَ اللهُ عَنْهَا، قَالَتْ: خَرَجْنَا مُوَافِينَ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِهِلَالِ ذِي الْحِجَّةِ، لَا نَرَى إِلَّا الْحَجَّ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَحَبَّ مِنْكُمْ أَنْ يُهِلَّ بِعُمْرَةٍ، فَلْيُهِلَّ بِعُمْرَةٍ» وَسَاقَ الْحَدِيثَ، بِمِثْلِ حَدِيثِ عَبْدَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10480,
                "hadithNumber": "2916",
                "englishNarrator": "A'isha (رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "We went with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) at the appearance of the new moon of Dhu'l-Hijja. There were amongst us those who had put on Ihram for Umra, and those also who had put on Ihram both for Hajj and Umra, and still those who had put on Ihram for Hajj (alone). I was one of those who had put on Ihram for. Umra (only). 'Urwa (one of the narrators) said: Allah enabled her (A'isha رضی اللہ تعالیٰ عنہا) to complete both Hajj and Umra (according to the way as mentioned above). Hisham (one of the narrators) said: She had neither the sacrificial animal nor (was she required to) fast, nor (was she obliged to give) alms.",
                "hadithUrdu": "ہم ذوالحجہ کا چا ند نکلنے کے قریب رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ( حج کے لیے مدینہ سے ) نکلے ہم میں سے بعض نے عمرے کا تلبیہ پکارا بعض نے حج کا ۔ اور میں ان لوگوں میں شامل تھی جنھوں نے صرف عمرے کا تلبیہ پکارا تھا ۔ اور ( وکیع نے ) آگے ان دونوں ( عبدہ اور ابن نمیر ) کی طرح حدیث بیان کی ۔ اور اس میں یہ کہا عروہ نے اس کے بارے میں کہا : بلا شبہ اللہ نے ان ( حضرت عائشہ رضی اللہ تعالیٰ عنہا کے ) اس طرح عمرہ کرنے میں نہ کو ئی قر بانی تھی نہ روزہ اور نہ صدقہ ۔",
                "urduNarrator": "ہم سے ابو کریب نے بیان کیا، انہوں نے کہا وکیع نے ہشام سے سابقہ سند کے ساتھ حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ رَضِيَ اللهُ عَنْهَا، قَالَتْ: خَرَجْنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مُوَافِينَ لِهِلَالِ ذِي الْحِجَّةِ مِنَّا مَنْ أَهَلَّ بِعُمْرَةٍ، وَمِنَّا مَنْ أَهَلَّ بِحَجَّةٍ وَعُمْرَةٍ، وَمِنَّا مَنْ أَهَلَّ بِحَجَّةٍ، فَكُنْتُ فِيمَنْ أَهَلَّ بِعُمْرَةٍ وَسَاقَ الْحَدِيثَ بِنَحْوِ حَدِيثِهِمَا، وقَالَ فِيهِ: قَالَ عُرْوَةُ فِي ذَلِكَ: إِنَّهُ قَضَى اللهُ حَجَّهَا وَعُمْرَتَهَا، قَالَ هِشَامٌ: وَلَمْ يَكُنْ فِي ذَلِكَ هَدْيٌ وَلَا صِيَامٌ وَلَا صَدَقَةٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10481,
                "hadithNumber": "2917",
                "englishNarrator": "A'isha (رضی اللہ تعالیٰ عنہا) said:",
                "hadithEnglish": "We proceeded with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) during the year of the Farewell Pilgrimage. There were those amongst us who had put on Ihram for Umra, and those who had put on Ihram both for Hajj and Umra, and those amongst us who had put on Ihram for Hajj (only), while the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had put on Ihram for Hajj (only). He who put on Ihram for Umra put it off (after performing Umra), and he who had put on Ihram for Hajj or for both Hajj and 'Umra did not put it off before the day of sacrifice (10th of Dhu'l-Hijja).",
                "hadithUrdu": "ہم حجۃ الودع کے سال رسول اللہ صلی اللہ علیہ وسلم کے ساتھ  نکلے ۔ ہمیں سے کچھ ایسے تھے جنھوں نے ( صرف ) عمرےکا تلبیہ کہا بعض نے حج اور عمرے دونوں کا اور بعض نے صرف حج کا ۔ رسول اللہ صلی اللہ علیہ وسلم نے حج کا تلبیہ پکارا ۔ جس نے عمرے کا تلبیہ کہا تھا وہ تو ( عمرے کی تکمیل کے بعد ) حلال ہو گیا اور جنھوں نے صرف حج کا یا حج اور عمرے فونوں کا تلبیہ کہا تھا اور قربانی کے جا نور ساتھ لا ئے تھے وہ لوگ قربانی کا دن آنے تک احرا م کی پابندیوں سے آزاد نہیں ہو ئے ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے ابو الاسود کی سند سے مالک کو پڑھا, محمد بن عبد الرحمٰن بن نوفل نے عروہ سے انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ أَبِي الْأَسْوَدِ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ نَوْفَلٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ رَضِيَ اللهُ عَنْهَا، أَنَّهَا قَالَتْ: خَرَجْنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَامَ حَجَّةِ الْوَدَاعِ، فَمِنَّا مَنْ أَهَلَّ بِعُمْرَةٍ، وَمِنَّا مَنْ أَهَلَّ بِحَجٍّ وَعُمْرَةٍ، وَمِنَّا مَنْ أَهَلَّ بِالْحَجِّ، «وَأَهَلَّ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِالْحَجِّ»، فَأَمَّا مَنْ أَهَلَّ بِعُمْرَةٍ فَحَلَّ، وَأَمَّا مَنْ أَهَلَّ بِحَجٍّ أَوْ جَمَعَ الْحَجَّ وَالْعُمْرَةَ، فَلَمْ يَحِلُّوا، حَتَّى كَانَ يَوْمُ النَّحْرِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10482,
                "hadithNumber": "2918",
                "englishNarrator": "A'isha (رضی اللہ تعالیٰ عنہا) said:",
                "hadithEnglish": "We proceeded with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) with no other intention but that of performing the Hajj. As I was at Sarif or near it, I entered in the state of menses. The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came to me and I was weeping, whereupon he said: Are you in a state of menses? I said. Yes. whereupon he said: This is what Allah has ordained for all the daughters, of Adam. Do whatever the pilgrim does. except that you should not circumambulate the House till you have washed yourself (at the end of the menses period). And the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) offered sacrifice of a cow on behalf of his wives.",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ  نکلے اور ہمارے پیش نظر حج کے سوا اور کچھ نہ تھا ۔ جب ہم مقام سرف یاس کے قریب پہنچے تو مجھے ایام شروع ہو گئے ۔ نبی صلی اللہ علیہ وسلم میرے پاس تشریف لا ئے اور مجھے روتا ہوا پا یا ۔ آپ نے فر ما یا : \"\" کیا تمھا رے ایام شروع ہو گئے ہیں ؟ ( حضرت عائشہ رضی اللہ تعالیٰ عنہا نے ) کہا : میں نے جواب دیا : جی ہاں ۔ آپ صلی اللہ علیہ وسلم نے فر ما یا : \"\" بلا شبہ یہ چیز اللہ تعا لیٰ نے آدم کی بیٹیوں کے لیے لکھ ( کر مقدر کر ) دی ہے تم ( سارے ) کا م ویسے ہی سر انجا م دو جیسے حاجی کرتے ہیں سوائے یہ کہ جب تک غسل نہ کر لو بیت اللہ کا طواف نہ کرنا ۔ ( حضرت عائشہ رضی اللہ تعالیٰ عنہا نے ) کہا ( اس حج میں ) رسول اللہ صلی اللہ علیہ وسلم نے اپنی بیویوں کی طرف سے گا ئے کی قربانی کی ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، عمرو ناقد اور زہیر بن حرب نے ابن عیینہ کی سند سے بیان کیا: سفیان بن عیینہ، عبدالرحمٰن بن کی قاسم نے اپنے والد ( محمد بن ابی بکر ) سے انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے حدیث بیان کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، قَالَ عَمْرٌو: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ رَضِيَ اللهُ عَنْهَا، قَالَتْ: خَرَجْنَا مَعَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَلَا نَرَى إِلَّا الْحَجَّ، حَتَّى إِذَا كُنَّا بِسَرِفَ، أَوْ قَرِيبًا مِنْهَا، حِضْتُ فَدَخَلَ عَلَيَّ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَأَنَا أَبْكِي، فَقَالَ: «أَنَفِسْتِ؟» - يَعْنِي الْحَيْضَةَ قَالَتْ - قُلْتُ: نَعَمْ، قَالَ: «إِنَّ هَذَا شَيْءٌ كَتَبَهُ اللهُ عَلَى بَنَاتِ آدَمَ، فَاقْضِي مَا يَقْضِي الْحَاجُّ، غَيْرَ أَنْ لَا تَطُوفِي بِالْبَيْتِ حَتَّى تَغْتَسِلِي» قَالَتْ: وَضَحَّى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ نِسَائِهِ بِالْبَقَرِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10483,
                "hadithNumber": "2919",
                "englishNarrator": "A'isha (رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "We went with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) with no other aim but that of Hajj till we came (to the place known as) Sarif; and there I entered in the state of menses. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came to me while I was weeping. He said: What makes you weep? I said: Would that I had not come (for Pilgrimage) this year. He (the Holy Prophet) said: What has happened to you? You have perhaps entered the period of menses. I said: Yes. He said: This is what has been ordained for the daughters of Adam. Do what a pilgrim does except that you should not circumambulate the House, till you are purified (of the menses). She ('A'isha رضی اللہ تعالیٰ عنہ ) said: When I came to Mecca, the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to his companions: Make this (Ihram) the Ihram for 'Umra. So the people put off Ihram except those who had sacrificial animals with them. She ('A'isha) said: The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had the sacrificial animal with him, and so had Abu Bakr, 'Umar and other persons of means. They (those who had put off Ihram again) put on Ihram (for Hajj) when they marched (towards Mina), and it was the 8th of Dhu'l-Hijja. She ('A'isha رضی اللہ تعالیٰ عنہ) said: When it was the day of sacrifice (10th of Dhu'l-Hijja), I was purified, and the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) commanded me and I did the circumambulation of Ifada. She said that the flesh of cow was sent to us. I said: What is it? They said: The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) has offered a cow as sacrifice on behalf of his wives. When it was the night at Hasba, I said: Messenger of Allah, people are coming back from Hajj and Umra, where as I am coming back from Hajj (alone). She (A'isha) reported: He (the Holy Prophet) commanded Abdul-Rahman bin Abu Bakr رضی اللہ تعالیٰ عنہ to mount me upon his camel behind him. She ('A'isha) said: I was very young and I well remember that I dozed off and my face touched the hind part of the haudaj (camel litter) till we came to Tan'im, and entered into the state of Ihram in lieu of Umra (which I for the time being abandoned) and which the people had performed.",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ  نکلے اور حج ہی کا ذکر کر رہے تھے ۔ جب ہم سرف کے مقام پر پہنچے تو میرے ایام شروع ہو گئے ۔ ( اس اثنا میں ) رسول اللہ صلی اللہ علیہ وسلم میرے ( حجرے میں ) داخل ہو ئے تو میں رو رہی تھی ۔ آپ صلی اللہ علیہ وسلم نے پو چھا : تمھیں کیا رلا رہا ہے ؟میں نے جواب دیا اللہ کی قسم ! کاش میں اس سال حج کے لیے نہ نکلتی ۔ آپ نے پو چھا : تمھا رے ساتھ کیا مسئلہ ہے؟ کہیں تمھیں ایام تو شروع نہیں ہو گئے ؟ میں نے کہا : جی ہاں آپ نے فر ما یا : \"\" یہ چیز تو اللہ نے آدم ؑ کی بیٹیوں کے لیے مقدر کر دی ہے ۔ تم تمام کا م ویسے کرتی جاؤ جیسے ( تمام ) حا جی کریں مگر جب تک پاک نہ ہو جاؤ بیت اللہ کا طواف نہ کرو ۔ انھوں ( حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : جب میں مکہ پہنچی تو رسول اللہ صلی اللہ علیہ وسلم نے اپنے صحا بہ کرام رضوان اللہ عنھم اجمعین سے فر ما یا : \"\" تم اسے ( حج کی نیت کو بدل کر ) عمرہ کر لو ۔ جن کے پاس قربانیا ں تھیں ان کے علاوہ تمام صحابہ کرام رضوان اللہ عنھم اجمعین نے ( اسی کے مطا بق عمرے کا ) تلبیہ پکارنا شروع کر دیا ۔ ( حضرت عائشہ رضی اللہ تعالیٰ عنہا نے ) کہا اور قربانیاں ( صرف ) رسول اللہ صلی اللہ علیہ وسلم ابو بکر و عمر اور ( بعض ) اصحاب ثروت رضوان اللہ عنھم اجمعین ( ہی ) کے پاس تھیں ۔ جب وہ چلے تو انھوں نے ( حج ) کا تلبیہ پکارا ۔ ( حضرت عائشہ رضی اللہ تعالیٰ عنہا نے ) کہا : جب قر بانی کا دن آیا تو میں پاک ہو گئی ۔ رسول اللہ صلی اللہ علیہ وسلم نے مجھے حکم دیا تو میں نے طواف ( افاضہ ) کر لیا ۔ ( انھوں نے ) کہا : ہمارے پاس گا ئے کا گو شت لا یا گیا میں نے پو چھا : یہ کیا ہے ؟ انھوں ( لا نے والوں ) نے جواب دیا کہ اللہ کے رسول اللہ صلی اللہ علیہ وسلم نے اپنی بیویوں کی طرف سے گا ئے کی قر بانی دی ہے ۔ جب ( مدینہ کے راستے منیٰ کے فوراً بعد کی منزل ) محصب کی رات آئی تو میں نے عرض کی اے اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! لو گ حج اور عمرہ ( دونوں ) کر کے لو ٹیں اور میں ( اکیلا ) حج کر کے لوٹوں ؟ کہا آپ صلی اللہ علیہ وسلم نے ( میرے بھا ئی ) عبد الرحمٰن بن ابی بکر رضی اللہ تعالیٰ عنہ کو حکم دیا انھوں نے مجھے اپنے اونٹ پر ساتھ بٹھا یا ۔ انھوں نے ) کہا : مجھے یا د پڑ تا ہے کہ میں ( اس وقت نو عمر لرکی تھی ( راستے میں ) میں اونگھ رہی تھی اور میرا منہ ( بار بار ) کجا وے کی پچھلی لکڑی سے ٹکراتا تھا حتیٰ کہ ہم تنعیم پہنچ گئے ۔ پھر میں نے وہاں سے اس عمرے کے بدلے جو لوگوں نے کیا تھا ( اور میں اس سے محروم رہ گئی تھی ) عمرے کا ( احرا م باند ھ کر ) تلبیہ پکا را.",
                "urduNarrator": "ہم سے سلیمان بن عبید اللہ نے ابو ایوب الغیلانی نے بیان کیا، کہا ہم سے ابوعامر عبد الملک بن عمرو نے بیان کیا، انہیں عبد العزیز بن ابن سلمہ ماجشون نے عبد الرحمٰن بن قاسم سے انھوں نے اپنے والد ( قاسم ) سے انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ۔ ( انھوں نے ) کہا",
                "hadithArabic": "حَدَّثَنِي سُلَيْمَانُ بْنُ عُبَيْدِ اللهِ أَبُو أَيُّوبَ الْغَيْلَانِيُّ، حَدَّثَنَا أَبُو عَامِرٍ عَبْدُ الْمَلِكِ بْنُ عَمْرٍو، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ الْمَاجِشُونُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ رَضِيَ اللهُ عَنْهَا، قَالَتْ: خَرَجْنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لَا نَذْكُرُ إِلَّا الْحَجَّ، حَتَّى جِئْنَا سَرِفَ فَطَمِثْتُ، فَدَخَلَ عَلَيَّ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَأَنَا أَبْكِي، فَقَالَ: «مَا يُبْكِيكِ؟» فَقُلْتُ: وَاللهِ، لَوَدِدْتُ أَنِّي لَمْ أَكُنْ خَرَجْتُ الْعَامَ، قَالَ: «مَا لَكِ؟ لَعَلَّكِ نَفِسْتِ؟» قُلْتُ: نَعَمْ، قَالَ: «هَذَا شَيْءٌ كَتَبَهُ اللهُ عَلَى بَنَاتِ آدَمَ، افْعَلِي مَا يَفْعَلُ الْحَاجُّ غَيْرَ أَنْ لَا تَطُوفِي بِالْبَيْتِ حَتَّى تَطْهُرِي» قَالَتْ: فَلَمَّا قَدِمْتُ مَكَّةَ، قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِأَصْحَابِهِ «اجْعَلُوهَا عُمْرَةً» فَأَحَلَّ النَّاسُ إِلَّا مَنْ كَانَ مَعَهُ الْهَدْيُ، قَالَتْ: فَكَانَ الْهَدْيُ مَعَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَأَبِي بَكْرٍ وَعُمَرَ وَذَوِي الْيَسَارَةِ، ثُمَّ أَهَلُّوا حِينَ رَاحُوا، قَالَتْ: فَلَمَّا كَانَ يَوْمُ النَّحْرِ طَهَرْتُ، فَأَمَرَنِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَأَفَضْتُ، قَالَتْ: فَأُتِيَنَا بِلَحْمِ بَقَرٍ، فَقُلْتُ: مَا هَذَا؟ فَقَالُوا: أَهْدَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ نِسَائِهِ الْبَقَرَ، فَلَمَّا كَانَتْ لَيْلَةُ الْحَصْبَةِ، قُلْتُ: يَا رَسُولَ اللهِ، يَرْجِعُ النَّاسُ بِحَجَّةٍ وَعُمْرَةٍ وَأَرْجِعُ بِحَجَّةٍ؟ قَالَتْ: فَأَمَرَ عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرٍ، فَأَرْدَفَنِي عَلَى جَمَلِهِ، قَالَتْ: فَإِنِّي لَأَذْكُرُ، وَأَنَا جَارِيَةٌ حَدِيثَةُ السِّنِّ، أَنْعَسُ فَيُصِيبُ وَجْهِي مُؤْخِرَةَ الرَّحْلِ، حَتَّى جِئْنَا إِلَى التَّنْعِيمِ، فَأَهْلَلْتُ مِنْهَا بِعُمْرَةٍ، جَزَاءً بِعُمْرَةِ النَّاسِ الَّتِي اعْتَمَرُوا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10484,
                "hadithNumber": "2920",
                "englishNarrator": "A'isha ( رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "We entered into the state of. Ihram for Hajj till we were at Sarif and I was in menses. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) came to me and I was weeping. The rest of the hadith is the same but (with this portion) that there were sacrificial animals with Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and with Abu Bakr, Umar and with rich persons. And they pronounced Talbiya as they proceeded on. And there is no mention of this (too): I was a girl of tender age and I dozed off and my face touched the bind part of the Haudaj.",
                "hadithUrdu": "ہم نے حج کا تلبیہ پکا را جب ہم سرف مقام پر تھے میرے ایام شروع ہو گئے آپ صلی اللہ علیہ وسلم ( میرے حجرے میں ) داخل ہو ئے تو میں رورہی تھی ( حماد نے ) اس سے آگے ماجثون کی حدیث کی طرح بیان کیا مگر حماد کی حدیث میں یہ ( الفا ظ ) نہیں : قربانی نبی صلی اللہ علیہ وسلم ابو بکر و عمر اور اصحاب ثروت رضوان اللہ عنھم اجمعین ہی کے پاس تھی ۔ پھر جب وہ چلے تو انھوں نے تلبیہ پکارا ۔ اور نہ یہ قول ( ان کی حدیث میں ہے ) کہ میں نو عمر لڑکی تھی مجھے اونگھ آتی تو میرا سر ( بار بار ) پالان کی پچھلی لکڑی کو لگتا تھا ۔",
                "urduNarrator": "مجھ سے ابو ایوب الغیلانی نے بیان کیا، انہوں نے ہم سے بہز بیان کیا، انہوں نے کہا حماد ( بن سلمہ ) نے عبد الرحمٰن سے حدیث بیان کی انھوں نے اپنے والد ( قاسم ) سے انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي أَبُو أَيُّوبَ الْغَيْلَانِيُّ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا حَمَّادٌ، عَنْ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ رَضِيَ اللهُ عَنْهَا، قَالَتْ: لَبَّيْنَا بِالْحَجِّ حَتَّى إِذَا كُنَّا بِسَرِفَ حِضْتُ، فَدَخَلَ عَلَيَّ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَأَنَا أَبْكِي، وَسَاقَ الْحَدِيثَ بِنَحْوِ حَدِيثِ الْمَاجِشُونِ، غَيْرَ أَنَّ حَمَّادًا لَيْسَ فِي حَدِيثِهِ: فَكَانَ الْهَدْيُ مَعَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَأَبِي بَكْرٍ، وَعُمَرَ، وَذَوِي الْيَسَارَةِ، ثُمَّ أَهَلُّوا حِينَ رَاحُوا وَلَا قَوْلُهَا وَأَنَا جَارِيَةٌ حَدِيثَةُ السِّنِّ أَنْعَسُ فَيُصِيبُ وَجْهِي مُؤْخِرَةَ الرَّحْلِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10485,
                "hadithNumber": "2921",
                "englishNarrator": "A'Isha رضی اللہ تعالیٰ عنہا reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) entered into the state of Ihram for Hajj Afrad.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے اکیلا حج ( افراد ) کیا تھا ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا، مجھ سے میرے چچا نے بیان کیا, مالک نے عبد الرحمٰن بن قاسم سے انھوں نے اپنے والد ( قاسم ) سے انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، حَدَّثَنِي خَالِي مَالِكُ بْنُ أَنَسٍ، ح وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ رَضِيَ اللهُ عَنْهَا: «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَفْرَدَ الْحَجَّ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10486,
                "hadithNumber": "2922",
                "englishNarrator": "A'isha (رضی اللہ تعالیٰ عنہا ) reported:",
                "hadithEnglish": "We proceeded with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) putting on the Ihram for Hajj during the months of Hajj and the night of Hajj till we encamped at Sarif. He (the Holy Prophet) went to his Companions and said: He who has no sacrificial animal with him, in his case I wish that he should perform Umra (with this Ihram), and he who has the sacrificial animal with him should not do it. So some of them performed Hajj whereas others who had no sacrificial animals with them did not do (Hajj, but performed only 'Umra). The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had a sacrificial animal with him and those too who could afford it (performed) Hajj). The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came to me (i. e. A'isha رضی اللہ تعالیٰ عنہا) while I was weeping, and he said: What makes you weep? I said: I heard your talk with Companions about Umra. He said: What has happened to you? I said: I do not observe prayer (due to the monthly period), whereupon he said: It would not harm you; you should perform (during this time) the rituals of Hajj (which you can do outside the House). Maybe Allah will compensate you for this. You are one among the daughters of Adam and Allah has ordained for you as He has ordained for them. So I proceeded on (with the rituals of Hajj) till we came to Mina. I washed myself and then circumambulated the House, and the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) encamped at Muhassab and called, Abd al-Rahman b. Abu Bakr. and said: Take out your sister from the precincts of the Ka'ba in order to put on Ihram for Umra and circumambulate the House. and I shall wait for you here. She said: So I went out and put on Ihram and then circumambulated the House, and (ran) between al-Safa and al-Marwa, and then we came to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and he was in his house in the middle of the night. He said: Have you completed your (rituals)? I said: Yes. He then announced to his Companions to march on. He came out, and went to the House and circumambulated it before the dawn prayer and then proceeded to Medina.",
                "hadithUrdu": "ہم حج کا تلبیہ کہتے ہو ئے حج کے مہینوں میں حج کی حرمتوں ( پابندیوں ) میں اور حج کے ایام میں رسول اللہ صلی اللہ علیہ وسلم کی معیت میں روانہ ہو ئے حتی کہ سرف کے مقا م پر اترے ۔ ( وہاں پہنچ کر ) آپ اپنے صحابہ کرام رضوان اللہ عنھم اجمعین کے پاس تشریف لے گئے اور فر ما یا : \"\" تم میں سے جس کے ہمرا ہ قربانی نہیں ہے ۔ اور وہ اپنے حج کو عمرے میں بدلنا چاہتا ہے توا یسا کر لے اور جس کے ساتھ قربانی کے جا نور ہیں وہ ( ایسا ) نہ کرے ۔ ان میں سے کچھ نے جن کے پاس قربانی نہیں تھی اس ( عمرے ) کو اختیار کر لیا اور کچھ لوگوں نے رہنے دیا ۔ البتہ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ اور آپ کے ساتھ بعض صاحب استطاعت صحابہ کے ساتھ قربانیاں تھیں ۔ پھر آپ میرے پاس تشریف لا ئے تو میں رو رہی تھی ۔ آپ نے فر ما یا : \"\" کیوں روتی ہو؟ میں نے جواب دیا میں نے آپ کی آپ کے صحابہ کرام رضوان اللہ عنھم اجمعین کے ساتھ گفتگو سنی ہے اور عمرے کے متعلق بھی سن لیا ہے میں عمرے سے روک دی گئی ہوں ۔ آپ نے پو چھا : ( کیوں ) تمھیں کیا ہے ؟میں نے جواب دیا : میں نماز ادا نہیں کر سکتی ۔ آپ نے فر ما یا : \"\" یہ ( ایام عمرے حج میں ) تمھارے لیے نقصان دہ نہیں تم اپنے حج میں ( لگی ) رہو امید ہے کہ اللہ تعا لیٰ تمھیں یہ ( عمرے کا ) اجر بھی دے گا تم آدم ؑکی بیٹیوں میں سے ہو ۔ اللہ تعا لیٰ نے تمھارے لیے بھی وہی کچھ لکھ دیا ہے جو ان کی قسمت میں لکھا ہے کہا ( پھر ) میں احرا م ہی کی حا لت میں ) اپنے حج کے سفر میں نکلی حتیٰ کہ ہم منیٰ میں جا اترے اور ( تب ) میں ایام سے پاک ہو گئی پھر ہم سب نے بیت اللہ کا طواف ( افاضہ ) کیا ۔ اور رسول اللہ صلی اللہ علیہ وسلم نے وادی محصب میں پڑاؤ ڈالا ۔ آپ صلی اللہ علیہ وسلم نے عبد الرحمٰن بن ابی بکر رضی اللہ تعالیٰ عنہ ( میرے بھا ئی ) کو بلا یا اور ان سے ) فر ما یا : \"\" اپنی بہن کو حرم سے باہر ( تنعیم ) لے جاؤ تا کہ یہ ( احرام باندھ کر ) عمرے کا تلبیہ کہے اور ( عمرے کے لیے بیت اللہ ( اور صفامروہ ) کا طواف کر لے ۔ میں ( تمھا ری واپسی تک ) تم دونوں کا یہیں انتظار کروں گا ۔ ( حضرت عائشہ رضی اللہ تعالیٰ عنہا نے ) کہا : ہم نکل پڑے میں نے ( احرا م باندھ کر ) بیت اللہ اور صفامروہ کا طواف کیا ۔ ہم لوٹ آئے اور رسول اللہ صلی اللہ علیہ وسلم آدھی رات کے وقت اپنی منزل ہی پر تھے ۔ آپ نے ( مجھ سے ) پو چھا : \"\" کیا تم ( عمرے سے ) فارغ ہو گئی ہو؟ میں نے کہا جی ہاں پھر آپ نے اپنے صحابہ کرام رضوان اللہ عنھم اجمعین میں کو چ کے اعلان کا حکم دیا ۔ آپ ( وہاں سے ) نکلے بیت اللہ کے پاس سے گزرے اور فجر کی نماز سے پہلے اس کا طواف ( وداع ) کیا پھر مدینہ کی طرف روانہ ہو گئے ۔",
                "urduNarrator": "ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا، کہا ہم سے اسحاق بن سلیمان نے بیان کیا, افلح بن حمید نے قاسم سے انھوں نے عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، حَدَّثَنَا إِسْحَاقُ بْنُ سُلَيْمَانَ، عَنْ أَفْلَحَ بْنِ حُمَيْدٍ، عَنِ الْقَاسِمِ، عَنْ عَائِشَةَ رَضِيَ اللهُ عَنْهَا، قَالَتْ: خَرَجْنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مُهِلِّينَ بِالْحَجِّ، فِي أَشْهُرِ الْحَجِّ، وَفِي حُرُمِ الْحَجِّ، وَلَيَالِي الْحَجِّ، حَتَّى نَزَلْنَا بِسَرِفَ، فَخَرَجَ إِلَى أَصْحَابِهِ فَقَالَ: «مَنْ لَمْ يَكُنْ مَعَهُ مِنْكُمْ هَدْيٌ فَأَحَبَّ أَنْ يَجْعَلَهَا عُمْرَةً، فَلْيَفْعَلْ، وَمَنْ كَانَ مَعَهُ هَدْيٌ، فَلَا» فَمِنْهُمُ الْآخِذُ بِهَا وَالتَّارِكُ لَهَا، مِمَّنْ لَمْ يَكُنْ مَعَهُ هَدْيٌ، فَأَمَّا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَكَانَ مَعَهُ الْهَدْيُ، وَمَعَ رِجَالٍ مِنْ أَصْحَابِهِ لَهُمْ قُوَّةٌ، فَدَخَلَ عَلَيَّ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَأَنَا أَبْكِي، فَقَالَ: «مَا يُبْكِيكِ؟» قُلْتُ: سَمِعْتُ كَلَامَكَ مَعَ أَصْحَابِكَ فَسَمِعْتُ بِالْعُمْرَةِ قَالَ «وَمَا لَكِ؟» قُلْتُ: لَا أُصَلِّي، قَالَ: «فَلَا يَضُرُّكِ، فَكُونِي فِي حَجِّكِ، فَعَسَى اللهُ أَنْ يَرْزُقَكِيهَا، وَإِنَّمَا أَنْتِ مِنْ بَنَاتِ آدَمَ، كَتَبَ اللهُ عَلَيْكِ مَا كَتَبَ عَلَيْهِنَّ» قَالَتْ: فَخَرَجْتُ فِي حَجَّتِي حَتَّى نَزَلْنَا مِنًى فَتَطَهَّرْتُ، ثُمَّ طُفْنَا بِالْبَيْتِ، وَنَزَلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الْمُحَصَّبَ، فَدَعَا عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرٍ، فَقَالَ: «اخْرُجْ بِأُخْتِكَ مِنَ الْحَرَمِ فَلْتُهِلَّ بِعُمْرَةٍ، ثُمَّ لِتَطُفْ بِالْبَيْتِ، فَإِنِّي أَنْتَظِرُكُمَا هَا هُنَا» قَالَتْ: فَخَرَجْنَا فَأَهْلَلْتُ، ثُمَّ طُفْتُ بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ، فَجِئْنَا رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَهُوَ فِي مَنْزِلِهِ مِنْ جَوْفِ اللَّيْلِ، فَقَالَ: «هَلْ فَرَغْتِ؟» قُلْتُ: نَعَمْ، فَآذَنَ فِي أَصْحَابِهِ بِالرَّحِيلِ، فَخَرَجَ فَمَرَّ بِالْبَيْتِ فَطَافَ بِهِ قَبْلَ صَلَاةِ الصُّبْحِ، ثُمَّ خَرَجَ إِلَى الْمَدِينَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10487,
                "hadithNumber": "2923",
                "englishNarrator": "A'isha ( رضی اللہ تعالیٰ عنہا) said:",
                "hadithEnglish": "Some among us put on Ihram for Hajj alone (Hajj Mufrad); some of us for Hajj and Umra together (Qiran), and some of us for Tamattal (first for Umra and after completing it for Hajj).",
                "hadithUrdu": "( جب ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ حج کے لیے نکلے تھے تو ) ہم میں سے بعض نے اکیلے حج ( افراد ) کا تلبیہ کہا بعض نے ایک ساتھ دونوں ( قرن ) اور بعض نے حج تمتع کا ارادہ کیا ۔",
                "urduNarrator": "مجھ سے یحییٰ بن ایوب نے بیان کیا، کہا ہم سے عباد بن عباد المہلبی نے بیان کیا، انہوں نے کہا عبید اللہ بن عمرنے قاسم بن محمد سے حدیث بیان کی ، انھوں نے ام المومنین حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے فر ما یا",
                "hadithArabic": "حَدَّثَنِي يَحْيَى بْنُ أَيُّوبَ، حَدَّثَنَا عَبَّادُ بْنُ عَبَّادٍ الْمُهَلَّبِيُّ، حَدَّثَنَا عُبَيْدُ اللهِ بْنُ عُمَرَ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ أُمِّ الْمُؤْمِنِينَ عَائِشَةَ رَضِيَ اللهُ عَنْهَا، قَالَتْ: «مِنَّا مَنْ أَهَلَّ بِالْحَجِّ مُفْرَدًا، وَمِنَّا مَنْ قَرَنَ، وَمِنَّا مَنْ تَمَتَّعَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10488,
                "hadithNumber": "2924",
                "englishNarrator": "AI-Qasim bin Muhammad reported:",
                "hadithEnglish": "A'isha رضی اللہ تعالیٰ عنہا had come for Hajj.",
                "hadithUrdu": "حضرت عائشہ رضی اللہ تعالیٰ عنہا ( صرف ) حج کےلئے آئیں تھیں.",
                "urduNarrator": "ہم سے عبد بن حمید نے بیان کیا، کہا ہم سے محمد بن بکر نے بیان کیا، کہا ہم سے ابن جریج نے بیان کیا، کہا کہ مجھ سے عبید اللہ بن عمر نے بیان کیا, قاسم بن محمد سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عُبَيْدُ اللهِ بْنُ عُمَرَ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، قَالَ: جَاءَتْ عَائِشَةُ حَاجَّةً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 10176,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=407",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=405",
                "label": "405",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=406",
                "label": "406",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=407",
                "label": "407",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=408",
                "label": "408",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=409",
                "label": "409",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=410",
                "label": "410",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=411",
                "label": "411",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=409",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=409",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=407",
        "to": 10200,
        "total": 40465
    }
}