{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 342,
        "data": [
            {
                "id": 8814,
                "hadithNumber": "1250",
                "englishNarrator": "Ibn Suhaib reported:",
                "hadithEnglish": "Anas رضی ‌اللہ ‌عنہ ‌was asked about the garlic; he stated that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had said: He who eats of this plant (garlic) should not approach us and pray along with us.",
                "hadithUrdu": "حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے لہسن کے بارے میں پوچھا گیا تو انھوں نے جواب دیا : رسول اللہ ﷺ نے فرمایا : ’’جس نے اس پودے میں سے کچھ کھایا ہو وہ ہرگز ہمارے قریب نہ آئے اور نہ ہمارے ساتھ نماز پڑھے ۔ ‘ ‘",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، کہا کہ ہم سے اسماعیل نے بیان کیا، یعنی ابن اُلیہ نے, عبدالعزیز سے ، جو صہیب کے بیٹے ہیں ، روایت ہے کہ",
                "hadithArabic": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ يَعْنِي ابْنَ عُلَيَّةَ، عَنْ عَبْدِ الْعَزِيزِ وَهُوَ ابْنُ صُهَيْبٍ، قَالَ: سُئِلَ أَنَسٌ عَنِ الثُّومِ، فَقَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَكَلَ مَنْ هَذِهِ الشَّجَرَةِ، فَلَا يَقْرَبَنَّا، وَلَا يُصَلِّي مَعَنَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8815,
                "hadithNumber": "1251",
                "englishNarrator": "Abu Huraira ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: He who eats of this plant (garlic) should not approach our mosque and should not harm us with the odour of garlic.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’جس نے اس پودے میں سے کچھ کھایا ہو وہ ہرگز ہماری مسجد کے قریب نہ آئے اور نہ ہمیں لہسن کی بو سے تکلیف دے ۔ ‘ ‘",
                "urduNarrator": "مجھ سے محمد بن رافع اور عبد بن حمید نے بیان کیا - عبد نے کہا: ہم سے انہوں نے بیان کیا اور ابن رافع نے کہا, ہم سے عبد الرزاق نے بیان کیا، ہم سے معمر نے ابن المسیب کی سند سے الزہریری کے بارے میں بیان کیا،حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ",
                "hadithArabic": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ - قَالَ عَبْدٌ: أَخْبَرَنَا، وَقَالَ ابْنُ رَافِعٍ: - حَدَّثَنَا عَبْدٌ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنِ ابْنِ الْمُسَيِّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَكَلَ مِنْ هَذِهِ الشَّجَرَةِ، فَلَا يَقْرَبَنَّ مَسْجِدَنَا، وَلَا يُؤْذِيَنَّا بِرِيحِ الثُّومِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8816,
                "hadithNumber": "1252",
                "englishNarrator": "Jabir ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade eating of onions and leek. When we were overpowered by a desire (to eat) we ate them. Upon this he (the Holy Prophet) said: He who eats of this offensive plant must not approach our mosque, for the angels are harmed by the same things as men.",
                "hadithUrdu": "رسول اللہ ﷺ نے پیاز اور گندنا کھا نے سے منع فرمایا ۔ سو ( ایک مرتبہ ) ہم ضرورت سے مجبور ہو گئے اور انھیں کھا لیا تو آپ نے فرمایا : ’’جس نے اس بدبودار سبزی میں سے کچھ کھایا ہو وہ ہرگز ہماری مسجد کے قریب نہ آئے ، فرشتے بھی یقیناً اس چیز سے تکلیف محسوس کرتے ہیں جس سے انسان تکلیف محسوس کرتے ہیں ۔ ‘ ‘",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے کثیر بن ہشام نے بیان کیا، وہ ہشام الدستوائی کی سند سے,ابو زبیر نے حضرت جابر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا كَثِيرُ بْنُ هِشَامٍ، عَنْ هِشَامٍ الدَّسْتُوَائِيِّ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ: نَهَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، عَنْ أَكْلِ الْبَصَلِ وَالْكُرَّاثِ، فَغَلَبَتْنَا الْحَاجَةُ، فَأَكَلْنَا مِنْهَا، فَقَالَ: «مَنْ أَكَلَ مِنْ هَذِهِ الشَّجَرَةِ الْمُنْتِنَةِ، فَلَا يَقْرَبَنَّ مَسْجِدَنَا، فَإِنَّ الْمَلَائِكَةَ تَأَذَّى، مِمَّا يَتَأَذَّى مِنْهُ الْإِنْسُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8817,
                "hadithNumber": "1253",
                "englishNarrator": "Jabir ‌رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: He who eats garlic or onion should remain away from us or from our mosque and stay in his house. A kettle was brought to him which had (cooked) vegetables in it, He smelt (offensive) odour in it. On asking he was informed of the vegetables (cooked in it). He said: Take it to such and such Companion. When he saw it, he also disliked eating it. (Upon this). he (the Holy Prophet) said: You may eat it, for I converse with one with whom you do not converse.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’جس نے لہسن یا پیاز کھایا وہ ہم سے دور رہے یا ہماری مسجدوں سے دور رہے اور اپنے گھر بیٹھے ۔ ‘ ‘ اور ایسا ہو ا کہ ( ایک دفعہ ) آپ کے پاس ایک ہانڈی لائی گئی جس میں کچھ سبز ترکاریاں تھیں ، آپ نے ان سے کچھ بو محسوس کی تو ان کے متعلق پوچھا ۔ آپ کو ان ترکاریوں کے بارے میں بتایا گیا جو اس میں ( ڈالی گئی ) تھیں تو آپ نے اسے ، اپنے ساتھیوں میں سے ایک کے پاس لے جانے کو کہا ۔ جب اس نے بھی اسے دیکھ کر ( آپ کی ناپسندیدگی کی بنا پر ) اس کو ناپسند کیا تو آپ نے فرمایا : ’’تم کھا لو کیونکہ میں ان سے سرگوشی کرتا ہوں جن سے تم سرگوشی نہیں کرتےہو ۔ ‘ ‘ ( اس سے فرشتے مراد ہیں ۔ صحیح ابن خزیمہ اور صحیح ابن حبان کی روایت میں اس بات کی صراحت موجود ہے ۔ )",
                "urduNarrator": "ابو طاہر اور حرملہ نے کہا : ہمیں ابن وہب نے خبر دی ، کہا : مجھے یونس نے ابن شہاب سے خبر دی ، انھوں نے کہا : مجھے عطاء بن ابی رباح نے حدیث بیان کی کہ حضرت جابر بن عبداللہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نےکہا ۔ حرملہ کی روایت میں ہے ، ان ( جابر ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) کو یقین تھا کہ",
                "hadithArabic": "وحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، قَالَا: أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ: حَدَّثَنِي عَطَاءُ بْنُ أَبِي رَبَاحٍ، أَنَّ جَابِرَ بْنَ عَبْدِ اللهِ، قَالَ: وَفِي رِوَايَةِ حَرْمَلَةَ، وَزَعَمَ أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «مَنْ أَكَلَ ثُومًا أَوْ بَصَلًا، فَلْيَعْتَزِلْنَا أَوْ لِيَعْتَزِلْ مَسْجِدَنَا، وَلْيَقْعُدْ فِي بَيْتِهِ» وَإِنَّهُ أُتِيَ بِقِدْرٍ فِيهِ خَضِرَاتٌ مِنْ بُقُولٍ، فَوَجَدَ لَهَا رِيحًا، فَسَأَلَ فَأُخْبِرَ بِمَا فِيهَا مِنَ الْبُقُولِ، فَقَالَ: «قَرِّبُوهَا» إِلَى بَعْضِ أَصْحَابِهِ، فَلَمَّا رَآهُ كَرِهَ أَكْلَهَا، قَالَ: «كُلْ فَإِنِّي أُنَاجِي مَنْ لَا تُنَاجِي».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8818,
                "hadithNumber": "1254",
                "englishNarrator": "Jabir bin 'Abdullah ‌رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) mying: He who eats of this (offensive) plant, i.e. garlic, and sometimes he said: He who eats onion and garlic and leek, should not approach our mosque for the angels are harmed by the same things as the children of Adam.",
                "hadithUrdu": "نبی اکرم ﷺ نے فرمایا : ’’ جس نے یہ ترکاری لہسن کھا یا ۔ ‘ ‘ اور ایک دفعہ فرمایا : ’’ جس نے پیاز ، لہسن اور گندنا کھایا ۔ تو وہ ہر گز ہماری مسجد کے قریب نہ آئے کیونکہ فرشتے ( بھی ) ان چیزوں سے اذیت محسوس کرتے ہیں جس جن سے آدم کے بیٹے اذیت محسوس کرتےہیں ۔ ‘ ‘",
                "urduNarrator": "مجھ سے محمد بن حاتم نے کہا,یحییٰ بن سعید نے ابن جریج سے حدیث بیان کی ، انھوں کہا : مجھے عطاء نے حضرت جابر بن عبداللہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے خبر دی کہ",
                "hadithArabic": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنِ ابْنِ جُرَيْجٍ، قَالَ: أَخْبَرَنِي عَطَاءٌ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: مَنْ أَكَلَ مِنْ هَذِهِ الْبَقْلَةِ، الثُّومِ - وقَالَ مَرَّةً: مَنْ أَكَلَ الْبَصَلَ وَالثُّومَ وَالْكُرَّاثَ فَلَا يَقْرَبَنَّ مَسْجِدَنَا، فَإِنَّ الْمَلَائِكَةَ تَتَأَذَّى مِمَّا يَتَأَذَّى مِنْهُ بَنُو آدَمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8819,
                "hadithNumber": "1255",
                "englishNarrator": "Ibn Juraij has narrated it with the same chain of transmitters:",
                "hadithEnglish": "He who eats of this plant, i. e. garlic, should not come to us in our mosque, and he made no mention of onions or leek.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’جس نے اس پودے ۔ آپ کی مراد لہسن سے تھی ۔ میں سے کچھ کھایا ہو وہ ہماری مسجد میں ہمارے پاس نہ آئے ۔ ‘ ‘ اور انھوں ( ابن جریج ) نے پیاز اور گندنے کا ذکر نہیں کیا ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا،محمد بن بکر اور عبدالرزاق نے ( دو مختلف سندوں سے روایت کرتے ہوئے ) کہا : ہمیں ابن جریج نے اسی ( سابقہ ) سند کے ساتھ خبر دی کہ",
                "hadithArabic": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ ح قَالَ: وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَا: جَمِيعًا أَخْبَرَنَا ابْنُ جُرَيْجٍ، بِهَذَا الْإِسْنَادِ مَنْ أَكَلَ مِنْ هَذِهِ الشَّجَرَةِ يُرِيدُ الثُّومَ فَلَا يَغْشَنَا فِي مَسْجِدِنَا وَلَمْ يَذْكُرِ الْبَصَلَ وَالْكُرَّاثَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8820,
                "hadithNumber": "1256",
                "englishNarrator": "Abu Sa'id رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "We made no transgression but Khaybar was conquered. We, the Companions of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), fell upon this plant. i e. garlic. because the people were hungry. We ate it to our heart's content and then made our way towards the mosque. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) sensed its odour and he said: He who takes anything of this offensive plant must not approach us in the mosque. The people said: Its (use) has been forbidden; its (use) bu been forbidden. This reached the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and he said: O people, I cannot forbid (the use of a thing) which Allah has made lawful, but (this garlic) is a plant the odour of which is repugnant to me.",
                "hadithUrdu": "ہم خیبر کی فتح سے فارغ نہیں ہوئے تھے کہ ہم ، رسول اللہ ﷺ کے ساتھی ، اس ترکاری ۔ لہسن ۔ پر جا پڑے ، لوگ بھوکے تھے اورہم نے اسے خوب اچھی طرح کھایا ، پھر ہم مسجد کی طرف گئے تو رسول اللہ ﷺ نے بومحسوس کی ۔ آپ نے فرمایا : ’’جس نے اس بدبودار پودے میں سے کچھ کھایا ہے وہ مسجد میں ہمارے قر یب نہ آئے ۔ ‘ ‘ اس پر لوگ کہنے لگے : ( لہسن ) حرام ہو گیا ، حرام ہو گیا ۔ یہ بات نبی ﷺ تک پہنچی تو آپ نے فرمایا : ’’ اے لوگو! ایسی چیز کو حرام کرنا میرے ہاتھ میں نہیں جسے اللہ نے میرے لیے حلال کر دیا ہے لیکن یہ ایسا پودا ہے جس کی بو مجھے ناپسند ہے ۔ ‘ ‘",
                "urduNarrator": "مجھ سے عمرو ناقد نے بیان کیا، ہم سے اسماعیل بن اُعلیہ نے بیان کیا، الجریری کی سند سے، ابو نضرہ سے,حضرت ابو سعید ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے ، انھوں  نے کہا",
                "hadithArabic": "وَحَدَّثَنِي عَمْرٌو النَّاقِدُ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنِ الْجُرَيْرِيِّ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ، قَالَ: لَمْ نَعْدُ أَنْ فُتِحَتْ خَيْبَرُ فَوَقَعْنَا أَصْحَابَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي تِلْكَ الْبَقْلَةِ الثُّومِ وَالنَّاسُ جِيَاعٌ، فَأَكَلْنَا مِنْهَا أَكْلًا شَدِيدًا، ثُمَّ رُحْنَا إِلَى الْمَسْجِدِ، فَوَجَدَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الرِّيحَ فَقَالَ: «مَنْ أَكَلَ مِنْ هَذِهِ الشَّجَرَةِ الْخَبِيثَةِ شَيْئًا، فَلَا يَقْرَبَنَّا فِي الْمَسْجِدِ» فَقَالَ النَّاسُ: حُرِّمَتْ، حُرِّمَتْ، فَبَلَغَ ذَاكَ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «أَيُّهَا النَّاسُ إِنَّهُ لَيْسَ بِي تَحْرِيمُ مَا أَحَلَّ اللهُ لِي، وَلَكِنَّهَا شَجَرَةٌ أَكْرَهُ رِيحَهَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8821,
                "hadithNumber": "1257",
                "englishNarrator": "Abu Sa'id al-Khudri رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) along with his Companions happened to pass by a field in which onions were sown. The people stopped there and ate out of that, but some of them did not eat. Then they (Propbet's Companions) went to him. He (first) called those who had not eaten the onions and kept the others (who had taken onions) waiting till its odour vanished.",
                "hadithUrdu": "رسول اللہ ﷺ اور آپ کے صحابہ ( ایک دفعہ ) پیاز کے ایک کھیت کے پاس سے گزرے ۔ ان میں سے کچھ لوگ اترے اور اس میں سے کچھ کھا لیا ، اور دوسروں نے نہ کھایا ۔ ہم آپ کے پاس گئے تو آپ نے ان لوگوں کو ( قریب ) بلا لیا جنھوں نے پیاز نہیں کھا یا تھا اور دوسرے ( جنھوں نے پیاز کھایا تھا ) انھیں پیچھے کر دیا یہاں تک کہ اس کی بو ختم ہو گئی ۔",
                "urduNarrator": "ہم سے ہارون بن سعید الایلی اور احمد بن عیسیٰ نے بیان کیا، کہا کہ ہم سے ابن وہب نے بیان کیا، کہا کہ مجھ سے عمرو نے بقیر بن اشج کے واسطہ سے ابن خاں دروازہ سے بیان کیا,حضرت ابو سعید خدری ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ، وَأَحْمَدُ بْنُ عِيسَى، قَالَا: حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو، عَنْ بُكَيْرِ بْنِ الْأَشَجِّ، عَنِ ابْنِ خَبَّابٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ: «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مَرَّ عَلَى زَرَّاعَةِ بَصَلٍ هُوَ وَأَصْحَابُهُ، فَنَزَلَ نَاسٌ مِنْهُمْ فَأَكَلُوا مِنْهُ. . وَلَمْ يَأْكُلْ آخَرُونَ، فَرُحْنَا إِلَيْهِ فَدَعَا الَّذِينَ لَمْ يَأْكُلُوا الْبَصَلَ وَأَخَّرَ الْآخَرِينَ، حَتَّى ذَهَبَ رِيحُهَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8822,
                "hadithNumber": "1258",
                "englishNarrator": "Ma'dan bin Talha ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "'Umar bin Khattab ‌رضی ‌اللہ ‌عنہ ‌, delivered the Friday sermon and he made a mention of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and Abu Bakr. He (further) said: I saw in a dream that a cock pecked me twice, and I perceive that my death is near. Some people have suggested me to appoint my successor. And Allah would not destroy His religion. His caliphate and that with which He sent His Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) If death approaches me soon, the (issue) of Caliphate (would be decided) by the consent of these six men with whom the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) remained well pleased till his death. And I know fully well that some people would blame me that I killed with these very hands of mine some persons who apparently professed (Islam). And if they do this (blame me) they are the enemies of Allah, and are non-believers and have gone astray. And I leave not after me anything which to my mind seems more important than Kalala. And I never turned towards the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) (for guidance) more often than this Kalala, and he (the Holy Prophet) was not annoyed with me on any other (issue) than this: (And he was so perturbed) that he struck his fingers on my chest and said: Does this verse. that is at the end of Surat al-Nisa'. which was revealed in the hot season not suffice you? And if I live longer I would decide this (problem so clearly) that one who reads the Qur'an, or one who does not read it, would be able to take (correct), decisions (under its light). He ('Umar) further said: Allah! I call You witness on these governors of lands, that I sent them to (the peoples of these lands) so that they should administer justice amongst them, teach them their religion and the Sunnah of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), and distribute amongst them the spoils of war and refer to me that which they find difficult to perform. O people. you eat 'these two plants and these are onions and garlic. and I find them nothing but repugnant for I saw that when the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) sensed the odour of these two from a person in a mosque, he was made to go to al-Baqi'. So he who eats it should (make its odour) die by cooking it well.",
                "hadithUrdu": "عمر بن خطاب ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے جمعے کے دن خطبہ دیا اور نبی اکرم ﷺ اور ابوبکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کا تذکرہ کیا ، کہا : میں نے خواب دیکھا ہے ، جیسے ایک مرغ نے مجھے تین ٹھونگیں ماری ہیں اور اس کو میں اپنی موت قریب آنے کے سوا اور کچھ نہیں سمجھتا ۔ اور کچھ قبائل مجھ سے مطالبہ کر رہے ہیں کہ میں کسی کو اپنا جانشین بنادو ں ۔ بلا شبہ اللہ تعالیٰ اپنے دین کو ضائع نہیں ہونے دے گا ، نہ اپنی خلافت کو اور نہ اس شریعت کو جس کے ساتھ اس نے اپنے نبی ﷺ کو مبعوث فرمایا ۔ اگر مجھے جلد موت آجائے تو خلافت ان چھ حضرات کے باہیم مشورے سے طے ہو گی جن سے رسول اللہ ﷺ اپنی وفات کے وقت خوش تھے ۔ اور میں جانتا ہوں کہ کچھ لوگ جن کو میں نے اسلام کی خاطر اپنے اس ہاتھ سے مارا ہے ، وہ اس امر ( خلافت ) پر اعتراض کریں گے ، اگر وہ ایسا کریں گے تو وہ اللہ کے دشمن ، کافر اور گمراہ ہوں گے ، پھر میں اپنے بعد جو ( حل طلب ) چیزیں چھوڑ کر جارہا ر ہوں ان میں سے میرے نزدیک کلالہ کی وراثت کےمسئلے سے بڑھ کر کوئی مسئلہ زیادہ اہم نہیں ۔ میں نے رسول اللہ ﷺ سے کسی مسئلے کے بارے میں اتنی دفعہ رجوع نہیں کیا جتنی دفعہ کلالہ کے بارے میں کیا اور آپ نے ( بھی ) میرے ساتھ کسی مسئلے میں اس قدر سختی نہیں برتی جتنی میرے ساتھ آپ نے اس مسئلے میں سختی کی حتیٰ کہ آپ نے انگلی میرے سینے میں چبھو کر فرمایا : ’’اے عمر ! کیا گرمی کے موسم میں اترنے والی آیت تمھارے لیے کافی نہیں جو سورۃ نساء کے آخر میں ہے ؟ ‘ ‘ میں اگر زندہ رہا تو میں اس مسئلے ( کلالہ ) کے بارے میں ایسا فیصلہ کروں گا کہ ( ہر انسان ) جو قرآن پڑھتا ہے یا نہیں پڑھتا ہے اس کے مطابق فیصلہ کر سکے گا ، پھر آپ نے فرمایا : اے اللہ ! میں شہروں کے گورنرون کے بارے میں تجھے گواہ بناتا ہوں کہ میں نے لوگوں پر انھیں صرف اس لیے مقرر کر کے بھیجا کہ وہ ان سے انصاف کریں اور لوگوں کو ان کے دین اور ان کے نبی ﷺ کی سنت کی تعلیم دیں اور ان کے اموال فے ان میں تقسیم کریں اور اگر لوگوں کے معاملات میں انھیں کوئی مشکل پیش آئے تو اسے میرے سامنے پیش کریں ۔ پھر اے لوگو! تم دو پودے کھا تے ہو ، میں انھیں ( بو کے اعتبار سے ) برے پودے ہی سمجھتا ہوں ، یہ پیاز اور لہسن ہیں ۔ میں نے رسول اللہ ﷺ کو دیکھا ، جب مسجد میں آپ کو کسی آدمی سے ان کی بوآتی تو آپ اسے بقیع کی طرف نکال دینے کا حکم صادر فرماتے ، لہذا جو شخص انھیں کھانا چاہتا ہے وہ انھیں پکاکر ان کی بو مار دے ۔",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا، کہا ہم سے یحییٰ بن سعید نے بیان کیا،ہشام نےکہا : ہم سے قتادہ نے حدیث بیان کی ، انھوں نے سالم بن ابی جعد سے اور انھوں نے حضرت معد ان بن ابی طلحہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا هِشَامٌ، حَدَّثَنَا قَتَادَةُ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ مَعْدَانَ بْنِ أَبِي طَلْحَةَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، خَطَبَ يَوْمَ الْجُمُعَةِ، فَذَكَرَ نَبِيَّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَذَكَرَ أَبَا بَكْرٍ قَالَ: إِنِّي رَأَيْتُ كَأَنَّ دِيكًا نَقَرَنِي ثَلَاثَ نَقَرَاتٍ، وَإِنِّي لَا أُرَاهُ إِلَّا حُضُورَ أَجَلِي، وَإِنَّ أَقْوَامًا يَأْمُرُونَنِي أَنَّ أَسْتَخْلِفَ، وَإِنَّ اللهَ لَمْ يَكُنْ لِيُضَيِّعَ دِينَهُ، وَلَا خِلَافَتَهُ، وَلَا الَّذِي بَعَثَ بِهِ نَبِيَّهُ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَإِنْ عَجِلَ بِي أَمْرٌ، فَالْخِلَافَةُ شُورَى بَيْنَ هَؤُلَاءِ السِّتَّةِ، الَّذِينَ تُوُفِّيَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَهُوَ عَنْهُمْ رَاضٍ، وَإِنِّي قَدْ عَلِمْتُ أَنَّ أَقْوَامًا يَطْعَنُونَ فِي هَذَا الْأَمْرِ، أَنَا ضَرَبْتُهُمْ بِيَدِي هَذِهِ عَلَى الْإِسْلَامِ، فَإِنْ فَعَلُوا ذَلِكَ فَأُولَئِكَ أَعْدَاءُ اللهِ، الْكَفَرَةُ الضُّلَّالُ، ثُمَّ إِنِّي لَا أَدَعُ بَعْدِي شَيْئًا أَهَمَّ عِنْدِي مِنَ الْكَلَالَةِ، مَا رَاجَعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي شَيْءٍ مَا رَاجَعْتُهُ فِي الْكَلَالَةِ، وَمَا أَغْلَظَ لِي فِي شَيْءٍ مَا أَغْلَظَ لِي فِيهِ، حَتَّى طَعَنَ بِإِصْبَعِهِ فِي صَدْرِي، فَقَالَ: «يَا عُمَرُ أَلَا تَكْفِيكَ آيَةُ الصَّيْفِ الَّتِي فِي آخِرِ سُورَةِ النِّسَاءِ؟» وَإِنِّي إِنْ أَعِشْ أَقْضِ فِيهَا بِقَضِيَّةٍ، يَقْضِي بِهَا مِنْ يَقْرَأُ الْقُرْآنَ وَمَنْ لَا يَقْرَأُ الْقُرْآنَ، ثُمَّ قَالَ: اللهُمَّ إِنِّي أُشْهِدُكَ عَلَى أُمَرَاءِ الْأَمْصَارِ، وَإِنِّي إِنَّمَا بَعَثْتُهُمْ عَلَيْهِمْ لِيَعْدِلُوا عَلَيْهِمْ، وَلِيُعَلِّمُوا النَّاسَ دِينَهُمْ، وَسُنَّةَ نَبِيِّهِمْ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَيَقْسِمُوا فِيهِمْ فَيْئَهُمْ، وَيَرْفَعُوا إِلَيَّ مَا أَشْكَلَ عَلَيْهِمْ مِنْ أَمْرِهِمْ، ثُمَّ إِنَّكُمْ، أَيُّهَا النَّاسُ تَأْكُلُونَ شَجَرَتَيْنِ لَا أَرَاهُمَا إِلَّا خَبِيثَتَيْنِ، هَذَا الْبَصَلَ وَالثُّومَ لَقَدْ رَأَيْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، إِذَا وَجَدَ رِيحَهُمَا مِنَ الرَّجُلِ فِي الْمَسْجِدِ، أَمَرَ بِهِ فَأُخْرِجَ إِلَى الْبَقِيعِ، فَمَنْ أَكَلَهُمَا فَلْيُمِتْهُمَا طَبْخًا",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8823,
                "hadithNumber": "1259",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated by Qatada with the same chain of transmitters.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے اسماعیل بن اولیاء نے بیان کیا,سعید بن ابی عروبہ اور شعبہ نے قتادہ سے اسی سند کے ساتھی اسی کے مانند روایت کی.",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، ح قَالَ: وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، كِلَاهُمَا عَنْ شَبَابَةَ بْنِ سَوَّارٍ، قَالَ: حَدَّثَنَا شُعْبَةُ، جَمِيعًا عَنْ قَتَادَةَ، فِي هَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8824,
                "hadithNumber": "1260",
                "englishNarrator": "Abu Huraira ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: If anyone hears a man crying out in the mosque about something he has lost, he should say: May Allah not restore it to you, for the mosques were not built for this.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’جوشخص کسی آدمی کو مسجد میں کسی گم شدہ جانور کے بارے میں اعلان کرتے ہوئے سنے تو وہ کہے : اللہ تمھارا جانور تمھیں نہ لوٹائے کیونکہ مسجدیں اس کام کے لیے نہیں بنائی گئیں ۔ ‘ ‘",
                "urduNarrator": "ہم سے ابو الطاہر احمد بن عمرو نے بیان کیا, ابن وہب نےہمیں حدیث سنائی ، انھوں نے حیوہ سے ، انھوں نے محمد بن عبدالرحمن سے ، انھوں نے شدادبن ہاد کے آزاد کردہ غلام ابو عبداللہ سے روایت کی کہ انھوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنا ، وہ کہہ رہے تھے",
                "hadithArabic": "حَدَّثَنَا أَبُو الطَّاهِرِ أَحْمَدُ بْنُ عَمْرٍو، حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ حَيْوَةَ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي عَبْدِ اللهِ، مَوْلَى شَدَّادِ بْنِ الْهَادِ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ سَمِعَ رَجُلًا يَنْشُدُ ضَالَّةً فِي الْمَسْجِدِ فَلْيَقُلْ لَا رَدَّهَا اللهُ عَلَيْكَ فَإِنَّ الْمَسَاجِدَ لَمْ تُبْنَ لِهَذَا».",
                "headingArabic": "النَّهْىِ عَنْ نَشْدِ الضَّالَّةِ، فِي الْمَسْجدِ وَمَا يَقُولُهُ مَنْ سَمِعَ النَّاشِدَ ‏",
                "headingUrdu": "مسجد میں گمشدہ جائیداد کے اعلانات کرنے کی ممانعت، اور جو شخص کسی شخص کو ایسا اعلان کرتے ہوئے سنتا ہے وہ کیا کہے؟",
                "headingEnglish": "The prohibition of making lost property announcements in the masjid, and what should be said by one who hears a person making such an announcement",
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8825,
                "hadithNumber": "1261",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saying like this.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے بھی کچھ ایسا ہی ارشاد فرمایا۔",
                "urduNarrator": "ہم سے زہیر بن حرب نے بیان کیا، انہوں نے کہا: میں نے ابو الاسود رضی اللہ عنہ کو کہتے سنا: انہوں نے ابوہریرہ رضی اللہ عنہ کو کہتے سنا",
                "hadithArabic": "وحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا الْمُقْرِئُ، حَدَّثَنَا حَيْوَةُ، قَالَ: سَمِعْتُ أَبَا الْأَسْوَدِ، يَقُولُ: حَدَّثَنِي أَبُو عَبْدِ اللهِ، مَوْلَى شَدَّادٍ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8826,
                "hadithNumber": "1262",
                "englishNarrator": "Sulaiman bin Buraida narrated it on the authority of his father:",
                "hadithEnglish": "A man cried out in the mosque saying: Who had called out for the red camel? Upon this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: May it not be restored to you! The mosques are built for what they are meant.",
                "hadithUrdu": "ایک آدمی نے مسجد میں اعلان کیا اور کہا : جو سرخ اونٹ ( کی نشاندہی ) کے لیے آواز دے گا ۔ تو نبی ﷺ فرمانے لگے : ’’تجھے ( تیرا اونٹ ) نہ ملے ، مسجدیں صرف انھی کاموں کے لیے بنائی گئی ہیں جن کے لیے انھیں بنایا گیا ۔ ‘ ‘ ( یعنی عبادت اور اللہ کے ذکر کے لیے ۔ )",
                "urduNarrator": "مجھ سے حجاج بن الشاعر نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا,سفیان ثوری نے ہمیں خبر دی ، انھوں نے علقمہ بن مرثد سے ، انھوں نے سلیمان بن بریدہ سے اور انھوں نے اپنے والد ( بریدہ بن حصیب اسلمی ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا الثَّوْرِيُّ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، أَنَّ رَجُلًا نَشَدَ فِي الْمَسْجِدِ فَقَالَ: مَنْ دَعَا إِلَى الْجَمَلِ الْأَحْمَرِ، فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا وَجَدْتَ، إِنَّمَا بُنِيَتِ الْمَسَاجِدُ لِمَا بُنِيَتْ لَهُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8827,
                "hadithNumber": "1263",
                "englishNarrator": "Sulaiman bin Buraida reported on the authority of his father:",
                "hadithEnglish": "When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had said prayer a man stood up and said: Who called for a red camel? (Upon this) the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: May it not be restored to you! The mosques are built for what they are meant.",
                "hadithUrdu": "( ایک بار ) جب نبی ﷺ نے نمازپڑھائی تو ایک آدمی نے کھڑے ہو کر کہا : جو سرخ اونٹ ( کی نشاندہی ) کے لیے آواز دے گل ۔ تو نبی اکرم ﷺ نے فرمایا : ’’تم ( اپنا اونٹ ) نہ پاؤ ، مساجد صرف انھی کاموں کے لیے بنائی گئی ہیں جن کے لیے انھیں بنایا گیا ۔ ‘ ‘",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے وکیع نے بیان کیا,ابو سنان نے علقمہ بن مرثد سے ، انھوں نے سلیمان بن بریدہ سے اور انھوں نےاپنے والد سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ أَبِي سِنَانٍ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لَمَّا صَلَّى قَامَ رَجُلٌ فَقَالَ: مَنْ دَعَا إِلَى الْجَمَلِ الْأَحْمَرِ، فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا وَجَدْتَ، إِنَّمَا بُنِيَتِ الْمَسَاجِدُ لَمَّا بُنِيَتْ لَهُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8828,
                "hadithNumber": "1264",
                "englishNarrator": "Ibn Buraida narrated it on the authority of his father:",
                "hadithEnglish": "A Bedouin came when the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had completed the morning prayer. He thrust his head in the door of the mosque, and then the hadith (as narrated above) was narrated. This hadith has been reported by another chain of transmitters.",
                "hadithUrdu": "جب نبی اکرم ﷺ صبح کی نماز پڑھ چکے تو ایک بدوی آیا اور مسجد کے دروازے سے اپنا سر اندر کیا ......پھر ان دونوں کی حدیث کی طرح بیان کیا ۔ امام مسلم ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : محمد بن شیبہ سے مراد ابو نعامہ شیبہ بن نعامہ ہے جس سے مسعر ، ہشیم ، جریر اور دوسرے کوفی راویوں نے روایت کی ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے جریر نے بیان کیا,محمد بن شیبہ نے علقمہ بن مرثد سے ، انھوں نے ( سلیمان ) بن بریدہ سے اور انھوں نے اپنے والد سے روایت کی کہ",
                "hadithArabic": "دَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنْ مُحَمَّدِ بْنِ شَيْبَةَ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنِ ابْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، قَالَ: جَاءَ أَعْرَابِيٌّ بَعْدَ مَا صَلَّى النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الْفَجْرِ، فَأَدْخَلَ رَأْسَهُ مِنْ بَابِ الْمَسْجِدِ، فَذَكَرَ بِمِثْلِ حَدِيثِهِمَا.قَالَ مُسْلِمٌ: «هُوَ شَيْبَةُ بْنُ نَعَامَةَ، أَبُو نَعَامَةَ رَوَى عَنْهُ مِسْعَرٌ، وَهُشَيْمٌ، وَجَرِيرٌ، وَغَيْرُهُمْ مِنَ الْكُوفِيِّينَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8829,
                "hadithNumber": "1265",
                "englishNarrator": "Abu Huraira رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: When any one of you stands up to pray, the devil comes to him and confuses him to that he does not know how much he has prayed. If any one of you has such an experience he should perform two prostrations while sitting down (in qa'da).",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’بلا شبہ تم میں سے کوئی جب نماز پڑھنے کے لیے کھڑا ہوتا ہے تو شیطان آکر اسے التباس ( شبہ ) میں ڈالتا ہے حتی کہ وہ نہیں جانتا کہ اس نے کتنی ( رکعتیں ) پڑھی ہیں ۔ تم میں سے کوئی جب یہ ( کیفیت ) پائے تووہ ( آخری تشہد میں ) بیٹھے ہوئے دو سجدے کر لے ۔ ‘ ‘",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا,امام مالک نے ابن شہاب ( زہری ) سے ، انھوں نے ابوسلمہ بن عبدالرحمن سے اور انھوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ أَحَدَكُمْ، إِذَا قَامَ يُصَلِّي جَاءَهُ الشَّيْطَانُ فَلَبَسَ عَلَيْهِ، حَتَّى لَا يَدْرِيَ كَمْ صَلَّى، فَإِذَا وَجَدَ ذَلِكَ أَحَدَكُمْ، فَلْيَسْجُدْ سَجْدَتَيْنِ وَهُوَ جَالِسٌ».",
                "headingArabic": "السَّهْوِ فِي الصَّلاَةِ وَالسُّجُودِ لَهُ ‏",
                "headingUrdu": "نماز میں سہو (بھول جانا) اور اس کی تلافی کے لیے سجدہ کرنا",
                "headingEnglish": "As-Sahw (forgetfulness) in prayer and prostrating to compensate for it",
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8830,
                "hadithNumber": "1266",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated by al-Zubri with the same chain of transmitters.",
                "hadithUrdu": "مجھ سے عمرو نقید اور زہیر بن حرب نے بیان کیا، انہوں نے کہاسفیان بن عیینہ اور لیث بن سعد نے زہری سے اسی سند کے ساتھ اسی طرح حدیث بیان کی ہے ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنِي عَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالَا: حَدَّثَنَا سُفْيَانُ وَهُوَ ابْنُ عُيَيْنَةَ، ح قَالَ: وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ رُمْحٍ، عَنِ اللَّيْثِ بْنِ سَعْدٍ، كِلَاهُمَا عَنِ الزُّهْرِيِّ، بِهَذَا الْإِسْنَادِ نَحْوَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8831,
                "hadithNumber": "1267",
                "englishNarrator": "Abu Huraira رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: When there is a call to prayer the devil runs back breaking the wind so that he may not hear the call, and when the call is complete he comes back. And when the takbir is pronounced he again runs back, and when takbir is over he comes back and distracts a man saying: Remember such and such, remember such and such, referring to something the man did not have in his mind. with the result that he does not know how much he has prayed; so when any one of you is not sure how much he has prayed. he should perform two prostrations while sitting (qa'da).",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’جب اذان کہی جاتی ہے تو شیطان پیٹھ پھیر کر بھاگتا ہے گوزمار رہا ہوتا ہے تاکہ اذان ( کی آواز ) نہ سنے ۔ جب اذان ختم ہو جاتی ہے تو ( واپس ) آتا ہے ، پھر جب نماز کے لیےتکبیر کہی جاتی ہے تو پیٹھ پھیر کر بھاگ جاتا ہے ، جب تکبیر ختم ہو جاتی ہے تو آجاتا ہے تاکہ انسان اور اس کے دل کے درمیان خیال آرائی شروع کروائے ، وہ کہتا ہے : فلاں بات یاد کرو ، فلاں چیز یاد کرو ۔ وہ چیزیں ( اسے یاد کراتا ہے ) جو اسے یاد نہیں ہوتیں حتی کہ وہ شخص یوں ہو جاتا ہے کہ اسے یا د نہیں رہتا اس نے کتنی رکعتیں پڑھی ہیں ، چنانچہ جب تم میں سے کسی کو یاد نہ رہے کہ اس نے کتنی رکعتیں پڑھی ہیں تو وہ ( تشہد میں ) بیٹھے بیٹھے دو سجدے کر لے ۔ ‘ ‘",
                "urduNarrator": "ہم سے محمد بن المثنیٰ نے بیان کیا، کہا ہم سے معاذ بن ہشام نے بیان کیا، مجھ سے میرے والد نے بیان کیا, یحییٰ بن ابی کثیر سے روایت ہے ، کہا : ہمیں ابو سلمہ بن عبدالرحمن نے حدیث سنائی کہ حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے انھیں حدیث بیان کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنِي أَبِي، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، حَدَّثَنَا أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ، حَدَّثَهُمْ أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: إِذَا نُودِيَ بِالْأَذَانِ أَدْبَرَ الشَّيْطَانُ لَهُ ضُرَاطٌ، حَتَّى لَا يَسْمَعَ الْأَذَانَ، فَإِذَا قُضِيَ الْأَذَانُ أَقْبَلَ، فَإِذَا ثُوِّبَ بِهَا أَدْبَرَ، فَإِذَا قُضِيَ التَّثْوِيبُ أَقْبَلَ يَخْطُرُ بَيْنَ الْمَرْءِ وَنَفْسِهِ، يَقُولُ: اذْكُرْ كَذَا، اذْكُرْ كَذَا، لِمَا لَمْ يَكُنْ يَذْكُرُ، حَتَّى يَظَلَّ الرَّجُلُ إِنْ يَدْرِي كَمْ صَلَّى، فَإِذَا لَمْ يَدْرِ أَحَدُكُمْ كَمْ صَلَّى فَلْيَسْجُدْ سَجْدَتَيْنِ وَهُوَ جَالِسٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8832,
                "hadithNumber": "1268",
                "englishNarrator": "Abu Huraira ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: The devil takes to his heels breaking wind when the prayer begins. and the rest is the same but with this addition: He (the devil) makes him think of pleasant things (or things productive of enjoyment) and of the things wished for, and reminds him of such needs which he had forgotten.",
                "hadithUrdu": "رسول اللہ ﷺ نےفرمایا : ’’جب نماز کے لیے تکبیر کہی جاتی ہے تو شیطان پیٹھ پھیر کر گوز مارتا ہوا بھاگتا ہے ...... ‘ ‘ آگے اوپر کی روایت کی طرح ذکر کیا اور یہ اضافہ کیا : ’’اسے رغبت اور امید دلاتا ہے اور اسے اس کی ایسی ضرورتیں یاد دلاتا ہے جو اسے یاد نہیں ہوتیں ۔ ‘ ‘",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، کہا کہ مجھ سے عمرو نے، عبد ربہ بن سعید کے واسطہ سے,عبدالرحمن اعرج نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو، عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ، عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ الشَّيْطَانَ إِذَا ثُوِّبَ بِالصَّلَاةِ وَلَّى وَلَهُ ضُرَاطٌ» فَذَكَرَ نَحْوَهُ، وَزَادَ «فَهَنَّاهُ وَمَنَّاهُ، وَذَكَّرَهُ مِنْ حَاجَاتِهِ مَا لَمْ يَكُنْ يَذْكُرُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8833,
                "hadithNumber": "1269",
                "englishNarrator": "Abdullah bin Buhaina ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) led us two rak'ahs of prayer in one of the (obligatory) prayers and then got up and did not sit. and the people stood up along with him. When he finished the prayer and we expected him to pronounce salutation. he said: Allah is Most Great while sitting and made two prostrations before salutation and then pronounced (the, final) salutation.",
                "hadithUrdu": "رسول اللہ ﷺ نے ہمیں کسی ایک نماز کی دو رکعتیں پڑھائیں ، پھر ( تیسری کے لیے ) کھڑے ہو گئے اور ( درمیان کے تشہد کے لیے ) نہ بیٹھے تو لوگ بھی آپ کے ساتھ کھڑے ہو گئے ، جب آپ نے نماز پوری کر لی اور ہم آپ کے سلام کے انتظار میں تھے توآپ نے تکبیر کہی اور بیٹھے بیٹھے سلام سے پہلے دو سجدے کیے ، پھر سلام پھیر دیا ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا مالک نے ابن شہاب سے ، انھوں نے عبدالرحمن اعرج سے اور انھوں نے حضرت عبداللہ بن بحسینہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ، عَنْ عَبْدِ اللهِ ابْنِ بُحَيْنَةَ، قَالَ: «صَلَّى لَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ رَكْعَتَيْنِ مِنْ بَعْضِ الصَّلَوَاتِ، ثُمَّ قَامَ فَلَمْ يَجْلِسْ، فَقَامَ النَّاسُ مَعَهُ، فَلَمَّا قَضَى صَلَاتَهُ، وَنَظَرْنَا تَسْلِيمَهُ كَبَّرَ، فَسَجَدَ سَجْدَتَيْنِ وَهُوَ جَالِسٌ، قَبْلَ التَّسْلِيمِ، ثُمَّ سَلَّمَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8834,
                "hadithNumber": "1270",
                "englishNarrator": "Abdullah bin Buhaina al-Asadi ‌رضی ‌اللہ ‌عنہ ‌, the ally of Abual-Muttalib, reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) stood up in the noon prayer (though) he hadith sit (after the two rak'ahs). When he completed the prayer he performed two prostrations and said, Allah is the Most Great in each prostration, while he was sitting before pronouncing salutation, and the people performed prostration along with him. That was a compensation for he had forgotten to observe jalsa (after two rak'ahs).",
                "hadithUrdu": "رسول اللہ ﷺ ظہر کی نماز میں ، جب آپ کو ( دوسری رکعت کےبعد ) بیٹھنا تھا ، کھڑے ہوگئے ، پھر جب آپ نے اپنی نماز مکمل کر لی تو آپ نے بیٹھے بیٹھے ہر سجدے کے لیے تکبیر کہتےہوئے سلام سے پہلے دو سجدے کیے ، اور لوگوں نے بھی ( تشہد کے لیے ) بیٹھے کی جگہ ، جو آپ بھول گئے تھے ، آپ کے ساتھ د و سجدے کیے ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ہم سے انہوں نے بیان کیا,لیث نے ابن شہاب سے ، انھوں نےاعرج سے اور انھوں نے حضرت عبداللہ بن بحینہ اسدی ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے ، جو بنو عبدالمطلب کے حلیف تھے ، روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح قَالَ: وَحَدَّثَنَا ابْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنِ الْأَعْرَجِ، عَنْ عَبْدِ اللهِ ابْنِ بُحَيْنَةَ الْأَسْدِيِّ، حَلِيفِ بَنِي عَبْدِ الْمُطَّلِبِ: «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَامَ فِي صَلَاةِ الظُّهْرِ وَعَلَيْهِ جُلُوسٌ، فَلَمَّا أَتَمَّ صَلَاتَهُ سَجَدَ سَجْدَتَيْنِ يُكَبِّرُ فِي كُلِّ سَجْدَةٍ وَهُوَ جَالِسٌ، قَبْلَ أَنْ يُسَلِّمَ، وَسَجَدَهُمَا النَّاسُ مَعَهُ، مَكَانَ مَا نَسِيَ مِنَ الْجُلُوسِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8835,
                "hadithNumber": "1271",
                "englishNarrator": "Abdullah bin Malik ibn Buhaina al-Asadi ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) stood up (at the end of two rak'ahs) when he had to sit and proceeded on with the prayer. But when he was at the end of the prayer, he performed a prostration before the salutation and then pronounced the salutation.",
                "hadithUrdu": "رسول اللہ ﷺ دو رکعتوں کےبعد جہاں نماز میں آپ کا بیٹھنے کا ارادہ تھا ، ( وہاں ) کھڑے ہو گئے ، آپ نے اپنی نماز جاری رکھی ۔ پھر جب نماز کے آخرمیں پہنچے تو سلا م سے پہلے سجدے کیے ، اس کے بعد سلام پھیرا ۔",
                "urduNarrator": "ہم سے ابو الربیع الزہرانی نے بیان کیا، ہم سے حماد نے بیان کیا,(ابن شہاب کے بجائے ) یحییٰ بن سعید نے عبدالرحمن اعرج سے اور انھوں نے حضرت عبداللہ بن مالک ابن بحینہ ازدی ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنَا أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ، عَنْ عَبْدِ اللهِ بْنِ مَالِكٍ ابْنِ بُحَيْنَةَ الْأَزْدِيِّ: «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَامَ فِي الشَّفْعِ الَّذِي يُرِيدُ أَنْ يَجْلِسَ فِي صَلَاتِهِ، فَمَضَى فِي صَلَاتِهِ، فَلَمَّا كَانَ فِي آخِرِ الصَّلَاةِ سَجَدَ قَبْلَ أَنْ يُسَلِّمَ، ثُمَّ سَلَّمَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8836,
                "hadithNumber": "1272",
                "englishNarrator": "Abu Sa'id al-Khudri ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: When any one of you is in doubt about his prayer and he does Dot know how much he has prayed, three or four (rak'ahs). he should cast aside his doubt and base his prayer on what he is sure of. then perform two prostrations before giving salutations. If he has prayed five rak'ahs, they will make his prayer an even number for him, and if he has prayed exactly four, they will be humiliation for the devil.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’جب تم میں سے کسی کو اپنی نماز میں شک ہو جائے اور اسے معلوم نہ ہو کہ اس نے کتنی رکعتیں پڑھ لی ہیں ؟ تین یا چار ؟ تو وہ شک کو چھوڑ دے اور جتنی رکعتوں پر اسے یقین ہے ان پر بنیاد رکھے ( تین یقینی ہیں تو چوتھی پڑھ لے ) پھر سلام سے پہلے دو سجدے کر لے ، اگر اس نے پانچ رکعتیں پڑھ لی ہیں تو یہ سجدے اس کی نماز کو جفت ( چھ رکعتیں ) کر دیں گے ارو اگر اس نے چار کی تکمیل کر لی تھی تو یہ سجدے شیطان کی ذلت و رسوائی کا باعث ہوں گے ۔ ‘ ‘",
                "urduNarrator": "مجھ سے محمد بن احمد بن ابی خلف نے بیان کیا، ہم سے موسیٰ بن داؤد نے بیان کیا,سلیمان بن بلال نے زید بن اسلم سے ، انھوں نے عطاء بن یسار سے اور انھوں نے حضرت ابو سعید خدری ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنِي مُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ، حَدَّثَنَا مُوسَى بْنُ دَاوُدَ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا شَكَّ أَحَدُكُمْ فِي صَلَاتِهِ، فَلَمْ يَدْرِ كَمْ صَلَّى ثَلَاثًا أَمْ أَرْبَعًا، فَلْيَطْرَحِ الشَّكَّ وَلْيَبْنِ عَلَى مَا اسْتَيْقَنَ، ثُمَّ يَسْجُدُ سَجْدَتَيْنِ قَبْلَ أَنْ يُسَلِّمَ، فَإِنْ كَانَ صَلَّى خَمْسًا شَفَعْنَ لَهُ صَلَاتَهُ، وَإِنْ كَانَ صَلَّى إِتْمَامًا لِأَرْبَعٍ كَانَتَا تَرْغِيمًا لِلشَّيْطَانِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8837,
                "hadithNumber": "1273",
                "englishNarrator": "This hadith has been narrated by Zaid bin Aslam with the same chain of transmitters and he said:",
                "hadithEnglish": "He should perform two prostrations before the salutation, as it was mentioned by Sulaiman bin Bilal.",
                "hadithUrdu": "وہ ’’ ( نمازی ) سلام پھیرنے سے پہلے دو سجدے کر لے ۔ ‘ ‘ جس طرح سلیمان بن بلال نے کہا ۔",
                "urduNarrator": "مجھ سے احمد بن عبدالرحمٰن بن وہب نے بیان کیا، مجھ سے میرے چچا عبداللہ نے بیان کیا,داؤد بن قیس نے زید بن اسلم سے اسی سند کے ساتھ روایت کی اور اس کے معنی کے مطابق یہ کہا",
                "hadithArabic": "حَدَّثَنِي أَحْمَدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ وَهْبٍ، حَدَّثَنِي عَمِّي عَبْدِ اللهِ، حَدَّثَنِي دَاوُدُ بْنُ قَيْسٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، بِهَذَا الْإِسْنَادِ، وَفِي مَعْنَاهُ قَالَ: «يَسْجُدُ سَجْدَتَيْنِ قَبْلَ السَّلَامِ» كَمَا قَالَ: سُلَيْمَانُ بْنُ بِلَالٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8838,
                "hadithNumber": "1274",
                "englishNarrator": "Alqama narrated It on the authority of 'Abdullah (bin Mas'ud) who said:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said the prayer; (the narrator added): He made some act of omission or commission when he pronounced salutation; it was said to him: Messenger of Allah, is there something new about the prayer? He (the Holy Prophet) said: What is it? They said: You said prayer in such and such away. He (the narrator) said: He (the Holy Prophet) turned his feet and faced the Qibla and performed two prostrations and then pronounced salutations, and then turned his face towards us and said: If there is anything new about prayer (new command from the Lord) I informed you of that. But I am a human being and I forget as you for. get, so when I forget, remind me, and when any one of you is in doubt about his prayer. he should aim at what Is correct. and complete his prayer in that respect and then make two prostrations.",
                "hadithUrdu": "رسول اللہ ﷺ نے ہمیں نماز پڑھائی ۔ ابراہیم نے کہا : آپ نے اس میں زیادتی یا کمی کر دی ۔ پھر جب آپ نے سلام پھرا تو آپ سے عرض کی گئی : اے اللہ کے رسول ! کیانماز میں کوئی نئی چیز ( تبدیلی ) آگئی ہے ؟ آپ نے پوچھا : ’’وہ کیا ؟ ‘ ‘ صحابہ نے عرض کی : آپ نے اتنی اتنی رکعتیں پڑھائی ہیں ۔ ( راوی نے کہا : ) آپ نے اپنے پاؤں موڑے ، قبلہ کی طرف رخ کیا اور دو سجدے کیے ، پھر سلام پھیرا ، پھر آپ نے ہماری طرف رخ کیا اور فرمایا : ’’اگر نماز میں کوئی نئی بات ہوتی تو میں تمھیں بتا دیتا ، لیکن میں ایک انسان ہوں ، جس طرح تم بھولتے ہومیں بھی بھول جاتا ہوں ، اس لیے جب میں بھول جاؤں تو مجھے یاد دلا دیا کرو اور جب تم میں سے کسی کو اپنی نماز کے بارے میں شک ہو جائے تو وہ صحیح کی جستجو کرے اور ا س کے مطابق ( نماز کی ) تکمیل کرے ، پھر ( سہو کے ) دو سجدے کر لے ۔ ‘ ‘",
                "urduNarrator": "ہم سے عثمان، ابوبکر، ابن ابی شیبہ اور اسحاق بن ابراہیم سب نے جریر کی سند سے بیان کیا - عثمان نے کہا, جریر نے ہمیں حدیث بیان کی ، انھوں نے منصور سے ، انھوں نے ابراہیم سے اور انھوں نے علقمہ سے روایت کی ، کہا  حضرت عبداللہ ( بن مسعود ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) نے کہا",
                "hadithArabic": "وَحَدَّثَنَا عُثْمَانُ، وَأَبُو بَكْرٍ، ابْنَا أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، جَمِيعًا عَنْ جَرِيرٍ - قَالَ عُثْمَانُ: حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، قَالَ: قَالَ عَبْدُ اللهِ: صَلَّى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - قَالَ إِبْرَاهِيمُ: زَادَ أَوْ نَقَصَ - فَلَمَّا سَلَّمَ قِيلَ لَهُ: يَا رَسُولَ اللهِ أَحَدَثَ فِي الصَّلَاةِ شَيْءٌ؟ قَالَ: «وَمَا ذَاكَ؟» قَالُوا: صَلَّيْتَ كَذَا وَكَذَا، قَالَ: فَثَنَى رِجْلَيْهِ، وَاسْتَقْبَلَ الْقِبْلَةَ، فَسَجَدَ سَجْدَتَيْنِ، ثُمَّ سَلَّمَ، ثُمَّ أَقْبَلَ عَلَيْنَا بِوَجْهِهِ فَقَالَ: «إِنَّهُ لَوْ حَدَثَ فِي الصَّلَاةِ شَيْءٌ أَنْبَأْتُكُمْ بِهِ، وَلَكِنْ إِنَّمَا أَنَا بَشَرٌ أَنْسَى كَمَا تَنْسَوْنَ، فَإِذَا نَسِيتُ فَذَكِّرُونِي، وَإِذَا شَكَّ أَحَدُكُمْ فِي صَلَاتِهِ فَلْيَتَحَرَّ الصَّوَابَ، فَلْيُتِمَّ عَلَيْهِ، ثُمَّ لِيَسْجُدْ سَجْدَتَيْنِ»",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 8526,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=341",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=339",
                "label": "339",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=340",
                "label": "340",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=341",
                "label": "341",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=342",
                "label": "342",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=343",
                "label": "343",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=344",
                "label": "344",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=345",
                "label": "345",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=343",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=343",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=341",
        "to": 8550,
        "total": 40465
    }
}