{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 483,
        "data": [
            {
                "id": 12339,
                "hadithNumber": "4776",
                "englishNarrator": "It has been narrated on the authority of 'Abdul-Rahman bin Abd Rabb al-Ka'ba who said:",
                "hadithEnglish": "I entered the mosque when 'Abdullah bin 'Amr bin al-'As was sitting in the shade of the Ka'ba and the people had gathered around him. I betook myself to them and sat near him. (Now) Abdullah said: I accompanied the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) on a journey. We halted at a place. Some of us began to set right their tents, others began to compete with one another in shooting, and others began to graze their beasts, when an announcer of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) announced that the people should gather together for prayer, so we gathered around the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). He said: It was the duty of every Prophet that has gone before me to guide his followers to what he knew was good for them and warn them against what he knew was bad for them; but this Umma of yours has its days of peace and (security) in the beginning of its career, and in the last phase of its existence it will be afflicted with trials and with things disagreeable to you. (In this phase of the Umma), there will be tremendous trials one after the other, each making the previous one dwindle into insignificance. When they would be afflicted with a trial, the believer would say: This is going to bring about my destruction. When at (the trial) is over, they would be afflicted with another trial, and the believer would say: This surely is going to be my end. Whoever wishes to be delivered from the fire and enter the garden should die with faith in Allah and the Last Day and should treat the people as he wishes to be treated by them. He who swears allegiance to a Caliph should give him the piedge of his hand and the sincerity of his heart (i. e. submit to him both outwardly as well as inwardly). He should obey him to the best of his capacity. It another man comes forward (as a claimant to Caliphate), disputing his authority, they (the Muslims) should behead the latter. The narrator says: I came close to him ('Abdullah b. 'Amr b. al-'As) and said to him: Can you say on oath that you heard it from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌)? He pointed with his hands to his ears and his heart and said: My ears heard it and my mind retained it. I said to him: This cousin of yours, Mu'awiya, orders us to unjustly consume our wealth among ourselves and to kill one another, while Allah says: O ye who believe, do not consume your wealth among yourselves unjustly, unless it be trade based on mutual agreement, and do not kill yourselves. Verily, God is Merciful to you (iv. 29). The narrator says that (hearing this) Abdullah b. 'Amr b. al-As kept quiet for a while and then said: Obey him in so far as he is obedient to God; and disobey him in matters involving disobedience to God.",
                "hadithUrdu": "میں مسجد میں گیا وہاں عبدﷲ بن عمرو بن العاص رضی اللہ عنہ کعبہ کے سایہ میں بیٹھے تھے اور لوگ ان کے پاس جمع تھے میں بھی گیا اور بیٹھا ۔ انہوں نے کہا ہم رسول اﷲ ﷺ کے ساتھ تھے ایک سفر میں تو ایک جگہ اترے ، کوئی اپنا ڈیرہ درست کرنے لگا ، کوئی تیر مارنے لگا ، کوئی اپنے جانوروں میں تھا کہ اتنے میں رسول اﷲ ﷺ کے پکارنے والے نے آواز دی نماز کے لیے اکٹھا ہوجاؤ ۔ ہم سب اپ کے پاس جمع ہوئے ۔ اپ نے فرمایا مجھ سے پہلے کوئی نبی ایسا نہیں گزرا جس پر ضروری نہ ہو اپنی امت کو جو بہتر بات اس کو معلوم ہو بتانا اور جو بری بات ہو اس سے ڈرانا اور تمہاری یہ امت اس کے پہلے حصہ میں سلامتی ہے اور اخیر حصے میں بلا ہے اور وہ باتیں ہیں جو تم کو بری لگیں گی اور ایسے فتنے آویں گے کہ ایک فتنہ دوسرے کو ہلکا اور پتلا کردے گا ( یعنی بعد کا فتنہ پہلے سے ایسا بڑھ کر ہوگا کہ پہلا فتنہ اس کے سامنے کچھ حقیقت نہ رکھے گا ) او رایک فتنہ آوے گا تو مومن کہے گا اس میں میری تباہی ہے پھر وہ جاتا رہے گا اور دوسرا آوے گا مومن کہے گا اس میں میری تباہی ہے ۔ پھر جو کوئی چاہے کہ جہنم سے بچے او رجنت میں جاوے اس کو چاہیے کہ مرے اﷲ تعالیٰ اور پچھلے دن پر یقین رکھ کر اور لوگوں سے وہ سلوک کرے جیسا وہ چاہتا ہو کہ لوگ اس سے کریں ۔ اور جو شخص کسی امام سے بیعت کرے اور اس کو اپنا ہاتھ دے دیوے اور دل سے نیت کرے اس کی تابعداری کی تو اس کی طاعت کرے اگر طاقت ہو ۔ اب اگر دوسرا امام اس سے لڑنے کو آوے تو ( اس کو منع کرو اگر نہ مانے بعیر لڑائی کے تو ) اس کی گردن مارو ۔ یہ سن کر میں عبداﷲ کے پسا گیا اور ان سے کہا میں تم کو قسم دیتا ہوں اﷲ کی تم نے یہ رسول اﷲ ﷺ سے سنا ہے؟ انہوں نے اپنے کانوں اور دل کی طرف اشارہ کیا ہاتھ سے اور کہا میرے کانوں نے سنا اور دل نے یاد رکھا ۔ میں نے کہا تمہارے چچا کے بیٹے معاویہؓ ہم کو حکم کرتے ہیں ایک دوسرے کا مال ناحق کھانے کے لیے او راپنی جانوں کو تباہ کرنے کے لیے اور اﷲتعالیٰ فرماتا ہے اے ایمان والو! مت کھاؤ اپنے مال ناحق مگر راضی سے دوداگری کرکے اور مت مارو اپنی جانوں کو بے شک اﷲ تعالیٰ تم پر مہربان ہے ۔ یہ سن کر عبداﷲ بن عمرو بن العاصؓ تھوڑی دیر تک چپ رہے پھر کہا معاویہؓ کی اطاعت کرو اس کام میں جو اﷲ کے حکم کے موافق ہو اور جو کام اﷲ تعالیٰ کے حکم کے خلاف ہو اس میں معاویہ رضی اللہ عنہ کا کہنا نہ مانو ۔",
                "urduNarrator": "ہم سے زہیر بن حرب اور اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے اسحاق نے بیان کیا، کہا کہ ہم سے زہیر جریر نے الاعمش کی سند سے، وہ زید بن کی سند سے, عبدالرحمن بن عبد رب الکعبہ سے روایت ہے",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ، زُهَيْرٌ حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ زَيْدِ بْنِ وَهْبٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ رَبِّ الْكَعْبَةِ، قَالَ دَخَلْتُ الْمَسْجِدَ فَإِذَا عَبْدُ اللَّهِ بْنُ عَمْرِو بْنِ الْعَاصِ جَالِسٌ فِي ظِلِّ الْكَعْبَةِ وَالنَّاسُ مُجْتَمِعُونَ عَلَيْهِ فَأَتَيْتُهُمْ فَجَلَسْتُ إِلَيْهِ فَقَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي سَفَرٍ فَنَزَلْنَا مَنْزِلاً فَمِنَّا مَنْ يُصْلِحُ خِبَاءَهُ وَمِنَّا مَنْ يَنْتَضِلُ وَمِنَّا مَنْ هُوَ فِي جَشَرِهِ إِذْ نَادَى مُنَادِي رَسُولِ اللَّهِ صلى الله عليه وسلم الصَّلاَةَ جَامِعَةً ‏.‏ فَاجْتَمَعْنَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏ ‏ إِنَّهُ لَمْ يَكُنْ نَبِيٌّ قَبْلِي إِلاَّ كَانَ حَقًّا عَلَيْهِ أَنْ يَدُلَّ أُمَّتَهُ عَلَى خَيْرِ مَا يَعْلَمُهُ لَهُمْ وَيُنْذِرَهُمْ شَرَّ مَا يَعْلَمُهُ لَهُمْ وَإِنَّ أُمَّتَكُمْ هَذِهِ جُعِلَ عَافِيَتُهَا فِي أَوَّلِهَا وَسَيُصِيبُ آخِرَهَا بَلاَءٌ وَأُمُورٌ تُنْكِرُونَهَا وَتَجِيءُ فِتْنَةٌ فَيُرَقِّقُ بَعْضُهَا بَعْضًا وَتَجِيءُ الْفِتْنَةُ فَيَقُولُ الْمُؤْمِنُ هَذِهِ مُهْلِكَتِي ‏.‏ ثُمَّ تَنْكَشِفُ وَتَجِيءُ الْفِتْنَةُ فَيَقُولُ الْمُؤْمِنُ هَذِهِ هَذِهِ ‏.‏ فَمَنْ أَحَبَّ أَنْ يُزَحْزَحَ عَنِ النَّارِ وَيَدْخُلَ الْجَنَّةَ فَلْتَأْتِهِ مَنِيَّتُهُ وَهُوَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ وَلْيَأْتِ إِلَى النَّاسِ الَّذِي يُحِبُّ أَنْ يُؤْتَى إِلَيْهِ وَمَنْ بَايَعَ إِمَامًا فَأَعْطَاهُ صَفْقَةَ يَدِهِ وَثَمَرَةَ قَلْبِهِ فَلْيُطِعْهُ إِنِ اسْتَطَاعَ فَإِنْ جَاءَ آخَرُ يُنَازِعُهُ فَاضْرِبُوا عُنُقَ الآخَرِ ‏ ‏ ‏.‏ فَدَنَوْتُ مِنْهُ فَقُلْتُ لَهُ أَنْشُدُكَ اللَّهَ آنْتَ سَمِعْتَ هَذَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَهْوَى إِلَى أُذُنَيْهِ وَقَلْبِهِ بِيَدَيْهِ وَقَالَ سَمِعَتْهُ أُذُنَاىَ وَوَعَاهُ قَلْبِي ‏.‏ فَقُلْتُ لَهُ هَذَا ابْنُ عَمِّكَ مُعَاوِيَةُ يَأْمُرُنَا أَنْ نَأْكُلَ أَمْوَالَنَا بَيْنَنَا بِالْبَاطِلِ وَنَقْتُلَ أَنْفُسَنَا وَاللَّهُ يَقُولُ ‏{‏ يَا أَيُّهَا الَّذِينَ آمَنُوا لاَ تَأْكُلُوا أَمْوَالَكُمْ بَيْنَكُمْ بِالْبَاطِلِ إِلاَّ أَنْ تَكُونَ تِجَارَةً عَنْ تَرَاضٍ مِنْكُمْ وَلاَ تَقْتُلُوا أَنْفُسَكُمْ إِنَّ اللَّهَ كَانَ بِكُمْ رَحِيمًا‏}‏ قَالَ فَسَكَتَ سَاعَةً ثُمَّ قَالَ أَطِعْهُ فِي طَاعَةِ اللَّهِ وَاعْصِهِ فِي مَعْصِيَةِ اللَّهِ ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12340,
                "hadithNumber": "4777",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of A'mash with a different chain of transmitters.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ، ابن نمیر اور ابو سعید الاشجع نے بیان کیا، انہوں نے کہا: وکیع اور ابومعاویہ دونوں نے اعمش سے اسی سند سے اسی کے مانند روایت کی.",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ نُمَيْرٍ، وَأَبُو سَعِيدٍ الْأَشَجُّ، قَالُوا: حَدَّثَنَا وَكِيعٌ، ح وحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، كِلَاهُمَا عَنِ الْأَعْمَشِ، بِهَذَا الْإِسْنَادِ نَحْوَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12341,
                "hadithNumber": "4778",
                "englishNarrator": "It has been narrated on the authority of 'Abd Rabb al-Ka'ba as-Sa'idl who said:",
                "hadithEnglish": "I saw a group of people near the Ka'ba.... Then he narrated the tradition as narrated by A'mash.",
                "hadithUrdu": "میں نے کعبہ کے پاس ایک مجمع دیکھا ، پھر اعمش کی حدیث کی طرح بیان کیا ۔",
                "urduNarrator": "مجھ سے محمد بن رافع نے بیان کیا، کہا ہم سے ابو المنذر اسماعیل بن عمر نے بیان کیا، کہا ہم سے یونس بن ابی اسحاق ہمدانی نے بیان کیا، کہا کہ عبداللہ بن عمر رضی اللہ عنہ نے ,  سفر کا باپ، عامر نے عبدالرحمن بن عبد رب الکعبہ صائدی سے روایت کی ، کہا",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا أَبُو الْمُنْذِرِ إِسْمَاعِيلُ بْنُ عُمَرَ، حَدَّثَنَا يُونُسُ بْنُ أَبِي إِسْحَاقَ الْهَمْدَانِيُّ، حَدَّثَنَا عَبْدُ اللهِ بْنُ أَبِي السَّفَرِ، عَنْ عَامِرٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ رَبِّ الْكَعْبَةِ الصَّائِدِيِّ، قَالَ: رَأَيْتُ جَمَاعَةً عِنْدَ الْكَعْبَةِ، فَذَكَرَ نَحْوَ حَدِيثِ الْأَعْمَشِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12342,
                "hadithNumber": "4779",
                "englishNarrator": "It has been narrated on the authority of Usaid bin Hudair رضی اللہ عنہ :",
                "hadithEnglish": "A man from the Ansar took the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) aside and said to him: Will you not appoint me governor as you have appointed so and so? He (the Messenger of Allah ﷺ) said: You will surely come across preferential treatment after me, so you should be patient until you meet me at the Cistern (Haud-i-Kauthar).",
                "hadithUrdu": "ایک انصاری نے تنہائی میں رسول اللہ صلی اللہ علیہ وسلم سے بات کی اور عرض کی : کیا جس طرح آپ نے فلاں شخص کو عامل بنایا ہے مجھے عامل نہیں بنائیں گے؟ آپ نے فرمایا : \" میرے بعد تم خود کو ( دوسروں پر ) ترجیح ( دینے کا معاملہ ) دیکھو گے تم اس پر صبر کرتے رہنا ، یہاں تک کہ حوض ( کوثر ) پر مجھ سے آن ملو ۔ \" ( وہاں تمہیں میری شفاعت پر اس صبر و تحمل کا بے پناہ اجر ملے گا ۔ )",
                "urduNarrator": "ہم سے محمد بن المثنیٰ اور محمد بن بشار نے بیان کیا، کہا:محمد بن جعفر نے ہمیں شعبہ سے حدیث بیان کی ، انہوں نے کہا : میں نے قتادہ سے سنا ، وہ حضرت انس بن مالک رضی اللہ عنہ سے حدیث بیان کر رہے تھے ، انہوں نے حضرت اسید بن حضیر رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ: سَمِعْتُ قَتَادَةَ، يُحَدِّثُ عَنْ أَنَسِ بْنِ مَالِكٍ، عَنْ أُسَيْدِ بْنِ حُضَيْرٍ، أَنَّ رَجُلًا مِنَ الْأَنْصَارِ خَلَا بِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: أَلَا تَسْتَعْمِلُنِي كَمَا اسْتَعْمَلْتَ فُلَانًا؟ فَقَالَ: «إِنَّكُمْ سَتَلْقَوْنَ بَعْدِي أَثَرَةً فَاصْبِرُوا حَتَّى تَلْقَوْنِي عَلَى الْحَوْضِ.",
                "headingArabic": "الأَمْرِ بِالصَّبْرِ عِنْدَ ظُلْمِ الْوُلاَةِ وَاسْتِئْثَارِهِمْ ‏‏",
                "headingUrdu": "ظالم حکمرانوں اور ان کی خود غرضی کے سامنے صبر کرنے کا حکم",
                "headingEnglish": "The command to be patient in the face of oppressive rulers and their selfishness",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12343,
                "hadithNumber": "4780",
                "englishNarrator": "It was narrated that Qatadah said:",
                "hadithEnglish": "I heard Anas narrating from Usaid bin Hudair رضی اللہ عنہ that a man from among the Ansar took the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) aside...\" a similar report (s no. 4779).",
                "hadithUrdu": ": میں نے حضرت انس رضی اللہ عنہ سے سنا ، وہ حضرت اسید بن حضیر رضی اللہ عنہ سے حدیث بیان کر رہے تھے کہ ایک انصاری نے رسول اللہ صلی اللہ علیہ وسلم سے تنہائی میں بات کی ، اسی ( سابقہ حدیث ) کے مانند.",
                "urduNarrator": "ہمیں خالد بن حارث نے حدیث بیان کی ، کہا : ہمیں شعبہ بن حجاج نے قتادہ سے حدیث سنائی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ، حَدَّثَنَا شُعْبَةُ بْنُ الْحَجَّاجِ، عَنْ قَتَادَةَ، قَالَ: سَمِعْتُ أَنَسًا، يُحَدِّثُ عَنْ أُسَيْدِ بْنِ حُضَيْرٍ، أَنَّ رَجُلًا مِنَ الْأَنْصَارِ خَلَا بِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12344,
                "hadithNumber": "4781",
                "englishNarrator": "Shubah narrated it with this chain o narration (a hadith similar to no. 4779), but he did not say:",
                "hadithEnglish": "He took the Messenger of Allah ﷺ aside.\"",
                "hadithUrdu": "اس نے رسول اللہ صلی اللہ علیہ وسلم سے تنہائی میں بات کی.",
                "urduNarrator": "مجھ سے عبید اللہ بن معاذ نے بیان کیا، ہم سے میرے والد نے بیان کیا، ہم سے شعبہ رضی اللہ عنہ نے اس سند کے ساتھ بیان کیا، اور انہوں نے یہ نہیں کہا: معاذ نے شعبہ سے اسی سند کے ساتھ حدیث سنائی اور یہ نہیں کہا",
                "hadithArabic": "وحَدَّثَنِيهِ عُبَيْدُ اللهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، بِهَذَا الْإِسْنَادِ، وَلَمْ يَقُلْ: خَلَا بِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12345,
                "hadithNumber": "4782",
                "englishNarrator": "It has been narrated on the authority of Alqama bin Wai'l al-Hadrami who learnt the tradition from his father. The latter said:",
                "hadithEnglish": "Salama bin Yazid al-ju'afi رضی اللہ عنہ asked the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌): Prophet of Allah, what do you think if we have rulers who rule over us and demand that we discharge our obligations towards them, but they (themselves) do not discharge their own responsibilities towards us? What do you order us to do? The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) avoided giving any answer. Salama asked him again. He (again) avoided giving any answer. Then he asked again-it was the second time or the third time-when Ash'ath bin Qais رضی اللہ عنہ (finding that the Prophet was unnecessarily being pressed for answer) pulled him aside and said: Listen to them and obey them, for on them shall he their burden and on you shall be your burden.",
                "hadithUrdu": "سلمہ بن یزید جعفی رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے سوال کیا اور کہا : اللہ کے نبی! آپ کیسے دیکھتے ہیں کہ اگر ہم پر ایسے لوگ حکمران بنیں جو ہم سے اپنے حقوق کا مطالبہ کریں اور ہمارے حق ہمیں نہ دیں تو اس صورت میں آپ ہمیں کیا حکم دیتے ہیں؟ آپ نے اس سے اعراض فرمایا ، اس نے دوبارہ سوال کیا ، آپ نے پھر اعراض فرمایا ، پھر جب اس نے دوسری یا تیسری بار سوال کیا تو اس کو اشعث بن قیس رضی اللہ عنہ نے کھینچ لیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" سنو اور اطاعت کرو کیونکہ جو ذمہ داری ان کو دی گئی اس کا بار ان پر ہے اور جو ذمہ داری تمہیں دی گئی ہے ، اس کا بوجھ تم پر ہے.",
                "urduNarrator": "ہم سے محمد بن المثنیٰ اور محمد بن بشار نے بیان کیا، کہا:محمد بن جعفر نے ہمیں حدیث بیان کی ، کہا : ہمیں شعبہ نے سماک بن حرب سے حدیث بیان کی ، انہوں نے علقمہ بن وائل حضرمی سے ، انہوں نے اپنے والد سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ عَلْقَمَةَ بْنِ وَائِلٍ الْحَضْرَمِيِّ، عَنْ أَبِيهِ، قَالَ: سَأَلَ سَلَمَةُ بْنُ يَزِيدَ الْجُعْفِيُّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: يَا نَبِيَّ اللهِ، أَرَأَيْتَ إِنْ قَامَتْ عَلَيْنَا أُمَرَاءُ يَسْأَلُونَا حَقَّهُمْ وَيَمْنَعُونَا حَقَّنَا، فَمَا تَأْمُرُنَا؟ فَأَعْرَضَ عَنْهُ، ثُمَّ سَأَلَهُ، فَأَعْرَضَ عَنْهُ، ثُمَّ سَأَلَهُ فِي الثَّانِيَةِ أَوْ فِي الثَّالِثَةِ، فَجَذَبَهُ الْأَشْعَثُ بْنُ قَيْسٍ، وَقَالَ: «اسْمَعُوا وَأَطِيعُوا، فَإِنَّمَا عَلَيْهِمْ مَا حُمِّلُوا، وَعَلَيْكُمْ مَا حُمِّلْتُمْ.",
                "headingArabic": "فِي طَاعَةِ الأُمَرَاءِ وَإِنْ مَنَعُوا الْحُقُوقَ",
                "headingUrdu": "حکمرانوں کی اطاعت کرنا خواہ وہ عوام کے حقوق کو روکیں۔",
                "headingEnglish": "Obeying Rulers even if they withhold the people's rights",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12346,
                "hadithNumber": "4783",
                "englishNarrator": "It has been narrated through a different chain of transmitters, on the authority of Simak who said:",
                "hadithEnglish": "Ash'ath bin Qais رضی اللہ عنہ pulled him (Salama bin Yazid) when the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Listen to them and obey them, for on them shall be the burden of what they do and on you shall be the burden of what you do.",
                "hadithUrdu": "اشعث بن قیس رضی اللہ عنہ نے اس ( پوچھنے والے ) کو کھینچا اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" سنو اور اطاعت کرو ، جو ذمہ داری ان پر ڈالی گئی اس کا بوجھ ان پر ہے اور جو تم پر ڈالی گئی اس کا بوجھ تم پر ہے.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, شبابہ نے کہا : ہمیں شعبہ نے سماک سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی اور کہا",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا شَبَابةُ، حَدَّثَنَا شُعْبَةُ، عَنْ سِمَاكٍ، بِهَذَا الْإِسْنَادِ مِثْلَهُ، وَقَالَ: فَجَذَبَهُ الْأَشْعَثُ بْنُ قَيْسٍ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «اسْمَعُوا وَأَطِيعُوا، فَإِنَّمَا عَلَيْهِمْ مَا حُمِّلُوا وَعَلَيْكُمْ مَا حُمِّلْتُمْ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12347,
                "hadithNumber": "4784",
                "englishNarrator": "It has been narrated on the authority of Hudhaifa bin al-Yaman رضی ‌اللہ ‌عنہ who said:",
                "hadithEnglish": "People used to ask the Messenger of Allah (ﷺ) about the good times, but I used to ask him about bad times fearing lest they overtake me. I said: Messenger of Allah, we were in the midst of ignorance and evil, and then God brought us this good (time through Islam). Is there any bad time after this good one? He said: Yes. I asked: Will there be a good time again after that bad time? He said: Yes, but therein will be a hidden evil. I asked: What will be the evil hidden therein? He said: (That time will witness the rise of) the people who will adopt ways other than mine and seek guidance other than mine. You will know good points as well as bad points. I asked: Will there be a bad time after this good one? He said: Yes. (A time will come) when there will be people standing and inviting at the gates of Hell. Whoso responds to their call they will throw them into the fire. I said: Messenger of Allah, describe them for us. He said: All right. They will be a people having the same complexion as ours and speaking our language. I said: Messenger of Allah, what do you suggest if I happen to live in that time? He said: You should stick to the main body of the Muslims and their leader. I said: If they have no (such thing as the) main body and have no leader? He said: Separate yourself from all these factions, though you may have to eat the roots of trees (in a jungle) until death comes to you and you are in this state.",
                "hadithUrdu": "لوگ رسول اﷲ صلی ‌اللہ ‌علیہ ‌وسلم سے بھلی باتوں کو پوچھا کرتے اور میں بری بات کو پوچھتا اس ڈر سے کہ کہیں برائی میں نہ پڑجاؤں۔ میں نے عرض کیا یارسول اﷲؐ! ہم جاہلیت اور برائی میں تھے پھر اﷲ نے ہم کو یہ بھلائی دی ( یعنی اسلام ) اب اس کے بعد بھی کچھ برائی ہے؟ آپ نے فرمایا ہاں لیکن اس میں دھبہ ہے۔ میں نے کہا وہ دھبہ کیسا؟ آپ نے فرمایا ایسے لوگ ہوں گے جو میری سنت پر نہیں چلیں گے او رمیرے طریقہ کے سوا اور راہ پر چلیں گے، ان میں اچھی باتیں بھی ہوں گی اور بری بھی۔ میں نے عرض کیا پھر اس کے بعد برائی ہوگی؟ آپ نے فرمایا ہاں ایسے لوگ پیدا ہوں گے جو جہنم کے دروازے کی طرف لوگوں کو بلاویں گے، جو ان کے بات مانے گا اس کو جہنم میں ڈال دیں گے۔ میں نے کہا یا رسول اﷲؐ! ان لوگوں کا حال ہم سے بیان فرمائیے؟ آپ نے فرمایا ان کا رنگ ہمارا ساہی ہوگا اور ہماری ہی زبان بولیں گے۔ میں نے عرض کیا یا رسول اﷲؐ! اگر اس زمانہ کو میں پاؤں تو کیا کروں؟ آپ نے فرمایا مسلمانوں کی جماعت کے ساتھ رہ اور ان کے امام کے ساتھ رہ۔ کہا اگر جماعت اور امام نہ ہوں؟ آپ نے فرمایا تو سب فرقوں کو چھوڑ دے اور اگرچہ ایک درخت کی جڑ دانت سے چباتا رہے مرتے دم تک۔",
                "urduNarrator": "مجھ سے محمد بن المثنیٰ نے بیان کیا، ہم سے ولید بن مسلم نے بیان کیا، مجھ سے عبدالرحمٰن بن یزید بن جبیر نے بیان کیا، مجھ سے بسر بن عبید اللہ نے بیان کیا۔ الحدرمی، کہ انہوں نے ابو ادریس الخولانی کو یہ کہتے ہوئے سنا: میں نے سنا,  حذیفہ بن الیمان رضی ‌اللہ ‌عنہ سے روایت ہے",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ يَزِيدَ بْنِ، جَابِرٍ حَدَّثَنِي بُسْرُ بْنُ عُبَيْدِ اللَّهِ الْحَضْرَمِيُّ، أَنَّهُ سَمِعَ أَبَا إِدْرِيسَ الْخَوْلاَنِيَّ، يَقُولُ سَمِعْتُ حُذَيْفَةَ بْنَ الْيَمَانِ، يَقُولُ كَانَ النَّاسُ يَسْأَلُونَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الْخَيْرِ وَكُنْتُ أَسْأَلُهُ عَنِ الشَّرِّ مَخَافَةَ أَنْ يُدْرِكَنِي فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّا كُنَّا فِي جَاهِلِيَّةٍ وَشَرٍّ فَجَاءَنَا اللَّهُ بِهَذَا الْخَيْرِ فَهَلْ بَعْدَ هَذَا الْخَيْرِ شَرٌّ قَالَ ‏ ‏ نَعَمْ ‏ ‏ فَقُلْتُ هَلْ بَعْدَ ذَلِكَ الشَّرِّ مِنْ خَيْرٍ قَالَ ‏ ‏ نَعَمْ وَفِيهِ دَخَنٌ ‏ ‏ ‏.‏ قُلْتُ وَمَا دَخَنُهُ قَالَ ‏ ‏ قَوْمٌ يَسْتَنُّونَ بِغَيْرِ سُنَّتِي وَيَهْدُونَ بِغَيْرِ هَدْيِي تَعْرِفُ مِنْهُمْ وَتُنْكِرُ ‏ ‏ ‏.‏ فَقُلْتُ هَلْ بَعْدَ ذَلِكَ الْخَيْرِ مِنْ شَرٍّ قَالَ ‏ ‏ نَعَمْ دُعَاةٌ عَلَى أَبْوَابِ جَهَنَّمَ مَنْ أَجَابَهُمْ إِلَيْهَا قَذَفُوهُ فِيهَا ‏ ‏ ‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ صِفْهُمْ لَنَا ‏.‏ قَالَ ‏ ‏ نَعَمْ قَوْمٌ مِنْ جِلْدَتِنَا وَيَتَكَلَّمُونَ بِأَلْسِنَتِنَا ‏ ‏ ‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ فَمَا تَرَى إِنْ أَدْرَكَنِي ذَلِكَ قَالَ ‏ ‏ تَلْزَمُ جَمَاعَةَ الْمُسْلِمِينَ وَإِمَامَهُمْ ‏ ‏ ‏.‏ فَقُلْتُ فَإِنْ لَمْ تَكُنْ لَهُمْ جَمَاعَةٌ وَلاَ إِمَامٌ قَالَ ‏ ‏ فَاعْتَزِلْ تِلْكَ الْفِرَقَ كُلَّهَا وَلَوْ أَنْ تَعَضَّ عَلَى أَصْلِ شَجَرَةٍ حَتَّى يُدْرِكَكَ الْمَوْتُ وَأَنْتَ عَلَى ذَلِكَ‏.‏",
                "headingArabic": "الأَمْرِ بِلُزُومِ الْجَمَاعَةِ عِنْدَ ظُهُورِ الْفِتَنِ وَتَحْذِيرِ الدُّعَاةِ إِلَى الْكُفْرِ ‏‏",
                "headingUrdu": "فتنوں کے ظاہر ہونے پر اور ہر حال میں مسلمانوں کی جماعت کے ساتھ رہنا فرض ہے۔ اطاعت سے انکار اور جماعت سے الگ ہونے کی ممانعت",
                "headingEnglish": "The obligation of staying with the Jama'ah (main body) of the muslims when Fitn (tribulations) appear, and in all circumstances. The prohibition of refusing to obey and on splitting away from the Jama'ah",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12348,
                "hadithNumber": "4785",
                "englishNarrator": "It his been narrated through a different chain of transmitters, on the authority of Hudhaifa bin al-Yaman رضی ‌اللہ ‌عنہ who said:",
                "hadithEnglish": "Messenger of Allah, no doubt, we had an evil time (i.e. the days of Jahiliyya or ignorance) and God brought us a good time (i. e. Islamic period) through which we are now living Will there be a bad time after this good time? He (the Holy Prophet) said: Yes. I said: Will there be a good time after this bad time? He said: Yes. I said: Will there be a bad time after good time? He said: Yes. I said: How? Whereupon he said: There will be leaders who will not be led by my guidance and who will not adopt my ways? There will be among them men who will have the hearts of devils in the bodies of human beings. I said: What should I do. Messenger of Allah, if I (happen) to live in that time? He replied: You will listen to the Amir and carry out his orders; even if your back is flogged and your wealth is snatched, you should listen and obey.",
                "hadithUrdu": "یارسول اﷲؐ! ہم برائی میں تھے پھر اﷲ تعالیٰ نے بھلائی دی اب اس کے بعد بھی کچھ برائی ہے؟ آپ نے فرمایا۔ میں نے کہا پھر اس کے بعد بھلائی ہے آپ نے فرمایا ہاں میں نے کہا پھر اس کے بعد برائی؟ آپ نے فرمایا ہاں۔ میں نے کہا کیسے؟ آپ نے فرمایا میرے بعد وہ لوگ حاکم ہوں گے جو میری راہ پر نہ چلیں گے، میری سنت پر عمل نہیں کریں گے او ران میں ایسے لوگ ہوں گے جن کے دل شیطان کے سے او ربدن آدمیوں کے سے ہوں گے۔ میں نے عرض کیا یارسول اﷲؐ! اس وقت میں کیا کروں؟ آپ نے فرمایا اگر تو ایسے زمانہ میں ہو تو سن اور مان حاکم کی بات کو اگرچہ وہ تیرے پیٹھ پھوڑے اور تیرا مال لے لے پر اس اس کی بات سنے جا اور اس کا حکم مانتا رہ۔",
                "urduNarrator": "مجھ سے محمد بن سہل بن عسکر التمیمی نے بیان کیا، کہا ہم سے یحییٰ بن حسن نے بیان کیا اور ہم سے عبداللہ بن عبدالرحمٰن دارمی نے بیان کیا۔ ہم سے یحییٰ نے بیان کیا - وہ ابن حسن ہیں - ہم سے معاویہ نے بیان کیا - یعنی ابن سلام نے - ہم سے زید بن سلام نے بیان کیا، انہوں نے ابو سلام کی سند سے کہا, حذیفہ بن الیمان رضی ‌اللہ ‌عنہ سے روایت ہے میں نے عرض کیا",
                "hadithArabic": "وَحَدَّثَنِي مُحَمَّدُ بْنُ سَهْلِ بْنِ عَسْكَرٍ التَّمِيمِيُّ، حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ، ح وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا يَحْيَى، - وَهُوَ ابْنُ حَسَّانَ - حَدَّثَنَا مُعَاوِيَةُ، - يَعْنِي ابْنَ سَلاَّمٍ - حَدَّثَنَا زَيْدُ بْنُ سَلاَّمٍ، عَنْ أَبِي سَلاَّمٍ، قَالَ قَالَ حُذَيْفَةُ بْنُ الْيَمَانِ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّا كُنَّا بِشَرٍّ فَجَاءَ اللَّهُ بِخَيْرٍ فَنَحْنُ فِيهِ فَهَلْ مِنْ وَرَاءِ هَذَا الْخَيْرِ شَرٌّ قَالَ نَعَمْ ‏.‏ قُلْتُ هَلْ وَرَاءَ ذَلِكَ الشَّرِّ خَيْرٌ قَالَ ‏ ‏ نَعَمْ ‏ ‏ ‏.‏ قُلْتُ فَهَلْ وَرَاءَ ذَلِكَ الْخَيْرِ شَرٌّ قَالَ ‏ ‏ نَعَمْ ‏ ‏ ‏.‏ قُلْتُ كَيْفَ قَالَ ‏ ‏ يَكُونُ بَعْدِي أَئِمَّةٌ لاَ يَهْتَدُونَ بِهُدَاىَ وَلاَ يَسْتَنُّونَ بِسُنَّتِي وَسَيَقُومُ فِيهِمْ رِجَالٌ قُلُوبُهُمْ قُلُوبُ الشَّيَاطِينِ فِي جُثْمَانِ إِنْسٍ ‏ ‏ ‏.‏ قَالَ قُلْتُ كَيْفَ أَصْنَعُ يَا رَسُولَ اللَّهِ إِنْ أَدْرَكْتُ ذَلِكَ قَالَ ‏ ‏ تَسْمَعُ وَتُطِيعُ لِلأَمِيرِ وَإِنْ ضُرِبَ ظَهْرُكَ وَأُخِذَ مَالُكَ فَاسْمَعْ وَأَطِعْ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12349,
                "hadithNumber": "4786",
                "englishNarrator": "It has been narrated on the authority of Abu Huraira رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "The Messenger of Allah (ﷺ) said: One who defected from obedience (to the Amir) and separated from the main body of the Muslims - if he died in that state-would die the death of one belonging to the days of Jahiliyya (i.e. would not die as a Muslim). One who fights under the banner of a people who are blind (to the cause for which they are fighting, i.e. do not know whether their cause is just or otherwise), who gets flared up with family pride, calls (people) to fight for their family honour, and supports his kith and kin (i.e. fights not for the cause of Allah but for the sake of this family or tribe) - if he is killed (in this fight), he dies as one belonging to the days of Jahiliyya. Whoso attacks my Ummah (indiscriminately) killing the righteous and the wicked of them, sparing not (even) those staunch in faith and fulfilling not his promise made with those who have been given a pledge of security - he has nothing to do with me and I have nothing to do with him.",
                "hadithUrdu": "رسول اﷲؐ نے فرمایا جو شخص حاکم کی اطاعت سے باہر ہوجاوے اور جماعت کا ساتھ چھوڑ دے پھر وہ مرے تو اس کی موت جاہلیت کی سی ہوگی اور جو شخص اندھے جھنڈے کے تلے لڑے ( جس لڑائی کی درستی شریعت سے صاف صاف ثابت نہ ہو ) غصہ ہو قوم کے لحاظ سے یا بلاتا ہو قوم کی طرف یا مدد کرتا ہو قوم کی او رخدا کی رضامندی مقصود نہ ہو پھر مارا جاوے تو اس کا مارا جانا جاہلیت کے زمانے کا سا ہوگا اور جو شخص ( میری امت پر ) دست درازی کرے اور اچھے اور بروں کو ان میں کے قتل کرے اور مومن کو بھی نہ چھورے اور جس سے عہد ہوا ہو اس کا عہد پورا نہ کرے تو وہ مجھ سے علاقہ نہیں رکھتا او رمیں اس سے تعلق نہیں رکھتا ( یعنی وہ مسلمان نہیں ہے ) ۔",
                "urduNarrator": "ہم سے شیبان بن فروخ نے بیان کیا، کہا ہم سے جریر نے بیان کیا، یعنی ابن حازم نے، کہا کہ ہم سے غیلان بن جریر نے بیان کیا، وہ ابو قیس بن ریاح کی سند سے,  ابوہریرہ رضی ‌اللہ ‌عنہ سے روایت ہے",
                "hadithArabic": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا جَرِيرٌ، - يَعْنِي ابْنَ حَازِمٍ - حَدَّثَنَا غَيْلاَنُ بْنُ، جَرِيرٍ عَنْ أَبِي قَيْسِ بْنِ رِيَاحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏ ‏ مَنْ خَرَجَ مِنَ الطَّاعَةِ وَفَارَقَ الْجَمَاعَةَ فَمَاتَ مَاتَ مِيتَةً جَاهِلِيَّةً وَمَنْ قَاتَلَ تَحْتَ رَايَةٍ عُمِّيَّةٍ يَغْضَبُ لِعَصَبَةٍ أَوْ يَدْعُو إِلَى عَصَبَةٍ أَوْ يَنْصُرُ عَصَبَةً فَقُتِلَ فَقِتْلَةٌ جَاهِلِيَّةٌ وَمَنْ خَرَجَ عَلَى أُمَّتِي يَضْرِبُ بَرَّهَا وَفَاجِرَهَا وَلاَ يَتَحَاشَ مِنْ مُؤْمِنِهَا وَلاَ يَفِي لِذِي عَهْدٍ عَهْدَهُ فَلَيْسَ مِنِّي وَلَسْتُ مِنْهُ.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12350,
                "hadithNumber": "4787",
                "englishNarrator": "It was narrated that Abu Hurairah رضی اللہ عنہ said:",
                "hadithEnglish": "The Messenger of Allah ﷺ said....\" a Hadith like that of Jarir رضی اللہ عنہ (no. 4786). And he said: \"...and does not spare the believers.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے جریر رضی اللہ عنہ کی حدیث سے ملتی جلتی بات کہی، اور فرمایا: وہ مومن عورت سے پرہیز نہ کرے۔",
                "urduNarrator": "مجھ سے عبید اللہ بن عمر القواری نے بیان کیا، ہم سے حماد بن زید نے بیان کیا، ہم سے ایوب نے بیان کیا، ان سے غیلان بن جریر نے، زیاد بن ریاح القیسی کی سند سے۔ ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ انہوں نے کہا",
                "hadithArabic": "وَحَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا أَيُّوبُ، عَنْ غَيْلاَنَ، بْنِ جَرِيرٍ عَنْ زِيَادِ بْنِ رِيَاحٍ الْقَيْسِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِنَحْوِ حَدِيثِ جَرِيرٍ وَقَالَ ‏ ‏ لاَ يَتَحَاشَى مِنْ مُؤْمِنِهَا ‏ ‏ ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12351,
                "hadithNumber": "4788",
                "englishNarrator": "It has been narrated (through a different chain of transmitters) on the authority of Abu Huraira رضی اﷲ عنہ :",
                "hadithEnglish": "The Messenger of Allah (ﷺ) said: Whoever defects from obedience (to the Amir) and separates from the main body of the Muslim-and dies in that state - dies the death of one belonging to the days of jahiliyya. And he who is killed under the banner of a man who is blind (to the cause for which he is fighting), who gets flared up with family pride and fights for his tribe is not from my Ummah, and whosoever from my followers attacks my followers (indiscriminately) killing the righteous and the wicked of them, sparing not (even) those staunch in faith and fulfilling not his obligation towards them who have been given a pledge (of security), is not from me (i.e. is not my follower).",
                "hadithUrdu": "رسول اﷲ صلی ‌اللہ ‌علیہ ‌وسلم نے فرمایا جو شخص اطاعت سے نکل جاوے اور جماعت چھوڑ دے پھ رمرے تو اس کی موت جاہلیت کی سی ہوگی اور جو شخص ایذا دھندہ جھندے کے تلے مارا جاوے جو غصہ ہوتا ہو قوم کے پاس سے اور لڑتا ہو قوم کے خیال سے وہ میرے امت میں سے نہیں ہیں اور جو میری امت پر نکلے مارتا ہوا ان کے نیکوں اور بدوں کو مومن کو بھی نہ چھوڑے جس سے عہد ہو وہ بھی پورا نہ کرے تو وہ میری امت میں نہیں ہے۔",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، ہم سے عبدالرحمٰن بن مہدی نے بیان کیا، ہم سے مہدی بن میمون نے بیان کیا، ان سے غیلان بن جریر نے زیاد بن ریاح سے,  ابوہریرہ رضی اﷲ عنہ سے روایت ہے",
                "hadithArabic": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا مَهْدِيُّ بْنُ مَيْمُونٍ، عَنْ غَيْلاَنَ بْنِ جَرِيرٍ، عَنْ زِيَادِ بْنِ رِيَاحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ ‏ مَنْ خَرَجَ مِنَ الطَّاعَةِ وَفَارَقَ الْجَمَاعَةَ ثُمَّ مَاتَ مَاتَ مِيتَةً جَاهِلِيَّةً وَمَنْ قُتِلَ تَحْتَ رَايَةٍ عُمِّيَّةٍ يَغْضَبُ لِلْعَصَبَةِ وَيُقَاتِلُ لِلْعَصَبَةِ فَلَيْسَ مِنْ أُمَّتِي وَمَنْ خَرَجَ مِنْ أُمَّتِي عَلَى أُمَّتِي يَضْرِبُ بَرَّهَا وَفَاجِرَهَا لاَ يَتَحَاشَ مِنْ مُؤْمِنِهَا وَلاَ يَفِي بِذِي عَهْدِهَا فَلَيْسَ مِنِّي ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12352,
                "hadithNumber": "4789",
                "englishNarrator": null,
                "hadithEnglish": "It was narrated from Ghailan bin Jarir with this chain of narration (a hadith similar to no. 4788). As for Ibn Al-Muthanna (a sub-narrator), he did not mention the prophet ﷺ in his Hadith. As for Ibn Bash-shar (a sub narrator), he said in his report: \"The Messenger of Allah ﷺ said...\" like their Hadith.",
                "hadithUrdu": "ہم سے محمد بن المثنیٰ اور ابن بشار نے بیان کیا، کہا: ہم سے محمد بن جعفر نے بیان کیا، ہم سے شعبہ نے، غیلان بن جریر کی سند سے اس سند کے ساتھ بیان کیا۔ جہاں تک ابن المثنی کا تعلق ہے تو انہوں نے حدیث میں رسول اللہ صلی اللہ علیہ وسلم کا ذکر نہیں کیا، جہاں تک ابن بشار کا تعلق ہے، انہوں نے اپنی روایت میں کہا: اللہ کے رسول صلی اللہ علیہ وسلم ان پر رحمت نازل فرمائیں۔ امن نے کچھ ایسا ہی کہا ان کی گفتگو...",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ غَيْلاَنَ بْنِ جَرِيرٍ، بِهَذَا الإِسْنَادِ ‏.‏ أَمَّا ابْنُ الْمُثَنَّى فَلَمْ يَذْكُرِ النَّبِيَّ صلى الله عليه وسلم فِي الْحَدِيثِ وَأَمَّا ابْنُ بَشَّارٍ فَقَالَ فِي رِوَايَتِهِ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِنَحْوِ حَدِيثِهِمْ.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12353,
                "hadithNumber": "4790",
                "englishNarrator": "It has been narrated on the authority of Ibn 'Abbas رضی اﷲ عنہ :",
                "hadithEnglish": "The messenger of Allah (ﷺ) said: One who found in his Amir something which he disliked should hold his patience, for one who separated from the main body of the Muslims even to the extent of a handspan and then he died would die the death of one belonging to the days of Jahiliyya.",
                "hadithUrdu": "رسول اﷲ صلی ‌اللہ ‌علیہ ‌وسلم نے فرمایا جو شخص اپنے حاکم سے بری بات دیکھے وہ صبر کرے اس لیے کہ جو جماعت سے بالشت بھر جدا ہوجاوے اس کی موت جاہلیت کی موت ہوگی۔",
                "urduNarrator": "ہم سے حسن بن ربیع نے بیان کیا، ہم سے حماد بن زید نے بیان کیا، ان سے الجعد ابو عثمان نے، وہ میرے والد سے, ابن عباس رضی اﷲ عنہ سے روایت ہے",
                "hadithArabic": "حَدَّثَنَا حَسَنُ بْنُ الرَّبِيعِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنِ الْجَعْدِ أَبِي عُثْمَانَ، عَنْ أَبِي، رَجَاءٍ عَنِ ابْنِ عَبَّاسٍ، يَرْوِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ ‏ مَنْ رَأَى مِنْ أَمِيرِهِ شَيْئًا يَكْرَهُهُ فَلْيَصْبِرْ فَإِنَّهُ مَنْ فَارَقَ الْجَمَاعَةَ شِبْرًا فَمَاتَ فَمِيتَةٌ جَاهِلِيَّةٌ ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12354,
                "hadithNumber": "4791",
                "englishNarrator": "It has been narrated (through a different chain of transmitters) on the authority of Ibn Abbas رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "The Messenger of Allah (may peace be upoh him) said: One who dislikes a thing done by his Amir should be patient over it, for anyone from the people who withdraws (his obedience) from the government, even to the extent of a handspan and died in that conditions, would die the death of one belonging to the days of jahilliyya.",
                "hadithUrdu": "رسول اﷲ صلی ‌اللہ ‌علیہ ‌وسلم نے فرمایا جو شخص اپنے حاکم سے بری بات دیکھے وہ صبر کرے کیونکہ جو کوئی بادشاہ سے بالشت بھر جدا ہو پھر مرے اسی حال میں اس کی موت جاہلیت کی سی موت ہوگی۔",
                "urduNarrator": "ہم سے شیبان بن فروخ نے بیان کیا، ہم سے عبد الوارث نے بیان کیا، ہم سے الجعد نے بیان کیا، ہم سے ابوراجہ نے بیان کیا، ہم سے الطاردی نے بیان کیا, ابن عباس رضی ‌اللہ ‌عنہ سے روایت ہے",
                "hadithArabic": "وَحَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا الْجَعْدُ، حَدَّثَنَا أَبُو رَجَاءٍ، الْعُطَارِدِيُّ عَنِ ابْنِ عَبَّاسٍ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏ ‏ مَنْ كَرِهَ مِنْ أَمِيرِهِ شَيْئًا فَلْيَصْبِرْ عَلَيْهِ فَإِنَّهُ لَيْسَ أَحَدٌ مِنَ النَّاسِ خَرَجَ مِنَ السُّلْطَانِ شِبْرًا فَمَاتَ عَلَيْهِ إِلاَّ مَاتَ مِيتَةً جَاهِلِيَّةً .‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12355,
                "hadithNumber": "4792",
                "englishNarrator": "It has been narrated on the authority of Ibn 'Abdullah al-Bajali رضی اﷲ عنہ :",
                "hadithEnglish": "The Messenger of Allah (ﷺ) said: One who is killed under the banner of a man who is blind (to his just cause), who raises the slogan of family or supports his own tribe, dies the death of one belonging to the days of Jahiliyya.",
                "hadithUrdu": "رسول اﷲ صلی ‌اللہ ‌علیہ ‌وسلم نے فرمایا جو شخص اندھے جھندے کے تلے مارا جاوے اور وہ بلاتا ہو تعصب اور قومی طرفداری کی طرف یا مدد کرتا ہو قومی تعصب کی تو اس کا قتل جاہلیت کا سا ہوگا۔",
                "urduNarrator": "ہم سے حریم بن عبد الاعلٰی نے بیان کیا، کہا ہم سے معتمر نے بیان کیا، انہوں نے کہا کہ میں نے اپنے والد کی روایت سے اپنے والد کو فرماتے ہوئے سنا, جندب بن عبداﷲ بجلی رضی اﷲ عنہ سے روایت ہے",
                "hadithArabic": "حَدَّثَنَا هُرَيْمُ بْنُ عَبْدِ الأَعْلَى، حَدَّثَنَا الْمُعْتَمِرُ، قَالَ سَمِعْتُ أَبِي يُحَدِّثُ، عَنْ أَبِي، مِجْلَزٍ عَنْ جُنْدَبِ بْنِ عَبْدِ اللَّهِ الْبَجَلِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ ‏ مَنْ قُتِلَ تَحْتَ رَايَةٍ عُمِّيَّةٍ يَدْعُو عَصَبِيَّةً أَوْ يَنْصُرُ عَصَبِيَّةً فَقِتْلَةٌ جَاهِلِيَّةٌ.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12356,
                "hadithNumber": "4793",
                "englishNarrator": "It has been reported on the authority of Nafi رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "'Abdullah bin Umar رضی ‌اللہ ‌عنہ paid a visit to Abdullah bin Muti' رضی ‌اللہ ‌عنہ in the days (when atrocities were perpetrated on the People Of Medina) at Harra in the time of Yazid bin Mu'awiya. Ibn Muti' said: Place a pillow for Abu 'Abdul-Rahman رضی ‌اللہ ‌عنہ (family name of 'Abdullah bin 'Umar رضی ‌اللہ ‌عنہ ). But the latter said: I have not come to sit with you. I have come to you to tell you a tradition I heard from the Messenger of Allah (ﷺ). I heard him say: One who withdraws his band from obedience (to the Amir) will find no argument (in his defence) when he stands before Allah on the Day of Judgment, and one who dies without having bound himself by an oath of allegiance (to an Amir) will die the death of one belonging to the days of Jahillyya.",
                "hadithUrdu": "عبدﷲ بن عمر رضی ‌اللہ ‌عنہ عبدﷲ بن مطیع رضی ‌اللہ ‌عنہ کے پاس آئے جو حرہ کا واقعہ ہوا یزید بن معاویہ کے زمانہ میں اس نے مدینہ منورہ پر لشکر بھیجا اور مدینہ والے حرہ میں جو ایک مقام ہے مدینہ سے ملا ہوا قتل ہوئے اس طرح طرح کے ظلم مدینہ والوں پر ہوئے۔ عبداﷲ بن مطیع نے کہا ابو عبدالرحمن رضی ‌اللہ ‌عنہ ( یہ کنیت ہے عبداﷲ بن عمر رضی ‌اللہ ‌عنہ کی ) کے لیے تو شک بچھاؤ۔ انہوں نے کہا میں اس لیے نہیں آیا کہ بیٹھوں بلکہ ایک حدیث تجھ کو سنانے کے لیے آیا ہوں جو میں نے رسول اﷲ سے سنی ہے، آپ فرماتے تھے جو شخص اپنا ہاتھ نکال لے اطاعت سے وہ قیامت کے دن خدا سے ملے گا اور کوئی دلیل اس کے پاس نہ ہوگی اور جو شخص مرجاوے اور کسی سے اس نے بیعت نہ کی ہو تو اس کی موت جاہلیت کی سی ہوگی۔",
                "urduNarrator": "ہم سے عبید اللہ بن معاذ العنبری نے بیان کیا، کہا ہم سے میرے والد نے بیان کیا، کہا ہم سے عاصم نے جو محمد بن زید کے بیٹے ہیں، ہم سے زید بن محمد نے بیان کیا , نافع رضی ‌اللہ ‌عنہ سے روایت ہے",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا عَاصِمٌ، - وَهُوَ ابْنُ مُحَمَّدِ بْنِ زَيْدٍ - عَنْ زَيْدِ بْنِ مُحَمَّدٍ، عَنْ نَافِعٍ، قَالَ جَاءَ عَبْدُ اللَّهِ بْنُ عُمَرَ إِلَى عَبْدِ اللَّهِ بْنِ مُطِيعٍ حِينَ كَانَ مِنْ أَمْرِ الْحَرَّةِ مَا كَانَ زَمَنَ يَزِيدَ بْنِ مُعَاوِيَةَ فَقَالَ اطْرَحُوا لأَبِي عَبْدِ الرَّحْمَنِ وِسَادَةً فَقَالَ إِنِّي لَمْ آتِكَ لأَجْلِسَ أَتَيْتُكَ لأُحَدِّثَكَ حَدِيثًا سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُهُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ ‏ مَنْ خَلَعَ يَدًا مِنْ طَاعَةٍ لَقِيَ اللَّهَ يَوْمَ الْقِيَامَةِ لاَ حُجَّةَ لَهُ وَمَنْ مَاتَ وَلَيْسَ فِي عُنُقِهِ بَيْعَةٌ مَاتَ مِيتَةً جَاهِلِيَّةً.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12357,
                "hadithNumber": "4794",
                "englishNarrator": null,
                "hadithEnglish": "It has been narrated on the authority of Ibn 'Umar that he visited Ibn Muti', and related from the Prophet (ﷺ) the tradition that has gone before.",
                "hadithUrdu": "ہم سے ابن نمیر نے بیان کیا، ہم سے یحییٰ بن عبداللہ بن بکیر نے بیان کیا، ہم سے لیث نے بیان کیا، ان سے عبید اللہ بن ابی جعفر نے، وہ بکیر بن کی سند سے۔ عبداللہ بن اشجع، نافع کی سند سے، ابن عمر کی روایت سے کہ وہ ابن مطیع کے پاس آئے، تو انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے اسی طرح کا ذکر کیا۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا يَحْيَى بْنُ عَبْدِ اللَّهِ بْنِ بُكَيْرٍ، حَدَّثَنَا لَيْثٌ، عَنْ عُبَيْدِ اللَّهِ، بْنِ أَبِي جَعْفَرٍ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الأَشَجِّ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُ أَتَى ابْنَ مُطِيعٍ ‏.‏ فَذَكَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12358,
                "hadithNumber": "4795",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like that of Nafi from Ibn Umar was narrated from Ibn Umar (as no. 4793), from the prophet ﷺ.",
                "hadithUrdu": "ہم سے عمرو بن علی نے بیان کیا، ہم سے ابن مہدی نے بیان کیا، ہم سے محمد بن عمرو بن جبلہ نے بیان کیا، ہم سے بشر بن عمر نے بیان کیا، ان سب نے کہا، ہم سے بیان کیا ہشام بن سعد، زید بن اسلم کی سند سے، اپنے والد کی سند سے، ابن عمر کی سند سے، رسول اللہ صلی اللہ علیہ وسلم سے، نافع حدیث کے معنی کے ساتھ۔ ابن عمر کی طرف سے.",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا ابْنُ مَهْدِيٍّ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ عَمْرِو بْنِ جَبَلَةَ، حَدَّثَنَا بِشْرُ بْنُ عُمَرَ، قَالاَ جَمِيعًا حَدَّثَنَا هِشَامُ بْنُ سَعْدٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمَعْنَى حَدِيثِ نَافِعٍ عَنِ ابْنِ عُمَرَ ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12359,
                "hadithNumber": "4796",
                "englishNarrator": "It has been narrated on the authority of 'Arfaja رضی اللہ عنہ who said:",
                "hadithEnglish": "I have heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) say: Different evils will make their appearance in the near future. Anyone who tries to disrupt the affairs of this Umma while they are united you should strike him with the sword whoever he be. (If remonstrance does not prevail with him and he does not desist from his disruptive activities, he is to be killed.)",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا : \" جلد ہی فتنوں پر فتنے برپا ہوں گے ، تو جو شخص اس امت کے معاملے ( نظام سلطنت ) کو ٹکڑے ٹکڑے کرنا چاہے جبکہ وہ متحد ہو تو اسے تلوار کا نشانہ بنا دو ، وہ جو کوئی بھی ہو ، سو ہو.",
                "urduNarrator": "مجھ سے ابوبکر بن نافع اور محمد بن بشار نے بیان کیا، ابن نافع نے کہا: ہم سے غندر نے بیان کیا، اور ابن بشار نے کہا: ہم سے محمد بن بشار نے بیان کیا,  جعفر، شعبہ نے زیاد بن علاقہ سے حدیث بیان کی ، انہوں نے کہا : میں نے عَرفجہ رضی اللہ عنہ سے سنا ، کہا",
                "hadithArabic": "حَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالَ ابْنُ نَافِعٍ: حَدَّثَنَا غُنْدَرٌ،، وقَالَ ابْنُ بَشَّارٍ: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ زِيَادِ بْنِ عِلَاقَةَ، قَالَ: سَمِعْتُ عَرْفَجَةَ، قَالَ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: «إِنَّهُ سَتَكُونُ هَنَاتٌ وَهَنَاتٌ، فَمَنْ أَرَادَ أَنْ يُفَرِّقَ أَمْرَ هَذِهِ الْأُمَّةِ وَهِيَ جَمِيعٌ، فَاضْرِبُوهُ بِالسَّيْفِ كَائِنًا مَنْ كَانَ.",
                "headingArabic": "حُكْمِ مَنْ فَرَّقَ أَمْرَ الْمُسْلِمِينَ وَهُوَ مُجْتَمِعٌ ‏‏",
                "headingUrdu": "اس شخص کا حکم جو مسلمانوں کے متحد ہو کر ان میں تفرقہ ڈالنا چاہے",
                "headingEnglish": "The ruling on one who seeks to divide the muslims when they are united",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12360,
                "hadithNumber": "4797",
                "englishNarrator": "In another version of the tradition narrated on the same authority through a different chains of transmitters we have the words:",
                "hadithEnglish": "Kill him.",
                "hadithUrdu": "\" اسے قتل کر دو \" کے الفاظ ہیں.",
                "urduNarrator": "ہم سے احمد بن خراش نے بیان کیا، کہا ہم سے حبان نے بیان کیا، ابو عوانہ ، شیبان ، اسرائیل ، عبداللہ بن مختار اور ایک آدمی جس کا حماد نے نام لیا تھا ، ان سب نے زیاد بن علاقہ سے ، انہوں نے حضرت عرفجہ رضی اللہ عنہ سے ، انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے اسی کے مانند روایت بیان کی ، مگر ان سب کی حدیث میں",
                "hadithArabic": "وحَدَّثَنَا أَحْمَدُ بْنُ خِرَاشٍ، حَدَّثَنَا حَبَّانُ، حَدَّثَنَا أَبُو عَوَانَةَ، ح وحَدَّثَنِي الْقَاسِمُ بْنُ زَكَرِيَّا، حَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُوسَى، عَنْ شَيْبَانَ، ح وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا الْمُصْعَبُ بْنُ الْمِقْدَامِ الْخَثْعَمِيُّ، حَدَّثَنَا إِسْرَائِيلُ، ح وحَدَّثَنِي حَجَّاجٌ، حَدَّثَنَا عَارِمُ بْنُ الْفَضْلِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا عَبْدُ اللهِ بْنُ الْمُخْتَارِ، وَرَجُلٌ سَمَّاهُ كُلُّهُمْ عَنْ زِيَادِ بْنِ عِلَاقَةَ، عَنْ عَرْفَجَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ، غَيْرَ أَنَّ فِي حَدِيثِهِمْ جَمِيعًا: «فَاقْتُلُوهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12361,
                "hadithNumber": "4798",
                "englishNarrator": "It has been narrated (through a still different chain of transmitters) on the Same authority (i.e. 'Arfaja رضی اللہ عنہ ) who said similarly-but adding:",
                "hadithEnglish": "I heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) say: When you are holding to one single man as your leader, you should kill who seeks to undermine your solidarity or disrupt your unity.",
                "hadithUrdu": "میں نے نبی صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا : \" جب تمہارا نظام ( حکومت ) ایک شخص کے ذمے ہو ، پھر کوئی تمہارے اتحاد کی لاٹھی کو توڑنے یا تمہاری جماعت کو منتشر کرنے کے ارادے سے آگے بڑھے تو اسے قتل کر دو.",
                "urduNarrator": "مجھ سے عثمان بن ابی شیبہ نے بیان کیا، یونس بن ابو یعفور نے حضرت عرفجہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وحَدَّثَنِي عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يُونُسُ بْنُ أَبِي يَعْفُورٍ، عَنْ أَبِيهِ، عَنْ عَرْفَجَةَ، قَالَ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: «مَنْ أَتَاكُمْ وَأَمْرُكُمْ جَمِيعٌ عَلَى رَجُلٍ وَاحِدٍ، يُرِيدُ أَنْ يَشُقَّ عَصَاكُمْ، أَوْ يُفَرِّقَ جَمَاعَتَكُمْ، فَاقْتُلُوهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12362,
                "hadithNumber": "4799",
                "englishNarrator": "It has been narrated on the authority of Abu Sa'id al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: When oath of allegiance has been taken for two caliphs, kill the one for whom the oath was taken later.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب دو خلیفوں کے لیے بیعت لی جائے تو ان میں سے دوسرے کو قتل کر دو.",
                "urduNarrator": "مجھ سے وہب بن بقیہ الوسطی نے بیان کیا، ہم سے خالد بن عبداللہ نے بیان کیا، الجریری کی سند سے، ابو نادرہ کی سند سے, حضرت ابو سعید خدری رضی اللہ عنہ سے روایت ہے ، کہا",
                "hadithArabic": "وحَدَّثَنِي وَهْبُ بْنُ بَقِيَّةَ الْوَاسِطِيُّ، حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللهِ، عَنِ الْجُرَيْرِيِّ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا بُويِعَ لِخَلِيفَتَيْنِ، فَاقْتُلُوا الْآخَرَ مِنْهُمَا.",
                "headingArabic": "إِذَا بُويِعَ لِخَلِيفَتَيْنِ ‏",
                "headingUrdu": "جب دو خلفاء سے بیعت ہو چکی ہے۔",
                "headingEnglish": "When allegiance has been sworn to two caliphs",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12363,
                "hadithNumber": "4800",
                "englishNarrator": "It was narrated from Umm Salamah رضی اللہ عنہا :",
                "hadithEnglish": "The Messenger of Allah ﷺ said: In the near future there will be Amirs and you will like their good deeds and dislike their bad deeds. One who sees through their bad deeds (and tries to prevent their repetition by his band or through his speech), is absolved from blame, but one who hates their bad deeds (in the heart of his heart, being unable to prevent their recurrence by his hand or his tongue), is (also) fafe ( so far as God's wrath is concerned). But one who approves of their bad deeds and imitates them is spiritually ruined. People asked (the Holy Prophet ﷺ): Shouldn't we fight against them? He replied: No, as long as they say their prayers.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جلد ہی ایسے حکمران ہوں گے کہ تم انہیں ( کچھ کاموں میں ) صحیح اور ( کچھ میں ) غلط پاؤ گے ۔ جس نے ( ان کی رہنمائی میں ) نیک کام کیے وہ بَری ٹھہرا اور جس نے ( ان کے غلط کاموں سے ) انکار کر دیا وہ بچ گیا لیکن جو ہر کام پر راضی ہوا اور ( ان کی ) پیروی کی ( وہ بَری ہوا نہ بچ سکا ۔ ) \" صحابہ نے عرض کی : کیا ہم ان سے جنگ نہ کریں؟ آپ نے فرمایا : \" نہیں ، جب تک کہ وہ نماز پڑھتے رہیں ( جنگ نہ کرو.)",
                "urduNarrator": "ہمیں حداب بن خالد الازدی نے بیان کیا ہمام بن یحییٰ نے کہا : ہمیں قتادہ نے حسن سے حدیث بیان کی ، انہوں نے ضبہ بن محصن سے ، انہوں نے ام المومنین ام سلمہ رضی اللہ عنہا سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ الْأَزْدِيُّ، حَدَّثَنَا هَمَّامُ بْنُ يَحْيَى، حَدَّثَنَا قَتَادَةُ، عَنِ الْحَسَنِ، عَنْ ضَبَّةَ بْنِ مِحْصَنٍ، عَنْ أُمِّ سَلَمَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «سَتَكُونُ أُمَرَاءُ فَتَعْرِفُونَ وَتُنْكِرُونَ، فَمَنْ عَرَفَ بَرِئَ، وَمَنْ أَنْكَرَ سَلِمَ، وَلَكِنْ مَنْ رَضِيَ وَتَابَعَ» قَالُوا: أَفَلَا نُقَاتِلُهُمْ؟ قَالَ: «لَا، مَا صَلَّوْا.",
                "headingArabic": "وُجُوبِ الإِنْكَارِ عَلَى الأُمَرَاءِ فِيمَا يُخَالِفُ الشَّرْعَ وَتَرْكِ قِتَالِهِمْ مَا صَلَّوْا وَنَحْوِ ذَلِكَ",
                "headingUrdu": "حکمرانوں کو اس بات پر ملامت کرنا جس میں وہ خلاف شرع ہوں لیکن ان سے اس وقت تک لڑائی نہ کی جائے جب تک وہ پابندی سے نماز پڑھتے ہوں وغیرہ۔",
                "headingEnglish": "The obligation to denounce rulers for that in which they go against Shari'ah, but they should not be fought so long as they pray regularly, etc",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 12051,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=482",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=480",
                "label": "480",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=481",
                "label": "481",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=482",
                "label": "482",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=483",
                "label": "483",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=484",
                "label": "484",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=485",
                "label": "485",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=486",
                "label": "486",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=484",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=484",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=482",
        "to": 12075,
        "total": 40465
    }
}