{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 417,
        "data": [
            {
                "id": 10689,
                "hadithNumber": "3125",
                "englishNarrator": "It is narrated from Umm Habiba رضی اللہ تعالیٰ عنہا :",
                "hadithEnglish": "We used to set forth from Muzdalifa to Mina, (very early in the dawn) when it was dark. And in the narration of Naqid (the words are): We set from Muzdalifa in the darkness (of the dawn).",
                "hadithUrdu": "ہم ( خواتین ) رسول اللہ صلی اللہ علیہ و سلم کے عہد مبا رک میں یہی کرتی تھیں ( کہ ) ہم رات کے آخری پہر میں جمع ( مزدلفہ ) سے منیٰ کی طرف روانہ ہو جا تی تھیں ۔",
                "urduNarrator": "ابو بکر بن ابی شیبہ اور عمرو ناقد نے سفیان بن عیینہ کے حوالے سے عمرو بن دینار سے حدیث بیا ن کی ، انھوں نے سالم بن شوال سے اور انھوں نے حضرت ام حبیبہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ، ح وحَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ سَالِمِ بْنِ شَوَّالٍ، عَنْ أُمِّ حَبِيبَةَ، قَالَتْ: «كُنَّا نَفْعَلُهُ عَلَى عَهْدِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، نُغَلِّسُ مِنْ جَمْعٍ إِلَى مِنًى» وَفِي رِوَايَةِ النَّاقِدِ نُغَلِّسُ مِنْ مُزْدَلِفَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10690,
                "hadithNumber": "3126",
                "englishNarrator": "Ibn 'Abbas رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sent me from Muzdalifa ahead (of the caravan) along with the luggage or with the weak ones during (the latter part of the) night.",
                "hadithUrdu": "مجھے رسول اللہ صلی اللہ علیہ و سلم نے مزدلفہ سے ( اونٹوں پر لد ے ) بو جھ ۔ ۔ ۔ یا کہا : کمزور افرا د ۔ ۔ ۔ کے ساتھ را ت ہی روانہ کر دیا تھا ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ اور قتیبہ بن سعید نے بیان کیا, حماد بن زید نے ہمیں عبید اللہ بن ابی یزید سے خبر دی انھوں نے کہا : میں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے سنا ، کہہ رہے تھے",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَقُتَيْبَةُ بْنُ سَعِيدٍ، جَمِيعًا عَنْ حَمَّادٍ، قَالَ يَحْيَى: أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عُبَيْدِ اللهِ بْنِ أَبِي يَزِيدَ، قَالَ: سَمِعْتُ ابْنَ عَبَّاسٍ، يَقُولُ: «بَعَثَنِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي الثَّقَلِ - أَوْ قَالَ فِي الضَّعَفَةِ - مِنْ جَمْعٍ بِلَيْلٍ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10691,
                "hadithNumber": "3127",
                "englishNarrator": "Ibn 'Abbas ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "I was among those (i.e. women and children) whom Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) sent forth with the weak members of his family.",
                "hadithUrdu": "میں ان لوگوں میں سے تھا جنھیں رسول اللہ صلی اللہ علیہ و سلم نے اپنے گھر کے کمزور افراد میں ( شامل کرتے ہو ئے ) پہلے روانہ کر دیا تھا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، انہوں نے کہا ہم سے سفیان بن عیینہ نے حدیث بیان کی ، ( کہا : ) ہمیں عبید اللہ بن ابی یزید نے خبر دی کہ انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے سنا ، وہ کہہ رہے تھے",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، حَدَّثَنَا عُبَيْدُ اللهِ بْنُ أَبِي يَزِيدَ، أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ، يَقُولُ: «أَنَا مِمَّنْ قَدَّمَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي ضَعَفَةِ أَهْلِهِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10692,
                "hadithNumber": "3128",
                "englishNarrator": "It was narrated that Ibn 'Abbas ( رضی اللہ تعالیٰ عنہ) said:",
                "hadithEnglish": "\"I was among those whom the Messenger of Allah ﷺ sent on ahead with the weakness of ones of his family.\"",
                "hadithUrdu": "ان لوگوں میں سے تھا جنھیں رسول اللہ صلی اللہ علیہ و سلم نے اپنے گھر کے کمزور افراد میں ( شامل کرتے ہو ئے ) پہلے روانہ کر دیا تھا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، کہا ہم سے عمرو نے بیان کیا, عطاء نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، حَدَّثَنَا عَمْرٌو، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ: «كُنْتُ فِيمَنْ قَدَّمَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي ضَعَفَةِ أَهْلِهِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10693,
                "hadithNumber": "3129",
                "englishNarrator": "Ata' reported from Ibn Abbas (رضی اللہ تعالیٰ عنہ):",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sent me from Muzdalifa along with his luggage (in the very early part of @he dawn). I (Ibn Juraij, one of the narrators) said (to 'Ata'): Has this (news) reached you that Ibn 'Abbas (رضی اللہ تعالیٰ عنہ) had said: He (Allah's Messenger) had sent me in the latter part of the night ? Thereupon he said: No, it was the dawn. I (again) said to him: (Did you hear) Ibn 'Abbas (رضی اللہ تعالیٰ عنہ) having said this (too): We stoned al-Jamra before the dawn prayer ? So where did he observe the dawn prayer? He said: No. But he said only so much (as described above).",
                "hadithUrdu": "مجھے رسول اللہ صلی اللہ علیہ و سلم نے سحر کے وقت مزدلفہ سے اونٹوں پر لدے بوجھ کے ساتھ ( جس میں کمزور افراد بھی شامل ہو تے ہیں ) روانہ کر دیا ( ابن جریج نے کہا : ) میں نے عطاء سے ) کہا : کیا آپ کو یہ بات پہنچی ہے کہ حضرت ابن عباس رضی اللہ تعالیٰ عنہ نےکہا : آپ مجھے لمبی رات ( کے وقت ) روانہ کر دیا تھا؟انھوں نے کہا : نہیں صرف یہی ( کہا : ) کہ سحر کے وقت روانہ کیا ۔ میں نے ان سے کہا : ( کیا ) حضرت ابن عباس رضی اللہ تعالیٰ عنہ نے ( یہ بھی ) کہا : ہم نے فجر سے پہلے جمرہ عقبہ کو کنکریاں ماریں؟ اور انھوں نے فجر کی نماز کہاں ادا کی تھی؟ انھوں نے کہا : مہیں ( مجھ سے ) صرف یہی الفا ظ کہے ۔ )",
                "urduNarrator": "ہم سے عبد بن حمید نے بیان کیا، کہا ہم سے محمد بن بکر نے بیان کیا, ہمیں ابن جریج نے خبر دی کہا : مجھے عطا ء نے بتا یا کہ حضرت ابن عباس رضی اللہ تعالیٰ عنہ نے کہا",
                "hadithArabic": "وحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عَطَاءٌ، أَنَّ ابْنَ عَبَّاسٍ، قَالَ: بَعَثَ بِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِسَحَرٍ مِنْ جَمْعٍ فِي ثَقَلِ نَبِيِّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قُلْتُ: أَبَلَغَكَ أَنَّ ابْنَ عَبَّاسٍ قَالَ: بَعَثَ بِي بِلَيْلٍ طَوِيلٍ؟ قَالَ: لَا، إِلَّا كَذَلِكَ بِسَحَرٍ، قُلْتُ لَهُ: فَقَالَ ابْنُ عَبَّاسٍ: رَمَيْنَا الْجَمْرَةَ قَبْلَ الْفَجْرِ، وَأَيْنَ صَلَّى الْفَجْرَ؟ قَالَ: لَا إِلَّا كَذَلِكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10694,
                "hadithNumber": "3130",
                "englishNarrator": "Salim bin 'Abdullah reported:",
                "hadithEnglish": "'Abdullah bin 'Umar (رضی اللہ تعالیٰ عنہ) used to send ahead of him the weak members of his household to stay during the night at Mash'ar al-Haram at Muzdalifa. They remembered Allah so long as they could afford, and then they proceeded before the stay of the Imam, and before his return. So some of them reached Mina for the dawn prayer and some of them reached there after that; and as they reached there, they stoned al-Jamra; and Ibn 'Umar (رضی اللہ تعالیٰ عنہ) used to say: Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) has granted this concession to them.",
                "hadithUrdu": "حضرت عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ اپنے گھر کے کمزور افراد کو پہلے روانہ کر دیتے تھے ۔ وہ لوگ رات کو مزدلفہ میں مشعر حرام کے پاس ہی وقوف کرتے ، اور جتنا میسر ہو تا اللہ کا ذکر کرتے ، اس کے بعد وہ امام کے مشعر حرام کے سامنے وقوف اور اس کی روانگی سے پہلے ہی روانہ ہو جا تے ۔ ان میں سے کچھ فجر کی نماز اداکرنے ) کے لیے منیٰ آجا تے اور کچھ اس کے بعد آتے ۔ پھر جب وہ ( سب لو گ منیٰ آجا تے تو جمرہ عقبہ کو کنکریاں مارتے ۔ حضرت ابن عمر رضی اللہ تعالیٰ عنہ کہا کرتے تھے : رسول اللہ صلی اللہ علیہ و سلم نے ان ( کمزور لوگوں ) کو رخصت دی ہے ۔",
                "urduNarrator": "مجھ سے ابو الطاہر اور حرملہ بن یحییٰ نے بیان کیا، کہا کہ ہم سے ابن وہب نے بیان کیا، مجھ سے یونس نے ابن شہاب سے بیان کیا, سالم بن عبد اللہ نے خبر دی کہ",
                "hadithArabic": "وحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، قَالَا: أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَنَّ سَالِمَ بْنَ عَبْدِ اللهِ، أَخْبَرَهُ أَنَّ عَبْدَ اللهِ بْنَ عُمَرَ، كَانَ «يُقَدِّمُ ضَعَفَةَ أَهْلِهِ فَيَقِفُونَ عِنْدَ الْمَشْعَرِ الْحَرَامِ بِالْمُزْدَلِفَةِ بِاللَّيْلِ، فَيَذْكُرُونَ اللهَ مَا بَدَا لَهُمْ، ثُمَّ يَدْفَعُونَ قَبْلَ أَنْ يَقِفَ الْإِمَامُ وَقَبْلَ أَنْ يَدْفَعَ، فَمِنْهُمْ مَنْ يَقْدَمُ مِنًى لِصَلَاةِ الْفَجْرِ، وَمِنْهُمْ مَنْ يَقْدَمُ بَعْدَ ذَلِكَ، فَإِذَا قَدِمُوا رَمَوْا الْجَمْرَةَ» وَكَانَ ابْنُ عُمَرَ يَقُولُ: «أَرْخَصَ فِي أُولَئِكَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10695,
                "hadithNumber": "3131",
                "englishNarrator": "Abdul-Rahman bin Yazid reported:",
                "hadithEnglish": "'Abdullah bin Mas'ud (رضی اللہ تعالیٰ عنہ) threw seven pebbles at Jamrat al-'Aqaba from the heart of the valley. He pronounced Takbir with every pebble. It was said to him that people fling stones from the upper side (of the valley), whereupon 'Abdullah bin Mas'ud (رضی اللہ تعالیٰ عنہ) said: By him, besides Whom there is no other god, that is the place (of flinging stones) of one upon whom Surah al-Baqara was revealed (the Holy Prophet).",
                "hadithUrdu": "حضرت عبد اللہ بن مسعود رضی اللہ تعالیٰ عنہ نے جمرہ عقبہ کو وادی کے اندر سے سات کنکریوں کے ساتھ رمی کی وہ ہر کنکری کے ساتھ اللہ اکبر کہتے تھے ۔ ( عبد الرحمن نے ) کہا : ان سے کہا گیا : کچھ لوگ اسے ( جمرہ کو ) اس کی بالا ئی طرف سے کنکریاں مارتے ہیں تو عبد اللہ بن مسعود رضی اللہ تعالیٰ عنہ نے کہا : اس ذات کی قسم جس کے سوا کو ئی معبود نہیں !یہی اس ہستی کے کھڑے ہو نے کی جگہ ہے جن پر سورہ بقرہ نازل کی گئی ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، انہوں نے کہا: ہم سے انہوں نے بیان کیا ہمیں ابو معاویہ نے اعمش سے حدیث بیان کی ، انھوں نے ابرا ہیم سے انھوں نے عبد الرحمن بن یزید سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، قَالَا: حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، قَالَ: رَمَى عَبْدُ اللهِ بْنُ مَسْعُودٍ جَمْرَةَ الْعَقَبَةِ مِنْ بَطْنِ الْوَادِي بِسَبْعِ حَصَيَاتٍ، يُكَبِّرُ مَعَ كُلِّ حَصَاةٍ. قَالَ فَقِيلَ لَهُ: إِنَّ أُنَاسًا يَرْمُونَهَا مِنْ فَوْقِهَا، فَقَالَ عَبْدُ اللهِ بْنُ مَسْعُودٍ: هَذَا، وَالَّذِي لَا إِلَهَ غَيْرُهُ، «مَقَامُ الَّذِي أُنْزِلَتْ عَلَيْهِ سُورَةُ الْبَقَرَةِ».",
                "headingArabic": "رَمْىِ جَمْرَةِ الْعَقَبَةِ مِنْ بَطْنِ الْوَادِي وَتَكُونُ مَكَّةُ عَنْ يَسَارِهِ وَيُكَبِّرُ مَعَ كُلِّ حَصَاةٍ",
                "headingUrdu": "جمرات عقبہ کو وادی کے نیچے سے سنگسار کرنا۔ مکہ بائیں طرف ہونا چاہیے اور ہر پھینک کے ساتھ تکبیر کہنا چاہیے۔",
                "headingEnglish": "Stoning Jamrat Al-'Aqabah from the bottom of the valley; Makkah should be on to one's left and one should say Takbir with each throw",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10696,
                "hadithNumber": "3132",
                "englishNarrator": "A'mash reported:",
                "hadithEnglish": "I heard Hajjaj bin Yusuf saying as he was delivering sermon on the pulpit: Observe the order of the (Holy) Qur'an which has been observed by Gabriel. (Thus state the surahs in this manner) one in which mention has been made of al-Baqara, one in which mention has been made of women (Surah al-Nisa') and then the surah in which mention has been made of the Family of 'Imrin. He (the (narrator) said: I met Ibrahim and informed him about these words of his (the statement of Hajjaj bin Yusuf). He cursed him and said: Abdul-Rahman bin Yazid has narrated to me that when he was in the company of 'Abdullah bin Mas'udd (رضی اللہ تعالیٰ عنہ) he came to Jamrat al-'Aqaba and then entered the heart of the valley and faced towards it (the Jamra) and then flung seven pebbles at it from the heart of the valley pronouncing Takbir with every pebble. I said: Abu 'Abd al-Rahman, people fling pebbles at it (Jamra) from the upper side, whereupon he said: By Him besides Whom there is no god, that is the place (of flinging pebbles of one) upon whom Surah al-Baqara was revealed;",
                "hadithUrdu": "میں نے حجا ج بن یو سف سے سنا وہ منبر پر خطبہ دیتے ہو ئے کہہ رہا تھا : قرآن کی وہی ترتیب رکھو جو جبریلؑ نے رکھی ( نیز سورہ بقرہ کہنے کے بجا ئے کہو ) وہ سورت جس میں بقر ہ کا ذکر کیا گیا ہے وہ سورت جس میں نساء کا تذکرہ ہے وہ سورت جس میں آل عمران کا تذکرہ ہے ۔ ( اعمش نے ) کہا اس کے بعد میں ابر اہیم سے ملا ، میں نے انھیں اس کی بات سنائی تو انھوں نے اس پر سب وشتم کیا اور کہا : مجھ سے عبد الرحمٰن بن یزید نے حدیث بیان کی کہ وہ حضرت عبد اللہ بن مسعود رضی اللہ تعالیٰ عنہ کے ساتھ تھے ۔ ۔ وہ جمرہ عقبہ کے پاس آئے وادی کے اندر کھڑے ہو ئے اس ( جمرہ ) کو چوڑا ئی کے رخ اپنے سامنے رکھا اس کے بعد وادی کے اندر سے اس کو سات کنکریاں ماریں وہ ہر کنکری کے ساتھ اللہ اکبر کہتے تھے کہا : میں نے عرض کی : ابو عبد الرحمٰن کچھ لو گ اس کے اوپر ( کی طرف ) سے اسے کنکریاں مارتے ہیں انھوں نے کہا اس ذات کی قسم!جس کے سوا کو ئی معبود نہیں !یہی اس ہستی کے کھڑے ہو نے کی جگہ ہے جس پر سورہ بقرہ نازل ہو ئی ۔",
                "urduNarrator": "ہم سے منجاب بن الحارث التمیمی نے بیان کیا، انہوں نے کہا ابن مسہر نے مجھے اعمش سے خبر دی ( انھوں نے ) کہا",
                "hadithArabic": "وحَدَّثَنَا مِنْجَابُ بْنُ الْحَارِثِ التَّمِيمِيُّ، أَخْبَرَنَا ابْنُ مُسْهِرٍ، عَنِ الْأَعْمَشِ، قَالَ: سَمِعْتُ الْحَجَّاجَ بْنَ يُوسُفَ، يَقُولُ: وَهُوَ يَخْطُبُ عَلَى الْمِنْبَرِ: أَلِّفُوا الْقُرْآنَ كَمَا أَلَّفَهُ جِبْرِيلُ، السُّورَةُ الَّتِي يُذْكَرُ فِيهَا الْبَقَرَةُ وَالسُّورَةُ الَّتِي يُذْكَرُ فِيهَا النِّسَاءُ، وَالسُّورَةُ الَّتِي يُذْكَرُ فِيهَا آلُ عِمْرَانَ. قَالَ: فَلَقِيتُ إِبْرَاهِيمَ فَأَخْبَرْتُهُ بِقَوْلِهِ، فَسَبَّهُ وَقَالَ: حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ يَزِيدَ، أَنَّهُ كَانَ مَعَ عَبْدِ اللهِ بْنِ مَسْعُودٍ، فَأَتَى جَمْرَةَ الْعَقَبَةِ، فَاسْتَبْطَنَ الْوَادِي، فَاسْتَعْرَضَهَا، فَرَمَاهَا مِنْ بَطْنِ الْوَادِي بِسَبْعِ حَصَيَاتٍ، يُكَبِّرُ مَعَ كُلِّ حَصَاةٍ، قَالَ فَقُلْتُ: يَا أَبَا عَبْدِ الرَّحْمَنِ إِنَّ النَّاسَ يَرْمُونَهَا مِنْ فَوْقِهَا فَقَالَ: هَذَا، وَالَّذِي لَا إِلَهَ غَيْرُهُ، «مَقَامُ الَّذِي أُنْزِلَتْ عَلَيْهِ سُورَةُ الْبَقَرَةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10697,
                "hadithNumber": "3133",
                "englishNarrator": "A'mash reported:",
                "hadithEnglish": "I heard Hajjaj saying I Do not say Surah al-Baqara. The rest of the hadith is the same.",
                "hadithUrdu": "میں نے حجاج سے سنا ، کہہ رہا تھا : \" سورہ بقرہ نہ کہو ۔ ۔ ۔ ۔ اور ان دونوں نے ابن مسہر کی حدیث کی طرح حدیث بیا ن کی .",
                "urduNarrator": "یعقوب الدورقی نے مجھ سے کہا, ابن ابی زائدہ اور سفیان دونوں نے ہمیں اعمش سے حدیث بیان کی ، انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي يَعْقُوبُ الدَّوْرَقِيُّ، حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ، ح وحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، كِلَاهُمَا عَنِ الْأَعْمَشِ، قَالَ: سَمِعْتُ الْحَجَّاجَ، يَقُولُ: لَا تَقُولُوا سُورَةُ الْبَقَرَةِ وَاقْتَصَّا الْحَدِيثَ بِمِثْلِ حَدِيثِ ابْنِ مُسْهِرٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10698,
                "hadithNumber": "3134",
                "englishNarrator": "Abdul-Rahman bin Yazid reported:",
                "hadithEnglish": "He performed Hajj along with 'Abdullah (رضی اللہ تعالیٰ عنہ) and he flung seven pebbles at al-Jamra (from a position) that the House was on his left and Mina was on his right and said: That is the place (of flinging pebbles of one) upon whom Surah al-Baqara was revealed.",
                "hadithUrdu": "انھوں نے حضرت عبد اللہ رضی اللہ تعالیٰ عنہ ( بن مسعود ) کی معیت میں حج کیا کہا : انھوں نے جمرہ عقبہ کو سات کنکریاں ماریں اور بیت اللہ کو اپنی بائیں طرف اور منیٰ کو دائیں طرف رکھا اور کہا یہی ان کے کھڑے ہو نے کی جگہ ہے جن پر سورہ بقرہ نازل کی گئی ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, ہمیں محمد بن جعفر غندرنے حدیث بیان کی ، ( کہا : ) ہمیں شعبہ نے حکم سے حدیث بیان کی انھوں نے ابرا ہیم سے اور انھوں نے عبد الرحمٰن بن یزید سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا غُنْدَرٌ، عَنْ شُعْبَةَ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ إِبْرَاهِيمَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، أَنَّهُ حَجَّ مَعَ عَبْدِ اللهِ قَالَ: فَرَمَى الْجَمْرَةَ بِسَبْعِ حَصَيَاتٍ وَجَعَلَ الْبَيْتَ عَنْ يَسَارِهِ وَمِنًى عَنْ يَمِينِهِ وَقَالَ: «هَذَا مَقَامُ الَّذِي أُنْزِلَتْ عَلَيْهِ سُورَةُ الْبَقَرَةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10699,
                "hadithNumber": "3135",
                "englishNarrator": "This hadith nas been narrated on the authority of Shu'ba with the same chain of transmitters except with this variation of (words):",
                "hadithEnglish": "As he came to Jamrat al-'Aqaba.",
                "hadithUrdu": "جب وہ جمرہ عقبہ کے پاس آئے ۔",
                "urduNarrator": "ہمیں معاذ عنبری نے حدیث بیان کی ، ( کہا : ) ہمیں شعبہ نے اسی سند کے ساتھ ( یہی ) حدیث بیان کی ، البتہ انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، بِهَذَا الْإِسْنَادِ غَيْرَ أَنَّهُ قَالَ: فَلَمَّا أَتَى جَمْرَةَ الْعَقَبَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10700,
                "hadithNumber": "3136",
                "englishNarrator": "Abdul-Rahman bin Yazid reported:",
                "hadithEnglish": "It was said to 'Abdullah ( رضی اللہ تعالیٰ عنہ) that people threw pebbles at the Jamra from the upper side of 'Aqaba, whereas he threw stones at it from the heart of the valley, whereupon he said: By Him besides Whom there is no god, it is at this very place that one upon whom was revealed Surah al-Baqara threw stones at it.",
                "hadithUrdu": "حضرت عبد اللہ رضی اللہ تعالیٰ عنہ سے کہا گیا : کچھ لو گ جمرہ عقبہ کو گھا ٹی کے اوپر سے کنکریاں مارتے ہیں ۔ کہا : تو حضرت عبد اللہ رضی اللہ تعالیٰ عنہ نے وادی کے اندر سے اسے کنکریاں ماریں ۔ پھر کہا : یہیں سے اس ذات کی قسم جس کے سوا کو ئی حقیقی معبود نہیں ! اس ہستی نے کنکریاں ماریں جن پر سورہ بقرہ نازل کی گئی ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے ابو المحیٰہ نے بیان کیا، کہا ہم سے یحییٰ بن یحییٰ نے بیان کیا اور تلفظ ان کا ہے - ہم سے یحییٰ بن نے بیان کیا یالا ابو المحیہ، کی سند پر سلمہ بن کہیل نے عبد الرحمٰن بن یزید سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو الْمُحَيَّاةِ، ح وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، - وَاللَّفْظُ لَهُ - أَخْبَرَنَا يَحْيَى بْنُ يَعْلَى أَبُو الْمُحَيَّاةِ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، قَالَ: قِيلَ لِعَبْدِ اللهِ إِنَّ نَاسًا يَرْمُونَ الْجَمْرَةَ مِنْ فَوْقِ الْعَقَبَةِ، قَالَ: فَرَمَاهَا عَبْدُ اللهِ مِنْ بَطْنِ الْوَادِي، ثُمَّ قَالَ: «مِنْ هَا هُنَا، وَالَّذِي لَا إِلَهَ غَيْرُهُ، رَمَاهَا الَّذِي أُنْزِلَتْ عَلَيْهِ سُورَةُ الْبَقَرَةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10701,
                "hadithNumber": "3137",
                "englishNarrator": "Jabir (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "I saw Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) flinging pebbles while riding his camel on the Day of Nahr, and he was saying: Learn your rituals (by seeing me performing them), for I do not know whether I would be performing Hajj after this Hajj of mine.",
                "hadithUrdu": "میں نے نبی صلی اللہ علیہ و سلم کو دیکھا آپ قربانی کے دن اپنی سواری پر ( سوار ہو کر ) کنکریاں مار رہے تھے اور فرما رہے تھے : تمھیں چا ہیے کہ تم اپنے حج کے طریقے سیکھ لو ، میں نہیں جا نتا شاید اس حج کے بعد میں ( دوبارہ ) حج نہ کر سکوں ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم اور علی بن خشرم نے بیان کیا، عیسیٰ بن یونس کی سند سے کہا: ہم سے عیسیٰ نے ابن جریج سے بیان کیا۔ مجھے ابو الزبیر نے بیان کیا کہ انہوں نے سنا , حضرت جابر رضی اللہ تعالیٰ عنہ بیان کرتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَلِيُّ بْنُ خَشْرَمٍ، جَمِيعًا عَنْ عِيسَى بْنِ يُونُسَ، قَالَ ابْنُ خَشْرَمٍ: أَخْبَرَنَا عِيسَى، عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرًا، يَقُولُ: رَأَيْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَرْمِي عَلَى رَاحِلَتِهِ يَوْمَ النَّحْرِ، وَيَقُولُ: «لِتَأْخُذُوا مَنَاسِكَكُمْ، فَإِنِّي لَا أَدْرِي لَعَلِّي لَا أَحُجُّ بَعْدَ حَجَّتِي هَذِهِ».",
                "headingArabic": "اسْتِحْبَابِ رَمْىِ جَمْرَةِ الْعَقَبَةِ يَوْمَ النَّحْرِ رَاكِبًا وَبَيَانِ قَوْلِهِ صَلَّى اللَّهُ تَعَالَى عَلَيْهِ وَسَلَّمَ: «لِتَأْخُذُوا مَنَاسِكَكُمْ»",
                "headingUrdu": "جمرات عقبہ کو سنگسار کرنا مستحب ہے، قربانی کے دن سواری، اور نبی صلی اللہ علیہ وسلم نے فرمایا: \"اپنے مناسک (حج) مجھ سے سیکھو\"۔",
                "headingEnglish": "It is recommended to stone Jamrat Al-'Aqabah, on the day of sacrifice, riding, and the prophet saws said: \"Learn your rituals (of Hajj) from me\"",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10702,
                "hadithNumber": "3138",
                "englishNarrator": "Umm al-Husain ( رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "I performed Hajj along with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) on the occasion of the Farewell Pilgrimage and saw him when he flung pebbles at Jamrat al-'Aqaba and returned while he was riding the camel, and Bilal and Usama رضی اللہ تعالیٰ عنہ were with him. One of them was leading his camel, while the other was raising his cloth over the head of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) to protect him from the sun. She (further) said: Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said so many things, and I heard him saying: If a slave having some limb of his missing and having dark complexion is appointed to govern you according to the Book of Allah the Exalted. listen to him and obey him.",
                "hadithUrdu": "میں نے ان سے سنا کہہ رہی تھیں حجۃالوداع کے موقع پر میں نے رسول اللہ صلی اللہ علیہ و سلم کی معیت میں حج کیا ، میں نے آپ صلی اللہ علیہ و سلم کو اس وقت دیکھا جب آپ نے جمرہ عقبہ کو کنکریاں ماریں اور واپس پلٹے آپ اپنی سواری پر تھے اور بلال اور اسامہ رضی اللہ تعالیٰ عنہ آپ کے ساتھ تھے ان میں سے ایک آگے سے ( مہار پکڑ کر ) آپ کی سواری کو ہانک رہا تھا اور دوسرا دھوپ سے ( بچاؤ کے لیے ) اپنا کپڑا رسول اللہ صلی اللہ علیہ و سلم کے سر مبارک پر تا نے ہو ئے تھا ۔ کہا رسول اللہ صلی اللہ علیہ و سلم نے ( اس موقع پر ) بہت سی باتیں ارشاد فر ما ئیں ۔ پھر میں نے آپ سے سنا آپ فر ما رہے تھے : اگر کو ئی کٹے ہو ئے اعضا ء والا ۔ ۔ ۔ میرا خیال ہے انھوں ( ام حصین رضی اللہ تعالیٰ عنہا ) نے کہا : ۔ ۔ ۔ کا لا غلا م بھی تمھا را میرا بنا دیا جا ئے جو اللہ کی کتاب کے مطابق تمھا ری قیادت کرے تو تم اس کی بات سننا اور اطاعت کرنا ۔",
                "urduNarrator": "مجھ سے سلمہ بن شبیب نے بیان کیا، کہا ہم سے حسن بن اعین نے بیان کیا، انہوں نے بیان کیا معقل نے زید بن ابی انیسہ سے حدیث بیان کی انھوں نے یحییٰ بن حصین سے اور انھوں نے اپنی دادی ام حصین رضی اللہ تعالیٰ عنہا سے روایت کی ، ( یحییٰ بن حصین نے ) کہا",
                "hadithArabic": "وحَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ، عَنْ يَحْيَى بْنِ حُصَيْنٍ، عَنْ جَدَّتِهِ أُمِّ الْحُصَيْنِ، قَالَ: سَمِعْتُهَا تَقُولُ: حَجَجْتُ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حَجَّةَ الْوَدَاعِ، فَرَأَيْتُهُ حِينَ رَمَى جَمْرَةَ الْعَقَبَةِ، وَانْصَرَفَ وَهُوَ عَلَى رَاحِلَتِهِ وَمَعَهُ بِلَالٌ وَأُسَامَةُ أَحَدُهُمَا يَقُودُ بِهِ رَاحِلَتَهُ، وَالْآخَرُ رَافِعٌ ثَوْبَهُ عَلَى رَأْسِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنَ الشَّمْسِ، قَالَتْ: فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَوْلًا كَثِيرًا، ثُمَّ سَمِعْتُهُ يَقُولُ: «إِنْ أُمِّرَ عَلَيْكُمْ عَبْدٌ مُجَدَّعٌ - حَسِبْتُهَا قَالَتْ - أَسْوَدُ، يَقُودُكُمْ بِكِتَابِ اللهِ تَعَالَى، فَاسْمَعُوا لَهُ وَأَطِيعُوا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10703,
                "hadithNumber": "3139",
                "englishNarrator": "Umm al-Husain (رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "I performed Hajj along with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) on the occasion of the Farewell Pilgrimage and saw Usama and Bilal رضی اللہ تعالیٰ عنہ (too), one of whom had caught hold of the lose string of the she-camel of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) while the other one was raising his cloth (over his head) protecting him from the heat, till he flung pebbles at Jamrat al-'Aqaba.\r\nImam Muslim said: Abu Abdul Rahim's name is Khalid bin Abi Yazid and he is the uncle of Muhammad bin Salama.",
                "hadithUrdu": "میں نے نبی صلی اللہ علیہ و سلم کے ساتھ الوداعی حج کیا تو میں نے اسامہ اور بلال رضی اللہ تعالیٰ عنہ کو دیکھا ان میں سے ایک نبی صلی اللہ علیہ و سلم کی اونٹنی کی نکیل تھا مے ہو ئے تھا اور دوسرا کپڑے کو اٹھا ئے گرمی سے اوٹ کر رہا تھا یہاں تک کہ آپ نے جمرہ عقبہ کو کنکریاں ماریں ۔\r\n امام مسلم نے کہا : ابو عبد الرحیم کا نام خالد بن ابی یزید ہے اور وہ محمد بن سلمہ کے ماموں ہیں ان سے وکیع اور حجاج اعور نے ( حدیث ) روایت کی .",
                "urduNarrator": "مجھ سے احمد بن حنبل نے بیان کیا، ہم سے محمد بن سلمہ نے بیان کیا, ابو عبد الرحیم نے زید بن ابی انیسہ سے انھوں نے یحییٰ بن حصین سے اور انھوں نے اپنی دادی ام حصین رضی اللہ تعالیٰ عنہا سے روایت کی انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ، عَنْ أَبِي عَبْدِ الرَّحِيمِ، عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ، عَنْ يَحْيَى بْنِ الْحُصَيْنِ، عَنْ أُمِّ الْحُصَيْنِ، جَدَّتِهِ قَالَتْ: «حَجَجْتُ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حَجَّةَ الْوَدَاعِ، فَرَأَيْتُ أُسَامَةَ وَبِلَالًا، وَأَحَدُهُمَا آخِذٌ بِخِطَامِ نَاقَةِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَالْآخَرُ رَافِعٌ ثَوْبَهُ يَسْتُرُهُ مِنَ الْحَرِّ، حَتَّى رَمَى جَمْرَةَ الْعَقَبَةِ» قَالَ مُسْلِم: وَاسْمُ أَبِي عَبْدِ الرَّحِيمِ خَالِدُ بْنُ أَبِي يَزِيدَ وَهُوَ خَالُ مُحَمَّدِ بْنِ سَلَمَةَ رَوَى عَنْهُ وَكِيعٌ وَحَجَّاجٌ الْأَعْوَرُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10704,
                "hadithNumber": "3140",
                "englishNarrator": "Jabir bin 'Abdullah reported:",
                "hadithEnglish": "I saw Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) throwing stones (at Jamrat al 'Aqaba) like pelting of small pebbles.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا ، آپ نے جمرہ عقبہ کو اتنی بڑی کنکریاں ماریں جتنی چٹکی ( دو انگلیوں ) سے ماری جانے والی کنکریاں ہوتی ہیں ۔",
                "urduNarrator": "مجھ سے محمد بن حاتم اور عبد بن حمید نے بیان کیا کہ ہم سے محمد بن بکر نے بیان کیا, ابو زبیرنے خبر دی کہ انھوں نے حضرت جابر بن عبداللہ سے سنا ، وہ بیان کررہے تھے",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ ابْنُ حَاتِمٍ: حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنَا أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ، يَقُولُ: «رَأَيْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ رَمَى الْجَمْرَةَ بِمِثْلِ حَصَى الْخَذْفِ».",
                "headingArabic": "اسْتِحْبَابِ كَوْنِ حَصَى الْجِمَارِ بِقَدْرِ حَصَى الْخَذْفِ ‏",
                "headingUrdu": "پھر بھی یہ تجویز کردہ چار پبلیس اسد تھے چار سنگسار خلیج میں چوڑے بانس کے سائز کے تھے۔",
                "headingEnglish": "It is recommended for the pebbles used for stoning to be the size of broad beans",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10705,
                "hadithNumber": "3141",
                "englishNarrator": "Jabir (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) flung pebbles at jamra on the Day of Nahr after sunrise, and after that (i. e. on the 11th, 12th and 13th of Dhu'l-Hijja when the sun had declined.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے قربانی کے دن چاشت کے وقت جمرہ ( عقبہ ) کو کنکریاں ماریں اور اس کے بعد ( کے دنوں میں تمام جمروں کو ) اس وقت جب سورج ڈھل گیا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، انہوں نے بیان کیا ابو خالد احمر اورابن ادریس نے ابن جریج سے حدیث بیان کی ، انھوں نے ابوزبیر سے اورانھوں نے جابر رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ، وَابْنُ إِدْرِيسَ، عَنِ ابْنِ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ: «رَمَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الْجَمْرَةَ يَوْمَ النَّحْرِ ضُحًى، وَأَمَّا بَعْدُ فَإِذَا زَالَتِ الشَّمْسُ».",
                "headingArabic": "بَيَانِ وَقْتِ اسْتِحْبَابِ الرَّمْىِ ‏",
                "headingUrdu": "جس وقت جمرہ کو سنگسار کرنا مستحب ہے۔",
                "headingEnglish": "The time when it is recommended to stone the Jamrah",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10706,
                "hadithNumber": "3142",
                "englishNarrator": null,
                "hadithEnglish": "Jabir bin Abdullah رضی اللہ تعالیٰ عنہ reported a hadith like this from Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌).",
                "hadithUrdu": "ہم سے علی بن خشرم نے بیان کیا، انہوں نے بیان کیا ہمیں عیسیٰ بن یونس نے خبردی ، ( کہا : ) ہمیں ابن جریج نے خبر دی ، ( کہا : ) مجھے ابو زبیرنے بتایا کہ انھوں نے جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے سنا ، وہ کہہ رہے تھے : نبی کریم صلی اللہ علیہ وسلم آگے اسی کے مانند ہے ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَاه عَلِيُّ بْنُ خَشْرَمٍ، أَخْبَرَنَا عِيسَى، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ، يَقُولُ: كَانَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10707,
                "hadithNumber": "3143",
                "englishNarrator": "Jabir (bin Abdullah) ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Odd number of stones are to be used for cleaning (the private parts after answering the call of nature), and casting of pebbles at the Jamras is to be done by odd numbers (seven), and (the number) of circuits between al-Safa' and al-Marwa is also odd (seven), and the number of circuits (around the Ka'ba) is also odd (seven). Whenever any one of you is required to use stones (for cleaning the private parts) he should use odd number of stones (three, five or seven).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" استنجا طاق ڈھیلوں سے ہوتاہے ، جمرات کی رمی طاق ہوتی ہے ، صفا مروہ کے درمیان سعی طاق ہوتی ہے ، بیت اللہ کا طواف طاق ہوتاہے ۔ اور تم میں سے جب کوئی استنجا کرے تو طاق ڈھیلوں سے کرے ۔",
                "urduNarrator": "مجھ سے سلمہ بن شبیب نے بیان کیا، ہم سے حسن بن  اعین نے بیان کیا، ان سے معقل نے، جو کہ ہم سے ابن عبید اللہ الجزری نے بیان کیا، انہوں نے ابو الزبیر سے روایت کی،حضرت جابر رضی اللہ تعالیٰ عنہ سے روایت ہے انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ وَهُوَ ابْنُ عُبَيْدِ اللهِ الْجَزَرِيُّ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الِاسْتِجْمَارُ تَوٌّ، وَرَمْيُ الْجِمَارِ تَوٌّ، وَالسَّعْيُ بَيْنَ الصَّفَا وَالْمَرْوَةِ تَوٌّ، وَالطَّوَافُ تَوٌّ، وَإِذَا اسْتَجْمَرَ أَحَدُكُمْ، فَلْيَسْتَجْمِرْ بِتَوٍّ».",
                "headingArabic": "بَيَانِ أَنَّ حَصَى الْجِمَارِ سَبْعٌ ‏",
                "headingUrdu": "جمرہ کو کنکریاں مارنے کی تعداد ایک وقت میں سات ہے۔",
                "headingEnglish": "The number of pebbles for stoning the Jamrahs is seven at a time",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10708,
                "hadithNumber": "3144",
                "englishNarrator": "Abdullah رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) got his head shaved (after slaughtering the sacrificial animal on the 10th of Dhu'l-Hijja), and so did a group of Companions, while some of them got their hair clipped. Abdullah رضی اللہ تعالیٰ عنہ said: Allah's Messenger (may peace'be upon him) observed once or twice: May Allah have mercy upon those who get their heads shaved. And he also said: Upon those too who got their hair clipped.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے سر منڈایا اور آپ صلی اللہ علیہ وسلم کے صحابہ کی ایک جماعت نے سر منڈایا ، اور ان میں سے کچھ نے بال کٹوائے ۔ حضرت عبداللہ رضی اللہ تعالیٰ عنہ نے کہا : رسول اللہ صلی اللہ علیہ وسلم نےفرمایا : \"\" اللہ سر منڈانے والوں پر رحم فرمائے ۔ \"\" ایک یادو مرتبہ ( دعا کی ) پھر فرمایا : \"\" اور بال کٹوانے والوں پر بھی \"\" ( ان کے لئے صرف ایک بار دعا کی ۔ )",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ اور محمد بن رمح نے بیان کیا، کہا: ہم سے انہوں نے بیان کیالیث نے نافع سے حدیث بیان کی کہ حضرت عبداللہ رضی اللہ تعالیٰ عنہ ( بن مسعود ) نے کہا",
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَمُحَمَّدُ بْنُ رُمْحٍ، قَالَا: أَخْبَرَنَا اللَّيْثُ، ح وحَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا لَيْثٌ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللهِ، قَالَ: حَلَقَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَحَلَقَ طَائِفَةٌ مِنْ أَصْحَابِهِ، وَقَصَّرَ بَعْضُهُمْ، قَالَ عَبْدُ اللهِ: إِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «رَحِمَ اللهُ الْمُحَلِّقِينَ» مَرَّةً أَوْ مَرَّتَيْنِ، ثُمَّ قَالَ: «وَالْمُقَصِّرِينَ».",
                "headingArabic": "تَفْضِيلِ الْحَلْقِ عَلَى التَّقْصِيرِ وَجَوَازِ التَّقْصِيرِ ‏‏",
                "headingUrdu": "سر منڈوانا بال کاٹنے سے افضل ہے، البتہ بال کاٹنا جائز ہے",
                "headingEnglish": "Shaving the head is preferrable to cutting the hair, although cutting the hair is permissible",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10709,
                "hadithNumber": "3145",
                "englishNarrator": "Abdullah bin Umar (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as having observed: O Allah, have mercy upon those who get their heads shaved. They (the Companions) said: Messenger of Allah, (what about those) who have got their hair clipped? He said: O Allah, have mercy upon those who have got their heads shaved. They (again) said: Allah's Messenger, (what about those) who have got their hair clipped? Thereupon he said: (O Allah, have mercy upon those) who have got their hair clipped.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اے اللہ !سر منڈانے والوں پر رحم فرما ۔ \" لوگوں ( صحابہ رضوان اللہ عنھم اجمعین ) نے کہا : اور بال کٹوانے والوں پر اے اللہ کے رسول صلی اللہ علیہ وسلم !فرمایا : \" اے اللہ ! سر منڈانے والوں پر رحم فرما ۔ \" صحابہ رضوان اللہ عنھم اجمعین نے پھر عرض کی : اور بال کٹوانے والوں پر ، اے اللہ کے رسول صلی اللہ علیہ وسلم ! فرمایا : \" اور بال کٹوانے والوں پر ( بھی رحم فرما ۔ ) \"",
                "urduNarrator": "یحییٰ بن یحییٰ نے امام مالک ؒکے سامنے قراءت کی کہ نافع سے روایت ہے ، اور انھوں نے حضرت عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «اللهُمَّ ارْحَمِ الْمُحَلِّقِينَ» قَالُوا: وَالْمُقَصِّرِينَ؟ يَا رَسُولَ اللهِ، قَالَ: «اللهُمَّ ارْحَمِ الْمُحَلِّقِينَ» قَالُوا: وَالْمُقَصِّرِينَ؟ يَا رَسُولَ اللهِ، قَالَ: «وَالْمُقَصِّرِينَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10710,
                "hadithNumber": "3146",
                "englishNarrator": "Ibn 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: May Allah have mercy upon those who have got their heads shaved. They said: Messenger of Allah, (what about) those who got their hair clipped? He said: May Allah have mercy upon those who have got their heads shaved. They said: Messenger of Allah, (what about those who have got their hair clipped)? He said: May Allah have mercy upon those who got their hair shaved. They said: Messenger of Allah, (what about) those who got their hair clipped? He said: (O Allah, have mercy upon) those who got their hair clipped.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \"\" : \"\" اے اللہ !سر منڈانے والوں پر رحم فرما ۔ \"\" لوگوں ( صحابہ رضوان اللہ عنھم اجمعین ) نے کہا : اور بال کٹوانے والوں پر اے اللہ کے رسول صلی اللہ علیہ وسلم !فرمایا : \"\" اے اللہ ! سر منڈانے والوں پر رحم فرما ۔ \"\" صحابہ رضوان اللہ عنھم اجمعین نے پھر عرض کی : اور بال کٹوانے والوں پر ، اے اللہ کے رسول صلی اللہ علیہ وسلم ! فرمایا : \"\" اور بال کٹوانے والوں پربھی ۔ حدیث نمبر ۔ 3147 ۔ ہمیں عبدالوہاب نے حدیث سنائی ، ( کہا : ) ہمیں عبیداللہ نے اسی سند کے ساتھ یہی حدیث بیان کی اور انھوں نے ( اپنی ) حدیث میں کہا : جب چوتھی باری آئی تو آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" اور بال کٹوانے والوں پر بھی ۔ \"\"",
                "urduNarrator": "ہم سے ابواسحاق ابراہیم بن محمد بن سفیان نے مسلم بن الحجاج کی سند سے بیان کیا، انہوں نے کہا ہمیں عبداللہ بن نمیر نے حدیث بیان کی ، ( کہا : ) ہمیں عبیداللہ بن عمر نے نافع سے حدیث بیان کی ، انھوں نے ابن عمر رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "أَخْبَرَنَا أَبُو إِسْحَاقَ إِبْرَاهِيمُ بْنُ مُحَمَّدِ بْنِ سُفْيَانَ، عَنْ مُسْلِمِ بْنِ الْحَجَّاجِ قَالَ حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللهِ بْنُ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «رَحِمَ اللهُ الْمُحَلِّقِينَ» قَالُوا: وَالْمُقَصِّرِينَ؟ يَا رَسُولَ اللهِ، قَالَ: «رَحِمَ اللهُ الْمُحَلِّقِينَ» قَالُوا: وَالْمُقَصِّرِينَ؟ يَا رَسُولَ اللهِ، قَالَ: «رَحِمَ اللهُ الْمُحَلِّقِينَ» قَالُوا: وَالْمُقَصِّرِينَ؟ يَا رَسُولَ اللهِ، قَالَ: «وَالْمُقَصِّرِينَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10711,
                "hadithNumber": "3147",
                "englishNarrator": "Ubaidullah reported this hadith with the same chain of transmitters and (it is said) that it was on the fourth turn:",
                "hadithEnglish": "He (the Holy Prophet) said: (May Allah have mercy upon) those who got their hair clipped.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" اور بال کٹوانے والوں پر بھی ۔ \"",
                "urduNarrator": "ہم سے ابن المثنی نے بیان کیا، انہوں نے کہا ہمیں عبدالوہاب نے حدیث سنائی ، ( کہا : ) ہمیں عبیداللہ نے اسی سند کے ساتھ یہی حدیث بیان کی اور انھوں نے ( اپنی ) حدیث میں کہا : جب چوتھی باری آئی تو",
                "hadithArabic": "وحَدَّثَنَاه ابْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا عُبَيْدُ اللهِ، بِهَذَا الْإِسْنَادِ وَقَالَ فِي الْحَدِيثِ: فَلَمَّا كَانَتِ الرَّابِعَةُ، قَالَ: «وَالْمُقَصِّرِينَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10712,
                "hadithNumber": "3148",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as having said: O Allah, grant pardon to those who got their heads shaved They (Companions of the Holy Prophet) said: Messenger of Allah, (what about those) who get their hair cut? He said: O Allah, grant pardon to those who get their heads shaved. They said: Messenger of Allah, (what about those) who got their hair clipped? He said: O Allah, grant pardon to those who get their heads shaved. They said: Messenger of Allah, (what about those) who get their hair clipped? He said: O Allah, grant pardon to those who get their heads shaved. They said: (What about those) who get their hair clipped? He said: (O Allah, grant pardon to) those who get their hair clipped.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نےفرمایا : \" اے اللہ !سر منڈانےوالوں کوبخش دے ۔ \" صحابہ رضوان اللہ عنھم اجمعین نے عرض کی : اے اللہ کے رسول صلی اللہ علیہ وسلم ! اور بال کٹوانے والوں کو؟ رسول اللہ صلی اللہ علیہ وسلم نےفرمایا : \" اے اللہ !سر منڈانےوالوں کوبخش دے ۔ \" صحابہ رضوان اللہ عنھم اجمعین نے عرض کی : اے اللہ کے رسول صلی اللہ علیہ وسلم ! اور بال کٹوانے والوں کو؟ رسول اللہ صلی اللہ علیہ وسلم نےفرمایا : \" اے اللہ !سر منڈانےوالوں کوبخش دے ۔ \" صحابہ رضوان اللہ عنھم اجمعین نے عرض کی : اے اللہ کے رسول صلی اللہ علیہ وسلم ! اور بال کٹوانے والوں کو؟فرمایا : \" اور بال کٹوانے والوں کو بھی ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، زہیر بن حرب، ابن نمیر اور ابو کریب نے ابن فضیل کی سند سے بیان کیا، کہا: ہم سے بیان کیا۔ ہم سے محمد بن فضیل عمارہ نے بیان کیا, ابوزرعہ نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَابْنُ نُمَيْرٍ، وَأَبُو كُرَيْبٍ، جَمِيعًا عَنِ ابْنِ فُضَيْلٍ، قَالَ زُهَيْرٌ: حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، حَدَّثَنَا عُمَارَةُ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «اللهُمَّ اغْفِرْ لِلْمُحَلِّقِينَ»، قَالُوا: يَا رَسُولَ اللهِ، وَلِلْمُقَصِّرِينَ؟، قَالَ: «اللهُمَّ اغْفِرْ لِلْمُحَلِّقِينَ» قَالُوا: يَا رَسُولَ اللهِ، وَلِلْمُقَصِّرِينَ؟، قَالَ: «اللهُمَّ اغْفِرْ لِلْمُحَلِّقِينَ»، قَالُوا: يَا رَسُولَ اللهِ، وَلِلْمُقَصِّرِينَ؟ قَالَ: «وَلِلْمُقَصِّرِينَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10713,
                "hadithNumber": "3149",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this is narrated on the authority of Abu Huraira رضی اللہ تعالیٰ عنہ .",
                "hadithUrdu": "علاء نے اپنے والد ( عبدالرحمن بن یعقوب ) سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی ۔ ۔ ۔ آگے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے ابو زرعہ کی ( روایت کردہ ) حدیث کے ہم معنی ہے ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِي أُمَيَّةُ بْنُ بِسْطَامَ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا رَوْحٌ، عَنِ الْعَلَاءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَى حَدِيثِ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 10401,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=416",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=414",
                "label": "414",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=415",
                "label": "415",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=416",
                "label": "416",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=417",
                "label": "417",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=418",
                "label": "418",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=419",
                "label": "419",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=420",
                "label": "420",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=418",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=418",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=416",
        "to": 10425,
        "total": 40465
    }
}