{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 371,
        "data": [
            {
                "id": 9539,
                "hadithNumber": "1975",
                "englishNarrator": "Abu Burda bin Abu Musa al-Ash'ari رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "'Abdullah bin Umar رضی اللہ تعالیٰ عنہ said to me: Did you hear anything from your father narrating something from the messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) about the time on Friday? I said: Yes, I heard him say from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) (these words): It is between the time when the Imam sits down and the end of the prayer.",
                "hadithUrdu": "مجھ سے حضرت عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ نے کہا : کیا تم نے اپنے والد کو جمعے کی گھڑی کے بارے میں رسول اللہ صلی اللہ علیہ وسلم سے حدیث بیان کرتے ہو ئے سنا ہے ؟کہ کہا : میں نے کہا : جی ہاں میں نے انھیں یہ کہتے سنا ہے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا آپ فر ما رہے تھے : \" یہ امام کے بیٹھنے سے لے کر نماز مکمل ہو نے تک ہے ۔",
                "urduNarrator": "مجھ سے ابو الطاہر اور علی بن خشرم نے بیان کیا، انہوں نے کہا: ہم سے ابن وہب نے مخرمہ بن بکیر سے بیان کیا، ہم سے ہارون بن سعید العیلی نے اور ہم سے احمد بن عیسٰی نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، ہم سے مخرمہ نے بیان کیا۔ ، اپنے والد کے اختیار پر، کے اختیار پر, ابو بردہ بن ابی مو سیٰ اشعری رضی اللہ تعالیٰ عنہ سے روا یت ہے کہا",
                "hadithArabic": "و حَدَّثَنِي أَبُو الطَّاهِرِ وَعَلِيُّ بْنُ خَشْرَمٍ قَالَا أَخْبَرَنَا ابْنُ وَهْبٍ عَنْ مَخْرَمَةَ بْنِ بُكَيْرٍ ح و حَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ وَأَحْمَدُ بْنُ عِيسَى قَالَا حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنَا مَخْرَمَةُ عَنْ أَبِيهِ عَنْ أَبِي بُرْدَةَ بْنِ أَبِي مُوسَى الْأَشْعَرِيِّ قَالَ قَالَ لِي عَبْدُ اللَّهِ بْنُ عُمَرَ أَسَمِعْتَ أَبَاكَ يُحَدِّثُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي شَأْنِ سَاعَةِ الْجُمُعَةِ قَالَ قُلْتُ نَعَمْ سَمِعْتُهُ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ هِيَ مَا بَيْنَ أَنْ يَجْلِسَ الْإِمَامُ إِلَى أَنْ تُقْضَى الصَّلَاةُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9540,
                "hadithNumber": "1976",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The best day on which the sun has risen is Friday; on it Adam was created, on it he was made to enter Paradise, on it he was expelled from it.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" بہترین دن جس پر سورج طلوع ہو تا ہے جمعے کا دن ہے اسی دن آدم ؑپیدا کیے گئے اور اسی دن جنت میں داخل کیے گئے اور اسی دن اس سے نکا لے گئے ۔",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، کہا کہ مجھ سے یونس نے بیان کیا, ابن شہاب نے کہا : مجھے عبد الرحمٰن اعرج نے خبر دی انھوں نے حضرت ابو ہریرہ  رضی اللہ تعالیٰ عنہ کو کہتے سنا کہ",
                "hadithArabic": "و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي عَبْدُ الرَّحْمَنِ الْأَعْرَجُ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرُ يَوْمٍ طَلَعَتْ عَلَيْهِ الشَّمْسُ يَوْمُ الْجُمُعَةِ فِيهِ خُلِقَ آدَمُ وَفِيهِ أُدْخِلَ الْجَنَّةَ وَفِيهِ أُخْرِجَ مِنْهَا.",
                "headingArabic": "فَضْلِ يَوْمِ الْجُمُعَةِ",
                "headingUrdu": "جمعہ کی فضیلت",
                "headingEnglish": "The virtue of Friday",
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9541,
                "hadithNumber": "1977",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The best day on which the sun has risen is Friday; on it Adam was created. on it he was made to enter Paradise, on it he was expelled from it. And the last hour will take place on no day other than Friday.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فر ما یا : بہترین دن جس میں سورج نکلتا ہے جمعے کا ہے اسی دن آدم ؑکو پیدا کیا گیا تھا اور اسی دن انھیں جنت میں داخل کیا گیا اور اسی میں انھیں اس سے نکا لا گیا ( خلا فت ارضی سونپی گئی ) اور قیامت بھی جمعے کے دن ہی بر پاہو گی ۔ \" صالح مومنوں کے لیے یہ انعام عظیم حا صل کرنے کا دن ہو گا ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ہم سے المغیرہ یعنی الحزمی نے بیان کیا، ان کی سند سے ابو زناد نے اعرج سے اور انھوں نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے رو یت کی کہ",
                "hadithArabic": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا الْمُغِيرَةُ يَعْنِي الْحِزَامِيَّ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ خَيْرُ يَوْمٍ طَلَعَتْ عَلَيْهِ الشَّمْسُ يَوْمُ الْجُمُعَةِ فِيهِ خُلِقَ آدَمُ وَفِيهِ أُدْخِلَ الْجَنَّةَ وَفِيهِ أُخْرِجَ مِنْهَا وَلَا تَقُومُ السَّاعَةُ إِلَّا فِي يَوْمِ الْجُمُعَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9542,
                "hadithNumber": "1978",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: We who are the last shall be the first on the Day of Resurrection, except that every Ummah was given the Book before us and we were given it after them. It was this day which Allah prescribed for us and guided us to it and the people came after us with regard to it, the Jews observing the next day and the Christians the day following that.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" ہم سب سے آخری ہیں اور قیامت کے دن سب سے پہلے ہو ں گے یہ اس کے باوجود ہے کہ ہر امت کو کتاب ہم سے پہلے دی گئی اور ہمیں ( ہماری کتاب ) ان کے بعد دی گئی پھر یہ دن جسے اللہ تعالیٰ نے ہمارے لئے لکھ دیا تھا اللہ تعا لیٰ نے اس کے لیے ہماری رہنما ئی فر ما ئی لو گ اس معاملے میں ہمارے بعد ہیں یہود کل ( جمعے سے اگلا دن یعنی ہفتہ منا ئیں گے ) اور نصاریٰ پرسوں ( ہفتےسے اگلا دن اتوار کا منا ئیں گے ۔ )",
                "urduNarrator": "عمر و ناقد نے کہا : ہمیں سفیان بن عیینہ نے ابو زناد سے حدیث سنا ئی انھوں نے اعرج سے اور انھوں نے حجرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا عَمْرٌو النَّاقِدُ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْنُ الْآخِرُونَ وَنَحْنُ السَّابِقُونَ يَوْمَ الْقِيَامَةِ بَيْدَ أَنَّ كُلَّ أُمَّةٍ أُوتِيَتْ الْكِتَابَ مِنْ قَبْلِنَا وَأُوتِينَاهُ مِنْ بَعْدِهِمْ ثُمَّ هَذَا الْيَوْمُ الَّذِي كَتَبَهُ اللَّهُ عَلَيْنَا هَدَانَا اللَّهُ لَهُ فَالنَّاسُ لَنَا فِيهِ تَبَعٌ الْيَهُودُ غَدًا وَالنَّصَارَى بَعْدَ غَدٍ.",
                "headingArabic": "هِدَايَةِ هَذِهِ الأُمَّةِ لِيَوْمِ الْجُمُعَةِ ‏",
                "headingUrdu": "اس امت کو جمعہ کی ہدایت کی گئی ہے۔",
                "headingEnglish": "This Ummah has been guided to Friday",
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9543,
                "hadithNumber": "1979",
                "englishNarrator": "It was narrated that Abu Huraira رضی اللہ تعالیٰ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: We are the last and would be the first on the Day of Resurrection.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" ہم سب کے بعد آنے والے ہیں اور قیامت کے دن ہم سب سے پہلے ہو ں گے ۔ ۔ ۔ \" اسی ( مذکورہ با لا حدیث ) کے مانند ہے",
                "urduNarrator": "ابن ابی عمر نے کہا : ہمیں سفیان نے ابو زناد سے حدیث سنا ئی انھوں نے اعرج سے اور انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روا یت کی نیز ( سفیان نے عبد اللہ ) بن طاوس سے انھوں نے اپنے والد ( طاوس بن کیسان ) سے انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ وَابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْنُ الْآخِرُونَ وَنَحْنُ السَّابِقُونَ يَوْمَ الْقِيَامَةِ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9544,
                "hadithNumber": "1980",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: We are the last (but) we would be the first on the Day of Resurrection, and we would be the first to enter Paradise, but that they were given the Book before us and we were given after them. They disagreed and Allah guided us aright on whatever they disagreed regarding the truth. And it was this day of theirs about which they disagreed, but Allah guided us to it, and that is Friday for us; the next day is for the Jews and the day following for the Christians.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" ہم آخری ہیں ( پھر بھی ) قیامت کے دن پہلے ہو ں گے اور ہم ہی پہلے جنت میں داخل ہوں گے البتہ انھیں ( انکی ) کتاب ہم سب سے پہلے دی گئی اور ہمیں ( ہماری کتاب ) ان کے بعد دی گئی انھوں نے ( آپس میں ) اختلا ف کیا اور اللہ تعا لیٰ نے ہماری اس حق کی طرف رہنما ئی فر ما ئی جس میں انھوں نے اختلا ف کیا تھا یہ ( جمعہ ) ان کا وہی دن تھا جس کے بارے میں انھوں نے اختلا ف کیا اللہ تعا لیٰ نے ہمیں اس کی طرف رہنما ئی کردی ۔ ۔ ۔ راوی نے کہا : جمعے کا دن مرادہے ۔ ۔ آج کا دن ہمارا ہے اور کل کا دن یہودیوں کا ہے اس سے اگلا دن عیسائیوں کا ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید اور زہیر بن حرب نے بیان کیا، کہا کہ ہم سے جریر نے اعمش کی سند سے بیان کیا, ابو صالح نے حضرت ابو ہریرہ  رضی اللہ تعالیٰ عنہ سے روا یت کی انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَزُهَيْرُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْنُ الْآخِرُونَ الْأَوَّلُونَ يَوْمَ الْقِيَامَةِ وَنَحْنُ أَوَّلُ مَنْ يَدْخُلُ الْجَنَّةَ بَيْدَ أَنَّهُمْ أُوتُوا الْكِتَابَ مِنْ قَبْلِنَا وَأُوتِينَاهُ مِنْ بَعْدِهِمْ فَاخْتَلَفُوا فَهَدَانَا اللَّهُ لِمَا اخْتَلَفُوا فِيهِ مِنْ الْحَقِّ فَهَذَا يَوْمُهُمْ الَّذِي اخْتَلَفُوا فِيهِ هَدَانَا اللَّهُ لَهُ قَالَ يَوْمُ الْجُمُعَةِ فَالْيَوْمَ لَنَا وَغَدًا لِلْيَهُودِ وَبَعْدَ غَدٍ لِلنَّصَارَى.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9545,
                "hadithNumber": "1981",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Muhammad, the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), as saying: We who are the last would be the first on the Day of Resurrection but they (other Ummahs) were given the Book before us and we were given after them, and this was the day that was prescribed for them but they disagreed on it. And Allah guided us to it. and they came after us with regard to it, the Jews observing the next day and the Christians the day following that.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : ہم آخری ہیں ( مگر ) قیامت کے دن سبقت لے جا نے والے ہو ں گے اس کے باوجود کہ ان کے بعد دی گئی اور یہ ( جمعہ ) ان کا وہی دن ہے جو ان پر فرض کیا گیا تھا اور وہ اس کے بارے میں اختلاف میں پڑگئے پھر اللہ تعا لیٰ نے اس کے بارے میں ہماری رہنمائی فر ما ئی اس لیے وہ لو گ اس ( عبادت کے دن کے ) معاملے میں ہم سے پیچھے ہیں یہود ( اپنا دن ) کل منا ئیں گے اور عیسا ئی پر سوں ۔",
                "urduNarrator": "اور ہم سے محمد بن رافع نے بیان کیا، کہا ہم سے عبد الرزاق نے بیان کیا، کہا کہ ہم سے معمر نے میرے بھائی ہمام بن منبیح سے بیان کیا, وہب بن منبہ کے بھا ئی ہمام بن منبہ نے کہا : یہ حدیث ہے حضرت ابو ہریر ہ رضی اللہ تعالیٰ عنہ نے ہمیں محمد رسول اللہ صلی اللہ علیہ وسلم سے بیان کی انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ أَخِي وَهْبِ بْنِ مُنَبِّهٍ قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ عَنْ مُحَمَّدٍ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْنُ الْآخِرُونَ السَّابِقُونَ يَوْمَ الْقِيَامَةِ بَيْدَ أَنَّهُمْ أُوتُوا الْكِتَابَ مِنْ قَبْلِنَا وَأُوتِينَاهُ مِنْ بَعْدِهِمْ وَهَذَا يَوْمُهُمْ الَّذِي فُرِضَ عَلَيْهِمْ فَاخْتَلَفُوا فِيهِ فَهَدَانَا اللَّهُ لَهُ فَهُمْ لَنَا فِيهِ تَبَعٌ فَالْيَهُودُ غَدًا وَالنَّصَارَى بَعْدَ غَدٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9546,
                "hadithNumber": "1982",
                "englishNarrator": "It is narrated by Abu Huraira رضی اللہ تعالیٰ عنہ and Hudhaifah رضی اللہ تعالیٰ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: It was Friday from which Allah diverted those who were before us. For the Jews (the day set aside for prayer) was Sabt (Saturday), and for the Christians it was Sunday. And Allah turned towards us and guided us to Friday (as the day of prayer) for us. In fact, He (Allah) made Friday, Saturday and Sunday (as days of prayer). In this order would they (Jews and Christians) come after us on the Day of Resurrection. We are the last of (the Ummahs) among the people in this world and the first among the created to be judged on the Day of Resurrection. In one narration it is: to be judged among them .",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" جو لوگ ہم سے پہلے تھے اللہ تعالیٰ نے انھیں جمعہ کی راہ سے ہٹادیا ، اس لئے یہود کے لئے ہفتے کا دن ہوگیا اور نصاریٰ کے لئے اتوار کا دن ۔ پھراللہ تعالیٰ نے ہمیں ( اس دنیا میں لایا ) اور جمعے کے دن کی طرف ہماری راہنمائی فرمادی ۔ اس نے جمعہ پھر ہفتہ پھر اتوار رکھا ( جس طرح وہ عبادت کے دنوں میں ہم سے پیچھے ہیں ) اسی طرح قیامت کے دن بھی ہم سے پیچھے ہوں گے ۔ اہل دنیا میں سے ہم سب کے بعد ہیں اور قیامت کےدن سب سے پہلے ہوں گے ۔ جن کا فیصلہ ( باقی ) مخلوقات سے پہلے کردیا جائے گا ۔ \"\" واصل کی روایت میں ( المقضي لهم کی جگہ ) المقضي بينهم ( جن کے درمیان فیصلہ ) ہے ۔",
                "urduNarrator": "ابو کریب اور واصل بن عبدالاعلیٰ نے کہا : ہم سے ابن فضیل نے ابومالک اشجعی ( سعد بن طارق ) سے حدیث بیان کی ، انھوں نے ابو حازم سے اورانھوں نے ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، نیز انھوں ( ابو مالک ) نے ربعی بن حراش سے اور انھوں نے حضرت حذیفہ رضی اللہ تعالیٰ عنہ سے روایت کی ، ان دونوں ( صحابیوں ) نے کہا",
                "hadithArabic": "و حَدَّثَنَا أَبُو كُرَيْبٍ وَوَاصِلُ بْنُ عَبْدِ الْأَعْلَى قَالَا حَدَّثَنَا ابْنُ فُضَيْلٍ عَنْ أَبِي مَالِكٍ الْأَشْجَعِيِّ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ وَعَنْ رِبْعِيِّ بْنِ حِرَاشٍ عَنْ حُذَيْفَةَ قَالَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَضَلَّ اللَّهُ عَنْ الْجُمُعَةِ مَنْ كَانَ قَبْلَنَا فَكَانَ لِلْيَهُودِ يَوْمُ السَّبْتِ وَكَانَ لِلنَّصَارَى يَوْمُ الْأَحَدِ فَجَاءَ اللَّهُ بِنَا فَهَدَانَا اللَّهُ لِيَوْمِ الْجُمُعَةِ فَجَعَلَ الْجُمُعَةَ وَالسَّبْتَ وَالْأَحَدَ وَكَذَلِكَ هُمْ تَبَعٌ لَنَا يَوْمَ الْقِيَامَةِ نَحْنُ الْآخِرُونَ مِنْ أَهْلِ الدُّنْيَا وَالْأَوَّلُونَ يَوْمَ الْقِيَامَةِ الْمَقْضِيُّ لَهُمْ قَبْلَ الْخَلَائِقِ وَفِي رِوَايَةِ وَاصِلٍ الْمَقْضِيُّ بَيْنَهُمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9547,
                "hadithNumber": "1983",
                "englishNarrator": "Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: We were guided aright to Friday (as a day of prayer and meditation), but Allah diverted those who were before us from it. The rest of the hadith is the same.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ہماری راہنمائی جمعے کی طرف کی گئی اور جو لوگ ہم سے پہلے تھے ان کو اللہ تعالیٰ نے ا س سےدوسری راہ پر لگادیا ۔ ۔ ۔ \" آگے ابن فضیل کے ہم معنی حدیث بیان کی ۔",
                "urduNarrator": "ہم سے ابو کریب نے بیان کیا, ابن ابی زائدہ نے ( ابومالک ) سعد بن طارق سے خبر دی ، انھوں نے کہا : ربعی بن حراش نے مجھے حضرت حذیفہ رضی اللہ تعالیٰ عنہ سے حدیث بیان کی ، انھوں نےکہا",
                "hadithArabic": "حَدَّثَنَا أَبُو كُرَيْبٍ أَخْبَرَنَا ابْنُ أَبِي زَائِدَةَ عَنْ سَعْدِ بْنِ طَارِقٍ حَدَّثَنِي رِبْعِيُّ بْنُ حِرَاشٍ عَنْ حُذَيْفَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هُدِينَا إِلَى الْجُمُعَةِ وَأَضَلَّ اللَّهُ عَنْهَا مَنْ كَانَ قَبْلَنَا فَذَكَرَ بِمَعْنَى حَدِيثِ ابْنِ فُضَيْلٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9548,
                "hadithNumber": "1984",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When it is Friday, the angels stand at every door of the mosque and record the people in the order of their arrival, and when the Imam sits (on the pulpit for delivering the sermon) they fold up their sheets (manuscripts of the Qur'an) and listen to the mention (of Allah). And he who comes early is like one who offers a she-camel as a sacrifice, the next like one who offers a cow, the next a ram, the next a hen, the next an egg.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایاجب جمعے کا دن ہوتا ہے تو مسجد کے دروازوں میں سے ہر دروازے پر فرشتے ہوتے ہیں جو ( آنے والوں کی ترتیب کے مطابق ( پہلے پھر پہلے کا نام لکھتے ہیں ، اور جب امام ( منبر پر ) بیٹھ جاتا ہے تو وہ ( ناموں والے ) صحیفے لپیٹ دیتے ہیں اورآکرذکر ( خطبہ ) سنتے ہیں ۔ اور گرمی میں ( پہلے ) آنے والے کی مثال اس انسان جیسی ہے جو اونٹ قربان کرتا ہےپھر ( جو آیا ) گویا وہ گائے قربان کردیتا ہے ۔ پھر ( جو آیا ) گویا وہ مینڈھا قربان کردیتاہے ، پھر ( جو آیا ) گویا وہ تقرب کے لئے مرغی پیش کرتاہے پھر ( جو آیا ) گویا وہ تقریب کے لئے انڈا پیش کرتا ہے ۔ \"",
                "urduNarrator": "ہم سے ابو الطاہر، حرملہ اور عمرو بن سواد الامیری نے بیان کیا، اور ہم سے ابو الطاہر نے بیان کیا، اور کہا کہ ہم سے ابن وہب نے بیان کیا، مجھ سے یونس نے ابن شہاب نے بیان کیا, ابوعبداللہ اغر نے خبر دی کہ انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے سنا ، وہ کہہ رہے تھے",
                "hadithArabic": "و حَدَّثَنِي أَبُو الطَّاهِرِ وَحَرْمَلَةُ وَعَمْرُو بْنُ سَوَّادٍ الْعَامِرِيُّ قَالَ أَبُو الطَّاهِرِ حَدَّثَنَا و قَالَ الْآخَرَانِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي أَبُو عَبْدِ اللَّهِ الْأَغَرُّ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كَانَ يَوْمُ الْجُمُعَةِ كَانَ عَلَى كُلِّ بَابٍ مِنْ أَبْوَابِ الْمَسْجِدِ مَلَائِكَةٌ يَكْتُبُونَ الْأَوَّلَ فَالْأَوَّلَ فَإِذَا جَلَسَ الْإِمَامُ طَوَوْا الصُّحُفَ وَجَاءُوا يَسْتَمِعُونَ الذِّكْرَ وَمَثَلُ الْمُهَجِّرِ كَمَثَلِ الَّذِي يُهْدِي الْبَدَنَةَ ثُمَّ كَالَّذِي يُهْدِي بَقَرَةً ثُمَّ كَالَّذِي يُهْدِي الْكَبْشَ ثُمَّ كَالَّذِي يُهْدِي الدَّجَاجَةَ ثُمَّ كَالَّذِي يُهْدِي الْبَيْضَةَ.",
                "headingArabic": "فَضْلِ التَّهْجِيرِ يَوْمَ الْجُمُعَةِ ‏",
                "headingUrdu": "جمعہ کے دن جلدی نکلنے کی فضیلت",
                "headingEnglish": "The virtue of going out early on Friday",
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9549,
                "hadithNumber": "1985",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated by Abu Huraira رضی اللہ عنہ through another chain of transmitters.",
                "hadithUrdu": "ہم سے یحییٰ بن یحییٰ اور عمرو ناقد نے بیان کیا، انہوں نے سفیان کی سند سے، وہ زہری کی سند سے، وہ سعید کی سند سے،سعید ( بن مسیب ) نے حضرت ابو ہریر ہ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے اسی ( سابقہ حدیث ) کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَعَمْرٌو النَّاقِدُ عَنْ سُفْيَانَ عَنْ الزُّهْرِيِّ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9550,
                "hadithNumber": "1986",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: There is an angel on every door of the mosque recording him first who (comes) first (to the mosque for Friday prayer). And he [the Prophet] likened him to one who offers a camel as a sacrifice and then he went on in the descending order till he reached the point at which the minimum (sacrifice) is that of an egg. And when the Imam sits (on the pulpit) the sheets are folded and they (the angels) attend to the mention of Allah.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" مسجد کے دروازوں میں سے ہر ایک دروازے پر ایک فرشتہ ہوتاہے جو پہلے پھر پہلے آنے والے کا نام لکھتا ہے ۔ آپ نے اونٹ کی قربانی کی مثال دی ، پھر بتدریج کم کرتے گئے یہاں تک کہ ( آخر میں ) انڈے جیسے چھوٹے ( صدقے ) کی مثال دی ۔ پھر جب امام منبر پر بیٹھ جاتا ہے تو ( اندراج کے ) صحیفے لپیٹ دیئے جاتے ہیں اور ( فرشتے ) ذکر ونصیحت ( سننے ) کے لئے حاضر ہوجاتے ہیں ۔ \"",
                "urduNarrator": "اور ہم سے قتیبہ بن سعید نے بیان کیا، ان سے یعقوب نے، یعنی ہم سے ابن عبدالرحمٰن نے بیان کیا, سہیل کے والد ابو صالح سمان نے حضرت ابو ہریر ہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا يَعْقُوبُ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ عَلَى كُلِّ بَابٍ مِنْ أَبْوَابِ الْمَسْجِدِ مَلَكٌ يَكْتُبُ الْأَوَّلَ فَالْأَوَّلَ مَثَّلَ الْجَزُورَ ثُمَّ نَزَّلَهُمْ حَتَّى صَغَّرَ إِلَى مَثَلِ الْبَيْضَةِ فَإِذَا جَلَسَ الْإِمَامُ طُوِيَتْ الصُّحُفُ وَحَضَرُوا الذِّكْرَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9551,
                "hadithNumber": "1987",
                "englishNarrator": "Abu-Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who took a bath and then came for Jumu'a prayer and then prayed what was fixed for him, then kept silence till the Imam finished the sermon, and then prayed along with him, his sins between that time and the next Friday would be forgiven, and even of three days more.",
                "hadithUrdu": "آپ نے فرمایا : \" جس نے غسل کیا ، پھر جمعے کے لئے حاضر ہوا ، پھر اس کے مقدر میں جتنی ( نفل ) نماز تھی پڑھی ، پھر خاموشی سے ( خطبہ ) سنتا رہا حتیٰ کہ خطیب اپنے خطبے سے فارغ ہوگیا ، پھر اس کے ساتھ نماز پڑھی ، اس کے اس جمعے سے لے کر ایک اور ( پچھلے یا اگلے ) جمعے تک کے گناہ بخش دیے جاتے ہیں اور مزید تین دنوں کے بھی ۔ \"",
                "urduNarrator": "ہم سے امیہ بن بسطام نے بیان کیا، ان سے یزید نے، یعنی ہم سے ابن زرعی نے بیان کیا، ہم سے ایک روح نے بیان کیا, سہیل نے اپنے والد ( ابو صالح ) سے ، انھوں نے حضرت ابو ہریرہ  رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کہ",
                "hadithArabic": "حَدَّثَنَا أُمَيَّةُ بْنُ بِسْطَامٍ حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ حَدَّثَنَا رَوْحٌ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ اغْتَسَلَ ثُمَّ أَتَى الْجُمُعَةَ فَصَلَّى مَا قُدِّرَ لَهُ ثُمَّ أَنْصَتَ حَتَّى يَفْرُغَ مِنْ خُطْبَتِهِ ثُمَّ يُصَلِّي مَعَهُ غُفِرَ لَهُ مَا بَيْنَهُ وَبَيْنَ الْجُمُعَةِ الْأُخْرَى وَفَضْلُ ثَلَاثَةِ أَيَّامٍ.",
                "headingArabic": "فَضْلِ مَنِ اسْتَمَعَ وَأَنْصَتَ فِي الْخُطْبَةِ ‏",
                "headingUrdu": "خطبہ کے دوران خاموش رہنے اور توجہ سے سننے والے کی فضیلت",
                "headingEnglish": "The virtue of one who remains silent and listens attentively during the khutbah",
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9552,
                "hadithNumber": "1988",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who performed ablution well, then came to Friday prayer, listened (to the sermon), kept silence all (his sins) between that time and the next Friday would be forgiven with three days extra, and he who touched pebbles caused an interruption.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جس شخص نے وضو کیا اوراچھی طرح وضو کیا ، پھر جمعے کے لئے آیا ، غور کے ساتھ خاموشی سے خطبہ سنا ، اس کے جمعے سے لے کر جمعے تک گناہ معاف کردئیے جاتے ہیں ۔ اورتین دن زائد کے بھی ۔ اور جو ( بلاوجہ ) کنکریوں کو ہاتھ لگاتا رہا ( ان سے کھیلتا رہا ) ، اس نے لغو اورفضول کام کیا ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ، ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، کہا کہ ہم سے ابو معاویہ نے بیان کیا اور باقی دو نے کہا کہ ہم سے ابو معاویہ نے بیان کیا, اعمش نے ابو صالح سے اور انھوں نے حضرت ابو ہریرہ  رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الْآخَرَانِ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ ثُمَّ أَتَى الْجُمُعَةَ فَاسْتَمَعَ وَأَنْصَتَ غُفِرَ لَهُ مَا بَيْنَهُ وَبَيْنَ الْجُمُعَةِ وَزِيَادَةُ ثَلَاثَةِ أَيَّامٍ وَمَنْ مَسَّ الْحَصَى فَقَدْ لَغَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9553,
                "hadithNumber": "1989",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "We used to observe (Jumu'a) prayer with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and then we returned and gave rest to our camels used for carrying water. Hassan[ (one of the narrators) said: I asked Ja'far what time that was. He said.. It is the time when the sun passes the meridian.",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نماز پڑھتے تھے ، پھر واپس آتے ، پھر اپنے پانی لانے والے اونٹوں کو آرام کا وقت دیتے ، حسن نےکہا : میں نے جعفر سے کہا : یہ ( نماز ) کس وقت ہوتی؟انھوں نے کہا : سورج کے ڈھلنے کے وقت ۔",
                "urduNarrator": "اور ہم سے ابوبکر بن ابی شیبہ اور اسحاق بن ابراہیم نے بیان کیا، کہا کہ ہم سے یحییٰ بن آدم نے بیان کیا، انہوں نے بیان کیاحسن بن عیاش نے جعفر بن محمد سے ، انھوں نے اپنے والد ( محمد ) سے اور انھوں نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَبُو بَكْرٍ حَدَّثَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا حَسَنُ بْنُ عَيَّاشٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ كُنَّا نُصَلِّي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ نَرْجِعُ فَنُرِيحُ نَوَاضِحَنَا قَالَ حَسَنٌ فَقُلْتُ لِجَعْفَرٍ فِي أَيِّ سَاعَةٍ تِلْكَ قَالَ زَوَالَ الشَّمْسِ.",
                "headingArabic": "صَلاَةِ الْجُمُعَةِ حِينَ تَزُولُ الشَّمْسُ ‏",
                "headingUrdu": "جمعہ کی نماز اس وقت ہوتی ہے جب سورج غروب ہو جائے۔",
                "headingEnglish": "Jumu`ah prayer is when the sun has passed its zenith",
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9554,
                "hadithNumber": "1990",
                "englishNarrator": "Ja'far reported on the authority of his father: that he asked Jabir bin 'Abdullah رضی اللہ تعالیٰ عنہ :",
                "hadithEnglish": "When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) observed Jumu'a prayer. He said: He used to observe prayer, and we then went (back) to our camels and gave them rest. 'Abdullah made this addition in his narration: Till the sun passed the meridian. and the camels used for carrying water (took rest).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کس وقت جمعہ پڑھتے تھے؟انھوں نے کہا : آپ جمعہ پڑھاتے ، پھر ہم اونٹوں کے پاس جاتے ، پھر انہیں آرام کا وقت دیتے ۔ عبداللہ نے اپنی روایت میں یہ اضافہ کیا : جس وقت سورج ڈھل جاتا ۔ ( جمال سے مراد ) تواضح ، یعنی پانی لانے والے اونٹ ہیں ۔",
                "urduNarrator": "قاسم بن زکریا نے کہا : ہمیں خالد بن مخلد نے حدیث بیان کی ، نیز عبداللہ بن عبدالرحمان دارمی نے کہا : ہمیں یحییٰ بن حسان نے حدیث بیان کی ، ان دونوں ( خالد اوریحییٰ ) نے کہا : ہمیں سلیمان بن بلال نے جعفر سےحدیث بیا ن کی ، انھوں نےاپنے والد ( محمد ) سے روایت کی کہ انھوں نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے پوچھا",
                "hadithArabic": "و حَدَّثَنِي الْقَاسِمُ بْنُ زَكَرِيَّاءَ حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ ح و حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ قَالَا جَمِيعًا حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ عَنْ جَعْفَرٍ عَنْ أَبِيهِ أَنَّهُ سَأَلَ جَابِرَ بْنَ عَبْدِ اللَّهِ مَتَى كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي الْجُمُعَةَ قَالَ كَانَ يُصَلِّي ثُمَّ نَذْهَبُ إِلَى جِمَالِنَا فَنُرِيحُهَا زَادَ عَبْدُ اللَّهِ فِي حَدِيثِهِ حِينَ تَزُولُ الشَّمْسُ يَعْنِي النَّوَاضِحَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9555,
                "hadithNumber": "1991",
                "englishNarrator": "Sahl bin Said رضی اللہ تعالیٰ عنہ said:",
                "hadithEnglish": "We did not have a siesta or lunch till after the Friday prayer. (Ibn Hajr added: ) During the lifetime of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ).",
                "hadithUrdu": "ہم جمعہ کے بعد ہی قیلولہ کرتے اور کھانا کھاتے تھے ۔ ( علی ) ابن حجر نے اضافہ کیا : رسول اللہ صلی اللہ علیہ وسلم کے عہد مبارک میں ۔",
                "urduNarrator": "عبداللہ بن مسلمہ بن قعنب ، یحییٰ بن یحییٰ اور علی بن حجر میں سے یحییٰ نے کہا : ہمیں خبر دی اور دوسرے دونوں نے کہا : ہم سے حدیث بیا ن کی عبدالعزیز بن ابی حازم نے اپنے والد ابوحازم سے ، انھوں نے حضرت سہیل رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ وَيَحْيَى بْنُ يَحْيَى وَعَلِيُّ بْنُ حُجْرٍ قَالَ يَحْيَى أَخْبَرَنَا و قَالَ الْآخَرَانِ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ عَنْ أَبِيهِ عَنْ سَهْلٍ قَالَ مَا كُنَّا نَقِيلُ وَلَا نَتَغَدَّى إِلَّا بَعْدَ الْجُمُعَةِ زَادَ ابْنُ حُجْرٍ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9556,
                "hadithNumber": "1992",
                "englishNarrator": "Iyas bin Salama bin al-Akwa' reported on the authority of his father:",
                "hadithEnglish": "We used to observe the Friday prayer with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) when the sun passed the meridian. and we then returned and tried to find out afternoon shadow (of the walls for protecting themselves from the heat of the sun).",
                "hadithUrdu": "جب سورج ڈھلتا ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ جمعہ پڑھتے ، پھر ہم سایہ تلاش کرتے ہوئے لوٹتے ۔",
                "urduNarrator": "اور ہم سے یحییٰ بن یحییٰ اور اسحاق بن ابراہیم نے بیان کیا کہ ہمیں خبر دو, وکیع نے یعلیٰ بن حارث محاربی سے روایت کی ، انھوں نے ایاس بن سلمہ بن اکوع سے اور انھوں نے اپنے والد ( حضرت سلمہ بن اکوع رضی اللہ تعالیٰ عنہ ) سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَإِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَا أَخْبَرَنَا وَكِيعٌ عَنْ يَعْلَى بْنِ الْحَارِثِ الْمُحَارِبِيِّ عَنْ إِيَاسِ بْنِ سَلَمَةَ بْنِ الْأَكْوَعِ عَنْ أَبِيهِ قَالَ كُنَّا نُجَمِّعُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا زَالَتْ الشَّمْسُ ثُمَّ نَرْجِعُ نَتَتَبَّعُ الْفَيْءَ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9557,
                "hadithNumber": "1993",
                "englishNarrator": "Iyas bin Salama bin Akwa' reported on the authority of his father, saying:",
                "hadithEnglish": "We used to observe the Friday prayer with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), and when we returned we did not find the shadow of the walls in which we could take protection (from the heat of the sun).",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ جمعہ پڑھتے پھر لوٹتے تو ہمیں دیواروں کا اتنا بھی سایہ نہ ملتا کہ ہم ( سورج سے ) اس کی اوٹ لے سکیں ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے ہشام بن عبدالملک نے بیان کیا، کہا ہم سے علی بن حارث نے بیان کیا، وہ ایاس بن سلمہ بن اکوع کے والد سے، انہوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا هِشَامُ بْنُ عَبْدِ الْمَلِكِ حَدَّثَنَا يَعْلَى بْنُ الْحَارِثِ عَنْ إِيَاسِ بْنِ سَلَمَةَ بْنِ الْأَكْوَعِ عَنْ أَبِيهِ قَالَ كُنَّا نُصَلِّي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْجُمُعَةَ فَنَرْجِعُ وَمَا نَجِدُ لِلْحِيطَانِ فَيْئًا نَسْتَظِلُّ بِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9558,
                "hadithNumber": "1994",
                "englishNarrator": "Ibn 'Umar رضی اللہ تعالیٰ عنہ said:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) used to deliver the sermon on Friday while standing. He would then sit and then stand (for the second sermon) as they (the Muslims) do nowadays.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم جمعے کے دن کھڑے ہوکر خطبہ ارشاد فرماتے ، پھر ( تھوڑی دیر ) بیٹھ جاتے ، پھر کھڑے ہوجاتے ۔ کہا : جس طرح آجکل ( خطبہ دینے والے ) کرتے ہیں ۔",
                "urduNarrator": "ہم سے عبید اللہ بن عمر القواریری اور ابو کامل الجہدری نے خالد کی سند سے بیان کیا، کہا کہ ہم سے خالد بن حارث نے بیان کیا، ہم سے عبید اللہ نے نافع کی سند سے بیان کیا, حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ وَأَبُو كَامِلٍ الْجَحْدَرِيُّ جَمِيعًا عَنْ خَالِدٍ قَالَ أَبُو كَامِلٍ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ يَوْمَ الْجُمُعَةِ قَائِمًا ثُمَّ يَجْلِسُ ثُمَّ يَقُومُ قَالَ كَمَا يَفْعَلُونَ الْيَوْمَ.",
                "headingArabic": "ذِكْرِ الْخُطْبَتَيْنِ قَبْلَ الصَّلاَةِ وَمَا فِيهِمَا مِنَ الْجَلْسَةِ ‏",
                "headingUrdu": "نماز سے پہلے دو خطبہ اور ان کے درمیان کچھ دیر بیٹھنا",
                "headingEnglish": "The two khutbah before the prayer, and sitting briefly in between them",
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9559,
                "hadithNumber": "1995",
                "englishNarrator": "Jabir bin Samura رضی اللہ تعالیٰ عنہ said:",
                "hadithEnglish": "The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) gave two sermons between which he sat, recited the Qur'an and exhorted the people.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کے دو خطبے ہوتے تھے جن کے درمیان آپ بیٹھتے تھے ۔ آپ قرآن پڑھتے اور لوگوں کو نصیحت اور تذکیر فرماتے ۔",
                "urduNarrator": "اور ہم سے یحییٰ بن یحییٰ، حسن بن الربیع اور ابوبکر بن ابی شیبہ نے بیان کیا، انہوں نے کہا کہ ہمیں اس نے خبر دی اور باقی دو نے کہا کہ ہم نے بیان کیا, ابو احوص نے سماک سے اور انھوں نے حضرت جابر بن سمرھ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَحَسَنُ بْنُ الرَّبِيعِ وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ يَحْيَى أَخْبَرَنَا و قَالَ الْآخَرَانِ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ سِمَاكٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ كَانَتْ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُطْبَتَانِ يَجْلِسُ بَيْنَهُمَا يَقْرَأُ الْقُرْآنَ وَيُذَكِّرُ النَّاسَ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9560,
                "hadithNumber": "1996",
                "englishNarrator": "Jabir bin Samura رضی اللہ تعالیٰ عنہ said:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) used to deliver the sermon while standing. He would then sit down and then stand up and address in a standing posture; and whoever informed you that he (the Holy Prophet) delivered the sermon while sitting told a lie. By Allah. I prayed with him more than two thousand times.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کھڑے ہوکر خطبہ دیتے تھے ، پھر بیٹھ جاتے ، پھر کھڑے ہوتے اور کھڑے ہوکر خطبہ دیتے ، اس لئے جس نے تمھیں یہ بتایا کہ آپ بیٹھ کر خطبہ دیتے تھے ، اس نے جھوٹ بولا ۔ اللہ کی قسم! میں نے آپ کے ساتھ دو ہزار سے زائد نمازیں پڑھی ہیں ۔ ( جن میں بہت سے جمعے بھی آئے اور آپ صلی اللہ علیہ وسلم نے تمام خطبے کھڑے ہوکر دیے ۔ )",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے بیان کیا ابو خیثمہ نے سماک سے روایت کی ، انھوں نے کہا : حضرت جابر بن سمرہ  رضی اللہ تعالیٰ عنہ نے مجھے خبر دی کہ",
                "hadithArabic": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو خَيْثَمَةَ عَنْ سِمَاكٍ قَالَ أَنْبَأَنِي جَابِرُ بْنُ سَمُرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَخْطُبُ قَائِمًا ثُمَّ يَجْلِسُ ثُمَّ يَقُومُ فَيَخْطُبُ قَائِمًا فَمَنْ نَبَّأَكَ أَنَّهُ كَانَ يَخْطُبُ جَالِسًا فَقَدْ كَذَبَ فَقَدْ وَاللَّهِ صَلَّيْتُ مَعَهُ أَكْثَرَ مِنْ أَلْفَيْ صَلَاةٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9561,
                "hadithNumber": "1997",
                "englishNarrator": "Jabir bin Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "The Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was delivering the sermon on Friday in a standing posture when a caravan from Syria arrived. The people flocked towards it till no one was left (with the Holy Prophet) but twelve persons, and it was on this occasion that this verse in regard to Jumu'a was revealed. And when they see merchandise or sport. they break away to it and leave thee standing.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم جمعے کےی دن کھڑے ہوکر خطبہ دے رہے تھے کہ شام سے ایک تجارتی قافلہ آگیا ، لوگوں نے اس کا رخ کرلیا حتیٰ کہ پیچھے بارہ آدمیوں کے سوا کوئی نہ بچا تویہ آیت نازل کی گئی جو سورہ جمعہ میں ہے : \" اور جب وہ تجارت یا کوئی مشغلہ دیکھتے ہیں تو اس کی طرف ٹوٹ پڑتے ہیں اور آپ کو کھڑا چھوڑ جاتے ہیں ۔ \"",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ اور اسحاق بن ابراہیم دونوں نے روایت کی ہے, جریر نے حصین بن عبدالرحمان سے روایت کی ، انھوں نے سالم بن ابی جعد سے اور انھوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ كِلَاهُمَا عَنْ جَرِيرٍ قَالَ عُثْمَانُ حَدَّثَنَا جَرِيرٌ عَنْ حُصَيْنِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَخْطُبُ قَائِمًا يَوْمَ الْجُمُعَةِ فَجَاءَتْ عِيرٌ مِنْ الشَّامِ فَانْفَتَلَ النَّاسُ إِلَيْهَا حَتَّى لَمْ يَبْقَ إِلَّا اثْنَا عَشَرَ رَجُلًا فَأُنْزِلَتْ هَذِهِ الْآيَةُ الَّتِي فِي الْجُمُعَةِ وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا وَتَرَكُوكَ قَائِمًا (الجمعة:11)",
                "headingArabic": "فِي قَوْلِهِ تَعَالَى: {وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا وَتَرَكُوكَ قَائِمًا}",
                "headingUrdu": "آیت: ’’اور جب وہ کوئی سامان تجارت یا کوئی تفریح ​​دیکھتے ہیں تو اس کی طرف بھاگ جاتے ہیں اور تمہیں کھڑا چھوڑ دیتے ہیں‘‘۔",
                "headingEnglish": "The verse: “And when they see some merchandise or some amusement they disperse headlong to it, and leave you standing”",
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9562,
                "hadithNumber": "1998",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated by Husain with the same chain of transmitters but with this alteration that he did not make mention of the standing position.",
                "hadithUrdu": "اور ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, عبداللہ بن ادریس نے حصین سے اسی سند کے ساتھ روایت کی ، کہا : ( جب تجارتی قافلہ آیاتو ) رسول اللہ صلی اللہ علیہ وسلم خطبہ دے رہے تھے ۔ یہ نہیں کہا : کھڑے ہوئے ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ حُصَيْنٍ بِهَذَا الْإِسْنَادِ قَالَ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ وَلَمْ يَقُلْ قَائِمًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9563,
                "hadithNumber": "1999",
                "englishNarrator": "Jabir bin Abdullah رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "I was along with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) on Friday when a caravan arrived. The people went to it, and none but twelve persons were left behind and I was one of them; and it was on this occasion that this verse was revealed: And when they see merchandise or sport away to it, and leave thee standing (lxii. 1 1). they break",
                "hadithUrdu": "ہم جمعے کے دن رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے کہ ایک چھوٹا سا بازار ( سامان بیچنے والوں کا قافلہ ) آگیا تو لوگ اس کی طرف نکل گئے اور ( صرف ) بارہ آدمیوں کے سوا کوئی نہ بچا ، میں بھی ان میں تھا ، کہا : اس پر اللہ تعالیٰ نے یہ آیت اتاری : \" اور جب وہ تجارت یاکوئی مشغلہ دیکھتے ہیں تو اس کی طرف ٹوٹ پڑتے ہیں اور آ پ کو کھڑا چھوڑ دیتے ہیں \" آیت کے آخر تک ۔",
                "urduNarrator": "ہم سے رفاعہ بن الہیثم وسیطی نے بیان کیا, خالد طحان نے حصین سے روایت کی ، انھوں نے سالم اور ابو سفیان سے اور انھوں نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا رِفَاعَةُ بْنُ الْهَيْثَمِ الْوَاسِطِيُّ حَدَّثَنَا خَالِدٌ يَعْنِي الطَّحَّانَ عَنْ حُصَيْنٍ عَنْ سَالِمٍ وَأَبِي سُفْيَانَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ كُنَّا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْجُمُعَةِ فَقَدِمَتْ سُوَيْقَةٌ قَالَ فَخَرَجَ النَّاسُ إِلَيْهَا فَلَمْ يَبْقَ إِلَّا اثْنَا عَشَرَ رَجُلًا أَنَا فِيهِمْ قَالَ فَأَنْزَلَ اللَّهُ وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا وَتَرَكُوكَ قَائِمًا إِلَى آخِرِ الْآيَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 9251,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=370",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=368",
                "label": "368",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=369",
                "label": "369",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=370",
                "label": "370",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=371",
                "label": "371",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=372",
                "label": "372",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=373",
                "label": "373",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=374",
                "label": "374",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=372",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=372",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=370",
        "to": 9275,
        "total": 40465
    }
}