{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 539,
        "data": [
            {
                "id": 13739,
                "hadithNumber": "6176",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated through another chain of transmitters and the one narrated on the authority of Abdullah رضی اللہ عنہ (the words are): Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) is reported to have said: Behold I am free from the dependence of all bosom friends and if I were to choose anyone as bosom friend I would have taken Abu Bakr as my bosom friend. Allah has taken your companion as a friend.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" سن رکھو!میں ہر خلیل کی رازدارانہ دوستی سے براءت کا اظہار کرتا ہوں اور اگر میں کسی کو خلیل بناتا تو ابو بکر کو خلیل بناتا ۔ تمھارا صاحب ( نبی اکرم صلی اللہ علیہ وسلم ) اللہ کا خلیل ہے ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے ابو معاویہ اور وکیع نے بیان کیا، ان سے اسحاق بن ابراہیم نے بیان کیا، ہم سے جریر نے بیان کیا، ان سے حذیفہ نے بیان کیا۔ ہم سے ابن ابی عمر، سفیان نے بیان کیا، ان سب نے الاعمش کی سند سے، ہم سے محمد بن عبداللہ بن نمیر اور ابو سعید الاشجع نے بیان کیا - اور الفاظ۔ ان سے انہوں نے کہا: ہم سے وکیع نے بیان کیا، عماش نے بیان کیا, عبداللہ بن مرہ نے ابو احوص سے ، انھوں نے عبداللہ ( بن مسعود ) رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، وَوَكِيعٌ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، ح وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، كُلُّهُمْ عَنِ الْأَعْمَشِ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، وَأَبُو سَعِيدٍ الْأَشَجُّ - وَاللَّفْظُ لَهُمَا - قَالَا: حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا الْأَعْمَشُ، عَنْ عَبْدِ اللهِ بْنِ مُرَّةَ، عَنْ أَبِي الْأَحْوَصِ، عَنْ عَبْدِ اللهِ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَلَا إِنِّي أَبْرَأُ إِلَى كُلِّ خِلٍّ مِنْ خِلِّهِ، وَلَوْ كُنْتُ مُتَّخِذًا خَلِيلًا، لَاتَّخَذْتُ أَبَا بَكْرٍ خَلِيلًا، إِنَّ صَاحِبَكُمْ خَلِيلُ اللهِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13740,
                "hadithNumber": "6177",
                "englishNarrator": "Amr bin al-'As reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) sent him in command of the army despatched to Dhat-as-Salasil. When 'Amr b. al-'As came back to the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) he said: Who amongst people are dearest to you? He said: A'isha. He then said: Who amongst men? He said: Her father, and I said: And who next? He said: Umar. He then enumerated some other men.",
                "hadithUrdu": "رسول اﷲ ﷺ نے ان کو ذات السلاسل کے لشکر کے ساتھ بھیجا ( ذات السلاسل نواحی شام میں ایک پانی کا نام ہے وہاں کی لڑائی جمادی الاخری۸ھ میں ہوئی ) ۔ وہ آئے آپ کے پاس انہوں نے کہا یا رسول اﷲؐ! سب لوگوں میں آپ کو کس سے زیادہ محبت ہے؟ آپ نے فرمایا عائشہ صدیقہؓ سے ۔ انہوں نے کہا مرودں میں کس سے زیادہ محبت ہے؟ آپﷺ نے فرمایا ان کے باپ سے ۔ انہوں نے کہا پھر ان کے بعد کس سے؟ آپؐ نے فرمایا عمرؓ سے یہاں تک کہ آپ نے کئی آدمیوں کا ذکر کیا ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا ہم سے خالد بن عبداللہ نے بیان کیا، انہوں نے خالد کے واسطہ سے، وہ ابو عثمان سے, عمرو بن عاصؓ سے روایت ہے",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللهِ، عَنْ خَالِدٍ، عَنْ أَبِي عُثْمَانَ، أَخْبَرَنِي عَمْرُو بْنُ الْعَاصِ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، بَعَثَهُ عَلَى جَيْشِ ذَاتِ السَّلَاسِلِ، فَأَتَيْتُهُ فَقُلْتُ: أَيُّ النَّاسِ أَحَبُّ إِلَيْكَ؟ قَالَ: «عَائِشَةُ» قُلْتُ: مِنَ الرِّجَالِ؟ قَالَ «أَبُوهَا» قُلْتُ: ثُمَّ مَنْ؟ قَالَ: «عُمَرُ» فَعَدَّ رِجَالًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13741,
                "hadithNumber": "6178",
                "englishNarrator": "Ibn Abu Mulaika reported:",
                "hadithEnglish": "I heard `A'isha رضی اللہ عنہا as saying and she was asked as to whom Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) would have nominated as his successor if he had to nominate one at all. She said: Abu Bakr رضی اللہ عنہ. It was said to her: Then whom after Abu Bakr? She said: `Uma  رضی اللہ عنہ . It was said to her. Then whom after `Umar? She said: Abu `Ubaida bin al-Jarrah, and then she kept quiet at this.",
                "hadithUrdu": "میں نے ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا سے سنا ، ان سے پوچھا گیا کہ اگر رسول اللہ صلی اللہ علیہ وسلم خلیفہ کرتے تو کس کو کرتے؟ انہوں نے کہا کہ سیدنا ابوبکر رضی اللہ عنہ کو ( خلیفہ ) بناتے ۔ پھر پوچھا گیا کہ ان کے بعد کس کو ( خلیفہ ) بناتے؟ انہوں نے کہا کہ سیدنا عمر رضی اللہ عنہ کو ( خلیفہ ) بناتے ۔ پھر پوچھا گیا کہ ان کے بعد کس کو ( خلیفہ ) بناتے؟ انہوں نے کہا کہ سیدنا ابوعبیدہ بن الجراح کو ۔ پھر خاموش ہو رہیں ۔",
                "urduNarrator": "مجھ سے حسن بن علی الحلوانی نے بیان کیا، ہم سے جعفر بن عون نے بیان کیا، ان سے ابو عمیس، ح، اور ہم سے عبد بن حمید نے بیان کیا - اور اس کے الفاظ - ہم سے جعفر بن عون نے بیان کیا، کہا ہم سے ابو عمیس نے بیان کیا, ابن ابی ملیکہ کہتے ہیں کہ",
                "hadithArabic": "وحَدَّثَنِي الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ، عَنْ أَبِي عُمَيْسٍ، ح وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ - وَاللَّفْظُ لَهُ - أَخْبَرَنَا جَعْفَرُ بْنُ عَوْنٍ، أَخْبَرَنَا أَبُو عُمَيْسٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، سَمِعْتُ عَائِشَةَ، وَسُئِلَتْ: مَنْ كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مُسْتَخْلِفًا لَوِ اسْتَخْلَفَهُ؟ قَالَتْ: أَبُو بَكْرٍ، فَقِيلَ لَهَا: ثُمَّ مَنْ؟ بَعْدَ أَبِي بَكْرٍ قَالَتْ: عُمَرُ، ثُمَّ قِيلَ لَهَا مَنْ؟ بَعْدَ عُمَرَ، قَالَتْ: أَبُو عُبَيْدَةَ بْنُ الْجَرَّاحِ ثُمَّ انْتَهَتْ إِلَى هَذَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13742,
                "hadithNumber": "6179",
                "englishNarrator": "Muhammad bin Jubair bin Mut'im reported on the authority of his father:",
                "hadithEnglish": "A woman asked Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) about something but lit, told her to come to him on some other occasion, whereupon she said: What in your opinion (should I do) if I come to you but do not find you, and it seemed as if she meant that he might die. Thereupon he said: If you do not find me, then come to Abu Bakr.",
                "hadithUrdu": "ایک عورت نے رسول اللہ صلی اللہ علیہ وسلم سے کچھ پوچھا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر آنا ۔ وہ بولی کہ یا رسول اللہ! اگر میں آؤں اور آپ صلی اللہ علیہ وسلم کو نہ پاؤں ( یعنی آپ صلی اللہ علیہ وسلم کی وفات ہو جائے تو ) ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر تو مجھے نہ پائے تو ابوبکر کے پاس آنا ۔",
                "urduNarrator": "عباد بن موسیٰ نے کہا ، ہمیں ابراہیم بن سعد نے حدیث بیان کی ، کہا : مجھے میرے والد نے محمد بن جبیر بن مطعم سے خبر دی ، انھوں نے اپنے والد سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي عَبَّادُ بْنُ مُوسَى، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، أَخْبَرَنِي أَبِي، عَنْ مُحَمَّدِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ، عَنْ أَبِيهِ، أَنَّ امْرَأَةً سَأَلَتْ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ شَيْئًا، فَأَمَرَهَا أَنْ تَرْجِعَ إِلَيْهِ، فَقَالَتْ: يَا رَسُولَ اللهِ أَرَأَيْتَ إِنْ جِئْتُ فَلَمْ أَجِدْكَ؟ - قَالَ أَبِي: كَأَنَّهَا تَعْنِي الْمَوْتَ - قَالَ: «فَإِنْ لَمْ تَجِدِينِي فَأْتِي أَبَا بَكْرٍ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13743,
                "hadithNumber": "6180",
                "englishNarrator": "Mut'im رضی ‌اللہ ‌عنہ ‌through another chain of transmitters (and the words are):",
                "hadithEnglish": "A woman came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and discussed with him something and he gave a command as we find in the above-mentioned narration.",
                "hadithUrdu": "ایک عورت رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں آئی اور اس نے آپ سے کسی چیز کے بارے میں بات کی تو آپ صلی اللہ علیہ وسلم نے اسے کچھ کرنے ( دوبارہ آنے ) کو کہا ۔ ( آگے ) عباد بن موسیٰ کی حدیث کے مانند ( ہے ۔ )",
                "urduNarrator": "حجاج بن الشاعر نے مجھ سے کہا, یعقوب بن ابراہیم نے کہا : ہمیں میرے والد نے اپنے والد سے حدیث بیان کی ، کہا : مجھے محمد بن جبیر بن معطم نے خبر دی کہ انھیں ان کے والد حضرت جبیر بن معطم ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے بتایا کہ",
                "hadithArabic": "وحَدَّثَنِيهِ حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي، عَنْ أَبِيهِ، أَخْبَرَنِي مُحَمَّدُ بْنُ جُبَيْرِ بْنِ مُطْعِمٍ، أَنَّ أَبَاهُ جُبَيْرَ بْنَ مُطْعِمٍ، أَخْبَرَهُ أَنَّ امْرَأَةً أَتَتْ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَكَلَّمَتْهُ فِي شَيْءٍ، فَأَمَرَهَا، بِأَمْرٍ بِمِثْلِ حَدِيثِ عَبَّادِ بْنِ مُوسَى.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13744,
                "hadithNumber": "6181",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) in his (last) illness asked me to call Abu Bakr, her father, and her brother too, so that he might write a document, for he feared that someone else might be desirous (of succeeding him) and that some claimant may say: I have better claim to it, whereas Allah and the Faithful do not substantiate the claim of anyone but that of Abu Bakr.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ا پنے ( آخری ) مرض کے دوران میں مجھ سے فرمایا؛ \" اپنے والد ابو بکر اور اپنے بھائی کو میرے پاس بلاؤ تاکہ میں ایک تحریر لکھ دوں ، مجھے یہ خوف ہے کہ کوئی تمنا کرنے والا تمنا کرے گا اور کہنے والا کہے گا : میں زیادہ حقدار ہوں جبکہ اللہ بھی ابو بکر کے سوا ( کسی اور کی جانشینی ) سے انکار فرماتا ہے اور مومن بھی ۔ \"",
                "urduNarrator": "ہم سے عبید اللہ بن سعید نے بیان کیا، کہا ہم سے یزید بن ہارون نے بیان کیا، کہا ہم سے ابراہیم بن سعد نے بیان کیا، کہا ہم سے صالح بن کیسان نے بیان کیا، وہ زہری کی سند سے, حضرت عائشہ صدیقہ رضی اللہ عنہا سے روایت ہے ، کہا",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللهِ بْنُ سَعِيدٍ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، حَدَّثَنَا صَالِحُ بْنُ كَيْسَانَ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ: قَالَ لِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: فِي مَرَضِهِ ادْعِي لِي أَبَا بَكْرٍ، أَبَاكِ، وَأَخَاكِ، حَتَّى أَكْتُبَ كِتَابًا، فَإِنِّي أَخَافُ أَنْ يَتَمَنَّى مُتَمَنٍّ وَيَقُولُ قَائِلٌ: أَنَا أَوْلَى، وَيَأْبَى اللهُ وَالْمُؤْمِنُونَ إِلَّا أَبَا بَكْرٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13745,
                "hadithNumber": "6182",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Who amongst you is fasting today? Abu Bakr رضی اللہ عنہ said: I am. He (again) said: Who amongst you followed a funeral procession today? Abu Bakr رضی اللہ عنہ said: I did. He (the Prophet) again said: Who amongst you served food to the needy? Abu Bakr رضی اللہ عنہ said: I did. He (again) said: Who amongst you has today visited the sick? Abu Bakr رضی اللہ عنہ said: I did. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) said: Anyone in whom (these good deeds) are combined will certainly enter paradise.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \" آج تم میں سے کس نے روزہ رکھا ہے؟ \" حضرت ابو بکر رضی اللہ تعالیٰ عنہ نے کہا : میں نے ۔ آپ صلی اللہ علیہ وسلم نے فرما یا : \" آج تم میں سے کون جنازے میں شامل ہوا ۔ ؟ \" ابوبکر رضی اللہ تعالیٰ عنہ نے کہا : میں ۔ آپ صلی اللہ علیہ وسلم نے فر ما یا : \" آج تم میں سے کس شخص نے کسی مسکین کو کھا نا کھلا یا ؟ \" حضرت ابو بکر رضی اللہ تعالیٰ عنہ نے کہا : میں نے ۔ آپ نے فر ما یا : \" آج تم میں سے کس شخص نے کسی مریض کی عیادت کی ہے ۔ ؟حضرت ابوبکر رضی اللہ تعالیٰ عنہ نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" جس کسی آدمی میں یہ سب اوصاف اکٹھے ہو تے ہیں تو وہ جنت میں داخل ہو جاتا ہے ۔ \"",
                "urduNarrator": "ہم سے محمد بن ابی عمر المکی نے بیان کیا، کہا ہم سے مروان بن معاویہ الفزاری نے بیان کیا، انہوں نے یزید کی سند سے، جو ابن کیسان ہیں، انہوں نے ابوحازم اشجعی کی سند سے, حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے ، کہا رسول اللہ صلی اللہ علیہ وسلم نے دریافت کیا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْمَكِّيُّ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ الْفَزَارِيُّ، عَنْ يَزِيدَ وَهُوَ ابْنُ كَيْسَانَ، عَنْ أَبِي حَازِمٍ الْأَشْجَعِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «مَنْ أَصْبَحَ مِنْكُمُ الْيَوْمَ صَائِمًا؟» قَالَ أَبُو بَكْرٍ: أَنَا، قَالَ: «فَمَنْ تَبِعَ مِنْكُمُ الْيَوْمَ جَنَازَةً؟» قَالَ أَبُو بَكْرٍ: أَنَا، قَالَ: «فَمَنْ أَطْعَمَ مِنْكُمُ الْيَوْمَ مِسْكِينًا» قَالَ أَبُو بَكْرٍ: أَنَا، قَالَ: «فَمَنْ عَادَ مِنْكُمُ الْيَوْمَ مَرِيضًا» قَالَ أَبُو بَكْرٍ: أَنَا، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَا اجْتَمَعْنَ فِي امْرِئٍ إِلَّا دَخَلَ الْجَنَّةَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13746,
                "hadithNumber": "6183",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: A person had been driving an ox loaded with luggage. The ox looked towards him and said: I have not been created for this but for lands (i.e. for ploughing the land and for drawing out water from the wells for the purpose of irrigating the lands). The people said with surprise and awe: Hallowed be Allah, does the ox speak? Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: I believe it and so do Abu Bakr and 'Umar. Abu Huraira رضی اللہ عنہ reported Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: A shepherd was tendirig the flock when a wolf came there and took away one goat. Tile shepherd pursued it (the wolf) and rescued it (the goat) from that (wolf). The wolf looked towards him and said: Who would save it on the day when there will be no shepherd except me? Thereupon people said: Hallowed be Allah I Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: I believe in it and so do Abu Bakr and Umar believe.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" ایک شخص اپنی گا ئے کو ہانک رہاتھا اس پر بو جھ لادا ہوا تھا ۔ اس گائے نے منہ پیچھے کیا اور کہا : مجھے اس کا م کے لیے پیدا نہیں کیا گیا بلکہ کھیتی باڑی کے لیے پیدا کیا گیا ہے ۔ \" لوگوں نے تعجب اور حیرت سے کہا : سبحان اللہ ! کیا گائے بولتی ہے؟ رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" ( کسی اور کو یقین ہو نہ ہو ) میرا ابو بکر کا اور عمر کا اس پر ایمان ہے ۔ \" حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" ایک چرواہااپنی بکریوں میں ( مو جود ) تھا کہ بھیڑیے نے اس پر حملہ کیا اور ایک بکری پکڑلی ، چرواہا اس کے پیچھے لگ گیا حتی کہ اس بکری کو بھیڑیے سے بچا لیا ۔ اس ( بھیڑیے ) نے کہا : اس دن اسے کون بچا ئے گا جب درندوں ( کے حملے ) کا دن آئے گا اور میرے سوا اس کا چرواہا ( مالک ) کو ئی نہ ہو گا ؟ \" لوگوں نے کہا : سبحان اللہ !تو رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" میں اس بات پر یقین رکھتا ہوں اور ابو بکر اور عمر ( بھی یقین رکھتے ہیں ۔ )",
                "urduNarrator": "مجھ سے ابو الطاہر احمد بن عمرو بن سرح اور ہرملہ بن یحییٰ نے بیان کیا، کہا کہ ہم سے ابن وہب نے بیان کیا, یو نس نے ابن شہاب سے روایت کی ، کہا : مجھے سعد بن مسیب اور ابو سلمہ بن عبد الرحمن ( بن عوف ) نے حدیث سنائی کہ ان دونوں نے ابوہریرہ رضی اللہ عنہ سے سنا ، کہتے تھے کہ",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ، وَحَرْمَلَةُ بْنُ يَحْيَى، قَالَا: أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيِّبِ، وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّهُمَا سَمِعَا أَبَا هُرَيْرَةَ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: بَيْنَمَا رَجُلٌ يَسُوقُ بَقَرَةً لَهُ، قَدْ حَمَلَ عَلَيْهَا، الْتَفَتَتْ إِلَيْهِ الْبَقَرَةُ فَقَالَتْ: إِنِّي لَمْ أُخْلَقْ لِهَذَا، وَلَكِنِّي إِنَّمَا خُلِقْتُ لِلْحَرْثِ فَقَالَ النَّاسُ: سُبْحَانَ اللهِ تَعَجُّبًا وَفَزَعًا، أَبَقَرَةٌ تَكَلَّمُ؟ فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «فَإِنِّي أُومِنُ بِهِ وَأَبُو بَكْرٍ، وَعُمَرُ» قَالَ أَبُو هُرَيْرَةَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: بَيْنَا رَاعٍ فِي غَنَمِهِ، عَدَا عَلَيْهِ الذِّئْبُ فَأَخَذَ مِنْهَا شَاةً، فَطَلَبَهُ الرَّاعِي حَتَّى اسْتَنْقَذَهَا مِنْهُ، فَالْتَفَتَ إِلَيْهِ الذِّئْبُ فَقَالَ لَهُ: مَنْ لَهَا يَوْمَ السَّبُعِ، يَوْمَ لَيْسَ لَهَا رَاعٍ غَيْرِي؟ فَقَالَ النَّاسُ: سُبْحَانَ اللهِ فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «فَإِنِّي أُومِنُ بِذَلِكَ، أَنَا وَأَبُو بَكْرٍ وَعُمَرُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13747,
                "hadithNumber": "6184",
                "englishNarrator": null,
                "hadithEnglish": "The story of the sheep and the wolf was narrated from Ibn Shihab (a hadith similar to no. 6183) with this chain, but he did not mention the story of the cow.",
                "hadithUrdu": "مجھ سے عبد الملک بن شعیب بن لیث نے بیان کیا، میرے والد نے مجھ سے میرے دادا کی سند سے بیان کیا, عقیل بن خالد نے ابن شہاب سے اسی سند کے ساتھ بکری اور بھیڑیے کا واقعہ بیان کیا اور گا ئے کا واقعہ بیان نہیں کیا ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي عُقَيْلُ بْنُ خَالِدٍ، عَنِ ابْنِ شِهَابٍ بِهَذَا الْإِسْنَادِ، قِصَّةَ الشَّاةِ وَالذِّئْبِ، وَلَمْ يَذْكُرْ قِصَّةَ الْبَقَرَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13748,
                "hadithNumber": "6185",
                "englishNarrator": "A hadith like that of Yunus from Az-Zuhri was narrated from Abu Hurairah رضی اللہ عنہ (no. 6183) from the prophet (ﷺ).",
                "hadithEnglish": "In both the Ahadith the cow and the sheep are both mentioned, and they said in their hadith: (The Messenger of Allah (ﷺ) said:) \"I believe in it and so do Abu Bakr and Umar.\"",
                "hadithUrdu": "ان دونوں کی حدیث میں گا ئے اور بکری دونوں کا ذکر ہے اور دونوں نے اپنی حدیث کے الفا ظ کہے ۔ \" میں اس پر یقین رکھتا ہوں اور ابو بکراور عمر ( بھی یقین رکھتے ہیں ۔ ) \" اور وہ دونوں وہاں نہیں تھے ۔",
                "urduNarrator": "ہم سے محمد بن عباد نے بیان کیا, سفیان بن عیینہ اور سفیان ( ثوری ) دونوں نے ابو زناد سے ، انھوں نے اعرج سے ، انھوں نے ابو سلمہ سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے ، انھوں نے نبی صلی اللہ علیہ وسلم سےزہری سے یونس کی روایت کے ہم معنی روایت کی",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبَّادٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ح وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا أَبُو دَاوُدَ الْحَفَرِيُّ، عَنْ سُفْيَانَ كِلَاهُمَا، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَى حَدِيثِ يُونُسَ، عَنِ الزُّهْرِيِّ وَفِي حَدِيثِهِمَا: ذِكْرُ الْبَقَرَةِ وَالشَّاةِ مَعًا، وَقَالَا فِي حَدِيثِهِمَا: «فَإِنِّي أُومِنُ بِهِ أَنَا وَأَبُو بَكْرٍ وَعُمَرُ» وَمَا هُمَا ثَمَّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13749,
                "hadithNumber": "6186",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Abu Huraira رضی اللہ عنہ through another chain of transmitters.",
                "hadithUrdu": "ہم سے محمد بن المثنیٰ اور ابن بشار نے بیان کیا، کہا: ہم سے محمد بن جعفر نے بیان کیا، شعبہ اور مسعر دونوں نے سعد بن ابرا ہیم سے انھوں نے ابو سلمہ سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبَّادٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ مِسْعَرٍ كِلَاهُمَا، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13750,
                "hadithNumber": "6187",
                "englishNarrator": "Ibn Abu Mulaika reported: I heard Ibn 'Abbas رضی اللہ عنہ as saying:",
                "hadithEnglish": "When 'Umar bin Khattab رضی اللہ عنہ was placed in the coffin the people gathered around him. They praised him and supplicated for him before the bier was lifted up, and I was one amongst them. Nothing attracted my attention but a person who gripped my shoulder from behind. I saw towards him and found that he was 'Ali رضی اللہ عنہ . He invoked Allah's mercy upon 'Umar رضی اللہ عنہ and said: You have left none behind you (whose) deeds (are so enviable) that I love to meet Allah with them. By Allah, I hoped that Allah would keep you and your two associates together. I had often heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: I came and there came too Abu Bakr and 'Umar; I entered and there entered too Abu Bakr and 'Umar; I went out and there went out too Abu Bakr and 'Umar, and I hope and think that Allah will keep you along with them.",
                "hadithUrdu": "جب حضرت عمر بن خطاب رضی اللہ عنہ ( کے جسد خاکی ) کو چار پائی پر رکھا گیا تو ( جنازہ ) اٹھا نے سے پہلے لوگوں نے چاروں طرف سے ان کو گھیر لیا ۔ وہ دعائیں کر رہے تھے تعریف کر رہے تھے دعائے رحمت کر رہے تھے ۔ میں بھی ان میں شامل تھا تو مجھے اچانک کسی ایسے شخص نے چونکا دیا جس نے پیچھے سے ( آکر ) میرا کندھا تھا ما ۔ میں نے مڑ کر دیکھا تو حضرت علی رضی اللہ عنہ تھے ، انھوں نے حضرت عمر رضی اللہ عنہ کے لیے رحمت کی دعا کی اور کہا : آپ نے کو ئی ایسا آدمی پیچھے نہ چھوڑا جو آپ سے بڑھ کر اس بات میں مجھے محبوب ہو کہ میں اللہ سے اس کے جیسے عملوں کے ساتھ ملوں ۔ اللہ کی قسم!مجھے ۔ ہمیشہ سے یہ یقین تھا کہ اللہ تعا لیٰ آپ کو اپنے دونوں ساتھیوں کے ساتھ رکھے گا ۔ اس کا سبب یہ ہے کہ میں اکثر رسول اللہ صلی اللہ علیہ وسلم سے سناکرتا تھا ، آپ فر ما یا کرتے تھے ، \" میں ابو بکر اور عمر آئے ۔ میں ابو بکر اور عمر اندر گئے ، میں ابو بکر اور عمر باہر نکلے ۔ \" مجھے امید تھی بلکہ مجھے ہمیشہ سے یقین رہا کہ اللہ آپ کو ان دونوں کے ساتھ رکھے گا ۔",
                "urduNarrator": "ہمیں سعید بن عمرو اشعثی، ابو الربیع العتکی اور ابو کریب محمد بن الاعلٰی نے بیان کیا اور تلفظ ابو کریب نے کہا, اس نے ہمیں بتایا اور باقی دو نے کہا, ابن مبارک نے عمر بن سعید بن ابو حسین سے ، انھوں نے ابن ابی ملیکہ سے روایت کی ، انھوں نے کہا : میں نے حضرت ابن عباس رضی اللہ عنہ کو بیان کرتے ہو ئے سنا",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ عَمْرٍو الْأَشْعَثِيُّ، وَأَبُو الرَّبِيعِ الْعَتَكِيُّ، وَأَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ - وَاللَّفْظُ لِأَبِي كُرَيْبٍ قَالَ أَبُو الرَّبِيعِ: حَدَّثَنَا وقَالَ الْآخَرَانِ: أَخْبَرَنَا - ابْنُ الْمُبَارَكِ، عَنْ عُمَرَ بْنِ سَعِيدِ بْنِ أَبِي حُسَيْنٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، قَالَ: سَمِعْتُ ابْنَ عَبَّاسٍ، يَقُولُ: وُضِعَ عُمَرُ بْنُ الْخَطَّابِ عَلَى سَرِيرِهِ، فَتَكَنَّفَهُ النَّاسُ يَدْعُونَ وَيُثْنُونَ وَيُصَلُّونَ عَلَيْهِ، قَبْلَ أَنْ يُرْفَعَ، وَأَنَا فِيهِمْ، قَالَ فَلَمْ يَرُعْنِي إِلَّا بِرَجُلٍ قَدْ أَخَذَ بِمَنْكِبِي مِنْ وَرَائِي، فَالْتَفَتُّ إِلَيْهِ فَإِذَا هُوَ عَلِيٌّ، فَتَرَحَّمَ عَلَى عُمَرَ، وَقَالَ: مَا خَلَّفْتَ أَحَدًا أَحَبَّ إِلَيَّ أَنْ أَلْقَى اللهَ بِمِثْلِ عَمَلِهِ مِنْكَ، وَايْمُ اللهِ إِنْ كُنْتُ لَأَظُنُّ أَنْ يَجْعَلَكَ اللهُ مَعَ صَاحِبَيْكَ، وَذَاكَ أَنِّي كُنْتُ أُكَثِّرُ أَسْمَعُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «جِئْتُ أَنَا وَأَبُو بَكْرٍ وَعُمَرُ، وَدَخَلْتُ أَنَا وَأَبُو بَكْرٍ وَعُمَرُ، وَخَرَجْتُ أَنَا وَأَبُو بَكْرٍ وَعُمَرُ، فَإِنْ كُنْتُ لَأَرْجُو، أَوْ لَأَظُنُّ، أَنْ يَجْعَلَكَ اللهُ مَعَهُمَا».",
                "headingArabic": "مِنْ فَضَائِلِ عُمَرَ رضى الله تعالى عنه ‏‏",
                "headingUrdu": "حضرت عمر رضی اللہ عنہ کے فضائل",
                "headingEnglish": "The Virtues Of 'Umar (RA)",
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13751,
                "hadithNumber": "6188",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of 'Umar bin Sa'id with the same chain of transmitters.",
                "hadithUrdu": "ہم سے اسحاق بن ابراہیم نے بیان کیا, عیسیٰ بن یونس نے عمربن سعید سے اسی سند سے اسی کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، عَنْ عُمَرَ بْنِ سَعِيدٍ فِي هَذَا الْإِسْنَادِ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13752,
                "hadithNumber": "6189",
                "englishNarrator": "Abu Sa'id Khudri رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: While I was asleep I saw people being presented to me (in a dream) and they wore shirts and some of these reached up to the breasts and some even beyond them. Then there happened to pass 'Umar bin Khattab and his shirt had been trailing. They said: Allah's Messenger, how do you interpret the dream? He said: (As strength of) faith.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" میں سویا ہوا تھا : میں نے دیکھا کہ لو گ میرے سامنے لا ئے جا رہے ہیں ۔ انھوں نے قمیص پہنی ہو ئی ہیں ، کسی کی قمیص چھا تی تک پہنچتی ہے کسی کی اس سے نیچے تک پہنچتی ہے اور عمر بن خطاب گزرے تو ان پر جو قمیص ہے وہ اسے گھسیٹ رہے ہیں ۔ \" لوگوں نے عرض کی : اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! آپ نے اس کی کیا تعبیر فرما ئی ہے؟ آپ صلی اللہ علیہ وسلم نے فر ما یا : \" دین ۔ \"",
                "urduNarrator": "ہم سے منصور بن ابی مزاحم نے بیان کیا، ہم سے ابراہیم بن سعد نے بیان کیا، ان سے صالح بن کیسان نے، ہم سے زہیر بن حرب اور حسن بن علی نے بیان کیا۔ الحلوانی اور عبد بن حمید - اور قول ان کا ہے - کہا: ہم سے یعقوب بن ابراہیم نے بیان کیا، ہم سے میرے والد نے، صالح کی سند سے، ابن شہاب کی سند سے، ابو امامہ بن سہل نے حضرت ابو سعید خدری رضی اللہ عنہ سے سنا ، کہتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا مَنْصُورُ بْنُ أَبِي مُزَاحِمٍ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحِ بْنِ كَيْسَانَ، ح وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَالْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، وَعَبْدُ بْنُ حُمَيْدٍ - وَاللَّفْظُ لَهُمْ - قَالُوا: حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي أَبُو أُمَامَةَ بْنُ سَهْلٍ، أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: بَيْنَا أَنَا نَائِمٌ، رَأَيْتُ النَّاسَ يُعْرَضُونَ وَعَلَيْهِمْ قُمُصٌ، مِنْهَا مَا يَبْلُغُ الثُّدِيَّ وَمِنْهَا مَا يَبْلُغُ دُونَ ذَلِكَ وَمَرَّ عُمَرُ بْنُ الْخَطَّابِ وَعَلَيْهِ قَمِيصٌ يَجُرُّهُ قَالُوا مَاذَا أَوَّلْتَ ذَلِكَ يَا رَسُولَ اللهِ قَالَ: «الدِّينَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13753,
                "hadithNumber": "6190",
                "englishNarrator": "Hamza bin Abdullah bin 'Umar bin Khattab reported on the authority of his father:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: While I was asleep I saw (in a dream) a cup containing milk being presented to me. I took out of that until I perceived freshness being reflected through my nails. Then I presented the leftover to 'Umar b. Khattab. They said: Allah's Messenger: How do you interpret it? He said: This implies knowledge.",
                "hadithUrdu": "آپ نے فرمایا : \" میں سویا ہوا تھا کہ میں نے ایک پیا لہ دیکھا جو میرے پاس لا یا گیا ۔ اس میں دودھ تھا ۔ میں نے اس میں سے پیا یہاں تک کہ مجھے محسوس ہوا کہ سیرابی میرے ناخنوں سے نکل رہی ہے ۔ پھر اپنا بچا ہوا دودھ میں نے عمر رضی اللہ تعالیٰ عنہ کو دے دیا ۔ \" ( حاضرین نے ) کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! آپ نے اس کی کیا تعبیر فر ما ئی ؟آپ نے فرما یا : \" علم ۔ \"",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا,یو نس نے کہا : کہ ابن شہاب نے انھیں بتا یا ، انھوں نےحمزہ بن عبد اللہ بن عمربن خطاب سے روایت کی ، انھوں نے اپنے والد سے انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، أَنَّ ابْنَ شِهَابٍ، أَخْبَرَهُ عَنْ حَمْزَةَ بْنِ عَبْدِ اللهِ بْنِ عُمَرَ بْنِ الْخَطَّابِ، عَنْ أَبِيهِ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «بَيْنَا أَنَا نَائِمٌ، إِذْ رَأَيْتُ قَدَحًا أُتِيتُ بِهِ فِيهِ لَبَنٌ، فَشَرِبْتُ مِنْهُ حَتَّى إِنِّي لَأَرَى الرِّيَّ يَجْرِي فِي أَظْفَارِي، ثُمَّ أَعْطَيْتُ فَضْلِي عُمَرَ بْنَ الْخَطَّابِ» قَالُوا: فَمَا أَوَّلْتَ ذَلِكَ؟ يَا رَسُولَ اللهِ قَالَ: «الْعِلْمَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13754,
                "hadithNumber": "6191",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Yunus with the same chain of transmitters.",
                "hadithUrdu": "ہم سے قتیبہ بن سعید نے بیان کیا، ہم سے لیث نے بیان کیا، ان سے عقیل کی سند سے، ہم سے ایچ الحلوانی اور عبد بن حمید نے بیان کیا، ان دونوں نے یعقوب بن ابراہیم کی سند سے۔ ہمارے والد ابن سعد نے ہم سے کہا, صالح نے یونس کی سند کے ساتھ اسی کی حدیث کے مانند حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَاهُ قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ عُقَيْلٍ، ح وَحَدَّثَنَا الْحُلْوَانِيُّ، وَعَبْدُ بْنُ حُمَيْدٍ، كِلَاهُمَا عَنْ يَعْقُوبَ بْنِ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، بِإِسْنَادِ يُونُسَ نَحْوَ حَدِيثِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13755,
                "hadithNumber": "6192",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: While I was asleep I saw myself on a well with a leathern bucket on a pulley. I drew (water) out of that as Allah wished me (to draw). Then the son of Abu Quhafa (Abu Bakr) drew from it one bucketful or two and there was some weakness in drawing that (may Allah forgive him). Then that bucket (changed into a large bucket) and Ibn Khattab drew it. I did not see any strongest man drawing it like 'Umar bin Khattab. He brought out so much water that the camels of the people had enough to drink and then laid down (for rest).",
                "hadithUrdu": "آپ فر ما رہےتھے ۔ \" میں سویا ہوا تھا کہ میں نے خود ایک کنویں پر دیکھا اس پر ایک ڈول تھا میں نے اس میں جتنا اللہ نے چا ہا پانی نکالا ، پھر ابن ابی قحافہ نے اس سے ایک یا دوڈول نکالے ، اللہ ان کی مغفرت کرے!ان کے پانی نکا لنے میں کچھ کمزوری تھی ، پھر وہ ایک بڑا ڈول بن گیا تو عمر بن خطاب نے اسے پکڑ لیا ، چنانچہ میں نے لوگوں میں کو ئی ایسا عبقری ( غیر معمولی صلاحیت کا مالک ) نہیں دیکھا جو عمر بن خطاب کی طرح سے پانی نکا لے حتی کہ لو گ اونٹوں کو ( سیراب کر کے گھاٹ سے سے باہر ) آرام کرنے کی جگہ پر لے گئے ۔ \"",
                "urduNarrator": "ہم سے حرملہ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا, یو نس نے ابن شہاب سے روایت کی کہ سعید بن مسیب نے انھیں خبر دی ، انھوں نے ابو ہریرہ رضی اللہ عنہ سے سنا ، کہتے تھے میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا",
                "hadithArabic": "حَدَّثَنَا حَرْمَلَةُ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَنَّ سَعِيدَ بْنَ الْمُسَيِّبِ، أَخْبَرَهُ أَنَّهُ، سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: «بَيْنَا أَنَا نَائِمٌ رَأَيْتُنِي عَلَى قَلِيبٍ، عَلَيْهَا دَلْوٌ، فَنَزَعْتُ مِنْهَا مَا شَاءَ اللهُ، ثُمَّ أَخَذَهَا ابْنُ أَبِي قُحَافَةَ فَنَزَعَ بِهَا ذَنُوبًا أَوْ ذَنُوبَيْنِ، وَفِي نَزْعِهِ، وَاللهُ يَغْفِرُ لَهُ، ضَعْفٌ، ثُمَّ اسْتَحَالَتْ غَرْبًا، فَأَخَذَهَا ابْنُ الْخَطَّابِ، فَلَمْ أَرَ عَبْقَرِيًّا مِنَ النَّاسِ يَنْزِعُ نَزْعَ عُمَرَ بْنِ الْخَطَّابِ، حَتَّى ضَرَبَ النَّاسُ بِعَطَنٍ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13756,
                "hadithNumber": "6193",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Yunus through another chain of transmitters.",
                "hadithUrdu": "مجھ سے عبدالملک بن شعیب بن لیث نے بیان کیا، مجھ سے میرے والد نے بیان کیا، مجھ سے میرے دادا نے بیان کیا، مجھ سے عقیل بن خالد نے بیان کیا اور ہم سے عمرو نقید نے بیان کیا۔ الحلوانی اور عبد بن حمید، یعقوب بن ابراہیم بن سعد کی سند سے، میرے والد نے ہم سے کہا, صالح نے یو نس کی سند کے ساتھ انھی کی حدیث کے مانند حدیث بیان کی .",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي عُقَيْلُ بْنُ خَالِدٍ، ح وَحَدَّثَنَا عَمْرٌو النَّاقِدُ، وَالْحُلْوَانِيُّ، وَعَبْدُ بْنُ حُمَيْدٍ، عَنْ يَعْقُوبَ بْنِ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ بِإِسْنَادِ يُونُسَ، نَحْوَ حَدِيثِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13757,
                "hadithNumber": "6194",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: I saw Ibn Abu Quhafa drawing (water) ; the rest of the hadith is the same.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" میں نے ابن ابی قحافہ کو ڈول کھینچتے دیکھا ۔ \" زہری کی حدیث کی طرح ۔",
                "urduNarrator": "ہم سے الحلوانی اور عبد بن حمید نے بیان کیا، کہا کہ ہم سے یعقوب نے بیان کیا, صالح نے کہا : اعرج وغیرہ نے کہا : کہ ابو ہریرہ رضی اللہ عنہ نے کہا",
                "hadithArabic": "حَدَّثَنَا الْحُلْوَانِيُّ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَا: حَدَّثَنَا يَعْقُوبُ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، قَالَ: قَالَ الْأَعْرَجُ، وَغَيْرُهُ: إِنَّ أَبَا هُرَيْرَةَ، قَالَ: إِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «رَأَيْتُ ابْنَ أَبِي قُحَافَةَ يَنْزِعُ» بِنَحْوِ حَدِيثِ الزُّهْرِيِّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13758,
                "hadithNumber": "6195",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: While I was asleep I saw myself drawing water from my tank in order to quench the thirst of the people that there came to me Abu Bakr. He took hold of the leathern bucket from my hand so that he should serve water to the people. He drew two bucketfuls and there was some weakness in his drawing (Allah may forgive him). Then there came Ibn Khattab رضی اللہ عنہ and he took hold of that, and I did not see a person stronger than he (drawing water) until the people went away with their thirst quenched and the tank filled with water.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فر ما یا : \" میں سویا ہوا تھا تو مجھے خواب میں دکھا یا گیا کہ میں اپنے حوض سے پانی نکال کر لوگوں کو پلا رہا ہوں ، پھر ابو بکر آئے اور انھوں نے مجھے آرام پہنچانے کے لیے میرے ہاتھ سے ڈول لے لیا ، انھوں نے دو ڈول پانی نکا لا ، ان کے پانی نکا لنے میں کچھ کمزوری تھی ، اللہ ان کی مغفرت کرے!پھر ابن خطاب رضی اللہ عنہ آئے تو انھوں نے ان سے ڈول لے لیا ، میں نے کسی شخص کو ان سے زیادہ قوت کے ساتھ ڈول کھینچتےنہیں دیکھا ، یہاں تک کہ لوگ ( سیراب ہو کر ) چلے گئے ۔ اور حوض پوری طرح بھراہوا تھا ( اس میں سے ) پانی امڈ رہا تھا ۔ \"",
                "urduNarrator": "مجھ سے احمد بن عبدالرحمٰن بن وہب نے بیان کیا، مجھ سے میرے چچا عبداللہ بن وہب نے بیان کیا، مجھ سے عمرو بن حارث نے بیان کیا کہ ابو یونس,ابو ہریرہ رضی اللہ عنہ کے آزاد کردہ غلام ابو یونس نے ابوہریرہ رضی اللہ عنہ سے حدیث بیان کی ، انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي أَحْمَدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ وَهْبٍ، حَدَّثَنَا عَمِّي عَبْدُ اللهِ بْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، أَنَّ أَبَا يُونُسَ، مَوْلَى أَبِي هُرَيْرَةَ، حَدَّثَهُ عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «بَيْنَا أَنَا نَائِمٌ أُرِيتُ أَنِّي أَنْزِعُ عَلَى حَوْضِي أَسْقِي النَّاسَ، فَجَاءَنِي أَبُو بَكْرٍ فَأَخَذَ الدَّلْوَ مِنْ يَدِي لِيُرَوِّحَنِي، فَنَزَعَ دَلْوَيْنِ، وَفِي نَزْعِهِ ضَعْفٌ، وَاللهُ يَغْفِرُ لَهُ، فَجَاءَ ابْنُ الْخَطَّابِ فَأَخَذَ مِنْهُ، فَلَمْ أَرَ نَزْعَ رَجُلٍ قَطُّ أَقْوَى مِنْهُ، حَتَّى تَوَلَّى النَّاسُ، وَالْحَوْضُ مَلْآنُ يَتَفَجَّرُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13759,
                "hadithNumber": "6196",
                "englishNarrator": "Abdullah bin 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: I saw (in a dream) as if I was drawing water with a leathern bucket on a wooden pulley. There came Abu Bakr and he drew out a bucketful or two and as he drew out, some weakness (was perceived in it) (may Allah, the Exalted and Glorious, forgive him). Then Umar came in order to serve water -and the bucket was changed into a large leather bucket and I did not see such a wonderful man amongst persons (drawing water) and he went on serving water to the people until they were fully satisfied and then went to their resting places.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" میں نے ( خواب میں دیکھا ) کہ جیسے میں ایک کنویں پر چرخی والے ڈول سے پانی نکا ل رہا ہوں ، پھر ابو بکر آگئے ، انھوں نے ایک یا دوڈول نکا لے اللہ تبارک وتعا لیٰ ان کی مغفرت فرما ئے ، انھوں نے کچھ کمزوری سے ڈول نکالے ۔ پھر عمر آئے انھوں نے پانی نکا لا تو وہ بہت بڑا ڈول بن گیا ، میں نے لوگوں میں کو ئی غیر معمولی آدمی بھی ایسا نہیں دیکھا جوان جیسی طاقت کا مظاہرہ کرسکتا ہو یہاں تک کہ لو گ سیراب ہو گئے اور انھوں نے جانوروں کو سیراب کرکے ) آرام کرنے کی جگہ پہنچادیا ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور محمد بن عبداللہ بن نمیر نے بیان کیا اور یہ لفظ ابوبکر کا ہے، انہوں نے کہا: ہم سے محمد بن بشر نے بیان کیا، ہم سے عبید اللہ بن عمر نے بیان کیا, ابو بکر بن سالم نے سالم بن عبد اللہ سے ، انھوں نے عبد اللہ بن عمر رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ - وَاللَّفْظُ لِأَبِي بَكْرٍ - قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا عُبَيْدُ اللهِ بْنُ عُمَرَ، حَدَّثَنِي أَبُو بَكْرِ بْنُ سَالِمٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللهِ، عَنْ عَبْدِ اللهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «أُرِيتُ كَأَنِّي أَنْزِعُ بِدَلْوِ بَكْرَةٍ عَلَى قَلِيبٍ، فَجَاءَ أَبُو بَكْرٍ فَنَزَعَ ذَنُوبًا أَوْ ذَنُوبَيْنِ، فَنَزَعَ نَزْعًا ضَعِيفًا وَاللهُ، تَبَارَكَ وَتَعَالَى يَغْفِرُ لَهُ، ثُمَّ جَاءَ عُمَرُ، فَاسْتَقَى فَاسْتَحَالَتْ غَرْبًا، فَلَمْ أَرَ عَبْقَرِيًّا مِنَ النَّاسِ يَفْرِي فَرْيَهُ، حَتَّى رَوِيَ النَّاسُ وَضَرَبُوا الْعَطَنَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13760,
                "hadithNumber": "6197",
                "englishNarrator": null,
                "hadithEnglish": "Salim bin 'Abdullah reported on the authority of his father some of the dreams of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) pertaining to Abu Bakr and Umar bin Khattab (رضی اللہ عنہ) and a hadith like this.",
                "hadithUrdu": "ہم سے احمد بن عبداللہ بن یونس نے بیان کیا، کہا ہم سے زہیر نے بیان کیا, موسیٰ بن عقبہ نے سالم بن عبداللہ سے ، انھوں نے اپنے والد سے حضرت ابو بکر اور عمربن خطاب رضی اللہ عنہ کے بارے میں نبی صلی اللہ علیہ وسلم کا خواب ان سب کی حدیث کی طرح روایت کیا ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللهِ بْنِ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنِي مُوسَى بْنُ عُقْبَةَ، عَنْ سَالِمِ بْنِ عَبْدِ اللهِ، عَنْ أَبِيهِ، عَنْ رُؤْيَا رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي أَبِي بَكْرٍ، وَعُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللهُ عَنْهُمَا بِنَحْوِ حَدِيثِهِمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13761,
                "hadithNumber": "6198",
                "englishNarrator": "Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: I entered Paradise and saw in it a house or a palace. I said: For whom is it reserved? They (the Angels) said: It is for 'Umar b. Khattab. (The Prophet said to 'Umar bin Khattab): I intenied to get into it but I thought of your feelings. Thereupon 'Umar رضی اللہ عنہ wept and said: Apostle of Allah, could I feel any jealousy in your case?",
                "hadithUrdu": "آپ نے فرما یا : \" میں جنت میں داخل ہوا تو میں نے وہاں ایک گھر یا محل دیکھا میں نے پو چھا : یہ کس کا ہے؟فرشتوں نے کہا : یہ عمر بن خطاب کا ( محل ) ہے ، میں نے اس میں داخل ہو نے کا ارادہ کیا ، پھر مجھے تمھا ری غیرت یاد آگئی ۔ حضرت عمر رضی اللہ عنہ رونے لگے اور عرض کی : اے اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! کیا آپ سے غیرت کی جا تی ہے؟",
                "urduNarrator": "محمد بن عبد اللہ بن نمیر اور زہیر بن حرب نے کہا : ۔ الفاظ انھی ( زہیر ) کے ہیں ۔ ہمیں سفیان بن عیینہ نے حدیث بیان کی ، انھوں نے عمرواور ابن منکدر سے انھوں نے جابر رضی اللہ عنہ سے انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ۔ کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، وَابْنِ الْمُنْكَدِرِ، سَمِعَا جَابِرًا، يُخْبِرُ عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، ح وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ - وَاللَّفْظُ لَهُ - حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ ابْنِ الْمُنْكَدِرِ، وَعَمْرٍو، عَنْ جَابِرٍ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: دَخَلْتُ الْجَنَّةَ فَرَأَيْتُ فِيهَا دَارًا أَوْ قَصْرًا، فَقُلْتُ: لِمَنْ هَذَا؟ فَقَالُوا: لِعُمَرَ بْنِ الْخَطَّابِ، فَأَرَدْتُ أَنْ أَدْخُلَ، فَذَكَرْتُ غَيْرَتَكَ فَبَكَى عُمَرُ وَقَالَ: أَيْ رَسُولَ اللهِ أَوَ عَلَيْكَ يُغَارُ؟",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13762,
                "hadithNumber": "6199",
                "englishNarrator": null,
                "hadithEnglish": "It was narrated from Ibn-Munkadir: \"I heard Jabir رضی اللہ عنہ (narrate) from the prophet (ﷺ)..\" a Hadith like that of Ibn Numair nd Zahair (no. 6199).",
                "hadithUrdu": "اسحٰق بن ابرا ہیم ، ابو بکر بن ابی شیبہ اور عمرو ناقد نے سفیان بن عیینہ سے حدیث بیان کی ، انھوں نے عمرو اور ابن منکدر سے روایت کی ، انھوں نے کہا : میں نے جابر رضی اللہ عنہ سے سنا ، انھوں نے نبی صلی اللہ علیہ وسلم سے ابن نمیر اور زہیر کی حدیث کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا سُفْيَانُ، عَنْ عَمْرٍو، وَابْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، سَمِعَ جَابِرًا، ح وَحَدَّثَنَاهُ عَمْرٌو النَّاقِدُ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ الْمُنْكَدِرِ، سَمِعْتُ جَابِرًا، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، بِمِثْلِ حَدِيثِ ابْنِ نُمَيْرٍ، وَزُهَيْرٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13763,
                "hadithNumber": "6200",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: While I was asleep I saw myself in Paradise and a woman performing ablution by the side of a palace. I said: For whom is it meant? They said: It is meant for 'Umar bin Khattab رضی اللہ عنہ . (The Holy Prophet) said: There came across my mind the feeling of Umar رضی اللہ عنہ and so I turned back and went away. Abu Huraira رضی اللہ عنہ said: 'Umar رضی اللہ عنہ wept as we were present in that meeting with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) amongst us and Umar رضی اللہ عنہ said: Allah's Messenger, may my father and mother be taken as ransom for you. Could I at all feel any jealousy about you?",
                "hadithUrdu": "آپ نے فر ما یا : \" میں سویا ہوا تھا کہ میں نے خود کو جنت میں دیکھا تو وہاں ایک عورت ، ایک محل کے جانبی حصے میں وضو کر رہی تھی ۔ میں نے پو چھا : یہ کس کا ( محل ) ہے ؟انھوں نے بتا یا یہ عمر خطاب رضی اللہ تعالیٰ عنہ کا ہے ۔ مجھے عمر کی غیر ت یاد آئی تو میں پیٹھ پھیر کر واپس آگیا ۔ \" ابوہریرہ رضی اللہ تعالیٰ عنہ نے کہا : اس پر عمر رضی اللہ تعالیٰ عنہ رونے لگے جبکہ ہم اس مجلس میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے پھر عمر رضی اللہ تعالیٰ عنہ نے کہا : میرے ماں باپ آپ پر قربان !کیا میں آپ پر غیرت کروں گا ؟",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا, یونس نے کہا : ابن شہاب نے انھیں سعید بن مسیب سے خبر دی ، انھوں نے ابو ہریرہ رضی اللہ عنہ سے ، انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، أَنَّ ابْنَ شِهَابٍ، أَخْبَرَهُ عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، أَنَّهُ قَالَ: بَيْنَا أَنَا نَائِمٌ إِذْ رَأَيْتُنِي فِي الْجَنَّةِ، فَإِذَا امْرَأَةٌ تَوَضَّأُ إِلَى جَانِبِ قَصْرٍ، فَقُلْتُ: لِمَنْ هَذَا؟ فَقَالُوا: لِعُمَرَ بْنِ الْخَطَّابِ، فَذَكَرْتُ غَيْرَةَ عُمَرَ، فَوَلَّيْتُ مُدْبِرًا قَالَ أَبُو هُرَيْرَةَ فَبَكَى عُمَرُ، وَنَحْنُ جَمِيعًا فِي ذَلِكَ الْمَجْلِسِ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، ثُمَّ قَالَ عُمَرُ: بِأَبِي أَنْتَ يَا رَسُولَ اللهِ أَعَلَيْكَ أَغَارُ؟",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 13451,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=538",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=536",
                "label": "536",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=537",
                "label": "537",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=538",
                "label": "538",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=539",
                "label": "539",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=540",
                "label": "540",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=541",
                "label": "541",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=542",
                "label": "542",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=540",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=540",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=538",
        "to": 13475,
        "total": 40465
    }
}