{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 353,
        "data": [
            {
                "id": 9089,
                "hadithNumber": "1525",
                "englishNarrator": "Simak bin Harb reported:",
                "hadithEnglish": "I said to Jabir bin Samura رضی اللہ عنہ : Did you sit in the company of the Messenger of Allah (ﷺ)? He said: Yes, very often. He (the Holy Prophet ﷺ) used to sit at the place where he observed the morning or dawn prayer till the sun rose or when it had risen; he would stand, and they (his Companions) would talk about matters (pertaining to the days) of ignorance, and they would laugh (on these matters) while (the Holy Prophet ﷺ) only smiled.",
                "hadithUrdu": "میں نے حضرت جابر بن سمرہ رضی اللہ عنہ سے کہا : کیا آپ رسول اللہ ﷺ کے ساتھ مجالس میں شریک ہوتے تھے؟ کہا : ہاں! بہت ۔ آپ جس جگہ صبح یا دن کے ابتدائی حصے کی نماز ادا فرماتے ، سورج طلوع ہونے تک وہاں سے نہ اٹھتے ۔ جب سورج طلوع ہو جاتا تو اٹھ کھڑے ہوتے ، لوگ دور جاہلیت میں کیے کاموں کے متعلق باتیں کرتے اور ہنستے تھے اور آپ ( بھی ان کی باتیں سن کر ) مسکراتے تھے ۔",
                "urduNarrator": "ہم سے احمد بن عبداللہ بن یونس نے بیان کیا، ہم سے زہیر نے بیان کیا، ان سے سماک نے، کہا ہم سے ح نے بیان کیا اور ہم سے یحییٰ بن یحییٰ نے بیان کیا اور اس کا تلفظ ,ابو حیثمہ نے سماک بن حرب سے روایت کرتے ہوئے خبر دی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللهِ بْنِ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا سِمَاكٌ، ح وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَاللَّفْظُ لَهُ، قَالَ: أَخْبَرَنَا أَبُو خَيْثَمَةَ، عَنْ سِمَاكِ بْنِ حَرْبٍ، قَالَ: قُلْتُ لِجَابِرِ بْنِ سَمُرَةَ: أَكُنْتَ تُجَالِسُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ؟ قَالَ: نَعَمْ كَثِيرًا، «كَانَ لَا يَقُومُ مِنْ مُصَلَّاهُ الَّذِي يُصَلِّي فِيهِ الصُّبْحَ، أَوِ الْغَدَاةَ، حَتَّى تَطْلُعَ الشَّمْسُ، فَإِذَا طَلَعَتِ الشَّمْسُ قَامَ، وَكَانُوا يَتَحَدَّثُونَ فَيَأْخُذُونَ فِي أَمْرِ الْجَاهِلِيَّةِ، فَيَضْحَكُونَ وَيَتَبَسَّمُ».",
                "headingArabic": "فَضْلِ الْجُلُوسِ فِي مُصَلاَّهُ بَعْدَ الصُّبْحِ وَفَضْلِ الْمَسَاجِدِ ‏‏",
                "headingUrdu": "صبح کے بعد جائے نماز میں بیٹھنے کی فضیلت اور مسجد کی فضیلت",
                "headingEnglish": "The virtue of sitting in one’s prayer place after Subh, and the virtue of the masajid",
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9090,
                "hadithNumber": "1526",
                "englishNarrator": "",
                "hadithEnglish": "Simak narrated on the authority of Jabir b. Samura that when the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) observed the dawn prayer, he sat at the place of worship till the sun had risen enough.",
                "hadithUrdu": "سفیان اور زکریا دونوں نے سماک سے اور انھوں نے حضرت جابر بن سمرہ رضی اللہ عنہ سے روایت کی کہ نبی ﷺ جب فجر پڑھتے تھے تو اپنی نماز کی جگہ پر بیٹھے رہتے حتی کہ سورج اچھی طرح نکل آتا ۔",
                "urduNarrator": "",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، قَالَ أَبُو بَكْرٍ: وَحَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، عَنْ زَكَرِيَّاءَ، كِلَاهُمَا عَنْ سِمَاكٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ: «أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا صَلَّى الْفَجْرَ جَلَسَ فِي مُصَلَّاهُ حَتَّى تَطْلُعَ الشَّمْسُ حَسَنًا»",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9091,
                "hadithNumber": "1527",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated by Simak with the same chain of transmitters, but no mention has been made of, enough .",
                "hadithUrdu": "ہم سے قتیبہ اور ابوبکر بن ابی شیبہ نے بیان کیا، کہا, ابواحوص اور شعبہ دونوں نے سماک سے اسی سند کے ساتھ یہی روایت بیان کی لیکن حسنا ‘ ‘ اچھی طرح’’ ( سورج نکل آتا ) نہیں کہا.",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا قُتَيْبَةُ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، قَالَا: حَدَّثَنَا أَبُو الْأَحْوَصِ، ح قَالَ: وَحَدَّثَنَا ابْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، كِلَاهُمَا عَنْ سِمَاكٍ، بِهَذَا الْإِسْنَادِ، وَلَمْ يَقُولَا حَسَنًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9092,
                "hadithNumber": "1528",
                "englishNarrator": "Abu Huraira رضی اللہ عنہٗ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: The parts of land dearest to Allah are its mosques, and the parts most hateful to Allah are markets.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ‘شہروں ‌میں ‌پیاری ‌جگہ ‌اللہ ‌کے ‌نزدیك ‌مسجدیں ‌ہیں ‌ ‌اور ‌ ‘ اللہ کے نزدیک ( انسانی ) آبادیوں کا سب سے ناپسندیدہ حصہ ان کے بازار ہیں ۔ ’’",
                "urduNarrator": "ہم سے ہارون بن معروف اور اسحاق بن موسیٰ الانصاری نے بیان کیا، کہا کہ ہم سے انس بن عیاض نے بیان کیا، مجھ سے ابن ابی ذباب نے بیان کیا، حر کی روایت میں اور انصاری کی حدیث میں حارث نے بیان کیا۔ میں، عبدالرحمٰن بن مہران کی طرف سے،حضرت ابوہریرہ رضی اللہ عنہٗ سے روایت ہے کہ",
                "hadithArabic": "وَحَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، وَإِسْحَاقُ بْنُ مُوسَى الْأَنْصَارِيُّ، قَالَا: حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، حَدَّثَنِي ابْنُ أَبِي ذُبَابٍ، فِي رِوَايَةِ هَارُونَ، وَفِي حَدِيثِ الْأَنْصَارِيِّ، حَدَّثَنِي الْحَارِثُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ مِهْرَانَ، مَوْلَى أَبِي هُرَيْرَةَ، عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «أَحَبُّ الْبِلَادِ إِلَى اللهِ مَسَاجِدُهَا، وَأَبْغَضُ الْبِلَادِ إِلَى اللهِ أَسْوَاقُهَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9093,
                "hadithNumber": "1529",
                "englishNarrator": "Abu Sa'id al-Khudri رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When there are three persons, one of them should lead them. The one among them most worthy to act as Imam is one who is best versed in the Qur'an.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ‘ ‘ جب ( نماز پڑھنے والے ) تین ہوں تو ان میں سے ایک ان کی امامت کرائے اور ان میں سے امامت کا زیادہ حقدار وہ ہے جو ان میں سے زیادہ ( قرآن ) پڑھا ہو ۔ ’’",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, ابوعوانہ نے ہمیں قتادہ سے حدیث سنائی ، انھوں نے ابو نضرہ سے اور انھوں نے حضرت ابوسعید خدری رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا كَانُوا ثَلَاثَةً فَلْيَؤُمَّهُمْ أَحَدُهُمْ، وَأَحَقُّهُمْ بِالْإِمَامَةِ أَقْرَؤُهُمْ».",
                "headingArabic": "مَنْ أَحَقُّ بِالإِمَامَةِ",
                "headingUrdu": "نماز کی امامت کا زیادہ حقدار کون ہے۔",
                "headingEnglish": "Who is more entitled to lead the prayer",
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9094,
                "hadithNumber": "1530",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been narrated by Qatida with the same chain of transmitters.",
                "hadithUrdu": "ہم سے محمد بن بشار نے بیان کیا، کہا ہم سے یحییٰ بن سعید نے بیان کیا, شعبہ ، سعید بن ابی عروبہ اور معاذ ( بن ہشام ) نے اپنے والد کے واسطے سے ، سب نے قتادہ سے اپنے اپنے شاگردوں کی اسی سند کے ساتھ اس کے مانند روایت بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ، عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، ح وَحَدَّثَنِي أَبُو غَسَّانَ الْمِسْمَعِيُّ، حَدَّثَنَا مُعَاذٌ وَهُوَ ابْنُ هِشَامٍ، حَدَّثَنِي أَبِي، كُلُّهُمْ عَنْ قَتَادَةَ، بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9095,
                "hadithNumber": "1531",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated by Abu Sa'id al-Khudri رضی اللہ عنہ by another chain of transmitters.",
                "hadithUrdu": "ہم سے محمد بن المثنیٰ نے بیان کیا، ہم سے سالم بن نوح نے بیان کیا، ہم سے حسن بن عیسیٰ نے بیان کیا، ہم سے ابن المبارک نے بیان کیا، جریدی نے ابو نضرہ سے ، انھوں نے حضرت ابوسعید رضی اللہ عنہ سے اور انھوں نے نبی ﷺ سے اسی طرح روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا سَالِمُ بْنُ نُوحٍ، ح وَحَدَّثَنَا حَسَنُ بْنُ عِيسَى، حَدَّثَنَا ابْنُ الْمُبَارَكِ، جَمِيعًا عَنِ الْجُرَيْرِيِّ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9096,
                "hadithNumber": "1532",
                "englishNarrator": "Abu Mas'ud al-Ansari رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The one who is most versed in Allah's Book should act as Imam for the people, but If they are equally versed in reciting it, then the one who has most knowledge regarding Sunnah if they are equal regarding the Sunnah, then the earliest one to emigrate; it they emigrated at the same time, then the earliest one to embrace Islam. No man must lead another in prayer where (the latter) has authority, or sit in his place of honour in his house, without his permission. Ashajj in his narration used the word, age in place of Islam .",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ‘ ‘ لوگوں کی امامت وہ کرائے جو ان میں سے کتاب اللہ کو زیادہ پڑھنے والا ہو ، اگر پڑھنے میں برابر ہو ں تو وہ جو ان میں سے سنت کا زیادہ عالم ہو ، اگر وہ سنت ( کے علم ) میں بھی برابر ہوں تو وہ جس نے ان سب کی نسبت پہلے ہجرت کی ہو ، اگر وہ ہجرت میں برابر ہوں تو وہ جو اسلام قبول کرنے میں سبقت رکھتا ہو ۔ کوئی انسان وہاں دوسرے انسان کی امامت نہ کرے جہاں اس ( دوسرے ) کا اختیار ہو اور اس کے گھر میں اس کی قابل احترام نشست پر اس کی اجازت کے بغیر کوئی نہ بیٹھے ۔ ’’ ( ابوسعید ) اشج نے اپنی روایت میں ’’اسلام قبول کرنے میں’’ ( سبقت ) کے بجائے ’’عمر میں’’ ( سبقت ) رکھتا ہے",
                "urduNarrator": "ابوبکر بن ابی شیبہ اور ابوسعید اشج نے ابو خالد احمر سے ، انھوں نے اوس بن ضمعج سے اور انھوں نے حضرت ابو مسعود انصاری رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو سَعِيدٍ الْأَشَجُّ، كِلَاهُمَا عَنْ أَبِي خَالِدٍ، قَالَ أَبُو بَكْرٍ: حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ، عَنِ الْأَعْمَشِ، عَنْ إِسْمَاعِيلَ بْنِ رَجَاءٍ، عَنْ أَوْسِ بْنِ ضَمْعَجٍ، عَنْ أَبِي مَسْعُودٍ الْأَنْصَارِيِّ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «يَؤُمُّ الْقَوْمَ أَقْرَؤُهُمْ لِكِتَابِ اللهِ، فَإِنْ كَانُوا فِي الْقِرَاءَةِ سَوَاءً، فَأَعْلَمُهُمْ بِالسُّنَّةِ، فَإِنْ كَانُوا فِي السُّنَّةِ سَوَاءً، فَأَقْدَمُهُمْ هِجْرَةً، فَإِنْ كَانُوا فِي الْهِجْرَةِ سَوَاءً، فَأَقْدَمُهُمْ سِلْمًا، وَلَا يَؤُمَّنَّ الرَّجُلُ الرَّجُلَ فِي سُلْطَانِهِ، وَلَا يَقْعُدْ فِي بَيْتِهِ عَلَى تَكْرِمَتِهِ إِلَّا بِإِذْنِهِ» قَالَ الْأَشَجُّ فِي رِوَايَتِهِ: مَكَانَ سِلْمًا سِنًّا،",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9097,
                "hadithNumber": "1533",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been narrated by A'mash by the same chain of transmitters",
                "hadithUrdu": "ہم سے ابو کریب نے بیان کیا, ابو معاویہ ، جریر ، ابن فضیل اور سفیان سب نے اعمش سے اسی سند کے ساتھ اسی مانند روایت بیان کی ہے",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح وَحَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا جَرِيرٌ، وَأَبُو مُعَاوِيَةَ، ح وَحَدَّثَنَا الْأَشَجُّ، حَدَّثَنَا ابْنُ فُضَيْلٍ، ح وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، كُلُّهُمْ عَنِ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9098,
                "hadithNumber": "1534",
                "englishNarrator": "Abu Mas'ud al-Ansari رضی اللہ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to us: The one who is well grounded in Allah's Book and is distinguished among them in recitation should act as; Imam for the people. and if they are equally versed in reciting it, then the one who has most knowledge regarding Sunnah; if they are equal regarding the Sunnah, then the earliest one to emigrate; If they emigrated at the same time, then the oldest one in age. No man must lead another in prayer in latter's house or where (the latter) has authority, or sit in his place of honour in his house, except that he gives you permission or with his permission.",
                "hadithUrdu": "رسول اللہ ﷺ نے ہم سے کہا : ‘ ‘ قوم کی امامت وہ کرے جو اللہ کی کتاب کو زیادہ پڑھنے والا اور پڑھنے میں دوسروں سے زیادہ قدیم ہو ، اگر ان سب کا پڑھنا ایک سا ہو تو وہ امامت کرے جو ہجرت میں قدیم تر ہو ، اگر ہجرت میں سب برابر ہوں تو وہ امامت کرے جو ان سب سے عمر میں بڑا ہو اور تم کسی شخص کے گھر اور اس کے دائرہ اختیار میں اس کے امام نہ ہی اس کے گھر میں اس کی قابل احترام نشست پر بیٹھو ، ہاں اس صورت میں کہ وہ تمھیں ( اس بات کی ) اجازت دے-یا ( فرمایا : ) اس کی اجازت سے ۔ ’’",
                "urduNarrator": "ہم سے محمد بن مثنیٰ اور ابن بشار نے بیان کیا، انہوں نے کہا: ہم سے محمد بن جعفر نے بیان کیا, شعبہ نے اسماعیل بن رجاء سے روایت کی ، کہا : میں نے اوس بن ضمعج سے سنا ، کہتے تھے : میں نے حضرت ابو مسعود رضی اللہ عنہ سے سنا ، وہ کہتے تھے",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَ ابْنُ الْمُثَنَّى: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ شُعْبَةَ، عَنْ إِسْمَاعِيلَ بْنِ رَجَاءٍ، قَالَ: سَمِعْتُ أَوْسَ بْنَ ضَمْعَجٍ، يَقُولُ: سَمِعْتُ أَبَا مَسْعُودٍ، يَقُولُ: قَالَ لَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «يَؤُمُّ الْقَوْمَ أَقْرَؤُهُمْ لِكِتَابِ اللهِ، وَأَقْدَمُهُمْ قِرَاءَةً، فَإِنْ كَانَتْ قِرَاءَتُهُمْ سَوَاءً، فَلْيَؤُمَّهُمْ أَقْدَمُهُمْ هِجْرَةً، فَإِنْ كَانُوا فِي الْهِجْرَةِ سَوَاءً، فَلْيَؤُمَّهُمْ أَكْبَرُهُمْ سِنًّا، وَلَا تَؤُمَّنَّ الرَّجُلَ فِي أَهْلِهِ، وَلَا فِي سُلْطَانِهِ، وَلَا تَجْلِسْ عَلَى تَكْرِمَتِهِ فِي بَيْتِهِ إِلَّا أَنْ يَأْذَنَ لَكَ، أَوْ بِإِذْنِهِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9099,
                "hadithNumber": "1535",
                "englishNarrator": "Malik bin Huwairith رضی اللہ عنہ reported:",
                "hadithEnglish": "We came to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and we were all young men of nearly equal age. We stayed with him (the Holy Prophet) for twenty nights, and as the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was extremely kind and tender of heart, he therefore, thought that we were eager (to see) our family (we felt homesick). So he asked us about the members of the family that we had left behind and when we informed him, he said: Go back to your family, stay with them, and teach them (beliefs and practices of Islam) and exhort them to good, and when the time for prayer comes, one amongst you should announce Adhan and then the oldest among you should lead the prayer.",
                "hadithUrdu": "ہم رسول اللہ ﷺ کی خدمت میں حاضر ہوئے اور ہم سب نوجوان اور ہم عمر تھے ، ہم نے آپ کے پاس بیس راتیں قیام کیا ۔ اللہ کے رسول ﷺ بہت مہربان اور نرم دل تھے ، آپ نے خیال فرمایا کہ ہمیں گھر والوں کے پاس جانے کا اشتیاق ہو گا ، آپ نے ہم سے ہمارے ان گھر والوں کے بارے میں سوال کیا جنھیں ہم چھوڑ آئے تھے ، ہم نے آپ کو بتایا تو آپ نے فرمایا : ‘ ‘ اپنے گھر والوں کے پاس لوٹ جاؤ ، انھی کے درمیان رہو ، انھیں تعلیم دو اور انھیں ( اچھائی پر چلنے کا ) حکم دو ، چنانچہ جب نماز کا وقت آئے تو ایک آدمی تم سب کے لئے اذان کہے ، پھر تم میں سے ( جو عمر میں ) سب سے بڑا ہو وہ تمھاری امامت کرے ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب نے کہا, اسماعیل بن ابراہیم ( ابن علیہ ) نے ہمیں حدیث بیان کی ، کہا : ہم سے ایوب نے ابو قلابہ سے حدیث بیان کی ، انھوں نے مالک بن حویرث رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي قِلَابَةَ، عَنْ مَالِكِ بْنِ الْحُوَيْرِثِ، قَالَ: أَتَيْنَا رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ شَبَبَةٌ مُتَقَارِبُونَ، فَأَقَمْنَا عِنْدَهُ عِشْرِينَ لَيْلَةً، وَكَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ رَحِيمًا رَقِيقًا، فَظَنَّ أَنَّا قَدِ اشْتَقْنَا أَهْلَنَا، فَسَأَلَنَا عَنْ مَنْ تَرَكْنَا مِنْ أَهْلِنَا، فَأَخْبَرْنَاهُ، فَقَالَ: «ارْجِعُوا إِلَى أَهْلِيكُمْ، فَأَقِيمُوا فِيهِمْ وَعَلِّمُوهُمْ، وَمُرُوهُمْ فَإِذَا حَضَرَتِ الصَّلَاةُ فَلْيُؤَذِّنْ لَكُمْ أَحَدُكُمْ، ثُمَّ لِيَؤُمَّكُمْ أَكْبَرُكُمْ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9100,
                "hadithNumber": "1536",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been transmitted by Ayyub رضی اللہ عنہ with the same chain of narrator.",
                "hadithUrdu": "ہم سے ابو الربیع الزہرانی اور خلف بن ہشام نے بیان کیا، کہا: ہم سے حماد نے ایوب رضی اللہ عنہ سے اس سند کے ساتھ بیان کیا۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، وَخَلَفُ بْنُ هِشَامٍ، قَالاَ حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، بِهَذَا الإِسْنَادِ ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9101,
                "hadithNumber": "1537",
                "englishNarrator": "Malik bin Huwairith Abu Sulaiman رضی اللہ عنہ reported:",
                "hadithEnglish": "I came to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) along with other persons and we were young men of nearly equal age, and the rest of the hadith was transmitted like the hadith narrated before.",
                "hadithUrdu": "میں کچھ لوگوں ( کی معیت ) میں رسول اللہ ﷺ کے پاس حاضر ہوا ، ہم تقریبا ہم عمر نوجوان تھے......آگے دونوں ( حماد اور عبدالوہاب ) نے ابن علیہ کی حدیث کی طرح حدیث بیان کی ۔",
                "urduNarrator": "اور یہی حدیث ہمیں ابن ابی عمر نے سنائی ، کہا : عبدالوہاب نے بھی ایوب سے ہمیں حدیث بیان کی ، کہا : مجھ سے ابو قلابہ نے بیان کیا ، کہا : ہمیں ابو سلیمان مالک بن حویرث رضی اللہ عنہ نے حدیث سنائی ، کہا",
                "hadithArabic": "وَحَدَّثَنَاهُ ابْنُ أَبِي عُمَرَ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، عَنْ أَيُّوبَ، قَالَ: قَالَ لِي أَبُو قِلَابَةَ، حَدَّثَنَا مَالِكُ بْنُ الْحُوَيْرِثِ أَبُو سُلَيْمَانَ، قَالَ: أَتَيْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي نَاسٍ، وَنَحْنُ شَبَبَةٌ مُتَقَارِبُونَ، وَاقْتَصَّا جَمِيعًا الْحَدِيثَ بِنَحْوِ حَدِيثِ ابْنِ عُلَيَّةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9102,
                "hadithNumber": "1538",
                "englishNarrator": "Malik bin Huwairith رضی اللہ عنہ reported:",
                "hadithEnglish": "I came to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) along with a companion of mine, and when we intended to return from him, he said: When there is time for prayer, announce prayer, pronounce Iqama, and the oldest amongst you should lead the prayer.",
                "hadithUrdu": "میں اور میرا ساتھی نبی ﷺ کی خدمت میں حاضر ہوئے ، جب ہم نے آپ کے ہاں سے واپسی کا ارادہ کیا تو آپ نے ہم سے فرمایا : ‘ ‘ جب نماز ( کا وقت ) آئے تو اذان کہو ، پھر اقامت کہو اور تم دونوں میں جو بڑا ہو وہ تمھاری امامت کر لے ۔ ’’",
                "urduNarrator": "مجھ سے اسحاق بن ابراہیم الحنظَلی نے بیان کیا، انہوں نے ہم سے بیان کیا, عبدالوہاب ثقفی نے خالد حذاء سے ، انھوں نے ابو قلابہ سے اور انھوں نے حضرت مالک بن حویرث رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ أَبِي قِلَابَةَ، عَنْ مَالِكِ بْنِ الْحُوَيْرِثِ، قَالَ: أَتَيْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَا وَصَاحِبٌ لِي، فَلَمَّا أَرَدْنَا الْإِقْفَالَ مِنْ عِنْدِهِ، قَالَ لَنَا: «إِذَا حَضَرَتِ الصَّلَاةُ، فَأَذِّنَا، ثُمَّ أَقِيمَا، وَلْيَؤُمَّكُمَا أَكْبَرُكُمَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9103,
                "hadithNumber": "1539",
                "englishNarrator": "It was narrated from Hafs, Ibn Ghiyath \"Khalid Al-Hadhdha\" narrated it to us with this chain.\" And he added: \"Al Hadhdha' said:",
                "hadithEnglish": "'And they were similar with (knowledge of) the Quran .",
                "hadithUrdu": "دونوں قراءت میں ایک جیسے تھے ۔",
                "urduNarrator": "ہم سے ابوسعید اشج نے بیان کیا، ان سےحفص بن غیاث نے  خالد حذاء سے اسی سند کے ساتھ روایت کی اور ( اپنی روایت میں ) یہ اضافہ کیا کہ حذاء نے کہا",
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو سَعِيدٍ الْأَشَجُّ، حَدَّثَنَا حَفْصٌ يَعْنِي ابْنَ غِيَاثٍ، حَدَّثَنَا خَالِدٌ الْحَذَّاءُ بِهَذَا الْإِسْنَادِ، وَزَادَ قَالَ الْحَذَّاءُ: وَكَانَا مُتَقَارِبَيْنِ فِي الْقِرَاءَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9104,
                "hadithNumber": "1540",
                "englishNarrator": "Abu Salama bin Abdul-Rahman bin 'Auf heard Abu Huraira رضی اللہ عنہ say:",
                "hadithEnglish": "(When) Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) (wished to invoke curse or blessing on someone, he would do so at the end) of the recitation in the dawn prayer, when he had pronounced Allah-o-Akbar (for bending) and then lifted his head (saying): Allah listened to him who praised Him; our Lord! to Thee is all praise ; he would then stand up and say: Rescue al-Walid b. Walid, Salama bin Hisham, and 'Ayyash bin Abd Rabi'a, and the helpless among the Muslims. O Allah! trample severely Mudar and cause them a famine (which broke out at the time) of Joseph. O Allah! curse Lihyan, Ri'l, Dhakwan, 'Usayya, for they disobeyed Allah and His Messenger. (The narrator then adds): The news reached us that he abandoned (this) when this verse was revealed: Thou but no concern in the matter whether He turns to them (mercifully) or chastises them; surely they are wrongdoers (ill. 127)",
                "hadithUrdu": "رسول اللہ ﷺ جب نماز فجر کی قراءت سے فارغ ہوتے اور ( رکوع میں جانے کے لیے ) تکبیر کہتے تو سر اٹھانے کے بعد سمع اللہ لمن حمدہ ربنا ولک الحمد ( اللہ نے سن لیا جس نے اس کی حمد کی ، اے ہمارے رب! اور ٰحمدتیرے ہی لیے ہے ) کہتے ، پھر حالت قیام ہی میں آپ فرماتے : ‘ ‘ اے اللہ!ولید بن ولید ، سلمہ بن ہشام ، عیاش بن ابی ربیعہ اور مومنوں میں سے ان لوگوں کو جنھیں ( کافروں نے ) کمزور پایا ، نجات عطا فرما ۔ اے اللہ!قبیلہ مضر پر اپنے روندنے کو سخت کر ، ان پر اپنے اس مؤاخذے کو یوسف علیہ السلام کے زمانے کے قحط کی طرح کر د ۔ اے اللہ! الحیان ، رعل ، ذکوان اور عصیہ پر ، جنھوں نے اللہ اور اس کے رسول کی نافرمانی کی ، لعنت نازل کر ۔ ’’پھر ہم تک یہ بات پہنچی کہ اس کے بعد جب آپ پر یہ آیت اتری : ‘ ‘ آپ کا اس معاملے سے کوئی سروکار نہیں ، ( اللہ تعالیٰ ) چاہے ان کو توبہ کا موقع عطا کرے ، چاہے ان کو عذاب دے کہ و ہ یقینا ظلم کرنے والے ہیں’’ تو آپ نے یہ دعا چھوڑ دی ۔",
                "urduNarrator": "مجھ سے ابو الطاہر اور حَرملہ بن یحییٰ نے بیان کیا، کہا کہ ہم سے ابن وہب نے بیان کیا, یونس بن یزید نے ابن شہاب سے روایت کرتے ہوئے خبر دی ، کہا : مجھے سعید بن مسیب اور ابو سلمہ بن عبدالرحمن بن عوف نے بتایا کہ ان دونوں نے حضرت ابوہریرہ رضی اللہ عنہ کو یہ کہتے ہوئے سنا کہ",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، قَالَا: أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ بْنُ يَزِيدَ، عَنِ ابْنِ شِهَابٍ، قَالَ: أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيِّبِ، وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَنَّهُمَا سَمِعَا أَبَا هُرَيْرَةَ، يَقُولُ: كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ حِينَ يَفْرُغُ مِنْ صَلَاةِ الْفَجْرِ مِنَ الْقِرَاءَةِ، وَيُكَبِّرُ وَيَرْفَعُ رَأْسَهُ: «سَمِعَ اللهُ لِمَنْ حَمِدَهُ، رَبَّنَا وَلَكَ الْحَمْدُ»، ثُمَّ يَقُولُ وَهُوَ قَائِمٌ: «اللهُمَّ أَنْجِ الْوَلِيدَ بْنَ الْوَلِيدِ، وَسَلَمَةَ بْنَ هِشَامٍ، وَعَيَّاشَ بْنَ أَبِي رَبِيعَةَ وَالْمُسْتَضْعَفِينَ مِنَ الْمُؤْمِنِينَ، اللهُمَّ اشْدُدْ وَطْأَتَكَ عَلَى مُضَرَ وَاجْعَلْهَا عَلَيْهِمْ كَسِنِي يُوسُفَ، اللهُمَّ الْعَنْ لِحْيَانَ، وَرِعْلًا، وَذَكْوَانَ، وَعُصَيَّةَ عَصَتِ اللهَ وَرَسُولَهُ»، ثُمَّ بَلَغَنَا أَنَّهُ تَرَكَ ذَلِكَ لَمَّا أُنْزِلَ: {لَيْسَ لَكَ مِنَ الْأَمْرِ شَيْءٌ أَوْ يَتُوبَ عَلَيْهِمْ أَوْ يُعَذِّبَهُمْ فَإِنَّهُمْ ظَالِمُونَ.",
                "headingArabic": "استحباب القنوت فى جميع الصلوات،إذا نزلت بالمسلمين نازلة والعياذ بِاللهِ واستحبابه في الصبح دائمًا وبيان أن محله بعد رفع الرأس من الركوع في الركعة الأخيرة واستحباب الجهر به",
                "headingUrdu": "اگر مسلمانوں پر کوئی آفت آجائے تو تمام نمازوں میں قنوت پڑھنا مستحب ہے - اور اللہ سے پناہ مانگی جاتی ہے۔ ہر وقت سُبْح میں قنوت کہنا مستحب ہے۔ اور صراحت کہ آخری رکعت میں رکوع سے سر اٹھانے کے بعد کہا جائے اور بلند آواز سے کہنا مستحب ہے",
                "headingEnglish": "It is recommended to say qunut in all prayers if a calamity befalls the Muslims – and refuge is sought from Allah (regarding that). It is recommended to say qunut in Subh at all times. And the clarification that it is to be said after raising the head from bowing in the final rak`ah, and it is recommended to say it out loud",
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9105,
                "hadithNumber": "1541",
                "englishNarrator": "This hadith has been narrated on the authority of Abu Huraira رضی اللہ عنہ by another chain of transmitters up to the words:",
                "hadithEnglish": "And cause them a famine like that (which broke out at the time) of Joseph, but the subsequent portion was not mentioned.",
                "hadithUrdu": "‘ ‘ اس سختی کو ان پر یوسف علیہ السلام کے زمانے کے قحط کی طرح کر دے’’ جو اس کے بعد ہے اسے بیان نہیں کیا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور عمرو ناقد نے بیان کیا، انہوں نے کہا, ابن عینیہ نے زہری سے ، انھوں نے سعید بن مسیب سے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے اور انھوں نے نبی ﷺ سے ان الفاظ تک روایت کی",
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، قَالَا: حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِلَى قَوْلِهِ: «وَاجْعَلْهَا عَلَيْهِمْ كَسِنِي يُوسُفَ» وَلَمْ يَذْكُرْ مَا بَعْدَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9106,
                "hadithNumber": "1542",
                "englishNarrator": "Abu Salama reported it on the authority of Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) recited Qunut after ruku' in prayer for one mouth at the time of reciting (these words): Allah listened to him who praised Him, and he said in Qunut: 0 Allah! rescue al-Walid bin al-Walid; O Allah! rescue Salama b. Hisham; O Allah! rescue 'Ayyash bin Abu Rabi'a; O Allah! rescue the helpless amongst the Muslims; O Allah! trample Mudar severely; O Allah! cause them a famine like that (which was caused at the time) of Joseph. Abu Huraira رضی اللہ عنہ (further) said: I saw that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) afterwards abandoned this supplication. I, therefore said: I see the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) abandoning this blessing upon them. It was raid to him (Abu Huraira): Don't you see that (those for whom was blessing invoked by the Holy Prophet) have come (i. e. they have been rescued)?",
                "hadithUrdu": "نبی ﷺ نے ایک مہینے تک رکوع کے بعد قنوت ( عاجزی سے دعا ) کی ، جب آپ سمع اللہ لمن حمدہ کہہ لیتے ( تو ) اپنی قنوت میں یہ ( الفاظ ) کہتے : اے اللہ! ولید بن ولیدکو نجات دے ، اے اللہ عیاش بن ابی ربیعہ کو نجات دے ، اے اللہ کمزور سمجھے جانے والے ( دوسرے ) مومنوں کو نجات عطا کر ، اے اللہ ! ان پر اپنے روندنے کو سخت تر کر اور اسے ان پر ، یوسف علیہ السلام کے ( زمانے کے ) قحط کے مانند کر دے ۔ ’’ مسجدوں اور نماز کی جگہوں کے احکام ابوہریرہ رضی اللہ عنہ نے کہا : پھر میں نے رسول اللہ ﷺ کو دیکھا کہ آپ نے یہ دعا چھوڑ دی ، میں نے ( ساتھیوں سے ) کہا : میں دیکھتا ہوں کہ رسول اللہ ﷺ نے یہ دعا چھوڑ دی ہے ۔ کہا : ( جواب میں ) مجھ سے کہا گیا ، تم انھیں دیکھتے نہیں ، ( جن کے لیے دعا ہوئی تھی ) وہ سب آچکے ہیں ۔",
                "urduNarrator": "ہم سے محمد بن مہران الرازی نے بیان کیا، کہا ہم سے ولید بن مسلم نے بیان کیا، ہمیں اوزاعی نے یحییٰ بن ابی کثیر سے حدیث سنائی ، انھوں نے ابو سلمہ سے روایت کی کہ حضرت ابوہریرہ رضی اللہ عنہ نے انھیں حدیث بیان کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مِهْرَانَ الرَّازِيُّ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا الْأَوْزَاعِيُّ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، أَنَّ أَبَا هُرَيْرَةَ، حَدَّثَهُمْ أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَنَتَ بَعْدَ الرَّكْعَةِ فِي صَلَاةٍ شَهْرًا، إِذَا قَالَ: «سَمِعَ اللهُ لِمَنْ حَمِدَهُ»، يَقُولُ فِي قُنُوتِهِ: «اللهُمَّ أَنْجِ الْوَلِيدَ بْنَ الْوَلِيدَ، اللهُمَّ نَجِّ سَلَمَةَ بْنَ هِشَامٍ، اللهُمَّ نَجِّ عَيَّاشَ بْنَ أَبِي رَبِيعَةَ، اللهُمَّ نَجِّ الْمُسْتَضْعَفِينَ مِنَ الْمُؤْمِنِينَ، اللهُمَّ اشْدُدْ وَطْأَتَكَ عَلَى مُضَرَ، اللهُمَّ اجْعَلْهَا عَلَيْهِمْ سِنِينَ كَسِنِي يُوسُفَ» قَالَ أَبُو هُرَيْرَةَ: ثُمَّ رَأَيْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ تَرَكَ الدُّعَاءَ بَعْدُ، فَقُلْتُ: أُرَى رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَدْ تَرَكَ الدُّعَاءَ لَهُمْ، قَالَ: فَقِيلَ: وَمَا تُرَاهُمْ قَدْ قَدِمُوا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9107,
                "hadithNumber": "1543",
                "englishNarrator": "Abu Salama narrated that Abu Huraira رضی اللہ عنہ told him:",
                "hadithEnglish": "When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) pronounced: Allah listened to him who praised Him. and before prostration, he would recite this in the 'Isya' prayer: O Allah! rescue 'Ayyash bin Abu Rabi'a, and the rest of the hadith is the same as narrated by Auza'i to the words: Like the famine (at the time) if Joseph. but he made no mention of that which follows afterwards.",
                "hadithUrdu": "( ایک روز ) رسول اللہ ﷺ عشاء کی نماز پڑھ رہے تھے ، جب آپ نے فرمایا : سمع اللہ لمن حمدہ تو سجدے میں جانے سے پہلے آپ نے ( دعا مانگتے ہوئے ) فرمایا : ‘ ‘ اے اللہ عیاش بن ابی ربیعہ کو نجات عطا فرما ۔ ’’ کے الفاظ تک اوزاعی کی روایت کردہ حدیث کی طرح حدیث بیان کی ، بعد کے الفاظ بیان نہیں کیےاوزاعی کے بجائے ) شیبان نے یحییٰ سے ، انھوں نے ابوسلمہ سے روایت کی.",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، ہم سے حسین بن محمد نے بیان کیا، ہم سے شیبان نے بیان کیا، وہ یحییٰ سے، ابو سلمہ رضی اللہ عنہ سےکہ حضرت ابوہریرہ رضی اللہ عنہ نے انھیں خبر دی کہ",
                "hadithArabic": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا حُسَيْنُ بْنُ مُحَمَّدٍ، حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، أَنَّ أَبَا هُرَيْرَةَ، أَخْبَرَهُ أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَيْنَمَا هُوَ يُصَلِّي الْعِشَاءَ، إِذْ قَالَ: «سَمِعَ اللهُ لِمَنْ حَمِدَهُ»، ثُمَّ قَالَ قَبْلَ أَنَّ يَسْجُدَ: «اللهُمَّ نَجِّ عَيَّاشَ بْنَ أَبِي رَبِيعَةَ»، ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ الْأَوْزَاعِيِّ إِلَى قَوْلِهِ كَسِنِي يُوسُفَ، وَلَمْ يَذْكُرْ مَا بَعْدَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9108,
                "hadithNumber": "1544",
                "englishNarrator": "Abu Salama bin 'Abdul-Rahman is reported to have said that he had heard Abu Huraira رضی اللہ عنہ saying:",
                "hadithEnglish": "I would say prayer along with you which is near to the prayer of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). and Abu Huraira رضی اللہ عنہ recited Qunut in the noon and in the 'Isya' and in the morning prayer, and invoked blessing (of Allah) upon Muslims-and curse upon the unbelievers.",
                "hadithUrdu": "اللہ کی قسم! ضرور رسول اللہ ﷺ کی نماز کو تم لوگوں کے بہت قریب کروں گا ، اس کے بعد حضرت ابوہریرہ رضی اللہ عنہ ظہر ، عشاء اور صبح کی نماز میں قنوت کرتے اور مسلمانوں کے حق میں ‌رضی ‌اللہ ‌عنہ ‌ ‌ دعا کرتے اور کافروں پر لعنت بھیجتے.",
                "urduNarrator": "ہم سے محمد بن المثنیٰ نے بیان کیا، ہم سے معاذ بن ہشام نے بیان کیا، ان سے میرے والد نے بیان کیا، ان سے یحییٰ بن ابی کثیر نے بیان کیا، انہوں نے کہا, ابو سلمہ بن عبدالرحمان نے حضرت ابوہریرہ رضی اللہ عنہ کو یہ کہتے ہوئے سنا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنِي أَبِي، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، قَالَ: حَدَّثَنَا أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ: وَاللهِ لَأُقَرِّبَنَّ بِكُمْ صَلَاةَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَكَانَ أَبُو هُرَيْرَةَ «يَقْنُتُ فِي الظُّهْرِ، وَالْعِشَاءِ الْآخِرَةِ، وَصَلَاةِ الصُّبْحِ، وَيَدْعُو لِلْمُؤْمِنِينَ، وَيَلْعَنُ الْكُفَّارَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9109,
                "hadithNumber": "1545",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) invoked curse in the morning (prayer) for thirty days upon those who killed the Companions (of the Holy Prophet) at Bi'r Ma'una. He cursed (the tribes) of Ri'l, Dhakwan, Lihyan, and Usayya, who had disobeyed Allah and His Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). Anas رضی اللہ عنہ said: Allah the Exalted and Great revealed (a verse) regarding those who were killed at Bi'r Ma'una, and we recited it, till it was abrogated later on (and the verse was like this):, convey to it our people the tidings that we have met our Lord, and He was pleased with us and we were pleased with Him .",
                "hadithUrdu": "رسول اللہ ﷺ نے ان لوگوں کے خلاف کنھوں نے بئر معونہ والوں کو قتل کیا تھا ، تیس ( دن تک ) صبح ( کی نمازوں ) میں بدعا کی ۔ آپ نے رعل ، ذکوان ، لحیان اور عصیہ کے خلاف ، جنھوں نے اللہ اور اس کے رسول کی نافرمانی کی ، بد دعا کی ۔ انس رضی اللہ عنہ نے کہا : اللہ نے ان لوگوں کے متعلق جو بئر معونہ پر قتل ہوئے ، قرآن ( کا کچھ حصہ ) نازل فرمایا جو بعد میں منسوخ ہو نے تک ہم پڑھتے رہے ( اس میں شہداء کا پیغام تھا ) کہ ہماری قوم کو بتا دیں کہ ہم اپنے رب سے جا ملے ہیں ، وہ ہم سے راضی ہو گیا ہے اور ہم اس سے راضی ہیں ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا: میں نے مالک رضی اللہ عنہ سے پڑھا,  اسحاق بن عبداللہ بن ابی طلحہ نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ: «دَعَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى الَّذِينَ قَتَلُوا أَصْحَابَ بِئْرِ مَعُونَةَ ثَلَاثِينَ صَبَاحًا، يَدْعُو عَلَى رِعْلٍ، وَذَكْوَانَ، وَلِحْيَانَ، وَعُصَيَّةَ عَصَتِ اللهِ وَرَسُولَهُ» قَالَ أَنَسٌ: أَنْزَلَ اللهُ عَزَّ وَجَلَّ فِي الَّذِينَ قَتَلُوا بِبِئْرِ مَعُونَةَ قُرْآنًا قَرَأْنَاهُ حَتَّى نُسِخَ بَعْدُ: أَنْ بَلِّغُوا قَوْمَنَا أَنْ قَدْ لَقِينَا رَبَّنَا فَرَضِيَ عَنَّا وَرَضِينَا عَنْهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9110,
                "hadithNumber": "1546",
                "englishNarrator": "Muhammad reported:",
                "hadithEnglish": "I asked Anas رضی اللہ عنہ whether the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) observed Qunut in the dawn prayer. He said: Yes, (he did so) after the ruku', for a short while.",
                "hadithUrdu": "میں نے حضرت انس بن مالک رضی اللہ عنہ سے پوچھا :  کیا رسول اللہ ﷺ نے ( کبھی ) صبح کی نماز میں قنو ت کی تھی؟ کہا : ہاں ، رکوع سے تھوڑی دیر بعد ۔",
                "urduNarrator": "مجھ سے عمرو ناقد اور زہیر بن حرب نے بیان کیا، کہا: ہم سے اسماعیل نے ایوب کی سند سے بیان کیا, محمد ( بن سیرین ) سے روایت ہے ، کہا",
                "hadithArabic": "وَحَدَّثَنِي عَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالَا: حَدَّثَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، قَالَ: قُلْتُ لِأَنَسٍ: هَلْ قَنَتَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي صَلَاةِ الصُّبْحِ؟ قَالَ: نَعَمْ، بَعْدَ الرُّكُوعِ يَسِيرًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9111,
                "hadithNumber": "1547",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) observed Qunut for a month in the dawn prayer after ruku' and invoked curse upon Ri'l, Dhakwan, and said that 'Usayya had disobeyed Allah and His Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌).",
                "hadithUrdu": "رسول اللہ ﷺ نے ایک مہینے تک صبح کی نماز میں رکوع کے بعد قنوت کی ، آپ رعل اور ذکوان کے خلاف بددعا فرماتے تھے اور کہتے تھے : ‘ ‘ عصیہ نے اللہ اور اس کے رسول کی نافرمانی کی ۔ ’’",
                "urduNarrator": "مجھ سے عبید اللہ بن معاذ العنبری، ابو کریب، اسحاق بن ابراہیم اور محمد بن عبد الاعلٰی نے بیان کیا، اور یہ قول ابن معاذ معمر بن سلیمان نے اپنے والد سے نقل کیا ہے, ابو مجلز نے حضرت انس رضی اللہ عنہ سے روایت کو کہ",
                "hadithArabic": "وَحَدَّثَنِي عُبَيْدُ اللهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، وَأَبُو كُرَيْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى، وَاللَّفْظُ لِابْنِ مُعَاذٍ، حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ، عَنْ أَبِيهِ، عَنْ أَبِي مِجْلَزٍ، عَنْ أَنَسِ بْنِ مَالِكٍ: قَنَتَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ شَهْرًا بَعْدَ الرُّكُوعِ فِي صَلَاةِ الصُّبْحِ يَدْعُو عَلَى رِعْلٍ، وَذَكْوَانَ، وَيَقُولُ: عُصَيَّةُ عَصَتِ اللهَ وَرَسُولَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9112,
                "hadithNumber": "1548",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ س reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) observed Qunut for a month in the dawn prayer after ruku' and invoked curse upon Bani Usayya.",
                "hadithUrdu": "رسول اللہ ﷺ نے ایک مہینے تک نماز فجر میں رکوع کے بعد قنوت کی ، آپ بنو عصیہ کے خلاف بددعا کرتے رہے.",
                "urduNarrator": "مجھ سے محمد بن حاتم نے بیان کیا، ہم سے بہز بن اسد نے بیان کیا، ہم سے حماد بن سلمہ نے بیان کیا، انس بن سیرین نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا بَهْزُ بْنُ أَسَدٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، أَخْبَرَنَا أَنَسُ بْنُ سِيرِينَ، عَنْ أَنَسِ بْنِ مَالِكٍ: «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَنَتَ شَهْرًا بَعْدَ الرُّكُوعِ فِي صَلَاةِ الْفَجْرِ يَدْعُو عَلَى بَنِي عُصَيَّةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9113,
                "hadithNumber": "1549",
                "englishNarrator": "Asim reported:",
                "hadithEnglish": "I asked Anas رضی اللہ عنہ whether Qunut was observed (by the Holy prophet) before ruku' or after ruku'. He replied: Before ruku'. I said: People conceive that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) observed Qunut after the ruku'. He said: The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) observed Qunut (after the ruku' as the people conceive it) for a mouth invoking curse upon those persons who had killed men among his Companions who were called the reciter (of the Qur'an).",
                "hadithUrdu": "میں نے ان ( انس رضی اللہ عنہ ) سے قنو ت کے بارے میں پوچھا : رکوع سے پہلے ہے یا رکوع کے بعد؟ تو انھوں نے کہا : رکوع سے پہلے ۔ کہا : میں نے عرض کی : بہت سے لوگ سمجھتے ہیں کہ رسول اللہ ﷺ نے رکوع کے بعد قنوت کی ۔ تو انھوں نے کہا : رسول اللہ ﷺ نے ایک مہینے کی ، ان لوگوں کو خلاف بددعا فرماتے رہے جنھوں نے آپ کے صحابہ میں سے کچھ لوگوں کو قتل کیا تھا جنھیں قراء ( قرآن پڑھنے والے ) کہا جاتا تھا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، کہا ابو معاویہ نے عاصم سے اور انھوں نے حضرت انس رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، قَالَا: حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنْ عَاصِمٍ، عَنْ أَنَسٍ، قَالَ: سَأَلْتُهُ عَنِ الْقُنُوتِ قَبْلَ الرُّكُوعِ، أَوْ بَعْدَ الرُّكُوعِ؟ فَقَالَ: قَبْلَ الرُّكُوعِ، قَالَ: قُلْتُ: فَإِنَّ نَاسًا يَزْعُمُونَ أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَنَتَ بَعْدَ الرُّكُوعِ، فَقَالَ: «إِنَّمَا قَنَتَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ شَهْرًا يَدْعُو عَلَى أُنَاسٍ قَتَلُوا أُنَاسًا مِنْ أَصْحَابِهِ، يُقَالُ لَهُمُ الْقُرَّاءُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 8801,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=352",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=350",
                "label": "350",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=351",
                "label": "351",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=352",
                "label": "352",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=353",
                "label": "353",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=354",
                "label": "354",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=355",
                "label": "355",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=356",
                "label": "356",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=354",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=354",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=352",
        "to": 8825,
        "total": 40465
    }
}