{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 446,
        "data": [
            {
                "id": 11414,
                "hadithNumber": "3850",
                "englishNarrator": "Jabir bin Abdullah (Allah be pleased with them) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When you purchase food grains, do not sell them until you have taken possession of them.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم فرمایا کرتے تھے : \" جب تم غلہ خریدو تو اسے پوری طرح قبضے میں لینے سے پہلے نہ بیچو.",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے روح نے بیان کیا، کہا ہم سے ابن جریج نے بیان کیا، کہا کہ مجھ سے ابو الزبیر نے بیان کیا, حضرت جابر بن عبداللہ رضی اللہ عنہ کہتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا رَوْحٌ، حَدَّثَنَا ابْنُ جُرَيْجٍ، حَدَّثَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ، يَقُولُ: كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِذَا ابْتَعْتَ طَعَامًا، فَلَا تَبِعْهُ حَتَّى تَسْتَوْفِيَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "22",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 122,
                    "chapterNumber": "22",
                    "chapterEnglish": "The Book of Transactions",
                    "chapterUrdu": "لین دین کے مسائل",
                    "chapterArabic": "كتاب الْبُيُوعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11415,
                "hadithNumber": "3851",
                "englishNarrator": "Jabir bin Abdullah (رضی اللہ عنہ) is reported to have said:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade the sale of a heap of dates the weight of which is unknown in accordance with the known weight of dates.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے کھجور کی مقدار معلوم کیے بغیر بیچنے سے منع فرمایا۔ تاریخیں",
                "urduNarrator": "مجھ سے ابو الطاہر احمد بن عمرو بن سرح نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، کہا کہ مجھ سے ابن جریج نے بیان کیا، ان سے ابو الزبیر نے بیان کیا، انہوں نے کہا: میں نے جابر بن عبداللہ رضی اللہ عنہما کو کہتے سنا",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ، أَخْبَرَنَا ابْنُ وَهْبٍ، حَدَّثَنِي ابْنُ جُرَيْجٍ، أَنَّ أَبَا الزُّبَيْرِ، أَخْبَرَهُ، قَالَ: سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللهِ، يَقُولُ: «نَهَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الصُّبْرَةِ مِنَ التَّمْرِ، لَا يُعْلَمُ مَكِيلَتُهَا، بِالْكَيْلِ الْمُسَمَّى مِنَ التَّمْرِ.",
                "headingArabic": "تَحْرِيمِ بَيْعِ صُبْرَةِ التَّمْرِ الْمَجْهُولَةِ الْقَدْرِ بِتَمْرٍ ‏‏",
                "headingUrdu": "کھجور کا ڈھیر بیچنے کی ممانعت جس کا وزن معلوم نہ ہو۔",
                "headingEnglish": "The prohibition of selling a heap of dates the weight of which is unknown",
                "chapterId": "22",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 122,
                    "chapterNumber": "22",
                    "chapterEnglish": "The Book of Transactions",
                    "chapterUrdu": "لین دین کے مسائل",
                    "chapterArabic": "كتاب الْبُيُوعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11416,
                "hadithNumber": "3852",
                "englishNarrator": null,
                "hadithEnglish": "This hadith is narrated on the authority of Jabir bin Abdullah ( رضی اللہ عنہ) but with this variation that no mention is made of the dates (which one finds) at the end of the previous hadith.",
                "hadithUrdu": "ہم سے اسحاق بن ابراہیم نے بیان کیا، انہوں نے بیان کیا روح بن عبادہ نے ہمیں حدیث بیان کی ، کہا : ہمیں ابن جریج نے ابوزبیر سے خبر دی ، انہوں نے جابر بن عبداللہ رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے : رسول اللہ صلی اللہ علیہ وسلم نے منع فرمایا ۔ ۔ ۔ اسی ( مذکورہ بالا روایت ) کے مانند ، لیکن انہوں نے حدیث کے آخر میں من التمر کے الفاظ ذکر نہیں کیے.",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ، يَقُولُ: نَهَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ، غَيْرَ أَنَّهُ لَمْ يَذْكُرْ: مِنَ التَّمْرِ فِي آخِرِ الْحَدِيثِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "22",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 122,
                    "chapterNumber": "22",
                    "chapterEnglish": "The Book of Transactions",
                    "chapterUrdu": "لین دین کے مسائل",
                    "chapterArabic": "كتاب الْبُيُوعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11417,
                "hadithNumber": "3853",
                "englishNarrator": "Ibn 'Umar (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) as saying: Both parties in a business transaction have the right to annul it so long as they have not separated; except in transactions which have been made subject to the right of parties to annul them.",
                "hadithUrdu": "اللہ کے رسول صلی اللہ علیہ وسلم نے فرمایا : \" بیع کرنے والے دونوں میں سے ہر ایک کو اپنے ساتھی کے خلاف ( بیع فسخ کرنے کا ) اختیار ہے جب تک وہ جدا نہ ہوں ، الا یہ کہ اختیار والی بیع ہو.",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا امام مالک نے نافع سے اور انہوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْبَيِّعَانِ كُلُّ وَاحِدٍ مِنْهُمَا بِالْخِيَارِ عَلَى صَاحِبِهِ، مَا لَمْ يَتَفَرَّقَا، إِلَّا بَيْعَ الْخِيَارِ.",
                "headingArabic": "ثُبُوتِ خِيَارِ الْمَجْلِسِ لِلْمُتَبَايِعَيْنِ ‏‏",
                "headingUrdu": "اس بات کی تصدیق کرتے ہوئے کہ لین دین کے دونوں فریقوں کے پاس (اسے منسوخ کرنے کا) اختیار ہے جب تک کہ وہ ایک ساتھ ہوں۔",
                "headingEnglish": "Affirming that both parties to a transaction have the option (of canceling it) while they are still together",
                "chapterId": "22",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 122,
                    "chapterNumber": "22",
                    "chapterEnglish": "The Book of Transactions",
                    "chapterUrdu": "لین دین کے مسائل",
                    "chapterArabic": "كتاب الْبُيُوعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11418,
                "hadithNumber": "3854",
                "englishNarrator": null,
                "hadithEnglish": "A hadith similar to that of Malik from Nafi' (no. 3853) was narrated from Ibn 'Umar رضی اللہ عنہما , from the prophet ﷺ.",
                "hadithUrdu": "ہم سے زہیر بن حرب اور محمد بن المثنیٰ نے بیان کیا، کہا: ہم سے یحییٰ نے جو القطان ہیں، بیان کیا اور ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، وہ ہم سے روایت کرتے ہیں۔ ہم سے محمد بن بشر، ح، اور ابن نمیر نے بیان کیا، ہم سے میرے والد نے بیان کیا، ان سب نے عبید اللہ سے، نافع کی سند سے، ابن عمر رضی اللہ عنہما سے، انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے۔ خدا اس پر رحم کرے اور اسے سلامتی عطا فرمائے،مجھ سے زہیر بن حرب اور علی بن حجر نے بیان کیا، کہا: ہم سے اسماعیل نے بیان کیا، اور ہم سے ابو الربیع اور ابو کامل نے بیان کیا، کہا: ہم سے حماد نے بیان کیا، اور انہوں نے کہا: ابن زید، تمام ایوب کی سند سے، نافع کی سند سے، ابن عمر کی سند سے، رسول اللہ صلی اللہ علیہ وسلم کی سند سے، اور ابن المثنی اور ابن ابی عمر نے روایت کی ہے۔ ہمیں کہتے ہیں: عبدالوہاب نے بتایا میں نے ہم سے یحییٰ بن سعید نے سنا، ہم سے ابن رافع نے بیان کیا، کہا ہم سے ابن ابی فودیک نے بیان کیا، کہا ہم سے ضحاک نے بیان کیا، ان دونوں نے نافع کی سند سے، ابن عمر رضی اللہ عنہما سے۔ نبی کریم صلی اللہ علیہ وسلم نافع کی روایت میں مالک کی حدیث کے مشابہ ہیں۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالَا: حَدَّثَنَا يَحْيَى وَهُوَ الْقَطَّانُ، ح وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، ح وحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، كُلُّهُمْ عَنْ عُبَيْدِ اللهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، ح وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَعَلِيُّ بْنُ حُجْرٍ، قَالَا: حَدَّثَنَا إِسْمَاعِيلُ، ح وحَدَّثَنَا أَبُو الرَّبِيعِ، وَأَبُو كَامِلٍ، قَالَا: حَدَّثَنَا حَمَّادٌ وَهُوَ ابْنُ زَيْدٍ، جَمِيعًا عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، ح وحَدَّثَنَا ابْنُ الْمُثَنَّى، وَابْنُ أَبِي عُمَرَ، قَالَا: حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ: سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ، ح وحَدَّثَنَا ابْنُ رَافِعٍ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، أَخْبَرَنَا الضَّحَّاكُ، كِلَاهُمَا، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَحْوَ حَدِيثِ مَالِكٍ، عَنْ نَافِعٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "22",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 122,
                    "chapterNumber": "22",
                    "chapterEnglish": "The Book of Transactions",
                    "chapterUrdu": "لین دین کے مسائل",
                    "chapterArabic": "كتاب الْبُيُوعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11419,
                "hadithNumber": "3855",
                "englishNarrator": "Ibn 'Umar ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When two persons enter into a transaction, each of them has the right to annul it so long as they are not separated and are together (at the place of transaction); or if one gives the other the right (to annul the transaction) But if one gives the other the option, the transaction is made on this condition (i.e. one has the right to annul the transaction), it becomes binding. And if they are separated after they have made the bargain and none of them annulled it, even then the transaction is binding.",
                "hadithUrdu": "آپ نے فرمایا : \" جب دو آدمی باہم بیع کریں تو دونوں میں سے ہر ایک کو ( سودا ختم کرنے کا ) اختیار ہے جب تک وہ دونوں جدا نہ ہو جائیں اور اکٹھے ہوں ۔ یا ان دونوں میں سے ایک دوسرے کو اختیار دے ، اگر ان میں سے ایک دوسرے کو اختیار دے اور اسی پر دونوں بیع کر لیں تو بیع لازم ہو گئی ، اور اگر باہم بیع کرنے کے بعد دونوں جدا ہوئے اور ان میں سے کسی نے بیع کو ترک نہیں کیا تو بھی بیع لازم ہو گئی.",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ہم سے لیث ایچ نے بیان کیا اور ہم سے محمد بن رومہ نے بیان کیا، لیث نے ہمیں نافع سے خبر دی ، انہوں نے حضرت ابن عمر رضی اللہ عنہ سے اور انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: «إِذَا تَبَايَعَ الرَّجُلَانِ فَكُلُّ وَاحِدٍ مِنْهُمَا بِالْخِيَارِ مَا لَمْ يَتَفَرَّقَا، وَكَانَا جَمِيعًا، أَوْ يُخَيِّرُ أَحَدُهُمَا الْآخَرَ، فَإِنْ خَيَّرَ أَحَدُهُمَا الْآخَرَ فَتَبَايَعَا عَلَى ذَلِكِ، فَقَدْ وَجَبَ الْبَيْعُ، وَإِنْ تَفَرَّقَا بَعْدَ أَنْ تَبَايَعَا وَلَمْ يَتْرُكْ وَاحِدٌ مِنْهُمَا الْبَيْعَ، فَقَدْ وَجَبَ الْبَيْعُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "22",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 122,
                    "chapterNumber": "22",
                    "chapterEnglish": "The Book of Transactions",
                    "chapterUrdu": "لین دین کے مسائل",
                    "chapterArabic": "كتاب الْبُيُوعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11420,
                "hadithNumber": "3856",
                "englishNarrator": "Abdullah bin 'Umar ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When two persons enter into a transaction, each one of them has the right to annul it so long as they are not separated, or their transaction gives one another (as a condition) the right of annulling, and if their transaction, has the right of annulling it the transaction becomes binding. Ibn Abi Umar رضی اللہ عنہ made this addition that whenever he (Ibn Umar رضی اللہ عنہ ) entered into a transaction with a person with the intention of not breaking it, he walked a while and then returned to him.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" جب دو بیع کرنے والے باہم خرید و فروخت کریں تو ان میں سے ہر ایک کو اپنی بیع ( ختم کرنے ) کا اختیار ہے جب تک وہ باہم جدا نہ ہوں یا ان کی بیع اختیار سے ہوئی ہو ( انہوں نے اختیار استعمال کر لیا ہو ۔ ) اگر ان کی بیع اختیار سے ہوئی ہے تو لازم ہو گئی ہے ۔ \"\" ابن ابی عمر نے اپنی روایت میں اضافہ کیا کہ نافع نے کہا : جب وہ ( ابن عمر رضی اللہ عنہ ) کسی آدمی سے بیع کرتے اور چاہتے کہ وہ آدمی ان سے بیع کی واپسی کا مطالبہ ( اقالہ ) نہ کرے تو وہ ( خیارِ مجلس ختم کرنے کے لیے ) اٹھتے ، تھوڑا سا چلتے ، پھر اس کے پاس واپس آ جاتے.",
                "urduNarrator": "زہیر بن حرب اور ابن ابی عمر دونوں نے سفیان سے روایت کی ۔ زہیر نے کہا : ہمیں سفیان بن عیینہ نے ابن جریج سے حدیث بیان کی ، انہوں نے کہا : مجھے نافع نے ( حدیث ) املا کرائی کہ انہوں نے حضرت عبداللہ بن عمر رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے",
                "hadithArabic": "وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَابْنُ أَبِي عُمَرَ، كِلَاهُمَا عَنْ سُفْيَانَ، قَالَ زُهَيْرٌ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ ابْنِ جُرَيْجٍ، قَالَ: أَمْلَى عَلَيَّ نَافِعٌ، سَمِعَ عَبْدَ اللهِ بْنَ عُمَرَ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا تَبَايَعَ الْمُتَبَايِعَانِ بِالْبَيْعِ فَكُلُّ وَاحِدٍ مِنْهُمَا بِالْخِيَارِ مِنْ بَيْعِهِ مَا لَمْ يَتَفَرَّقَا، أَوْ يَكُونُ بَيْعُهُمَا عَنْ خِيَارٍ، فَإِذَا كَانَ بَيْعُهُمَا عَنْ خِيَارٍ، فَقَدْ وَجَبَ»، زَادَ ابْنُ أَبِي عُمَرَ فِي رِوَايَتِهِ: قَالَ نَافِعٌ: فَكَانَ إِذَا بَايَعَ رَجُلًا، فَأَرَادَ أَنْ لَا يُقِيلَهُ، قَامَ فَمَشَى هُنَيَّةً، ثُمَّ رَجَعَ إِلَيْهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "22",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 122,
                    "chapterNumber": "22",
                    "chapterEnglish": "The Book of Transactions",
                    "chapterUrdu": "لین دین کے مسائل",
                    "chapterArabic": "كتاب الْبُيُوعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11421,
                "hadithNumber": "3857",
                "englishNarrator": "Ibn Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: There is no transaction between two persons entering a transaction until they separate, but only when there is an option to annul it.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" دو بیع کرنے والوں کے درمیان ( اس وقت تک ) بیع ( لازم ) نہیں ہوتی ، یہاں تک کہ وہ ایک دوسرے سے جدا ہو جائیں ، الا یہ کہ خیار ( اختیار ) والی بیع ہو ۔ \" ( جس میں خیار کی مدت طے کر لی جائے یا اختیار استعمال کر کے بیع کو پکا کر لیا جائے.",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ، یحییٰ بن ایوب، قتیبہ اور ابن حجر نے بیان کیا کہ ہم کو یحییٰ بن یحییٰ نے خبر دی اور دوسروں نے کہا: ہم سے اسماعیل بن جعفر نے بیان کیا,عبداللہ بن دینار سے روایت ہے کہ انہوں نے حضرت ابن عمر رضی اللہ عنہ سے سنا وہ کہہ رہے تھے",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَيَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ حُجْرٍ، قَالَ يَحْيَى بْنُ يَحْيَى: أَخْبَرَنَا، وقَالَ الْآخَرُونَ: حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ عَبْدِ اللهِ بْنِ دِينَارٍ، أَنَّهُ سَمِعَ ابْنَ عُمَرَ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «كُلُّ بَيِّعَيْنِ لَا بَيْعَ بَيْنَهُمَا حَتَّى يَتَفَرَّقَا، إِلَّا بَيْعُ الْخِيَارِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "22",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 122,
                    "chapterNumber": "22",
                    "chapterEnglish": "The Book of Transactions",
                    "chapterUrdu": "لین دین کے مسائل",
                    "chapterArabic": "كتاب الْبُيُوعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11422,
                "hadithNumber": "3858",
                "englishNarrator": "Hakim bin Hazim (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Both parties in a business transaction have the right to annul it so long as they have not separated; and if they speak the truth and make everything clear they will be blessed in their transaction; but if they tell a lie and conceal anything the blessing on their transaction will be blotted out.",
                "hadithUrdu": "انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ، آپ نے فرمایا : \" بیع کرنے والے دونوں فریقوں کو اختیار ہے جب تک جدا نہ ہوں ۔ اگر وہ دونوں سچ بولیں اور حقیقت کو واضح کریں تو ان کی بیع میں برکت ڈالی جاتی ہے ، اور اگر وہ جھوٹ بولیں اور ( عیب وغیرہ ) چھپائیں تو ان کی بیع سے برکت مٹا دی جاتی ہے.",
                "urduNarrator": "ہم سے محمد بن المثنیٰ نے بیان کیا، ہم سے یحییٰ بن سعید نے بیان کیا، شعبہ کی سند سے، ہم سے عمرو بن علی نے بیان کیا، ہم سے یحییٰ بن سعید اور عبد نے بیان کیا۔ رحمٰن بن مہدی کہتے ہیں: ہم سے شعبہ نے قتادہ کی سند سے بیان کیا, ابوخلیل نے عبداللہ بن حارث سے ، انہوں نے حضرت حکیم بن حزام رضی اللہ عنہ سے اور",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ شُعْبَةَ، ح وحَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، قَالَا: حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَبِي الْخَلِيلِ، عَنْ عَبْدِ اللهِ بْنِ الْحَارِثِ، عَنْ حَكِيمِ بْنِ حِزَامٍ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْبَيِّعَانِ بِالْخِيَارِ مَا لَمْ يَتَفَرَّقَا، فَإِنْ صَدَقَا وَبَيَّنَا بُورِكَ لَهُمَا فِي بَيْعِهِمَا، وَإِنْ كَذَبَا وَكَتَمَا مُحِقَ بَرَكَةُ بَيْعِهِمَا.",
                "headingArabic": "الصِّدْقِ فِي الْبَيْعِ وَالْبَيَانِ ‏‏",
                "headingUrdu": "فروخت اور نقائص کے انکشاف میں ایمانداری",
                "headingEnglish": "Honesty in selling and disclosure of defects",
                "chapterId": "22",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 122,
                    "chapterNumber": "22",
                    "chapterEnglish": "The Book of Transactions",
                    "chapterUrdu": "لین دین کے مسائل",
                    "chapterArabic": "كتاب الْبُيُوعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11423,
                "hadithNumber": "3859",
                "englishNarrator": "A hadith like this has been transmitted on the authority of Hakim bin Hizam رضی اللہ عنہ (Imam Muslim) said:",
                "hadithEnglish": "Hakim bin Hizam رضی اللہ عنہ was born inside the Ka'ba and lived for one hundred and twenty years.",
                "hadithUrdu": "حضرت حکیم بن حزام رضی اللہ عنہ کعبہ کے اندر پیدا ہوئے تھے اور انہوں نے 120 سال زندگی پائی.",
                "urduNarrator": "ہم سے عمرو بن علی نے بیان کیا، کہا ہم سے عبدالرحمٰن بن مہدی نے بیان کیا، کہا ہم سے ہمام نے بیان کیا, ابوتیاح سے روایت ہے ، انہوں نے کہا : میں نے عبداللہ بن حارث سے سنا ، وہ حکیم بن حزام رضی اللہ عنہ سے حدیث بیان کر رہے تھے ، انہوں نے نبی صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ۔ امام مسلم بن حجاج رحمۃ اللہ علیہ نے کہا",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا هَمَّامٌ، عَنْ أَبِي التَّيَّاحِ، قَالَ: سَمِعْتُ عَبْدَ اللهِ بْنَ الْحَارِثِ، يُحَدِّثُ عَنْ حَكِيمِ بْنِ حِزَامٍ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ، قَالَ مُسْلِمُ بْنُ الْحَجَّاجِ: «وُلِدَ حَكِيمُ بْنُ حِزَامٍ فِي جَوْفِ الْكَعْبَةِ، وَعَاشَ مِائَةً وَعِشْرِينَ سَنَةً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "22",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 122,
                    "chapterNumber": "22",
                    "chapterEnglish": "The Book of Transactions",
                    "chapterUrdu": "لین دین کے مسائل",
                    "chapterArabic": "كتاب الْبُيُوعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11424,
                "hadithNumber": "3860",
                "englishNarrator": "Abdullah bin Dinar narrated:",
                "hadithEnglish": "He heard Ibn 'Umar (رضی اللہ عنہ) saying: A man mentioned to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) that he was deceived in a business transaction, whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: When you enter into a transaction, say: There should be no attempt to deceive.",
                "hadithUrdu": "انہوں نے حضرت ابن عمر رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے : ایک آدمی نے رسول اللہ صلی اللہ علیہ وسلم سے عرض کی کہ اسے بیع میں دھوکا دے دیا جاتا ہے ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" تم جس سے بھی بیع کرو تو کہہ دیا کرو : دھوکا نہیں ہو گا ۔ \"\" ( بعد ازیں ) وہ جب بھی بیع کرتا تو کہتا : دھوکا نہیں ہو گا.",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ، یحییٰ بن ایوب، قتیبہ اور ابن حجر نے بیان کیا کہ ہم سے یحییٰ بن یحییٰ نے بیان کیا اور دوسروں نے کہا,اسماعیل بن جعفر نے عبداللہ بن دینار سے روایت کی",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَيَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ حُجْرٍ، قَالَ يَحْيَى بْنُ يَحْيَى: أَخْبَرَنَا، وقَالَ الْآخَرُونَ: حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ عَبْدِ اللهِ بْنِ دِينَارٍ، أَنَّهُ سَمِعَ ابْنَ عُمَرَ، يَقُولُ: ذَكَرَ رَجُلٌ لِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ يُخْدَعُ فِي الْبُيُوعِ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: مَنْ بَايَعْتَ، فَقُلْ: لَا خِلَابَةَ ، فَكَانَ إِذَا بَايَعَ يَقُولُ: لَا خِيَابَةَ.",
                "headingArabic": "مَنْ يُخْدَعُ فِي الْبَيْعِ ‏‏",
                "headingUrdu": "وہ جو لین دین میں دھوکہ کھاتا ہے۔",
                "headingEnglish": "One who is deceived in transactions",
                "chapterId": "22",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 122,
                    "chapterNumber": "22",
                    "chapterEnglish": "The Book of Transactions",
                    "chapterUrdu": "لین دین کے مسائل",
                    "chapterArabic": "كتاب الْبُيُوعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11425,
                "hadithNumber": "3861",
                "englishNarrator": "This hadith has been narrated on the authority of 'Abdullah bin Dinar with the same chain of transmitters but these words are not found in it. When he buys he should say:",
                "hadithEnglish": "There should be no attempt to deceive.",
                "hadithUrdu": "وہ جب سودا کرتا تو کہتا تھا : دھوکا نہیں ہو گا.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے وکیع نے بیان کیا,سفیان اور شعبہ دونوں نے عبداللہ بن دینار سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ، لیکن ان دونوں کی حدیث میں یہ الفاظ نہیں ہیں",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، كِلَاهُمَا عَنْ عَبْدِ اللهِ بْنِ دِينَارٍ، بِهَذَا الْإِسْنَادِ مِثْلَهُ، وَلَيْسَ فِي حَدِيثِهِمَا: فَكَانَ إِذَا بَايَعَ يَقُولُ: لَا خِيَابَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "22",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 122,
                    "chapterNumber": "22",
                    "chapterEnglish": "The Book of Transactions",
                    "chapterUrdu": "لین دین کے مسائل",
                    "chapterArabic": "كتاب الْبُيُوعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11426,
                "hadithNumber": "3862",
                "englishNarrator": "Ibn 'Umar ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade the sale of fruits until they were clearly in good condition, he forbade it both to the seller and to the buyer.",
                "hadithUrdu": "اللہ کے رسول صلی اللہ علیہ وسلم نے ( اس وقت تک درختوں پر لگے ہوئے ) پھلوں کی بیع سے منع فرمایا یہاں تک کہ ان کی ( پکنے کی ) صلاحیت ظاہر ہو جائے ۔ آپ نے بیچنے والے اور خریدنے والے دونوں کو ( ایسی بیع سے ) منع فرمایا.",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا امام مالک نے نافع سے ، انہوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ،«أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الثَّمَرِ حَتَّى يَبْدُوَ صَلَاحُهَا» نَهَى الْبَائِعَ وَالْمُبْتَاعَ.",
                "headingArabic": "النَّهْىِ عَنْ بَيْعِ الثِّمَارِ، قَبْلَ بُدُوِّ صَلاَحِهَا بِغَيْرِ شَرْطِ الْقَطْعِ ‏‏",
                "headingUrdu": "پیداوار کی نیکی ظاہر ہونے سے پہلے بیچنے کی ممانعت",
                "headingEnglish": "The prohibition of selling produce before its goodness appears",
                "chapterId": "22",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 122,
                    "chapterNumber": "22",
                    "chapterEnglish": "The Book of Transactions",
                    "chapterUrdu": "لین دین کے مسائل",
                    "chapterArabic": "كتاب الْبُيُوعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11427,
                "hadithNumber": "3863",
                "englishNarrator": null,
                "hadithEnglish": "Another chain on the authority of Ibn 'Umar رضی اللہ عنہ narrated the same as the above hadith.",
                "hadithUrdu": "ہم سے ابن نمیر نے بیان کیا، ہم سے میرے والد نے بیان کیا, عبیداللہ نے ہمیں نافع سے حدیث بیان کی ، انہوں نے حضرت ابن عمر رضی اللہ عنہ سے ، انہوں نے نبی صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی.",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "22",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 122,
                    "chapterNumber": "22",
                    "chapterEnglish": "The Book of Transactions",
                    "chapterUrdu": "لین دین کے مسائل",
                    "chapterArabic": "كتاب الْبُيُوعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11428,
                "hadithNumber": "3864",
                "englishNarrator": "Ibn 'Umar (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade the sale of palm-trees (i. e. their trults) until the dates began to ripen, and ears of corn until they were white and were safe from blight. He forbade the seller and the buyer.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے کھجور کی بیع سے منع فرمایا حتی کہ وہ سرخ یا زرد ہو جائے اور کِھیل ( سٹہ ) ( کی بیع ) سے حتی کہ وہ ( دانے بھر کر ) سفید اور آفات سے محفوظ ہو جائے ۔ آپ نے بیچنے اور خریدنے والے دونوں کو منع فرمایا.",
                "urduNarrator": "مجھ سے علی بن حجر السعدی اور زہیر بن حرب نے بیان کیا، کہا: ہم سے اسماعیل نے ایوب کی سند سے اور نافع کی سند سے بیان کیا, حضرت ابن عمر رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "وحَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالَا: حَدَّثَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ النَّخْلِ حَتَّى يَزْهُوَ، وَعَنِ السُّنْبُلِ حَتَّى يَبْيَضَّ، وَيَأْمَنَ الْعَاهَةَ» نَهَى الْبَائِعَ وَالْمُشْتَرِيَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "22",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 122,
                    "chapterNumber": "22",
                    "chapterEnglish": "The Book of Transactions",
                    "chapterUrdu": "لین دین کے مسائل",
                    "chapterArabic": "كتاب الْبُيُوعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11429,
                "hadithNumber": "3865",
                "englishNarrator": "Ibn Umar (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Do not buy fruit until its good condition becomes clear, and (the danger) of blight is no more. He said: Its good condition becoming clear implies that it becomes red or yellow.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" تم پھل مت خریدو حتی کہ ان کی صلاحیت ظاہر ہو جائے اور اس سے آفت ( کا امکان ) ختم ہو جائے ۔ \"\" ( ابن عمر رضی اللہ عنہ نے ) کہا : اس کی صلاحیت ( ظاہر ہونے ) سے اس کی سرخی اور زردی مراد ہے.",
                "urduNarrator": "مجھ سے زہیر بن حرب نے کہا, جریر نے ہمیں یحییٰ بن سعید سے حدیث بیان کی ، انہوں نے نافع سے ، انہوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تَبْتَاعُوا الثَّمَرَ حَتَّى يَبْدُوَ صَلَاحُهُ، وَتَذْهَبَ عَنْهُ الْآفَةُ»، قَالَ: يَبْدُوَ صَلَاحُهُ: حُمْرَتُهُ وَصُفْرَتُهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "22",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 122,
                    "chapterNumber": "22",
                    "chapterEnglish": "The Book of Transactions",
                    "chapterUrdu": "لین دین کے مسائل",
                    "chapterArabic": "كتاب الْبُيُوعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11430,
                "hadithNumber": "3866",
                "englishNarrator": null,
                "hadithEnglish": "This hadith is reported or the authority of Yahya with the same chain of transmitters up to until its good condition becomes clear, but lie did not mention what follows (these words).",
                "hadithUrdu": "ہم سے محمد بن المثنی اور ابن ابی عمر نے بیان کیا، کہاعبدالوہاب نے یحییٰ سے اسی سند کے ساتھ \" حتیٰ کہ اس کی صلاحیت واضح ہو جائے \" تک حدیث بیان کی ، اس کے بعد والا حصہ بیان نہیں کیا.",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ أَبِي عُمَرَ، قَالَا: حَدَّثَنَا عَبْدُ الْوَهَّابِ، عَنْ يَحْيَى، بِهَذَا الْإِسْنَادِ، حَتَّى يَبْدُوَ صَلَاحُهُ، لَمْ يَذْكُرْ مَا بَعْدَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "22",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 122,
                    "chapterNumber": "22",
                    "chapterEnglish": "The Book of Transactions",
                    "chapterUrdu": "لین دین کے مسائل",
                    "chapterArabic": "كتاب الْبُيُوعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11431,
                "hadithNumber": "3867",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Ibn 'Umar رضی اللہ عنہ through another chain of transmitters.",
                "hadithUrdu": "ہم سے ابن رافع نے بیان کیا,ابن ابی فُدیک نے ہمیں حدیث بیان کی ، کہا : ہمیں ضحاک نے نافع سے خبر دی ، انہوں نے حضرت ابن عمر رضی اللہ عنہ سے ، انہوں نے نبی صلی اللہ علیہ وسلم سے عبدالوہاب کی حدیث کی طرح روایت کی.",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا ابْنُ رَافِعٍ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، أَخْبَرَنَا الضَّحَّاكُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ عَبْدِ الْوَهَّابِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "22",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 122,
                    "chapterNumber": "22",
                    "chapterEnglish": "The Book of Transactions",
                    "chapterUrdu": "لین دین کے مسائل",
                    "chapterArabic": "كتاب الْبُيُوعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11432,
                "hadithNumber": "3868",
                "englishNarrator": null,
                "hadithEnglish": "Nafi, reported on the authority of Ibn Umar (رضی اللہ عنہ) a hadith like that narrated before.",
                "hadithUrdu": "ہم سے سوید بن سعید نے بیان کیا، کہا ہم سے حفص بن میسرہ نے بیان کیا,موسیٰ بن عقبہ نے مجھے نافع سے حدیث بیان کی ، انہوں نے حضرت ابن عمر رضی اللہ عنہ سے ، انہوں نے نبی صلی اللہ علیہ وسلم سے امام مالک اور عبیداللہ کی حدیث کے مانند روایت بیان کی.",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا حَفْصُ بْنُ مَيْسَرَةَ، حَدَّثَنِي مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ مَالِكٍ، وَعُبَيْدِ اللهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "22",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 122,
                    "chapterNumber": "22",
                    "chapterEnglish": "The Book of Transactions",
                    "chapterUrdu": "لین دین کے مسائل",
                    "chapterArabic": "كتاب الْبُيُوعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11433,
                "hadithNumber": "3869",
                "englishNarrator": "Ibn Umar ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger' ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Do not buy fruits (on the trees) until their good condition becomes clear.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم پھل نہ بیچو یہاں تک کہ اس کی صلاحیت ظاہر ہو جائے.",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ، یحییٰ بن ایوب، قتیبہ اور ابن حجر نے بیان کیا کہ ہم سے یحییٰ بن یحییٰ نے بیان کیا اور دوسروں نے کہا,اسماعیل بن جعفر نے عبداللہ بن دینار سے روایت کی کہ انہوں نے ابن عمر رضی اللہ عنہ سے سنا ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَيَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ حُجْرٍ، قَالَ يَحْيَى بْنُ يَحْيَى: أَخْبَرَنَا، وقَالَ الْآخَرُونَ: حَدَّثَنَا إِسْمَاعِيلُ وَهُوَ ابْنُ جَعْفَرٍ، عَنْ عَبْدِ اللهِ بْنِ دِينَارٍ، أَنَّهُ سَمِعَ ابْنَ عُمَرَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تَبِيعُوا الثَّمَرَ حَتَّى يَبْدُوَ صَلَاحُهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "22",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 122,
                    "chapterNumber": "22",
                    "chapterEnglish": "The Book of Transactions",
                    "chapterUrdu": "لین دین کے مسائل",
                    "chapterArabic": "كتاب الْبُيُوعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11434,
                "hadithNumber": "3870",
                "englishNarrator": "In the hadith transmitted on the authority of Shu'ba it was stated:",
                "hadithEnglish": "Ibn Umar (رضی اللہ عنہ) was asked what good condition implied. He said: When (the danger of) blight is no more.",
                "hadithUrdu": "ابن عمر رضی اللہ عنہ سے کہا گیا : اس کی صلاحیت سے کیا مراد ہے؟ انہوں نے کہا : اس سے آفت ( بورگر جانے اور بیماری لگ جانے ) کا وقت ختم ہو جائے.",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، ہم سے عبدالرحمٰن نے بیان کیا،سفیان اور شعبہ دونوں نے عبداللہ بن دینار سے اسی سند کے ساتھ حدیث بیان کی ، شعبہ کی حدیث میں یہ اضافہ ہے کہ",
                "hadithArabic": "وحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، ح وحَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، كِلَاهُمَا عَنْ عَبْدِ اللهِ بْنِ دِينَارٍ بِهَذَا الْإِسْنَادِ، وَزَادَ فِي حَدِيثِ شُعْبَةَ، فَقِيلَ لِابْنِ عُمَرَ: مَا صَلَاحُهُ؟ قَالَ: تَذْهَبُ عَاهَتُهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "22",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 122,
                    "chapterNumber": "22",
                    "chapterEnglish": "The Book of Transactions",
                    "chapterUrdu": "لین دین کے مسائل",
                    "chapterArabic": "كتاب الْبُيُوعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11435,
                "hadithNumber": "3871",
                "englishNarrator": "Jabir (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade (or forbade us) the sale of fruits until they are ripe in a good condition.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ( اس وقت تک ) درخت پر لگے پھل کو بیچنے سے منع فرمایا ۔ ۔ یا کہا : ہمیں منع فرمایا ۔ ۔ یہاں تک کہ وہ ٹھیک ہو جائے.",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا ہم سے ابو خیثمہ نے بیان کیا, ابوزبیر نے ہمیں حضرت جابر رضی اللہ عنہ سے حدیث بیان کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو خَيْثَمَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، ح وحَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ: «نَهَى - أَوْ نَهَانَا - رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الثَّمَرِ حَتَّى يَطِيبَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "22",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 122,
                    "chapterNumber": "22",
                    "chapterEnglish": "The Book of Transactions",
                    "chapterUrdu": "لین دین کے مسائل",
                    "chapterArabic": "كتاب الْبُيُوعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11436,
                "hadithNumber": "3872",
                "englishNarrator": "Jabir bin Abdullah (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbidding the sale of fruit until its good condition is obvious.",
                "hadithUrdu": "اللہ کے رسول صلی اللہ علیہ وسلم نے ( اس وقت تک ) درخت پر لگے پھل کو بیچنے سے منع فرمایا یہاں تک کہ اس کی صلاحیت ظاہر ہو جائے.",
                "urduNarrator": "ہم سے احمد بن عثمان النفالی نے بیان کیا، ہم سے ابوعاصم نے بیان کیا اور مجھ سے محمد بن حاتم نے بیان کیا اور اس کا لفظ یہ ہے کہ ہم سے روح نے بیان کیا، انہوں نے کہا: ہم سے بیان کیا ہم سے زکریا بن اسحاق نے بیان کیا,عمرو بن دینار نے حدیث بیان کی کہ انہوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے سنا وہ کہہ رہے تھے",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ عُثْمَانَ النَّوْفَلِيُّ، حَدَّثَنَا أَبُو عَاصِمٍ، ح وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، وَاللَّفْظُ لَهُ، حَدَّثَنَا رَوْحٌ، قَالَا: حَدَّثَنَا زَكَرِيَّا بْنُ إِسْحَاقَ، حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ، يَقُولُ: «نَهَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الثَّمَرِ حَتَّى يَبْدُوَ صَلَاحُهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "22",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 122,
                    "chapterNumber": "22",
                    "chapterEnglish": "The Book of Transactions",
                    "chapterUrdu": "لین دین کے مسائل",
                    "chapterArabic": "كتاب الْبُيُوعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11437,
                "hadithNumber": "3873",
                "englishNarrator": "Abu Bakhtari reported:",
                "hadithEnglish": "I asked Ibn 'Abbas ( رضی اللہ عنہ) about the sale of dates. He said: Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) forbade the sale of dates of the trees until one eats them or they are eaten (i. e. they are fit to be eaten) or until they are weighed (or measured). I said: What does it imply: Until it is weighed ? Thereupon a person who was with him (Ibn Abbas  رضی اللہ عنہ) said: Until he is able to keep it with him (after plucking them).",
                "hadithUrdu": "میں نے حضرت ابن عباس رضی اللہ عنہ سے کھجور کی بیع کے بارے میں دریافت کیا تو انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے کھجور کی بیع سے منع فرمایا حتی کہ وہ اس سے خود کھا سکے یا وہ کھائے جانے کے قابل ہو جائے ، اور یہاں تک کہ اس کا وزن کیا جا سکے ۔ میں نے کہا : اس کا وزن کیے جانے سے کیا مراد ہے؟ ان کے پاس موجود ایک شخص نے کہا : اس ( کے وزن ) کا اندازہ لگایا جا سکے.",
                "urduNarrator": "ہم سے محمد بن المثنیٰ اور ابن بشار نے بیان کیا، کہا: ہم سے محمد بن جعفر نے بیان کیا، ہم سے شعبہ نے، عمرو بن مرہ سے بیان کیا, ابو بختری سے روایت ہے ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ أَبِي الْبَخْتَرِيِّ، قَالَ: سَأَلْتُ ابْنَ عَبَّاسٍ عَنْ بَيْعِ النَّخْلِ، فَقَالَ: «نَهَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ النَّخْلِ حَتَّى يَأْكُلَ مِنْهُ، أَوْ يُؤْكَلَ، وَحَتَّى يُوزَنَ»، قَالَ: فَقُلْتُ: مَا يُوزَنُ؟ فَقَالَ رَجُلٌ عِنْدَهُ: حَتَّى يُحْزَرَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "22",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 122,
                    "chapterNumber": "22",
                    "chapterEnglish": "The Book of Transactions",
                    "chapterUrdu": "لین دین کے مسائل",
                    "chapterArabic": "كتاب الْبُيُوعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11438,
                "hadithNumber": "3874",
                "englishNarrator": "Abu Huraira (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Do not sell the fruits until their good condition becomes evident.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ( درختوں پر لگا ہوا ) پھل نہ خریدو یہاں تک کہ اس کی صلاحیت ظاہر ہو جائے.",
                "urduNarrator": "مجھ سے ابو کریب محمد بن العلاء نے بیان کیا، ہم سے محمد بن فضیل نے، اپنے والد سے، ابن ابی نعم کی سند سے بیان کیا, حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنِي أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ أَبِيهِ، عَنِ ابْنِ أَبِي نُعْمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تَبْتَاعُوا الثِّمَارَ حَتَّى يَبْدُوَ صَلَاحُهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "22",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 122,
                    "chapterNumber": "22",
                    "chapterEnglish": "The Book of Transactions",
                    "chapterUrdu": "لین دین کے مسائل",
                    "chapterArabic": "كتاب الْبُيُوعِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 11126,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=445",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=443",
                "label": "443",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=444",
                "label": "444",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=445",
                "label": "445",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=446",
                "label": "446",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=447",
                "label": "447",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=448",
                "label": "448",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=449",
                "label": "449",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=447",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=447",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=445",
        "to": 11150,
        "total": 40465
    }
}