{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 582,
        "data": [
            {
                "id": 14814,
                "hadithNumber": "7253",
                "englishNarrator": "Ahnaf bin Qais reported on the authority of Abu Bakra رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: When two Muslims confront each other with their swords, both the slayer and the slain are doomed to Hell-Fire.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب وہ مسلمان اپنی اپنی تلواروں سے باہم ٹکرائیں تو قاتل اور مقتول دونوں آگ میں ہو ں گے ۔ \"",
                "urduNarrator": "احمد بن عبدہ ضبحی نے ہمیں یہی حدیث بیان کی انھوں نے کہا : ہمیں حماد نے ایوب یونس اور معلی بن زیادہ سے حدیث بیان کی ، انھوں نے حسن سے انھو ں نے حسن سے انھوں نے احنف بن قیس سے اور انھوں نےحضرت ابوبکر رضی اللہ عنہ سے روایت کی کہا",
                "hadithArabic": "و حَدَّثَنَاه أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ وَيُونُسَ وَالْمُعَلَّى بْنِ زِيَادٍ عَنْ الْحَسَنِ عَنْ الْأَحْنَفِ بْنِ قَيْسٍ عَنْ أَبِي بَكْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا الْتَقَى الْمُسْلِمَانِ بِسَيْفَيْهِمَا فَالْقَاتِلُ وَالْمَقْتُولُ فِي النَّارِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14815,
                "hadithNumber": "7254",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Hammad through another chain of transmitters.",
                "hadithUrdu": "مجھ سے حجاج بن الشاعر نے بیان کیا: ہمیں عبد الرزاق نے اپنی کتاب سے بیان کیا, معمر نے ہمیں ایوب سے اسی سند کے ساتھ حماد سے ابو کامل کی حدیث کی طرح آخر تک بیان کیا ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ حَدَّثَنَا عَبْدُ الرَّزَّاقِ مِنْ كِتَابِهِ أَخْبَرَنَا مَعْمَرٌ عَنْ أَيُّوبَ بِهَذَا الْإِسْنَادِ نَحْوَ حَدِيثِ أَبِي كَامِلٍ عَنْ حَمَّادٍ إِلَى آخِرِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14816,
                "hadithNumber": "7255",
                "englishNarrator": "Abu Bakra رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: When two Muslims (confront each other) and the one amongst them attacks his brother with a weapon, both of them are at the brink of Hell-Fire. And when one of them kills his companion, both of them get into Hell-Fire.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا \" جب وہ مسلمانوں میں سے ایک نے اپنے بھائی پر اسلحہ کشی کی تو وہ دونوں جہنم کے کنارے پر ہیں پھر جب ان میں سے ایک نے ( موقع پاتے ) دوسرے کو قتل کردیا تو دونوں اکٹھے جہنم میں داخل ہوں گے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے غندر نے شعبہ کی سند سے اور ہم سے محمد بن المثنیٰ اور ابن بشار نے بیان کیا، انہوں نے کہا کہ ہم سے محمد بن جعفر نے بیان کیا، ہم سے شعبہ نے بیان کیا، منصور کی سند سے, ربعی بن حراش نے حضرت ابو بکرہ رضی اللہ عنہ سے اورانھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا غُنْدَرٌ عَنْ شُعْبَةَ و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ مَنْصُورٍ عَنْ رِبْعِيِّ بْنِ حِرَاشٍ عَنْ أَبِي بَكْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا الْمُسْلِمَانِ حَمَلَ أَحَدُهُمَا عَلَى أَخِيهِ السِّلَاحَ فَهُمَا عَلَى جُرْفِ جَهَنَّمَ فَإِذَا قَتَلَ أَحَدُهُمَا صَاحِبَهُ دَخَلَاهَا جَمِيعًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14817,
                "hadithNumber": "7256",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) many ahadith and one of them was this: The last Hour will not come until the two parties (of Muslims) confront each other and there is a large-scale massacre amongst them and the claim of both of them is the same.",
                "hadithUrdu": "انھوں نے کئی احادیث ذکر کیں ان میں سے ( ایک یہ تھی ) اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" قیامت اس وقت قائم نہیں ہوگی یہاں تک کہ مسلمانوں کی دوبڑی جماعتیں باہم جنگ آزماہوں گی ۔ ان دونوں کے درمیان بڑی قتل و غارتگری ہوگی جبکہ دونوں ایک ہی ( بات یعنی حق کی نصرت کا ) دعویٰ کرتے ہوں گے ۔ \"",
                "urduNarrator": "ہم سے محمد بن رافع نے بیان کیا، ہم سے عبدالرزاق نے بیان کیا, معمر نے ہمام بن منبہ سے روایت کی کہا : یہ احادیث ہیں جو حضرت ابو ہریرہ رضی اللہ عنہ نے ہمیں رسول اللہ صلی اللہ علیہ وسلم سے بیان کیں",
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَقُومُ السَّاعَةُ حَتَّى تَقْتَتِلَ فِئَتَانِ عَظِيمَتَانِ وَتَكُونُ بَيْنَهُمَا مَقْتَلَةٌ عَظِيمَةٌ وَدَعْوَاهُمَا وَاحِدَةٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14818,
                "hadithNumber": "7257",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: The last Hour will not come unless there is much bloodshed. They said: What is harj? Thereupon he said: Bloodshed. bloodshed.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" قیامت قائم نہیں ہو گی یہاں تک کہ بہت زیادہ ہرج ( جانوں کی تباہی ) ہوجائے گی؟انھوں ( صحابہ کرام رضوان اللہ عنھم اجمعین ) نے پوچھا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! ہرج ( تباہی ) کیا ہو گی؟فرمایا : \" قتل ، قتل ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ان سے یعقوب نے، یعنی ابن عبدالرحمٰن نے، ہم سے سہیل کے واسطہ سے اپنے والد سے بیان کیا, حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا يَعْقُوبُ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَقُومُ السَّاعَةُ حَتَّى يَكْثُرَ الْهَرْجُ قَالُوا وَمَا الْهَرْجُ يَا رَسُولَ اللَّهِ قَالَ الْقَتْلُ الْقَتْلُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14819,
                "hadithNumber": "7258",
                "englishNarrator": "Thauban رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Allah drew the ends of the world near one another for my sake. And I have seen its eastern and western ends. And the dominion of my Ummah would reach those ends which have been drawn near me and I have been granted the red and the white treasure and I begged my Lord for my Ummah that it should not be destroyed because of famine, nor be dominated by an enemy who is not amongst them to take their lives and destroy them root and branch, and my Lord said: Muhammad, whenever I make a decision, there is none to change it. I grant you for your Ummah that it would not be destroyed by famine and it would not be dominated by an enemy who would not be amongst it and would take their lives and destroy them root and branch even if all the people from the different parts of the world join hands together (for this purpose), but it would be from amongst them, viz. your Ummah, that some people would kill the others or imprison the others.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" بے شک اللہ تعالیٰ نے میرے لیے زمین کو لپیٹ دیا اور میں نے اس کے مشارق و مغارب کو دیکھ لیا اور جہاں تک یہ زمین میرے لیے لپیٹی گئی عنقریب میری امت کی حکومت وہاں تک پہنچے گی اور مجھے سرخ اور سفید دونوں خزانے ( سونے اور چاندی کے ذخائر ) دیے گئے اور میں نے اپنے رب سے اپنی امت کے لیے یہ سوال کیا کہ وہ اس کو عام قحط سالی سے ہلاک نہ کرے اور ان کے علاوہ سے ان پر کوئی دشمن مسلط نہ کرے جو مجموعی طور پر ان سب ( کی جانوں ) کورواکر لے ۔ بے شک میرے رب نے فرمایا : \" اے محمد صلی اللہ علیہ وسلم !جب میں کو ئی فیصلہ کردوں تو وہ رد نہیں ہوتا ۔ بلاشبہ میں نے آپ کی امت کے لیے آپ کو یہ بات عطا کردی ہے کہ ان کو عام قحط سالی سے ہلاک نہیں کروں گا اور ان پر ان کے علاوہ سے کسی اور دشمن کو مسلط نہ کروں گاجو ان سب ( کی جانوں ) کورواقراردے لے ۔ چاہے ان کے خلاف ان کے اطراف والے ۔ یا کہا : ان کے اطراف والوں کے اندر سے ہوں اکٹھے کیوں نہ ہوں جائیں ۔ یہاں تک کہ یہ ( خود ) ایک دوسرے کو ہلاک کریں گے ۔ اور ایک دوسرے کو قیدی بنائیں گے ۔ \"",
                "urduNarrator": "ہم سے ابو الربیع العتکی اور قتیبہ بن سعید دونوں نے حماد بن زید کی سند سے بیان کیا اور قول قتیبہ کا ہے, ہم سے حماد نے بیان کیا, ایوب نے ابو قلابہ سے انھوں نے ابو اسماء سے اور انھوں نے حضرت ثوبان رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو الرَّبِيعِ الْعَتَكِيُّ وَقُتَيْبَةُ بْنُ سَعِيدٍ كِلَاهُمَا عَنْ حَمَّادِ بْنِ زَيْدٍ وَاللَّفْظُ لِقُتَيْبَةَ حَدَّثَنَا حَمَّادٌ عَنْ أَيَّوبَ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي أَسْمَاءَ عَنْ ثَوْبَانَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ زَوَى لِي الْأَرْضَ فَرَأَيْتُ مَشَارِقَهَا وَمَغَارِبَهَا وَإِنَّ أُمَّتِي سَيَبْلُغُ مُلْكُهَا مَا زُوِيَ لِي مِنْهَا وَأُعْطِيتُ الْكَنْزَيْنِ الْأَحْمَرَ وَالْأَبْيَضَ وَإِنِّي سَأَلْتُ رَبِّي لِأُمَّتِي أَنْ لَا يُهْلِكَهَا بِسَنَةٍ عَامَّةٍ وَأَنْ لَا يُسَلِّطَ عَلَيْهِمْ عَدُوًّا مِنْ سِوَى أَنْفُسِهِمْ فَيَسْتَبِيحَ بَيْضَتَهُمْ وَإِنَّ رَبِّي قَالَ يَا مُحَمَّدُ إِنِّي إِذَا قَضَيْتُ قَضَاءً فَإِنَّهُ لَا يُرَدُّ وَإِنِّي أَعْطَيْتُكَ لِأُمَّتِكَ أَنْ لَا أُهْلِكَهُمْ بِسَنَةٍ عَامَّةٍ وَأَنْ لَا أُسَلِّطَ عَلَيْهِمْ عَدُوًّا مِنْ سِوَى أَنْفُسِهِمْ يَسْتَبِيحُ بَيْضَتَهُمْ وَلَوْ اجْتَمَعَ عَلَيْهِمْ مَنْ بِأَقْطَارِهَا أَوْ قَالَ مَنْ بَيْنَ أَقْطَارِهَا حَتَّى يَكُونَ بَعْضُهُمْ يُهْلِكُ بَعْضًا وَيَسْبِي بَعْضُهُمْ بَعْضًا.",
                "headingArabic": "هَلاَكُ هَذِهِ الأُمَّةِ بَعْضِهِمْ بِبَعْضٍ",
                "headingUrdu": "(کے حصے) یہ امت ایک دوسرے کو تباہ کر دے گی۔",
                "headingEnglish": "(Parts of) This Ummah Will Destroy One Another",
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14820,
                "hadithNumber": "7259",
                "englishNarrator": "Thauban رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said. Verily, Allah drew the ends of the world near me until I saw its east and west, and He bestowed upon me two treasures, the red and the white. The rest of the hadith is the same.",
                "hadithUrdu": "اللہ کے نبی صلی اللہ علیہ وسلم نے فرمایا : \" بے شک اللہ تعالیٰ نے زمین کو میرے لیے لپیٹ دیا حتیٰ کہ میں نے اس کےمشارق کو مغارب کو دیکھ لیا اور اس نے مجھے سرخ اور سفید وہ خزانے عطا فرمائے ۔ \" اس کے بعد ابو قلابہ سے ایوب کی روایت کی طرح بیان کیا ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب، اسحاق بن ابراہیم، محمد بن المثنیٰ اور ابن بشار نے بیان کیا۔ اسحاق نے کہا: ہم سے اس نے بیان کیا، اور دوسروں نے کہا: ہم سے معاذ بن ہشام نے بیان کیا، مجھ سے میرے والد نے بیان کیا, قتادہ نے ابوقلابہ سے انھوں نے ابو اسماء یحییٰ سے اور انھوں نے حضرت ثوبان رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ وَمُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَ إِسْحَقُ أَخْبَرَنَا و قَالَ الْآخَرُونَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي أَسْمَاءَ الرَّحَبِيِّ عَنْ ثَوْبَانَ أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ تَعَالَى زَوَى لِي الْأَرْضَ حَتَّى رَأَيْتُ مَشَارِقَهَا وَمَغَارِبَهَا وَأَعْطَانِي الْكَنْزَيْنِ الْأَحْمَرَ وَالْأَبْيَضَ ثُمَّ ذَكَرَ نَحْوَ حَدِيثِ أَيُّوبَ عَنْ أَبِي قِلَابَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14821,
                "hadithNumber": "7260",
                "englishNarrator": "Amir bin Sa'd reported on the authority of his father:",
                "hadithEnglish": "One day Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came from a high, land. He passed by the mosque of Banu Mu'awiya, went in and observed two rak'ahs there and we also observed prayer along with him and he made a long supplication to his Lord. He then came to us and said: I asked my Lord three things and He has granted me two but has withheld one. I begged my Lord that my Ummah should not be destroyed because of famine and He granted me this. And I begged my Lord that my Ummah should not be destroyed by drowning (by deluge) and He granted me this. And I begged my Lord that there should be no bloodshed among the people of my Ummah, but He did not grant it.",
                "hadithUrdu": "ایک دن رسول اللہ صلی اللہ علیہ وسلم ( مدینہ کے ) بالائی علاقے سے تشریف لائے یہاں تک کہ جب آپ بنو معاویہ کی مسجد کے قریب سے گزرے تو آپ اس میں داخل ہوئے اور وہ رکعتیں ادا فرمائیں ۔ ہم نے بھی آپ کے ساتھ نماز پڑھی اور آپ نے اپنے رب سے بہت لمبی دعا کی پھر آپ نے ہماری طرف رخ کیا تو فرمایا : \" میں نے اپنے رب سے تین ( چیزیں ) مانگیں ۔ اس نے وہ مجھے عطا فرمادیں اور ایک مجھ سے روک لی ۔ میں نے اپنے رب سے یہ مانگا کہ وہ میری ( پوری ) امت کو قحط سالی سے ہلاک نہ کرے تو اس نے مجھے یہ چیز عطا فرمادی اور میں نے اس سے مانگا کہ وہ میری امت کو غرق کر کے ہلاک نہ کرے تو اس نے یہ ( بھی ) مجھے عطافرمادی اور میں نے اس سے یہ سوال کیا کہ ان کی آپس میں جنگ نہ ہو تو اس نے یہ ( بات ) مجھ سے روک لی ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, عبد اللہ بن نمیر نے کہا , ہمیں عثمان بن حکیم نے حدیث بیان کی ، کہا : مجھے عامر بن سعد نے اپنے والد ( سعد بن ابی وقاص رضی اللہ تعالیٰ عنہ ) سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ و حَدَّثَنَا ابْنُ نُمَيْرٍ وَاللَّفْظُ لَهُ حَدَّثَنَا أَبِي حَدَّثَنَا عُثْمَانُ بْنُ حَكِيمٍ أَخْبَرَنِي عَامِرُ بْنُ سَعْدٍ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقْبَلَ ذَاتَ يَوْمٍ مِنْ الْعَالِيَةِ حَتَّى إِذَا مَرَّ بِمَسْجِدِ بَنِي مُعَاوِيَةَ دَخَلَ فَرَكَعَ فِيهِ رَكْعَتَيْنِ وَصَلَّيْنَا مَعَهُ وَدَعَا رَبَّهُ طَوِيلًا ثُمَّ انْصَرَفَ إِلَيْنَا فَقَالَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَأَلْتُ رَبِّي ثَلَاثًا فَأَعْطَانِي ثِنْتَيْنِ وَمَنَعَنِي وَاحِدَةً سَأَلْتُ رَبِّي أَنْ لَا يُهْلِكَ أُمَّتِي بِالسَّنَةِ فَأَعْطَانِيهَا وَسَأَلْتُهُ أَنْ لَا يُهْلِكَ أُمَّتِي بِالْغَرَقِ فَأَعْطَانِيهَا وَسَأَلْتُهُ أَنْ لَا يَجْعَلَ بَأْسَهُمْ بَيْنَهُمْ فَمَنَعَنِيهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14822,
                "hadithNumber": "7261",
                "englishNarrator": "Amir bin Sa'd reported on the authority of his father:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came with a group of his Companions and he passed by the mosque of Banu Mu'awiya. The rest of the hadith is the same.",
                "hadithUrdu": "وہ رسول اللہ صلی اللہ علیہ وسلم کے ہمراہ صحابہ کرام رضوان اللہ عنھم اجمعین کی ایک جماعت کے ساتھ آئے اور آپ بنو معاویہ کی مسجد کے قریب سے گزرے ۔ ( آگے ) ابن نمیرکی حدیث کے مانند ۔",
                "urduNarrator": "اور ہم سے ابن ابی عمر نے بیان کیا, مروان بن معاویہ نے کہا , ہمیں عثمان بن حکیم نے حدیث بیان کی ، کہا : مجھے عامر بن سعد نے اپنے والد ( سعد بن ابی وقاص رضی اللہ تعالیٰ عنہ ) سے خبر دی کہ",
                "hadithArabic": "و حَدَّثَنَاه ابْنُ أَبِي عُمَرَ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ حَدَّثَنَا عُثْمَانُ بْنُ حَكِيمٍ الْأَنْصَارِيُّ أَخْبَرَنِي عَامِرُ بْنُ سَعْدٍ عَنْ أَبِيهِ أَنَّهُ أَقْبَلَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي طَائِفَةٍ مِنْ أَصْحَابِهِ فَمَرَّ بِمَسْجِدِ بَنِي مُعَاوِيَةَ بِمِثْلِ حَدِيثِ ابْنِ نُمَيْرٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14823,
                "hadithNumber": "7262",
                "englishNarrator": "Hudhaifa bin al-Yaman رضی اللہ عنہ reported:",
                "hadithEnglish": "By Allah, I have the best knowledge amongst people about every turmoil which is going to appear in the period intervening me and the Last Hour; and it is not for the fact that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) told me something confidentially pertaining to it and he did not tell anybody else about it, but it is because of the fact that I was present in the assembly in which he had been describing the turmoil. and he especially made a mention of three turmoils which would not spare anything and amongst these there would be turmoils like storms in the hot season. Some of them would be violent and some of them would be comparatively mild. Hudhaifa رضی اللہ عنہ said: All (who were present) except I have gone (to the next world).",
                "hadithUrdu": "اللہ کی قسم!میں اب سے لے کر قیامت تک وقوع پذیر ہونے والے تمام فتنوں کے بارے میں باقی سب لوگوں کی نسبت زیادہ جانتاہوں ۔ اور ( انھیں بیان کرنےمیں ) میرے لیے اس کے سوا اور کوئی ( مانع ) نہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ان میں سے کوئی چیز راز کے طورپر مجھے بتائی تھی جو آپ نے میرے علاوہ کسی اور کو نہیں بتائی تھی ۔ ( ایسی باتیں میں کبھی بیان نہیں کروں گا ) البتہ رسول اللہ صلی اللہ علیہ وسلم نے ایک مجلس میں جہاں میں مو جود تھا فتنوں کو شمار کر رہے تھے : \" ان میں سے تین ( فتنے ) ایسے ہیں جو تقریباً کسی چیزکو باقی نہیں چھوڑیں گے اور ان میں سے کچھ فتنے ایسے ہیں جو موسم گرما کی آندھیوں کی طرح ہیں ان میں کچھ چھوٹے ہیں اور کچھ بڑے ہیں ۔ \" حضرت حذیفہ رضی اللہ عنہ نے کہا : میرے سوا وہ سب لوگ ( جو اس مجلس میں موجود تھے ) رخصت ہوگئے ۔",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ التجیبی نے بیان کیا، ہم سے ابن وہب نے بیان کیا, یونس نے مجھے ابن شہاب سے خبردی کہ ابو ادریس خولانی کہا کرتے تھے کہ حضرت حذیفہ بن یمان رضی اللہ تعالیٰ عنہ نے بیان کیا",
                "hadithArabic": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى التُّجِيبِيُّ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ أَنَّ أَبَا إِدْرِيسَ الْخَوْلَانِيَّ كَانَ يَقُولُ قَالَ حُذَيْفَةُ بْنُ الْيَمَانِ وَاللَّهِ إِنِّي لَأَعْلَمُ النَّاسِ بِكُلِّ فِتْنَةٍ هِيَ كَائِنَةٌ فِيمَا بَيْنِي وَبَيْنَ السَّاعَةِ وَمَا بِي إِلَّا أَنْ يَكُونَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسَرَّ إِلَيَّ فِي ذَلِكَ شَيْئًا لَمْ يُحَدِّثْهُ غَيْرِي وَلَكِنْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَهُوَ يُحَدِّثُ مَجْلِسًا أَنَا فِيهِ عَنْ الْفِتَنِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَعُدُّ الْفِتَنَ مِنْهُنَّ ثَلَاثٌ لَا يَكَدْنَ يَذَرْنَ شَيْئًا وَمِنْهُنَّ فِتَنٌ كَرِيَاحِ الصَّيْفِ مِنْهَا صِغَارٌ وَمِنْهَا كِبَارٌ قَالَ حُذَيْفَةُ فَذَهَبَ أُولَئِكَ الرَّهْطُ كُلُّهُمْ غَيْرِي.",
                "headingArabic": "إِخْبَارِ النَّبِيِّ صلى الله عليه وسلم فِيمَا يَكُونُ إِلَى قِيَامِ السَّاعَةِ",
                "headingUrdu": "قیامت کے شروع ہونے تک کیا ہو گا اس کے بارے میں نبی کی پیشین گوئی",
                "headingEnglish": "The Prophet's Foretelling Of What Will Happen Until The Hour Begins",
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14824,
                "hadithNumber": "7263",
                "englishNarrator": "Hudhaifa رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) stood before us one day and he did not leave anything unsaid (that he had to say) at that very spot which would happen (in the shape of turmoil) up to the Last Hour. Those who had to remember them preserved them in their minds and those who could not remember them forgot them. My friends knew them and there are certain things which slip out of my mind, but I recapitulate them when anyone makes a mention of them just as a person is lost from one's mind but is recalled to him on seeing his face.",
                "hadithUrdu": "ایک بار رسول اللہ صلی اللہ علیہ وسلم ہمارے سامنے کھڑے ہوئے اور آپ نے اپنے کھڑے ہونے کے اس وقت سے لے کر قیامت تک ہونے والی کوئی ( اہم ) بات نہ چھوڑی مگر اسے بیان فرمادیا جس نے اس ( بیان ) کو یاد رکھا اس نے اسے یاد رکھا اور جس نے اسے بھلادیا اس نے اسے بھلادیا ۔ وہ سب کچھ میرے ان ساتھیوں کے علم میں آیا پھر ان میں سے کوئی چیز پیش آتی ہے جو میں بھول چکا ہوتا ہوں تو جب اسے دیکھتا ہوں تو وہ مجھے یاد آجاتی ہے بالکل اسی طرح جیسے انسان کسی غائب ہو جانے والے شخص کا چہرہ یاد رکھتا ہے جب اسے دیکھتا ہے تو پہچان لیتا ہے ۔",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ اور اسحاق بن ابراہیم نے بیان کیا۔ عثمان نے کہا: ہم سے اسحاق نے بیان کیا, جریر نے اعمش سے انھوں نے شقیق سے اور انھوں نے حضرت حذیفہ رضی اللہ عنہ سے روایت کی کہا",
                "hadithArabic": "و حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ عُثْمَانُ حَدَّثَنَا و قَالَ إِسْحَقُ أَخْبَرَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ شَقِيقٍ عَنْ حُذَيْفَةَ قَالَ قَامَ فِينَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَقَامًا مَا تَرَكَ شَيْئًا يَكُونُ فِي مَقَامِهِ ذَلِكَ إِلَى قِيَامِ السَّاعَةِ إِلَّا حَدَّثَ بِهِ حَفِظَهُ مَنْ حَفِظَهُ وَنَسِيَهُ مَنْ نَسِيَهُ قَدْ عَلِمَهُ أَصْحَابِي هَؤُلَاءِ وَإِنَّهُ لَيَكُونُ مِنْهُ الشَّيْءُ قَدْ نَسِيتُهُ فَأَرَاهُ فَأَذْكُرُهُ كَمَا يَذْكُرُ الرَّجُلُ وَجْهَ الرَّجُلِ إِذَا غَابَ عَنْهُ ثُمَّ إِذَا رَآهُ عَرَفَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14825,
                "hadithNumber": "7264",
                "englishNarrator": "This hadith has been narrated on the authority of A'mash with the same chain of transmitters up to the words:",
                "hadithEnglish": "\"And he forgot who had to forget,\" that and. he did not make a mention of what follows after this.",
                "hadithUrdu": "\" اور جس نے اسے بھلادیا اس نے اسے بھلادیا \" روایت کی اور اس کے بعد کا حصہ بیان نہیں کیا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا کہ ہم سے وکیع نے بیان کیا, سفیان نے اعمش سے اسی سند کے ساتھ ان ( حذیفہ رضی اللہ تعالیٰ عنہ ) کے اس قول تک",
                "hadithArabic": "و حَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ إِلَى قَوْلِهِ وَنَسِيَهُ مَنْ نَسِيَهُ وَلَمْ يَذْكُرْ مَا بَعْدَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14826,
                "hadithNumber": "7265",
                "englishNarrator": "Hudhaifa رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) informed me of what is going to happen before the approach of the Last Hour. And there is nothing that I did not ask him in this connection except this that I did not ask him as to what would turn the people of Medina out from Medina.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے قیامت قائم ہونے تک جو کچھ ہونے والا ہے اس کی مجھے خبر دی اور ان میں سے کوئی چیز نہیں مگر میں نے آپ سے اس کے بارے میں سوال کیا البتہ میں نے آپ سے یہ سوال نہیں کیا کہ اہل مدینہ کو مدینہ سے کون سی چیز باہر نکالے گی ۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا, محمد بن جعفر غندرنے کہا : ہمیں شعبہ نے عدی بن ثابت سے حدیث بیان کی ، انھوں نے عبد اللہ بن یزید سے اور انھوں نے حضرت حذیفہ رضی اللہ عنہ سے روایت کی کہ انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ و حَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ حَدَّثَنَا غُنْدَرٌ حَدَّثَنَا شُعْبَةُ عَنْ عَدِيِّ بْنِ ثَابِتٍ عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ عَنْ حُذَيْفَةَ أَنَّهُ قَالَ أَخْبَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَا هُوَ كَائِنٌ إِلَى أَنْ تَقُومَ السَّاعَةُ فَمَا مِنْهُ شَيْءٌ إِلَّا قَدْ سَأَلْتُهُ إِلَّا أَنِّي لَمْ أَسْأَلْهُ مَا يُخْرِجُ أَهْلَ الْمَدِينَةِ مِنْ الْمَدِينَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14827,
                "hadithNumber": "7266",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters.",
                "hadithUrdu": "ہم سے محمد بن مثنیٰ نے بیان کیا, وہب بن جریر نے کہا , ہمیں شعبہ نے اسی سند کے ساتھ اسی کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنِي وَهْبُ بْنُ جَرِيرٍ أَخْبَرَنَا شُعْبَةُ بِهَذَا الْإِسْنَادِ نَحْوَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14828,
                "hadithNumber": "7267",
                "englishNarrator": "Abu Zaid (Amr bin Akhtab) رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) led us in the dawn prayer and then mounted the pulpit and addressed us until it was (time for the) noon prayer. He then came down the pulpit and observed prayer and then again mounted the pulpit and again addressed us until it was time for the 'Asr prayer. He then again came down and observed the prayer and again mounted the pulpit and addressed us until the sun was set and he informed (about) everything (pertaining to turmoil) that lay hidden in the past and what lies in (the womb) of) the future and the most learned amongst us is one who remembers them well.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ہمیں فجر کی نماز پڑھائی اور منبر پر رونق افروز ہوئے تو ہمیں خطبہ دیا یہاں تک کہ ظہر کی نماز کا وقت ہو گیا آپ ( منبرسے ) اترے ہمیں نماز پڑھائی پھر دوبارہ منبر پر رونق افروز ہوئے اور ( آگے ) خطبہ ارشاد فرمایا : یہاں تک کہ عصر کی نماز کا وقت ہوگیا پھر آپ اترے نماز پڑھائی اور پھر منبر پر تشریف لے گئے اور خطبہ دیا یہاں تک کہ سورج غروب ہو گیا ۔ آپ نے جو کچھ ہوا اور جو ہونے والاتھا ( سب ) ہمیں بتادیا ہم میں سے زیادہ جاننے والا وہی ہے جو یا دواشت میں دوسروں سے بڑھ کر ہے ۔",
                "urduNarrator": "مجھ سے یعقوب بن ابراہیم الدورقی اور حجاج بن الشاعر نے ابو عاصم کی سند سے بیان کیا,  حجاج نے کہا, ہم سے ابوعاصم نے بیان کیا، انہیں عذرا بن ثابت نے خبر دی، جس نے ہمیں خبر دی: علباء بن احمر نے کہا : حضرت ابو زید عمرو بن اخطب رضی اللہ عنہ نے مجھے بیان کیا کہا",
                "hadithArabic": "و حَدَّثَنِي يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ وَحَجَّاجُ بْنُ الشَّاعِرِ جَمِيعًا عَنْ أَبِي عَاصِمٍ قَالَ حَجَّاجٌ حَدَّثَنَا أَبُو عَاصِمٍ أَخْبَرَنَا عَزْرَةُ بْنُ ثَابِتٍ أَخْبَرَنَا عِلْبَاءُ بْنُ أَحْمَرَ حَدَّثَنِي أَبُو زَيْدٍ يَعْنِي عَمْرَو بْنَ أَخْطَبَ قَالَ صَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْفَجْرَ وَصَعِدَ الْمِنْبَرَ فَخَطَبَنَا حَتَّى حَضَرَتْ الظُّهْرُ فَنَزَلَ فَصَلَّى ثُمَّ صَعِدَ الْمِنْبَرَ فَخَطَبَنَا حَتَّى حَضَرَتْ الْعَصْرُ ثُمَّ نَزَلَ فَصَلَّى ثُمَّ صَعِدَ الْمِنْبَرَ فَخَطَبَنَا حَتَّى غَرَبَتْ الشَّمْسُ فَأَخْبَرَنَا بِمَا كَانَ وَبِمَا هُوَ كَائِنٌ فَأَعْلَمُنَا أَحْفَظُنَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14829,
                "hadithNumber": "7268",
                "englishNarrator": "Hudhaifa رضی اللہ عنہ reported:",
                "hadithEnglish": "We were one day in the company of 'Umar رضی اللہ عنہ that he said: Who amongst you has preserved in his mind most perfectly the hadith of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) in regard to the turmoil as he told about it? I said: It is I. Thereupon he said: You are bold (enough to make this claim). And he further said: How? I said: I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: There would (first) be turmoil for a person in regard to his family, his property, his own self, his children, his neighbours (and the sins committed in their connection) would be expiated by fasting, prayer, charity, enjoining good and prohibiting evil. Thereupon 'Umar رضی اللہ عنہ said: I do not mean (that turmoil on a small scale) but that one which would emerge like the mounting waves of the ocean. I said: Commander of the Faithful, you have nothing to do with it, for the door is closed between you and that. He said: Would that door be broken or opened? I said: No, it would be broken. Thereupon he said: Then it would not be closed despite best efforts. We said to Hudhaifa رضی اللہ عنہ : Did Umar know the door? Thereupon he said: Yes, he knew it (for certain) just as one knows that night precedes the next day. And I narrated to him something in which there was nothing fabricated. Shaqiq (one of the narrators) said: We dared not ask Hudhaifa رضی اللہ عنہ about that door. So we requested Masruq to ask him. So he asked him and he said: (By that door, he meant) 'Umar رضی اللہ عنہ .",
                "hadithUrdu": "ہم حضرت عمر رضی اللہ عنہ کے پاس بیٹھے ہوئے تھے کہ انھوں نے کہا : فتنے کے متعلق رسول اللہ صلی اللہ علیہ وسلم کا ارشاد جس طرح آپ نے خود فرمایا تھا تم میں سے کسی کو یاد ہے؟ ( حضرت حذیفہ رضی اللہ تعالیٰ عنہ نے ) کہا : میں نے عرض کی : مجھے ۔ ( حضرت عمر رضی اللہ عنہ نے ) کہا : تم بہت جرات مند ہو ۔ ( یہ بتاؤ کہ ) آپ صلی اللہ علیہ وسلم نے کس طرح ارشاد فرمایاتھا؟میں نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا تھا آپ فرما رہے تھے ۔ انسان اپنے گھروالوں اپنےمال اپنی جان اور اپنے ہمسائے کے بارے میں جس فتنے میں مبتلا ہوتاہے تو روزہ نماز ، صدقہ ، نیکی کا حکم کرنا اور برائی سے منع کرنا اس کا کفارہ بن جاتے ہیں ۔ تو حضرت عمر رضی اللہ تعالیٰ عنہ نے کہا : میری مراد اس سے نہیں میری مراد تواس ( فتنے ) سے ہے جو سمندر کی موجوں کی طرح امڈکرآتا ہے ۔ حضرت حذیفہ رضی اللہ عنہ نے کہا : امیر المؤمنین!آپ کو اس فتنے سے کیا ( خطرہ ) ہے؟آپ کے اور اس فتنے کے درمیان ایک بنددروازہ ہے ۔ انھوں نے کہا : وہ دروازہ توڑاجائے گا یا کھولا جا ئے گا؟کہا : میں نے جواب دیا نہیں بلکہ توڑاجائےگا ۔ ( حضرت عمر رضی اللہ تعالیٰ عنہ نے ) کہا : پھر اس بات کی زیادہ توقع ہے کہ وہ ( دروازہ دوبارہ ) کبھی بند نہیں کیا جا سکے گا ۔ ( شقیق نے ) کہا : ہم نے حضرت حذیفہ رضی اللہ تعالیٰ عنہ سے پوچھا کیا حضرت عمر رضی اللہ تعالیٰ عنہ جانتے تھے کہ دروازہ کون ہے؟انھوں نے کہا : ہاں اسی طرح جیسے وہ یہ بات جانتے تھے کہ صبح کے بعد رات ہے میں نے ان کو ایک حدیث بیان کی تھی وہ کوئی اٹکل بچو بات نہ تھی ۔ کہا : پھر ہم اس بات سے ڈرگئے کہ حضرت حذیفہ رضی اللہ تعالیٰ عنہ سے پوچھیں وہ دروازہ کون تھا؟ ہم نے مسروق سے کہا : آپ ان ( حضرت حذیفہ رضی اللہ تعالیٰ عنہ ) سے پوچھیں انھوں نے پوچھا تو ( حضرت حذیفہ رضی اللہ تعالیٰ عنہ نے ) کہا : ( وہ دروازہ ) حضرت عمر رضی اللہ تعالیٰ عنہ ( تھے ).",
                "urduNarrator": "ہم سے محمد بن عبداللہ بن نمیر اور محمد بن العلاء ابو کریب نے بیان کیا, ابو معاویہ نے کہا : ہمیں اعمش نے ( ابو وائل ) شقیق سے حدیث بیان کی انھوں نے حضرت حذیفہ رضی اللہ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ وَمُحَمَّدُ بْنُ الْعَلَاءِ أَبُو كُرَيْبٍ جَمِيعًا عَنْ أَبِي مُعَاوِيَةَ قَالَ ابْنُ الْعَلَاءِ حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ عَنْ شَقِيقٍ عَنْ حُذَيْفَةَ قَالَ كُنَّا عِنْدَ عُمَرَ فَقَالَ أَيُّكُمْ يَحْفَظُ حَدِيثَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْفِتْنَةِ كَمَا قَالَ قَالَ فَقُلْتُ أَنَا قَالَ إِنَّكَ لَجَرِيءٌ وَكَيْفَ قَالَ قَالَ قُلْتُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِتْنَةُ الرَّجُلِ فِي أَهْلِهِ وَمَالِهِ وَنَفْسِهِ وَوَلَدِهِ وَجَارِهِ يُكَفِّرُهَا الصِّيَامُ وَالصَّلَاةُ وَالصَّدَقَةُ وَالْأَمْرُ بِالْمَعْرُوفِ وَالنَّهْيُ عَنْ الْمُنْكَرِ فَقَالَ عُمَرُ لَيْسَ هَذَا أُرِيدُ إِنَّمَا أُرِيدُ الَّتِي تَمُوجُ كَمَوْجِ الْبَحْرِ قَالَ فَقُلْتُ مَا لَكَ وَلَهَا يَا أَمِيرَ الْمُؤْمِنِينَ إِنَّ بَيْنَكَ وَبَيْنَهَا بَابًا مُغْلَقًا قَالَ أَفَيُكْسَرُ الْبَابُ أَمْ يُفْتَحُ قَالَ قُلْتُ لَا بَلْ يُكْسَرُ قَالَ ذَلِكَ أَحْرَى أَنْ لَا يُغْلَقَ أَبَدًا قَالَ فَقُلْنَا لِحُذَيْفَةَ هَلْ كَانَ عُمَرُ يَعْلَمُ مَنْ الْبَابُ قَالَ نَعَمْ كَمَا يَعْلَمُ أَنَّ دُونَ غَدٍ اللَّيْلَةَ إِنِّي حَدَّثْتُهُ حَدِيثًا لَيْسَ بِالْأَغَالِيطِ قَالَ فَهِبْنَا أَنْ نَسْأَلَ حُذَيْفَةَ مَنْ الْبَابُ فَقُلْنَا لِمَسْرُوقٍ سَلْهُ فَسَأَلَهُ فَقَالَ عُمَرُ.",
                "headingArabic": "ي الْفِتْنَةِ الَّتِي تَمُوجُ كَمَوْجِ الْبَحْرِ",
                "headingUrdu": "وہ مصیبت جو سمندر کی لہروں کی طرح آئے گی۔",
                "headingEnglish": "The Tribulation That Will Come like Waves Of The Ocean",
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14830,
                "hadithNumber": "7269",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Hudhaifa رضی اللہ عنہ through other chains of transmitters also.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ اور ابو سعید اشجع نے بیان کیا , وکیع جریر عیسیٰ بن یونس اور یحییٰ بن عیسیٰ سب نے اعمش سے اسی سند کے ساتھ ابو معاویہ کی حدیث کی طرح حدیث بیان کی اور شقیق سے اعمش اور ان سے عیسیٰ کی حدیث میں یہ ( جملہ ) ہے کہا : میں نے حضرت حذیفہ رضی اللہ عنہ کو کہتے ہوئے سنا ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو سَعِيدٍ الْأَشَجُّ قَالَا حَدَّثَنَا وَكِيعٌ و حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ ح و حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا يَحْيَى بْنُ عِيسَى كُلُّهُمْ عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ نَحْوَ حَدِيثِ أَبِي مُعَاوِيَةَ وَفِي حَدِيثِ عِيسَى عَنْ الْأَعْمَشِ عَنْ شَقِيقٍ قَالَ سَمِعْتُ حُذَيْفَةَ يَقُولُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14831,
                "hadithNumber": "7270",
                "englishNarrator": "Hudhaifa رضی اللہ عنہ reported:",
                "hadithEnglish": "Umar رضی اللہ عنہ said: 'Who tell us about tribulation?'\" And he narrated a similar Hadith (as no. 7268).",
                "hadithUrdu": "حضرت عمر رضی اللہ عنہ نے کہا : کون ہے جو ہمیں فتنے کے بارے میں حدیث بیان کرے گا؟اور ( پھر ) ا ن سب کی حدیث کی طرح بیان کیا ۔",
                "urduNarrator": "ابن ابی عمر نے ہمیں حدیث بیان کی ، کہا : ہمیں سفیان نے جامع بن ابی راشد سے اور اعمش نے ابو وائل ( شقیق ) سے حدیث بیان کی ، انھوں نے حضرت حذیفہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ جَامِعِ بْنِ أَبِي رَاشِدٍ وَالْأَعْمَشُ عَنْ أَبِي وَائِلٍ عَنْ حُذَيْفَةَ قَالَ قَالَ عُمَرُ مَنْ يُحَدِّثُنَا عَنْ الْفِتْنَةِ وَاقْتَصَّ الْحَدِيثَ بِنَحْوِ حَدِيثِهِمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14832,
                "hadithNumber": "7271",
                "englishNarrator": "Jundub رضی اللہ عنہ reported:",
                "hadithEnglish": "I came on the day of Jara`a that a person was (found) sitting. I said: They would shed their blood today. That person said: By Allah not at all. I said: By Allah, of course, they would do it. He said: By Allah, they would not do it. I said: By Allah, of course, they would do it. He said: By Allah, they would not do it, and I have heard a hadith of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) which I am narrating to you in this connection. I said: You are a bad seat fellow. I have been opposing you since morning and you are listening to me in spite of the fact that you have heard a hadith from Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) (contrary to my statement). I myself felt that there was no use of this annoyance. (He could tell me earlier that it was a hadith of the Prophet (may peace be upon him], and I would not have opposed him at all.) I turned my face toward him and asked him and he was Hadrat Hudhaifa رضی اللہ عنہ .",
                "hadithUrdu": "میں جرعہ کے دن وہاں آیا تو ( وہاں ) ایک شخص بیٹھا ہوا تھا ۔ میں نے کہا : آج یہاں بہت خونریزی ہو گی ۔ اس شخص نے کہا : اللہ کی قسم!ہر گز نہیں ہو گی ۔ میں نے کہا : اللہ کی قسم!ضرورہو گی اس نے کہا : واللہ !ہر گز نہیں ہو گی ، میں نے کہا واللہ!ضرورہوگی اس نے کہا : واللہ!ہرگز نہیں ہو گی ، یہ اللہ کے رسول اللہ صلی اللہ علیہ وسلم کی حدیث ہے جو آپ نے مجھے ارشاد فرمائی تھی ۔ میں نے جواب میں کہا : آج تم میرے لیے آج کے بد ترین ساتھی ( ثابت ہوئے ) ہو ۔ تم مجھ سے سن رہے ہو کہ میں تمھاری مخالفت کرر ہا ہوں اور تم نے جو رسول اللہ صلی اللہ علیہ وسلم سے سناہےا س کی بنا پر مجھے روکتے نہیں؟پھر میں نے کہا : یہ غصہ کیسا؟چنانچہ میں ( ٹھیک طرح سے ) ان کی طرف متوجہ ہوا اور ان کے بارے میں پوچھا تو وہ آدمی حضرت حذیفہ رضی اللہ عنہ تھے ۔",
                "urduNarrator": "ہم سے محمد بن مثنیٰ اور محمد بن حاتم نے بیان کیا، کہا ہم سے معاذ بن معاذ نے بیان کیا، ہم سے ابن عون نے بیان کیا, محمد ( بن سیرین ) سے روایت ہے انھوں نے کہا : حضرت جندب رضی اللہ عنہ نے کہا",
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ حَاتِمٍ قَالَا حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ حَدَّثَنَا ابْنُ عَوْنٍ عَنْ مُحَمَّدٍ قَالَ قَالَ جُنْدُبٌ جِئْتُ يَوْمَ الْجَرَعَةِ فَإِذَا رَجُلٌ جَالِسٌ فَقُلْتُ لَيُهْرَاقَنَّ الْيَوْمَ هَاهُنَا دِمَاءٌ فَقَالَ ذَاكَ الرَّجُلُ كَلَّا وَاللَّهِ قُلْتُ بَلَى وَاللَّهِ قَالَ كَلَّا وَاللَّهِ قُلْتُ بَلَى وَاللَّهِ قَالَ كَلَّا وَاللَّهِ إِنَّهُ لَحَدِيثُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَنِيهِ قُلْتُ بِئْسَ الْجَلِيسُ لِي أَنْتَ مُنْذُ الْيَوْمِ تَسْمَعُنِي أُخَالِفُكَ وَقَدْ سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَا تَنْهَانِي ثُمَّ قُلْتُ مَا هَذَا الْغَضَبُ فَأَقْبَلْتُ عَلَيْهِ وَأَسْأَلُهُ فَإِذَا الرَّجُلُ حُذَيْفَةُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14833,
                "hadithNumber": "7272",
                "englishNarrator": "Abu Huraira رضی اللہ  عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The Last Hour would not come before the Euphrates uncovers a mountain of gold, for which people would fight. Ninety-nine out of each one hundred would die but every man amongst them would say that perhaps he would be the one who would be saved (and thus possess this gold).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" قیامت نہیں آئے گی ۔ یہاں تک کہ دریائے فرات سونے کے ایک پہاڑ کو ظاہر کرے گا ۔ اس پر ( لڑتے ہوئے ) ہر سو میں سے ننانوے لوگ مارے جائیں گے اور ان ( لڑنے والوں ) میں سے ہر کوئی کہے گا ۔ شاید میں ہی بچ جاؤں گا ۔ ( اور سارے سونے کا مالک بن جاؤں گا ۔ )",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, یعقوب بن عبد الرحمٰن القاری نے ہمیں سہیل سے حدیث بیان کی ، انھوں نے اپنے والد سے اور انھوں نے حضرت ابو ہریرہ رضی اللہ  عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا يَعْقُوبُ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْقَارِيَّ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَقُومُ السَّاعَةُ حَتَّى يَحْسِرَ الْفُرَاتُ عَنْ جَبَلٍ مِنْ ذَهَبٍ يَقْتَتِلُ النَّاسُ عَلَيْهِ فَيُقْتَلُ مِنْ كُلِّ مِائَةٍ تِسْعَةٌ وَتِسْعُونَ وَيَقُولُ كُلُّ رَجُلٍ مِنْهُمْ لَعَلِّي أَكُونُ أَنَا الَّذِي أَنْجُو.",
                "headingArabic": "لاَ تَقُومُ السَّاعَةُ حَتَّى يَحْسِرَ الْفُرَاتُ عَنْ جَبَلٍ مِنْ ذَهَبٍ",
                "headingUrdu": "قیامت اس وقت تک شروع نہیں ہوگی جب تک کہ فرات سونے کے پہاڑ سے پردہ نہ اٹھا لے",
                "headingEnglish": "The Hour Will Not Begin Until The Euphrates Uncovers A Mountain Of Gold",
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14834,
                "hadithNumber": "7273",
                "englishNarrator": "This hadith has been narrated on the authority of Suhail with the same chain of transmitters but with this addition:",
                "hadithEnglish": "My father said: If you see that, do not even go near it.",
                "hadithUrdu": "تو میرے والد نے کہا : اگر تم اس پہاڑ کو دیکھ لو تو اس کے قریب بھی مت جانا ۔",
                "urduNarrator": "مجھ سے امیہ بن بسطام نے بیان کیا، ہم سے یزید بن زریع نے بیان کیا, روح نے سہیل سے اسی سند کے ساتھ اسی کے مطابق حدیث بیان کی اور مزید کہا",
                "hadithArabic": "و حَدَّثَنِي أُمَيَّةُ بْنُ بِسْطَامَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا رَوْحٌ عَنْ سُهَيْلٍ بِهَذَا الْإِسْنَادِ نَحْوَهُ وَزَادَ فَقَالَ أَبِي إِنْ رَأَيْتَهُ فَلَا تَقْرَبَنَّهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14835,
                "hadithNumber": "7274",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The Last Hour would not come unless the Euphrates would uncover a treasure of gold, so he who finds it should not take anything out of that.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" عنقریب دریائے فرات سونے کے ایک خزانے کو ظاہر کردےگا جو شخص وہاں موجودہو تو وہ اس میں سے کچھ بھی نہ لے ۔ \"",
                "urduNarrator": "ہم سے ابومسعود سہل بن عثمان نے بیان کیا، کہا کہ ہم سے عقبہ بن خالد السکونی نے بیان کیا، انہوں نے عبید اللہ سے، انہوں نے خبیب بن عبدالرحمٰن کی سند سے, حفص بن عاصم نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو مَسْعُودٍ سَهْلُ بْنُ عُثْمَانَ حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ السَّكُونِيُّ عَنْ عُبَيْدِ اللَّهِ عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ حَفْصِ بْنِ عَاصِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُوشِكُ الْفُرَاتُ أَنْ يَحْسِرَ عَنْ كَنْزٍ مِنْ ذَهَبٍ فَمَنْ حَضَرَهُ فَلَا يَأْخُذْ مِنْهُ شَيْئًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14836,
                "hadithNumber": "7275",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The Euphrates would soon uncover a mountain of gold but he who is present there should not take anything from that.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" عنقریب دریائے فرات سونے کے ایک پہاڑ کو ظاہر کردےگا ۔ جو شخص وہاں موجود ہووہ اس میں سے کچھ نہ لے ۔ \"",
                "urduNarrator": "ہم سے سہل بن عثمان نے بیان کیا، ہم سے عقبہ بن خالد نے بیان کیا، انہوں نے عبید اللہ سے، وہ ابو الزناد سے, عبد الرحمٰن اعرج نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا سَهْلُ بْنُ عُثْمَانَ حَدَّثَنَا عُقْبَةُ بْنُ خالِدٍ عَنْ عُبَيْدِ اللَّهِ عَنْ أَبِي الزِّنَادِ عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُوشِكُ الْفُرَاتُ أَنْ يَحْسِرَ عَنْ جَبَلٍ مِنْ ذَهَبٍ فَمَنْ حَضَرَهُ فَلَا يَأْخُذْ مِنْهُ شَيْئًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14837,
                "hadithNumber": "7276",
                "englishNarrator": "`Abdullah bin Harith bin Naufal reported:",
                "hadithEnglish": "I was standing along with Ubayy bin Ka`b رضی اللہ عنہ and he said: The opinions of the people differ in regard to the achievement of worldly ends. I said: Yes, of course. Thereupon he said: I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: The Euphrates would soon uncover a mountain of gold and when the people would bear of it they would flock towards it but the people who would possess that (treasure) (would say): If we allow these persons to take out of it they would take away the whole of it. So they would fight and ninety-nine out of one hundred would be killed. Abu Kamil in his narration said: I and Ubayy bin Ka`b رضی اللہ عنہ stood under the shade of the battlement of Hassan.",
                "hadithUrdu": "میں حضرت ابی بن کعب رضی اللہ عنہ کے ساتھ کھڑا تھا تو انھوں نےکہا : دنیا کی طلب میں لوگوں کی گردنیں مسلسل ایک دوسرے سے مختلف ( اور باہمی جھگڑے اور عداوتیں جاری ) رہیں گی ۔ میں نے کہا : ہاں ( بالکل ایسے ہی ہو گا ) انھوں نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : \"\" ( وہ و قت ) قریب ہے کہ دریائےفرات سونے کے ایک پہاڑ کو ظاہر کرے گا ۔ جب لوگ اس کے بارے میں سنیں گے تو اس کی طرف چل نکلیں گے ۔ جو لوگ اس ( پہاڑ ) کے قریب ہوں گےوہ کہیں گے ۔ اگر ہم نے ( دوسرے ) لوگوں کو اس میں سے ( سونا ) لےجانے کی اجازت دے دی تو وہ سب کا سب لے جائیں گے کہا : وہ اس پر جنگ آزماہوں کے تو ہر سو میں سے ننانوے قتل ہو جائیں گے ۔ ابو کامل نے اپنی حدیث میں ( اس طرح ) کہا : انھوں نے کہا : میں اور حضرت ابی بن کعب رضی اللہ عنہ قلعہ حسان کے سائے میں ٹھہرے ہوئے تھے ۔",
                "urduNarrator": "ابو کامل فضیل بن حسین اور ابو معن رقاشی نے ہمیں حدیث بیان کی ۔ الفاظ ابومعن کے ہیں ۔ دونوں نے کہا : ہمیں خالد بن حارث نے حدیث بیان کی ، کہا : ہمیں عبد الحمید بن جعفر نے حدیث بیان کی ، انھوں نے کہا : مجھے میرے والد نے سلیمان بن یسار سے خبردی ، انھوں نے عبد اللہ بن حارث بن نوفل سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو كَامِلٍ فُضَيْلُ بْنُ حُسَيْنٍ وَأَبُو مَعْنٍ الرَّقَاشِيُّ وَاللَّفْظُ لِأَبِي مَعْنٍ قَالَا حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ أَخْبَرَنِي أَبِي عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ بْنِ نَوْفَلٍ قَالَ كُنْتُ وَاقِفًا مَعَ أُبَيِّ بْنِ كَعْبٍ فَقَالَ لَا يَزَالُ النَّاسُ مُخْتَلِفَةً أَعْنَاقُهُمْ فِي طَلَبِ الدُّنْيَا قُلْتُ أَجَلْ قَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يُوشِكُ الْفُرَاتُ أَنْ يَحْسِرَ عَنْ جَبَلٍ مِنْ ذَهَبٍ فَإِذَا سَمِعَ بِهِ النَّاسُ سَارُوا إِلَيْهِ فَيَقُولُ مَنْ عِنْدَهُ لَئِنْ تَرَكْنَا النَّاسَ يَأْخُذُونَ مِنْهُ لَيُذْهَبَنَّ بِهِ كُلِّهِ قَالَ فَيَقْتَتِلُونَ عَلَيْهِ فَيُقْتَلُ مِنْ كُلِّ مِائَةٍ تِسْعَةٌ وَتِسْعُونَ قَالَ أَبُو كَامِلٍ فِي حَدِيثِهِ قَالَ وَقَفْتُ أَنَا وَأُبَيُّ بْنُ كَعْبٍ فِي ظِلِّ أُجُمِ حَسَّانَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14838,
                "hadithNumber": "7277",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Iraq would withhold its dirhams and qafiz; Syria would withhold its mudd and dinar and Egypt would withhold its irdab and dinar and you would recoil to that position from where you started and you would recoil to that position from where you started and you would recoil to that position from where you started, the flesh and blood of Abu Huraira رضی اللہ عنہ would bear testimony to it.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ( میں دیکھ رہا ہوں کہ ) عراق نے اپنے درہم اور قفیر کو روک لیا ہے اور شام نے اپنا مدی اور دینار روک لیاہے اور مصر نے اپنا اردب اور دینار روک لیا ہے اور تم وہیں پہنچ گئے ہو جہاں سے تمھارا آغاز تھا اور تم وہیں پہنچ گئے ہو جہاں سے تمھارا آغاز تھا ۔ اور تم وہیں پہنچ گئےہو ۔ جہاں تمھارا آغاز تھا ۔ اس پر ابو ہریرہ رضی اللہ عنہ کا گوشت اور خون گواہ ہے ۔",
                "urduNarrator": "ہم سے عبید بن یعش اور اسحاق بن ابراہیم نے بیان کیا - اور قول عبید کا ہے - انہوں نے کہا : ہم سے خالد بن خالد کے موکل یحییٰ بن آدم بن سلیمان نے بیان کیا : ہم سے زہیر نے سہیل بن کی سند سے بیان کیا , ابو صالح نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ بْنُ يَعِيشَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ وَاللَّفْظُ لِعُبَيْدٍ قَالَا حَدَّثَنَا يَحْيَى بْنُ آدَمَ بْنِ سُلَيْمَانَ مَوْلَى خَالِدِ بْنِ خَالِدٍ حَدَّثَنَا زُهَيْرٌ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنَعَتْ الْعِرَاقُ دِرْهَمَهَا وَقَفِيزَهَا وَمَنَعَتْ الشَّأْمُ مُدْيَهَا وَدِينَارَهَا وَمَنَعَتْ مِصْرُ إِرْدَبَّهَا وَدِينَارَهَا وَعُدْتُمْ مِنْ حَيْثُ بَدَأْتُمْ وَعُدْتُمْ مِنْ حَيْثُ بَدَأْتُمْ وَعُدْتُمْ مِنْ حَيْثُ بَدَأْتُمْ شَهِدَ عَلَى ذَلِكَ لَحْمُ أَبِي هُرَيْرَةَ وَدَمُهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 14526,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=581",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=579",
                "label": "579",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=580",
                "label": "580",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=581",
                "label": "581",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=582",
                "label": "582",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=583",
                "label": "583",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=584",
                "label": "584",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=585",
                "label": "585",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=583",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=583",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=581",
        "to": 14550,
        "total": 40465
    }
}