{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 324,
        "data": [
            {
                "id": 8364,
                "hadithNumber": "800",
                "englishNarrator": "Ibn Abbas ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) dressed himself, and then went out for prayer, when he was presented with bread and meat. He took three morsels out of that, and then offered prayer along with other people and did not touch water.",
                "hadithUrdu": "رسول اللہﷺ نے اپنے کپڑے زیب تن فرمائے ، پھر نماز کے لیے نکلے تو آپ کو روٹی اور گوشت کا تحفہ پیش کیا گیا ، آپ نے تین لقمے تناول فرمائے ، پھر لوگوں کو نماز پڑھائی اور پانی کو نہیں چھوا ۔",
                "urduNarrator": "مجھ سے علی بن حجر نے بیان کیا، ہم سے اسماعیل بن جعفر نے بیان کیا,محمد بن عمرو بن حلحلہ نے محمد بن عمرو بن عطاء سے ، انہوں نے حضرت ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرِو بْنِ حَلْحَلَةَ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ: «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ جَمَعَ عَلَيْهِ ثِيَابَهُ ثُمَّ خَرَجَ إِلَى الصَّلَاةِ، فَأُتِيَ بِهَدِيَّةٍ خُبْزٍ وَلَحْمٍ، فَأَكَلَ ثَلَاثَ لُقَمٍ، ثُمَّ صَلَّى بِالنَّاسِ، وَمَا مَسَّ مَاءً».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8365,
                "hadithNumber": "801",
                "englishNarrator": "This hadith is narrated by Muhammad bin 'Amr bin Ata' with these words:",
                "hadithEnglish": "I was with Ibn 'Abbas رضی ‌اللہ ‌عنہ ‌, and Ibn 'Abbas ‌رضی ‌اللہ ‌عنہ saw the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) doing like this, and it is also said that the words are: He (the Holy Prophet) offered prayer; and the word people is not mentioned.",
                "hadithUrdu": "میں ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے ساتھ تھا .... اس کے بعد انہوں نے ابن حلحلہ کی روایت کے ہم معنیٰ حدیث بیان کی ہے اور اس میں یہ اضافہ ہے کہ ابن عباس ؓ موجود تھے اور یہ کہ انہوں نے ( ابن عباس ) نے صلى بالناس ( آپﷺ نے لوگوں کو نماز پڑھائی ) کے بجائے صلى ( آپﷺ نے نماز پڑھی ) کہا ۔",
                "urduNarrator": "ہم سے ابو کریب نے بیان کیا، ہم سے ابو اسامہ نے بیان کیا۔امام مسلم نے ایک دوسری سند سے ولید بن کثیر کے واسطے سے محمد بن عمرو بن عطاء سے روایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنِ الْوَلِيدِ بْنِ كَثِيرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرِو بْنِ عَطَاءٍ، قَالَ: كُنْتُ مَعَ ابْنِ عَبَّاسٍ، وَسَاقَ الْحَدِيثَ بِمَعْنَى حَدِيثِ ابْنِ حَلْحَلَةَ، وَفِيهِ أَنَّ ابْنَ عَبَّاسٍ، شَهِدَ ذَلِكَ مِنَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَقَالَ صَلَّى وَلَمْ يَقُلْ بِالنَّاسِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8366,
                "hadithNumber": "802",
                "englishNarrator": "Jabir bin Samura reported:",
                "hadithEnglish": "A man asked the Messenger of Allah (may peace he upon him) whether he should perform ablution after (eating) mutton. He (the Messenger of Allah) said: Perform ablution it you so desire, and if you do not wish, do not perform it. He (again) asked: Should I perform ablution (after eating) camel's flesh? He said: Yes, perform ablution (after eating) camel's flesh. He (again) said: May I say prayer in the sheepfolds? He (the Messenger of Allah) said: Yes. He (the narrator) again said: May I say prayer where camels lie down? He (the Holy Prophet) said: No.",
                "hadithUrdu": "ایک آدمی نے رسول اللہﷺ سے پوچھا : کیا میں بکری کے گوشت سے وضو کروں؟ آپ نے فرمایا : چاہو تو وضو کر لو اور چاہو تو نہ کرو ۔ ‘ ‘ اس نے کہا : اونٹ کے گوشت سے وضو کروں؟ آپ نے فرمایا : ہاں ، اونٹ کے گوشت سے وضو کرو ۔ ‘ ‘ اس نے کہا : کیا بکریوں کے باڑے میں نماز پڑھ لوں؟ آپ نے فرمایا : ’’ہاں ۔ ‘ ‘ اس نے کہا : اونٹوں کے بٹھانے ک جگہ میں نماز پڑھ لوں؟ آپ نے فرمایا : ’’نہیں ۔ ‘ ‘",
                "urduNarrator": "ابو کامل فضیل بن حسین جحدری نے کہا : ہمیں ابو عوانہ نے عثمان بن عبد اللہ بن موہب سے حدیث سنائی ، انہوں نے جعفر بن ابی ثور سے اور انہوں نے حضرت جابر بن سمرہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو كَامِلٍ فُضَيْلُ بْنُ حُسَيْنٍ الْجَحْدَرِيُّ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عُثْمَانَ بْنِ عَبْدِ اللهِ بْنِ مَوْهَبٍ، عَنْ جَعْفَرِ بْنِ أَبِي ثَوْرٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، أَنَّ رَجُلًا سَأَلَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَأَتَوَضَّأُ مِنْ لُحُومِ الْغَنَمِ؟ قَالَ: «إِنْ شِئْتَ فَتَوَضَّأْ، وَإِنْ شِئْتَ فَلَا تَوَضَّأْ» قَالَ أَتَوَضَّأُ مِنْ لُحُومِ الْإِبِلِ؟ قَالَ: «نَعَمْ فَتَوَضَّأْ مِنْ لُحُومِ الْإِبِلِ» قَالَ: أُصَلِّي فِي مَرَابِضِ الْغَنَمِ؟ قَالَ: «نَعَمْ» قَالَ: أُصَلِّي فِي مَبَارِكِ الْإِبِلِ؟ قَالَ: «لَا».",
                "headingArabic": "الْوُضُوءِ مِنْ لُحُومِ الإِبِلِ ‏",
                "headingUrdu": "اونٹ کا گوشت کھانے کے بعد وضو کرنا",
                "headingEnglish": "(Performing) wudu’ after eating camel meat",
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8367,
                "hadithNumber": "803",
                "englishNarrator": null,
                "hadithEnglish": "A Hadith similar to that of Abu Kamil from Abu Awanah was narrated from Jabir bin Samurah  ‌رضی ‌اللہ ‌عنہ ‌from the Prophet (ﷺ).",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے معاویہ بن عمرو نے بیان کیا، ہم سے زیدہ نے بیان کیا,سماک ، عثمان بن عبد اللہ بن موہب اور اشعث بن ابی شعثاء سب نے جعفر بن ابی ثور سے ، انہوں نے جابر بن سمرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اسی طرح حدیث بیان کی جس طرح ابو عوانہ سے ابو کامل نے روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو، حَدَّثَنَا زَائِدَةُ، عَنْ سِمَاكٍ، ح وَحَدَّثَنِي الْقَاسِمُ بْنُ زَكَرِيَّا، حَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُوسَى، عَنْ شَيْبَانَ، عَنْ عُثْمَانَ بْنِ عَبْدِ اللهِ بْنِ مَوْهَبٍ، وَأَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ، كُلُّهُمْ عَنْ جَعْفَرِ بْنِ أَبِي ثَوْرٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ أَبِي كَامِلٍ، عَنْ أَبِي عَوَانَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8368,
                "hadithNumber": "804",
                "englishNarrator": "Abbad bin Tamim reported from his uncle:",
                "hadithEnglish": "A person made a complaint to the Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) that he entertained (doubt) as it something had happened to him breaking his ablution. He (the Holy Prophet) said: He should not return (from prayer) unless he hears a sound or perceives a smell (of passing wind). Abu Bakr and Zuhair bin Harb have pointed out in their narrations that it was 'Abdullah bin Zaid ‌رضی ‌اللہ ‌عنہ ‌.",
                "hadithUrdu": "نبیﷺ سے ایک آدمی کے حوالے سے شکایت کی گئی کہ اسے یہ خیال آتا رہتا ہے کہ وہ نماز کے دوران میں کوئی چیز محسوس کرتا ہے ۔ آپ نے فرمایا : ’’ ( وہ نماز سے ) نہ ہٹے یہاں تک کہ کوئی آواز سنے یا کوئی بو محسوس کرے ۔ ‘ ‘ ابو بکر اور زہیر بن حرب نے اپنی روایت میں ( عباد بن تمیم کے چچا کے بارے میں ) بتایا کہ وہ عبد اللہ بن زید ‌رضی ‌اللہ ‌عنہ ‌ ‌ ہیں ۔",
                "urduNarrator": "عمرو ناقد ، زہیر بن حرب اور ابو بکر بن ابی شیبہ نے سفیان بن عیینہ سے ، انہوں نے زہری سے ، انہوں نے سعید ( بن مسیب ) اور عباد بن تمیم سے اور انہوں نے ان ( عباد ) کے چچا سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنِي عَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، ح، وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ - قَالَ عَمْرٌو: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدٍ، وَعَبَّادِ بْنِ تَمِيمٍ، عَنْ عَمِّهِ شُكِيَ إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: الرَّجُلُ، يُخَيَّلُ إِلَيْهِ أَنَّهُ يَجِدُ الشَّيْءَ فِي الصَّلَاةِ، قَالَ: «لَا يَنْصَرِفُ حَتَّى يَسْمَعَ صَوْتًا، أَوْ يَجِدَ رِيحًا» قَالَ أَبُو بَكْرٍ: وَزُهَيْرُ بْنُ حَرْبٍ فِي رِوَايَتِهِمَا هُوَ عَبْدُ اللهِ بْنُ زَيْدٍ.",
                "headingArabic": null,
                "headingUrdu": "اس بات کا ثبوت کہ اگر کسی شخص کو یقین ہو کہ وہ پاکیزگی کی حالت میں ہے تو اسے شک ہو کہ اس نے حدیث کا ارتکاب کیا ہے (وضو توڑ دیا) تو وہ اس طرح پاکی کے ساتھ نماز پڑھے۔",
                "headingEnglish": "Evidence that if a person is certain that he is in a state of purity, then he doubts whether he has committed hadith (broken his wudu’), then he prays with his purity like that",
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8369,
                "hadithNumber": "805",
                "englishNarrator": "Abu Huraira ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: If any one of you has pain in his abdomen, but is doubtful whether or not anything has issued from him, be should not leave the mosque unless he hears a sound or perceives a smell.",
                "hadithUrdu": "رسول اللہﷺ نے فرمایا : ’’جب تم میں سے کسی کو اپنے پیٹ میں کچھ محسوس ہو اور اسے شبہ ہو جائے کہ اس میں سے کچھ نکلا ہے یا نہیں تو ہر گز مسجد سے نہ نکلے یہاں تک کہ آواز سنے یا بو محسوس کر لے ۔ ‘ ‘",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، ہم سے جریر نے سہیل سے اور اپنے والد سے,حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے ، کہا",
                "hadithArabic": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا وَجَدَ أَحَدُكُمْ فِي بَطْنِهِ شَيْئًا، فَأَشْكَلَ عَلَيْهِ أَخَرَجَ مِنْهُ شَيْءٌ أَمْ لَا، فَلَا يَخْرُجَنَّ مِنَ الْمَسْجِدِ حَتَّى يَسْمَعَ صَوْتًا، أَوْ يَجِدَ رِيحًا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8370,
                "hadithNumber": "806",
                "englishNarrator": "It was narrated that Ibn Abbas said:",
                "hadithEnglish": "The freed slave-girl of Maimuna was given a goat in charity but it died. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) happened to pass by that (carcass). Upon this be said: Why did you not take off its skin? You could put it to use, after tanning it. They (the Companions) said: It was dead. Upon, this he (the Messenger of Allah) said: Only its eating is prohibited. Abu bakr and Ibn Umar in their narrations said: It is narrated from Maimuna ( رضی ‌اللہ ‌عنہا).",
                "hadithUrdu": "سیدہ میمونہ ؓ کی آزاد کردہ لونڈی کو صدقے میں بکری دی گئی ، وہ مر گئی ، رسول اللہﷺ اس کے پاس سے گزرے تو آپ نے فرمایا : ’’تم نے اس چمڑا کیوں نہ اتارا ، اس کو رنگ لیتے اور اس سے فائدہ اٹھا لیتے! ‘ ‘ لوگوں نے بتایا : یہ مردار ہے ۔ آپ نے فرمایا : بس اس کا کھانا حرام ہے ۔ ‘ ‘ ابو بکر اور ابن ابی عمر نے اپنی روایت میں عن ابن عباس ،  انہو ں میمونہ رضی ‌اللہ ‌عنہا کہا ( سند میں روایت ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے آگے میمونہؓ کی طرف منسوب کی ۔ )",
                "urduNarrator": "یحییٰ بن یحییٰ ، ابوبکر بن ابی شیبہ ، عمرو ناقد او رابن ابی عمر سب نے سفیان بن عیینہ سے ، انہوں نے زہری سے ، انہوں عبید اللہ بن عبد اللہ سے ، انہوں نے ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَابْنُ أَبِي عُمَرَ، جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، قَالَ يَحْيَى: أَخْبَرَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللهِ بْنِ عَبْدِ اللهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ: تُصُدِّقَ عَلَى مَوْلَاةٍ لِمَيْمُونَةَ بِشَاةٍ فَمَاتَتْ فَمَرَّ بِهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «هَلَّا أَخَذْتُمْ إِهَابَهَا فَدَبَغْتُمُوهُ فَانْتَفَعْتُمْ بِهِ؟» فَقَالُوا: إِنَّهَا مَيْتَةٌ فَقَالَ: «إِنَّمَا حَرُمَ أَكْلُهَا» قَالَ أَبُو بَكْرٍ، وَابْنُ أَبِي عُمَرَ، فِي حَدِيثِهِمَا عَنْ مَيْمُونَةَ رَضِيَ اللهُ عَنْهَا.",
                "headingArabic": "طَهَارَةِ جُلُودِ الْمَيْتَةِ بِالدِّبَاغِ",
                "headingUrdu": "مردہ جانوروں کی کھالوں کو ٹیننگ سے پاک کیا جاتا ہے۔",
                "headingEnglish": "Hides of dead animals are purified by tanning",
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8371,
                "hadithNumber": "807",
                "englishNarrator": "Ibn 'Abbas رضی ‌اللہ ‌عنہ ‌said:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) saw a dead goat, which had been given in charity to the freed slave-girl of Maimuna. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Why don't you make use of its skin? They (the Companions around the Holy Prophet) said: It is dead. Upon this he said: It is the eating (of the dead animal) which is prohibited.",
                "hadithUrdu": "سیدہ میمونہ ؓ کی آزاد کردہ لونڈی کو صدقے میں بکری دی گئی ، وہ مر گئی ، رسول اللہﷺ اس کے پاس سے گزرے تو آپ نے فرمایا : ’’تم نے اس چمڑا کیوں نہ اتارا ، اس کو رنگ لیتے اور اس سے فائدہ اٹھا لیتے! ‘ ‘ لوگوں نے بتایا : یہ مردار ہے ۔ آپ نے فرمایا : بس اس کا کھانا حرام ہے ۔ ‘ ‘ ابو بکر اور ابن ابی عمر نے اپنی روایت میں عن ابن عباس ، عن میمونہ کہا ( سند میں روایت ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے آگے میمونہؓ کی طرف منسوب کی ۔ )",
                "urduNarrator": "یحییٰ بن یحییٰ ، ابوبکر بن ابی شیبہ ، عمرو ناقد او رابن ابی عمر سب نے سفیان بن عیینہ سے ، انہوں نے زہری سے ، انہوں عبید اللہ بن عبد اللہ سے ، انہوں نے ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، قَالَا: حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللهِ بْنِ عَبْدِ اللهِ بْنِ عُتْبَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَجَدَ شَاةً مَيْتَةً أُعْطِيَتْهَا مَوْلَاةٌ لِمَيْمُونَةَ مِنَ الصَّدَقَةِ. فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «هَلَّا انْتَفَعْتُمْ بِجِلْدِهَا» قَالُوا: إِنَّهَا مَيْتَةٌ. فَقَالَ: «إِنَّمَا حَرُمَ أَكْلُهَا»",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8372,
                "hadithNumber": "808",
                "englishNarrator": null,
                "hadithEnglish": "This hadith is narrated by Ibn Shihab with the same chain of transmitters as transmitted by Yunus.",
                "hadithUrdu": "ہم سے حسن الحلوانی اور عبد بن حمید نے یہ سب بیان کیا، یعقوب بن ابراہیم بن سعد کی سند سے، میرے والد نے مجھ سے صالح کی سند سے، ابن شہاب کی سند سے بیان کیا۔ یونس کی روایت پر",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا حَسَنٌ الْحُلْوَانِيُّ، وَعَبْدُ بْنُ حُمَيْدٍ، جَمِيعًا عَنْ يَعْقُوبَ بْنِ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنِي أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، بِهَذَا الْإِسْنَادِ بِنَحْوِ رِوَايَةِ يُونُسَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8373,
                "hadithNumber": "809",
                "englishNarrator": "Ibn Abbas reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) happened to pass by a goat thrown (away) which had been in fact given to the freed slave-girl of Maimuna as charity. Upon this the Messenger of Allah (way peace he upon him) said: Why did they not get its skin? They had better tan it and make use of it.",
                "hadithUrdu": "رسول اللہﷺ ایک مردہ پڑی ہوئی بکری کے پاس سے گزرے جو میمونہؓ کی باندی کو بطور صدقہ دی گئی تھی تو نبی اکرمﷺ نے فرمایا : ’’انہوں نے اس کے چمڑے کو کیوں نہ اتارا ، وہ اس کو رنگ لیتے اور فائدہ اٹھا لیتے! ‘ ‘",
                "urduNarrator": "ہم سے ابن ابی عمر اور عبداللہ بن محمد الزہری نے بیان کیا - اور یہ لفظ ابن ابی عمر کا ہے - انہوں نے کہا,سفیان نے عمرو سے ، انہوں نے عطاء سے ، انہوں نے حضرت ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، وَعَبْدُ اللهِ بْنُ مُحَمَّدٍ الزُّهْرِيُّ، - وَاللَّفْظُ لِابْنِ أَبِي عُمَرَ -، قَالَا: حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِشَاةٍ مَطْرُوحَةٍ أُعْطِيَتْهَا مَوْلَاةٌ لِمَيْمُونَةَ مِنَ الصَّدَقَةِ، فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَلَّا أَخَذُوا إِهَابَهَا فَدَبَغُوهُ فَانْتَفَعُوا بِهِ؟».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8374,
                "hadithNumber": "810",
                "englishNarrator": "Ibn'Abbas رضی ‌اللہ ‌عنہ reported on the authority of Maimuna:",
                "hadithEnglish": "Someone amongst the wives of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had a domestic animal and it died. Upon this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Why did you not take off its skin and make use of that?",
                "hadithUrdu": "ایک بکری ، جو رسول اللہﷺ کی ایک بیوی کی تھی ، مر گئی تو رسول اللہﷺ نے فرمایا : ’’تم نے اس کا چمڑا اتار کر اس سے فائدہ کیوں نہیں اٹھایا! ‘ ‘",
                "urduNarrator": "ہم سے احمد بن عثمان النو فلی نے بیان کیا، کہا ہم سے ابو عاصم نے بیان کیا,ابن جریج نے عمرو بن دینار سے باقی ماندہ سابقہ سند کے ساتھ ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ حضرت میمونہؓ نے انہیں بتایا کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ عُثْمَانَ النَّوْفَلِيُّ، حَدَّثَنَا أَبُو عَاصِمٍ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ، أَخْبَرَنِي عَطَاءٌ، مُنْذُ حِينٍ قَالَ: أَخْبَرَنِي ابْنُ عَبَّاسٍ، أَنَّ مَيْمُونَةَ، أَخْبَرَتْهُ أَنَّ دَاجِنَةً كَانَتْ لِبَعْضِ نِسَاءِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ. فَمَاتَتْ. فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَلَّا أَخَذْتُمْ إِهَابَهَا فَاسْتَمْتَعْتُمْ بِهِ؟».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8375,
                "hadithNumber": "811",
                "englishNarrator": "Ibn 'Abbas ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) happened to pass by (the dead body) of the goat which belonged to the freed slave-girl of Maimuna and said: Why did you not make use of its skin?",
                "hadithUrdu": "نبی اکرمﷺ سیدہ میمونہؓ کی باندی کی ( مردہ ) بکری کے پاس سے گزرے تو آپ نے فرمایا : ’’تم نے اس کے چمڑے سے فائدہ کیوں نہ اٹھایا! ‘ ‘",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے عبدالرحیم بن سلیمان نے بیان کیا,عبد الملک بن ابی سلیمان نے عطاء کے حوالے سے حضرت ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ، عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِشَاةٍ لِمَوْلَاةٍ لِمَيْمُونَةَ. فَقَالَ: «أَلَّا انْتَفَعْتُمْ بِإِهَابِهَا؟».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8376,
                "hadithNumber": "812",
                "englishNarrator": "Abdullah bin Abbas said:",
                "hadithEnglish": "I heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) say: When the skin is tanned it becomes purified.",
                "hadithUrdu": "میں نے رسول اللہﷺ سے سنا ، آپ نے فرمایا : ’’جب چمڑے کو رنگ لیا جاتا ہے تو وہ پاک ہو جاتا ہے ۔ ‘ ‘",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا,سلیمان بن بلال نے زید بن اسلم سے ، انہوں نے عبد الرحمن بن وعلہ سے ، انہوں نے حضرت عبد اللہ بن عباسؓ کے حوالے سے خبر دی ، کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا سُلَيْمَانُ بْنُ بِلَالٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ وَعْلَةَ، أَخْبَرَهُ عَنْ عَبْدِ اللهِ بْنِ عَبَّاسٍ، قَالَ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِذَا دُبِغَ الْإِهَابُ فَقَدْ طَهُرَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8377,
                "hadithNumber": "813",
                "englishNarrator": null,
                "hadithEnglish": "A hadith similar to that of Yahya bin Yahya was narrated from the prophet ﷺ.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ اور عمرو نقید نے بیان کیا، کہا,سفیان بن عیینہ ، عبد العزیز بن محمد اور سفیان ثوری نے مختلف سندوں کے ساتھ زید بن اسلم کی سابقہ سند کے ساتھ نبیﷺ سے اسی طرح روایت بیان کی ، یعنی یحییٰ بن یحییٰ کی حدیث کی طرح ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، قَالَا: حَدَّثَنَا ابْنُ عُيَيْنَةَ، ح، وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُحَمَّدٍ، ح، وَحَدَّثَنَا أَبُو كُرَيْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ جَمِيعًا عَنْ وَكِيعٍ، عَنْ سُفْيَانَ، كُلُّهُمْ عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ وَعْلَةَ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ يَعْنِي حَدِيثَ يَحْيَى بْنِ يَحْيَى.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8378,
                "hadithNumber": "814",
                "englishNarrator": "Abu al-Khair reported:",
                "hadithEnglish": "I saw Ibn Wa'la al-Saba'i wear a fur. I touched it. He said: Why do you touch it? I asked Ibn 'Abbas saying: We are the inhabitants of the western regions, and there (live) with us Berbers and Magians. They bring with them rams and slaughter them, but we do not eat (the meat of the animals) slaughtered by them, and they come with skins full of fat. Upon this Ibn 'Abbas said: We asked the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) about this and he said: Its tanning makes it pure.",
                "hadithUrdu": "میں نے علی بن وعلہ سبائی کو ایک پوستین ( چمڑے کا کوٹ ) پہنے ہوئے دیکھا ، میں نے اسے چھوا تو اس نے کہا : اسے کیوں چھوتے ہو؟ میں نے عبد اللہ بن عباسؓ سے پوچھا تھا : ہم مغرب میں ہوتے ہیں اور ہمارے ساتھ بربر اور مجوسی ہوتے ہیں ، ہمارے پاس مینڈھا لایا جاتا ہے جسے انہوں نے ذبح کیا ہوتا ہے اور ہم ان کے ذبح کیے ہوئے جانور نہیں کھاتے ، وہ ہمارے پاس مشکیزہ لاتے ہیں جس میں وہ چربی ڈالتے ہیں ۔ تو ابن عباسؓ نے جواب دیا : ہم نے رسول اللہﷺ سے اس کے بارے میں پوچھا تھا ۔ آپ نے فرمایا : ’’ اس کو رنگنا اس کو پاک کر دیتا ہے ۔ ‘ ‘",
                "urduNarrator": "مجھ سے اسحاق بن منصور نے بیان کیا، اور مجھ سے ابوبکر بن اسحاق نے بیان کیا، انہوں نے کہا: ہم سے ابوبکر نے بیان کیا، اور ہم سے ابن منصور نے بیان کیا, ہم سے عمرو بن ربیع نے بیان کیا، کہا کہ ہم سے یحییٰ بن ایوب نے بیان کیا،یزید بن ابی حبیب نے ابو خیر سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، وَأَبُو بَكْرِ بْنُ إِسْحَاقَ، - قَالَ: أَبُو بَكْرٍ، حَدَّثَنَا وَقَالَ ابْنُ مَنْصُورٍ: - أَخْبَرَنَا عَمْرُو بْنُ الرَّبِيعِ، أَخْبَرَنَا يَحْيَى بْنُ أَيُّوبَ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، أَنَّ أَبَا الْخَيْرِ، حَدَّثَهُ قَالَ: رَأَيْتُ عَلَى ابْنِ وَعْلَةَ السَّبَئِيِّ، فَرْوًا فَمَسِسْتُهُ، فَقَالَ: مَا لَكَ تَمَسُّهُ؟ قَدْ سَأَلْتُ عَبْدَ اللهِ بْنَ عَبَّاسٍ قُلْتُ: إِنَّا نَكُونُ بِالْمَغْرِبِ. وَمَعَنَا الْبَرْبَرُ وَالْمَجُوسُ نُؤْتَى بِالْكَبْشِ قَدْ ذَبَحُوهُ، وَنَحْنُ لَا نَأْكُلُ ذَبَائِحَهُمْ، وَيَأْتُونَا بِالسِّقَاءِ يَجْعَلُونَ فِيهِ الْوَدَكَ، فَقَالَ: ابْنُ عَبَّاسٍ، قَدْ سَأَلْنَا رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ؟ فَقَالَ: «دِبَاغُهُ طَهُورُهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8379,
                "hadithNumber": "815",
                "englishNarrator": "Ibn Wa'la al-Saba'i reported:",
                "hadithEnglish": "I asked 'Abdullah bin 'Abbas saying: We are the inhabitants of the western regions. The Magians come to us with skins full of water and fat. He said: Drink. I said to him: Is it your own opinion? Ibn Abbas said: I heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) say: Tanning purifies it (the skin).",
                "hadithUrdu": "میں نے عبد اللہ بن عباسؓ سے پوچھا : ہم مغرب میں ہوتے ہیں تو مجوسی ہمارے پاس پانی اور چربی کے مشکیزے لاتے ہیں ۔ انہوں نے کہا : پی لیا کرو ۔ میں نے پوچھا : کیا آپ اپنی رائےبتا رہے ہیں؟ ابن عباسؓ نے جواب دیا : میں نے رسول اللہﷺ کو فرماتے ہوئے سناے : ’’ اس کو رنگنا اس کو پاک کر دیتا ہے ۔ ‘ ‘",
                "urduNarrator": "مجھ سے اسحاق بن منصور اور ابوبکر بن اسحاق نے بیان کیا، عمرو بن ربیع کی سند سے، ہم سے یحییٰ بن ایوب نے بیان کیا,جعفر بن ربیعہ نے ابو خیر سے روایت کی ، کہا : مجھ سے ابن وعلہ سبائی نے بیان کیا کہ",
                "hadithArabic": "وَحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، وَأَبُو بَكْرِ بْنُ إِسْحَاقَ، عَنْ عَمْرِو بْنِ الرَّبِيعِ، أَخْبَرَنَا يَحْيَى بْنُ أَيُّوبَ، عَنْ جَعْفَرِ بْنِ رَبِيعَةَ، عَنْ أَبِي الْخَيْرِ، حَدَّثَهُ قَالَ: حَدَّثَنِي ابْنُ وَعْلَةَ السَّبَإِيُّ، قَالَ: سَأَلْتُ عَبْدَ اللهِ بْنَ عَبَّاسٍ، قُلْتُ: إِنَّا نَكُونُ بِالْمَغْرِبِ فَيَأْتِينَا الْمَجُوسُ بِالْأَسْقِيَةِ فِيهَا الْمَاءُ وَالْوَدَكُ، فَقَالَ: اشْرَبْ. فَقُلْتُ: أَرَأْيٌ تَرَاهُ؟ فَقَالَ: ابْنُ عَبَّاسٍ سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «دِبَاغُهُ طَهُورُهُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8380,
                "hadithNumber": "816",
                "englishNarrator": "A'isha reported:",
                "hadithEnglish": "We went with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) on one of his journeys and when we reached the place Baida' or Dhat al-jaish, my necklace was broken (and fell somewhere). The Messenger of Allah (way peace be upon him) along with other people stayed there for searching it. There was neither any water at that place nor was there any water with them (the Companions of the Holy Prophet). Some persons came to my father Abu Bakr and said: Do you see what 'A'isha has done? She has detained the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and persons accompanying him, and there is neither any water here or with them. So Abu Bakr came there and the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was sleeping with his head on my thigh. He (Abu Bakr) said: You have detained the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and other persons and there is neither water here nor with them. She ('A'isha) said: Abu Bakr رضی ‌اللہ ‌عنہ ‌scolded me and uttered what Allah wanted him to utter and nudged my hips with his hand. And there was nothing to prevent me from stirring but for the fact that the messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was lying upon my thigh. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) slept till it was dawn at a waterless place. So Allah revealed the verses pertaining to tayammum and they (the Prophet and his Companions) performed tayammum. Usaid bin al-Hudair رضی ‌اللہ ‌عنہ ‌who was one of the leaders said: This is not the first of your blessings,0 Family to Abu Bakr رضی ‌اللہ ‌عنہ ‌. 'A'isha said: We made the came) stand which was my mount and found the necklace under it.",
                "hadithUrdu": "ہم رسول اللہﷺ کے ایک سفر میں آپ کے ساتھ نکلے ، جب ہم بیداء یا ذات الجیش کے مقام پر پہنچے تو میرا ہار ٹوٹ کر گر گیا ، رسول اللہﷺ اس کی تلاش کی خاطر ٹھہر گئے ، صحابہ کرام ‌رضی ‌اللہ ‌عنہ ‌ ‌ بھی آپ کے ساتھ رک گئے ، نہ وہ پانی ( والی جگہ ) پر تھے نہ ان کے پاس پانی ( بچا ہوا ) تھا ۔ لوگ ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے پاس آئے اور کہا : کیا آپ کو پتہ نہیں ، عائشہؓ نے کیا کیا ہے؟ رسول اللہﷺ اور آپ کے ساتھ ( دوسرے ) لوگوں کو روک رکھا ہے ، نہ وہ پانی ( والی جگہ ) پر ہیں اور نہ لوگوں کے پاس پانی بچا ہے ۔ ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ تشریف لائے ( اس وقت ) رسول اللہﷺ میری ران پر سر رکھ کر سو چکے تھے اور کہا : تم نے رسول اللہﷺ کو اور آپ کے ساتھیوں کو روک رکھا ہے جبکہ نہ وہ پانی والی جگہ پر ہیں اور نہ ان کے پاس پانی ہے ۔ عائشہؓ نے فرمایا : حضرت ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے مجھے ڈانٹا اور جو کچھ اللہ کو منظور رتھا کہا اور اپنے ہاتھ سے میری کوکھ میں کچوکے لگانے لگے ، مجھے صرف اس بات نے حرکت کرنے سے روکے رکھا کہ رسو ل اللہﷺ کا سر میری ران پر تھا ، رسول اللہﷺ سوئے رہے اور پانی کے بغیر ہی صبح ہو گی ۔ اس پر اللہ تعالیٰ نے تیمم کی آیت اتاری تو صحابہ کرام ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے تیمم کیا ۔ اسید بن حضیر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ، جو نقباء میں سے تھے ، کہا : اے ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے خاندان! یہ آپ کی پہلی برکت نہیں ہے ۔ حضرت عائشہؓ نے کہا : ہم نے اس اونٹ کو جس پر میں سوار تھی اٹھایا تو ہمیں اس کے نیچے سے ہار مل گیا ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے مالک رضی اللہ عنہ کے پاس عبدالرحمٰن بن القاسم رضی اللہ عنہ کے والد کے واسطہ سے پڑھا,انہوں نے حضرت عائشہؓ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ: خَرَجْنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي بَعْضِ أَسْفَارِهِ، حَتَّى إِذَا كُنَّا بِالْبَيْدَاءِ - أَوْ بِذَاتِ الْجَيْشِ - انْقَطَعَ عِقْدٌ لِي، «فَأَقَامَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى الْتِمَاسِهِ، وَأَقَامَ النَّاسُ مَعَهُ، وَلَيْسُوا عَلَى مَاءٍ، وَلَيْسَ مَعَهُمْ مَاءٌ»، فَأَتَى النَّاسُ إِلَى أَبِي بَكْرٍ فَقَالُوا: أَلَا تَرَى إِلَى مَا صَنَعَتْ عَائِشَةُ؟ «أَقَامَتْ بِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَبِالنَّاسِ مَعَهُ، وَلَيْسُوا عَلَى مَاءٍ، وَلَيْسَ مَعَهُمْ مَاءٌ»، فَجَاءَ أَبُو بَكْرٍ وَرَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَاضِعٌ رَأْسَهُ عَلَى فَخِذِي قَدْ نَامَ، فَقَالَ: حَبَسْتِ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَالنَّاسَ وَلَيْسُوا عَلَى مَاءٍ، وَلَيْسَ مَعَهُمْ مَاءٌ «، قَالَتْ فَعَاتَبَنِي أَبُو بَكْرٍ، وَقَالَ مَا شَاءَ اللهُ أَنْ يَقُولَ، وَجَعَلَ يَطْعُنُ بِيَدِهِ فِي خَاصِرَتِي،» فَلَا يَمْنَعُنِي مِنَ التَّحَرُّكِ إِلَّا مَكَانُ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى فَخِذِي، فَنَامَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حَتَّى أَصْبَحَ عَلَى غَيْرِ مَاءٍ، فَأَنْزَلَ اللهُ آيَةَ التَّيَمُّمِ فَتَيَمَّمُوا فَقَالَ أُسَيْدُ بْنُ الْحُضَيْرِ: - وَهُوَ أَحَدُ النُّقَبَاءِ - «مَا هِيَ بِأَوَّلِ بَرَكَتِكُمْ يَا آلَ أَبِي بَكْرٍ» فَقَالَتْ عَائِشَةُ: «فَبَعَثْنَا الْبَعِيرَ الَّذِي كُنْتُ عَلَيْهِ فَوَجَدْنَا الْعِقْدَ تَحْتَهُ»",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8381,
                "hadithNumber": "817",
                "englishNarrator": "A'isha reported:",
                "hadithEnglish": "She had borrowed from Asma' (her sister) a necklace and it was lost. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sent men to search for it. As it was the time for prayer, they offered prayer without ablution (as water was not available there). When they came to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), they made a complaint about it, and the verses pertaining to tayammum were revealed. Upon this Usaid bin Hadair ‌رضی ‌اللہ ‌عنہ said (to 'A'isha): May Allah grant you a good reward! Never has been there an occasion when you were beset with difficulty and Allah did not make you come out of that and made it an occasion of blessing for the Muslims.",
                "hadithUrdu": "انہوں نے حضرت اسماء ؓ سے عاریتاً ہار لیا ، وہ گم ہو گیا تو رسول اللہﷺ نے اپنے کچھ ساتھیوں کو اس کی تلاش کے لیے بھیجا ۔ ان کی نماز کا وقت آ گیا تو انہوں نے بغیر وضو کے نماز پڑھ لی اور جب نبی اکرمﷺ کی خدمت میں حاضر ہوئے تو آپ سے اس بات کی شکایت کی ، ( اس پر ) تیمم کی آیت اتری تو اسید بن حضیر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ( حضرت عائشہؓ سے ) کہا : اللہ آپ کو بہترین جزا دے ، اللہ کی قسم! آپ کو کبھی کوئی مشکل معاملہ پیش نہیں آیا مگر اللہ تعالیٰ نے آپ کے لیے اس سے نکلنے کی سبیل پیدا کر دی اور اسی میں مسلمانوں کے لیے برکت رکھ کر دی ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے ابو اسامہ ایچ نے بیان کیا، کہا ہم سے ابو کریب نے بیان کیا، کہا ہم سے ابو اسامہ اور ابن بشر نے بیان کیا,ہشام کے والد عروہ بن زبیر نے حضرت عائشہؓ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ ح، وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، وَابْنُ بِشْرٍ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّهَا اسْتَعَارَتْ مِنْ أَسْمَاءَ قِلَادَةً فَهَلَكَتْ، «فَأَرْسَلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَاسًا مِنْ أَصْحَابِهِ فِي طَلَبِهَا، فَأَدْرَكَتْهُمُ الصَّلَاةُ، فَصَلَّوْا بِغَيْرِ وُضُوءٍ، فَلَمَّا أَتَوُا النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ شَكَوْا ذَلِكَ إِلَيْهِ، فَنَزَلَتْ آيَةُ التَّيَمُّمِ» فَقَالَ أُسَيْدُ بْنُ حُضَيْرٍ: «جَزَاكِ اللهُ خَيْرًا، فَوَاللهِ مَا نَزَلَ بِكِ أَمْرٌ قَطُّ، إِلَّا جَعَلَ اللهُ لَكِ مِنْهُ مَخْرَجًا وَجَعَلَ لِلْمُسْلِمِينَ فِيهِ بَرَكَةً».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8382,
                "hadithNumber": "818",
                "englishNarrator": "Shaqiq reported:",
                "hadithEnglish": "I was sitting in the company of Abdullah and Abu Musa when Abu Musa said: O 'Abd al-Rahman (kunya of 'Abdullah bin Mas'ud رضی ‌اللہ ‌عنہ), what would you like a man to do about the prayer if he experiences a seminal emission or has sexual intercourse but does not find water for a month? 'Abdullah رضی ‌اللہ ‌عنہ ‌said: He should not perform tayammum even if he does not find water for a month. 'Abdullah رضی ‌اللہ ‌عنہ ‌said: Then what about the verse in Sura Ma'ida: If you do not find water, betake yourself to clean dust ? 'Abdullah said: If they were granted concession on the basis of this verse, there is a possibility that they would perform tayammum with dust on finding water very cold for themselves. Abu Musa رضی ‌اللہ ‌عنہ ‌said to Abdullah: You have not heard the words of 'Ammar: The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) sent me on an errand and I had a seminal emission, but could find no water, and rolled myself in dust just as a beast rolls itself. I came to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) then and made a mention of that to him and he (the Holy Prophet) said: It would have been enough for you to do thus. Then he struck the ground with his hands once and wiped his right hand with the help of his left hand and the exterior of his palms and his face. 'Abdullah رضی ‌اللہ ‌عنہ ‌said: Didn't you see that Umar رضی ‌اللہ ‌عنہ ‌was not fully satisfied with the words of 'Ammar only?",
                "hadithUrdu": "میں حضرت عبد اللہ ( بن مسعود ) اور ابو موسیٰ ؓ کے بیٹھا ہوا تھا ۔ حضرت ابو موسیٰ نے پوچھا : ابو عبد الرحمن! بتائیےاگر انسان حالت جنابت میں ہو اور ایک ماہ تک اسے پانی نہ ملے تو وہ نماز کا کیا کرے؟ اس پر حضرت عبد اللہ ( بن مسعود ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) نے جواب دیا : وہ تیمم نہ کرے ، چاہے اسے ایک ماہ تک پانی نہ ملے ۔ اس پر ابو موسیٰ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : تو سورہ مائدہ کی اس آیت کا کیا مطلب ہے : ’’تم پانی نہ پاؤ تو پاک مٹی سے تیمم کرو؟ ‘ ‘ اس پر عبد اللہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے جواب دیا : اگر انہیں اس آیت کی بنا پر رخصت دے دی گئی تو خطرہ ہے جب انہیں پانی ٹھنڈا محسوس ہو گا تو وہ مٹی سے تیمم کر لیں گے ۔ ابو موسیٰ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے عبد اللہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے کہا : کیا آپ نے عمار کی یہ بات نہیں سنی کہ مجھے رسول اللہﷺ نے کسی کام کے لیے بھیجا ، مجھے جنابت ہو گئی اور پانی نہ ملا تو میں چوپائے کی طرح مٹی میں لوٹ پوٹ ہوا ( اور نماز پڑھ لی ) ، پھر میں نبی اکرمﷺ کے پاس آیا اور آپ سے اس کا تذکرہ کیا تو آپ نے فرمایا : ’’تمہارے لیے بس اپنے دونوں ہاتھوں سے اس طرح کرنا کافی تھا ۔ ‘ ‘ پھر آپﷺ نے اپنے دونوں ہاتھ ایک بار زمین پر مارے ، پھر بائیں ہاتھ کو دائیں پر اور اپنی دونوں ہتھیلیوں کی پشت پر اور اپنے چہرے پر ملا ۔ تو عبد اللہ ( بن مسعود ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) نے جواب دیا : کیا تمہیں معلوم نہیں کہ حضرت عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ عمار کی بات پر مطمئن نہیں ہوئے تھے ۔ ( تفصیل آگے حدیث : 820 میں ہے ۔ )",
                "urduNarrator": "یحییٰ بن یحییٰ، ابوبکر بن ابی شیبہ اور ابن نمیر نے ابومعاویہ کی سند سے کہا,ابو معاویہ نے اعمش سے ، انہوں نے شقیق سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ نُمَيْرٍ، جَمِيعًا عَنْ أَبِي مُعَاوِيَةَ، قَالَ أَبُو بَكْرٍ: حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ شَقِيقٍ، قَالَ: كُنْتُ جَالِسًا مَعَ عَبْدِ اللهِ، وَأَبِي مُوسَى، فَقَالَ أَبُو مُوسَى: يَا أَبَا عَبْدِ الرَّحْمَنِ أَرَأَيْتَ لَوْ أَنَّ رَجُلًا أَجْنَبَ فَلَمْ يَجِدِ الْمَاءَ شَهْرًا كَيْفَ يَصْنَعُ بِالصَّلَاةِ؟ فَقَالَ عَبْدُ اللهِ: لَا يَتَيَمَّمُ وَإِنْ لَمْ يَجِدِ الْمَاءَ شَهْرًا. فَقَالَ أَبُو مُوسَى: فَكَيْفَ بِهَذِهِ الْآيَةِ فِي سُورَةِ الْمَائِدَةِ {فَلَمْ تَجِدُوا مَاءً فَتَيَمَّمُوا صَعِيدًا طَيِّبًا} [النساء: 43]. فَقَالَ عَبْدُ اللهِ: لَوْ رُخِّصَ لَهُمْ فِي هَذِهِ الْآيَةِ لَأَوْشَكَ إِذَا بَرَدَ عَلَيْهِمُ الْمَاءُ أَنْ يَتَيَمَّمُوا بِالصَّعِيدِ، فَقَالَ أَبُو مُوسَى، لِعَبْدِ اللهِ: أَلَمْ تَسْمَعْ قَوْلَ عَمَّارٍ بَعَثَنِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي حَاجَةٍ فَأَجْنَبْتُ فَلَمْ أَجِدِ الْمَاءَ، فَتَمَرَّغْتُ فِي الصَّعِيدِ كَمَا تَمَرَّغُ الدَّابَّةُ ثُمَّ أَتَيْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَذَكَرْتُ ذَلِكَ لَهُ فَقَالَ: «إِنَّمَا كَانَ يَكْفِيكَ أَنْ تَقُولَ بِيَدَيْكَ هَكَذَا» ثُمَّ ضَرَبَ بِيَدَيْهِ الْأَرْضَ ضَرْبَةً وَاحِدَةً، ثُمَّ مَسَحَ الشِّمَالَ عَلَى الْيَمِينِ، وَظَاهِرَ كَفَّيْهِ، وَوَجْهَهُ فَقَالَ: عَبْدُ اللهِ أَوَلَمْ تَرَ عُمَرَ لَمْ يَقْنَعْ بِقَوْلِ عَمَّارٍ؟",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8383,
                "hadithNumber": "819",
                "englishNarrator": "It was narrated that Shaqiq said:",
                "hadithEnglish": "\"Abu Musa رضی ‌اللہ ‌عنہ ‌said to 'Abdullah....\" and he quoted a hadith similar to that of Abu Muaviyah, except that he said: The Messenger of Allah ﷺ said: ' It would have been sufficient for you to do like this,' and he struck his hands on the ground, then he shook off the dust and wiped his face and hands.\"",
                "hadithUrdu": "ابو موسیٰ اشعری ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے عبد اللہ ( بن مسعود ) ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے پوچھا ... پھر ابو معاویہ کی ( سابقہ ) حدیث پورے واقعے سمیت بیان کی ، مگر یہ کہ انہوں نے کہا : رسول اللہﷺ نے فرمایا : ’’ تمہارے لیے اس طرح کر لینا ہی کافی تھا ۔ ‘ ‘ اور اپنے دونوں ہاتھ زمین پر مارے ، ( پھر ) اپنے دونوں ہاتھ جھاڑے اور اپنے چہرے اور ہتھیلیوں پر مسح کیا ۔",
                "urduNarrator": "ابو کامل الجہدری نے ہم سے کہا,عبد الواحد نے کہا , ہمیں اعمش نے شقیق سے حدیث بیان کی ، کہا",
                "hadithArabic": "وَحَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا الْأَعْمَشُ، عَنْ شَقِيقٍ، قَالَ: قَالَ أَبُو مُوسَى، لِعَبْدِ اللهِ: وَسَاقَ الْحَدِيثَ بِقِصَّتِهِ نَحْوَ حَدِيثِ أَبِي مُعَاوِيَةَ غَيْرَ أَنَّهُ قَالَ: فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّمَا كَانَ يَكْفِيكَ أَنْ تَقُولَ هَكَذَا» وَضَرَبَ بِيَدَيْهِ إِلَى الْأَرْضِ فَنَفَضَ يَدَيْهِ فَمَسَحَ وَجْهَهُ وَكَفَّيْهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8384,
                "hadithNumber": "820",
                "englishNarrator": "Abdul-Rabmin bin Abza narrated It on the authority of his father:",
                "hadithEnglish": "A man came to 'Umar رضی ‌اللہ ‌عنہ ‌and said: I am (at times) affected by seminal emission but find no water. He ('Umar رضی ‌اللہ ‌عنہ ‌) told him not to say prayer. 'Ammar then said. Do you remember, O Commander of the Faithful, when I and you were in a military detachment and we had had a seminal emission and did not find water (for taking bath) and you did not say prayer, but as for myself I rolled in dust and said prayer, and (when it was mentioned before) the Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: It was enough for you to strike the ground with your hands and then blow (the dust) and then wipe your face and palms. Umar رضی ‌اللہ ‌عنہ said: 'Ammar, fear Allah. He said: If you so like, I would not narrate it. A hadith like this has been transmitted with the same chain of transmitters but for the words: 'Umar رضی ‌اللہ ‌عنہ said: We hold you responsible for what you claim.",
                "hadithUrdu": "ایک آدمی حضرت عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے پاس آیا اور پوچھا : میں جنبی ہو گیا ہوں اور مجھے پانی نہیں ملا ۔ تو انہوں نے جواب دیا : نماز نہ پڑھ ۔ اس پر حضرت عمار ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : امیر المؤمنین! کیا آپ کو یاد نہیں ، جب میں اور آپ ایک فوجی دستے میں تھے تو ہم جنبی ہو گئے اور پانی نہ ملا تو آپ نے نماز نہ پڑھی اور میں مٹی میں لوٹ پوٹ ہو گیا اور نماز پڑھ لی تو نبی اکرمﷺ نے فرمایا : ’’تمہارے لیے بس اتنا ہی کافی تھا کہ اپنے دونوں ہاتھ زمین پر مارتے ، پھر ان میں پھونک مار کر ان دونوں سے اپنے چہرے اور اپنی ہتھیلیوں کا مسح کر لیتے ۔ ‘ ‘ حضرت عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : اے عمار! اللہ سے ڈرو ۔ ( عمار ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ) جواب دیا : اگر آپ چاہتے ہیں تو میں یہ واقعہ بیان نہیں کرتا ۔ حکم نے کہا : یہی روایت مجھے ( ذر کے واسطے کے بغیر ) ابن عبد الرحمن بن ابزیٰ نے اپنے والد سے براہ راست بھی سنائی جو بعینہ ذر کی حدیث کی طرح تھی ۔ کہا : مجھے سلمہ نے ذر کے حوالے سے حکم کی بیان کردہ سند کے ساتھ یہ حدیث بیان کی کہ حضرت عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : آپ نے جس چیز ( کی ذمہ داری ) کو اٹھا لیا ہے ہم اسے آپ ہی پر ڈالتے ہیں ( آپ اپنے اعتماد پر یہ روایت بیان کر سکتے ہیں ۔ )",
                "urduNarrator": "مجھ سے عبداللہ بن ہاشم العبدی نے بیان کیا، انہوں نے ہم سے بیان کیا, یحییٰ بن سعید قطان نے شعبہ سے حدیث بیان کی ، کہا : مجھ سے حکم نے ذر ( بن عبد اللہ بن زرارہ ) سے ، انہوں نے سعید بن عبد الرحمن بن ابزیٰ سے اور انہوں نے اپنے والد سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللهِ بْنُ هَاشِمٍ الْعَبْدِيُّ، حَدَّثَنَا يَحْيَى يَعْنِي ابْنَ سَعِيدٍ الْقَطَّانَ، عَنْ شُعْبَةَ، قَالَ: حَدَّثَنِي الْحَكَمُ، عَنْ ذَرٍّ، عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى، عَنْ أَبِيهِ، أَنَّ رَجُلًا أَتَى عُمَرَ، فَقَالَ: إِنِّي أَجْنَبْتُ فَلَمْ أَجِدْ مَاءً فَقَالَ: لَا تُصَلِّ. فَقَالَ عَمَّارٌ: أَمَا تَذْكُرُ يَا أَمِيرَ الْمُؤْمِنِينَ، إِذْ أَنَا وَأَنْتَ فِي سَرِيَّةٍ فَأَجْنَبْنَا فَلَمْ نَجِدْ مَاءً، فَأَمَّا أَنْتَ فَلَمْ تُصَلِّ، وَأَمَّا أَنَا فَتَمَعَّكْتُ فِي التُّرَابِ وَصَلَّيْتُ، فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّمَا كَانَ يَكْفِيكَ أَنْ تَضْرِبَ بِيَدَيْكَ الْأَرْضَ، ثُمَّ تَنْفُخَ، ثُمَّ تَمْسَحَ بِهِمَا وَجْهَكَ، وَكَفَّيْكَ» فَقَالَ عُمَرُ: اتَّقِ اللهَ يَا عَمَّارُ قَالَ: إِنْ شِئْتَ لَمْ أُحَدِّثْ بِهِ قَالَ الْحَكَمُ: وَحَدَّثَنِيهِ ابْنُ عَبْدِ الرَّحْمَنِ بْنُ أَبْزَى، عَنْ أَبِيهِ، مِثْلَ حَدِيثِ ذَرٍّ قَالَ: وَحَدَّثَنِي سَلَمَةُ، عَنْ ذَرٍّ، فِي هَذَا الْإِسْنَادِ الَّذِي ذَكَرَ الْحَكَمُ، فَقَالَ عُمَرُ: نُوَلِّيكَ مَا تَوَلَّيْتَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8385,
                "hadithNumber": "821",
                "englishNarrator": "Abdul-Rahman bin Abza mnated it on the authority of his father:",
                "hadithEnglish": "A man came to Umar and said: I have had a seminal emission but I found no water, and the rest of the hadith is the same but with this addition: 'Amr said: 0 Commander of the Faithful, because of the right given to you by Allah over me, if you desire, I would not narrate this hadith to anyone.",
                "hadithUrdu": "ایک آدمی حضرت عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے پاس آیا اور پوچھا : میں جنبی ہو گیا ہوں اور مجھے پانی نہیں ملا ۔ اس کے بعد ( مذکورہ بالا ) حدیث بیان کی اور اس میں یہ اضافہ کیا کہ عمار ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : اے امیر المؤمنین! اگر آپ چاہیں تو آپ کے اس حق کی بنا پر جو اللہ تعالیٰ نے مجھ پر رکھا ہے ، میں یہ حدیث کسی کو نہ سناؤں گا ۔ اور ( شعبہ نے یہاں ) مجھے سلمہ نے ذر حدیث بیان کی ( کے الفاظ ) کا ذکر نہیں کیا ۔",
                "urduNarrator": "اسحاق بن منصور نے مجھ سے کہا,نضر بن شمیل نے شعبہ سے باقی ماندہ سابقہ سند کے ساتھ روایت کی کہ, میں نے ذر کو ابن عبدالرحمٰن بن عبزی سے سنا",
                "hadithArabic": "وَحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ، أَخْبَرَنَا شُعْبَةُ، عَنِ الْحَكَمِ، قَالَ: سَمِعْتُ ذَرًّا، عَنِ ابْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى، قَالَ: قَالَ الْحَكَمُ: وَقَدْ سَمِعْتُهُ مِنِ ابْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى، عَنْ أَبِيهِ، أَنَّ رَجُلًا أَتَى عُمَرَ فَقَالَ: إِنِّي أَجْنَبْتُ فَلَمْ أَجِدْ مَاءً. وَسَاقَ الْحَدِيثَ وَزَادَ فِيهِ، قَالَ عَمَّارٌ: يَا أَمِيرَ الْمُؤْمِنِينَ إِنْ شِئْتَ لِمَا جَعَلَ اللهُ عَلَيَّ مِنْ حَقِّكَ لَا أُحَدِّثُ بِهِ أَحَدًا، وَلَمْ يَذْكُرْ حَدَّثَنِي سَلَمَةُ، عَنْ ذَرٍّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8386,
                "hadithNumber": "822",
                "englishNarrator": "Umair, the freed slave of Ibn 'Abbas, reported:",
                "hadithEnglish": "I and 'Abd al-Rahmin b. Yasir, the freed slave of Maimuna, the wife of the Apostle (way peace be upon him). came to the house of Abu'l-Jahm b. al-Harith al-Simma Ansari and he said: The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came from the direction of Bi'r Jamal and a man met him; he saluted him but the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) made no response, till he (the Holy Prophet) came to the wall, wiped his face and hands and then returned his salutations.",
                "hadithUrdu": "میں اور عبد الرحمن بن یسار ، جو نبی اکرمﷺ کی زوجہ حضرت میمونہؓ کے آزاد کردہ غلام تھے ، ابو جہم بن حارث بن صمہ انصاری کے پاس پہنچے تو ابو جہم ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے بتایا کہ رسول اللہﷺ بئر جمل ( نامی جگہ ) سے تشریف لائے تو آپ کو ایک آدمی ملا ، اس نے آپ کو سلام کہا تو آپ نے اس کے سلام کا جواب نہ دیا حتیٰ کہ آپ ایک دیوار کی طرف بڑھے اور آپ نے اپنے چہرے اور ہاتھوں پر مسح کیا ، پھر اس کے سلام کا جواب دیا ۔",
                "urduNarrator": "مسلم نے کہا اور لیث بن سعد نے جعفر بن ربیعہ کی سند سے، عبدالرحمٰن بن ہرمز کی سند سے، حضرت ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے آزاد کردہ غلام عمیر بیان کرتے ہیں کہ",
                "hadithArabic": "قَالَ مُسْلِمٌ، وَرَوَى اللَّيْثُ بْنُ سَعْدٍ، عَنْ جَعْفَرِ بْنِ رَبِيعَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ، عَنْ عُمَيْرٍ، مَوْلَى ابْنِ عَبَّاسٍ، أَنَّهُ سَمِعَهُ يَقُولُ: أَقْبَلْتُ أَنَا وَعَبْدُ الرَّحْمَنِ بْنُ يَسَارٍ، مَوْلَى مَيْمُونَةَ زَوْجِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ. حَتَّى دَخَلْنَا عَلَى أَبِي الْجَهْمِ بْنِ الْحَارِثِ بْنِ الصِّمَّةِ الْأَنْصَارِيِّ، فَقَالَ أَبُو الْجَهْمِ: «أَقْبَلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنْ نَحْوِ بِئْرِ جَمَلٍ، فَلَقِيَهُ رَجُلٌ فَسَلَّمَ عَلَيْهِ، فَلَمْ يَرُدَّ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَيْهِ، حَتَّى أَقْبَلَ عَلَى الْجِدَارِ فَمَسَحَ وَجْهَهُ وَيَدَيْهِ، ثُمَّ رَدَّ عَلَيْهِ السَّلَامُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8387,
                "hadithNumber": "823",
                "englishNarrator": "Ibn Umar reported:",
                "hadithEnglish": "A person happened to pass by the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) when he was making water and saluted him, but he did not respond to his salutation.",
                "hadithUrdu": "ایک آدمی گزرا جبکہ رسول اللہﷺ پیشاب کر رہے تھے ، تو اس نے سلام کہا ، آپ ﷺ نے اسے سلام کا جواب نہ دیا ۔",
                "urduNarrator": "ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا، کہا ہم سے میرے والد نے بیان کیا، کہا ہم سے سفیان نے بیان کیا، وہ ضحاک بن عثمان کی سند سے، وہ نافع کی سند سے,حضرت ابن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا سُفْيَانُ، عَنِ الضَّحَّاكِ بْنِ عُثْمَانَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ: «أَنَّ رَجُلًا مَرَّ وَرَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَبُولُ، فَسَلَّمَ، فَلَمْ يَرُدَّ عَلَيْهِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8388,
                "hadithNumber": "824",
                "englishNarrator": "Hudhaifa reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) happened to meet him and he was (sexually) defiled, and he slipped away and took a bath and then came and said: I was (sexually) defiled. Upon this he (the Holy Prophet) remarked: A Muslim is never defiled.",
                "hadithUrdu": "رسول اللہﷺ مدینہ کے راستوں میں میں سے کسی راستے پر انہیں ملے تو وہ کھسک گئے اور جا کر غسل کیا ۔ نبیﷺ نے انہیں تلاش کروایا ۔ جب وہ آپ کی خدمت میں آئے تو آپ نے فرمایا : ’’ابو ہریرہ! تم کہاں تھے؟ ‘ ‘ انہوں نے عرض کی! اے اللہ کے رسولﷺ! جب آپ مجھے ملے تو میں جنابت کی حالت میں تھا ، میں نے غسل کیے بغیر آپ کے پاس بیٹھنا پسند نہ کیا ۔ رسول اللہﷺ نے فرمایا : ’’سبحان اللہ! مومن ناپاک ( نجس ) نہیں ہوتا ۔ ‘ ‘ ( یعنی اس طرح ناپاک نہیں ہوتا کہ اسے کوئی چھو جائے ، قریب بیٹھے یا اس سے ہاتھ ملائے تو وہ بھی ناپاک ہو جائے ۔ )",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے یحییٰ نے بیان کیا، یعنی ابن سعید نے، کہا کہ ہم سے حمید نے بیان کیا، اور ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، اور اس کا لفظ یہ ہے کہ ہم سے اسماعیل بن اولیہ نے حمید کی سند سے بیان کیا۔ اطویل، ابو رافع کی روایت سے،حضرت ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ وہ جنابت کی حالت میں تھے کہ",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى، - يَعْنِي ابْنَ سَعِيدٍ - قَالَ حُمَيْدٌ حَدَّثَنَا ح، وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ لَقِيَهُ النَّبِيُّ صلى الله عليه وسلم فِي طَرِيقٍ مِنْ طُرُقِ الْمَدِينَةِ وَهُوَ جُنُبٌ فَانْسَلَّ فَذَهَبَ فَاغْتَسَلَ فَتَفَقَّدَهُ النَّبِيُّ صلى الله عليه وسلم فَلَمَّا جَاءَهُ قَالَ ‏\"‏ أَيْنَ كُنْتَ يَا أَبَا هُرَيْرَةَ ‏\"‏ ‏.‏ قَالَ يَا رَسُولَ اللَّهِ لَقِيتَنِي وَأَنَا جُنُبٌ فَكَرِهْتُ أَنْ أُجَالِسَكَ حَتَّى أَغْتَسِلَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ سُبْحَانَ اللَّهِ إِنَّ الْمُؤْمِنَ لاَ يَنْجُسُ ‏\"‏ ‏.‏",
                "headingArabic": "الدَّلِيلِ عَلَى أَنَّ الْمُسْلِمَ لاَ يَنْجُسُ ‏‏",
                "headingUrdu": "اس بات کا ثبوت کہ مسلمان نجس نہیں ہوتا",
                "headingEnglish": "Evidence that the Muslim does not become impure",
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 8076,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=323",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=321",
                "label": "321",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=322",
                "label": "322",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=323",
                "label": "323",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=324",
                "label": "324",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=325",
                "label": "325",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=326",
                "label": "326",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=327",
                "label": "327",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=325",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=325",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=323",
        "to": 8100,
        "total": 40465
    }
}