{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 532,
        "data": [
            {
                "id": 13564,
                "hadithNumber": "6001",
                "englishNarrator": "This hadith has been transmitted on the authority of Anas bin Malik رضی اللہ عنہ with this addition:",
                "hadithEnglish": "More numerous than stars in the sky.",
                "hadithUrdu": "\" یا آسمان کے ستاروں سے زیادہ د ( کھائی دیتے ہیں ۔ ) \"",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، ہم سے حسن بن موسیٰ نے بیان کیا، شیبان نے قتادہ سے روایت کی کہا : ہمیں حضرت انس بن مالک رضی اللہ عنہ نے حدیث سنائی کہ اللہ کے نبی صلی اللہ علیہ وسلم نے فر ما یا ۔ اس ( سابقہ روایت ) کے مانند اور مزید بیان کیا",
                "hadithArabic": "وحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى، حَدَّثَنَا شَيْبَانُ، عَنْ قَتَادَةَ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ أَنَّ نَبِيَّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ مِثْلَهُ وَزَادَ «أَوْ أَكْثَرُ مِنْ عَدَدِ نُجُومِ السَّمَاءِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13565,
                "hadithNumber": "6002",
                "englishNarrator": "Jabir bin Samura رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Behold, I shall be present ahead of you on the Cistern, and the distance between its different sides would be like that between Sana' and Aila, and its jugs would be like stars in the sky.",
                "hadithUrdu": "آپ نے فرمایا : \" سنو! میں حوض پر تمھا را پیش رو ہو ں گا اور اس ( حوض ) کے دوکناروں کا فاصلہ صنعاء اور ایلہ کے مابین فاصلے کی طرح ہے ۔ اس میں کو زےستاروں جیسے لگتے ہیں ۔",
                "urduNarrator": "مجھ سے ولید بن شجاع بن الولید السکونی نے بیان کیا، میرے والد رحمہ اللہ نے بیان کیا، مجھ سے زیاد بن خیثمہ نے بیان کیا، سماک بن حرب نے حضرت جا بربن سمرہ رضی اللہ عنہ سے انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي الْوَلِيدُ بْنُ شُجَاعِ بْنِ الْوَلِيدِ السَّكُونِيُّ، حَدَّثَنِي أَبِي رَحِمَهُ اللهُ، حَدَّثَنِي زِيَادُ بْنُ خَيْثَمَةَ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَلَا إِنِّي فَرَطٌ لَكُمْ عَلَى الْحَوْضِ، وَإِنَّ بُعْدَ مَا بَيْنَ طَرَفَيْهِ كَمَا بَيْنَ صَنْعَاءَ وَأَيْلَةَ، كَأَنَّ الْأَبَارِيقَ فِيهِ النُّجُومُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13566,
                "hadithNumber": "6003",
                "englishNarrator": "Amir bin Sa'd bin Abu Waqqas reported:",
                "hadithEnglish": "I wrote (a letter) to Jabir bin Samura رضی اللہ عنہ (and it was sent) through my servant Nafi' asking him to inform me about something (pertaining to the Haud Kauthar). He wrote to me: I heard him (the Holy Prophet) say: I shall be there ahead of you at the Haud Kauthar.",
                "hadithUrdu": "میں نے اپنے غلام نافع کے ہاتھ حضرت جابر بن سمرہ رضی اللہ عنہ کو خط بھیجا کہ آپ مجھے کو ئی ایسی چیز بتا ئیں ۔ جو آپ رسول اللہ صلی اللہ علیہ وسلم سے سنی ہو ، انھوں نے مجھے ( جواب میں ) لکھا : میں نے آپ صلی اللہ علیہ وسلم کو یہ فرماتے ہو ئے سناہے ۔ \" میں حوض پر ( تمھا را ) پیش رو ہو ں گا ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید اور ابوبکر بن ابی شیبہ نے بیان کیا، کہا کہ ہم سے حاتم بن اسماعیل نے المہاجر بن مسمار کی سند سے بیان کیا، عامر بن سعد بن ابی وقاص نے کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، قَالَا: حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، عَنِ الْمُهَاجِرِ بْنِ مِسْمَارٍ، عَنْ عَامِرِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ، قَالَ: كَتَبْتُ إِلَى جَابِرِ بْنِ سَمُرَةَ مَعَ غُلَامِي نَافِعٍ، أَخْبِرْنِي بِشَيْءٍ سَمِعْتَهُ مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: فَكَتَبَ إِلَيَّ إِنِّي سَمِعْتُهُ يَقُولُ: «أَنَا الْفَرَطُ عَلَى الْحَوْضِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13567,
                "hadithNumber": "6004",
                "englishNarrator": "Sa`d رضی اللہ عنہ reported:",
                "hadithEnglish": "On the Day of Uhud I saw on the right side of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and on his left side two persons dressed in white clothes and whom I did not see before nor after that, and they were Gabriel and Michael (Allah be pleased with both of them).",
                "hadithUrdu": "میں نے احد کے دن رسول اللہ صلی اللہ علیہ وسلم کے دائیں اور بائیں دوآدمیوں کو دیکھا وہ سفید لباس میں تھے ، ان کو نہ میں نے اس سے پہلے کبھی دیکھا تھا نہ بعد میں یعنی حضرت جبرئیل علیہ السلام اور مکائیل علیہ السلام کو ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، انہیں محمد بن بشر نے اور ہم سے ابو اسامہ نے بیان کیا, مسعرنے سعد بن ابرا ہیم سے ، انھوں نے اپنے والد سے ، انھوں نے حضرت سعد رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، وَأَبُو أُسَامَةَ، عَنْ مِسْعَرٍ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِيهِ، عَنْ سَعْدٍ، قَالَ: «رَأَيْتُ عَنْ يَمِينِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَعَنْ شِمَالِهِ يَوْمَ أُحُدٍ رَجُلَيْنِ عَلَيْهِمَا ثِيَابُ بَيَاضٍ، مَا رَأَيْتُهُمَا قَبْلُ وَلَا بَعْدُ، يَعْنِي جِبْرِيلَ وَمِيكَائِيلَ عَلَيْهِمَا السَّلَامُ».",
                "headingArabic": "فِي قِتَالِ جِبْرِيلَ وَمِيكَائِيلَ عَنِ النَّبِيِّ صلى الله عليه وسلم يَوْمَ أُحُدٍ ‏‏",
                "headingUrdu": "فرشتے آپ صلی اللہ علیہ وسلم کے ساتھ مل کر لڑے",
                "headingEnglish": "The Angels Fought Alongside Him (SAW)",
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13568,
                "hadithNumber": "6005",
                "englishNarrator": "Sa'd bin Abu Waqqas رضی اللہ عنہ reported:",
                "hadithEnglish": "I saw on the right side of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and on his left side two persons with white clothes on the Day of Uhud fighting a desperate fight, and I saw them neither before nor after that.",
                "hadithUrdu": "میں نے احد کے دن رسول اللہ صلی اللہ علیہ وسلم کے دائیں اور بائیں سفید کپڑوں میں ملبوس دوآدمی دیکھے وہ آپ کی طرف سے شدت کے ساتھ جنگ کر رہے تھے ۔ میں نے ان کو نہ اس سے پہلے دیکھا تھا نہ بعد میں کبھی دیکھا ۔ \"",
                "urduNarrator": "مجھ سے اسحاق بن منصور نے بیان کیا، ہمیں عبدالصمد بن عبد الوارث نے خبر دی، ابرا ہیم بن سعد نے کہا : ہمیں سعد نے اپنے والد ( ابراہیم ) سے انھوں نے حضرت سعد بن ابی وقاص رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، حَدَّثَنَا سَعْدٌ، عَنْ أَبِيهِ، عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ، قَالَ: «لَقَدْ رَأَيْتُ يَوْمَ أُحُدٍ عَنْ يَمِينِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَعَنْ يَسَارِهِ رَجُلَيْنِ عَلَيْهِمَا ثِيَابٌ بِيضٌ، يُقَاتِلَانِ عَنْهُ كَأَشَدِّ الْقِتَالِ مَا رَأَيْتُهُمَا قَبْلُ وَلَا بَعْدُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13569,
                "hadithNumber": "6006",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was the sublimest among people (in character) and the most generous amongst them and he was the bravest of men. One night the people of Medina felt disturbed and set forth in the direction of a sound when Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) met them on his way back as he had gone towards that sound ahead of them. He was on the horse of Abu Talha  رضی اللہ عنہ which had no saddle over it, and a sword was slung round his neck, and he was saying: There was nothing to be afraid of, and he also said: We found it (this horse) like a torrent of water (indicating its swift-footedness), whereas the horse had been slow before that time.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم تمام انسانوں میں سب سے بڑھ کر خوبصورت سب انسانوں سے بڑھ کر سخی اور سب سے زیادہ بہادرتھے ۔ ایک رات اہل مدینہ ( ایک آواز سن کر ) خوف زدہ ہو گئے ، صحابہ کرام رضوان اللہ عنھم اجمعین اس آواز کی طرف گئے ، تو رسول اللہ صلی اللہ علیہ وسلم انھیں اس جگہ سے واپس آتے ہو ئے ملے ، آپ سب سے پہلے آواز ( کی جگہ ) تک پہنچے ، آپ حضرت ابو طلحہ رضی اللہ تعالیٰ عنہ کے گھوڑے کی ننگی پیٹھ پر سوار تھے ، آپ کی گردن مبارک میں تلوار حمائل تھی اور آپ فر ما رہےتھے ۔ \" خوف میں مبتلا نہ ہو خوف میں مبتلانہ ہو \" ( پھر ) آپ صلی اللہ علیہ وسلم \" ہم نے اس ( گھوڑے ) کو سمندر کی طرح پا یا ہے یا ( فرما یا ) وہ تو سمندر ہے ۔ \" انھوں ( انس رضی اللہ تعالیٰ عنہ ) نے کہا : اور ( اس سے پہلے ) وہ سست رفتار گھوڑا تھا ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ التمیمی، سعید بن منصور، ابو الربیع العتکی اور ابو کامل نے بیان کیا اور لفظ یحییٰ نے کہا: ہم سے انہوں نے بیان کیا اور باقی دو نے کہا ہم سے حماد بن زید نے بیان کیا, ثابت نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَسَعِيدُ بْنُ مَنْصُورٍ، وَأَبُو الرَّبِيعِ الْعَتَكِيُّ، وَأَبُو كَامِلٍ - وَاللَّفْظُ لِيَحْيَى قَالَ يَحْيَى: أَخْبَرَنَا، وقَالَ الْآخَرَانِ - حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ ثَابِتٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ: «كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَحْسَنَ النَّاسِ، وَكَانَ أَجْوَدَ النَّاسِ، وَكَانَ أَشْجَعَ النَّاسِ» وَلَقَدْ فَزِعَ أَهْلُ الْمَدِينَةِ ذَاتَ لَيْلَةٍ، فَانْطَلَقَ نَاسٌ قِبَلَ الصَّوْتِ، فَتَلَقَّاهُمْ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ رَاجِعًا، وَقَدْ سَبَقَهُمْ إِلَى الصَّوْتِ، وَهُوَ عَلَى فَرَسٍ لِأَبِي طَلْحَةَ عُرْيٍ، فِي عُنُقِهِ السَّيْفُ وَهُوَ يَقُولُ: «لَمْ تُرَاعُوا، لَمْ تُرَاعُوا» قَالَ: «وَجَدْنَاهُ بَحْرًا، أَوْ إِنَّهُ لَبَحْرٌ» قَالَ: وَكَانَ فَرَسًا يُبَطَّأُ.",
                "headingArabic": "فِي شَجَاعَةِ النَّبِيِّ صلى الله عليه وسلم وَتَقَدُّمِهِ لِلْحَرْبِ ‏‏",
                "headingUrdu": "رسول اللہ صلی اللہ علیہ وسلم کی ہمت",
                "headingEnglish": "His ﷺ Courage",
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13570,
                "hadithNumber": "6007",
                "englishNarrator": "Anas رضی اللہ عنہ reported:",
                "hadithEnglish": "There was consternation in Medina. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) borrowed the horse from Abu Talha رضی اللہ عنہ which was called Mandub. He rode it and said: We have found no reason for consternation, and we have found it to be (as quick as a torrent) of water.",
                "hadithUrdu": "ایک بار مدینہ میں خوف پھیل گیا نبی صلی اللہ علیہ وسلم نے حضرت ابو طلحہ رضی اللہ تعالیٰ عنہ کا ایک گھوڑا مستعار لیا ، اسے مندوب کہا جاتا تھا آپ اس پر سوار ہو ئے تو آپ نے فرما یا : \" ہم نے کو ئی ڈر اور خوف کی بات نہیں دیکھی اور اس گھوڑے کو ہم نے سمندر ( کی طرح ) پا یا ہے ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, وکیع نے شعبہ سے ، انھوں نے قتادہ سے ، انھوں نے حضرت انس رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ: كَانَ بِالْمَدِينَةِ فَزَعٌ فَاسْتَعَارَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَرَسًا لِأَبِي طَلْحَةَ يُقَالُ لَهُ مَنْدُوبٌ فَرَكِبَهُ فَقَالَ: «مَا رَأَيْنَا مِنْ فَزَعٍ وَإِنْ وَجَدْنَاهُ لَبَحْرًا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13571,
                "hadithNumber": "6008",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been transmitted on the authority of Anas رضی اللہ عنہ with a slight variation of wording.",
                "hadithUrdu": "ہم سے محمد بن المثنیٰ اور ابن بشار نے بیان کیا، کہا: محمد بن جعفر اور خالد بن حارث نے کہا : ہمیں شعبہ نے اسی سند کے ساتھ حدیث بیان کی ، اور ابن جعفر کی روایت میں ہے ، انھوں ( حضرت انس رضی اللہ تعالیٰ عنہ ) نے کہا : ہمارا گھوڑا ۔ اور انھوں نے یہ نہیں کہا کہ ابو طلحہ رضی اللہ عنہ کا ( گھوڑا ۔ ) اور خالد کی حدیث میں ہے ۔ قتادہ سے روایت ہے ۔ میں نے حضرت انس رضی اللہ تعالیٰ عنہ سے سنا ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ح وحَدَّثَنِيهِ يَحْيَى بْنُ حَبِيبٍ، حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ، قَالَا: حَدَّثَنَا شُعْبَةُ، بِهَذَا الْإِسْنَادِ. وَفِي حَدِيثِ ابْنِ جَعْفَرٍ، قَالَ: فَرَسًا لَنَا، وَلَمْ يَقُلْ: لِأَبِي طَلْحَةَ، وَفِي حَدِيثِ خَالِدٍ: عَنْ قَتَادَةَ، سَمِعْتُ أَنَسًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13572,
                "hadithNumber": "6009",
                "englishNarrator": "Ibn 'Abbas رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was the most generous of people in charity, but he was generous to the utmost in the month of Ramadan. Gabriel (peace be upon him) would meet him every year during the month of Ramadin until it ended, and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) recited to him the Qur'an; and when Gabriel met him Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was most generous in giving charity like the blowing wind.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم خیر ( اچھی چیزوں ) میں تمام انسانوں میں سے زیادہ سخی تھے ۔ اور آپ رمضان کے مہینے میں سخاوت میں بہت ہی زیادہ بڑھ جا تے تھے ۔ جبرئیل علیہ السلام ہر سال رمضان کے مہینے میں اس کے ختم ہو نے تک ( روزانہ آکر ) آپ سے ملتے تھے ۔ رسول اللہ صلی اللہ علیہ وسلم ان کے سامنے قرآن مجید کی قراءت فر ما تے تھے ۔ اور جب حضرت جبرئیل علیہ السلام آپ سے آکر ملتے تھے تو آپ خیر ( کے عطا کرنے ) میں بارش برسانے والی ہواؤں سے بھی زیادہ سخی ہو جا تے تھے ۔",
                "urduNarrator": "ہم سے منصور بن ابی مزاحم نے بیان کیا, ابرا ہیم ( بن سعد ) نے ابن شہاب سے ، انھوں نے عبید اللہ بن عبد اللہ بن عتبہ بن مسعود سے ، انھوں نے حضرت ابن عباس رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا مَنْصُورُ بْنُ أَبِي مُزَاحِمٍ، حَدَّثَنَا إِبْرَاهِيمُ يَعْنِي ابْنَ سَعْدٍ، عَنِ الزُّهْرِيِّ، ح وحَدَّثَنِي أَبُو عِمْرَانَ مُحَمَّدُ بْنُ جَعْفَرِ بْنِ زِيَادٍ - وَاللَّفْظُ لَهُ - أَخْبَرَنَا إِبْرَاهِيمُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللهِ بْنِ عَبْدِ اللهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ: «كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَجْوَدَ النَّاسِ بِالْخَيْرِ، وَكَانَ أَجْوَدَ مَا يَكُونُ فِي شَهْرِ رَمَضَانَ إِنَّ جِبْرِيلَ عَلَيْهِ السَّلَامُ كَانَ يَلْقَاهُ، فِي كُلِّ سَنَةٍ، فِي رَمَضَانَ حَتَّى يَنْسَلِخَ، فَيَعْرِضُ عَلَيْهِ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الْقُرْآنَ، فَإِذَا لَقِيَهُ جِبْرِيلُ كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَجْوَدَ بِالْخَيْرِ مِنَ الرِّيحِ الْمُرْسَلَةِ».",
                "headingArabic": "كَانَ النَّبِيُّ صلى الله عليه وسلم أَجْوَدَ النَّاسِ بِالْخَيْرِ مِنَ الرِّيحِ الْمُرْسَلَةِ",
                "headingUrdu": "اس کی سخاوت",
                "headingEnglish": "His ﷺ Generosity",
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13573,
                "hadithNumber": "6010",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Zuhri with the same chain of transmitters.",
                "hadithUrdu": "ہم سے ابو کریب نے بیان کیا، کہا ہم سے ابن مبارک نے بیان کیا, یو نس اور معمر دونوں نے زہری سے اسی سند کے ساتھ اسی طرح روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو كُرَيْبٍ، حَدَّثَنَا ابْنُ مُبَارَكٍ، عَنْ يُونُسَ،وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ كِلَاهُمَا، عَنِ الزُّهْرِيِّ بِهَذَا الْإِسْنَادِ نَحْوَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13574,
                "hadithNumber": "6011",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "I served the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) for ten years, and, by Allah, he never said to me any harsh word, and he never said to me about a thing as to why I had done that and as to why I had not done that. Abu Rabi' has made this addition (in this narration): The work which a servant should do. There is no mention of his words By Allah .",
                "hadithUrdu": "میں نے ( تقریباً ) دس سال تک رسول اللہ صلی اللہ علیہ وسلم کی خدمت کی ، اللہ کی قسم! آپ مجھ سے کبھی اُف تک نہیں کہا اور نہ کبھی کسی چیز لے لیے مجھ سے یہ کہا کہ تم نے فلا ں کا م کیوں کیا؟ یا فلا ں کا م کیوں نہ کیا ۔ ؟ابو ربیع نے اضافہ کیا : ( نہ آپ نے کبھی یہ فرما یا ) \" خادم ایسا نہیں کرتا ۔ \" انھوں نے ان ( انس رضی اللہ عنہ ) کی بات \" اللہ کی قسم! \" کا ذکر نہیں کیا ۔",
                "urduNarrator": "سعید بن منصور اور ابو ربیع نے ہمیں حدیث بیان کی ، دونوں نے کہا : ہمیں حماد بن زید نے ثابت بنانی سے حدیث سنائی ، انھوں نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، وَأَبُو الرَّبِيعِ، قَالَا: حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ: خَدَمْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَشْرَ سِنِينَ، وَاللهِ مَا قَالَ لِي: أُفًّا قَطُّ، وَلَا قَالَ لِي لِشَيْءٍ: لِمَ فَعَلْتَ كَذَا؟ وَهَلَّا فَعَلْتَ كَذَا؟ زَادَ أَبُو الرَّبِيعِ: لَيْسَ مِمَّا يَصْنَعُهُ الْخَادِمُ، وَلَمْ يَذْكُرْ قَوْلَهُ: وَاللهِ.",
                "headingArabic": "كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَحْسَنَ النَّاسِ خُلُقًا ‏‏",
                "headingUrdu": "آپ ﷺ کا حسن اخلاق",
                "headingEnglish": "His ﷺ Good Manners",
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13575,
                "hadithNumber": "6012",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Anas رضی اللہ عنہ through another chain of transmitters.",
                "hadithUrdu": "ہم سے شیبان بن فروخ نے بیان کیا, سلام بن مسکین نے کہا : ہمیں ثابت بنا نی نے حضرت انس رضی اللہ عنہ سے اسی کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَاهُ شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا سَلَّامُ بْنُ مِسْكِينٍ، حَدَّثَنَا ثَابِتٌ الْبُنَانِيُّ، عَنْ أَنَسٍ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13576,
                "hadithNumber": "6013",
                "englishNarrator": "Anas رضی اللہ عنہ reported:",
                "hadithEnglish": "When Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came to Medina, Abla Talha took hold of my hand and brought me to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: Allah's Messenger, Anas رضی اللہ عنہ is a prudent young boy, and he will serve you. He (Anas) said: I served him in journey and at home, but, by Allah, he never asked me about a thing which I did as to why I did so, nor about a thing which I did not do as to why I had not done that.",
                "hadithUrdu": "جب رسول اللہ صلی اللہ علیہ وسلم مدینہ تشریف لا ئے تو حضرت ابو طلحہ رضی اللہ تعالیٰ عنہ نے میرا ہاتھ پکڑا اور مجھے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں لے گئے اور عرض کی : اللہ کے رسول صلی اللہ علیہ وسلم ! انس ایک سمجھدار لڑکا ہے ، اس لیے یہ آپ کی خدمت کرے گا ( حضرت انس رضی اللہ تعالیٰ عنہ نے ) کہا : پھر میں سفر اور حضر میں آپ صلی اللہ علیہ وسلم کی خدمت کرتا رہا اللہ کی قسم! میں نے کو ئی کا م کیا تو آپ صلی اللہ علیہ وسلم نے یہ نہیں فرما یا : تم نے یہ کا م اس طرح کیوں کیا؟اور میں نے کو ئی کام نہ کیا تو آپ صلی اللہ علیہ وسلم نے یہ نہیں فر ما یا : تم نے یہ کام اس طرح کیوں نہیں کیا ؟",
                "urduNarrator": "ہم سے احمد بن حنبل اور زہیر بن حرب نے بیان کیا، ان سب نے اسماعیل کی سند سے روایت کی ہے اور یہ الفاظ احمد کے لیے ہیں، انہوں نے کہا: ہم سے اسماعیل بن حرب نے بیان کیا۔ ابراہیم، ہمیں عبد العزیز نے حضرت انس رضی اللہ عنہ سے حدیث سنائی کہا",
                "hadithArabic": "وَحَدَّثَنَاهُ أَحْمَدُ بْنُ حَنْبَلٍ، وَزُهَيْرُ بْنُ حَرْبٍ، جَمِيعًا عَنْ إِسْمَاعِيلَ، - وَاللَّفْظُ لِأَحْمَدَ - قَالَا: حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَنَسٍ، قَالَ: لَمَّا قَدِمَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ، أَخَذَ أَبُو طَلْحَةَ بِيَدِي فَانْطَلَقَ بِي إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: يَا رَسُولَ اللهِ إِنَّ أَنَسًا غُلَامٌ كَيِّسٌ فَلْيَخْدُمْكَ، قَالَ: فَخَدَمْتُهُ فِي السَّفَرِ وَالْحَضَرِ، وَاللهِ مَا قَالَ لِي لِشَيْءٍ صَنَعْتُهُ: لِمَ صَنَعْتَ هَذَا هَكَذَا؟ وَلَا لِشَيْءٍ لَمْ أَصْنَعْهُ: لِمَ لَمْ تَصْنَعْ هَذَا هَكَذَا؟",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13577,
                "hadithNumber": "6014",
                "englishNarrator": "Anas رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: I served the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) for nine years, and I do not know (of any instance) when he said to me: Why you have done this and that, and he never found fault with me in anything.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: میں نے نو سال رسول اللہ صلی اللہ علیہ وسلم کی خدمت کی ، مجھے علم نہیں کہ آپ نے کبھی مجھ سے یوں فرما یا : ہو تم نے اس اس طرح کیوں کیا؟ اور نہ آپ صلی اللہ علیہ وسلم نے کسی چیز میں کبھی مجھ پر نکتہ چینی کی ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابن نمیر نے بیان کیا، کہا کہ ہم سے محمد بن بشر نے بیان کیا، ہم سے زکریا نے بیان کیا، سعید بن ابی بردہ نے حضرت انس رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ نُمَيْرٍ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا زَكَرِيَّاءُ، حَدَّثَنِي سَعِيدٌ وَهُوَ ابْنُ أَبِي بُرْدَةَ، عَنْ أَنَسٍ، قَالَ: خَدَمْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ تِسْعَ سِنِينَ، فَمَا أَعْلَمُهُ قَالَ لِي قَطُّ: لِمَ فَعَلْتَ كَذَا وَكَذَا؟ وَلَا عَابَ عَلَيَّ شَيْئًا قَطُّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13578,
                "hadithNumber": "6015",
                "englishNarrator": "Anas رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had the best disposition amongst people. He sent me on an errand one day, and I said: By Allah, I would not go. I had, however, this idea in my mind that I would do as Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had commanded me to do. I went out until I happened to come across children who had been playing in the street. In the meanwhile, Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came there and he caught me by the back of my neck from behind me. As I looked towards him I found him smiling and he said: Unais, did you go where I commanded you to go? I said: Allah's Messenger, yes, I am going.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم تمام انسانوں میں اخلا ق کے سب سے اچھے تھے ، آپ نے ایک دن مجھے کسی کام سے بھیجا ، میں نے کہا : اللہ کی قسم! میں نہیں جا ؤں گا ۔ حالانکہ میرے دل میں یہ تھا کہ نبی صلی اللہ علیہ وسلم نے مجھے جس کام کا حکم دیا ہے میں اس کے لیے ضرورجا ؤں گا ۔ تومیں چلا گیا حتیٰ کہ میں چند لڑکوں کے پاس سے گزرا ، وہ بازار میں کھیل رہے تھے ، پھر اچانک ( میں نے دیکھا ) رسول اللہ صلی اللہ علیہ وسلم نے پیچھے سے میری گدی سے مجھے پکڑ لیا ، میں نے آپ کی طرف دیکھا تو آپ ہنس رہے تھے ۔ آپ نے فرمایا : \" اے چھوٹے انس! کیا تم وہاں گئے تھے جہاں ( جانے کو ) میں نے کہا تھا ؟ \" میں نے کہا جی! ہاں ، اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! میں جا رہا ہوں ۔",
                "urduNarrator": "مجھ سے ابو معن الرقاشی نے بیان کیا زید بن یزید نے، کہا ہم سے عمر بن یونس نے بیان کیا، ہم سے عکرمہ نے جو ابن عمار ہیں، بیان کیا, اسحٰق نے کہا : حضرت انس رضی اللہ عنہ نے کہا",
                "hadithArabic": "حَدَّثَنِي أَبُو مَعْنٍ الرَّقَاشِيُّ زَيْدُ بْنُ يَزِيدَ، أَخْبَرَنَا عُمَرُ بْنُ يُونُسَ، حَدَّثَنَا عِكْرِمَةُ وَهُوَ ابْنُ عَمَّارٍ، قَالَ: قَالَ إِسْحَاقُ: قَالَ أَنَسٌ: «كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنْ أَحْسَنِ النَّاسِ خُلُقًا»، فَأَرْسَلَنِي يَوْمًا لِحَاجَةٍ، فَقُلْتُ: وَاللهِ لَا أَذْهَبُ، وَفِي نَفْسِي أَنْ أَذْهَبَ لِمَا أَمَرَنِي بِهِ نَبِيُّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَخَرَجْتُ حَتَّى أَمُرَّ عَلَى صِبْيَانٍ وَهُمْ يَلْعَبُونَ فِي السُّوقِ، فَإِذَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَدْ قَبَضَ بِقَفَايَ مِنْ وَرَائِي، قَالَ: فَنَظَرْتُ إِلَيْهِ وَهُوَ يَضْحَكُ، فَقَالَ: «يَا أُنَيْسُ أَذَهَبْتَ حَيْثُ أَمَرْتُكَ؟» قَالَ قُلْتُ: نَعَمْ، أَنَا أَذْهَبُ، يَا رَسُولَ اللهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13579,
                "hadithNumber": "6016",
                "englishNarrator": "Anas رضی اللہ عنہ said:",
                "hadithEnglish": "I served him for nine years but I know not that he ever said to me about a thing which I had done why I did that, or about a thing I had left as to why I had not done that.",
                "hadithUrdu": "اللہ کی قسمً میں نے نوسال آپ کی خدمت کی ، میں نے آپ کو کبھی نہ دیکھا کہ کسی کام کے بارے میں جو میں نے کیا ، یہ کہا ہو تم نے فلاں فلا ں کام کیوں کیا؟ اور کو ئی چیز جو میں نے چھوڑدی ہو ( اس کے بارےمیں کہا ہو : ) تم نے فلاں فلاں کا م کیوں نہ کیا؟",
                "urduNarrator": "حضرت انس رضی اللہ عنہ نے کہا",
                "hadithArabic": "قَالَ أَنَسٌ: وَاللهِ لَقَدْ خَدَمْتُهُ تِسْعَ سِنِينَ، مَا عَلِمْتُهُ قَالَ لِشَيْءٍ صَنَعْتُهُ: لِمَ فَعَلْتَ كَذَا وَكَذَا؟ أَوْ لِشَيْءٍ تَرَكْتُهُ: هَلَّا فَعَلْتَ كَذَا وَكَذَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13580,
                "hadithNumber": "6017",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was the best amongst people in disposition and behaviour.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم تمام انسانوں میں سب سے بڑھ کر خوش اخلا ق تھے ۔",
                "urduNarrator": "ہم سے شیبان بن فروخ اور ابو الربیع نے بیان کیا، کہا: ہم سے عبدالوارث نے بیان کیا، ابو تیاح نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، وَأَبُو الرَّبِيعِ، قَالَا: حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ أَبِي التَّيَّاحِ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ: «كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَحْسَنَ النَّاسِ خُلُقًا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13581,
                "hadithNumber": "6018",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "It never happened that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was asked for anything and he said: No.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم سے کو ئی چیز مانگی گئی ہو اور آپ نے فرما یا ہو ۔ نہیں ،",
                "urduNarrator": "ابو بکر بن ابی شیبہ اور عمرو ناقد نے کہا , ہمیں سفیان بن عیینہ نے ابن منکدر سے حدیث بیان کی ، انھوں نے حضرت جا بر بن عبد اللہ رضی اللہ عنہ سے سنا ، کہا : ایسا کبھی نہیں ہوا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، قَالَا: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ ابْنِ الْمُنْكَدِرِ، سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ، قَالَ: «مَا سُئِلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ شَيْئًا قَطُّ فَقَالَ لَا».",
                "headingArabic": "مَا سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم شَيْئًا قَطُّ فَقَالَ لاَ ‏ وَكَثْرَةِ عَطَائِهِ",
                "headingUrdu": "آپ ﷺ کی سخاوت",
                "headingEnglish": "His ﷺ Generosity",
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13582,
                "hadithNumber": "6019",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Jabir bin 'Abdullah رضی اللہ عنہ through another chain of transmitters.",
                "hadithUrdu": "ہم سے ابو کریب نے بیان کیا،اشجعی اور عبد الرحمٰن بن مہدی دونوں نے سفیان سے انھوں نے محمد بن منکدر سے روایت کی ، انھوں نے کہا : سمیں نے حضرت جابربن عبد اللہ رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے ، بالکل اسی ( سابقہ حدیث ) کے مانند ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا الْأَشْجَعِيُّ، ح وحَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ يَعْنِي ابْنَ مَهْدِيٍّ كِلَاهُمَا، عَنْ سُفْيَانَ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، قَالَ: سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللهِ يَقُولُ، مِثْلَهُ سَوَاءً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13583,
                "hadithNumber": "6020",
                "englishNarrator": "Musa bin Anas reported on the authority of his father:",
                "hadithEnglish": "It never happened that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was asked anything for the sake of Islam and he did not give that. There came to him a person and he gave him a large flock (of sheep and goats) and he went back to his people and said: My people, embrace Islam, for Muhammad gives so much charity as if he has no fear of want.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم سے اسلام ( لا نے ) پر جوبھی چیز طلب کی جا تی آپ وہ عطا فر ما دیتے ، کہا : ایک شخص آپ کے پاس آیا تو آپ صلی اللہ علیہ وسلم دوپہاڑوں کے درمیان ( چرنے والی ) بکریاں اسے دے دیں ، وہ شخص اپنی قوم کی طرف واپس گیا اور کہنے لگا : میری قوم !مسلمان ہو جاؤ بلا شبہ محمد صلی اللہ علیہ وسلم اتنا عطا کرتے ہیں کہ فقر وفاقہ کا اندیشہ تک نہیں رکھتے ۔",
                "urduNarrator": "ہم سے عاصم بن النضر التیمی نے بیان کیا، ہم سے خالد نے بیان کیا، یعنی ہم سے ابن حارث نے بیان کیا، ہم سے حمید نے بیان کیا، موسیٰ بن انس نے اپنے والد سے روایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنَا عَاصِمُ بْنُ النَّضْرِ التَّيْمِيُّ، حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ، حَدَّثَنَا حُمَيْدٌ، عَنْ مُوسَى بْنِ أَنَسٍ، عَنْ أَبِيهِ، قَالَ: مَا سُئِلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى الْإِسْلَامِ شَيْئًا إِلَّا أَعْطَاهُ، قَالَ: فَجَاءَهُ رَجُلٌ فَأَعْطَاهُ غَنَمًا بَيْنَ جَبَلَيْنِ، فَرَجَعَ إِلَى قَوْمِهِ، فَقَالَ: يَا قَوْمِ أَسْلِمُوا، فَإِنَّ مُحَمَّدًا يُعْطِي عَطَاءً لَا يَخْشَى الْفَاقَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13584,
                "hadithNumber": "6021",
                "englishNarrator": "Anas 'bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "A person requested Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) to give him a very large flock and he gave that to him. He came to his tribe and said: O people, embrace Islam. By Allah, Muhammad donates so much as if he did not fear want. Anas said that the person embraced Islam for the sake of the world but later he became Muslim until Islam became dearer to him than the world and what it contains.",
                "hadithUrdu": "ایک شخص نے نبی صلی اللہ علیہ وسلم سے دوپہاڑوں کے درمیان ( چرنے والی ) بکریاں مانگیں ، آپ نے وہ بکریاں اس کو عطا کر دیں پھر وہ اپنی قوم کے پاس آیا اور کہنے لگا : میری قوم اسلام لے آؤ ، کیونکہ اللہ کی قسم!بے شک محمد صلی اللہ علیہ وسلم اتنا کرتے ہیں کہ فقر وفاقہ کا اندیشہ بھی نہیں رکھتے ۔ حضرت انس رضی اللہ تعالیٰ عنہ نے کہا : بے شک کو ئی آدمی صرف دنیا کی طلب میں بھی مسلمان ہو جا تا تھا ، پھر جو نہی وہ اسلام لا تا تھا تو اسلام اسے دنیا اور جو کچھ دنیا میں ہے اس سے بڑھ کر محبوب ہو جاتا تھا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے یزید بن ہارون نے بیان کیا، وہ حماد بن سلمہ سے, ثابت نے حضرت انس رضی اللہ عنہ سے روایت کی ، کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ حَمَّادِ بْنِ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، أَنَّ رَجُلًا سَأَلَ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ غَنَمًا بَيْنَ جَبَلَيْنِ، فَأَعْطَاهُ إِيَّاهُ، فَأَتَى قَوْمَهُ فَقَالَ: «أَيْ قَوْمِ أَسْلِمُوا، فَوَاللهِ إِنَّ مُحَمَّدًا لَيُعْطِي عَطَاءً مَا يَخَافُ الْفَقْرَ» فَقَالَ أَنَسٌ: «إِنْ كَانَ الرَّجُلُ لَيُسْلِمُ مَا يُرِيدُ إِلَّا الدُّنْيَا، فَمَا يُسْلِمُ حَتَّى يَكُونَ الْإِسْلَامُ أَحَبَّ إِلَيْهِ مِنَ الدُّنْيَا وَمَا عَلَيْهَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13585,
                "hadithNumber": "6022",
                "englishNarrator": "Ibn Shihab reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) went on the expedition of Victory, i. e. the Victory of Mecca, and then he went out along with the Muslims and they fought at Hunain, and Allah granted victory to his religion and to the Muslims, and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) gave one hundred camels to Safwan bin Umayya رضی اللہ عنہ . He again gave him one hundred camels, and then again gave him one hundred camels. Sa'id bin Musayyib said that Safwan رضی اللہ عنہ told him: (By Allah) Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) gave me what he gave me (and my state of mind at that time was) that he was the most detested person amongst people in my eyes. But he continued giving to me until now he is the dearest of people to me.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے غزوہ فتح یعنی فتح مکہ کے لیے جہاد کیا ، پھر رسول اللہ صلی اللہ علیہ وسلم ان مسلمانوں کے ساتھ جو آپ کے ہمراہ تھے نکلے اور حنین میں خونریز جنگ کی ، اللہ نے اپنے دین کو اور مسلمانوں کو فتح عطا فرما ئی ، اس دن رسول اللہ صلی اللہ علیہ وسلم نے صفوان بن امیہ رضی اللہ تعالیٰ عنہ کو سو اونٹ عطا فرمائے ، پھر سواونٹ پھر سواونٹ ۔ ابن شہاب نے کہا : مجھے سعید بن مسیب نے یہ بیان کیا کہ صفوان رضی اللہ عنہ نے کہا : اللہ کی قسم!رسول اللہ صلی اللہ علیہ وسلم نے مجھے جو عطا فر ما یا ، مجھے تمام انسانوں میں سب سے زیادہ بغض آپ صلی اللہ علیہ وسلم سے تھا ۔ پھر آپ مجھے مسلسل عطا فرما تے رہے یہاں تک کہ آپ مجھے تمام انسانوں کی نسبت زیادہ محبوب ہو گئے ۔",
                "urduNarrator": "مجھ سے ابو الطاہر احمد بن عمرو بن سرح نے بیان کیا، کہا ہم سے عبداللہ بن وہب نے بیان کیا, یو نس نے مجھے ابن شہاب سے خبر دی کہا",
                "hadithArabic": "وحَدَّثَنِي أَبُو الطَّاهِرِ أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ، أَخْبَرَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ: «غَزَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ غَزْوَةَ الْفَتْحِ، فَتْحِ مَكَّةَ، ثُمَّ خَرَجَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمَنْ مَعَهُ مِنَ الْمُسْلِمِينَ، فَاقْتَتَلُوا بِحُنَيْنٍ، فَنَصَرَ اللهُ دِينَهُ وَالْمُسْلِمِينَ وَأَعْطَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَوْمَئِذٍ صَفْوَانَ بْنَ أُمَيَّةَ مِائَةً مِنَ النَّعَمِ ثُمَّ مِائَةً ثُمَّ مِائَةً» قَالَ ابْنُ شِهَابٍ: حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيِّبِ، أَنَّ صَفْوَانَ قَالَ: «وَاللهِ لَقَدْ أَعْطَانِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مَا أَعْطَانِي، وَإِنَّهُ لَأَبْغَضُ النَّاسِ إِلَيَّ، فَمَا بَرِحَ يُعْطِينِي حَتَّى إِنَّهُ لَأَحَبُّ النَّاسِ إِلَيَّ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13586,
                "hadithNumber": "6023",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: In case we get wealth from Bahrain, I would give you so much and so much; he made an indication of it with both his hands. Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) died before wealth from Bahrain came, and it fell to the lot of Abu Bakr رضی اللہ عنہ after him. He commanded the announcer to make announcement to the effect that he to whom Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had held out promise or owed any debt should come (to him). I came and said: Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had said to me: In case there comes to us the wealth of Bahrain I shall give you so much, and so much. Abu Bakr رضی اللہ عنہ took a handful (of the coins) and gave that to me once and asked me to count them I counted them as five hundred dinars and he said: Here is double of this for you.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : اگر ہمارے پاس بحرین کا مال آئے گا تو میں تجھے اتنا ، اتنا اور اتنا دوں گا اور دونوں ہاتھوں سے اشارہ کیا ( یعنی تین لپ بھر کر ) ۔ پھر بحرین کا مال آنے سے پہلے آپ صلی اللہ علیہ وسلم کی وفات ہو گئی ۔ وہ مال سیدنا ابوبکر صدیق رضی اللہ عنہ کے پاس آپ صلی اللہ علیہ وسلم کے بعد آیا تو انہوں نے ایک منادی کو یہ آواز کرنے کے لئے حکم دیا کہ جس کے لئے رسول اللہ صلی اللہ علیہ وسلم نے کچھ وعدہ کیا ہو ، یا اس کا قرض آپ صلی اللہ علیہ وسلم پر آتا ہو وہ آئے ۔ یہ سن کر میں کھڑا ہوا اور کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے وعدہ کیا تھا کہ اگر بحرین کا مال آئے گا تو تجھ کو اتنا ، اتنا اور اتنا دیں گے ۔ یہ سن کر سیدنا ابوبکر صدیق رضی اللہ عنہ نے ایک لپ بھرا پھر مجھ سے کہا کہ اس کو گن ۔ میں نے گنا تو وہ پانچ سو نکلے سیدنا ابوبکر رضی اللہ عنہ نے کہا کہ اس کا دوگنا اور لے لے ( تو تین لپ ہو گئے ) ۔",
                "urduNarrator": "ہم سے عمرو ناقد نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، انہوں نے ابن المنکدر کی سند سے، کہا کہ انہوں نے جابر بن عبداللہ رضی اللہ عنہما سے سنا اور ہم سے اسحاق نے بیان کیا۔ سفیان نے ابن المنکدر کی سند سے جابر کی سند سے اور عمرو کی سند سے محمد بن علی کی سند سے جابر کی روایت سے ان میں سے ایک دوسرے سے زیادہ ہے، ابن ابی عمر نے ہمیں حدیث بیان کی ، الفاظ انھی کے ہیں ۔ کہا : سفیان نے کہا : میں نے محمد بن منکدر سے سنا ، وہ کہہ رہے تھے : میں نے حضرت جابر بن اللہ رضی اللہ تعالیٰ عنہ سے سنا ، سفیان نے یہ بھی کہا : میں نے عمرو بن دینار سے سنا ، وہ محمد بن علی سے حدیث بیان کررہے تھے ، انھوں نے کہا : میں نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے سنا ۔ ان دونوں میں سے ( بھی ) ایک نے دوسرے کی نسبت کچھ زائد بیان کیا ، ( حضرت جابر رضی اللہ تعالیٰ عنہ نے ) کہا : کہسفیان بن عیینہ نے محمد بن منکدر سے روایت کی کہ انھوں نے جابر بن عبد اللہ رضی اللہ عنہ سے سنا ، ( اسی طرح ) سفیان نے ابن منکدر سے انھوں نے حضرت جابر رضی اللہ عنہ سے روایت کی ، نیز عمرو سے روایت ہے ، انھوں نے محمد بن علی سے اور انھوں نے حضرت جابر رضی اللہ تعالیٰ عنہ سے روایت کی ، ان دونوں میں سے ہر ایک نے دوسرے کی نسبت کچھ زائد بیان کیا ، اسی طرح",
                "hadithArabic": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ ابْنِ الْمُنْكَدِرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ، وَحَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا سُفْيَانُ، عَنِ ابْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ، وَعَنْ عَمْرٍو، عَنْ مُحَمَّدِ بْنِ عَلِيٍّ، عَنْ جَابِرٍ، أَحَدُهُمَا يَزِيدُ عَلَى الْآخَرِ، وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ - وَاللَّفْظُ لَهُ - قَالَ: قَالَ سُفْيَانُ: سَمِعْتُ مُحَمَّدَ بْنَ الْمُنْكَدِرِ يَقُولُ: سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللهِ، قَالَ سُفْيَانُ: وَسَمِعْتُ أَيْضًا عَمْرَو بْنَ دِينَارٍ يُحَدِّثُ، عَنْ مُحَمَّدِ بْنِ عَلِيٍّ، قَالَ: سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللهِ، - وَزَادَ أَحَدُهُمَا عَلَى الْآخَرِ - قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَوْ قَدْ جَاءَنَا مَالُ الْبَحْرَيْنِ لَقَدْ أَعْطَيْتُكَ هَكَذَا وَهَكَذَا وَهَكَذَا» وَقَالَ بِيَدَيْهِ جَمِيعًا، فَقُبِضَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَبْلَ أَنْ يَجِيءَ مَالُ الْبَحْرَيْنِ فَقَدِمَ عَلَى أَبِي بَكْرٍ بَعْدَهُ، فَأَمَرَ مُنَادِيًا فَنَادَى: مَنْ كَانَتْ لَهُ عَلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عِدَةٌ أَوْ دَيْنٌ فَلْيَأْتِ، فَقُمْتُ فَقُلْتُ: إِنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَوْ قَدْ جَاءَنَا مَالُ الْبَحْرَيْنِ أَعْطَيْتُكَ هَكَذَا وَهَكَذَا وَهَكَذَا» فَحَثَى أَبُو بَكْرٍ مَرَّةً، ثُمَّ قَالَ لِي: عُدَّهَا، فَعَدَدْتُهَا فَإِذَا هِيَ خَمْسُمِائَةٍ، فَقَالَ: خُذْ مِثْلَيْهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13587,
                "hadithNumber": "6024",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "When Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) died, there came to Abi Bakr رضی اللہ عنہ wealth from al-'Ala' bin al-Hadrami رضی اللہ عنہ . Abu Bakr رضی اللہ عنہ said: He to whom Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) owed any debt or held out any promise should come to us; the rest of the hadith is the same.",
                "hadithUrdu": "جب نبی صلی اللہ علیہ وسلم فوت ہو ئے تو حضرت ابو بکر رضی اللہ عنہ کے پاس ( بحرین کے گورنر ) حضرت علاء بن حضرمی رضی اللہ عنہ کی طرف سے مال آیا ، حضرت ابو بکر رضی اللہ عنہ نے کہا : جس شخص کا نبی صلی اللہ علیہ وسلم پر کو ئی قرض ہو یا آپ کی طرف سے کسی کے ساتھ وعدہ ہو تو ہمارے پاس آئے ۔ ( آگے ) ابن عیینہ کی حدیث کی مانند ۔",
                "urduNarrator": "ہم سے محمد بن حاتم بن میمون نے بیان کیا، کہا ہم سے محمد بن بکر نے بیان کیا, ابن جریج نے کہا : مجھے عمرو بن دینار نے محمد بن علی سے خبر دی ، انھو ں نے جابر بن عبد اللہ رضی اللہ عنہ سے روایت کی ، نیز کہا : مجھے محمد بن منکدر نے ( بھی ) جابر بن عبد اللہ رضی اللہ  عنہ سے خبردی تھی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ مَيْمُونٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ، عَنْ مُحَمَّدِ بْنِ عَلِيٍّ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، قَالَ: وَأَخْبَرَنِي مُحَمَّدُ بْنُ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ قَالَ: لَمَّا مَاتَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ جَاءَ أَبَا بَكْرٍ مَالٌ مِنْ قِبَلِ الْعَلَاءِ بْنِ الْحَضْرَمِيِّ فَقَالَ أَبُو بَكْرٍ: مَنْ كَانَ لَهُ عَلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ دَيْنٌ، أَوْ كَانَتْ لَهُ قِبَلَهُ عِدَةٌ، فَلْيَأْتِنَا بِنَحْوِ حَدِيثِ ابْنِ عُيَيْنَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13588,
                "hadithNumber": "6025",
                "englishNarrator": "Anas bin Malik رضی اللہ  عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: A child was born into me this night and I named him after the name of my father Ibrahim. He then sent him to Umm Saif رضی اللہ عنہا , the wife of a blacksmith who was called Abu Saif. He (the Holy Prophet) went to him and I followed him until we reached Abu Saif and he was blowing fire with the help of blacksmith's bellows and the house was filled with smoke. I hastened my step and went ahead of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: Abu Saif, stop it, as there comes Allah's Messenger (may peace he upon him). He stopped and Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) called for the child. He embraced him and said what Allah had desired. Anas رضی اللہ عنہ said: I saw that the boy breathed his last in the presence of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). The eyes of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) shed tears and he said: Ibrahim, our eyes shed tears and our hearts are filled with grief, but we do not say anything except that by which Allah is pleased. O Ibrahim, we are grieved for you.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \"\" آج رات میرا ایک بیٹا پیداہوا ہے جس کا نام میں نے اپنے والد کے نام پر ابرا ہیم رکھا ہے ۔ \"\" پھر آپ صلی اللہ علیہ وسلم نے اس بچے کو ابو سیف نامی لوہار کی بیوی ام سیف رضی اللہ عنہا کے سپرد کر دیا ، پھر ( ایک روز ) آپ صلی اللہ علیہ وسلم اس بچے کے پاس جا نے کے لیے چل پڑے میں آپ صلی اللہ علیہ وسلم کے پیچھے چلا ہم ابو سیف کے پاس پہنچے وہ بھٹی پھونک رہا تھا ۔ گھر دھوئیں سے بھرا ہوا تھا ۔ میں تیزی سے چلتا ہوا رسول اللہ صلی اللہ علیہ وسلم سے آگے ہوگیا اور کہا : ابو سیف!رک جاؤ ، رسول اللہ صلی اللہ علیہ وسلم تشریف لائے ہیں ، وہ رک گیا ۔ رسول اللہ صلی اللہ علیہ وسلم نے بچے کو منگوا بھیجا ، آپ نے اسے اپنے ساتھ لگالیا اور جو اللہ چاہتا تھا ، آپ نے فرمایا ( محبت وشفقت کے بول بولے ۔ ) تو حضرت انس رضی اللہ عنہ نے کہا : میں نے اس بچے کو دیکھا ، وہ رسول اللہ صلی اللہ علیہ وسلم ( کی آنکھوں ) کے سامنے اپنی جان جان آفریں کے سپرد کر رہا تھا تورسول اللہ صلی اللہ علیہ وسلم کی آنکھوں میں آنسو آگئے ، آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" آنکھیں آنسوبہارہی ہیں اور دل غم سے بھر ا ہواہے لیکن ہم اس کے سوا اور کچھ نہیں کہیں گے جس سے ہمارا پروردگار راضی ہو ، اللہ کی قسم!ابراہیم!ہم آپ کی ( جدائی کی ) وجہ سے سخت غمزدہ ہیں ۔ \"\"",
                "urduNarrator": "ہم سے حداب بن خالد اور شیبان بن فروخ نے بیان کیا، ان دونوں نے سلیمان سے اور لفظ شیبان ہے، ہم سے سلیمان بن المغیرہ نے بیان کیا، ثابت بنانی نے حضرت انس رضی اللہ  عنہ سے حدیث بیان کی ، کہا",
                "hadithArabic": "حَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ، وَشَيْبَانُ بْنُ فَرُّوخَ، كِلَاهُمَا عَنْ سُلَيْمَانَ، - وَاللَّفْظُ لِشَيْبَانَ - حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، حَدَّثَنَا ثَابِتٌ الْبُنَانِيُّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «وُلِدَ لِي اللَّيْلَةَ غُلَامٌ، فَسَمَّيْتُهُ بِاسْمِ أَبِي إِبْرَاهِيمَ» ثُمَّ دَفَعَهُ إِلَى أُمِّ سَيْفٍ، امْرَأَةِ قَيْنٍ يُقَالُ لَهُ أَبُو سَيْفٍ، فَانْطَلَقَ يَأْتِيهِ وَاتَّبَعْتُهُ، فَانْتَهَيْنَا إِلَى أَبِي سَيْفٍ وَهُوَ يَنْفُخُ بِكِيرِهِ، قَدِ امْتَلَأَ الْبَيْتُ دُخَانًا، فَأَسْرَعْتُ الْمَشْيَ بَيْنَ يَدَيْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقُلْتُ: يَا أَبَا سَيْفٍ أَمْسِكْ، جَاءَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَأَمْسَكَ فَدَعَا النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِالصَّبِيِّ، فَضَمَّهُ إِلَيْهِ، وَقَالَ مَا شَاءَ اللهُ أَنْ يَقُولَ، فَقَالَ أَنَسٌ: لَقَدْ رَأَيْتُهُ وَهُوَ يَكِيدُ بِنَفْسِهِ بَيْنَ يَدَيْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَدَمَعَتْ عَيْنَا رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «تَدْمَعُ الْعَيْنُ وَيَحْزَنُ الْقَلْبُ، وَلَا نَقُولُ إِلَّا مَا يَرْضَى رَبَّنَا، وَاللهِ يَا إِبْرَاهِيمُ إِنَّا بِكَ لَمَحْزُونُونَ».",
                "headingArabic": "رَحْمَتِهِ صلى الله عليه وسلم الصِّبْيَانَ وَالْعِيَالَ وَتَوَاضُعِهِ وَفَضْلِ ذَلِكَ ‏‏",
                "headingUrdu": "بچوں کے ساتھ اس کی شفقت اور اس کی عاجزی، اور اس کی خوبی",
                "headingEnglish": "His Compassion Towards Children And His Humbleness, And The Virtue Of That",
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 13276,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=531",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=529",
                "label": "529",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=530",
                "label": "530",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=531",
                "label": "531",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=532",
                "label": "532",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=533",
                "label": "533",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=534",
                "label": "534",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=535",
                "label": "535",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=533",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=533",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=531",
        "to": 13300,
        "total": 40465
    }
}