{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 390,
        "data": [
            {
                "id": 10014,
                "hadithNumber": "2450",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Jabir bin 'Abdullah رضی اللہ تعالیٰ عنہ through another chain of transmitters.",
                "hadithUrdu": "ہم سے محمد بن المثنی نے بیان کیا, عبدالوہاب ثقفی نے کہا : میں نے یحییٰ بن سعید سے سنا ، کہہ رہے تھے : مجھے ابو زبیر نے بتایا کہ انھوں نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے سنا ، نیز قرہ بن خالد نے بھی ابو زبیر کے واسطے سے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے حدیث بیان کی کہ نبی کریم صلی اللہ علیہ وسلم غنیمتیں تقسیم فرمارہے تھے ۔ ۔ ۔ اور ( مذکورہ بالا حدیث کے مانند ) حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ قَالَ سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ يَقُولُ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ حَدَّثَنِي قُرَّةُ بْنُ خَالِدٍ حَدَّثَنِي أَبُو الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْسِمُ مَغَانِمَ وَسَاقَ الْحَدِيثَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10015,
                "hadithNumber": "2451",
                "englishNarrator": "Abu Said Khudri رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "'Ali رضی اللہ تعالیٰ عنہ sent some gold alloyed with dust to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), and the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) distributed that among four men, al-Aqra bin Habis Hanzali and Uyaina bin Badr al-Fazari and 'Alqama bin 'Ulatha al-'Amiri رضی اللہ تعالیٰ عنہ , then to one person of the tribe of Kilab and to Zaid al-Khair al-Ta'l, and then to one person of the tribe of Nabhan. Upon this the people of Quraish felt angry and said: He (the Holy Prophet) gave to the chiefs of Najd and ignored us. Upon this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: I have done it with a view to conciliating between them. Then there came a person with thick beard, prominent cheeks, deep sunken eyes and protruding forehead and shaven head. He said: Muhammad, fear Allah. Upon this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: If I disobey Allah, who would then obey Him? Have I not been (sent as the) most trustworthy among the people of the world? But you do not repose trust in me. That person then went back. A person among the people then sought permission (from the Holy Prophet) for his murder. According to some, it was Khalid bin Walid رضی اللہ تعالیٰ عنہ who sought the permission. Upon this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), said: From this very person's posterity there would arise people who would recite the Qur'an, but it would not go beyond their throat; they would kill the followers of Islam and would spare the idol-worshippers. They would glance through the teachings of Islam so hurriedly just as the arrow passes through the pray. If I were to ever find them I would kill them like 'Ad.",
                "hadithUrdu": "حضرت علی رضی اللہ تعالیٰ عنہ جب یمن میں تھے تو انھوں نےکچھ سونا رسول اللہ صلی اللہ علیہ وسلم کے پاس بھیجا جو اپنی مٹی کے اندر ہی تھا تو رسول اللہ صلی اللہ علیہ وسلم نے اسے چار افراد : اقرع بن حابس حنظلی ، عینیہ ( بن حصین بن حذیفہ ) بن بدر فزاری ، علقمہ بن علاثہ عامری رضی اللہ تعالیٰ عنہ جو اس کے بعد ( آگے بڑے قبیلے ) بنو کلاب ( بن ربیعہ بن عامر ) کا ایک فرد تھا اور زید الخیر طائی جو اس کے بعد ( آگے بنوطے کی ذیلی شاخ ) بن نہہمان کا ایک فرد تھا ، میں تقسیم فرمادیا ، کہا : اس پر قریش ناراض ہوگئے اور کہنےلگے : کیا آپ صلی اللہ علیہ وسلم نجدی سرداروں کو عطا کریں گے اور ہمیں چھوڑدیں گے؟تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" یہ کام میں نے ان کی تالیف قلب کی خاطر کیا ہے ۔ \" اتنے میں گھنی داڑھی ، ابھرے ہوئے رخساروں ، دھنسی ہوئی آنکھوں ، نکلی ہوئی پیشانی ، منڈھے ہوئے سر والا ایک شخص آیا اور کہا : اے محمد صلی اللہ علیہ وسلم !اللہ سے ڈریں!تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اگر میں اس کی نافرمانی کروں گاتو اس کی فرمانبرداری کون کرے گا!وہ تو مجھے تمام روئے زمین کے لوگوں پر امین سمجھتا ہے اور تم مجھے امین نہیں سمجھتے؟ \" پھر وہ آدمی پیٹھ پھیر کر چل دیا ، لوگوں میں سے ایک شخص نے اس کو قتل کرنے کی اجازت طلب کی ۔ ۔ ۔ بیان کرنے والے سمجھتے ہیں کہ وہ خالد بن ولید رضی اللہ تعالیٰ عنہ تھے ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اس کی اصل ( جس قبیلے سے اس کا اپنا تعلق ہے ) سے ایسی قوم ہوگی جو قرآن پڑھے گی لیکن وہ ان کے گلے سے نیچے نہیں اتر ےگا ۔ وہ اہل اسلام کو قتل کریں گے اور بت پرستوں کو چھوڑدیں گے ۔ وہ اسلام سے اس طرح نکل جائیں گے جس طرح تیر نشانہ بنائے جانے والے شکار سے نکل جاتا ہے ، اگر میں نے ان کو پالیاتو میں ہر صورت انھیں اس طرح قتل کروں گا جس طرح ( عذاب بھیج کر ) قوم عاد کو قتل کیا گیا ۔",
                "urduNarrator": "ہم سے ہناد بن سری نے بیان کیا، ہم سے ابو الاحواص نے بیان کیا, سعید بن مسروق نے عبدالرحمن بن ابی نعم سے اور انھوں نے حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ سَعِيدِ بْنِ مَسْرُوقٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي نُعْمٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ بَعَثَ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ وَهُوَ بِالْيَمَنِ بِذَهَبَةٍ فِي تُرْبَتِهَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَسَمَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ أَرْبَعَةِ نَفَرٍ الْأَقْرَعُ بْنُ حَابِسٍ الْحَنْظَلِيُّ وَعُيَيْنَةُ بْنُ بَدْرٍ الْفَزَارِيُّ وَعَلْقَمَةُ بْنُ عُلَاثَةَ الْعَامِرِيُّ ثُمَّ أَحَدُ بَنِي كِلَابٍ وَزَيْدُ الْخَيْرِ الطَّائِيُّ ثُمَّ أَحَدُ بَنِي نَبْهَانَ قَالَ فَغَضِبَتْ قُرَيْشٌ فَقَالُوا أَتُعْطِي صَنَادِيدَ نَجْدٍ وَتَدَعُنَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي إِنَّمَا فَعَلْتُ ذَلِكَ لِأَتَأَلَّفَهُمْ فَجَاءَ رَجُلٌ كَثُّ اللِّحْيَةِ مُشْرِفُ الْوَجْنَتَيْنِ غَائِرُ الْعَيْنَيْنِ نَاتِئُ الْجَبِينِ مَحْلُوقُ الرَّأْسِ فَقَالَ اتَّقِ اللَّهَ يَا مُحَمَّدُ قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَنْ يُطِعْ اللَّهَ إِنْ عَصَيْتُهُ أَيَأْمَنُنِي عَلَى أَهْلِ الْأَرْضِ وَلَا تَأْمَنُونِي قَالَ ثُمَّ أَدْبَرَ الرَّجُلُ فَاسْتَأْذَنَ رَجُلٌ مِنْ الْقَوْمِ فِي قَتْلِهِ يُرَوْنَ أَنَّهُ خَالِدُ بْنُ الْوَلِيدِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ مِنْ ضِئْضِئِ هَذَا قَوْمًا يَقْرَءُونَ الْقُرْآنَ لَا يُجَاوِزُ حَنَاجِرَهُمْ يَقْتُلُونَ أَهْلَ الْإِسْلَامِ وَيَدَعُونَ أَهْلَ الْأَوْثَانِ يَمْرُقُونَ مِنْ الْإِسْلَامِ كَمَا يَمْرُقُ السَّهْمُ مِنْ الرَّمِيَّةِ لَئِنْ أَدْرَكْتُهُمْ لَأَقْتُلَنَّهُمْ قَتْلَ عَادٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10016,
                "hadithNumber": "2452",
                "englishNarrator": "Abu Said al-Khudri رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "'Ali bin Abu Talib sent to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) from Yemen some gold alloyed with clay in a leather bag dyed in the leaves of Mimosa flava. He distributed it among four men. 'Uyaina bin Hisna, Aqra' bin Habis and Zaid al-Khail, and the fourth one was either Alqama bin 'Ulatha or 'Amir bin Tufail. A person from among his (Prophet's) Companions said: We had a better claim to this (wealth) than these (persons). This (remark) reached the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) upon which he said: Will you not trust me, whereas I am a trustee of Him Who is in the heaven? The news come to me from the heaven morning and evening. Then there stood up a person with deep sunken eyes, prominent cheek bones, and elevated forehead, thick beard, shaven head, tucked up loincloth, and he said: Messenger of Allah, fear Allah. He (the Holy Prophet) said: Woe to thee. Do I not deserve most to fear Allah amongst the people of the earth? That man then returned. Khalid b. Walid then said: Messenger of Allah, should I not strike his neck? Upon this he (the Holy Prophet) said: Perhaps he may be observing the prayer. Khalid said: How many observers of prayer are there who profess with their tongue what is not in their heart? Upon this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: I have not been commanded to pierce through the hearts of people, nor to split their bellies (insides). He again looked at him and he was going back. Upon this he (the Holy Prophet) said: There would arise a people from the progeny of this (man) who would recite the Qur'an glibly, but it would not go beyond their throats; they would (hurriedly) pass through (the teachings of their) religion just as the arrow passes through the prey. I conceive that he (the Holy Prophet) also said this: If I find them I would certainly kill them as were killed the (people of) Thamud.",
                "hadithUrdu": "حضرت علی بن ابی طالب نے یمن سے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں رنگے ہوئے ( دباغت شدہ ) چمڑے میں ( خام ) سونے کا ایک ٹکڑا بھیجاجسے مٹی سے الگ نہیں کیاگیا تھا تو آپ صلی اللہ علیہ وسلم نے اسے چار افراد : عینیہ بن حصن ، اقرع بن حابس ، زید الخیل اور چوتھے فرد علقمہ بن علاثہ یا عامر بن طفیل کے درمیان تقسیم کردیا ۔ اس پر آپ صلی اللہ علیہ وسلم کے ساتھیوں میں سے ایک آدمی نے کہا : ہم اس ( عطیے ) کے ان لوگوں کی نسبت زیادہ حق دار تھے ۔ کہا : یہ بات نبی کریم صلی اللہ علیہ وسلم تک پہنچی تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" کیا تم مجھے امین نہیں سمجھتے؟حالانکہ میں اس کا امین ہوں جو آسمان میں ہے ، میرے پاس صبح وشام آسمان کی خبر آتی ہے ۔ \" ( ابوسعید خدری رضی اللہ تعالیٰ عنہ نے ) کہا : گھنی داڑھی ، ابھرے ہوئے رخساروں ، دھنسی ہوئی آنکھوں ، نکلی ہوئی پیشانی ، منڈھے ہوئے سر والا اور پنڈلی تک اٹھے تہبند والا ایک شخص کھڑا ہوا ، اس نے کہا : اےاللہ کے رسول صلی اللہ علیہ وسلم ! اللہ سے ڈریئے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا؛ \" تجھ پر افسوس ، کیا میں تمام اہل زمین سے بڑھ کر اللہ سے ڈرنے کا حقدار نہیں ہوں! \" پھر وہ آدمی پیٹھ پھیر کر چل دیا ۔ توخالد بن ولید رضی اللہ تعالیٰ عنہ نے عرض کی : اے اللہ کے رسول صلی اللہ علیہ وسلم کیا میں اس کی گردن نہ اڑا دوں؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" نہیں ، ہوسکتا ہے کہ وہ نماز پڑھتا ہو ۔ \" خالد رضی اللہ تعالیٰ عنہ نے عرض کی : کتنے ہی نمازی ہیں جو زبان سے ( وہ بات ) کہتے ہیں ( کلمہ پڑھتے ہیں ) جو ان کے دلوں میں نہیں ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" مجھے یہ حکم نہیں دیا گیا کہ لوگوں کے دلوں میں سوراخ کروں اور نہ یہ کہ ان کے پیٹ چاک کروں ۔ \" پھر جب وہ پشت پھیر کر جارہاتھا تو آپ صلی اللہ علیہ وسلم نے اس کی طرف دیکھا اور فرمایا : \" یہ حقیقت ہے کہ اس کی اصل سے ایسے لوگ نکلیں گے جو اللہ کی کتاب کو بڑی تراوٹ سے پڑھیں گے ( لیکن ) لیکن وہ ان کے گلے سے نیچے نہیں اترے گی ، وہ دین سے اس طرح نکل جائیں گے جیسے تیر نشانہ بنائے جانے والے شکار سے نکلتا ہے ۔ \" ( ابو سعیدخدری رضی اللہ تعالیٰ عنہ نے ) کہا : میر اخیال ہے کہ آپ صلی اللہ علیہ وسلم نے فرمایا : \" اگر میں نے ان کو پالیا تو انھیں اس طرح قتل کروں گا جس طرح ثمود قتل ہوئے تھے ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, عبدالواحد نے عمارہ بن قعقاع سے ر وایت کی ، انھوں نے کہا : ہمیں عبدالرحمن بن نعیم نے حدیث بیان کی ، کہا : میں نے حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ کو فرماتے ہوئے سنا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا عَبْدُ الْوَاحِدِ عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي نُعْمٍ قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ يَقُولُ بَعَثَ عَلِيُّ بْنُ أَبِي طَالِبٍ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْيَمَنِ بِذَهَبَةٍ فِي أَدِيمٍ مَقْرُوظٍ لَمْ تُحَصَّلْ مِنْ تُرَابِهَا قَالَ فَقَسَمَهَا بَيْنَ أَرْبَعَةِ نَفَرٍ بَيْنَ عُيَيْنَةَ بْنِ حِصْنٍ وَالْأَقْرَعِ بْنِ حَابِسٍ وَزَيْدِ الْخَيْلِ وَالرَّابِعُ إِمَّا عَلْقَمَةُ بْنُ عُلَاثَةَ وَإِمَّا عَامِرُ بْنُ الطُّفَيْلِ فَقَالَ رَجُلٌ مِنْ أَصْحَابِهِ كُنَّا نَحْنُ أَحَقَّ بِهَذَا مِنْ هَؤُلَاءِ قَالَ فَبَلَغَ ذَلِكَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَلَا تَأْمَنُونِي وَأَنَا أَمِينُ مَنْ فِي السَّمَاءِ يَأْتِينِي خَبَرُ السَّمَاءِ صَبَاحًا وَمَسَاءً قَالَ فَقَامَ رَجُلٌ غَائِرُ الْعَيْنَيْنِ مُشْرِفُ الْوَجْنَتَيْنِ نَاشِزُ الْجَبْهَةِ كَثُّ اللِّحْيَةِ مَحْلُوقُ الرَّأْسِ مُشَمَّرُ الْإِزَارِ فَقَالَ يَا رَسُولَ اللَّهِ اتَّقِ اللَّهَ فَقَالَ وَيْلَكَ أَوَلَسْتُ أَحَقَّ أَهْلِ الْأَرْضِ أَنْ يَتَّقِيَ اللَّهَ قَالَ ثُمَّ وَلَّى الرَّجُلُ فَقَالَ خَالِدُ بْنُ الْوَلِيدِ يَا رَسُولَ اللَّهِ أَلَا أَضْرِبُ عُنُقَهُ فَقَالَ لَا لَعَلَّهُ أَنْ يَكُونَ يُصَلِّي قَالَ خَالِدٌ وَكَمْ مِنْ مُصَلٍّ يَقُولُ بِلِسَانِهِ مَا لَيْسَ فِي قَلْبِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي لَمْ أُومَرْ أَنْ أَنْقُبَ عَنْ قُلُوبِ النَّاسِ وَلَا أَشُقَّ بُطُونَهُمْ قَالَ ثُمَّ نَظَرَ إِلَيْهِ وَهُوَ مُقَفٍّ فَقَالَ إِنَّهُ يَخْرُجُ مِنْ ضِئْضِئِ هَذَا قَوْمٌ يَتْلُونَ كِتَابَ اللَّهِ رَطْبًا لَا يُجَاوِزُ حَنَاجِرَهُمْ يَمْرُقُونَ مِنْ الدِّينِ كَمَا يَمْرُقُ السَّهْمُ مِنْ الرَّمِيَّةِ قَالَ أَظُنُّهُ قَالَ لَئِنْ أَدْرَكْتُهُمْ لَأَقْتُلَنَّهُمْ قَتْلَ ثَمُودَ حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ بِهَذَا الْإِسْنَادِ قَالَ وَعَلْقَمَةُ بْنُ عُلَاثَةَ وَلَمْ يَذْكُرْ عَامِرَ بْنَ الطُّفَيْلِ وَقَالَ نَاتِئُ الْجَبْهَةِ وَلَمْ يَقُلْ نَاشِزُ وَزَادَ فَقَامَ إِلَيْهِ عُمَرُ بْنُ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ فَقَالَ يَا رَسُولَ اللَّهِ أَلَا أَضْرِبُ عُنُقَهُ قَالَ لَا قَالَ ثُمَّ أَدْبَرَ فَقَامَ إِلَيْهِ خَالِدٌ سَيْفُ اللَّهِ فَقَالَ يَا رَسُولَ اللَّهِ أَلَا أَضْرِبُ عُنُقَهُ قَالَ لَا فَقَالَ إِنَّهُ سَيَخْرُجُ مِنْ ضِئْضِئِ هَذَا قَوْمٌ يَتْلُونَ كِتَابَ اللَّهِ لَيِّنًا رَطْبًا وَقَالَ قَالَ عُمَارَةُ حَسِبْتُهُ قَالَ لَئِنْ أَدْرَكْتُهُمْ لَأَقْتُلَنَّهُمْ قَتْلَ ثَمُودَ و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا ابْنُ فُضَيْلٍ عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ بِهَذَا الْإِسْنَادِ وَقَالَ بَيْنَ أَرْبَعَةِ نَفَرٍ زَيْدُ الْخَيْرِ وَالْأَقْرَعُ بْنُ حَابِسٍ وَعُيَيْنَةُ بْنُ حِصْنٍ وَعَلْقَمَةُ بْنُ عُلَاثَةَ أَوْ عَامِرُ بْنُ الطُّفَيْلِ وَقَالَ نَاشِزُ الْجَبْهَةِ كَرِوَايَةِ عَبْدِ الْوَاحِدِ وَقَالَ إِنَّهُ سَيَخْرُجُ مِنْ ضِئْضِئِ هَذَا قَوْمٌ وَلَمْ يَذْكُرْ لَئِنْ أَدْرَكْتُهُمْ لَأَقْتُلَنَّهُمْ قَتْلَ ثَمُودَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10017,
                "hadithNumber": "2453",
                "englishNarrator": "This hadith has been narrated through another chain of transmitters and (the narrator) made a mention of elevated forehead, but he made no mention of tucked-up loin cloth and made this addition:",
                "hadithEnglish": "There stood up 'Umar bin Khattab رضی اللہ تعالیٰ عنہ , and said: Should I not strike his neck? Upon this he said: No. Then he turned away, and Khalid the Sword of Allah stood up against him, and said: Prophet of Allah. shall I not strike off his neck? He said, No, and then said: A people would rise from his progeny who would recite the Book of Allah glibly and fluently. 'Umar said: I think he (the Holy Prophet) also said this: If I find them I would certainly kill them like Thamud.",
                "hadithUrdu": "عمر بن خطاب رضی اللہ تعالیٰ عنہ اٹھ کر آپ صلی اللہ علیہ وسلم کی خدمت میں آئے اور عرض کی : اے اللہ کے رسول صلی اللہ علیہ وسلم !کیا میں اس کی گردن نہ اڑا دوں؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" نہیں ۔ \" کہا : پھر وہ پیٹھ پھیر کر چل پڑا تو خالد سیف اللہ رضی اللہ تعالیٰ عنہ اٹھ کر آپ صلی اللہ علیہ وسلم کے پاس حاضر ہوئے اور عرض کی : اے اللہ کے رسول صلی اللہ علیہ وسلم کیا میں اس کی گردن نہ اڑادوں؟تو آپ صلی اللہ علیہ وسلم نے فر مایا : \" نہیں ۔ \" پھر فرمایا : \" حقیقت یہ ہے کہ عنقریب اس کی اصل سے ایسے لوگ نکلیں گے جو اللہ تعالیٰ کی کتاب نرمی اور تراوٹ سے پڑھیں گے ۔ \" ( جریر نے ) کہا : عمارہ نے کہا : میرا خیال ہے کہ آپ صلی اللہ علیہ وسلم نے فرمایا : \" اگر میں نے ان کو پالیا تو ان کو اسی طرح قتل کروں گا جس طرح ثمود قتل ہوئے ۔",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ نے بیان کیا، انہوں نے کہا جریر نے عمارہ بن قعقاع سے اسی سند کے ساتھ حدیث بیان کی ، انھوں نے علقمہ بن علاثہ کاذکر کیا اور عامر بن طفیل کا ذکر نہیں کیا ۔ نیز ناتي الجبهة ( نکلی ہوئی پیشانی والا ) کہا اور ( عبدالواحد کی طرح ناشز ( ابھری ہوئی پیشانی والا ) نہیں کہا اور ان الفاظ کا اضافہ کیاکہ",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ، بِهَذَا الْإِسْنَادِ، قَالَ: وَعَلْقَمَةُ بْنُ عُلَاثَةَ، وَلَمْ يَذْكُرْ عَامِرَ بْنَ الطُّفَيْلِ، وَقَالَ: نَاتِئُ الْجَبْهَةِ، وَلَمْ يَقُلْ: نَاشِزُ، وَزَادَ: فَقَامَ إِلَيْهِ عُمَرُ بْنُ الْخَطَّابِ رَضِيَ اللهُ عَنْهُ فَقَالَ: يَا رَسُولَ اللهِ أَلَا أَضْرِبُ عُنُقَهُ؟ قَالَ: «لَا» قَالَ: ثُمَّ أَدْبَرَ فَقَامَ إِلَيْهِ خَالِدٌ، سَيْفُ اللهِ، فَقَالَ: يَا رَسُولَ اللهِ، أَلَا أَضْرِبُ عُنُقَهُ؟ قَالَ: «لَا» فَقَالَ: «إِنَّهُ سَيَخْرُجُ مِنْ ضِئْضِئِ هَذَا قَوْمٌ يَتْلُونَ كِتَابَ اللهِ لَيِّنًا رَطْبًا» وَقَالَ: قَالَ عُمَارَةُ: حَسِبْتُهُ قَالَ: «لَئِنْ أَدْرَكْتُهُمْ لَأَقْتُلَنَّهُمْ قَتْلَ ثَمُودَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10018,
                "hadithNumber": "2454",
                "englishNarrator": null,
                "hadithEnglish": "It was narrated from Umarah bin Al-Qaqa with this chian (a similar hadith as no. 2452) and he said: \"...between four men: Zaid Al-Khail, Al Aqra bin' bin Habis, 'Uyaynah or Amr bin At-tufail.\" And he said: \"...between four men: A high forehead,\" like the report  of Abdul-Wahid. And he said: 'There will emerge from the progeny of this men people who..\" but he did not say: \"If live to see them then I will certainly kill them like the killing of Thamud.\"",
                "hadithUrdu": "عمارہ بن قعقاع کے ایک دوسرے شاگرد ابن فضیل نے اسی سند کے ساتھ یہ حدیث بیان کی اور کہا : ( رسول اللہ صلی اللہ علیہ وسلم نے خام سونا ) چار افراد : زید الخیل ، اقرع بن حابس ، عینیہ بن حصن اور علقمہ بن علاثہ یا عامر بن طفیل میں ( تقسیم کیا ۔ ) اور عبدالواحدکی روایت کی طرح \" ابھری ہوئی پیشانی والا \" کہا اور انھوں نے \" اس کی اصل سے ( جس سے اس کا تعلق ہے ) ایک قوم نکلے گی \" کے الفاظ بیان کیے اورلئن ادركت لاقتلنهم قتل ثمود ( اگر میں نے ان کو پالیاتو ان کو اس طرح قتل کروں گا جس طرح ثمود قتل ہوئے ) کے الفاظ ذکر نہیں کیے ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا ابْنُ فُضَيْلٍ، عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ، بِهَذَا الْإِسْنَادِ، وَقَالَ: بَيْنَ أَرْبَعَةِ نَفَرٍ زَيْدُ الْخَيْرِ، وَالْأَقْرَعُ بْنُ حَابِسٍ، وَعُيَيْنَةُ بْنُ حِصْنٍ، وَعَلْقَمَةُ بْنُ عُلَاثَةَ، أَوْ عَامِرُ بْنُ الطُّفَيْلِ وَقَالَ: نَاشِزُ الْجَبْهَةِ، كَرِوَايَةِ عَبْدِ الْوَاحِدِ، وَقَالَ: إِنَّهُ سَيَخْرُجُ مِنْ ضِئْضِئِ هَذَا قَوْمٌ، وَلَمْ يَذْكُرْ «لَئِنْ أَدْرَكْتُهُمْ لَأَقْتُلَنَّهُمْ قَتْلَ ثَمُودَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10019,
                "hadithNumber": "2455",
                "englishNarrator": "Abu Salama and 'Ata' bin Yasar came to Abu Sa'id al-Khudri رضی اللہ تعالیٰ عنہ and asked him about Haruriya, saying:",
                "hadithEnglish": "Did you hear the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) making a mention of them? He (Abu Sai'd al-Khudri) said: I don't know who the Haruriya are, but I heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: There would arise in this nation (and he did not say out of them ) a people and you would hold insignificant your prayers as compared with their prayers. And they would recite the Qur'an which would not go beyond their throats and would swerve through the religion (as blank) just as a (swift) arrow passes through the prey. The archer looks at his arrow, at its iron head and glances at its end (which he held) in the tip of his fingers to see whether it had any stain of blood.",
                "hadithUrdu": "کیا آپ نے رسول اللہ صلی اللہ علیہ وسلم کو ان کا تذکرہ کرتے ہوئے سناتھا؟انھوں نے کہا : حروریہ کوتو میں نہیں جانتا ، البتہ میں نے یہ رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے یہ سنا ہے؛ \" اس امت میں ایک قوم نکلے گی ۔ آپ نے \" اس امت میں سے \" نہیں کہا ۔ تم اپنی نمازوں کو ان کی نمازوں سے ہیچ سمجھو گے ، وہ قرآن پڑھیں گے اور وہ ان کے حلق ۔ ۔ ۔ یا ان کے گلے ۔ ۔ ۔ سے نیچے نہیں اترے گا ۔ وہ اس طرح دین سے نکل جائیں گے جس طرح تیر شکار کیے ہوئے جانور سے نکل جاتا ہے اور تیر انداز اپنے تیر کی لکڑی کو ، اس کے پھل کو ، اسکی تانت کو دیکھتا ہے اور اس کے پچھلے حصے ( سوفار یا چٹکی ) کے بارے میں شک میں مبتلا ہوتا ہے کے کہا اس کے ساتھ ( شکار کے ) خون میں کچھ لگا ہے ۔ \" ( تیر تیزی سے نکل جائے تو اس پر خون وغیرہ زیادہ نہیں لگتا ۔ اسی طرح تیزی کے ساتھ دین سے نکلنے والے پردین کا کوئی اثر باقی نہیں رہتا ۔ )",
                "urduNarrator": "ہم سے محمد بن المثنیٰ نے بیان کیا، کہا ہم سے عبدالوہاب نے بیان کیا، انہوں نے کہا: میں نے یحییٰ بن سعید کو یہ کہتے ہوئے سنا: انہوں نے مجھ سے بیان کیا محمد بن ابراہیم نے ابو سلمہ اورعطاء بن یسار سے روایت کی کہ وہ دونوں حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ کی خدمت میں حاضر ہوئے اوران سے حروریہ کے بارے میں دریافت کیا",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ: سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ، يَقُولُ: أَخْبَرَنِي مُحَمَّدُ بْنُ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ، وَعَطَاءِ بْنِ يَسَارٍ، أَنَّهُمَا أَتَيَا أَبَا سَعِيدٍ الْخُدْرِيَّ، فَسَأَلَاهُ عَنِ الْحَرُورِيَّةِ، هَلْ سَمِعْتَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَذْكُرُهَا قَالَ: لَا أَدْرِي مَنِ الْحَرُورِيَّةُ، وَلَكِنِّي سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: يَخْرُجُ فِي هَذِهِ الْأُمَّةِ - وَلَمْ يَقُلْ: مِنْهَا - قَوْمٌ تَحْقِرُونَ صَلَاتَكُمْ مَعَ صَلَاتِهِمْ، فَيَقْرَءُونَ الْقُرْآنَ، لَا يُجَاوِزُ حُلُوقَهُمْ - أَوْ حَنَاجِرَهُمْ - يَمْرُقُونَ مِنَ الدِّينِ مُرُوقَ السَّهْمِ مِنَ الرَّمِيَّةِ، فَيَنْظُرُ الرَّامِي إِلَى سَهْمِهِ إِلَى نَصْلِهِ إِلَى رِصَافِهِ، فَيَتَمَارَى فِي الْفُوقَةِ، هَلْ عَلِقَ بِهَا مِنَ الدَّمِ شَيْءٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10020,
                "hadithNumber": "2456",
                "englishNarrator": "Abu Sai'd al-Khudri رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "When we were in the company of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and he was distributing the spoils of war, there came to him Dhul-Khuwasira, one of Banu Tamim. He said: Messenger of Allah, do justice. Upon this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Woe be upon thee! Who would do justice, if I do not do justice? You would be unsuccessful and incurring a loss, if I do not do justice. Upon this Umar bin Khattab رضی اللہ تعالیٰ عنہ said: Messenger of Allah, permit me to strike off his neck. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Leave him, for he has friends (who would outwardly look to be so religious and pious) that everyone among you would consider his prayer insignificant as compared with their prayer, and his fast as compared with their fasts. They would recite the Qur'an but it would not go beyond their collar-bones. They would pass through (the teachings of Islam so hurriedly) just as the arrow passes through the prey. He would look at its Iron head, but would not find anything ticking) there. He would then see at the lowest end, but would not find anything sticking there. He would then see at its grip but would not find anything sticking to it. He would then see at its feathers and he would find nothing sticking to them (as the arrow would pass so quickly that nothing would stick to it) neither excrement nor blood. They would be recognised by the presence of a black man among them whose upper arms would be like a woman's breast, or like a piece of meat as it quivers, and they would come forth at the time when there is dissension among the people. Abu Sai'd رضی اللہ تعالیٰ عنہ said: I testify to the fact that I heard it from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), and I testify to the fact that 'Ali bin Abu Talib  رضی اللہ تعالیٰ عنہ fought against them and I was with him. He gave orders about that man who was sought for, and when he was brought in, and when I looked at him, he was exactly as the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had described him.",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضرتھے اور آپ صلی اللہ علیہ وسلم کچھ مال تقسیم فرمارہے تھے کہ اسی اثناء میں آپ کے پاس ذوالخویصرہ جو بنو تمیم کا ایک فرد تھا ، آیا اور کہا : اے اللہ کے رسول صلی اللہ علیہ وسلم !عدل کیجئے ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" تیری ہلاکت ( کا سامان ہو ) !اگر میں عدل نہیں کرو گاتو کون عدل کرے گا؟ اگر میں عدل نہیں کررہا تو میں ناکام ہوگیا اور خسارے میں پڑ گیا ۔ \"\" ( یا اگر میں نے عدل نہ کیا تو تم ن اکام رہو گے اور خسارے میں ہوں گے ) اس پر حضر ت عمر بن خطاب رضی اللہ تعالیٰ عنہ نے عرض کی : اے اللہ کے رسول صلی اللہ علیہ وسلم ! مجھے اجازت دیجئے میں اس منافق کو قتل کردوں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" اے چھوڑ دو ، اس کے کچھ ساتھی ہوں گے ۔ تمھارا کوئی فرد اپنی نماز کو ان کی نماز اور اپنے روزوں کو ان کے روزوں کے سامنے ہیچ سمجھے گا ، یہ لوگ قرآن پڑھیں گے لیکن ان کی ہنسلیوں سے نیچے نہیں اترے گا ۔ اسلام سے اس طرح نکلیں گے جیسے تیر نشانہ بنائے گئے شکار سے نکلتاہے ۔ اس کے پھل ( یا پیکان ) کو دیکھا جائے تو اس میں کچھ نہیں پایا جاتا ، پھر اس کے سو فار کو دیکھا جائے تو اس میں بھی کچھ نہیں پایا جاتا ، پھر اس کے پر کو دیکھا جائے تو اس میں کچھ نہیں پایا جاتا ، وہ ( تیر ) گوبر اور خون سے آگے نکل گیا ( لیکن اس پر لگا کچھ بھی نہیں ) ، ان کی نشانی ایک سیاہ فام مرد ہے ، اس کے دونوں مونڈھوں میں سے ایک مونڈھا عورت کے پستان کی طرح یا گوشت کے ہلتے ہوئے ٹکڑے کی طرح ہوگا ۔ وہ لوگوں ( مسلمانوں ) کے باہمی اختلاف کے وقت ( نمودار ) ہوں گے ۔ \"\" ابو سعید خدری رضی اللہ تعالیٰ عنہ نے کہا : میں گواہی دیتا ہوں کہ میں نے یہ حدیث رسول اللہ صلی اللہ علیہ وسلم سے سنی ہے اور میں گواہی دیتا ہوں کہ حضرت علی رضی اللہ تعالیٰ عنہ نے ان کےخلاف جنگ کی ، میں ان کے ساتھ تھا ۔ انھوں نے اس آدمی ( کو تلاش کرنے ) کے بارے میں حکم دیا ، اسے تلاش کیا گیا تو وہ مل گیا ، اس ( کی لاش ) کو لایا گیا تو میں نے اس کو اسی طرح دیکھا جس طرح رسول اللہ صلی اللہ علیہ وسلم نے اس کا تعارف کرایاتھا ۔",
                "urduNarrator": "مجھ سے ابو الطاہر نے بیان کیا، کہا ہم سے عبداللہ بن وہب نے بیان کیا، مجھ سے یونس نے بیان کیا, ابن شہاب سے روایت ہے ، کہا : مجھے ابو سلمہ بن عبدالرحمان اورضحاک ہمدانی نے خبر دی کہ حضرت ابوسعید خدری رضی اللہ تعالیٰ عنہ نے کہا",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، ح وحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، وَأَحْمَدُ بْنُ عَبْدِ الرَّحْمَنِ الْفِهْرِيُّ، قَالَا: أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، وَالضَّحَّاكُ الْهَمْدَانِيُّ، أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ، قَالَ: بَيْنَا نَحْنُ عِنْدَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَقْسِمُ قَسْمًا، أَتَاهُ ذُو الْخُوَيْصِرَةِ، وَهُوَ رَجُلٌ مِنْ بَنِي تَمِيمٍ، فَقَالَ: يَا رَسُولَ اللهِ، اعْدِلْ، قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «وَيْلَكَ وَمَنْ يَعْدِلُ إِنْ لَمْ أَعْدِلْ؟ قَدْ خِبْتُ وَخَسِرْتُ إِنْ لَمْ أَعْدِلْ» فَقَالَ عُمَرُ بْنُ الْخَطَّابِ رَضِيَ اللهُ عَنْهُ: يَا رَسُولَ اللهِ، ائْذَنْ لِي فِيهِ أَضْرِبْ عُنُقَهُ، قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «دَعْهُ، فَإِنَّ لَهُ أَصْحَابًا يَحْقِرُ أَحَدُكُمْ صَلَاتَهُ مَعَ صَلَاتِهِمْ، وَصِيَامَهُ مَعَ صِيَامِهِمْ، يَقْرَءُونَ الْقُرْآنَ، لَا يُجَاوِزُ تَرَاقِيَهُمْ، يَمْرُقُونَ مِنَ الْإِسْلَامِ كَمَا يَمْرُقُ السَّهْمُ مِنَ الرَّمِيَّةِ، يُنْظَرُ إِلَى نَصْلِهِ فَلَا يُوجَدُ فِيهِ شَيْءٌ، ثُمَّ يُنْظَرُ إِلَى رِصَافِهِ فَلَا يُوجَدُ فِيهِ شَيْءٌ، ثُمَّ يُنْظَرُ إِلَى نَضِيِّهِ فَلَا يُوجَدُ فِيهِ شَيْءٌ - وَهُوَ الْقِدْحُ - ثُمَّ يُنْظَرُ إِلَى قُذَذِهِ فَلَا يُوجَدُ فِيهِ شَيْءٌ، سَبَقَ الْفَرْثَ وَالدَّمَ، آيَتُهُمْ رَجُلٌ أَسْوَدُ، إِحْدَى عَضُدَيْهِ مِثْلُ ثَدْيِ الْمَرْأَةِ، أَوْ مِثْلُ الْبَضْعَةِ تَتَدَرْدَرُ، يَخْرُجُونَ عَلَى حِينِ فُرْقَةٍ مِنَ النَّاسِ» قَالَ أَبُو سَعِيدٍ: «فَأَشْهَدُ أَنِّي سَمِعْتُ هَذَا مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَأَشْهَدُ أَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ رَضِيَ اللهُ عَنْهُ قَاتَلَهُمْ وَأَنَا مَعَهُ، فَأَمَرَ بِذَلِكَ الرَّجُلِ فَالْتُمِسَ، فَوُجِدَ، فَأُتِيَ بِهِ، حَتَّى نَظَرْتُ إِلَيْهِ، عَلَى نَعْتِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الَّذِي نَعَتَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10021,
                "hadithNumber": "2457",
                "englishNarrator": "Abu Sa'id al-Khudri رضی اللہ تعالیٰ عنہ said:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) made a mention of a sect that would be among his Ummah which would emerge out of the dissension of the people. Their distinctive mark would be shaven heads. They would be the worst creatures or the worst of the creatures. The group who would be nearer to the truth out of the two would kill them. The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) gave an example (to give their description) or he said: A man throws an arrow at the prey (or he said at the target), and sees at its iron head, but finds no sign (of blood there), or he sees at the lowest end, but would not see or find any sign (of blood there). He would then see into the grip but would not find (anything) sticking to it. Abu Sai'd رضی اللہ تعالیٰ عنہ then said: People of Iraq. it is you who have killed them.",
                "hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم نے کچھ لوگوں کا تذکرہ فرمایا جو آپ صلی اللہ علیہ وسلم کی امت میں ہوں گے ، وہ لوگوں میں افتراق کے وقت سے نکلیں گے ، ان کی نشانی سر منڈانا ہوگی ، آپ صلی اللہ علیہ وسلم نے فرمایا : \" وہ مخلوق کے بدترین لوگ ۔ یا مخلوق کے بدترین لوگوں میں سے ہوں گے ، ان کو دو گروہوں میں سے وہ ( گروہ ) قتل کرے گا جو حق کے قریب تر ہوگا ۔ \" آپ نے ان کی مثال بیان کی یا بات ارشاد فرمائی : \" انسان شکار کو ۔ ۔ ۔ یا فرمایا : نشانے کو ۔ تیر مارتا ہے وہ پھل کو دیکھتا ہے تو اسے ( خون کا ) نشان نظر نہیں آتا ( جس سے بصیرت حاصل ہوجائے کہ شکار کو لگا ہے ) ، پیکان اور پر کے درمیانی حصے کو دیکھتا ہے تو کوئی نشان نظر نہیں آتا ، وہ سوفار ( پچھلے حصے ) کو دیکھتا ہے تو کوئی نشان نہیں دیکھتا ۔ \" حضرت ابوسعید خدری رضی اللہ تعالیٰ عنہ نے کہا : اے اہل عراق!تم ہی نے ان کو ( حضرت علی رضی اللہ تعالیٰ عنہ کی معیت میں ) قتل کیا ہے ۔",
                "urduNarrator": "مجھ سے محمد بن المثنیٰ نے بیان کیا، ہم سے ابن ابی عدی نے بیان کیا,سلیمان بن ابو نضرہ سے اور انھوں نے حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ سُلَيْمَانَ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَكَرَ قَوْمًا يَكُونُونَ فِي أُمَّتِهِ يَخْرُجُونَ فِي فُرْقَةٍ مِنْ النَّاسِ سِيمَاهُمْ التَّحَالُقُ قَالَ هُمْ شَرُّ الْخَلْقِ أَوْ مِنْ أَشَرِّ الْخَلْقِ يَقْتُلُهُمْ أَدْنَى الطَّائِفَتَيْنِ إِلَى الْحَقِّ قَالَ فَضَرَبَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَهُمْ مَثَلًا أَوْ قَالَ قَوْلًا الرَّجُلُ يَرْمِي الرَّمِيَّةَ أَوْ قَالَ الْغَرَضَ فَيَنْظُرُ فِي النَّصْلِ فَلَا يَرَى بَصِيرَةً وَيَنْظُرُ فِي النَّضِيِّ فَلَا يَرَى بَصِيرَةً وَيَنْظُرُ فِي الْفُوقِ فَلَا يَرَى بَصِيرَةً قَالَ قَالَ أَبُو سَعِيدٍ وَأَنْتُمْ قَتَلْتُمُوهُمْ يَا أَهْلَ الْعِرَاقِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10022,
                "hadithNumber": "2458",
                "englishNarrator": "Abu Sa'id al-Khudri رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: A group would secede itself (from the Ummah) when there would be dissension among the Muslims. Out of the two groups who would be nearer the truth would kill them.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" مسلمانوں میں افتراق کے وقت تیزی سے ( اپنے ہدف کے اندر سے ) نکل جانےو الا ایک گروہ نکلے گا دو جماعتوں میں سے جو جماعت حق سے زیادہ تعلق رکھنے والی ہوگی ، ( وہی ) اسے قتل کرے گی ۔ \"",
                "urduNarrator": "ہم سے شیبان بن فروخ نے بیان کیا, قاسم بن فضل حدانی نے حدیث بیان کی ، کہا : ہم سے ابو نضرہ نے حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ سے حدیث بیان کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا الْقَاسِمُ وَهُوَ ابْنُ الْفَضْلِ الْحُدَّانِيُّ حَدَّثَنَا أَبُو نَضْرَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَمْرُقُ مَارِقَةٌ عِنْدَ فُرْقَةٍ مِنْ الْمُسْلِمِينَ يَقْتُلُهَا أَوْلَى الطَّائِفَتَيْنِ بِالْحَقِّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10023,
                "hadithNumber": "2459",
                "englishNarrator": "Abu Sa'id al-Khudri رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: There would be two groups in my Ummah, and there would emerge another group (seceding itself from both of them), and the party nearer to the truth among the two would kill them (the group of the Khawarij).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" میری امت کے دو گروہ ہوں گے ان دونوں کےدرمیان سے ، دین میں سے تیزی سے باہر ہوجانے والے نکلیں گے ، انھیں وہ گروہ قتل کرے گا جو دونوں گروہوں میں سے زیادہ حق کے لائق ہوگا ۔ \"",
                "urduNarrator": "ہم سے ابو الربیع الزہرانی اور قتیبہ بن سعید نے بیان کیا، قتیبہ نے کہا کہ ہم سے ابو عوانہ نے بیان کیا, قتادہ نے ابو نضر ہ سے اور انھوں نے حضرت ابوسعید خدری رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو الرَّبِيعِ الزَّهْرَانِيُّ وَقُتَيْبَةُ بْنُ سَعِيدٍ قَالَ قُتَيْبَةُ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَكُونُ فِي أُمَّتِي فِرْقَتَانِ فَتَخْرُجُ مِنْ بَيْنِهِمَا مَارِقَةٌ يَلِي قَتْلَهُمْ أَوْلَاهُمْ بِالْحَقِّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10024,
                "hadithNumber": "2460",
                "englishNarrator": "It was narrated from Abu Sa'eed Al-Khudri رضی اللہ تعالیٰ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: A group will secede at a time of division among the people, and they will be killed by the group that is closer to the truth.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" لوگوں میں گروہ بندی کےوقت دین میں سے تیزی سے نکل جانے والا ایک فرقہ تیزی سے نکلے گا ۔ ان کے قتل کی ذمہ داری دونوں جماعتوں میں سے حق سے زیادہ تعلق رکھنےوالی جماعت پوری کرے گی ۔ \"",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا، کہا ہم سے عبد الاعلی نے بیان کیا، انہوں نے کہا داود نے ابونضرہ سے اور انھوں نے حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا دَاوُدُ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تَمْرُقُ مَارِقَةٌ فِي فُرْقَةٍ مِنْ النَّاسِ فَيَلِي قَتْلَهُمْ أَوْلَى الطَّائِفَتَيْنِ بِالْحَقِّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10025,
                "hadithNumber": "2461",
                "englishNarrator": "Abu Sa'id al-Khudri رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) that a group (Khawarij) would emerge from the different parties (the party of Hadrat 'Ali and the party of Amir Mu'awiya), the group nearer the truth between the two would kill them.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم سے یہ بات ایک حدیث میں روایت کی جس میں آپ نے اس قوم کا تذکرہ فرمایا جو ( امت کے ) مختلف گروہوں میں بٹنے کے وقت نکلے گی ، ان کو دونوں گروہوں میں سے حق سے قریب تر گروہ قتل کرے گا ۔",
                "urduNarrator": "مجھ سے عبید اللہ القوایری نے بیان کیا، ہم سے محمد بن عبداللہ بن الزبیر نے بیان کیا، ہم سے سفیان ثابت نے بیان کیا, ضحاک مشرقی نے حضرت ابوسعید خدری رضی اللہ تعالیٰ عنہ سے اور انھوں نے",
                "hadithArabic": "حَدَّثَنِي عُبَيْدُ اللَّهِ الْقَوَارِيرِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ حَدَّثَنَا سُفْيَانُ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ الضَّحَّاكِ الْمِشْرَقِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَدِيثٍ ذَكَرَ فِيهِ قَوْمًا يَخْرُجُونَ عَلَى فُرْقَةٍ مُخْتَلِفَةٍ يَقْتُلُهُمْ أَقْرَبُ الطَّائِفَتَيْنِ مِنْ الْحَقِّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10026,
                "hadithNumber": "2462",
                "englishNarrator": "Ali رضی اللہ تعالیٰ عنہ said:",
                "hadithEnglish": "Whenever I narrate to you anything from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) believe it to be absolutely true as falling from the sky is dearer to me than that of attributing anything to him (the Holy Prophet) which he never said. When I talk to you of anything which is between me and you (there might creep some error in it) for battle is an outwitting. I heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: There would arise at the end of the age a people who would be young in age and immature in thought, but they would talk (in such a manner) as if their words are the best among the creatures. They would recite the Qur'an, but it would not go beyond their throats, and they would pass through the religion as an arrow goes through the prey. So when you meet them, kill them, for in their killing you would get a reward with Allah on the Day of Judgement.",
                "hadithUrdu": "جب میں تمھیں رسول اللہ صلی اللہ علیہ وسلم سے حدیث سنا ؤں تو یہ با ت کہ میں آسمان سے گرپڑوں مجھے اس سے زیادہ پسند ہے کہ میں آپ کی طرف کو ئی ایسی با ت منسوب کروں جو آپ نے نہیں فر ما ئی ۔ اورجب میں تم سے اس معاملے میں با ت کروں جو میرے اور تمھا رے درمیان ہے ( تو رسول اللہ صلی اللہ علیہ وسلم کے اس قول سے استشہاد کر سکتا ہوں کہ ) جنگ ایک چال ہے ( لیکن ) میں نے رسول اللہ صلی اللہ علیہ وسلم کو ( بصراحت یہ ) فر ما تے ہو ئے سنا : \" عنقریب ( خلا فت راشدہ کے ) آخری زمانے میں ایک قوم نکلے گی وہ لو گ کم عمر اور کم عقل ہو ں گے ( بظاہر ) مخلوق کی سب سے بہترین با ت کہیں گے قرآن پڑھیں گے جو ان کے حلق سے نیچے نہیں اترے گا دین کے اندر سے اس طرح تیزی سے نکل جا ئیں گے جس طرح تیرتیزی سے شکار کے اندر سے نکل جا تا ہے جب تمھا را ان سے سامنا ہو تو ان کو قتل کر دینا جس نے ان کو قتل کیا اس کے لیے یقیناً قیامت کے دن اللہ کے ہاں اجر ہے ۔",
                "urduNarrator": "ہم سے محمد بن عبداللہ بن نمیر اور عبداللہ بن سعید الاشجع نے بیان کیا، وکیع کی سند سے، ہم سے الا شج نے بیان کیا, وکیع نے حدیث بیان کی کہا اعمش نے ہمیں خیثمہ سے حدیث بیان کی ، انھوں نے سوید بن غفلہ سے روا یت کی انھوں نے کہا : حضرت علی رضی اللہ تعالیٰ عنہ نے فر ما یا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ وَعَبْدُ اللَّهِ بْنُ سَعِيدٍ الْأَشَجُّ جَمِيعًا عَنْ وَكِيعٍ قَالَ الْأَشَجُّ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الْأَعْمَشُ عَنْ خَيْثَمَةَ عَنْ سُوَيْدِ بْنِ غَفَلَةَ قَالَ قَالَ عَلِيٌّ إِذَا حَدَّثْتُكُمْ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَأَنْ أَخِرَّ مِنْ السَّمَاءِ أَحَبُّ إِلَيَّ مِنْ أَنْ أَقُولَ عَلَيْهِ مَا لَمْ يَقُلْ وَإِذَا حَدَّثْتُكُمْ فِيمَا بَيْنِي وَبَيْنَكُمْ فَإِنَّ الْحَرْبَ خَدْعَةٌ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ سَيَخْرُجُ فِي آخِرِ الزَّمَانِ قَوْمٌ أَحْدَاثُ الْأَسْنَانِ سُفَهَاءُ الْأَحْلَامِ يَقُولُونَ مِنْ خَيْرِ قَوْلِ الْبَرِيَّةِ يَقْرَءُونَ الْقُرْآنَ لَا يُجَاوِزُ حَنَاجِرَهُمْ يَمْرُقُونَ مِنْ الدِّينِ كَمَا يَمْرُقُ السَّهْمُ مِنْ الرَّمِيَّةِ فَإِذَا لَقِيتُمُوهُمْ فَاقْتُلُوهُمْ فَإِنَّ فِي قَتْلِهِمْ أَجْرًا لِمَنْ قَتَلَهُمْ عِنْدَ اللَّهِ يَوْمَ الْقِيَامَةِ.",
                "headingArabic": "التَّحْرِيضِ عَلَى قَتْلِ الْخَوَارِجِ ‏",
                "headingUrdu": "خوارج کو قتل کرنے کی تلقین",
                "headingEnglish": "Exhortation to kill the Khawarij",
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10027,
                "hadithNumber": "2463",
                "englishNarrator": null,
                "hadithEnglish": "A similar report (as no. 2462) was narrated from Al A'mash with this chain.",
                "hadithUrdu": "ہم سے اسحاق بن ابراہیم نے بیان کیا, عیسیٰ بن یو نس اور سفیان دو نوں نے اعمش سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ وَأَبُو بَكْرِ بْنُ نَافِعٍ قَالَا حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا سُفْيَانُ كِلَاهُمَا عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10028,
                "hadithNumber": "2464",
                "englishNarrator": "This hadith has been narrated on the authority of A'mash with the same chain of transmitters, but (these words) are not there:",
                "hadithEnglish": "They pass through the religion clean as the arrow passes through the prey.",
                "hadithUrdu": "\" دین میں سے تیز رفتاری کے ساتھ یوں نکلیں گے جس طرح تیر نشانہ لگے شکار سے تیزی سے نکل جاتا ہے کے الفا ظ نہیں ہیں ۔",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ نے بیان کیا، کہا ہم سے جریر ایچ نے بیان کیا، کہا ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، انہیں ابو کریب نے اور ہم سے زہیر بن حرب نے بیان کیا، انہوں نے کہا کہ ہم سے ابو معاویہ نے بیان کیا کہ وہ دونوں اعمش سے جریر اور ابو معاویہ نے اسی سند کے ساتھ روایت کی اور ان دو نوں کی حدیث میں",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ وَزُهَيْرُ بْنُ حَرْبٍ قَالُوا حَدَّثَنَا أَبُو مُعَاوِيَةَ كِلَاهُمَا عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ وَلَيْسَ فِي حَدِيثِهِمَا يَمْرُقُونَ مِنْ الدِّينِ كَمَا يَمْرُقُ السَّهْمُ مِنْ الرَّمِيَّةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10029,
                "hadithNumber": "2465",
                "englishNarrator": "Abida narrated from 'Ali رضی اللہ عنہ that he made a mention of the Khawarij (and in this connection) said:",
                "hadithEnglish": "There would be a person among them with a defective hand (or with a short hand) or a fleshy hand. If you were to exercise restraint, I would tell you what Allah has promised to those who would kill them on the order of Muhammad ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). I (the narrator) said to him: Did you hear it from Muhammad ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ )? He (Hadrat 'Ali) said: Yes, by the Lord of the Ka'bah; Yes, by the Lord of the Ka'bah; yes, by the Lord of the Ka'bah.",
                "hadithUrdu": "ان میں ایک آدمی ناقص چھوٹے یا زیادہ اور ہلتے ہو ئے گو شت کے ( جیسے ) ہاتھ والا ہو گا اگر تمھا رے اترا نے کا ڈر نہ ہو تا تو جو کچھ اللہ تعا لیٰ نے انھیں قتل کرنے والوں کے لیے رسول اللہ صلی اللہ علیہ وسلم کی زبان سے وعدہ فر ما یا ہے وہ میں تمھیں بتا تا ۔ ( عبیدہ نے ) کہا میں نے عرض کی : کیا آپ نے یہ ( وعدہ برا راست ) محمد صلی اللہ علیہ وسلم سے سنا ہے ؟ انھوں نے کہا : رب کعبہ کی قسم! ہاں رب کعبہ قسم !ہاں رب کعبہ کی قسم !ہاں",
                "urduNarrator": "ہم سے محمد بن ابی بکر مقدامی نے بیان کیا، ہم سے ابن الیہ اور حماد بن زید نے بیان کیا اور ہم سے قتیبہ بن سعید نے بیان کیا، ہم سے حماد بن زید نے بیان کیا، اور ان سے ابوبکر بن ابی شیبہ اور زہیر بن حرب نے بیان کیا۔ انہوں نے کہا: ہم سے اسماعیل بن اولیہ نے بیان کیا۔ایو ب نے محمد سے انھوں نے عبیدہ سے اور انھوں نے حضرت علی رضی اللہ عنہ سے روایت کی انھوں نے خوارج کا ذکر کیا اور کہا",
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ حَدَّثَنَا ابْنُ عُلَيَّةَ وَحَمَّادُ بْنُ زَيْدٍ ح و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ وَاللَّفْظُ لَهُمَا قَالَا حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ عَنْ أَيُّوبَ عَنْ مُحَمَّدٍ عَنْ عَبِيدَةَ عَنْ عَلِيٍّ قَالَ ذَكَرَ الْخَوَارِجَ فَقَالَ فِيهِمْ رَجُلٌ مُخْدَجُ الْيَدِ أَوْ مُودَنُ الْيَدِ أَوْ مَثْدُونُ الْيَدِ لَوْلَا أَنْ تَبْطَرُوا لَحَدَّثْتُكُمْ بِمَا وَعَدَ اللَّهُ الَّذِينَ يَقْتُلُونَهُمْ عَلَى لِسَانِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قُلْتُ آنْتَ سَمِعْتَهُ مِنْ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِي وَرَبِّ الْكَعْبَةِ إِي وَرَبِّ الْكَعْبَةِ إِي وَرَبِّ الْكَعْبَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10030,
                "hadithNumber": "2466",
                "englishNarrator": "Abida said:",
                "hadithEnglish": "I will not narrate to you except what I heard from him (Hadrat 'Ali رضی اللہ عنہ ), and then he narrated from him.\" Then he narrated from 'Ali a hadith similar to that of Ayyub (no. 2464).",
                "hadithUrdu": "ہم سے محمد بن المثنی نے بیان کیا، کہا ہم سے ابن ابی عدی نے بیان کیا، ان کی سند سےابن عون نے محمد سے اور انھوں نے عبیدہ سے روایت کی ، انھوں نے کہا میں تمھیں صرف وہی بیان کروں گا جو میں نے ان ( علی رضی اللہ تعالیٰ عنہ ) سے سنا ہے پھر انھوں نے حضرت علی رضی اللہ عنہ سے ایو ب کی حدیث کی طرح مرفو ع حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ ابْنِ عَوْنٍ عَنْ مُحَمَّدٍ عَنْ عَبِيدَةَ قَالَ لَا أُحَدِّثُكُمْ إِلَّا مَا سَمِعْتُ مِنْهُ فَذَكَرَ عَنْ عَلِيٍّ نَحْوَ حَدِيثِ أَيُّوبَ مَرْفُوعًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10031,
                "hadithNumber": "2467",
                "englishNarrator": "Zaid bin Wahb Juhani reported:",
                "hadithEnglish": "He was among the squadron which was under the command of Ali رضی اللہ تعالیٰ عنہ and which set out (to curb the activities) of the Khawarij. 'Ali رضی اللہ تعالیٰ عنہ said: O people, I heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) say: There would arise from my Ummah a people who would recite the Qur'an, and your recital would seem insignificant as compared with their recital, your prayer as compared with their prayer, and your fast, as compared with their fast. They would recite the Qur'an thinking that it supports them, whereas it is an evidence against them. Their prayer does not get beyond their collar bone; they would swerve through Islam just as the arrow passes through the prey. If the squadron which is to encounter them were to know (what great boon) has been assured to them by their Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) they would completely rely upon this deed (alone and cease to do other good deeds), and their (that of the Khawarij) distinctive mark is that there would be (among them) a person whose wrist would be without the arm, and the end of his wrist would be fleshy like the nipple of the breast on which there would be white hair. You would be marching towards Muawiya and the people of Syria and you would leave them behind among your children and your property (to do harm). By Allah, I believe that these are the people (against whom you have been commanded to fight and get reward) for they have shed forbidden blood, and raided the animals of the people. So go forth in the name of Allah (to fight against them). Salama b. Kuhail mentioned that Zaid b. Wahb made me alight at every stage, till we crossed a bridge. 'Abdullah b. Wahb al-Rasibi was at the head of the Khawarij when we encountered them. He ('Abdullah) said to his army: Throw the spears and draw out your swords from their sheaths, for I fear that they would attack you as they attacked you on the day of Harura. They went back and threw their spears and drew out their swords, and people fought against them with spears and they were killed one after another. Only two persons were killed among the people (among the army led by 'Ali) on that day. 'Ali رضی اللہ تعالیٰ عنہ said: Find out from among them (the dead bodies of the Khawarij) (the maimed). They searched but did not find him. 'Ali رضی اللہ تعالیٰ عنہ then himself stood up and (walked) till he came to the people who had been killed one after another. He ('Ali رضی اللہ تعالیٰ عنہ ) said: Search them to the last, and then ('Ali's companions) found him (the dead body of the maimed) near the earth. He ('Ali رضی اللہ تعالیٰ عنہ) then pronounced Allahu Akbar (Allah is the Greatest) and then said, Allah told the Truth and His Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) conveyed it. Then there stood before him 'Abida Salmani who said: Commander of the Believers, by Allah, besides Whom there is no god but He, (tell me) whether you heard this hadith from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). He said: Yes, by Allah, besides Whom there is no god but He. He asked him to take an oath thrice and he took the oath.",
                "hadithUrdu": "وہ اس لشکر میں شامل تھے جو حضرت علی رضی اللہ تعالیٰ عنہ کے ساتھ تھا ( اور ) خوارج کی طرف روانہ ہوا تھا تو حضرت علی رضی اللہ تعالیٰ عنہ نے کہا : لو گو !میں نے رسول اللہ صلی اللہ علیہ وسلم کو فر ما تے ہو ئے سنا : \"\" میری امت سے کچھ لو گ نکلیں گے وہ ( اس طرح ) قرآن پڑھیں گے کہ تمھا ری قراءت ان کی قراءت کے مقابلے میں کچھ نہ ہو گی اور نہ تمھا ری نمازوں کی ان کی نمازوں کے مقابلے میں کو ئی حیثیت ہو گی اور نہ ہی تمھا رے روزوں کی ان کے روزوں کے مقابلے میں کو ئی حیثیت ہو گی ۔ وہ قرآن پڑھیں گے اور خیال کریں گے وہ ان کے حق میں ہے حا لا نکہ وہ ان کے خلا ف ہو گا ان کی نماز ان کی ہنسلیوں سے آگے نہیں بڑھے گی وہ اس طرح تیزرفتا ری کے ساتھ اسلام سے نکل جا ئیں گے جس طرح تیر بہت تیزی سے شکا ر کے اندر سے نکل جا تا ہے ۔ : \"\" اگر وہ لشکر جو ان کو جا لے گا جا ن لے کہ ان کے نبی صلی اللہ علیہ وسلم کی زبان سے ان کے بارے میں کیا فیصلہ ہوا ہے تو وہ عمل سے ( بے نیاز ہو کر صرف اسی عمل پر ) بھروسا کر لیں ۔ اس ( گروہ ) کی نشانی یہ ہے کہ ان میں ایک آدمی ہو گا جس کا عضد ( بازو ، کندھے سے لے کر کہنی تک کا حصہ ) ہو گا کلا ئی نہیں ہو گی اس کے بازو کے سر ے پر پستان کی نو ک کی طرح ( کا نشان ) ہو گا جس پر سفید بال ہوں گے تو لو گ معاویہ رضی اللہ تعالیٰ عنہ اور اہل شام کی طرف جا رہے ہو اور ان ( لوگوں ) کو چھوڑرہے ہو جو تمھا رے بعد تمھا رے بچوں اور اموال پر آپڑیں گے اللہ کی قسم!مجھے امید ہے کہ وہی قوم ہے کیونکہ انھوں نے ( مسلمانوں کا ) حرمت والا خون بہا یا ہے اور لوگوں کے مویشیوں پر غارت گر ی کی ہے اللہ کا نا م لے کر ( ان کی طرف ) چلو ۔ سلمہ بن کہیل نے کہا : مجھے زید بن وہب نے ( ایک ایک ) منزل میں اتارا ( ہر منزل کے بارے میں تفصیل سے ) بتا یا حتیٰ کے بتا یا : ہم ایک پل پر سے گزرے پھر جب ہمارا آمنا سامنا ہوا تو اس روز خوارج کا سپہ سالار عبد اللہ بن وہب راسی تھا اس نے ان سے کہا : اپنے نیزے پھنیک دو اور اپنی تلواریں نیا موں سے نکا ل لو کیونکہ مجھے خطرہ ہے کہ وہ تمھا رے سامنے ( صلح کے لیے اللہ کا نا م ) پکا ریں گے جس طرح انھوں نے خروراء کے دن تمھا رے سامنے پکا را تھا تو انھوں نے لوٹ کر اپنے نیزے دو ر پھینک دیے اور تلواریں سونت لیں تو لو گ انھی نیزوں کے ساتھ ان پر پل پڑے اور وہ ایک دوسرے پر قتل ہو ئے ( ایک کے بعد دوسرا آتا اور قتل ہو کر پہلو ں پر گرتا ) اور اس روز ( علی رضی اللہ تعالیٰ عنہ کا ساتھ دینے والے ) لو گوں میں سے دو کے سوا کو ئی اور قتل نہ ہوا حضرت علی رضی اللہ تعالیٰ عنہ نے کہا ان میں ادھورے ہاتھ والے کو تلا ش کرو لو گوں نے بہت ڈھونڈا لیکن اس کو نہ پا سکے اس پر حضرت علی رضی اللہ تعالیٰ عنہ خود اٹھے اور ان لو گوں کے پاس آئے جو قتل ہو کر ایک دوسرے پر گرے ہو ئے تھے آپ نے فر ما یا : ان کو ہٹاؤ تو انھوں نے اسے ( لا شوں کے نیچے ) زمین سے لگا ہوا پا یا ۔ آپ نے اللہ اکبر کہا پھر کہا : اللہ نے سچ فر ما یا اور اس کے رسول اللہ صلی اللہ علیہ وسلم نے ( اسی طرح ہم تک ) پہنچا دیا ۔ ( زید بن وہب نے ) کہا عبیدہ سلمانی کھڑے ہو کر آپ کے سامنے حاضر ہو ئے اور کہا اے امیر المومنین ! اس اللہ کی قسم جس کے سوا کو ئی عبادت کے لا ئق نہیں !آپ نے واقعی یہ حدیث رسول اللہ صلی اللہ علیہ وسلم سے سنی تھی؟ تو انھوں نے کہا : ہاں اس اللہ کی قسم جس کے سوا کو ئی عبادت کے لا ئق نہیں !حتیٰ کہ اس نے آپ سے تین دفعہ قسم لی اور آپ اس کے سامنے حلف اٹھاتے رہے ۔",
                "urduNarrator": "ہم سے عبد بن حمید نے بیان کیا، انہوں نے بیان کیا, ہم سے عبدالرزاق بن ہمام نے بیان کیا، ہم سے عبدالملک بن ابی سلیمان نے بیان کیا, سلمہ بن کہیل نے کہا : مجھے زید بن وہب جہنی ؒ نے حدیث سنا ئی کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ بْنُ هَمَّامٍ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ أَبِي سُلَيْمَانَ حَدَّثَنَا سَلَمَةُ بْنُ كُهَيْلٍ حَدَّثَنِي زَيْدُ بْنُ وَهْبٍ الْجُهَنِيُّ أَنَّهُ كَانَ فِي الْجَيْشِ الَّذِينَ كَانُوا مَعَ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ الَّذِينَ سَارُوا إِلَى الْخَوَارِجِ فَقَالَ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ أَيُّهَا النَّاسُ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يَخْرُجُ قَوْمٌ مِنْ أُمَّتِي يَقْرَءُونَ الْقُرْآنَ لَيْسَ قِرَاءَتُكُمْ إِلَى قِرَاءَتِهِمْ بِشَيْءٍ وَلَا صَلَاتُكُمْ إِلَى صَلَاتِهِمْ بِشَيْءٍ وَلَا صِيَامُكُمْ إِلَى صِيَامِهِمْ بِشَيْءٍ يَقْرَءُونَ الْقُرْآنَ يَحْسِبُونَ أَنَّهُ لَهُمْ وَهُوَ عَلَيْهِمْ لَا تُجَاوِزُ صَلَاتُهُمْ تَرَاقِيَهُمْ يَمْرُقُونَ مِنْ الْإِسْلَامِ كَمَا يَمْرُقُ السَّهْمُ مِنْ الرَّمِيَّةِ لَوْ يَعْلَمُ الْجَيْشُ الَّذِينَ يُصِيبُونَهُمْ مَا قُضِيَ لَهُمْ عَلَى لِسَانِ نَبِيِّهِمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَاتَّكَلُوا عَنْ الْعَمَلِ وَآيَةُ ذَلِكَ أَنَّ فِيهِمْ رَجُلًا لَهُ عَضُدٌ وَلَيْسَ لَهُ ذِرَاعٌ عَلَى رَأْسِ عَضُدِهِ مِثْلُ حَلَمَةِ الثَّدْيِ عَلَيْهِ شَعَرَاتٌ بِيضٌ فَتَذْهَبُونَ إِلَى مُعَاوِيَةَ وَأَهْلِ الشَّامِ وَتَتْرُكُونَ هَؤُلَاءِ يَخْلُفُونَكُمْ فِي ذَرَارِيِّكُمْ وَأَمْوَالِكُمْ وَاللَّهِ إِنِّي لَأَرْجُو أَنْ يَكُونُوا هَؤُلَاءِ الْقَوْمَ فَإِنَّهُمْ قَدْ سَفَكُوا الدَّمَ الْحَرَامَ وَأَغَارُوا فِي سَرْحِ النَّاسِ فَسِيرُوا عَلَى اسْمِ اللَّهِ قَالَ سَلَمَةُ بْنُ كُهَيْلٍ فَنَزَّلَنِي زَيْدُ بْنُ وَهْبٍ مَنْزِلًا حَتَّى قَالَ مَرَرْنَا عَلَى قَنْطَرَةٍ فَلَمَّا الْتَقَيْنَا وَعَلَى الْخَوَارِجِ يَوْمَئِذٍ عَبْدُ اللَّهِ بْنُ وَهْبٍ الرَّاسِبِيُّ فَقَالَ لَهُمْ أَلْقُوا الرِّمَاحَ وَسُلُّوا سُيُوفَكُمْ مِنْ جُفُونِهَا فَإِنِّي أَخَافُ أَنْ يُنَاشِدُوكُمْ كَمَا نَاشَدُوكُمْ يَوْمَ حَرُورَاءَ فَرَجَعُوا فَوَحَّشُوا بِرِمَاحِهِمْ وَسَلُّوا السُّيُوفَ وَشَجَرَهُمْ النَّاسُ بِرِمَاحِهِمْ قَالَ وَقُتِلَ بَعْضُهُمْ عَلَى بَعْضٍ وَمَا أُصِيبَ مِنْ النَّاسِ يَوْمَئِذٍ إِلَّا رَجُلَانِ فَقَالَ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ الْتَمِسُوا فِيهِمْ الْمُخْدَجَ فَالْتَمَسُوهُ فَلَمْ يَجِدُوهُ فَقَامَ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ بِنَفْسِهِ حَتَّى أَتَى نَاسًا قَدْ قُتِلَ بَعْضُهُمْ عَلَى بَعْضٍ قَالَ أَخِّرُوهُمْ فَوَجَدُوهُ مِمَّا يَلِي الْأَرْضَ فَكَبَّرَ ثُمَّ قَالَ صَدَقَ اللَّهُ وَبَلَّغَ رَسُولُهُ قَالَ فَقَامَ إِلَيْهِ عَبِيدَةُ السَّلْمَانِيُّ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ أَلِلَّهَ الَّذِي لَا إِلَهَ إِلَّا هُوَ لَسَمِعْتَ هَذَا الْحَدِيثَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِي وَاللَّهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ حَتَّى اسْتَحْلَفَهُ ثَلَاثًا وَهُوَ يَحْلِفُ لَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10032,
                "hadithNumber": "2468",
                "englishNarrator": "Ubaidullah bin Abu Rafi' رضی اللہ تعالیٰ عنہ , the freed slave of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), said:",
                "hadithEnglish": "When Haruria (the Khawarij) set out and as he was with 'Ali bin Abu Talib رضی اللہ تعالیٰ عنہ they said, There is no command but that of Allah. Upon this 'Ali رضی اللہ تعالیٰ عنہ said: The statement is true but it is intentionally applied (to support) a wrong (cause). The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) described their characteristics and I found these characteristics in them. They state the truth with their tongue, but it does not go beyond this part of their bodies (and the narrator pointed towards his throat). The most hateful among the creation of Allah is one black man among them (Khawarij). One of his hand is like the teat of a goat or the nipple of the breast. When 'Ali bin Abu Talib رضی اللہ تعالیٰ عنہ killed them, he said: Search (for his dead body). They searched for him, but they did not find it (his dead body). Upon this he said: Go (and search for him). By Allah, neither I have spoken a lie nor has the lie been spoken to me. 'Ali said this twice and thrice. They then found him (the dead body) in a rain. They brought (his dead) body till they placed it before him (Hadrat 'Ali). 'Ubaidullah said: And, I was present at (that place) when this happened and when 'Ali رضی اللہ تعالیٰ عنہ said about them. A person narrated to me from Ibn Hanain that he said: I saw that black man.",
                "hadithUrdu": "جب حروریہ نے خروج کیا اور وہ ( عبیدہ اللہ ) حضرت علی بن ابی طا لب رضی اللہ تعالیٰ عنہ کے ساتھ تھا تو انھوں نے کہا حکومت اللہ کے سوا کسی کی نہیں حضرت علی رضی اللہ تعالیٰ عنہ نے کہا : یہ کلمہ حق ہے جس سے با طل مراد لیا گیا ہے رسول اللہ صلی اللہ علیہ وسلم نے کچھ لو گوں کی صفات بیان کیں میں ان لو گو ں میں ان صفات کو خوب پہچا نتا ہوں ( آپ نے فر ما یا ) : \"\" وہ اپنی زبانوں سے حق بات کہیں گے اور وہ ( حق ) ان کی اس جگہ ۔ ۔ ۔ آپ نے اپنے حلق کی طرف اشارہ کیا ۔ ۔ ۔ سے آگے نہیں بڑھے گا یہ اللہ تعالیٰ کی مخلوق میں سے اس کے ہا ں سب سے زیادہ ناپسندیدہ ہیں ان میں ایک سیاہ رنگ کا آدمی ہو گا اس کا ایک ہا تھ بکرکے تھن یا نوک پستان کی طرح ہو گا جب حضرت علی رضی اللہ تعالیٰ عنہ نے ان کو قتل کیا ڈھونڈو ۔ لو گوں نے ڈھونڈا تو انھیں کچھ نہ ملا فر ما یا دوبارہ تلاش کرو اللہ کی قسم! میں نے جھوٹ نہیں بو لا اور نہ مجھے جھوٹ بتا یا گیا دو یا تین دفعہ ( یہی فقرہ ) کہا پھر انھوں نے اسے ایک کھنڈر میں پالیا تو وہ اسے لے آئے یہاں تک کہ اسے آپ کے سامنے رکھ دیا ۔ عبید اللہ نے کہا : میں بے ان کے اس معاملے میں اور ان کے متعلق حضرت علی رضی اللہ تعالیٰ عنہ کی بات کے وقت حاضر تھا ۔ یو نس نے اپنی روا یت میں اضافہ کیا : بکیر نے کہا مجھے ( عبد اللہ ) بن حنین ( ہاشمی ) سے ایک آدمی نے حدیث بیان کی اس نے کہا میں نے بھی اس کا لے کو دیکھا تھا ۔",
                "urduNarrator": "ابو طا ہر اور یو نس بن عبد الاعلی دو نوں نے کہا ہمیں عبد اللہ بن وہب نے خبر دی انھوں نے کہا مجھے عمرو بن حارث نے بکیر اشج سے خبردی انھوں نے بسر بن سعید سے اور انھوں نے رسول اللہ صلی اللہ علیہ وسلم کے آزاد کردہ غلا م حضرت ابو رافع رضی اللہ تعالیٰ عنہ کے بیٹے عبید اللہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ، وَيُونُسُ بْنُ عَبْدِ الْأَعْلَى، قَالَا: أَخْبَرَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ بُكَيْرِ بْنِ الْأَشَجِّ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ عُبَيْدِ اللهِ بْنِ أَبِي رَافِعٍ، مَوْلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّ الْحَرُورِيَّةَ لَمَّا خَرَجَتْ، وَهُوَ مَعَ عَلِيِّ بْنِ أَبِي طَالِبٍ رَضِيَ اللهُ عَنْهُ، قَالُوا: لَا حُكْمَ إِلَّا لِلَّهِ، قَالَ عَلِيٌّ: كَلِمَةُ حَقٍّ أُرِيدَ بِهَا بَاطِلٌ، إِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَصَفَ نَاسًا، إِنِّي لَأَعْرِفُ صِفَتَهُمْ فِي هَؤُلَاءِ، «يَقُولُونَ الْحَقَّ بِأَلْسِنَتِهِمْ لَا يَجُوزُ هَذَا، مِنْهُمْ، - وَأَشَارَ إِلَى حَلْقِهِ - مِنْ أَبْغَضِ خَلْقِ اللهِ إِلَيْهِ مِنْهُمْ أَسْوَدُ، إِحْدَى يَدَيْهِ طُبْيُ شَاةٍ أَوْ حَلَمَةُ ثَدْيٍ» فَلَمَّا قَتَلَهُمْ عَلِيُّ بْنُ أَبِي طَالِبٍ رَضِيَ اللهُ عَنْهُ قَالَ: انْظُرُوا، فَنَظَرُوا فَلَمْ يَجِدُوا شَيْئًا، فَقَالَ: ارْجِعُوا فَوَاللهِ، مَا كَذَبْتُ وَلَا كُذِبْتُ، مَرَّتَيْنِ أَوْ ثَلَاثًا، ثُمَّ وَجَدُوهُ فِي خَرِبَةٍ، فَأَتَوْا بِهِ حَتَّى وَضَعُوهُ بَيْنَ يَدَيْهِ، قَالَ عُبَيْدُ اللهِ: وَأَنَا حَاضِرُ ذَلِكَ مِنْ أَمْرِهِمْ، وَقَوْلِ عَلِيٍّ فِيهِمْ ، زَادَ يُونُسُ فِي رِوَايَتِهِ: قَالَ بُكَيْرٌ: وَحَدَّثَنِي رَجُلٌ عَنِ ابْنِ حُنَيْنٍ أَنَّهُ، قَالَ: رَأَيْتُ ذَلِكَ الْأَسْوَدَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10033,
                "hadithNumber": "2469",
                "englishNarrator": "Abu Dharr رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Verily there would arise from my Ummah after me or soon after me a group (of people) who would recite the Qur'an, but it would not go beyond their throats, and they would pass clean through their religion just as the arrow passes through the prey, and they would never come back to it. They would be the worst among the creation and the creatures. Ibn Samit (one of the narrators) said: I met Rafi' bin 'Amr Ghifari, the brother of Al-Hakam Ghifari and I said: What is this hadith that I heard from Abu Dharr, i. e. so and so? and then I narrated that hadith to him and said: I heard it from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا بلا شبہ میرے بعد میری امت سے ۔ ۔ ۔ یا عنقریب میرے بعد میری امت سے ۔ ۔ ۔ ایک قوم ہو گی جو قرآن پڑھیں گے وہ ان کے گلوں سے نیچے نہیں اترے گا وہ دین سے اس طرح نکل جائیں گے جیسے تیر شکار سے نکل جا تا ہے پھر اس میں واپس نہیں آئیں گے ۔ وہ انسانوں اور مخلو قات میں بد ترین ہوں گے ۔ ابن صامت نے کہا : میں حکم غفا ری رضی اللہ تعالیٰ عنہ کو ملا ، میں نے کہا : ( یہ ) کیا حدیث ہے جو میں نے ابو ذر رضی اللہ تعالیٰ عنہ سے اس طرح سنی ہے؟ اس کے بعد میں نے یہ حدیث بیان کی تو انھوں نے کہا میں نے بھی یہ حدیث رسول اللہ صلی اللہ علیہ وسلم سے سنی ہے ۔",
                "urduNarrator": "ہم سے شیبان بن فروخ نے بیان کیا، کہا ہم سے سلیمان بن المغیرہ نے بیان کیا، ہم سے حمید بن ہلال نے بیان کیا،عبد اللہ بن صامت نے حضرت ابو ذر رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ حَدَّثَنَا حُمَيْدُ بْنُ هِلَالٍ عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ عَنْ أَبِي ذَرٍّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ بَعْدِي مِنْ أُمَّتِي أَوْ سَيَكُونُ بَعْدِي مِنْ أُمَّتِي قَوْمٌ يَقْرَءُونَ الْقُرْآنَ لَا يُجَاوِزُ حَلَاقِيمَهُمْ يَخْرُجُونَ مِنْ الدِّينِ كَمَا يَخْرُجُ السَّهْمُ مِنْ الرَّمِيَّةِ ثُمَّ لَا يَعُودُونَ فِيهِ هُمْ شَرُّ الْخَلْقِ وَالْخَلِيقَةِ فَقَالَ ابْنُ الصَّامِتِ فَلَقِيتُ رَافِعَ بْنَ عَمْرٍو الْغِفَارِيَّ أَخَا الْحَكَمِ الْغِفَارِيِّ قُلْتُ مَا حَدِيثٌ سَمِعْتُهُ مِنْ أَبِي ذَرٍّ كَذَا وَكَذَا فَذَكَرْتُ لَهُ هَذَا الْحَدِيثَ فَقَالَ وَأَنَا سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": "الْخَوَارِجُ شَرُّ الْخَلْقِ وَالْخَلِيقَةِ ‏",
                "headingUrdu": "خوارج انسانوں اور تمام مخلوقات میں سے بد ترین ہیں۔",
                "headingEnglish": "The Khawarij are the most evil of people and of all creation",
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10034,
                "hadithNumber": "2470",
                "englishNarrator": "Yusair bin 'Amr reported:",
                "hadithEnglish": "He inquired of Sahl bin Hunaif رضی اللہ تعالیٰ عنہ : Did you hear the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) making a mention of the Khawarij? He said: I heard him say (and he pointed with his hand towards the east) that these would be a people who would recite the Qur'an with their tongues and it would not go beyond their collar bones. They would pass clean through their religion just as the arrow passes through the prey.",
                "hadithUrdu": "میں نے سہل بن حنیف رضی اللہ تعالیٰ عنہ سے پو چھا کیا آپ نے رسول اللہ صلی اللہ علیہ وسلم کو خوارج کا تذکرہکرتے ہو ئے سنا؟ انھوں نے کہا میں نے آپ صلی اللہ علیہ وسلم سے یہ سنا تھا ۔ ۔ ۔ اور آپ نے اپنے ہا تھ سے مشرق کی جا نب اشارہ کیا تھا ۔ ۔ ۔ ایک قوم ہو گی جو اپنی زبانوں سے قرآن مجید کی تلا وت کریں گے لیکن وہ ان کی ہنسلی کی ہڈیوں سے آگے نہیں جا ئے گا وہ دین سے اس طرح تیزی سے نکل جا ئیں گے جس طرح تیر شکا ر میں سے نکل جا تا ہے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, علی بن مسہر نے ( ابو اسحاق شیبانی سے اور انھوں نے یسر بن عمرو سے روایت کی انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ الشَّيْبَانِيِّ عَنْ يُسَيْرِ بْنِ عَمْرٍو قَالَ سَأَلْتُ سَهْلَ بْنَ حُنَيْفٍ هَلْ سَمِعْتَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَذْكُرُ الْخَوَارِجَ فَقَالَ سَمِعْتُهُ وَأَشَارَ بِيَدِهِ نَحْوَ الْمَشْرِقِ قَوْمٌ يَقْرَءُونَ الْقُرْآنَ بِأَلْسِنَتِهِمْ لَا يَعْدُو تَرَاقِيَهُمْ يَمْرُقُونَ مِنْ الدِّينِ كَمَا يَمْرُقُ السَّهْمُ مِنْ الرَّمِيَّةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10035,
                "hadithNumber": "2471",
                "englishNarrator": null,
                "hadithEnglish": "This hadith had been transmitted by Sulaiman Shaibani with the same chain of narrators (and the words are), There would arise out of (this group) many a group",
                "hadithUrdu": "ہم سے ابو کامل نے بیان کیا، انہوں نے کہا عبد الو حد نے کہا : ہمیں ( ابو اسحاق ) سلیما ن شیبانی نے اسی سند کے ساتھ ( مذکورہ ) حدیث بیان کی اور کہا \" اس ( جا نب ) سے کچھ قومیں نکلیں گی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَاه أَبُو كَامِلٍ حَدَّثَنَا عَبْدُ الْوَاحِدِ حَدَّثَنَا سُلَيْمَانُ الشَّيْبَانِيُّ بِهَذَا الْإِسْنَادِ وَقَالَ يَخْرُجُ مِنْهُ أَقْوَامٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10036,
                "hadithNumber": "2472",
                "englishNarrator": "Sahl bin Hunaif رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: There would arise from the east a people with shaven heads.",
                "hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم سےروایت کی فر ما یا : \" ایک قوم مشرق کی طرف سر گرداں پھر ے گی ان کے سر منڈھے ہو ئے ہوں گے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور اسحاق نے یزید کی سند سے بیان کیا، ابوبکر نے کہا: ہم سے یزید بن ہارون نے بیان کیا, اعوام بن حو شب سے روایت ہے کہا ابو اسحاق شیبا نی نے سہیل بن حنیف رضی اللہ تعالیٰ عنہ سے اور انھوں نے",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ جَمِيعًا عَنْ يَزِيدَ قَالَ أَبُو بَكْرٍ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ عَنْ الْعَوَّامِ بْنِ حَوْشَبٍ حَدَّثَنَا أَبُو إِسْحَقَ الشَّيْبَانِيُّ عَنْ أُسَيْرِ بْنِ عَمْرٍو عَنْ سَهْلِ بْنِ حُنَيْفٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَتِيهُ قَوْمٌ قِبَلَ الْمَشْرِقِ مُحَلَّقَةٌ رُءُوسُهُمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10037,
                "hadithNumber": "2473",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Hasan bin 'Ali رضی اللہ تعالیٰ عنہ took one of The dates of the sadaqa and put it in his mouth, whereupon the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Leave it, leave it, throw it; don't you know that we do not eat the sadaqa?",
                "hadithUrdu": "حسن بن علی رضی اللہ تعالیٰ عنہ نے صدقے کی کھجوروں میں سے ایک کھجور لے لی اور اسے اپنے منہ میں ڈا ل لیا تو رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" چھوڑو ، چھوڑو ، پھینک دو اسے کیا تم نہیں جا نتے کہ ہم صدقہ نہیں کھا تے ؟ \"",
                "urduNarrator": "عبید اللہ بن معاذ عنبری نے کہا : ہمیں میرے والد نے حدیث بیان کی انھوں نے کہا ہمیں شعبہ نے محمد بن زیاد سے حدیث بیان کی انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ کو بیان کرتے ہو ئے سنا کہ ہجرت",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدٍ وَهُوَ ابْنُ زِيَادٍ، سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ: أَخَذَ الْحَسَنُ بْنُ عَلِيٍّ تَمْرَةً مِنْ تَمْرِ الصَّدَقَةِ، فَجَعَلَهَا فِي فِيهِ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «كِخْ كِخْ، ارْمِ بِهَا، أَمَا عَلِمْتَ أَنَّا لَا نَأْكُلُ الصَّدَقَةَ؟».",
                "headingArabic": "تَحْرِيمِ الزَّكَاةِ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَى آلِهِ وَهُمْ بَنُو هَاشِمٍ وَبَنُو الْمُطَّلِبِ دُونَ غَيْرِهِمْ",
                "headingUrdu": "رسول اللہ صلی اللہ علیہ وسلم اور آپ کی آل پر زکوٰۃ حرام ہے، اور وہ بنو ہاشم اور بنو المطلب ہیں، اور کوئی نہیں۔",
                "headingEnglish": "Zakat is forbidden for the messenger of Allah pbuh and his family, and they are Banu Hashim and Banu Al-Muttalib, and no one else",
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10038,
                "hadithNumber": "2474",
                "englishNarrator": "This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters (and the words of the Holy Prophet ﷺ) are:",
                "hadithEnglish": "Sadaqa is not permissible for us.",
                "hadithUrdu": "( \" ہم صدقہ نہیں کھا تے \" کے بجا ئے ) \" ہمارے لیے صدقہ حلا ل نہیں \" کہا ہے",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ، ابوبکر بن ابی شیبہ اور زہیر بن حرب نے روایت کی ہے, وکیع نے شعبہ سے اسی ( ؐذکورہ با لا ) سند کے ساتھ روایت کی اور",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، جَمِيعًا عَنْ وَكِيعٍ، عَنْ شُعْبَةَ، بِهَذَا الْإِسْنَادِ، وَقَالَ: «أَنَّا لَا تَحِلُّ لَنَا الصَّدَقَةُ؟».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 9726,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=389",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=387",
                "label": "387",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=388",
                "label": "388",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=389",
                "label": "389",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=390",
                "label": "390",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=391",
                "label": "391",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=392",
                "label": "392",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=393",
                "label": "393",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=391",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=391",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=389",
        "to": 9750,
        "total": 40465
    }
}