{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 307,
        "data": [
            {
                "id": 7939,
                "hadithNumber": "375",
                "englishNarrator": "It is narrated on the authority of Anas ‌رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "Verily the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: The Hour (Resurrection) will not occur until 'Allah, Allah' is not said on earth.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’ قیامت قائم نہیں ہو گی یہاں تک کہ ( وہ وقت آ جائے گا جب ) زمین میں اللہ اللہ نہیں کہا جارہا ہو گا ۔ ‘ ‘",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے عفان نے بیان کیا,حماد نے کہا ,ہمیں ثابت نے حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے حدیث سنائی کہ",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادٌ، أَخْبَرَنَا ثَابِتٌ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: لَا تَقُومُ السَّاعَةُ حَتَّى لَا يُقَالَ فِي الْأَرْضِ: اللهُ، اللهُ.",
                "headingArabic": "ذَهَابِ الإِيمَانِ آخِرَ الزَّمَانِ ‏‏",
                "headingUrdu": "آخر وقت میں ایمان کا غائب ہونا",
                "headingEnglish": "The Disappearance of Faith at the End of Time",
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7940,
                "hadithNumber": "376",
                "englishNarrator": "It is narrated on the authority of Anas رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: The Hour (Resurrection) will not occur as long as anyone says: 'Allah, Allah.'",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’ کسی ایسے شخص پر قیامت قائم نہ ہو گی جو اللہ اللہ کہتا ہو گا ۔ ‘ ‘",
                "urduNarrator": "ہم سے عبد بن حمید نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا,معمر نے ثابت سے خبر دی ، انہوں نے حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: لَا تَقُومُ السَّاعَةُ عَلَى أَحَدٍ يَقُولُ: اللهُ، اللهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7941,
                "hadithNumber": "377",
                "englishNarrator": "Hudhaifa رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "We were in the company of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) when he said. Count for me those who profess al-Islam. We said: Messenger of Allah, do you entertain any fear concerning us and we are (at this time) between six hundred and seven hundred (in strength). He (the Holy Prophet) remarked: You don't perceive; you may be put to some trial, He (the narrator) said: We actually suffered trial so much so that some of our men were constrained to offer their prayers in concealment.",
                "hadithUrdu": "ہم رسو ل اللہ ﷺ کے ساتھ تھے ، آپ نے فرمایا : ’’ میرے لیے شمار کرو کہ کتنے ( لوگ ) اسلام کے الفاظ بولتے ہیں ( اسلام کا کلمہ پڑھتے ہیں ؟ ) ‘ ‘ حذیفہ نے کہا : تب ہم نے عرض کی : اے اللہ کے رسول ! کیا آپ کو ہم پر ( کوئی مصیبت نازل ہو جانے کا ) خوف ہے جبکہ ہم چھ سات سال سو کے درمیان ہیں ؟ آپ نے فرمایا : ’’ تم نہیں جانتے ، ہو سکتا ہے تم کسی آزمائش میں ڈال دیے جاؤ ۔ ‘ ‘ پھر ہم آزمائش میں ڈال دیے گئے یہاں تک کہ ہم میں سے کوئی شخص پوشیدہ رہے بغیر نماز بھی نہیں پڑھ سکتا تھا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، محمد بن عبداللہ بن نمیر اور ابو کریب نے بیان کیا، اور یہ قول ابو کریب کا ہے، انہوں نے کہا: ہم سے ابو معاویہ نے بیان کیا، امش کی سند سے، شقیق سے,حضرت حذیفہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سےروایت ہے ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، وَأَبُو كُرَيْبٍ، وَاللَّفْظُ لِأَبِي كُرَيْبٍ، قَالُوا: حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ حُذَيْفَةَ، قَالَ: كُنَّا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «أَحْصُوا لِي كَمْ يَلْفِظُ الْإِسْلَامَ»، قَالَ: فَقُلْنَا: يَا رَسُولَ اللهِ، أَتَخَافُ عَلَيْنَا وَنَحْنُ مَا بَيْنَ السِّتِّمِائَةٍ إِلَى السَّبْعِمِائةٍ؟ قَالَ: «إِنَّكُمْ لَا تَدْرُونَ لَعَلَّكُمْ أَنْ تُبْتَلَوْا»، قَالَ: «فَابْتُلِيَنَا حَتَّى جَعَلَ الرَّجُلُ مِنَّا لَا يُصَلِّي إِلَّا سِرًّا».",
                "headingArabic": "جَوَازِ الاِسْتِسْرَارِ لِلْخَائِفِ ‏‏",
                "headingUrdu": "خوف کی حالت میں اپنے ایمان کو چھپانے کی اجازت",
                "headingEnglish": "Permissibility of concealing one's faith in the case of fear",
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7942,
                "hadithNumber": "378",
                "englishNarrator": "Sa'd narrated it on the authority of his father (Abi Waqqas) that he observed:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) distributed shares (of booty among his Companions). I said: Messenger of Allah! Give it to so and so, for verily he is a believer. Upon this the Messenger of Allah remarked: Or a Muslim. I (the narrator) repeated it (the word believer ) thrice and he (the Holy Prophet) turned his back upon me (and substituted the word) Muslim, and then observed: I bestow it (this share) to a man out of apprehension lest Allah should throw him prostrate into the fire (of Hell) whereas in fact the other man is dearer to me than he.",
                "hadithUrdu": "رسول اللہ ﷺ نے تقسیم کا کچھ مال بانٹا تو میں نے عرض کی ، اللہ کے رسول ! فلاں کو بھی دیجیے کیونکہ وہ مومن ہے ، نبی ﷺ نے فرمایا : ’’یامسلمان ہے ۔ ‘ ‘ میں تین بار یہ بات کہتا ہوں اور آپ ﷺ تین بار میرے سامنے یہی الفاظ دہراتے ہیں ’’یامسلمان ہے ۔ ‘ ‘ پھر آپ نے فرمایا : ’’ میں ایک آدمی کو دیتا ہوں جبکہ دوسرا مجھے اس سے زیادہ پیارا ہوتا ہے ، اس ڈر سے کہ کہیں اللہ اس کو اندھے منہ آگ میں ( نہ ) ڈال دے ۔ ‘ ‘",
                "urduNarrator": "ہم سے ابن ابی عمر نے بیان کیا,سفیان نے زہری سے حدیث بیان کی ، انہوں نے عامر بن سعد ( بن ابی وقاص ) سے اور انہوں نے اپنے والد سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عَامِرِ بْنِ سَعْدٍ، عَنْ أَبِيهِ، قَالَ: قَسَمَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَسْمًا، فَقُلْتُ: يَا رَسُولَ اللهِ، أَعْطِ فُلَانًا فَإِنَّهُ مُؤْمِنٌ، فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَوْ مُسْلِمٌ» أَقُولُهَا ثَلَاثًا، وَيُرَدِّدُهَا عَلَيَّ ثَلَاثًا «أَوْ مُسْلِمٌ»، ثُمَّ قَالَ: «إِنِّي لَأُعْطِي الرَّجُلَ، وَغَيْرُهُ أَحَبُّ إِلَيَّ مِنْهُ، مَخَافَةَ أَنْ يَكُبَّهُ اللهُ فِي النَّارِ».",
                "headingArabic": "تَأَلُّفِ قَلْبِ مَنْ يَخَافُ عَلَى إِيمَانِهِ لِضَعْفِهِ وَالنَّهْيِ عَنِ الْقَطْعِ بِالإِيمَانِ مِنْ غَيْرِ دَلِيلٍ قَاطِعٍ",
                "headingUrdu": "کسی کے ساتھ نرمی کرنا جس کا ایمان کمزور ہونے کی وجہ سے فکر مند ہے۔ قطعی ثبوت کے بغیر کسی کی طرف عقیدہ منسوب کرنے کی ممانعت",
                "headingEnglish": "Being kind to one for whose faith there is concern because it is weak; Prohibition of attributing Faith to someone without definitive evidence",
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7943,
                "hadithNumber": "379",
                "englishNarrator": "It is narrated on the authority of Sa'd ‌رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) bestowed upon a group of persons (things), and Sa'd was sitting amongst them. Sa'd said: The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) ignored some of them. And he who was ignored seemed to be more deserving in my eyes (as compared with others). I (Sa'd) said: Messenger of Allah I why is it that you did not give to such and such (man)? Verily I see him a believer. Upon this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) observed: Or a Muslim? I kept quiet for some time but I was again impelled (to express) what I knew about him. I said: Messenger of Allah why is it that you did not give it to such and such? Verily, by Allah, see him a believer. Upon this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) remarked: (Nay, not a believer) but a Muslim. He (Sa'd) said: I again kept quite for some time but what I knew about him again impelled me (to express my opinion) and I said: Why is it that you did not give (the share) to so and so: By Allah, verily I see him a believer. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) remarked; (Nay, not so) but a Muslim. Verily (at times) I give (a share) to a certain man apprehending that he may not be thrown prostrate in the Fire, whereas the other man (who is not given) is dearer to me (as compared with him).",
                "hadithUrdu": "رسول اللہ ﷺ نے کچھ لوگوں کو کچھ عطا فرمایا ، سعد ‌رضی ‌اللہ ‌عنہ ‌ ‌ بھی ان میں بیٹھے تھے ، سعد ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : پھر رسول اللہ ﷺ نے ان میں سے ایک کو چھوڑ دیا ، اسے کچھ عطانہ فرمایا ، حالانکہ ان سب سے وہی مجھ زیادہ اچھا لگتا تھا ، چنانچہ میں نے عرض کی : اے اللہ کے رسول ! آپ نے فلاں سے اعراض کیوں فرمایا؟ اللہ کی قسم ! میں اسے مومن سمجھتا ہوں ۔ اس پر رسول اللہ ﷺ نے فرمایا : ’’ یا مسلمان ۔ ‘ ‘ سعد نے کہا : پھر میں تھوڑی دیر کے لیے چپ ہو گیا ، پھر مجھ پر اس بات کا غلبہ ہوا جو میں اس کے بارے میں جانتا تھا تو میں نے عرض کی : اے اللہ کے رسول !فلاں سے آپ نے اعراض کیوں فرمایا؟ اللہ کی قسم !میں تو اسے مومن سمجھتا ہوں ۔ اس پر رسول اللہ ﷺ نے فرمایا : ’’ یامسلمان ۔ ‘ ‘ تو میں تھوڑی دیر کے لیے چپ ہو گیا ، پھر مجھ پر اس بات کاغلبہ ہوا جو میں اس کے بارے میں جانتا تھا ، چنانچہ میں نے عرض کی : اے اللہ کے رسول ! فلاں سے آپ نے اعراض کیوں فرمایا؟ کیونکہ اللہ کی قسم ! میں نے اسے مومن سمجھتا ہوں ۔ اس پر رسول اللہ ﷺ نے فرمایا : ’’یا مسلمان ۔ بلا شبہ میں ایک آدمی کو ( عطیہ ) دیتا ہوں ۔ حالانکہ دوسرا مجھے اس سے زیادہ پیارا ہوتا ہے ، اس بات سے ڈرتےہوئے کہ اسے منہ کے بل آگ میں ڈال دیا جائے گا ۔ ‘ ‘",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے یعقوب بن ابراہیم نے بیان کیا,ابن شہاب ( زہری ) کے بھتیجے نے اپنے چچا سے حدیث بیان کی ، انہوں نے کہا : مجھے عامر بن سعد بن ابی وقاص نےاپنے والد سعد ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے خبر دی کہ",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ أَخِي ابْنِ شِهَابٍ، عَنْ عَمِّهِ، قَالَ أَخْبَرَنِي عَامِرُ بْنُ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ أَبِيهِ سَعْدٍ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَعْطَى رَهْطًا وَسَعْدٌ جَالِسٌ فِيهِمْ، قَالَ سَعْدٌ: فَتَرَكَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنْهُمْ مَنْ لَمْ يُعْطِهِ، وَهُوَ أَعْجَبُهُمْ إِلَيَّ، فَقُلْتُ: يَا رَسُولَ اللهِ، مَا لَكَ عَنْ فُلَانٍ؟ فَوَاللهِ إِنِّي لَأَرَاهُ مُؤْمِنًا، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَوْ مُسْلِمًا»، قَالَ: فَسَكَتُّ قَلِيلًا ثُمَّ غَلَبَنِي مَا أَعْلَمُ مِنْهُ، فَقُلْتُ: يَا رَسُولَ اللهِ، مَا لَكَ عَنْ فُلَانٍ؟ فَوَاللهِ إِنِّي لَأَرَاهُ مُؤْمِنًا، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَوْ مُسْلِمًا»، قَالَ: فَسَكَتُّ قَلِيلًا ثُمَّ غَلَبَنِي مَا عَلِمْتُ مِنْهُ، فَقُلْتُ: يَا رَسُولَ اللهِ، مَا لَكَ عَنْ فُلَانٍ؟ فَوَاللهِ إِنِّي لَأَرَاهُ مُؤْمِنًا، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَوْ مُسْلِمًا، إِنِّي لَأُعْطِي الرَّجُلَ وَغَيْرُهُ أَحَبُّ إِلَيَّ مِنْهُ، خَشْيَةَ أَنْ يُكَبَّ فِي النَّارِ عَلَى وَجْهِهِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7944,
                "hadithNumber": "380",
                "englishNarrator": "Sa'd ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bestowed upon a group of persons (booty) and I was sitting with them. The remaining part of the hadith is the same as mentioned (above) with the additionI stood up and went to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and whispered to him: Why did you omit such and such a man?",
                "hadithUrdu": "رسول اللہ ﷺ نے کچھ لوگوں کو ( عطیہ ) دیا اورمیں ان میں بیٹھا تھا ..... آگے ابن شہاب کے بھتیجے کی اپنے چچا سے روایت کی طرح ہے اور اتنا اضافہ ہے : ’’میں اٹھ کر رسول اللہ ﷺ کے پاس گیا اور سرگوشی کرتے ہوئے آپ سے عرض کی : فلاں سے آپ نے اعراض کیوں فرمایا.",
                "urduNarrator": "ہم سے حسن بن علی الحلوانی اور عبد بن حمید نے بیان کیا، کہا: ہم سے یعقوب نے جو ابراہیم بن سعد کے بیٹے ہیں، بیان کیا، ہم سے میرے والد نے بیان کیا,\r\nصالح نے ابن شہاب سے روایت کی ، انہوں نے کہا : مجھے عامر بن سعد نے اپنے والد ( حضرت ) سعد ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے خبر دی ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَا: حَدَّثَنَا يَعْقُوبُ وَهُوَ ابْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، قَالَ: حَدَّثَنِي عَامِرُ بْنُ سَعْدٍ، عَنْ أَبِيهِ سَعْدٍ، أَنَّهُ قَالَ: أَعْطَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ رَهْطًا وَأَنَا جَالِسٌ فِيهِمْ، بِمِثْلِ حَدِيثِ ابْنِ أَخِي ابْنِ شِهَابٍ، عَنْ عَمِّهِ، وَزَادَ، فَقُمْتُ إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَسَارَرْتُهُ، فَقُلْتُ: مَا لَكَ عَنْ فُلَانٍ؟",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7945,
                "hadithNumber": "381",
                "englishNarrator": "The same hadith has been narrated on the authority of Muhammad bin Sa'd and these words (are also there):",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) gave a stroke on my neck or between my two shoulders and said: Sa'd, do you fight with me simply because I gave (a share) to a man?",
                "hadithUrdu": "رسول اللہ ﷺ نے میری ( سعد بن ابی وقاص ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی ) گردن اور کندھے کے درمیان اپناہاتھ مار ، پھر فرمایا : ’’ کیا لڑائی کر رہے ہو سعد؟ کہ میں ایک آدمی کو دیتا ہوں ..... ‘ ‘",
                "urduNarrator": "ہم سے حسن الحلوانی نے بیان کیا، کہا ہم سے یعقوب نے بیان کیا، کہا ہم سے میرے والد نے بیان کیا، صالح کی سند سے، اسماعیل بن محمد سے، انہوں نے کہا,( عامر بن سعد کے بھائی ) محمد بن سعد یہ حدیث بیان کرتے ہیں ، انہوں نے اپنی حدیث میں کہا",
                "hadithArabic": "وَحَدَّثَنَا الْحَسَنُ الْحُلْوَانِيُّ، حَدَّثَنَا يَعْقُوبُ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنْ إِسْمَاعِيلَ بْنِ مُحَمَّدٍ، قَالَ: سَمِعْتُ مُحَمَّدَ بْنَ سَعْدٍ يُحَدِّثُ هَذَا، فَقَالَ فِي حَدِيثِهِ: فَضَرَبَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِيَدِهِ بَيْنَ عُنُقِي وَكَتِفِي، ثُمَّ قَالَ: «أَقِتَالًا؟ - أَيْ سَعْدُ - إِنِّي لَأُعْطِي الرَّجُلَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7946,
                "hadithNumber": "382",
                "englishNarrator": "It is narrated on the authority of Abu Huraira ‌رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) observed: We have more claim to doubt than Ibrahim ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) when he said: My Lord! Show me how Thou wilt quicken the dead. He said: Believeth thou not? He said: Yes! But that my heart may rest at ease. He (the Holy Prophet) observed: May Lord take mercy on Lot, that he wanted a strong support, and had I stayed (in the prison) as long as Yusuf stayed, I would have responded to him who invited me.",
                "hadithUrdu": "رسو ل اللہ ﷺ نے فرمایا : ’’ ہم ابراہیم سے زیادہ شک کرنے کا حق رکھتے ہیں ، جب انہوں نے کہا تھا : ’’ اے میرے رب ! مجھے دکھا تو مردوں کو کیسے زندہ کرے گا؟ اللہ تعالیٰ نے فرمایا : کیا تمہیں یقین نہیں ؟ کہا : کیوں نہیں ! لیکن ( میں اس لیے جاننا چاہتا ہوں ) تاکہ میرا دل مطمئن ہو جائے ۔ ‘ ‘ آپ نے فرمایا : ’’ اور اللہ لوط ‌رضی ‌اللہ ‌عنہ ‌ ‌ پر رحم فرمائے ، ( وہ کسی سہارے کی تمنا کر رہے تھے ) حالانکہ انہوں نے ایک مضبوط سہارے کی پناہ لی ہوئی تھی ۔ اور اگر میں قید خانے میں یوسف علیہ السلام جتنا طویل عرصہ ٹھہرتا تو ( ہوسکتا ہے ) بلانے والے کی بات مان لیتا ۔ ‘ ‘ ( عملاً آپ نے دوسرے انبیاء سے بڑھ کر ہی صبر و تحمل سے کام لیا ۔ )",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، کہا کہ مجھ سے یونس نے بیان کیا، ابن شہاب سے,یونس نے ابن شہاب زہری سے خبر دی ، انہوں نے ابو سلمہ بن عبد الرحمن اور سعید بن مسیب سے روایت کی ، انہوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، وَسَعِيدِ بْنِ الْمُسَيِّبِ، عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: نَحْنُ أَحَقُّ بِالشَّكِّ مِنْ إِبْرَاهِيمَ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِذْ قَالَ: {رَبِّ أَرِنِي كَيْفَ تُحْيِي الْمَوْتَى قَالَ: أَوَلَمْ تُؤْمِنْ قَالَ بَلَى وَلَكِنْ لِيَطْمَئِنَّ قَلْبِي} [البقرة: 260] ، قَالَ: «وَيَرْحَمُ اللهُ لُوطًا لَقَدْ كَانَ يَأْوِي إِلَى رُكْنٍ شَدِيدٍ، وَلَوْ لَبِثْتُ فِي السِّجْنِ طُولَ لَبْثِ يُوسُفَ لَأَجَبْتُ الدَّاعِيَ».",
                "headingArabic": "زِيَادَةِ طُمَأْنِينَةِ الْقَلْبِ بِتَظَاهُرِ الأَدِلَّةِ ‏‏",
                "headingUrdu": "ظاہری شواہد سے دل کا سکون بڑھانا",
                "headingEnglish": "Increasing the heart's tranquility with the appearance evidence",
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7947,
                "hadithNumber": "383",
                "englishNarrator": "Abdullah bin Muhammad narrated the same hadith on the authority of Abu Huraira رضی ‌اللہ ‌عنہ ‌ ‌and in the transmission by Malik the words are:",
                "hadithEnglish": "He (the Holy Prophet) recited the verse: but that my heart may rest at ease and completed it.",
                "hadithUrdu": "’’تاکہ میرا دل مطمئن ہو جاےئ ۔ ‘ ‘ کہا : پھر آپ ﷺ نے یہ آیت پڑھی حتی کہ اس سے آگے نکل گئے ۔",
                "urduNarrator": "اور مجھ سے عبداللہ بن محمد بن اسماء الضبعي نے بیان کیا، مالک کی سند سے,مالک نے زہری سے روایت کی کہ سعید بن مسیب اور ابوعبیدہ نے انہیں حضرت ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌سے خبر دی ، انہوں نے رسول اللہ ﷺ سے روایت کی جو زہری سے یونس کی ( روایت کردہ ) حدیث کے مانند ہے او رمالک کی حدیث میں ( یوں ) ہے",
                "hadithArabic": "وَحَدَّثَنِي بِهِ إِنْ شَاءَ اللهُ عَبْدُ اللهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ الضُّبَعِيُّ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ مَالِكٍ، عَنِ الزُّهْرِيِّ، أَنَّ سَعِيدَ بْنَ الْمُسَيِّبِ، وَأَبَا عُبَيْدٍ، أَخْبَرَاهُ عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ يُونُسَ، عَنِ الزُّهْرِيِّ، ِ وَفِي حَدِيثِ مَالِكٍ: {وَلَكِنْ لِيَطْمَئِنَّ قَلْبِي} [البقرة: 260] قَالَ: ثُمَّ قَرَأَ هَذِهِ الْآيَةَ حَتَّى جَازَهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7948,
                "hadithNumber": "384",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has also been narrated by Abd bin Humaid Ya'qub, i. e. son of Ibrahim bin Sa'd, Abu Uwais, Zuhri, like the one narrated by Malik with the same chain of transmission and said: He recited this verse till he completed it.",
                "hadithUrdu": "ابو اویس نے بھی زہری سے اسی طرح روایت کی ہے جس طرح مالک نے کی ہے البتہ اس نے ( حتی جازھا ) حتی کہ اس سے آگے نکل گئے کے بجائےئ ) حتی أنجزها ( حتی کہ اس کو مکمل کیا ) کہا ہے ۔",
                "urduNarrator": "ہم سے عبد بن حمید نے بیان کیا، انہوں نے کہا: مجھ سے یعقوب یعنی ابن ابراہیم بن سعد نے بیان کیا",
                "hadithArabic": "حَدَّثَنَاهُ عَبْدُ بْنُ حُمَيْدٍ، قَالَ: حَدَّثَنِي يَعْقُوبُ يَعْنِي ابْنَ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبُو أُوَيْسٍ، عَنِ الزُّهْرِيِّ، كَرِوَايَةِ مَالِكٍ بِإِسْنَادِهِ، وَقَالَ: ثُمَّ قَرَأَ هَذِهِ الْآيَةَ حَتَّى أَنْجَزَهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7949,
                "hadithNumber": "385",
                "englishNarrator": "It is narrated on the authority of Abu Huraira رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) observed: There has never been a Prophet amongst the prophets who was not bestowed with a sign amongst the signs which were bestowed (on the earlier prophets). Human beings believed in it and verily I have been conferred upon revelation (the Holy Qur'an) which Allah revealed to me. I hope that I will have the greatest following on the Day of Resurrection.",
                "hadithUrdu": "رسو ل اللہ ﷺ نے فرمایا : ’’ انبیاء میں سے ہر ایک نبی کوایسی نشانیاں ( معجزے ) دی گئیں جن ( کو دیکھ کر ) لوگ ایمان لائے ، اور وحی مجھی کو دی گئی ، جو اللہ نے مجھ پر نازل فرمائی ، ( وہ معجزہ بھی ہے ، اور نور بھی ’’ولكن جعلنه نورا ‘ ‘ ) اس لیے میں امید کرتا ہوں کہ قیامت کے دن ان سب سے زیادہ پیروکار میرے ہو ں گے ۔ ‘ ‘",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے لیث نے بیان کیا، ان سے سعید بن ابی سعید نے اپنے والد سے,حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَا مِنَ الْأَنْبِيَاءِ مِنْ نَبِيٍّ إِلَّا قَدِ اُعْطِيَ مِنَ الْآيَاتِ مَا مِثْلُهُ آمَنَ عَلَيْهِ الْبَشَرُ، وَإِنَّمَا كَانَ الَّذِي أُوتِيتُ وَحْيًا أَوْحَى اللهُ إِلَيَّ، فَأَرْجُو أَنْ أَكُونَ أَكْثَرَهُمْ تَابِعًا يَوْمَ الْقِيَامَةِ».",
                "headingArabic": "وُجُوبِ الإِيمَانِ بِرِسَالَةِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى جَمِيعِ النَّاسِ وَنَسْخِ الْمِلَلِ بِمِلَّتِهِ",
                "headingUrdu": "یہ ماننا فرض ہے کہ ہمارے نبی محمد صلی اللہ علیہ وسلم کا پیغام تمام لوگوں کے لیے ہے، اور باقی تمام مذاہب کی منسوخی",
                "headingEnglish": "Obligation of believing that the message of our Prophet Muhammad (saws) is for all people, and the abrogation of all other religions",
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7950,
                "hadithNumber": "386",
                "englishNarrator": "It is narrated on the authority of Abu Huraira ‌رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) observed: By Him in Whose hand is the life of Muhammad, he who amongst the community of Jews or Christians hears about me, but does not affirm his belief in that with which I have been sent and dies in this state (of disbelief), he shall be but one of the denizens of Hell-Fire.",
                "hadithUrdu": "رسول ‌اللہ ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌نے ‌فرمایا ‌. ‌قسم ‌ہے ‌اس ‌كی ‌جس ‌كے ‌ہاتھ ‌میں ‌محمد ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌كی ‌جان ‌ہے ‌. ‌اس ‌زمانے ‌كا ( ‌یعنی ‌میرے ‌وقت ‌اور ‌میرے ‌بعد ‌قیامت ‌تك ) ‌كو‏ئی ‌یہودی ‌یا ‌نصرانی ( ‌یا ‌اور ‌كوئی ‌دین ‌والا ) ‌میرا ‌حال ‌سنے ‌پھر ‌ایمان نہ ‌لائے ‌اس ‌پر ‌جس ‌كو ‌میں ‌دے ‌كر ‌بھیجا ‌گیا ‌ہوں ( ‌یعنی ‌قرآن ) ‌تو ‌جہنم ‌میں ‌جائے ‌گا .",
                "urduNarrator": "مجھ سے یونس بن عبد العلا نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، انہوں نے کہا: اور مجھ سے عمرو نے بیان کیا کہ ان سے ابو یونس نے بیان کیا,حضرت ‌ابو ‌ہریرہ ‌رضی ‌اللہ ‌عنہ ‌سے ‌روایت ‌ہے ‌",
                "hadithArabic": "حَدَّثَنِي يُونُسُ بْنُ عَبْدِ الْأَعْلَى، أَخْبَرَنَا ابْنُ وَهْبٍ، قَالَ: وَأَخْبَرَنِي عَمْرٌو، أَنَّ أَبَا يُونُسَ، حَدَّثَهُ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: «وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ، لَا يَسْمَعُ بِي أَحَدٌ مِنْ هَذِهِ الْأُمَّةِ يَهُودِيٌّ، وَلَا نَصْرَانِيٌّ، ثُمَّ يَمُوتُ وَلَمْ يُؤْمِنْ بِالَّذِي أُرْسِلْتُ بِهِ، إِلَّا كَانَ مِنْ أَصْحَابِ النَّارِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7951,
                "hadithNumber": "387",
                "englishNarrator": "It is narrated on the authority of Sha'bi:",
                "hadithEnglish": "One among the citizens of Khurasan asked him: 0 Abu! some of the people amongst us who belong to Khurasan say that a person who freed his bondswoman and then married her is like one who rode over a sacrificial animal. Sha'bi said: Abu Burda b. Abi Musa narrated it to me on the authority of his father that verily the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: There are three (classes of persons) who would be given a double reward. One who is amongst the People of the Book and believed in his apostle and (lived) to see the time of Apostle Muhammad ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and affirmed his faith in him and followed him and attested his truth, for him is the double reward; and the slave of the master who discharges all those obligations that he owes to Allah and discharges his duties that he owes to his master, for him there is a double reward. And a man who had a bondswoman and fed her and fed her well, then taught her good manners, and did that well and later on granted her freedom and married her, for him is the double reward. Then Sha'bi said: Accept this hadith without (giving) anything. Formerly a man was (obliged) to travel to Medina even for a smaller hadith than this.",
                "hadithUrdu": "میں نے اہل خراسان میں سے ایک آدمی کو دیکھا ، اس نے شعبی ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سوال کیا اور کہا : اے ابو عمرو! ہماری طرف اہل خراسان اس آدمی کے متعلق جو اپنی لونڈی کو آزاد کرے ، پھر اس سے شادی کر لے ( یہ ) کہتے ہیں کہ وہ اپنے قربانی کر کے جانور پر سوار ہونے والے کے مانند ہے ۔ شعبی ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : مجھے ابوبردہ بن ابی موسیٰ نے اپنے والد سے حدیث سنایئ کہ رسو ل اللہ ﷺنے فرمایا : ’’تین آدمی ہیں جنہیں ان کا اجر دوبار دیا جائے گا : اہل کتاب کاآدمی جو اپنے نبی پر ایمان لایا اور نبیﷺ ( کے دور ) کو پایا تو آپ پر بھی ایمان لایا ، آپ کی پیروی کی اور آپ کی تصدیق کی تو اس کےلیے دو اجر ہیں ۔ اور وہ غلام جو کسی کی ملکیت میں ہے ، اس نے اللہ کا جو حق اس پر ہے ، ادا کیا اور اپنے آقا کا حق بھی ادا کیا تو اس کےلیے دو اجر ہیں ۔ اور ایک آدمی جس کی کوئی لونڈی تھی ، اس نے اسے خوراک دی تو بہترین خوراک مہیا کی ، پھر اسے تربیت دی تو بہت اچھی تربیت دی ، پھر اس کو آزاد کر کے اس سے شادی کر لی تو اس کے لیے بھی دو اجر ہیں ۔ پھر شعبی نے خراسانی سے کہا : یہ حدیث بلا مشقت لے لو ۔ پہلے ایک آدمی اس سے بھی چھوٹی حدیث کے لیے مدینہ کا سفر کرتا تھا ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا,ہشیم نے صالح بن صالح ہمدانی سے خبر دی ، انہوں نے شعبی سےروایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، عَنْ صَالِحِ بْنِ صَالِحٍ الْهَمْدَانِيِّ، عَنِ الشَّعْبِيِّ، قَالَ: رَأَيْتُ رَجُلًا مِنْ أَهْلِ خُرَاسَانَ سَأَلَ الشَّعْبِيَّ، فَقَالَ: يَا أَبَا عَمْرٍو، إِنَّ مَنْ قِبَلَنَا مِنْ أَهْلِ خُرَاسَانَ يَقُولُونَ فِي الرَّجُلِ إِذَا أَعْتَقَ أَمَتَهُ، ثُمَّ تَزَوَّجَهَا: فَهُوَ كَالرَّاكِبِ بَدَنَتَهُ، فَقَالَ الشَّعْبِيُّ: حَدَّثَنِي أَبُو بُرْدَةَ بْنُ أَبِي مُوسَى، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: ثَلَاثَةٌ يُؤْتَوْنَ أَجْرَهُمْ مَرَّتَيْنِ: رَجُلٌ مِنْ أَهْلِ الْكِتَابِ آمَنَ بِنَبِيِّهِ، وَأَدْرَكَ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَآمَنَ بِهِ وَاتَّبَعَهُ وَصَدَّقَهُ، فَلَهُ أَجْرَانِ، وَعَبْدٌ مَمْلُوكٌ أَدَّى حَقَّ اللهِ تَعَالَى وَحَقَّ سَيِّدِهِ، فَلَهُ أَجْرَانِ، وَرَجُلٌ كَانَتْ لَهُ أَمَةٌ فَغَذَّاهَا، فَأَحْسَنَ غِذَاءَهَا، ثُمَّ أَدَّبَهَا فَأَحْسَنَ أَدَبَهَا، ثُمَّ أَعْتَقَهَا وَتَزَوَّجَهَا فَلَهُ أَجْرَانِ ، ثُمَّ قَالَ الشَّعْبِيُّ لِلْخُرَاسَانِيِّ: خُذْ هَذَا الْحَدِيثَ بِغَيْرِ شَيْءٍ، فَقَدْ كَانَ الرَّجُلُ يَرْحَلُ فِيمَا دُونَ هَذَا إِلَى الْمَدِينَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7952,
                "hadithNumber": "388",
                "englishNarrator": "",
                "hadithEnglish": "This hadith has been narrated by another chain of transmitters like Abu Bakr b. Abi Shaiba, 'Abda b. Sulaiman Ibn Abi 'Umar Sufyan, 'Ubaidullah b. Mu'adh, Shu'ba; all of them heard it from Salih b. Salih.",
                "hadithUrdu": "عبدہ بن سلیمان ، سفیان اور شعبہ نے صالح بن صالح کے واسطے سے سابقہ سند کے ساتھ یہی حدیث بیان کی ۔",
                "urduNarrator": "",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، ح، وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، ح، وَحَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، كُلُّهُمْ عَنْ صَالِحِ بْنِ صَالِحٍ، بِهَذَا الْإِسْنَادِ نَحْوَهُ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7953,
                "hadithNumber": "389",
                "englishNarrator": null,
                "hadithEnglish": "Abu Huraira reported that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: By Him in Whose hand is my life, the son of Mary ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) will soon descend among you as a just judge. He will break crosses, kill swine and abolish Jizya and the wealth will pour forth to such an extent that no one will accept it.",
                "hadithUrdu": "لیث نے ابن شہاب سے حدیث سنائی انہوں نے ابن مسیب سے انہوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنا ، کہتے تھے : رسول اللہ ﷺ نے فرمایا : ’’ اس ذات کی قسم جس کے ہاتھ میں میری جان ہے ! یقیناً قریب ہے کہ عیسیٰ ابن مریم ‌رضی ‌اللہ ‌عنہ ‌ ‌ تم میں اتریں گے ، انصاف کرنے والے حاکم ہوں گے ، پس وہ صلیب کو توڑ دیں گے ، خنزیر کو قتل کریں گے ، جزیہ ختم کر دیں گے اور مال کی فراوانی ہو جائے گی حتی کہ کوئی اس کو قبول نہ کرے گا ۔ ‘ ‘",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح، وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنِ ابْنِ الْمُسَيِّبِ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «وَالَّذِي نَفْسِي بِيَدِهِ، لَيُوشِكَنَّ أَنْ يَنْزِلَ فِيكُمْ ابْنُ مَرْيَمَ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حَكَمًا مُقْسِطًا، فَيَكْسِرَ الصَّلِيبَ، وَيَقْتُلَ الْخِنْزِيرَ، وَيَضَعَ الْجِزْيَةَ، وَيَفِيضُ الْمَالُ حَتَّى لَا يَقْبَلَهُ أَحَدٌ»",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7954,
                "hadithNumber": "390",
                "englishNarrator": "The same hadith is transmitted from Zuhri with the same chain of transmission. But in the tradition narrated by Ibn 'Uyaina the words are:",
                "hadithEnglish": "Impartial leader and just judge and in the tradition narrated by Yunus: the judge judging with justice and impartial leader are not mentioned. And in the hadith narrated by Salih like the one transmitted by Laith the words are: impartial judge . And in the hadith transmitted by Ziyad the words are: Till one sajda is better than the world and what it contains. Then Abu Huraira ‌رضی ‌اللہ ‌عنہ ‌used to say, recite if you like: Not one of the People of the Book will fail to believe in him before his death.",
                "hadithUrdu": "’’ انصاف کرنے والے پیشوا ، عادل حاکم ‘ ‘ اور یونس کی روایت میں  ’’عادل حاکم ‘ ‘ ہے ، انہوں نے ’’انصاف کرنے والے پیشوا ‘ ‘ کا تذکرہ نہیں کیا ۔ اور صالح کی روایت میں لیث کی طرح ہے : ’’انصاف کرنےوالے حاکم ‘ ‘ اور یہ اضافہ بھی ہے : ’’حتی کہ ایک سجدہ دنیا اور اس کی ہرچیز سے بہتر ہو گا ۔ ‘ ‘ ( کیونکہ باقی انبیاء کےساتھ محمدرسول اللہ ﷺ پرمکمل ایمان ہو گا ، او راولو العزم نبی جو صاحب کتاب و شریعت تھا ۔ آپ کی امت میں شامل ہو گا اور اسی کے مطابق فیصلے فرما رہا ہو گا ۔ ) پھر ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ ( آخر میں ) کہتے ہیں : چاہو تو یہ آیت پڑھ لو : ’’ اہل کتاب میں سے کوئی نہ ہو گا مگر عیسیٰ کی وفات سے پہلے ان پر ضرور ایمان لائے گا ( اور انہی کے ساتھ امت محمدیہ میں شامل ہو گا ۔ ) ‘ ‘",
                "urduNarrator": "ہم سے عبد العلا بن حماد، ابوبکر بن ابی شیبہ اور زہیر بن حرب نے بیان کیا,سفیان بن عیینہ ، یونس اور صالح نے ( ابن شہاب ) زہری سے ( ان کی ) اسی سند سے روایت نقل کی ۔ ابن عیینہ کی روایت میں ہے",
                "hadithArabic": "وَحَدَّثَنَاهُ عَبْدُ الْأَعْلَى بْنُ حَمَّادٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالُوا: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ح، وَحَدَّثَنِيهِ حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، قَالَ: حَدَّثَنِي يُونُسُ، ح، وَحَدَّثَنَا حَسَنٌ الْحُلْوَانِيُّ، وَعَبْدُ بْنُ حُمَيْدٍ، عَنْ يَعْقُوبَ بْنِ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، كُلُّهُمْ عَنِ الزُّهْرِيِّ، بِهَذَا الْإِسْنَادِ، وَفِي رِوَايَةِ ابْنِ عُيَيْنَةَ: «إِمَامًا مُقْسِطًا، وَحَكَمًا عَدْلًا» وَفِي رِوَايَةِ يُونُسَ: «حَكَمًا عَادِلًا»، وَلَمْ يَذْكُرْ «إِمَامًا مُقْسِطًا»، وَفِي حَدِيثِ صَالِحٍ: «حَكَمًا مُقْسِطًا»، كَمَا قَالَ اللَّيْثُ: وَفِي حَدِيثِهِ مِنَ الزِّيَادَةِ: «وَحَتَّى تَكُونَ السَّجْدَةُ الْوَاحِدَةُ خَيْرًا مِنَ الدُّنْيَا وَمَا فِيهَا»، ثُمَّ يَقُولُ أَبُو هُرَيْرَةَ: اقْرَءُوا إِنْ شِئْتُمْ: {وَإِنْ مِنْ أَهْلِ الْكِتَابِ إِلَّا لَيُؤْمِنَنَّ بِهِ قَبْلَ مَوْتِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7955,
                "hadithNumber": "391",
                "englishNarrator": "It is narrated on the authority of Abu Huraira ‌رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "The Messenger or Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) observed: I swear by Allah that the son of Mary will certainly descend as a just judge and he would definitely break the cross, and kill swine and abolish Jizya and would leave the young she-camel and no one would endeavour to (collect Zakat on it). Spite, mutual hatred and jealousy against one another will certainly disappear and when he summons people to accept wealth, not even one would do so.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’ اللہ کی قسم ! یقیناً عیسیٰ بن مریم ‌رضی ‌اللہ ‌عنہ ‌ ‌ عادل حاکم ( فیصلہ کرنےوالے ) بن کر اتریں گے ، ہر صورت میں صلیب کو توڑیں گے ، خنزیر کو قتل کریں گے او رجزیہ موقوف کر دیں گے ، جو ان اونٹنیوں کو چھوڑ دیا جائے گا اور ان سے محنت و مشقت نہیں لی جائے گی ( دوسرے وسائل میسر آنے کی وجہ سے ان کی محنت کی ضرورت نہ ہو گی ) لوگوں کے دلوں سے عداوت ، باہمی بغض و حسد ختم ہو جائے گا ، لوگ مال ( لے جانے ) کے لیے بلائے جائیں گے لیکن کوئی اسے قبول نہ کرے گا ۔ ‘ ‘",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ہم سے لیث نے بیان کیا، سعید بن ابی سعید کی سند سے,عطاء بن میناء نے حضرت ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ عَطَاءِ بْنِ مِينَاءَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «وَاللهِ، لَيَنْزِلَنَّ ابْنُ مَرْيَمَ حَكَمًا عَادِلًا، فَلَيَكْسِرَنَّ الصَّلِيبَ، وَلَيَقْتُلَنَّ الْخِنْزِيرَ، وَلَيَضَعَنَّ الْجِزْيَةَ، وَلَتُتْرَكَنَّ الْقِلَاصُ فَلَا يُسْعَى عَلَيْهَا، وَلَتَذْهَبَنَّ الشَّحْنَاءُ وَالتَّبَاغُضُ وَالتَّحَاسُدُ، وَلَيَدْعُوَنَّ إِلَى الْمَالِ فَلَا يَقْبَلُهُ أَحَدٌ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7956,
                "hadithNumber": "392",
                "englishNarrator": "It is narrated on the authority of Abu Huraira رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) observed: What will be your state when the son of Mary descends amongst you and there will be an Imam amongst you?",
                "hadithUrdu": "حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : رسو ل اللہ ﷺ نے فرمایا : ’’اس وقت تم کیسے ( عمدہ حال میں ) ہو گےجب مریم کےبیٹے ( عیسیٰ ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) تم میں اتریں گے اور تمہارا امام تم میں سے ہو گا؟ ‘ ‘ ( اترنے کےبعد پہلی نماز مقتدی کی حیثیت سے پڑھ کر امت محمدیہ میں شامل ہو جائیں گے ۔ )",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ہم سے لیث نے بیان کیا، سعید بن ابی سعید کی سند سے,یونس نے ابن شہاب سے روایت کی ، انہوں نے کہا : ابوقتادہ انصاری ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے آزاد کردہ غلام نافع نےمجھے خبر دی کہ",
                "hadithArabic": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ: أَخْبَرَنِي نَافِعٌ، مَوْلَى أَبِي قَتَادَةَ الْأَنْصَارِيِّ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «كَيْفَ أَنْتُمْ إِذَا نَزَلَ ابْنُ مَرْيَمَ فِيكُمْ وَإِمَامُكُمْ مِنْكُمْ؟».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7957,
                "hadithNumber": "393",
                "englishNarrator": "It is narrated on the authority of Abu Huraira رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "He heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: What would you do when the son of Mary would descend and lead you?",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’ تم کیسے ہو گے جب مریم کے بیٹے تمہارے درمیان اتریں گے اور تمہاری پیشوائی کریں گے ؟ ‘ ‘ ( جب امامت کرائیں گے تو بھی امت کے ایک فرد کی حیثیت سے کرائیں گے ۔ )",
                "urduNarrator": "مجھ سے محمد بن حاتم نے بیان کیا، کہا ہم سے یعقوب بن ابراہیم نے بیان کیا,ابن شہاب کے بھتیجے نے اپنے چچا ( ابن شہاب ) کے سابقہ سند کے ساتھ حضرت ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے یہ روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ أَخِي ابْنِ شِهَابٍ، عَنْ عَمِّهِ، قَالَ: أَخْبَرَنِي نَافِعٌ، مَوْلَى أَبِي قَتَادَةَ الْأَنْصَارِيِّ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «كَيْفَ أَنْتُمْ إِذَا نَزَلَ ابْنُ مَرْيَمَ فِيكُمْ وَأَمَّكُمْ؟",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7958,
                "hadithNumber": "394",
                "englishNarrator": "It is narrated on the authority of Abu Huraira رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) observed: What would you do when the son of Mary would descend amongst you and would lead you as one amongst you? Ibn Abi Dhi'b on the authority of Abu Huraira narrated: Your leader amongst you. Ibn Abi Dhi'b said: Do you know what the words: He would lead as one amongst you mean? I said: Explain these to me. He said: He would lead you according to the Book of your: Lord (hallowed be He and most exalted) and the Sunnah of your Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ).",
                "hadithUrdu": "رسو ل ا للہﷺ ‌ ‌ نے فرمایا : ’’ تم کیسے ہو گا جب ابن مریم تم میں اتریں گے اور تم میں سے ( ہوکر ) تمہاری امامت کرائیں گے ! ‘ ‘ میں ( ولید بن مسلم ) نے ابن ابی ذئب سے پوچھا : اوزاعی نے ہمیں زہری سے حدیث سنائی ، انہوں نے نافع سے اور انہوں نے ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اس طرح بیان کیا : ’’اور تمہار ا امام تمہیں میں سے ہو گا ‘ ‘ ( اور آپ کہہ رہے ہیں ، ابن مریم امامت کرائیں گے ) ابن ابی ذئب نے ( جواب میں ) کہا : جانتے ہو ’’ تم میں تمہاری امامت کرائیں گے ‘ ‘ کا مطلب کیا ہے ؟ میں نے کہا : آپ مجھے بتا دیجیے ۔ انہوں نے جواب دیا کہ تمہارے رب عزوجل کی کتاب اور تمہارے نبی ﷺ کی سنت کےساتھ ( تم میں ایک فرد کی حیثیت سے یا تمہاری امت کا فرد بن کر ) تمہاری قیادت یا امامت کریں گے ۔",
                "urduNarrator": "ہم سے زہیر بن حرب نے بیان کیا، کہا کہ مجھ سے ولید بن مسلم نے بیان کیا،ابن ابی ذئب نے ابن شہاب سے سابقہ سند کے ساتھ حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنِي الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنِ ابْنِ شِهَابٍ، عَنْ نَافِعٍ، مَوْلَى أَبِي قَتَادَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «كَيْفَ أَنْتُمْ إِذَا نَزَلَ فِيكُمْ ابْنُ مَرْيَمَ فَأَمَّكُمْ مِنْكُمْ؟»، فَقُلْتُ لِابْنِ أَبِي ذِئْبٍ: إِنَّ الْأَوْزَاعِيَّ، حَدَّثَنَا عَنِ الزُّهْرِيِّ، عَنْ نَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، «وَإِمَامُكُمْ مِنْكُمْ» قَالَ ابْنُ أَبِي ذِئْبٍ: «تَدْرِي مَا أَمَّكُمْ مِنْكُمْ؟» قُلْتُ: تُخْبِرُنِي، قَالَ: «فَأَمَّكُمْ بِكِتَابِ رَبِّكُمْ تَبَارَكَ وَتَعَالَى، وَسُنَّةِ نَبِيِّكُمْ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7959,
                "hadithNumber": "395",
                "englishNarrator": "Jabir bin 'Abdullah رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "I heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) say: A section of my people will not cease fighting for the Truth and will prevail till the Day of Resurrection. He said: Jesus son of Mary would then descend and their (Muslims') commander would invite him to come and lead them in prayer, but he would say: No, some amongst you are commanders over some (amongst you). This is the honour from Allah for this Ummah.",
                "hadithUrdu": "میں نے رسول اللہ ﷺ کو فرماتے ہوئے سنا : ’’ میری امت کا ایک گروہ مسلسل حق پر ( قائم رہتے ہوئے ) لڑتا رہے گا ، وہ قیامت کے دن تک ( جس بھی معرکے میں ہو ں گے ) غالب رہیں گے ، کہا : پھر عیسیٰ ابن مریم ‌رضی ‌اللہ ‌عنہ ‌ ‌ اتریں گے تو اس طائفہ ( گروہ ) کا امیر کہے گا : آئیں ہمیں نماز پڑھائیں ، اس پر عیسیٰ ‌علیہ ‌السلام ‌ جواب دیں گے : نہیں ، اللہ کی طرف سے اس امت کو بخشی گئی عزت و شرف کی بنا پر تم ہی ایک دوسرے پر امیر ہو ۔ ‘ ‘",
                "urduNarrator": "ہم سے ولید بن شجاع، ہارون بن عبداللہ اور حجاج بن الشعر نے بیان کیا، کہا: ہم سے حجاج نے جو ابن محمد ہیں، ابن جریج کی سند سے بیان کیا، انہوں نے کہا: اخبر ابو الزبیر۔ مجھے دکھایا،حضرت جابر بن عبد اللہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ بیان کرتے ہیں",
                "hadithArabic": "حَدَّثَنَا الْوَلِيدُ بْنُ شُجَاعٍ، وَهَارُونُ بْنُ عَبْدِ اللهِ، وَحَجَّاجُ بْنُ الشَّاعِرِ، قَالُوا: حَدَّثَنَا حَجَّاجٌ وَهُوَ ابْنُ مُحَمَّدٍ، عَنِ ابْنِ جُرَيْجٍ، قَالَ: أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ، يَقُولُ: سَمِعْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا تَزَالُ طَائِفَةٌ مِنْ أُمَّتِي يُقَاتِلُونَ عَلَى الْحَقِّ ظَاهِرِينَ إِلَى يَوْمِ الْقِيَامَةِ»، قَالَ: فَيَنْزِلُ عِيسَى ابْنُ مَرْيَمَ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَيَقُولُ أَمِيرُهُمْ: تَعَالَ صَلِّ لَنَا، فَيَقُولُ: لَا، إِنَّ بَعْضَكُمْ عَلَى بَعْضٍ أُمَرَاءُ تَكْرِمَةَ اللهِ هَذِهِ الْأُمَّةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7960,
                "hadithNumber": "396",
                "englishNarrator": "It is narrated on the authority of Abu Huraira ‌رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: The (Last) Hour shall not came till the sun rises from the place of its setting And on the day when it rises from the place of its setting even if all the people together affirmed their faith, it would not be of any avail to one who did not believe previously and derived no good out of his belief.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’جب تک سورج مغرب سے طلوع نہیں ہوتا ، اس وقت تک قیامت قائم نہیں ہو گی ۔ جب وہ مغرب سے طلوع ہوجائے گا تو سب کے سب لوگ ایمان لے آئیں گے ، اس دن ’’کسی ایسے شخص کو اس کا ایمان فائدہ نہیں دے گا جو پہلے ایمان نہ لایا تھا یا اپنے ایمان ( کی حالت ) میں کوئی نیکی نہ کمائی تھی ۔ ‘ ‘ ( عمل سے تصدیق نہ کی تھی ۔ )",
                "urduNarrator": "ہم سے یحییٰ بن ایوب، قتیبہ بن سعید اور علی بن حجر نے بیان کیا، کہا ہم سے اسماعیل نے بیان کیا، یعنی ابن جعفر نے,علاء بن عبد الرحمن نے اپنے والد سے اور انہوں نے حضرت ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ أيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَعَلِيُّ بْنُ حُجْرٍ قَالُوا: حَدَّثَنَا إِسْمَاعِيلُ يَعْنُونَ ابْنَ جَعْفَرٍ، عَنِ الْعَلَاءِ وَهُوَ ابْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: لَا تَقُومُ السَّاعَةُ حَتَّى تَطْلُعَ الشَّمْسُ مِنْ مَغْرِبِهَا، فَإِذَا طَلَعَتْ مِنْ مَغْرِبِهَا آمَنَ النَّاسُ كُلُّهُمْ أَجْمَعُونَ فَيَوْمَئِذٍ {لَا يَنْفَعُ نَفْسًا إِيمَانُهَا لَمْ تَكُنْ آمَنَتْ مِنْ قبْلُ أَوْ كَسَبَتْ فِي إِيمَانِهَا خَيْرًا.",
                "headingArabic": "بَيَانِ الزَّمَنِ الَّذِي لاَ يُقْبَلُ فِيهِ الإِيمَانُ ‏‏",
                "headingUrdu": "اس وقت کو واضح کرنا جب ایمان قبول نہیں کیا جائے گا۔",
                "headingEnglish": "Clarifying the time when faith will no longer be accepted",
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7961,
                "hadithNumber": "397",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated by another chain of transmitters, Abu Bakr bin Abi Shaiba, Ibn Numair, Abu Kuraib, Ibn Fudail. This hadith has also been narrated through several other chains on the authority of Abu Huraira.",
                "hadithUrdu": "ابو زرعہ ، عبدالرحمن اعرج اور ہمام بن منبہ سے بھی حضرت ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اسی جیسی روایت مذکور ہے جو علاء نے اپنے والد کے واسطے سے حضرت ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انہوں نے نبی ﷺ سے روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا أَبُو بكْرِ بْنُ أَبِي شَيْبَةَ، وابْنُ نُميْرٍ، وأَبُو كُريْبٍ، قَالُوا: حَدَّثَنَا ابْنُ فُضَيْلٍ، ح، وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، كِلَاهُمَا عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، ح، وَحَدَّثَنَا أَبُو بكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ، عَنْ زاَئِدَةَ، عَنْ عَبْدِ اللهِ بْنِ ذَكْوَانَ، عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، ح، وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنبِّهٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ الْعَلَاءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلَّى الله عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7962,
                "hadithNumber": "398",
                "englishNarrator": "It is narrated on the authority of Abu Huraira رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) observed: When three things appear faith will not benefit one who has not previously believed or has derived no good from his faith: the rising of the sun in its place of setting, the Dajjal, and the beast of the earth.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’ تین چیزیں ہیں جب ان کا ظہور ہو جائے گا تو اس وقت کسی شخص کو ، جو اس سے پہلے ایمان نہیں لایا تھا یا اپنے ایمان کے دوران میں کوئی نیکی نہ کی تھی ، اس کا ایمان لانافائدہ نہ دے گا : سورج کا مغرب سے طلوع ہونا ، دجال اور دابۃ الارض ( زمین سے ایک عجیب الخلقت جانور کا نکلنا ۔ ) ‘ ‘",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور زہیر بن حرب نے بیان کیا، کہا کہ ہم سے وکیع نے بیان کیا اور ہم سے زہیر بن حرب نے بیان کیا، ہم سے اسحاق بن یوسف نے بیان کیا، یہ سب فضیل بن غزوان کی سند سے ہیں۔ ہم سے ابو کریب محمد بن علاء نے بیان کیا اور تلفظ ان کا ہے - ہم سے ابن فضیل نے اپنے والد سے روایت کی،ابو حازم نے حضرت ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالَا: حَدَّثَنَا وَكِيعٌ، ح، وَحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْحَاقُ بْنُ يُوسُفَ الْأَزْرَقُ، جَمِيعًا عَنْ فُضَيْلِ بْنِ غَزْوَانَ، ح، وَحَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ - وَاللَّفْظُ لَهُ - حَدَّثَنَا ابْنُ فُضَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: ثَلَاثٌ إِذَا خَرَجْنَ لَا يَنْفَعُ نَفْسًا إِيمَانُهَا لَمْ تَكُنْ آمَنَتْ مِنْ قَبْلُ، أَوْ كَسَبَتْ فِي إِيمَانِهَا خَيْرًا: طُلُوعُ الشَّمْسِ مِنْ مَغْرِبِهَا، وَالدَّجَّالُ، وَدَابَّةُ الْأَرْضِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7963,
                "hadithNumber": "399",
                "englishNarrator": "It is narrated on the authority of Abu Dharr رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) one day said: Do you know where the sun goes? They replied: Allah and His Apostle know best. He (the Holy Prophet) observed: Verily it (the sun) glides till it reaches its resting place under the Throne. Then it falls prostrate and remains there until it is asked: Rise up and go to the place whence you came, and it goes back and continues emerging out from its rising place and then glides till it reaches its place of rest under the Throne and falls prostrate and remains in that state until it is asked: Rise up and return to the place whence you came, and it returns and emerges out from it rising place and the it glides (in such a normal way) that the people do not discern anything ( unusual in it) till it reaches its resting place under the Throne. Then it would be said to it: Rise up and emerge out from the place of your setting, and it will rise from the place of its setting. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said. Do you know when it would happen? It would happen at the time when faith will not benefit one who has not previously believed or has derived no good from the faith.",
                "hadithUrdu": "رسول اللہ ﷺ نے ایک دن پوچھا : ’’جانتے ہو یہ سورج کہاں جاتا ہے ؟ ‘ ‘ صحابہ نے جواب دیا : اللہ اور اس کا رسول زیادہ آگاہ ہیں ۔ آپ نے فرمایا : ’’یہ چلتا رہتا ہے یہاں تک کہ عرش کے نیچے اپنے مستقر پر پہنچ جاتا ہے ، پھر سجدے میں چلا جاتا ہے ، وہ مسلسل اسی حالت میں رہتا ہے حتی کہ اسے کہا جاتا ہے : اٹھو! جہاں سے آئے تھے ادھر لوٹ جاؤ تو وہ واپس لوٹتا ہے اور اپنے مطلع سے طلوع ہوتا ہے ، پھر چلتا ہوا عرش کے نیچے اپنی جائے قرار پر پہنچ جاتا ہے ، پھر سجدہ ریز ہو جاتا ہے اور اسی حالت میں رہتا ہے یہاں تک کہ اس سے کہا جاتا ہے : بلند ہو جاؤ اور جہاں سے آئے تھے ، ادھر لوٹ جاؤ تو وہ واپس جاتا ہے اور اپنے مطلع سے طلوع ہوتا ہے ، پھر ( ایک دن سورج ) چلےگا ، لوگ اس میں معمول سے ہٹی ہوئی کوئی چیز نہیں پائیں گے حتی کہ ( جی ) یہ عرش کے نیچے اپنے اسی مستقر پر پہنچے گا تو اسے کہا جائے گا : بلندہو اور اپنےمغرب ( جس طرف غروب ہوتا تھا ، اسی سمت ) سے طلوع ہو تو وہ اپنے مغرب سے طلوع ہو گا ۔ ‘ ‘ پھر آپ نے فرمایا : ’’کیا جانتے ہو یہ کب ہو گا؟ یہ اس وقت ہو گا جب ’’کسی شخص کو اس کا ایمان لانا فائدہ نہ پہنچائے گا جو اس سے پہلے ایمان نہیں لایا تھا یا اپنے ایمان کےدوران میں نیکی نہیں کمائی تھی ۔ ‘ ‘",
                "urduNarrator": "ہم سے یحییٰ بن ایوب اور اسحاق بن ابراہیم نے بیان کیا,(اسماعیل ) ابن علیہ نے کہا : ہمیں یونس نے ابراہیم بن یزید تیمی کے حوالے سے حدیث سنائی ، میرے علم کے مطابق ، انہوں نے یہ حدیث اپنے والد ( یزید ) سے سنی اور انہوں نے حضرت ابو ذر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، جَمِيعًا عَنِ ابْنِ عُلَيَّةَ، قَالَ ابْنُ أَيُّوبَ: حَدَّثَنَا ابْنُ عُلَيَّةَ، حَدَّثَنَا يُونُسُ، عَنْ إِبْرَاهِيمَ بْنِ يَزِيدَ التَّيْمِيِّ، - سَمِعَهُ فِيمَا أَعْلَمُ - عَنْ أَبِيهِ، عَنْ أَبِي ذَرٍّ أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ يَوْمًا: «أَتَدْرُونَ أَيْنَ تَذْهَبُ هَذِهِ الشَّمْسُ؟» قَالُوا: اللهُ وَرَسُولُهُ أَعْلَمُ قَالَ: إِنَّ هَذِهِ تَجْرِي حَتَّى تَنْتَهِيَ إِلَى مُسْتَقَرِّهَا تَحْتَ الْعَرْشِ، فَتَخِرُّ سَاجِدَةً، فَلَا تَزَالُ كَذَلِكَ حَتَّى يُقَالَ لَهَا: ارْتَفِعِي، ارْجِعِي مِنْ حَيْثُ جِئْتِ، فَتَرْجِعُ فَتُصْبِحُ طَالِعَةً مِنْ مَطْلِعِهَا، ثُمَّ تَجْرِي حَتَّى تَنْتَهِيَ إِلَى مُسْتَقَرِّهَا تَحْتَ الْعَرْشِ، فَتَخِرُّ سَاجِدَةً، وَلَا تَزَالُ كَذَلِكَ حَتَّى يُقَالَ لَهَا: ارْتَفِعِي، ارْجِعِي مِنْ حَيْثُ جِئْتِ، فَتَرْجِعُ فَتُصْبِحُ طَالِعَةً مِنْ مَطْلِعِهَا، ثُمَّ تَجْرِي لَا يَسْتَنْكِرُ النَّاسَ مِنْهَا شَيْئًا حَتَّى تَنْتَهِيَ إِلَى مُسْتَقَرِّهَا ذَاكَ تَحْتَ الْعَرْشِ، فَيُقَالُ لَهَا: ارْتَفِعِي أَصْبِحِي طَالِعَةً مِنْ مَغْرِبِكِ، فَتُصْبِحُ طَالِعَةً مِنْ مَغْرِبِهَا ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: أَتَدْرُونَ مَتَى ذَاكُمْ؟ ذَاكَ حِينَ {لَا يَنْفَعُ نَفْسًا إِيمَانُهَا لَمْ تَكُنْ آمَنَتْ مِنْ قَبْلُ أَوْ كَسَبَتْ فِي إِيمَانِهَا خَيْرًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 7651,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=306",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=304",
                "label": "304",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=305",
                "label": "305",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=306",
                "label": "306",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=307",
                "label": "307",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=308",
                "label": "308",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=309",
                "label": "309",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=310",
                "label": "310",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=308",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=308",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=306",
        "to": 7675,
        "total": 40465
    }
}