{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 386,
        "data": [
            {
                "id": 9914,
                "hadithNumber": "2350",
                "englishNarrator": "Adi bin Hatim reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) made a mention of the Fire and sought refuge (with Allah against it). He turned aside his face three times and then said: Protect yourselves against Fire even if with half a date. But if you fail to find it (then protect yourselves against Fire) with the help of a pleasant word).",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے آگ کا ذکر کیا تو اس سے پناہ مانگی اور تین بار اپنے چہرہ مبا رک کے ساتھ دور ہو نے کا اشارہ کیا ، پھر فر ما یا : \" آگ سے بچو چا ہے کھجور کے ایک ٹکڑے کے ذریعے سے ( بچو ) اگر تم ( یہ بھی ) نہ پاؤ تو اچھی بات کے ساتھ ۔",
                "urduNarrator": "ہم سے محمد بن المثنیٰ اور ابن بشار نے بیان کیا، کہا: ہم سے محمد بن جعفر نے بیان کیا, شعبہ نے عمرو بن مرہ سے با قی ماندہ سابقہ سند کے ساتھ روایت کی کہ ان سے خیثمہ سے، عدی بن حاتم کی سند سے",
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ خَيْثَمَةَ عَنْ عَدِيِّ بْنِ حَاتِمٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ ذَكَرَ النَّارَ فَتَعَوَّذَ مِنْهَا وَأَشَاحَ بِوَجْهِهِ ثَلَاثَ مِرَارٍ ثُمَّ قَالَ اتَّقُوا النَّارَ وَلَوْ بِشِقِّ تَمْرَةٍ فَإِنْ لَمْ تَجِدُوا فَبِكَلِمَةٍ طَيِّبَةٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9915,
                "hadithNumber": "2351",
                "englishNarrator": "Mundhir bin Jarir reported on the authority of his father:",
                "hadithEnglish": "While we were in the company of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) in the early hours of the morning, some people came there (who) were barefooted, naked, wearing striped woollen clothes, or cloaks, with their swords hung (around their necks). Most of them, nay, all of them, belonged to the tribe of Mudar. The colour of the face of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) underwent a change when he saw them in poverty. He then entered (his house) and came out and commanded Bilal (to pronounce Adhan). He pronounced Adhan and Iqima, and he (the Holy Prophet) observed prayer (along with his Companion) and then addressed (them reciting verses of the Holy Qur'an): ' 0 people, fear your Lord, Who created you from a single being to the end of the verse, Allah is ever a Watcher over you (iv. 1). (He then recited) a verse of Sura Hashr: Fear Allah. and let every soul consider that which it sends forth for the morrow and fear Allah (lix. 18). (Then the audience began to vie with one another in giving charity.) Some donated a dinar, others a dirham, still others clothes, some donated a sa' of wheat, some a sa' of dates; till he (the Holy Prophet) said: (Bring) even if it is half a date. Then a person from among the Ansar came there with a money bag which his hands could scarcely lift; in fact, they could not (lift). Then the people followed continuously, till I saw two heaps of eatables and clothes, and I saw the face of the Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) glistening, like gold (on account of joy). The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: He who sets a good precedent in Islam, there is a reward for him for this (act of goodness) and reward of that also who acted according to it subsequently, without any deduction from their rewards; and he who sets in Islam an evil precedent, there is upon him the burden of that, and the burden of him also who acted upon it subsequently, without any deduction from their burden.",
                "hadithUrdu": "ہم دن کے ابتدا ئی حصے میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حا ظر تھے کہ آپ کے پا س کچھ لو گ ننگے پاؤں ننگے بدن سوراخ کر کے دن کی دھا ری دار چادریں یا غبائیں گلے میں ڈا لے اور تلواریں لٹکا ئے ہو ئے آئے ان میں سے اکثر بلکہ سب کے سب مضر قبیلے سے تھے ان کی فاقہ زدگی کو دیکھ کر رسول اللہ صلی اللہ علیہ وسلم کا رخ نور غمزدہ ہو گیا آپ اندر تشریف لے گئے پھر با ہر نکلے تو بلال رضی اللہ تعالیٰ عنہ کو حکم دیا انھوں نے اذان دی اور اقامت کہی آپ نے نماز ادا کی ، پھر خطبہ دیا اور فرما یا : \" اے لو گو !اپنے رب سے ڈرو جس نے تمھیں ایک جا ن سے پیدا کیا ۔ ۔ ۔ آیت کے آخر تک \" بے شک اللہ تم پر نگرا ن ہے اور وہ آیت جو سورہ حشر میں ہے اللہ سے ڈرو اور ہر جا ن دیکھے کہ اس نے کل کے لیے آگے کیا بھیجا ہے ( پھر فر ما یا ) آدمی پر لازم ہے کہ وہ اپنے دینا ر سےاپنے درہم سے اپنے کپڑے سے اپنی گندم کے ایک صاع سے اپنی کھجور کے ایک صاع سے ۔ حتیٰ کہ آپ نے فر ما یا : ۔ ۔ ۔ چا ہے کھجور کے ایک ٹکڑے کے ذریعے سے صدقہ کرے ( جریرنے ) کہا : تو انصار میں سے ایک آدمی ایک تھیلی لا یا اس کی ہتھیلی اس ( کو اٹھا نے ) سے عاجز آنے لگی تھی بلکہ عا جز آگئی تھی کہا : پھر لو گ ایک دوسرے کے پیچھے آنے لگے یہاں تک کہ میں نے کھا نے اور کپڑوں کے دو ڈھیر دیکھے حتیٰ کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کا چہرہ مبارک دیکھا وہ اس طرح دمک رہا تھا جیسے اس پر سونا چڑاھا ہوا ہو ۔ پھر رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا \" جس نے اسلا م میں کو ئی اچھا طریقہ رائج کیا تو اس کے لیے اس کا ( اپنا بھی ) اجر ہےے اور ان کے جیسا اجر بھی جنھوں نے اس کے بعد اس ( طریقے ) پر عمل کیا اس کے بغیر کہ ان کے اجر میں کو ئی کمی ہو اور جس نے اسلا م میں کسی برے طریقے کی ابتدا کی اس کا بو جھ اسی پر ہے اور ان کا بو جھ بھی جنھوں نے اس کے بعد اس پر عمل کیا اس کے بغیر کہ ان کے بو جھ میں کو ئی کمی ہو ۔",
                "urduNarrator": "مجھ سے محمد بن المثنی العنزی نے بیان کیا، انہوں نے ہم سے بیان کیا محمد بن جعفر نے کہا : ہمیں شعبہ نے عون بن ابی جحیفہ سے حدیث بیان کی ، ا نھوں نے منذر بن جریر سے اور انھوں نے اپنے والد سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى الْعَنَزِيُّ أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ عَوْنِ بْنِ أَبِي جُحَيْفَةَ عَنْ الْمُنْذِرِ بْنِ جَرِيرٍ عَنْ أَبِيهِ قَالَ كُنَّا عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي صَدْرِ النَّهَارِ قَالَ فَجَاءَهُ قَوْمٌ حُفَاةٌ عُرَاةٌ مُجْتَابِي النِّمَارِ أَوْ الْعَبَاءِ مُتَقَلِّدِي السُّيُوفِ عَامَّتُهُمْ مِنْ مُضَرَ بَلْ كُلُّهُمْ مِنْ مُضَرَ فَتَمَعَّرَ وَجْهُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِمَا رَأَى بِهِمْ مِنْ الْفَاقَةِ فَدَخَلَ ثُمَّ خَرَجَ فَأَمَرَ بِلَالًا فَأَذَّنَ وَأَقَامَ فَصَلَّى ثُمَّ خَطَبَ فَقَالَ يَا أَيُّهَا النَّاسُ اتَّقُوا رَبَّكُمْ الَّذِي خَلَقَكُمْ مِنْ نَفْسٍ وَاحِدَةٍ إِلَى آخِرِ الْآيَةِ إِنَّ اللَّهَ كَانَ عَلَيْكُمْ رَقِيبًا وَالْآيَةَ الَّتِي فِي الْحَشْرِ اتَّقُوا اللَّهَ وَلْتَنْظُرْ نَفْسٌ مَا قَدَّمَتْ لِغَدٍ وَاتَّقُوا اللَّهَ تَصَدَّقَ رَجُلٌ مِنْ دِينَارِهِ مِنْ دِرْهَمِهِ مِنْ ثَوْبِهِ مِنْ صَاعِ بُرِّهِ مِنْ صَاعِ تَمْرِهِ حَتَّى قَالَ وَلَوْ بِشِقِّ تَمْرَةٍ قَالَ فَجَاءَ رَجُلٌ مِنْ الْأَنْصَارِ بِصُرَّةٍ كَادَتْ كَفُّهُ تَعْجِزُ عَنْهَا بَلْ قَدْ عَجَزَتْ قَالَ ثُمَّ تَتَابَعَ النَّاسُ حَتَّى رَأَيْتُ كَوْمَيْنِ مِنْ طَعَامٍ وَثِيَابٍ حَتَّى رَأَيْتُ وَجْهَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَهَلَّلُ كَأَنَّهُ مُذْهَبَةٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ سَنَّ فِي الْإِسْلَامِ سُنَّةً حَسَنَةً فَلَهُ أَجْرُهَا وَأَجْرُ مَنْ عَمِلَ بِهَا بَعْدَهُ مِنْ غَيْرِ أَنْ يَنْقُصَ مِنْ أُجُورِهِمْ شَيْءٌ وَمَنْ سَنَّ فِي الْإِسْلَامِ سُنَّةً سَيِّئَةً كَانَ عَلَيْهِ وِزْرُهَا وَوِزْرُ مَنْ عَمِلَ بِهَا مِنْ بَعْدِهِ مِنْ غَيْرِ أَنْ يَنْقُصَ مِنْ أَوْزَارِهِمْ شَيْءٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9916,
                "hadithNumber": "2352",
                "englishNarrator": "This hadith has been narrated on the authority of Mandhir through another chain of transmitters. And the hadith transmitted by Ibn Mu'adh contains an addition:",
                "hadithEnglish": "He then observed the noon prayer and then gave the sermon.",
                "hadithUrdu": "پھر آپ نے ظہر کی نماز ادا فرمائی ، پھر خطبہ دیا ۔",
                "urduNarrator": "ابو اسامہ اور معاذ عنبری دو نوں نے کہا : ہمیں شعبہ نے حدیث بیا ن کی ، ا نھوں نے کہا مجھے عون بن ابی جحیفہ نے حدیث بیا ن کی انھوں نے کہا : میں منذر بن جریر سے سنا انھوں نے اپنے والد سے روایت کی انھوں نے کہا : ہم دن کے ابتدا ئی حصے میں رسول اللہ صلی اللہ علیہ وسلم کے پاس ( حا ضر ) تھے ۔ ۔ ۔ ( آگے ابن جعفر کی حدیث کی طرح ہے ۔ اور ابن معاذ کی حدیث میں اضافہ ہے ، کہا",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ ح و حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ حَدَّثَنَا أَبِي قَالَا جَمِيعًا حَدَّثَنَا شُعْبَةُ حَدَّثَنِي عَوْنُ بْنُ أَبِي جُحَيْفَةَ قَالَ سَمِعْتُ الْمُنْذِرَ بْنَ جَرِيرٍ عَنْ أَبِيهِ قَالَ كُنَّا عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَدْرَ النَّهَارِ بِمِثْلِ حَدِيثِ ابْنِ جَعْفَرٍ وَفِي حَدِيثِ ابْنِ مُعَاذٍ مِنْ الزِّيَادَةِ قَالَ ثُمَّ صَلَّى الظُّهْرَ ثُمَّ خَطَبَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9917,
                "hadithNumber": "2353",
                "englishNarrator": "Mundhir bin Jarir narrated on the authority of his father:",
                "hadithEnglish": "When we were sitting in the company of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). There came people dressed in striped woollen clothes, and the rest of the hadith in the same, and there (it is also mentioned): He observed the Zuhr prayer and then climbed up a small pulpit, praised Allah, lauded Him, and then said: Verily Allah in His Book has revealed: 'O people, fear your Lord, ' etc. (iv. 1).",
                "hadithUrdu": "میں نبی اکرم صلی اللہ علیہ وسلم کے پاس بیٹھا ہواتھا کہ آپ کی خدمت میں ایک قوم درمیا ن میں سوراخ کرکے اون کی دھاری دار چیتھڑے گلے میں ڈالے آئی ۔ ۔ ۔ اور پورا واقعہ بیان کیا اور اس میں ہے : آپ نے ظہر کی نماز پڑھائی ، پھر ایک چھوٹے سے منبر پر تشریف لےگئے ، اللہ تعالیٰ کی حمد وثنا بیان کی ، پھر فرمایا : \" بلاشبہ اللہ تعالیٰ نے اپنی کتاب میں نازل فرمایا ہے : \" اےلوگو!اپنے رب سے ڈرو ۔ \" آیت کے آخر تک ۔",
                "urduNarrator": "مجھ سے عبید اللہ بن عمر القوایری، ابو کامل اور محمد بن نے بیان کیا, عبدالملک بن عمیر نے منذر بن جریر سے اور انھوں نےاپنے والد سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ وَأَبُو كَامِلٍ وَمُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ الْأُمَوِيُّ قَالُوا حَدَّثَنَا أَبُو عَوَانَةَ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ الْمُنْذِرِ بْنِ جَرِيرٍ عَنْ أَبِيهِ قَالَ كُنْتُ جَالِسًا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَاهُ قَوْمٌ مُجْتَابِي النِّمَارِ وَسَاقُوا الْحَدِيثَ بِقِصَّتِهِ وَفِيهِ فَصَلَّى الظُّهْرَ ثُمَّ صَعِدَ مِنْبَرًا صَغِيرًا فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ أَمَّا بَعْدُ فَإِنَّ اللَّهَ أَنْزَلَ فِي كِتَابِهِ يَا أَيُّهَا النَّاسُ اتَّقُوا رَبَّكُمُ الْآيَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9918,
                "hadithNumber": "2354",
                "englishNarrator": "Jarir bin 'Abdullah رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "People came to to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and they ware dressed in woollen clothes. He (the Holy Prophet) saw their dismal state, as they were suffering from want and the rest of the hadith is the same.",
                "hadithUrdu": "بدوؤں میں سے کچھ لوگ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے ، ان کے جسم پراونی کپڑے تھے ، آپ نے ان کی بدحالی دیکھی ، وہ فاقہ زدہ تھے ۔ ۔ ۔ پھر ان ( سابقہ راویان حدیث ) کی حدیث کے ہم معنی روایت بیان کی ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے جریر نے الاعمش کی سند سے، موسیٰ بن عبداللہ بن یزید سے اور ابو الضحیٰ رضی اللہ عنہ کی سند سے, عبدالرحمن بن ہلال عبسی نے حضرت جریر بن عبداللہ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ مُوسَى بْنِ عَبْدِ اللَّهِ بْنِ يَزِيدَ وَأَبِي الضُّحَى عَنْ عَبْدِ الرَّحْمَنِ بْنِ هِلَالٍ الْعَبْسِيِّ عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ قَالَ جَاءَ نَاسٌ مِنْ الْأَعْرَابِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَيْهِمْ الصُّوفُ فَرَأَى سُوءَ حَالِهِمْ قَدْ أَصَابَتْهُمْ حَاجَةٌ فَذَكَرَ بِمَعْنَى حَدِيثِهِمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9919,
                "hadithNumber": "2355",
                "englishNarrator": "Abu Mas'ud رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "We were commanded to give charity (despite the fact.) that we were coolies. Abu 'Aqil donated half a sa'. And there came another man with more than this. The hypocrites said: Verily Allah does not stand in need of the charity of this, and the second one has done nothing but only made a show (of his charity). Then this verse was revealed. Those who scoff at the voluntary givers of charity among the believers as well as those who cannot find anything (to give) but with their hard labour (ix. 80). And Bishr did not utter the word Muttawwi'in.",
                "hadithUrdu": "ہمیں صدقہ کرنے کاحکم دیا گیا ہے ، کہا : ہم بوجھ اٹھایا کرتے تھے ۔ کہا : ابوعقیل رضی اللہ تعالیٰ عنہ نے آدھا صاع صدقہ کیا ۔ ایک دوسرا انسان اس سے زیادہ کوئی چیز لایا تو منافقوں نے کہا : اللہ تعالیٰ اس کے صدقے سے غنی ہے اور اس دوسرے نے محض دکھلاوا کیا ہے ، اس پر یہ آیت مبارک اتری : \" وہ لوگ جو صدقات کے معاملے میں دل کھول کر دینے والے مسلمانوں پرطعن کرتے ہیں اور ان پر بھی جو اپنی محنت ( کی اجرت ) کے سواکچھ نہیں پاتے ۔ \" بشر نے المطوعين ( اوربعد کے ) الفاظ نہیں کہے ۔",
                "urduNarrator": "یحییٰ بن معین اور بشر بن خالد نے ۔ لفظ بشر کے ہیں ۔ حدیث بیان کی ، کہا : ہمیں محمد بن جعفر ( غندر ) نےخبر دی ، انھوں نے شعبہ سے ، انھوں نے سلیمان سے ، انھوں نے ابو وائل سے اور انھوں نے حضرت ابومسعود رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنِي يَحْيَى بْنُ مَعِينٍ حَدَّثَنَا غُنْدَرٌ حَدَّثَنَا شُعْبَةُ ح و حَدَّثَنِيهِ بِشْرُ بْنُ خَالِدٍ وَاللَّفْظُ لَهُ أَخْبَرَنَا مُحَمَّدٌ يَعْنِي ابْنَ جَعْفَرٍ عَنْ شُعْبَةَ عَنْ سُلَيْمَانَ عَنْ أَبِي وَائِلٍ عَنْ أَبِي مَسْعُودٍ قَالَ أُمِرْنَا بِالصَّدَقَةِ قَالَ كُنَّا نُحَامِلُ قَالَ فَتَصَدَّقَ أَبُو عَقِيلٍ بِنِصْفِ صَاعٍ قَالَ وَجَاءَ إِنْسَانٌ بِشَيْءٍ أَكْثَرَ مِنْهُ فَقَالَ الْمُنَافِقُونَ إِنَّ اللَّهَ لَغَنِيٌّ عَنْ صَدَقَةِ هَذَا وَمَا فَعَلَ هَذَا الْآخَرُ إِلَّا رِيَاءً فَنَزَلَتْ الَّذِينَ يَلْمِزُونَ الْمُطَّوِّعِينَ مِنْ الْمُؤْمِنِينَ فِي الصَّدَقَاتِ وَالَّذِينَ لَا يَجِدُونَ إِلَّا جُهْدَهُمْ وَلَمْ يَلْفِظْ بِشْرٌ بِالْمُطَّوِّعِينَ.",
                "headingArabic": "الْحَمْلِ بِأُجْرَةٍ يُتَصَدَّقُ بِهَا وَالنَّهْىِ الشَّدِيدِ عَنْ تَنْقِيصِ الْمُتَصَدِّقِ بِقَلِيل",
                "headingUrdu": "ادائیگی کے لیے سامان لے جانا اور اپنی اجرت میں سے صدقہ کرنا اور صدقہ میں معمولی چیز دینے والے کو حقیر سمجھنے کی سخت ممانعت",
                "headingEnglish": "Carrying goods for payment and giving charity out of one's wages, and the stern prohibition of belittling the one who gives something small in charity",
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9920,
                "hadithNumber": "2356",
                "englishNarrator": "This hadith has been narrated by Shu'ba with the same chain of transmitters and in the hadith transmitted by Sa'id bin al Rabi (the words are):",
                "hadithEnglish": "We used to carry loads on our backs.",
                "hadithUrdu": "ہم اپنی پشتوں پر بوجھ اٹھاتے تھے ۔",
                "urduNarrator": "اور ہم سے محمد بن بشار نے بیان کیا، انہوں نے مجھ سے بیان کیاسعید بن ربیع اورابو داود دونوں نے شبعہ سے باقی ماندہ اسی سند کے ساتھ حدیث بیا ن کی اور سعید بن ربیع کی حدیث میں ہے ، کہا",
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنِي سَعِيدُ بْنُ الرَّبِيعِ ح و حَدَّثَنِيهِ إِسْحَقُ بْنُ مَنْصُورٍ أَخْبَرَنَا أَبُو دَاوُدَ كِلَاهُمَا عَنْ شُعْبَةَ بِهَذَا الْإِسْنَادِ وَفِي حَدِيثِ سَعِيدِ بْنِ الرَّبِيعِ قَالَ كُنَّا نُحَامِلُ عَلَى ظُهُورِنَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9921,
                "hadithNumber": "2357",
                "englishNarrator": "It is narrated on the authority of Abu Huraira (that the Messenger of Allah ﷺ) said:",
                "hadithEnglish": "Of course the person who gives to the family a she-camel as a gift, which gives milk morning and evening equal to a large bowl, its reward (the reward of the gift) is great.",
                "hadithUrdu": "\" سن لو ، کوئی آدمی کسی خاندان کو ( ایسی دودھ دینے والی ) اونٹنی دے جو صبح کو بڑا پیالہ بھر دودھ دے اور شام کو بھی بڑا پیالہ بھر دودھ دے تو یقیناً اس ( اونٹنی ) کا اجر بہت بڑا ہے ۔ \"",
                "urduNarrator": "ہم سے زہیر بن حرب نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، انہوں نے ابوالزناد سے، انہوں نے العرج کی سند سے, حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت ہے ، وہ اسے ( آپ صلی اللہ علیہ وسلم تک ) پہنچاتے تھے",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ يَبْلُغُ بِهِ أَلَا رَجُلٌ يَمْنَحُ أَهْلَ بَيْتٍ نَاقَةً تَغْدُو بِعُسٍّ وَتَرُوحُ بِعُسٍّ إِنَّ أَجْرَهَا لَعَظِيمٌ.",
                "headingArabic": "فَضْلِ الْمَنِيحَةِ ‏‏",
                "headingUrdu": "تحفہ دینے کی فضیلت",
                "headingEnglish": "The virute of giving gifts",
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9922,
                "hadithNumber": "2358",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade (to do certain things) and then he made a mention of certain habits and said: He who gives a she-camel as a gift, for him is the reward (of the gift) both morning and evening - a reward for drinking milk in the morning and a reward for drinking milk in the evening.",
                "hadithUrdu": "آپ نے ( کچھ اشیاء سے ) منع کیا ، پھر چند خصلتوں کا ذکر کیا اورفرمایا : \" جس نے دودھ پینے کے لئے جانور دیا تو اس ( اونٹنی ، گائے وغیرہ ) نے صدقے سے صبح کی اور صدقے سے شام کی ، یعنی اپنے صبح کے دودھ سے اور اپنے شام کے دودھ سے ۔ \"",
                "urduNarrator": "مجھ سے محمد بن احمد بن ابی خلف نے بیان کیا، کہا ہم سے زکریا بن عدی نے بیان کیا، کہا ہم سے عبید اللہ بن عمرو نے بیان کیا، وہ زید کی سند سے، عدی بن ثابت سے اور ابی حازم کے واسطہ سے, حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ حَدَّثَنَا زَكَرِيَّاءُ بْنُ عَدِيٍّ أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ عَمْرٍو عَنْ زَيْدٍ عَنْ عَدِيِّ بْنِ ثَابِتٍ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ نَهَى فَذَكَرَ خِصَالًا وَقَالَ مَنْ مَنَحَ مَنِيحَةً غَدَتْ بِصَدَقَةٍ وَرَاحَتْ بِصَدَقَةٍ صَبُوحِهَا وَغَبُوقِهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9923,
                "hadithNumber": "2359",
                "englishNarrator": "Abu Haraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "The likeness of one who spends or one who gives charity is that of a person who has two cloaks or two coats-of-mail over him right from the breast to the collar bones. And when the spender (and the other narrator said, when the giver of charity) makes up his mind to give charity, it (coat-mail) becomes expanded for him. But when a miserly person intends to spend, it contracts and every ring grips the place where it is. For the giver of charity, this coat-of. mail expands to cover his whole body and obliterates even his footprints. Abu Huraira said: (The miserly man) tries to expand it (the coat-of-mail) but it does not expand.",
                "hadithUrdu": "\" خرچ کرنے والے اور صدقہ دینے والے کی مثال اس آدمی کی ہے جس کے جسم پر چھاتی سے لے کر ہنسلی کی ہڈیوں تک دو جبے یا دو زرہیں ہوں ۔ جب خرچ کرنے والا اور دوسرے ( راوی ) نے کہا : جب صدقہ کرنے والا ۔ خرچ کرنے کا ارادہ کرتاہے تو وہ زرہ اس ( کے جسم ) پر کھل جاتی ہے یا رواں ہوجاتی ہے اور جب بخیل خرچ کرنے کاارادہ کرتا ہےتو وہ اس ( کے جسم ) پر سکڑ جاتی ہے اورہر حلقہ اپنی جگہ ( کومضبوطی سے ) پکڑ لیتا ہے حتیٰ کہ اس ( کی انگلیوں ) کے پوروں کو ڈھانپ دیتا ہے اور اس کے نقش پا کو مٹا دیتا ہے ۔ \" کہا : تو ابو ہریرہ رضی اللہ تعالیٰ عنہ نے کہا : آپ نے فرمایا : \" وہ ( بخیل ) اس کو کھولنا چاہتا ہے لیکن وہ کھلتی نہیں ۔ \"",
                "urduNarrator": "ہم سے عمرو ناقد نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا, ابو زناد نے اعرج سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی ، نیز ابن جریج نے کہا : حسن بن مسلم سے ، انھوں نے طاوس سے ، انھوں نے ابوہریرہ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرٌو النَّاقِدُ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ عَمْرٌو وَحَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ قَالَ وَقَالَ ابْنُ جُرَيْجٍ عَنْ الْحَسَنِ بْنِ مُسْلِمٍ عَنْ طَاوُسٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَثَلُ الْمُنْفِقِ وَالْمُتَصَدِّقِ كَمَثَلِ رَجُلٍ عَلَيْهِ جُبَّتَانِ أَوْ جُنَّتَانِ مِنْ لَدُنْ ثُدِيِّهِمَا إِلَى تَرَاقِيهِمَا فَإِذَا أَرَادَ الْمُنْفِقُ وَقَالَ الْآخَرُ فَإِذَا أَرَادَ الْمُتَصَدِّقُ أَنْ يَتَصَدَّقَ سَبَغَتْ عَلَيْهِ أَوْ مَرَّتْ وَإِذَا أَرَادَ الْبَخِيلُ أَنْ يُنْفِقَ قَلَصَتْ عَلَيْهِ وَأَخَذَتْ كُلُّ حَلْقَةٍ مَوْضِعَهَا حَتَّى تُجِنَّ بَنَانَهُ وَتَعْفُوَ أَثَرَهُ قَالَ فَقَالَ أَبُو هُرَيْرَةَ فَقَالَ يُوَسِّعُهَا وَلَا تَتَّسِعُ.",
                "headingArabic": "مَثَلِ الْمُنْفِقِ وَالْبَخِيلِ ‏‏",
                "headingUrdu": "دینے والے اور کنجوس کی مثال",
                "headingEnglish": "The Likeness of the giver and the miser",
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9924,
                "hadithNumber": "2360",
                "englishNarrator": "Abu Haraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) gave similitudes of a miserly man and the giver of charity as two persons who have two coats-of-mail over them with their hands pressed closely to their breasts and their collar bones. Whenever the giver of charity gives charity it (the coat-of mail) expands so much as to cover his finger tips and obliterate his foot prints. And whenever the miserly person intends to give charity (the coat-of-mail) contracts and every ring grips the place where it is. He (Abu Huraira رضی اللہ تعالیٰ عنہ ) said: I saw the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saying with fingers in the opening of his shirt: If you had seen him trying to expand it, it will not expand.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے مثال بیان فرمائی : \" بخیل اور صدقہ کرنے والے کی مثال ایسے دو آدمیوں کی مانند ہے جن ( کے جسموں ) پر لوہے کی دو زرہیں ہیں ، ان کے دونوں ہاتھ انکی چھاتیوں اورہنسلی کی ہڈیوں سے جکڑے ہوئے ہیں ، پس صدقہ دینے والا جب صدقہ دینے لگتا ہےتووہ ( اس کی زرہ ) پھیل جاتی ہے حتیٰ کہ اس کی انگلیوں کے پوروں کو ڈھانپ لیتی ہے اور ( زمین پر گھسیٹنے کی وجہ سے ) اس کے نقش قدم کو مٹانے لگتی ہے ۔ اور بخیل جب صدقہ دینے کا ارادہ کرنے لگتا ہے تو وہ سکڑ جاتی ہے اور ہر حلقہ اپنی جگہ کو پکڑ لیتا ہے ۔ \" ( ابو ہریرہ رضی اللہ تعالیٰ عنہ نے ) کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا آپ اپنی گریبان میں ڈال رہے تھے ، کاش تم آپ صلی اللہ علیہ وسلم کو دیکھتے ( ایسے لگتا تھا کہ ) آپ صلی اللہ علیہ وسلم اسے کشادہ کرنا چاہتے ہیں لیکن وہ کشادہ نہیں ہوتی ۔",
                "urduNarrator": "مجھ سے سلیمان بن عبید اللہ ابو ایوب الغیلانی نے بیان کیا، کہا ہم سے ابو عامر یعنی العقدی نے بیان کیا، کہا ہم سےابراہیم بن نافع نے حسن بن مسلم سے ، انھوں نے طاوس سے اور انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنِي سُلَيْمَانُ بْنُ عُبَيْدِ اللَّهِ أَبُو أَيُّوبَ الْغَيْلَانِيُّ حَدَّثَنَا أَبُو عَامِرٍ يَعْنِي الْعَقَدِيَّ حَدَّثَنَا إِبْرَاهِيمُ بْنُ نَافِعٍ عَنْ الْحَسَنِ بْنِ مُسْلِمٍ عَنْ طَاوُسٍ عَنْ أَبِي هُرَيْرَةَ قَالَ ضَرَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَثَلَ الْبَخِيلِ وَالْمُتَصَدِّقِ كَمَثَلِ رَجُلَيْنِ عَلَيْهِمَا جُنَّتَانِ مِنْ حَدِيدٍ قَدْ اضْطُرَّتْ أَيْدِيهِمَا إِلَى ثُدِيِّهِمَا وَتَرَاقِيهِمَا فَجَعَلَ الْمُتَصَدِّقُ كُلَّمَا تَصَدَّقَ بِصَدَقَةٍ انْبَسَطَتْ عَنْهُ حَتَّى تُغَشِّيَ أَنَامِلَهُ وَتَعْفُوَ أَثَرَهُ وَجَعَلَ الْبَخِيلُ كُلَّمَا هَمَّ بِصَدَقَةٍ قَلَصَتْ وَأَخَذَتْ كُلُّ حَلْقَةٍ مَكَانَهَا قَالَ فَأَنَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ بِإِصْبَعِهِ فِي جَيْبِهِ فَلَوْ رَأَيْتَهُ يُوَسِّعُهَا وَلَا تَوَسَّعُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9925,
                "hadithNumber": "2361",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: . The similitude of a miserly man and the giver of charity is that of two persons with coats of mail over them; when the giver of charity intends to give charity, it expands over him (to much so) that the footprints are also obliterated. And when the miserly man intends to give charity, it contracts over him, and his hands are tied up to his collar bone, and every ring is fixed up to another. He (the narrator) said: I heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He would try to expand it. but he would not be able to do so.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" بخیل اور صدقہ دینے والے کی مثال ان دو آدمیوں جیسی ہے جن پر لوہے کی دو زرہیں ہیں ، صدقہ دینے والا جب صدقہ دینے کاارادہ کرتا ہے تو وہ ( اس کی زرہ ) اس پر کشادہ ہوجاتی ہے حتیٰ کہ اس کے نقش پا کو مٹانے لگتی ہے اور جب بخیل صدقہ دینے کاارادہ کرتاہے تو وہ ( زرہ ) اس پر سکڑ جاتی ہے اور اس کے دونوں ہاتھ اس کی ہنسلی کے ساتھ جکڑ جاتے ہیں اور ہر حلقہ ساتھ و الے حلقے کے ساتھ پیوست ہوجاتاہے ۔ \" ( ابو ہریرہ رضی اللہ تعالیٰ عنہ نے ) کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : \" وہ کوشش کرتا ہے کہ اسے کشادہ کرے لیکن نہیں کرسکتا ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے احمد بن اسحاق الحضدمی نے بیان کیا، وہیب کی سند سے, عبداللہ بن طاوس نے اپنے والد سے اور انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَحْمَدُ بْنُ إِسْحَقَ الْحَضْرَمِيُّ عَنْ وُهَيْبٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ طَاوُسٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَثَلُ الْبَخِيلِ وَالْمُتَصَدِّقِ مَثَلُ رَجُلَيْنِ عَلَيْهِمَا جُنَّتَانِ مِنْ حَدِيدٍ إِذَا هَمَّ الْمُتَصَدِّقُ بِصَدَقَةٍ اتَّسَعَتْ عَلَيْهِ حَتَّى تُعَفِّيَ أَثَرَهُ وَإِذَا هَمَّ الْبَخِيلُ بِصَدَقَةٍ تَقَلَّصَتْ عَلَيْهِ وَانْضَمَّتْ يَدَاهُ إِلَى تَرَاقِيهِ وَانْقَبَضَتْ كُلُّ حَلْقَةٍ إِلَى صَاحِبَتِهَا قَالَ فَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فَيَجْهَدُ أَنْ يُوَسِّعَهَا فَلَا يَسْتَطِيعُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9926,
                "hadithNumber": "2362",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: A man expressed his intention to give charity, so he came out with charity and placed it in the hand of an adulteress. In the morning, the people were talking and saying: charity was given to an adulteress last night. He (the giver of Sadaqa) said: O Allah, to Thee be the praise-to an adulteress. He then again expressed his intention to give charity; so he went out with the charity and placed it in the hand of a rich person. In the morning the people were talking and saying: Charity was given to a rich person. He (the giver of charity) said: O Allah, to Thee be the praise-to a well-to-do person. He then expressed his intention to give charity, so he went out with charity and placed it in the hand of a thief. In the morning, the people were talking and saying: Charity was given to a thief. So (one of the persons) said: O Allah, to Thee be the praise (what a misfortune it is that charity has been given to) the adulteress, to a rich person. to a thief! There came (the angel to him) and he was told: Your charity has been accepted. As for the adulteress (the charity might become the means) whereby she might restrain herself from fornication. The rich man might perhaps learn a lesson and spend from what Allah has given him, and the thief might thereby refrain from committing theft.",
                "hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم نے فرمایا : \" ایک آدمی نے کہا : میں آج رات ضرور کچھ صدقہ کروں گا تو وہ اپنا صدقہ لے کر نکلا اور اسےایک زانیہ کے ہاتھ میں دے دیا ، صبح کو لوگ باتیں کرنے لگے کہ آج رات ایک زانیہ پر صدقہ کیا گیا ، اس آدمی نے کہا : اے اللہ تیری حمد!زانیہ پر ( صدقہ ہوا ) میں ضرور صدقہ کروں گا ، پھر وہ صدقہ لے کر نکلا تو اسے ایک مالدار کے ہاتھ میں دے دیا ۔ صبح کو لوگ باتیں کرنے لگے : ایک مال دار پر صدقہ کیا گیا ۔ اس نے کہا : اے اللہ تیری حمد! مالدار پر ( صدقہ ہوا ) میں ضرور کچھ صدقہ کروں گا اور وہ اپنا صدقہ لے کر نکلاتو اسے ایک چور کے ہاتھ پر رکھ دیا ۔ لوگ صبح کو باتیں کرنے لگے : چور پر صدقہ کیا گیا ۔ تو اس نے کہا : اے اللہ ! سب حمد تیرے ہی لئے ہے ، زانیہ پر ، مالدار پر ، اور چور پر ( صدقہ ہوا ) ۔ اس کو ( خواب میں ) کہا گیا تمہارا صدقہ قبول ہوچکا ، جہاں تک زانیہ کا تعلق ہے تو ہوسکتا ہے کہ اس ( صدقے ) کی وجہ سے زانیہ اپنے زنا سے پاک دامنی اختیار کرلے اور شاید مال دارعبرت پکڑے اور اللہ نے جو اسے دیا ہے ( خود ) اس میں صدقہ کرے اور شاید اس کی وجہ سے چور اپنی چوری سے باز آجائے ۔ \"",
                "urduNarrator": "مجھ سے سوید بن سعید نے بیان کیا، مجھ سے حفص بن میسرہ نے بیان کیا، وہ موسیٰ بن عقبہ کی سند سے، ابوالزیناد نے، العرج کی سند سے, حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنِي سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنِي حَفْصُ بْنُ مَيْسَرَةَ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قَالَ رَجُلٌ لَأَتَصَدَّقَنَّ اللَّيْلَةَ بِصَدَقَةٍ فَخَرَجَ بِصَدَقَتِهِ فَوَضَعَهَا فِي يَدِ زَانِيَةٍ فَأَصْبَحُوا يَتَحَدَّثُونَ تُصُدِّقَ اللَّيْلَةَ عَلَى زَانِيَةٍ قَالَ اللَّهُمَّ لَكَ الْحَمْدُ عَلَى زَانِيَةٍ لَأَتَصَدَّقَنَّ بِصَدَقَةٍ فَخَرَجَ بِصَدَقَتِهِ فَوَضَعَهَا فِي يَدِ غَنِيٍّ فَأَصْبَحُوا يَتَحَدَّثُونَ تُصُدِّقَ عَلَى غَنِيٍّ قَالَ اللَّهُمَّ لَكَ الْحَمْدُ عَلَى غَنِيٍّ لَأَتَصَدَّقَنَّ بِصَدَقَةٍ فَخَرَجَ بِصَدَقَتِهِ فَوَضَعَهَا فِي يَدِ سَارِقٍ فَأَصْبَحُوا يَتَحَدَّثُونَ تُصُدِّقَ عَلَى سَارِقٍ فَقَالَ اللَّهُمَّ لَكَ الْحَمْدُ عَلَى زَانِيَةٍ وَعَلَى غَنِيٍّ وَعَلَى سَارِقٍ فَأُتِيَ فَقِيلَ لَهُ أَمَّا صَدَقَتُكَ فَقَدْ قُبِلَتْ أَمَّا الزَّانِيَةُ فَلَعَلَّهَا تَسْتَعِفُّ بِهَا عَنْ زِنَاهَا وَلَعَلَّ الْغَنِيَّ يَعْتَبِرُ فَيُنْفِقُ مِمَّا أَعْطَاهُ اللَّهُ وَلَعَلَّ السَّارِقَ يَسْتَعِفُّ بِهَا عَنْ سَرِقَتِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9927,
                "hadithNumber": "2363",
                "englishNarrator": "Abu Musa رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The honest Muslim trustee who spends (sometimes he said who gives ) what he is commanded to do and he gives that in full with his heart overflowing with cheerfulness and he gives it to one to whom he is ordered, he is one of the givers of charity.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" بے شک ایک مسلمان امانت دار خازن ( خزانچی ) جو دیئے گئے حکم پر عمل کرتا ہے ۔ ( یا فرمایا : ادا کرتا ہے ) اسے خوش دلی کے ساتھ پورے کا پورا ( بلکہ ) وافر ، اس شخص کو ادا کردیتا ہے جس کے بارے میں اسے حکم دیا گیا ہے تو وہ ( خازن بھی ) ۔ ۔ ۔ دو صدقہ کرنے والوں میں سے ایک ہے ۔ \"",
                "urduNarrator": "ہم سے ابو بکر بن ابی شیبہ، ابو عامر اشعری، ابن نمیر اور ابو کریب نے بیان کیا، ہم سے ابو عامر نے بیان کیا اور ہم سے اسامہ برید نے اپنے دادا ابو بردہ سے بیان کیا , حضرت ابو موسیٰ رضی اللہ تعالیٰ عنہ نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو عَامِرٍ الْأَشْعَرِيُّ وَابْنُ نُمَيْرٍ وَأَبُو كُرَيْبٍ كُلُّهُمْ عَنْ أَبِي أُسَامَةَ قَالَ أَبُو عَامِرٍ حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنَا بُرَيْدٌ عَنْ جَدِّهِ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَى عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الْخَازِنَ الْمُسْلِمَ الْأَمِينَ الَّذِي يُنْفِذُ وَرُبَّمَا قَالَ يُعْطِي مَا أُمِرَ بِهِ فَيُعْطِيهِ كَامِلًا مُوَفَّرًا طَيِّبَةً بِهِ نَفْسُهُ فَيَدْفَعُهُ إِلَى الَّذِي أُمِرَ لَهُ بِهِ أَحَدُ الْمُتَصَدِّقَيْنِ.",
                "headingArabic": "أَجْرِ الْخَازِنِ الأَمِينِ وَالْمَرْأَةِ إِذَا تَصَدَّقَتْ مِنْ بَيْتِ زَوْجِهَا غَيْرَ مُفْسِدَةٍ ب",
                "headingUrdu": "ثقہ کار کا ثواب اور اگر عورت اپنے شوہر کے گھر سے اس کی صریح یا ظاہری اجازت سے بغیر کسی نقصان کے صدقہ دے",
                "headingEnglish": "The reward of the Trustworthy Trustee, and if a woman gives charity from her husband's house without causing any damage, with his explicit or implicit permission",
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9928,
                "hadithNumber": "2364",
                "englishNarrator": "A'isha رضی اللہ تعالیٰ عنہا reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When a woman gives in charity some of the food in her house, without causing any damage, there is reward for her for whatever she has given, and a reward for her husband for what he earned. The same applies to the trustee. In no respect does the one diminish the reward of the other.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب عورت اجاڑے بغیر اپنے گھر کے کھانے سے خرچ کرتی ہے تو اسے خرچ کرنے کی وجہ سے اجر ملے گا اور اس کے خاوند کو اس کے کمانے کی وجہ سے اپنا اجر ملے گا اور خزانچی کے لئے بھی اسی طرح ( اجر ) ہے ۔ یہ ایک دوسرے کے اجر میں کوئی کمی نہیں کرتے ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ، زہیر بن حرب اور اسحاق بن ابراہیم نے بیان کیا,  جریر نے منصور سے ، انھوں نے شقیق سے ، انھوں نے مسروق سے اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَزُهَيْرُ بْنُ حَرْبٍ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ جَمِيعًا عَنْ جَرِيرٍ قَالَ يَحْيَى أَخْبَرَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ شَقِيقٍ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَنْفَقَتْ الْمَرْأَةُ مِنْ طَعَامِ بَيْتِهَا غَيْرَ مُفْسِدَةٍ كَانَ لَهَا أَجْرُهَا بِمَا أَنْفَقَتْ وَلِزَوْجِهَا أَجْرُهُ بِمَا كَسَبَ وَلِلْخَازِنِ مِثْلُ ذَلِكَ لَا يَنْقُصُ بَعْضُهُمْ أَجْرَ بَعْضٍ شَيْئًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9929,
                "hadithNumber": "2365",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated by Mansur with the same chain of transmitters (with this alteration of words): from the food of her husband .",
                "hadithUrdu": "ہم سے ابن ابی عمر نے بیان کیا، انہوں نے کہا فضیل بن عیاض نے منصور سے اسی سند کے ساتھ ( سابقہ حدیث کے مانند ) روایت کی اور انھوں نے ( \" اپنے گھر کے کھانے میں سے \" کے بجائے ) من طعام زوجها ( اپنے خاوند کے کھانے میں سے ) کے الفاظ کہے ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَاه ابْنُ أَبِي عُمَرَ حَدَّثَنَا فُضَيْلُ بْنُ عِيَاضٍ عَنْ مَنْصُورٍ بِهَذَا الْإِسْنَادِ وَقَالَ مِنْ طَعَامِ زَوْجِهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9930,
                "hadithNumber": "2366",
                "englishNarrator": "A'isha رضی اللہ تعالیٰ عنہا reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When a woman spends (something as Sadaqa) out of the household of her husband without causing any damage, there is a reward for her and for him too like it for whatever he earned, and for her (for the wife) because of her spending (for the sake of Allah), and for the trustee also (there is a reward like it), without any reduction from their rewards.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب عورت اجاڑے بغیر اپنے خاوند کے گھر سے ( اللہ کی راہ میں ) خرچ کرتی ہے تو اس کے لئے اس کااجر ہے اور اس ( خاوند ) کے لئے بھی اس کے کمانے کی وجہ سے ویسا ہی اجر ہے اور اس عورت کے لئے اس کے خرچ کرنے کی وجہ سے اور خزانچی کے لئے بھی اس جیسا ( اجر ) ہے ، ان ( سب لوگوں ) کے اجر میں کچھ کمی کئے بغیر ۔ \"",
                "urduNarrator": "ابو بکر بن ابی شیبہ نے کہا : ابو معاویہ نے ہمیں اعمش سے حدیث بیان کی ، انھوں نے شقیق سے ، انھوں نے مسروق سے اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ شَقِيقٍ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَنْفَقَتْ الْمَرْأَةُ مِنْ بَيْتِ زَوْجِهَا غَيْرَ مُفْسِدَةٍ كَانَ لَهَا أَجْرُهَا وَلَهُ مِثْلُهُ بِمَا اكْتَسَبَ وَلَهَا بِمَا أَنْفَقَتْ وَلِلْخَازِنِ مِثْلُ ذَلِكَ مِنْ غَيْرِ أَنْ يَنْتَقِصَ مِنْ أُجُورِهِمْ شَيْئًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9931,
                "hadithNumber": "2367",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated by A'mash with the same chain of transmitters.",
                "hadithUrdu": "ابن نمیر نے کہا : ہمیں میرے والد اور با معاویہ نے اعمش سے اسی ( مذکورہ بالا ) سند کے ساتھ اسی طرح حدیث بیا ن کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَاه ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي وَأَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ نَحْوَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9932,
                "hadithNumber": "2368",
                "englishNarrator": "Umair رضی اللہ تعالیٰ عنہ , the freed slave of Abi'l-Lahm reported:",
                "hadithEnglish": "I was the slave (of Abi'l-Lahm). I asked the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) if I could give some charity out of my master's wealth. He said: Yes, and the reward is half and half between you two.",
                "hadithUrdu": "میں غلام تھا ، میں نے رسول اللہ صلی اللہ علیہ وسلم سے پوچھا : کیا میں اپنے آقاؤں کے مال میں سے کچھ صدقہ کرسکتا ہوں؟آپ نے فرمایا : \" ہاں ، اوراجر تم دونوں کےدرمیان آدھاآدھا ( برابر برابر ) ہوگا ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، ابن نمیر اور زہیر بن حرب نے حفص بن غیث کی سند سے بیان کیا، کہا: ہم سے حفص نے روایت کی ہے, محمد بن زید نے آبی اللحم ( غفاری ) رضی اللہ تعالیٰ عنہ کے آزاد کردہ غلام عمیر رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَابْنُ نُمَيْرٍ وَزُهَيْرُ بْنُ حَرْبٍ جَمِيعًا عَنْ حَفْصِ بْنِ غِيَاثٍ قَالَ ابْنُ نُمَيْرٍ حَدَّثَنَا حَفْصٌ عَنْ مُحَمَّدِ بْنِ زَيْدٍ عَنْ عُمَيْرٍ مَوْلَى آبِي اللَّحْمِ قَالَ كُنْتُ مَمْلُوكًا فَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَأَتَصَدَّقُ مِنْ مَالِ مَوَالِيَّ بِشَيْءٍ قَالَ نَعَمْ وَالْأَجْرُ بَيْنَكُمَا نِصْفَانِ.",
                "headingArabic": "مَا أَنْفَقَ الْعَبْدُ مِنْ مَالِ مَوْلاَهُ ‏‏",
                "headingUrdu": "غلام اپنے آقا کا مال کیسا خرچ کرتا ہے۔",
                "headingEnglish": "What a slave spends of his master's wealth",
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9933,
                "hadithNumber": "2369",
                "englishNarrator": "Umair رضی اللہ تعالیٰ عنہ , the freed slave of Abi'l-Lahm رضی اللہ تعالیٰ عنہ said:",
                "hadithEnglish": "My master commanded me to cut some meat in strips; (as I was doing it) a poor man came to me and I gave him some of it to eat. My master came to know of that, and he beat me. I came to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and narrated it to him. He (the Holy Prophet) summoned him and said: Why did you beat him? He (Abi'l-Lahm) said: He gives away my food without being commanded to do so. Upon this he (the Holy Prophet) said: The reward would be shared by you two.",
                "hadithUrdu": "مجھے میرے آقا نے گوشت کے ٹکڑے کرکے خشک کرنے کا حکم دیا ، میرے پاس ایک مسکین آگیا تو میں نے اس میں سے کچھ کھلا دیا ۔ میرے آقا کو اس کا پتہ چل گیا ۔ تو انھوں نے مجھے مارا ۔ اس پر میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور آپ صلی اللہ علیہ وسلم کو یہ بات بتائی ۔ آپ نے اسے بلا کر پوچھا : \" تم نے اسے کیوں مارا؟ \" اس نے کہا : میرے حکم کے بغیر میراکھانا ( دوسروں کو ) دیتا ہے ۔ توآپ صلی اللہ علیہ وسلم نےفرمایا : \" اجر تم دونوں کے درمیان ہوگا ۔ \" ( تم دونوں کو ملے گا )",
                "urduNarrator": "اور ہم سے قتیبہ بن سعید نے بیان کیا، حاتم نے، یعنی ہم سے ابن اسماعیل نے بیان کیا, یزید بن ابی عبید نے کہا : میں نے آبی اللحم رضی اللہ تعالیٰ عنہ کے آزاد کردہ غلام عمیر رضی اللہ تعالیٰ عنہ سے سنا ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا حَاتِمٌ يَعْنِي ابْنَ إِسْمَعِيلَ عَنْ يَزِيدَ يَعْنِي ابْنَ أَبِي عُبَيْدٍ قَالَ سَمِعْتُ عُمَيْرًا مَوْلَى آبِي اللَّحْمِ قَالَ أَمَرَنِي مَوْلَايَ أَنْ أُقَدِّدَ لَحْمًا فَجَاءَنِي مِسْكِينٌ فَأَطْعَمْتُهُ مِنْهُ فَعَلِمَ بِذَلِكَ مَوْلَايَ فَضَرَبَنِي فَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرْتُ ذَلِكَ لَهُ فَدَعَاهُ فَقَالَ لِمَ ضَرَبْتَهُ فَقَالَ يُعْطِي طَعَامِي بِغَيْرِ أَنْ آمُرَهُ فَقَالَ الْأَجْرُ بَيْنَكُمَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9934,
                "hadithNumber": "2370",
                "englishNarrator": "Hammam bin Munabbih said:",
                "hadithEnglish": "These are some of the a hadith of Muhammad. the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), transmitted to us on the authority of Abu Huraira رضی اللہ تعالیٰ عنہ . So he narrated one hadith out of them (as this): The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: No woman should observe fast when her spouse is present (in the house) but with his permission. And she should not admit any (mahram) in his house, while he (her husband) is present, but with his permission. And whatever she spends from his earnings without his sanction, for him is half the reward.",
                "hadithUrdu": "یہ وہ احادیث ہیں جو ابو ہریرہ رضی اللہ تعالیٰ عنہ نے ہمیں محمد رسول اللہ صلی اللہ علیہ وسلم سے بیان کی ، پھر انھوں نے کچھ احادیث ذکر کیں ، ان میں سے یہ بھی تھی کہ آپ صلی اللہ علیہ وسلم نے فرمایا : \" عورت اپنے خاوند کی موجودگی میں ( نفلی ) روزہ نہ رکھے مگر جب اس کی اجازت ہو اور اس کے گھر میں اس ک موجودگی میں ( اپنے کسی محرم کو بھی ) اس کی اجازت کے بغیر نہ آنے دےاور اس ( عورت ) نے اس کے حکم کے بغیر اس کی کمائی سے جو کچھ خرچ کیا تو یقیناً اس کا آدھا اجر اس ( خاوند ) کے لئے ہے ۔ \"",
                "urduNarrator": "ہم سے محمد بن رافع نے بیان کیا، ہم سے عبدالرزاق نے بیان کیا، ہم سے معمر نے بیان کیا , ہمام بن منبہ سے ر وایت ہے ، کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ عَنْ مُحَمَّدٍ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَصُمْ الْمَرْأَةُ وَبَعْلُهَا شَاهِدٌ إِلَّا بِإِذْنِهِ وَلَا تَأْذَنْ فِي بَيْتِهِ وَهُوَ شَاهِدٌ إِلَّا بِإِذْنِهِ وَمَا أَنْفَقَتْ مِنْ كَسْبِهِ مِنْ غَيْرِ أَمْرِهِ فَإِنَّ نِصْفَ أَجْرِهِ لَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9935,
                "hadithNumber": "2371",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: If anyone contributes a pair of anything for the sake of Allah, he would be invited to enter Paradise (with these words): O servant of Allah, it is good (for you). Those who engage in prayer will he invited to enter by the gate of prayer; those who take part in Jihad will be invited to enter by the gate of Jihad; those who give charity will be invited to enter by the gate of charity; and those who observe fast will be invited to enter by the gate ar-Rayyan. Abu Bakr Siddiq said: Messenger of Allah, is it necessary that a person be invited through one of these gates? Will anyone be invited to enter by all those gates? The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Yes, and I hope you will be one of them.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جس نے اللہ کی راہ میں دو دو چیزیں خرچ کیں اسے جنت میں آواز دی جائے گی کے اے اللہ کے بندے!یہ ( دروازہ ) بہت اچھا ہے ۔ ( کیونکہ وہ دوسرے میں سے جانے کا حقدار بھی ہوگا ) جو نماز پڑھنے والوں میں سے ہوگا ، اسے نماز کے دروازے سے پکارا جائے گا ، جو جہاد کرنے والوں میں سے ہوگا ، اسے جہاد کے دروازے سے پکارا جائے گا ، جو صدقہ دینے والوں میں سے ہوگا ، اسے صدقے والے دروازے سے پکارا جائے گا ، اور جو روزہ داروں میں سے ہوگا ، اسے باب ریان ( سیرابی کے دروازے ) سے پکارا جائے گا ۔ \" ابوبکر صدیق رضی اللہ تعالیٰ عنہ نے کہا : اے اللہ کے رسول صلی اللہ علیہ وسلم !کسی انسان کو ان تمام دروازوں سے پکارے جان کی ضرورت تو نہیں ہے لیکن کیا کوئی ایسا بھی ( خوش نصیب ) ہوگا جسے ان تمام دروازوں سے بلا یا جائے گا؟رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ہاں ، اور مجھے امید ہے تم انھی میں سے ہوگے ۔ \"",
                "urduNarrator": "مجھ سے ابو الطاہر اور ہرملہ بن یحییٰ التجیبی نے بیان کیا، اور یہ قول ابو الطاہر کا ہے، انہوں نے کہا: مجھ سے ابن وہب نے بیان کیا, یونس نے ابن شہاب سے ، انھوں نے حمید بن عبدالرحمان سے اور انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ وَحَرْمَلَةُ بْنُ يَحْيَى التُّجِيبِيُّ وَاللَّفْظُ لِأَبِي الطَّاهِرِ قَالَا حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَنْفَقَ زَوْجَيْنِ فِي سَبِيلِ اللَّهِ نُودِيَ فِي الْجَنَّةِ يَا عَبْدَ اللَّهِ هَذَا خَيْرٌ فَمَنْ كَانَ مِنْ أَهْلِ الصَّلَاةِ دُعِيَ مِنْ بَابِ الصَّلَاةِ وَمَنْ كَانَ مِنْ أَهْلِ الْجِهَادِ دُعِيَ مِنْ بَابِ الْجِهَادِ وَمَنْ كَانَ مِنْ أَهْلِ الصَّدَقَةِ دُعِيَ مِنْ بَابِ الصَّدَقَةِ وَمَنْ كَانَ مِنْ أَهْلِ الصِّيَامِ دُعِيَ مِنْ بَابِ الرَّيَّانِ قَالَ أَبُو بَكْرٍ الصِّدِّيقُ يَا رَسُولَ اللَّهِ مَا عَلَى أَحَدٍ يُدْعَى مِنْ تِلْكَ الْأَبْوَابِ مِنْ ضَرُورَةٍ فَهَلْ يُدْعَى أَحَدٌ مِنْ تِلْكَ الْأَبْوَابِ كُلِّهَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَعَمْ وَأَرْجُو أَنْ تَكُونَ مِنْهُمْ.",
                "headingArabic": "فَضْلِ إِخْفَاءِ الصَّدَقَةِ",
                "headingUrdu": "صدقہ چھپانے کی فضیلت",
                "headingEnglish": "The virtue of concealing (what is given in) charity",
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9936,
                "hadithNumber": "2372",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated by Zuhri through another chain of transmitters.",
                "hadithUrdu": "مجھ سے عمرو ناقد، الحسن الحلوانی اور عبد بن حمید نے بیان کیا، انہوں نے کہا: ہم سے یعقوب نے، جو ابراہیم بن سعد کے بیٹے ہیں، بیان کیا، ہم سے میرے والد نےصالح اور معمر دونوں نے زہری سے یونس کی مذکورہ بالا سند کے ساتھ اسی کی حدیث کے ہم معنی حدیث بیا ن کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنِي عَمْرٌو النَّاقِدُ وَالْحَسَنُ الْحُلْوَانِيُّ وَعَبْدُ بْنُ حُمَيْدٍ قَالُوا حَدَّثَنَا يَعْقُوبُ وَهُوَ ابْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنَا أَبِي عَنْ صَالِحٍ ح و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ كِلَاهُمَا عَنْ الزُّهْرِيِّ بِإِسْنَادِ يُونُسَ وَمَعْنَى حَدِيثِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9937,
                "hadithNumber": "2373",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who spent pairs for the sake of Allah, the guardians of Paradise would call him, (in fact) every guardian of the door (of Paradise would welcome him saying): O, so and so, come on. Upon this Abu Bakr said: Messenger of Allah, (it means) there would be no distress on this person. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said. I hope you would be among them.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جس نے اللہ کی راہ میں جوڑا جوڑا خرچ کیا ، اسے جنت کے پہرے دار بلائیں گے ، دروازے کے تمام پہر ے دار ( کہیں گے : ) اے فلاں!آجاؤ ۔ \" اس پر ابو بکر صدیق رضی اللہ تعالیٰ عنہ نے کہا : اے اللہ کے رسول صلی اللہ علیہ وسلم !ایسے فرد کو کسی قسم ( کے نقصان ) کا اندیشہ نہیں ہوگا ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" مجھے امید ہے کہ تم انھی میں سے ہو گے ۔ \"",
                "urduNarrator": "مجھ سے محمد بن رافع نے بیان کیا، کہا ہم سے محمد بن عبداللہ بن الزبیر نے بیان کیا، کہا ہم سے شیبان ح نے بیان کیا، اور مجھ سے محمد بن حاتم نے بیان کیا، اور اس کا قول یہ ہے کہ ہم سے شبابہ نے بیان کیا، مجھ سے شیبان بن عبدالرحمٰن نے یحییٰ بن ابی کثیر  کی سند سےابو سلمہ بن عبدالرحمن سے روایت ہےکہ انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے سنا ، وہ کہہ رہے تھے کہ",
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ حَدَّثَنَا شَيْبَانُ ح و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ وَاللَّفْظُ لَهُ حَدَّثَنَا شَبَابَةُ حَدَّثَنِي شَيْبَانُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَنْفَقَ زَوْجَيْنِ فِي سَبِيلِ اللَّهِ دَعَاهُ خَزَنَةُ الْجَنَّةِ كُلُّ خَزَنَةِ بَابٍ أَيْ فُلُ هَلُمَّ فَقَالَ أَبُو بَكْرٍ يَا رَسُولَ اللَّهِ ذَلِكَ الَّذِي لَا تَوَى عَلَيْهِ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي لَأَرْجُو أَنْ تَكُونَ مِنْهُمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9938,
                "hadithNumber": "2374",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Who fasted among you today? Abu Bakr رضی اللہ تعالیٰ عنہ replied: I did. He (the Prophet again) said: Who among you followed a bier today? Abu Bakr رضی اللہ تعالیٰ عنہ replied: I did. He (the Prophet again) said: Who among you fed a poor man today? Abu Bakr رضی اللہ تعالیٰ عنہ replied: I did. He (again) said: Who among you visited an invalid today? Abu Bakr رضی اللہ تعالیٰ عنہ said: I did. Upon this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Anyone in whom (these good deeds) are combined will certainly enter paradise.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" آج تم میں سے روزے دار کون ہے؟ \" ابو بکر رضی اللہ تعالیٰ عنہ نے کہا : میں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" آج تم میں سے جنازے کے ساتھ کون گیا؟ \" ابوبکر صدیق رضی اللہ تعالیٰ عنہ نے کہا : میں ، آپ نے پوچھا : \" آج تم میں سے کسی نے کسی مسکین کو کھانا کھلایا ہے؟ \" ابو بکر رضی اللہ تعالیٰ عنہ نے جواب دیا : میں نے ، آپ نے پوچھا : \" تو آج تم میں سے کسی بیمار کی تیمار داری کس نے کی؟ \" ابو بکر رضی اللہ تعالیٰ عنہ نے کہا : میں نے ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کسی انسان میں یہ نیکیاں جمع نہیں ہوتیں مگر وہ یقیناً جنت میں داخل ہوتاہے ۔ \"",
                "urduNarrator": "ہم سے ابن ابی عمر نے بیان کیا، کہا کہ ہم سے مروان نے بیان کیا، یعنی الفزاری نے، یزید کی سند سے اور وہ ابن کیسان نے، ابو حازم اشجعی نے ابوہریرہ رضی اللہ عنہ سے، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا مَرْوَانُ يَعْنِي الْفَزَارِيَّ عَنْ يَزِيدَ وَهُوَ ابْنُ كَيْسَانَ عَنْ أَبِي حَازِمٍ الْأَشْجَعِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَصْبَحَ مِنْكُمْ الْيَوْمَ صَائِمًا قَالَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ أَنَا قَالَ فَمَنْ تَبِعَ مِنْكُمْ الْيَوْمَ جَنَازَةً قَالَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ أَنَا قَالَ فَمَنْ أَطْعَمَ مِنْكُمْ الْيَوْمَ مِسْكِينًا قَالَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ أَنَا قَالَ فَمَنْ عَادَ مِنْكُمْ الْيَوْمَ مَرِيضًا قَالَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ أَنَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا اجْتَمَعْنَ فِي امْرِئٍ إِلَّا دَخَلَ الْجَنَّةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 9626,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=385",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=383",
                "label": "383",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=384",
                "label": "384",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=385",
                "label": "385",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=386",
                "label": "386",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=387",
                "label": "387",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=388",
                "label": "388",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=389",
                "label": "389",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=387",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=387",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=385",
        "to": 9650,
        "total": 40465
    }
}