{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 355,
        "data": [
            {
                "id": 9139,
                "hadithNumber": "1575",
                "englishNarrator": "Ibn 'Abbas رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah has prescribed the prayer through the word of your Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as four rak'ahs when resident, two when travelling, and one when danger is present.",
                "hadithUrdu": "اللہ تعالیٰ نے تمھارے نبی صلی اللہ علیہ وسلم کی زبان سے نماز فرض کی ، حضر ( جب مقیم ہوں ) میں چار رکعتیں ، سفر میں دو رکعتیں اور خوف ( جنگ ) میں ( امام کے ساتھ ) ایک رکعت ( پھر اس کی امامت کے بغیر ایک رکعت ) ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ، سعید بن منصور، ابو الربیع اور قتیبہ بن سعید نے بیان کیا اور دوسروں نے کہا,ابو عوانہ نے بکیر بن اخنس سے ، انھوں نے مجاہد سے ، انھوں نے حضرت ابن عباس رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَسَعِيدُ بْنُ مَنْصُورٍ وَأَبُو الرَّبِيعِ وَقُتَيْبَةُ بْنُ سَعِيدٍ قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الْآخَرُونَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ بُكَيْرِ بْنِ الْأَخْنَسِ عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍ قَالَ فَرَضَ اللَّهُ الصَّلَاةَ عَلَى لِسَانِ نَبِيِّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْحَضَرِ أَرْبَعًا وَفِي السَّفَرِ رَكْعَتَيْنِ وَفِي الْخَوْفِ رَكْعَةً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9140,
                "hadithNumber": "1576",
                "englishNarrator": "Ibn 'Abbas رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah has prescribed the prayer by the tongue of your Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as two rak'ahs for the traveller, four for the resident, and one in danger.",
                "hadithUrdu": "بے شک اللہ تعالیٰ نے تمھارے نبی صلی اللہ علیہ وسلم کی زبان سے نماز فرض کی ، مسافر پردو رکعتیں ، مقیم پر چار اور ( جنگ کے ) خوف کے عالم میں ( امام کی اقتداء میں ) ایک رکعت ( اور اقتدا کے بغیر ایک رکعت ) ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور عمرو ناقد نے قاسم بن مالک کی سند سے بیان کیا، عمرو نے کہا: ہم سے قاسم بن مالک مزنی نے بیان کیا, ایوب بن عائد طائی نے بکیر بن اخنس سے ، انھوں نے م مجاہد سے اور انھوں نے حضرت ابن عباس رضی اللہ عنہ سے حدیث بیان کی ، کہا!",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ جَمِيعًا عَنْ الْقَاسِمِ بْنِ مَالِكٍ قَالَ عَمْرٌو حَدَّثَنَا قَاسِمُ بْنُ مَالِكٍ الْمُزَنِيُّ حَدَّثَنَا أَيُّوبُ بْنُ عَائِذٍ الطَّائِيُّ عَنْ بُكَيْرِ بْنِ الْأَخْنَسِ عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍ قَالَ إِنَّ اللَّهَ فَرَضَ الصَّلَاةَ عَلَى لِسَانِ نَبِيِّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمُسَافِرِ رَكْعَتَيْنِ وَعَلَى الْمُقِيمِ أَرْبَعًا وَفِي الْخَوْفِ رَكْعَةً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9141,
                "hadithNumber": "1577",
                "englishNarrator": "Musa bin Salama Hudhali said:",
                "hadithEnglish": "I asked Ibn 'Abbas رضی اللہ عنہ : How should I say prayer when I am in Mecca, and when I do not pray along with the Imam? He said: Two rak'ahs (of prayer) is the Sunnah of Abu'l-Qasim ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌).",
                "hadithUrdu": "میں نے حضرت ابن عباس رضی اللہ عنہ سے پوچھا : جب میں مکہ میں ہوں اور امام کے ساتھ نماز نہ پڑھوں تو پھر کیسے نماز پڑھوں؟تو انھوں نے جواب دیا : دو رکعتیں ، ( یہی ) ابو القاسم صلی اللہ علیہ وسلم کی سنت ہے ۔",
                "urduNarrator": "ہم سے محمد بن المثنیٰ اور ابن بشار نے بیان کیا، کہا: ہم سے محمد بن جعفر نے بیان کیا,شعبہ نے کہا : میں نے قتادہ سے سنا ، وہ موسیٰ بن سلمہ ہذلی ( بصری ) سے حدیث بیان کررہے تھے ۔ کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ قَتَادَةَ يُحَدِّثُ عَنْ مُوسَى بْنِ سَلَمَةَ الْهُذَلِيِّ قَالَ سَأَلْتُ ابْنَ عَبَّاسٍ كَيْفَ أُصَلِّي إِذَا كُنْتُ بِمَكَّةَ إِذَا لَمْ أُصَلِّ مَعَ الْإِمَامِ فَقَالَ رَكْعَتَيْنِ سُنَّةَ أَبِي الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9142,
                "hadithNumber": "1578",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been narrated by Abu Qatada with the same chain of transmitters.",
                "hadithUrdu": "ہم سے محمد بن منہال نے بیان کیا، ہم سے یزید بن زرعی نے بیان کیا,( شعبہ کی بجائے ) سعید بن ابی عروبہ اور معاذ بن ہشام نے اپنے والد کے واسطے سے قتادہ سے ، اسی مذکورہ سند کےساتھ اسی طرح ( حدیث بیان کی ) ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَاه مُحَمَّدُ بْنُ مِنْهَالٍ الضَّرِيرُ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنَا أَبِي جَمِيعًا عَنْ قَتَادَةَ بِهَذَا الْإِسْنَادِ نَحْوَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9143,
                "hadithNumber": "1579",
                "englishNarrator": "Hafs bin 'Asim رضی اللہ عنہ said:",
                "hadithEnglish": "I accompanied Ibn 'Umar رضی اللہ عنہ on the road to Mecca and he led us in two rak'ahs at the noon prayer, then he went forward and we too went along with him to a place where he alighted, and he sat and we sat along with him, and he cast a glance to the side where he said prayer and he saw people standing and asked: What are they doing? I said: They are engaged in glorifying Allah, offering Sunnah prayer. He said: If I had done so I would have perfected my prayer; O my nephew! I accompanied the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) on a journey, and he made no addittion to two rak'ahs, till Allah called him. I accompanied Abu Bakr رضی اللہ عنہ and he made no addition to two rak'ahs till Allah caused him to die. I accompanied 'Umar and he made no addition to two rak'ahs till Allah caused him to die. I accompanied 'Uthman  رضی اللہ عنہ and he made no addition to two rak'ahs, till Allah caused him to die, and Allah has said: There is a model pattern for you in the Messenger of Allah (al-Qur'an, xxxiii. 21).",
                "hadithUrdu": "میں نے مکہ کے راستے میں حضرت ابن عمر رضی اللہ عنہ کے ساتھ سفر کیا ، انھوں نے ہمیں ظہر کی نماز دو رکعتیں پڑھائی ، پھر وہ اور ہم آگے بڑھے اور اپنی قیام گاہ پر آئے اور بیٹھ گئے ، ہم بھی ان کے ساتھ بیٹھ گئے ۔ پھر اچانک ان کی توجہ اس طرف ہوئی جہاں انھوں نے نماز پڑھی تھی ، انھوں نے ( وہاں ) لوگوں کو قیام کی حالت میں دیکھاانھوں نےپوچھا ، یہ لوگ کیا کررہے ہیں؟میں نے کہا : سنتیں پڑھ رہے ہیں ۔ انھوں نے کہا : اگر مجھے سنتیں پڑھنی ہوتیں تو میں نماز ( بھی ) پوری کرتا ( قصر نہ کرتا ) بھتیجے!میں سفر میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ رہا آپ نے دو رکعت سے زائد نماز نہ پڑھی یہاں تک کہ اللہ تعالیٰ نے آپ کو اپنے پاس بلا لیا اور میں حضرت ابو بکر رضی اللہ تعالیٰ عنہ کے ہمرا ہ رہا انھوں نے بھی دو رکعت سے زائد نماز نہ پڑھی یہاں تک کہ اللہ تعالیٰ نے انھیں بھی بلا لیا ، اور میں حضرت عمر رضی اللہ تعالیٰ عنہ کے ہمراہ رہا ، انھوں نے بھی دورکعت نما ز سے زائد نہ پڑھی ۔ یہاں تک کہ اللہ تعالیٰ نے انھیں بھی بلا لیا ۔ پھر میں عثمان رضی اللہ  عنہ کے ساتھ رہا انہوں نے بھی دو سے زائد رکعتیں نہیں پڑھیں ، یہا ں تک کہ اللہ نے انھیں بلا لیا اور اللہ تعالیٰ کا فرمان ہے : \" بے شک تمہارے لئے رسول اللہ صلی اللہ علیہ وسلم ( کے عمل ) میں بہترین نمونہ ہے ۔ \"",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ بن قعنب نے بیان کیا,عیسیٰ بن حضص بن عاصم بن عمر بن خطاب رضی اللہ عنہ نے اپنے والد ( حفص ) سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ حَدَّثَنَا عِيسَى بْنُ حَفْصِ بْنِ عَاصِمِ بْنِ عُمَرَ بْنِ الْخَطَّابِ عَنْ أَبِيهِ قَالَ صَحِبْتُ ابْنَ عُمَرَ فِي طَرِيقِ مَكَّةَ قَالَ فَصَلَّى لَنَا الظُّهْرَ رَكْعَتَيْنِ ثُمَّ أَقْبَلَ وَأَقْبَلْنَا مَعَهُ حَتَّى جَاءَ رَحْلَهُ وَجَلَسَ وَجَلَسْنَا مَعَهُ فَحَانَتْ مِنْهُ الْتِفَاتَةٌ نَحْوَ حَيْثُ صَلَّى فَرَأَى نَاسًا قِيَامًا فَقَالَ مَا يَصْنَعُ هَؤُلَاءِ قُلْتُ يُسَبِّحُونَ قَالَ لَوْ كُنْتُ مُسَبِّحًا لَأَتْمَمْتُ صَلَاتِي يَا ابْنَ أَخِي إِنِّي صَحِبْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي السَّفَرِ فَلَمْ يَزِدْ عَلَى رَكْعَتَيْنِ حَتَّى قَبَضَهُ اللَّهُ وَصَحِبْتُ أَبَا بَكْرٍ فَلَمْ يَزِدْ عَلَى رَكْعَتَيْنِ حَتَّى قَبَضَهُ اللَّهُ وَصَحِبْتُ عُمَرَ فَلَمْ يَزِدْ عَلَى رَكْعَتَيْنِ حَتَّى قَبَضَهُ اللَّهُ ثُمَّ صَحِبْتُ عُثْمَانَ فَلَمْ يَزِدْ عَلَى رَكْعَتَيْنِ حَتَّى قَبَضَهُ اللَّهُ وَقَدْ قَالَ اللَّهُ لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9144,
                "hadithNumber": "1580",
                "englishNarrator": "Hafs bin 'Asim reported:",
                "hadithEnglish": "I fell ill and lbn 'Umar رضی اللہ عنہ came to inquire after my health, and I asked him about the glorification of Allah (i. e. prayer) while travelling. Thereupon he said: I accompanied the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) on a journey but I did not see him glorifying Him, and were I to glorify (Him). I would have completed the prayer. Allah, the Exalted, has said: Verily there is a model pattern for you in the Messenger of Allah.",
                "hadithUrdu": "میں بیمار ہواتو ( عبداللہ ) بن عمر رضی اللہ عنہ میر عیادت کرنے آئےکہا : میں نے ان سے سفر میں سنتیں پڑھنے کے بارے میں سوال کیا ۔ انھوں نے کہا : میں سفر کے دوران رسول اللہ صلی اللہ علیہ وسلم کے ہمرا رہا ہوں ۔ میں نے دیکھا کہ آپ سنتیں پڑھتے ہوں ، اور اگر مجھے سنتیں پڑھنی ہوتیں تو میں نماز ہی پوری پڑھتا ۔ اللہ تعالیٰ نے فرمایا ہے : \" بے شک تمہارے لئے رسول اللہ صلی اللہ علیہ وسلم ( کے عمل ) میں بہترین نمونہ ہے ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ان سے یزید نے، یعنی ہم سے ابن زرعی نے بیان کیا،عمر بن محمد نے حفص بن عاصم سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ عَنْ عُمَرَ بْنِ مُحَمَّدٍ عَنْ حَفْصِ بْنِ عَاصِمٍ قَالَ مَرِضْتُ مَرَضًا فَجَاءَ ابْنُ عُمَرَ يَعُودُنِي قَالَ وَسَأَلْتُهُ عَنْ السُّبْحَةِ فِي السَّفَرِ فَقَالَ صَحِبْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي السَّفَرِ فَمَا رَأَيْتُهُ يُسَبِّحُ وَلَوْ كُنْتُ مُسَبِّحًا لَأَتْمَمْتُ وَقَدْ قَالَ اللَّهُ تَعَالَى لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9145,
                "hadithNumber": "1581",
                "englishNarrator": "Anas رضی اللہ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said four rak'ahs in the noon prayer while at Medina, but he offered two rak'ahs in the afternoon prayer at Dhu'l-Hulaifa.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے مدینہ میں ظہر کی چار رکعات پڑھیں اور ذوالحلیفہ میں عصر کی دو رکعتیں پڑھیں ۔",
                "urduNarrator": "ہم سے خلف بن ہشام، ابو الربیع الزہرانی اور قتیبہ بن سعید نے بیان کیا، انہوں نے کہا: ہم سے حماد نے جو ابن زید ہیں، اور ہم سے زہیر بن حرب اور یعقوب بن ابراہیم نے بیان کیا، کہا: اسماعیل نے بیان کیا۔ ہمارے لیے، ان دونوں کو، ایوب کے اختیار پر، کے اختیار پرابو قلابہ نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا خَلَفُ بْنُ هِشَامٍ وَأَبُو الرَّبِيعِ الزَّهْرَانِيُّ وَقُتَيْبَةُ بْنُ سَعِيدٍ قَالُوا حَدَّثَنَا حَمَّادٌ وَهُوَ ابْنُ زَيْدٍ ح و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ وَيَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَا حَدَّثَنَا إِسْمَعِيلُ كِلَاهُمَا عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى الظُّهْرَ بِالْمَدِينَةِ أَرْبَعًا وَصَلَّى الْعَصْرَ بِذِي الْحُلَيْفَةِ رَكْعَتَيْنِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9146,
                "hadithNumber": "1582",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ is reported to have said:",
                "hadithEnglish": "I observed four rak'ahs in the noon prayer with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) at Medina, and said two rak'ahs in the afternoon prayer at Dhu'l-Hulaifa.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ مدینہ میں ظہر کی چار رکعات پڑھیں اور آ پ کے ساتھ ذوالحلیفہ میں عصر کی دو رکعتیں پڑھیں ۔",
                "urduNarrator": "ہم سے سعید بن منصور نے بیان کیا، کہا ہم سے سفیان نے بیان کیا، محمد بن منکدر اور ابراہیم بن میسرہ دونوں نے حضرت انس بن مالک رضی اللہ عنہ سے سنا کہہ رہے تھے",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا سُفْيَانُ حَدَّثَنَا مُحَمَّدُ بْنُ الْمُنْكَدِرِ وَإِبْرَاهِيمُ بْنُ مَيْسَرَةَ سَمِعَا أَنَسَ بْنَ مَالِكٍ يَقُولُ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الظُّهْرَ بِالْمَدِينَةِ أَرْبَعًا وَصَلَّيْتُ مَعَهُ الْعَصْرَ بِذِي الْحُلَيْفَةِ رَكْعَتَيْنِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9147,
                "hadithNumber": "1583",
                "englishNarrator": "Yahya bin Yazid al-Huna'i reported:",
                "hadithEnglish": "I asked Anas bin Malik رضی اللہ عنہ about shortening of prayer. He said: When the Messenger of' Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had covered a distance of three miles or three farsakh (Shu'ba, one of the narrators, had some doubt about it) he observed two rak'ahs.",
                "hadithUrdu": "کہا میں نے حضرت انس بن مالک رضی اللہ عنہ سے نماز قصر کرنے کے بارے میں پوچھا توانھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم جب تین میل یا تین فرسخ کی مسافت پر نکلتے ۔ مسافت کے بارے میں شک کرنے والے شعبہ ہیں ۔ تو دو رکعت نماز پڑھتے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور محمد بن بشار نے بیان کیا، ان دونوں نے غندر کی سند سے کہا: ہم سے محمد بن جعفر غندر نے بیان کیا,شعبہ نے یحییٰ بن یزید ہنائی سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ بَشَّارٍ كِلَاهُمَا عَنْ غُنْدَرٍ قَالَ أَبُو بَكْرٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ غُنْدَرٌ عَنْ شُعْبَةَ عَنْ يَحْيَى بْنِ يَزِيدَ الْهُنَائِيِّ قَالَ سَأَلْتُ أَنَسَ بْنَ مَالِكٍ عَنْ قَصْرِ الصَّلَاةِ فَقَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا خَرَجَ مَسِيرَةَ ثَلَاثَةِ أَمْيَالٍ أَوْ ثَلَاثَةِ فَرَاسِخَ شُعْبَةُ الشَّاكُّ صَلَّى رَكْعَتَيْنِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9148,
                "hadithNumber": "1584",
                "englishNarrator": "Jubair bin Nufair reported:",
                "hadithEnglish": "I went along with Shurahbil bin al-Simt to a village which was situated at a distance of seventeen or eighteen miles, and he said only two rak'ahs of prayer. I said to him (about it) and he said: I saw 'Umar رضی اللہ عنہ observing two rak'ahs at Dhu'l-Hulaifa and I (too) said to him (about it) and he said: I am doing the same as I saw the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) doing.",
                "hadithUrdu": "می شرجیل بن سمط ( الکندی ) کی معیت میں ایک بستی کو گیا جو سترہ یا اٹھارہ میل کے فاصلے پر تھی تو انھوں نے دو رکعت نماز پڑھی ، میں نے ان سے پوچھا ، انھوں نے جواب دیا : میں نے حضرت عمر رضی اللہ عنہ کو ذوالحلیفہ میں دو رکعت پڑھتے دیکھا ہے ، تو میں نے ان ( حضرت عمر رضی اللہ تعالیٰ عنہ ) سے پوچھا ، انھوں نے جواب دیا : میں اسی طرح کرتا ہوں جس طرح میں نے رسول اللہ صلی اللہ علیہ وسلم کو کرتے دیکھا ہے ۔",
                "urduNarrator": "ہم سے زہیر بن حرب اور محمد بن بشار نے بیان کیا، ہم سے ابن مہدی نے بیان کیا,عبدالرحمان بن مہدی ، نے حدیث بیان کی کہا : ہمیں شعبہ نے یزید بن خمیر سے حدیث سنائی ۔ انہوں نے حبیب بن عبید سے انھوں نے جبیر بن نفیر سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَمُحَمَّدُ بْنُ بَشَّارٍ جَمِيعًا عَنْ ابْنِ مَهْدِيٍّ قَالَ زُهَيْرٌ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا شُعْبَةُ عَنْ يَزِيدَ بْنِ خُمَيْرٍ عَنْ حَبِيبِ بْنِ عُبَيْدٍ عَنْ جُبَيْرِ بْنِ نُفَيْرٍ قَالَ خَرَجْتُ مَعَ شُرَحْبِيلَ بْنِ السِّمْطِ إِلَى قَرْيَةٍ عَلَى رَأْسِ سَبْعَةَ عَشَرَ أَوْ ثَمَانِيَةَ عَشَرَ مِيلًا فَصَلَّى رَكْعَتَيْنِ فَقُلْتُ لَهُ فَقَالَ رَأَيْتُ عُمَرَ صَلَّى بِذِي الْحُلَيْفَةِ رَكْعَتَيْنِ فَقُلْتُ لَهُ فَقَالَ إِنَّمَا أَفْعَلُ كَمَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَفْعَلُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9149,
                "hadithNumber": "1585",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been transmitted by Shu'ba with the same chain of narrators and it is narrated from Simt, and the name of Shurahbil has not been mentioned, and he said that he had gone to a place called Dumin, situated at a distance of eighteen miles from Hims.",
                "hadithUrdu": "مجھ سے محمد بن المثنیٰ نے بیان کیا, محمد بن جعفر نے کہا : ہمیں شعبہ نے اسی سند کے ساتھ یہ حدیث بیان کی اور کہا : ابن سمط سے روایت ہے اور انھوں نے شرجیل کا نام لیا اور کہا : وہ حمص کی دومین نامی جگہ پر پہنچے جو اٹھارہ میل کے فاصلے پر تھی ( اور وہاں نماز قصر پڑھی ) ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنِيهِ مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ بِهَذَا الْإِسْنَادِ وَقَالَ عَنْ ابْنِ السِّمْطِ وَلَمْ يُسَمِّ شُرَحْبِيلَ وَقَالَ إِنَّهُ أَتَى أَرْضًا يُقَالُ لَهَا دُومِينَ مِنْ حِمْصَ عَلَى رَأْسِ ثَمَانِيَةَ عَشَرَ مِيلًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9150,
                "hadithNumber": "1586",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "We went out from Medina to Mecca with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and he prayed two rak'ahs at each time of prayer till we returned to Medina. I said: For how long did he stay in Mecca? He said: (For) ten (days).",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ مدینہ سے مکہ جانے کے لئے نکلے تو آپ دو رکعت نماز پڑھتے رہے یہاں تک کہ مدینہ واپس پہنچ گئے ۔ راوی نے حضرت انس رضی اللہ عنہ سے پوچھا : آپ مکہ کتنا عرصہ ٹھرے؟انھوں نے جواب دیا : دس دن ( آپ صلی اللہ علیہ وسلم نے حجۃ الوداع کے موقع پر مکہ آکر خود مکہ ، منیٰ ، عرفات اور مزدلفۃ مختلف مقامات پردس دن گزارے ۔ )",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ التمیمی نے بیان کیا,ہشیم نے یحییٰ بن ابی اسحاق سے ، انھوں نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ أَخْبَرَنَا هُشَيْمٌ عَنْ يَحْيَى بْنِ أَبِي إِسْحَقَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْمَدِينَةِ إِلَى مَكَّةَ فَصَلَّى رَكْعَتَيْنِ رَكْعَتَيْنِ حَتَّى رَجَعَ قُلْتُ كَمْ أَقَامَ بِمَكَّةَ قَالَ عَشْرًاَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9151,
                "hadithNumber": "1587",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been narrated by Anas رضی اللہ عنہ by another chain of transmitters.",
                "hadithUrdu": "ہم سے قتیبہ نے بیان کیا, ابو عوانہ اور ( اسماعیل ) ابن علیہ نے یحییٰ بن ابی اسحاق سے انھو ں نے حضرت انس رضی اللہ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے ہشیم کی حدیث کے مانند حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَاه قُتَيْبَةُ حَدَّثَنَا أَبُو عَوَانَةَ ح و حَدَّثَنَاه أَبُو كُرَيْبٍ حَدَّثَنَا ابْنُ عُلَيَّةَ جَمِيعًا عَنْ يَحْيَى بْنِ أَبِي إِسْحَقَ عَنْ أَنَسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ هُشَيْمٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9152,
                "hadithNumber": "1588",
                "englishNarrator": "Yahya bin Abu Ishaq reported:",
                "hadithEnglish": "I heard Anas bin Malik رضی اللہ عنہ say: We went out for Pilgrimage from Medina. The rest is the same.",
                "hadithUrdu": "میں نےحضرت انس بن مالک رضی اللہ عنہ سے سنا ، وہ بیان کرتے تھے کہ ہم حج کے لئے مدینہ سے چلے ۔ ۔ ۔ پھر مذکورہ بالا روایت بیان کی ۔",
                "urduNarrator": "ہم سے عبید اللہ بن معاذ نے بیان کیا، ہم سے میرے والد نے بیان کیا,شعبہ نے کہا : مجھے یحییٰ بن ابی اسحاق نے حدیث سنائی ، کہا",
                "hadithArabic": "و حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ قَالَ حَدَّثَنِي يَحْيَى بْنُ أَبِي إِسْحَقَ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُ خَرَجْنَا مِنْ الْمَدِينَةِ إِلَى الْحَجِّ ثُمَّ ذَكَرَ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9153,
                "hadithNumber": "1589",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been transmitted by Anas رضی اللہ عنہ, but no mention has been made of Pilgrimage.",
                "hadithUrdu": "ہم سے ابن نمیر نے بیان کیا، کہا ہم سے ابو ایچ نے بیان کیا، کہا ہم سے ابو کریب نے بیان کیا، ہم سے ابو اسامہ نے بیان کیا,( سفیان ) ثوری نے یحییٰ بن ابی اسحاق سے ، انھوں نے حضرت انس رضی اللہ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے اسی سابقہ حدیث کے مانند حدیث وروایت کی اور ( اس میں ) حج کاتذکرہ نہیں کیا ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي ح و حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو أُسَامَةَ جَمِيعًا عَنْ الثَّوْرِيِّ عَنْ يَحْيَى بْنِ أَبِي إِسْحَقَ عَنْ أَنَسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ وَلَمْ يَذْكُرْ الْحَجّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9154,
                "hadithNumber": "1590",
                "englishNarrator": "Salim bin 'Abdullah (bin 'Umar) reported on the authority of his father:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) observed the prayer of a traveller, i. e. two rak'ahs in Mina, and other places; so did Abu Bakr and 'Umar رضی اللہ عنہ , and 'Uthman رضی اللہ عنہ too observed two rak'ahs at the beginning of his caliphate, but he then completed four.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے منیٰ اور دوسری جگہوں ، یعنی اس کے نواح میں اور ( آپ صلی اللہ علیہ وسلم کے بعد ) حضرت ابو بکر اورحضرت عمر رضی اللہ عنہ نے مسافر کی نماز ، یعنی دو رکعتیں پڑھیں ۔ اورعثمان رضی اللہ تعالیٰ عنہ نے بھی اپنی خلافت کے ابتدائی سالوں میں دو رکعتیں پڑھیں ، بعد میں پوری چار پڑھنے لگے ۔",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، مجھ سے ابن وہب نے بیان کیا، انہوں نے کہاعمرو بن حارث نے ابن شہاب سے ، انھوں نے سالم بن عبداللہ ( بن عمر ) سے ، انھوں نے اپنے والد ( حضرت عبداللہ بن عمر رضی اللہ عنہ ) سے اور ا نھوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو وَهُوَ ابْنُ الْحَارِثِ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ صَلَّى صَلَاةَ الْمُسَافِرِ بِمِنًى وَغَيْرِهِ رَكْعَتَيْنِ وَأَبُو بَكْرٍ وَعُمَرُ وَعُثْمَانُ رَكْعَتَيْنِ صَدْرًا مِنْ خِلَافَتِهِ ثُمَّ أَتَمَّهَا أَرْبَعًا.",
                "headingArabic": "قَصْرِ الصَّلاَةِ بِمِنًى ‏‏",
                "headingUrdu": "منیٰ میں نماز قصر کرنا",
                "headingEnglish": "Shortening the prayer in Mina",
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9155,
                "hadithNumber": "1591",
                "englishNarrator": "It was narrted from Az-Zuhri with this chain (a similar hadith as no. 1590).",
                "hadithEnglish": "He said: in \"Mina,\" he did not say: \"elsewhere.",
                "hadithUrdu": "انھوں نے \" منیٰ میں \" کہا اور \" دوسری جگہوں \" کے الفاظ نہیں کہے ۔",
                "urduNarrator": "ہم سے زہیر بن حرب نے بیان کیا، کہا ہم سے ولید بن مسلم نے بیان کیا، انہیں اوزاعی اور معمر نے ( اپنی اپنی سند سے روایت کرتے ہوئے ) زہری سے باقی ماندہ اسی سند کے ساتھ یہی حدیث روایت کی",
                "hadithArabic": "و حَدَّثَنَاه زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ عَنْ الْأَوْزَاعِيِّ ح و حَدَّثَنَاه إِسْحَقُ وَعَبْدُ بْنُ حُمَيْدٍ قَالَا أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ جَمِيعًا عَنْ الزُّهْرِيِّ بِهَذَا الْإِسْنَادِ قَالَ بِمِنًى وَلَمْ يَقُلْ وَغَيْرِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9156,
                "hadithNumber": "1592",
                "englishNarrator": "Ibn 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said two rak'ahs at Mina, and Abu Bakr after him, and 'Umar رضی اللہ عنہ after Abu Bakr رضی اللہ عنہ , and 'Uthman رضی اللہ عنہ at the beginning of his caliphate; then 'Uthman رضی اللہ عنہ observed four rak'ahs, and when Ibn 'Umar prayed with the Imam, he said four rak'ahs, but when he observed prayer alone, he said two rak'ahs.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے منیٰ میں دو رکعتیں پڑھیں ، آپ کے بعد حضرت ابو بکر رضی اللہ تعالیٰ عنہ نے اور حضرت ابو بکر رضی اللہ تعالیٰ عنہ کے بعد حضرت عمر رضی اللہ تعالیٰ عنہ نے اور حضرت عثمان رضی اللہ تعالیٰ عنہ نے اپنی خلافت کے ابتدائی سالوں میں ( دورکعتیں پڑھیں ) پھر عثمان رضی اللہ تعالیٰ عنہ نے اس کے بعد چار رکعتیں پڑھیں ۔ اس لئے حضرت ابن عمر رضی اللہ تعالیٰ عنہ جب امام کے ساتھ نماز پڑھتے تو چار رکعات پڑھتے اور جب اکیلے پڑھتے تو وہ رکعتیں پڑھتے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, ابو اسامہ نے کہا : ہمیں عبیداللہ بن عمر نے نافع سے حدیث سنائی ، انھوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِنًى رَكْعَتَيْنِ وَأَبُو بَكْرٍ بَعْدَهُ وَعُمَرُ بَعْدَ أَبِي بَكْرٍ وَعُثْمَانُ صَدْرًا مِنْ خِلَافَتِهِ ثُمَّ إِنَّ عُثْمَانَ صَلَّى بَعْدُ أَرْبَعًا فَكَانَ ابْنُ عُمَرَ إِذَا صَلَّى مَعَ الْإِمَامِ صَلَّى أَرْبَعًا وَإِذَا صَلَّاهَا وَحْدَهُ صَلَّى رَكْعَتَيْنِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9157,
                "hadithNumber": "1593",
                "englishNarrator": null,
                "hadithEnglish": "A similar report (as no. 1592) was narrated from 'Ubaidullah with this chin.\r\nhadith like this has been narrated by the same chain of transmitters.",
                "hadithUrdu": "ہم سے ابن المثنی اور عبید اللہ بن سعید نے بیان کیا، کہا: ہم سے بیان کیا, یحییٰ قطان ، ابن ابی زائدہ اور عقبہ بن خالد نے عبیداللہ سے اسی سند کے ساتھ اسی طرح روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَاه ابْنُ الْمُثَنَّى وَعُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَا حَدَّثَنَا يَحْيَى وَهُوَ الْقَطَّانُ ح و حَدَّثَنَاه أَبُو كُرَيْبٍ أَخْبَرَنَا ابْنُ أَبِي زَائِدَةَ ح و حَدَّثَنَاه ابْنُ نُمَيْرٍ حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ كُلُّهُمْ عَنْ عُبَيْدِ اللَّهِ بِهَذَا الْإِسْنَادِ نَحْوَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9158,
                "hadithNumber": "1594",
                "englishNarrator": "Ibn 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said in Mina the prayer of a traveller (short prayer) ; Abu Bakr and 'Umar did the same and 'Uthmia did it for eight years or six years. Hafs (one of the narrators) said: Ibn 'Umar رضی اللہ عنہ would also say two rak'ahs at Mina and then go to bed. I said to him: O uncle, I wish you could have said two rak'ahs (of Sunnah prayer after shorenting the Fard prayer). He said: Were I to do that, I would have completed the prayer.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم ابو بکر ، عمر ، اور عثمان ، رضوان اللہ عنھم اجمعین نے ( پہلے ) آٹھ سال یا کہا : چھ سال ۔ ۔ ۔ منیٰ میں مسافر والی نماز پڑھی ۔ حفص نے کہا : ابن عمر رضی اللہ تعالیٰ عنہ منیٰ میں دو رکعت نماز پڑھتے تھے ۔ پھر اپنے بستر پر آجاتے تھے ۔ میں نے کہا : چچا جان! اگر آپ فرض نماز کے بعددوسنتیں بھی پڑھ لیا کریں! تو انھوں نے کہا : اگر میں ایسا کروں تو ( گویا ) پوری نماز پڑھوں ۔",
                "urduNarrator": "عبیداللہ بن معاذ نے حدیث بیان کی ، کہا : میرے والد نے ہمیں حدیث سنائی ، کہا : ہمیں شعبہ نے خبیب بن عبدالرحمان سے حدیث سنائی ، انھوں نے حفص بن عاصم سے سنا ، انھوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ سَمِعَ حَفْصَ بْنَ عَاصِمٍ عَنْ ابْنِ عُمَرَ قَالَ صَلَّى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِنًى صَلَاةَ الْمُسَافِرِ وَأَبُو بَكْرٍ وَعُمَرُ وَعُثْمَانُ ثَمَانِيَ سِنِينَ أَوْ قَالَ سِتَّ سِنِينَ قَالَ حَفْصٌ وَكَانَ ابْنُ عُمَرَ يُصَلِّي بِمِنًى رَكْعَتَيْنِ ثُمَّ يَأْتِي فِرَاشَهُ فَقُلْتُ أَيْ عَمِّ لَوْ صَلَّيْتَ بَعْدَهَا رَكْعَتَيْنِ قَالَ لَوْ فَعَلْتُ لَأَتْمَمْتُ الصَّلَاةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9159,
                "hadithNumber": "1595",
                "englishNarrator": "This hadith has been narrated by Shu'ba with the same chain of transmitters but no mention has been made of Mina, but they (the narrators) only said:",
                "hadithEnglish": "He prayed while travelling.",
                "hadithUrdu": "آپ نے سفر میں نماز پڑھی۔",
                "urduNarrator": "اور ہم سے یحییٰ بن حبیب نے بیان کیا، کہا ہم سے خالد نے بیان کیا، یعنی ابن حارث نے اور ہم سے ابن المثنیٰ نے بیان کیا، انہوں نے کہا کہ مجھ سے عبد الصمد نے بیان کیا، انہوں نے کہا کہ ہم سے شعبہ رضی اللہ عنہ نے اس سلسلہ کے بارے میں بیان کیا۔ انہوں نے حدیث میں منیٰ میں یہ نہیں کہا کہ",
                "hadithArabic": "و حَدَّثَنَاه يَحْيَى بْنُ حَبِيبٍ حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ ح و حَدَّثَنَا ابْنُ الْمُثَنَّى قَالَ حَدَّثَنِي عَبْدُ الصَّمَدِ قَالَا حَدَّثَنَا شُعْبَةُ بِهَذَا الْإِسْنَادِ وَلَمْ يَقُولَا فِي الْحَدِيثِ بِمِنًى وَلَكِنْ قَالَا صَلَّى فِي السَّفَرِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9160,
                "hadithNumber": "1596",
                "englishNarrator": "Ibrahim reported:",
                "hadithEnglish": "I heard 'Abdul-Rahman as saying; 'Uthman رضی اللہ عنہ led us four rak'ahs of prayer at Mina. It was reported to Abdullah bin Mas'ud رضی اللہ عنہ and he recited: Surely we are Allah's and to Him shall we return, and then said: I prayed with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) at Mina two rak'ahs of prayer. I prayed along with Abu Bakr al-Siddiq two rak'ahs of prayer at Mina. I prayed along with 'Umar bin Khattab رضی اللہ عنہ two rak'ahs of prayer at Mina. I wish I had my share of the two rak'ahs acceptable (to God) for the four rak'ahs.",
                "hadithUrdu": "میں نے عبدالرحمان بن یزید سے سنا ، کہہ رہے تھے : حضرت عثمان رضی اللہ عنہ نے ہمیں منیٰ میں چار رکعات پڑھائیں ، یہ بات عبداللہ بن مسعود رضی اللہ عنہ کو بتائی گئی تو انھوں نے انا للہ وانا الیہ راجعون پڑھا پھر کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ منیٰ میں دو رکعات نما ز پڑھی ، ابو بکر رضی اللہ تعالیٰ عنہ کے ساتھ منیٰ میں دو رکعات نماز پڑھی ۔ اور عمر بن خطاب رضی اللہ عنہ کےساتھ منیٰ میں دو رکعات نماز پڑھی ، کاش! میرے نصیب میں چار رکعات کے بدلے شرف قبولیت حاصل کرنے والی دو رکعتیں ہوں ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, عبدالواحد نے اعمش سے حدیث بیان کی ، کہا : ہمیں ابراہیم نے حدیث سنائی ، کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا عَبْدُ الْوَاحِدِ عَنْ الْأَعْمَشِ حَدَّثَنَا إِبْرَاهِيمُ قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ يَزِيدَ يَقُولُ صَلَّى بِنَا عُثْمَانُ بِمِنًى أَرْبَعَ رَكَعَاتٍ فَقِيلَ ذَلِكَ لِعَبْدِ اللَّهِ بْنِ مَسْعُودٍ فَاسْتَرْجَعَ ثُمَّ قَالَ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِنًى رَكْعَتَيْنِ وَصَلَّيْتُ مَعَ أَبِي بَكْرٍ الصِّدِّيقِ بِمِنًى رَكْعَتَيْنِ وَصَلَّيْتُ مَعَ عُمَرَ بْنِ الْخَطَّابِ بِمِنًى رَكْعَتَيْنِ فَلَيْتَ حَظِّي مِنْ أَرْبَعِ رَكَعَاتٍ رَكْعَتَانِ مُتَقَبَّلَتَانِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9161,
                "hadithNumber": "1597",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been reported by A'mash with the same chain of transmitters.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، کہا ہم سے انہوں نے بیان کیا, ابو معاویہ ، جریر اور عیسیٰ سب نے ( مختلف سندوں سے روایت کرتے ہوئے ) اعمش سے اسی سند کے ساتھ اسی طرح حدیث بیان کی ہے ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ ح و حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ قَالَ حَدَّثَنَا جَرِيرٌ ح و حَدَّثَنَا إِسْحَقُ وَابْنُ خَشْرَمٍ قَالَا أَخْبَرَنَا عِيسَى كُلُّهُمْ عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ نَحْوَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9162,
                "hadithNumber": "1598",
                "englishNarrator": "Haritha bin Wahb رضی اللہ عنہ reported:",
                "hadithEnglish": "I prayed with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) two rak'ahs and most of them offered two rak'ahs only in Mina, while the people felt secure.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ منیٰ میں دو رکعات نماز پڑھی ، ( جب ) لوگ سب سے زیادہ امن میں اور کثیر تعداد میں تھے ۔ ( یہ اللہ کی رخصت کو قبول کرنے کا معاملہ تھا ، خوف ، بدامنی یا جنگ کا معاملہ نہ تھا ۔ )",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ اور قتیبہ نے بیان کیا، کہا ہم سے قتیبہ نے بیان کیا,ابو احوص نے ابو اسحاق سے اور انھوں نے حضرت حارثہ بن وہب رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَقُتَيْبَةُ قَالَ يَحْيَى أَخْبَرَنَا و قَالَ قُتَيْبَةُ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ حَارِثَةَ بْنِ وَهْبٍ قَالَ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِنًى آمَنَ مَا كَانَ النَّاسُ وَأَكْثَرَهُ رَكْعَتَيْنِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9163,
                "hadithNumber": "1599",
                "englishNarrator": "Wahb al-Khuza'i رضی اللہ عنہ reported:",
                "hadithEnglish": "I prayed behind the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) at Mina, and there was the greatest number of people, and they prayed two rak'ahs on the occasion of the Farewell Pilgrimage. (Muslim said: Haritha bin Wahb al-Khuza'i رضی اللہ عنہ is the brother of 'Ubaidullah bin 'Umar son of Khattab رضی اللہ عنہ from the side of his mother.)",
                "hadithUrdu": "میں نے منیٰ میں رسول اللہ صلی اللہ علیہ وسلم کی اقتداء میں نماز پڑھی جبکہ لوگ ( تعداد میں ) جتنے زیادہ ہوسکتے تھے ( موجود تھے ) آپ نے حجۃ الوداع کے موقع پر دو رکعت نماز پڑھائی ۔ امام مسلم ؒ نے کہا : حارثہ بن وہب خزاعی رضی اللہ عنہ ماں ( ملیکہ بنت جرول الخزاعیہ ) کی طرف سے عبیداللہ بن عمر بن خطاب رضی اللہ عنہ کے بھائی تھے ۔",
                "urduNarrator": "ہم سے احمد بن عبداللہ بن یونس نے بیان کیا, زہیر نے حدیث بیان کی ، کہا : ہمیں ابو اسحاق نے حدیث سنائی ، کہا ، مجھ سے حارثہ بن وہب خزاعی رضی اللہ عنہ نے حدیث بیان کی کہا",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا أَبُو إِسْحَقَ حَدَّثَنِي حَارِثَةُ بْنُ وَهْبٍ الْخُزَاعِيُّ قَالَ صَلَّيْتُ خَلْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِنًى وَالنَّاسُ أَكْثَرُ مَا كَانُوا فَصَلَّى رَكْعَتَيْنِ فِي حَجَّةِ الْوَدَاعِ قَالَ مُسْلِم حَارِثَةُ بْنُ وَهْبٍ الْخُزَاعِيُّ هُوَ أَخُو عُبَيْدِ اللَّهِ بْنِ عُمَرَ بْنِ الْخَطَّابِ لِأُمِّهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 8851,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=354",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=352",
                "label": "352",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=353",
                "label": "353",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=354",
                "label": "354",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=355",
                "label": "355",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=356",
                "label": "356",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=357",
                "label": "357",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=358",
                "label": "358",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=356",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=356",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=354",
        "to": 8875,
        "total": 40465
    }
}