{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 311,
        "data": [
            {
                "id": 8039,
                "hadithNumber": "475",
                "englishNarrator": "Anas bin Malik رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Allah would gather people on the Day of Resurrection and they would be concerned about it, and Ibn Ubaid said. They would get a Divine inspiration about it, and would say: If we could seek intercession with our Lord, we may be relieved from this predicament of ours. He (the Holy Prophet  ﷺ) said: They would come to Adam andsay, Thou art Adam, the father of mankind. Allah created thee with His own hand and breathed unto thee of His Spirit and commanded the angels and they prostrated before thee. So intercede for us with thy Lords, that He may relieve us from this position of ours. He would say: I am not in a position to do this, and would recall his error, and would fight shy of his Lord on account of that; go to Noah the first messenger (after me) sent by Allah. He (the Holy Prophet  ﷺ) said: So they would come to Noah (peace be upon him). He would say: I am not in a position to do that for you, and recall his fault which he had committed, and would fight shy of his Lord on account of that, (and would say): You better go to Ibrahim (peace be upon him) whom Allah took for a friend. They would come to Ibrahim (peace be upon him) and he would say: I am not in a position to do that for you, and would recall his fault that he had committed and would, therefore, fight shy of his Lord on that account (and would say): You better go to Moses (peace be upon him) with whom Allah conversed and con- ferred Torah upon him. He (the Holy Prophet) said: So they would come to Moses (peace be upon him) He would say: I am not in a position to do that for you, and would recall his fault that he had committed and would fight shy of his Lord on account of that (and would say): You better go to Jesus, the Spirit of Allah and His word He would say: I am not in a position to do that for you; you better go to Muhammad ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), a servant whose former and later sins have been forgiven. He (the narrator) said: The Messenger or Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) observed: So they would come to me and I would ask the permission of my Lord and it would be granted to me, and when I would see Him, I would fall down in prostration, and He (Allah) would leave me thus as long as He would wish, and then it would be said: O Muhammad, raise your head, say and you would be heard; ask and it would be granted; intercede and intercession would be accepted. Then I would raise my head and extrol my Lord with the praise which my Lord would teach me. I shall then inter- cede, but a limit would be set for me I would bring them out from the Fire and make them enter Paradise (according to the limit). I shall return then ard fall down in pros- tration and Allah would leave me (in that position) as long as He would wish to leave me it would be said: Rise, O Muhammad, say and you would be heard; ask and it would be conferred; intercede and intercession would be granted. I would raise my head and extrol my Lord with praise that He would teach me. I would theft intercede and a limit would be set for me. I would bring them out of the Fire (of Hell) and make them enter Paradise. He (the narrator) said: I do not remember whether he (the Holy Prophet) said at tLe third time or at the fourth time: O my Lord, none has been left in the Fire, but thise restrained by the Holy Qur'an, i e. those who were eternally doomed. Ibn Ubaid said in a narration: Qatada observed: whose everlasting stay was imperative .",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’اللہ تعالیٰ قیامت کے دن لوگوں کو جمع کرے گا اور وہ اس بات پر فکر مند ہوں گے ( کہ اس دن کی سختیوں سے کیسے نجات پائی جائے؟ ) ( ابن عبید نے کہا : ان کے دل میں یہ بات ڈالی جائے گی ) او ر وہ کہیں گے : اگر ہم اپنے رب کے حضور کوئی سفارش لائیں تاکہ وہ ہمیں اس جگہ ( کی سختیوں ) سے راحت عطا کر دے ۔ آپ نے فرمایا : چنانچہ وہ آدم علیہ السلام کے پاس آئیں گے اورکہیں گے : آپ آدم ہیں ، تمام مخلوق کے والد ، اللہ تعالیٰ نے آپ کو اپنے ہاتھ سے پیدا کیا اور آپ میں اپنی روح پھونکی اور فرشتوں کو حکم دیا تو انہوں نے آپ کو سجدہ کیا ، آپ ہمارے لیے اپنے رب کے حضور سفارش فرمائیں کہ وہ ہمیں اس ( اذیت ناک ) جگہ سے راحت دے ۔ وہ جواب دیں گے : میں اس مقام پر نہیں ، پھر وہ اپنی غلطی کو ، جو ان سے ہو گئی تھی ، یاد کر کے اس کی وجہ سے اپنےرب سے شرمندگی محسوس کریں گے ، ( اور کہیں گے : ) لیکن تم نوح ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے پاس جاؤ ، وہ پہلے رسول ہیں جنہیں اللہ تعالیٰ نے ( لوگوں کی طرف ) مبعوث فرمایا ، آپ نے فرمایا : تو اس پر لوگ نوح ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے پاس آئیں گے ۔ وہ کہیں گے : یہ میرا مقام نہیں اور وہ اپنی غلطی کو ، جس کا ارتکاب ان سے ہو گیا تھا ، یادکرکے اس پر اپنے رب کی شرمندگی محسوس کریں گے ، ( اور کہیں گے : ) لیکن تم ابراہیم علیہ السلام کے پاس جاؤ جنہیں اللہ تعالیٰ نے اپنا خلیل ( خالص دوست ) بنایا ہے ۔ وہ ابراہیم علیہ السلام کے پاس آئیں گے تو وہ کہیں گے : یہ میرا مقام نہیں ہے اور وہ اپنی غلطی کو یادکریں گےجو ان سے سرزد ہو گئی تھی اور اس پر اپنے رب سے شرمندہ ہوں گے ، ( اور کہیں گے : ) لیکن تم موسیٰ ‌علیہ ‌السلام ‌ کے پاس جاؤ جن سے اللہ تعالیٰ نےکلام کیا اور انہیں تورات عنایت کی ۔ لوگ موسیٰ ‌علیہ ‌السلام ‌ کی خدمت میں حاضر ہوں گے ، وہ کہیں گے کہ میں اس مقام پر نہیں اور اپنی غلطی کو ، جو ان سے ہو گئی تھی ، یاد کر کے اس پر اپنے رب سے شرمندگی محسوس کریں گے ( او رکہیں گے : ) لیکن تم روح اللہ اور اس کے کلمے عیسیٰ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے پاس جاؤ ۔ لوگ روح اللہ اور اس کے کلمے عیسیٰ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کےپاس آئیں گے ۔ وہ ( بھی یہ ) کہیں گے : یہ میرا مقام نہیں ہے ، تم محمدﷺ کے پاس جاؤ ، وہ ایسے برگزیدہ عبد ( بندت ) ہیں جس کے اگلے پچھلے گناہ ( اگر ہوتے تو بھی ) معاف کیے جا چکے ۔ ‘ ‘ حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : رسو ل اللہ ﷺ نے فرمایا : ’’ پھر وہ میرے پاس آئیں گے ، میں اپنے رب ( کے پاس حاضری ) کی اجازت چاہوں گا تو مجھے اجازت دی جائے گی ، اسے دیکھتے ہی میں سجدے میں گر جاؤں گا ، تو جب تک اللہ چاہے گا مجھے اس حالت ( سجدہ ) میں رہنے دے گا ۔ پھر کہا جائے گا : اے محمد! اپنا سر اٹھائیے ، کہیے : آپ کی بات سنی جائے گی ، مانگیے ، آپ کودیاجائے گا ، سفارش کیجیے ، آپ کی سفارش قبول کی جائے گی ۔ میں اپنا سر اٹھاؤں گا اور اپنے رب تعالیٰ کی ایسی حمد وستائش بیان کروں گا جو میرا رب عز وجل خود مجھے سکھائے گا ، پھر میں سفارش کروں گا ۔ وہ میرے لیے حد مقرر کر دے گا ، میں ( اس کے مطابق ) لوگوں کو آگ سے نکال کر جنت میں داخل کروں گا ، پھر میں واپس آکر سجدے میں گر جاؤں گا ۔ اللہ تعالیٰ جب تک چاہے گا مجھے اسی حالت میں رہنے دے گا ، پھر کہا جائے گا : اپنا سر اٹھائیے ، اے محمدﷺ!کہیے : آپ کی بات سنی جائے گی ، مانگیے ، آپ کو ملے گا ، سفارش کیجیے آپ کی سفارش قبول کی جائے گی ۔ میں اپنا سر اٹھاؤں گا اور اپنے رب کی وہ حمد کروں گا جومیرا رب مجھے سکھائے گا ، پھر میں سفارش کروں گا تووہ میرے لیے پھر ایک حد مقرر فرما دےگا ، میں ان کو دوزخ سے نکالوں گا اور جنت میں داخل کروں گا ۔ ‘ ‘ ( حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ نےکہا : مجھے یاد نہیں ، آپ نے تیسری یا چوتھی بار فرمایا ) پھر میں کہوں گا : ’’اےمیرے رب! آگ میں ان کے سوا اور کوئی باقی نہیں بچا جنہیں قرآن نے روک لیا ہے ، یعنی جن کا ( دوزخ میں ) ہمیشہ رہنا ( اللہ کی طرف سے ) لازمی ہو گیا ہے ۔ ‘ ‘ ابن عبید نےاپنی روایت میں کہا : قتادہ نے کہا : یعنی جس کا ہمیشہ رہنا لازمی ہو گیا ۔",
                "urduNarrator": "ابو کامل فضیل بن حسین جحدری اور محمد بن عبید غبری نے کہا : ( الفاظ ابو کامل کے ہیں ) ہمیں ابو عوانہ نے قتادہ سےحدیث سنائی ، انہوں نے حضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نےکہاکہ",
                "hadithArabic": "حَدَّثَنَا أَبُو كَامِلٍ فُضَيْلُ بْنُ حُسَيْنٍ الْجَحْدَرِيُّ، وَمُحَمَّدُ بْنُ عُبَيْدٍ الْغُبَرِيُّ - وَاللَّفْظُ لِأَبِي كَامِلٍ - قَالَ: حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: يَجْمَعُ اللهُ النَّاسَ يَوْمَ الْقِيَامَةِ فَيَهْتَمُّونَ لِذَلِكَ - وَقَالَ ابْنُ عُبَيْدٍ: فَيُلْهَمُونَ لِذَلِكَ - فَيَقُولُونَ: لَوْ اسْتَشْفَعْنَا عَلَى رَبِّنَا حَتَّى يُرِيحَنَا مِنْ مَكَانِنَا هَذَا، قَالَ: فَيَأْتُونَ آدَمَ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَيَقُولُونَ: أَنْتَ آدَمُ، أَبُو الْخَلْقِ، خَلَقَكَ اللهُ بِيَدِهِ، وَنَفَخَ فِيكَ مِنْ رُوحِهِ، وَأَمَرَ الْمَلَائِكَةَ فَسَجَدُوا لَكَ، اشْفَعْ لَنَا عِنْدَ رَبِّكَ حَتَّى يُرِيحَنَا مِنْ مَكَانِنَا هَذَا، فَيَقُولُ: لَسْتُ هُنَاكُمْ، فَيَذْكُرُ خَطِيئَتَهُ الَّتِي أَصَابَ، فَيَسْتَحْيِي رَبَّهُ مِنْهَا، وَلَكِنِ ائْتُوا نُوحًا أَوَّلَ رَسُولٍ بَعَثَهُ اللهُ ، قَالَ: فَيَأْتُونَ نُوحًا صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَيَقُولُ: لَسْتُ هُنَاكُمْ، فَيَذْكُرُ خَطِيئَتَهُ الَّتِي أَصَابَ، فَيَسْتَحْيِي رَبَّهُ مِنْهَا، وَلَكِنِ ائْتُوا إِبْرَاهِيمَ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الَّذِي اتَّخَذَهُ اللهُ خَلِيلًا، فَيَأْتُونَ إِبْرَاهِيمَ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَيَقُولُ: لَسْتُ هُنَاكُمْ، وَيَذْكُرُ خَطِيئَتَهُ الَّتِي أَصَابَ، فَيَسْتَحْيِي رَبَّهُ مِنْهَا، وَلَكِنِ ائْتُوا مُوسَى صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، الَّذِي كَلَّمَهُ اللهُ وَأَعْطَاهُ التَّوْرَاةَ، قَالَ: فَيَأْتُونَ مُوسَى عَلَيْهِ السَّلَامُ، فَيَقُولُ: لَسْتُ هُنَاكُمْ، وَيَذْكُرُ خَطِيئَتَهُ الَّتِي أَصَابَ، فَيَسْتَحْيِي رَبَّهُ مِنْهَا، وَلَكِنِ ائْتُوا عِيسَى رُوحَ اللهِ وَكَلِمَتَهُ، فَيَأْتُونَ عِيسَى رُوحَ اللهِ وَكَلِمَتَهُ، فَيَقُولُ: لَسْتُ هُنَاكُمْ، وَلَكِنِ ائْتُوا مُحَمَّدًا صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَبْدًا قَدْ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَمَا تَأَخَّرَ ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: فَيَأْتُونِي فَأَسْتَأْذِنُ عَلَى رَبِّي، فَيُؤْذَنُ لِي، فَإِذَا أَنَا رَأَيْتُهُ وَقَعْتُ سَاجِدًا، فَيَدَعُنِي مَا شَاءَ اللهُ، فَيُقَالُ: يَا مُحَمَّدُ، ارْفَعْ رَأْسَكَ، قُلْ تُسْمَعْ، سَلْ تُعْطَهْ، اشْفَعْ تُشَفَّعْ، فَأَرْفَعُ رَأْسِي، فَأَحْمَدُ رَبِّي بِتَحْمِيدٍ يُعَلِّمُنِيهِ رَبِّي، ثُمَّ أَشْفَعُ فَيَحُدُّ لِي حَدًّا، فَأُخْرِجُهُمْ مِنَ النَّارِ، وَأُدْخِلُهُمُ الْجَنَّةَ، ثُمَّ أَعُودُ فَأَقَعُ سَاجِدًا، فَيَدَعُنِي مَا شَاءَ اللهُ أَنْ يَدَعَنِي، ثُمَّ يُقَالُ: ارْفَعْ يَا مُحَمَّدُ، قُلْ تُسْمَعْ، سَلْ تُعْطَهْ، اشْفَعْ تُشَفَّعْ، فَأَرْفَعُ رَأْسِي، فَأَحْمَدُ رَبِّي بِتَحْمِيدٍ يُعَلِّمُنِيهِ، ثُمَّ أَشْفَعُ فَيَحُدُّ لِي حَدًّا، فَأُخْرِجَهُمْ مِنَ النَّارِ وَأُدْخِلُهُمُ الْجَنَّةَ - قَالَ: فَلَا أَدْرِي فِي الثَّالِثَةِ أَوْ فِي الرَّابِعَةِ - قَالَ فَأَقُولُ: يَا رَبِّ، مَا بَقِيَ فِي النَّارِ إِلَّا مَنْ حَبَسَهُ الْقُرْآنُ، أَيْ وَجَبَ عَلَيْهِ الْخُلُودُ . قَالَ ابْنُ عُبَيْدٍ فِي رِوَايَتِهِ: قَالَ قَتَادَةُ: «أَيْ وَجَبَ عَلَيْهِ الْخُلُودُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8040,
                "hadithNumber": "476",
                "englishNarrator": "Anas رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: The believers would gather on the Day of Resurrection, and they would be concerned about it, or would be made mindful of it (i. e. the trjuble for it), (and the remaining part of the hadith w, ) uld be narrated) like the one transmitted by Abu Uwana, and he said in the hadith: Then I would come for the fourth time, or I would return the fourth time, and would say: O my Lord, no one has been left but he whom the Holy Qur'an has restrained.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’قیامت کے دن مومن جمع ہوں گے اور اس ( کی ہولناکیوں سے بچنے ) کی فکر میں مبتلا ہوں گے یا یہ بات ان کے دلوں میں ڈالی جائے گی ۔ ‘ ‘ .... ( آگے ) ابو عوانہ کی حدیث کےمانند ہے ، البتہ انہوں نے اس حدیث میں یہ کہا : ’’پھر میں چوتھی بار اللہ تعالیٰ کی خدمت میں حاضر ہوں گا ( یا چوتھی بار لوٹوں گا ) اور کہوں گا : اے میرے رب! ان کے سوا جنہیں قرآن ( کے فیصلے ) نے روک رکھاہے اور کوئی باقی نہیں بچا ۔ ‘ ‘",
                "urduNarrator": "ہم سے محمد بن المثنیٰ اور محمد بن بشار نے بیان کیا، کہا کہ ہم سے ابن ابی عدی نے بیان کیا،دوسری سند سے جس میں ( ابو عوانہ کے بجائے ) سعید نے قتادہ سے اور انہوں نے حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے کہا کہ",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «يَجْتَمِعُ الْمُؤْمِنُونَ يَوْمَ الْقِيَامَةِ فَيَهْتَمُّونَ بِذَلِكَ» - أَوْ يُلْهَمُونَ ذَلِكَ - بِمِثْلِ حَدِيثِ أَبِي عَوَانَةَ، وَقَالَ فِي الْحَدِيثِ: ثُمَّ آتِيهِ الرَّابِعَةَ - أَوْ أَعُودُ الرَّابِعَةَ - فَأَقُولُ: يَا رَبِّ، مَا بَقِيَ إِلَّا مَنْ حَبَسَهُ الْقُرْآنُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8041,
                "hadithNumber": "477",
                "englishNarrator": "Anas bin Malik رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Prophet of Allah (may peace be, upon him) said: Allah will gather the believers on the Day of Resurrection and they would be made mindful of it; and the rest (of the hadith) is like the one narrated above; and then he mentioned the fourth time: And I (the Holy Prophet) would say: O my Lord, no one is left in the Fire except he whom the Qur'an has restrained, i e. eternally doomed.",
                "hadithUrdu": "اللہ کے نبی ﷺ نےفرمایا : ’’قیامت کے دن اللہ تعالیٰ مومنوں کو جمع کرے گا ، پھر اس ( دن کی پریشانی سے بچنے ) کے لیے ان کے دل میں یہ بات ڈالی جائے گی ۔ ‘ ‘ .... یہ حدیث بھی ان دونوں ( ابوعوانہ اور سعید ) کی حدیث کی طرح ہے ، چوتھی دفعہ کے بارے میں یہ کہا : ’’تو میں کہوں گا : اے میرے رب! آگ میں ان کے سوا اور کوئی باقی نہیں جسے قرآن ( کے فیصلے ) نے روک لیا ہے ، یعنی جس کے لیے ( آگ میں ) ہمیشہ رہنا واجب ہو گیا ہے ۔",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا,معاذ بن ہشام نے کہا : میرے والد نے مجھے قتادہ کے حوالے سے حدیث سنائی اور انہوں نے حضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ: حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ نَبِيَّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «يَجْمَعُ اللهُ الْمُؤْمِنِينَ يَوْمَ الْقِيَامَةِ فَيُلْهَمُونَ لِذَلِكَ» بِمِثْلِ حَدِيثِهِمَا، وَذَكَرَ فِي الرَّابِعَةِ: فَأَقُولُ: يَا رَبِّ، مَا بَقِيَ فِي النَّارِ إِلَّا مَنْ حَبَسَهُ الْقُرْآنُ أَيْ وَجَبَ عَلَيْهِ الْخُلُودُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8042,
                "hadithNumber": "478",
                "englishNarrator": "Anas bin Malik ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "Verily the Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: He who professed: There is no god but Allah, would be brought out of the Fire even though he has in his heart virtue equal to the weight of a barley grain. Then he who professed: There is no god but Allah, would come out of the Fire, even though he has in his heart virtue equal to the weight of a wheat grain. He would then bring out from the Fire he who professed: There is no god but Allah, even though he has in his heart virtue equal to the weight of an atom. Ibn Minhal has made an addition (of these words) in his narration: Yazid said: I met Shu'ba and narrated to him this hadith. Shu'ba said: Qatada transmitted to us this hadith from Anas bin Malik رضی ‌اللہ ‌عنہ who heard it from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) with this alteration that he substituted the word Zurra (grain) in place of Zarra (atom). Yazid said: Abu Bistam has made a change in it.",
                "hadithUrdu": "رسو ل اللہﷺ نے فرمایا .... ، اسی طرح ابوغسان مسمعی اور محمد بن مثنیٰ نےکہا : میرے والد نےمجھے قتادہ کے حوالے سے حدیث سنائی ، ( انہوں نے کہا : ) ہمیں انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ نےحدیث سنائی کہ نبی ﷺ نے فرمایا : ’’اس شخص کو آگ سے نکال لیا جائےگا جس نے لا اله الا الله کہا اور ا س کےدل میں ایک جوکے وزن کے برابر خیر ہوئی ، پھر ایسے شخص کو آگ سے نکالا جائے گا جس نے لا اله الا الله کہا اور اس کے دل میں گندم کے دانے کے برابر خیر ہوئی ، پھر اس کو آگ سے نکالا جائے گا جس نے لا اله الا الله کہا اور اس کےدل میں ایک ذرے کے برابر بھی خیر ہوئی ۔ ‘ ‘ ( گزشتہ متعدد احادیث سے وضاحت ہوتی ہے کہ خیر سے مراد ایمان ہے ۔ ) ابن منہال نے اپنی روایت میں اضافہ کیا کہ یزید نے کہا : میں شعبہ سے ملا اور انہیں یہ حدیث سنائی تو شعبہ نےکہا : ہمیں یہ حدیث قتادہ نے حضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے ، انہوں نے نبی ﷺ سے سنائی ، البتہ شعبہ نے ’’ایک ذرے ‘ ‘ کے بجائے ’’مکئی کا دانہ ‘ ‘ کہا ۔ یزید نے کہا : اس لفظ میں ابو بسطام ( شعبہ ) سے تصحیف ( حروف میں اشتباہ کی وجہ سے غلطی ) ہو گئی ۔",
                "urduNarrator": "محمد بن منہال الضریر ( نابینا ) نے کہا : ہمیں یزید بن زریع نے حدیث سنائی ، انہوں نے کہا : ہمیں سعید بن ابی عروبہ اور دستوائی ( کپڑے ) والے ہشام نے قتادہ سے حدیث سنائی ، انہوں نے حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ مِنْهَالٍ الضَّرِيرُ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، وَهِشَامٌ صَاحِبُ الدَّسْتَوَائِيِّ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ. ح وَحَدَّثَنِي أَبُو غَسَّانَ الْمِسْمَعِيُّ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالَا: حَدَّثَنَا مُعَاذٌ وَهُوَ ابْنُ هِشَامٍ، قَالَ: حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: يَخْرُجُ مِنَ النَّارِ مِنْ قَالَ: لَا إِلَهَ إِلَّا اللهُ وَكَانَ فِي قَلْبِهِ مِنَ الْخَيْرِ مَا يَزِنُ شَعِيرَةً، ثُمَّ يَخْرُجُ مِنَ النَّارِ مِنْ قَالَ: لَا إِلَهَ إِلَّا اللهُ وَكَانَ فِي قَلْبِهِ مِنَ الْخَيْرِ مَا يَزِنُ بُرَّةً، ثُمَّ يَخْرُجُ مِنَ النَّارِ مِنْ قَالَ: لَا إِلَهَ إِلَّا اللهُ وَكَانَ فِي قَلْبِهِ مِنَ الْخَيْرِ مَا يَزِنُ ذَرَّةً . زَادَ ابْنُ مِنْهَالٍ فِي رِوَايَتِهِ: قَالَ: يَزِيدُ، فَلَقِيتُ شُعْبَةَ فَحَدَّثْتُهُ بِالْحَدِيثِ، فَقَالَ شُعْبَةُ: حَدَّثَنَا بِهِ قَتَادَةُ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِالْحَدِيثِ، إِلَّا أَنَّ شُعْبَةَ جَعَلَ مَكَانَ الذَّرَّةِ ذُرَةً، قَالَ يَزِيدُ: صَحَّفَ فِيهَا أَبُو بِسْطَامَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8043,
                "hadithNumber": "479",
                "englishNarrator": "Ma'bad bin Hilal al 'Anazi reported:",
                "hadithEnglish": "We went to Anas bin Malik ‌رضی ‌اللہ ‌عنہ ‌through Thabit and reached there (his house) while he was offering the forenoon prayer. Thabit sought permission for us and we entered, and he seated Thabit with him on his bedstead. He (Thabit) said to him (Anas bin Malik): O Abu Hamza (kunya of Anas b. Malik), your brothers from among the inhabitants of Basra ask you to narrate to them the hadith of intercession. He said: Muhammad ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) narrated to us: When it would be the Day of Resurrection, some of the people would rush to one another in bewilderment. They would come to Adam and say: Intercede (with your Lord) for your progeny. He would say: I am not fit to do this, but go to Ibrabim (peace be upon him) for he is the Friend of Allah. They would come to Ibrahim, but he would say: I am not fit to do this, but go to Moses, for he is Allah's Interlocutor. They would come to Moses, but he would say: I am not fit to do this, but you should go to Jesus, for he is the Spirit of Allah and His word. They would come to Jesus, and he would say, I am not fit to do this; you better go to Muhammad ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). They would come to me, and I would say: I am in a position to do that, I would go and ask the permission of my Lord and it would be granted to me. I would then stand before Him and would extol Him with praises which I am not able to do now, but with which Allah would inspire me, then I would fall in prostration and it would be said to me: O Muhammad, raise thy head, and say and it would be listened to; ask and it would be granted, intercede and it would be accepted. I shall say: My Lord, my people, my people It would be said: Go, and bring forth from it (Hell) him who has in his heart faith equal to the weight of a wheat grain or a barley seed. I would go and do that; then I would return to my Lord and extol Him with those praises (taught to me by Allah), then I would fall in prostration. It would be said to me: O Muhammad, raise your head, and say and it would be heard; ask and it would be granted; intercede and intercession would be accepted. So I would say: My people. my people. It would be said to me: Go and take out from it (Hell) him who has in his heart faith equal to the weight of a mustard seed. I would go and do that. I would again return to my Lord and extol Him with those praises. I would then fall in prostration. It would be said to me: O Muhammad, raisevour head: say, and you would be listened to; ask and it would be granted; intercede and intercession would be accepted. I would say: My Lord, my people, my people. It would be said to me: Go, and bring out of the Fire him who has in his heart as much faith as the smallest, smallest, smallest grain of mustard seed. I would go and do that. This is the hadith which Anas narrated to us. We went out of his (house) and when we reached the upper part of Jabban (graveyard) we said: Would that we meet Hasan and salute him and he was hiding in the house of Abu Khalifa. He (Ma'bad b. Hilal, the narrator) said: We went to him and greeted him and we said: O Abu Sa'id, we come from your brother Abu Hamza (kunya of Anas), and we have never heard a hadith like this relating to intercession, which he has narrated to us. He said: Narrate it, we narrated the hadith. He said: Narrate it (still further). We said: He did not (narrate it) before us more than this. He said: He (Anas) had narrated it to us twenty years back, when he was strong and healthy. He has in fact missed something. I cannot make out whether the old man has forgotten or he has (intentionally) avoided to narrate it to you lest you should rely (absolutely) upon it (and abandon doing good deeds). We said to him: Relate that to us, and he laughed and said: There is haste in the nature of man. I did not make mention of it to you but for the fact that I wanted to narrate that to you (and added that the Prophet said): I would then return to my Lord for the fourth time and extol Him with these praises. I would then fall in prostration. It would be said to me: O Muhammad, raise your head: say and it will be listened to; ask and it will be granted; intercede and intercession would be accepted. I would say: O my Lord, permit me regarding him who professed: There is no god but Allah. He (the Lord) would say: That is not for thee or that is not what lies with thee, but by My Honour, Glory, Greatness and Might, I would certainly take him out who professed it: There is no god but Allah. He (the narrator, Ma'bad) said: I hear testimony to the fact that the hadith transmitted to us-by Hasan was heard by him from Anas b. Malik and I can see that he reported it twenty years back, when he was hale and hearty.",
                "hadithUrdu": "ہم لوگ انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے پاس گئے اور ثابت ( البنانی ) کو اپنا سفارشی بنایا ( ان کے ذریعے سے ملاقات کی اجازت حاصل کی ۔ ) ہم ان کے ہاں پہنچے تو وہ چاشت کی نماز پڑھ رہے تھے ۔ ثابت نے ہمارے لیے ( اندر آنے کی ) اجازت لی ۔ ہم اندر ان کے سامنے حاضر ہوئے ۔ انہوں نے ثابت کو اپنے ساتھ اپنی چارپائی پر بٹھالیا ۔ ثابت نے ان سے کہا : اے ابوحمزہ! بصرہ کےباشندوں میں سے آپ کو ( یہ ) بھائی آپ سے درخواست کرتے ہیں کہ آپ انہیں شفاعت کی حدیث سنائیں ۔ حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : ہمیں حضرت محمدﷺ نے بتایا : ’’ جب قیامت کا دن ہو گا تولوگ موجوں کی طرح ایک دوسرے سے ٹکرا رہے ہوں گے ۔ وہ آدم علیہ السلام کے پاس آئیں گے اور ان سے عرض کریں گے : اپنی اولاد کے حق میں سفارش کیجیے ( کہ وہ میدان حشر کے مصائب اور جاں گسل انتظار سے نجات پائیں ۔ ) وہ کہیں گے : میں اس کے لیے نہیں ہوں ۔ لیکن تم ابراہیم علیہ السلام کا دامن تھام لو کیونکہ وہ اللہ تعالیٰ کے خلیل ( خالص دوست ) ہیں ۔ لوگ ابراہیم علیہ السلام کے پاس جائیں گے ۔ وہ جواب دیں گے : میں اس کے لیےنہیں ۔ لیکن تم موسیٰ علیہ السلام کے پاس پہنچ جاؤ وہ کلیم اللہ ہیں ( جن سے اللہ نے براہ راست کلام کیا ) تو موسیٰ علیہ السلام کے پاس حاضری ہو گی ۔ وہ فرمائیں گے : میں اس کے لیے نہیں ۔ لیکن تم عیسیٰ کےساتھ لگ جاؤ کیونکہ وہ اللہ کی روح اور اس کا کلمہ ہیں ۔ تو عیسیٰ ‌علیہ ‌السلام ‌ کے پاس آمد ہو گی ، وہ فرمائیں گے : میں اس کے لیے نہیں ۔ لیکن تم محمدﷺ کے پاس پہنچ جاؤ ، تو ( ان کی ) آمد میرے پاس ہو گی ۔ میں جواب دوں گا : اس ( کام ) کے لیے میں ہوں ۔ میں چل پڑوں گا اور اپنے رب کے سامنے حاضری کی اجازت چاہوں گا ، مجھے اجازت عطا کی جائے گی ، اس میں اس کے سامنے کھڑا ہوں گا اور تعریف کی ایسی باتوں کے ساتھ اس کی حمد کروں گا جس پر میں اب میں قادر نہیں ہوں ، اللہ تعالیٰ ہی یہ ( حمد ) میرے دل میں ڈالے گا ، پھر میں اس کے حضور سجدے میں گر جاؤں گا ، پھر مجھ سے کہا جائے گا : اے محمد! اپنا سراٹھائیں اور کہیں ، آپ کی بات سنی جائے گی ، مانگیں ، آپ کو دیا جائے گا اور سفارش کریں ، آپ کی سفارش قبول کی جائے گی ۔ میں عرض کروں گا : اے میرے رب ! میری امت ! ، میری امت! تو مجھ سے کہاجائے گا : جائیں جس کےدل میں گندم یا جو کے دانے کے برابر ایمان ہے اسے نکال لیں ، میں جاؤں گا اور ایسا کروں گا ، پھر میں اپنے رب تعالیٰ کے حضور لوٹ آؤں گا اور حمد کے انہی اسلوبوں سے اس کی تعریف بیان کروں گا ، پھر اس کے سامنے سجدے میں گر جاؤں گا تو مجھے کہا جائے گا : اے محمد! اپنا سر اٹھائیں اور کہیں ، آپ کی بات سنی جائے گی اور مانگیں ، آپ کو دیا جائے گا اور سفارش کریں ، آپ کی سفارش قبول ہو گی ۔ میں عرض کروں گا : اے میرے رب ! میری امت ! میری امت! مجھے کہا جائے گا : جائیں ، جس کے دل میں رائی کے دانے کے برابر ایمان ہو ، اسے نکال لیں ۔ تو میں جاؤں گا اور ایسا کروں گا ، پھراپنے رب کے حضور لوٹ آؤں گا اور اس جیسی تعریف سے اس کی حمد کروں گا ، پھر اس کے سامنے سجدے میں گر جاؤں گا ۔ تو مجھ سے کہا جائے گا : اے محمد ! ا پنا سر اٹھائیں ، کہیں ، آپ کی بات سنی جائے گی اور مانگیں ، آپ کو دیا جائے گا اور سفارش کریں ، آپ کی سفارش قبول ہو گی ۔ تو میں کہوں گا : اے میرے رب ! میری امت ! میری امت !تو مجھ سے کہا جائے گا : جائیں ، جس کے دل میں رائی کے دانے سے کم ، اس سے ( بھی ) کم ، اس سے ( اور بھی ) کم ایمان ہو اسے آگ سے نکال لیں تو میں جاؤں گا اور ایسا کروں گا ۔ ‘ ‘ یہ حضرت انس کی روایت ہے جو انہوں نے ہمیں بیان کی ۔ ( معبدی بن ہلال عنزی نے ) کہا : چنانچہ ہم ان کے ہاں سے نکل آئے ، جب ہم چٹیل میدان کے بالائی حصے پر پہنچے تو ہم نے کہا : ( کیا ہی اچھاہو ) اگر ہم حسن بصری کا رخ کریں اور انہیں سلام کرتے جائیں ۔ وہ ( حجاج بن یوسف کے ڈر سے ) ابو خلیفہ کے گھر میں چھپے ہوئے تھے ۔ انہوں نےکہا : جب ہم ان کے پاس پہنچے تو انہیں سلام کیا ۔ ہم نے کہا : جناب ابوسعید! ہم آپ کے بھائی ابو حمزہ ( حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی کنیت ہے ) کے پاس سے آرہے ہیں ۔ ہم نے کبھی اس جیسی حدیث نہیں سنی جو انہوں شفاعت کے بارے میں ہمیں سنائی ۔ حسن بصری نے کہا : لائیں سنائیں ۔ ہم نے انہیں حدیث سنائی تو انہوں نے کہا : آگے سنائیں ۔ ہم نے کہا : انہوں نےہمیں اس سے زیادہ نہیں سنایا ۔ انہوں ( حسن بصری ) نے کہا : ہمیں انہوں نے یہ حدیث بیس برس پہلے سنائی تھی ، اس وقت وہ پوری قوتوں کے مالک تھے ۔ انہوں نے کچھ حصہ چھوڑ دیا ہے ، معلوم نہیں ، شیخ بھول گئے یا انہوں نے تمہیں پوری حدیث سنانا پسند نہیں کیا کہ کہیں تم ( اس میں بیان کی ہوئی بات ہی پر ) بھروسا نہ کر لو ۔ ہم نےعرض کی : آپ ہمیں سنا دیں تو وہ ہنس پڑے اور کہا : انسان جلدباز پیدا کیاگیا ہے ، میں نے تمہارے سامنے اس بات کا تذکرہ اس کے سوا ( اور کسی وجہ سے ) نہیں کیا تھا مگر اس لیے کہ میں تمہیں یہ حدیث سنانا چاہتا تھا ۔ آپﷺ نے فرمایا : ’’پھر میں چوتھی بار اپنے رب کی طرف لوٹوں گا ، پھر انہی تعریفوں سے اس کی حمد بیان کروں گا ، پھر اس حضور سجدہ ریز ہو جاؤں گا تو مجھ سے کہا جائے گا : اے محمد! اپنا سر اٹھائیں اور کہیں ، آپ کی بات سنی جائے گی اور مانگیں ، آپ کو دیاجائے گااور سفارش کریں آپ کی سفارش قبول ہو گی ۔ تو میں عرض کروں گا : اے میرے رب ! مجھے ان کےبارے میں ( بھی ) اجازت دیجیے جنہوں نے ( صرف ) لا الہ الا اللہ کہا ۔ اللہ فرمائے گا : یہ آپ کے لیے نہیں لیکن میری عزت کی قسم ، میری کبریائی ، میری عظمت اور میری بڑائی کی قسم ! میں ان کو ( بھی ) جہنم سے نکال لوں گا جنہوں نے لا الہ الا اللہ کہا ۔ ‘ ‘ معبد کا بیان ہے : میں حسن بصری کے بارے میں گواہی دیتا ہوں کہ انہوں نے ہمیں بتایا کہ انہوں نے حضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے یہ روایت سنی ۔ میرا خیال ہے ، انہوں نے کہا : بیس سال پہلے ، اور اس وقت ان کی صلاحتیں بھر پور تھیں ۔",
                "urduNarrator": "ہم سے ابو الربیع العتکی نے بیان کیا، ہم سے حماد بن زید نے بیان کیا، ان سے معبد بن ہلال العنزی نے، ان سے حذیفہ نے بیان کیا اور ہم سے سعید بن منصور نے بیان کیا، اور ان سے حدیث حماد بن ہے۔ زید نے ہمیں بتایا,معبد بن ہلال عنزی نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو الرَّبِيعِ الْعَتَكِيُّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا مَعْبَدُ بْنُ هِلَالٍ الْعَنَزِيُّ، ح، وَحَدَّثَنَاهُ سَعِيدُ بْنُ مَنْصُورٍ، وَاللَّفْظُ لَهُ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا مَعْبَدُ بْنُ هِلَالٍ الْعَنَزِيُّ، قَالَ: انْطَلَقْنَا إِلَى أَنَسِ بْنِ مَالِكٍ، وَتَشَفَّعْنَا بِثَابِتٍ فَانْتَهَيْنَا إِلَيْهِ وَهُوَ يُصَلِّي الضُّحَى، فَاسْتَأْذَنَ لَنَا ثَابِتٌ، فَدَخَلْنَا عَلَيْهِ وَأَجْلَسَ ثَابِتًا مَعَهُ عَلَى سَرِيرِهِ، فَقَالَ: لَهُ يَا أَبَا حَمْزَةَ، إِنَّ إِخْوَانَكَ مِنْ أَهْلِ الْبَصْرَةِ يَسْأَلُونَكَ أَنْ تُحَدِّثَهُمْ حَدِيثَ الشَّفَاعَةِ، قَالَ: حَدَّثَنَا مُحَمَّدٌ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: إِذَا كَانَ يَوْمُ الْقِيَامَةِ مَاجَ النَّاسُ بَعْضُهُمْ إِلَى بَعْضٍ، فَيَأْتُونَ آدَمَ فَيَقُولُونَ لَهُ: اشْفَعْ لِذُرِّيَّتِكَ، فَيَقُولُ: لَسْتُ لَهَا، وَلَكِنْ عَلَيْكُمْ بِإِبْرَاهِيمَ عَلَيْهِ السَّلَامُ، فَإِنَّهُ خَلِيلُ اللهِ، فَيَأْتُونَ إِبْرَاهِيمَ فَيَقُولُ: لَسْتُ لَهَا وَلَكِنْ عَلَيْكُمْ بِمُوسَى عَلَيْهِ السَّلَامُ، فَإِنَّهُ كَلِيمُ اللهِ، فَيُؤْتَى مُوسَى، فَيَقُولُ: لَسْتُ لَهَا، وَلَكِنْ عَلَيْكُمْ بِعِيسَى عَلَيْهِ السَّلَامُ [ص:183]، فَإِنَّهُ رُوحُ اللهِ وَكَلِمَتُهُ، فَيُؤتَى عِيسَى، فَيَقُولُ: لَسْتُ لَهَا، وَلَكِنْ عَلَيْكُمْ بِمُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَأُوتَى، فَأَقُولُ: أَنَا لَهَا، فَأَنْطَلِقُ فَأَسْتَأْذِنُ عَلَى رَبِّي، فَيُؤْذَنُ لِي، فَأَقُومُ بَيْنَ يَدَيْهِ فَأَحْمَدُهُ بِمَحَامِدَ لَا أَقْدِرُ عَلَيْهِ الْآنَ، يُلْهِمُنِيهِ اللهُ، ثُمَّ أَخِرُّ لَهُ سَاجِدًا، فَيُقَالُ لِي: يَا مُحَمَّدُ، ارْفَعْ رَأْسَكَ، وَقُلْ: يُسْمَعْ لَكَ، وَسَلْ تُعْطَهْ، وَاشْفَعْ تُشَفَّعْ، فَأَقُولُ: رَبِّ، أُمَّتِي أُمَّتِي، فَيُقَالُ: انْطَلِقْ، فَمَنْ كَانَ فِي قَلْبِهِ مِثْقَالُ حَبَّةٍ مِنْ بُرَّةٍ، أَوْ شَعِيرَةٍ مِنْ إِيمَانٍ، فَأَخْرِجْهُ مِنْهَا، فَأَنْطَلِقُ فَأَفْعَلُ، ثُمَّ أَرْجِعُ إِلَى رَبِّي فَأَحْمَدُهُ بِتِلْكَ الْمَحَامِدِ، ثُمَّ أَخِرُّ لَهُ سَاجِدًا، فَيُقَالُ لِي: يَا مُحَمَّدُ، ارْفَعْ رَأْسَكَ، وَقُلْ يُسْمَعْ لَكَ، وَسَلْ تُعْطَهْ، وَاشْفَعْ تُشَفَّعْ، فَأَقُولُ: أُمَّتِي أُمَّتِي، فَيُقَالُ لِي: انْطَلِقْ فَمَنْ كَانَ فِي قَلْبِهِ مِثْقَالُ حَبَّةٍ مِنْ خَرْدَلٍ مِنْ إِيمَانٍ فَأَخْرِجْهُ مِنْهَا، فَأَنْطَلِقُ فَأَفْعَلُ، ثُمَّ أَعُودُ إِلَى رَبِّي فَأَحْمَدُهُ بِتِلْكَ الْمَحَامِدِ، ثُمَّ أَخِرُّ لَهُ سَاجِدًا، فَيُقَالُ لِي: يَا مُحَمَّدُ، ارْفَعْ رَأْسَكَ، وَقُلْ يُسْمَعْ لَكَ، وَسَلْ تُعْطَهْ، وَاشْفَعْ تُشَفَّعْ، فَأَقُولُ: يَا رَبِّ، أُمَّتِي أُمَّتِي، فَيُقَالُ لِي: انْطَلِقْ فَمَنْ كَانَ فِي قَلْبِهِ أَدْنَى أَدْنَى أَدْنَى مِنْ مِثْقَالِ حَبَّةٍ مِنْ خَرْدَلٍ مِنْ إِيمَانٍ فَأَخْرِجْهُ مِنَ النَّارِ فَأَنْطَلِقُ فَأَفْعَلُ ، هَذَا حَدِيثُ أَنَسٍ الَّذِي أَنْبَأَنَا بِهِ، فَخَرَجْنَا مِنْ عِنْدِهِ، فَلَمَّا كُنَّا بِظَهْرِ الْجَبَّانِ، قُلْنَا: لَوْ مِلْنَا إِلَى الْحَسَنِ فَسَلَّمْنَا عَلَيْهِ وَهُوَ مُسْتَخْفٍ فِي دَارِ أَبِي خَلِيفَةَ، قَالَ: فَدَخَلْنَا عَلَيْهِ، فَسَلَّمْنَا عَلَيْهِ، فَقُلْنَا: يَا أَبَا سَعِيدٍ، جِئْنَا مِنْ عِنْدِ أَخِيكَ أَبِي حَمْزَةَ، فَلَمْ نَسْمَعْ مِثْلَ حَدِيثٍ حَدَّثَنَاهُ فِي الشَّفَاعَةِ، قَالَ: هِيَهِ، فَحَدَّثْنَاهُ الْحَدِيثَ، فَقَالَ: هِيَهِ قُلْنَا: مَا زَادَنَا، قَالَ: قَدْ حَدَّثَنَا بِهِ مُنْذُ عِشْرِينَ سَنَةً وَهُوَ يَوْمَئِذٍ جَمِيعٌ، وَلَقَدْ تَرَكَ شَيْئًا مَا أَدْرِي أَنَسِيَ الشَّيْخُ، أَوْ كَرِهَ أَنْ يُحَدِّثَكُمْ، فَتَتَّكِلُوا، قُلْنَا لَهُ: حَدِّثْنَا، فَضَحِكَ وَقَالَ: {خُلِقَ الْإِنْسَانُ مِنْ عَجَلٍ} [الأنبياء: 37]، مَا ذَكَرْتُ لَكُمْ هَذَا إِلَّا وَأَنَا أُرِيدُ أَنْ أُحَدِّثَكُمُوهُ، ثُمَّ أَرْجِعُ إِلَى رَبِّي فِي الرَّابِعَةِ، فَأَحْمَدُهُ بِتِلْكَ الْمَحَامِدِ، ثُمَّ أَخِرُّ لَهُ سَاجِدًا، فَيُقَالُ لِي: يَا مُحَمَّدُ، ارْفَعْ رَأْسَكَ، وَقُلْ يُسْمَعْ لَكَ، وَسَلْ تُعْطَ، وَاشْفَعْ تُشَفَّعْ، فَأَقُولُ: يَا رَبِّ، ائْذَنْ لِي فِيمَنْ قَالَ: لَا إِلَهَ إِلَّا اللهُ، قَالَ: لَيْسَ ذَاكَ لَكَ - أَوْ قَالَ: لَيْسَ ذَاكَ إِلَيْكَ - وَلَكِنْ وَعِزَّتِي وَكِبْرِيَائِي وَعَظَمَتِي وَجِبْرِيَائِي، لَأُخْرِجَنَّ مَنْ قَالَ: لَا إِلَهَ إِلَّا اللهُ، ، قَالَ: فَأَشْهَدُ عَلَى الْحَسَنِ أَنَّهُ حَدَّثَنَا بِهِ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ أُرَاهُ قَالَ: قَبْلَ عِشْرِينَ سَنَةً وَهُوَ يَوْمِئِذٍ جَمِيعٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8044,
                "hadithNumber": "480",
                "englishNarrator": "Abu Huraira رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "Meat was one day brought to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and a foreleg was offered to him, a part which he liked. He sliced with his teeth a piece out of it and said: I shall be the leader of mankind on the Day of Resurrection. Do you know why? Allah would gather in one plain the earlier and the later (of the human race) on the Day of Resurrection. Then the voice of the proclaimer would be heard by all of them and the eyesight would penetrate through all of them and the sun would come near. People would then experience a degree of anguish, anxiety and agony which they shall not be able to bear and they shall not be able to stand. Some people would say to the others: Don you see in which trouble you are? Don't you see what (misfortune) has overtaken you? Why don't you find one who should intercede for you with your Lord? Some would say to the others: Go to Adam. And they would go to Adam and say: O Adam, thou art the father of mankind. Allah created thee by His own Hand and breathed in thee of His spirit and ordered the angels to prostrate before thee. Intercede for us with thy Lord Don't you see in what (trouble) we are? Don't you see what (misfortune) has overtaken us? Adam would say: Verily, my Lord is angry, to an extent to which He had never been angry before nor would He be angry afterward. Verily, He forbade me (to go near) that tree and I disobeyed Him. I am concerned with my own self. Go to someone else; go to Noah. They would come to Noah and would say: O Noah, thou art the first of the Messengers (sent) on the earth (after Adam), and Allah named thee as a Grateful Servant, intercede for us with thy Lord. Don't you see in what (trouble) we are? Don't you see what (misfortune) has overtaken us? He would say: Verily, my Lord is angry today as He had never been angry before, and would never be angry afterwards. There had emanated a curse from me with which I cursed my people. I am concerned with only myself, I am concerned only with myself; you better go to Ibrahim (peace be upon him). They would go to Ibrahim and say: Thou art the apostle of Allah and His Friend amongst the inhabitants of the earth; intercede for us with thy Lord. Don't you see in which (trouble) we are? Don't you see what (misfortune) has overtaken us? Ibrahim would say to them: Verily, my Lord is today angry as He had never been angry before and would never be angry afterwards. and (Ibrahim) would mention his lies (and then say): I am concerned only with myself, I am concerned only with myself. You better go to someone else: go to Moses. They would come to Moses (peace be upon him) and say: O Moses, thou art Allah's messenger, Allah blessed thee with His messengership and His conversation amongst people. Intercede for us with thy Lord. Don't you see in what (trouble) we are? Don't you see what (misfortune) has overtaken us? Moses (peace be upon him) would say to them: Verily. my Lord is angry as He had never been angry before and would never be angry afterwards. I, in fact, killed a person whom I had not been ordered to kill. I am concerned with myself, I am concerned with myself. You better go to Jesus (peace be upon him). They would come to Jesus and would say: O Jesus, thou art the messenger of Allah and thou conversed with people in the cradle, (thou art) His Word which I-Ie sent down upon Mary. and (thou art) the Spirit from Him; so intercede for us with thy Lord. Don't you see (the trouble) in which we are? Don't you see (the misfortune) that has overtaken us? Jesus (peace be upon him) would say: Verily, my Lord is angry today as He had never been angry before or would ever be angry afterwards. He mentioned no sin of his. (He simply said: ) I am concerned with myself, I am concerned with myself; you go to someone else: better go to Muhammad ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). They would come to me and say: O Mahammad, thou art the messenger of Allah and the last of the apostles. Allah has pardoned thee all thy previous and later sins. Intercede for us with thy Lord; don't you see in which (trouble) we are? Don't you see what (misfortune) has overtaken us? I shall then set off and come below the Throne and fall down prostrate before my Lord; then Allah would reveal to me and inspire me with some of His Praises and Glorifications which He had not revealed to anyone before me. He would then say: Muhammad, raise thy head; ask and it would be granted; intercede and intercession would be accepted I would then raise my head and say: O my Lord, my people, my people. It would be said: O Muhammad, bring in by the right gate of Paradise those of your people who would have no account to render. They would share with the people some other door besides this door. The Prophet then said: By Him in Whose Hand is the life of Muhammad, verify the distance between two door leaves of the Paradise is as great as between Mecca and Hajar, or as between Mecca and Busra.",
                "hadithUrdu": "ایک دن رسو ل اللہ ﷺ کی خدمت میں گوشت لایا گیا اور دستی اٹھا کر آپ کو پیش کی گئی کیونکہ آپ آپ کو مرغوب تھی ، آپ نے اپنےدندان مبارک سے ایک بار اس میں سے تناول کیا اور فرمایا : ’’ میں قیامت کے دن تمام انسانوں کا سردار ہوں گا ۔ کیا تم جانتے ہو یہ کیسے ہو گا؟ اللہ تعالیٰ قیامت کے دن تمام اگلون اور پچھلوں کو ایک ہموار چٹیل میدان میں جمع کرے گا ۔ بلانے والا سب کو اپنی آواز سنائے گا اور ( اللہ کی ) نظر سب کے آر پار ( سب کو دیکھ رہی ) ہو گی ۔ سورج قریب ہو جائے گا اور لوگوں کو اس قدر غم اور کرب لاحق ہو گا جوان کی طاقت سے زیادہ اور ناقابل برداشت ہو گا ۔ لوگ ایک دوسرے کہیں گے : کیا دیکھتے نہیں تم کس حالت میں ہو ؟ کیا دیکھتے نہیں تم پر کیسی مصیبت آن پڑی ہے ؟ کیا تم کوئی ا یسا شخص تلاش نہیں کرتے جو تمہاری سفارش کردے؟ یعنی تمہارے رب کے حضور ۔ چنانچہ لوگ ایک دوسرے سے کہیں گے : آدم علیہ السلام کے پاس چلو تو وہ آدم علیہ السلام کی خدمت میں حاضر ہوں گے اور عرض کریں گے : اے آدم ! آپ سب انسانوں کے والد ہیں ، اللہ تعالیٰ نے آپ کو اپنے ہاتھ سے بنایا اور آپ میں اپنی ( طرف سے ) روح پھونکی اور فرشتوں کو حکم دیا تو انہوں نے آپ کو سجدہ کیا ۔ آپ اپنے رب کے حضور ہماری سفارش فرمائیں ۔ آپ دیکھتے نہیں ہم کس حال میں ہیں ؟ کیا آپ دیکھتے نہیں ہم پر کیسی مصیبت آن پڑی ہے ؟ آدم علیہ السلام جواب دیں گے : میرا رب آج اتنے غصے میں ہے جتنے غصے میں اسے سے پہلے کبھی نہیں آیا اور نہ اس کے بعد کبھی آئے گا اور یقیناً اس نے مجھے ایک خاص درخت ( کےقریب جانے ) سے روکا تھا لیکن میں نے اس کی نافرمانی کی تھی ، مجھے اپنی جان کی فکر ہے ، مجھے اپنی جان بچانی ہے ۔ تم کسی اور کے پاس جاؤ ، نوح ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے پاس جاؤ ۔ لوگ نوح ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی خدمت میں حاضر ہوں گے اور عرض کریں گے : اے نوح! آپ ( اہل ) زمین کی طرف سے بھیجے گئے سب سے پہلے رسول ہیں اور ا للہ تعالیٰ نے آپ کو شکر گزار بندے کا نام دیا ہے ۔ آپ دیکھتے نہیں ہم کس حال میں ہیں ؟ آپ دیکھتے نہیں ہم پر کیا مصیبت آن پڑی ہے ؟ وہ انہیں جوا ب دیں گے : آج میرا رب اتنے غصے میں ہے جتنے غصے میں نہ وہ اس سے پہلے کبھی آیا نہ آیندہ کبھی آئے گا ۔ حقیقت یہ ہے کہ میرے لیے ایک دعا ( خاص کی گئی ) تھی وہ میں نے اپنی قوم کےخلاف مانگ لی ۔ ( آج تو ) میری اپنی جان ( پر بنی ) ہے ۔ مجھے اپنی جان ( کی فکر ) ہے ۔ تم ابراہیم علیہ السلام کے پاس جاؤ ، چنانچہ لوگ ابراہیم علیہ السلام کے پاس حاضر ہوں گے اور عرض گزار ہوں گے : آپ اللہ کے نبی اور اہل زمین میں سے اس کے خلیل ( صرف اس کے دوست ) ہیں ، اپنے رب کے حضور ہماری سفارش فرمائیں ، آپ دیکھتے نہیں ہم کس حال میں ہیں ؟ کیا آپ دیکھتے نہیں ہم پر کیا مصیبت آن پڑی ہے ؟ تو ابراہیم علیہ السلام ان سے کہیں گے : میرارب اس قدر غصے میں ہے کہ اس سے پہلے کبھی اتنے غصے میں نہیں آیا اور نہ آیندہ کبھی آئے گا اور اپنے ( تین ) جھوٹ یاد کریں گے ، ( اور کہیں ) مجھے اپنی جان کی فکر ہے ، مجھے تو اپنی جان کی بچانی ہے ۔ کسی اورکے پاس جاؤ ، موسیٰ ‌علیہ ‌السلام ‌ کے پاس جاؤ ۔ لوگ موسیٰ ‌علیہ ‌السلام ‌ کے خدمت میں حاضر ہوں گے اورعرض کریں گے : اے موسیٰ!آپ اللہ کےرسول ہیں ، اللہ تعالیٰ نے آپ کو اپنے پیغام اور اپنی ہم کلامی کے ذریعے سے فضیلت عطا کی ، اللہ کے حضور ہمارے لیے سفارش کیجیے ، آپ دیکھتے نہیں ہم کس حال میں ہیں ؟ آپ دیکھتے نہیں ہم پر کیا مصیبت آن پڑی ہے ؟ موسیٰ ‌علیہ ‌السلام ‌ ان سے کہیں گے : میرا ب آج اس قدر غصے میں ہے کہ نہ اس سے پہلے کبھی اس قدر غصے میں آیا اور نہ اس کے بعد آئے گا ۔ میں ایک جان کو قتل کر چکا ہوں جس کے قتل کا مجھے حکم نہ دیا گیا تھا ۔ میری جان ( کا کیا ہو گا ) میری جان ( کیسے بچے گی؟ ) عیسیٰ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے پا س جاؤ ۔ لوگ عیسیٰ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے پاس آئیں گے اور عرض کریں گے : اے عیسیٰ! آپ اللہ کا کلمہ ہیں جسے اس نے مریم ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی طرف القاء کیا اور اس کی روح ہیں ، اس لیے آپ اپنے رب کے حضور ہماری سفارش فرمائیں ، آپ ہماری حالت نہیں دیکھتے جس میں ہم ہیں ؟ کیا آپ نہیں دیکھتے ہم پر کیسی مصیبت آن پڑی ہے ؟ تو عیسیٰ ‌رضی ‌اللہ ‌عنہ ‌ ‌ انہیں جواب دیں گے : میرا رب اتنے غصے میں ہے جتنے غصےمیں نہ وہ اس سے پہلے آیا اور نہ آیندہ کبھی آئے گا ، وہ اپنی کسی خطا کا ذکر نہیں کریں گے ، ( کہیں گے مجھے ) اپنی جان کی فکر ہے ، مجھے اپنی جان بچانی ہے ۔ میرے سوا کسی اور کے پاس جاؤ ، محمدﷺ کے پاس جاؤ ۔ لوگ میرے پاس ےئین گآ اور کہیں گے : اے محمد! آپ اللہ کے رسول اور آخری نبی ہیں ، اللہ تعالیٰ نے آپ کے اگلے پچھلے تمام گناہ ( اگر ہوتے تو بھی ) معاف کر دیے ، اپنے رب کےحضور ہماری سفارش فرمائیں ، آپ دیکھتے نہیں ہم کس حال میں ہیں ؟ آپ دیکھتے نہیں ہم کیا مصیبت آن پڑی ہے ؟ تو میں چل پڑوں گا اور عرش کے نیچے آؤں گا اور اپنے رب کے حضور سجدے میں گر جاؤں گا ، پھر اللہ تعالیٰ مجھ پر اپنی ایسی تعریفوں اوراپنی ایسی بہترین ثنا ( کے دروازے ) کھول دے گا اور انہیں میرے دل میں ڈالے گا جو مجھ سے پہلے کسی کے لیے نہیں کھولے گئے ، پھر ( اللہ ) فرمائےگا : اے محمد! اپنا سر اٹھائیے ، مانگیے ، آپ کو ملے گا ، سفارش کیجیے ، آپ کی سفارش قبول ہو گی ۔ تو میں سر اٹھاؤں گا اور عرض کروں گا : اےمیرے رب ! میری امت ! میری امت ! توکہا جائے گا : اے محمد! آپ کی امت کے جن لوگوں کا حساب و کتاب نہیں ان کو جنت کے دروازے میں سے دائیں دروازے سے داخل کر دیجیے اور وہ جنت کے باقی دروازوں میں ( بھی ) لوگوں کے ساتھ شریک ہیں ۔ اس ذات کی قسم جس کے ہاتھ میں محمد کی جان ہے ! جنت کے دو کواڑوں کے درمیان اتنا ( فاصلہ ) ہے جتنامکہ اور ( شہر بجر ) یا مکہ اور بصری کے درمیان ہے ۔ ‘ ‘",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور محمد بن عبداللہ بن نمیر نے بیان کیا، اور انہوں نے حدیث کے ضمن میں اتفاق کیا، سوائے اس کے کہ ان میں سے ایک نے خط کے بعد ایک حرف کا اضافہ کیا، انہوں نے کہا: ہم سے محمد بن بشر نے بیان کیا،ابو حیان نے ابو زرعہ سے اور انہوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نےکہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، وَاتَّفَقَا فِي سِيَاقِ الْحَدِيثِ إِلَّا مَا يَزِيدُ أَحَدُهُمَا مِنَ الْحَرْفِ بَعْدَ الْحَرْفِ قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا أَبُو حَيَّانَ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: أُتِيَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَوْمًا بِلَحْمٍ، فَرُفِعَ إِلَيْهِ الذِّرَاعُ، وَكَانَتْ تُعْجِبُهُ فَنَهَسَ مِنْهَا نَهْسَةً فَقَالَ: أَنَا سَيِّدُ النَّاسِ يَوْمَ الْقِيَامَةِ، وَهَلْ تَدْرُونَ بِمَ ذَاكَ؟ يَجْمَعُ اللهُ يَوْمَ الْقِيَامَةِ الْأَوَّلِينَ وَالْآخِرِينَ فِي صَعِيدٍ وَاحِدٍ، فَيُسْمِعُهُمُ الدَّاعِي، وَيَنْفُذُهُمُ الْبَصَرُ، وَتَدْنُو الشَّمْسُ فَيَبْلُغُ النَّاسَ مِنَ الْغَمِّ وَالْكَرْبِ مَا لَا يُطِيقُونَ، وَمَا لَا يَحْتَمِلُونَ، فَيَقُولُ بَعْضُ النَّاسِ لِبَعْضٍ: أَلَا تَرَوْنَ مَا أَنْتُمْ فِيهِ؟ أَلَا تَرَوْنَ مَا قَدْ بَلَغَكُمْ؟ أَلَا تَنْظُرُونَ مَنْ يَشْفَعُ لَكُمْ إِلَى رَبِّكُمْ؟ فَيَقُولُ بَعْضُ النَّاسِ لِبَعْضٍ: ائْتُوا آدَمَ، فَيَأْتُونَ آدَمَ، فَيَقُولُونَ: يَا آدَمُ، أَنْتَ أَبُو الْبَشَرِ، خَلَقَكَ اللهُ بِيَدِهِ، وَنَفَخَ فِيكَ مِنْ رُوحِهِ، وَأَمَرَ الْمَلَائِكَةَ فَسَجَدُوا لَكَ، اشْفَعْ لَنَا إِلَى رَبِّكَ، أَلَا تَرَى إِلَى مَا نَحْنُ فِيهِ؟ أَلَا تَرَى إِلَى [ص:185] مَا قَدْ بَلَغَنَا؟ فَيَقُولُ آدَمُ: إِنَّ رَبِّي غَضِبَ الْيَوْمَ غَضَبًا لَمْ يَغْضَبْ قَبْلَهُ مِثْلَهُ، وَلَنْ يَغْضَبَ بَعْدَهُ مِثْلَهُ، وَإِنَّهُ نَهَانِي عَنِ الشَّجَرَةِ فَعَصَيْتُهُ نَفْسِي نَفْسِي، اذْهَبُوا إِلَى غَيْرِي، اذْهَبُوا إِلَى نُوحٍ، فَيَأْتُونَ نُوحًا، فَيَقُولُونَ: يَا نُوحُ، أَنْتَ أَوَّلُ الرُّسُلِ إِلَى الْأَرْضِ، وَسَمَّاكَ اللهُ عَبْدًا شَكُورًا، اشْفَعْ لَنَا إِلَى رَبِّكَ، أَلَا تَرَى مَا نَحْنُ فِيهِ؟ أَلَا تَرَى مَا قَدْ بَلَغَنَا؟ فَيَقُولُ لَهُمْ: إِنَّ رَبِّي قَدْ غَضِبَ الْيَوْمَ غَضَبًا لَمْ يَغْضَبْ قَبْلَهُ مِثْلَهُ، وَلَنْ يَغْضَبَ بَعْدَهُ مِثْلَهُ، وَإِنَّهُ قَدْ كَانَتْ لِي دَعْوَةٌ دَعَوْتُ بِهَا عَلَى قَوْمِي، نَفْسِي نَفْسِي، اذْهَبُوا إِلَى إِبْرَاهِيمَ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَيَأْتُونَ إِبْرَاهِيمَ، فَيَقُولُونَ: أَنْتَ نَبِيُّ اللهِ وَخَلِيلُهُ مِنْ أَهْلِ الْأَرْضِ، اشْفَعْ لَنَا إِلَى رَبِّكَ، أَلَا تَرَى إِلَى مَا نَحْنُ فِيهِ؟ أَلَا تَرَى إِلَى مَا قَدْ بَلَغَنَا؟ فَيَقُولُ لَهُمْ إِبْرَاهِيمُ: إِنَّ رَبِّي قَدْ غَضِبَ الْيَوْمَ غَضَبًا لَمْ يَغْضَبْ قَبْلَهُ مِثْلَهُ، وَلَا يَغْضَبُ بَعْدَهُ مِثْلَهُ، وَذَكَرَ كَذَبَاتِهِ، نَفْسِي نَفْسِي، اذْهَبُوا إِلَى غَيْرِي، اذْهَبُوا إِلَى مُوسَى، فَيَأْتُونَ مُوسَى صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَيَقُولُونَ: يَا مُوسَى، أَنْتَ رَسُولُ اللهِ فَضَّلَكَ اللهُ بِرِسَالَاتِهِ، وَبِتَكْلِيمِهِ عَلَى النَّاسِ، اشْفَعْ لَنَا إِلَى رَبِّكَ، أَلَا تَرَى إِلَى مَا نَحْنُ فِيهِ؟ أَلَا تَرَى مَا قَدْ بَلَغَنَا؟ فَيَقُولُ لَهُمْ مُوسَى صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: إِنَّ رَبِّي قَدْ غَضِبَ الْيَوْمَ غَضَبًا لَمْ يَغْضَبْ قَبْلَهُ مِثْلَهُ، وَلَنْ يَغْضَبَ بَعْدَهُ مِثْلَهُ، وَإِنِّي قَتَلْتُ نَفْسًا لَمْ أُومَرْ بِقَتْلِهَا، نَفْسِي نَفْسِي، اذْهَبُوا إِلَى عِيسَى صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَيَأْتُونَ عِيسَى، فَيَقُولُونَ: يَا عِيسَى أَنْتَ رَسُولُ اللهِ، وَكَلَّمْتَ النَّاسَ فِي الْمَهْدِ، وَكَلِمَةٌ مِنْهُ أَلْقَاهَا إِلَى مَرْيَمَ، وَرُوحٌ مِنْهُ، فَاشْفَعْ لَنَا إِلَى رَبِّكَ، أَلَا تَرَى مَا نَحْنُ فِيهِ؟ أَلَا تَرَى مَا قَدْ بَلَغَنَا؟ فَيَقُولُ لَهُمْ عِيسَى صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: إِنَّ رَبِّي قَدْ غَضِبَ الْيَوْمَ غَضَبًا لَمْ يَغْضَبْ قَبْلَهُ مِثْلَهُ، وَلَنْ يَغْضَبَ بَعْدَهُ مِثْلَهُ، وَلَمْ يَذْكُرْ لَهُ ذَنْبًا، نَفْسِي نَفْسِي، اذْهَبُوا إِلَى غَيْرِي، اذْهَبُوا إِلَى مُحَمَّدٍ، فَيَأْتُونِّي فَيَقُولُونَ: يَا مُحَمَّدُ، أَنْتَ رَسُولُ اللهِ، وَخَاتَمُ الْأَنْبِيَاءِ، وَغَفَرَ اللهُ لَكَ مَا تَقَدَّمَ مِنْ ذَنْبِكَ، وَمَا تَأَخَّرَ، اشْفَعْ لَنَا إِلَى رَبِّكَ، أَلَا تَرَى مَا نَحْنُ فِيهِ؟ أَلَا تَرَى مَا قَدْ بَلَغَنَا؟ فَأَنْطَلِقُ، فَآتِي تَحْتَ الْعَرْشِ، فَأَقَعُ سَاجِدًا لِرَبِّي، ثُمَّ يَفْتَحُ اللهُ عَلَيَّ وَيُلْهِمُنِي مِنْ مَحَامِدِهِ، وَحُسْنِ الثَّنَاءِ عَلَيْهِ شَيْئًا لَمْ يَفْتَحْهُ لِأَحَدٍ قَبْلِي، ثُمَّ يُقَالُ: يَا مُحَمَّدُ، ارْفَعْ رَأْسَكَ، سَلْ تُعْطَهْ، اشْفَعْ تُشَفَّعْ، فَأَرْفَعُ رَأْسِي، فَأَقُولُ: يَا رَبِّ، أُمَّتِي أُمَّتِي، فَيُقَالُ: يَا مُحَمَّدُ، أَدْخِلْ الْجَنَّةَ مِنْ أُمَّتِكَ مَنْ لَا حِسَابَ عَلَيْهِ مِنَ الْبَابُِ الْأَيْمَنِ مِنْ أَبْوَابِ الْجَنَّةِ، وَهُمْ شُرَكَاءُ النَّاسِ فِيمَا سِوَى ذَلِكَ مِنَ الْأَبْوَابِ، وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ، إِنَّ مَا بَيْنَ الْمِصْرَاعَيْنِ مِنْ مَصَارِيعِ الْجَنَّةِ لَكَمَا بَيْنَ مَكَّةَ وَهَجَرٍ، أَوْ كَمَا بَيْنَ مَكَّةَ وَبُصْرَى .",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8045,
                "hadithNumber": "481",
                "englishNarrator": "It is reported on the authority of Abu Huraira رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "There was placed before the Messenger of Allah a cup of soft bread, soup and meat. He took part of the foreleg which he liked most. He sliced (with his teeth) a slice (out of that) and said: I would be the leader of mankind on the Day of Resurrection. He then sliced (that meat) for the second time and said: I am the leader of mankind on the Day of Resurrection. When he saw that his companions did not ask him (about this assertion) he said: Why don't you say: How would that be? They said: How would be it, Messenger of Allah? He said: People would stand before the Lord of the worlds. And the rest of the hadith was narrated like the one transmitted by Abu Hayyan, on the authority of Abu Zur'a, and in the story of Ibrahim, this addition was made. He said and made mention of his words with regard to the star: This is my Lord. And his words with regard to their gods: But the big among them has done that. And his words: I am ailing. He (the Holy Prophet) said: By Him in Whose Hand is the life of Muhammad, the distance between two leaves of the door from their supporting frames is as the distance between Mecca and Hajar or Hajar and Mecca. I do not remember how he said it (whether Mecca and Hajar or Hajar and Mecca).",
                "hadithUrdu": "رسو ل اللہﷺ کے سامنے ثرید اور گوشت کا پیالہ رکھا گیا ، آپ نے دستی اٹھائی ، آپ کو بکری ( کے گوشت ) میں سب سے زیادہ یہی حصہ پسند تھا ، آپ نےاس میں سے ایک بار اپنے داندان مبارک سے تناول کیا اور فرمایا : ’’میں قیامت کےدن تمام لوگوں کاسردار ہوں گا ۔ ‘ ‘ پھر دوبارہ تناول کیا اور فرمایا : ’’میں قیامت کے روز تمام انسانوں کا سردار ہوں گا ۔ ‘ ‘ جب آپ نے دیکھا کہ آپ کے ساتھی ( اس کے بارےمیں ) آپ سے کچھ نہیں پوچھ رہے تو آپ نے فرمایا : ’’ تم پوچھتے کیوں نہیں کہ یہ کیسے ہو گا؟ انہوں نے پوچھا : یہ کیسے ہو گا؟ اللہ کے رسول ! آپ نے فرمایا : ’’لوگ رب العالمین کے سامنےکھڑے ہو ں گے..... ‘ ‘ ( عمارہ نے بھی ) ابوزرعہ کے حوالے سے ابو حیان کی بیان کردہ حدیث کی طرح بیان کی اور ابراہیم علیہ السلام کے واقعے میں یہ اضافہ کیا : ( آپﷺ نے ) فرمایا : ابراہیم علیہ السلام نےستارے کے بارے میں اپنا قول : ’’یہ میرا رب ہے ‘ ‘ اور ان کے معبودوں کے بارے میں یہ کہنا : ’’ بلکہ یہ کام ان کے بڑے نے کیا ہے ‘ ‘ اور یہ کہنا : ’’میں بیمار ہوں ‘ ‘ یاد کیا ۔ ( رسول اللہ ﷺنے ) فرمایا : ’’اس ذات کی قسم جس کے ہاتھ میں محمدﷺ کی جان ہے ! چوکھٹ کےدونوں بازؤں تک جنت کے کواڑوں میں سے ( ہر ) دو کواڑوں کے درمیان : اتنا فاصلہ ہے کہ جتنا مکہ اور ہجر کے درمیان ، یا ( فرمایا ) ہجر اور مکہ کےدرمیان ہے ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے جریر نے بیان کیا(ایک دوسرے سند سے ) عمارہ بن قعقاع نے ابو زرعہ سے ، انہوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے کہا کہ",
                "hadithArabic": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: وُضِعَتْ بَيْنَ يَدَيْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَصْعَةٌ مِنْ ثَرِيدٍ وَلَحْمٍ، فَتَنَاوَلَ الذِّرَاعَ وَكَانَتْ أَحَبَّ الشَّاةِ إِلَيْهِ، فَنَهَسَ نَهْسَةً، فَقَالَ: «أَنَا سَيِّدُ النَّاسِ يَوْمَ الْقِيَامَةِ»، ثُمَّ نَهَسَ أُخْرَى، فَقَالَ: «أَنَا سَيِّدُ النَّاسِ يَوْمَ الْقِيَامَةِ»، فَلَمَّا رَأَى أَصْحَابَهُ لَا يَسْأَلُونَهُ قَالَ: «أَلَا تَقُولُونَ كَيْفَهْ؟» قَالُوا: كَيْفَهْ يَا رَسُولَ اللهِ؟ قَالَ: «يَقُومُ النَّاسُ لِرَبِّ الْعَالَمِينَ» وَسَاقَ الْحَدِيثَ بِمَعْنَى حَدِيثِ أَبِي حَيَّانَ، عَنْ أَبِي زُرْعَةَ، وَزَادَ فِي قِصَّةِ إِبْرَاهِيمَ فَقَالَ: وَذَكَرَ قَوْلَهُ فِي الْكَوْكَبِ: ِ {هَذَا رَبِّي} [الأنعام: 76] وَقَوْلَهُ لِآلِهَتِهِمْ: {بَلْ فَعَلَهُ كَبِيرُهُمْ هَذَا} [الأنبياء: 63]، وَقَوْلَهُ: {إِنِّي سَقِيمٌ} [الصافات: 89]، قَالَ: وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ، إِنَّ مَا بَيْنَ الْمِصْرَاعَيْنِ مِنْ مَصَارِيعِ الْجَنَّةِ إِلَى عِضَادَتَيِ الْبَابُِ لَكَمَا بَيْنَ مَكَّةَ وَهَجَرٍ، أَوْ هَجَرٍ وَمَكَّةَ، قَالَ: لَا أَدْرِي أَيَّ ذَلِكَ قَالَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8046,
                "hadithNumber": "482",
                "englishNarrator": "It is narrated on the authority of Abu Huraira رضی ‌اللہ ‌عنہ and Hudhaifa رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Allah, the Blessed and Exalted, would gather people. The believers would stand till the Paradise would be brought near them. They would come to Adam and say: O our father, open for us the Paradise. He would say: What turned ye out from the Paradise was the sin of your father Adam. I am not in a position to do that; better go to my son Ibrahim, the Friend of Allah. He (the Holy Prophet) said: He (Ibrahim) would say: I am not in a position to do that. Verily I had been the Friend (of Allah) from beyond, beyond; you better approach Moses (peace be upon him) with whom Allah conversed. They would come to Moses (peace be upon him), but he would say: I am not in a position to do that; you better go to Jesus, the Word of Allah and His Spirit. Jesus (peace be upon him) would say: I am not in a position to do that. So they would come to Muhammad ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). He would then be permitted (to open the door of Paradise). Trustworthiness and kinship would be despatched, and these would stand on the right and left of the Path and the first of you would pass with (the swiftness) of lightning. He (the narrator) said: I said, O thou who art far dearer to me than my father and my mother I which thing is like the passing of lightning? He said: Have you not seen lightning, how it passes and then comes back within the twinkling of an eye? Then (they would pass) like the passing of the wind, then like the passing of a bird, and the hastening of persons would be according to their deeds, and your Apostle would be standing on the Path saying: Save, O my Lord, save. (The people would go on passing) till the deeds of the servants would be failing in strength, till a man would come who would find it hard to go along (that Path) but crawlingly. He (the narrator) said: And on the sides of the Path hooks would be suspended ready to catch anyone whom these would be required (to catch). There would be those who would somehow or other succeed in trasversing that Path and some would be piled up in Hell. By Him in Whose Hand is the life of Abu Huraira it would take one seventy years to fathom the depth of Hell.",
                "hadithUrdu": "رسو ل اللہ ﷺنے فرمایا : ’’ اللہ تبارک وتعالیٰ لوگوں کو جمع کرے گا تو مومن کھڑے ہو جائیں گے یہاں تک کہ جنت ان کے قریب کر دی جائے گی اور وہ آدم ‌علیہ ‌السلام ‌ کے پاس آکر عرض کریں گے : اے والد بزرگ ! ہمارے لیے جنت کا دروازہ کھلوائیے ۔ وہ جواب دیں گے : کیا جنت سے تمہیں نکالنے کا سبب تمہارے باپ آدم کی خطاکے علاوہ کوئی اور چیز بنی تھی! میں اس کام کا اہل نہیں ہوں ۔ میرے بیٹے ، اللہ کے خلیل ابراہیم علیہ السلام کے پاس جاؤ ۔ آپ نے فرمایا : ’’ابراہیم علیہ السلام کہیں گے : اس کام ( کو کرنے ) والا میں نہیں ہوں ، میں خلیل تھا ( مگر اولین شفاعت کے اس منصب سے ) پیچھے پیچھے ۔ تم موسیٰ ‌علیہ ‌السلام ‌ کا رخ کرو ، جن سے اللہ تعالیٰ نے کلام کیا ۔ لوگ موسیٰ ‌علیہ ‌السلام ‌ کے پاس آئیں گے ۔ وہ جواب دیں گے : اس کام ( کو کرنے ) والا میں نہیں ہوں ۔ اللہ تعالیٰ کی روح اور اس کے کلمے عیسیٰ ‌‌علیہ ‌السلام ‌ ‌ کے پاس جاؤ ۔ عیسیٰ ‌‌علیہ ‌السلام ‌ ‌ فرمائیں گے ، میں اس کام ( کو کرنے ) والا نہیں ہوں ۔ تو لوگ محمدﷺ کے پاس آئیں گے ۔ آپ اللہ کے سامنے قیام فرمائیں گے اور آپ کو ( شفاعت کی ) اجازت دی جائے گی ۔ امانت اور قرابت داری کو بھیجا جائے گا ، وہ پل صراط کی دونوں جانب دائیں اوربائیں کھڑی ہو جائیں گی ۔ تم میں سے اولین شخص بجلی کی طرح گزر جائے گا ۔ ‘ ‘ میں نے پوچھا : میرے ماں باپ آپ پر قربان! بجلی گزرنے کی طرح ’’کیا ہے ؟ ‘ ‘ آپ نے فرمایا : ’’تم نے کبھی بجلی کی طرف نہیں دیکھا ، کس طرح پلک جھپکنے میں گزرتی اور لوٹتی ہے ؟ پھر ہوا کے گزرنے کی طرح ( تیزی سے ) پھر پرندہ گزرنے اورآدمی کے دوڑنے کی طرح ، ان کے اعمال ان کو لے کر دوڑیں گے اور تمہارا نبی پل صراط پر کھڑا ہوا کہہ رہا ہو گا : اے میرے رب ! بچا بچا ( میری امت کے ہر گزرنے والے کو سلامتی سے گزار دے ۔ ) حتی کہ بندوں کے اعمال ان کو لے کر گزر نہ سکیں گے یہاں تک کہ ایسا آدمی آئے گاجس میں گھسٹ گھسٹ کر چلنے سے زیادہ کی استطاعت نہ ہوگی ۔ آپ نے فرمایا : ( پل ) صراط کے دونوں کناروں پر لوہے کے آنکڑے معلق ہو ں گے ، وہ اس بات پر مامور ہوں گےکہ جن لوگوں کے بارے میں حکم ہو ان کو پکڑ لیں ، اس طرح بعض زخمی ہو کر نجات پا جائیں گے اور بعض آگ میں دھکیل دیے جائیں گے ۔ ‘ ‘ اس ذات کی قسم جس کے ہاتھ میں ابو ہریرہ کی جان ہے! جہنم کی گہرائی ستر سال ( کی مسافت ) کے برابر ہے ۔",
                "urduNarrator": "ہم سے محمد بن طاریف بن خلیفہ البجلی نے بیان کیا,محمد بن فضیل نے کہا , ہمیں ابو مالک اشجعی نے حدیث سنائی ، انہوں نے ابو حازم سے اور انہوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، نیز ابو مالک نے ربعی بن حراش سے اور انہوں نے حضرت حذیفہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، ان دونوں نے کہاکہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ طَرِيفِ بْنِ خَلِيفَةَ الْبَجَلِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، حَدَّثَنَا أَبُو مَالِكٍ الْأَشْجَعِيُّ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، وَأَبُو مَالِكٍ، عَنْ رِبْعِيٍّ، عَنْ حُذَيْفَةَ، قَالَا: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ [ص:187]: يَجْمَعُ اللهُ تَبَارَكَ وَتَعَالَى النَّاسَ، فَيَقُومُ الْمُؤْمِنُونَ حَتَّى تُزْلَفَ لَهُمُ الْجَنَّةُ، فَيَأْتُونَ آدَمَ، فَيَقُولُونَ: يَا أَبَانَا، اسْتَفْتِحْ لَنَا الْجَنَّةَ، فَيَقُولُ: وَهَلْ أَخْرَجَكُمْ مِنَ الْجَنَّةِ إِلَّا خَطِيئَةُ أَبِيكُمْ آدَمَ، لَسْتُ بِصَاحِبِ ذَلِكَ، اذْهَبُوا إِلَى ابْنِي إِبْرَاهِيمَ خَلِيلِ اللهِ ، قَالَ: فَيَقُولُ إِبْرَاهِيمُ: لَسْتُ بِصَاحِبِ ذَلِكَ، إِنَّمَا كُنْتُ خَلِيلًا مِنْ وَرَاءَ وَرَاءَ، اعْمِدُوا إِلَى مُوسَى صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الَّذِي كَلَّمَهُ اللهُ تَكْلِيمًا، فَيَأْتُونَ مُوسَى صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَيَقُولُ: لَسْتُ بِصَاحِبِ ذَلِكَ، اذْهَبُوا إِلَى عِيسَى كَلِمَةِ اللهِ وَرُوحِهِ، فَيَقُولُ عِيسَى صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: لَسْتُ بِصَاحِبِ ذَلِكَ، فَيَأْتُونَ مُحَمَّدًا صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَيَقُومُ فَيُؤْذَنُ لَهُ، وَتُرْسَلُ الْأَمَانَةُ وَالرَّحِمُ، فَتَقُومَانِ جَنَبَتَيِ الصِّرَاطِ يَمِينًا وَشِمَالًا، فَيَمُرُّ أَوَّلُكُمْ كَالْبَرْقِ قَالَ: قُلْتُ: بِأَبِي أَنْتَ وَأُمِّي أَيُّ شَيْءٍ كَمَرِّ الْبَرْقِ؟ قَالَ: أَلَمْ تَرَوْا إِلَى الْبَرْقِ كَيْفَ يَمُرُّ وَيَرْجِعُ فِي طَرْفَةِ عَيْنٍ؟ ثُمَّ كَمَرِّ الرِّيحِ، ثُمَّ كَمَرِّ الطَّيْرِ، وَشَدِّ الرِّجَالِ، تَجْرِي بِهِمْ أَعْمَالُهُمْ وَنَبِيُّكُمْ قَائِمٌ عَلَى الصِّرَاطِ يَقُولُ: رَبِّ سَلِّمْ سَلِّمْ، حَتَّى تَعْجِزَ أَعْمَالُ الْعِبَادِ، حَتَّى يَجِيءَ الرَّجُلُ فَلَا يَسْتَطِيعُ السَّيْرَ إِلَّا زَحْفًا ، قَالَ: «وَفِي حَافَتَيِ الصِّرَاطِ كَلَالِيبُ مُعَلَّقَةٌ مَأْمُورَةٌ بِأَخْذِ مَنِ اُمِرَتْ بِهِ، فَمَخْدُوشٌ نَاجٍ، وَمَكْدُوسٌ فِي النَّارِ» وَالَّذِي نَفْسُ أَبِي هُرَيْرَةَ بِيَدِهِ إِنَّ قَعْرَ جَهَنَّمَ لَسَبْعُونَ خَرِيفًا",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8047,
                "hadithNumber": "483",
                "englishNarrator": "Anas bin Malik ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: I would be the first among people to intercede in the Paradise and amongst the apostles I would have the largest following (on the Day of Resurrection).",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’لوگوں میں سے سب سے پہلا شخص میں ہوں گا جو جنت کے بارے میں سفارش کرے گا اور تمام انبیاء سے میرے پیروکار زیادہ ہوں گے ۔ ‘ ‘",
                "urduNarrator": "ہم سے قتیبہ بن سعید اور اسحاق بن ابراہیم نے بیان کیا، قتیبہ نے کہا,جریر نےمختار بن فلفل سے ، انہوں نے حضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نےکہا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ قُتَيْبَةُ: حَدَّثَنَا جَرِيرٌ، عَنِ الْمُخْتَارِ بْنِ فُلْفُلٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَنَا أَوَّلُ النَّاسِ يَشْفَعُ فِي الْجَنَّةِ وَأَنَا أَكْثَرُ الْأَنْبِيَاءِ تَبَعًا».",
                "headingArabic": "فِي قَوْلِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَنَا أَوَّلُ النَّاسِ يَشْفَعُ فِي الْجَنَّةِ وَأَنَا أَكْثَرُ الأَنْبِيَاءِ تَبَعًا»",
                "headingUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے اس فرمان کے بارے میں: \"میں جنت کے بارے میں شفاعت کرنے والوں میں سب سے پہلے ہوں گا اور میں سب سے زیادہ پیروکاروں والا نبی ہوں گا۔\"",
                "headingEnglish": "Regarding the saying of the Prophet (saws): \"I will be the first of the people to intercede concerning Paradise, and I will be the Prophet with the Greatest Number of Followers.\"",
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8048,
                "hadithNumber": "484",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Amongst the apostles I would have the largest following on the Day of Resurrection, and I would be the first to knock at the door of Paradise.",
                "hadithUrdu": "اللہ کے رسول! آپ صلی اللہ علیہ وسلم نے فرمایا: ”قیامت کے دن میں سب سے زیادہ انبیاء ہوں گا اور میں سب سے پہلے جنت کا دروازہ کھٹکھٹاؤں گا۔",
                "urduNarrator": "ہم سے ابو کریب محمد بن علاء نے بیان کیا، کہا ہم سے معاویہ بن ہشام نے بیان کیا، انہوں نے سفیان سے، وہ مختار بن فلفل سے، انہوں نے انس بن مالک رضی اللہ عنہ سے، انہوں نے کہا",
                "hadithArabic": "وَحَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ، حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ، عَنْ سُفْيَانَ، عَنْ مُخْتَارِ بْنِ فُلْفُلٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَنَا أَكْثَرُ الْأَنْبِيَاءِ تَبَعًا يَوْمَ الْقِيَامَةِ، وَأَنَا أَوَّلُ مَنْ يَقْرَعُ بَابَ الْجَنَّةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8049,
                "hadithNumber": "485",
                "englishNarrator": "Anas bin Malik ‌رضی ‌اللہ ‌عنہ ‌said:",
                "hadithEnglish": "The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: I would be the first intercessor in the Paradise and no apostle amongst the apostles has been testified (by such a large number of people) as I have been testified. And verily there woald be an apostle among the apostles who would be testified to by only one man from his people.",
                "hadithUrdu": "رسو ل اللہ ﷺ نے فرمایا : ’’جنت کے بارے میں سب سے پہلا سفارش کرنے والا میں ہو ں گا ، انبیاء میں سے کسی نبی کی اتنی تصدیق نہیں کی گئی جتنی میری کی گئی ۔ اور بلاشبہ انبیاء میں ایسا بھی نبی ہوگا جن کی امت ( دعوت ) میں سے ایک شخص ہی ان کی تصدیق کرتا ہو گا ۔ ‘ ‘",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے حسین بن علی نے بیان کیا,زائدہ نےمختار بن فلفل سے روایت کی ، انہوں نے کہا : حضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا کہ",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ، عَنْ زَائِدَةَ، عَنِ الْمُخْتَارِ بْنِ فُلْفُلٍ، قَالَ: قَالَ أَنَسُ بْنُ مَالِكٍ: قَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَنَا أَوَّلُ شَفِيعٍ فِي الْجَنَّةِ، لَمْ يُصَدَّقْ نَبِيٌّ مِنَ الْأَنْبِيَاءِ مَا صُدِّقْتُ، وَإِنَّ مِنَ الْأَنْبِيَاءِ نَبِيًّا مَا يُصَدِّقُهُ مِنْ أُمَّتِهِ إِلَّا رَجُلٌ وَاحِدٌ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8050,
                "hadithNumber": "486",
                "englishNarrator": "Anas bin Malik ‌رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: I will come to the gate of Paradise on the Day of Resurrection. and would seek its opening. and the keeper would say: Who art thou? I would say: Muhammad. He would then say: It is for thee that I have been ordered, and not to open it for anyone before thee.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’میں قیامت کے دن جنت کے دروازے پر آؤں گا او ردروازہ کھلواؤں گا ۔ جنت کا دربان پوچھے گا : آپ کون ہیں؟میں جواب دوں گا : محمد! وہ کہے گا : مجھے آپ ہی کےبارےمیں حکم ملا تھا ( کہ ) آپ سے پہلے کسی کے لیے دروازہ نہ کھولوں ۔ ‘ ‘",
                "urduNarrator": "مجھ سے عمرو ناقد اور زہیر بن حرب نے بیان کیا، کہا کہ ہم سے ہاشم بن القاسم نے بیان کیا، ہم سے سلیمان بن مغیرہ نے بیان کیا,ثابت نے حضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے حدیث بیان کی ، انہوں نے کہا کہ",
                "hadithArabic": "وَحَدَّثَنِي عَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالَا: حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، حَدَّثَنَا سُليْمَانُ بْنُ الْمُغِيرَةِ، عَنْ ثَابِتٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: آتِي بَابَ الْجَنَّةِ يَوْمَ الْقِيَامَةِ فَأَسْتفْتِحُ، فَيَقُولُ الْخَازِنُ: مَنْ أَنْتَ؟ فَأَقُولُ: مُحَمَّدٌ، فَيَقُولُ: بِكَ أُمِرْتُ لَا أَفْتَحُ لِأَحَدٍ قَبْلَكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8051,
                "hadithNumber": "487",
                "englishNarrator": null,
                "hadithEnglish": "Abu Huraira reported: Verity the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: There is for every apostle a (special) prayer with which he would pray. I wish I could reserve, my prayer for intercession of my Ummah on the Day of Resurrection.",
                "hadithUrdu": "مالک بن انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ابن شہاب سے خبر دی ، انہوں نے ابو سلمہ بن عبد الرحمن سے اور انہوں نے حضر ت ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ رسو ل اللہ ﷺ نے فرمایا : ’’ ہر نبی کی ایک ( یقینی ) دعا ہے جو وہ مانگتا ہے ۔ میں چاہتا ہوں کہ میں اپنی دعا کو قیامت کے دن اپنی امت کی سفارش کے لیے محفوظ رکھوں ۔ ‘ ‘",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنِي يُونسُ بْنُ عَبْدِ الْأَعْلى، أَخْبَرَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، قَالَ: َ أَخْبَرَنِي مَالِكُ بْنُ أَنَسٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لِكُلِّ نَبِيٍّ دَعْوَةٌ يَدْعُوهَا، فَأُرِيدُ أَنْ أَخْتَبِئَ دَعْوَتِي شَفَاعَةً لِأُمَّتِي يَوْمَ الْقِيَامَةِ»",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8052,
                "hadithNumber": "488",
                "englishNarrator": "Abu Huraira رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: There is for every apostle a prayer, and I intend (if Allah so willed) that I would reserve my prayer for the intercession of my Ummah on the Day of Resurrection.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’یقیناً ہر نبی کی ایک دعا ہے ( جس کی قبولیت یقینی ہے ۔ ) میں نے ارادہ کیا ہے کہ ان شاءاللہ میں اپنی اس دعا کو قیامت کے روز اپنی امت کی سفارش کرنے کے لیے محفوظ رکھوں گا ۔ ‘ ‘",
                "urduNarrator": "مجھ سے زہیر بن حرب اور عبد بن حمید نے بیان کیا، زہیر نے کہا: ہم سے یعقوب بن ابراہیم نے بیان کیا,( مالک بن ا نس کے بجائے ) ابن شہاب کے بھتیجے نے ابن شہاب سے حدیث سنائی ، انہوں نے کہا : مجھے ابو سلمہ بن عبد الرحمن نے خبر دی کہ حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا",
                "hadithArabic": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَعبْدُ بْنُ حُمَيْدٍ، قَالَ زُهيْرٌ: حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ أَخِي ابْنِ شِهابٍ، عَنْ عَمِّهِ، أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ: قَالَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لِكُلِّ نَبِيٍّ دَعْوَةٌ، وَأَرَدْتُ إِنْ شَاءَ اللهُ أَنْ أَخْتَبِئَ دَعْوَتِي شَفَاعَةً لِأُمَّتِي يَوْمَ الْقِيَامَةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8053,
                "hadithNumber": "489",
                "englishNarrator": null,
                "hadithEnglish": "Amr bin Abu Sufyan transmitted a hadith like this from Abu Huraira رضی ‌اللہ ‌عنہ ‌who narrated it from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌).",
                "hadithUrdu": "ابن شہاب کے بھتیجے نے ابن شہاب سے اور انہوں نے ( ابو سلمہ کے بجائے ) عمرو بن ابی سفیان بن اسید بن جاریہ ثقفی سے اسی کے مانند حدیث حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے ، انہوں نے رسول اللہ ﷺ سے بیان کی ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب اور عبد بن حمید نے بیان کیا کہ ہم سے یعقوب بن ابراہیم نے بیان کیا,",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَعبْدُ بْنُ حُمَيْدٍ، قَالَ زُهَيْرٌ: حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ أَخِي ابْنِ شِهابٍ، عَنْ عمِّهِ، حَدَّثَنِي عَمْرُو بْنِ أَبِي سُفْيَانَ بْنِ أُسَيْدِ بْنِ جَارِيَةَ الثَّقَفِيُّ مِثْلَ ذَلِكَ عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8054,
                "hadithNumber": "490",
                "englishNarrator": "Amr bin Abu Sufyan reported:",
                "hadithEnglish": "Abu Huraira رضی ‌اللہ ‌عنہ ‌said to Ka'b al-Ahbar رضی ‌اللہ ‌عنہ ‌that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had said: For every apostle there Is a (special) prayer by which he would pray (to his Lord). I, however, intend (if Allah so willed) that I would reserve my prayer for the intercession of my Ummah on the Day of Resurrection. Ka'b said to Abu Hurairaرضی ‌اللہ ‌عنہ ‌: Did you hear this from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ )? Abu Huraira رضی ‌اللہ ‌عنہ ‌said: Yes.",
                "hadithUrdu": "حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کعب احبار ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے کہا ، بلاشبہ اللہ کے نبی ﷺ نے فرمایا : ’’ ہر نبی کی ایک ( یقینی ) دعا ہے جو وہ کرتا ہے اور میں چاہتا ہوں کہ ان شاء اللہ میں اپنی دعا قیامت کےدن اپنی امت کی سفارش کے لیے محفوظ رکھوں ۔ ‘ ‘ اس پر کعب نےحضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے پوچھا : آپ نے یہ فرمان ( براہ راست ) رسول اللہ ﷺ سے سنا تھا؟ ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نےجواب دیا : ہاں !",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا,یونس نے ابن شہاب سے خبر دی کہ عمرو بن ابی سفیان ثقفی نےخبر دی کہ",
                "hadithArabic": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَنَّ عَمْرَو بْنَ أَبِي سُفْيَانَ بْنِ أَسِيدِ بْنِ جَارِيَةَ الثَّقَفِيَّ، أَخْبَرَهُ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ لِكَعْبِ الْأَحْبَارِ: إِنَّ نَبِيَّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لِكُلِّ نَبِيٍّ دَعْوَةٌ يَدْعُوهَا، فَأَنَا أُرِيدُ إِنْ شَاءَ اللهُ أَنْ أَخْتَبِئَ دَعْوَتِي شَفَاعَةً لِأُمَّتِي يَوْمَ الْقِيَامَةِ» فَقَالَ كَعْبٌ، لِأَبِي هُرَيْرَةَ: أَنْتَ سَمِعْتَ هَذَا مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ؟ قَالَ أَبُو هُرَيْرَةَ: «نَعَمْ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8055,
                "hadithNumber": "491",
                "englishNarrator": "Abu Huraira رضی ‌اللہ ‌عنہ ‌said:",
                "hadithEnglish": "The Prophet of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: There is for every apostle a prayer which is granted, but every prophet showed haste in his prayer. I have, however, reserved my prayer for the intercession of my Ummah on the Day of Resurrection, and it would be granted, if Allah so willed, in case of everyone amongst my Ummah provided he dies without associating anything with Allah.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’ہر نبی کی ایک دعا ایسی ہے جو ( یقینی طور پر ) قبول کی جانے والی ہے ۔ ہر نبی نےاپنی وہ دعا جلدی مانگ لی ) جبکہ میں نے اپنی دعا قیامت کے دن اپنی امت کی سفارش کے لیے محفوظ کر لی ہے ، چنانچہ یہ دعا ان شاء اللہ میری امت کے ہر اس فرد کو پہنچے گی جو ا للہ کے ساتھ کسی کوشریک نہ کرتے ہوئے فوت ہوا ۔ ‘ ‘",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، اور یہ بات ابو کریب کا ہے، انہوں نے کہا: ہم سے ابو معاویہ نے الاعمش کی سند سے بیان کیا,ابو صالح نےحضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ،، وَاللَّفْظُ لِأَبِي كُرَيْبٍ، قَالَا: حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لِكُلِّ نَبِيٍّ دَعْوَةٌ مُسْتَجَابَةٌ، فَتَعَجَّلَ كُلُّ نَبِيٍّ دَعْوَتَهُ، وَإِنِّي اخْتَبَأْتُ دَعْوَتِي شَفَاعَةً لِأُمَّتِي يَوْمَ الْقِيَامَةِ، فَهِيَ نَائِلَةٌ إِنْ شَاءَ اللهُ مَنْ مَاتَ مِنْ أُمَّتِي لَا يُشْرِكُ بِاللهِ شَيْئًا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8056,
                "hadithNumber": "492",
                "englishNarrator": "Abu Huraira ‌رضی ‌اللہ ‌عنہ said:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Every Messenger is endowed with a prayer which is granted and by which he would (pray to his Lord) and it would he granted for him. I have, however, reserved my prayer for the intercession of my Ummab on the Day of Resurrection.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’ہر نبی کے لیے ایک قبول کی جانے والی دعا ہے ، وہ اسےمانگتا ہے تو ( ضرور ) قبول کی جاتی ہے اور وہ اسے عطا کر دی جاتی ہے ۔ میں نے اپنی دعا قیامت کے دن اپنی امت کی سفارش کے لیے چھپا ( بچا ) کر رکھی ہے ۔ ‘ ‘",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ہم سے جریر نے عمارہ کی سند سے بیان کیا اور وہ ابن ققعاع ہیں,ابو زرعہ ے حضرت ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنْ عُمَارَةَ وَهُوَ ابْنُ الْقَعْقَاعِ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: لِكُلِّ نَبِيٍّ دَعْوَةٌ مُسْتَجَابَةٌ يَدْعُو بِهَا فَيُسْتَجَابُ لَهُ، فَيُؤْتَاهَا، وَإِنِّي اخْتَبَأْتُ دَعْوَتِي شَفَاعَةً لِأُمَّتِي يَوْمَ الْقِيَامَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8057,
                "hadithNumber": "493",
                "englishNarrator": "Abu Huraira ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: There was for every apostle a prayer with which he prayed for his Ummah and it was granted to him; but I wish, if Allah so wills, to defer my prayer for the intercession of my Ummah on the Day of Resurrection.",
                "hadithUrdu": "رسو ل اللہ ﷺنے فرمایا : ’’ہر نبی کی ایک دعا ہے جو اس نے اپنی امت کے بارے میں مانگی اور وہ اس کے لیے قبول ہوئی ۔ اور میں چاہتا ہوں کہ ان شاء اللہ میں اپنی دعا کو قیامت کے دن اپنی امت کی سفارش کے لیے مؤخر کر دوں ۔ ‘ ‘",
                "urduNarrator": "ہم سے عبید اللہ بن معاذ الانباری نے بیان کیا، کہا ہم سے میرے والد نے بیان کیا، ہم سے شعبہ رضی اللہ عنہ نے بیان کیا,محمد بن زیاد نے کہا , میں نے حضرت ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنا ، وہ کہہ رہے تھے کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدٍ وَهُوَ ابْنُ زِيَادٍ، قَالَ: سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لِكُلِّ نَبِيٍّ دَعْوَةٌ دَعَا بِهَا فِي أُمَّتِهِ، فَاسْتُجِيبَ لَهُ، وَإِنِّي أُرِيدُ إِنْ شَاءَ اللهُ أَنْ أُؤَخِّرَ دَعْوَتِي شَفَاعَةً لِأُمَّتِي يَوْمَ الْقِيَامَةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8058,
                "hadithNumber": "494",
                "englishNarrator": "Anas bin Malik ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "Verily the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: There is for every apostle a prayer with which he prays (to Allah) for his Ummah. I have reserved my prayer for the intercession of my Ummah on the Day of Resurrection.",
                "hadithUrdu": "اللہ کے نبی ﷺ نے فرمایا : ’’ہر نبی کی ایک ( یقینی مقبول ) دعا ہے جو اس نے اپنی امت کے لیے کی جبکہ میں نے اپنی دعا قیامت کے روز اپنی امت کی سفارش کے لیے محفوظ کر لی ہے ۔ ‘ ‘",
                "urduNarrator": "مجھ سے ابو غسان المسماعی نے بیان کیا اور ہم سے محمد بن المثنیٰ اور ابن بشار نے بیان کیا اور یہ قول ابو غسان سے ہے,ہشام نے قتادہ سے روایت کی ، انہوں نے کہا : ہمیں انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ نےحدیث سنائی کہ",
                "hadithArabic": "حَدَّثَنِي أَبُو غَسَّانَ الْمِسْمَعِيُّ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ حَدَّثَانَا، وَاللَّفْظُ لِأَبِي غَسَّانَ، قَالُوا: حَدَّثَنَا مُعَاذٌ يَعْنُونَ ابْنَ هِشَامٍ، قَالَ: حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، أَنَّ نَبِيَّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لِكُلِّ نَبِيٍّ دَعْوَةٌ دَعَاهَا لِأُمَّتِهِ، وَإِنِّي اخْتَبَأْتُ دَعْوَتِي شَفَاعَةً لِأُمَّتِي يَوْمَ الْقِيَامَةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8059,
                "hadithNumber": "495",
                "englishNarrator": null,
                "hadithEnglish": "It was also narrated from Qatadah with this chain. Except that in the version of (one of the narrators) Waki, he said: \"He (ﷺ) said: 'Which is given.\"' And in the version of (one of the narrators) Abu Usamah, he said: \"From the Prophet (ﷺ).\"",
                "hadithUrdu": "مجھ سے زہیر بن حرب نے بیان کیا اور ابن ابی خلف نے کہا : ہم سے ایک روح نے بیان کیا ,مذکورہ بالا روایت ( ہشام کے بجائے ) شعبہ نے قتادہ سےباقی ماندہ اسی سند کے ساتھ بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، وَابْنُ أَبِي خَلَفٍ قَالَ: حَدَّثَنَا رَوْحٌ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، بِهَذَا الْإِسْنَادِ. ح.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8060,
                "hadithNumber": "496",
                "englishNarrator": null,
                "hadithEnglish": "Mis'ar transmitted it with the same chain of narrators from Qatada except that in the hadith narrated by Waki' (the Prophet ﷺ) said: He was endowed, and in the hadith reported by Abu Usama (the words are): It is reported from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ).",
                "hadithUrdu": "ابو کریب نے ہم سے کہا,وکیع اور ابو اسامہ نےمسعر سے حدیث سنائی ، انہوں نےقتادہ سے اسی سند کے ساتھ یہی روایت بیان کی ، اتنا فرق ہے کہ وکیع کی روایت کے الفاظ ہیں : ’’ آپ نے فرمایا : ( ہر نبی کو ایک دعا ) ’’عطا کی گئی ہے ‘ ‘ اور ابو اسامہ کی روایت کے الفاظ ہیں : ’’نبی اکرم ﷺ سے روایت ہے ۔ ‘ ‘",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا وَكِيعٌ، ح، وَحَدَّثَنِيهِ إِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ، حَدَّثَنَا أَبُو أُسَامَةَ جَمِيعًا عَنْ مِسْعَرٍ، عَنْ قَتَادَةَ بِهَذَا الْإِسْنَادِ، غَيْرَ أَنَّ فِي حَدِيثِ وَكِيعٍ، قَالَ: قَالَ: أُعْطِيَ، وَفِي حَدِيثِ أَبِي أُسَامَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8061,
                "hadithNumber": "497",
                "englishNarrator": "Muhammad bin 'Abd al-A'la reported it to me: Mu'tamir narrated to us on the authority of his father who transmitted it from Anas ‌رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "Verity the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said, and then narrated the hadith like the one transmitted by Qatada on the authority of Anas رضی ‌اللہ ‌عنہ ‌.",
                "hadithUrdu": "اللہ کے نبی ﷺ نے فرمایا......... آگے کی حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی روایت کی طرح ہے ۔",
                "urduNarrator": "محمد بن عبد العلا نے مجھ سے کہا,معتمر کے والد سلیمان بن طرخان نےحضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى، حَدَّثَنَا الْمُعْتَمِرُ، عَنْ أَبِيهِ، عَنْ أَنَسٍ، أَنَّ نَبِيَّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: فَذَكَرَ نَحْوَ حَدِيثِ قَتَادَةَ، عَنْ أَنَسٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8062,
                "hadithNumber": "498",
                "englishNarrator": "Abu Zubair heard Jabir bin Abdullah ‌رضی ‌اللہ ‌عنہ ‌reporting it from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ):",
                "hadithEnglish": "For every apostle was a prayer with which he prayed (to his Lord) for his Ummah, but I have reserved my prayer for the intercession of my Ummah on the Day of Resurrection.",
                "hadithUrdu": "’’ہر نبی کے لیے ایک دعا ہے جو وہ اپنی امت کے بارے میں کر چکا جبکہ میں نے اپنی دعا قیامت کے دن اپنی امت کی سفارش کےلیے محفوظ کر رکھی ہے ۔ ‘ ‘",
                "urduNarrator": "مجھ سے محمد بن احمد بن ابی خلف نے بیان کیا، کہا ہم سے ایک روح نے بیان کیا، کہا ہم سے ابن جریج نے بیان کیا، انہوں نے کہا: مجھ سے ابو الزبیر نے بیان کیا،حضرت جابر نے عبد اللہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نبی کریم ﷺ سے روایت بیان کرتے ہیں کہ",
                "hadithArabic": "وَحَدَّثَنِي مُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ، حَدَّثَنَا رَوْحٌ، حَدَّثَنَا ابْنُ جُرَيْجٍ، قَالَ: أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ، يَقُولُ: عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، «لِكُلِّ نَبِيٍّ دَعْوَةٌ قَدْ دَعَا بِهَا فِي أُمَّتِهِ، وَخَبَأْتُ دَعْوَتِي شَفَاعَةً لِأُمَّتِي يَوْمَ الْقِيَامَةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8063,
                "hadithNumber": "499",
                "englishNarrator": "Abdullah bin Amr bin al-'As ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "Verily the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) recited the words of Allah, the Great and Glorious, that Ibrahim uttered. My Lord! lo! they have led many of mankind astray: But whoso followeth me, he verily is of me (al-Qur'an, xiv. 35) and Jesus (peace be upon him) said: If thou punisheth them, lo! they are Thy slaves, and if Thou forgiveth them-verily Thou art the Mighty, the Wise (al-Qur'an, v 117). Then he raised his hands and said: O Lord, my Ummah, my Ummah, and wept; so Allah the High and the Exalted said: O Gabriel, go to Muhammad (though your Lord knows it fully well) and ask him: What makes thee weep? So Gabriel (peace be upon him) came to him and asked him, and the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) informed him what he had said (though Allah knew it fully well). Upon this Allah said: O Gabriel, go to Muhammad and say: Verily We will please thee with regard to your Ummah and would not displease thee.",
                "hadithUrdu": "نبیﷺ نےابراہیم علیہ السلام کے بارے میں اللہ تعالیٰ کے فرمان : ’’پروردگار ، ان بتوں نے بہتوں کو گمراہی میں ڈالا ہے ( ممکن ہے کہ میری اولاد کو بھی یہ گمراہ کر دیں ، لہٰذا ان میں سے ) جو میرے طریقے پر چلے وہ میرا ہے اور جو میرے خلاف طریقہ اختیار کرے تو یقیناً تو درگزر کرنے والا مہربان ہے ۔ ‘ ‘ اور عیسیٰ ‌علیہ ‌السلام ‌ کے قول ’’اگر تو انہیں عذاب دے تو وہ تیرے بندے ہیں اور اگر تو انہیں معاف فرما دے تو بلاشبہ توہی غالب حکمت والا ہے ‘ ‘ کی تلاوت فرمائی اور اپنے ہاتھ اٹھ کر فرمایا : ’’ اے اللہ ! میری امت ، میری امت ‘ ‘ اور ( بے اختیار ) روپڑے ۔ اللہ تعالیٰ نےحکم دیا : اے جبرئیل !محمدﷺ کے پاس جاؤ ، جبکہ تمہارا رب زیادہ جاننےوالا ہے ، ان سے پوچھو کہ آپ کو کیا بات رلا رہی ہے ؟ جبریل ‌علیہ ‌السلام ‌ آپ کےپاس آئے اور ( وجہ ) پوچھی تو رسو ل ا للہﷺ نے جو بات کہی تھی ان کو بتائی ، جبکہ وہ ( اللہ اس بات سے ) زیادہ اچھی طرح آگاہ ہے ، اس پر اللہ تعالیٰ نے فرمایا : اے جبریل! محمدﷺ کے پاس جاؤ اور کہو کہ ہم آپ کی امت کے بارے میں آپ کو راضی کریں گے اور ہم آپ کو تکلیف نہ ہونے دیں گے ۔",
                "urduNarrator": "مجھ سے یونس بن عبد العلاء الصدفی نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، انہوں نے کہا: مجھ سے عمرو بن حارث نے بیان کیا کہ ان سے بکر بن سوادہ نے عبدر رحمن بن جبیر کی سند سے بیان کیا,حضرت عبد اللہ بن عمرو بن عاص ‌رضی ‌اللہ ‌عنہ ‌ ‌ سےروایت کہ",
                "hadithArabic": "حَدَّثَنِي يُونُسُ بْنُ عَبْدِ الْأَعْلَى الصَّدَفِيُّ، أَخْبَرَنَا ابْنُ وَهْبٍ، قَالَ: أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، أَنَّ بَكْرَ بْنَ سَوَادَةَ، حَدَّثَهُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرٍ، عَنْ عَبْدِ اللهِ بْنِ عَمْرِو بْنِ الْعَاصِ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: تَلَا قَوْلَ اللهِ عَزَّ وَجَلَّ فِي إِبْرَاهِيمَ: {رَبِّ إِنَّهُنَّ أَضْلَلْنَ كَثِيرًا مِنَ النَّاسِ فَمَنْ تَبِعَنِي فَإِنَّهُ مِنِّي} [إبراهيم: 36] الْآيَةَ، وَقَالَ عِيسَى عَلَيْهِ السَّلَامُ: {إِنْ تُعَذِّبْهُمْ فَإِنَّهُمْ عِبَادُكَ وَإِنْ تَغْفِرْ لَهُمْ فَإِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ} [المائدة: 118]، فَرَفَعَ يَدَيْهِ وَقَالَ: «اللهُمَّ أُمَّتِي أُمَّتِي»، وَبَكَى، فَقَالَ اللهُ عَزَّ وَجَلَّ: «يَا جِبْرِيلُ اذْهَبْ إِلَى مُحَمَّدٍ، وَرَبُّكَ أَعْلَمُ، فَسَلْهُ مَا يُبْكِيكَ؟» فَأَتَاهُ جِبْرِيلُ عَلَيْهِ الصَّلَاةُ وَالسَّلَامُ، فَسَأَلَهُ فَأَخْبَرَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمَا قَالَ، وَهُوَ أَعْلَمُ، فَقَالَ اللهُ: يَا جِبْرِيلُ، اذْهَبْ إِلَى مُحَمَّدٍ، فَقُلْ: إِنَّا سَنُرْضِيكَ فِي أُمَّتِكَ، وَلَا نَسُوءُكَ.",
                "headingArabic": "دُعَاءِ النَّبِيِّ صلى الله عليه وسلم لأُمَّتِهِ وَبُكَائِهِ شَفَقَةً عَلَيْهِمْ ‏‏",
                "headingUrdu": "رسول اللہ صلی اللہ علیہ وسلم کا اپنی امت کے لیے دعا اور ان کے لیے ہمدردی کا رونا",
                "headingEnglish": "The supplication of the Prophet (saws) for his ummah and his weeping out of compassion for them",
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 7751,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=310",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=308",
                "label": "308",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=309",
                "label": "309",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=310",
                "label": "310",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=311",
                "label": "311",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=312",
                "label": "312",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=313",
                "label": "313",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=314",
                "label": "314",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=312",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=312",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=310",
        "to": 7775,
        "total": 40465
    }
}