{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 490,
        "data": [
            {
                "id": 12514,
                "hadithNumber": "4951",
                "englishNarrator": "It has been narrated on the authority of Mughira who said:",
                "hadithEnglish": "I heard the Messenger of Allah (ﷺ) say: A group of people from my Umma will continue to be triumphant over the people until the Command of Allah overtakes them while they are still triumphant.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا: میری امت کا ایک گروہ لوگوں پر غالب نہیں رہے گا جب تک کہ ان پر خدا کا حکم نہ آجائے اور وہ غالب آجائے۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے وکیع نے بیان کیا، ہم سے ح اور ابن نمیر نے بیان کیا، ہم سے وکیع اور عبدہ دونوں نے اسماعیل کی سند سے بیان کیا۔ ہم سے ابن ابی خالد، ایچ ابن ابی عمر نے بیان کیا - اور لفظ ان کے لیے ہے - ہم سے مروان نے بیان کیا - یعنی الفزاری نے - اسماعیل کی سند سے، قیس کی سند سے، المغیرہ، انہوں نے کہا",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا وَكِيعٌ، وَعَبْدَةُ كِلاَهُمَا عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، ح وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا مَرْوَانُ، - يَعْنِي الْفَزَارِيَّ - عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ، عَنِ الْمُغِيرَةِ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ ‏ لَنْ يَزَالَ قَوْمٌ مِنْ أُمَّتِي ظَاهِرِينَ عَلَى النَّاسِ حَتَّى يَأْتِيَهُمْ أَمْرُ اللَّهِ وَهُمْ ظَاهِرُونَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12515,
                "hadithNumber": "4952",
                "englishNarrator": null,
                "hadithEnglish": "Al-Mughirah bin Shibah said: \"I heard the Messenger of Allah ﷺ say...\" a hadith like that of Marwan.",
                "hadithUrdu": "مجھ سے محمد بن رافع نے بیان کیا، مجھ سے ابو اسامہ نے بیان کیا، مجھ سے اسماعیل نے بیان کیا، قیس کی سند سے، انہوں نے کہا: میں نے مغیرہ بن شعبہ رضی اللہ عنہ کو کہتے سنا: میں نے سنا۔ رسول اللہ صلی اللہ علیہ وسلم مروان کی حدیث سے ملتا جلتا کچھ فرماتے ہیں۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنِيهِ مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنِي إِسْمَاعِيلُ، عَنْ قَيْسٍ، قَالَ سَمِعْتُ الْمُغِيرَةَ بْنَ شُعْبَةَ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ بِمِثْلِ حَدِيثِ مَرْوَانَ سَوَاءً ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12516,
                "hadithNumber": "4953",
                "englishNarrator": "It has been narrated on the authority of Jabir bin Samura رضی ﷲ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said: This religion will continue to exist, and a group of people from the Muslims will continue to fight for its protection until the Hour is established.",
                "hadithUrdu": "رسول اﷲ صلی ‌اللہ ‌علیہ ‌وسلم نے فرمایا یہ دین برابر قائم رہے گا اور اس کے اوپر لڑتی رہے گی ایک جماعت ( کافروں سے اور مخالفوں سے ) مسلمانوں کی قیامت ہوئے تک۔",
                "urduNarrator": "ہم سے محمد بن المثنیٰ اور محمد بن بشار نے بیان کیا، کہا: ہم سے محمد بن جعفر نے بیان کیا، ہم سے شعبہ نے بیان کیا، سماک بن حرب سے, جابر بن سمرہ رضی ﷲ عنہ سے روایت ہے",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏ ‏ لَنْ يَبْرَحَ هَذَا الدِّينُ قَائِمًا يُقَاتِلُ عَلَيْهِ عِصَابَةٌ مِنَ الْمُسْلِمِينَ حَتَّى تَقُومَ السَّاعَةُ.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12517,
                "hadithNumber": "4954",
                "englishNarrator": "It has been narrated on the authority of Jabir bin 'Abdullah who said:",
                "hadithEnglish": "I heard the Messenger of Allah (ﷺ) say: A group of people from my Umma will continue to fight In defense of truth and remain triumphant until the Day of judgment.",
                "hadithUrdu": "میں نے سنا رسول اﷲ صلی ‌اللہ ‌علیہ ‌وسلم سے آپ فرماتے تھے ہمیشہ ایک گروہ میری امت کا حق پر لڑتا رہے گا قیامت تک۔",
                "urduNarrator": "مجھ سے ہارون بن عبداللہ اور حجاج بن الشاعر نے بیان کیا، انہوں نے کہا کہ ہم سے حجاج بن محمد نے بیان کیا، انہوں نے ابن جریج نے کہا کہ مجھ سے ابو الزبیر نے بیان کیا, جابر بن عبدﷲ سے روایت ہے",
                "hadithArabic": "حَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، وَحَجَّاجُ بْنُ الشَّاعِرِ، قَالاَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ ‏ لاَ تَزَالُ طَائِفَةٌ مِنْ أُمَّتِي يُقَاتِلُونَ عَلَى الْحَقِّ ظَاهِرِينَ إِلَى يَوْمِ الْقِيَامَةِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12518,
                "hadithNumber": "4955",
                "englishNarrator": "It his been narrated on the authority of Umair bin Umm Hani who said:",
                "hadithEnglish": "I heard Mu'awiya رضی ‌اللہ ‌عنہ say (while delivering a sermon from the pulpit) that he heard the Messenger of Allah (ﷺ) say: A group of people from my Umma will continue to obey Allah's Command, and those who desert or oppose them shall not be able to do them any harm. They will be dominating the people until Allah's Command is executed (i. e. Resurrection is established).",
                "hadithUrdu": "میں نے معاویہ رضی ‌اللہ ‌عنہ سے سنا منبر پر، وہ کہتے تھے میں نے سنا رسول اﷲؐ سے آپ فرماتے تھے ہمیشہ ایک گروہ میری امت کا اﷲ کے حکم پر قائم رہے گا جو کوئی ان کو بگاڑنا چاہے وہ کچھ بگاڑ نہ سکے گا یہاں تک کہ اﷲ کا حکم آن پہنچے اور وہ غالب رہیں گے لوگوں پر۔",
                "urduNarrator": "ہم سے منصور بن ابی مزاحم نے بیان کیا، کہا ہم سے یحییٰ بن حمزہ نے بیان کیا، وہ عبدالرحمٰن بن یزید بن جابر سے, عمیر بن ہانی سے روایت ہے",
                "hadithArabic": "حَدَّثَنَا مَنْصُورُ بْنُ أَبِي مُزَاحِمٍ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، بْنِ جَابِرٍ أَنَّ عُمَيْرَ بْنَ هَانِئٍ، حَدَّثَهُ قَالَ سَمِعْتُ مُعَاوِيَةَ، عَلَى الْمِنْبَرِ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ ‏ لاَ تَزَالُ طَائِفَةٌ مِنْ أُمَّتِي قَائِمَةً بِأَمْرِ اللَّهِ لاَ يَضُرُّهُمْ مَنْ خَذَلَهُمْ أَوْ خَالَفَهُمْ حَتَّى يَأْتِيَ أَمْرُ اللَّهِ وَهُمْ ظَاهِرُونَ عَلَى النَّاسِ.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12519,
                "hadithNumber": "4956",
                "englishNarrator": "Yazid bin al-Asamm said:",
                "hadithEnglish": "He heard Mu'awiya bin Abu Sufyan رضی ‌اللہ ‌عنہ quote a tradition from the Prophet (ﷺ) which he related from the Prophet (ﷺ) and he did not hear him quote from the Prophet (ﷺ) any tradition other than this in the course of his sermon from the pulpit-that whom Allah wants to do a favor, He grants him an understanding of religion. A group of people from the Muslims will remain on the Right Path and continue until the Day of Judgment to triumph over those who oppose them.",
                "hadithUrdu": "میں نے معاویہ بن ابی سفیان رضی ‌اللہ ‌عنہ  کو کہتے سنا: رسول اﷲ صلی ‌اللہ ‌علیہ ‌وسلم نے فرمایا جس شخص کی اﷲ تعالیٰ بھلائی چاہتا ہے اس کو دین میں سمجھ دیتا ہے اور ہمیشہ ایک جماعت مسلمانوں کی حق پر لڑتی رہے گی او رغالب رہے گی ان پر جو ان سے لڑیں قیامت تک۔",
                "urduNarrator": "ہم سے اسحاق بن منصور نے بیان کیا، کہا ہم سے کثیر بن ہشام نے بیان کیا، کہا کہ ہم سے جعفر جو کہ ابن برقان ہیں، کہا ہم سے یزید بن العصام نے بیان کیا، انہوں نے کہا",
                "hadithArabic": "وَحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا كَثِيرُ بْنُ هِشَامٍ، حَدَّثَنَا جَعْفَرٌ،- وَهُوَ ابْنُ بُرْقَانَ - حَدَّثَنَا يَزِيدُ بْنُ الأَصَمِّ، قَالَ سَمِعْتُ مُعَاوِيَةَ بْنَ أَبِي سُفْيَانَ، ذَكَرَ حَدِيثًا رَوَاهُ عَنِ النَّبِيِّ صلى الله عليه وسلم لَمْ أَسْمَعْهُ رَوَى عَنِ النَّبِيِّ صلى الله عليه وسلم عَلَى مِنْبَرِهِ حَدِيثًا غَيْرَهُ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ ‏ مَنْ يُرِدِ اللَّهُ بِهِ خَيْرًا يُفَقِّهْهُ فِي الدِّينِ وَلاَ تَزَالُ عِصَابَةٌ مِنَ الْمُسْلِمِينَ يُقَاتِلُونَ عَلَى الْحَقِّ ظَاهِرِينَ عَلَى مَنْ نَاوَأَهُمْ إِلَى يَوْمِ الْقِيَامَةِ.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12520,
                "hadithNumber": "4957",
                "englishNarrator": "It has been narrated on the authority of 'Abdul-Rahman bin Shamasa al- Mahri who said:",
                "hadithEnglish": "I was in the company of Maslama bin Mukhallad, and 'Abdullah bin 'Amr bin 'As was with him. 'Abdullah رضی ‌اللہ ‌عنہ said: The Hour shall some only when the worst type of people are left on the earth. They will be worse than the people of pre-Islamic days. They will get whatever they ask of Allah. While we were yet sitting when 'Uqba bin 'Amir came, and Maslama said to him: 'Uqba, listen to what 'Abdullah says. 'Uqba said: He knows better; so far as I am concerned, I heard the Messenger of Allah (ﷺ) say: A group of people from my Umma will continue to fight in obedience to the Command of Allah, remaining dominant over their enemies. Those who will oppose them shall not do them any harm. They will remain ill this condition until the Hour overtakes them. (At this) 'Abdullah رضی ‌اللہ ‌عنہ said: Yes. Then Allah will raise a wild which will be fragrant like musk and whose touch will be like the touch of silk; (but) it will cause the death of all (faithful) persons, not leaving behind a single person with an iota of faith in his heart. Then only the worst of men will remain to be overwhelmed by the Hour.",
                "hadithUrdu": "میں مسلمہ بن مخلدون کے پاس بیٹھا تھا ان کے پاس عبدﷲ بن عمرو بن العاص تھے۔ عبدﷲ رضی ‌اللہ ‌عنہ نے کہا قیامت قائم نہ ہوگی مگر بدترین خلق ﷲ پر وہ بدتر ہوں گے جاہلیت والوں سے ﷲ تعالیٰ سے جس بات کی دعا کریں گے ﷲ تعالیٰ ان کو دے دے گا۔ لوگ اسی حال میں تھے کہ عقبہ بن عامر آئے مسلمہ نے ان سے کہا اے عقبہ عبدﷲ کیا کہتے ہیں؟عقبہ نے کہا وہ مجھ سے زیادہ جانتے ہیں پر میں نے تو رسول ﷲؐ سے سنا ہے آپ فرماتے تھے ہمیشہ میری امت کا ایک گروہ یا ایک جماعت ﷲ کے حکم پر لڑتی رہے گی اور اپنے دشمن پر غالب رہے گی جو کوئی ان کا خلاف کرے گا ان کو کچھ نقصان نہ پہنچاسکے گا یہاں تک کہ قیامت آجاوے گی اور وہ اسی حال میں ہوں گے۔ عبدﷲ رضی ‌اللہ ‌عنہ نے کہا بے شک ( حضرت نے ایسا فرمایا ) لیکن پھر ﷲ ایک ہوا بھیجے گا جس میں مشک کی سی بو ہوگی اور ریشم کی طرح بدن پر لگے گی وہ نہ چھوڑے گی، کسی شخص کو جس کے دل میں ایک دانے برابر بھی ایمان ہوگا بلکہ اس کو مارے جاوے گی بعد اس کے سب برے کافر لوگ رہ جاویں گے انہی پر قیامت قائم ہوگی۔",
                "urduNarrator": "مجھ سے احمد بن عبدالرحمٰن بن وہب نے بیان کیا، کہا ہم سے میرے چچا عبداللہ بن وہب نے بیان کیا، کہا ہم سے عمرو بن حارث نے بیان کیا، مجھ سے یزید بن ابی نے بیان کیا۔ پیارے عبدالرحمن بن شماسہ مہری سے روایت ہے",
                "hadithArabic": "حَدَّثَنِي أَحْمَدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ وَهْبٍ، حَدَّثَنَا عَمِّي عَبْدُ اللَّهِ بْنُ وَهْبٍ، حَدَّثَنَا عَمْرُو بْنُ الْحَارِثِ، حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ، حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ شُمَاسَةَ الْمَهْرِيُّ، قَالَ كُنْتُ عِنْدَ مَسْلَمَةَ بْنِ مُخَلَّدٍ وَعِنْدَهُ عَبْدُ اللَّهِ بْنُ عَمْرِو بْنِ الْعَاصِ فَقَالَ عَبْدُ اللَّهِ لاَ تَقُومُ السَّاعَةُ إِلاَّ عَلَى شِرَارِ الْخَلْقِ هُمْ شَرٌّ مِنْ أَهْلِ الْجَاهِلِيَّةِ لاَ يَدْعُونَ اللَّهَ بِشَىْءٍ إِلاَّ رَدَّهُ عَلَيْهِمْ ‏.‏ فَبَيْنَمَا هُمْ عَلَى ذَلِكَ أَقْبَلَ عُقْبَةُ بْنُ عَامِرٍ فَقَالَ لَهُ مَسْلَمَةُ يَا عُقْبَةُ اسْمَعْ مَا يَقُولُ عَبْدُ اللَّهِ ‏.‏ فَقَالَ عُقْبَةُ هُوَ أَعْلَمُ وَأَمَّا أَنَا فَسَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ ‏ لاَ تَزَالُ عِصَابَةٌ مِنْ أُمَّتِي يُقَاتِلُونَ عَلَى أَمْرِ اللَّهِ قَاهِرِينَ لِعَدُوِّهِمْ لاَ يَضُرُّهُمْ مَنْ خَالَفَهُمْ حَتَّى تَأْتِيَهُمُ السَّاعَةُ وَهُمْ عَلَى ذَلِكَ ‏ ‏ ‏.‏ فَقَالَ عَبْدُ اللَّهِ أَجَلْ ‏.‏ ثُمَّ يَبْعَثُ اللَّهُ رِيحًا كَرِيحِ الْمِسْكِ مَسُّهَا مَسُّ الْحَرِيرِ فَلاَ تَتْرُكُ نَفْسًا فِي قَلْبِهِ مِثْقَالُ حَبَّةٍ مِنَ الإِيمَانِ إِلاَّ قَبَضَتْهُ ثُمَّ يَبْقَى شِرَارُ النَّاسِ عَلَيْهِمْ تَقُومُ السَّاعَةُ ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12521,
                "hadithNumber": "4958",
                "englishNarrator": "It has been narrated by Sa'd bin Abu Waqqas رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "The Messenger of Allah (ﷺ) said: The people of the West will continue to triumphantly follow the truth until the Hour is established.",
                "hadithUrdu": "رسول ﷲؐ نے فرمایا ہمیشہ مغرب والے ( عینی عرب یا شام والے ) حق پر غالب رہیں گے یہاں تک کہ قیامت قائم ہوگی۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا ہم سے ہشیم نے بیان کیا، وہ داؤد بن ابی ہند کی سند سے، وہ ابو عثمان کی سند سے, سعد بن ابی وقاص رضی ‌اللہ ‌عنہ سے روایت ہے",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ، عَنْ أَبِي عُثْمَانَ، عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ ‏ لاَ يَزَالُ أَهْلُ الْغَرْبِ ظَاهِرِينَ عَلَى الْحَقِّ حَتَّى تَقُومَ السَّاعَةُ.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12522,
                "hadithNumber": "4959",
                "englishNarrator": "It has been narrated on the authority of Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: When you journey through a fertile land, you should (go slow and) give the camels a chance to graze in the land. When you travel In an arid (land) where there is scarcity of vegetation, you should quicken their pace (lest your camels grow feeble and emaciated for lack of fodder). When you halt for the night, avoid (pitching your tent on) the road, for it is the abode of noxious little animals at night.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم شادابی ( کے زمانے ) میں سفر کرو تو زمین میں سے اونٹوں کو ان کا حصہ دو اور جب تم خشک سالی ( یا قحط زدہ زمین ) میں سفر کرو تو اس زمین پر سے جلدی گزرو اور جب تم رات کے آخری حصے میں منزل کرو تو گزر گاہ سے ہٹ جاؤ کیونکہ رات کو وہ ( راستے کی ) جگہ حشرات الارض کا ٹھکانا ہوتی ہے ، \" ( وہاں اپنی خوراک کے حصول کے لیے آتے ہیں ۔ )",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، انہوں نے ہم سے بیان کیا: جریر نے سہیل سے ، انہوں نے اپنے والد سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا سَافَرْتُمْ فِي الْخِصْبِ، فَأَعْطُوا الْإِبِلَ حَظَّهَا مِنَ الْأَرْضِ، وَإِذَا سَافَرْتُمْ فِي السَّنَةِ، فَأَسْرِعُوا عَلَيْهَا السَّيْرَ، وَإِذَا عَرَّسْتُمْ بِاللَّيْلِ، فَاجْتَنِبُوا الطَّرِيقَ، فَإِنَّهَا مَأْوَى الْهَوَامِّ بِاللَّيْلِ».",
                "headingArabic": "مُرَاعَاةِ مَصْلَحَةِ الدَّوَابِّ فِي السَّيْرِ وَالنَّهْىِ عَنِ التَّعْرِيسِ فِي الطَّرِيقِ ‏‏",
                "headingUrdu": "سفر کرتے وقت جانوروں کی صحت کو مدنظر رکھنا، اور رات کے آخر میں سڑک پر رکنے کی ممانعت۔",
                "headingEnglish": "Keeping animals' well being in mind when traveling, and the prohibition of halting in the road at the end of the night.",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12523,
                "hadithNumber": "4960",
                "englishNarrator": "It has been narrated (through another chain of transmitters) on the authority of Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: When you travel (through a land) where there is plenty of vegetation, you should (go slow and) give the camels a chance to enjoy the benefit of the earth. When you travel (through a land) where there is scarcity of vegetation, you should hasten with them (so that you may be able to cross that land while your animals ore still in a good condition of health). When you make a halt for the night, avoid (doing so on) the road, for the tracks are the pathways of wild beasts or the abode of noxious little animals.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم شادابی ( کے زمانے ) میں سفر کرو تو زمین سے اونٹوں کو ان کا حصہ دو اور جب تم خشک سالی میں سفر کرو تو اس ( سے متاثرہ علاقے میں ) سے ان ( اونٹوں کی ٹانگوں ) کا گودا بچا کر لے جاؤ ( تیز رفتاری سے نکل جاؤ تاکہ زیادہ عرصہ بھوکے رہ کر وہ کمزور نہ ہو جائیں ) اور جب تم رات کے آخری حصے میں قیام کرو تو گزرگاہ میں ٹھہرنے سے اجتناب کرو کیونکہ رات کے وقت وہ جگہ جانوروں کی گزر گاہ اور حشرات الارض کی آماجگاہ ہوتی ہے ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, عبدالعزیز بن محمد نے سہیل سے ، انہوں نے اپنے والد سے ، انہوں نے ابوہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُحَمَّدٍ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا سَافَرْتُمْ فِي الْخِصْبِ، فَأَعْطُوا الْإِبِلَ حَظَّهَا مِنَ الْأَرْضِ، وَإِذَا سَافَرْتُمْ فِي السَّنَةِ، فَبَادِرُوا بِهَا نِقْيَهَا، وَإِذَا عَرَّسْتُمْ، فَاجْتَنِبُوا الطَّرِيقَ، فَإِنَّهَا طُرُقُ الدَّوَابِّ، وَمَأْوَى الْهَوَامِّ بِاللَّيْلِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12524,
                "hadithNumber": "4961",
                "englishNarrator": "On the authority of Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Travelling is a tortuous experience. It deprives a person of his sleep. his food and drink. When one of you has accomplished his purpose, he should hasten his return to his family. He (Imam Malik) said: Yes.",
                "hadithUrdu": "یحییٰ بن یحییٰ تمیمی نے کہا : میں نے امام مالک سے پوچھا : سمی نے آپ کو ابوصالح کے واسطے سے ابوہریرہ رضی اللہ عنہ سے روایت بیان کی تھی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" سفر عذاب کا ایک ٹکڑا ہے ، وہ تم میں سے ایک ( مسافر ) کو سونے ، کھانے اور پینے سے روک دیتا ہے ، جب تم میں سے کوئی شخص وہ کام سر انجام دے چکے جو اس کے پیشِ نظر تھا تو وہ جلد اپنے گھر آئے \" ؟ انہوں ( امام مالک ) نے کہا : ہاں ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، وَإِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، وَأَبُو مُصْعَبٍ الزُّهْرِيُّ، وَمَنْصُورُ بْنُ أَبِي مُزَاحِمٍ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، قَالُوا: حَدَّثَنَا مَالِكٌ، ح وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَاللَّفْظُ لَهُ، قَالَ: قُلْتُ لِمَالِكٍ، حَدَّثَكَ سُمَيٌّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «السَّفَرُ قِطْعَةٌ مِنَ الْعَذَابِ، يَمْنَعُ أَحَدَكُمْ نَوْمَهُ وَطَعَامَهُ وَشَرَابَهُ، فَإِذَا قَضَى أَحَدُكُمْ نَهْمَتَهُ مِنْ وَجْهِهِ، فَلْيُعَجِّلْ إِلَى أَهْلِهِ»، قَالَ: نَعَمْ.",
                "headingArabic": "السَّفَرِ قِطْعَةٌ مِنَ الْعَذَابِ وَاسْتِحْبَابِ تَعْجِيلِ الْمُسَافِرِ إِلَى أَهْلِهِ بَعْدَ قَضَاءِ شُغْلِهِ",
                "headingUrdu": "سفر ایک قسم کا عذاب ہے، اور مسافر کے لیے مستحب ہے کہ وہ اپنا کاروبار ختم کرنے کے بعد اپنے گھر والوں کے پاس واپس چلے۔",
                "headingEnglish": "Travel is a kind of torment, and it is recommended for the traveler to hasten back to his family after finishing his business",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12525,
                "hadithNumber": "4962",
                "englishNarrator": "It has been narrated on the authority of Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) would not come (back) to his family by night. He would come to them in the morning or in the evening.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم رات کو اپنے گھر والوں پر دستک نہ دیتے تھے ۔ آپ ( سفر سے گھر والوں کے پاس ) صبح کو یا شام کو تشریف لاتے تھے ۔",
                "urduNarrator": "مجھ سے ابوبکر بن ابی شیبہ نے بیان کیا, یزید بن ہارون نے ہمام سے حدیث بیان کی ، انہوں نے اسحٰق بن عبداللہ بن ابی طلحہ سے ، انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ هَمَّامٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ لَا يَطْرُقُ أَهْلَهُ لَيْلًا، وَكَانَ يَأْتِيهِمْ غُدْوَةً، أَوْ عَشِيَّةً».",
                "headingArabic": "كَرَاهَةِ الطُّرُوقِ وَهُوَ الدُّخُولُ لَيْلاً لِمَنْ وَرَدَ مِنْ سَفَرٍ ‏‏",
                "headingUrdu": "سفر سے گھر آتے وقت رات کو داخل ہونا ناپسندیدہ ہے۔",
                "headingEnglish": "It is disliked to enter at night when coming home from a journey",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12526,
                "hadithNumber": "4963",
                "englishNarrator": "A similar report was narrated from Anas bin Malik رضی اللہ عنہ, from the prophet ﷺ but  he said:",
                "hadithEnglish": "(He) would not enter (upon his household at night).",
                "hadithUrdu": "( گھروں ) داخل نہ ہوتے تھے ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب نے کہا, عبدالصمد بن عبدالوارث نے کہا : ہمیں حمام نے حدیث بیان کی ، کہا : ہمیں اسحٰق بن عبداللہ بن ابی طلحہ نے حضرت انس بن مالک رضی اللہ عنہ سے ، انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ، البتہ انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا إِسْحَاقُ بْنُ عَبْدِ اللهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ، غَيْرَ أَنَّهُ قَالَ: كَانَ لَا يَدْخُلُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12527,
                "hadithNumber": "4964",
                "englishNarrator": "It has been narrated on the authority of Jabir bin 'Abdullah رضی اللہ عنہ who said:",
                "hadithEnglish": "We accompanied the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) on an expedition. When we came (back) to Medina and were going to enter our houses, he said: Wait and enter (your houses) in the later part of the evening so that a woman with disheveled hair may have used the comb, and a woman whose husband has been away from home may have removed the hair from her private parts.",
                "hadithUrdu": "ہم ایک غزوے میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے ، جب ہم مدینہ پہنچے تو ہم گھروں کے اندر داخل ہونے کے لیے جانے لگے تو آپ نے فرمایا : \" رک جاؤ ، حتی کہ ہم ( کچھ تاخیر سے ) رات کے وقت ، یعنی عشاء کے وقت جائیں تاکہ بکھرے بالوں والی اپنے بال سنوار لے اور اور شوہر کی غیر موجودگی میں رہنے والی اپنی صفائی کرے ۔ \"",
                "urduNarrator": "اسماعیل بن سالم نے مجھ سے کہا, ہشیم نے سیار سے ، انہوں نے ( عامر ) شعبی سے ، انہوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي إِسْمَاعِيلُ بْنُ سَالِمٍ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا سَيَّارٌ، ح وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَاللَّفْظُ لَهُ، حَدَّثَنَا هُشَيْمٌ، عَنْ سَيَّارٍ، عَنِ الشَّعْبِيِّ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، قَالَ: كُنَّا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي غَزَاةٍ، فَلَمَّا قَدِمْنَا الْمَدِينَةَ ذَهَبْنَا لِنَدْخُلَ، فَقَالَ: «أَمْهِلُوا حَتَّى نَدْخُلَ لَيْلًا - أَيْ عِشَاءً - كَيْ تَمْتَشِطَ الشَّعِثَةُ، وَتَسْتَحِدَّ الْمُغِيبَةُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12528,
                "hadithNumber": "4965",
                "englishNarrator": "It has been narrated on the authority of Jabir رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: If one of you comes (back from a journey) at night. he should not enter his house as a night visitor (but should wait) until a woman whose husband has been away from house has removed the hair from her private parts and a woman with disheveled hair has combed her hair.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم میں سے کوئی شخص رات کے وقت گھر واپس آئے تو رات کو ( اچانک ) اپنے گھر میں داخل نہ ہو ( بلکہ اتنی دیر توقف کرے ) کہ شوہر کی غیر حاضری میں رہنے والی اپنی صفائی کر لے اور الجھے بالوں والی بال سنوار لے ۔ \"",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا, عبدالصمد نے کہا : ہمیں شعبہ نے سیار سے حدیث بیان کی ، انہوں نے عامر ( شعبی ) سے ، انہوں نے حضرت جابر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنِي عَبْدُ الصَّمَدِ، حَدَّثَنَا شُعْبَةُ، عَنْ سَيَّارٍ، عَنْ عَامِرٍ، عَنْ جَابِرٍ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا قَدِمَ أَحَدُكُمْ لَيْلًا، فَلَا يَأْتِيَنَّ أَهْلَهُ طُرُوقًا، حَتَّى تَسْتَحِدَّ الْمُغِيبَةُ، وَتَمْتَشِطَ الشَّعِثَةُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12529,
                "hadithNumber": "4966",
                "englishNarrator": null,
                "hadithEnglish": "Shubah narrated, sayyar narrated a similar hadith (as no. 4965) with this chain of narration.",
                "hadithUrdu": "مجھ سے یحییٰ بن حبیب نے کہا, روح بن عبادہ نے کہا : ہمیں شعبہ نے حدیث بیان کی ، کہا : ہمیں سیار نے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِيهِ يَحْيَى بْنُ حَبِيبٍ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا سَيَّارٌ، بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12530,
                "hadithNumber": "4967",
                "englishNarrator": "It was narrated that Jabir رضی اللہ عنہ said:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade that a man who had long absent should come to his family like (an unexpected) night visitor.",
                "hadithUrdu": "جب کوئی انسان لمبا وقت گھر سے دور رہا ہو تو رسول اللہ صلی اللہ علیہ وسلم نے اسے رات کو اچانک گھر میں داخل ہونے سے منع فرمایا ۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا, محمد بن جعفر نے کہا ,  ہمیں شعبہ نے عاصم سے حدیث بیان کی ، انہوں نے شعبی سے ، انہوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدٌ يَعْنِي ابْنَ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَاصِمٍ، عَنِ الشَّعْبِيِّ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، قَالَ: «نَهَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِذَا أَطَالَ الرَّجُلُ الْغَيْبَةَ، أَنْ يَأْتِيَ أَهْلَهُ طُرُوقًا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12531,
                "hadithNumber": "4968",
                "englishNarrator": null,
                "hadithEnglish": "Shubah narrated it with this chain (a Hadith similar to no. 4967).",
                "hadithUrdu": "مجھ سے یحییٰ بن حبیب نے کہا, روح نے کہا : ہمیں شعبہ نے اسی سند کے ساتھ حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِيهِ يَحْيَى بْنُ حَبِيبٍ، حَدَّثَنَا رَوْحٌ، حَدَّثَنَا شُعْبَةُ، بِهَذَا الْإِسْنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12532,
                "hadithNumber": "4969",
                "englishNarrator": "It was narrated that Jabir رضی اللہ عنہ said:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade that a man should come to his family like (an unexpected) night visitor doubting their fidelity and spying into their lapses.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے اس بات سے منع فرمایا ہے کہ انسان رات کو ( اچانک ) گھر والوں کے پاس جا پہنچے اور ان کو خیانت ( جس طرح خاوند نے کہا ہوا ہے ، اس طرح نہ رہنے ) کا مرتکب سمجھے اور ان کی کمزوریاں ڈھونڈے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, وکیع نے سفیان سے ، انہوں نے محارب سے ، انہوں نے حضرت جابر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ مُحَارِبٍ، عَنْ جَابِرٍ، قَالَ: «نَهَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ يَطْرُقَ الرَّجُلُ أَهْلَهُ لَيْلًا يَتَخَوَّنُهُمْ، أَوْ يَلْتَمِسُ عَثَرَاتِهِمْ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12533,
                "hadithNumber": "4970",
                "englishNarrator": "Sufyan narrated with this chain of narration that 'Abdur Rahman said:",
                "hadithEnglish": "I do not know if it in the hadith or not, meaning (the words) doubting their fidelity and spying into their lapses.",
                "hadithUrdu": "\" ان کو خیانت کا مرتکب سمجھے اور ان کی کمزوریاں تلاش کرے \" کے الفاظ حدیث میں ہیں یا نہیں ۔",
                "urduNarrator": "مجھ سے محمد بن المثنیٰ نے بیان کیا, عبدالرحمٰن نے کہا : ہمیں سفیان نے اسی سند کے ساتھ حدیث بیان کی ۔ عبدالرحمٰن نے کہا , سفیان نے کہا : مجھے معلوم نہیں کہ",
                "hadithArabic": "وحَدَّثَنِيهِ مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، بِهَذَا الْإِسْنَادِ، قَالَ عَبْدُ الرَّحْمَنِ: قَالَ سُفْيَانُ: «لَا أَدْرِي هَذَا فِي الْحَدِيثِ أَمْ لَا، يَعْنِي أَنْ يَتَخَوَّنَهُمْ، أَوْ يَلْتَمِسَ عَثَرَاتِهِمْ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12534,
                "hadithNumber": "4971",
                "englishNarrator": "It was narrated from Jabir رضی اللہ عنہ , from the prophet ﷺ, that:",
                "hadithEnglish": "The undesirability of coining to one's house like a night visitor, but does not contain the words: Doubting their fidelity or spying into their lapses.",
                "hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم سے ( اچانک ) رات کو گھر آنے کی کراہت بیان کی اور یہ جملہ بیان نہیں کیا ,  ان کو خائن سمجھے اور ان کی کمزوریاں تلاش کرے ۔",
                "urduNarrator": "ہم سے محمد بن المثنیٰ نے بیان کیا، ہم سے محمد بن جعفر نے بیان کیا، اور ہم سے عبید اللہ بن معاذ نے بیان کیا، ہم سے میرے والد نے بیان کیا، سب نے کہا: ہمیں شعبہ نے محارب سے حدیث بیان کی ، انہوں نے حضرت جابر رضی اللہ عنہ سے ، انہوں نے",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ح وحَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، قَالَا جَمِيعًا: حَدَّثَنَا شُعْبَةُ، عَنْ مُحَارِبٍ، عَنْ جَابِرٍ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِكَرَاهَةِ الطُّرُوقِ، وَلَمْ يَذْكُرْ: يَتَخَوَّنُهُمْ، أَوْ يَلْتَمِسُ عَثَرَاتِهِمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12535,
                "hadithNumber": "4972",
                "englishNarrator": "Adi bin Hatim رضی اللہ عنہ reported:",
                "hadithEnglish": "I said: Messenger of Allah, I set off trained dogs and they catch for me (the game) and I recite the name of Allah over it (I slaughter the game by reciting Bismillah-i-Allah-o-Akbar), whereupon he said: When you set off your trained dogs, if you recited the name of Allah (while setting them off), then eat (the game). I said: Even if they (the trained dogs) kill that (the game)? He (the Holy Prophet) said: Even if these kill, but (on the condition) that no other dog, which you did not set off (along with your dogs), participates (in catching the game). I said to him: I throw Mi'rad, a heavy featherless blunt arrow, for hunting and killing (the game). Thereupon he said: When you throw Mi'rad, and it pierces, then eat, but if it falls flatly (and beats the game to death), then do not eat that.",
                "hadithUrdu": "میں نے عرض کی : اللہ کےرسول صلی اللہ علیہ وسلم ! میں سدھائے ہوئے کتوں کو چھوڑتا ہوں ۔ وہ میرے لئے شکار کو قابو کرلیتے ہیں ۔ اور میں اس پر اللہ کا نام بھی لیتا ہوں ۔ ( بسم اللہ پڑھتا ہوں ) آپ صلی اللہ علیہ وسلم نے فرمایا؛ \" جب تم اپنا سدھایا ہوا کتا چھوڑ دو اور اس پر بسم اللہ پڑھ لو تو پھر اس کو کھالو ۔ \" میں نے کہا : خواہ وہ کتے شکار کو مار ڈالیں؟آپ صلی اللہ علیہ وسلم نے فرمایا : خواہ وہ شکار کو مارڈالیں ، جب تک کوئی اور کتا ، جو ان کے ساتھ نہیں ( بھیجا گیا ) ، اُن کے ساتھ شریک نہ ہوجائے ۔ \" میں نے عرض کی : میں شکار کو موٹی لکڑی کے نوکدار بغیر پروں کے تیر کا نشان بناتا ہوں اور اسے مار لیتا ہوں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم بغیر پروں والا تیر مارو اور وہ اس کے جسم کو چھید دے ( خون نکل جائے ) تو اس کو کھالو اور اگر وہ اسے چوڑائی کی طرف سے نشانہ بنائے اور مارڈ الے تو مت کھاؤ ۔ \"",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم الحنظَلی نے بیان کیا، کہا ہم سے جریر نے منصور کی سند سے اور ابراہیم کی سند سے, ہمام بن حارث نے حضرت عدی بن حاتم رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ هَمَّامِ بْنِ الْحَارِثِ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ: قُلْتُ: يَا رَسُولَ اللهِ، إِنِّي أُرْسِلُ الْكِلَابَ الْمُعَلَّمَةَ، فَيُمْسِكْنَ عَلَيَّ، وَأَذْكُرُ اسْمَ اللهِ عَلَيْهِ، فَقَالَ: «إِذَا أَرْسَلْتَ كَلْبَكَ الْمُعَلَّمَ، وَذَكَرْتَ اسْمَ اللهِ عَلَيْهِ فَكُلْ»، قُلْتُ: وَإِنْ قَتَلْنَ؟ قَالَ: «وَإِنْ قَتَلْنَ، مَا لَمْ يَشْرَكْهَا كَلْبٌ لَيْسَ مَعَهَا» قُلْتُ لَهُ: فَإِنِّي أَرْمِي بِالْمِعْرَاضِ الصَّيْدَ، فَأُصِيبُ، فَقَالَ: «إِذَا رَمَيْتَ بِالْمِعْرَاضِ فَخَزَقَ فَكُلْهُ، وَإِنْ أَصَابَهُ بِعَرْضِهِ، فَلَا تَأْكُلْهُ.",
                "headingArabic": "الصَّيْدِ بِالْكِلاَبِ الْمُعَلَّمَةِ ‏‏",
                "headingUrdu": "تربیت یافتہ کتوں اور تیروں سے شکار کرنا",
                "headingEnglish": "Hunting with trained dogs and arrows",
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12536,
                "hadithNumber": "4973",
                "englishNarrator": "Adi bin Hatim رضی اللہ عنہ reported:",
                "hadithEnglish": "I asked Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saying: We are a people who hunt with these (trained) dogs, then (what should we do)? Thereupon he (the Holy Prophet ﷺ) said: When you set of your trained dogs having recited the name of Allah, then eat what these (hounds) have caught for you, even if it (the game) is killed, provided (the hunting dog) has not eaten (any part of the game). If it has eaten (the game), then you don't eat it as I fear that it might have caught for its own self. And do not eat it if other dogs have joined your trained dogs.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سوال کیا کہ ہم لوگ ان کتوں سے شکار کرتے ہیں؟آپ نے فرمایا : \" جب تم اپنے سدھائے ہوئے کتے چھوڑ دو اور اس پر بسم اللہ پڑھ لو تو جو ( شکار ) وہ تمھارے لئے پکڑیں چاہے وہ اسے ماردیں ، تم اسے کھالو ، الا یہ کہ کتا ( اس میں سے ) کچھ خود کھالے ۔ اگر وہ کھا لے تو تم نہ کھاؤ ۔ کیونکہ مجھے خدشہ ہے کہ اس نے اپنے لئے ( شکار ) پکڑا ہوگا ۔ اگر دوسرے کتے ان کے ساتھ شامل ہوگئے ہیں تو مت کھاؤ ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے ابن فضیل نے بیان کیا, بیا ن نے شعبی سے ، انھوں نے عدی بن حاتم رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ فُضَيْلٍ، عَنْ بَيَانٍ، عَنِ الشَّعْبِيِّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ: سَأَلْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قُلْتُ: إِنَّا قَوْمٌ نَصِيدُ بِهَذِهِ الْكِلَابِ، فَقَالَ: «إِذَا أَرْسَلْتَ كِلَابَكَ الْمُعَلَّمَةَ، وَذَكَرْتَ اسْمَ اللهِ عَلَيْهَا، فَكُلْ مِمَّا أَمْسَكْنَ عَلَيْكَ، وَإِنْ قَتَلْنَ، إِلَّا أَنْ يَأْكُلَ الْكَلْبُ، فَإِنْ أَكَلَ فَلَا تَأْكُلْ، فَإِنِّي أَخَافُ أَنْ يَكُونَ إِنَّمَا أَمْسَكَ عَلَى نَفْسِهِ، وَإِنْ خَالَطَهَا كِلَابٌ مِنْ غَيْرِهَا، فَلَا تَأْكُلْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12537,
                "hadithNumber": "4974",
                "englishNarrator": "Adi bin Hatim رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "He asked the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) about (hunting) with the help of an arrow having a stub end. He said: If it strikes (the game) with its point, then eat, but if it strikes flatly and it dies, that is Waqidh (beaten into death), do not eat that. I asked the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) about (hunting with the help of) dogs, whereupon he said. When you send your dog (for hunting) reciting the name of Allah, then eat (the game), but if some part of it is eaten (by the dogs, then do not eat that, for it (your dog) has caught that (the-game) for itself. I (again) said: If I find along with my dog another dog, and do not know which of (the dogs) has caught (the game). then (what should I do)? Thereupon he ('Allah's Messenger) said: Then don't eat that, for you recited the name of Allah on your dog and not on the other one.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے بغیر پر والے تیر کے متعلق سوال کیا ۔ آپ نےفرمایا : \" جب اس نے اپنے ( چھیدنے والے ) تیز حصے کے ذریعے سے نشانہ بنایا ہوتو کھا لو اور اگر اپنی چوڑائی سے نشانہ بنا کر ماردیا ہو ۔ تووہ چوٹ لگنے سے مرا ہوا ( شکار ) ہے ، اسے نہ کھاؤ ۔ \" اور میں نے رسول اللہ صلی اللہ علیہ وسلم سے کتے کے ( شکار پر ) اپناکتا چھوڑ دو اور اس پر بسم اللہ پڑھو تو اس کو کھا لو ، اگر کتے نے اس ( شکار ) میں سے کچھ کھا لیا ہے تو اس کو مت کھاؤ ، کیونکہ کتے نے اس ( شکار ) کو اپنے لئے پکڑا ہے ۔ \" میں نے کہا اگر میں اپنے کتے کے ساتھ ایک اور کتے کو بھی دیکھوں اور مجھے پتہ نہ چلے کہ دونوں میں سے کس نے شکار کیا ہے؟آپ نے فرمایا : \" پھر تم نہ کھاؤ ، کیونکہ تم نے صرف اپنے کتے پر بسم اللہ پڑھی ہے ، دوسرے کتے پر بسم اللہ نہیں پڑھی ۔ \"",
                "urduNarrator": "عبید اللہ بن معاذ عنبری نے کہا : ہمیں شعبہ نے عبداللہ ابی سفر سے حدیث بیان کی ، انھوں نے شعبی سے ، انھوں نے عدی بن حاتم رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وحَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ اللهِ بْنِ أَبِي السَّفَرِ، عَنِ الشَّعْبِيِّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ: سَأَلْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ الْمِعْرَاضِ، فَقَالَ: «إِذَا أَصَابَ بِحَدِّهِ فَكُلْ، وَإِذَا أَصَابَ بِعَرْضِهِ فَقَتَلَ، فَإِنَّهُ وَقِيذٌ، فَلَا تَأْكُلْ» وَسَأَلْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ الْكَلْبِ، فَقَالَ: «إِذَا أَرْسَلْتَ كَلْبَكَ، وَذَكَرْتَ اسْمَ اللهِ فَكُلْ، فَإِنْ أَكَلَ مِنْهُ فَلَا تَأْكُلْ، فَإِنَّهُ إِنَّمَا أَمْسَكَ عَلَى نَفْسِهِ»، قُلْتُ: فَإِنْ وَجَدْتُ مَعَ كَلْبِي كَلْبًا آخَرَ، فَلَا أَدْرِي أَيُّهُمَا أَخَذَهُ؟ قَالَ: «فَلَا تَأْكُلْ، فَإِنَّمَا سَمَّيْتَ عَلَى كَلْبِكَ، وَلَمْ تُسَمِّ عَلَى غَيْرِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12538,
                "hadithNumber": "4975",
                "englishNarrator": "Adi bin Hatim رضی اللہ عنہ reported:",
                "hadithEnglish": "I asked Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) about Mi'rad (i.e. hunting with the help of arrow having a stub end, and he stated the same (as we find in the previous hadith).",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے بغیر پر والے تیر کے متعلق سوا ل کیا ، پھر اسی کے مانند بیان کیا ۔",
                "urduNarrator": "ہم سے یحییٰ بن ایوب نے بیان کیا, ابن علیہ نے کہا : مجھے شعبہ نے عبداللہ بن ابی سفر سےخبر دی ، انھوں نے کہا : میں نے شعبی کو کہتے ہوئے سنا ، کہا : میں نے حضرت عدی بن حاتم رضی اللہ عنہ کو یہ کہتے ہوئے سناکہ",
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، حَدَّثَنَا ابْنُ عُلَيَّةَ، قَالَ: وَأَخْبَرَنِي شُعْبَةُ، عَنْ عَبْدِ اللهِ بْنِ أَبِي السَّفَرِ، قَالَ: سَمِعْتُ الشَّعْبِيَّ، يَقُولُ: سَمِعْتُ عَدِيَّ بْنَ حَاتِمٍ، يَقُولُ: سَأَلْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ الْمِعْرَاضِ، فَذَكَرَ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 12226,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=489",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=487",
                "label": "487",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=488",
                "label": "488",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=489",
                "label": "489",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=490",
                "label": "490",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=491",
                "label": "491",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=492",
                "label": "492",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=493",
                "label": "493",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=491",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=491",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=489",
        "to": 12250,
        "total": 40465
    }
}