{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 578,
        "data": [
            {
                "id": 14714,
                "hadithNumber": "7153",
                "englishNarrator": null,
                "hadithEnglish": "It was narrated from Al-Amash with this chain of narrators (a Hadith similar to no. 7152), as far as the words \"...like musk.\"",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا, ابو معاویہ نے اعمش سے اسی سند کے ساتھ آپ صلی اللہ علیہ وسلم کے فرمان : \" کستوری کے پسینے کی طرح \" تک روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ إِلَى قَوْلِهِ كَرَشْحِ الْمِسْكِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14715,
                "hadithNumber": "7154",
                "englishNarrator": "Jabir bin Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said that the inmates of Paradise would eat therein and they would also drink, but they would neither void excrement, nor suffer catarrh, nor pass water, and their eating (would be digested) in the form of belching and their sweat would be musk aged they would glorify and praise Allah as easily as you breathe.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ، \" اہل جنت اس میں کھائیں اور پئیں گے ۔ ( لیکن ) وہ اس میں رفع حاجت کریں گے ۔ نہ ناک سنکیں گے ۔ نہ پیشاب کریں گے البتہ ان کا کھانا ذکاء ( کی شکل میں تحلیل ) ہوجائے گا ۔ جو مشک کی طرح خوشبودارہو گی ۔ انھیں ( خود بخود ) اللہ کی پاکیزگی اور اس کی حمد کرنا الہام کیا جا ئے گا جس طرح انھیں ( خود بخود ) سانس لینا الہام کیا گیا ہے ۔ \"",
                "urduNarrator": "حسن بن علی حلوانی اور حجاج بن شاعر دونوں نے مجھے ابو عاصم سے روایت کی ۔ حسن نے کہا : ہمیں ابو عاصم نے حدیث بیان کی کہا : ابن جریج سے روایت ہے انھوں نے کہا : مجھے ابو زبیر نے بتایا کہ انھوں نے حضرت جابرعبد اللہ رضی اللہ عنہ سے سنا ، وہ کہتے ہیں کہ",
                "hadithArabic": "و حَدَّثَنِي الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ وَحَجَّاجُ بْنُ الشَّاعِرِ كِلَاهُمَا عَنْ أَبِي عَاصِمٍ قَالَ حَسَنٌ حَدَّثَنَا أَبُو عَاصِمٍ عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْكُلُ أَهْلُ الْجَنَّةِ فِيهَا وَيَشْرَبُونَ وَلَا يَتَغَوَّطُونَ وَلَا يَمْتَخِطُونَ وَلَا يَبُولُونَ وَلَكِنْ طَعَامُهُمْ ذَاكَ جُشَاءٌ كَرَشْحِ الْمِسْكِ يُلْهَمُونَ التَّسْبِيحَ وَالْحَمْدَ كَمَا تُلْهَمُونَ النَّفَسَ قَالَ وَفِي حَدِيثِ حَجَّاجٍ طَعَامُهُمْ ذَلِكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14716,
                "hadithNumber": "7155",
                "englishNarrator": "A similar report (as Hadith no. 7154) was from Jabir رضی اللہ عنہ from the Prophet ﷺexcept that he said:",
                "hadithEnglish": "\"....And they will glorify and praise Allah as easily as breathing.\"",
                "hadithUrdu": "\" اور انھیں تسبیح و تکبیر اسی طرح الہام کی جائےگی جس طرح سانس لینا الہام کیا جاتا ہے ۔",
                "urduNarrator": "سعید بن یحییٰ نے کہا : ہمیں ابن جریج نے حدیث بیان کی کہا : مجھے ابو زبیر نے حضرت جابر رضی اللہ عنہ سے خبردی ، انھوں نے نبی صلی اللہ علیہ وسلم سے ( حدیث ) روایت کی مگر انھوں نےکہا",
                "hadithArabic": "و حَدَّثَنِي سَعِيدُ بْنُ يَحْيَى الْأُمَوِيُّ حَدَّثَنِي أَبِي حَدَّثَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ عَنْ جَابِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ وَيُلْهَمُونَ التَّسْبِيحَ وَالتَّكْبِيرَ كَمَا تُلْهَمُونَ النَّفَسَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14717,
                "hadithNumber": "7156",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who would get into Paradise (would be made to enjoy such an everlasting) bliss that he would neither become destitute, nor would his clothes wear out, nor his youth would decline.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" جو شخص جنت میں داخل ہو گا وہ ناز و نعم میں ہو گا کبھی تنگ حال نہ ہو گا ۔ اس کا لباس پرانا ہو گا نہ اس کی جوانی ڈھلے گی ۔ \"",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے عبدالرحمٰن بن مہدی نے بیان کیا، ہم سے حماد بن سلمہ نے ثابت کی سند سے, ابو رافع نے حضرت ابو ہریرہ رضی اللہ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ ثَابِتٍ عَنْ أَبِي رَافِعٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ يَدْخُلُ الْجَنَّةَ يَنْعَمُ لَا يَبْأَسُ لَا تَبْلَى ثِيَابُهُ وَلَا يَفْنَى شَبَابُهُ.",
                "headingArabic": "فِي دَوَامِ نَعِيمِ أَهْلِ الْجَنَّةِ وَقَوْله تَعَالَى وَنُودُوا أَنْ تِلْكُمْ الْجَنَّةُ أُورِثْتُمُوهَا بِمَا كُنْتُمْ تَعْمَلُونَ",
                "headingUrdu": "اہل جنت کی دائمی لذت، اور وہ آیت جس میں اللہ تعالیٰ فرماتا ہے: \"اور ان کو اعلان کیا جائے گا: یہ وہ جنت ہے جس کا وارث تم نے کیا تھا\"",
                "headingEnglish": "The Eternal Delight Of The People Of Paradise, And The Verse In Which Allah Says: \"And It Will Be Announced To Them: This Is The Paradise Which You Have Inherited For What You Used To Do\"",
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14718,
                "hadithNumber": "7157",
                "englishNarrator": "Abu Sa'id al-Khudri and Abu Huraira رضی اللہ عنہ both reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: There would be an announcer (in Paradise) who would make this announcement: Verily I there is in store for you (everlasting) health and that you should never fall ill and that you live (for ever) and do not die at all. And that you would remain young and never grow old. And that you would always live in affluent circumstances and never become destitute, as words of Allah, the Exalted and Glorious, are: And it would be announced to them: This is the Paradise. You have been made to inherit it for what you used to do . (VII; 43)",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" ایک اعلان کرنے والااعلان کرے گا ۔ یقیناًتمھارے لیے یہ ( انعام بھی ) ہے کہ تم ہمیشہ صحت مند رہو گے ۔ کبھی بیمار نہ پڑوگے ، اور یہ بھی تمھارے لیے ہے کہ زندہ رہوگے ۔ کبھی موت کا شکار نہیں ہو گے ۔ اور یہ بھی تمھارے لیے ہے کہ جوان رہو گے ۔ کبھی بوڑھے نہ ہوگے ۔ اور یہ بھی تمھارے لیے ہے کہ ہمیشہ ناز و نعم میں رہوگے ۔ کبھی زحمت نہ دیکھو گے ۔ \" یہی اللہ عزوجل کا فرمان ( واضح کرتا ) ہے : \" اور انھیں ندادے کرکہاجائے گاکہ یہی تمھاری جنت ہے جس کے تم ان اعمال کی وجہ سے سے جو تم کرتے رہے وارث بنا دیے گئے ہو ۔ \"",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم اور عبد بن حمید نے بیان کیا - اور لفظ اسحاق کا ہے - انہوں نے کہا: ہمیں عبد الرزاق نے خبر دی, ثوری نے کہا : مجھے ابو اسحٰق نے حدیث بیان کی ، ( ابو ہریرہ رضی اللہ تعالیٰ عنہ کے آزاد کردہ غلام ) اغر ( ابن عبد اللہ ) نے انھیں حضرت ابو سعید خدری اور حضرت ابو ہریرہ رضی اللہ عنہ سےروایت کی ، انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَعَبْدُ بْنُ حُمَيْدٍ وَاللَّفْظُ لِإِسْحَقَ قَالَا أَخْبَرَنَا عَبْدُ الرَّزَّاقِ قَالَ قَالَ الثَّوْرِيُّ فَحَدَّثَنِي أَبُو إِسْحَقَ أَنَّ الْأَغَرَّ حَدَّثَهُ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ وَأَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يُنَادِي مُنَادٍ إِنَّ لَكُمْ أَنْ تَصِحُّوا فَلَا تَسْقَمُوا أَبَدًا وَإِنَّ لَكُمْ أَنْ تَحْيَوْا فَلَا تَمُوتُوا أَبَدًا وَإِنَّ لَكُمْ أَنْ تَشِبُّوا فَلَا تَهْرَمُوا أَبَدًا وَإِنَّ لَكُمْ أَنْ تَنْعَمُوا فَلَا تَبْأَسُوا أَبَدًا فَذَلِكَ قَوْلُهُ عَزَّ وَجَلَّ وَنُودُوا أَنْ تِلْكُمْ الْجَنَّةُ أُورِثْتُمُوهَا بِمَا كُنْتُمْ تَعْمَلُونَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14719,
                "hadithNumber": "7158",
                "englishNarrator": "Abu Bakr bin Abdullah bin Qais reported on the authority of his father:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said that in Paradise there would be for a believer a tent of a single hollowed pearl the breadth of which would be sixty miles. It would be meant for a believer and the believers would go around it and none would be able to see the others.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" مومن کے لیے جنت میں ایک خیمہ ہو گا ۔ جو ایک پولے چمکتے سفید موتی کا بناہوا ہوگا ۔ اس کی لمبائی ستر میل ہو گی ۔ اس ( خیمے ) میں مومن کے بہت سے گھروالے ہوں گے ۔ وہ ( باری باری ) ان کے ہاں چکرلگائےگا ۔ ( لیکن ) وہ ( اس قدر فاصلے پہ ہوں گےکہ ) ایک دوسرے کو نہیں دیکھتے ہوں گے ۔ ( کسی کا بھی دل پریشانی یاحسد کا شکار نہ ہو گا ۔ )",
                "urduNarrator": "ہم سے سعید بن منصور نے بیان کیا, ابو قدامہ حارث بن عبید نے ابو عمران جونی سے ، انھوں نے ابو بکر بن عبد اللہ بن قیس سے ، انھوں نے اپنے والد ( ابو موسیٰ اشعری رضی اللہ تعالیٰ عنہ ) سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ عَنْ أَبِي قُدَامَةَ وَهُوَ الْحَارِثُ بْنُ عُبَيْدٍ عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ اللَّهِ بْنِ قَيْسٍ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ لِلْمُؤْمِنِ فِي الْجَنَّةِ لَخَيْمَةً مِنْ لُؤْلُؤَةٍ وَاحِدَةٍ مُجَوَّفَةٍ طُولُهَا سِتُّونَ مِيلًا لِلْمُؤْمِنِ فِيهَا أَهْلُونَ يَطُوفُ عَلَيْهِمْ الْمُؤْمِنُ فَلَا يَرَى بَعْضُهُمْ بَعْضًا.",
                "headingArabic": "فِي صِفَةِ خِيَامِ الْجَنَّةِ وَمَا لِلْمُؤْمِنِينَ فِيهَا مِنَ الأَهْلِينَ",
                "headingUrdu": "جنت کے خیمے اور وہ بیویاں جو ان میں اہل ایمان کی ہوں گی۔",
                "headingEnglish": "The Tents Of Paradise, And The Wives That The Believers Will Have In Them",
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14720,
                "hadithNumber": "7159",
                "englishNarrator": "Abu Bakr bin Abdullah bin Qais reported on the authority of his father:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said that in Paradise there would be a tent made of a single hollowed pearl, the breadth of which would be sixty miles from all sides and there would live a family in each corner and the other would not be able to see the believer who goes around them.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جنت میں کھوکھلے چمکدار سفید موتی کا خیمہ ہو گا ۔ اس کی چوڑائی ساٹھ میل ہو گی ۔ اس کے ہر کونے میں گھر والے ہوں گےوہ ایک دوسرے کو نہیں دیکھتے ہوں گے ۔ مومن ان کے ہاں چکرلگایا کرے گا ۔",
                "urduNarrator": "مجھ سے ابو غسان المسمعی نے بیان کیا، انہوں نے کہا: ابو عبد الصمد نے کہا : ہمیں ابو عمران جونی نے ابو بکر بن عبد اللہ بن قیس سے اور انھوں نے اپنے والد سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنِي أَبُو غَسَّانَ الْمِسْمَعِيُّ حَدَّثَنَا أَبُو عَبْدِ الصَّمَدِ حَدَّثَنَا أَبُو عِمْرَانَ الْجَوْنِيُّ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ اللَّهِ بْنِ قَيْسٍ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي الْجَنَّةِ خَيْمَةٌ مِنْ لُؤْلُؤَةٍ مُجَوَّفَةٍ عَرْضُهَا سِتُّونَ مِيلًا فِي كُلِّ زَاوِيَةٍ مِنْهَا أَهْلٌ مَا يَرَوْنَ الْآخَرِينَ يَطُوفُ عَلَيْهِمْ الْمُؤْمِنُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14721,
                "hadithNumber": "7160",
                "englishNarrator": "This hadith has been transmitted on the authority of Abu Bakr bin Abu Musa bin Qais who, on the authority of his father:",
                "hadithEnglish": "The Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: there would be a tent made of a pearl whose height towards the sky would be sixty miles. In each corner, there would be a family of the believer, out of sight for the others.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" خیمہ ایک موتی ( کا ) ہوگا اوپر کی طرف اس کی لمبائی ( بلندی ) ساٹھ میل ہوگی ۔ اس کے ہر کونے میں مومن کے گھروالے ہوں گے ، وہ دوسروں کو نہیں دیکھیں گے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے یزید بن ہارون نے بیان کیا, ہمام نے ابو عمران جونی سے خبر دی انھوں نے ابو بکر بن ابوموسیٰ بن قیس سے انھوں نے اپنے والد ( ابو موسیٰ رضی اللہ عنہ ) سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا هَمَّامٌ عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ عَنْ أَبِي بَكْرِ بْنِ أَبِي مُوسَى بْنِ قَيْسٍ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْخَيْمَةُ دُرَّةٌ طُولُهَا فِي السَّمَاءِ سِتُّونَ مِيلًا فِي كُلِّ زَاوِيَةٍ مِنْهَا أَهْلٌ لِلْمُؤْمِنِ لَا يَرَاهُمْ الْآخَرُونَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14722,
                "hadithNumber": "7161",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Saihan, Jaihan, Euphrates and Nile are all among the rivers of Paradise.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" سیحان ، جیحان ، فرات اور نیل سب جنت کی ( طرف سے آنے والی ) نہریں ہیں ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ان سے ابواسامہ، عبداللہ بن نمیر اور علی بن مشیر نے عبید اللہ بن عمر رضی اللہ عنہما سے بیان کیا۔ ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا، ہم سے محمد بن بشر نے بیان کیا، ہم سے عبیداللہ نے بیان کیا، ان سے خبیب بن عبدالرحمٰن نے بیان کیا، وہ حفص بن عاصم کی سند سے, حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ وَعَبْدُ اللَّهِ بْنُ نُمَيْرٍ وَعَلِيُّ بْنُ مُسْهِرٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ و حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ حَفْصِ بْنِ عَاصِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَيْحَانُ وَجَيْحَانُ وَالْفُرَاتُ وَالنِّيلُ كُلٌّ مِنْ أَنْهَارِ الْجَنَّةِ.",
                "headingArabic": "مَا فِي الدُّنْيَا مِنْ أَنْهَارِ الْجَنَّةِ",
                "headingUrdu": "اس دنیا میں جنت کی نہریں۔",
                "headingEnglish": "Rivers Of Paradise In This World",
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14723,
                "hadithNumber": "7162",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: There would enter Paradise people whose hearts would be like those of the hearts of birds.",
                "hadithUrdu": "آپ نے فرمایا : \" جنت میں ایسی قومیں ( امتیں جماعتیں ) داخل ہوں کی جن کے دل پرندوں کے دلوں کی طرح ہوں گے ۔ \"",
                "urduNarrator": "ہم سے حجاج بن شاعر نے بیان کیا، ہم سے ابو الندر ہاشم بن القاسم لیثی نے بیان کیا، ان سے ابراہیم نے بیان کیا، ہم سے ابن سعد نے بیان کیا، ہم سے میرے والد نے ابو سلمہ کی سند سے بیان کیا, حضرت ابو ہریرہ رضی اللہ عنہ نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا حَجَّاجُ بْنُ الشَّاعِرِ حَدَّثَنَا أَبُو النَّضْرِ هَاشِمُ بْنُ الْقَاسِمِ اللَّيْثِيُّ حَدَّثَنَا إِبْرَاهِيمُ يَعْنِي ابْنَ سَعْدٍ حَدَّثَنَا أَبِي عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَدْخُلُ الْجَنَّةَ أَقْوَامٌ أَفْئِدَتُهُمْ مِثْلُ أَفْئِدَةِ الطَّيْرِ.",
                "headingArabic": "يَدْخُلُ الْجَنَّةَ أَقْوَامٌ أَفْئِدَتُهُمْ مِثْلُ أَفْئِدَةِ الطَّيْرِ",
                "headingUrdu": "جنت میں وہ لوگ داخل ہوں گے جن کے دل پرندوں کے دلوں کی طرح ہوں گے۔",
                "headingEnglish": "People Will Enter Paradise Whose Hearts Are Like The Hearts Of Birds",
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14724,
                "hadithNumber": "7163",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Allah, the Exalted and Glorious, created Adam in His image with His length of sixty cubits, and as He created him He told him to greet that group, and that was a party of angels sitting there, and listen to the response that they give him, for it would form his greeting and that of his offspring. He then went away and said: Peace be upon you! They (the angels) said: May there be peace upon you and the Mercy of Allah, and they made an addition of Mercy of Allah . So he who would get into Paradise would get in the form of Adam, his length being sixty cubits, then the people who followed him continued to diminish in size up to this day.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ عزوجل نے حضرت آدم علیہ السلام کو اپنی ( پسندیدہ ) صورت پر پیدا فرمایا ، ان کا قد ساٹھ ہاتھ تھا جب ان کو تخلیق فرمالیا تو فرمایا : جائیں اور اس ( سامنے والی ) جماعت کو سلام کہیں ۔ اور وہ فرشتوں کی جماعت ہے جو بیٹھے ہوئے ہیں اور جس طرح وہ آپ کو سلام کہیں اسے غور سے سنیں ، وہی آپ کا اور آپ کی اولاد کا سلام ہو گا ۔ فرمایا وہ گئے اور کہا : السلام عليك انھوں نے ( جواب میں ) کہا : السلام عليك ورحمة الله فرمایا : انھوں نےان ( آدم علیہ السلام ) کے لیے ورحمة الله کا اضافہ کیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" ہر وہ شخص جو جنت میں داخل ہو گا آدم علیہ السلام کی ( اسی ) صورت پر ہوگا اور ان کی قامت ( جنت میں ) ساٹھ ہاتھ تھی پھر ان کے بعد آج تک ( ان کی اولاد کی ) خلقت چھوٹی ہوتی رہی ہے ۔ \"",
                "urduNarrator": "ہم سے محمد بن رافع نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، ہم سے معمر نے بیان کیا, ہمام بن منبہ سے روایت ہے انھوں نے کہا : یہ وہ احادیث ہیں جو ہمیں حضرت ابو ہریرہ رضی اللہ عنہ نے نبی صلی اللہ علیہ وسلم سے بیان کیں ان میں سے ( ایک ) یہ ہے کہ اور",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ قَالَ هَذَا مَا حَدَّثَنَا بِهِ أَبُو هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَلَقَ اللَّهُ عَزَّ وَجَلَّ آدَمَ عَلَى صُورَتِهِ طُولُهُ سِتُّونَ ذِرَاعًا فَلَمَّا خَلَقَهُ قَالَ اذْهَبْ فَسَلِّمْ عَلَى أُولَئِكَ النَّفَرِ وَهُمْ نَفَرٌ مِنْ الْمَلَائِكَةِ جُلُوسٌ فَاسْتَمِعْ مَا يُجِيبُونَكَ فَإِنَّهَا تَحِيَّتُكَ وَتَحِيَّةُ ذُرِّيَّتِكَ قَالَ فَذَهَبَ فَقَالَ السَّلَامُ عَلَيْكُمْ فَقَالُوا السَّلَامُ عَلَيْكَ وَرَحْمَةُ اللَّهِ قَالَ فَزَادُوهُ وَرَحْمَةُ اللَّهِ قَالَ فَكُلُّ مَنْ يَدْخُلُ الْجَنَّةَ عَلَى صُورَةِ آدَمَ وَطُولُهُ سِتُّونَ ذِرَاعًا فَلَمْ يَزَلْ الْخَلْقُ يَنْقُصُ بَعْدَهُ حَتَّى الْآنَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14725,
                "hadithNumber": "7164",
                "englishNarrator": "Abdullah bin Mas`ud رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Hell would be brought on that day (the Day of Judgment) with seventy thousand bridles, and seventy thousand angels dragging each bridle.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اس ( قیامت کے ) روز جہنم کو لایا جائے گا ، اس کی ستر ہزار لگامیں ہوں گی ، ہر کام کے ساتھ ستر ہزار فرشتے ہوں گے جو اسے کھینچ رہے ہوں گے ۔ \"",
                "urduNarrator": "ہم سے عمر بن حفص بن غیاث نے بیان کیا، ہم سے میرے والد نے علاء بن خالد کاہلی سے اور شقیق کی سند سے بیان کیا, حضرت عبداللہ ( بن مسعود رضی اللہ عنہ ) سے روایت ہے ، کہا",
                "hadithArabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ حَدَّثَنَا أَبِي عَنْ الْعَلَاءِ بْنِ خَالِدٍ الْكَاهِلِيِّ عَنْ شَقِيقٍ عَنْ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُؤْتَى بِجَهَنَّمَ يَوْمَئِذٍ لَهَا سَبْعُونَ أَلْفَ زِمَامٍ مَعَ كُلِّ زِمَامٍ سَبْعُونَ أَلْفَ مَلَكٍ يَجُرُّونَهَا.",
                "headingArabic": "فِي شِدَّةِ حَرِّ نَارِ جَهَنَّمَ وَبُعْدِ قَعْرِهَا وَمَا تَأْخُذُ مِنَ الْمُعَذَّبِينَ",
                "headingUrdu": "جہنم کے بارے میں - اللہ ہمیں اس سے محفوظ رکھے",
                "headingEnglish": "About Hell - May Allah Protect Us From It",
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14726,
                "hadithNumber": "7165",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: The fire which sons of Adam burn is only one-seventieth part of the Fire of Hell. His Companions said: By Allah, even ordinary fire would have been enough (to burn people). Thereupon he said: It is sixty-nine parts in excess of (the heat of) fire in this world each of them being equivalent to their heat.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا : \" تمہاری یہ آگ ۔ جس کو ابن آدم روشن کرتاہے ۔ جہنم کی گرمی کے سترحصوں میں سے ایک حصے ( کی حرارت ) کے برابر ہے ۔ \" انھوں ( صحابہ ) نے عرض کی : یارسول اللہ صلی اللہ علیہ وسلم ! اللہ کی قسم!یہ لوگ بھی تو کافی تھی ، آپ صلی اللہ علیہ وسلم نے فرمایا : \" اسے انہتر حصے زیادہ رکھا گیا ہے ، ہرحصہ اس ( دنیا کی آگ ) کے مانند گرم ہے ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا: المغیرہ، یعنی ہم سے ابن عبدالرحمٰن حزامی نے بیان کیا, ابو زناد نے اعرج سے اور انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا الْمُغِيرَةُ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْحِزَامِيَّ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نَارُكُمْ هَذِهِ الَّتِي يُوقِدُ ابْنُ آدَمَ جُزْءٌ مِنْ سَبْعِينَ جُزْءًا مِنْ حَرِّ جَهَنَّمَ قَالُوا وَاللَّهِ إِنْ كَانَتْ لَكَافِيَةً يَا رَسُولَ اللَّهِ قَالَ فَإِنَّهَا فُضِّلَتْ عَلَيْهَا بِتِسْعَةٍ وَسِتِّينَ جُزْءًا كُلُّهَا مِثْلُ حَرِّهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14727,
                "hadithNumber": "7166",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Abu Huraira رضی اللہ عنہ through another chain of transmitters with a slight variation of wording.",
                "hadithUrdu": "ہم سے محمد بن رافع نے بیان کیا، ہم سے عبدالرزاق نے بیان کیا, معمر نے ہمیں ہمام بن منبہ سے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے ابوزناد کی حدیث کے مانند روایت کی ، مگر انھوں ( معمر ) نے کہا : \" وہ سب ک سب اس جیسی حرارت رکھتے ہیں ۔ \"",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ أَبِي الزِّنَادِ غَيْرَ أَنَّهُ قَالَ كُلُّهُنَّ مِثْلُ حَرِّهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14728,
                "hadithNumber": "7167",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "We were in the company of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) that we heard a terrible sound. Thereupon Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Do you know what (sound) is this? We said: Allah and His Messenger know best. Thereupon he said: That is a stone which was thrown seventy years before in Hell and it has 'been constantly slipping down and now it has reached its base.",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے کہ آپ نے کسی بہت وزنی چیز کے کرنے کی آواز سنی ۔ اس پر نبی کریم صلی اللہ علیہ وسلم نے فرمایا : \" کیا تم جانتے ہو یہ کیسی آواز تھی؟ \" کہا : ہم نے عرض کی : اللہ اور اس کا رسول صلی اللہ علیہ وسلم زیادہ جاننے والے ہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا؛ \" یہ ایک پتھر تھا جس کو ستر سال پہلے جہنم میں پھینکا کیا تھا ، یہ اب اس میں گر اہے ، یہاں تک کہ اس کی گہرائی تک پہنچ گیا ہے ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن ایوب نے بیان کیا, خلف بن خلیفہ نے کہا : ہمیں یزید بن کیسان نے ابو حازم سے حدیث بیان کی ، انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ حَدَّثَنَا خَلَفُ بْنُ خَلِيفَةَ حَدَّثَنَا يَزِيدُ بْنُ كَيْسَانَ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذْ سَمِعَ وَجْبَةً فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَدْرُونَ مَا هَذَا قَالَ قُلْنَا اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ هَذَا حَجَرٌ رُمِيَ بِهِ فِي النَّارِ مُنْذُ سَبْعِينَ خَرِيفًا فَهُوَ يَهْوِي فِي النَّارِ الْآنَ حَتَّى انْتَهَى إِلَى قَعْرِهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14729,
                "hadithNumber": "7168",
                "englishNarrator": "This hadith has been narrated on the authority of Abu Huraira رضی اللہ عنہ with the same chain of transmitters but with this change of wording that the Prophet (ﷺ) said:",
                "hadithEnglish": "It reached at its base and you heard its sound.",
                "hadithUrdu": "\" یہ ( اب ) اس کے نچلے حصے میں گرا ہے اور تم نے اس کے گرنے کی آوازسنی ہے ۔ \"",
                "urduNarrator": "ہم سے محمد بن عباد اور ابن ابی عمر نے بیان کیا, مروان نے ہمیں یزید بن کیسان سے حدیث بیان کی ، انھوں نے ابوحازم سے اور انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے اسی سند کے ساتھ روایت کی اور کہا",
                "hadithArabic": "و حَدَّثَنَاه مُحَمَّدُ بْنُ عَبَّادٍ وَابْنُ أَبِي عُمَرَ قَالَا حَدَّثَنَا مَرْوَانُ عَنْ يَزِيدَ بْنِ كَيْسَانَ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ بِهَذَا الْإِسْنَادِ وَقَالَ هَذَا وَقَعَ فِي أَسْفَلِهَا فَسَمِعْتُمْ وَجْبَتَهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14730,
                "hadithNumber": "7169",
                "englishNarrator": "Samura bin Jundub رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle (ﷺ) as saying: There will be some to whose ankels the fire will reach, some to whose knees, some to whose waist the fire will reach, and some to whose collar-bone the fire will reach.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \" ان ( جہنمیوں ) میں سے کوئی ایسا ہوگا جس کے ٹخنوں تک آگ لپٹی ہوگی اور کوئی ایسا ہوگا جس کی قمر تک لپٹی ہوگی اور کوئی ایسا ہوگا جس کی گردن تک لپٹی ہوگی ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے یونس بن محمد نے بیان کیا, شیبان بن عبدالرحمن نے ہمیں حدیث بیان کی ، کہا : قتادہ نے کہا : میں نے ابونضرہ کو حضرت سمرہ رضی اللہ عنہ سے حدیث بیان کرتے ہوئے سنا ، انھوں نے نبی اکرم صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ حَدَّثَنَا شَيْبَانُ بْنُ عَبْدِ الرَّحْمَنِ قَالَ قَالَ قَتَادَةُ سَمِعْتَ أَبَا نَضْرَةَ يُحَدِّثُ عَنْ سَمُرَةَ أَنَّهُ سَمِعَ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ مِنْهُمْ مَنْ تَأْخُذُهُ النَّارُ إِلَى كَعْبَيْهِ وَمِنْهُمْ مَنْ تَأْخُذُهُ إِلَى حُجْزَتِهِ وَمِنْهُمْ مَنْ تَأْخُذُهُ إِلَى عُنُقِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14731,
                "hadithNumber": "7170",
                "englishNarrator": "Samura bin Jundub رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: There would be among them those to whom the fire will reach up to their ankels and to some of them the fire would reach their knees and to some it would reach their waists and to some it would reach up to their collar-bones.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا : \" ان میں سے کوئی ایسا ہوگا جس کے دونوں ٹخنوں تک آگ لپٹی ہوگی ان میں سے کوئی ایسا ہوگا جن کے دونوں گھٹنوں تک آگ لپٹی ہوگی اور کوئی ایسا ہوگا جس کی کمر تک آگ لپٹی ہوگی اور کوئی ایسا ہوگا جس کی ہنسلی کی ہڈی تک آگ پکڑے گی ۔ \"",
                "urduNarrator": "ہم سے عمرو بن زرارہ نے بیان کیا, عبدالوہاب بن عطاء نے ہمیں سعید سے خبر دی ، انھوں نے قتادہ سے روایت کی ، کہا : میں نے ابو نضرہ کو سنا ، وہ حضرت سمرہ بن جندب رضی اللہ عنہ سے روایت کر تے تھے کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ زُرَارَةَ أَخْبَرَنَا عَبْدُ الْوَهَّابِ يَعْنِي ابْنَ عَطَاءٍ عَنْ سَعِيدٍ عَنْ قَتَادَةَ قَالَ سَمِعْتُ أَبَا نَضْرَةَ يُحَدِّثُ عَنْ سَمُرَةَ بْنِ جُنْدَبٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مِنْهُمْ مَنْ تَأْخُذُهُ النَّارُ إِلَى كَعْبَيْهِ وَمِنْهُمْ مَنْ تَأْخُذُهُ النَّارُ إِلَى رُكْبَتَيْهِ وَمِنْهُمْ مَنْ تَأْخُذُهُ النَّارُ إِلَى حُجْزَتِهِ وَمِنْهُمْ مَنْ تَأْخُذُهُ النَّارُ إِلَى تَرْقُوَتِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14732,
                "hadithNumber": "7171",
                "englishNarrator": null,
                "hadithEnglish": "Sa'id narrated it with this chain of narrators (a Hadith similar to no. 7170), but instead of \"waist\" he said \"groin\".",
                "hadithUrdu": "ہم سے محمد بن المثنیٰ اور محمد بن بشار نے بیان کیا, روح نے کہا , ہمیں سعید نے اسی سند کے سا تھ حدیث بیان کی اور انھوں نے ( کمر پر ازار باندھنے کی جگہ کے لیے ) \" حجرة \" کے بجائے ۔ \" حقوية \" کا لفظ استعمال کیا ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَاه مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ قَالَا حَدَّثَنَا رَوْحٌ حَدَّثَنَا سَعِيدٌ بِهَذَا الْإِسْنَادِ وَجَعَلَ مَكَانَ حُجْزَتِهِ حِقْوَيْهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14733,
                "hadithNumber": "7172",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: There was a dispute between the Hell and the Paradise and it (the Hell) said: The haughty and the proud would find abode in me. And the Paradise said: The meek and the humble would find their abode in me. Thereupon Allah, the Exalted and Glorious, (addressing the Hell) said: You are (the means) of My punishment by which I punish those of My servants whom I wish. (And addressing the Paradise) He said: You are only My Mercy by means of which 1 shall show mercy to those whom I wish, but each one of you would be full.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" دوزخ اور جنت میں مباحثہ ہوا تو اس ( دوزخ ) نے کہا : میرے اندر جبار اور متکبر داخل ہوں گے ۔ اور اس ( جنت ) نے کہا : میرے اندر ( اسباب دنیا ک اعتبار سے ) ضعیف اور مسکین لوگ داخل ہوں گے ۔ اللہ عزوجل نے اس ( دوزخ ) سے کہا : تم میرا عذاب ہو ، تمہارے ذریعے سے میں جنھیں چاہوں گا عذاب دوں گا ۔ یا شاید فرمایا : جنھیں چاہوں گا مبتلا کروں گا ۔ اور اس ( جنت ) سے کہا : تو میری رحمت ہے اور تمہارے ذریعے سے جس پرچاہوں گا رحم کروں گا اور تم دونوں کے لئے وہ مقدار ہوگی جو اس کو بھر دے گی ۔ \"",
                "urduNarrator": "ہم سے ابن ابی عمر نے بیان کیا, سفیان نے ابو زناد سے ، انھوں نے اعرج سے اور انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَجَّتْ النَّارُ وَالْجَنَّةُ فَقَالَتْ هَذِهِ يَدْخُلُنِي الْجَبَّارُونَ وَالْمُتَكَبِّرُونَ وَقَالَتْ هَذِهِ يَدْخُلُنِي الضُّعَفَاءُ وَالْمَسَاكِينُ فَقَالَ اللَّهُ عَزَّ وَجَلَّ لِهَذِهِ أَنْتِ عَذَابِي أُعَذِّبُ بِكِ مَنْ أَشَاءُ وَرُبَّمَا قَالَ أُصِيبُ بِكِ مَنْ أَشَاءُ وَقَالَ لِهَذِهِ أَنْتِ رَحْمَتِي أَرْحَمُ بِكِ مَنْ أَشَاءُ وَلِكُلِّ وَاحِدَةٍ مِنْكُمَا مِلْؤُهَا.",
                "headingArabic": "النَّارُ يَدْخُلُهَا الْجَبَّارُونَ وَالْجَنَّةُ يَدْخُلُهَا الضُّعَفَاءُ",
                "headingUrdu": "متکبر آگ میں داخل ہوں گے اور عاجز جنت میں داخل ہوں گے۔",
                "headingEnglish": "The Arrogant Will Enter The Fire, And The Humble Will Enter Paradise",
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14734,
                "hadithNumber": "7173",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: The Hell and the Paradise fell into dispute and the Hell said: I have been distinguished by the proud and the haughty. And the Paradise said: What is the matter with me that the meek and the humble amongst people and the downtrodden and the simple enter me? Thereupon Allah said to the Paradise: You are (the means) of My Mercy whereby I show mercy to those of My servants whom I wish, and He said to the Hell: You are (the means) of punishment whereby I punish those of My servants whom l wish. Both of you will be full. The Hell will riot be filled up until Allah puts down His foot in it. The Hell would say: Enough, enough, enough, and at that time it will be filled up, all its parts integrated together.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" دوزخ اور جنت نے باہم ( اپنی اپنی برتری کے ) دلائل دیے دوزخ نے کہا : مجھے جبر وتکبر کرنے و الوں ( کا ٹھکانہ ہونے ) کی بناء پر ترجیح حاصل ہے ۔ جنت نے کہا : مجھے کیا ہواہے کہ میرے اندر کمزور ، خاک نشین ، اورعاجز ولاچار لوگ ہی داخل ہوں گے؟ اللہ عزوجل نے جنت سے فرمایا : تو میری رحمت ہے میں اپنے بندوں میں سے جن پر چاہوں گا تیسرے ذریعے سے رحمت کروں گا اور دوزخ سے کہا : تو میرا عذاب ہے میں اپنے بندوں میں سے جس کو چاہوں گاتمہارے ذریعے دے عذاب دوں گااور تم دونوں کے لئے اتنی ( مخلوق ) ہے جس سے تم بھر جاؤ ۔ رہی آگ تو وہ پوری طرح سے نہیں بھرے گی چنانچہ وہ ( اللہ ) اس کے اوپر اپناقدم رکھے گا تو وہ کہے گی!بس بس! اس وقت وہ بھر جائے گی اور باہم سمٹ جائے گی ۔ \"",
                "urduNarrator": "مجھ سے محمد بن رافع نے بیان کیا، ہم سے شبابہ نے بیان کیا, ورقاء نے مجھے ابو زناد سے ، انھوں نے اعرج سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا شَبَابَةُ حَدَّثَنِي وَرْقَاءُ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تَحَاجَّتْ النَّارُ وَالْجَنَّةُ فَقَالَتْ النَّارُ أُوثِرْتُ بِالْمُتَكَبِّرِينَ وَالْمُتَجَبِّرِينَ وَقَالَتْ الْجَنَّةُ فَمَا لِي لَا يَدْخُلُنِي إِلَّا ضُعَفَاءُ النَّاسِ وَسَقَطُهُمْ وَعَجَزُهُمْ فَقَالَ اللَّهُ لِلْجَنَّةِ أَنْتِ رَحْمَتِي أَرْحَمُ بِكِ مَنْ أَشَاءُ مِنْ عِبَادِي وَقَالَ لِلنَّارِ أَنْتِ عَذَابِي أُعَذِّبُ بِكِ مَنْ أَشَاءُ مِنْ عِبَادِي وَلِكُلِّ وَاحِدَةٍ مِنْكُمْ مِلْؤُهَا فَأَمَّا النَّارُ فَلَا تَمْتَلِئُ فَيَضَعُ قَدَمَهُ عَلَيْهَا فَتَقُولُ قَطْ قَطْ فَهُنَالِكَ تَمْتَلِئُ وَيُزْوَى بَعْضُهَا إِلَى بَعْضٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14735,
                "hadithNumber": "7174",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: The Paradise and the Hell disputed with each other. The rest of the hadith is the same.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا \" جنت اور دوزخ نے ( اپنی اپنی برتری کے ) دلائل دیئے ۔ \" پھر ابو زناد کی حدیث کے ہم معنی حدیث بیان کی ۔",
                "urduNarrator": "ہم سے عبداللہ بن عون ہلالی نے بیان کیا: ہم سے ابو سفیان یعنی محمد بن حمید نے معمر کی سند سے بیان کیا, ایوب نے ابن سیرین سے اور انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَوْنٍ الْهِلَالِيُّ حَدَّثَنَا أَبُو سُفْيَانَ يَعْنِي مُحَمَّدَ بْنَ حُمَيْدٍ عَنْ مَعْمَرٍ عَنْ أَيُّوبَ عَنْ ابْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ احْتَجَّتْ الْجَنَّةُ وَالنَّارُ وَاقْتَصَّ الْحَدِيثَ بِمَعْنَى حَدِيثِ أَبِي الزِّنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14736,
                "hadithNumber": "7175",
                "englishNarrator": "Hammam bin Munabbih reported that Abu Huraira رضی اللہ عنہ narrated to them some ahadith of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and one of them is this:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: The Paradise and the Hell fell into dispute and the Hell said: 1 have been distinguished for accommodating (the haughty and proud in me), and the Paradise said: What is the matter that the meek and the humble and the downtrodden and simple would find an abode in me? Thereupon Allah said to Paradise: You are a (means) of My Mercy. 1 shall show mercy through you to one whom I will from amongst My servants. And lie said to the Hell: You are a (sign) of My chastisement and I shall chastise through you anyone whom I will from amongst My servants and both of you, would be full. And as regards the Hell it would not be full until Allah, the Exalted and Glorious, places His foot therein, and it would say: Enough, enough, enough, and it would be then full and the one part would draw very close to the other one and Allah would not treat unjustly anyone amongst His creation and He would create another creation for the Paradise (to accommodate it).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جنت اوردوزخ نے ( اپنے اپنے بارے میں ) ایک دوسرے کو دلائل دیئے ۔ دوزخ نے کہا : مجھے تکبر اور جبر کرنے والوں ( کا ٹھکانہ ہونے ) کی بناء پر ترجیح حاصل ہے ۔ جنت نے کہا : میرا کیا حال ہے کہ میرے اندر لوگوں میں سے کمزور خاک نشین اور سیدھے سادے لوگ داخل ہوں گے؟تو اللہ عزوجل نے جنت سے فرمایا : تو سراسر میری رحمت ہے ، تیرے ذریعے سے میں اپنے بندوں میں سے جس کو چاہوں گا رحمت سے نوازوں گا اور دوزخ سے کہا : تو صرف اور صرف میرا عذاب ہے ، تیرے ذریعے میں سے میں اپنے بندوں میں سے جس کو چاہوں گا عذاب میں ڈالوں گا اور تم دونوں میں سے ہر ایک کے لئے اتنے بندے ہیں جن سے وہ بھر جائے ، جہاں تک آگ کا تعلق ہے تو وہ نہیں بھرے گی یہاں تک کہ اللہ تبارک وتعالیٰ ۔ اپنا قدم ( اس پر ) رکھ دے گا تو وہ کہے گی ۔ بس ۔ بس ۔ بس اس وقت وہ بھر جائے گی ، اس کے بعض حصے بعض کے ساتھ سمٹ جائیں گے ۔ اللہ تعالیٰ اپنی مخلوق میں سے کسی پر ظلم نہیں کرے گا اور جہاں تک جنت کا تعلق ہے تو اللہ ( اس کے لیے ) ایک مخلوق تیار کردے گا ۔ \"",
                "urduNarrator": "ہم سے محمد بن رافع نے بیان کیا، ہم سے عبدالرزاق نے بیان کیا, معمر نے ہمیں ہمام بن منبہ سے حدیث بیان کی ، کہا : یہ احادیث ہیں جو حضرت ابو ہریرہ رضی اللہ عنہ نے ہمیں رسول اللہ صلی اللہ علیہ وسلم سے بیان کیں ، انھوں نے بہت سی احادیث بیان کیں ، ان میں سے ( ایک ) یہ ہے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَحَاجَّتْ الْجَنَّةُ وَالنَّارُ فَقَالَتْ النَّارُ أُوثِرْتُ بِالْمُتَكَبِّرِينَ وَالْمُتَجَبِّرِينَ وَقَالَتْ الْجَنَّةُ فَمَا لِي لَا يَدْخُلُنِي إِلَّا ضُعَفَاءُ النَّاسِ وَسَقَطُهُمْ وَغِرَّتُهُمْ قَالَ اللَّهُ لِلْجَنَّةِ إِنَّمَا أَنْتِ رَحْمَتِي أَرْحَمُ بِكِ مَنْ أَشَاءُ مِنْ عِبَادِي وَقَالَ لِلنَّارِ إِنَّمَا أَنْتِ عَذَابِي أُعَذِّبُ بِكِ مَنْ أَشَاءُ مِنْ عِبَادِي وَلِكُلِّ وَاحِدَةٍ مِنْكُمَا مِلْؤُهَا فَأَمَّا النَّارُ فَلَا تَمْتَلِئُ حَتَّى يَضَعَ اللَّهُ تَبَارَكَ وَتَعَالَى رِجْلَهُ تَقُولُ قَطْ قَطْ قَطْ فَهُنَالِكَ تَمْتَلِئُ وَيُزْوَى بَعْضُهَا إِلَى بَعْضٍ وَلَا يَظْلِمُ اللَّهُ مِنْ خَلْقِهِ أَحَدًا وَأَمَّا الْجَنَّةُ فَإِنَّ اللَّهَ يُنْشِئُ لَهَا خَلْقًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14737,
                "hadithNumber": "7176",
                "englishNarrator": "Abu Sa'id al-Khudri reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: The Paradise and the Hell disputed with each other. The rest of the hadith is the same as transmitted by Abu Huraira رضی اللہ عنہ up to the words'. It is essential for Me to fill up both of you.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جنت اور دوزخ نے ایک دوسرے کے سامنے دلائل دیے ۔ \" پھرانہوں نے حضرت ابو ہریرہ رضی اللہ عنہ کی حدیث کی طرح آپ صلی اللہ علیہ وسلم کے اس فرمان : \" تم دونوں کو بھرنا میری ذمہ داری ہے \" تک بیان کیا اور اس کے بعدکے مزید الفاظ ذکر نہیں کیے ۔",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ نے بیان کیا، کہا ہم سے جریر نے العماش کی سند سے، ابوصالح کی سند سے, حضرت ابو سعید خدری رضی اللہ عنہ سے روایت ہے ، کہا کہ",
                "hadithArabic": "و حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَجَّتْ الْجَنَّةُ وَالنَّارُ فَذَكَرَ نَحْوَ حَدِيثِ أَبِي هُرَيْرَةَ إِلَى قَوْلِهِ وَلِكِلَيْكُمَا عَلَيَّ مِلْؤُهَا وَلَمْ يَذْكُرْ مَا بَعْدَهُ مِنْ الزِّيَادَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14738,
                "hadithNumber": "7177",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said that the Hell would continue to say: Is there anything more, until Allah, the Exalted and High, would place His foot therein and that would say: Enough, enough, by Your Honour, and some parts of it would draw close to the other.",
                "hadithUrdu": "اللہ کے نبی کریم صلی اللہ علیہ وسلم نے فرمایا؛ \" دوزخ مسلسل یہی کہتی رہے گی : کیا اور زیادہ ہے؟یہاں تک کہ رب العزت تبارک وتعالیٰ اس میں اپنا قدم ٹکائے گا تو وہ کہے گی بس بس تیری عزت کی قسم! ( میرامطالبہ ختم ہوگیا ۔ ) اور اس کاایک حصہ دوسرے حصے سے سمٹ جائے گا ۔ \"",
                "urduNarrator": "ہم سے عبد بن حمید نے بیان کیا، ہم سے یونس بن محمد نے بیان کیا, شیبان نے ہمیں قتادہ سے حدیث بیان کی ، کہا : ہمیں حضرت انس بن مالک رضی اللہ عنہ نے حدیث بیان کی کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ حَدَّثَنَا شَيْبَانُ عَنْ قَتَادَةَ حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَزَالُ جَهَنَّمُ تَقُولُ هَلْ مِنْ مَزِيدٍ حَتَّى يَضَعَ فِيهَا رَبُّ الْعِزَّةِ تَبَارَكَ وَتَعَالَى قَدَمَهُ فَتَقُولُ قَطْ قَطْ وَعِزَّتِكَ وَيُزْوَى بَعْضُهَا إِلَى بَعْضٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 14426,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=577",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=575",
                "label": "575",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=576",
                "label": "576",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=577",
                "label": "577",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=578",
                "label": "578",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=579",
                "label": "579",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=580",
                "label": "580",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=581",
                "label": "581",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=579",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=579",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=577",
        "to": 14450,
        "total": 40465
    }
}