{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 587,
        "data": [
            {
                "id": 14939,
                "hadithNumber": "7378",
                "englishNarrator": "Mughira bin Shu'ba رضی اللہ عنہ reported:",
                "hadithEnglish": "No one asked Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) more about Dajjil than I asked him. He said: He should not be a source of worry to you for he would not be able to do any harm to you. I said: Allah's Messenger, it is alleged that he would have along with him (abundance of) food and water. Thereupon he said: He would be very insignificant in the eye of Allah (even) with all this.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم سے دجال کے بارے میں جتنا میں نے پوچھا اس سے زیادہ کسی نے نہیں پوچھا ۔ آپ نے فرمایا : \" اس ( کے حوالے ) سے تمھیں کیا بات اتنا تھکا رہی ہے؟ وہ تمھیں نقصان نہیں پہنچائے گا ۔ کہا : میں نے عرض کی ، اللہ کے رسول اللہ صلی اللہ علیہ وسلم !لوگ کہتے ہیں اس کے ہمراہ کھانے ( کےڈھیر ) اور ( پانی کے ) دریا ہوں گے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ کے نزدیک وہ اس سے حقیر تر ہے ( کہ ایسی چیزوں کے ذریعے سے مسلمانوں کو گمراہ کر سکے ، )",
                "urduNarrator": "ہم سے شہاب بن عباد العبدی نے بیان کیا, ابراہیم بن حمید رؤاسی نے اسماعیل بن ابی خالد سے انھوں نےقیس بن ابی حازم سے اور انھوں نے حضرت مغیرہ بن شعبہ رضی اللہ عنہ سے روایت کی ، انھوں نےکہا : کہ",
                "hadithArabic": "حَدَّثَنَا شِهَابُ بْنُ عَبَّادٍ الْعَبْدِيُّ حَدَّثَنَا إِبْرَاهِيمُ بْنُ حُمَيْدٍ الرُّؤَاسِيُّ عَنْ إِسْمَعِيلَ بْنِ أَبِي خَالِدٍ عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَ مَا سَأَلَ أَحَدٌ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الدَّجَّالِ أَكْثَرَ مِمَّا سَأَلْتُ قَالَ وَمَا يُنْصِبُكَ مِنْهُ إِنَّهُ لَا يَضُرُّكَ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّهُمْ يَقُولُونَ إِنَّ مَعَهُ الطَّعَامَ وَالْأَنْهَارَ قَالَ هُوَ أَهْوَنُ عَلَى اللَّهِ مِنْ ذَلِكَ.",
                "headingArabic": "فِي الدَّجَّالِ وَهُوَ أَهْوَنُ عَلَى اللَّهِ عَزَّ وَجَلَّ",
                "headingUrdu": "دجال اللہ تعالیٰ کے نزدیک بہت ہی حقیر ہے۔",
                "headingEnglish": "Ad-Dajjal Is Very Insignificant Before Allah",
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14940,
                "hadithNumber": "7379",
                "englishNarrator": "Mughira bin Shu'ba رضی اللہ عنہ reported:",
                "hadithEnglish": "None asked Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) about Dajjal more than I asked him. I (one of the narrators other than Mughira bin Shu'ba) said: What did you ask? Mughira replied: I said that the people alleged that he would have a mountain load of bread and mutton and rivers of water. Thereupon he said: He would be more insignificant in the eye of Allah compared with all this.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم سے دجال کے بارے میں جتنا میں نے پوچھا اس سے زیادہ کسی نے نہیں پوچھا ، آپ نے فرمایا : ’’تمھارے سوال کا ( سبب ) کیا ہے ؟ \" کہا : میں نے عرض کی وہ ( لوگ ) کہتے ہیں اس کے ہمراہ روٹی اور گوشت کے پہاڑ اور پانی کا دریاہوگافرمایا : \" وہ اللہ کے نزدیک اس سے زیادہ حقیرہے ۔ \"",
                "urduNarrator": "ہم سے سریج بن یونس نے بیان کیا, ہشیم نے اسماعیل سے انھوں نے قیس سے اور انھوں نے حضرت مغیرہ بن شعبہ رضی اللہ عنہ سے روایت کی کہا",
                "hadithArabic": "حَدَّثَنَا سُرَيْجُ بْنُ يُونُسَ حَدَّثَنَا هُشَيْمٌ عَنْ إِسْمَعِيلَ عَنْ قَيْسٍ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَ مَا سَأَلَ أَحَدٌ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الدَّجَّالِ أَكْثَرَ مِمَّا سَأَلْتُهُ قَالَ وَمَا سُؤَالُكَ قَالَ قُلْتُ إِنَّهُمْ يَقُولُونَ مَعَهُ جِبَالٌ مِنْ خُبْزٍ وَلَحْمٍ وَنَهَرٌ مِنْ مَاءٍ قَالَ هُوَ أَهْوَنُ عَلَى اللَّهِ مِنْ ذَلِكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14941,
                "hadithNumber": "7380",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Isma'il through other chains of transmitters with a slight variation of wording.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ اور ابن نمیر نے بیان کیا، کہا ہم سے وکیع نے بیان کیا، اور ہم سے اسحاق بن ابراہیم نے بیان کیا، ہم سے جریر نے بیان کیا، اور ہم سے ابن ابی عمر نے بیان کیا اور ہم سے سفیان نے بیان کیا, ہم سے ابوبکر بن ابی شیبہ اور ابن نمیر نے بیان کیا, وکیع ، جریر ، سفیان ، یزید بن ہارون اور ابو اسامہ سب نے اسماعیل سے اسی سند کے ساتھ ابراہیم بن حمید کی طرح روایت کی اور یزید کی حدیث میں مزید یہ ہے کہ آپ صلی اللہ علیہ وسلم نے مجھ سے فرمایا : \" میرے بیٹے ! \"",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَابْنُ نُمَيْرٍ قَالَا حَدَّثَنَا وَكِيعٌ و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا جَرِيرٌ و حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ ح و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا أَبُو أُسَامَةَ كُلُّهُمْ عَنْ إِسْمَعِيلَ بِهَذَا الْإِسْنَادِ نَحْوَ حَدِيثِ إِبْرَاهِيمَ بْنِ حُمَيْدٍ وَزَادَ فِي حَدِيثِ يَزِيدَ فَقَالَ لِي أَيْ بُنَيَّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14942,
                "hadithNumber": "7381",
                "englishNarrator": "Abdullah bin 'Amr رضی اللہ عنہ reported:",
                "hadithEnglish": "A person came to him and said: What is this hadith that you narrate that the Last Hour would come at such and such time? Thereupon he said: Hallowed be Allah, there is no god but Allah (or the words to the same effect). I have decided that I would not narrate anything to anyone now. I had only said that you would see after some time an important event that the (sacred) House (Ka'ba) would be burnt and it would happen and definitely happen. He then reported that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: The Dajjal would appear in my Ummah and he would stay (in the world) for forty - I cannot say whether he meant forty days, forty months or forty years. And Allah would then send Jesus son of Mary who would resemble 'Urwa bin Mas'ud رضی اللہ عنہ . He (Jesus Christ) would chase him and kill him. Then people would live for seven years that there would be no rancour between two persons. Then Allah would send cold wind from the side of Syria that none would survive upon the earth having a speck of good in him or faith in him but he would die, so much so that even if some amongst you were to enter the innermost part of the mountain, this wind would reach that place also and that would cause his death. I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Only the wicked people would survive and they would be as careless as birds with the characteristics of beasts. They would never appreciate the good nor condemn evil. Then Satan would come to them in human form and would say: Don't you respond? And they would say: What do you order us? And he would command them to worship the idols but, in spite of this, they would have abundance of sustenance and lead comfortable lives. Then the trumpet would be blown and no one would hear that but he would bend his neck to one side and raise it from the other side and the first one to hear that trumpet would be the person who would be busy in setting right the tank meant for providing water to the camels. He would swoon and the other people would also swoon, then Allah would send or He would cause to send rain which would be like dew and there would grow out of it the bodies of the people. Then the second trumpet would be blown and they would stand up and begin to look (around). Then it would be said: O people, go to your Lord, and make them stand there. And they would be questioned. Then it would be said: Bring out a group (out of them) for the Hell-Fire. And then it would be asked: How much? It would be said: Nine hundred and ninty-nine out of one thousand for the Hell-Fire and that would be the day which would make the children old because of its terror and that would be the day about which it has been said: On the day when the shank would be uncovered (lxviii. 42).",
                "hadithUrdu": "ان کے پاس ایک شخص آیا اور کہا : یہ کیا حدیث ہے جو آپ بیان کرتے ہیں ۔ کہ فلاں فلاں بات ہونے تک قیامت قائم ہو جائے گی انھوں نے سبحان اللہ ! ۔ یا ۔ ۔ ۔ لاالہ الااللہ ۔ ۔ ۔ یا ۔ ۔ ۔ اس جیسا کوئی کلمہ کہا : ( اورکہنے لگے ) میں نے پختہ ارادہ کر لیا کہ میں کسی کو کبھی کوئی بات بیان نہیں کروں گا ۔ میں نے یہ کہا تھا تم لوگ تھوڑے عرصے بعد بہت بڑا معاملہ دیکھو گے ۔ بیت اللہ کو جلا دیا جا ئےگا ۔ اور یہ ہوگا پھر کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" میری امت میں دجال نمودار ہو گا اور چالیس مجھے یاد نہیں کہ چالیس دن ( فرمائے ) یا چالیس مہینے یا چالیس سال رہے گا تو اللہ تعالیٰ حضرت عیسیٰ علیہ السلام کو بھیج دیں گے ۔ وہ اس طرح ہیں جیسے حضرت عروہ بن مسعود رضی اللہ عنہ آپ اسے ڈھونڈیں گے اور اسے ہلاک کر دیں گے پھر لوگ سات سال تک اس حالت میں رہیں گے ۔ کہ کوئی سے دو آدمیوں کے درمیان دشمنی تک نہ ہوگی پھر اللہ تعالیٰ شام کی طرف سے ایک ٹھنڈی ہواچلائے گاتو روئے زمین پر ایک بھی ایسا آدمی نہیں رہے گا جس کے دل میں ذرہ برابر بھلائی یا ایمان ہو گا ۔ مگر وہ ہوا اس کی روح قبض کرے گی یہاں تک کہااگر تم میں سے کوئی شخص پہاڑ کے جگرمیں گھس جائے گا تو وہاں بھی وہ ( ہوا ) داخل ہو جا ئے گی ۔ یہاں تک کہ اس کی روح قبض کرلے گی ۔ \" انھوں نے کہا : یہ بات میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنی ۔ آپ نے فرمایا : \" پرندوں جیسا ہلکا پن اور درندوں جیسی عقلیں رکھنے والے بد ترین لوگ باقی رہ جائیں گے ۔ نہ اچھائی کو اچھا سمجھیں گے نہ برائی کو برا جانیں گے ۔ شیطان کوئی شکل اختیار کر کے ان کے پاس آئے گا اور کہے گا : \" کیا تم میری بات پر عمل نہیں کروگے؟وہ کہیں گے ۔ تو ہمیں کیا حکم دیتا ہے ۔ ؟وہ انھیں بت پوجنے کا حکم دے گا وہ اسی حالت میں رہیں گے ان کا رزق اترتا ہوگا ان کی معیشت بہت اچھی ہو گی پھر صور پھونکا جائے گا ۔ جو بھی اسے سنے گا وہ گردن کی ایک جانب کو جھکائے گا اور دوسری جانب کو اونچا کرے گا ( گردنیں ٹیڑھی ہو جائیں گی ) سب سے پہلا شخص جواسے سنے گاوہ اپنے اونٹوں کے حوض کی لپائی کر رہا ہوگا ۔ وہ پچھاڑ کھا کر گر جائے گا ۔ اور دوسرے لوگ بھی گر ( کر مر ) جائیں گے ۔ اس کے بعد اللہ تعالیٰ ایک بارش نازل فرمائےگا ۔ جو ایک پھوار کے مانند ہو گی ۔ یا سائے کی طرح ہو گی ۔ شک کرنے والے نعمان ( بن سالم ) ہیں اس سے انسانوں کے جسم اُگ آئیں گے ۔ پھر صور میں دوسری بار پھونک ماری جائے گی ۔ تو وہ سب لوگ کھڑے ہوئے دیکھ رہے ہوں گے ، ( زندہ ہو جا ئیں گے ) پھر کہا جا ئے گا لوگو! اپنے پروردگارکی طرف آؤ !اور ( فرشتوں سے کہا جائے گا ان کولاکھڑا کرو ان سے سوال پوچھے جائیں گے ۔ حکم دیا جا ئےگا ۔ آگ میں بھیجے جانے والوں کو ( اپنی صفوں سے ) باہرنکالو پوچھا جائے گا ۔ کتنوں میں سے ( کتنے؟ ) کہاجائے گا ہر ہزار میں سے نو سو ننانوے ۔ انھوں نے کہا : تویہ وہ دن ہو گا جو بچوں کو بوڑھا کردے گا ۔ اور وہی دن ہو گا جب پنڈلی سے پردہ ہٹا ( کر دیدار جمال کرایا ) جائے گا ۔ \"",
                "urduNarrator": "عبید اللہ بن معاذ عنبری نے کہا , ہمیں شعبہ نے نعمان بن سالم سے حدیث بیان کی ، انھوں نے کہا : میں نے یعقوببن عاصم بن عروہ بن مسعود ثقفی سے سنا ، وہ کہتے ہیں میں نے حضرت عبد اللہ بن عمرو رضی اللہ عنہ سے سنا",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ النُّعْمَانِ بْنِ سَالِمٍ قَالَ سَمِعْتُ يَعْقُوبَ بْنَ عَاصِمِ بْنِ عُرْوَةَ بْنِ مَسْعُودٍ الثَّقَفِيَّ يَقُولُ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَمْرٍو وَجَاءَهُ رَجُلٌ فَقَالَ مَا هَذَا الْحَدِيثُ الَّذِي تُحَدِّثُ بِهِ تَقُولُ إِنَّ السَّاعَةَ تَقُومُ إِلَى كَذَا وَكَذَا فَقَالَ سُبْحَانَ اللَّهِ أَوْ لَا إِلَهَ إِلَّا اللَّهُ أَوْ كَلِمَةً نَحْوَهُمَا لَقَدْ هَمَمْتُ أَنْ لَا أُحَدِّثَ أَحَدًا شَيْئًا أَبَدًا إِنَّمَا قُلْتُ إِنَّكُمْ سَتَرَوْنَ بَعْدَ قَلِيلٍ أَمْرًا عَظِيمًا يُحَرَّقُ الْبَيْتُ وَيَكُونُ وَيَكُونُ ثُمَّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْرُجُ الدَّجَّالُ فِي أُمَّتِي فَيَمْكُثُ أَرْبَعِينَ لَا أَدْرِي أَرْبَعِينَ يَوْمًا أَوْ أَرْبَعِينَ شَهْرًا أَوْ أَرْبَعِينَ عَامًا فَيَبْعَثُ اللَّهُ عِيسَى ابْنَ مَرْيَمَ كَأَنَّهُ عُرْوَةُ بْنُ مَسْعُودٍ فَيَطْلُبُهُ فَيُهْلِكُهُ ثُمَّ يَمْكُثُ النَّاسُ سَبْعَ سِنِينَ لَيْسَ بَيْنَ اثْنَيْنِ عَدَاوَةٌ ثُمَّ يُرْسِلُ اللَّهُ رِيحًا بَارِدَةً مِنْ قِبَلِ الشَّأْمِ فَلَا يَبْقَى عَلَى وَجْهِ الْأَرْضِ أَحَدٌ فِي قَلْبِهِ مِثْقَالُ ذَرَّةٍ مِنْ خَيْرٍ أَوْ إِيمَانٍ إِلَّا قَبَضَتْهُ حَتَّى لَوْ أَنَّ أَحَدَكُمْ دَخَلَ فِي كَبِدِ جَبَلٍ لَدَخَلَتْهُ عَلَيْهِ حَتَّى تَقْبِضَهُ قَالَ سَمِعْتُهَا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَيَبْقَى شِرَارُ النَّاسِ فِي خِفَّةِ الطَّيْرِ وَأَحْلَامِ السِّبَاعِ لَا يَعْرِفُونَ مَعْرُوفًا وَلَا يُنْكِرُونَ مُنْكَرًا فَيَتَمَثَّلُ لَهُمْ الشَّيْطَانُ فَيَقُولُ أَلَا تَسْتَجِيبُونَ فَيَقُولُونَ فَمَا تَأْمُرُنَا فَيَأْمُرُهُمْ بِعِبَادَةِ الْأَوْثَانِ وَهُمْ فِي ذَلِكَ دَارٌّ رِزْقُهُمْ حَسَنٌ عَيْشُهُمْ ثُمَّ يُنْفَخُ فِي الصُّورِ فَلَا يَسْمَعُهُ أَحَدٌ إِلَّا أَصْغَى لِيتًا وَرَفَعَ لِيتًا قَالَ وَأَوَّلُ مَنْ يَسْمَعُهُ رَجُلٌ يَلُوطُ حَوْضَ إِبِلِهِ قَالَ فَيَصْعَقُ وَيَصْعَقُ النَّاسُ ثُمَّ يُرْسِلُ اللَّهُ أَوْ قَالَ يُنْزِلُ اللَّهُ مَطَرًا كَأَنَّهُ الطَّلُّ أَوْ الظِّلُّ نُعْمَانُ الشَّاكُّ فَتَنْبُتُ مِنْهُ أَجْسَادُ النَّاسِ ثُمَّ يُنْفَخُ فِيهِ أُخْرَى فَإِذَا هُمْ قِيَامٌ يَنْظُرُونَ ثُمَّ يُقَالُ يَا أَيُّهَا النَّاسُ هَلُمَّ إِلَى رَبِّكُمْ وَقِفُوهُمْ إِنَّهُمْ مَسْئُولُونَ قَالَ ثُمَّ يُقَالُ أَخْرِجُوا بَعْثَ النَّارِ فَيُقَالُ مِنْ كَمْ فَيُقَالُ مِنْ كُلِّ أَلْفٍ تِسْعَ مِائَةٍ وَتِسْعَةً وَتِسْعِينَ قَالَ فَذَاكَ يَوْمَ يَجْعَلُ الْوِلْدَانَ شِيبًا وَذَلِكَ يَوْمَ يُكْشَفُ عَنْ سَاقٍ.",
                "headingArabic": "فِي خُرُوجِ الدَّجَّالِ وَمُكْثِهِ فِي الْأَرْضِ وَنُزُولِ عِيسَى وَقَتْلِهِ إِيَّاهُ، وذهاب أهل الخير والإيمان، وبقاء شرارالناس وعبادتهم الأوثان، والنفخ في الصور، وبعث من في ولقبور",
                "headingUrdu": "دجال کا ظہور اور زمین پر اس کا قیام، اور عیسیٰ کا نزول جو اسے قتل کرے گا۔ نیکی اور ایمان والوں کی موت، اور بدترین لوگوں کی بقا، اور ان کی بت پرستی۔ صور پھونکنا، اور ان لوگوں کا جی اٹھنا جو اپنی قبروں میں ہیں۔",
                "headingEnglish": "The Emergence Of Ad-Dajjal And His Stay On Earth, And The Descent Of 'Eisa Who Will Kill Him. The Death Of The People Of Goodness And Faith, And The Survival Of The Worst Of People, And Their Idol-Worship. The Trumpet Blast, And The Resurrection Of Those Who Are In Their Graves",
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14943,
                "hadithNumber": "7382",
                "englishNarrator": "Ya'qub bin 'Asim bin Urwa bin Mas'ud reported:",
                "hadithEnglish": "I heard a person saying to 'Abdullah bin Amr رضی اللہ عنہ : You say that the Last Hour would come at such and such time, whereupon he said: I had made up my mind that I would not narrate anything to you. I only said: But you would soon see after some time a very significant affair, for example the burning of the House (Ka'ba). Shu'ba said like this and 'Abdullah bin Amr رضی اللہ عنہ reported Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) having said: The Dajjal would appear in my Ummah. And in another hadith (the words are): None would survive who would have even a speck of faith in his heart, but he would be dead. Muhammad bin Ja'far رضی اللہ عنہ reported that Shu'ba narrated to him this hadith many a time and I also read it out to him many a time.",
                "hadithUrdu": "میں نے ایک شخص کو سنا ، اس نے حضرت عبداللہ بن عمرو سے کہا : آپ یہ کہتے ہیں کہ فلاں فلاں ( بات پوری ہوجائے ) پر قیامت قائم ہوجائے گی ۔ حضرت عبداللہ بن عمرو رضی اللہ عنہ نے کہا : میں نے یہ ارادہ کرلیا ہے کہ میں تم لوگوں کو کوئی حدیث نہ سناؤں ، میں تو یہ کہاتھا کہ تم تھوڑی مدت کے بعد ایک بڑا معاملہ دیکھو گے تو بیت اللہ کے جلنے کا واقعہ ہوگیا ۔ شعبہ نے یہ الفاظ کہےیا اس سے ملتے جلتے الفاظ کہے ۔ حضرت عبداللہ بن عمر رضی اللہ عنہ نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" میری امت میں دجال نمودار ہوگا ۔ \"\" اور ( اس کے بعد محمد بن جعفر نے ) معاذ کی حدیث کےمانند حدیث بیان کی اور اپنی حدیث میں کہا : \"\" کوئی ا یک شخص بھی جس نے دل میں ذرہ برابر ایمان ہو ، نہیں بچے کا مگر وہ ( ہوگا ) اس کی روح قبض کرلے گی ۔ \"\" محمد بن جعفر نے کہا : شعبہ نے مجھے یہ حدیث کئی بار سنائی اورمیں نے ( کئی بار ) اسے ان کے سامنے دہرایا ۔",
                "urduNarrator": "مجھ سے محمد بن بشار نے بیان کیا, محمد بن جعفر نے کہا : ہمیں شعبہ نے نعمان بن سالم سے حدیث بیان کی ، انھوں نے کہا : میں نے یعقوب بن عاصم بن عروہ بن مسعود سے سنا ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ النُّعْمَانِ بْنِ سَالِمٍ قَالَ سَمِعْتُ يَعْقُوبَ بْنَ عَاصِمِ بْنِ عُرْوَةَ بْنِ مَسْعُودٍ قَالَ سَمِعْتُ رَجُلًا قَالَ لِعَبْدِ اللَّهِ بْنِ عَمْرٍو إِنَّكَ تَقُولُ إِنَّ السَّاعَةَ تَقُومُ إِلَى كَذَا وَكَذَا فَقَالَ لَقَدْ هَمَمْتُ أَنْ لَا أُحَدِّثَكُمْ بِشَيْءٍ إِنَّمَا قُلْتُ إِنَّكُمْ تَرَوْنَ بَعْدَ قَلِيلٍ أَمْرًا عَظِيمًا فَكَانَ حَرِيقَ الْبَيْتِ قَالَ شُعْبَةُ هَذَا أَوْ نَحْوَهُ قَالَ عَبْدُ اللَّهِ بْنُ عَمْرٍو قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْرُجُ الدَّجَّالُ فِي أُمَّتِي وَسَاقَ الْحَدِيثَ بِمِثْلِ حَدِيثِ مُعَاذٍ وَقَالَ فِي حَدِيثِهِ فَلَا يَبْقَى أَحَدٌ فِي قَلْبِهِ مِثْقَالُ ذَرَّةٍ مِنْ إِيمَانٍ إِلَّا قَبَضَتْهُ قَالَ مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنِي شُعْبَةُ بِهَذَا الْحَدِيثِ مَرَّاتٍ وَعَرَضْتُهُ عَلَيْهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14944,
                "hadithNumber": "7383",
                "englishNarrator": "`Abdullah bin `Amr رضی اللہ عنہ reported:",
                "hadithEnglish": "I committed to memory a hadith from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and I did not forget it after I had heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The first sign (out of the signs of the appearance of the Dajjal) would be the appearance of the sun from the west, the appearance of the beast before the people in the forenoon and which of the two happens first, the second one would follow immediately after that.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے ایک ایسی حدیث سنی ہے جس کو سننے کے بعد میں اسے بھولا نہیں ۔ میں نے رسول اللہ صلی اللہ علیہ وسلم کوفرماتے ہوئے سنا : \" نمودار ہونے والی سب سے پہلے نشانی مغرب سے سورج کا طلوع ہونا اور دن چڑھے لوگوں کے سامنے زمین کے چوپائے کانکلنا ہے ۔ ان میں سے جو بھی نشانی دوسری سے پہلے ظاہر ہوگی ، دوسری اس کے بعد جلد نمودار ہوجائے گی ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, محمد بن بشیر نے ابو حیان سے ، انھوں نے ابو زرعہ سے اور انھوں نے حضر ت عبداللہ بن عمر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ عَنْ أَبِي حَيَّانَ عَنْ أَبِي زُرْعَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ حَفِظْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدِيثًا لَمْ أَنْسَهُ بَعْدُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ أَوَّلَ الْآيَاتِ خُرُوجًا طُلُوعُ الشَّمْسِ مِنْ مَغْرِبِهَا وَخُرُوجُ الدَّابَّةِ عَلَى النَّاسِ ضُحًى وَأَيُّهُمَا مَا كَانَتْ قَبْلَ صَاحِبَتِهَا فَالْأُخْرَى عَلَى إِثْرِهَا قَرِيبٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14945,
                "hadithNumber": "7384",
                "englishNarrator": "Abu Zur'a reported:",
                "hadithEnglish": "Three persons amongst Muslims had been sitting in Medina in the presence of Marwan bin Hakam and they heard him narrate these signs from him and the first amongst them was the appearance of the Dajjal. 'Abdullah bin 'Amr رضی اللہ عنہ reported that Marwin said nothing (particular in this connection). I, however, heard a hadith from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and I did not forget that after I had heard that from Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and he reported a hadith like the foregoing.",
                "hadithUrdu": "مسلمانوں میں سے تین شخص مدینہ میں مروان بن حکم کے پاس بیٹھے تھے اور اسے قیامت کی نشانیاں بیان کرتے ہوئے سن رہے تھے کہ ان میں سے پہلی دجال کا ظہور ہوگا ، اس پر حضرت عبداللہ بن عمرو رضی اللہ عنہ نے کہا : ( تم لوگ یوں سمجھو کہ ) مروان نے کچھ بھی نہیں کہا ( کیونکہ اس کی بات رسول اللہ صلی اللہ علیہ وسلم کے فرمان کے مطابق نہیں ) میں نے رسول اللہ صلی اللہ علیہ وسلم سے ایک حدیث سنی تھی جسے میں بھولا نہیں ۔ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا ۔ پھر اسی ( سابقہ حدیث ) کے مانند بیان کیا ۔",
                "urduNarrator": "ہم سے محمد بن عبداللہ بن نمیر نے کہا : ہمیں ابو حیان نے ابوزرعہ سے بیان کیا ، کہا",
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا أَبُو حَيَّانَ عَنْ أَبِي زُرْعَةَ قَالَ جَلَسَ إِلَى مَرْوَانَ بْنِ الْحَكَمِ بِالْمَدِينَةِ ثَلَاثَةُ نَفَرٍ مِنْ الْمُسْلِمِينَ فَسَمِعُوهُ وَهُوَ يُحَدِّثُ عَنْ الْآيَاتِ أَنَّ أَوَّلَهَا خُرُوجًا الدَّجَّالُ فَقَالَ عَبْدُ اللَّهِ بْنُ عَمْرٍو لَمْ يَقُلْ مَرْوَانُ شَيْئًا قَدْ حَفِظْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدِيثًا لَمْ أَنْسَهُ بَعْدُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فَذَكَرَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14946,
                "hadithNumber": "7385",
                "englishNarrator": "Abu Zur'a reported:",
                "hadithEnglish": "There was a discussion in the presence of Marwan about the Last Hour, and Abdullah bin 'Amr رضی اللہ عنہ said: I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying. The rest of the hadith is the same, but there is no mention of forenoon.",
                "hadithUrdu": "لوگوں نے مروان کی موجودگی میں قیامت کے بارے میں مذاکرہ کیا تو حضرت عبداللہ بن عمرو رضی اللہ عنہ نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا ۔ ( آگے ) ان دونوں کی حدیث کے مانند بیان کیا اور \" دن چڑھنے کے وقت \" کاذ کر نہیں کیا ۔",
                "urduNarrator": "ہم سے نصر بن علی الجھمی نے بیان کیا، کہا ہم سے ابو احمد نے بیان کیا ,سفیان نے ابو حیان سے اور انھوں نے ابو زرعہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا أَبُو أَحْمَدَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي حَيَّانَ عَنْ أَبِي زُرْعَةَ قَالَ تَذَاكَرُوا السَّاعَةَ عِنْدَ مَرْوَانَ فَقَالَ عَبْدُ اللَّهِ بْنُ عَمْرٍو سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ بِمِثْلِ حَدِيثِهِمَا وَلَمْ يَذْكُرْ ضُحًى.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14947,
                "hadithNumber": "7386",
                "englishNarrator": "Amir bin Sharahil Sha'bi Sha'b Hamdan reported:",
                "hadithEnglish": "He asked Fatima رضی اللہ عنہ , daughter of Qais and sister of ad-Dahhak bin Qais رضی اللہ عنہ and she was the first amongst the emigrant women: Narrate to me a hadith which you had heard directly from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and there is no extra link in between them. She said: Very well, if you like, I am prepared to do that, and he said to her: Well, do It and narrate that to me. She said: I married the son of Mughira and he was a chosen young man of Quraish at that time, but he fell as a martyr in the first Jihad (fighting) on the side of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). When I became a widow, 'Abdul-Rahman bin Auf, one amongst the group of the Companions of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), sent me the proposal of marriage. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) also sent me such a message for his freed slave Usama bin Zaid رضی اللہ عنہ . And it had been conveyed to me that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had said (about Usama): He who loves me should also love Usama. When Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) talked to me (about this matter), I said: My affairs are in your hand. You may marry me to anyone whom you like. He said: You better shift now to the house of Umm Sharik, and Umm Sharik was a rich lady from amongst the Ansar. She spent generously for the cause of Allah and entertained guests very hospitably. I said: Well, I will do as you like. He said: Do not do that for Umm Sharik is a woman who is very frequently visited by guests and I do not like that your head may be uncovered or the cloth may be removed from your shank and the strangers may catch sight of them which you abhor. You better shift to the house of your cousin 'Abdullah bin 'Amr bin Umm Maktum and he is a person of the Bani Fihr branch of the Quraish, and he belonged to that tribe (to which Fatima رضی اللہ عنہا ) belonged. So I shifted to that house, and when my period of waiting was over, I heard the voice of an announcer making an announcement that the prayer would be observed in the mosque (where) congregational prayer (is observed). So I set out towards that mosque and observed prayer along with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and I was in the row of the women which was near the row of men. When Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had finished his prayer, he sat on the pulpit smiling and said: Every worshipper should keep sitting at his place. He then said: Do you know why I had asked you to assemble? They said: Allah and His Messenger know best. He said: By Allah. I have not made you assemble for exhortation or for a warning, but I have detained you here, for Tamim Dari, a Christian, who came and accepted Islam, told me something, which agrees with what I was telling, you about the Dajjal. He narrated to me that he had sailed in a ship along with thirty men of Bani Lakhm and Bani Judham and had been tossed by waves in the ocean for a month. Then these (waves) took them (near) the land within the ocean (island) at the time of sunset. They sat in a small side-boat and entered that island. There was a beast with long thick hair (and because of these) they could not distinguish his face from his back. They said: Woe to you, who can you be? Thereupon it said: I am al-Jassasa. They said: What is al-Jassasa? And it said: O people, go to this person in the monastery as he is very much eager to know about you. He (the narrator) said: When it named a person for us we were afraid of it lest it should be a devil. Then we hurriedly went on till we came to that monastery and found a well-built person there with his hands tied to his neck and having iron shackles between his two legs up to the ankles. We said: Woe be upon thee, who are you? And he said: You would soon come to know about me. but tell me who are you. We said: We are people from Arabia and we embarked upon a boat but the sea-waves had been driving us for one month and they brought as near this island. We got Into the side-boats and entered this island and here a beast met us with profusely thick hair and because of the thickness of his hair his face could not be distinguished from his back. We said: Woe be to thee, who are you? It said: I am al-Jassasa. We said: What is al-Jassasa? And it said: You go to this very person in the monastery for he is eagerly waiting for you to know about you. So we came to you in hot haste fearing that that might be the Devil. He (that chained person) said: Tell me about the date-palm trees of Baisan. We said: About what aspect of theirs do you seek information? He said: I ask you whether these trees bear fruit or not. We said: yes. Thereupon he said: I think these would not bear fruits. He said: Inform me about the lake of Tabariyya? We said: Which aspect of it do you want to know? He said: Is there water in it? They said: There is abundance of water in it. Thereupon he said: I think it would soon become dry. He again said: Inform me about the spring of Zughar. They said: Which aspect of it you want to know? He (the chained person) said: Is there water in it and does it irrigate (the land)? We said to him: Yes, there is abundance of water in it and the inhabitants (of Medina) irrigate (land) with the help of it, He said: Inform me about the unlettered Prophet; what has he done? We said: He has come out from Mecca and has settled In Yathrib (Medina). He said: Do the Arabs fight against him? We said: Yes. He said: How did he deal with them? We informed him that he had overcome those in his neighbourhood and they had submitted themselves before him. Thereupon he said to us: Has it actually happened? We said: Yes. Thereupon he said: If it is so that is better for them that they should show obedience to him. I am going to tell you about myself and I am Dajjal and would be soon permitted to get out and so I shall get out and travel in the land, and will not spare any town where I would not stay for forty nights except Mecca and Medina as these two (places) are prohibited (areas) for me and I would not make an attempt to enter any one of these two. An angel with a sword in his hand would confront me and would bar my way and there would be angels to guard every passage leading to it; then Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) striking the pulpit with the help of the end of his staff said: This implies Taiba meaning Medina. Have I not, told you an account (of the Dajjal) like this? 'The people said: Yes, and this account narrated by Tamim Dari was liked by me for it corroborates the account which I gave to you in regard to him (Dajjal) at Medina and Mecca. Behold he (Dajjal) is in the Syrian sea (Mediterranean) or the Yemen sea (Arabian sea). Nay, on the contrary, he is in the east, he is in the east, he is in the east, and he pointed with his hand towards the east. I (Fatima bint Qais رضی اللہ عنہا ) said: I preserved it in my mind (this narration from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ).",
                "hadithUrdu": "انھوں نے ضحاک بن قیس رضی اللہ تعالیٰ عنہ کی ہمشیرہ سید ہ فاطمہ بنت قیس رضی اللہ عنہ سے سوال کیا ، وہ اولین ہجرت کرنے والوں میں سے تھیں کہ آپ مجھے رسول اللہ صلی اللہ علیہ وسلم کی ایسی حدیث بیان کریں جو آپ نے رسول اللہ صلی اللہ علیہ وسلم سے ( بلاواسطہ ) سنی ہو ۔ وہ بولیں کہ اچھا ، اگر تم یہ چاہتے ہو تو میں بیان کروں گی ۔ انہوں نے کہا کہ ہاں بیان کرو ۔ سیدہ فاطمہ رضی اللہ عنہا نے کہا کہ میں نے ابن مغیرہ سے نکاح کیا اور وہ ان دنوں قریش کے عمدہ جوانوں میں سے تھے ، پھر وہ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ پہلے ہی جہاد میں شہید ہو گئے ۔ جب میں بیوہ ہو گئی تو مجھے عبدالرحمن بن عوف رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم کے صحابہ میں سے چند کے ساتھ آ کر نکاح کا پیغام دیا ۔ اور رسول اللہ صلی اللہ علیہ وسلم نے اپنے مولیٰ اسامہ بن زید رضی اللہ عنہ کے لئے پیغام بھیجا ۔ اور میں رسول اللہ صلی اللہ علیہ وسلم یہ حدیث سن چکی تھی کہ جو شخص مجھ سے محبت رکھے ، اس کو چاہئے کہ اسامہ رضی اللہ عنہ سے بھی محبت رکھے ۔ جب رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے اس بارے میں گفتگو کی تو میں نے کہا کہ میرے کام کا اختیار آپ صلی اللہ علیہ وسلم کو ہے ، آپ صلی اللہ علیہ وسلم جس سے چاہیں نکاح کر دیجئیے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم ام شریک کے گھر چلی جاؤ اور ام شریک انصار میں ایک مالدار عورت تھی اور اللہ کی راہ میں بہت زیادہ خرچ کرتی تھیں ، اس کے پاس مہمان اترتے تھے ۔ میں نے عرض کیا کہ بہت اچھا ، میں ام شریک کے پاس چلی جاؤں گی ۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ ام شریک کے پاس مت جا اس کے پاس مہمان بہت آتے ہیں اور مجھے برا معلوم ہوتا ہے کہ کہیں تیری اوڑھنی گر جائے یا تیری پنڈلیوں پر سے کپڑا ہٹ جائے اور لوگ تیرے بدن میں سے وہ دیکھیں جو تجھے برا لگے گا ۔ تم اپنے چچا کے بیٹے عبداللہ بن عمرو ابن ام مکتوم کے پاس چلی جاؤ اور وہ بنی فہر میں سے ایک شخص تھا اور فہر قریش کی ایک شاخ ہے اور وہ اس قبیلہ میں سے تھا جس میں سے سیدہ فاطمہ رضی اللہ عنہا بھی تھیں ۔ پھر سیدہ فاطمہ نے کہا کہ میں ان کے گھر میں چلی گئی ۔ جب میری عدت گزر گئی تو میں نے پکارنے والے کی آواز سنی اور وہ پکارنے والا رسول اللہ صلی اللہ علیہ وسلم کا منادی تھا ، وہ پکار رہا تھا کہ نماز کے لئے جمع ہو جاؤ ۔ میں بھی مسجد کی طرف نکلی اور میں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نماز پڑھی ۔ میں اس صف میں تھی جس میں عورتیں لوگوں کے پیچھے تھیں ۔ جب آپ صلی اللہ علیہ وسلم نے نماز پڑھ لی تو منبر پر بیٹھے اور آپ صلی اللہ علیہ وسلم ہنس رہے تھے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہر ایک آدمی اپنی نماز کی جگہ پر رہے ۔ پھر فرمایا کہ تم جانتے ہو کہ میں نے تمہیں کیوں اکٹھا کیا ہے؟ صحابہ بولے کہ اللہ اور اس کا رسول صلی اللہ علیہ وسلم خوب جانتے ہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ کی قسم میں نے تمہیں رغبت دلانے یا ڈرانے کے لئے جمع نہیں کیا ، بلکہ اس لئے جمع کیا کہ تمیم داری ایک نصرانی تھا ، وہ آیا اور اس نے بیعت کی اور مسلمان ہوا اور مجھ سے ایک حدیث بیان کی جو اس حدیث کے موافق ہے جو میں تم سے دجال کے بارے میں بیان کیا کرتا تھا ۔ اس نے بیان کیا کہ وہ یعنی تمیم سمندر کے جہاز میں تیس آدمیوں کے ساتھ سوار ہوا جو لخم اور جذام کی قوم میں سے تھے ، پس ان سے ایک مہینہ بھر سمندر کی لہریں کھیلتی رہیں ۔ پھر وہ لوگ سمندر میں ڈوبتے سورج کی طرف ایک جزیرے کے کنارے جا لگے ۔ پس وہ جہاز سے پلوار ( یعنی چھوٹی کشتی ) میں بیٹھے اور جزیرے میں داخل ہو گئے وہاں ان کو ایک جانور ملا جو کہ بھاری دم ، بہت بالوں والا کہ اس کا اگلا پچھلا حصہ بالوں کے ہجوم سے معلوم نہ ہوتا تھا ۔ لوگوں نے اس سے کہا کہ اے کمبخت تو کیا چیز ہے؟ اس نے کہا کہ میں جاسوس ہوں ۔ لوگوں نے کہا کہ جاسوس کیا؟ اس نے کہا کہ اس مرد کے پاس چلو جو دیر میں ہے ، کہ وہ تمہاری خبر کا بہت مشتاق ہے ۔ تمیم رضی اللہ عنہ نے کہا کہ جب اس نے مرد کا نام لیا تو ہم اس جانور سے ڈرے کہ کہیں شیطان نہ ہو ۔ تمیم نے کہا کہ پھر ہم دوڑتے ہوئے ( یعنی جلدی ) دیر میں داخل ہوئے ۔ دیکھا تو وہاں ایک بڑے قد کا آدمی ہے کہ ہم نے اتنا بڑا آدمی اور ویسا سخت جکڑا ہوا کبھی نہیں دیکھا ۔ اس کے دونوں ہاتھ گردن کے ساتھ بندھے ہوئے تھے اور دونوں زانوں سے ٹخنوں تک لوہے سے جکڑا ہوا تھا ۔ ہم نے کہا کہ اے کمبخت! تو کیا چیز ہے؟ اس نے کہا تم میری خبر پر قابو پا گئے ہو ( یعنی میرا حال تو تم کو اب معلوم ہو جائے گا ) ، تم اپنا حال بتاؤ کہ تم کون ہو؟ لوگوں نے کہا کہ ہم عرب لوگ ہیں ، سمندر میں جہاز میں سوار ہوئے تھے ، لیکن جب ہم سوار ہوئے تو سمندر کو جوش میں پایا پھر ایک مہینے کی مدت تک لہر ہم سے کھیلتی رہی ، پھر ہم اس جزیرے میں آ لگے تو چھوٹی کشتی میں بیٹھ کر جزیرے میں داخل ہوئے ، پس ہمیں ایک بھاری دم کا اور بہت بالوں والا جانور ملا ، ہم اس کے بالوں کی کثرت کی وجہ سے اس کا اگلا پچھلا حصہ نہ پہچانتے تھے ۔ ہم نے اس سے کہا کہ اے کمبخت! تو کیا چیز ہے؟ اس نے کہا کہ میں جاسوس ہوں ۔ ہم نے کہا کہ جاسوس کیا؟ اس نے کہا کہ اس مرد کے پاس چلو جو دیر میں ہے اور وہ تمہاری خبر کا بہت مشتاق ہے ۔ پس ہم تیری طرف دوڑتے ہوئے آئے اور ہم اس سے ڈرے کہ کہیں بھوت پریت نہ ہو ۔ پھر اس مرد نے کہا کہ مجھے بیسان کے نخلستان کی خبر دو ۔ ہم نے کہا کہ تو اس کا کون سا حال پوچھتا ہے؟ اس نے کہا کہ میں اس کے نخلستان کے بارے میں پوچھتا ہوں کہ پھلتا ہے؟ ہم نے اس سے کہا کہ ہاں پھلتا ہے ۔ اس نے کہا کہ خبردار رہو عنقریب وہ نہ پھلے گا ۔ اس نے کہا کہ مجھے طبرستان کے دریا کے بارے میں بتلاؤ ۔ ہم نے کہا کہ تو اس دریا کا کون سا حال پوچھتا ہے؟ وہ بولا کہ اس میں پانی ہے؟ لوگوں نے کہا کہ اس میں بہت پانی ہے ۔ اس نے کہا کہ البتہ اس کا پانی عنقریب ختم ہو جائے گا ۔ پھر اس نے کہا کہ مجھے زغر کے چشمے کے بارے میں خبر دو ۔ لوگوں نے کہا کہ اس کا کیا حال پوچھتا ہے؟ اس نے کہا کہ اس چشمہ میں پانی ہے اور وہاں کے لوگ اس پانی سے کھیتی کرتے ہیں؟ ہم نے اس سے کہا کہ ہاں! اس میں بہت پانی ہے اور وہاں کے لوگ اس کے پانی سے کھیتی کرتے ہیں ۔ اس نے کہا کہ مجھے امییّن کے پیغمبر کے بارے میں خبر دو کہ وہ کیا رہے؟ لوگوں نے کہا کہ وہ مکہ سے نکلے ہیں اور مدینہ میں گئے ہیں ۔ اس نے کہا کہ کیا عرب کے لوگ ان سے لڑے؟ ہم نے کہا کہ ہاں ۔ اس نے کہا کہ انہوں نے عربوں کے ساتھ کیا کیا؟ ہم نے کہا کہ وہ اپنے گرد و پیش کے عربوں پر غالب ہوئے اور انہوں نے ان کی اطاعت کی ۔ اس نے کہا کہ یہ بات ہو چکی؟ ہم نے کہا کہ ہاں ۔ اس نے کہا کہ خبردار رہو یہ بات ان کے حق میں بہتر ہے کہ پیغمبر کے تابعدار ہوں ۔ اور البتہ میں تم سے اپنا حال کہتا ہوں کہ میں مسیح ( دجال ) ہوں ۔ اور البتہ وہ زمانہ قریب ہے کہ جب مجھے نکلنے کی اجازت ہو گی ۔ پس میں نکلوں گا اور سیر کروں گا اور کسی بستی کو نہ چھوڑوں گا جہاں چالیس رات کے اندر نہ جاؤں ، سوائے مکہ اور طیبہ کے ، کہ وہاں جانا مجھ پر حرام ہے یعنی منع ہے ۔ جب میں ان دونوں بستیوں میں سے کسی کے اندر جانا چاہوں گا تو میرے آگے ایک فرشتہ بڑھ آئے گا اور اس کے ہاتھ میں ننگی تلوار ہو گی ، وہ مجھے وہاں جانے سے روک دے گا اور البتہ اس کے ہر ایک ناکہ پر فرشتے ہوں گے جو اس کی چوکیداری کریں گے ۔ سیدہ فاطمہ رضی اللہ عنہا نے کہا کہ پھر نبی کریم صلی اللہ علیہ وسلم نے اپنی چھڑی منبر پر مار کر فرمایا کہ طیبہ یہی ہے ، طیبہ یہی ہے ، طیبہ یہی ہے ۔ یعنی طیبہ سے مراد مدینہ منورہ ہے ۔ خبردار رہو! بھلا میں تم کو اس حال کی خبر دے نہیں چکا ہوں؟ تو اصحاب نے کہا کہ ہاں ۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ مجھے تمیم رضی اللہ عنہ کی بات اچھی لگی جو اس چیز کے موافق ہوئی جو میں نے تم لوگوں سے دجال اور مدینہ اور مکہ کے حال سے فرما دیا تھا ۔ خبردار ہو کہ وہ شام یا یمن کے سمندر میں ہے؟ نہیں بلکہ وہ مشرق کی طرف ہے ، وہ مشرق کی طرف ہے ، وہ مشرق کی طرف ہے ( مشرق کی طرف بحر ہند ہے شاید دجال بحر ہند کے کسی جزیرہ میں ہو ) اور آپ صلی اللہ علیہ وسلم نے مشرق کی طرف اشارہ کیا ۔ سیدہ فاطمہ بنت قیس رضی اللہ عنہا نے کہا کہ یہ حدیث میں نے رسول اللہ صلی اللہ علیہ وسلم سے یاد رکھی ہے ۔",
                "urduNarrator": "ہم سے عبد الوارث بن عبد الصمد بن عبد الوارث اور حجاج بن الش اعر نے عبد الصمد کی سند سے بیان کیا۔ لفظ عبد الوارث بن عبد الصمد کا ہے۔ میرے والد نے ہم سے میرے دادا کی سند سے حسین بن ذکوان کی سند سے بیان کیا, ابن بریدہ نے ہمیں حدیث بیان کی ، کہا : مجھے عامر بن شراحیل شعبی نے جن کا تعلق شعب ہمدان سے تھا ، حدیث بیان کی",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ عَبْدِ الصَّمَدِ بْنِ عَبْدِ الْوَارِثِ وَحَجَّاجُ بْنُ الشَّاعِرِ كِلَاهُمَا عَنْ عَبْدِ الصَّمَدِ وَاللَّفْظُ لِعَبْدِ الْوَارِثِ بْنِ عَبْدِ الصَّمَدِ حَدَّثَنَا أَبِي عَنْ جَدِّي عَنْ الْحُسَيْنِ بْنِ ذَكْوَانَ حَدَّثَنَا ابْنُ بُرَيْدَةَ حَدَّثَنِي عَامِرُ بْنُ شَرَاحِيلَ الشَّعْبِيُّ شَعْبُ هَمْدَانَ أَنَّهُ سَأَلَ فَاطِمَةَ بِنْتَ قَيْسٍ أُخْتَ الضَّحَّاكِ بْنِ قَيْسٍ وَكَانَتْ مِنْ الْمُهَاجِرَاتِ الْأُوَلِ فَقَالَ حَدِّثِينِي حَدِيثًا سَمِعْتِيهِ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُسْنِدِيهِ إِلَى أَحَدٍ غَيْرِهِ فَقَالَتْ لَئِنْ شِئْتَ لَأَفْعَلَنَّ فَقَالَ لَهَا أَجَلْ حَدِّثِينِي فَقَالَتْ نَكَحْتُ ابْنَ الْمُغِيرَةِ وَهُوَ مِنْ خِيَارِ شَبَابِ قُرَيْشٍ يَوْمَئِذٍ فَأُصِيبَ فِي أَوَّلِ الْجِهَادِ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا تَأَيَّمْتُ خَطَبَنِي عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ فِي نَفَرٍ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَخَطَبَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى مَوْلَاهُ أُسَامَةَ بْنِ زَيْدٍ وَكُنْتُ قَدْ حُدِّثْتُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَحَبَّنِي فَلْيُحِبَّ أُسَامَةَ فَلَمَّا كَلَّمَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُلْتُ أَمْرِي بِيَدِكَ فَأَنْكِحْنِي مَنْ شِئْتَ فَقَالَ انْتَقِلِي إِلَى أُمِّ شَرِيكٍ وَأُمُّ شَرِيكٍ امْرَأَةٌ غَنِيَّةٌ مِنْ الْأَنْصَارِ عَظِيمَةُ النَّفَقَةِ فِي سَبِيلِ اللَّهِ يَنْزِلُ عَلَيْهَا الضِّيفَانُ فَقُلْتُ سَأَفْعَلُ فَقَالَ لَا تَفْعَلِي إِنَّ أُمَّ شَرِيكٍ امْرَأَةٌ كَثِيرَةُ الضِّيفَانِ فَإِنِّي أَكْرَهُ أَنْ يَسْقُطَ عَنْكِ خِمَارُكِ أَوْ يَنْكَشِفَ الثَّوْبُ عَنْ سَاقَيْكِ فَيَرَى الْقَوْمُ مِنْكِ بَعْضَ مَا تَكْرَهِينَ وَلَكِنْ انْتَقِلِي إِلَى ابْنِ عَمِّكِ عَبْدِ اللَّهِ بْنِ عَمْرِو ابْنِ أُمِّ مَكْتُومٍ وَهُوَ رَجُلٌ مِنْ بَنِي فِهْرٍ فِهْرِ قُرَيْشٍ وَهُوَ مِنْ الْبَطْنِ الَّذِي هِيَ مِنْهُ فَانْتَقَلْتُ إِلَيْهِ فَلَمَّا انْقَضَتْ عِدَّتِي سَمِعْتُ نِدَاءَ الْمُنَادِي مُنَادِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُنَادِي الصَّلَاةَ جَامِعَةً فَخَرَجْتُ إِلَى الْمَسْجِدِ فَصَلَّيْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكُنْتُ فِي صَفِّ النِّسَاءِ الَّتِي تَلِي ظُهُورَ الْقَوْمِ فَلَمَّا قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاتَهُ جَلَسَ عَلَى الْمِنْبَرِ وَهُوَ يَضْحَكُ فَقَالَ لِيَلْزَمْ كُلُّ إِنْسَانٍ مُصَلَّاهُ ثُمَّ قَالَ أَتَدْرُونَ لِمَ جَمَعْتُكُمْ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ إِنِّي وَاللَّهِ مَا جَمَعْتُكُمْ لِرَغْبَةٍ وَلَا لِرَهْبَةٍ وَلَكِنْ جَمَعْتُكُمْ لِأَنَّ تَمِيمًا الدَّارِيَّ كَانَ رَجُلًا نَصْرَانِيًّا فَجَاءَ فَبَايَعَ وَأَسْلَمَ وَحَدَّثَنِي حَدِيثًا وَافَقَ الَّذِي كُنْتُ أُحَدِّثُكُمْ عَنْ مَسِيحِ الدَّجَّالِ حَدَّثَنِي أَنَّهُ رَكِبَ فِي سَفِينَةٍ بَحْرِيَّةٍ مَعَ ثَلَاثِينَ رَجُلًا مِنْ لَخْمٍ وَجُذَامَ فَلَعِبَ بِهِمْ الْمَوْجُ شَهْرًا فِي الْبَحْرِ ثُمَّ أَرْفَئُوا إِلَى جَزِيرَةٍ فِي الْبَحْرِ حَتَّى مَغْرِبِ الشَّمْسِ فَجَلَسُوا فِي أَقْرُبْ السَّفِينَةِ فَدَخَلُوا الْجَزِيرَةَ فَلَقِيَتْهُمْ دَابَّةٌ أَهْلَبُ كَثِيرُ الشَّعَرِ لَا يَدْرُونَ مَا قُبُلُهُ مِنْ دُبُرِهِ مِنْ كَثْرَةِ الشَّعَرِ فَقَالُوا وَيْلَكِ مَا أَنْتِ فَقَالَتْ أَنَا الْجَسَّاسَةُ قَالُوا وَمَا الْجَسَّاسَةُ قَالَتْ أَيُّهَا الْقَوْمُ انْطَلِقُوا إِلَى هَذَا الرَّجُلِ فِي الدَّيْرِ فَإِنَّهُ إِلَى خَبَرِكُمْ بِالْأَشْوَاقِ قَالَ لَمَّا سَمَّتْ لَنَا رَجُلًا فَرِقْنَا مِنْهَا أَنْ تَكُونَ شَيْطَانَةً قَالَ فَانْطَلَقْنَا سِرَاعًا حَتَّى دَخَلْنَا الدَّيْرَ فَإِذَا فِيهِ أَعْظَمُ إِنْسَانٍ رَأَيْنَاهُ قَطُّ خَلْقًا وَأَشَدُّهُ وِثَاقًا مَجْمُوعَةٌ يَدَاهُ إِلَى عُنُقِهِ مَا بَيْنَ رُكْبَتَيْهِ إِلَى كَعْبَيْهِ بِالْحَدِيدِ قُلْنَا وَيْلَكَ مَا أَنْتَ قَالَ قَدْ قَدَرْتُمْ عَلَى خَبَرِي فَأَخْبِرُونِي مَا أَنْتُمْ قَالُوا نَحْنُ أُنَاسٌ مِنْ الْعَرَبِ رَكِبْنَا فِي سَفِينَةٍ بَحْرِيَّةٍ فَصَادَفْنَا الْبَحْرَ حِينَ اغْتَلَمَ فَلَعِبَ بِنَا الْمَوْجُ شَهْرًا ثُمَّ أَرْفَأْنَا إِلَى جَزِيرَتِكَ هَذِهِ فَجَلَسْنَا فِي أَقْرُبِهَا فَدَخَلْنَا الْجَزِيرَةَ فَلَقِيَتْنَا دَابَّةٌ أَهْلَبُ كَثِيرُ الشَّعَرِ لَا يُدْرَى مَا قُبُلُهُ مِنْ دُبُرِهِ مِنْ كَثْرَةِ الشَّعَرِ فَقُلْنَا وَيْلَكِ مَا أَنْتِ فَقَالَتْ أَنَا الْجَسَّاسَةُ قُلْنَا وَمَا الْجَسَّاسَةُ قَالَتْ اعْمِدُوا إِلَى هَذَا الرَّجُلِ فِي الدَّيْرِ فَإِنَّهُ إِلَى خَبَرِكُمْ بِالْأَشْوَاقِ فَأَقْبَلْنَا إِلَيْكَ سِرَاعًا وَفَزِعْنَا مِنْهَا وَلَمْ نَأْمَنْ أَنْ تَكُونَ شَيْطَانَةً فَقَالَ أَخْبِرُونِي عَنْ نَخْلِ بَيْسَانَ قُلْنَا عَنْ أَيِّ شَأْنِهَا تَسْتَخْبِرُ قَالَ أَسْأَلُكُمْ عَنْ نَخْلِهَا هَلْ يُثْمِرُ قُلْنَا لَهُ نَعَمْ قَالَ أَمَا إِنَّهُ يُوشِكُ أَنْ لَا تُثْمِرَ قَالَ أَخْبِرُونِي عَنْ بُحَيْرَةِ الطَّبَرِيَّةِ قُلْنَا عَنْ أَيِّ شَأْنِهَا تَسْتَخْبِرُ قَالَ هَلْ فِيهَا مَاءٌ قَالُوا هِيَ كَثِيرَةُ الْمَاءِ قَالَ أَمَا إِنَّ مَاءَهَا يُوشِكُ أَنْ يَذْهَبَ قَالَ أَخْبِرُونِي عَنْ عَيْنِ زُغَرَ قَالُوا عَنْ أَيِّ شَأْنِهَا تَسْتَخْبِرُ قَالَ هَلْ فِي الْعَيْنِ مَاءٌ وَهَلْ يَزْرَعُ أَهْلُهَا بِمَاءِ الْعَيْنِ قُلْنَا لَهُ نَعَمْ هِيَ كَثِيرَةُ الْمَاءِ وَأَهْلُهَا يَزْرَعُونَ مِنْ مَائِهَا قَالَ أَخْبِرُونِي عَنْ نَبِيِّ الْأُمِّيِّينَ مَا فَعَلَ قَالُوا قَدْ خَرَجَ مِنْ مَكَّةَ وَنَزَلَ يَثْرِبَ قَالَ أَقَاتَلَهُ الْعَرَبُ قُلْنَا نَعَمْ قَالَ كَيْفَ صَنَعَ بِهِمْ فَأَخْبَرْنَاهُ أَنَّهُ قَدْ ظَهَرَ عَلَى مَنْ يَلِيهِ مِنْ الْعَرَبِ وَأَطَاعُوهُ قَالَ لَهُمْ قَدْ كَانَ ذَلِكَ قُلْنَا نَعَمْ قَالَ أَمَا إِنَّ ذَاكَ خَيْرٌ لَهُمْ أَنْ يُطِيعُوهُ وَإِنِّي مُخْبِرُكُمْ عَنِّي إِنِّي أَنَا الْمَسِيحُ وَإِنِّي أُوشِكُ أَنْ يُؤْذَنَ لِي فِي الْخُرُوجِ فَأَخْرُجَ فَأَسِيرَ فِي الْأَرْضِ فَلَا أَدَعَ قَرْيَةً إِلَّا هَبَطْتُهَا فِي أَرْبَعِينَ لَيْلَةً غَيْرَ مَكَّةَ وَطَيْبَةَ فَهُمَا مُحَرَّمَتَانِ عَلَيَّ كِلْتَاهُمَا كُلَّمَا أَرَدْتُ أَنْ أَدْخُلَ وَاحِدَةً أَوْ وَاحِدًا مِنْهُمَا اسْتَقْبَلَنِي مَلَكٌ بِيَدِهِ السَّيْفُ صَلْتًا يَصُدُّنِي عَنْهَا وَإِنَّ عَلَى كُلِّ نَقْبٍ مِنْهَا مَلَائِكَةً يَحْرُسُونَهَا قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَطَعَنَ بِمِخْصَرَتِهِ فِي الْمِنْبَرِ هَذِهِ طَيْبَةُ هَذِهِ طَيْبَةُ هَذِهِ طَيْبَةُ يَعْنِي الْمَدِينَةَ أَلَا هَلْ كُنْتُ حَدَّثْتُكُمْ ذَلِكَ فَقَالَ النَّاسُ نَعَمْ فَإِنَّهُ أَعْجَبَنِي حَدِيثُ تَمِيمٍ أَنَّهُ وَافَقَ الَّذِي كُنْتُ أُحَدِّثُكُمْ عَنْهُ وَعَنْ الْمَدِينَةِ وَمَكَّةَ أَلَا إِنَّهُ فِي بَحْرِ الشَّأْمِ أَوْ بَحْرِ الْيَمَنِ لَا بَلْ مِنْ قِبَلِ الْمَشْرِقِ مَا هُوَ مِنْ قِبَلِ الْمَشْرِقِ مَا هُوَ مِنْ قِبَلِ الْمَشْرِقِ مَا هُوَ وَأَوْمَأَ بِيَدِهِ إِلَى الْمَشْرِقِ قَالَتْ فَحَفِظْتُ هَذَا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": "{‏ قِصَّةِ الْجَسَّاسَةِ ‏}‏",
                "headingUrdu": "الجصاصہ",
                "headingEnglish": "Al-Jassasah",
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14948,
                "hadithNumber": "7387",
                "englishNarrator": "Al-Sha'bi reported:",
                "hadithEnglish": "We visited Fatima bin Qais رضی اللہ عنہ and she served us fresh dates which are called rutab and she also served us barley. I asked her about that woman in whose case three divorces had been pronounced as to how much time she should count as the waiting period. She said: My husband pronounced three divorces in my case and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) permitted me to spend any waiting period in my family. (It was during this period) that announcement was made for the people to observe prayer in the bigger Mosque. I went there along with people and I was in the front row meant for women and it was adjacent to the last row of men and I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) deliver sermon sitting on the pulpit. He said: The cousin of Tamim (Dari) sailed in the ocean. The rest of the hadith is the same but with this addition: (I see) as if I am looking to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) pointing his rod towards the land (and saying): It is Taiba, i.e. Medina.",
                "hadithUrdu": "ہم حضرت فاطمہ بنت قیس رضی اللہ تعالیٰ عنہ کے ہاں گئے ، انھوں نے ہمیں تازہ کھجوروں کاتحفہ دیا جن کو ابن طاب کی تازہ کھجوریں کہا جاتا تھا اور جو کے ستو پلائے ، میں نے ان سے ا س عورت کے بارے میں پوچھا جس کو تین طلاقیں دی گئی ہوں کہ وہ عدت کہاں گزارے گی؟انھوں نے کہا : مجھے میرے شوہر نے تین طلاقیں دی تھیں تو نبی کریم صلی اللہ علیہ وسلم نے مجھے اجازت دی تھی کہ میں انے گھر والوں کے درمیان عدت گزار لوں ، ( حضرت فاطمہ رضی اللہ تعالیٰ عنہا نے ) کہا : پھر ( عدت کے بعد ) لوگوں میں یہ اعلان کیا گیا کہ نماز کی جماعت ہونے والی ہے ، میں بھی دوسرے لوگوں کے ساتھ نماز کے لئے چل دی ، میں عورتوں کی پہلی صف میں تھی جو مردوں کی آخری صف کے پیچھے تھی ۔ انھوں نے کہا : میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ منبر پرخطبہ دے رہے تھے ، آپ نے فرمایا : \" تمیم داری کے چچا کے بیٹے ( ان کے قبیلے سے تعلق رکھنے والے رشتہ دار ) سمندر ( کے جہاز ) میں سوار ہوئے ۔ \" اسکے بعد ( سیار نے پوری ) حدیث بیان کی اور اس میں مزید کہا کہ ( حضرت فاطمہ رضی اللہ عنہا نے ) کہا : ایسے لگتا ہے کہ میں نبی کریم صلی اللہ علیہ وسلم کو دیکھ رہی ہوں ، آپ نے اپنے عصا کو زمین کی طرف جھکایا اور فرمایا : \" یہ طیبہ ہے ۔ \" آپ کی مراد مدینہ سے تھی ۔",
                "urduNarrator": "ہم سے یحییٰ بن حبیب الحارثی نے بیان کیا، ہم سے خالد بن حارث الحجیمی ابو عثمان نے بیان کیا، ہم سے قرہ نے بیان کیا, سیار ابو الحکم نے کہا : ہمیں شعبی نے حدیث بیان کی ، کہا : ہمیں شعبی نے حدیث بیان کی ، کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ الْهُجَيْمِيُّ أَبُو عُثْمَانَ حَدَّثَنَا قُرَّةُ حَدَّثَنَا سَيَّارٌ أَبُو الْحَكَمِ حَدَّثَنَا الشَّعْبِيُّ قَالَ دَخَلْنَا عَلَى فَاطِمَةَ بِنْتِ قَيْسٍ فَأَتْحَفَتْنَا بِرُطَبٍ يُقَالُ لَهُ رُطَبُ ابْنِ طَابٍ وَأَسْقَتْنَا سَوِيقَ سُلْتٍ فَسَأَلْتُهَا عَنْ الْمُطَلَّقَةِ ثَلَاثًا أَيْنَ تَعْتَدُّ قَالَتْ طَلَّقَنِي بَعْلِي ثَلَاثًا فَأَذِنَ لِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أَعْتَدَّ فِي أَهْلِي قَالَتْ فَنُودِيَ فِي النَّاسِ إِنَّ الصَّلَاةَ جَامِعَةً قَالَتْ فَانْطَلَقْتُ فِيمَنْ انْطَلَقَ مِنْ النَّاسِ قَالَتْ فَكُنْتُ فِي الصَّفِّ الْمُقَدَّمِ مِنْ النِّسَاءِ وَهُوَ يَلِي الْمُؤَخَّرَ مِنْ الرِّجَالِ قَالَتْ فَسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ عَلَى الْمِنْبَرِ يَخْطُبُ فَقَالَ إِنَّ بَنِي عَمٍّ لِتَمِيمٍ الدَّارِيِّ رَكِبُوا فِي الْبَحْرِ وَسَاقَ الْحَدِيثَ وَزَادَ فِيهِ قَالَتْ فَكَأَنَّمَا أَنْظُرُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَهْوَى بِمِخْصَرَتِهِ إِلَى الْأَرْضِ وَقَالَ هَذِهِ طَيْبَةُ يَعْنِي الْمَدِينَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14949,
                "hadithNumber": "7388",
                "englishNarrator": "It was narrated that Fatima bint Qais رضی اللہ عنہا said:",
                "hadithEnglish": "Tamim Dari رضی اللہ عنہ came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and informed Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) that he sailed in an ocean and his ship lost direction and thus landed at an island. They moved about in that land in search of water. There they saw a person who had been pulling his hair. The rest of the hadith is the same. And he (Dajjal) said: If I were to be permitted to set out I would have covered all the lands except Taiba. Then Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) brought (Tamim Dari) before the public and he narrated to them and said: That is Taiba and that is the Dajjal.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے پاس حضرت تمیم داری رضی اللہ عنہ آئے اور رسول اللہ صلی اللہ علیہ وسلم کو بتایا کہ وہ سمندر ( کےجہاز ) میں سوار ہوئے تو ان کا جہاز راستے سے ہٹ گیا ، وہ ایک جزیرے میں جا اترے ، وہ اس جزیرے میں نکل کر پانی ڈھونڈنے لگے ، وہاں ایک انسان سے ملاقات ہوئی جو اپنے بال گھسیٹ رہاتھا ، پھر ( پوری ) حدیث بیان کی اور اس میں یہ بھی کہا : پھر اس ( دجال ) نے کہا : اگر مجھے نکلنے کی اجازت دی گئی تو میں طیبہ ( مدینہ ) کے سوا تمام شہروں میں جاؤں گا ، پھر رسول اللہ صلی اللہ علیہ وسلم ان ( حضرت تمیم داری رضی اللہ عنہ ) کو لوگوں کے سامنے لے گئے اور ( ان کی موجودگی میں ) آپ نے ان ( لوگوں ) کے سامنے ( یہ واقعہ ) بیان کیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" یہ طیبہ ہے اور وہ ( شخص ) دجال ہے ۔ \"",
                "urduNarrator": "ہم سے حسن بن علی الحلوانی اور احمد بن عثمان النوفلی نے بیان کیا، کہا ہم سے وہب بن جریر نے بیان کیا، ہم سے میرے والد نے بیان کیا, غیلان بن جریر نے شعبی سے اور انھوں نے حضرت فاطمہ بنت قیس رضی اللہ عنہا سے حدیث بیان کی ، کہا",
                "hadithArabic": "و حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ وَأَحْمَدُ بْنُ عُثْمَانَ النَّوْفَلِيُّ قَالَا حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ حَدَّثَنَا أَبِي قَالَ سَمِعْتُ غَيْلَانَ بْنَ جَرِيرٍ يُحَدِّثُ عَنْ الشَّعْبِيِّ عَنْ فَاطِمَةَ بِنْتِ قَيْسٍ قَالَتْ قَدِمَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَمِيمٌ الدَّارِيُّ فَأَخْبَرَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ رَكِبَ الْبَحْرَ فَتَاهَتْ بِهِ سَفِينَتُهُ فَسَقَطَ إِلَى جَزِيرَةٍ فَخَرَجَ إِلَيْهَا يَلْتَمِسُ الْمَاءَ فَلَقِيَ إِنْسَانًا يَجُرُّ شَعَرَهُ وَاقْتَصَّ الْحَدِيثَ وَقَالَ فِيهِ ثُمَّ قَالَ أَمَا إِنَّهُ لَوْ قَدْ أُذِنَ لِي فِي الْخُرُوجِ قَدْ وَطِئْتُ الْبِلَادَ كُلَّهَا غَيْرَ طَيْبَةَ فَأَخْرَجَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى النَّاسِ فَحَدَّثَهُمْ قَالَ هَذِهِ طَيْبَةُ وَذَاكَ الدَّجَّالُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14950,
                "hadithNumber": "7389",
                "englishNarrator": "Fatima bin Qais رضی اللہ عنہا reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sat on the pulpit and said: O people, Tamim Dari has reported to me that some persons of his tribe sailed in the ocean in a boat and it capsised and then some of them travelled on one of the planks of the boat and they went to an island in the ocean. The rest of the hadith is the same.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم منبر پر رونق افروز ہوئے اور فرمایا : \" لوگو! مجھے تمیم داری نے یہ بتایا ہے کہ ان کی قوم کے کچھ لوگ اپنے ایک جہاز میں سمندر میں تھے ، وہ جہاز ٹوٹ گیا اوران میں سے کچھ لوگ جہاز کے تختوں میں سے ایک تختے پر سوار ہوگئے اور سمندر میں ایک جزیرے کی طرف جانکلے ۔ \" اور پھر ( آگے باقی ماندہ ) حدیث بیان کی ۔",
                "urduNarrator": "ہم سے ابوبکر بن اسحاق نے بیان کیا، کہا ہم سے یحییٰ بن بکر نے بیان کیا، کہا ہم سے المغیرہ نے بیان کیا، یعنی الحزامی نے, ابو زناد نے شعبی سے اور انھوں نےحضرت فاطمہ بنت قیس رضی اللہ عنہا سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي أَبُو بَكْرِ بْنُ إِسْحَقَ حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ حَدَّثَنَا الْمُغِيرَةُ يَعْنِي الْحِزَامِيَّ عَنْ أَبِي الزِّنَادِ عَنْ الشَّعْبِيِّ عَنْ فَاطِمَةَ بِنْتِ قَيْسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَعَدَ عَلَى الْمِنْبَرِ فَقَالَ أَيُّهَا النَّاسُ حَدَّثَنِي تَمِيمٌ الدَّارِيُّ أَنَّ أُنَاسًا مِنْ قَوْمِهِ كَانُوا فِي الْبَحْرِ فِي سَفِينَةٍ لَهُمْ فَانْكَسَرَتْ بِهِمْ فَرَكِبَ بَعْضُهُمْ عَلَى لَوْحٍ مِنْ أَلْوَاحِ السَّفِينَةِ فَخَرَجُوا إِلَى جَزِيرَةٍ فِي الْبَحْرِ وَسَاقَ الْحَدِيثَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14951,
                "hadithNumber": "7390",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: There will be no land which would not be covered by the Dajjal but Mecca and Medina, and there would no passage out of the passages leading to them which would not be guarded by angels arranged in rows. Then he (the Dajjal) would appear in a barren place adjacent to Medina and it would rock three times that every unbeliever and hypocrite would get out of it towards him.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" مکہ اور مدینہ کے علاوہ کوئی شہر نہیں مگر دجال! اسے روندے گا ۔ ان ( دو شہروں ) کے راستوں میں سے ہر راستے پر فرشتے صف باندھتے ہوئے پہرہ دے رہے ہوں گے پھر وہ ایک شوریلی زمین میں اترے گا ۔ اس وقت مدینہ تین بارلرز ےگا اور ہر کافر اور منافق اس میں سے نکل کر اس ( دجال ) کے پاس چلا جائے گا ۔ \"",
                "urduNarrator": "مجھ سے علی بن حجر السعدی نے بیان کیا: ہم سے ولید بن مسلم نے بیان کیا, ابن عمر واوزاعی نے اسحاق بن عبداللہ بن ابی طلحہ سے روایت کی ، کہا : مجھے حضرت انس بن مالک رضی اللہ عنہ نے حدیث بیان کی ، کہا",
                "hadithArabic": "حَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنِي أَبُو عَمْرٍو يَعْنِي الْأَوْزَاعِيَّ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ مِنْ بَلَدٍ إِلَّا سَيَطَؤُهُ الدَّجَّالُ إِلَّا مَكَّةَ وَالْمَدِينَةَ وَلَيْسَ نَقْبٌ مِنْ أَنْقَابِهَا إِلَّا عَلَيْهِ الْمَلَائِكَةُ صَافِّينَ تَحْرُسُهَا فَيَنْزِلُ بِالسِّبْخَةِ فَتَرْجُفُ الْمَدِينَةُ ثَلَاثَ رَجَفَاتٍ يَخْرُجُ إِلَيْهِ مِنْهَا كُلُّ كَافِرٍ وَمُنَافِقٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14952,
                "hadithNumber": "7391",
                "englishNarrator": "This hadith has been transmitted on the authority of Anas رضی اللہ عنہ:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said this but with this addition that (the Dajjal would come) and pitch his tent in the waste-land of Juruf and thus there would come out of (the city) every hypocrite, man and woman.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ۔ اس کے بعد اسی ( سابقہ حدیث کی ) طرح بیان کیا ، مگر اس میں کہا : چنانچہ وہ ( دجال ) جرف کی شوریلی زمین میں آکر اپنا خیمہ لگائے گا اور کہا : ہر منافق مرد اور عورت نکل کر اس کے پاس چلے جائیں گے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے یونس بن محمد نے بیان کیا, حماد بن سلمہ نے اسحاق بن عبداللہ بن ابی طلحہ سے اور انھوں نے حضرت انس رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ عَنْ حَمَّادِ بْنِ سَلَمَةَ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ عَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَذَكَرَ نَحْوَهُ غَيْرَ أَنَّهُ قَالَ فَيَأْتِي سِبْخَةَ الْجُرُفِ فَيَضْرِبُ رِوَاقَهُ وَقَالَ فَيَخْرُجُ إِلَيْهِ كُلُّ مُنَافِقٍ وَمُنَافِقَةٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14953,
                "hadithNumber": "7392",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: The Dajjal would be followed by seventy thousand Jews of Isfahan wearing Persian shawls.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اصبہان کے یہودیوں میں سے ستر ہزار ( یہودی ) دجال کی پیروی کریں گے ، ان ( کے جسموں ) پر طینسان کی حبائیں ہوں گی ۔ \"",
                "urduNarrator": "ہم سے منصور بن ابی مزاحم نے بیان کیا، ہم سے یحییٰ بن حمزہ نے بیان کیا، انہوں نے الاوزاعی کی سند سے، اسحق بن عبداللہ نے اپنے چچا کی سند سے بیان کیا, حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا مَنْصُورُ بْنُ أَبِي مُزَاحِمٍ حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ عَنْ الْأَوْزَاعِيِّ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ عَنْ عَمِّهِ أَنَسِ بْنِ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَتْبَعُ الدَّجَّالَ مِنْ يَهُودِ أَصْبَهَانَ سَبْعُونَ أَلْفًا عَلَيْهِمْ الطَّيَالِسَةُ.",
                "headingArabic": "فِي بَقِيَّةٍ مِنْ أَحَادِيثِ الدَّجَّالِ",
                "headingUrdu": "دجال کے بارے میں باقی احادیث",
                "headingEnglish": "The Rest Of The Ahadith About Ad-Dajjal",
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14954,
                "hadithNumber": "7393",
                "englishNarrator": "Umm Sharik reported:",
                "hadithEnglish": "I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: The people would run away from the Dajjal seeking shelter in the mountains. She said: Where would be the Arabs then in that day? He said: They would be small in number.",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم فرمارہے تھے : \" لوگ دجال سے فرار ہوکر پہاڑوں میں جائیں گے ۔ \" حضرت ام شریک رضی اللہ عنہا نے کہا : اللہ کےرسول صلی اللہ علیہ وسلم ! اس وقت عرب کہاں ہوں گے؟ ( جو دین کے دفاع میں سینہ سپر ہوجاتے ہیں ۔ ) آپ صلی اللہ علیہ وسلم نے فرمایا؛ \" وہ بہت کم ہوں گے ۔ \"",
                "urduNarrator": "ہم سے ہارون بن عبداللہ نے بیان کیا, حجاج بن محمد نے کہا ,  ابن جریج نے کہا کہ مجھے ابو زبیر نے حدیث بیان کی ، انھوں نے حضر ت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے سنا ، وہ کہہ رہے تھے کہ مجھے ام شریک نے خبر دی کہ انھوں نے",
                "hadithArabic": "حَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ قَالَ قَالَ ابْنُ جُرَيْجٍ حَدَّثَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ أَخْبَرَتْنِي أُمُّ شَرِيكٍ أَنَّهَا سَمِعَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَيَفِرَّنَّ النَّاسُ مِنْ الدَّجَّالِ فِي الْجِبَالِ قَالَتْ أُمُّ شَرِيكٍ يَا رَسُولَ اللَّهِ فَأَيْنَ الْعَرَبُ يَوْمَئِذٍ قَالَ هُمْ قَلِيلٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14955,
                "hadithNumber": "7394",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Ibn Juraij with the same chain of transmitters.",
                "hadithUrdu": "ہم سے محمد بن بشار اور عبد بن حمید نے بیان کیا, ابو عاصم نے ابن جریج سے اسی سند کے ساتھ ( یہی ) حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَاه مُحَمَّدُ بْنُ بَشَّارٍ وَعَبْدُ بْنُ حُمَيْدٍ قَالَا حَدَّثَنَا أَبُو عَاصِمٍ عَنْ ابْنِ جُرَيْجٍ بِهَذَا الْإِسْنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14956,
                "hadithNumber": "7395",
                "englishNarrator": "Abu Qatada reported:",
                "hadithEnglish": "We used to go to Imran bin Husain رضی اللہ عنہ passing in front of Hisham bin 'Amir رضی اللہ عنہ . He, one day, said: You pass by me (in order) to go to some persons, but (amongst the living persons) none remained in the company of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) more than I and none knows more a hadith than I. I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: There would be no creation (creating more trouble) than the Dajjal right from the creation of Adam to the Last Hour.",
                "hadithUrdu": "ہم حضرت ہشام بن عامر رضی اللہ عنہ کے پاس سے گزر کر حضرت عمران بن حصین رضی اللہ عنہ کے پاس جایا کر تے تھے ، ایک دن انھوں نے کہا : تم مجھے چھوڑ کر ایسے لوگوں کے پاس جاتے ہوجو مجھ سے زیادہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہونے والے نہیں تھے اور نہ ان کو مجھ سے زیادہ رسول اللہ صلی اللہ علیہ وسلم کی احادیث کا علم ہے ، میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سناتھا : \" حضرت آدم علیہ السلام سے لے کر قیامت تک کوئی مخلوق ( فتنہ وفساد میں ) ایسی نہیں جو دجال سے بڑی ہو ۔ \"",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا : ہم سے احمد بن اسحاق الحضرمی نے بیان کیا , عبدالعزیز بن مختار نے کہا : ہمیں ایوب نے حمید بن ہلال سے حدیث بیان کی ، انھوں نے ایک گروہ سے روایت کی جن میں ابو دہماء اور ابو قتادہ شامل ہیں ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا أَحْمَدُ بْنُ إِسْحَقَ الْحَضْرَمِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ الْمُخْتَارِ حَدَّثَنَا أَيُّوبُ عَنْ حُمَيْدِ بْنِ هِلَالٍ عَنْ رَهْطٍ مِنْهُمْ أَبُو الدَّهْمَاءِ وَأَبُو قَتَادَةَ قَالُوا كُنَّا نَمُرُّ عَلَى هِشَامِ بْنِ عَامِرٍ نَأْتِي عِمْرَانَ بْنَ حُصَيْنٍ فَقَالَ ذَاتَ يَوْمٍ إِنَّكُمْ لَتُجَاوِزُونِي إِلَى رِجَالٍ مَا كَانُوا بِأَحْضَرَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنِّي وَلَا أَعْلَمَ بِحَدِيثِهِ مِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا بَيْنَ خَلْقِ آدَمَ إِلَى قِيَامِ السَّاعَةِ خَلْقٌ أَكْبَرُ مِنْ الدَّجَّالِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14957,
                "hadithNumber": "7396",
                "englishNarrator": "It was narrated that Humaid bin Hilal:",
                "hadithEnglish": "Three of his people, including Abu Qatadah, said: \"We used to pass by Hisham bin Amir رضی اللہ عنہ on our way to Imraan bin Husain رضی اللہ عنہ ...\" a hadith like that of Abdul Aziz bin Mukhtar, except that he said: \" a matter of greater impact than the Dajjal.\"",
                "hadithUrdu": "ہم ہشام بن عامر رضی اللہ عنہ کے پاس سے گزر کر حضرت عمران بن حصین رضی اللہ عنہ کے پا س جاتے تھے ۔ جس طرح عبدالعزیز بن مختار کی روایت ہے مگر انھوں نے کہا؛ \" دجال ( کے فتنے ) سے بڑا کوئی معاملہ ( پیش نہیں آیا ۔ ) \"",
                "urduNarrator": "مجھ سے محمد بن حاتم نے بیان کیا، ہم سے عبداللہ بن جعفر الرقی نے بیان کیا, عبیداللہ بن عمرو نے ایوب سے ، انھوں نے حمید بن ہلال سے اور انھوں نے اپنی قوم کے تین لوگوں سے روایت کی جن میں ابو قتادہ بھی شامل ہیں کہ",
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ الرَّقِّيُّ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَمْرٍو عَنْ أَيُّوبَ عَنْ حُمَيْدِ بْنِ هِلَالٍ عَنْ ثَلَاثَةِ رَهْطٍ مِنْ قَوْمِهِ فِيهِمْ أَبُو قَتَادَةَ قَالُوا كُنَّا نَمُرُّ عَلَى هِشَامِ بْنِ عَامِرٍ إِلَى عِمْرَانَ بْنِ حُصَيْنٍ بِمِثْلِ حَدِيثِ عَبْدِ الْعَزِيزِ بْنِ مُخْتَارٍ غَيْرَ أَنَّهُ قَالَ أَمْرٌ أَكْبَرُ مِنْ الدَّجَّالِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14958,
                "hadithNumber": "7397",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) having said: Hasten to do good deeds before six things happen: the rising of the sun from the west, the smoke, the Dajjal, the beast and (the death) of one of you or the general turmoil.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \" چھ چیزوں کے ظہور سے پہلے نیک عمل کرنے میں سبقت کرو ۔ سورج کے مغرب سے طلوع ہونے ، دھوئیں ، دجال ، زمین کے چوپائے ، خاص طور پر تم میں سے کسی ایک کو پیش آنے والے معاملے ( بیماری ، عاجز کردینے والا بڑھاپا یا کوئی رکاوٹ ) اور ہر کسی کو پیش آنے والا معاملہ ( مثلا : اجتماعی گمراہی ، فتنے کے زمانے میں قتل عام ، قیامت سے پہلے ۔ ) \"",
                "urduNarrator": "ہم سے یحییٰ بن ایوب، قتیبہ بن سعید اور ابن حجر نے بیان کیا: ہم سے اسماعیل یعنی ابن جعفر نے امام کی سند سے بیان کیاالعلاء کے والد ( عبدالرحمان ) نے حضرت ابو ہریرۃ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ بْنُ سَعِيدٍ وَابْنُ حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَعِيلُ يَعْنُونَ ابْنَ جَعْفَرٍ عَنْ الْعَلَاءِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ بَادِرُوا بِالْأَعْمَالِ سِتًّا طُلُوعَ الشَّمْسِ مِنْ مَغْرِبِهَا أَوْ الدُّخَانَ أَوْ الدَّجَّالَ أَوْ الدَّابَّةَ أَوْ خَاصَّةَ أَحَدِكُمْ أَوْ أَمْرَ الْعَامَّةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14959,
                "hadithNumber": "7398",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Hasten in performing these good deeds (before these) six things (happen): (the appearance) of the Dajjal, the smoke, the beast of the earth, the rising of the sun from the west, the general turmoil (leading to large-scale massacre) and death of masses and individuals.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" چھ چیزوں کے ظہور سے پہلے نیک اعمال میں سبقت کرو : دجال ، دھواں ، زمین کا چوپایہ ، سورج کا مغرب سے طلوع ہونا ، عام لوگوں کے ساتھ پیش آنے والا معاملہ یا خصوصی طور پر تم سے کسی ایک کو پیش آنے والا معاملہ ۔ \"",
                "urduNarrator": "ہم سے امیہ بن بسطام العیشی نے بیان کیا، ہم سے یزید بن زرعی نے بیان کیا, شعبہ نے قتادہ سے ، انھوں نے حسن سے ، انھوں نے زیاد بن ریاح سے ، انھوں نے حضرت ابوہریرۃ رضی اللہ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أُمَيَّةُ بْنُ بِسْطَامَ الْعَيْشِيُّ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ زِيَادِ بْنِ رِيَاحٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ بَادِرُوا بِالْأَعْمَالِ سِتًّا الدَّجَّالَ وَالدُّخَانَ وَدَابَّةَ الْأَرْضِ وَطُلُوعَ الشَّمْسِ مِنْ مَغْرِبِهَا وَأَمْرَ الْعَامَّةِ وَخُوَيْصَّةَ أَحَدِكُمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14960,
                "hadithNumber": "7399",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Qatada through another chain of transmitters.",
                "hadithUrdu": "ہم سے زہیر بن حرب اور محمد بن المثنیٰ نے بیان کیا، کہا ہم سے عبد الصمد بن عبد الوارث نے بیان کیا, ہمام نے قتادہ سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَاه زُهَيْرُ بْنُ حَرْبٍ وَمُحَمَّدُ بْنُ الْمُثَنَّى قَالَا حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14961,
                "hadithNumber": "7400",
                "englishNarrator": "Ma'qil bin Yasar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Worshiping during the period of widespread turmoil is like emigration towards me.",
                "hadithUrdu": "آ پ نے فرمایا : \" کو طرف پھیلی ہوئی قتل وغارت گری کے دوران میں عبادت ( پر توجہ مرکوز ) کرنا ، میری طرف ہجرت کرنے کی طرح ہے ۔ \"",
                "urduNarrator": "یحییٰ بن یحییٰ نے ہمیں حدیث بیان کی ، کہا : ہمیں حماد بن زید نے خبردی ، انھوں نے معلی بن زیاد سے ، انھوں نے معاویہ بن قرہ سے ، انھوں نے معقل بن یسار رضی اللہ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ۔ اسی طرح ہمیں قتیبہ بن سعید نے یہی حدیث بیان کی ، انھوں نے کہا ۔ ہمیں حماد نے معلیٰ بن زیاد سے حدیث بیان کی ، انھوں نے اس روایت کو معاویہ بن قرہ کی طرف لوٹایا ، انھوں نے حضرت معقل بن یسار رضی اللہ عنہ کی طرف اور انھوں نے نبی کریم صلی اللہ علیہ وسلم کی طرف منسوب کرتے ہوئے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ مُعَلَّى بْنِ زِيَادٍ عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ عَنْ مَعْقِلِ بْنِ يَسَارٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ح و حَدَّثَنَاه قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا حَمَّادٌ عَنْ الْمُعَلَّى بْنِ زِيَادٍ رَدَّهُ إِلَى مُعَاوِيَةَ بْنِ قُرَّةَ رَدَّهُ إِلَى مَعْقِلِ بْنِ يَسَارٍ رَدَّهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْعِبَادَةُ فِي الْهَرْجِ كَهِجْرَةٍ إِلَيَّ.",
                "headingArabic": "فَضْلِ الْعِبَادَةِ فِي الْهَرْجِ",
                "headingUrdu": "افراتفری کے وقت عبادت کی فضیلت",
                "headingEnglish": "The Virtue Of Worship At Times Of Turmoil",
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14962,
                "hadithNumber": "7401",
                "englishNarrator": null,
                "hadithEnglish": "The previous hadith is narrated through Abu Kamil from Hammad with the same chain.",
                "hadithUrdu": "یہی حدیث مجھے ابو کامل نے بیان کی ، انھوں نے کہا : ہمیں حماد نے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنِيهِ أَبُو كَامِلٍ حَدَّثَنَا حَمَّادٌ بِهَذَا الْإِسْنَادِ نَحْوَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14963,
                "hadithNumber": "7402",
                "englishNarrator": "Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The Last Hour would affect (most terribly) the wicked persons.",
                "hadithUrdu": "آپ نے فرمایا : \" قیامت صرف بدترین لوگوں پرہی قائم ہوگی ۔ \"",
                "urduNarrator": "ہم سے زہیر بن حرب نے بیان کیا، کہا ہم سے عبدالرحمٰن نے بیان کیا، ہم سے ابن مہدی نے بیان کیا، ہم سے شعبہ نے بیان کیا، وہ علی بن عکر سے اور ابو الاحواص کی سند سے, حضرت عبداللہ ( بن مسعود رضی اللہ عنہ ) سے روایت ہے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ يَعْنِي ابْنَ مَهْدِيٍّ حَدَّثَنَا شُعْبَةُ عَنْ عَلِيِّ بْنِ الْأَقْمَرِ عَنْ أَبِي الْأَحْوَصِ عَنْ عَبْدِ اللَّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَقُومُ السَّاعَةُ إِلَّا عَلَى شِرَارِ النَّاسِ.",
                "headingArabic": "قُرْبِ السَّاعَةِ",
                "headingUrdu": "قیامت کا نقطہ نظر",
                "headingEnglish": "The Approach Of The Hour",
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 14651,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=586",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=584",
                "label": "584",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=585",
                "label": "585",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=586",
                "label": "586",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=587",
                "label": "587",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=588",
                "label": "588",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=589",
                "label": "589",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=590",
                "label": "590",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=588",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=588",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=586",
        "to": 14675,
        "total": 40465
    }
}