{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 332,
        "data": [
            {
                "id": 8564,
                "hadithNumber": "1000",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated by Yahya bin Sa'id with the same chain of transmitters.",
                "hadithUrdu": "ہم سے محمد بن المثنی نے بیان کیا,( سلیمان بن بلال کے بجائے ) عبد الوہاب ثقفی ، سفیان بن عیینہ ، ابو خالد احمر اورعیسیٰ بن یونس سبھی نے یحییٰ بن سعید سے ( باقی ماندہ ) اسی سند کے ساتھ اسی کے مانند حدیث روایت کی ہے.",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ يَعْنِي الثَّقَفِيَّ، ح قَالَ: وَحَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ح قَالَ: وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ، ح قَالَ: وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ: أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، كُلُّهُمْ عَنْ يَحْيَى بْنِ سَعِيدٍ، بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": "التَّوَسُّطِ فِي الْقِرَاءَةِ فِي الصَّلاَةِ الْجَهْرِيَّةِ بَيْنَ الْجَهْرِ وَالإِسْرَارِ إِذَا خَافَ مِنَ الْجَهْرِ مَفْسَدَةً",
                "headingUrdu": "نماز میں قرآن کی تلاوت کرتے وقت اعتدال جب بلند آواز سے پڑھا جائے اور نہ بہت اونچی آواز میں پڑھا جائے اور نہ بہت نرم اور جب بلند آواز سے پڑھا جائے تو منفی نتائج کا اندیشہ ہو",
                "headingEnglish": "Moderation When Reciting Qur'an In A Prayer When It Is To Be Recited Out Loud, And Making it Neither Too Loud Nor Too Soft, And When There Is The Fear Of Negative Consequences If It Is Recited Out Loud",
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8565,
                "hadithNumber": "1001",
                "englishNarrator": "Ibn 'Abbas رضی اللہ عنہما reported:",
                "hadithEnglish": "The word of (Allah) Great and Glorious: 'And utter not thy prayer loudly, nor be low in it (xvii. 110) was revealed as the Messenger of Allah (ﷺ) was hiding himself in Mecca. When he led his Companions in prayer he raised his voice (while reciting the) Qur'an. And when the polytheists heard that, they reviled the Qur'an and Him Who revealed it and him who brought it. Upon this Allah, the Exalted, said to His Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌): Utter not thy prayer so loudly that the polytheists may hear thy recitation and (recite it) not so low that it may be inaudible to your Companions. Make them hear the Qur'an, but do not recite it loudly and seek a (middle) way between these. Recite between loud and low tone.",
                "hadithUrdu": "﴿ولا تجهر بصلاتك ولا تخافت بها﴾ ’’ اور اپنی نماز نہ بلند آواز سے پڑھیں اور نہ اسے پست کریں ‘ ‘ کے بارے میں روایت کی ، انہوں نے کہا : یہ آیت اس وقت اتری جب رسول اللہﷺ مکہ میں پوشیدہ ( عبادت کرتے ) تھے ۔ جب آپ اپنے ساتھیوں کو جماعت کراتے تو قراءت بلند آواز سے کرتے تھے ، مشرک جب یہ قراءت سنتے تو قرآن کو ، اس کے نازل کرنے والے کو اور اس کے لانے والے کو برا بھلا کہتے ۔ اس پر اللہ تعالیٰ نے اپنے نبیﷺ کو ہدایت کی : ’’ اپنی نماز میں ( آواز کو اس قدر ) بلند نہ کریں ‘ ‘ کہ آپ کی قراءت مشرکوں کو سنائی دے ’’ اور نہ اس ( کی آواز ) کو پست کریں ‘ ‘ اپنے ساتھیوں سے ، انہیں قرآن سنائیں اور آواز اتنی زیاد اونچی نہ کریں ’’اور ان ( دونوں ) کے درمیان کی راہ اختیار کریں ۔ ‘ ‘ ( اللہ تعالیٰ ) فرماتا ہے : بلند اور آہستہ کے درمیان ( میں رہیں ۔ )",
                "urduNarrator": "ابو جعفر محمد بن الصباح اور عمرو نقید نے ہشیم کی سند سے بیان کیا، کہا, ہم سے ہشیم نے بیان کیا، ہم سے ابو بشر نے بیان کیا,سعید بن جبیر نے حضرت ابن عباس رضی اللہ عنہما سے اللہ تعالیٰ کے فرمان",
                "hadithArabic": "حَدَّثَنَا أَبُو جَعْفَرٍ مُحَمَّدُ بْنُ الصَّبَّاحِ، وَعَمْرٌو النَّاقِدُ، جَمِيعًا عَنْ هُشَيْمٍ، قَالَ ابْنُ الصَّبَّاحِ: حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا أَبُو بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، فِي قَوْلِهِ عَزَّ وَجَلَّ: {وَلَا تَجْهَرْ بِصَلَاتِكَ وَلَا تُخَافِتْ بِهَا} قَالَ: نَزَلَتْ وَرَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مُتَوَارٍ بِمَكَّةَ، فَكَانَ إِذَا صَلَّى بِأَصْحَابِهِ رَفَعَ صَوْتَهُ بِالْقُرْآنِ، فَإِذَا سَمِعَ ذَلِكَ الْمُشْرِكُونَ سَبُّوا الْقُرْآنَ وَمَنْ أَنْزَلَهُ وَمَنْ جَاءَ بِهِ، فَقَالَ اللهُ تَعَالَى لِنَبِيِّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: {وَلَا تَجْهَرْ بِصَلَاتِكَ} «فَيَسْمَعَ الْمُشْرِكُونَ قِرَاءَتَكَ» {وَلَا تُخَافِتْ بِهَا}«عَنْ أَصْحَابِكَ أَسْمِعْهُمُ الْقُرْآنَ وَلَا تَجْهَرْ ذَلِكَ الْجَهْرَ» {وَابْتَغِ بَيْنَ ذَلِكَ سَبِيلًا}، «يَقُولُ بَيْنَ الْجَهْرِ وَالْمُخَافَتَةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8566,
                "hadithNumber": "1002",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "So far as these words of (Allah) Glorious and High are concerned: And utter not thy prayer loudly, not be low in it relate to supplication (du'a').",
                "hadithUrdu": "اللہ تعالیٰ کے اسی فرمان : ’’ نہ اپنی نماز میں ( قراءت ) بلند کریں اور نہ آہستہ ‘ ‘ کے بارے میں روایت کی کہ انہوں نے ( عائشہ رضی اللہ عنہا ) نے کہا کہ یہ آیت دعا کے بارے میں اتری ہے ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا, یحییٰ بن زکریا نے ہشام بن عروہ سے ، انہوں نے اپنے والد سے اور انہوں نے حضرت عائشہ رضی اللہ عنہا سے",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا يَحْيَى بْنُ زَكَرِيَّا، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، فِي قَوْلِهِ عَزَّ وَجَلَّ: {وَلَا تَجْهَرْ بِصَلَاتِكَ وَلَا تُخَافِتْ بِهَا} قَالَتْ: أُنْزِلَ هَذَا فِي الدُّعَاءِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8567,
                "hadithNumber": "1003",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been narrated by Hisham with the same chain of transmitters.",
                "hadithUrdu": "ہم سے قتیبہ بن سعید نے بیان کیا,حماد بن زید ، ابو اسامہ ، وکیع اور ابو معاویہ نے اپنی اپنی سند کے ساتھ ہشام سے اسی سابقہ سند کے ساتھ یہی حدیث روایت کی ہے ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ، ح قَالَ: وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، وَوَكِيعٌ، ح قَالَ حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، كُلُّهُمْ عَنْ هِشَامٍ، بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8568,
                "hadithNumber": "1004",
                "englishNarrator": "Ibn 'Abbas رضی اللہ عنہما reported with regard to the words of Allah, Great and Glorious:",
                "hadithEnglish": "Move not thy tongue therewith that when Gabriel brought revelation to him (the Holy Prophet) he moved his tongue and lips (with a view to committing it to memory instantly). This was something hard for him and it was visible (from his face). Then Allah, the Exalted. revealed this a Move not thy tongue therewith to make haste (in memorising it). Surely on us rests the collecting of it and the reciting of it (ixxv. 16), i. e. Verily it rests with Us that We would preserve it in your heart and (enable you) to recite it You would recite it when We would recite it and so follow its recitation, and He (Allah) said: We revealed it, so listen to it attentively. Verily its exposition rests with Us. i. e. We would make it deliver by your tongue. So when Gabriel came to him (to the Holy Prophet), he kept silence, and when he went away he recited as Allah had promised him.",
                "hadithUrdu": "﴿ولا تحرك به لسانك لتعجل به﴾ ’’آپ اس کے ساتھ اپنی زبان کو حرکت نہ دیں تاکہ اسے جلدی حاصل کر لیں ۔ ‘ ‘ کے بارے میں روایت بیان کی کہا : جب جبرائیل ‌رضی ‌اللہ ‌عنہ ‌ ‌ نبیﷺ کے پاس وحی لے کر آتے تو آپ ( اس کو پڑھنے کے لیے ساتھ ساتھ ) اپنی زبان اور اپنے ہونٹوں کو حرکت دیتے تھے ، ایسا کرنا آپ پر گراں گزرتا تھا اور یہ آپ ( کے چہرے ) سے معلوم ہو جاتا ۔ اس پر اللہ تعالیٰ نے یہ آیات اتاریں : ’’ آپ اس ( وحی کے پڑھنے ) کے لیے اپنی زبان کو نہ ہلائیں کہ آپ اسے جلد سیکھ لیں ۔ بے شک اس کو ( آپ کے دل میں ) سمیٹ رکھنا اور ( آپ کی زبان سے ) اس کی قراءت ہمارا ذمہ ہے ۔ ‘ ‘ یعنی ہمارا ذمہ ہے کہ ہم اسے آپ کو سینۂ مبارک میں جمع کریں اور اس کی قراءت ( بھی ہمارے ذمے ہے ) تاکہ آپ قراءت کریں ۔ ’’پھر جب ہم اسے پڑھیں ( فرشتہ ہماری طرف سے تلاوت کرے ) تو آپ اس کے پڑھنے کی اتباع کریں ۔ ‘ ‘ فرمایا : یعنی ہم اس کو نازل کریں تو آپ اس کو غور سے سنیں ۔ ’’ اس کا واضح کر دینا بھی یقیناً ہمارے ذمے ہے ‘ ‘ کہ آ پ کی زبان س ( لوگوں کے سامنے ) بیان کر دیں ، پھر جب جبرائیل ‌رضی ‌اللہ ‌عنہ ‌ ‌ آپ کے پاس ( وحی لے کر ) آتے تو آپ سر جھکا کر غور سے سنتے اور جب وہ چلے جاتے تو اللہ کے وعدے کے مطابق آپ اس کی قراءت فرماتے ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید، ابوبکر بن ابی شیبہ اور اسحاق بن ابراہیم نے جریر رضی اللہ عنہ سے کہا, جریر بن عبد الحمید نے موسیٰ بن ابی عائشہ سے ، انہوں نے سعید بن جبیر سے اور انہوں نے حضرت ابن عباس رضی اللہ عنہما سے اللہ تعالیٰ کے فرمان",
                "hadithArabic": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، كُلُّهُمْ عَنْ جَرِيرٍ، قَالَ أَبُو بَكْرٍ: حَدَّثَنَا جَرِيرُ بْنُ عَبْدِ الْحَمِيدِ، عَنْ مُوسَى بْنِ أَبِي عَائِشَةَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، فِي قَوْلِهِ عَزَّ وَجَلَّ: {لَا تُحَرِّكْ بِهِ لِسَانَكَ} [القيامة: 16] قَالَ: «كَانَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِذَا نَزَلَ عَلَيْهِ جِبْرِيلُ بِالْوَحْيِ كَانَ مِمَّا يُحَرِّكُ بِهِ لِسَانَهُ وَشَفَتَيْهِ فَيَشْتَدُّ عَلَيْهِ، فَكَانَ ذَلِكَ يُعْرَفُ مِنْهُ»، فَأَنْزَلَ اللهُ تَعَالَى: {لَا تُحَرِّكْ بِهِ لِسَانَكَ لِتَعْجَلَ بِهِ} [القيامة: 16] أَخْذَهُ {إِنَّ عَلَيْنَا جَمْعَهُ} [القيامة: 17] وَقُرْآنَهُ إِنَّ عَلَيْنَا أَنْ نَجْمَعَهُ فِي صَدْرِكَ وَقُرْآنَهُ فَتَقْرَؤُهُ {فَإِذَا قَرَأْنَاهُ فَاتَّبِعْ قُرْآنَهُ} [القيامة: 18] قَالَ: أَنْزَلْنَاهُ فَاسْتَمِعْ لَهُ {إِنَّ عَلَيْنَا بَيَانَهُ} [القيامة: 19] أَنْ نُبَيِّنَهُ بِلِسَانِكَ فَكَانَ إِذَا أَتَاهُ جِبْرِيلُ أَطْرَقَ فَإِذَا ذَهَبَ قَرَأَهُ كَمَا وَعَدَهُ اللهُ.",
                "headingArabic": "الاِسْتِمَاعِ لِلْقِرَاءَةِ ‏",
                "headingUrdu": "تلاوت سننا",
                "headingEnglish": "Listening to the Recitation",
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8569,
                "hadithNumber": "1005",
                "englishNarrator": "Ibn Abbas ‌رضی ‌اللہ ‌عنہ reported with regard to the words:",
                "hadithEnglish": "Do not move thy tongue there with to make haste, that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) felt it hard and he moved his lips. Ibn 'Abbas ‌رضی ‌اللہ ‌عنہ ‌said to me (Sa'id bin Jubair): I move them just as the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) moved them. Then said Sa'id: I move them just as Ibn 'Abbas moved them, and he moved his lips. Allah, the Exalted, revealed this: Do not move your tongue therewith to make haste. It is with US that its collection rests and its recital (al-Qur'an, ixxv. 16). He said: Its preservation in your heart and then your recital. So when We recite it, follow its recital. He said: Listen to it, and be silent and then it rests with Us that you recite it. So when Gabriel came to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), he listened to him attentively, and when Gabriel went away, the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) recited as he (Gabriel) had recited it.",
                "hadithUrdu": "’’آپ اس ( وحی کو پڑھنے ) کے لیے اپنی زبان کو نہ ہلائیں کہ آپ اسے جلد سیکھ لیں ‘ ‘ کے بارے میں روایت کی کہ نبی اکرمﷺ وحی کے نزول کی وجہ سے بہت مشقت برداشت کرتے ، آپ ( ساتھ ساتھ ) اپنے ہونٹ ہلاتے تھے ( ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے مجھے کہا : میں تمہیں رسول اللہﷺ کی طرح ہونٹ ہلا کر دکھاتا ہوں ، تو انہوں نے اپنے ہونٹوں کو حرکت دی اور سعید بن جبیر نے ( اپنے شاگرد سے ) کہا : میں اپنے ہونٹوں کو اسی طرح ہلاتا ہوں جس طرح ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ انہیں ہلاتے تھے ، پھر اپنے ہونٹ ہلائے ) اس پر اللہ تعالیٰ یہ آیت اتاری : ’’ آپ اس ( وحی کو پڑھنے ) کے لیے اپنی زبان کو نہ ہلائیں کہ آپ اسے جلد سیکھ لیں ۔ بےشک ہمارا ذمہ ہے اس کو ( آپ کے دل میں ) سمیٹ کر رکھنا اور ( آپ کی زبان سے ) اس کی قراءت ۔ ‘ ‘ کہا : آپ کے سینے میں اسے جمع کرنا ، پھر یہ کہ آپ اسے پڑھیں ۔ ’’ پھر جب ہم پڑھیں ( فرشتہ ہماری طرف سے تلاوت کرے ) تو آپ اس کے پڑھنے کی اتباع کریں ۔ ‘ ‘ ابن عباس رضی اللہ عنہما نے کہا : یعنی اس کو غور سےسنیں اور خاموش رہیں ، پھر ہمارے ذمے ہے کہ آپ اس کی قراءت کریں ۔ ابن عباس رضی اللہ عنہما نے کہا : اس کے بعد جب آپ کے پاس جبرائیل ‌رضی ‌اللہ ‌عنہ ‌ ‌ ( وحی لے کر ) آتے تو آپ غور سے سنتے اور جب جبرائیل ‌رضی ‌اللہ ‌عنہ ‌ ‌ چلے جاتے تواسے آپ اسی طرح پڑھتے جس طرح انہوں نے آپ کو پڑھایا ہوتا ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا,( جریر بن عبد الحمید کے بجائے ) ابو عوانہ نے موسیٰ بن ابی عائشہ سے ، انہوں نے سعید بن جبیر سے اور انہوں حضرت ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اللہ کے فرمان",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ مُوسَى بْنِ أَبِي عَائِشَةَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، فِي قَوْلهِ: {لَا تُحَرِّكْ بِهِ لِسَانَكَ لِتَعْجَلَ بِهِ} [القيامة: 16]، قَالَ: «كَانَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُعَالِجُ مِنَ التَّنْزِيلِ شِدَّةً كَانَ يُحَرِّكُ شَفَتَيْهِ»، فَقَالَ لِي ابْنُ عَبَّاسٍ: «أَنَا أُحَرِّكُهُمَا كَمَا كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُحَرِّكُهُمَا» فَقَالَ سَعِيدٌ: «أَنَا أُحَرِّكُهُمَا كَمَا كَانَ ابْنُ عَبَّاسٍ يُحَرِّكُهُمَا فَحَرَّكَ شَفَتَيْهِ» فَأَنْزَلَ اللهُ تَعَالَى: {لَا تُحَرِّكْ بِهِ لِسَانَكَ لِتَعْجَلَ بِهِ إِنَّ عَلَيْنَا جَمْعَهُ} [القيامة: 17] وَقُرْآنَهُ قَالَ: جَمْعَهُ فِي صَدْرِكَ ثُمَّ تَقْرَؤُهُ {فَإِذَا قَرَأْنَاهُ فَاتَّبِعْ قُرْآنَهُ} [القيامة: 18] قَالَ: فَاسْتَمِعْ وَأَنْصِتْ ثُمَّ إِنَّ عَلَيْنَا أَنْ تَقْرَأَهُ قَالَ: «فَكَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِذَا أَتَاهُ جِبْرِيلُ اسْتَمَعَ فَإِذَا انْطَلَقَ جِبْرِيلُ قَرَأَهُ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَمَا أَقْرَأَهُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8570,
                "hadithNumber": "1006",
                "englishNarrator": "Ibn 'Abbas رضی اللہ عنہما reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) neither recited the Qur'an to the Jinn nor did he see them. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) went out with some of his Companions with the intention of going to the bazaar of 'Ukaz And there had been (at that time) obstructions between satans and the news from the Heaven, and there were flung flames upon them. So satan went back to their people and they said: What has happened to you? They said: There have been created obstructions between us and the news from the Heaven. And there have been flung upon us flames. They said: It cannot happen but for some (important) event. So traverse the eastern parts of the earth and the western parts and find out why is it that there have been created obstructions between us and the news from the Heaven. So they went forth and traversed the easts of the earth and its wests. Some of them proceeded towards Tihama and that is a nakhl towards the bazaar of 'Ukaz and he (the Holy Prophet) was leading his Companions in the morning prayer. So when they heard the Qur'an. they listened to it attentively and said: It is this which has caused obstruction between us and news from the Heaven. They went back to their people and said: O our people, we have heard a strange Qur'an which directs us to the right path; so we affirm our faith in it and we would never associate anyone with our Lord. And Allah, the Exalted and Glorious, revealed to His Apostle Muhammad ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌): It has been revealed to me that a party of Jinn listened to it (Qur'an, lxxii. 1).",
                "hadithUrdu": "رسول اللہ ﷺ نے جنوں کو قرآن سنایا نہ ان کو دیکھا ۔ ( اصل واقعہ یہ ہے کہ ) رسول اللہﷺ اپنے چند ساتھیوں کو ساتھ عکاظ کے بازار کی طرف جانے کے ارادے سے چلے ( ان دنوں ) آسمانی خبر اور شیطانوں کے درمیان رکاوٹ پیدا کر دی گئی تھی ( شیطان آسمانی خبریں نہ سن سکتے تھے ) اور ان پر انگارے پھینکے جانے لگے تھے تو شیاطین ( خبریں حاصل کیے بغیر ) اپنی قوم کے پاس واپس آئے ۔ اس پر انہوں نے پوچھا : تمہارے ساتھ کیا ہوا؟ انہوں ( واپس آنے والوں ) نے کہا : ہمیں آسمان کی خبریں لینے سے روک دیا گیا اور ہم پر انگارے پھینکے گئے ۔ انہوں نے کہا : اس کے سوا یہ کسی اور سبب سے نہیں ہوا کہ کوئی نئی بات ظہور پذیر ہوئی ہے ، اس لیے تم زمین کے مشر ق ومغرب میں پھیل جاؤ اور دیکھو کہ ہمارے آسمانی خبر کے درمیان حائل ہونے والی چیز ( کی حقیقت ) کیا ہے؟ وہ نکل کر زمین کے مشرق اور مغرب میں پہنچے ۔ وہ نفری جس نے تہامہ کا رخ کیا تھا ، گزری ، تو آپ عکاظ کی طرف جاتے ہوئے کجھوروں ( والے مقام نخلہ ) میں تھے ، اپنے ساتھیوں کو صبح کی نماز پڑھا رہے تھے ، جب جنوں نے قرآن سنا تو اس پر کان لگا دیے اور کہنے لگے : یہ ہے جو ہمارے اور آسمانوں کی خبر کے درمیان حائل ہو گیا ہے ۔ اس کے بعد وہ اپنی قوم کی طرف لوٹے اور کہا : اے ہماری قوم! ہم نے عجیب قرآن سنا ہے جو حق کی طرف رہنمائی کرتا ہے ، اس لیے ہم اس پر ایمان لے آئے ہیں اور ہم اپنے رب کے ساتھ ہرگز کسی کو شریک نہیں ٹھہرائیں گے ۔ اس پر اللہ تعالیٰ نے اپنے نبی محمدﷺ پر یہ آیت نازل فرمائی : ’’ کہہ دیجیئے : میری طرف یہ وحی کی گئی ہے کہ جنوں کی ایک جماعت نے کان لگا کر سنا ۔ ‘ ‘",
                "urduNarrator": "ہم سے شیبان بن فرخ نے بیان کیا، کہا ہم سے ابو عونہ نے بیان کیا، انہوں نے ابو بشر کی سند سے,سعید نے جبیر نے حضرت ابن عباس رضی اللہ عنہما سے روایت کی ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ قَالَ: مَا قَرَأَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى الْجِنِّ وَمَا رَآهُمُ انْطَلَقَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي طَائِفَةٍ مِنْ أَصْحَابِهِ عَامِدِينَ إِلَى سُوقِ عُكَاظٍ وَقَدْ حِيلَ بَيْنَ الشَّيَاطِينِ وَبَيْنَ خَبَرِ السَّمَاءِ. وَأُرْسِلَتْ عَلَيْهِمُ الشُّهُبُ. فَرَجَعَتِ الشَّيَاطِينُ إِلَى قَوْمِهِمْ فَقَالُوا: مَا لَكُمْ. قَالُوا: حِيلَ بَيْنَنَا وَبَيْنَ خَبَرِ السَّمَاءِ وَأُرْسِلَتْ عَلَيْنَا الشُّهُبُ. قَالُوا: مَا ذَاكَ إِلَّا مِنْ شَيْءٍ حَدَثَ. فَاضْرِبُوا مَشَارِقَ الْأَرْضِ وَمَغَارِبَهَا. فَانْظُرُوا مَا هَذَا الَّذِي حَالَ بَيْنَنَا وَبَيْنَ خَبَرِ السَّمَاءِ فَانْطَلَقُوا يَضْرِبُونَ مَشَارِقَ الْأَرْضِ وَمَغَارِبَهَا. فَمَرَّ النَّفَرُ الَّذِينَ أَخَذُوا نَحْوَ تِهَامَةَ - وَهُوَ بِنَخْلٍ عَامِدِينَ إِلَى سُوقِ عُكَاظٍ وَهُوَ يُصَلِّي بِأَصْحَابِهِ صَلَاةَ الْفَجْرِ - فَلَمَّا سَمِعُوا الْقُرْآنَ اسْتَمَعُوا لَهُ. وَقَالُوا: هَذَا الَّذِي حَالَ بَيْنَنَا وَبَيْنَ خَبَرِ السَّمَاءِ فَرَجَعُوا إِلَى قَوْمِهِمْ. فَقَالُوا: يَا قَوْمَنَا إِنَّا سَمِعْنَا قُرْآنًا عَجَبًا يَهْدِي إِلَى الرُّشْدِ فَآمَنَّا بِهِ وَلَنْ نُشْرِكَ بِرَبِّنَا أَحَدًا. فَأَنْزَلَ اللهُ عَزَّ وَجَلَّ عَلَى نَبِيِّهِ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «قُلْ أُوحِيَ إِلَيَّ أَنَّهُ اسْتَمَعَ نَفَرٌ مِنَ الْجِنِّ».",
                "headingArabic": "الْجَهْرِ بِالْقِرَاءَةِ فِي الصُّبْحِ وَالْقِرَاءَةِ عَلَى الْجِنِّ ‏",
                "headingUrdu": "سبھ میں بلند آواز سے تلاوت کرنا اور جنوں کو پڑھنا",
                "headingEnglish": "Reciting Out Aloud In As-Subh And Reciting To The Jinn",
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8571,
                "hadithNumber": "1007",
                "englishNarrator": "Dawud reported from 'Amir who said:",
                "hadithEnglish": "I asked 'Alqama if Ibn Mas'ud رضی ‌اللہ ‌عنہ ‌was present with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) on the night of the Jinn (the night when the Prophet met them). He (Ibn Mas'uad رضی ‌اللہ ‌عنہ ‌) said: No, but we were in the company of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) one night and we missed him. We searched for him in the valleys and the hills and said. He has either been taken away (by jinn) or has been secretly killed. He (the narrator) said. We spent the worst night which people could ever spend. When it was dawn we saw him coming from the side of Hiri'. He (the narrator) reported. We said: Messenger of Allah, we missed you and searched for you, but we could not find you and we spent the worst night which people could ever spend. He (the Holy Prophet) said: There came to me an inviter on behalf of the Jinn and I went along with him and recited to them the Qur'an. He (the narrator) said: He then went along with us and showed us their traces and traces of their embers. They (the Jinn) asked him (the Holy Prophet) about their provision and he said: Every bone on which the name of Allah is recited is your provision. The time it will fall in your hand it would be covered with flesh, and the dung of (the camels) is fodder for your animals. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Don't perform istinja with these (things) for these are the food of your brothers (Jinn).",
                "hadithUrdu": "میں نے علقمہ سے پوچھا : کیا جنوں ( سے ملاقات ) کی رات عبد اللہ بن مسعود ‌رضی ‌اللہ ‌عنہ ‌ ‌ رسول اللہ کے ساتھ تھے؟ کہا : علقمہ نے جواب دیا : میں نے خود ابن مسعود ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے پوچھا : کیا آپ لوگوں میں سے کوئی لیلۃ الجن میں رسول اللہﷺ کے ساتھ موجود تھا؟ انہوں نے کہا : نہیں ، لیکن ایک رات ہم رسول اللہﷺ کے ساتھ تھے تو ہم نے آپ کو گم پایا ، ہم نے آپ کو وادیوں اور گھاٹیوں میں تلاش کیا ، ( آپ نہ ملے ) تو ہم نے کہا کہ آپ کو اڑا لیا گیا ہے یا آپ کو بے خبری میں قتل کر دیا گیا ہے ، کہا : ہم نے بدترین رات گزاری جو کسی قوم نے ( کبھی ) گزاری ہو گی ۔ جب ہم نے صبح کی تو اچانک دیکھا کہ آپ حراء کی طرف سے تشریف لا رہے ہیں ، انہوں نے کہا کہ ہم نے عرض کی : اے اللہ کے رسول! ہم نے آپ کوگم پایا تو آپ کی تلاش شروع کر دی لیکن آپ نہ ملے ، اس لیے ہم نے وہ بدترین رات گزاری جو کوئی قوم ( کبھی ) گزار سکتی ہے ۔ اس پر آپ نے فرمایا : ’’ میرے پاس جنوں کی طرف سے دعوت دینے والا آیا تو میں اس کے ساتھ گیا اور میں نے ان کے سامنت قرآن کی قراءت کی ۔ ‘ ‘ انہوں نے کہا : پھر آپ ( ﷺ ) ہمیں لے کر گئے اور ہمیں ان کے نقوش قدم اور ان کی آگ کے نشانات دکھائے ۔ جنوں نے آپ سے زاد ( خوراک ) کا سوال کیا تو آپ نے فرمایا : ’’تمہارے لیے ہر وہ ہڈی ہے جس ( کے جانور ) پر اللہ کا نام لیا گیا ہو اور تمہارے ہاتھ لگ جائے ، ( اس پر لگا ہوا ) گوشت جتنا زیادہ سے زیادہ ہو اور ( ہر نرم قدموں والے اونٹ اور کٹے سموں والے ) جانور کی لید تمہارے جانوروں کا چارہ ہے ۔ ‘ ‘ پھر رسول اللہﷺ نے ( انسانوں سے ) فرمایا : ’’ تم ان دونوں چیزوں سے استنجا نہ کیا کرو کیونکہ یہ دونوں ( دین میں ) تمہارے بھائیوں ( جنوں اور ان کے جانوروں ) کا کھانا ہیں ۔ ‘ ‘",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا، انہوں نے کہا عبد الاعلیٰ نے داؤد سے اور انہوں نے عامر ( بن شراحیل ) سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْأَعْلَى عَنْ دَاوُدَ، عَنْ عَامِرٍ، قَالَ: سَأَلْتُ عَلْقَمَةَ هَلْ كَانَ ابْنُ مَسْعُودٍ شَهِدَ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لَيْلَةَ الْجِنِّ؟ قَالَ: فَقَالَ عَلْقَمَةُ، أَنَا سَأَلْتُ ابْنَ مَسْعُودٍ فَقُلْتُ: هَلْ شَهِدَ أَحَدٌ مِنْكُمْ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لَيْلَةَ الْجِنِّ؟ قَالَ: لَا وَلَكِنَّا كُنَّا مَعَ رَسُولِ اللهِ ذَاتَ لَيْلَةٍ فَفَقَدْنَاهُ فَالْتَمَسْنَاهُ فِي الْأَوْدِيَةِ وَالشِّعَابِ. فَقُلْنَا: اسْتُطِيرَ أَوِ اغْتِيلَ. قَالَ: فَبِتْنَا بِشَرِّ لَيْلَةٍ بَاتَ بِهَا قَوْمٌ فَلَمَّا أَصْبَحْنَا إِذَا هُوَ جَاءٍ مِنْ قِبَلَ حِرَاءٍ. قَالَ: فَقُلْنَا يَا رَسُولَ اللهِ فَقَدْنَاكَ فَطَلَبْنَاكَ فَلَمْ نَجِدْكَ فَبِتْنَا بِشَرِّ لَيْلَةٍ بَاتَ بِهَا قَوْمٌ. فَقَالَ: «أَتَانِي دَاعِي الْجِنِّ فَذَهَبْتُ مَعَهُ فَقَرَأْتُ عَلَيْهِمُ الْقُرْآنَ» قَالَ: فَانْطَلَقَ بِنَا فَأَرَانَا آثَارَهُمْ وَآثَارَ نِيرَانِهِمْ وَسَأَلُوهُ الزَّادَ فَقَالَ: لَكُمْ كُلُّ عَظْمٍ ذُكِرَ اسْمُ اللهِ عَلَيْهِ يَقَعُ فِي أَيْدِيكُمْ أَوْفَرَ مَا يَكُونُ لَحْمًا وَكُلُّ بَعْرَةٍ عَلَفٌ لِدَوَابِّكُمْ. فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «فَلَا تَسْتَنْجُوا بِهِمَا فَإِنَّهُمَا طَعَامُ إِخْوَانِكُمْ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8572,
                "hadithNumber": "1008",
                "englishNarrator": "This hadith has been reported by Dawud with the same chain of transmitters up to the word (s): The traces of their embers. Sha'bi said:",
                "hadithEnglish": "They (the Jinn) asked about their provision, and they were the Jinn of al-jazira, up to the end of the hadith, and the words of Sha'bi have been directly transmitted from the hadith of Abdullah رضی ‌اللہ ‌عنہ ‌.",
                "hadithUrdu": "جنوں نے آپ سے خوراک کا سوار کیا اور وہ جزیرہ کے جنوں میں سے تھے ... حدیث کے آخری حصے تک جو شعبی کا قول ہے ، عبد اللہ بن مسعود ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی حدیث سے الگ ہے ۔",
                "urduNarrator": "علی بن حجر السعدی نے مجھ سے کہا,اسماعیل بن ابراہیم نے داؤد سے اسی سند کے ساتھ وآثار نيرانهم ( ان کی آگ کے نشانات ) تک بیان کیا ۔ شعبی نے کہا",
                "hadithArabic": "وَحَدَّثَنِيهِ عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ عَنْ دَاوُدَ بِهَذَا الْإِسْنَادِ إِلَى قَوْلِهِ: وَآثَارَ نِيرَانِهِمْ. قَالَ الشَّعْبِيُّ: وَسَأَلُوهُ الزَّادَ وَكَانُوا مِنْ جِنِّ الْجَزِيرَةِ إِلَى آخِرِ الْحَدِيثِ مِنْ قَوْلِ الشَّعْبِيِّ. مُفَصَّلًا مِنْ حَدِيثِ عَبْدِ اللهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8573,
                "hadithNumber": "1009",
                "englishNarrator": "This hadith has been narrated on the authority of 'Abdullah from the Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) up to the words:",
                "hadithEnglish": "It was narrated from 'Abdullah from the prophet ﷺ, up to the words: and the traces of their fires; he did not mention what come after that (from no. 1008).",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا,عبد اللہ بن ادریس نے داؤد سے باقی ماندہ سابقہ سند کے ساتھ نبی ﷺسے وآثار نيرانهم تک روایت کیا اور بعد والا حصہ بیان نہیں کیا ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللهِ بْنُ إِدْرِيسَ، عَنْ دَاوُدَ، عَنِ الشَّعْبِيِّ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللهِ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِلَى قَوْلِهِ: «وَآثَارَ نِيرَانِهِمْ» وَلَمْ يَذْكُرْ مَا بَعْدَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8574,
                "hadithNumber": "1010",
                "englishNarrator": "Abdullah (bin Mas'ud) said:",
                "hadithEnglish": "I was not with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) but I wish I were with him.",
                "hadithUrdu": "میں لیلۃ الجن کو رسول اللہﷺ کے ساتھ نہ تھا اور میری خواہش تھی کہ میں آپ کے ساتھ ہوتا",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا ہم سے خالد بن عبداللہ نے بیان کیا، وہ خالد کے واسطہ سے، وہ ابو معشر کی سند سے,(شعبی کے بجائے ) ابراہیم ( نخعی ) نے علقمہ سے اور انہوں نے عبد اللہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللهِ، عَنْ خَالِدٍ، عَنْ أَبِي مَعْشَرٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللهِ قَالَ: لَمْ أَكُنْ لَيْلَةَ الْجِنِّ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَوَدِدْتُ أَنِّي كُنْتُ مَعَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8575,
                "hadithNumber": "1011",
                "englishNarrator": "Ma'n reported.. I heard it from my father who said:",
                "hadithEnglish": "I asked Masruq who informed the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) about the night when they heard the Qur'an. He said: Your father, Ibn Mas'ud رضی ‌اللہ ‌عنہ , narrated it to me that a tree informed him about that.",
                "hadithUrdu": "میں نے مسروق سے پوچھا : جس رات جنوں نے کان لگا کر ( قرآن ) سنا ، اس کی اطلاع نبیﷺ کو کس نے دی؟ انہوں نے کہا : مجھے تمہارے والد ( ابن مسعود ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) نے بتایا کہ آپ کو ان جنوں کی اطلاع ایک درخت نے دی تھی ۔ ( یہ آپﷺ کا معجزہ تھا ۔ )",
                "urduNarrator": "ہم سے سعید بن محمد الجرمی اور عبید اللہ بن سعید نے بیان کیا، کہا کہ ہم سے ابو اسامہ نے ,مسعر کی سند سے بیان کیا,معن ( بن عبد الرحمن بن عبد اللہ بن مسعود ہذلی ) سے روایت ہے ، کہا : میں نے اپنے والد سے سنا ، کہا",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ مُحَمَّدٍ الْجَرْمِيُّ، وَعُبَيْدُ اللهِ بْنُ سَعِيدٍ، قَالَا: حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ مِسْعَرٍ، عَنْ مَعْنٍ، قَالَ: سَمِعْتُ أَبِي، قَالَ: سَأَلْتُ مَسْرُوقًا: مَنْ آذَنَ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِالْجِنِّ لَيْلَةَ اسْتَمَعُوا الْقُرْآنَ؟ فَقَالَ: حَدَّثَنِي أَبُوكَ يَعْنِي ابْنَ مَسْعُودٍ أَنَّهُ آذَنَتْهُ بِهِمْ شَجَرَةٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8576,
                "hadithNumber": "1012",
                "englishNarrator": "Abu Qatada رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) led us in prayer and recited in the first two rak'ahs of the noon and afternoon prayers Surat al-Fitiha and two (other) surahs. And he would sometimes recite loud enough for us the verses. He would prolong the first rak'ah more than the second. And he acted similarly in the morning prayer.",
                "hadithUrdu": "رسول اللہ ﷺ ہمیں نماز پڑھاتے تو ظہر اور عصر کی پہلی دو رکعتوں میں سورہ فاتحہ اور دو سورتیں ( ہر رکعت میں فاتحہ کے بعد ایک سورت ) پڑھتے اور کبھی کبھار ہمیں کوئی آیت سنا دیتے ۔ ظہر کی پہلی رکعت لمبی کرتے اور دوسری رکعت مختصر کرتے اور صبح کی نماز میں بھی ایسا ہی کرتے ۔",
                "urduNarrator": "ہم سے محمد بن المثنیٰ العنزی نے بیان کیا، ہم سے ابن ابی عدی نے بیان کیا،حجاج صواف نے یحییٰ بن ابی کثیر سے ، انہوں نے عبد اللہ بن ابی قتادہ اور ابو سلمہ سے اور انہوں نے حضرت ابو قتادہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى الْعَنَزِيُّ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنِ الْحَجَّاجِ يَعْنِي الصَّوَّافَ، عَنْ يَحْيَى وَهُوَ ابْنُ أَبِي كَثِيرٍ، عَنْ عَبْدِ اللهِ بْنِ أَبِي قَتَادَةَ، وَأَبِي سَلَمَةَ، عَنْ أَبِي قَتَادَةَ قَالَ: كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي بِنَا فَيَقْرَأُ فِي الظُّهْرِ وَالْعَصْرِ فِي الرَّكْعَتَيْنِ الْأُولَيَيْنِ بِفَاتِحَةِ الْكِتَابِ وَسُورَتَيْنِ وَيُسْمِعُنَا الْآيَةَ أَحْيَانًا وَكَانَ يُطَوِّلُ الرَّكْعَةَ الْأُولَى مِنَ الظُّهْرِ وَيُقَصِّرُ الثَّانِيَةَ وَكَذَلِكَ فِي الصُّبْحِ.",
                "headingArabic": "الْقِرَاءَةِ فِي الظُّهْرِ وَالْعَصْرِ",
                "headingUrdu": "ظہر اور عصر کی تلاوت",
                "headingEnglish": "The Recitation For Zuhr And 'Asr",
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8577,
                "hadithNumber": "1013",
                "englishNarrator": "Abu Qatada reported it on the authority of his father:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) would recite in the first two rak'ahs of the noon and afternoon prayers the opening chapter of the Book and another surah. He would sometimes recite loud enough to make audible to us the verse and would recite in the last two rak'ahs Surat al-Faitiha (only).",
                "hadithUrdu": "نبیﷺ ظہر اور عصر کی پہلی دو رکعتوں میں ( سے ہر رکعت میں ) سورۃ فاتحہ اور ایک سورت پڑھتے اور کبھی کبھار ہمیں بھی کوئی آیت سنا دیتے اور آخری دو رکعتوں میں سورۃ فاتحہ پڑھا کرتے تھے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے یزید بن ہارون نے بیان کیا,(حجاج کے بجائے ) ہمام اور ابان بن یزید نے یحییٰ بن ابی کثیر سے ، انہوں نے عبد اللہ بن ابی قتادہ سے اور انہوں نے اپنے والد سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا هَمَّامٌ، وَأَبَانُ بْنُ يَزِيدَ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عَبْدِ اللهِ بْنِ أَبِي قَتَادَةَ، عَنْ أَبِيهِ: «أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ فِي الرَّكْعَتَيْنِ الْأُولَيَيْنِ مِنَ الظُّهْرِ وَالْعَصْرِ، بِفَاتِحَةِ الْكِتَابِ وَسُورَةٍ وَيُسْمِعُنَا الْآيَةَ أَحْيَانًا، وَيَقْرَأُ فِي الرَّكْعَتَيْنِ الْأُخْرَيَيْنِ بِفَاتِحَةِ الْكِتَابِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8578,
                "hadithNumber": "1014",
                "englishNarrator": "Abu Sa'id al-Khudri رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "We used to estimate how long Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) stood in the noon and afternoon prayers, and we estimated hat he stood in the first two rak'ahs of the noon prayer as long as it takes to recite Alif Lam Mim, Tanzil, i. e. as-Sajda. We estimated that he stood half that time in the last two rak'ahs; that he stood in the first two of the afternoon as long as he did in the last two at noon; and in the last two of the afternoon prayer about half that time. Abu Bakr in his narration has made no mention of Alif Lam Mim, Tanzil, but said: As long as it takes to recite thirty verses.",
                "hadithUrdu": "ہم ظہر اور عصر میں رسول اللہﷺ کے قیام کا اندازہ لگاتے تھے تو ہم نے ظہر کی پہلی دو رکعتوں میں قیام کا اندازہ ﴿الم 0 تنزيل﴾ ( السجدہ ) کی قراءت کے بقدر لگایا اور اس کی آخری دو رکعتوں کے قیام کا اندازہ اس سے نصف کے بقدر لگایا اور ہم نے عصر کی پہلی دو رکعتوں کے قیام کا اندازہ لگایا کہ وہ ظہر کی آخری دو رکعتوں کے برابر تھا اور عصر کی دو رکعتوں کا قیام اس سے آدھا تھا ۔ امام مسلم ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے استادہ ابو بکر بن ابی شیبہ نے اپنی روایت میں ﴿الم 0 تنزيل﴾ ( کا نام ) ذکر نہیں کیا ، انہوں نے کہا : تیس آیات کےبقدر.",
                "urduNarrator": "یحییٰ بن یحییٰ اور ابو بکر بن ابی شیبہ نے ہشیم سے ، انہوں نے منصور سے ، انہوں نے ولید بن مسلم سے ، انہوں نے ابو صدیق ( ناجی ) سے اور انہوں نے حضرت ابو سعید خدری ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے ر وایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، جَمِيعًا عَنْ هُشَيْمٍ، قَالَ: يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، عَنْ مَنْصُورٍ، عَنِ الْوَلِيدِ بْنِ مُسْلِمٍ، عَنْ أَبِي الصِّدِّيقِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: «كُنَّا نَحْزِرُ قِيَامَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي الظُّهْرِ وَالْعَصْرِ فَحَزَرْنَا قِيَامَهُ فِي الرَّكْعَتَيْنِ الْأُولَيَيْنِ مِنَ الظُّهْرِ قَدْرَ قِرَاءَةِ الم تَنْزِيلُ السَّجْدَةِ وَحَزَرْنَا قِيَامَهُ فِي الْأُخْرَيَيْنِ قَدْرَ النِّصْفِ مِنْ ذَلِكَ، وَحَزَرْنَا قِيَامَهُ فِي الرَّكْعَتَيْنِ الْأُولَيَيْنِ مِنَ الْعَصْرِ عَلَى قَدْرِ قِيَامِهِ فِي الْأُخْرَيَيْنِ مِنَ الظُّهْرِ وَفِي الْأُخْرَيَيْنِ مِنَ الْعَصْرِ عَلَى النِّصْفِ مِنْ ذَلِكَ» وَلَمْ يَذْكُرْ أَبُو بَكْرٍ فِي رِوَايَتِهِ: الم تَنْزِيلُ وَقَالَ: قَدْرَ ثَلَاثِينَ آيَةً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8579,
                "hadithNumber": "1015",
                "englishNarrator": "Abu Sa'id al-Khudri reported:",
                "hadithEnglish": "The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to recite in every rak'ah of the first two rak'ahs of the noon prayer about thirty verses and in the last two about fifteen verses or half (of the first rak'ah) and in every rak'ah of the 'Asr prayer of the first two rak'ahs about fifteen verses and in the last two verses half (of the first ones).",
                "hadithUrdu": "نبی اکرمﷺ ظہر کی نماز میں پہلی دو رکعتوں میں سے ہر رکعت میں تیس آیات کے بقدر قراءت فرماتے تھے اور آخری دو میں پندرہ آیتوں کے بقدر یا یہ کہا : اس ( پہلی دو ) سے نصف ۔ اور عصر کی پہلی دو رکعتوں میں سے ہر رکعت میں پندرہ آیتوں کے برابر اور آخری دو میں اس سے نصف ۔",
                "urduNarrator": "ہم سے شیبان بن فرخ نے بیان کیا,ابو عوانہ نے منصور سے باقی ماندہ سابقہ سند سے حضرت ابو سعید خدری ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ مَنْصُورٍ، عَنِ الْوَلِيدِ أَبِي بِشْرٍ، عَنْ أَبِي الصِّدِّيقِ النَّاجِيِّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ فِي صَلَاةِ الظُّهْرِ فِي الرَّكْعَتَيْنِ الْأُولَيَيْنِ فِي كُلِّ رَكْعَةٍ قَدْرَ ثَلَاثِينَ آيَةً، وَفِي الْأُخْرَيَيْنِ قَدْرَ خَمْسَ عَشْرَةَ آيَةً أَوْ قَالَ نِصْفَ ذَلِكَ - وَفِي الْعَصْرِ فِي الرَّكْعَتَيْنِ الْأُولَيَيْنِ فِي كُلِّ رَكْعَةٍ قَدْرَ قِرَاءَةِ خَمْسَ عَشْرَةَ آيَةً وَفِي الْأُخْرَيَيْنِ قَدْرَ نِصْفِ ذَلِكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8580,
                "hadithNumber": "1016",
                "englishNarrator": "Jabir bin Samura رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "The people of Kufa complained to Umar bin Khattab رضی ‌اللہ ‌عنہ about Sa'id and they made a mention of his prayer. 'Umar رضی ‌اللہ ‌عنہ sent for him. He came to him. He ('Umar رضی ‌اللہ ‌عنہ) totd him that the people had found fault with his prayer. He said: I lead them in prayer in accorance with the prayer of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). I make no decrease in it. I make them stand for a longer time in the first two (rak'ahs) and shorten it in the last two. Upon this 'Umar رضی ‌اللہ ‌عنہ remarked: This is what I deemed of thee, O Abu Ishaq.",
                "hadithUrdu": "کوفہ والوں نے حضرت عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے حضرت حضرت سعد ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی شکایت کی اور ( اس میں ) ان کی نماز کا بھی ذکر کیا ۔ حضرت عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ان کی طرف پیغام بھیجا ، وہ آئے تو حضرت عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ان سے ، کوفہ والوں نے ان کی نماز پر جو اعتراض کیا تھا ، اس کا تذکرہ کیا ، تو انہوں نے کہا : یقیناً میں انہیں رسول اللہﷺ کی نماز کی طرف نماز پڑھاتا ہوں ، اس میں کمی نہیں کرتا ۔ میں انہیں پہلی دو رکعتوں لمبی پڑھاتا ہوں اور آخری میں دو تخفیف کرتا ہوں ۔ اس پر عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے فرمایا : اے ابو اسحاق! آپ کے بارے میں گمان ( بھی ) یہی ہے ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا,ہشیم نے عبد الملک بن عمیر سے اور انہوں نے حضرت جابر بن سمرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، أَنَّ أَهْلَ الْكُوفَةِ شَكَوْا سَعْدًا إِلَى عُمَرَ بْنِ الْخَطَّابِ فَذَكَرُوا مِنْ صَلَاتِهِ. فَأَرْسَلَ إِلَيْهِ عُمَرُ فَقَدِمَ عَلَيْهِ فَذَكَرَ لَهُ مَا عَابُوهُ بِهِ مِنْ أَمْرِ الصَّلَاةِ. فَقَالَ: «إِنِّي لَأُصَلِّي بِهِمْ صَلَاةَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مَا أَخْرِمُ عَنْهَا إِنِّي لَأَرْكُدُ بِهِمْ فِي الْأُولَيَيْنِ وَأَحْذِفُ فِي الْأُخْرَيَيْنِ» فَقَالَ: ذَاكَ الظَّنُّ بِكَ أَبَا إِسْحَاقَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8581,
                "hadithNumber": "1017",
                "englishNarrator": null,
                "hadithEnglish": "This hadith his been narrated by 'Abdul-Malik with the same chain of transmitters.",
                "hadithUrdu": "ہم سے قتیبہ بن سعید اور اسحاق بن ابراہیم نے بیان کیا(ہشیم کے بجائے ) جریر نے عبد الملک بن عمیر سے اسی سند کے ساتھ یہی روایت بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، عَنْ جَرِيرٍ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، بِهَذَا الْإِسْنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8582,
                "hadithNumber": "1018",
                "englishNarrator": "Jabir bin Samura رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "'Umar said to Sa'd رضی ‌اللہ ‌عنہ ‌: They complain against you in every matter, even in prayer. He (Sa'd) said: I prolong (standing) in the first two (rak'ahs) and shorten it in the last two, and I make no negligence in following the prayer of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). He ('Umar) remarked: This is what is expected of you, or, that is what I deemed of you.",
                "hadithUrdu": "حضرت عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے حضرت سعد ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے کہا : لوگوں نے آپ کی ہر چیز حتیٰ کہ نماز کی بھی شکایت کی ہے ۔ حضرت سعد ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : میں ( یہ کہتا ہوں کہ میں ) پہلی دو رکعتوں میں ( قیام کو ) طول دیتا ہوں اور آخری دو رکعتوں میں تخفیف کرتا ہوں ، میں نے جس طرح رسول اللہﷺ کی اقتدا میں نماز پڑھی تھی ، اس میں کوئی کوتاہی نہیں کرتا ۔ تو عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : آپ کے بارے میں یہی گمان ہے یا آپ کے بارے میں میرا گمان یہی ہے ۔",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا، کہا ہم سے عبدالرحمٰن بن مہدی نے بیان کیا,شعبہ نے ابوعون سے روایت کی ، انہوں نے کہا کہ میں نے حضرت جابر بن سمرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنا کہ",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي عَوْنٍ، قَالَ: سَمِعْتُ جَابِرَ بْنَ سَمُرَةَ، قَالَ: قَالَ عُمَرُ لِسَعْدٍ قَدْ شَكَوْكَ فِي كُلِّ شَيْءٍ حَتَّى فِي الصَّلَاةِ. قَالَ: «أَمَّا أَنَا فَأَمُدُّ فِي الْأُولَيَيْنِ وَأَحْذِفُ فِي الْأُخْرَيَيْنِ. وَمَا آلُو مَا اقْتَدَيْتُ بِهِ مِنْ صَلَاةِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ» فَقَالَ: ذَاكَ الظَّنُّ بِكَ، أَوْ ذَاكَ ظَنِّي بِكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8583,
                "hadithNumber": "1019",
                "englishNarrator": "This hadith is narrated by Jabir bin Samura رضی ‌اللہ ‌عنہ but with the addition of these words:",
                "hadithEnglish": "(Sa'd رضی ‌اللہ ‌عنہ said): These bedouins presume to teach me prayer.",
                "hadithUrdu": "سعد ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : بدوی مجھے نماز سکھائیں گے؟ ( میں نے تو خود رسول اللہﷺ سے نماز سیکھی ہے)",
                "urduNarrator": "ہم سے ابو کریب نے بیان کیا، کہا ہم سے ابن بشر نے بیان کیا, مسعر نے عبد الملک ( بن عمیر ) اور ابو عون سے روایت کی ، انہوں نے حضرت جابر بن سمرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے ان کی حدیث کے ہم معنیٰ روایت بیان کی اور اس میں یہ اضافہ کیا ہے کہ",
                "hadithArabic": "وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا ابْنُ بِشْرٍ، عَنْ مِسْعَرٍ، عَنْ عَبْدِ الْمَلِكِ، وَأَبِي عَوْنٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، بِمَعْنَى حَدِيثِهِمْ وَزَادَ فَقَالَ: تُعَلِّمُنِي الْأَعْرَابُ بِالصَّلَاةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8584,
                "hadithNumber": "1020",
                "englishNarrator": "Abu Sa'id al-Khudri رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The noon prayer would start and one would go to al-Baqi' and after having relieved himself he would perform ablution and then come, while the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) would be in the first rak'ah, because he would prolong it so much.",
                "hadithUrdu": "ظہر کی نماز اقامت کہی جاتی اور کوئی جانے والا بقیع جاتا ، اپنی ضرورت سے فارغ ہو کر وضو کرتا ، پھر ( مسجد میں ) آتا اور رسول اللہﷺ اسے لمبا کرنے کی وجہ سے ابھی پہلی رکعت میں ہوتے ۔",
                "urduNarrator": "ہم سے داؤد بن راشد نے بیان کیا، کہا ہم سے الولید یعنی ابن مسلم نے بیان کیا، انہوں نے سعید کی سند سے جو عبدالعزیز کے بیٹے ہیں, عطیہ بن قیس نے قزعہ سے ، انہوں نے حضرت ابو سعید خدری ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا دَاوُدُ بْنُ رُشَيْدٍ، حَدَّثَنَا الْوَلِيدُ يَعْنِي ابْنَ مُسْلِمٍ، عَنْ سَعِيدٍ وَهُوَ ابْنُ عَبْدِ العَزِيزِ، عَنْ عَطِيَّةَ بْنِ قَيْسٍ، عَنْ قَزْعَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ: «لَقَدْ كَانَتْ صَلَاةُ الظُّهْرِ تُقَامُ فَيَذْهَبُ الذَّاهِبُ إِلَى الْبَقِيعِ فَيَقْضِي حَاجَتَهُ. ثُمَّ يَتَوَضَّأُ. ثُمَّ يَأْتِي وَرَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي الرَّكْعَةِ الْأُولَى مِمَّا يُطَوِّلُهَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8585,
                "hadithNumber": "1021",
                "englishNarrator": "Qaz'a reported:",
                "hadithEnglish": "I came to Abu Sa'id al-Khudri ‌رضی ‌اللہ ‌عنہ ‌and he was surrounded by people. When the people departed from him I said: I am not going to ask you what these people have been asking you. I want to ask you about the prayer of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). He (Abu Sa'id) said: There is no good for you in this. He (Qaz'a), however, repeated (his demand). He then said: The noon prayer would start and one of us would go to Baqi' and, having relieved himself, would come to his home, then perform ablution and go to the mosque, and (he would find) The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) in the first rak'ah.",
                "hadithUrdu": "میں ابو سعید خدری ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی خدمت میں حاضر ہوا ، ان کے پاس ( استفادے کے لیے ) کثرت سے لوگ موجود تھے ۔ جب یہ لوگ ان سے ( رخصت ہو کر ) منتشر ہو گئے تو میں نے عرض کی : میں آپ سے ان چیزوں کے بارے میں سوال نہیں کروں گا جن کے بارے میں لوگ آپ سے سوال کر رہے تھے ۔ میں نے کہا : میں آپ سے رسول اللہﷺ کی نماز کے بارے میں پوچھتا ہوں ۔ انہوں نے کہا : اس سوال میں تیرے لیے بھلائی نہیں ہے ( کیونکہ تم نماز پڑھانے والے حکمرانوں کے پیچھے ایسے نماز نہیں پڑھ سکو گے ) انہوں نے ان کے سامنے دوبارہ اپنا مسئلہ پیش کیا تو ابو سعید خدری ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : ظہر کی نماز کھڑی کی جاتی اور ہم میں سے کوئی بقیع کی طرف جاتا ، اپنی ضرورت پوری کرتا ، پھر اپنے گھر آ کر وضو کرتا ، اس کے بعد واپس مسجد میں آتا تو رسول اللہﷺ ابھی پہلی رکعت میں ہوتے تھے ۔",
                "urduNarrator": "مجھ سے محمد بن حاتم نے بیان کیا، ہم سے عبدالرحمٰن بن مہدی نے بیان کیا، وہ معاویہ بن صالح کی سند سے,ربیعہ نے کہا : قزعہ نے مجھے حدیث سنائی ، کہا",
                "hadithArabic": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ، عَنْ رَبِيعَةَ، قَالَ: حَدَّثَنِي قَزْعَةُ، قَالَ: أَتَيْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ، وَهُوَ مَكْثُورٌ عَلَيْهِ فَلَمَّا تَفَرَّقَ النَّاسُ عَنْهُ قُلْتُ: إِنِّي لَا أَسْأَلُكَ عَمَّا يَسْأَلُكَ هَؤُلَاءِ عَنْهُ قُلْتُ: أَسْأَلُكَ عَنْ صَلَاةِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: مَا لَكَ فِي ذَاكَ مِنْ خَيْرٍ فَأَعَادَهَا عَلَيْهِ. فَقَالَ: «كَانَتْ صَلَاةُ الظُّهْرِ تُقَامُ فَيَنْطَلِقُ أَحَدُنَا إِلَى الْبَقِيعِ فَيَقْضِي حَاجَتَهُ، ثُمَّ يَأْتِي أَهْلَهُ فَيَتَوَضَّأُ، ثُمَّ يَرْجِعُ إِلَى الْمَسْجِدِ وَرَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي الرَّكْعَةِ الْأُولَى».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8586,
                "hadithNumber": "1022",
                "englishNarrator": "Abdullah bin Sa'ib ‌رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) led us in the morning prayer in Mecca and began Sarat al-Mu'minin (xxiii ) but when he came to the mention of Moses and Aaron (verse. 45) or to the mention of Jesus (verse 50), a cough got the better of him, and he bowed. 'Abdullah bin Sa'ib ‌رضی ‌اللہ ‌عنہ was present there, and in the hadith narrated by Abdul-Razzaq (the words are): He cut short (the recitation) and bowed.",
                "hadithUrdu": "نبیﷺ نے ہمیں مکہ میں صبح کی نماز پڑھائی تو سورہ مومنون کی قراءت شروع کی حتیٰ کہ موسیٰ اور ہارون علیہ السلام کا ذکر آیا یا عیسیٰ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کا ذکر آیا ( محمد بن عبادہ کو شک ہے یا راویوں نے اس کے سامنے ( بیان کرتے ہوئے ) اختلاف کیا ہے ) ( اس وقت ) رسو ل اللہﷺ کو کھانسی آنے لگی تو آپ رکوع میں چلے گئے ۔ عبد اللہ بن سائب ‌رضی ‌اللہ ‌عنہ ‌ ‌ بھی اس نماز میں موجود تھے ۔ عبد الرزاق کی روایت میں ہے : آپ نے قراءت قطع کر دی اور رکوع میں چلے گئے ۔ اور ان کی حدیث میں ( راوی کا نام ) عبد اللہ بن عمرو ہے ، آگے ابن عاص نہیں کہا ۔",
                "urduNarrator": "ہم سے ہارون بن عبداللہ نے بیان کیا,حجاج بن محمد نے ابن جریج سے روایت کی ، نیز عبد الرزاق نے ہمیں حدیث بیان کی ، کہا : ابن جریج نے ہمیں بتایا ، کہا : میں نے محمد بن عباد بن جعفر سے سنا ، کہہ رہے تھے : مجھے ابو سلمہ بن سفیان ، عبد اللہ بن عمرو بن عاص اور عبد اللہ بن مسیب سے عابدی نے حضرت عبد اللہ بن سائب ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کرتے ہوئے خبر دی ، انہوں نے کہا",
                "hadithArabic": "وَحَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللهِ، حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، عَنِ ابْنِ جُرَيْجٍ ح، قَالَ: وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، - وَتَقَارَبَا فِي اللَّفْظِ - حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ: سَمِعْتُ مُحَمَّدَ بْنَ عَبَّادِ بْنِ جَعْفَرٍ، يَقُولُ: أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ سُفْيَانَ، وَعَبْدُ اللهِ بْنُ عَمْرِو بْنِ الْعَاصِ، وَعَبْدُ اللهِ بْنُ الْمُسَيِّبِ الْعَابِدِيُّ، عَنْ عَبْدِ اللهِ بْنِ السَّائِبِ قَالَ: صَلَّى لَنَا النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: الصُّبْحَ بِمَكَّةَ فَاسْتَفْتَحَ سُورَةَ الْمُؤْمِنِينَ حَتَّى جَاءَ ذِكْرُ مُوسَى، وَهَارُونَ أَوْ ذِكْرُ عِيسَى - مُحَمَّدُ بْنُ عَبَّادٍ يَشُكُّ - أَوِ اخْتَلَفُوا عَلَيْهِ أَخَذَتِ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ سَعْلَةٌ فَرَكَعَ وَعَبْدُ اللهِ بْنُ السَّائِبِ، حَاضِرٌ ذَلِكَ وَفِي حَدِيثِ عَبْدِ الرَّزَّاقِ فَحَذَفَ فَرَكَعَ وَفِي حَدِيثِهِ عَبْدُ اللهِ بْنُ عَمْرٍو وَلَمْ يَقُلِ ابْنَ الْعَاصِ.",
                "headingArabic": "الْقِرَاءَةِ فِي الصُّبْحِ ‏",
                "headingUrdu": "الصبح میں تلاوت",
                "headingEnglish": "Recitation in As-Subh",
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8587,
                "hadithNumber": "1023",
                "englishNarrator": "Amr bin Huraith رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "I heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) recite in the morning prayer Wa'l-lail-i-idhd 'As'asa (ixxxi. 17).",
                "hadithUrdu": "انہوں نے رسول اللہﷺ کو فجر کی نماز میں ﴿واليل إذا عسعس﴾ ( قسم ہے رات کی! جب وہ جانے لگتی ہے ) پڑھتے ہوئے سنا.",
                "urduNarrator": "ہم سے زہیر بن حرب نے بیان کیا، کہا ہم سے یحییٰ بن سعید نے بیان کیا، کہا ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا کہ ہم سے وکیع نے بیان کیا، مجھ سے ابو کریب نے بیان کیا اور تلفظ ان کا ہے، ہم سے ابن بشر نے مس ​​کی سند سے بیان کیا۔ انہوں نے کہا: مجھے ولید بن ساری نے بیان کیا,حضرت عمرو بن حریث ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کہ",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، ح قَالَ: وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنِي أَبُو كُرَيْبٍ - وَاللَّفْظُ لَهُ - أَخْبَرَنَا ابْنُ بِشْرٍ، عَنْ مِسْعَرٍ، قَالَ: حَدَّثَنِي الْوَلِيدُ بْنُ سَرِيعٍ، عَنْ عَمْرِو بْنِ حُرَيْثٍ: «أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي الْفَجْرِ وَاللَّيْلِ إِذَا عَسْعَسَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8588,
                "hadithNumber": "1024",
                "englishNarrator": "Qutba bin Malik رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "I said prayer and the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) led it and he recited Qaf. (I.). By the Glorious Qur'an, till he recited and the tall palm trees (l. 10). I wanted to repeat it but I could not follow its significance.",
                "hadithUrdu": "میں نے نماز پڑھی اور ہمیں رسول اللہﷺ نے نماز پڑھائی ، آپ ﴿ق والقرآن المجيد﴾ پڑھی حتی کہ آپ نے ﴿والنخل باسقت﴾ ( اور کجھور کے بلند وبالا درخت ) پڑھا تو میں اس آیت کو بار بار ( ذہن میں ) دہرانے لگا اور آپ نے جو کہا مجھے اس ( کے مفہوم ) کا پتہ نہ چلا ۔",
                "urduNarrator": "ابو کامل الجہدری فضیل بن حسین نے مجھ سے کہا,ابو عوانہ نے زیاد بن علاقہ سے اور انہوں نے حضرت قطبہ نے مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنِي أَبُو كَامِلٍ الْجَحْدَرِيُّ فُضَيْلُ بْنُ حُسَيْنٍ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ زِيَادِ بْنِ عِلَاقَةَ، عَنْ قُطْبَةَ بْنِ مَالِكٍ قَالَ: صَلَّيْتُ وَصَلَّى بِنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَقَرَأَ: ق وَالْقُرْآنِ الْمَجِيدِ. حَتَّى قَرَأَ: {وَالنَّخْلَ بَاسِقَاتٍ} [ق: 10]. قَالَ: فَجَعَلْتُ أُرَدِّدُهَا وَلَا أَدْرِي مَا قَالَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 8276,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=331",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=329",
                "label": "329",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=330",
                "label": "330",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=331",
                "label": "331",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=332",
                "label": "332",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=333",
                "label": "333",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=334",
                "label": "334",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=335",
                "label": "335",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=333",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=333",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=331",
        "to": 8300,
        "total": 40465
    }
}