{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 356,
        "data": [
            {
                "id": 9164,
                "hadithNumber": "1600",
                "englishNarrator": "It was narrated from Nafi:",
                "hadithEnglish": "Ibn 'Umar رضی اللہ عنہ announced Adhan for prayer on a cold, windy night. Then added: Pray in your dwellings; and then said: When it was a cold, rainy night, the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) used to command the Mu'adhdhin to say Pray in your dwellings.",
                "hadithUrdu": "ابن عمر رضی اللہ عنہ نے سردی اور ہوا والی ایک رات اذان کہی اور اس کے آخر میں کہا : ( أَلَا صَلُّوا فِي الرِّحَالِ ) سنو! ( اپنے ) ٹھکانوں میں نماز پڑھ لو ۔ \" پھر کہا کہ جب رات سرد اور بارش والی ہوتی تو رسول اللہ صلی اللہ علیہ وسلم موذن کو حکم دیتے کہ وہ کہے ( أَلَا صَلُّوا فِي الرِّحَالِ ) سنو! ( اپنے ) ٹھکانوں پر نماز پڑھ لو ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا: میں نے پڑھاامام مالک نے نافع سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ أَنَّ ابْنَ عُمَرَ أَذَّنَ بِالصَّلَاةِ فِي لَيْلَةٍ ذَاتِ بَرْدٍ وَرِيحٍ فَقَالَ أَلَا صَلُّوا فِي الرِّحَالِ ثُمَّ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُ الْمُؤَذِّنَ إِذَا كَانَتْ لَيْلَةٌ بَارِدَةٌ ذَاتُ مَطَرٍ يَقُولُ أَلَا صَلُّوا فِي الرِّحَالِ.",
                "headingArabic": "الصَّلاَةِ فِي الرحَالِ فِي الْمَطَرِ ‏‏",
                "headingUrdu": "بارش کے وقت گھروں میں نماز پڑھنا",
                "headingEnglish": "Praying in dwellings when it is raining",
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9165,
                "hadithNumber": "1601",
                "englishNarrator": "Ibn 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "He summoned (people) to pray on a cold, windy and rainy night, and then observed at the end of the Adhan: Pray in your dwellings, pray in your dwellings, and then said: When it was a cold night or it was raining in a journey the Messenger of Allah (may peace he upon him) used to command the Mu'adhdhin to announce: Pray in your dwellings.",
                "hadithUrdu": "انھوں نے سردی ، ہوا اور بارش و الی ایک رات میں اذان دی اور اذان کے آخر میں کہا : \" سنو! اپنے ٹھکانوں میں نماز پڑھ لو ، سنو! ٹھکانوں میں نماز پڑھو ، \" پھر کہا : جب سفر میں رات سرد یا بارش والی ہوتی تو رسول اللہ صلی اللہ علیہ وسلم موذن کو یہ کہنے کا حکم دیتے \" أَلَا صَلُّوا فِي الرِّحَالِکُم ) \" سنو!اپنی قیام گاہوں میں نماز پڑھ لو ۔ \"",
                "urduNarrator": "محمد بن عبداللہ بن نمیر نے حدیث بیان کی ، کہا : مجھے میرے والد نے حدیث سنائی ، کہا : ہمیں عبیداللہ نے حدیث سنائی ، کہا : مجھے نافع نے حضرت ابن عمر رضی اللہ عنہ سے حدیث بیان کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا عُبَيْدُ اللَّهِ حَدَّثَنِي نَافِعٌ عَنْ ابْنِ عُمَرَ أَنَّهُ نَادَى بِالصَّلَاةِ فِي لَيْلَةٍ ذَاتِ بَرْدٍ وَرِيحٍ وَمَطَرٍ فَقَالَ فِي آخِرِ نِدَائِهِ أَلَا صَلُّوا فِي رِحَالِكُمْ أَلَا صَلُّوا فِي الرِّحَالِ ثُمَّ قَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْمُرُ الْمُؤَذِّنَ إِذَا كَانَتْ لَيْلَةٌ بَارِدَةٌ أَوْ ذَاتُ مَطَرٍ فِي السَّفَرِ أَنْ يَقُولَ أَلَا صَلُّوا فِي رِحَالِكُمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9166,
                "hadithNumber": "1602",
                "englishNarrator": "Ibn 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "He summoned (people) to prayer at a place (known as) Dajnan, and the rest of the hadith is the same, and then said: Pray in your dwellings, but he did not repeat for the second time words of Ibn 'Umar رضی اللہ عنہ (Pray in your dwellings).",
                "hadithUrdu": "انھوں نے ( مکہ سے چھ میل کے فاصلے پر واقع ) بضَجنانَ پہاڑ پر اذان کہی ۔ ۔ ۔ پھر اوپر والی حدیث کے مانند بیان کیا اور ( ابو اسامہ نے ) کہا : \" أَلَا صَلُّوا فِي الرِّحَالِکُم \" اور انھوں نے ابن عمر رضی اللہ عنہ کے دوبارہ \" أَلَا صَلُّوا فِي الرِّحَالِ \" کہنے کا ذکر نہیں کیا ۔",
                "urduNarrator": "اور ہم سے ابوبکر بن ابی شیبہ نے بیان کیا,ابو اسامہ نے کہا : ہمیں عبیداللہ نے نافع سے حدیث سنائی ، انھوں نے حضرت ابن عمر رضی اللہ عنہ سے ر وایت کی کہ",
                "hadithArabic": "و حَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّهُ نَادَى بِالصَّلَاةِ بِضَجْنَانَ ثُمَّ ذَكَرَ بِمِثْلِهِ وَقَالَ أَلَا صَلُّوا فِي رِحَالِكُمْ وَلَمْ يُعِدْ ثَانِيَةً أَلَا صَلُّوا فِي الرِّحَالِ مِنْ قَوْلِ ابْنِ عُمَرَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9167,
                "hadithNumber": "1603",
                "englishNarrator": "Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "We set cut with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) on a journey when it began to rain. Upon this he said: He who desires may pray in his dwelling.",
                "hadithUrdu": "ایک سفر میں ہم رسول اللہ صلی اللہ علیہ وسلم کے ہمراہ نکلے تو بارش ہوگئی ، آپ صلی اللہ علیہ وسلم نے فرمایا ، \" تم میں سے جو چاہے اپنی قیام گاہ میں نماز پڑھ لے ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا ہم سے ابو خیثمہ نے بیان کیا، کہا کہ ہم سے ابو الزبیر نے بیان کیا، وہ جابر  کی سند سے، ہم سے احمد بن یونس نے بیان کیا، انہوں نے کہا: ہم سے زہیر نے بیان کیا، ہم سے ابو الزید نے بیان کیا, حضرت جابر رضی اللہ عنہ سے روایت ہے انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو خَيْثَمَةَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ ح و حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ قَالَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَمُطِرْنَا فَقَالَ لِيُصَلِّ مَنْ شَاءَ مِنْكُمْ فِي رَحْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9168,
                "hadithNumber": "1604",
                "englishNarrator": "Abdullah bin 'Abbas رضی اللہ عنہ reported:",
                "hadithEnglish": "He said to the Mu'adhdhin on a rainy day: When you have announced I testify that there is no god but Allah; I testify that Muhammad is the Messenger of Allah, do not say: Come to the prayer, but make this announcement: Say prayer in your houses. He (the narrator) said that the people disapproved of it. Ibn 'Abbas رضی اللہ عنہ said: Are you astonished at it? He (the Holy Prophet), who is better than I, did it. Jumu'a prayer is no doubt obligatory, but I do not like that I should (force you) to come out and walk in mud and slippery ground.",
                "hadithUrdu": "انھوں نے ایک بارش والے دن اپنے موذن سے فرمایا : جب تم اشهد ان لا اله الا الله اشهد ان محمد ا رسول الله کہہ چکو تو حيي علي الصلوة نہ کہنا ( بلکہ ) صَلُّوا فِي بُيُوتِكُمْ ( اپنے گھروں میں نماز پڑھو ) کہنا ۔ کہا : لوگوں نے گویا اس کو ایک غیر معروف کام سمجھا تو ابن عباس رضی اللہ عنہ نے کہا : کیاتم اس پر تعجب کررہے ہو؟ یہ کام انھوں نے کیا جو مجھ سے بہت زیادہ بہترتھے ۔ جمعہ پڑھنالازم ہے اور مجھے برا معلوم ہوا کہ میں تمھیں تنگی میں مبتلا کروں اور تم کیچڑاور پھسلن میں چل کر آؤ ۔",
                "urduNarrator": "مجھ سے علی بن حجر السعدی نے بیان کیا انہوں نے ہم سے بیان کیا,اسماعیل ( ابن علیہ ) نے ( ابن ابی سفیان ) الزیادی کے ساتھی عبدالحمید سے ، انھوں نے عبداللہ بن حارث سے اور انھوں نے حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ حَدَّثَنَا إِسْمَعِيلُ عَنْ عَبْدِ الْحَمِيدِ صَاحِبِ الزِّيَادِيِّ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ أَنَّهُ قَالَ لِمُؤَذِّنِهِ فِي يَوْمٍ مَطِيرٍ إِذَا قُلْتَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ فَلَا تَقُلْ حَيَّ عَلَى الصَّلَاةِ قُلْ صَلُّوا فِي بُيُوتِكُمْ قَالَ فَكَأَنَّ النَّاسَ اسْتَنْكَرُوا ذَاكَ فَقَالَ أَتَعْجَبُونَ مِنْ ذَا قَدْ فَعَلَ ذَا مَنْ هُوَ خَيْرٌ مِنِّي إِنَّ الْجُمُعَةَ عَزْمَةٌ وَإِنِّي كَرِهْتُ أَنْ أُخْرِجَكُمْ فَتَمْشُوا فِي الطِّينِ وَالدَّحْضْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9169,
                "hadithNumber": "1605",
                "englishNarrator": "Abdul-Hamid reported:",
                "hadithEnglish": "I heard 'Abdullah bin al-Harith say: 'Abdullah bin 'Abbas رضی اللہ عنہ addressed us on a rainy day, and the rest of the hadith is the same, but he made no mention of Jumu'a prayer, and added: He who did it (who commanded us to say prayer in our houses), I. e. the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), is better than I. Abu Kalim sid: \"Hammad narrated something similar to us from Asim, from Abdullah bin Harith.\"",
                "hadithUrdu": "میں نے عبداللہ بن حارث سے سنا ، انھوں نے کہا : حضرت عبداللہ بن عباس رضی اللہ عنہ نے ایک پھسلن والے دن ہمارے سامنے خطبہ دیا ۔ ۔ ۔ آگے ابن علیہ کی حدیث کےہم معنی روایت بیان کی ، لیکن جمعے کا نام نہیں لیا ، اور کہا : یہ کام اس شخصیت نے کیا ہے جو مجھ سے بہت زیادہ بہتر تھے ، یعنی نبی اکرم صلی اللہ علیہ وسلم نے ( یہ کام کیا ہے ) ابو کامل نے کہا : حماد نے ہم سے یہ حدیث ( عبدالحمید کی بجائے ) عاصم سے ، انھوں نے عبداللہ بن حارث سے اسی طرح روایت کی ہے ۔",
                "urduNarrator": "ابو کامل جحدری نے کہا : ہمیں حماد ، یعنی ابن زید نے عبدالحمید سے حدیث بیان کی ، انھوں نے کہا",
                "hadithArabic": "ِ و حَدَّثَنِيهِ أَبُو كَامِلٍ الْجَحْدَرِيُّ حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ عَنْ عَبْدِ الْحَمِيدِ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ الْحَارِثِ قَالَ خَطَبَنَا عَبْدُ اللَّهِ بْنُ عَبَّاسٍ فِي يَوْمٍ ذِي رَدْغٍ وَسَاقَ الْحَدِيثَ بِمَعْنَى حَدِيثِ ابْنِ عُلَيَّةَ وَلَمْ يَذْكُرْ الْجُمُعَةَ وَقَالَ قَدْ فَعَلَهُ مَنْ هُوَ خَيْرٌ مِنِّي يَعْنِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ و قَالَ أَبُو كَامِلٍ حَدَّثَنَا حَمَّادٌ عَنْ عَاصِمٍ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ بِنَحْوِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9170,
                "hadithNumber": "1606",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated by Ayyub and 'Asim al-Ahwal with the same chain of transmitters, but in this hadith it is not recorded: i. e. the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ).",
                "hadithUrdu": "ابو ربیع عتکی زہرانی نے کہا : ہمیں حماد یعنی ابن زید نے حدیث سنائی ، کہا : ہمیں ایوب اور عاصم احول نے اس سند کےساتھ حدیث سنائی ، البتہ انھوں ( ابو ربیع ) نے اپنی حدیث میں یعنی النبي صلی اللہ علیہ وسلم کے الفاظ ذکر نہیں کیے ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنِيهِ أَبُو الرَّبِيعِ الْعَتَكِيُّ هُوَ الزَّهْرَانِيُّ حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ حَدَّثَنَا أَيُّوبُ وَعَاصِمٌ الْأَحْوَلُ بِهَذَا الْإِسْنَادِ وَلَمْ يَذْكُرْ فِي حَدِيثِهِ يَعْنِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9171,
                "hadithNumber": "1607",
                "englishNarrator": "Abdullah bin Harith reported:",
                "hadithEnglish": "Ibn 'Abbas رضی اللہ عنہ commanded the Mu'adhdhin to (summon the people to prayer on Friday and make announcement to say prayer in their houses) when it was rainy, and the rest of the hadith is the same (except this) that he said: I do not like you should walk in muddy slippery place.",
                "hadithUrdu": "حضرت ابن عباس رضی اللہ عنہ کے موذن نے جمعے کے روز بارش والے دن اذان دی ۔ ۔ ۔ پھر ابن علیہ کی حدیث کی طرح بیان کیا ، اورکہا : میں نے اس بات کو ناپسند کیا کہ تم پھسلن میں چل کرآؤ ۔",
                "urduNarrator": "ہم سے اسحاق بن منصور نے بیان کیا، کہا ہم سے ابن شمیل نے بیان کیا,شعبہ نے کہا : ہمیں عبدالحمید صاحب الزیادی نے حدیث سنائی ، کہا : میں نے عبداللہ بن حارث سے سنا ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ أَخْبَرَنَا ابْنُ شُمَيْلٍ أَخْبَرَنَا شُعْبَةُ حَدَّثَنَا عَبْدُ الْحَمِيدِ صَاحِبُ الزِّيَادِيِّ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ الْحَارِثِ قَالَ أَذَّنَ مُؤَذِّنُ ابْنِ عَبَّاسٍ يَوْمَ جُمُعَةٍ فِي يَوْمٍ مَطِيرٍ فَذَكَرَ نَحْوَ حَدِيثِ ابْنِ عُلَيَّةَ وَقَالَ وَكَرِهْتُ أَنْ تَمْشُوا فِي الدَّحْضِ وَالزَّلَلِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9172,
                "hadithNumber": "1608",
                "englishNarrator": "Abdullah bin Harith reported:",
                "hadithEnglish": "The Mu'adhdhin of Ibn 'Abbas رضی اللہ عنہ said Adhan on Friday (and then made the announcement to say prayer in houses) because it was a rainy day; as it has been narrated by Ma'mar and others, and in this hadith it was mentioned: He who did it, i. e. the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), was better than I.",
                "hadithUrdu": "حضرت ابن عباس رضی اللہ عنہ نے اپنے موذن کو حکم دیا ۔ معمر کی روایت میں ہے : جمعے کے روز بارش کے دن ۔ ۔ ۔ ( آگے ) سابقہ راویوں کی روایت کی طرح ہے ۔ اور معمر کی حدیث میں یہ بھی ہے : یہ کام انھوں نے کیا جو مجھ سے بہت زیادہ بہتر ہیں ، یعنی نبی اکرم صلی اللہ علیہ وسلم نے ۔",
                "urduNarrator": "ہم سے عبد بن حمید نے بیان کیا، ہم سے سعید بن عامر نے بیان کیا,شعبہ اور معمر دونوں نے ( اپنی اپنی سند سے روایت کرتے ہوئے ) عاصم احول سے اور انھوں نے عبداللہ بن حارث سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنَاه عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ عَنْ شُعْبَةَ ح و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ كِلَاهُمَا عَنْ عَاصِمٍ الْأَحْوَلِ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ أَنَّ ابْنَ عَبَّاسٍ أَمَرَ مُؤَذِّنَهُ فِي حَدِيثِ مَعْمَرٍ فِي يَوْمِ جُمُعَةٍ فِي يَوْمٍ مَطِيرٍ بِنَحْوِ حَدِيثِهِمْ وَذَكَرَ فِي حَدِيثِ مَعْمَرٍ فَعَلَهُ مَنْ هُوَ خَيْرٌ مِنِّي يَعْنِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9173,
                "hadithNumber": "1609",
                "englishNarrator": "It was narrated that Abdullah bin Harith saod:",
                "hadithEnglish": "A hadith like this that Ibn 'Abbas رضی اللہ عنہ ordered his Mu'adhdhin (to summon people to prayer and then make announcement to say prayer in their houses) on Friday which was a rainy day, has been transmitted by 'Abdullah bin Harith. Wuhaib, however, says that he did not hear it from him.",
                "hadithUrdu": "ابن عباس رضی اللہ عنہ نے جمعے کے روز بارش کے دن اپنے موذن کو حکم دیا ۔ ۔ ۔ ( آگے اسی طرح ہے ) جس طرح دوسرے راویوں نے بیان کیا ۔",
                "urduNarrator": "ہم سے عبد بن حمید نے بیان کیا، ہم سے احمد بن اسحاق الحدرمی نے بیان کیا، انہیں وہیب نے بیان کیا، انہیں ایوب نے عبداللہ بن حارث سے روایت کیا، انہوں نے کہا: وہیب نے ان کے ساتھ اس کا ذکر نہیں کیا، انہوں نے کہا",
                "hadithArabic": "و حَدَّثَنَاه عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا أَحْمَدُ بْنُ إِسْحَقَ الْحَضْرَمِيُّ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا أَيُّوبُ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ قَالَ وُهَيْبٌ لَمْ يَسْمَعْهُ مِنْهُ قَالَ أَمَرَ ابْنُ عَبَّاسٍ مُؤَذِّنَهُ فِي يَوْمِ جُمُعَةٍ فِي يَوْمٍ مَطِيرٍ بِنَحْوِ حَدِيثِهِم.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9174,
                "hadithNumber": "1610",
                "englishNarrator": "Ibn 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to say Nafl prayer on (the back of) his camel in whatever direction it took him.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ( سفر میں سواری پر ) اپنی نفل نماز پڑھتے تھے آپ کی اونٹنی جس طرف بھی آپ کو لئے ہوئے رخ کرلیتی ۔",
                "urduNarrator": "محمد بن عبداللہ بن نمیر نے حدیث بیان کی ، کہا : ہمیں میرے والد نے حدیث بیان کی ، کہا : ہمیں عبیداللہ نے نافع سے انھوں نے حضرت ابن عمر رضی اللہ عنہ سے حدیث بیان کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي سُبْحَتَهُ حَيْثُمَا تَوَجَّهَتْ بِهِ نَاقَتُهُ.",
                "headingArabic": "جَوَازِ صَلاَةِ النَّافِلَةِ عَلَى الدَّابَّةِ فِي السَّفَرِ حَيْثُ تَوَجَّهَتْ ‏‏",
                "headingUrdu": "سفر میں سواری کے اوپر نفلی نماز پڑھنا جائز ہے، خواہ اس کا رخ کس طرف ہو",
                "headingEnglish": "It is permissible to offer voluntary prayers atop one’s mount when travelling, no matter what direction it is facing",
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9175,
                "hadithNumber": "1611",
                "englishNarrator": "Ibn 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "The Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) used to pray on (the back of) his camel in whatever direction it took him.",
                "hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم اپنی سواری پر نماز پڑھتے تھے ۔ وہ چاہے آپ کو لئے ہوئے جس طرف بھی رخ کرلیتی ۔",
                "urduNarrator": "اور ہم سے ابوبکر بن ابی شیبہ نے بیان کیا,ابو خالد احمر نے عبیداللہ سے انھوں نے نافع سے اور انھوں نے ابن عمر رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي عَلَى رَاحِلَتِهِ حَيْثُ تَوَجَّهَتْ بِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9176,
                "hadithNumber": "1612",
                "englishNarrator": "Ibn 'Umar رضی اللہ  عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to say prayer on his camel while coming from Mecca to Medina, in whatever direction his face had turned; and its was (in this context) that this verse was revealed: So whether you turn thither is Allah's face (ii. 115).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم جب مکہ سے مدینہ کی طرف آرہے ہوتے ، اپنی سواری پر نماز پڑھتے تھے ، جس طرف بھی آپ کا رخ ہوجاتا ۔ کہا : اسی کے بارے میں یہ آیت اتری : \" سو جس طرف تم رخ کرو ، وہیں اللہ کا چہرہ ہے ۔ \"",
                "urduNarrator": "مجھ سے عبید اللہ بن عمر القواری نے بیان کیا, یحییٰ بن سعید نے عبدالملک بن ابی سلیمان سے روایت کی ، کہا : ہمیں سعید بن جبیر نے حضرت ابن عمر رضی اللہ  عنہ سے روایت بیان کی کہ",
                "hadithArabic": "و حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ قَالَ حَدَّثَنَا سَعِيدُ بْنُ جُبَيْرٍ عَنْ ابْنِ عُمَرَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي وَهُوَ مُقْبِلٌ مِنْ مَكَّةَ إِلَى الْمَدِينَةِ عَلَى رَاحِلَتِهِ حَيْثُ كَانَ وَجْهُهُ قَالَ وَفِيهِ نَزَلَتْ فَأَيْنَمَا تُوَلُّوا فَثَمَّ وَجْهُ اللَّهِ )البقرة:115).",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9177,
                "hadithNumber": "1613",
                "englishNarrator": "This hadith has been narrated by another chain of transmitters and in the one narrated by Ibn Mubarak and Ibn Abu Za'ida (these words are narrated):",
                "hadithEnglish": "Ibn 'Umar رضی اللہ عنہ then recited: Whether you turn thither is Allah's face, and it was revealed in this context.",
                "hadithUrdu": "پھر حضرت ابن عمر رضی اللہ عنہ نےآیت تلاوت کی ( فَأَيْنَمَا تُوَلُّوا فَثَمَّ وَجْهُ اللہِہہہ ) \" تم جس طرف بھی رخ کرو وہیں اللہ کا چہرہ ہے \" اور کہا : یہ اسی کے بارے میں اتری ہے ۔",
                "urduNarrator": "ہم سے ابو کریب نے بیان کیا, ابن مبارک ، ابن ابی زائدہ اور ابن نمیر نے اپنے والد کے حوالے سے ، سب نے عبدالملک سے اسی سند کے ساتھ یہ حدیث روایت کی اور ان میں سے ابن مبارک اور ابن ابی زائدہ کی روایت میں ہے کہ",
                "hadithArabic": "و حَدَّثَنَاه أَبُو كُرَيْبٍ أَخْبَرَنَا ابْنُ الْمُبَارَكِ وَابْنُ أَبِي زَائِدَةَ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي كُلُّهُمْ عَنْ عَبْدِ الْمَلِكِ بِهَذَا الْإِسْنَادِ نَحْوَهُ وَفِي حَدِيثِ ابْنِ مُبَارَكٍ وَابْنِ أَبِي زَائِدَةَ ثُمَّ تَلَا ابْنُ عُمَرَ فَأَيْنَمَا تُوَلُّوا فَثَمَّ وَجْهُ اللَّهِ وَقَالَ فِي هَذَا نَزَلَتْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9178,
                "hadithNumber": "1614",
                "englishNarrator": "Ibn 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "I saw the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) praying (Nafl prayer) on a donkey's back while his face was turned towards Khaibar.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو گدھے پر نمازپڑھتے دیکھا جبکہ آپ نے خیبر کا رخ کیا ہوا تھا ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے مالک رضی اللہ عنہ سے اس کے متعلق پڑھا,عمرو بن یحییٰ مازنی نے سعید بن یسار سے اور انھوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ عَمْرِو بْنِ يَحْيَى الْمَازِنِيِّ عَنْ سَعِيدِ بْنِ يَسَارٍ عَنْ ابْنِ عُمَرَ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي عَلَى حِمَارٍ وَهُوَ مُوَجِّهٌ إِلَى خَيْبَرَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9179,
                "hadithNumber": "1615",
                "englishNarrator": "Sa'id bin Yasar reported:",
                "hadithEnglish": "I was travelling along with Ibn 'Umar رضی اللہ عنہ on the way to Mecca. Sa'id said: When I apprehended dawn, I dismounted (the ride) and observed Witr prayer and then again joined him. Ibn 'Umar said to me: Where were you? I said: I apprehended the appearance of dawn, so I dismounted and observed Witr prayer. Upon this 'Abdullah رضی اللہ عنہ said: Is there not a model pattern for you in the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ )? I said: Yes, by Allah, and (then) he said: The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) used to observe Witr prayer on the camel's back.",
                "hadithUrdu": "میں مکہ کے راستے میں حضرت ابن عمر رضی اللہ تعالیٰ عنہ کے ساتھ سفر کررہا تھا ۔ پھر جب مجھے صبح ہوجانے کا اندیشہ ہوا تو میں سواری سے اترا اور وتر پڑھے ، پھر میں ان سے جا ملا تو حضرت ابن عمر رضی اللہ تعالیٰ عنہ نے مجھ سے پوچھا : تم کہاں ( رہ گئے ) تھے؟میں نے ان سے کہا : مجھے فجر ہوجانے کا اندیشہ ہوا ، اس لئے میں نے اتر کروترپڑھے ۔ تو حضرت عبداللہ رضی اللہ عنہ نے کہا : کیا تمہارے لئے رسول اللہ صلی اللہ علیہ وسلم کے عمل میں نمونہ نہیں ہے؟میں نے کہا : کیوں نہیں ، اللہ کی قسم ہے انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم اونٹ پر وتر پڑھتے تھے ۔",
                "urduNarrator": "اور ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا: میں نے مالک رضی اللہ عنہ سے پڑھا, ابو بکر بن عمر بن عبدالرحمان ، بن عبداللہ بن عمر بن خطاب رضی اللہ عنہ نے سعید بن یسار سے روایت کی کہ انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ أَبِي بَكْرِ بْنِ عُمَرَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ بْنِ الْخَطَّابِ عَنْ سَعِيدِ بْنِ يَسَارٍ أَنَّهُ قَالَ كُنْتُ أَسِيرُ مَعَ ابْنِ عُمَرَ بِطَرِيقِ مَكَّةَ قَالَ سَعِيدٌ فَلَمَّا خَشِيتُ الصُّبْحَ نَزَلْتُ فَأَوْتَرْتُ ثُمَّ أَدْرَكْتُهُ فَقَالَ لِي ابْنُ عُمَرَ أَيْنَ كُنْتَ فَقُلْتُ لَهُ خَشِيتُ الْفَجْرَ فَنَزَلْتُ فَأَوْتَرْتُ فَقَالَ عَبْدُ اللَّهِ أَلَيْسَ لَكَ فِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُسْوَةٌ فَقُلْتُ بَلَى وَاللَّهِ قَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُوتِرُ عَلَى الْبَعِيرِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9180,
                "hadithNumber": "1616",
                "englishNarrator": "Abdullah bin Dinar reported on the authority of Ibn 'Umar رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) used to observe prayer on his ride (no matter) in which direction it had its face turned. 'Abdullah b. Dinar said that Ibn 'Umar رضی اللہ عنہ used to do like that.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم اپنی سواری پر نماز پڑھتے تھے وہ آپ کو لئے ہوئے جدھر کا بھی رخ کرلیتی ۔ عبداللہ بن دینار نے کہا : حضرت ابن عمر رضی اللہ عنہ بھی یہی کرتے تھے ۔",
                "urduNarrator": "اور ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا: میں نے پڑھا, امام مالکؒ نے عبداللہ بن دینار سے اور انھوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی کہ انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ أَنَّهُ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي عَلَى رَاحِلَتِهِ حَيْثُمَا تَوَجَّهَتْ بِهِ قَالَ عَبْدُ اللَّهِ بْنُ دِينَارٍ كَانَ ابْنُ عُمَرَ يَفْعَلُ ذَلِكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9181,
                "hadithNumber": "1617",
                "englishNarrator": "Abdullah bin 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to observe Witr prayer on his ride.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم اپنی سواری پر وتر ادا کرتے تھے ۔",
                "urduNarrator": "اور مجھ سے عیسیٰ بن حماد المصری نے بیان کیا, ابن ہاد نے عبداللہ بن دینا ر سے اور انھوں نے حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت کی کہ انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنِي عِيسَى بْنُ حَمَّادٍ الْمِصْرِيُّ أَخْبَرَنَا اللَّيْثُ حَدَّثَنِي ابْنُ الْهَادِ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّهُ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُوتِرُ عَلَى رَاحِلَتِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9182,
                "hadithNumber": "1618",
                "englishNarrator": "Salim bin 'Abdullah reported on the authority of his father:",
                "hadithEnglish": "The Messenger of Allah (ﷺ) used to observe Nafi (supererogatory) prayer on his ride no matter in what direction it turned its face, and he observed Witr too on it, but did not observe obligatory prayer on it.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم اپنی سواری پر نفل پڑھتے جدھر بھی آپ کا رخ ہوجاتا اور اسی پر وتر بھی پڑھتے ، البتہ آپ فرض نماز اس پر نہیں پڑھتے تھے ۔",
                "urduNarrator": "اور مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، اور مجھ سے یونس نے ابن شہاب کی سند سے بیان کیا, سالم بن عبداللہ نے اپنے والد ( عبداللہ بن عمر رضی اللہ عنہ ) سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُسَبِّحُ عَلَى الرَّاحِلَةِ قِبَلَ أَيِّ وَجْهٍ تَوَجَّهَ وَيُوتِرُ عَلَيْهَا غَيْرَ أَنَّهُ لَا يُصَلِّي عَلَيْهَا الْمَكْتُوبَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9183,
                "hadithNumber": "1619",
                "englishNarrator": "Abdullah bin 'Amir bin Rabi'a رضی اللہ عنہ has reported on the authority of his father:",
                "hadithEnglish": "He had seen the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) observing Nafl player at night on a journey on the back of his ride in whichever direction it turned its face.",
                "hadithUrdu": "انھوں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا ، آپ سفر میں رات کے وقت سواری پر نفل پڑھتے تھے جدھر کا بھی وہ رخ کرلیتی تھی ۔",
                "urduNarrator": "ہم سے عمرو بن سواد اور حرملہ نے بیان کیا، کہا کہ ہمیں ابن وہب نے خبر دی، مجھے یونس نے ابن شہاب کی سند سے خبر دی,حضرت عبداللہ بن عامر بن ربیعہ رضی اللہ عنہ نے خبر دی کہ انھیں ان کے والد نے بتایا کہ",
                "hadithArabic": "و حَدَّثَنَا عَمْرُو بْنُ سَوَّادٍ وَحَرْمَلَةُ قَالَا أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ عَبْدِ اللَّهِ بْنِ عَامِرِ بْنِ رَبِيعَةَ أَخْبَرَهُ أَنَّ أَبَاهُ أَخْبَرَهُ أَنَّهُ رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي السُّبْحَةَ بِاللَّيْلِ فِي السَّفَرِ عَلَى ظَهْرِ رَاحِلَتِهِ حَيْثُ تَوَجَّهَتْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9184,
                "hadithNumber": "1620",
                "englishNarrator": "Anas bin Sirin reported:",
                "hadithEnglish": "We met Anas bin Malik رضی اللہ عنہ as he came to Syria at a place known as 'Ain-al-Tamar and saw him observing prayer on the back of his donkey with his face turned in that direction. (Hammam one of the narrators) pointed towards the left of Qibla, so I said to him: I find you observing prayer towards the side other than that of Qibla. Upon this he said: Had I not seen the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) doing like this, I would not have done so at all.",
                "hadithUrdu": "جب حضرت انس بن مالک رضی اللہ عنہ شام سے آئے تو ہم نے ان کا استقبال کیا ، ہم عین التمر کے مقام پر جا کر ان سے ملے تو میں نے انھیں دیکھا ، وہ گدھے پر نماز پڑھ رہے تھے اور ان کا رخ اس طرف تھا ۔ ہمام نے قبلے کی بائیں طرف اشارہ کیا ۔ تو میں ( انس بن سیرین ) نے ان سے کہا : میں نے آپ کو قبلے کی بائیں طرف نماز پڑھتے دیکھا ہے انھوں نے کہا : اگر میں نے رسول اللہ صلی اللہ علیہ وسلم کو ایسا کرتے ہوئے نہ دیکھا ہوتا تو میں ( کبھی ) ایسا نہ کرتا ۔",
                "urduNarrator": "اور ہم سے محمد بن حاتم نے بیان کیا، کہا ہم سے عفان بن مسلم نے بیان کیا، انہوں نے بیان کیاہمام نے کہا : ہمیں انس بن سیرین نے حدیث بیان کی کہ",
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا أَنَسُ بْنُ سِيرِينَ قَالَ تَلَقَّيْنَا أَنَسَ بْنَ مَالِكٍ حِينَ قَدِمَ الشَّامَ فَتَلَقَّيْنَاهُ بِعَيْنِ التَّمْرِ فَرَأَيْتُهُ يُصَلِّي عَلَى حِمَارٍ وَوَجْهُهُ ذَلِكَ الْجَانِبَ وَأَوْمَأَ هَمَّامٌ عَنْ يَسَارِ الْقِبْلَةِ فَقُلْتُ لَهُ رَأَيْتُكَ تُصَلِّي لِغَيْرِ الْقِبْلَةِ قَالَ لَوْلَا أَنِّي رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَفْعَلُهُ لَمْ أَفْعَلْهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9185,
                "hadithNumber": "1621",
                "englishNarrator": "Ibn 'Umar رضی اللہ  عنہ reported:",
                "hadithEnglish": "When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was in a state of hurry on a journey, he combined the sunset and 'Isha' prayers.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کو جب چلنے کی جلدی ہوتی تو مغرب اور عشاء کی نمازیں جمع کرلیتے ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا: میں نے پڑھا, امام مالک ؒ نے نافع سے اور ا نھوں نے حضرت ابن عمر رضی اللہ  عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا عَجِلَ بِهِ السَّيْرُ جَمَعَ بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ.",
                "headingArabic": "جَوَازِ الْجَمْعِ بَيْنَ الصَّلاَتَيْنِ فِي السَّفَرِ",
                "headingUrdu": "سفر میں دو نمازوں کو جمع کرنا جائز ہے۔",
                "headingEnglish": "It is permissible to combine two prayers when traveling",
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9186,
                "hadithNumber": "1622",
                "englishNarrator": "Nafi' reported:",
                "hadithEnglish": "When Ibn 'Umar رضی اللہ عنہ was in a state of hurry on a journey, he combined the sunset and 'Isha' prayers after the twilight had disappeared, and he would say that when the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was in a state of hurry on a journey, he combined the sunset and 'Isha' prayers.",
                "hadithUrdu": "حضرت عمر رضی اللہ عنہ کو جب ( سفر کے لئے ) جلدی چلنا ہوتا تو شفق ( سورج کی سرخی ) غائب ہونے کے بعد ( یعنی عشاء کاوقت شروع ہونے کے بعد ) مغرب اور عشاء کو جمع کرکے پڑھتے تھے اور بتاتے تھے کہ رسول اللہ صلی اللہ علیہ وسلم کو جب جلد چلنا ہوتا تو آپ صلی اللہ علیہ وسلم مغرب اور عشاء کو جمع کرلیتے تھے ۔",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا، کہا ہم سے یحییٰ نے بیان کیا,عبیداللہ سے روایت ہےکہا : مجھے نافع نے خبردی کہ",
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ قَالَ أَخْبَرَنِي نَافِعٌ أَنَّ ابْنَ عُمَرَ كَانَ إِذَا جَدَّ بِهِ السَّيْرُ جَمَعَ بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ بَعْدَ أَنْ يَغِيبَ الشَّفَقُ وَيَقُولُ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا جَدَّ بِهِ السَّيْرُ جَمَعَ بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9187,
                "hadithNumber": "1623",
                "englishNarrator": "Salim reported from his father to be saying:",
                "hadithEnglish": "I saw the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) combining the sunset and Isha' prayers when he was in a hurry on a journey.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا ، جب آپ کو چلنے کی جلدی ہوتی تو آپ مغرب اور عشاء کو جمع کرلیتے تھے ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ، قتیبہ بن سعید، ابوبکر بن ابی شیبہ اور عمرو ناقد نے بیان کیا، ہم سے ابن عیینہ نے بیان کیا, سفیان نے ( ابن شہاب ) زہری سے ، انھوں نے سالم سے اور انھوں نے اپنے والد ( ابن عمر رضی اللہ عنہ سے ر وایت کی کہ",
                "hadithArabic": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَقُتَيْبَةُ بْنُ سَعِيدٍ وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ كُلُّهُمْ عَنْ ابْنِ عُيَيْنَةَ قَالَ عَمْرٌو حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَجْمَعُ بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ إِذَا جَدَّ بِهِ السَّيْرُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9188,
                "hadithNumber": "1624",
                "englishNarrator": "Salim bin 'Abdullah reported that his father had said:",
                "hadithEnglish": "I saw the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) delaying the sunset prayer till he would combine it with the 'Isha' when he hastened to set out on a journey.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا جب آپ نے سفر میں جلد چلنا ہوتا تو مغرب کی نماز کو موخر کردیتے حتیٰ کہ اسے اور عشاء کی نماز کو جمع کرکرتے ۔",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، مجھ سے ابن وہب نے بیان کیا، انہوں نے کہا, یونس نے ابن شہاب سے روایت کی ، کہا : مجھےسالم بن عبداللہ نے خبر دی کہ ان کے والد نے کہا",
                "hadithArabic": "و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنَ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ أَنَّ أَبَاهُ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَعْجَلَهُ السَّيْرُ فِي السَّفَرِ يُؤَخِّرُ صَلَاةَ الْمَغْرِبِ حَتَّى يَجْمَعَ بَيْنَهَا وَبَيْنَ صَلَاةِ الْعِشَاءِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 8876,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=355",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=353",
                "label": "353",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=354",
                "label": "354",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=355",
                "label": "355",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=356",
                "label": "356",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=357",
                "label": "357",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=358",
                "label": "358",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=359",
                "label": "359",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=357",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=357",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=355",
        "to": 8900,
        "total": 40465
    }
}