{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 567,
        "data": [
            {
                "id": 14439,
                "hadithNumber": "6876",
                "englishNarrator": "Anas رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger (ﷺ) wed to make this supplication: O Allah, I seek refuge in Thee from miserliness, from sloth and from decrepitude.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم یہ دعائیں مانگا کرتے تھے : \" اے اللہ! میں بخل ، سستی ، ذلیل ترین عمر ، قبر کے عذاب اور زندگی اور موت کی آزمائشوں سے تیری پناہ میں آتا ہوں ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن نافع العبدی نے بیان کیا، ہم سے بہز بن اسد العمی نے بیان کیا، ہم سے ہارون الاعور نے بیان کیا, شعیب بن حبحاب نے حضرت انس رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ نَافِعٍ الْعَبْدِيُّ حَدَّثَنَا بَهْزُ بْنُ أَسَدٍ الْعَمِّيُّ حَدَّثَنَا هَارُونُ الْأَعْوَرُ حَدَّثَنَا شُعَيْبُ بْنُ الْحَبْحَابِ عَنْ أَنَسٍ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدْعُو بِهَؤُلَاءِ الدَّعَوَاتِ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْبُخْلِ وَالْكَسَلِ وَأَرْذَلِ الْعُمُرِ وَعَذَابِ الْقَبْرِ وَفِتْنَةِ الْمَحْيَا وَالْمَمَاتِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14440,
                "hadithNumber": "6877",
                "englishNarrator": "It was narrated from Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to seek refuge (in Allah) from the evil of what has been decreed, from misery, from the mockery of (triumphant) enemies, and from severe calamity. `Amr (one of the narrators) said in his narration: Sufyan said: 'I fear I may have added one of them (the phrases).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم انسان کے حق میں برا ثابت ہونے والے فیصلے ، بدبختی کے آ لینے ، اپنی تکلیف پر دشمنوں کے خوش ہونے اور عاجز کر دینے والی آزمائش سے پناہ مانگا کرتے تھے ۔ عمرو نے اپنی حدیث ( کی سند ) میں کہا : سفیان نے کہا : مجھے شک ہے کہ ( شاید ) میں نے ان باتوں میں سے کوئی ایک بات بڑھا دی ہے ۔",
                "urduNarrator": "عمرو ناقد اور زُہیر بن حرب نے مجھے حدیث بیان کی ، انہوں نے کہا : ہمیں سفیان بن عیینہ نے حدیث بیان کی ، انہوں نے کہا : مجھے سُمی نے ابوصالح سے حدیث بیان کی ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي عَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ حَدَّثَنِي سُمَيٌّ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَتَعَوَّذُ مِنْ سُوءِ الْقَضَاءِ وَمِنْ دَرَكِ الشَّقَاءِ وَمِنْ شَمَاتَةِ الْأَعْدَاءِ وَمِنْ جَهْدِ الْبَلَاءِ قَالَ عَمْرٌو فِي حَدِيثِهِ قَالَ سُفْيَانُ أَشُكُّ أَنِّي زِدْتُ وَاحِدَةً مِنْهَا.",
                "headingArabic": "فِي التَّعَوُّذِ مِنْ سُوءِ الْقَضَاءِ وَدَرَكِ الشَّقَاءِ وَغَيْرِهِ",
                "headingUrdu": "برے انجام سے پناہ مانگنا، اور مصیبت وغیرہ",
                "headingEnglish": "Seeking Refuge From A Bad End, And Misery Etc",
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14441,
                "hadithNumber": "6878",
                "englishNarrator": "Khaula bint Hakim Sulamiyya reported:",
                "hadithEnglish": "I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: When anyone lands at a place, and then says: I seek refuge in the Perfect Word of Allah from the evil of what He has created, nothing would harm him until he marches from that stopping place.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا : \" جو شخص کسی ( بھی ) منزل پر اترا اور اس نے یہ کلمات کہے : میں اللہ ( سے اس ) کے مکمل ترین کلمات کی پناہ طلب کرتا ہوں ہر اس چیز کے شر سے جو اس نے پیدا کی ، تو اس شخص کو اس منزل سے چلے جانے تک کوئی چیز نقصان نہیں پہنچائے گی ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ,لیث نے یزید بن ابی حبیب سے اور انہون نے حارث بن یعقوب سے روایت کی کہ یعقوب بن عبداللہ نے انہیں حدیث سنائی ، انہوں نے بسر بن سعید کو یہ کہتے ہوئے سنا ، میں نے سعد بن ابی وقاص رضی اللہ عنہ کو کہتے ہوئے سنا ، کہا : میں نے حضرت خولہ بنت حکیم سلمیہ سے سنا ، وہ کہتی تھیں",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ وَاللَّفْظُ لَهُ أَخْبَرَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ الْحَارِثِ بْنِ يَعْقُوبَ أَنَّ يَعْقُوبَ بْنَ عَبْدِ اللَّهِ حَدَّثَهُ أَنَّهُ سَمِعَ بُسْرَ بْنَ سَعِيدٍ يَقُولُ سَمِعْتُ سَعْدَ بْنَ أَبِي وَقَّاصٍ يَقُولُ سَمِعْتُ خَوْلَةَ بِنْتَ حَكِيمٍ السُّلَمِيَّةَ تَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ نَزَلَ مَنْزِلًا ثُمَّ قَالَ أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ لَمْ يَضُرَّهُ شَيْءٌ حَتَّى يَرْتَحِلَ مِنْ مَنْزِلِهِ ذَلِكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14442,
                "hadithNumber": "6879",
                "englishNarrator": "Khaula bint Hakim Sulamiyya reported:",
                "hadithEnglish": "She heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: When any one of you stays at a place, he should say: I seek refuge in the Perfect Word of Allah from the evil of that He created. Nothing would then do him any harm until he moves from that place.",
                "hadithUrdu": "انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا : \" تم میں سے کوئی شخص جب کسی منزل پر پہنچے تو یہ کلمات کہے : \" میں ہر اس چیز کے شر سے جو اللہ نے پیدا کی ، اس نے مکمل ترین کلمات کی پناہ میں آتا ہوں ، اس طرح وہاں سے کوچ کر جانے تک کوئی بھی چیز اسے نقصان نہیں پہنچائے گی ۔ \"",
                "urduNarrator": "عبداللہ بن وہب نے کہا : ہمیں عمرو بن حارث نے خبر دی کہ یزید بن ابی حبیب اور حارث بن یعقوب نے انہیں یعقوب بن عبداللہ بن اشج سے حدیث بیان کی ، انہوں نے بسر بن سعید سے ، انہوں نے سعد بن ابی وقاص رضی اللہ عنہ سے اور انہوں نے حضرت خولہ بنت حکیم سلمیہ سے روایت کی",
                "hadithArabic": "و حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ وَأَبُو الطَّاهِرِ كِلَاهُمَا عَنْ ابْنِ وَهْبٍ وَاللَّفْظُ لِهَارُونَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ قَالَ وَأَخْبَرَنَا عَمْرٌو وَهُوَ ابْنُ الْحَارِثِ أَنَّ يَزِيدَ بْنَ أَبِي حَبِيبٍ وَالْحَارِثَ بْنَ يَعْقُوبَ حَدَّثَاهُ عَنْ يَعْقُوبَ بْنِ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ عَنْ بُسْرِ بْنِ سَعِيدٍ عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ عَنْ خَوْلَةَ بِنْتِ حَكِيمٍ السُّلَمِيَّةِ أَنَّهَا سَمِعَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا نَزَلَ أَحَدُكُمْ مَنْزِلًا فَلْيَقُلْ أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ فَإِنَّهُ لَا يَضُرُّهُ شَيْءٌ حَتَّى يَرْتَحِلَ مِنْهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14443,
                "hadithNumber": "6880",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "A person came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and said: Allah's Messenger, I was stung by a scorpion during the night. Thereupon he said: Had you recited these words in the evening: I seek refuge in the Perfect Word of Allah from the evil of what He created, it would not have done any harm to you.",
                "hadithUrdu": "ایک شخص نبی صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کی : اللہ کے رسول! مجھے اس بچھو سے کتنی شدید تکلیف پہنچی جس نے کل رات مجھے کاٹ لیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" اگر تم  شام کے وقت یہ ( کلمات ) کہہ دیتے : میں ہر اس چیز کے شر سے جسے اللہ نے پیدا کیا ، اس کے کامل ترین کلمات کی پناہ میں آتا ہوں تو وہ ( بچھو ) تمہیں کوئی نقصان نہ پہنچاتا ۔ \"",
                "urduNarrator": "یعقوب نے کہا : قعقاع بن حکیم نے ذوان سے ، انہوں نے ابوصالح سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ انہوں نے کہا",
                "hadithArabic": "قَالَ يَعْقُوبُ وَقَالَ الْقَعْقَاعُ بْنُ حَكِيمٍ عَنْ ذَكْوَانَ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ أَنَّهُ قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ مَا لَقِيتُ مِنْ عَقْرَبٍ لَدَغَتْنِي الْبَارِحَةَ قَالَ أَمَا لَوْ قُلْتَ حِينَ أَمْسَيْتَ أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ لَمْ تَضُرَّكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14444,
                "hadithNumber": "6881",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ said:",
                "hadithEnglish": "\"A man said: \"O Messenger of Allah, A scorpion stung me last night...\"A hadith like that of Ibn Wahb.",
                "hadithUrdu": "ایک شخص نے کہا : اللہ کے رسول! مجھے بچھو نے کاٹ لیا ۔ ( آگے ) ابن وہب کی حدیث کے مانند ہے ۔",
                "urduNarrator": "اور مجھ سے عیسیٰ بن حماد المصری نے بیان کیا, لیث نے یزید بن ابی حبیب سے ، انہوں نے جعفر سے ، انہوں نے یعقوب سے روایت کی ، انہوں نے ان کو بتایا کہ غطفان کے آزاد کردہ غلام ابوصالح نے انہیں بتایا ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا ، کہتے تھے",
                "hadithArabic": "و حَدَّثَنِي عِيسَى بْنُ حَمَّادٍ الْمِصْرِيُّ أَخْبَرَنِي اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ جَعْفَرٍ عَنْ يَعْقُوبَ أَنَّهُ ذَكَرَ لَهُ أَنَّ أَبَا صَالِحٍ مَوْلَى غَطَفَانَ أَخْبَرَهُ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَجُلٌ يَا رَسُولَ اللَّهِ لَدَغَتْنِي عَقْرَبٌ بِمِثْلِ حَدِيثِ ابْنِ وَهْبٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14445,
                "hadithNumber": "6882",
                "englishNarrator": "Al-Bara' bin 'Azib رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's, Messenger ﷺ said: When you go to bed, perform ablution as is done for prayer; then lie down on the right side and recite: O Allah, I turn my face towards Thee and entrust my affair to Thee. I retreat unto Thee for protection with hope in Thee and fear of Thee. There is no resort and no deliverer (from hardship) but Thou only. I affirm my faith in Thine books which Thou revealed and in Thine Apostles whom Thou sent. Make this as the last word of yours (when you go to sleep) and in case you die during that night, you would die upon Fitra (upon Islam). And as I repeated these words in order to commit them to memory, I said: I affirm my faith in Thy Messenger (Rasul) whom Thou sent. He said: Say: I affirm my faith in the Apostle (Nabi) whom Thou sent.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" جب تم اپنے بستر پر جانے لگو تو اپنی نماز کے وضو کی طرح وضو کرو ، پھر اپنی دائیں کروٹ لیٹو ، پھر یہ کہو : \"\" اے اللہ! میں نے اپنا چہرہ تیرے سپرد کر دیا اور اپنا معاملہ تیرے حوالے کر دیا اور اپنی کمر تیرے سہارے پر ٹکا دی ، یہ سب سے امید اور تیرے خوف کے ساتھ کیا ۔ تیرے سوا تجھ سے نہ کہیں پناہ مل سکتی ہے ، نہ نجات حاصل ہو سکتی ہے ۔ میں تیری کتاب پر ایمان لایا جو تو نے نازل کی اور تیرے نبی پر ایمان لایا جسے تو نے مبعوث کیا ۔ ان کلمات کو تم ( اپنی زبان سے ادا ہونے والے ) آخری کلمات بنا لو ( ان کے بعد اور کچھ نہ بولو ) تو اس رات اگر تمہیں موت آ گئی تو فطرت پر موت آئے گی ۔ \"\" ( حضرت براء بن عازب رضی اللہ عنہ نے ) کہا : میں نے ان کلمات کو یاد کرنے کے لیے انہیں دہرایا تو کہا : \"\" میں تیرے رسول پر ایمان لایا جسے تو نے بھیجا \"\" تو آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" ( یوں ) کہو : میں تیرے نبی پر ایمان لایا جسے تو نے بھیجا ۔ \"\"",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ اور اسحاق بن ابراہیم نے بیان کیا اور یہ لفظ عثمان کے لیے ہے۔ ہم سے اسحاق نے بیان کیا اور عثمان نے کہا کہ جریر نے بیان کیا, منصور نے سعد بن عبیدہ سے روایت کی ، انہوں نے کہا : مجھے حضرت براء بن عازب رضی اللہ عنہ نے حدیث بیان کی کہ",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ وَاللَّفْظُ لِعُثْمَانَ قَالَ إِسْحَقُ أَخْبَرَنَا و قَالَ عُثْمَانُ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ سَعْدِ بْنِ عُبَيْدَةَ حَدَّثَنِي الْبَرَاءُ بْنُ عَازِبٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا أَخَذْتَ مَضْجَعَكَ فَتَوَضَّأْ وُضُوءَكَ لِلصَّلَاةِ ثُمَّ اضْطَجِعْ عَلَى شِقِّكَ الْأَيْمَنِ ثُمَّ قُلْ اللَّهُمَّ إِنِّي أَسْلَمْتُ وَجْهِي إِلَيْكَ وَفَوَّضْتُ أَمْرِي إِلَيْكَ وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ رَغْبَةً وَرَهْبَةً إِلَيْكَ لَا مَلْجَأَ وَلَا مَنْجَا مِنْكَ إِلَّا إِلَيْكَ آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ وَاجْعَلْهُنَّ مِنْ آخِرِ كَلَامِكَ فَإِنْ مُتَّ مِنْ لَيْلَتِكَ مُتَّ وَأَنْتَ عَلَى الْفِطْرَةِ قَالَ فَرَدَّدْتُهُنَّ لِأَسْتَذْكِرَهُنَّ فَقُلْتُ آمَنْتُ بِرَسُولِكَ الَّذِي أَرْسَلْتَ قَالَ قُلْ آمَنْتُ بِنَبِيِّكَ الَّذِي أَرْسَلْتَ.",
                "headingArabic": "الدعاء عند النوم",
                "headingUrdu": "سونے کے وقت کی دعا",
                "headingEnglish": "Supplication When Going To Sleep",
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14446,
                "hadithNumber": "6883",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been transmitted on the authority of al-Bara' bin 'Azib رضی اللہ عنہ with a slight variation of wording and there is this addition in the hadith transmitted on the authority of Husain: In case you get up in the morning, you will get up with bliss.",
                "hadithUrdu": "اور ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا، کہا کہ ہم سے عبداللہ، یعنی ابن ادریس نے بیان کیا، انہوں نے کہا:حُصین بن سعد بن عبیدہ سے ، انہوں نے حضرت براء بن عازب رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے یہ حدیث روایت کی ، مگر منصور نے زیادہ مکمل حدیث بیان کی اور حصین کی حدیث میں یہ اضافہ کیا : \" اگر یہ ( کہنے والا ) صبح کرے گا تو خیر حاصل کرے گا ۔ \"",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا عَبْدُ اللَّهِ يَعْنِي ابْنَ إِدْرِيسَ قَالَ سَمِعْتُ حُصَيْنًا عَنْ سَعْدِ بْنِ عُبَيْدَةَ عَنْ الْبَرَاءِ بْنِ عَازِبٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْحَدِيثِ غَيْرَ أَنَّ مَنْصُورًا أَتَمُّ حَدِيثًا وَزَادَ فِي حَدِيثِ حُصَيْنٍ وَإِنْ أَصْبَحَ أَصَابَ خَيْرًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14447,
                "hadithNumber": "6884",
                "englishNarrator": "Al-Bara' bin 'Azib رضی اللہ عنہ سreported:",
                "hadithEnglish": "Allah's Messenger (ﷺ) commanded a person (in these words): When you go to bed during night, you should say: O Allah, I surrender myself to Thee and entrust my affair to Thee, with hope in Thee and fear of Thee. There is no resort and no deliverer (from hardship but Thou). I affirm my faith in the Book which Thou revealed and in the Messengers whom Thou sent. If you die in this state you would die on Fitra, and Ibn Bashr did not make a mention of night in this hadith.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ایک شخص کو حکم دیا کہ جب وہ رات کو اپنی خواب گاہ میں جانے لگے تو ( دعا کرتے ہوئے ) یہ کہے : \" اے اللہ! میں نے اپنی جان تیرے سپرد کر دی اور اپنا چہرہ تیری طرف متوجہ کر لیا اور اپنی کمر تیرے سہارے پر ٹکا دی اور اپنا معاملہ تیرے حوالے کر دیا ، یہ سب تجھی سے امید کرتے ہوئے اور تجھی سے ڈرتے ہوئے کیا ۔ تجھ سے خوف تیرے سوا نہ پناہ کی کوئی جگہ ہے نہ نجات کی ۔ میں تیری کتاب پر ایمان لایا جو تو نے نازل کی اور تیرے رسول پر ایمان لایا جسے تو نے بھیجا ، پھر اگر ( اس رات ) اسے موت آ گئی تو فطرت پر موت آئے گی ۔ \" ابن بشار نے اپنی حدیث میں : \" رات کے وقت \" ( بستر پر جانے لگے ) کے الفاظ نہیں کہے ۔",
                "urduNarrator": "محمد بن مثنیٰ نے ابوداود سے اور ابن بشار نے عبدالرحمٰن اور ابوداود دونوں سے روایت کی ، دونوں نے کہا : ہمیں شعبہ نے عمروہ بن مرہ سے حدیث سنائی ، انہوں نے کہا: میں نے سعد بن عبیدہ سے سنا ، وہ حضرت براء بن عازب رضی اللہ عنہ سے روایت کر رہے تھے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا أَبُو دَاوُدَ حَدَّثَنَا شُعْبَةُ و حَدَّثَنَا ابْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ وَأَبُو دَاوُدَ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ قَالَ سَمِعْتُ سَعْدَ بْنَ عُبَيْدَةَ يُحَدِّثُ عَنْ الْبَرَاءِ بْنِ عَازِبٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ رَجُلًا إِذَا أَخَذَ مَضْجَعَهُ مِنْ اللَّيْلِ أَنْ يَقُولَ اللَّهُمَّ أَسْلَمْتُ نَفْسِي إِلَيْكَ وَوَجَّهْتُ وَجْهِي إِلَيْكَ وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ وَفَوَّضْتُ أَمْرِي إِلَيْكَ رَغْبَةً وَرَهْبَةً إِلَيْكَ لَا مَلْجَأَ وَلَا مَنْجَا مِنْكَ إِلَّا إِلَيْكَ آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ وَبِرَسُولِكَ الَّذِي أَرْسَلْتَ فَإِنْ مَاتَ مَاتَ عَلَى الْفِطْرَةِ وَلَمْ يَذْكُرْ ابْنُ بَشَّارٍ فِي حَدِيثِهِ مِنْ اللَّيْلِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14448,
                "hadithNumber": "6885",
                "englishNarrator": "This hadith has been transmitted on the authority of al-Bara' bin 'Azib رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم) said to a person: O, so and so, as you go to your bed; the rest of the hadith is the same but with this variation of wording that he said: Thine Apostle whom Thou sent. If you die that night you would die on Fitra and if you get up in the morning you would get up with a bliss.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ایک شخص سے فرمایا : \" اے فلاں! جب تم اپنے بستر پر لیٹنے لگو ۔ ۔ ۔ \" اس کے بعد عمرو بن مرہ کی حدیث کے مانند ہے ۔ ( مگر ابو احوص نے منصور کی روایت کی طرح ) یہ الفاظ کہے : \" ( اور میں ایمان لایا ) تیرے نبی پر جسے تو نے بھیجا ، پھر اگر تم اس رات مر گئے تو ( عین ) فطرت پر مرو گے اور اگر تم نے ( زندہ حالت میں ) صبح کر لی تو خیر ( و بھلائی ) حاصل کرو گے ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا, اس نے ہمیں بتایا: ابو احوص نے ابواسحٰق سے اور انہوں نے حضرت براء بن عازب رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِرَجُلٍ يَا فُلَانُ إِذَا أَوَيْتَ إِلَى فِرَاشِكَ بِمِثْلِ حَدِيثِ عَمْرِو بْنِ مُرَّةَ غَيْرَ أَنَّهُ قَالَ وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ فَإِنْ مُتَّ مِنْ لَيْلَتِكَ مُتَّ عَلَى الْفِطْرَةِ وَإِنْ أَصْبَحْتَ أَصَبْتَ خَيْرًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14449,
                "hadithNumber": "6886",
                "englishNarrator": "This hadith has been transmitted on the authority of al-Bara' bin 'Azib رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم) commanded a person (in these words) and there is no mention of this: if you get up in the morning you would get up with a bliss.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ایک شخص کو حکم دیا ، اسی کے مانند ، اور انہوں نے \" اگر تم نے ( زندہ حالت میں ) صبح کی تو خیر حاصل کرو گے \" کے الفاظ بیان نہیں کیے ۔",
                "urduNarrator": "ہم سے ابن المثنیٰ اور ابن بشار نے بیان کیا، کہا: ہم سے محمد بن جعفر نے بیان کیا, شعبہ نے ابواسحٰق سے روایت کی کہ انہوں نے حضرت براء بن عازب رضی اللہ عنہ کو کہتے ہوئے سنا",
                "hadithArabic": "حَدَّثَنَا ابْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ أَنَّهُ سَمِعَ الْبَرَاءَ بْنَ عَازِبٍ يَقُولُ أَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا بِمِثْلِهِ وَلَمْ يَذْكُرْ وَإِنْ أَصْبَحْتَ أَصَبْتَ خَيْرًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14450,
                "hadithNumber": "6887",
                "englishNarrator": "Al-Bara' رضی اللہ عنہ reported:",
                "hadithEnglish": "Whenever Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) went to bed, he said: O Allah, it is with Thine Name that I live and it is with Thine Name that I die. And when he got up he used to say: Praise is due to Allah, Who gave us life after our death (sleep) and unto Thee is resurrection.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم جب بستر پر تشریف لے جاتے تو یہ دعا کرتے : \" اے اللہ! میں تیرے نام سے جیتا ہوں اور تیرے نام سے وفات پاؤں گا \" اور جب بیدار ہوتے تو فرماتے : \" اللہ کی حمد ہے جس نے ہمیں وفات دینے کے بعد زندہ کر دیا اور اسی کی طرف ( قیامت کے روز ) زندہ ہو کر جاتا ہے ۔ \"",
                "urduNarrator": "ہم سے عبید اللہ بن معاذ نے بیان کیا، ہم سے ابی نے بیان کیا، ہم سے شعبہ نے بیان کیا، ان سے عبداللہ بن ابی الصفر نے، وہ ابوبکر بن ابی موسیٰ رضی اللہ عنہ سے, حضرت براء بن عازب رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي السَّفَرِ عَنْ أَبَي بَكْرِ بْنِ أَبِي مُوسَى عَنْ الْبَرَاءِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَخَذَ مَضْجَعَهُ قَالَ اللَّهُمَّ بِاسْمِكَ أَحْيَا وَبِاسْمِكَ أَمُوتُ وَإِذَا اسْتَيْقَظَ قَالَ الْحَمْدُ لِلَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14451,
                "hadithNumber": "6888",
                "englishNarrator": "Abdullah bin 'Umar رضی اللہ عنہ commanded:",
                "hadithEnglish": "A person that as he went to bed, he should say: O Allah, Thou created my being and it is for Thee to take it to its ultimate goal. And its death and life is due to Thee, and if Thou givest it life, safeguard it; and if Thou bringst death, grant it pardon. O Allah, I beg of Thee safety. A person said to him: Did you hear it from Umar? Thereupon he said: (I have heard from one) who is better than Umar رضی اللہ عنہ , viz. from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). Ibn Nafi, reported this on the authority of Abdullah bin Harith but he did not make mention of this that he heard it himself .",
                "hadithUrdu": "انہوں نے ایک شخص سے کہا کہ جب وہ اپنے بستر پر جائے تو یہ دعا کرے : \"\" اے اللہ! میری جان کو تو نے پیدا کیا اور تو ہی اس کو موت دے گا ، اس جان کی موت بھی اور زندگی بھی تیرے ہی لیے ہے ، اگر تو اس کو زندہ رکھے تو اس کی حفاظت فرمانا اور اگر تو اس کو موت دے تو اس کی مغفرت کرنا ، اے اللہ! میں تجھ سے عافیت مانگتا ہوں ۔ \"\" ایک شخص نے حضرت عبداللہ بن عمر رضی اللہ عنہ سے پوچھا : کیا آپ نے یہ حدیث حضرت عمر رضی اللہ عنہ سے سنی ہے؟ انہوں نے کہا : ان سے جو حضرت عمر سے زیادہ افضل ہیں ( میں نے یہ حدیث ) رسول اللہ صلی اللہ علیہ وسلم سے ( سنی ہے ۔ ) ابن نافع نے اپنی روایت میں کہا : عبداللہ بن حارث سے روایت ہے ، یہ نہیں کہا : میں نے سنا ۔",
                "urduNarrator": "عقبہ بن مُکرم اور ابوبکر بن نافع نے کہا : ہمیں غندر نے حدیث بیان کی ، انہوں نے کہا : ہمیں شعبہ نے خالد سے حدیث سنائی ، انہوں نے کہا : میں نے عبداللہ بن حارث کو حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت کرتے ہوئے سنا",
                "hadithArabic": "حَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ الْعَمِّيُّ وَأَبُو بَكْرِ بْنُ نَافِعٍ قَالَا حَدَّثَنَا غُنْدَرٌ حَدَّثَنَا شُعْبَةُ عَنْ خَالِدٍ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ الْحَارِثِ يُحَدِّثُ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّهُ أَمَرَ رَجُلًا إِذَا أَخَذَ مَضْجَعَهُ قَالَ اللَّهُمَّ خَلَقْتَ نَفْسِي وَأَنْتَ تَوَفَّاهَا لَكَ مَمَاتُهَا وَمَحْيَاهَا إِنْ أَحْيَيْتَهَا فَاحْفَظْهَا وَإِنْ أَمَتَّهَا فَاغْفِرْ لَهَا اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فَقَالَ لَهُ رَجُلٌ أَسَمِعْتَ هَذَا مِنْ عُمَرَ فَقَالَ مِنْ خَيْرٍ مِنْ عُمَرَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ابْنُ نَافِعٍ فِي رِوَايَتِهِ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ وَلَمْ يَذْكُرْ سَمِعْتُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14452,
                "hadithNumber": "6889",
                "englishNarrator": "Suhail reported:",
                "hadithEnglish": "Abu Salih used to command us (in these words): When any one of you intends to go to sleep, he should lie on the bed on his right side and then say: O Allah. the Lord of the Heavens and the Lord of the Earth and Lord of the Magnificent Throne, our Lord, and the Lord of evervthina, the Splitter of the grain of corn and the datestone (or fruit kernal), the Revealer of Torah and Injil (Bible) and Criterion (the Holy Qur'an), I seek refuge in Thee from the evil of every- thing Thou art to sieze by the forelock (Thou hast perfect control over it). O Allah, Thou art the First, there is naught before Thee, and Thou art the Last and there is naught after Thee, and Thou art Evident and there is nothing above Thee, and Thou art Innermost and there is nothing beyond Thee. Remove the burden of debt from us and relieve us from want. Abu Salih used to narrate it from Abu Huraira who narrated it from Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ).",
                "hadithUrdu": "جب ہم میں سے کوئی شخص سونے کا ارادہ کرے تو بستر پر دائیں کروٹ لیٹے ، پھر دعا کرے : اے اللہ! اے آسمانوں کے رب اور زمین کے رب اور عرش عظیم کے رب ، اے ہمارے رب اور ہر چیز کے رب ، دانے اور گٹھلیوں کو چیر ( کر پودے اور درخت اگا ) دینے والے! تورات ، انجیل اور فرقان کو نازل کرنے والے! میں ہر اس چیز کے شر سے تیری پناہ میں آتا ہوں جس کی پیشانی تیرے قبضے میں ہے ، اے اللہ! تو ہی اول ہے ، تجھ سے پہلے کوئی شے نہیں ، اے اللہ! تو ہی آخر ہے ، تیرے بعد کوئی شے نہیں ہے ، تو ہی ظاہر ہے ، تیرے اوپر کوئی شے نہیں ہے ، تو ہی باطن ہے ، تجھ سے پیچھے کوئی شے نہیں ہے ، ہماری طرف سے ( ہمارا ) قرض ادا کر اور ہمیں فقر سے غنا عطا فرما ۔ وہ اس حدیث کو ابوہریرہ رضی اللہ عنہ سے اور وہ ( آگے ) اسے رسول اللہ صلی اللہ علیہ وسلم سے روایت کرتے تھے ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا, جریر نے سہیل سے روایت کی ، انہوں نے کہا : ( میرے والد ) ابوصالح ہمیں حکم دیا کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ عَنْ سُهَيْلٍ قَالَ كَانَ أَبُو صَالِحٍ يَأْمُرُنَا إِذَا أَرَادَ أَحَدُنَا أَنْ يَنَامَ أَنْ يَضْطَجِعَ عَلَى شِقِّهِ الْأَيْمَنِ ثُمَّ يَقُولُ اللَّهُمَّ رَبَّ السَّمَاوَاتِ وَرَبَّ الْأَرْضِ وَرَبَّ الْعَرْشِ الْعَظِيمِ رَبَّنَا وَرَبَّ كُلِّ شَيْءٍ فَالِقَ الْحَبِّ وَالنَّوَى وَمُنْزِلَ التَّوْرَاةِ وَالْإِنْجِيلِ وَالْفُرْقَانِ أَعُوذُ بِكَ مِنْ شَرِّ كُلِّ شَيْءٍ أَنْتَ آخِذٌ بِنَاصِيَتِهِ اللَّهُمَّ أَنْتَ الْأَوَّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ وَأَنْتَ الْآخِرُ فَلَيْسَ بَعْدَكَ شَيْءٌ وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَيْءٌ اقْضِ عَنَّا الدَّيْنَ وَأَغْنِنَا مِنْ الْفَقْرِ وَكَانَ يَرْوِي ذَلِكَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14453,
                "hadithNumber": "6890",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to command us that as we go to our bed, we should utter the words (as mentioned above) and he also said (these words): From the evil of every animal, Thou hast hold upon its forelock (Thou bast full control over it).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ہمیں یہ حکم دیا کرتے تھے کہ جب ہم اپنے بستروں پر لیٹیں تو یہ دعا کریں ، جریر کی حدیث کے مانند ( اور خالد طحان نے \" ہر اس چیز کے شر سے \" کے بجائے ) کہا : \" ہر اس جاندار کے شر سے ( تیری پناہ چاہتا ہوں ) جسے تو نے اس کی پیشانی سے پکڑا ہوا ہے ۔ \"",
                "urduNarrator": "مجھ سے عبد الحمید بن بیان الو سطی نے بیان کیا، ہم سے خالد نے بیان کیا, خالد طحان نے سہیل سے ، انہوں نے اپنے والد سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا خالد طحان نے سہیل سے ، انہوں نے اپنے والد سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنِي عَبْدُ الْحَمِيدِ بْنُ بَيَانٍ الْوَاسِطِيُّ حَدَّثَنَا خَالِدٌ يَعْنِي الطَّحَّانَ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُنَا إِذَا أَخَذْنَا مَضْجَعَنَا أَنْ نَقُولَ بِمِثْلِ حَدِيثِ جَرِيرٍ وَقَالَ مِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14454,
                "hadithNumber": "6891",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Fatima رضی اللہ عنہا (the daughter of the Holy Prophet) came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and asked for a servant. He said to her: Say: O Allah, the Lord of the seven heavens; the rest of the hadith is the same.",
                "hadithUrdu": "حضرت فاطمہ رضی اللہ عنہا نبی صلی اللہ علیہ وسلم کے پاس ایک خادم مانگنے کے لیے آئیں تو آپ صلی اللہ علیہ وسلم نے ( جواب میں ) ان سے کہا : \" ( بیٹی! ) تم کہا کرو : اے اللہ! ساتوں آسمانوں کے رب! \" جس طرح سہیل نے اپنے والد ( ابوصالح ) سے روایت کی ۔",
                "urduNarrator": "ہم سے ابو کریب محمد بن العلاء نے بیان کیا، کہا ہم سے ابو اسامہ ایچ نے بیان کیا، کہا کہ ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، انہوں نے کہا ابن ابو عبیدہ نے، کہا ہم دونوں کو میرے والد نے بیان کیا, اعمش نے ابوصالح سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا أَبُو أُسَامَةَ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا ابْنُ أَبِي عُبَيْدَةَ حَدَّثَنَا أَبِي كِلَاهُمَا عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ أَتَتْ فَاطِمَةُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَسْأَلُهُ خَادِمًا فَقَالَ لَهَا قُولِي اللَّهُمَّ رَبَّ السَّمَاوَاتِ السَّبْعِ بِمِثْلِ حَدِيثِ سُهَيْلٍ عَنْ أَبِيهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14455,
                "hadithNumber": "6892",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as say- ing: When any one of you goes to bed, he should take hold of the hem of his lower garment and then should clean (his bed) with the help of that and then should recite the name of Allah for he himself does tiot know what he left behind him on his bed, and when he intends to lie on bed, he should lie on his right side and utter these words: Hallowed be Allah, my Lord. It is with Thine (grace) that I place my side (upon the bed) and it is with Thee that I take it up (after sleep), and in case Thou withholdst my being (if thou causest me to die), then grant pardon to my being, and if Thou keepst (this process of breathing on), then protect it with that with which Thou protected Thine pious servants.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم میں سے کوئی شخص اپنے بستر پر لیٹنا چاہے تو اپنے تہبند کا اندرونی حصہ لے کر اس سے اپنے بستر کو جھاڑے ، پھر بسم اللہ کہے کیونکہ وہ نہیں جانتا کہ اس ( کے اٹھ جانے ) کے بعد اس کے بستر پر ( مخلوقات میں سے ) کون آیا؟ پھر جب لیٹنا چاہے تو اپنی دائیں کروٹ لیٹے اور کہے : \" میرے پروردگار! تو ( ہر نا شایان بات سے ) پاک ہے ، میں نے تیرے ( حکم ) سے اپنا پہلو ( بستر پر ) رکھا اور تیرے ہی حک سے اسے اٹھاؤں گا اگر تو نے میری روح کو ( اپنے پاس ) روک لیا تو اس کی مغفرت کر دینا اور اگر تو نے اسے ( واپس ) بھیج دیا تو اس کی اسی طرح حفاظت فرمانا جس طرح تو اپنے نیک بندوں کی حفاظت فرماتا ہے ۔ \"",
                "urduNarrator": "اور ہم سے اسحاق بن موسیٰ الانصاری نے بیان کیا, انس بن عیاض نے کہا , ہمیں عبیداللہ نے حدیث بیان کی ، انہوں نے کہا : مجھے سعید بن ابی سعید مقبری نے اپنے والد سے حدیث بیان کی ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنَا إِسْحَقُ بْنُ مُوسَى الْأَنْصَارِيُّ حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ حَدَّثَنَا عُبَيْدُ اللَّهِ حَدَّثَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ الْمَقْبُرِيُّ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا أَوَى أَحَدُكُمْ إِلَى فِرَاشِهِ فَلْيَأْخُذْ دَاخِلَةَ إِزَارِهِ فَلْيَنْفُضْ بِهَا فِرَاشَهُ وَلْيُسَمِّ اللَّهَ فَإِنَّهُ لَا يَعْلَمُ مَا خَلَفَهُ بَعْدَهُ عَلَى فِرَاشِهِ فَإِذَا أَرَادَ أَنْ يَضْطَجِعَ فَلْيَضْطَجِعْ عَلَى شِقِّهِ الْأَيْمَنِ وَلْيَقُلْ سُبْحَانَكَ اللَّهُمَّ رَبِّي بِكَ وَضَعْتُ جَنْبِي وَبِكَ أَرْفَعُهُ إِنْ أَمْسَكْتَ نَفْسِي فَاغْفِرْ لَهَا وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14456,
                "hadithNumber": "6893",
                "englishNarrator": "This hadith has been narrated on the authority of Ubaidullah bin Umar with the same chain of transmitters and he said: Then utter:",
                "hadithEnglish": "My Lord. with Thine name I place my side and if Thou keepest me alive have mercy upon myself",
                "hadithUrdu": "تیرے نام سے اے پروردگار! میں نے اپنا پہلو ٹکایا ، اگر تو نے میری جان کو زندہ کیا تو اس پر رحمت فرمانا ۔ \"",
                "urduNarrator": "ہم سے ابو کریب نے بیان کیا, عبدہ نے عبیداللہ بن عمر سے اسی سند کے ساتھ یہی حدیث روایت کی اور کہا : \" پھر وہ یہ ہے",
                "hadithArabic": "و حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا عَبْدَةُ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ بِهَذَا الْإِسْنَادِ وَقَالَ ثُمَّ لْيَقُلْ بِاسْمِكَ رَبِّي وَضَعْتُ جَنْبِي فَإِنْ أَحْيَيْتَ نَفْسِي فَارْحَمْهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14457,
                "hadithNumber": "6894",
                "englishNarrator": "Anas رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When you go to bed, say: Praise is due to Allah Who fed us, provided us drink, sufficed us and provided us with shelter, for many a people there is none to suffice and none to provide shelter.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم جب بستر پر جاتے تو فرماتے : \" اللہ تعالیٰ کی حمد ہے جس نے ہمیں کھلایا ، پلایا ، ( ہر طرح سے ) کافی ہوا اور ہمیں ٹھکانا دیا ۔ کتنے لوگ ہیں جن کا نہ کوئی کفایت کرنے والا ہے نہ ٹھکانہ دینے والا ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے یزید بن ہارون نے بیان کیا، حماد بن سلمہ نے ثابت کی سند سے, حضرت انس رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ عَنْ حَمَّادِ بْنِ سَلَمَةَ عَنْ ثَابِتٍ عَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَوَى إِلَى فِرَاشِهِ قَالَ الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا وَكَفَانَا وَآوَانَا فَكَمْ مِمَّنْ لَا كَافِيَ لَهُ وَلَا مُؤْوِيَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14458,
                "hadithNumber": "6895",
                "englishNarrator": "Farwa' bin Naufal Ashja'i reported:",
                "hadithEnglish": "I asked: 'A'isha رضی اللہ عنہا, in what words did Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) supplicate Allah? She said that he used to utter: I seek refuge in Thee from the evil of what I did and from the evil of what I did not. Farwa' bin Naufal Ashja'i reported: I asked: 'A'isha رضی اللہ عنہا, in what words did Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) supplicate Allah? She said that he used to utter: I seek refuge in Thee from the evil of what I did and from the evil of what I did not.",
                "hadithUrdu": "میں نے ام المومنین حضرت عائشہ رضی اللہ عنہا سے سوال کیا کہ رسول اللہ صلی اللہ علیہ وسلم اللہ تعالیٰ سے کیا دعائیں کیا کرتے تھے؟ حضرت عائشہ رضی اللہ عنہا نے کہا : آپ صلی اللہ علیہ وسلم دعا کیا کرتے تھے : \" اے اللہ! جو میں نے کیا اس کے شر سے اور جو میں نے نہیں کیا ، اس کے شر سے تیری پناہ میں آتا ہوں ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ اور اسحاق بن ابراہیم نے بیان کیا، اور یہ قول یحییٰ کا ہے، انہوں نے کہا: ہم سے جریر نے بیان کیا, منصور نے ہلال سے اور انہوں نے فروہ بن نوفل اشجعی سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَإِسْحَقُ بْنُ إِبْرَاهِيمَ وَاللَّفْظُ لِيَحْيَى قَالَا أَخْبَرَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ هِلَالٍ عَنْ فَرْوَةَ بْنِ نَوْفَلٍ الْأَشْجَعِيِّ قَالَ سَأَلْتُ عَائِشَةَ عَمَّا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدْعُو بِهِ اللَّهَ قَالَتْ كَانَ يَقُولُ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا عَمِلْتُ وَمِنْ شَرِّ مَا لَمْ أَعْمَلْ.",
                "headingArabic": "في الأدعية",
                "headingUrdu": "دعائیں [رسول اللہ صلی اللہ علیہ وسلم]",
                "headingEnglish": "Supplications [Of The Prophet (SAW)]",
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14459,
                "hadithNumber": "6896",
                "englishNarrator": "Farwa' bin Naufal reported:",
                "hadithEnglish": "I asked 'A'isha رضی اللہ عنہا about the supplication that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) made. She said that he used to say: O Allah, I seek refuge in Thee from the evil of what I have done and from the evil of what I have not done.",
                "hadithUrdu": "میں نے حضرت عائشہ رضی اللہ عنہا سے سوال کیا کہ رسول اللہ صلی اللہ علیہ وسلم کیا دعا فرمایا کرتے تھے؟ حضرت عائشہ رضی اللہ عنہا نے کہا : آپ یہ دعا فرمایا کرتے تھے : \" اے اللہ! میں نے جو کام کیے ہیں ، ان کے شر سے اور جو کام میں نے نہیں کیے ، ان کے شر سے تیری پناہ چاہتا ہوں ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، کہا: عبداللہ بن ادریس نے حصین سے ، انہوں نے ہلال سے اور انہوں نے فروہ بن نوفل سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ حُصَيْنٍ عَنْ هِلَالٍ عَنْ فَرْوَةَ بْنِ نَوْفَلٍ قَالَ سَأَلْتُ عَائِشَةَ عَنْ دُعَاءٍ كَانَ يَدْعُو بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ كَانَ يَقُولُ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا عَمِلْتُ وَشَرِّ مَا لَمْ أَعْمَلْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14460,
                "hadithNumber": "6897",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Muhammad bin ja'far through another chain of transmitters.",
                "hadithUrdu": "ہم سے محمد بن المثنی اور ابن بشار نے بیان کیا، انہوں نے کہا: ابن ابی عدی اور محمد بن جعفر دونوں نے شعبہ سے اور انہوں نے حصین سے اسی سند کے ساتھ اسی کے مانند روایت کی ، مگر محمد بن جعفر کی حدیث میں ( وشر ما لم اعمل کے بجائے ) و من شر ما لم اعمل ہے ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ ح و حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرِو بْنِ جَبَلَةَ حَدَّثَنَا مُحَمَّدٌ يَعْنِي ابْنَ جَعْفَرٍ كِلَاهُمَا عَنْ شُعْبَةَ عَنْ حُصَيْنٍ بِهَذَا الْإِسْنَادِ مِثْلَهُ غَيْرَ أَنَّ فِي حَدِيثِ مُحَمَّدِ بْنِ جَعْفَرٍ وَمِنْ شَرِّ مَا لَمْ أَعْمَلْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14461,
                "hadithNumber": "6898",
                "englishNarrator": "Farwa' bin Naufal reported on the authority of 'A'isha رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to supplicate (in these words): O Allah, I seek refuge in Thee from the evil of what I did and from the evil of what I did not.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم اپنی دعا میں فرماتے تھے : \" اے اللہ! میں ان کاموں کے شر سے جو میں نے کیے اور ان کے شر سے جو نہیں کیے ، تیری پناہ میں آتا ہوں ۔ \"",
                "urduNarrator": "مجھ سے عبداللہ بن ہاشم نے بیان کیا، ہم سے وکیع نے بیان کیا، الاوزاعی کی سند سے, عبدہ بن ابولبابہ نے ہلال بن سیاف سے ، انہوں نے فروہ بن نوفل سے اور انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنِي عَبْدُ اللَّهِ بْنُ هَاشِمٍ حَدَّثَنَا وَكِيعٌ عَنْ الْأَوْزَاعِيِّ عَنْ عَبْدَةَ بْنِ أَبِي لُبَابَةَ عَنْ هِلَالِ بْنِ يَسَافٍ عَنْ فَرْوَةَ بْنِ نَوْفَلٍ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ فِي دُعَائِهِ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا عَمِلْتُ وَشَرِّ مَا لَمْ أَعْمَلْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14462,
                "hadithNumber": "6899",
                "englishNarrator": "Ibn 'Abbas رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to say: O Allah, it is unto Thee that I surrender myself. I affirm my faith in Thee and repose my trust in Thee and turn to Thee in repentance and with Thy help fought my adversaries. O Allah, I seek refuge in Thee with Thine Power; there is no god but Thou, lest Thou leadest me astray. Thou art ever-living that dieth not, while the Jinn and mankind die.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ( دعا کرتے ہوئے ) فرمایا کرتے تھے : \" اے اللہ! میں تیرے لیے فرمانبردار ہو گیا ، تیرے ساتھ ایمان لایا ، تجھ پر بھروسہ کیا ، تیری طرف رجوع کیا اور تیری مدد سے ( کفر کے ساتھ ) مخاصمت کی ۔ اے اللہ! میں اس بات سے تیری عزت کی پناہ لیتا ہوں ۔ ۔ تیرے سوا کوئی معبود نہیں ۔ ۔ کہ تو مجھے سیدھی راہ سے ہٹا دے ۔ ۔ تو ہی ہمیشہ زندہ رہنے والا ہے جس کو موت نہیں آ سکتی اور جن و انس سب مر جائیں گے ۔ \"",
                "urduNarrator": "ہم سے حجاج بن الشاعر نے بیان کیا، کہا ہم سے عبداللہ بن عمرو ابو معمر نے بیان کیا، کہا ہم سے عبدالوارث نے بیان کیا، کہا ہم سے حسین نے بیان کیا، کہا کہ مجھ سے ابن بریدہ نے بیان کیا۔ یحییٰ بن یعمر حضرت ابن عباس رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَمْرٍو أَبُو مَعْمَرٍ حَدَّثَنَا عَبْدُ الْوَارِثِ حَدَّثَنَا الْحُسَيْنُ حَدَّثَنِي ابْنُ بُرَيْدَةَ عَنْ يَحْيَى بْنِ يَعْمَرَ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ اللَّهُمَّ لَكَ أَسْلَمْتُ وَبِكَ آمَنْتُ وَعَلَيْكَ تَوَكَّلْتُ وَإِلَيْكَ أَنَبْتُ وَبِكَ خَاصَمْتُ اللَّهُمَّ إِنِّي أَعُوذُ بِعِزَّتِكَ لَا إِلَهَ إِلَّا أَنْتَ أَنْ تُضِلَّنِي أَنْتَ الْحَيُّ الَّذِي لَا يَمُوتُ وَالْجِنُّ وَالْإِنْسُ يَمُوتُونَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14463,
                "hadithNumber": "6900",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "When Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) set out on a journey in the morning, he used to say: A listener listened to our praising Allah (for) His goodly trial of us. Our Lord! acompany us, guard us and bestow upon us Thy grace. I am seeker of refuge in Allah from the Fire.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم جب کسی سفر میں ہوتے اور سحر کے وقت اٹھتے تو فرماتے : \" ( ہماری طرف سے ) اللہ کی حمد اور اس کے انعام کی خوبصورتی ( کے اعتراف ) کا سننے والا یہ بات دوسروں کو بھی سنا دے ۔ اے ہمارے رب! ہمارے ساتھ رہ ، ہم پر احسان کر ، میں آگ سے اللہ کی پناہ مانگتے ہوئے یہ دعا کر رہا ہوں ۔ \"",
                "urduNarrator": "مجھ سے ابو الطاہر نے بیان کیا، کہا ہم سے عبداللہ بن وہب نے بیان کیا، کہا کہ مجھ سے سلیمان بن بلال نے بیان کیا، سہیل بن ابی صالح نے اپنے والد سے, حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي سُلَيْمَانُ بْنُ بِلَالٍ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا كَانَ فِي سَفَرٍ وَأَسْحَرَ يَقُولُ سَمِعَ سَامِعٌ بِحَمْدِ اللَّهِ وَحُسْنِ بَلَائِهِ عَلَيْنَا رَبَّنَا صَاحِبْنَا وَأَفْضِلْ عَلَيْنَا عَائِذًا بِاللَّهِ مِنْ النَّارِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 14151,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=566",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=564",
                "label": "564",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=565",
                "label": "565",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=566",
                "label": "566",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=567",
                "label": "567",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=568",
                "label": "568",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=569",
                "label": "569",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=570",
                "label": "570",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=568",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=568",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=566",
        "to": 14175,
        "total": 40465
    }
}