{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 328,
        "data": [
            {
                "id": 8464,
                "hadithNumber": "900",
                "englishNarrator": "Abdullah bin Mas'ud ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "We were sitting with the Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) in prayer, and the rest of the hadith is the same as narrated by Mansur He (also said): After (reciting tashahud) he may choose any prayer.",
                "hadithUrdu": "جب ہم نماز میں نبیﷺ کے ساتھ بیٹھتے تھے .... ( آگے ) منصور کی حدیث کی طرح ( ہے ) اور کہا : ’’ اس کے بعد دعا کا انتخاب کر لے ۔ ‘ ‘",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا ہم سے ابو معاویہ نے بیان کیا۔اعمش نے ( ابو وائل ) شقیق سے اور انہوں نے حضرت عبد اللہ بن مسعود ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ عَبْدِ اللهِ بْنِ مَسْعُودٍ، قَالَ: كُنَّا إِذَا جَلَسْنَا مَعَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي الصَّلَاةِ بِمِثْلِ حَدِيثِ مَنْصُورٍ وَقَالَ: «ثُمَّ يَتَخَيَّرُ بَعْدُ مِنَ الدُّعَاءِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8465,
                "hadithNumber": "901",
                "englishNarrator": "Ibn Mas'ud is reported to have said:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) taught me tashahhud taking my hand within his palms, in the same way as he taught me a Sura of the Qur'an, and he narrated it as narrated above.",
                "hadithUrdu": "رسول اللہﷺ نے مجھے تشہد سکھایا ، میری ہتھیلی آپ کی دونوں ہتھیلیوں کے درمیان تھی ، ( بالکل اسی طرح ) جیسے آپ مجھے قرآنی سورت کی تعلیم دیتے تھے ۔ اور انہوں نے ( ابن سخبرہ ) نے تشہد اسی طرح بیان کیا جس طرح سابقہ راویوں نے بیان کیا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے ابو نعیم نے بیان کیا، کہا ہم سے سیف بن سلیمان نے بیان کیا، انہوں نے کہا کہ میں نے ایک مجاہد کو یہ کہتے ہوئے سنا, عبد اللہ بن سخبرہ نے کہا , میں نے حضرت ابن مسعود سے سنا ، کہہ رہے تھے",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو نُعيْمٍ، حَدَّثَنَا سيْفُ بْنُ سُليْمَانَ، قَالَ: سَمِعْتُ مُجَاهِدًا، يَقُولُ: حَدَّثَنِي عَبْدُ اللهِ بْنُ سَخْبَرَةَ، قَالَ: سَمِعْتُ ابْنَ مَسْعُودٍ، يَقُولُ: «عَلَّمَنِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ التَّشهُّدَ، كَفِّي بَيْنَ كَفَّيْهِ كَمَا يُعلِّمُنِي السُّورَةَ مِنَ الْقُرْآنِ، وَاقْتَصَّ التَّشَهُّدَ بِمِثْلِ مَا اقْتَصُّوا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8466,
                "hadithNumber": "902",
                "englishNarrator": "Ibn `Abbas رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to teach us tashahhud just as he used to teach us a Surah of the Qur'an, and he would say: All services rendered by words, acts of worship, and all good things are due to Allah. Peace be upon you, O Prophet, and Allah's mercy and blessings. Peace be upon us and upon Allah's upright servants. I testify that there is no god but Allah, and I testify that Muhammad is the Messenger of Allah. In the narration of Ibn Rumh (the words are): As he would teach us the Qur'an.",
                "hadithUrdu": "رسول اللہﷺ ہمیں تشہد اسی طرح سکھاتے جس طرح قرآن کی کوئی سورت سکھاتے تھے ، چنانچہ آپ فرماتے تھے : ’’بقا وبادشاہت ، عظمت و اختیار اور کثرت خیر ، ساری دعائیں اور ساری پاکیزہ چیزیں اللہ ہی کےلیے ہیں ۔ آپ پر سلام ہو اے نبی! اور اللہ کی رحمت اور اس کی برکتیں ہوں ۔ ہم پر اور اللہ کے نیک بندوں پر سلام ہو ۔ میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود نہیں اور میں گواہی دیتا ہوں کہ محمدﷺ اللہ کے رسول ہیں ۔ ‘ ‘",
                "urduNarrator": "امام مسلم نے قتیبہ بن سعید اور محمد بن رمح بن مہاجر کی سندوں سے لیث سے ، انہوں نے ابو زبیر سے ، انہوں نے سعید بن جبیر اور طاؤس سے اور انہوں نے حضرت ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ، أَخْبَرَنَا اللَّيْثُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، وَعَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ قَالَ: كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُعَلِّمُنَا التَّشَهُّدَ كَمَا يُعَلِّمُنَا السُّورَةَ مِنَ الْقُرْآنِ فَكَانَ يَقُولُ: «التَّحِيَّاتُ الْمُبَارَكَاتُ، الصَّلَوَاتُ الطَّيِّبَاتُ لِلَّهِ، السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ، السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللهِ الصَّالِحِينَ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللهُ، وَأَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللهِ» وَفِي رِوَايَةِ ابْنِ رُمْحٍ كَمَا يُعَلِّمُنَا الْقُرْآنَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8467,
                "hadithNumber": "903",
                "englishNarrator": "Tawus narrated it on the authority of Ibn 'Abbas ‌رضی ‌اللہ ‌عنہ ‌that he said:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) used to teach us tashahhud as he would teach us a Sura of the Qur'an.",
                "hadithUrdu": "رسول اللہﷺ ہمیں تشہد یوں سکھاتے تھے جیسے آپ ہمیں قرآن کی سورت سکھاتے تھے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے یحییٰ بن آدم نے بیان کیا,عبد الرحمن بن حمید نے کہا : مجھے ابو زبیر نے طاؤس کے حوالے سے حضرت ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے حدیث بیان کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ حُمَيْدٍ، ٍ حَدَّثَنِي أَبُو الزُّبَيْرِ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ: «كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُعَلِّمُنَا التَّشَهُّدَ، كَمَا يُعَلِّمُنَا السُّورَةَ مِنَ الْقُرْآنِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8468,
                "hadithNumber": "904",
                "englishNarrator": "Hattan bin `Abdullah al-Raqashi reported:",
                "hadithEnglish": "I observed prayer with Abu Musa al-Ash`ari رضی ‌اللہ ‌عنہ ‌and when he was in the qa`dah, one among the people said: The prayer has been made obligatory along with piety and Zakat. He (the narrator) said: When Abu Musa رضی ‌اللہ ‌عنہ ‌had finished the prayer after salutation he turned (towards the people) and said: Who amongst you said such and such a thing? A hush fell on the people. He again said: Who amongst you has said such and such a thing? A hush fell on the people. He (Abu Musa رضی ‌اللہ ‌عنہ ‌) said: Hattan, it is perhaps you that have uttered it. He (Hattan) said No. I have not uttered it. I was afraid that you might be annoyed with me on account of this. A person amongst the people said: It was I who said it, and in this I intended nothing but good. Abu Musa said: Don't you know what you have to recite in your prayers? Verily the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) addressed us and explained to us all its aspects and taught us how to observe prayer (properly). He (the Holy Prophet) said: When you pray make your rows straight and let anyone amongst you act as your Imam. Recite the takbir when he recites it and when he recites: Not of those with whom Thou art angry, nor of those who go astray, say: Amin. Allah would respond you. And when he (the Imam) recites the takbir, you may also recite the takbir, for the Imam bows before you and raises himself before you. Then the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: The one is equivalent to the other. And when he says: Allah listens to him who praises Him, you should say: O Allah, our Lord, to Thee be the praise, for Allah, the Exalted and Glorious, has vouchsafed (us) through the tongue of His Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) that Allah listens to him who praises Him. And when he (the Imam) recites the takbir and prostrates, you should also recite the takbir and prostrate, for the Imam prostrates before you and raises himself before you. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: The one is equivalent to the other. And when he (the Imam) sits for Qa`da (for tashahhud) the first words of every one amongst you should be: All services rendered by words, acts of worship and all good things are due to Allah. Peace be upon you, O Apostle, and Allah's mercy and blessings. Peace be upon us and upon the upright servants of Allah. I testify that there is no god but Allah, and I testify that Muhammad is His servant and His Messenger.",
                "hadithUrdu": "میں نے حضرت ابو موسیٰ اشعری ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے ساتھ ایک نماز پڑھی ، جب وہ قعدہ ( نماز میں تشہد کے لیے بیٹھنے ) کے قریب تھے تو لوگوں میں سے ایک شخص نے کہا : نماز کو نیکی اور زکاۃ کے ساتھ رکھا گیا ہے؟ جب ابو موسیٰ ‌رضی ‌اللہ ‌عنہ ‌ نے نماز پوری کر لی تو مڑے اور کہا : تم میں سے یہ یہ بات کہنے والا کون تھا؟ تو سب لوگ مارے ہیبت کے چپ رہے ، انہوں نے پھر کہا : تم میں سے یہ یہ بات کہنے والا کون تھا؟ تو لوگ ہیبت کے مارے پھر چپ رہے تو انہوں نے کہا : اے حطان! لگتا ہے تو نے یہ بات کہی؟ انہوں نے کہا : میں نے یہ نہیں کہا ، البتہ مجھے ڈر تھا کہ آپ اس کے سبب میری سرزنش کریں گے ۔ تو لوگوں میں سے ایک آدمی نے کہا : میں نے یہ بات کہی تھی اور میں نے اس سے بھلائی کے سوا اور کچھ نہ چاہا تھا ۔ تو ابو موسیٰ ‌رضی ‌اللہ ‌عنہ ‌ نے کہا : کیا تم نہیں جانتے کہ تمہیں اپنی نماز میں کیسے کہنا چاہیے؟ رسول اللہﷺ نے ہمیں خطبہ دیا ، آپ نے ہمارے لیے ہمارا طریقہ واضح کیا اور ہمیں ہماری نماز سکھائی ۔ آپ نے فرمایا : ’’جب تم نماز پڑھو تو اپنی صفوں کو سیدھا کرو ، پھر تم میں سے ایک شخص تمہاری امامت کرائے ، جب وہ تکبیر کہے تو تم تکبیر کہو اور جب وہ ﴿غير المغضوب عليهم والا الضالين﴾ کہے تو تم آمین کہو ، اللہ تمہاری دعا قبول فرمائے گا ۔ پھر جب وہ تکبیر کہے اور رکوع کرے تو تم تکبیر کہو اور رکوع کرو ، امام تم سے پہلے رکوع میں جائے گا اور تم سے پہلے سر اٹھائے گا ۔ ‘ ‘ پھر رسول اللہﷺ نے فرمایا : ’’ تو ( مقتدی کی طرف سے رکوع میں جانےکی ) یہ ( تاخیر ) اس ( تاخیر ) کا بدل ہو کی ( جو رکوع سے سر اٹھانے میں ہو گی ) اور جب امام سمع الله لمن حمده کہے تو تم اللهم ربنا لك الحمد کہو ، اللہ تمہاری ( بات ) سنے گا ، کیونکہ اللہ تعالیٰ نے اپنے نبیﷺ کی زبان سے فرمایا ہے : اللہ نے اسے سن لیا جس نے اس کی حمد بیان کی اور جب امام تکبیر کہے اور سجدہ کرے تو تم تکبیر کہو اور سجدہ کرو ، امام تم سے پہلے سجدہ کرے گا اور تم سے پہلے سر اٹھائے گا ۔ ‘ ‘ پھر رسول اللہﷺ نے فرمایا : ’’ تو یہ ( تاخیر ) اس ( تاخیر ) کابدل ہو گی اور جب وہ قعدہ میں ہو تو تمہارا پہلا بول ( یہ ) ہو : بقا وبادشاہت ، اختیار وعظمت ، سب پاک چیزیں اور ساری دعائیں اللہ کےلیے ہیں ۔ اے نبی! آپ پر سلام اور اللہ کی رحمت اور اس کی برکتیں ہوں ۔ ہم پر اور اللہ کے نیک بندوں پر سلام ہو ۔ میں گواہی دیتا ہوں کہ اللہ کےسوا کوئی معبود نہیں اور میں گواہی دیتا ہوں کہ محمدﷺ اس کے بندے اور رسول ہیں ۔ ‘ ‘",
                "urduNarrator": "ہم سے سعید بن منصور، قتیبہ بن سعید، ابو کامل الجہدری اور محمد بن عبد الملک الامّی نے بیان کیا اور یہ الفاظ ابو کامل کا ہے، انہوں نے کہاابو عوانہ نے قتادہ سے ، انہوں نے یونس بن جبیر سے اور انہوں نے حطان بن عبد اللہ رقاشی سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو كَامِلٍ الْجَحْدَرِيُّ، وَمُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ الْأُمَوِيُّ، - وَاللَّفْظُ لِأَبِي كَامِلٍ -، قَالُوا: حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ يُونُسَ بْنِ جُبَيْرٍ، عَنْ حِطَّانَ بْنِ عَبْدِ اللهِ الرَّقَاشِيِّ، قَالَ: صَلَّيْتُ مَعَ أَبِي مُوسَى الْأَشْعَرِيِّ صَلَاةً فَلَمَّا كَانَ عِنْدَ الْقَعْدَةِ قَالَ رَجُلٌ مِنَ الْقَوْمِ: أُقِرَّتِ الصَّلَاةُ بِالْبِرِّ وَالزَّكَاةِ؟ قَالَ فَلَمَّا قَضَى أَبُو مُوسَى الصَّلَاةَ وَسَلَّمَ انْصَرَفَ فَقَالَ: أَيُّكُمُ الْقَائِلُ كَلِمَةَ كَذَا وَكَذَا؟ قَالَ: فَأَرَمَّ الْقَوْمُ، ثُمَّ قَالَ: أَيُّكُمُ الْقَائِلُ كَلِمَةَ كَذَا وَكَذَا؟ فَأَرَمَّ الْقَوْمُ، فَقَالَ: لَعَلَّكَ يَا حِطَّانُ قُلْتَهَا؟ قَالَ: مَا قُلْتُهَا، وَلَقَدْ رَهِبْتُ أَنْ تَبْكَعَنِي بِهَا فَقَالَ رَجُلٌ مِنَ الْقَوْمِ: أَنَا قُلْتُهَا، وَلَمْ أُرِدْ بِهَا إِلَّا الْخَيْرَ فَقَالَ أَبُو مُوسَى: أَمَا تَعْلَمُونَ كَيْفَ تَقُولُونَ فِي صَلَاتِكُمْ؟ إِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ خَطَبَنَا فَبَيَّنَ لَنَا سُنَّتَنَا وَعَلَّمَنَا صَلَاتَنَا. فَقَالَ: إِذَا صَلَّيْتُمْ فَأَقِيمُوا صُفُوفَكُمْ ثُمَّ لْيَؤُمَّكُمْ أَحَدُكُمْ، فَإِذَا كَبَّرَ فَكَبِّرُوا، وَإِذْ قَالَ {غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ} [الفاتحة: 7]، فَقُولُوا: آمِينَ، يُجِبْكُمُ اللهُ فَإِذَا كَبَّرَ وَرَكَعَ فَكَبِّرُوا وَارْكَعُوا، فَإِنَّ الْإِمَامَ يَرْكَعُ قَبْلَكُمْ، وَيَرْفَعُ قَبْلَكُمْ ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: فَتِلْكَ بِتِلْكَ وَإِذَا قَالَ: سَمِعَ اللهُ لِمَنْ حَمِدَهُ. فَقُولُوا: اللهُمَّ رَبَّنَا لَكَ الْحَمْدُ يَسْمَعُ اللهُ لَكُمْ، فَإِنَّ اللهَ تَبَارَكَ وَتَعَالَى، قَالَ عَلَى لِسَانِ نَبِيِّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: سَمِعَ اللهُ لِمَنْ حَمِدَهُ وَإِذَا كَبَّرَ وَسَجَدَ فَكَبِّرُوا وَاسْجُدُوا فَإِنَّ الْإِمَامَ يَسْجُدُ قَبْلَكُمْ وَيَرْفَعُ قَبْلَكُمْ فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: فَتِلْكَ بِتِلْكَ، وَإِذَا كَانَ عِنْدَ الْقَعْدَةِ فَلْيَكُنْ مِنْ أَوَّلِ قَوْلِ أَحَدِكُمْ: التَّحِيَّاتُ الطَّيِّبَاتُ الصَّلَوَاتُ لِلَّهِ السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ، السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللهِ الصَّالِحِينَ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ «.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8469,
                "hadithNumber": "905",
                "englishNarrator": "Qatada has narrated a hadith like this with another chain of transmitters. In the hadith transmitted by Jarir on the authority of Sulaiman, Qatada's further words are:",
                "hadithEnglish": "When (the Qur'an) is recited (in prayer), you should observe silence, and (the following words are) not found in the hadith narrated by anyone except by Abu Kamil who heard it from Abu 'Awina (and the words are): Verily Allah vouchsafed through the tongue of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) this: Allah listens to him who praises Him. Abu Ishaq (a student of Imam Muslim) said: Abu Bakr the son of Abu Nadr's sister has (critically) discussed this hadith. Imam Muslim said: Whom can you find a more authentic transmitter of hadith than Sulaiman? Abu Bakr said to him (Imam Muslim): What about the hadith narrated by Abu Huraira, i.e. the hadith that when the Qur'an is recited (in prayer) observe silence? He (Abu Bakr again) said: Then, why have you not included it (in your compilation)? He (Imam Muslim) said: I have not included in this every hadith which I deem authentic; I have recorded only such ahadith on which there is an agreement (amongst the Muhaddithin apart from their being authentic).",
                "hadithUrdu": "’’ جب امام پڑھے تو تم غور سے سنو ۔ ‘ ‘ اور ابو عوانہ کے شاگرد کامل کی حدیث کے علاوہ ان میں سے کسی کی حدیث میں : ’’اللہ عزوجل نے اپنے نبیﷺ کی زبان سے فرمایا ہے : ’’ اللہ نے اسے سن لیا جس نے اس کی حمد کی ۔ ‘ ‘ کے الفاظ نہیں ہیں ۔ ابو اسحاق نے کہا : ابو نضر کے بھانجے ابو بکر نے اس حدیث کے متعلق بات کی تو امام مسلم نے کہا : آپ کو سلیمان سے بڑا حافظ چاہیے؟ اس پر ابو بکر نے امام مسلم سے کہا : ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی حدیث؟ پھر ( ابو بکر نے ) کہا : وہ صحیح ہے ، یعنی ( یہ اضافہ کہ ) جب امام پڑھے تو تم خاموش رہو ۔ امام مسلم نے ( جوابا ) کہا : وہ میرے نزدیک بھی صحیح ہے ۔ تو ابو بکر نے کہا : آپ نے اسے یہاں کیوں نہ رکھا ( درج کیا ) ؟ ( امام مسلم نے جواباً ) کہا : ہر وہ چیز جو میرے نزدیک صحیح ہے ، میں نے اسے یہاں نہیں رکھا ۔ یہاں میں نے صرف ان ( احادیث ) کو رکھا جن ( کی صحت ) پر انہوں ( محدثین ) نے اتفاق کیا ہے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا,ابو اسامہ نے سعید بن ابی عروبہ سے حدیث بیان کی ، نیز معاذ بن ہشام نے اپنے والد سے حدیث بیان کی ، اسی طرح جریر نے سلیمان تیمی سے خبر دی ، ان سب ( ابن ابی عروبہ ، ہشام اور سلیمان ) نے قتادہ سے اسی ( سابقہ ) حدیث کے مانند روایت کی ، البتہ قتادہ سے سلیمان اور ان سے جریر کی بیان کردہ حدیث میں یہ اضافہ ہے",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، ح وَحَدَّثَنَا أَبُو غَسَّانَ الْمِسْمَعِيُّ، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنَا أَبِي، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا جَرِيرٌ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، كُلُّ هَؤُلَاءِ عَنْ قَتَادَةَ، فِي هَذَا الْإِسْنَادِ بِمِثْلِهِ وَفِي حَدِيثِ جَرِيرٍ، عَنْ سُلَيْمَانَ، عَنْ قَتَادَةَ مِنَ الزِّيَادَةِ» وَإِذَا قَرَأَ فَأَنْصِتُوا وَلَيْسَ فِي حَدِيثِ أَحَدٍ مِنْهُمْ فَإِنَّ اللهَ قَالَ عَلَى لِسَانِ نَبِيِّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «سَمِعَ اللهُ لِمَنْ حَمِدَهُ» إِلَّا فِي رِوَايَةِ أَبِي كَامِلٍ، وَحْدَهُ عَنْ أَبِي عَوَانَةَ قَالَ أَبُو إِسْحَاقَ: قَالَ أَبُو بَكْرِ: ابْنُ أُخْتِ أَبِي النَّضْرِ فِي هَذَا الْحَدِيثِ. فَقَالَ مُسْلِمٌ: تُرِيدُ أَحْفَظَ مِنْ سُلَيْمَانَ؟ فَقَالَ لَهُ أَبُو بَكْرٍ: فَحَدِيثُ أَبِي هُرَيْرَةَ؟ فَقَالَ: هُوَ صَحِيحٌ يَعْنِي وَإِذَا قَرَأَ فَأَنْصِتُوا فَقَالَ: هُوَ عِنْدِي صَحِيحٌ فَقَالَ: لِمَ لِمَ تَضَعْهُ هَا هُنَا؟ قَالَ: لَيْسَ كُلُّ شَيْءٍ عِنْدِي صَحِيحٍ وَضَعْتُهُ هَا هُنَا إِنَّمَا وَضَعْتُ هَا هُنَا مَا أَجْمَعُوا عَلَيْهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8470,
                "hadithNumber": "906",
                "englishNarrator": "This hadith has been transmitted by Qatida with the same chain of transmitters (and the words are):",
                "hadithEnglish": "Allah, the Exalted and the Glorious, commanded it through the tongue of His Apostle (ﷺ): Allah listens to him who praises Him.",
                "hadithUrdu": "’’چنانچہ اللہ نے اپنے نبیﷺ کی زبان سے فیصلہ کر دیا ( کہ ) اللہ نے اسے سن لیا جس نے اس کی حمد بیان کی ( قال کے بجائے قضى کالفظ روایت کیا ۔ )",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم اور ابن ابی عمر نے عبد الرزاق کی سند سے اور معمر کی سند سے بیان کیا,قتادہ کے ایک اور شاگرد معمر نے اسی سند کے ساتھ مذکورہ بالا حدیث روایت کی اور ( اپنی ) حدیث میں کہا :",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ أَبِي عُمَرَ، عَنْ عَبْدِ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنْ قَتَادَةَ، بِهَذَا الْإِسْنَادِ. وَقَالَ فِي الْحَدِيثِ: «فَإِنَّ اللهَ عَزَّ وَجَلَّ قَضَى عَلَى لِسَانِ نَبِيِّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ سَمِعَ اللهُ لِمَنْ حَمِدَهُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8471,
                "hadithNumber": "907",
                "englishNarrator": "Abdullah bin Zaid-he who was shown the call (for prayer in a dream) narrated it on the authority of Abu Mas'ud al-Ansari who said: We were sitting in the company of Sa'id bin 'Ubida when the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came to us. Bashir bin S'ad ‌رضی ‌اللہ ‌عنہ ‌said:",
                "hadithEnglish": "Allah has commanded us to bless you. Messenger of Allah! But how should we bless you? He (the narrator) said: The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) kept quiet (and we were so much perturbed over his silence) that we wished we had not asked him. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) then said: (For blessing me) say: 0 Allah, bless Muhammad and the members of his household as Thou didst bless the mernbers of Ibrahim's household. Grant favours to Muhammad and the members of his household as Thou didst grant favours to the members of the household of Ibrahim in the world. Thou art indeed Praiseworthy and Glorious; and salutation as you know.",
                "hadithUrdu": "اللہ کے رسول! اللہ تعالیٰ نے ہمیں آپ پر درود بھیجنے کا حکم دیا ہے تو ہم آپ پر درود کیسے بھیجیں؟ انہوں نے کہا : اس پر رسول اللہﷺ خاموش ہوگئے حتیٰ کہ ہم نے تمنا کی کہ انہوں نے آپ سے یہ سوال نہ کیا ہوتا ، پھر رسول اللہﷺ نے فرمایا : ’’ کہو : اے اللہ! رحمت فرما محمد اور محمد کی آل پر ، جیسے تو نے رحمت فرمائی ابراہیم کی آل پر اور برکت نازل فرما محمد اور محمد کی آل پر ، جیسے تو نے سب جہانوں میں برکت نازل فرمائی ابراہیم کی آل پر ، بلاشبہ تو سزا وار حمد ہے ، عظمتوں والا ہے اور سلام اسی طرح ہے جیسے تم ( پہلے ) جان چکے ہو ۔ ‘ ‘",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ التمیمی نے بیان کیا، کہا: میں نے مالک رضی اللہ عنہ کو پڑھا,نعیم بن عبد اللہ مجمر سے روایت ہے کہ محمد بن عبد اللہ بن زید انصاری نے ( محمد کے والد عبد اللہ بن زید وہی ہیں جن کو نماز کے لیے اذان خواب میں دکھائی گئی تھی ) انہیں ابو مسعود انصاری ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے متعلق بتایا کہ انہوں نے کہا : ہم سعد بن عبادہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی مجلس میں تھے کہ رسول اللہﷺ ہمارے پاس تشریف لائے ، چنانچہ بشیر بن سعد ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے آپ سے عرض کی",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ نُعَيْمِ بْنِ عَبْدِ اللهِ الْمُجْمِرِ، أَنَّ مُحَمَّدَ بْنَ عَبْدِ اللهِ بْنِ زَيْدٍ الْأَنْصَارِيَّ، وَعَبْدُ اللهِ بْنُ زَيْدٍ، هُوَ الَّذِي كَانَ أُرِيَ النِّدَاءَ بِالصَّلَاةِ أَخْبَرَهُ عَنْ أَبِي مَسْعُودٍ الْأَنْصَارِيِّ، قَالَ: أَتَانَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ فِي مَجْلِسِ سَعْدِ بْنِ عُبَادَةَ، فَقَالَ لَهُ بَشِيرُ بْنُ سَعْدٍ: أَمَرَنَا اللهُ تَعَالَى أَنْ نُصَلِّيَ عَلَيْكَ يَا رَسُولَ اللهِ، فَكَيْفَ نُصَلِّي عَلَيْكَ؟ قَالَ: فَسَكَتَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، حَتَّى تَمَنَّيْنَا أَنَّهُ لَمْ يَسْأَلْهُ ثُمَّ قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «قُولُوا اللهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ، كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ وَبَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ فِي الْعَالَمِينَ، إِنَّكَ حَمِيدٌ مَجِيدٌ، وَالسَّلَامُ كَمَا قَدْ عَلِمْتُمْ».",
                "headingArabic": "الصَّلاَةِ عَلَى النَّبِيِّ صلى الله عليه وسلم بَعْدَ التَّشَهُّدِ ‏",
                "headingUrdu": "تشہد کے بعد رسول اللہ صلی اللہ علیہ وسلم پر درود بھیجنا",
                "headingEnglish": "Sending Salat Upon The Prophet (saws) After The Tashah-hud",
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8472,
                "hadithNumber": "908",
                "englishNarrator": "Ibn Abi Laila reported: Ka'b bin 'Ujra رضی ‌اللہ ‌عنہ ‌met me and said:",
                "hadithEnglish": "Should I not offer you a present (and added): The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came to us and we said: We have learnt how to invoke peace upon you; (kindly tell us) how we should bless you. He (the Holy Prophet) said: Say: O Allah: bless Muhammad and his family as Thou didst bless the family of Ibrahim. Verily Thou art Praiseworthy and Glorious, O Allah.",
                "hadithUrdu": "کیا میں تمہیں ایک تحفہ نہ دوں؟ رسول اللہﷺ ہماری طرف تشریف لائے تو ہم نے عرض کی : ہم تو جان چکے ہیں کہ ہم آپ پر سلام کیسے بھیجیں ، ( یہ بتائیں ) ہم آپ پر صلاۃ کیسے بھیجیں؟ آپ نے فرمایا : ’’کہو : اے اللہ! محمد اور محمد کی آل پر رحمت فرما ، جیسے تو نے ابراہیم کی آل پر رحمت فرمائی ، بلاشبہ تو سزاوار حمد ، عظمتوں والا ہے ۔ اے اللہ! محمد پر اور محمد کی آل پر برکت نازل فرما ، جیسے تو نے ابراہیم کی آل پر برکت نازل فرمائی ، بلاشبہ تو سزاوار حمد ہے ، عظمتوں والا ہے ۔ ‘ ‘",
                "urduNarrator": "ہم سے محمد بن المثنیٰ اور محمد بن بشار نے بیان کیا اور یہ قول ابن المثنیٰ کا ہے انہوں نے کہا,محمد بن جعفر نے کہا : ہمیں شعبہ نے حَکم سے حدیث سنائی ، انہوں نے کہا : میں نے ابن ابی لیلیٰ سے سنا ، انہوں نے کہا : مجھے حضرت کعب بن عجرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ ملے اور کہنے لگے",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، - وَاللَّفْظُ لِابْنِ الْمُثَنَّى - قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، قَالَ: سَمِعْتُ ابْنَ أَبِي لَيْلَى، قَالَ: لَقِيَنِي كَعْبُ بْنُ عُجْرَةَ، فَقَالَ: أَلَا أُهْدِي لَكَ هَدِيَّةً خَرَجَ عَلَيْنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَقُلْنَا: قَدْ عَرَفْنَا كَيْفَ نُسَلِّمُ عَلَيْكَ فَكَيْفَ نُصَلِّي عَلَيْكَ؟ قَالَ: «قُولُوا اللهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ، كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ، اللهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ، كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8473,
                "hadithNumber": "909",
                "englishNarrator": "A hadith like this has been narrated by Mis'ar on the authority of al-Hakam, but in the hadith transmitted by Mis'ar these words are not found:",
                "hadithEnglish": "Should I not offer you a present?",
                "hadithUrdu": "کیا میں تمہیں ایک تحفہ نہ دوں؟",
                "urduNarrator": "ہم سے زہیر بن حرب اور ابو کریب نے بیان کیا, وکیع نے شعبہ اور مسعر سے اسی سند کے ساتھ حکم سے اسی کی مانند روایت کی اور مسعر کی حدیث میں یہ جملہ نہیں ہے",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَأَبُو كُرَيْبٍ، قَالَا: حَدَّثَنَا وَكِيعٌ، عَنْ شُعْبَةَ، وَمِسْعَرٍ، عَنِ الْحَكَمِ، بِهَذَا الْإِسْنَادِ مِثْلَهُ وَلَيْسَ فِي حَدِيثِ مِسْعَرٍ: أَلَا أُهْدِي لَكَ هَدِيَّةً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8474,
                "hadithNumber": "910",
                "englishNarrator": "A hadith like this has been narrated by al-Hakam except that he said:",
                "hadithEnglish": "Bless Muhammad ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and he did not say: (Allahhummah) O Allah.",
                "hadithUrdu": "وبارك على محمد اور ( اس سے پہلے ) اللهم نہیں کہا ۔",
                "urduNarrator": "اسماعیل بن زکریا نے اعمش ، مسعر اور مالک بن مغول سے روایت کی اور ان سب نے حکم سے اسی سند کے ساتھ سابقہ حدیث کی مانند روایت کی ، البتہ  اس نے کہا :",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَكَّارٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ زَكَرِيَّا، عَنِ الْأَعْمَشِ، وَعَنْ مِسْعَرٍ، وَعَنْ مَالِكِ بْنِ مِغْوَلٍ، كُلُّهُمْ عَنِ الْحَكَمِ، بِهَذَا الْإِسْنَادِ مِثْلَهُ غَيْرَ، أَنَّهُ قَالَ: «وَبَارِكْ عَلَى مُحَمَّدٍ» وَلَمْ يَقُلْ: اللهُمَّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8475,
                "hadithNumber": "911",
                "englishNarrator": "Abu Humaid as-Sa'idi ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "They (the Companions of the Holy Prophet) said: Apostle of Allah, how should we bless you? He (the Holy Prophet) observed: Say: O Allah! bless Muhammad, his wives and his offspring as Thou didst bless Ibrahim, and grant favours to Muhammad, and his wives and his offspring as Thou didst grant favours to the family of Ibrahim; Thou art Praiseworthy and Glorious.",
                "hadithUrdu": "انہوں ( صحابہ ) نے کہا : اے اللہ کے رسول! ہم آپ پر صلاۃ کیسے بھیجیں؟ آپ نے فرمایا : ’’کہو : اے اللہ! رحمت فرما محمد پر اور آپ کی ازواج اور آپ کی اولاد پر ، جیسے تو نے ابراہیم کی آل پر رحمت فرمائی اور برکت نازل فرما محمد پر اور آپ کی ازواج اور آپ کی اولاد پر ، جیسے تو نے برکت نازل فرمائی ابراہیم کی آل پر ، بلاشبہ تو سزا وار حمد ہے ، عظمتوں والا ہے ۔ ‘ ‘",
                "urduNarrator": "ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا، ہم سے روح نے بیان کیا، اور ہم سے عبداللہ بن نافع، ایچ، اسحق بن ابراہیم نے بیان کیا - اور اس کا تلفظ - انہوں نے کہا: اخبہ رانا روح، مالک بن انس رضی اللہ عنہ سے۔ عبداللہ بن ابی بکر کی سند سے، اپنے والد کی سند سے،عمرو بن سلیم نے کہا : مجھے حضرت ابو حمید ساعدی ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے بتایا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، حَدَّثَنَا رَوْحٌ، وَعَبْدُ اللهِ بْنُ نَافِعٍ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لَهُ - قَالَ: أَخْبَرَنَا رَوْحٌ، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنْ عَبْدِ اللهِ بْنِ أَبِي بَكْرٍ، عَنْ أَبِيهِ، عَنْ عَمْرِو بْنِ سُلَيْمٍ، أَخْبَرَنِي أَبُو حُمَيْدٍ السَّاعِدِيُّ، أَنَّهُمْ قَالُوا: يَا رَسُولَ اللهِ، كَيْفَ نُصَلِّي عَلَيْكَ؟ قَالَ: «قُولُوا اللهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى أَزْوَاجِهِ، وَذُرِّيَّتِهِ كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ، وَبَارِكْ عَلَى مُحَمَّدٍ وَعَلَى أَزْوَاجِهِ، وَذُرِّيَّتِهِ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8476,
                "hadithNumber": "912",
                "englishNarrator": "Abu Huraira reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: He who blesses me once, Allah would bless him ten times.",
                "hadithUrdu": "رسول اللہﷺ نےفرمایا : جس نے مجھ پر ایک بار درود بھیجا اللہ تعالیٰ اس پر دس بار رحمت نازل فرمائے گا ۔",
                "urduNarrator": "ہم سے یحییٰ بن ایوب، قتیبہ اور ابن حجر نے بیان کیا، انہوں نے کہا: ہم سے اسماعیل نے جو ابن جعفر ہیں، انہوں نے اپنے والد سے علاء کی سند سے بیان کیا, حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ حُجْرٍ، ٍ قَالُوا: حَدَّثَنَا إِسْمَاعِيلُ وَهُوَ ابْنُ جَعْفَرٍ، عَنِ الْعَلَاءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ صَلَّى عَلَيَّ وَاحِدَةً صَلَّى الله عَلَيْهِ عَشْرًا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8477,
                "hadithNumber": "913",
                "englishNarrator": "Abu Huraira ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: When the Imam says: Allah listens to him who praises Him. you should say: O Allah, our Lord for Thee is the praise. for if what anyone says synchronises with what the angels say, his past sins will be forgiven.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’ جب امام سمع الله لمن حمده ( اللہ نے سن لیا جس نے اس کی تعریف کی ) کہے تو تم کہو : اللهم ، ربنا لك الحمد ( اے اللہ! ہمارے رب! سب تعریف تیرے لیے ہے ) کیونکہ جس کا قول فرشتوں کے قول کے موافق ہو گیا اس کے گزشتہ گناہ معاف کر دیے جائیں گے ۔ ‘ ‘",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے مالک رضی اللہ عنہ سے پڑھا,سمی نے ابو صالح سے ، انہوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ سُمَيٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: إِذَا قَالَ الْإِمَامُ سَمِعَ اللهُ لِمَنْ حَمِدَهُ، فَقُولُوا: اللهُمَّ رَبَّنَا لَكَ الْحَمْدُ، فَإِنَّهُ مَنْ وَافَقَ قَوْلُهُ قَوْلَ الْمَلَائِكَةِ، غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ.",
                "headingArabic": "التَّسْمِيعِ وَالتَّحْمِيدِ وَالتَّأْمِينِ ‏‏",
                "headingUrdu": "\"سمیع اللہ لمن حمدہ، ربنا و لکل الحمد\" اور \"امین\" کہنا",
                "headingEnglish": "Saying \"Sami'a Allahu liman Hamidah,\" Rabbana wa lakal-hamd,\" and \"Amin\"",
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8478,
                "hadithNumber": "914",
                "englishNarrator": null,
                "hadithEnglish": "A hadith similar to that of Summayy was from Abu Huraira ‌رضی ‌اللہ ‌عنہ ‌from the prophet ﷺ.",
                "hadithUrdu": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا کہ ہم سے یعقوب نے، یعنی ابن عبدالرحمٰن نے بیان کیا, سہیل نے اپنے والد ( ابو صالح ) سے ، انہوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انہوں نے نبیﷺ سے ( مذکورہ بالا راوی ) سمی کی حدیث کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَى حَدِيثِ سُمَيٍّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8479,
                "hadithNumber": "915",
                "englishNarrator": "Abu Huraira ‌رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Say Amin when the Imam says Amin, for it anyone's utterance of Amin synchronises with that of the angels, he will be forgiven his past sins.",
                "hadithUrdu": "رسول اللہﷺ نے فرمایا : ’’ جب امام آمین کہے تو تم بھی آمین کہو کیونکہ جس کی آمین فرشتوں کی آمین کے موافق ہو جائے گی ، اس کے سابقہ گناہ معاف کر دیے جائیں گے ۔ ‘ ‘",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا, مالک نے ابن شہاب سے ، انہوں نے سعید بن مسیب اور ابو سلمہ بن عبد الرحمن سے روایت کی کہ ان دونوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، وَأَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّهُمَا أَخْبَرَاهُ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا أَمَّنَ الْإِمَامُ فَأَمِّنُوا، فَإِنَّهُ مَنْ وَافَقَ تَأْمِينُهُ تَأْمِينَ الْمَلَائِكَةِ، غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ» قَالَ ابْنُ شِهَابٍ كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «آمِينَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8480,
                "hadithNumber": "916",
                "englishNarrator": "Abu Huraira رضی ‌اللہ ‌عنہ ‌said:",
                "hadithEnglish": "I heard from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) the hadith like one transmitted by Malik, but he made no mention of the words of Shihab.",
                "hadithUrdu": "میں نے رسول اللہﷺ سے سنا ... ( آگے ) مالک کی مذکورہ بالا روایت کی طرح ہے ، البتہ یونس نے ابن شہاب کا قول بیان نہیں کیا ۔",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا,( مالک کے بجائے ) یونس نے ابن شہاب سے ، انہوں نے ابن مسیب اور ابو سلمہ بن عبد الرحمن سے روایت کی کہ حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا",
                "hadithArabic": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي ابْنُ الْمُسَيِّبِ، وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ مَالِكٍ وَلَمْ يَذْكُرْ قَوْلَ ابْنِ شِهَابٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8481,
                "hadithNumber": "917",
                "englishNarrator": "Abu Huraira رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: When anyone amongst you utters Amin in prayer and the angels in the sky also utter Amin, and this (utterance of the one) synchronises with (that of) the other, all his previous sins are pardoned.",
                "hadithUrdu": "رسول اللہﷺ نے فرمایا : ’’ جب تم میں سے کوئی نماز میں آمین کہے اور فرشتے آسمان میں آمین کہیں اور ایک آمین دوسری کے موافق ہو جائے تو اس کے پچھلے گناہ معاف کر دیے جاتے ہیں ۔ ‘ ‘",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، مجھ سے ابن وہب نے بیان کیا، مجھ سے عمرو نے بیان کیا,ابو یونس ( سلیم بن جبیر ) نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے حدیث بیان کی کہ",
                "hadithArabic": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، حَدَّثَنِي ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو، أَنَّ أَبَا يُونُسَ، حَدَّثَهُ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: إِذَا قَالَ أَحَدُكُمْ فِي الصَّلَاةِ: آمِينَ. وَالْمَلَائِكَةُ فِي السَّمَاءِ: آمِينَ. فَوَافَقَ إِحْدَاهُمَا الْأُخْرَى. غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8482,
                "hadithNumber": "918",
                "englishNarrator": "Abu Hurairah رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: When anyone amongst you utters Amin and the angels In the heaven also utter Amin and (the Amin) of the one synchronises with (that of) the other, all his previous sins are pardoned.",
                "hadithUrdu": "رسول اللہﷺ نے فرمایا : ’’ جب تم میں سے ایک شخص آمین کہے اور فرشتے آسمان میں آمین کہیں اور آمین دوسری کے موافق ہو جائے تو اس شخص کے پچھلے گناہ معاف کر دیے جاتے ہیں",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ القعنبی نے بیان کیا، کہا ہم سے المغیرہ نے بیان کیا، ان سے ابو الزناد نے، ان سے العرج نے، انہوں نے ابوہریرہ رضی اللہ عنہ سے، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ، حَدَّثَنَا الْمُغِيرَةُ، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: إِذَا قَالَ أَحَدُكُمْ: آمِينَ. وَالْمَلَائِكَةُ فِي السَّمَاءِ: آمِينَ. فَوَافَقَتْ إِحْدَاهُمَا الْأُخْرَى. غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8483,
                "hadithNumber": "919",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this is transmitted by Ma'mar from Hammam bin Munabbih on the authority of Abu Huraira رضی ‌اللہ ‌عنہ who reported it from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌).",
                "hadithUrdu": "ہم سے محمد بن رافع نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، کہا ہم سے معمر نے بیان کیا,ہمام بن منبہ نے ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انہوں نے نبیﷺ سے اسی ( گزشتہ حدیث ) کی طرح حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8484,
                "hadithNumber": "920",
                "englishNarrator": "Abu Huraira ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: When the reciter (Imam) utters: Not of those on whom (is Thine) wrath and not the erring ones, and (the person) behind him utters Amin and his utterance synchronises with that of the dwellers of heavens, all his previous sins would be pardoned.",
                "hadithUrdu": "رسول اللہﷺ نے فرمایا : ’’ جب قاری ﴿غير المغضوب عليهم والا الضالين﴾ کہے اور جو اس کے پیچھے ہے وہ ( بھی ) آمین کہے اور اس کا کہنا آسمان والوں کی کہی ہوئی ( آمین ) کے موافق ہو جائے تو اس کے پچھلے گناہ معاف کر دیے جاتے ہیں ۔ ‘ ‘",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا کہ ہم سے یعقوب نے، یعنی ابن عبدالرحمٰن نے بیان کیا,سہیل کے والد ابو صالح نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: إِذَا قَالَ الْقَارِئُ: {غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ} [الفاتحة: 7] فَقَالَ: مَنْ خَلْفَهُ: آمِينَ، فَوَافَقَ قَوْلُهُ قَوْلَ أَهْلِ السَّمَاءِ، غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8485,
                "hadithNumber": "921",
                "englishNarrator": "Anas bin Malik رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) fell down from a horse and his right side was grazed. We went to him to inquire after his health when the time of prayer came. He led us in prayer in a sitting posture and we said prayer behind him sitting, and when he finished the prayer hesaid: The Imam is appointed only to be followed; so when he recites takbir, you should also recite that; when he prostrates, you should also prostrate; when he rises up, you should also rise up, and when he said God listens to him who praises Him, you should say: Our Lord, to Thee be the praise, and when he prays sitting, all of you should pray sitting.",
                "hadithUrdu": "نبیﷺ گھوڑے سے گر گئے تو آپ کا دایاں پہلو چھل گیا ، ہم آپ کے ہاں آپ کی عیادت کے لیے حاضر ہوئے ، نماز کا وقت ہو گیا تو آپ نے ہمیں بیٹھ کر نماز پڑھائی ، چنانچھ ہم نے ( آپ کے اشارے پر ، حدیث 926 ۔ 928 ) آپ کے پیچھے بیٹھ کر نماز پڑھی ، پھر جب آپ نے نماز پوری کی تو فرمایا : ’’امام اسی لیے بنایا گیا کہ اس کی اقتدا کی جائے ، چنانچہ جب وہ تکبیر کہے تو تم تکبیر کہو ، جب وہ سجدہ کرے تو تم سجدہ کرو ، جب وہ ( سر ) اٹھائے تو تم ( سر ) اٹھاؤ اور جب وہ سمع الله لمن حمده ( اللہ نے اسے سن لیا جس نے اس کی حمد بیان کی ) کہے تو تم ربنا لك الحمد ( اے ہمارے رب! تیری ہی لیے سب تعریف ہے ) کہو اور جب وہ بیٹھ کر نماز پڑھے تو تم بھی بیٹھ کر نماز پڑھو ۔ ‘ ‘",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ، قتیبہ بن سعید، ابوبکر بن ابی شیبہ، عمرو ناقد، زہیر بن حرب اور ابو کریب نے ہم سے سفیان سے بیان کیا - ابوبکر نے کہا,سفیان بن عیینہ نے زہری سے حدیث بیان کی ، انہوں نے کہا کہ میں نے حضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنا ، وہ کہتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، وَأَبُو كُرَيْبٍ، جَمِيعًا عَنْ سُفْيَانَ - قَالَ أَبُو بَكْرٍ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ - عَنِ الزُّهْرِيِّ، قَالَ: سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يَقُولُ: سَقَطَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ فَرَسٍ فَجُحِشَ شِقُّهُ الْأَيْمَنُ، فَدَخَلْنَا عَلَيْهِ نَعُودُهُ، فَحَضَرَتِ الصَّلَاةُ، فَصَلَّى بِنَا قَاعِدًا، فَصَلَّيْنَا وَرَاءَهُ قُعُودًا، فَلَمَّا قَضَى الصَّلَاةَ قَالَ: إِنَّمَا جُعِلَ الْإِمَامُ لِيُؤْتَمَّ بِهِ، فَإِذَا كَبَّرَ فَكَبِّرُوا، وَإِذَا سَجَدَ فَاسْجُدُوا، وَإِذَا رَفَعَ فَارْفَعُوا وَإِذَا قَالَ: سَمِعَ اللهُ لِمَنْ حَمِدَهُ. فَقُولُوا: رَبَّنَا وَلَكَ الْحَمْدُ، وَإِذَا صَلَّى قَاعِدًا، فَصَلُّوا قُعُودًا أَجْمَعُونَ.",
                "headingArabic": "ائْتِمَامِ الْمَأْمُومِ بِالإِمَامِ ‏",
                "headingUrdu": "امام کی پیروی کرنا",
                "headingEnglish": "Following The Imam",
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8486,
                "hadithNumber": "922",
                "englishNarrator": "Anas bin Malik رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) fell down from a horse and he was grazed and he led the prayer for us sitting, and the rest of the hadith is the same.",
                "hadithUrdu": "رسول اللہﷺ گھوڑے سے گر گئے اور آپ کا ایک پہلو چھل گیا تو آپ نے ہمیں بیٹھ کر نماز پڑھائی .... آگے سابقہ حدیث کی طرح بیان کیا ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ہم سے لیث ایچ نے بیان کیا اور ہم سے محمد بن رومح نے بیان کیا،( سفیان کے بجائے ) لیث نے ابن شہاب ( زہری ) سے ، انہوں نے حضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ خَرَّ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ فَرَسٍ فَجُحِشَ فَصَلَّى لَنَا قَاعِدًا، ثُمَّ ذَكَرَ نَحْوَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8487,
                "hadithNumber": "923",
                "englishNarrator": "Anas bin Malik رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) fell down from a horse and his right side was grazed, and the rest of the hadith is the same with the addition of these words: When he (the Imam) says prayer standing, you should also do so.",
                "hadithUrdu": "رسول اللہﷺ گھوڑے سے گر گئے اور آپ کا دایاں پہلو چھل گیا ... پھر ان دونوں حضرات ( سفیان اور لیث ) کی روایت کے مانند روایت کی ، البتہ یونس نے یہ اضافہ کیا : ’’ اور جب وہ ( امام ) کھڑا ہو کر نماز پڑھے تو تم بھی کھڑے ہو کر نماز پڑھو.",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا,یونس نے ابن شہاب ( زہری ) سے روایت کی ، انہوں نے کہا : مجھے حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ صُرِعَ عَنْ فَرَسٍ فَجُحِشَ شِقُّهُ الْأَيْمَنُ، بِنَحْوِ حَدِيثِهِمَا وَزَادَ « فَإِذَا صَلَّى قَائِمًا فَصَلُّوا قِيَامًا» .",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8488,
                "hadithNumber": "924",
                "englishNarrator": "Anas ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) rode a horse and fell down from it and his right side was grazed, and the rest of the hadith is the same, and (these words) are found in it: When he (the Imam) says prayer in an erect posture, you should also say it in an erect posture.",
                "hadithUrdu": "رسول اللہﷺ گھوڑے پر سوار ہوئے اور اس سے گر پڑے ، اس سے آپ کا دایاں پہلو چھل گیا .... آگے مذکورہ بالا تینوں راویوں کی طرح روایت کی اور اس میں ( بھی یہ ) ہے : ’’ جب وہ ( امام ) کھڑا ہو کر نماز پڑھے تو تم بھی کھڑے ہو کر نماز پڑھو ۔ ‘ ‘",
                "urduNarrator": "ہم سے ابن ابی عمر نے بیان کیا، کہا ہم سے معن بن عیسیٰ نے بیان کیا,مالک بن انس نے زہری سے اور انہوں نے حضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا مَعْنُ بْنُ عِيسَى، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنِ الزُّهْرِيِّ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ رَكِبَ فَرَسًا فَصُرِعَ، عَنْهُ فَجُحِشَ شِقُّهُ الْأَيْمَنُ، بِنَحْوِ حَدِيثِهِمْ وَفِيهِ» إِذَا صَلَّى قَائِمًا فَصَلُّوا قِيَامًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 8176,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=327",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=325",
                "label": "325",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=326",
                "label": "326",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=327",
                "label": "327",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=328",
                "label": "328",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=329",
                "label": "329",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=330",
                "label": "330",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=331",
                "label": "331",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=329",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=329",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=327",
        "to": 8200,
        "total": 40465
    }
}