{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 511,
        "data": [
            {
                "id": 13039,
                "hadithNumber": "5476",
                "englishNarrator": "Ibn Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had made for himself a ring of silver, and he (wore it in his finger). then it was in Abu Bakr's finger. then it was in 'Umar's finger. then it was in 'Uthman's finger. until it fell into the well of Aris and it had these words engraved upon it (Muhammad, Messenger of Allah ﷺ). Ibn Numair narrated it with a slight variation of words.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے چا ندی کی ایک انگوٹھی بنوائی ، پہلے وہ آپ کے ہا تھ میں تھی پھر حضرت ابو بکر رضی اللہ عنہ کے ہا تھا میں رہی پھر حضرت عمر رضی اللہ عنہ کے ہا تھ میں رہی پھر حضرت عثمان رضی اللہ عنہ کے ہاتھ میں رہی یہاں تک کہ وہ ان ( حضرت عثمان رضی اللہ عنہ ) سےاریس کے کنویں میں گر گئی ، اس ( انگوٹھی ) پر \"\" محمد رسول اللہ صلی اللہ علیہ وسلم \"\" نقش تھا ۔ ابن نمیر کی روایت میں ہے : یہاں تک کہ وہ ایک کنویں میں گر گئی ، انھوں نے یہ نہیں کہا : ان سے ( گر گئی ۔ )",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا, عبد اللہ بن نمیر نے عبید اللہ سے ، انھوں نے نافع سے ، انھوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ عُبَيْدِ اللَّهِ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ اتَّخَذَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَاتَمًا مِنْ وَرِقٍ فَكَانَ فِي يَدِهِ ثُمَّ كَانَ فِي يَدِ أَبِي بَكْرٍ ثُمَّ كَانَ فِي يَدِ عُمَرَ ثُمَّ كَانَ فِي يَدِ عُثْمَانَ حَتَّى وَقَعَ مِنْهُ فِي بِئْرِ أَرِيسٍ نَقْشُهُ مُحَمَّدٌ رَسُولُ اللَّهِ قَالَ ابْنُ نُمَيْرٍ حَتَّى وَقَعَ فِي بِئْرِ وَلَمْ يَقُلْ مِنْهُ.",
                "headingArabic": "لُبْسِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَاتَمًا مِنْ وَرِقٍ نَقْشُهُ مُحَمَّدٌ رَسُولُ اللَّهِ وَلُبْسِ الْخُلَفَاءِ لَهُ مِنْ بَعْدِهِ",
                "headingUrdu": "رسول اللہ صلی اللہ علیہ وسلم چاندی کی انگوٹھی پہنتے تھے جس پر محمد رسول اللہ صلی اللہ علیہ وسلم کے الفاظ لکھے ہوئے تھے اور خلفائے راشدین اسے آپ کی وفات کے بعد پہنتے تھے۔",
                "headingEnglish": "The Prophet (SAW) Wore A Ring Of Silver On Which Was Inscribed The Words Muhammad Rasul Allah (Muhammad the Messenger of Allah), And The Caliphs Wore It After He Died",
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13040,
                "hadithNumber": "5477",
                "englishNarrator": "Ibn Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had made for himself a gold ring; then he discarded it, and then made for himself a silver ring, and had these words engraved upon it (Muhammad, Messenger of Allah ﷺ), and said: No one should engrave anything like the engraving of this signet ring of mine. And when he wore it, he kept its stone towards the inside of his palm, and it was this which fell down (from the hands) of Mu'ayqib into the well of Aris.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے سونے کی ایک انگوٹھی بنوائی ، پھر آپ نے اس کو پھینک دیا ، اس کے بعد آپ نے چاندی کی ایک انگوٹھی بنوائی ، اس میں یہ نقش کرایا : محمد رسول اللہ صلی اللہ علیہ وسلم \" اور فرمایا : \" کوئی شخص میری اس انگوٹھی کے نقش کے مطابق نقش نہ بنوائے ۔ \" جب آپ اس انگوٹھی کو پہنتے توانگوٹھی کے نگینے ( موٹے چوڑے حصے ) کو ہتھیلی کے اندر کی طرف کرلیاکرتے تھے اور یہی وہ انگوٹھی تھی جو معیقیب ( کے ہاتھ ) سے چاہ اریس میں گر گئی تھی ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، عمرو نا قد، محمد بن عباد اور ابن ابی عمر نے بیان کیا، اور یہ قول ابوبکر سے ہے، انہوں نے کہا کہ ہم سے سفیان نے بیان کیا۔ ابن عیینہ، ایوب ابن موسی کی سند سے, نافع نے حضرت ابن عمر رضی اللہ عنہ سے ر وایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَمُحَمَّدُ بْنُ عَبَّادٍ وَابْنُ أَبِي عُمَرَ وَاللَّفْظُ لِأَبِي بَكْرٍ قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَيُّوبَ بْنِ مُوسَى عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ اتَّخَذَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَاتَمًا مِنْ ذَهَبٍ ثُمَّ أَلْقَاهُ ثُمَّ اتَّخَذَ خَاتَمًا مِنْ وَرِقٍ وَنَقَشَ فِيهِ مُحَمَّدٌ رَسُولُ اللَّهِ وَقَالَ لَا يَنْقُشْ أَحَدٌ عَلَى نَقْشِ خَاتَمِي هَذَا وَكَانَ إِذَا لَبِسَهُ جَعَلَ فَصَّهُ مِمَّا يَلِي بَطْنَ كَفِّهِ وَهُوَ الَّذِي سَقَطَ مِنْ مُعَيْقِيبٍ فِي بِئْرِ أَرِيسٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13041,
                "hadithNumber": "5478",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had made for him a silver ring. and got engraved on it (Muhammad, Messenger of Allah ﷺ) and said to the people I have got made a ring of silver and engraved in it (these words) (Muhammad, Messenger of Allah ﷺ). So none should engrave these (words) like this engravement.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے چاندی کی ایک انگوٹھی بنوائی ، اس میں \" محمد رسول اللہ \" نقش کرایا اور لوگوں سے فرمایا؛ \" میں نے چاندی کی ایک انگوٹھی بنائی ہے اوراس میں \" محمد رسول اللہ \" نقش کرایا ہے ، سوکوئی شخص اس نقش کے مطابق نقش کندہ نہ کرائے ۔ \"",
                "urduNarrator": "ہمیں یحییٰ بن یحییٰ، خلف بن ہشام اور ابو الربیع العتکی نے بیان کیا, حماد نے ہمیں عبدالعزیز بن صہیب سے خبر دی ، انھوں نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَخَلَفُ بْنُ هِشَامٍ وَأَبُو الرَّبِيعِ الْعَتَكِيُّ كُلُّهُمْ عَنْ حَمَّادٍ قَالَ يَحْيَى أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اتَّخَذَ خَاتَمًا مِنْ فِضَّةٍ وَنَقَشَ فِيهِ مُحَمَّدٌ رَسُولُ اللَّهِ وَقَالَ لِلنَّاسِ إِنِّي اتَّخَذْتُ خَاتَمًا مِنْ فِضَّةٍ وَنَقَشْتُ فِيهِ مُحَمَّدٌ رَسُولُ اللَّهِ فَلَا يَنْقُشْ أَحَدٌ عَلَى نَقْشِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13042,
                "hadithNumber": "5479",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been reported on the authority of Anas رضی اللہ عنہ through another chain of transmitters but there is no mention of the words (Muhammad, Messenger of Allah ﷺ) in it.",
                "hadithUrdu": "اور ہم سے احمد بن حنبل، ابوبکر بن ابی شیبہ اور زہیر بن حرب نے بیان کیا، انہوں نے کہا: اسماعیل ( ابن علیہ ) نے عبدالعزیز بن صہیب سے حدیث بیان کی ، انھوں نے حضرت انس رضی اللہ عنہ سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی اور اس میں \" محمد رسول اللہ \" ( نقش کرانے ) کا ذکر نہیں کیا ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ قَالُوا حَدَّثَنَا إِسْمَعِيلُ يَعْنُونَ ابْنَ عُلَيَّةَ عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ عَنْ أَنَسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا وَلَمْ يَذْكُرْ فِي الْحَدِيثِ مُحَمَّدٌ رَسُولُ اللَّهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13043,
                "hadithNumber": "5480",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "When Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) decided to write letters to the Byzantine (Emperor) they (his Companions) told him that they would not read a letter unless it is sealed. (Then) Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had a silver ring made (for himself), (its shape is so vivid in my mind) as if I see its brightness in the band of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and its engravement was (Muhammad, Messenger of Allah ﷺ).",
                "hadithUrdu": "جب رسول اللہ صلی اللہ علیہ وسلم نے روم ( کے بادشاہ ) کی طرف خط لکھنے کاارادہ کیا تو صحابہ نےعرض کی : وہ لوگ کوئی ایسا خط نہیں پڑھتے جس پر مہر نہ لگائی گئی ہو ، کہا : تو رسول اللہ صلی اللہ علیہ وسلم نے چاندی کی ایک انگوٹھی کی ایک انگوٹھی بنوائی ، ایسالگتا ہے کہ میں اب بھی رسول اللہ صلی اللہ علیہ وسلم کے ہاتھوں میں اس کی سفیدی کو دیکھ رہا ہوں ، اس پر \" محمد رسول اللہ صلی اللہ علیہ وسلم \" نقش ہے ۔",
                "urduNarrator": "ہم سے محمد بن مثنیٰ اور ابن بشار نے بیان کیا، انہوں نے کہا: ہم سے محمد بن جعفر نے بیان کیا,شعبہ نے ہمیں حدیث بیان کی ، کہا : میں نے قتادہ کو حضرت انس بن مالک رضی اللہ عنہ سے حدیث بیان کرتے ہوئے سنا ، کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ قَتَادَةَ يُحَدِّثُ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ لَمَّا أَرَادَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَكْتُبَ إِلَى الرُّومِ قَالَ قَالُوا إِنَّهُمْ لَا يَقْرَءُونَ كِتَابًا إِلَّا مَخْتُومًا قَالَ فَاتَّخَذَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَاتَمًا مِنْ فِضَّةٍ كَأَنِّي أَنْظُرُ إِلَى بَيَاضِهِ فِي يَدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَقْشُهُ مُحَمَّدٌ رَسُولُ اللَّهِ.",
                "headingArabic": "فِي اتِّخَاذِ النَّبِيِّ صلى الله عليه وسلم خَاتَمًا لَمَّا أَرَادَ أَنْ يَكْتُبَ إِلَى الْعَجَمِ ‏‏",
                "headingUrdu": "نبی صلی اللہ علیہ وسلم نے جب غیر عربوں کو خط بھیجنا چاہا تو انگوٹھی حاصل کی۔",
                "headingEnglish": "The Prophet (SAW) Acquired A Ring When He Wanted To Send Letters To The Non-Arabs",
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13044,
                "hadithNumber": "5481",
                "englishNarrator": "Anas رضی اللہ عنہ reported:",
                "hadithEnglish": "When Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) decided to write (letters) to non-Arabs (i. e. Persian and Byzantine Emperors) it was said to him that the non-Arabs would not accept a letter but that having a seal over it; so he (the Holy Prophet ﷺ) got a silver ring made. He (Anas) said: I perceive as if I am looking at its brightness in his hand.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے اہل عجم کی طرف خط لکھنے کا ارادہ کیا تو آپ سے عرض کی گئی کہ وہ لوگ صرف اس خط کو قبول کرتے ہیں جس پر مہر لگی ہو ، اس پر رسول اللہ صلی اللہ علیہ وسلم نے چاندی کی ایک انگوٹھی بنوائی ۔ کہا : مجھے ایسا لگتا ہے کہ میں ( اب بھی ) رسول اللہ صلی اللہ علیہ وسلم کے ہاتھ میں اس ( انگوٹھی ) کی سفیدی کو دیکھ رہاہوں ۔",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا , معاذ بن ہشام نے ہمیں حدیث بیان کی ، کہا : مجھے میرے والد نے قتادہ سے حدیث سنائی ، انھوں نے حضرت انس رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ أَنَسٍ أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ أَرَادَ أَنْ يَكْتُبَ إِلَى الْعَجَمِ فَقِيلَ لَهُ إِنَّ الْعَجَمَ لَا يَقْبَلُونَ إِلَّا كِتَابًا عَلَيْهِ خَاتَمٌ فَاصْطَنَعَ خَاتَمًا مِنْ فِضَّةٍ قَالَ كَأَنِّي أَنْظُرُ إِلَى بَيَاضِهِ فِي يَدِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13045,
                "hadithNumber": "5482",
                "englishNarrator": "Anas رضی اللہ عنہ reported:",
                "hadithEnglish": "When Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) decided to write to the Kisra (the King of Persia), Caesar (Emperor of Rome), and the Negus (the Emperor of Abyssinia), it was said to him that they would not accept the letter without the seal over it; so Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) got a seal made, the ring of which was made of silver and there was engraved on it: Muhammad, the Messenger of Allah ﷺ.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے کسریٰ ، قیصر اور نجاشی کی طرف خط لکھنے کاارادہ فرمایا تو آپ سے عرض کی گئی کہ وہ لوگ صرف اس خط کو قبول کرتے ہیں جس پر مہر لگی ہو ، اس پر رسول اللہ صلی اللہ علیہ وسلم نے مہر ڈھلوائی ، وہ چاندی کی انگوٹھی تھی اور اس میں \" محمد رسول اللہ \" نقش کرایا ۔",
                "urduNarrator": "ہم سے نصر بن علی الجہضمی نے بیان کیا، کہا ہم سے نوح بن قیس نے بیان کیا, خالد بن قیس نے قتادہ سے ، انھوں نے حضرت انس رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا نُوحُ بْنُ قَيْسٍ عَنْ أَخِيهِ خَالِدِ بْنِ قَيْسٍ عَنْ قَتَادَةَ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرَادَ أَنْ يَكْتُبَ إِلَى كِسْرَى وَقَيْصَرَ وَالنَّجَاشِيِّ فَقِيلَ إِنَّهُمْ لَا يَقْبَلُونَ كِتَابًا إِلَّا بِخَاتَمٍ فَصَاغَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَاتَمًا حَلْقَتُهُ فِضَّةً وَنَقَشَ فِيهِ مُحَمَّدٌ رَسُولُ اللَّهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13046,
                "hadithNumber": "5483",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "I saw one day on the finger of Allah's Messenger (may peace be Upon him) a silver ring; so the people also got silver rings made and wore them Then Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) discarded his ring, and the people also discarded their rings.",
                "hadithUrdu": "میں نے ایک دن رسول اللہ صلی اللہ علیہ وسلم کے ہاتھ میں چاندی کی ایک انگوٹھی دیکھی ، پھر لوگوں نے بھی چاندی کی انگوٹھیاں بنوائیں اور پہن لیں ، پھر نبی کریم صلی اللہ علیہ وسلم نے اپنی انگوٹھی پھینک دی تو لوگوں نے بھی اپنی انگوٹھیاں پھینک دیں ۔",
                "urduNarrator": "مجھ سے ابو عمران محمد بن جعفر بن زیاد نے بیان کیا, ابراہیم بن سعد نے ہمیں ابن شہاب سے خبر دی ، انھوں نے حضرت انس رضی اللہ عنہ بن مالک سے روایت کی ایک",
                "hadithArabic": "حَدَّثَنِي أَبُو عِمْرَانَ مُحَمَّدُ بْنُ جَعْفَرِ بْنِ زِيَادٍ أَخْبَرَنَا إِبْرَاهِيمُ يَعْنِي ابْنَ سَعْدٍ عَنْ ابْنِ شِهَابٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّهُ أَبْصَرَ فِي يَدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَاتَمًا مِنْ وَرِقٍ يَوْمًا وَاحِدًا قَالَ فَصَنَعَ النَّاسُ الْخَوَاتِمَ مِنْ وَرِقٍ فَلَبِسُوهُ فَطَرَحَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَاتَمَهُ فَطَرَحَ النَّاسُ خَوَاتِمَهُمْ.",
                "headingArabic": "فِي طَرْحِ الْخَوَاتِمِ ‏.‏",
                "headingUrdu": "انگوٹھیوں کی پیشکش",
                "headingEnglish": "Discarding Rings",
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13047,
                "hadithNumber": "5484",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "One day he saw on the finger of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) a silver ring, and the people also made silver rings and put them on. Then Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) threw his ring away, and so the people also threw away their rings.",
                "hadithUrdu": "انھوں نے ایک دن رسول اللہ صلی اللہ علیہ وسلم کے ہاتھ میں چاندی کی ایک انگوٹھی دیکھی ، پھر سب لوگوں نے چاندی کی انگوٹھیاں ڈھلوائیں اور پہن لیں ، پھر نبی کریم صلی اللہ علیہ وسلم نے اپنی انگوٹھی پھینک دی تو لوگوں نے بھی اپنی اپنی انگوٹھیاں پھینک دیں ۔",
                "urduNarrator": "مجھ سے محمد بن عبداللہ بن نمیر نے بیان کیا, روح نے ہمیں حدیث بیان کی ، کہا : ہمیں ان جریج نے خبر دی ، کہا : مجھے زیاد نے بتایا کہ ابن شہاب نے انھیں خبر دی ، حضرت انس بن مالک رضی اللہ عنہ نے انھیں بتایا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا رَوْحٌ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي زِيَادٌ أَنَّ ابْنَ شِهَابٍ أَخْبَرَهُ أَنَّ أَنَسَ بْنَ مَالِكٍ أَخْبَرَهُ أَنَّهُ رَأَى فِي يَدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَاتَمًا مِنْ وَرِقٍ يَوْمًا وَاحِدًا ثُمَّ إِنَّ النَّاسَ اضْطَرَبُوا الْخَوَاتِمَ مِنْ وَرِقٍ فَلَبِسُوهَا فَطَرَحَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَاتَمَهُ فَطَرَحَ النَّاسُ خَوَاتِمَهُمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13048,
                "hadithNumber": "5485",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been reported on the authority of Ibn Juraij with the same chain of transmitters.",
                "hadithUrdu": "ہم سے عقبہ بن مکرم نے بیان کیا, ابو عاصم نے ابو جریج سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ الْعَمِّيُّ حَدَّثَنَا أَبُو عَاصِمٍ عَنْ ابْنِ جُرَيْجٍ بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13049,
                "hadithNumber": "5486",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "The ring of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was made of silver and it had an Abyssinian stone in it.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کی انگوٹھی چاندی کی تھی اور اس کانگینہ حبش کاتھا ۔",
                "urduNarrator": "ہم سے یحییٰ بن ایوب نے بیان کیا, عبداللہ بن وہب مصری نے کہا : مجھے یونس بن یزید نے ابن شہاب سے خبر دی ، کہا : مجھے حضرت انس بن مالک رضی اللہ عنہ نے حدیث بیان کی ، کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ الْمِصْرِيُّ أَخْبَرَنِي يُونُسُ بْنُ يَزِيدَ عَنْ ابْنِ شِهَابٍ حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ قَالَ كَانَ خَاتَمُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ وَرِقٍ وَكَانَ فَصُّهُ حَبَشِيًّا.",
                "headingArabic": "فِي خَاتَمِ الْوَرِقِ فَصُّهُ حَبَشِيٌّ ‏.‏",
                "headingUrdu": "حبشی پتھر کے ساتھ چاندی کی انگوٹھی",
                "headingEnglish": "Silver Ring With An Abyssinian Stone",
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13050,
                "hadithNumber": "5487",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) wore a silver ring on his right hand which had an Abyssinian stone in it, and he kept its stone towards the palm.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نےاپنے دائیں ہاتھ میں چاندی کی ایک انگوٹھی پہنی ، اس میں حبش کا نگینہ تھا ، آپ اس کے نگینے کو ہتھیلی کی طرف رکھا کرتے تھے ۔",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ اور عباد بن موسیٰ نے بیان کیا، کہا:طلحٰہ بن یحییٰ انصاری نے یونس سے ، انھوں نے ابن شہاب سے ، انھوں نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَعَبَّادُ بْنُ مُوسَى قَالَا حَدَّثَنَا طَلْحَةُ بْنُ يَحْيَى وَهُوَ الْأَنْصَارِيُّ ثُمَّ الزُّرَقِيُّ عَنْ يُونُسَ عَنْ ابْنِ شِهَابٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَبِسَ خَاتَمَ فِضَّةٍ فِي يَمِينِهِ فِيهِ فَصٌّ حَبَشِيٌّ كَانَ يَجْعَلُ فَصَّهُ مِمَّا يَلِي كَفَّهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13051,
                "hadithNumber": "5488",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Yunus bin Yazid with the same chain of transmitters.",
                "hadithUrdu": "مجھ سے زہیر بن حرب نے بیان کیا، مجھ سے اسماعیل بن ابی اویس نے بیان کیا, سلیمان بن بلال نے یونس بن یزید سے اسی سندکے ساتھ طلحہ بن یحییٰ کی حدیث کے مانند بیان کیا ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنِي إِسْمَعِيلُ بْنُ أَبِي أُوَيْسٍ حَدَّثَنِي سُلَيْمَانُ بْنُ بِلَالٍ عَنْ يُونُسَ بْنِ يَزِيدَ بِهَذَا الْإِسْنَادِ مِثْلَ حَدِيثِ طَلْحَةَ بْنِ يَحْيَى.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13052,
                "hadithNumber": "5489",
                "englishNarrator": "Anas رضی اللہ عنہ reported:",
                "hadithEnglish": "The ring of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was on this, and he pointed toward the little finger of his left hand.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کی انگوٹھی اس انگلی میں تھی ، یہ کہہ کر انھوں نے بائیں ہاتھ کی چھنگلی کی طرف اشارہ کیا ۔",
                "urduNarrator": "مجھ سے ابوبکر بن خلاد باہلی نے بیان کیا، ہم سے عبدالرحمٰن بن مہدی نے بیان کیا، ہم سے حماد بن سلمہ نے بیان کیا, ثابت نے حضرت انس رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنِي أَبُو بَكْرِ بْنُ خَلَّادٍ الْبَاهِلِيُّ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ ثَابِتٍ عَنْ أَنَسٍ قَالَ كَانَ خَاتَمُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي هَذِهِ وَأَشَارَ إِلَى الْخِنْصِرِ مِنْ يَدِهِ الْيُسْرَى.",
                "headingArabic": "فِي لُبْسِ الْخَاتَمِ فِي الْخِنْصَرِ مِنَ الْيَدِ ‏.‏",
                "headingUrdu": "چھوٹی انگلی میں انگوٹھی پہننا",
                "headingEnglish": "Wearing Rings On The Little Finger",
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13053,
                "hadithNumber": "5490",
                "englishNarrator": "Ali رضی اللہ عنہ reported:",
                "hadithEnglish": "He the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), forbade me that I should wear my ring in this (forefinger) or in that near it. 'Asim (one of the narrators in the chain of transmitters) said: He did not remember which of the two (fingers) he pointed out; and he forbade to wear Qassi material (silk garments), and to sit on the silk saddle cloth, and he said: As regards Qassi, it is a variegated garment which was brought from Egypt and h which had figures upon it, and as regards Mayathir, it is something which women prepared for their husbands as red cloths for their saddles.",
                "hadithUrdu": "آپ یعنی نبی کریم صلی اللہ علیہ وسلم نے مجھے اس انگلی یا اس کے پاس والی انگلی میں انگوٹھی پہننے سے منع فرمایا ۔ عاصم کو یہ یاد نہیں رہا کہ حضرت علی رضی اللہ عنہ نے کون سی دو انگلیوں میں ( پہننے سے منع کیا تھا ) ۔ ۔ ۔ اور آپ نےمجھے قس کے ریشمی کپڑے پہننے اور ریشمی گدوں پر بیٹھنے سے منع فرمایا ۔ انھوں نے ( حضر ت علی رضی اللہ عنہ ) نے کہا قَسَی ( ریشمی ) دھاریوں والا کپڑا مصر اور شام سے آتا تھا ، اس میں کچھ شبیہیں ( تصویروں جیسے نقش ونگار ) ہوتی ہیں ۔ اور میاثر اس کہتے ہیں جو عورتیں اپنے خاوندوں کی خاطر زین پر رکھنے کے لیے بناتی تھیں ، جس طرح ارغوانی رنگ کے گدے ہوں ۔",
                "urduNarrator": "مجھ سے محمد بن عبداللہ بن نمیر اور ابو کریب نے بیان کیا, ابن ادریس نے کہا , میں نے عاصم بن کلیب سے سنا ، انھوں نے ابو بردہ رضی اللہ عنہ سے ، انھوں نے حضر ت علی رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ وَأَبُو كُرَيْبٍ جَمِيعًا عَنْ ابْنِ إِدْرِيسَ وَاللَّفْظُ لِأَبِي كُرَيْبٍ حَدَّثَنَا ابْنُ إِدْرِيسَ قَالَ سَمِعْتُ عَاصِمَ بْنَ كُلَيْبٍ عَنْ أَبِي بُرْدَةَ عَنْ عَلِيٍّ قَالَ نَهَانِي يَعْنِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أَجْعَلَ خَاتَمِي فِي هَذِهِ أَوْ الَّتِي تَلِيهَا لَمْ يَدْرِ عَاصِمٌ فِي أَيِّ الثِّنْتَيْنِ وَنَهَانِي عَنْ لُبْسِ الْقَسِّيِّ وَعَنْ جُلُوسٍ عَلَى الْمَيَاثِرِ قَالَ فَأَمَّا الْقَسِّيِّ فَثِيَابٌ مُضَلَّعَةٌ يُؤْتَى بِهَا مِنْ مِصْرَ وَالشَّامِ فِيهَا شِبْهُ كَذَا وَأَمَّا الْمَيَاثِرُ فَشَيْءٌ كَانَتْ تَجْعَلُهُ النِّسَاءُ لِبُعُولَتِهِنَّ عَلَى الرَّحْلِ كَالْقَطَائِفِ الْأُرْجُوَانِ.",
                "headingArabic": "النَّهْىِ عَنِ التَّخَتُّمِ، فِي الْوُسْطَى وَالَّتِي تَلِيهَا ‏.‏",
                "headingUrdu": "درمیانی انگلی اور اس کے ساتھ والی انگلی میں انگوٹھی پہننے کی ممانعت",
                "headingEnglish": "The Prohibition Of Wearing Rings On The Middle Finger And The One That Is Next To It",
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13054,
                "hadithNumber": "5491",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been reported on the authority of 'Ali رضی اللہ عنہ through a different chain of transmitters.",
                "hadithUrdu": "ہم سے ابن ابی عمر نے بیان کیا, سفیان نے عاصم بن کلیب سے ، انھوں نے ابو موسیٰ ( اشعری رضی اللہ عنہ ) کے ایک بیٹے سے روایت کی ، انھوں نے کہا : میں نے حضرت علی رضی اللہ عنہ سے سنا ، پھر نبی کریم صلی اللہ علیہ وسلم سے اسی کے مطابق روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ عَاصِمِ بْنِ كُلَيْبٍ عَنْ ابْنٍ لَأَبِي مُوسَى قَالَ سَمِعْتُ عَلِيًّا فَذَكَرَ هَذَا الْحَدِيثَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13055,
                "hadithNumber": "5492",
                "englishNarrator": "Ali bin Abu Talib رضی اللہ عنہ reported:",
                "hadithEnglish": "He (Allah' s Apostle) forbade or forbade me. the rest of the hadith is the same.",
                "hadithUrdu": "انہوں نےمنع فرمایا ، یا مجھے منع فرمایا ، ان کی مراد نبی کریم صلی اللہ علیہ وسلم سے تھی ( اس کے بعد ) اسی طرح بیان کیا ۔",
                "urduNarrator": "ہم سے ابن المثنیٰ اور ابن بشار نے بیان کیا، کہا: ہم سے محمد بن جعفر نے بیان کیا, شعبہ نے عاصم بن کلیب سے روایت کی ، کہا : میں نے ابو بردہ رضی اللہ عنہ سے سنا ، انھوں نے کہا : میں نے حضرت علی بن ابی طالب رضی اللہ عنہ سے سنا ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا ابْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ عَاصِمِ بْنِ كُلَيْبٍ قَالَ سَمِعْتُ أَبَا بُرْدَةَ قَالَ سَمِعْتُ عَلِيَّ بْنَ أَبِي طَالِبٍ قَالَ نَهَى أَوْ نَهَانِي يَعْنِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ نَحْوَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13056,
                "hadithNumber": "5493",
                "englishNarrator": "Ali رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) forbade me that I should wear a ring in this and that finger of mine, and he pointed to the middle finger and the next one.",
                "hadithUrdu": "مجھے رسول اللہ صلی اللہ علیہ وسلم نے منع فرمایاتھا کہ میں ان دونوں میں سے کسی انگلی میں انگوٹھی پہنوں ، پھر انھوں نے درمیانی اور ( انگوٹھے کی طرف سے ) اس کے ساتھ والی انگلی کی طرف اشارہ کیا ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا, ابو احوص نے عاصم بن کلیب سے ، انھوں نے ابو بردہ رضی اللہ عنہ سے روایت کی ، کہا : حضر علی رضی اللہ عنہ نے مجھ سے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو الْأَحْوَصِ عَنْ عَاصِمِ بْنِ كُلَيْبٍ عَنْ أَبِي بُرْدَةَ قَالَ قَالَ عَلِيٌّ نَهَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أَتَخَتَّمَ فِي إِصْبَعِي هَذِهِ أَوْ هَذِهِ قَالَ فَأَوْمَأَ إِلَى الْوُسْطَى وَالَّتِي تَلِيهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13057,
                "hadithNumber": "5494",
                "englishNarrator": "Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "I heard Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saying during an expedition in which we also participated: Make a general practice of wearing sandals, for a man is riding as it were when he wears sandals.",
                "hadithUrdu": "میں نے ایک غزوے کے دوران میں ، جو ہم نے لڑا ، رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا : \" کثرت سے ( اکثر اوقات ) جوتے پہنا کرو ، کیونکہ آدمی جب تک جوتے پہن کر رکھتا ہے سوار ہوتا ہے ۔ ( اس کے پاؤں اسی طرح محفوظ رہتے ہیں جس طرح سوار کے اور وہ سوار ہی کی طرح تیزی سے چل سکتا ہے )",
                "urduNarrator": "مجھ سے سلمہ بن شبیب نے بیان کیا، کہا ہم سے حسن بن عیان نے بیان کیا، کہا ہم سے معقل نے بیان کیا, ابو زبیرنے حضرت جابر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ حَدَّثَنَا مَعْقِلٌ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي غَزْوَةٍ غَزَوْنَاهَا اسْتَكْثِرُوا مِنْ النِّعَالِ فَإِنَّ الرَّجُلَ لَا يَزَالُ رَاكِبًا مَا انْتَعَلَ.",
                "headingArabic": "اسْتِحْبَابِ لُبْسِ النِّعَالِ وَمَا فِي مَعْنَاهَا",
                "headingUrdu": "سینڈل وغیرہ پہننے کی سفارش کی جاتی ہے۔",
                "headingEnglish": "It Is Recommended To Wear Sandals et",
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13058,
                "hadithNumber": "5495",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When one of you puts on sandals, he should first put in the right foot, and when he takes off he should take off the left one first, or he should put them on together or take them off together.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم میں سے کوئی شخص جوتا پہنے تو دائیں ( پاؤں ) سے ابتدا کرے اور جب جوتا اتارے تو بائیں ( پاؤں ) سے ابتداکرے اور دونوں جوتے پہنے یا دونوں جوتے اتار دے ۔ \"",
                "urduNarrator": "ہم سے عبدالرحمٰن بن سلام الجمعی نے بیان کیا، کہا ہم سے الربیع بن مسلم نے بیان کیا, محمد بن زیاد نے ابو ہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَلَّامٍ الْجُمَحِيُّ حَدَّثَنَا الرَّبِيعُ بْنُ مُسْلِمٍ عَنْ مُحَمَّدٍ يَعْنِي ابْنَ زِيَادٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا انْتَعَلَ أَحَدُكُمْ فَلْيَبْدَأْ بِالْيُمْنَى وَإِذَا خَلَعَ فَلْيَبْدَأْ بِالشِّمَالِ وَلْيُنْعِلْهُمَا جَمِيعًا أَوْ لِيَخْلَعْهُمَا جَمِيعًا.",
                "headingArabic": "اسْتِحْبَابِ لُبْسِ النَّعْلِ فِي الْيُمْنَى أَوَّلًا وَالْخَلْعِ مِنْ الْيُسْرَى أَوَّلًا وَكَرَاهَةِ الْمَشْيِ فِي نَعْلٍ وَاحِدَةٍ",
                "headingUrdu": "جوتے کو پہلے داہنے پاؤں میں رکھنا اور پہلے بائیں پاؤں سے اتارنا مستحب ہے اور ایک جوتے میں چلنا ناپسندیدہ ہے۔",
                "headingEnglish": "It Is Recommended To Put Shoes On The Right Foot First, And To Take Them Off From The Left Foot First, And It Is Disliked To Walk In One Shoe",
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13059,
                "hadithNumber": "5496",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: None of you should walk in one sandal; either he should wear the two or should take off the two.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم میں سے کوئی شخص ایک جوتے میں نہ چلے ، دونوں جوتے پہنے یا دونوں جوتے اتار دے ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے مالک کو ابو الزناد کی سند سے پڑھا, اعرج نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَمْشِ أَحَدُكُمْ فِي نَعْلٍ وَاحِدَةٍ لِيُنْعِلْهُمَا جَمِيعًا أَوْ لِيَخْلَعْهُمَا جَمِيعًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13060,
                "hadithNumber": "5497",
                "englishNarrator": "Abu Razin رضی اللہ عنہ reported:",
                "hadithEnglish": "Abu Huraira رضی اللہ عنہ came to us and he struck his forehead with his hand and said: Behold I you talk amongst yourself that I attribute wrongly to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) (certain things) in order to guide you to the right path. In such a case, I would myself go astray. Listen. I bear testimony to the fact that I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) saying: When the thong of any one of you is broken, he should not walk in the second one until he has got it repaired.",
                "hadithUrdu": "حضرت ابو ہریرہ رضی اللہ عنہ ہمارے پاس آئے ، انھوں نے اپنی پیشانی پر ہاتھ مار کر فرمایا : سنو! کیا تم اس طرح کی باتیں کرتے ہوکہ میں رسول اللہ صلی اللہ علیہ وسلم کی طرف باتیں منسوب کرتا ہوں ۔ تاکہ تم ہدایت پاجاؤ اور میں خود گمراہ ہوجاؤں ، سن لو!میں گواہی دیتا ہوں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا : \" جب تم میں سے کسی شخص کے جوتے کا تسمہ ٹوٹ جائے تو وہ اس کو ٹھیک کرنے سے پہلے دوسرے ( جوتے ) میں نہ چلے ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا اور یہ قول ابو کریب کا ہے, ابن ادریس نے اعمش سے ، انھوں نے ابو رزین سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ وَاللَّفْظُ لِأَبِي كُرَيْبٍ قَالَا حَدَّثَنَا ابْنُ إِدْرِيسَ عَنْ الْأَعْمَشِ عَنْ أَبِي رَزِينٍ قَالَ خَرَجَ إِلَيْنَا أَبُو هُرَيْرَةَ فَضَرَبَ بِيَدِهِ عَلَى جَبْهَتِهِ فَقَالَ أَلَا إِنَّكُمْ تَحَدَّثُونَ أَنِّي أَكْذِبُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِتَهْتَدُوا وَأَضِلَّ أَلَا وَإِنِّي أَشْهَدُ لَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا انْقَطَعَ شِسْعُ أَحَدِكُمْ فَلَا يَمْشِ فِي الْأُخْرَى حَتَّى يُصْلِحَهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13061,
                "hadithNumber": "5498",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been reported on the authority of Abu Huraira رضی اللہ عنہ with a different chain of transmitters.",
                "hadithUrdu": "مجھے علی بن حجر السعدی نے روایت کیا ہے, علی بن مسہر نے کہا : ہمیں اعمش نے ابو رزین اور ابو صالح سے خبردی ، انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے اسی کے ہم معنی روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنِيهِ عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ أَخْبَرَنَا عَلِيُّ بْنُ مُسْهِرٍ أَخْبَرَنَا الْأَعْمَشُ عَنْ أَبِي رَزِينٍ وَأَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْمَعْنَى.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13062,
                "hadithNumber": "5499",
                "englishNarrator": "Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) forbade that a man should eat with the left hand or walk with one sandal or wrap himself completely leaving no opening for the arms (to draw out) or support himself when sitting with a single garment wrapped round his knees which may expose his private parts.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے اس بات سے منع فرمایا کہ آدمی اپنے بائیں ہاتھ سے کھائے ، یا ایک جوتا پہن کرچلے اور ایسا کپڑا پہنے جس میں باہر نکالنے والے اعضاء ( سر ، ہاتھ ، پاؤں ) کےلیے سوراخ نہ ہوں اور ایک ہی کپڑا اس طرح کمر اور گھٹنوں کے گرد باندھے کہ اس کی شرمگاہ ظاہر ہو ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, مالک بن انس نے ابو زبیر سے ، انھوں نے حضرت جابر رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكِ بْنِ أَنَسٍ فِيمَا قُرِئَ عَلَيْهِ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يَأْكُلَ الرَّجُلُ بِشِمَالِهِ أَوْ يَمْشِيَ فِي نَعْلٍ وَاحِدَةٍ وَأَنْ يَشْتَمِلَ الصَّمَّاءَ وَأَنْ يَحْتَبِيَ فِي ثَوْبٍ وَاحِدٍ كَاشِفًا عَنْ فَرْجِهِ.",
                "headingArabic": "النهي عن اشتمال الصماء، والاحتباء في ثوب واحد كاشفاً بعض عورته وحكم الاستلقاء علىٰ ظهره رافعًا إحدىٰ رجليه على الأخرى",
                "headingUrdu": "استمال السماء کی ممانعت (جس میں بازوؤں کے نکلنے کی گنجائش نہ ہو اپنے آپ کو مکمل طور پر کپڑے میں لپیٹنا) اور الاحتیبہ (خود کو لپیٹنا) ایک ہی لباس میں ٹانگوں کے ساتھ پیٹ تک کھینچا جائے جو عروہ کا کچھ حصہ ظاہر کرے اور ایک ٹانگ کے اوپری حصے پر۔",
                "headingEnglish": "The Prohibition Of Ishtimal As-Samma' (Wrapping Oneself Up Entirely In One's Garment With No Room For The Arms To Emerge), And Al-Ihtiba' (Wrapping Oneself Up) In A Single Garment With The Legs Drawn Up To The Belly Exposing Part Of The 'Awrah, And the ruling on lying on one's back with one leg on top of the other",
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13063,
                "hadithNumber": "5500",
                "englishNarrator": "Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When the thong of the shoe of any one of you is cut off. he should not walk with one sandal until he has got the thong repaired, and he should not walk with one shoe and he should not eat with his left hand and should not wrap his cloth round his knees or wrap himself completely leaving no room for the arms.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ( یاانھوں نے کہا : ) ۔ میں نے یہ رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : ۔ ۔ ۔ \" جب تم میں سے کسی کا تسمہ ٹوٹ جائے ۔ یا ( فرمایا ) جس شخص کے جوتے کا تسمہ ٹوٹ جائے ۔ تو وہ ایک ( ہی ) جوتے میں نہ چلے ۔ یہاں تک کہ اپنا تسمہ ٹھیک کرلے ، ایک موزے میں بھی نہ چلے ، اپنے بائیں ہاتھ سے نہ کھائے ، نہ ( اکڑوں بیٹھ کر ) اکلوتے کپڑے کوکمر اور گھٹنوں کے گرد باندھے ، نہ ہاتھ پاؤں بند کردینے والا لباس پہنے ۔ \"",
                "urduNarrator": "ہم سے احمد بن یونس نے بیان کیا، ہم سے زہیر نے بیان کیا، ہم سے ابو الزبیر نے جابر  کی سند سے بیان کیا، ہم سے یحییٰ بن یحییٰ نے بیان کیا, ابو خیثمہ ( زہیر ) نے ابو زبیر سے ، انھوں نے حضرت جابر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ  و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى حَدَّثَنَا أَبُو خَيْثَمَةَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا انْقَطَعَ شِسْعُ أَحَدِكُمْ أَوْ مَنْ انْقَطَعَ شِسْعُ نَعْلِهِ فَلَا يَمْشِ فِي نَعْلٍ وَاحِدَةٍ حَتَّى يُصْلِحَ شِسْعَهُ وَلَا يَمْشِ فِي خُفٍّ وَاحِدٍ وَلَا يَأْكُلْ بِشِمَالِهِ وَلَا يَحْتَبِي بِالثَّوْبِ الْوَاحِدِ وَلَا يَلْتَحِفْ الصَّمَّاءَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 12751,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=510",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=508",
                "label": "508",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=509",
                "label": "509",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=510",
                "label": "510",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=511",
                "label": "511",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=512",
                "label": "512",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=513",
                "label": "513",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=514",
                "label": "514",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=512",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=512",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=510",
        "to": 12775,
        "total": 40465
    }
}