{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 569,
        "data": [
            {
                "id": 14489,
                "hadithNumber": "6926",
                "englishNarrator": "Abu Dharr رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Should I not inform you about the words liked most by Allah? I said: Allah's Messenger, do inform me about the words liked most by Allah. He said: Verily, the words liked most by Allah are: hallowed be Allah and praise is due to Him.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کیا میں تمہیں وہ کلمہ نہ بتاؤں جو اللہ تعالیٰ کو سب سے زیادہ محبوب ہے؟ \" میں نے کہا : اللہ کے رسول! مجھے وہ کلمہ بتائیے جو اللہ تعالیٰ کو سب سے زیادہ محبوب ہے ، تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ تعالیٰ کو سب سےزیادہ محبوب کلمہ سبحان الله وبحمده ہے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا۔ ہم سے یحییٰ بن ابی بکر نے بیان کیا, شعبہ نے جریر سے ، انہوں نے ابوعبداللہ جسری سے جو عنزہ قبیلے سے تھے ، انہوں نے عبداللہ بن صامت سے اور انہوں نے حضرت ابوذر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ عَنْ شُعْبَةَ عَنْ الْجُرَيْرِيِّ عَنْ أَبِي عَبْدِ اللَّهِ الْجِسْرِيِّ مِنْ عَنَزَةَ عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ عَنْ أَبِي ذَرٍّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا أُخْبِرُكَ بِأَحَبِّ الْكَلَامِ إِلَى اللَّهِ قُلْتُ يَا رَسُولَ اللَّهِ أَخْبِرْنِي بِأَحَبِّ الْكَلَامِ إِلَى اللَّهِ فَقَالَ إِنَّ أَحَبَّ الْكَلَامِ إِلَى اللَّهِ سُبْحَانَ اللَّهِ وَبِحَمْدِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14490,
                "hadithNumber": "6927",
                "englishNarrator": "Abu Dharda رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: There is no believing servant who supplicates for his brother behind his back (in his absence) that the Angels do not say: The same be for you too.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کوئی مسلمان بندہ نہیں جو اپنے بھائی کی پیٹھ پیچھے اس کے لیے دعا کرے ، مگر ایک فرشتہ ( ہے جو ) کہتا ہے : تمہیں بھی اس کے مانند ملے ۔ \"",
                "urduNarrator": "مجھ سے احمد بن عمر بن حفص وکیع نے بیان کیا، کہا ہم سے فضیل نے طلحہ بن عبیداللہ بن کریز سے ، انہوں نے ام درداء سے اور انہوں نے حضرت ابو درداء رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي أَحْمَدُ بْنُ عُمَرَ بْنِ حَفْصٍ الْوَكِيعِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ حَدَّثَنَا أَبِي عَنْ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ بْنِ كَرِيزٍ عَنْ أُمِّ الدَّرْدَاءِ عَنْ أَبِي الدَّرْدَاءِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ عَبْدٍ مُسْلِمٍ يَدْعُو لِأَخِيهِ بِظَهْرِ الْغَيْبِ إِلَّا قَالَ الْمَلَكُ وَلَكَ بِمِثْلٍ",
                "headingArabic": "فَضْلِ الدُّعَاءِ لِلْمُسْلِمِينَ بِظَهْرِ الْغَيْبِ ‏‏",
                "headingUrdu": "مسلمانوں کے لیے ان کی غیر موجودگی میں نماز پڑھنے کی فضیلت",
                "headingEnglish": "The Virtue Of Praying For The Muslims In Their Absence",
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14491,
                "hadithNumber": "6928",
                "englishNarrator": "Umm Darda' رضی اللہ عنہا reported:",
                "hadithEnglish": "My husband reported that he heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: He who supplicates for his brother behind his back (in his absence), the Angel commissioned (for carrying supplication to his Lord) says: Ameen, and it is for you also.",
                "hadithUrdu": "میرے آقا ( خاوند ) نے مجھ سے بیان کیا کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا : \" جس شخص نے اپنے بھائی کے لیے اس کی پیٹھ پیچھے دعا کی تو جو فرشتہ اس کے ساتھ مقرر ہے وہ کہتا ہے : آمین اور تمہیں بھی اسی کے مانند عطا ہو ۔ \"",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے نضر بن شمائل نے بیان کیا,  موسیٰ بن سروان معلم نے ہمیں حدیث بیان کی ، کہا : مجھے طلحہ بن عبیداللہ بن کریز نے حدیث بیان کی ، کہا : مجھے حضرت ام درداء رضی اللہ عنہا نے حدیث بیان کی ، کہا",
                "hadithArabic": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا النَّضْرُ بْنُ شُمَيْلٍ حَدَّثَنَا مُوسَى بْنُ سَرْوَانَ الْمُعَلِّمُ حَدَّثَنِي طَلْحَةُ بْنُ عُبَيْدِ اللَّهِ بْنِ كَرِيزٍ قَالَ حَدَّثَتْنِي أُمُّ الدَّرْدَاءِ قَالَتْ حَدَّثَنِي سَيِّدِي أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ دَعَا لِأَخِيهِ بِظَهْرِ الْغَيْبِ قَالَ الْمَلَكُ الْمُوَكَّلُ بِهِ آمِينَ وَلَكَ بِمِثْلٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14492,
                "hadithNumber": "6929",
                "englishNarrator": "Safwan (and he was Ibn 'Abdullah bin Safwan, and he had been married to Umm Darda') reported:",
                "hadithEnglish": "I visited Abu Darda's رضی اللہ عنہ house in Syria. I did not find him there but Umm Darda' رضی اللہ عنہا (was present at the house). She said: Do you intend to perform Hajj during this year? I said: Yes. She said: Do supplicate Allah for blessings upon us, for Allah's Apostle (may peace be upon hiin) used to say: The supplication of a Muslim for his brother at his back (in his absence) is responded so long as he makes a supplica- tion for blessings for his brother and the commissioned Angel says: Amen, and says: You will have something similar.",
                "hadithUrdu": "اور میں شام آیا تو حضرت ابودرداء رضی اللہ عنہ کے ہاں ان کے گھر گیا ، وہ نہیں ملے ، میں حضرت ام درداء رضی اللہ عنہا سے ملا تو انہوں نے کہا : کیا تم اس سال حج کا ارادہ رکھتے ہو؟ میں نے کہا : جی ہاں ۔ انہوں نے کہا : ہمارے لیے خیر کی دعا کرنا کیونکہ نبی صلی اللہ علیہ وسلم فرمایا کرتے تھے : \" مسلمان کی اپنے بھائی کے لیے اس کی پیٹھ پیچھے کی گئی دعا مستجاب ہوتی ہے ، اس کے سر کے قریب ایک فرشتہ مقرر ہوتا ہے ، وہ جب بھی اپنے بھائی کے لیے دعائے خیر کرتا ہے تو مقرر کیا ہوا فرشتہ اس پر کہتا ہے : آمین ، اور تمہیں بھی اسی کے مانند عطا ہو ۔ \"",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا, عیسیٰ بن یونس نے کہا ,  ہمیں عبدالملک بن ابی سلیمان نے ابوزبیر سے حدیث بیان کی ، انہوں نے عبداللہ بن صفوان کے بیٹے صفوان سے روایت کی ، ( حضرت ابودرداء رضی اللہ عنہ کی بیٹی ) درداء ، ان ( صفوان ) کی زوجیت میں تھی ، وہ کہتے ہیں",
                "hadithArabic": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ أَبِي سُلَيْمَانَ عَنْ أَبِي الزُّبَيْرِ عَنْ صَفْوَانَ وَهُوَ ابْنُ عَبْدِ اللَّهِ بْنِ صَفْوَانَ وَكَانَتْ تَحْتَهُ الدَّرْدَاءُ قَالَ قَدِمْتُ الشَّامَ فَأَتَيْتُ أَبَا الدَّرْدَاءِ فِي مَنْزِلِهِ فَلَمْ أَجِدْهُ وَوَجَدْتُ أُمَّ الدَّرْدَاءِ فَقَالَتْ أَتُرِيدُ الْحَجَّ الْعَامَ فَقُلْتُ نَعَمْ قَالَتْ فَادْعُ اللَّهَ لَنَا بِخَيْرٍ فَإِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ دَعْوَةُ الْمَرْءِ الْمُسْلِمِ لِأَخِيهِ بِظَهْرِ الْغَيْبِ مُسْتَجَابَةٌ عِنْدَ رَأْسِهِ مَلَكٌ مُوَكَّلٌ كُلَّمَا دَعَا لِأَخِيهِ بِخَيْرٍ قَالَ الْمَلَكُ الْمُوَكَّلُ بِهِ آمِينَ وَلَكَ بِمِثْلٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14493,
                "hadithNumber": "6930",
                "englishNarrator": null,
                "hadithEnglish": "(Safwan said:) \"Then I went out to the market and I met Abu Ad-Darda رضی اللہ عنہا, and he said something similar to me, narrated it from the prophet ﷺ.\"",
                "hadithUrdu": "( صفوان نے ) کہا : میں بازار کی طرف نکلا تو حضرت ابودرداء رضی اللہ عنہ سے بھی میری ملاقات ہوئی ، انہوں نے بھی نبی صلی اللہ علیہ وسلم سے روایت کرتے ہوئے مجھ سے وہی کچھ کہا ( جو ان کی بیوی حضرت ام درداء رضی اللہ عنہا نے کہا تھا ۔ )",
                "urduNarrator": null,
                "hadithArabic": "قَالَ فَخَرَجْتُ إِلَى السُّوقِ فَلَقِيتُ أَبَا الدَّرْدَاءِ فَقَالَ لِي مِثْلَ ذَلِكَ يَرْوِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14494,
                "hadithNumber": "6931",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Safwan bin 'Abdullah bin Safwan with the same chain of transmitters.",
                "hadithUrdu": "اور ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, یزید بن ہارون نے عبدالملک بن ابی سلیمان سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ، اور کہا : صفوان بن عبداللہ بن صفوان سے روایت ہے ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ بِهَذَا الْإِسْنَادِ مِثْلَهُ وَقَالَ عَنْ صَفْوَانَ بْنِ عَبْدِ اللَّهِ بْنِ صَفْوَانَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14495,
                "hadithNumber": "6932",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Allah is pleased with His servant who says: Al-Hamdu lillah while taking a morsel of food and while drinking.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : اللہ تعالیٰ اس بات پر ( اپنے ) بندے سے راضی ہوتا ہے کہ وہ ایک کھانا کھائے اور اس پر اللہ کی حمد کرے یا پینے کی کوئی چیز ( پانی ، دودھ وغیرہ ) پیے اور اس پر اللہ کی حمد کرے ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابن نمیر نے بیان کیا اور اس کا قول ابن نمیر کا ہے۔ کہنے لگے, ابواسامہ اور محمد بن بشر نے زکریا بن ابی زائدہ سے ، انہوں نے سعید بن ابی بُردہ سے اور انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَابْنُ نُمَيْرٍ وَاللَّفْظُ لِابْنِ نُمَيْرٍ قَالَا حَدَّثَنَا أَبُو أُسَامَةَ وَمُحَمَّدُ بْنُ بِشْرٍ عَنْ زَكَرِيَّاءَ بْنِ أَبِي زَائِدَةَ عَنْ سَعِيدِ بْنِ أَبِي بُرْدَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ لَيَرْضَى عَنْ الْعَبْدِ أَنْ يَأْكُلَ الْأَكْلَةَ فَيَحْمَدَهُ عَلَيْهَا أَوْ يَشْرَبَ الشَّرْبَةَ فَيَحْمَدَهُ عَلَيْهَا.",
                "headingArabic": "اسْتِحْبَابِ حَمْدِ اللَّهِ تَعَالَى بَعْدَ الأَكْلِ وَالشُّرْبِ ‏‏",
                "headingUrdu": "کھانے پینے کے بعد اللہ کی حمد و ثنا کرنا مستحب ہے۔",
                "headingEnglish": "It Is Recommend To Praise Allah After Eating And Drinking",
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14496,
                "hadithNumber": "6933",
                "englishNarrator": null,
                "hadithEnglish": "It was narrated that Anas bin Malik رضی اللہ عنہ said: \"The Messenger of Allah ﷺ said...\" a similar report (a Hadith no. 6932).",
                "hadithUrdu": "مجھ سے زہیر بن حرب نے بیان کیا, اسحٰق بن یوسف ازرق نے کہا : ہمیں زکریا بن ابی زائدہ نے سعید بن ابی بُردہ سے حدیث بیان کی ، انہوں نے انس بن مالک رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، ( آگے ) اسی کے مانند ( ہے ۔ )",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا إِسْحَقُ بْنُ يُوسُفَ الْأَزْرَقُ حَدَّثَنَا زَكَرِيَّاءُ  بْنِ أَبِي زَائِدَةَ، عَنْ سَعِيدِ بْنِ أَبِي بُرْدَةَ، عَنْ أَنَسِ بْنِ، مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14497,
                "hadithNumber": "6934",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: The supplication of every one of you is granted if he does not grow impatient and says: I supplicated but it was not granted.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم میں سے کسی شخص کی دعا اس وقت تک قبول ہوتی ہے جب تک وہ جلد بازی کرتے ہوئے یہ نہیں کہتا : میں نے دعا کی ، لیکن میرے حق میں قبول نہیں ہوتی ۔ ۔ یا نہیں ہوئی ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا , امام مالک نے ابن شہاب سے ، انہوں نے ابن ازہر کے آزاد کردہ غلام ابوعبید سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي عُبَيْدٍ مَوْلَى ابْنِ أَزْهَرَ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يُسْتَجَابُ لِأَحَدِكُمْ مَا لَمْ يَعْجَلْ فَيَقُولُ قَدْ دَعَوْتُ فَلَا أَوْ فَلَمْ يُسْتَجَبْ لِي.",
                "headingArabic": "بَيَانِ أَنَّهُ يُسْتَجَابُ لِلدَّاعِي مَا لَمْ يَعْجَلْ فَيَقُولُ دَعَوْتُ فَلَمْ يُسْتَجَبْ لِي ‏‏",
                "headingUrdu": "یہ اس کے لیے مستحب ہے جس نے دعا کی ہے کہ وہ بے صبری نہ کرے۔ اور یہ نہ کہنا: \"میں نے دعا کی اور کوئی جواب نہیں ملا\"",
                "headingEnglish": "It Is Recommended For The One Who Supplicated Not To Be Impatient. And Not To Say: \"I Supplicated And Received No Response\"",
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14498,
                "hadithNumber": "6935",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The supplication of one of you is granted if he does not grow impatient and say- I supplicated my Lord but it was not granted.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم میں سے کسی بھی شخص کی دعا قبول ہوتی ہے جب تک وہ جلد بازی نہ کرے اور یہ ( نہ ) کہے : میں نے اپنے رب سے دعا کی تو اس نے مجھے میری دعا کا جواب نہیں دیا ( میری دعا قبول نہیں کی ۔ ) \"",
                "urduNarrator": "مجھ سے عبدالملک بن شعیب بن لیث نے بیان کیا، مجھ سے میرے والد نے میرے دادا کے بارے میں بیان کیا, عقیل بن خالد نے ابن شہاب سے روایت کی ، انہوں نے کہا : مجھے عبدالرحمٰن بن عوف رضی اللہ عنہ کے آزاد کردہ غلام ابوعبید نے حدیث بیان کی ۔ ۔ اور وہ قراء اور اہل فقہ میں سے ہیں ۔ ۔ انہوں نے کہا : میں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا ، وہ کہتے ہیں کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ لَيْثٍ حَدَّثَنِي أَبِي عَنْ جَدِّي حَدَّثَنِي عُقَيْلُ بْنُ خَالِدٍ عَنْ ابْنِ شِهَابٍ أَنَّهُ قَالَ حَدَّثَنِي أَبُو عُبَيْدٍ مَوْلَى عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ وَكَانَ مِنْ الْقُرَّاءِ وَأَهْلِ الْفِقْهِ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُسْتَجَابُ لِأَحَدِكُمْ مَا لَمْ يَعْجَلْ فَيَقُولُ قَدْ دَعَوْتُ رَبِّي فَلَمْ يَسْتَجِبْ لِي.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14499,
                "hadithNumber": "6936",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The supplication of the servant is granted in case he does not supplicate for sin or for severing the ties of blood, or he does not become impatient. It was said: Allah's Messenger, what does: If he does not grow impatient imply? He said: That he should say like this: I supplicated and I supplicated but I did not find it being responded. and then he becomes frustrated and abandons supplication.",
                "hadithUrdu": "آپ نے فرمایا : \" جب تک کوئی بندہ گناہ یا قطع رحمی کی دعا نہ کرے اور قبولیت کے معاملے میں جلد بازی نہ کرے ، اس کی دعا قبول ہوتی رہتی ہے ۔ \" عرض کی گئی : اللہ کے رسول! جلد بازی کرنا کیا ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا : \" وہ کہے : میں نے دعا کی اور میں نے دعا کی اور مجھے نظر نہیں آتا کہ وہ میرے حق میں قبول کرے گا ، پھر اس مرحلے میں ( مایوس ہو کر ) تھک جائے اور دعا کرنا چھوڑ دے ۔ \"",
                "urduNarrator": "مجھ سے ابو الطاہر نے بیان کیا، ہم سے ابن وہب نے بیان کیا، مجھ سے معاویہ نے جو ابن صالح ہیں، ربیعہ بن یزید کی سند سے بیان کیا, ابوادریس خولانی نے حضرت ابوہریرہ رضی اللہ عنہ سے ، انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي مُعَاوِيَةُ وَهُوَ ابْنُ صَالِحٍ عَنْ رَبِيعَةَ بْنِ يَزِيدَ عَنْ أَبِي إِدْرِيسَ الْخَوْلَانِيِّ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ لَا يَزَالُ يُسْتَجَابُ لِلْعَبْدِ مَا لَمْ يَدْعُ بِإِثْمٍ أَوْ قَطِيعَةِ رَحِمٍ مَا لَمْ يَسْتَعْجِلْ قِيلَ يَا رَسُولَ اللَّهِ مَا الِاسْتِعْجَالُ قَالَ يَقُولُ قَدْ دَعَوْتُ وَقَدْ دَعَوْتُ فَلَمْ أَرَ يَسْتَجِيبُ لِي فَيَسْتَحْسِرُ عِنْدَ ذَلِكَ وَيَدَعُ الدُّعَاءَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14500,
                "hadithNumber": "6937",
                "englishNarrator": "Usama bin Zaid رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger (ﷺ) said: I stood at the door of Paradise and I found that the overwhelming majority of those who entered therein was that of poor persons and the wealthy persons were detained to get into that. The denizens of Hell were commanded to get into Hell, and I stood upon the door of Fire and the majority amongst them who entered there was that of women.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" میں جنت کے دروازے پر کھڑا ہوا تو زیادہ تر لوگ جو اس میں داخل ہوئے ، مسکین تھے اور میں نے دیکھا کہ مال و متاع والے ( جنتی ) باہر روکے ہوئے تھے ، سوائے ( مالدار ) دوزخیوں کے ، انہیں جہنم میں ڈالنے کا حکم ( فورا ہی ) صادر کر دیا گیا تھا ۔ اور میں جہنم کے دروازے پر کھڑا ہوا تو دیکھا کہ اس میں داخل ہونے والی بیشتر عورتیں تھیں ۔ \"",
                "urduNarrator": "ہم سے حداب بن خالد نے بیان کیا, حماد بن سلمہ ، معاذ بن معاذ ، عنبری ، معتمر ، جریر اور یزید بن زُریع نے کہا : ہمیں سلیمان تیمی نے ابوعثمان سے حدیث بیان کی ، انہوں نے حضرت اسامہ بن زید رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ ح و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ الْعَنْبَرِيُّ ح و حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى حَدَّثَنَا الْمُعْتَمِرُ ح و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا جَرِيرٌ كُلُّهُمْ عَنْ سُلَيْمَانَ التَّيْمِيِّ ح و حَدَّثَنَا أَبُو كَامِلٍ فُضَيْلُ بْنُ حُسَيْنٍ وَاللَّفْظُ لَهُ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا التَّيْمِيُّ عَنْ أَبِي عُثْمَانَ عَنْ أُسَامَةَ بْنِ زَيْدٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُمْتُ عَلَى بَابِ الْجَنَّةِ فَإِذَا عَامَّةُ مَنْ دَخَلَهَا الْمَسَاكِينُ وَإِذَا أَصْحَابُ الْجَدِّ مَحْبُوسُونَ إِلَّا أَصْحَابَ النَّارِ فَقَدْ أُمِرَ بِهِمْ إِلَى النَّارِ وَقُمْتُ عَلَى بَابِ النَّارِ فَإِذَا عَامَّةُ مَنْ دَخَلَهَا النِّسَاءُ.",
                "headingArabic": "أَكْثَرُ أَهْلِ الْجَنَّةِ الْفُقَرَاءُ وَأَكْثَرُ أَهْلِ النَّارِ النِّسَاءُ وَبَيَانِ الْفِتْنَةِ بِالنِّسَاءِ",
                "headingUrdu": "\"جنت والوں میں سے اکثر غریب ہیں، اور جہنمیوں میں سے اکثر عورتیں ہیں، اور عورتوں کا فتنہ\"",
                "headingEnglish": "\"Most Of The People Of Paradise Are Poor, And Most Of The Inhabitants Of The Fire Are Women, And The Fitnah Of Women\"",
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14501,
                "hadithNumber": "6938",
                "englishNarrator": "Ibn Abbas  رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: I had a chance to look into the Paradise and I found that majority of the people was poor and I looked into the Fire and there I found the majority constituted by women.",
                "hadithUrdu": "حضرت محمد صلی اللہ علیہ وسلم نے فرمایا : \" میں نے جنت کے اندر جھانک کر دیکھا تو میں نے اہل جنت میں اکثریت فقراء کی دیکھی اور میں نے دوزخ میں جھانک کر دیکھا تو میں نے دوزخ میں اکثریت عورتوں کی دیکھی ۔ \"",
                "urduNarrator": "ہم سے زہیر بن حرب نے بیان کیا, اسماعیل بن ابراہیم نے ایوب سے ، انہوں نے ابورجاء عطاروی سے روایت کی ، انہوں نے کہا : میں نے حضرت ابن عباس رضی اللہ عنہ کو بیان کرتے ہوئے سنا کہ",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ عَنْ أَيُّوبَ عَنْ أَبِي رَجَاءٍ الْعُطَارِدِيِّ قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُ قَالَ مُحَمَّدٌ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اطَّلَعْتُ فِي الْجَنَّةِ فَرَأَيْتُ أَكْثَرَ أَهْلِهَا الْفُقَرَاءَ وَاطَّلَعْتُ فِي النَّارِ فَرَأَيْتُ أَكْثَرَ أَهْلِهَا النِّسَاءَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14502,
                "hadithNumber": "6939",
                "englishNarrator": null,
                "hadithEnglish": "Ayyub narrated it with this chain of narrators (a Hadith similar to no. 6938).",
                "hadithUrdu": "ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے( عبدالوہاب ) ثقفی نے بتایا : ایوب نے ہمیں اسی سند کے ساتھ ( یہی ) حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَاه إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا الثَّقَفِيُّ أَخْبَرَنَا أَيُّوبُ بِهَذَا الْإِسْنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14503,
                "hadithNumber": "6940",
                "englishNarrator": "Ibn 'Abbas رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) stated like this: He looked into the Fire of Hell. The rest of the hadith is the same.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے آگ ( جہنم ) میں جھانک کر دیکھا ۔ پھر ایوب کی حدیث کے مانند ذکر کیا ۔",
                "urduNarrator": "ہم سے شیبان بن فروخ نے بیان کیا, ابو اشہب نے ہمیں حدیث بیان کی ، کہا : ہمیں ابو رجاء نے حضرت ابن عباس رضی اللہ عنہ سے حدیث بیان کی کہ",
                "hadithArabic": "و حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا أَبُو الْأَشْهَبِ حَدَّثَنَا أَبُو رَجَاءٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اطَّلَعَ فِي النَّارِ فَذَكَرَ بِمِثْلِ حَدِيثِ أَيُّوبَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14504,
                "hadithNumber": "6941",
                "englishNarrator": null,
                "hadithEnglish": "It was narrated that Ibn Abbas رضی اللہ عنہ said: The Messenger of Allah ﷺ said....\" and he narrated a similar report (a Hadith no.6938).",
                "hadithUrdu": "ہم سے ابو کریب نے بیان کیا، ہم سے ابو اسامہ نے بیان کیا, سعید بن ابی عروبہ سے روایت ہے ، انہوں نے ابورجاء سے سنا ، انہوں نے حضرت ابن عباس رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، پھر اسی کے مانند ذکر کیا ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ سَمِعَ أَبَا رَجَاءٍ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14505,
                "hadithNumber": "6942",
                "englishNarrator": "Imran bin Husain رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Amongst the inmates of Paradise the women would form a minority.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جنت میں رہنے والوں میں سب سے کم تعداد عورتوں کی ہے ۔ \"",
                "urduNarrator": "ہم سے عبید اللہ بن نے بیان کیا, معاذ نے کہا : ہمیں شعبہ نے ابوتیاح سے حدیث بیان کی ، انہوں نے کہا : مطرف بن عبداللہ کی دو بیویاں تھیں ، وہ ایک بیوی کے پاس سے آئے تو دوسری نے کہا : تم فلاں عورت ( دوسری بیوی کا نام لیا ) کے پاس سے آئے ہو؟ انہوں نے کہا : میں حضرت عمران بن حصین رضی اللہ عنہ کے پاس سے ( بھی ہو کر ) آیا ہوں اور انہوں نے ہمیں یہ حدیث بیان کی ہے کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ أَبِي التَّيَّاحِ قَالَ كَانَ لِمُطَرِّفِ بْنِ عَبْدِ اللَّهِ امْرَأَتَانِ فَجَاءَ مِنْ عِنْدِ إِحْدَاهُمَا فَقَالَتْ الْأُخْرَى جِئْتَ مِنْ عِنْدِ فُلَانَةَ فَقَالَ جِئْتُ مِنْ عِنْدِ عِمْرَانَ بْنِ حُصَيْنٍ فَحَدَّثَنَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ أَقَلَّ سَاكِنِي الْجَنَّةِ النِّسَاءُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14506,
                "hadithNumber": "6943",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Mutarrif through another chain of transmitters.",
                "hadithUrdu": "اور ہم سے محمد بن الولید بن عبدالحمید نے بیان کیا,  ہمیں محمد بن جعفر نے حدیث بیان کی ، کہا : ہمیں شعبہ نے ابوتیاح سے حدیث سنائی ، کہا : میں نے مطرف کو حدیث بیان کرتے ہوئے سنا کہ ان کی دو بیویاں تھیں ( آگے ) معاذ کی حدیث کے ہم معنی ( روایت کی ۔ )",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْوَلِيدِ بْنِ عَبْدِ الْحَمِيدِ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي التَّيَّاحِ قَالَ سَمِعْتُ مُطَرِّفًا يُحَدِّثُ أَنَّهُ كَانَتْ لَهُ امْرَأَتَانِ بِمَعْنَى حَدِيثِ مُعَاذٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14507,
                "hadithNumber": "6944",
                "englishNarrator": "Abdullah bin Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) supplicated in these words: O Allah, I seek refuge in Thee from the withdrawal of Thine blessing and the change of Thine protection (from me) and from the sudden wrath of Thine, and from every displeasure of Thine.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کی دعاؤں میں سے ایک یہ تھی : \" اے اللہ! میں تیری پناہ چاہتا ہوں تیری نعمت کے زوال سے ، تیری عافیت کے ہٹ جانے سے ، تیری ناگہانی سزا سے اور تیری ہر طرح کی ناراضی سے ۔ \"",
                "urduNarrator": "ہم سے عبید اللہ بن عبد الکریم ابو زرع نے بیان کیا، ہم سے ابن بکیر نے بیان کیا، ان سے یعقوب بن عبدالرحمٰن نے بیان کیا، ان سے موسیٰ بن عقبہ نے، وہ عبداللہ بن دینار کی سند سے, حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے ، کہا",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْكَرِيمِ أَبُو زُرْعَةَ حَدَّثَنَا ابْنُ بُكَيْرٍ حَدَّثَنِي يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ كَانَ مِنْ دُعَاءِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ وَتَحَوُّلِ عَافِيَتِكَ وَفُجَاءَةِ نِقْمَتِكَ وَجَمِيعِ سَخَطِكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14508,
                "hadithNumber": "6945",
                "englishNarrator": "Usama bin Zaid رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: I have not left after me any (chance) of turmoil more injurious to men than the harm done to the men because of women.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" میں نے اپنے بعد کوئی آزمائش نہیں چھوڑی جو مردوں کے لیے عورتوں ( کی آزمائش ) سے بڑھ کر نقصان پہنچانے والی ہو ۔ \"",
                "urduNarrator": "سعید بن منصور نے کہا : ہمیں سفیان اور معتمر بن سلیمان نے سلیمان تیمی سے حدیث بیان کی ، انہوں نے ابوعثمان نہدی سے اور انہوں نے حضرت اسامہ بن زید رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا سُفْيَانُ وَمُعْتَمِرُ بْنُ سُلَيْمَانَ عَنْ سُلَيْمَانَ التَّيْمِيِّ عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ عَنْ أُسَامَةَ بْنِ زَيْدٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا تَرَكْتُ بَعْدِي فِتْنَةً هِيَ أَضَرُّ عَلَى الرِّجَالِ مِنْ النِّسَاءِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14509,
                "hadithNumber": "6946",
                "englishNarrator": "Usama bin Zaid bin Harith and Sa'id bin Zaid bin 'Amr bin Naufal رضی اللہ عنہ both reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: I have not left after me turmoil for the people but the harm done to men by women.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" میں اپنے بعد لوگوں میں کوئی ایسا فتنہ چھوڑ کر نہیں جا رہا جو مردوں کے لیے عورتوں سے بڑھ کر نقصان پہنچانے والا ہو ۔ \"",
                "urduNarrator": "عبیداللہ بن معاذ عنبری ، سعید بن سعید اور محمد بن عبدالاعلیٰ نے ہمیں معتمر سے حدیث بیان کی ۔ ابن معاذ نے کہا : ہمیں معتمر بن سلیمان نے حدیث بیان کی ، انہوں نے کہا : میرے والد نے کہا : ہمیں ابوعثمان نے حضرت اسامہ بن زید اور حضرت سعید بن زید رضی اللہ عنہ سے روایت کی ، ان دونوں نے رسول اللہ صلی اللہ علیہ وسلم سے حدیث بیان کی کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ وَسُوَيْدُ بْنُ سَعِيدٍ وَمُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى جَمِيعًا عَنْ الْمُعْتَمِرِ قَالَ ابْنُ مُعَاذٍ حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ قَالَ قَالَ أَبِي حَدَّثَنَا أَبُو عُثْمَانَ عَنْ أُسَامَةَ بْنِ زَيْدِ بْنِ حَارِثَةَ وَسَعِيدِ بْنِ زَيْدِ بْنِ عَمْرِو بْنِ نُفَيْلٍ أَنَّهُمَا حَدَّثَا عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ مَا تَرَكْتُ بَعْدِي فِي النَّاسِ فِتْنَةً أَضَرَّ عَلَى الرِّجَالِ مِنْ النِّسَاءِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14510,
                "hadithNumber": "6947",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Sulaiman Taimi with the same chain of transmitters.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ اور ابن نمیر نے بیان کیا، کہا: ابوخالد احمر ، ہشیم اور جریر سب نے سلیمان تیمی سے ، اسی سند کے ساتھ ، اسی کے مانند حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَابْنُ نُمَيْرٍ قَالَ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ ح و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا هُشَيْمٌ ح و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا جَرِيرٌ كُلُّهُمْ عَنْ سُلَيْمَانَ التَّيْمِيِّ بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14511,
                "hadithNumber": "6948",
                "englishNarrator": "Abu Sa'id Khudri رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: The world is sweet and green (alluring) and verily Allah is going to install you as vicegerent in it in order to see how you act. So avoid the allurement of women: verily, the first trial for the people of Isra'il was caused by women. And in the hadith transmitted on the authority of Ibn Bashshar the words are: So that He should see how you act.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" بلاشبہ دنیا بہت میٹھی اور ہری بھری ہے اور اللہ تعالیٰ اس میں تمہیں ( تم سے پہلے والوں کا ) جانشیں بنانے والا ہے ، پھر وہ دیکھے گا کہ تم کیسے عمل کرتے ہو ، لہذا تم دنیا ( میں کھو جانے سے ) بچتے رہنا اور عورتوں ( کے فتنے میں مبتلا ہونے سے ) بچ کر رہنا ، اس لیے کہ بنی اسرائیل میں سب سے پہلا فتنہ عورتوں ( کے معاملے ) میں تھا ۔ \"\" اور بشار کی حدیث میں ہے : \"\" تاکہ وہ دیکھے کہ تم کس طرح عمل کرتے ہو ۔ \"\"",
                "urduNarrator": "محمد بن مثنیٰ اور محمد بن بشار نے ہمیں حدیث بیان کی ، دونوں نے کہا : ہمیں محمد بن جعفر نے حدیث سنائی ، انہوں نے کہا : ہمیں شعبہ نے ابوسلمہ سے حدیث بیان کی ، انہوں نے کہا : میں نے ابونضرہ سے سنا ، وہ حضرت ابوسعید خدری رضی اللہ عنہ سے روایت کر رہے تھے ، انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي مَسْلَمَةَ قَالَ سَمِعْتُ أَبَا نَضْرَةَ يُحَدِّثُ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الدُّنْيَا حُلْوَةٌ خَضِرَةٌ وَإِنَّ اللَّهَ مُسْتَخْلِفُكُمْ فِيهَا فَيَنْظُرُ كَيْفَ تَعْمَلُونَ فَاتَّقُوا الدُّنْيَا وَاتَّقُوا النِّسَاءَ فَإِنَّ أَوَّلَ فِتْنَةِ بَنِي إِسْرَائِيلَ كَانَتْ فِي النِّسَاءِ وَفِي حَدِيثِ ابْنِ بَشَّارٍ لِيَنْظُرَ كَيْفَ تَعْمَلُونَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14512,
                "hadithNumber": "6949",
                "englishNarrator": "Abdullah bin 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Three persons set out on a journey. They were overtaken by rain and they had to find protection in a mountain cave where at its mouth there fell a rock of that mountain and thus blocked them altogether. One of them said to the others: Look to your good deeds that you performed for the sake of Allah and then supplicate Allah, the Exalted, that He might rescue you (from this trouble). One of them said: O Allah, I had my parents who were old and my wife and my small children also. I tended the flock and when I came back to them in the evening, I milked them (the sheep, goats, cows, etc.) and first served that milk to my parents. One day I was obliged to go out to a distant place in search of fodder and I could not come back before evening and found them (the parents) asleep. I milked the animals as I used to milk and brought milk to them and stood by their heads avoiding to disturb them from sleep and I did not deem it advisable to serve milk to my children before serving them. My children wept near my feet. I remained there in that very state and my parents too until it was morning. And (0 Allah) if Thou art aware that I did this in order to seek Thine pleasure, grant us riddance from this trouble. (The rock slipped a bit) that they could see the sky. The second one said: 0 Allah, I had a female cousin whom I loved more than the men love the women. I wanted to have sexual intercourse with her; she refused but on the condition of getting one hundred dinirs. It was with very great difficulty that I could collect one hundred dinirs and then paid them to her and when I was going to have a sexual intercourse with her, that she said: Servant of Allah, fear Allah and do not break the seal (of chastity) but by lawful means. I got up. 0 Allah, if Thou art aware that I did this in order to seek Thine pleasure, rid us from this trouble. The situation was somewhat eased for them. The third one said: Allah, I employed a workman for a measure of rice. After he had finished his work I gave him his dues (in the form of) a measure of rice, but he did not accept them. I used these rice as seeds, and that gave a bumper crop and I became rich enough to have cows and flocks (in my possession). He came to me and said: Fear Allah, and commit no cruel upon me in regard to my dues. I said to him: Takeaway this flock of cows and sheep. He said: Fear Allah and do not make a fun of me. I said: I am not making a fun of you. You take the cows and the flocks. So he took them. 0 Allah, if Thou art aware that I did it for Thine pleasure, case the situation for us. And Allah relieved them from the rest of the trouble.",
                "hadithUrdu": "آپ نے فرمایا : \"\" تین آدمی پیدال چلے جا رہے تھے کہ انہیں بارش نے آ لیا ، انہوں نے پہاڑ میں ایک غار کی پناہ لی ، تو ( اچانک ) ان کے گار کے منہ پر پہاڑ سے ایک چٹان آ گری اور ان کے اوپر آ کر انہیں ڈھانک دیا ، انہوں نے ایک دوسرے سے کہا : تم اپنے ان نیک اعمال پر نظر ڈالو جو تم نے ( صرف اور صرف ) اللہ کے لیے کیے ہوں اور ان کے وسیلے سے اللہ تعالیٰ سے دعا کرو ، شاید وہ اس بندش اور قید سے تمہیں آزاد کر دے ۔ اس پر ان میں سے ایک نے کہا ، اے اللہ! میرے انتہائی بوڑھے والدین ، بیوی اور چھوٹے چھوٹے بچے ہیں جن کی میں نگہداشت کرتا ہوں ۔ جب شام کو میں اپنے جانور ( چرانے کے بعد انہیں ) ان کے پاس واپس آتا ، ان کا دودھ دوہتا تو آغاز اپنے والدین سے کرتا اور اپنے بچوں سے پہلے انہیں پلاتا تھا ۔ ایک دن ( مویشیوں کے چرنے کے قابل ) درختوں کی تلاش مجھے بہت دور لے گئی ، میں رات سے پہلے گھر نہ پہنچ سکا ۔ میں نے انہیں پایا کہ وہ دونوں سو چکے ہیں ۔ میں جس طرح 0ہر روز ) دودھ نکالا کرتا تھا نکالا اور وہ ڈوبا ہوا دودھ لے کر ان کے سرہانے کھڑا ہو گیا ۔ مجھے یہ بھی ناپسند تھا کہ ان کو نیند سے جگاؤں اور یہ بھی گوارا نہ تھا کہ ان سے پہلے بچوں کو پلاؤں ، بچے بھوک کی شدت سے بلکتے ہوئے میرے قدموں میں لوٹ پوٹ ہو رہے تھے ، میں اسی حال میں ( کھڑا ) رہا اور وہ بھی اسی حالت میں رہے یہاں تک کہ صبح طلوع ہو گئی ۔ ( اے اللہ! ) اگر تو جانتا ہے کہ میں نے یہ صرف تیری رضا کے لیے کیا ہے تو اس ( غار کے بند منہ ) میں اتنا سوراخ کر دے کہ ہم آسمان کو دیکھ لیں ۔ اللہ نے اس میں ایک سوراخ کر دیا کہ وہ آسمان کو دیکھنے لگے ۔ اور دوسرا ( ساتھی ) کہنے لگا : اے اللہ! میری ایک چچا زاد تھی ، میں اس سے وہی شدید محبت کرتا تھا جو ایک مرد عورت سے کرتا ہے ۔ میں نے اس سے اپنے لیے ( خود ) اسی کو مانگا ۔ اس نے اس وقت تک ( میری بات ماننے سے ) انکار کر دیا ، یہاں تک کہ میں اسے ( سونے کے ) سو دینار لا کر دوں ۔ میں انہیں حاصل کرنے میں لگ گیا یہاں تک کہ سو دینار اکٹھے کر لیے ، پھر جب میں ان کے دونوں قدموں کے درمیان پہنچا تو وہ کہنے لگی : اللہ کے بندے! اللہ سے ڈر اور حق ( نکاح ) کے بغیر مہر ( بکارت ) نہ توڑ ۔ تو ( تیرا نام سن کر ) میں اس سے ( الگ ہو کر ) کھڑا ہو گیا ۔ اگر تو جانتا ہے کہ میں نے یہ تجھے راضی کرنے کے لیے کیا تھا تو اس میں ( اور زیادہ ) سوراخ کر دے ( اللہ نے ) ان کے لیے ( اور زیادہ ) سوراخ کر دیا ۔ اور تیسرے نے ( دعا کرتے ہوئے ) کہا : اے اللہ! میں نے ایک مزدور کو چاولوں کے ایک فرق ( تین صاع ، تقریبا ساڑھے سات کلو گرام ) کی اجرت کے عوض کام پر لگایا ۔ جب اس نے اپنا کام پورا کر لیا تو کہا : میرا حق ( اجرت ) ادا کرو ۔ میں نے اسے اس کا فرق ( تین صاع چاول ) پیش کیا ۔ وہ ( اسے کم قرار دیتے ہوئے ) اس کو چھوڑ کر چلا گیا ۔ میں مسلسل اس ( تین صاع چاولوں ) کو کاشت کرنے لگا ، یہاں تک کہ میں نے اس ( کی آمدنی ) سے گائے ( کے بہت سے ریوڑ ) اور ان کو چرانے والے ( غلام ) اکٹھے کر لیے ۔ پھر ( مدت بعد ) وہ میرے پاس ( واپس ) آیا اور کہا : اللہ سے ڈرو ، میرے حق میں مجھ پر ظلم نہ کرو ۔ میں نے کہا : ان گایوں ( کے ریوڑوں ) اور انہیں چرانے والے ( غلاموں ) کی طرف جاؤ اور انہیں لے لو ۔ اس نے کہا : اللہ سے ڈرو! میرے ساتھ مذاق تو نہ کرو ۔ میں نے کہا : میں مذاق نہیں کر رہا ، یہ سب گائیں اور ان کو چرانے والے ( غلام ) لے جاؤ ، وہ انہیں لے کر چلا گیا ۔ اگر تو جانتا ہے کہ میں نے یہ صرف تجھے راضی کرنے کے لیے کیا تھا تو جو حصہ باقی رہ گیا ہے ، اسے بھی کھول دے ۔ اللہ نے باقی حصہ بھی کھول دیا ( اور وہ آزاد ہو کر غار سے باہر نکل آئے ۔ ) \"\"",
                "urduNarrator": "محمد بن اسحاق المصیبی نے مجھ سے کہا: انس بن عیاض ابو ضمرہ نے موسیٰ بن عقبہ سے ، انہوں نے نافع سے ، انہوں نے حضرت عبداللہ بن عمر رضی اللہ عنہ سے اور انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ إِسْحَاقَ الْمُسَيِّبِيُّ، حَدَّثَنِي أَنَسٌ يَعْنِي ابْنَ عِيَاضٍ أَبَا ضَمْرَةَ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللهِ بْنِ عُمَرَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: بَيْنَمَا ثَلَاثَةُ نَفَرٍ يَتَمَشَّوْنَ أَخَذَهُمُ الْمَطَرُ، فَأَوَوْا إِلَى غَارٍ فِي جَبَلٍ، فَانْحَطَّتْ عَلَى فَمِ غَارِهِمْ صَخْرَةٌ مِنَ الْجَبَلِ، فَانْطَبَقَتْ عَلَيْهِمْ، فَقَالَ بَعْضُهُمْ لِبَعْضٍ: انْظُرُوا أَعْمَالًا عَمِلْتُمُوهَا صَالِحَةً لِلَّهِ، فَادْعُوا اللهَ تَعَالَى بِهَا، لَعَلَّ اللهَ يَفْرُجُهَا عَنْكُمْ، فَقَالَ أَحَدُهُمْ: اللهُمَّ إِنَّهُ كَانَ لِي وَالِدَانِ شَيْخَانِ كَبِيرَانِ، وَامْرَأَتِي، وَلِي صِبْيَةٌ صِغَارٌ أَرْعَى عَلَيْهِمْ، فَإِذَا أَرَحْتُ عَلَيْهِمْ، حَلَبْتُ، فَبَدَأْتُ بِوَالِدَيَّ، فَسَقَيْتُهُمَا قَبْلَ بَنِيَّ، وَأَنَّهُ نَأَى بِي ذَاتَ يَوْمٍ الشَّجَرُ، فَلَمْ آتِ حَتَّى أَمْسَيْتُ، فَوَجَدْتُهُمَا قَدْ نَامَا، فَحَلَبْتُ كَمَا كُنْتُ أَحْلُبُ، فَجِئْتُ بِالْحِلَابِ، فَقُمْتُ عِنْدَ رُءُوسِهِمَا أَكْرَهُ أَنْ أُوقِظَهُمَا مِنْ نَوْمِهِمَا، وَأَكْرَهُ أَنْ أَسْقِيَ الصِّبْيَةَ قَبْلَهُمَا، وَالصِّبْيَةُ يَتَضَاغَوْنَ عِنْدَ قَدَمَيَّ، فَلَمْ يَزَلْ ذَلِكَ دَأْبِي وَدَأْبَهُمْ حَتَّى طَلَعَ الْفَجْرُ، فَإِنْ كُنْتَ تَعْلَمُ أَنِّي فَعَلْتُ ذَلِكَ ابْتِغَاءَ وَجْهِكَ، فَافْرُجْ لَنَا مِنْهَا فُرْجَةً، نَرَى مِنْهَا السَّمَاءَ، فَفَرَجَ اللهُ مِنْهَا فُرْجَةً، فَرَأَوْا مِنْهَا السَّمَاءَ، وَقَالَ الْآخَرُ: اللهُمَّ إِنَّهُ كَانَتْ لِيَ ابْنَةُ عَمٍّ أَحْبَبْتُهَا كَأَشَدِّ مَا يُحِبُّ الرِّجَالُ النِّسَاءَ، وَطَلَبْتُ إِلَيْهَا نَفْسَهَا، فَأَبَتْ حَتَّى آتِيَهَا بِمِائَةِ دِينَارٍ، فَتَعِبْتُ حَتَّى جَمَعْتُ مِائَةَ دِينَارٍ، فَجِئْتُهَا بِهَا، فَلَمَّا وَقَعْتُ بَيْنَ رِجْلَيْهَا، قَالَتْ: يَا عَبْدَ اللهِ اتَّقِ اللهَ، وَلَا تَفْتَحِ الْخَاتَمَ إِلَّا بِحَقِّهِ، فَقُمْتُ عَنْهَا، فَإِنْ كُنْتَ تَعْلَمُ أَنِّي فَعَلْتُ ذَلِكَ ابْتِغَاءَ وَجْهِكَ، فَافْرُجْ لَنَا مِنْهَا فُرْجَةً، فَفَرَجَ لَهُمْ، وَقَالَ الْآخَرُ: اللهُمَّ إِنِّي كُنْتُ اسْتَأْجَرْتُ أَجِيرًا بِفَرَقِ أَرُزٍّ، فَلَمَّا قَضَى عَمَلَهُ قَالَ: أَعْطِنِي حَقِّي، فَعَرَضْتُ عَلَيْهِ فَرَقَهُ فَرَغِبَ عَنْهُ، فَلَمْ أَزَلْ أَزْرَعُهُ حَتَّى جَمَعْتُ مِنْهُ بَقَرًا وَرِعَاءَهَا، فَجَاءَنِي فَقَالَ: اتَّقِ اللهَ وَلَا تَظْلِمْنِي حَقِّي، قُلْتُ: اذْهَبْ إِلَى تِلْكَ الْبَقَرِ وَرِعَائِهَا، فَخُذْهَا فَقَالَ: اتَّقِ اللهَ وَلَا تَسْتَهْزِئْ بِي فَقُلْتُ: إِنِّي لَا أَسْتَهْزِئُ بِكَ، خُذْ ذَلِكَ الْبَقَرَ وَرِعَاءَهَا، فَأَخَذَهُ فَذَهَبَ بِهِ، فَإِنْ كُنْتَ تَعْلَمُ أَنِّي فَعَلْتُ ذَلِكَ ابْتِغَاءَ وَجْهِكَ، فَافْرُجْ لَنَا مَا بَقِيَ، فَفَرَجَ اللهُ مَا بَقِيَ.",
                "headingArabic": "قِصَّةِ أَصْحَابِ الْغَارِ الثَّلاَثَةِ وَالتَّوَسُّلِ بِصَالِحِ الأَعْمَالِ ‏‏",
                "headingUrdu": "غار میں تین آدمیوں کا قصہ اور ان کی توسل (اللہ کا قرب حاصل کرنے کی کوشش) اعمال صالحہ کے ذریعے",
                "headingEnglish": "The Story Of Three Men In The Cave And Their Tawossul (Seeking To Draw Close To Allah) By Means Of Righteous Deeds",
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14513,
                "hadithNumber": "6950",
                "englishNarrator": null,
                "hadithEnglish": "A Hadith like that of Abu Damrah from Musa bin Uqbah was narrated from Nafi from Ibn Umar from the Prophet ﷺ, and they added in their Hadith: they went out walking,\" except Ubaidullah, in whose hadith it says: \"And they went out\" and he did not mention anything after that.",
                "hadithUrdu": "ہم سے اسحاق بن منصور اور عبد بن حمید نے بیان کیا، کہا کہ ہم سے ابو عاصم نے ابن جریج کی سند سے بیان کیا,موسیٰ بن عقبہ ، عبیداللہ ، فُضیل ، رقبہ بن مسقلہ اور صالح بن کیسان سب نے نافع سے ، انہوں نے ابن عمر رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے ابوضمرہ کی موسیٰ بن عقبہ سے روایت کردہ حدیث کے ہم معنی روایت کی اور انہوں نے ان کی حدیث میں ( پیدل چلے جا رہے تھے کے ساتھ ) \" اور وہ پیدل چلتے ہوئے نکلے \" کے الفاظ بڑھائے اورعبیداللہ کی روایت کو چھوڑ کر صالح کی حدیث میں \" وہ مل کر پیدل چلے \" کے الفاظ ہیں جبکہ ان ( عبیداللہ ) کی حدیث میں \" اور وہ نکلے \" کا لفظ ہے اور انہوں نے اس کے بعد ( پیدل چلتے ہوئے وغیرہ ) کا کچھ ذکر نہیں کیا ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَا: أَخْبَرَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي مُوسَى بْنُ عُقْبَةَ، ح وحَدَّثَنِي سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ عُبَيْدِ اللهِ، ح وحَدَّثَنِي أَبُو كُرَيْبٍ، وَمُحَمَّدُ بْنُ طَرِيفٍ الْبَجَلِيُّ، قَالَا: حَدَّثَنَا ابْنُ فُضَيْلٍ، حَدَّثَنَا أَبِي، وَرَقَبَةُ بْنُ مَسْقَلَةَ، ح وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ وَحَسَنٌ الْحُلْوَانِيُّ وَعَبْدُ بْنُ حُمَيْدٍ، قَالُوا: حَدَّثَنَا يَعْقُوبُ يَعْنُونَ ابْنَ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنْ صَالِحِ بْنِ كَيْسَانَ، كُلُّهُمْ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَى حَدِيثِ أَبِي ضَمْرَةَ، عَنْ مُوسَى بْنِ عُقْبَةَ وَزَادُوا فِي حَدِيثِهِمْ: «وَخَرَجُوا يَمْشُونَ»، وَفِي حَدِيثِ صَالِحٍ «يَتَمَاشَوْنَ» إِلَّا عُبَيْدَ اللهِ فَإِنَّ فِي حَدِيثِهِ: وَخَرَجُوا وَلَمْ يَذْكُرْ بَعْدَهَا شَيْئًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 14201,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=568",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=566",
                "label": "566",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=567",
                "label": "567",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=568",
                "label": "568",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=569",
                "label": "569",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=570",
                "label": "570",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=571",
                "label": "571",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=572",
                "label": "572",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=570",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=570",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=568",
        "to": 14225,
        "total": 40465
    }
}