{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 535,
        "data": [
            {
                "id": 13639,
                "hadithNumber": "6076",
                "englishNarrator": "Thabit reported:",
                "hadithEnglish": "Anas bin Malik رضی اللہ عنہ was asked about the dyeing (of the hair of) Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). Thereupon he said: (They were so few) that if I so liked I could count their number in his head, and he further said: (That is) he did not dye. Abu Bakr رضی اللہ عنہ , however, dyed them and so did 'Umar رضی اللہ عنہ dye them with pure henna.",
                "hadithUrdu": "حضرت انس بن مالک رضی اللہ عنہ سے نبی کریم صلی اللہ علیہ وسلم کے بالوں کے خضاب کے بارے میں سوال کیاگیا تو انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم کے سر مبارک میں جو سفید بال موجود تھے ، اگر میں انھیں گننا چاہتا تو گن لیتا ۔ انھوں نے کہا : آپ صلی اللہ علیہ وسلم نے بالوں کو رنگ نہیں لگایا اورحضرت ابو بکر رضی اللہ عنہ نے مہندی اور کتم کو ملا کر بالوں کو رنگ لگایا اور حضرت عمر رضی اللہ تعالیٰ عنہ نے خالص مہندی کا رنگ لگایا ۔",
                "urduNarrator": "مجھ سے ابو الربیع العتکی نے بیان کیا، حماد نے کہا, ثابت نے کہا",
                "hadithArabic": "حَدَّثَنِي أَبُو الرَّبِيعِ الْعَتَكِيُّ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا ثَابِتٌ، قَالَ: سُئِلَ أَنَسُ بْنُ مَالِكٍ عَنْ خِضَابِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ؟ فَقَالَ: «لَوْ شِئْتُ أَنْ أَعُدَّ شَمَطَاتٍ كُنَّ فِي رَأْسِهِ فَعَلْتُ»، وَقَالَ: لَمْ يَخْتَضِبْ «وَقَدِ اخْتَضَبَ أَبُو بَكْرٍ بِالْحِنَّاءِ وَالْكَتَمِ» وَاخْتَضَبَ عُمَرُ بِالْحِنَّاءِ بَحْتًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13640,
                "hadithNumber": "6077",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ said:",
                "hadithEnglish": "A person should pick out his white hair from his head or beard, and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) did not dye, and there was some whiteness in his hair at his chin, on his temples and very little on his head.",
                "hadithUrdu": "سر اور داڑھی کے سفید بال اکھیڑنا مکروہ ہے اور رسول اللہ صلی اللہ علیہ وسلم نے خضاب نہیں کیا ۔ آپ صلی اللہ علیہ وسلم کی چھوٹی داڑھی میں جو نیچے کے ہونٹ تلے ہوتی ہے ، کچھ سفیدی تھی ، اور کچھ کنپٹیوں پر اور سر میں کہیں کہیں سفید بال تھے ۔",
                "urduNarrator": "علی جہضمی نے کہا : ہمیں مثنیٰ بن سعید نے قتادہ سے حدیث بیان کی ، انھوں نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی ، کہا : کہ",
                "hadithArabic": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا الْمُثَنَّى بْنُ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ: يُكْرَهُ أَنْ يَنْتِفَ الرَّجُلُ الشَّعْرَةَ الْبَيْضَاءَ مِنْ رَأْسِهِ وَلِحْيَتِهِ، قَالَ: وَلَمْ يَخْتَضِبْ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، إِنَّمَا كَانَ الْبَيَاضُ فِي عَنْفَقَتِهِ وَفِي الصُّدْغَيْنِ وَفِي الرَّأْسِ نَبْذٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13641,
                "hadithNumber": "6078",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Muthanna through the same chain of transmitters.",
                "hadithUrdu": "مجھ سے محمد بن المثنیٰ نے بیان کیا,عبدالصمد نے مثنیٰ ( بن سعید ) سے اسی سند کے ساتھ حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِيهِ مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا الْمُثَنَّى بِهَذَا الْإِسْنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13642,
                "hadithNumber": "6079",
                "englishNarrator": "Anas (bin Malik) رضی اللہ عنہ was asked about the old age of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). He said:",
                "hadithEnglish": "Allah did not blemish him with white hair.",
                "hadithUrdu": "اللہ تعالیٰ نے سفید بالوں کے ساتھ آپ کے جمال میں کمی نہیں کی تھی ۔",
                "urduNarrator": "ہم سے محمد بن المثنیٰ، ابن بشار، احمد بن ابراہیم الدورقی اور ہارون بن عبداللہ نے ابوداؤد کی سند سے بیان کیا، انہوں نے کہا: ہم سے ابن المثنیٰ، سلیمان بن داؤد نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا, خلید بن جعفر نے ابو ایاس سے حضرت انس رضی اللہ عنہ کے بارے میں سنا ، ان سے نبی کریم صلی اللہ علیہ وسلم کے سفید بالوں کے بارے میں سوال کیا گیا ، انھوں نے کہا",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، وَأَحْمَدُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، وَهَارُونُ بْنُ عَبْدِ اللهِ، جَمِيعًا، عَنْ أَبِي دَاوُدَ، قَالَ: ابْنُ الْمُثَنَّى، حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ، حَدَّثَنَا شُعْبَةُ، عَنْ خُلَيْدِ بْنِ جَعْفَرٍ، سَمِعَ أَبَا إِيَاسٍ، عَنْ أَنَسٍ: أَنَّهُ سُئِلَ عَنْ شَيْبِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: مَا شَانَهُ اللهُ بِبَيْضَاءَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13643,
                "hadithNumber": "6080",
                "englishNarrator": "Abu Juhaifa رضی اللہ عنہ reported:",
                "hadithEnglish": "I saw Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) having some whiteness (in hair) at this place, and Zuhair placed one of his fingers at his chin. Juhaifa رضی اللہ عنہ was asked how old he had been at that time. He said: I made arrows and put feathers to them (i. e. I had passed my childhood).",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا ، آپ کی اس جگہ پر سفیدی تھی ، زہیر نے نچلے ہونٹ کے نیچے والے اپنے بالوں پر انگلی رکھ دی ، ان ( ابوجحیفہ رضی اللہ عنہ ) سے کہاگیا : ان دنوں آپ ( حاضرین میں سے ) کس کی طرح ( کس عمرکے ) تھے ( آپ سب سے چھوٹے ہوں گے؟ ) انھوں نے کہا : میں تیروں کے پیکان اور ان کے پر لگاتا تھا ۔",
                "urduNarrator": "ہم سے احمد بن یونس نے بیان کیا، ہم سے زہیر نے بیان کیا، ہم سے ابواسحاق نے بیان کیا، ان سے یحییٰ بن یحییٰ نے بیان کیا، ہم سے ابو خیثمہ نے بیان کیا، ابو کی سند سے۔ اسحاق، ابو جحیفہ کی سند پر، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو إِسْحَاقَ، ح وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو خَيْثَمَةَ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي جُحَيْفَةَ، قَالَ: رَأَيْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، «هَذِهِ مِنْهُ بَيْضَاءَ، وَوَضَعَ زُهَيْرٌ بَعْضَ أَصَابِعِهِ عَلَى عَنْفَقَتِهِ» قِيلَ لَهُ: مِثْلُ مَنْ أَنْتَ يَوْمَئِذٍ؟ فَقَالَ: «أَبْرِي النَّبْلَ وَأَرِيشُهَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13644,
                "hadithNumber": "6081",
                "englishNarrator": "Abu Juhaifa رضی اللہ عنہ reported:",
                "hadithEnglish": "I saw Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) that he had white complexion and had some white hair, and Hasan bin 'Ali رضی اللہ عنہ resembled him.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو د یکھا ، آپ گورے تھے ، بالوں میں تھوڑی سی سفیدی آئی تھی ، حضرت حسین بن علی رضی اللہ عنہ آپ سے مشابہت رکھتے تھے ۔",
                "urduNarrator": "ہم سے واصل بن عبد الاعلی نے بیان کیا, محمد بن فضیل نے اسماعیل بن ابی خالد سے ، انھوں نے حضرت جحیفہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا وَاصِلُ بْنُ عَبْدِ الْأَعْلَى، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، عَنْ أَبِي جُحَيْفَةَ، قَالَ: «رَأَيْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَبْيَضَ قَدْ شَابَ كَانَ الْحَسَنُ بْنُ عَلِيٍّ يُشْبِهُهُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13645,
                "hadithNumber": "6082",
                "englishNarrator": "It was narrated that Abu Juhaifa رضی اللہ عنہ (a hadith similar to no. 6081), but they did not say:",
                "hadithEnglish": "\"With a white white complexion an white hair.\"",
                "hadithUrdu": "آپ گورے تھے ، بالوں میں تھوڑی سی سفیدی آئی تھی ۔",
                "urduNarrator": "ہم سے سعید بن منصور نے بیان کیا, سفیان ، خالد بن عبداللہ اورمحمد بن بشر ، سب نےاسماعیل سے ، انھوں نے حضرت جحیفہ رضی اللہ عنہ سے روایت کی ، ان سب نے یہ نہیں کہا",
                "hadithArabic": "وَحَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، حَدَّثَنَا سُفْيَانُ، وَخَالِدُ بْنُ عَبْدِ اللهِ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، كُلُّهُمْ عَنْ إِسْمَاعِيلَ، عَنْ أَبِي جُحَيْفَةَ، بِهَذَا وَلَمْ يَقُولُوا: أَبْيَضَ قَدْ شَابَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13646,
                "hadithNumber": "6083",
                "englishNarrator": "Jabir bin Samura رضی اللہ عنہ was asked about the old age of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). He said:",
                "hadithEnglish": "When he oiled his head nothing was seen (as a mark of old age) and when he did not apply oil something (of the old age) became visible.",
                "hadithUrdu": "جب آپ سر مبارک کو تیل لگاتے تھے تو سفید بال نظر نہیں آتے تھے اور جب تیل نہیں لگاتے تھے تونظر آتے تھے ۔",
                "urduNarrator": "ہم سے محمد بن المثنیٰ نے بیان کیا، ہم سے ابوداؤد سلیمان بن داؤد نے بیان کیا، ہم سے شعبہ نے بیان کیا، سماک بن حرب نے کہا : میں نے حضرت جابر بن سمرہ رضی اللہ عنہ سے سنا ، ان سے نبی کریم صلی اللہ علیہ وسلم کے سفید بالوں کے متعلق سوال کیاگیاتھا ، انھوں نےکہا",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا أَبُو دَاوُدَ سُلَيْمَانُ بْنُ دَاوُدَ، حَدَّثَنَا شُعْبَةُ، عَنْ سِمَاكِ بْنِ حَرْبٍ، قَالَ: سَمِعْتُ جَابِرَ بْنَ سَمُرَةَ، سُئِلَ عَنْ شَيْبِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «كَانَ إِذَا دَهَنَ رَأْسَهُ لَمْ يُرَ مِنْهُ شَيْءٌ، وَإِذَا لَمْ يَدْهُنْ رُئِيَ مِنْهُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13647,
                "hadithNumber": "6084",
                "englishNarrator": "Jabir bin Samura رضی اللہ عنہ reported:",
                "hadithEnglish": "There had appeared some whiteness on the front part of the head and beard of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). When he applied oil, it did not become visible, but when he did not (apply) oil, it became apparent. And he had a thick beard. A person said: His face was as (bright) as the sword. Thereupon he (Jabir رضی اللہ عنہ ) said: No, it was round and like the sun and the moon. And I saw the seal near his shoulder of the size of a pigeon's egg and its color was the same as that of his body.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے سر اور ڈاڑھی کا آگے کا حصہ سفید ہو گیا تھا جب آپ صلی اللہ علیہ وسلم تیل ڈالتے تو سفیدی معلوم نہ ہوتی اور آپ صلی اللہ علیہ وسلم کی ڈاڑھی بہت گھنی تھی ۔ ایک شخص بولا کہ کیا آپ صلی اللہ علیہ وسلم کا چہرہ مبارک تلوار کی طرح یعنی لمبا تھا؟ سیدنا جابر رضی اللہ عنہ نے کہا کہ نہیں آپ صلی اللہ علیہ وسلم کا چہرہ مبارک سورج اور چاند کی طرح اور گول تھا اور میں نے نبوت کی مہر آپ صلی اللہ علیہ وسلم کے کندھے پر دیکھی جیسے کبوتر کا انڈا ہوتا ہے اور اس کا رنگ جسم کے رنگ سے ملتا تھا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے عبید اللہ نے بیان کیا, اسرائیل نے سماک سے روایت کی کہ انھوں نے حضرت جابر بن سمرہ رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے : کہ",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عُبَيْدُ اللهِ، عَنْ إِسْرَائِيلَ، عَنْ سِمَاكٍ، أَنَّهُ سَمِعَ جَابِرَ بْنَ سَمُرَةَ، يَقُولُ: كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَدْ شَمِطَ مُقَدَّمُ رَأْسِهِ وَلِحْيَتِهِ، وَكَانَ إِذَا ادَّهَنَ لَمْ يَتَبَيَّنْ، وَإِذَا شَعِثَ رَأْسُهُ تَبَيَّنَ، وَكَانَ كَثِيرَ شَعْرِ اللِّحْيَةِ، فَقَالَ: رَجُلٌ وَجْهُهُ مِثْلُ السَّيْفِ؟ قَالَ: لَا، بَلْ كَانَ مِثْلَ الشَّمْسِ وَالْقَمَرِ، وَكَانَ مُسْتَدِيرًا وَرَأَيْتُ الْخَاتَمَ عِنْدَ كَتِفِهِ مِثْلَ بَيْضَةِ الْحَمَامَةِ يُشْبِهُ جَسَدَهُ.",
                "headingArabic": "إِثْبَاتِ خَاتَمِ النُّبُوَّةِ وَصِفَتِهِ وَمَحِلِّهِ مِنْ جَسَدِهِ صلى الله عليه وسلم ‏.‏",
                "headingUrdu": "مہر نبوت، اس کے اوصاف اور اس کا مقام رسول اللہ صلی اللہ علیہ وسلم کے جسم پر",
                "headingEnglish": "The Seal Of Prophethood, Its Attributes And Its Location On The Body Of The Prophet (SAW)",
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13648,
                "hadithNumber": "6085",
                "englishNarrator": "Jabir Samura رضی اللہ عنہ reported:",
                "hadithEnglish": "I saw the seal on his back as if it were a pigeon's egg.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کی پشت مبارک پرمہر نبوت دیکھی ، جیسے وہ کبوتری کا انڈا ہو ۔",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا، کہا ہم سے محمد بن جعفر نے بیان کیا, شعبہ نے سماک سے روایت کی ، کہا : میں نے حضرت جابر بن سمرہ رضی اللہ عنہ سے سنا ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سِمَاكٍ، قَالَ: سَمِعْتُ جَابِرَ بْنَ سَمُرَةَ، قَالَ: «رَأَيْتُ خَاتَمًا فِي ظَهْرِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، كَأَنَّهُ بَيْضَةُ حَمَامٍ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13649,
                "hadithNumber": "6086",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Simak with the same chain of transmitters.",
                "hadithUrdu": "ہم سے ابن نمیر نے بیان کیا، کہا ہم سے عبید اللہ بن موسیٰ نے بیان کیا, حسن بن صالح نے سماک سے اسی سند کے ساتھ اسی کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُوسَى، أَخْبَرَنَا حَسَنُ بْنُ صَالِحٍ، عَنْ سِمَاكٍ، بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13650,
                "hadithNumber": "6087",
                "englishNarrator": "As-Sa'ib bin Yazid reported:",
                "hadithEnglish": "My mother's sister took me to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and said: Allah's Messenger, here is the son of my sister and he is ailing. He touched my head and invoked blessings upon me. He then performed ablution and I drank the water left from his ablution; then I stood behind him and I saw the seal between his shoulders.",
                "hadithUrdu": "میری خالہ مجھے رسول اللہ صلی اللہ علیہ وسلم کے پاس لے گئی اور کہا کہ یا رسول اللہ! میرا بھانجا بہت بیمار ہے ۔ آپ صلی اللہ علیہ وسلم نے میرے سر پر ہاتھ پھیرا اور برکت کی دعا کی ۔ پھر وضو کیا تو میں نے آپ صلی اللہ علیہ وسلم کے وضو کا بچا ہوا پانی پی لیا ۔ پھر میں آپ صلی اللہ علیہ وسلم کی پیٹھ کے پیچھے کھڑا ہوا تو مجھے آپ کے د ونوں کندھوں کے درمیان آپ کی مہر ( نبوت ) مسہری کے لٹو کی طرح نظر آئی ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید اور محمد بن عباد نے بیان کیا، کہا: ہم سے حاتم نے جو ابن اسماعیل ہیں، بیان کیا, جعد بن عبدالرحمن نے کہا : میں نے حضرت سائب بن یزید سے سنا ، وہ کہہ رہے تھے ، کہ",
                "hadithArabic": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ عَبَّادٍ، قَالَا: حَدَّثَنَا حَاتِمٌ وَهُوَ ابْنُ إِسْمَاعِيلَ، عَنِ الْجَعْدِ بْنِ عَبْدِ الرَّحْمَنِ، قَالَ: سَمِعْتُ السَّائِبَ بْنَ يَزِيدَ، يَقُولُ: ذَهَبَتْ بِي خَالَتِي إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَتْ: يَا رَسُولَ اللهِ إِنَّ ابْنَ أُخْتِي وَجِعٌ «فَمَسَحَ رَأْسِي وَدَعَا لِي بِالْبَرَكَةِ، ثُمَّ تَوَضَّأَ فَشَرِبْتُ مِنْ وَضُوئِهِ، ثُمَّ قُمْتُ خَلْفَ ظَهْرِهِ فَنَظَرْتُ إِلَى خَاتَمِهِ بَيْنَ كَتِفَيْهِ مِثْلَ زِرِّ الْحَجَلَةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13651,
                "hadithNumber": "6088",
                "englishNarrator": "Abdullah bin Sarjis رضی اللہ عنہ reported:",
                "hadithEnglish": "I saw Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and ate with him bread and meat, or he said Tharid (bread soaked in soup). I said to him: Did Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) seek forgiveness for you? He said: Yes, and for you, and he then recited this verse: Ask forgiveness for thy sin and for the believing men and believing women (xlvii. 19). I then went after him and saw the Seal of Prophethood between his shoulders on the left side of his shoulder having spots on it like moles.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھاتھا اور میں نے آپ کے ساتھ روٹی اورگوشت یا کہا : ثریدکھایاتھا ، ( عاصم نے ) کہا : میں نے ان ( عبداللہ رضی اللہ تعالیٰ عنہ ) سے پوچھا : کیا نبی کریم صلی اللہ علیہ وسلم نے تمھارے لئے دعائے مغفرت کی تھی ، انھوں نے کہا : ہاں ، اورتمھارے لئے بھی ، پھر یہ آیت پڑھی ، \"\" اور اپنے گناہ کے لئے استغفار کیجئے اور ایماندار مردون اور ایماندار عورتوں کے لئے بھی ۔ \"\" کہا : پھر میں گھوم کر آپ کے پیچھے ہواتو میں نے آپ کے دونوں کندھوں کے درمیان مہر نبوت دیکھی ، آپ کے بائیں شانے کی نرم ہڈی کے قریب بند مٹھی کی طرح ، اس پر خال ( تل ) تھے جس طرح جلد پر آغاز شباب کے کالے نشان ہوتے ہیں ۔",
                "urduNarrator": "ہم سے ابو کامل نے بیان کیا، کہا ہم سے حماد نے بیان کیا، ہم سے ابن زید نے بیان کیا، کہا ہم سے سوید بن سعید نے بیان کیا، کہا ہم سے علی بن مسہرنے بیان کیا, عاصم احول نے حضرت عبداللہ بن سرجس رضی اللہ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو كَامِلٍ، حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ، ح وحَدَّثَنِي سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، كِلَاهُمَا عَنْ عَاصِمٍ الْأَحْوَلِ، ح وحَدَّثَنِي حَامِدُ بْنُ عُمَرَ الْبَكْرَاوِيُّ - وَاللَّفْظُ لَهُ -، حَدَّثَنَا عَبْدُ الْوَاحِدِ يَعْنِي ابْنَ زِيَادٍ، حَدَّثَنَا عَاصِمٌ، عَنْ عَبْدِ اللهِ بْنِ سَرْجِسَ، قَالَ: رَأَيْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَأَكَلْتُ مَعَهُ خُبْزًا وَلَحْمًا، أَوْ قَالَ ثَرِيدًا، قَالَ فَقُلْتُ لَهُ: أَسْتَغْفَرَ لَكَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ؟ قَالَ: نَعَمْ، وَلَكَ، ثُمَّ تَلَا هَذِهِ الْآيَةَ {وَاسْتَغْفِرْ لِذَنْبِكَ وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ} [محمد: 19] قَالَ: ثُمَّ دُرْتُ خَلْفَهُ «فَنَظَرْتُ إِلَى خَاتَمِ النُّبُوَّةِ بَيْنَ كَتِفَيْهِ. عِنْدَ نَاغِضِ كَتِفِهِ الْيُسْرَى. جُمْعًا عَلَيْهِ خِيلَانٌ كَأَمْثَالِ الثَّآلِيلِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13652,
                "hadithNumber": "6089",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was neither very conspicuously tall nor short-statured, and his color was neither glaringly white nor brown; his hair was neither very curly nor very straight; Allah commissioned him (as a Prophet) when he had reached the age of forty years, and he stayed in Mecca for ten years and for ten years in Medina; Allah took him away when he had just reached the age of sixty, and there had not been twenty white hair in his head and beard.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم بہت درازقد تھے نہ پستہ قامت ، بالکل سفید تھے نہ بالکل گندمی ، نہ سخت گھنگرالے بال تھے اور بہ بالکل سیدھے ، اللہ تعالیٰ نے آ پ کو چالیس سال کی عمر میں بعثت سے نوازا ، آپ دس سال مکہ مکرمہ میں رہے ، اور دس سال مدینہ میں ، اللہ تعالیٰ نے ساٹھ سال ( سے کچھ زائد ) عمر میں آپ کو وفات دی جبکہ آپ کے سر اور داڑھی میں بیس بال بھی سفید نہیں تھے ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: امام مالک نے ربیعہ بن ابی عبدالرحمن سے ، انھوں نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی ، انھوں نےان ( حضرت انس رضی اللہ تعالیٰ عنہ ) کو یہ کہتے ہوئے سنا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ سَمِعَهُ يَقُولُ: «كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لَيْسَ بِالطَّوِيلِ الْبَائِنِ، وَلَا بِالْقَصِيرِ، وَلَيْسَ بِالْأَبْيَضِ الْأَمْهَقِ وَلَا بِالْآدَمِ وَلَا بِالْجَعْدِ الْقَطَطِ وَلَا بِالسَّبِطِ، بَعَثَهُ اللهُ عَلَى رَأْسِ أَرْبَعِينَ سَنَةً فَأَقَامَ بِمَكَّةَ عَشْرَ سِنِينَ وَبِالْمَدِينَةِ عَشْرَ سِنِينَ، وَتَوَفَّاهُ اللهُ عَلَى رَأْسِ سِتِّينَ سَنَةً، وَلَيْسَ فِي رَأْسِهِ وَلِحْيَتِهِ عِشْرُونَ شَعْرَةً بَيْضَاءَ».",
                "headingArabic": "ي صِفَةِ النَّبِيِّ صلى الله عليه وسلم وَمَبْعَثِهِ وَسِنِّهِ ‏.‏",
                "headingUrdu": "آپ صلی اللہ علیہ وسلم کتنی دیر تک زندہ رہے اور مکہ اور مدینہ میں کتنی مدت رہے؟",
                "headingEnglish": "How Long He (SAW) Lived, And How Long He Stayed In Makkah And Al-Madinah",
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13653,
                "hadithNumber": "6090",
                "englishNarrator": "A Hadith like that of Malik bin Anas (no. 6089) was narrated from Anas bin Malik رضی اللہ عنہ, and in both of their Ahadith it add:",
                "hadithEnglish": "\"He was bright faced.\"",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم کا رنگ کھلتا ہوا تھا ۔",
                "urduNarrator": "ہم سے یحییٰ بن ایوب، قتیبہ بن سعید اور علی بن حجر نے بیان کیا، انہوں نے کہا: اسماعیل بن جعفر اور سلیمان بن بلال دونوں نے ربیعہ بن ابی عبدالرحمن سے ، انھوں نے حضرت انس بن مالک رضی اللہ عنہ سے ، امام مالک بن انس رضی اللہ تعالیٰ عنہ کی حدیث کے مانندحدیث بیان کی اور ان دونوں نےاپنی حدیث میں مذید بیان کیا",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَعَلِيُّ بْنُ حُجْرٍ، قَالُوا: حَدَّثَنَا إِسْمَاعِيلُ يَعْنُونَ ابْنَ جَعْفَرٍ، ح وحَدَّثَنِي الْقَاسِمُ بْنُ زَكَرِيَّاءَ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنِي سُلَيْمَانُ بْنُ بِلَالٍ، كِلَاهُمَا، عَنْ رَبِيعَةَ يَعْنِي ابْنَ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ أَنَسِ بْنِ مَالِكٍ، بِمِثْلِ حَدِيثِ مَالِكِ بْنِ أَنَسٍ وَزَادَ فِي حَدِيثِهِمَا كَانَ أَزْهَرَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13654,
                "hadithNumber": "6091",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) died when he was sixty-three years old, and so was the case with Abu Bakr رضی اللہ عنہ , and so was the case with Umar رضی اللہ عنہ who was also sixty-three (when he died).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے وفات پائی اورآپ صلی اللہ علیہ وسلم تریسٹھ ( 63 ) سال کے تھے اور حضرت ابو بکر رضی اللہ تعالیٰ عنہ ( فوت ہوئے ) اور وہ تریسٹھ سال کے تھے اور حضرت عمر رضی اللہ تعالیٰ عنہ ( کی شہادت ہوئی ) اور وہ تریسٹھ سال کے تھے ۔",
                "urduNarrator": "مجھ سے ابو غسان رازی محمد بن عمرو نے بیان کیا، کہا ہم سے حکم بن سلام نے بیان کیا، ہم سے عثمان بن زیدہ نے بیان کیا, زبیر بن عدی نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی کہ انھوں نے کہا",
                "hadithArabic": "حَدَّثَنِي أَبُو غَسَّانَ الرَّازِيُّ مُحَمَّدُ بْنُ عَمْرٍو، حَدَّثَنَا حَكَّامُ بْنُ سَلْمٍ، حَدَّثَنَا عُثْمَانُ بْنُ زَائِدَةَ، عَنِ الزُّبَيْرِ بْنِ عَدِيٍّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ: «قُبِضَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَهُوَ ابْنُ ثَلَاثٍ وَسِتِّينَ، وَأَبُو بَكْرٍ وَهُوَ ابْنُ ثَلَاثٍ وَسِتِّينَ، وَعُمَرُ وَهُوَ ابْنُ ثَلَاثٍ وَسِتِّينَ».",
                "headingArabic": "كَمْ سِنُّ النَّبِيِّ صلى الله عليه وسلم يَوْمَ قُبِضَ ‏.‏",
                "headingUrdu": "رسول اللہ صلی اللہ علیہ وسلم کی عمر جب آپ کی وفات ہوئی۔",
                "headingEnglish": "The Age Of The Prophet (SAW) When He Died",
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13655,
                "hadithNumber": "6092",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) died when he had attained the age of sixty-three. And a hadith like this had been transmitted on the authority of Sa'id bin Musayyib.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کی وفات ہوئی اور آپ63 سال کے تھے ۔ ابن شہاب نے کہا : مجھے سعید بن مسیب نے بھی اسی طرح بتایا ۔",
                "urduNarrator": "اور مجھ سے عبدالملک بن شعیب بن لیث نے بیان کیا، مجھ سے میرے والد نے بیان کیا، میرے دادا سے، انہوں نے کہا:عقل بن خالد نے ابن شہاب سے ، انھوں نے عروہ بن زبیر سے ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، قَالَ: حَدَّثَنِي عُقَيْلُ بْنُ خَالِدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، «تُوُفِّيَ وَهُوَ ابْنُ ثَلَاثٍ وَسِتِّينَ سَنَةً» وقَالَ ابْنُ شِهَابٍ، أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيِّبِ، بِمِثْلِ ذَلِكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13656,
                "hadithNumber": "6093",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Ibn Shihab through the same chain of transmitters.",
                "hadithUrdu": "ہم سے عثمان بن ابی شیبہ اور عباد بن موسیٰ نے بیان کیا، کہا کہ ہم سے طلحہ بن یحییٰ نے بیان کیا، یونس بن یزید نے ابن شہاب سے دونوں سندوں سے عقیل کی حدیث کے مانند ( بیان کیا ۔ )",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَعَبَّادُ بْنُ مُوسَى، قَالَا: حَدَّثَنَا طَلْحَةُ بْنُ يَحْيَى، عَنْ يُونُسَ بْنِ يَزِيدَ، عَنِ ابْنِ شِهَابٍ، بِالْإِسْنَادَيْنِ جَمِيعًا، مِثْلَ حَدِيثِ عُقَيْلٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13657,
                "hadithNumber": "6094",
                "englishNarrator": "Amr reported:",
                "hadithEnglish": "I said to 'Urwa: How long did Allah's Apostle - ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) stay in Mecca? He said: For ten years. I said: Ibn 'Abbas رضی اللہ عنہ says (that he stayed in Mecca) for thirteen years.",
                "hadithUrdu": "میں نے عروہ سے پوچھا : نبی کریم صلی اللہ علیہ وسلم ( بعثت کے بعد ) مکہ میں کتنا عرصہ رہے؟انھوں نے کہا : دس ( سال ۔ ) انھوں ( عمرو ) نے کہا : میں نے کہا : حضرت ابن عباس رضی اللہ عنہ تیرہ ( سال ) کہتے تھے ۔",
                "urduNarrator": "ابومعمر اسماعیل بن ابراہیم ہذلی نے کہا : ہمیں سفیان نے عمرو ( بن دینار ) سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو مَعْمَرٍ إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ الْهُذَلِيُّ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، قَالَ: قُلْتُ لِعُرْوَةَ: كَمْ كَانَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمَكَّةَ؟ قَالَ: عَشْرًا، قَالَ: قُلْتُ: فَإِنَّ ابْنَ عَبَّاسٍ يَقُولُ: ثَلَاثَ عَشْرَةَ.",
                "headingArabic": "كَمْ أَقَامَ النَّبِيُّ صلى الله عليه وسلم بِمَكَّةَ وَالْمَدِينَةِ ‏.‏",
                "headingUrdu": "نبی کریم صلی اللہ علیہ وسلم مکہ اور مدینہ میں کتنی دیر رہے؟",
                "headingEnglish": "How Long Did The Prophet ft Stay In Makkah And Al-Madinah?",
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13658,
                "hadithNumber": "6095",
                "englishNarrator": "Amr reported: I said to 'Urwa:",
                "hadithEnglish": "How long did Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) stay in Mecca? He said: For ten years. I said: Ibn Abbas رضی اللہ عنہ says it is some years above ten. He ('Urwa) sought forgiveness for him and said: His statement is based on the verse of a poet.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم ( بعثت کے بعد ) مکہ میں کتنے سال رہے؟انھوں نے کہا : دس ( سال ۔ ) کہا : میں نے کہا : حضرت ابن عباس رضی اللہ عنہ تو دس ( سال ۔ ) سے کچھ زائد بتاتے ہیں ۔ انھوں ( عمرو بن دینار ) نے کہا : توانھوں ( عروہ رحمۃ اللہ علیہ ) نے کہا : اللہ ان کی مغفرت کرے!اور کہا : انھوں نے یہ عمر شاعر کے قول سے اخذ کی ہے ۔",
                "urduNarrator": "ابن ابی عمر نے کہا ,  ہمیں سفیان نے عمرو سے روایت کی ، انھوں نے کہا : میں نے عروہ سے پوچھا",
                "hadithArabic": "وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، قَالَ: قُلْتُ لِعُرْوَةَ: كَمْ لَبِثَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمَكَّةَ؟ قَالَ: عَشْرًا، قُلْتُ: فَإِنَّ ابْنَ عَبَّاسٍ يَقُولُ: بِضْعَ عَشْرَةَ قَالَ: فَغَفَّرَهُ، وَقَالَ إِنَّمَا أَخَذَهُ مِنْ قَوْلِ الشَّاعِرِ وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، قَالَ: قُلْتُ لِعُرْوَةَ: كَمْ لَبِثَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمَكَّةَ؟ قَالَ: عَشْرًا، قُلْتُ: فَإِنَّ ابْنَ عَبَّاسٍ يَقُولُ: بِضْعَ عَشْرَةَ قَالَ: فَغَفَّرَهُ، وَقَالَ إِنَّمَا أَخَذَهُ مِنْ قَوْلِ الشَّاعِرِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13659,
                "hadithNumber": "6096",
                "englishNarrator": "Ibn 'Abbas reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) stayed in Mecca for thirteen years and he died when he had attained the age of sixty three years.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم مکہ میں تیرہ سال رہے ، آپ کی وفات ہوئی اور آپ صلی اللہ علیہ وسلم 63 سال کے تھے ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم اور ہارون بن عبداللہ نے بیان کیا، روح بن عبادہ سے، ہم سے زکریا بن اسحاق نے بیان کیا,عمرو بن دینار نے حضرت ابن عباس رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَهَارُونُ بْنُ عَبْدِ اللهِ، عَنْ رَوْحِ بْنِ عُبَادَةَ، حَدَّثَنَا زَكَرِيَّاءُ بْنُ إِسْحَاقَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، «مَكَثَ بِمَكَّةَ ثَلَاثَ عَشْرَةَ، وَتُوُفِّيَ وَهُوَ ابْنُ ثَلَاثٍ وَسِتِّينَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13660,
                "hadithNumber": "6097",
                "englishNarrator": "Ibn 'Abbas رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) stayed in Mecca for thirteen years (after he had received revelation) and stayed in Medina for ten years, and he was sixty-three when he died.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم مکہ میں تیرہ سال رہے آپ صلی اللہ علیہ وسلم کی طرف وحی بھیجی جاتی تھی اور مدینہ میں دس سال رہ ، آپ کی وفات ہوئی اور آپ تریسٹھ سال کے تھے ۔",
                "urduNarrator": "ہم سے ابن ابی عمر نے بیان کیا، کہا ہم سے بشر بن السری نے بیان کیا، کہا ہم سے حماد نے بیان کیا, ابو جمرہ ضبعی نے حضرت ابن عباس رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ، حَدَّثَنَا حَمَّادٌ، عَنْ أَبِي جَمْرَةَ الضُّبَعِيِّ، عَنِ ابْنِ عَبَّاسٍ، قَالَ: «أَقَامَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمَكَّةَ ثَلَاثَ عَشْرَةَ سَنَةً يُوحَى إِلَيْهِ، وَبِالْمَدِينَةِ عَشْرًا وَمَاتَ وَهُوَ ابْنُ ثَلَاثٍ وَسِتِّينَ سَنَةً».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13661,
                "hadithNumber": "6098",
                "englishNarrator": "Abu Ishaq reported:",
                "hadithEnglish": "I was sitting with 'Abdullah bin 'Utba and there was a discussion about the age of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). Some of the persons said: Abu Bakr رضی اللہ عنہ  was older than Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). 'Abdullah رضی اللہ عنہ said: Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) died when he was sixty-three, and Abu Bakr رضی اللہ عنہ died when he was sixty-three and so 'Umar fell as a martyr when he was sixty-three. A person from the people who was called 'Amir bin Sa'd رضی اللہ عنہ reported that Jabir رضی اللہ عنہ had said: We were sitting with Mu'awiya رضی اللہ عنہ that there was a discussion about the age of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). Thereupon Mu'awiya رضی اللہ عنہ said: Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) died when he had attained the age of sixty-three, and Abu Bakr رضی اللہ عنہ died when he had attained the age of sixty-three, and Umar رضی اللہ عنہ fell as a martyr when he had attained the age of sixty-three.",
                "hadithUrdu": "میں عبداللہ بن عتبہ کے پاس بیٹھا ہواتھا تو ( وہاں بیٹھےہوئے ) لوگوں نے رسول اللہ صلی اللہ علیہ وسلم کی عمر کے بارے میں بات کی ۔ لوگوں میں سے ایک نے کہا : حضرت ابو بکر رضی اللہ عنہ عمر میں رسول اللہ صلی اللہ علیہ وسلم سے بڑ ے تھے عبداللہ کہنے لگے : رسول اللہ صلی اللہ علیہ وسلم کا انتقال ہوا اور آپ تریسٹھ سال کے تھے ، حضرت ابو بکر رضی اللہ عنہ کاانتقال ہوا اور وہ بھی تریسٹھ سال کے تھے ، اور حضرت عمر رضی اللہ تعالیٰ عنہ کو شہید کیا گیا اور وہ بھی تریسٹھ سال کے تھے ۔ کہا : ان لوگوں میں سے ایک شخص نے ، جنھیں عامر بن سعد کہا جاتاتھا ، کہا : ہمیں جریر ( بن عبداللہ بن جابر بجلی رضی اللہ تعالیٰ عنہ ) نے حدیث بیان کی کہ ہم حضرت معاویہ رضی اللہ تعالیٰ عنہ کے پاس بیٹھے ہوئے تھے تو لوگوں نے رسول اللہ صلی اللہ علیہ وسلم کی عمر مبارک کا ذکر کیاتو حضرت معاویہ رضی اللہ عنہ بتایا : رسول اللہ صلی اللہ علیہ وسلم کا انتقال ہوا اور آپ تریسٹھ برس کے تھے اور حضرت عمر رضی اللہ تعالیٰ عنہ شہید ہوئے اور وہ بھی تریسٹھ برس کے تھے ۔",
                "urduNarrator": "ہم سے عبداللہ بن عمر بن محمد بن ابان الجعفی نے بیان کیا, اسلام ابواحوص نے ابو اسحاق سے روایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنَا عَبْدُ اللهِ بْنُ عُمَرَ بْنِ مُحَمَّدِ بْنِ أَبَانَ الْجُعْفِيُّ، حَدَّثَنَا سَلَّامٌ أَبُو الْأَحْوَصِ، عَنْ أَبِي إِسْحَاقَ، قَالَ: كُنْتُ جَالِسًا مَعَ عَبْدِ اللهِ بْنِ عُتْبَةَ، فَذَكَرُوا سِنِي رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: بَعْضُ الْقَوْمِ كَانَ أَبُو بَكْرٍ أَكْبَرَ مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ عَبْدُ اللهِ: «قُبِضَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَهُوَ ابْنُ ثَلَاثٍ وَسِتِّينَ، وَمَاتَ أَبُو بَكْرٍ وَهُوَ ابْنُ ثَلَاثٍ وَسِتِّينَ، وَقُتِلَ عُمَرُ وَهُوَ ابْنُ ثَلَاثٍ وَسِتِّينَ» قَالَ: فَقَالَ رَجُلٌ مِنَ الْقَوْمِ يُقَالُ لَهُ عَامِرُ بْنُ سَعْدٍ: حَدَّثَنَا جَرِيرٌ، قَالَ: كُنَّا قُعُودًا عِنْدَ مُعَاوِيَةَ فَذَكَرُوا سِنِي رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مُعَاوِيَةُ: «قُبِضَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَهُوَ ابْنُ ثَلَاثٍ وَسِتِّينَ سَنَةً، وَمَاتَ أَبُو بَكْرٍ وَهُوَ ابْنُ ثَلَاثٍ وَسِتِّينَ، وَقُتِلَ عُمَرُ وَهُوَ ابْنُ ثَلَاثٍ وَسِتِّينَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13662,
                "hadithNumber": "6099",
                "englishNarrator": "Jarir reported:",
                "hadithEnglish": "He heard Mu'awiya رضی اللہ عنہ say in his address that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) died at the age of sixty-three, so was the case with Abu Bakr and 'Umar, and I (am now) sixty-three.",
                "hadithUrdu": "انھوں نے حضرت معاویہ رضی اللہ عنہ کوخطبہ دیتے ہوئے سنا ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم کاانتقال ہوا تو آپ تریسٹھ برس کے تھے اور ابو بکر وعمر رضی اللہ تعالیٰ عنہ ( بھی اتنی ہی عمر کے ہوئے ) اوراب میں بھی تریسٹھ برس کا ہوں ۔",
                "urduNarrator": "ہم سے ابن المثنیٰ اور ابن بشار نے بیان کیا - اور یہ قول ابن المثنیٰ کا ہے - انہوں نے کہا: ہم سے محمد بن جعفر نے بیان کیا، شعبہ نے کہا : میں نے ابو اسحاق سےسنا ، وہ عامر بن سعد بجلی سے حدیث روایت کررہے تھے ، انھوں نے جریر سے روایت کی",
                "hadithArabic": "وَحَدَّثَنَا ابْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ - وَاللَّفْظُ لِابْنِ الْمُثَنَّى - قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، سَمِعْتُ أَبَا إِسْحَاقَ، يُحَدِّثُ عَنْ عَامِرِ بْنِ سَعْدٍ الْبَجَلِيِّ، عَنْ جَرِيرٍ، أَنَّهُ سَمِعَ مُعَاوِيَةَ، يَخْطُبُ فَقَالَ: «مَاتَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَهُوَ ابْنُ ثَلَاثٍ وَسِتِّينَ، وَأَبُو بَكْرٍ وَعُمَرُ وَأَنَا ابْنُ ثَلَاثٍ وَسِتِّينَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13663,
                "hadithNumber": "6100",
                "englishNarrator": "Ammar, the freed slave of Banu Hashim, reported:",
                "hadithEnglish": "I asked Ibn 'Abbas رضی اللہ  عنہ how old was he when death overtook the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). He said: I little know that such a thing is not known to a man like you who belong to his people. He said: I asked people about it but they differed with me, and I liked to know your opinion about it. He said: Do you know counting? He said: Yes. He then said: Bear this in mind very well that he was commissioned (as a Prophet) at the age of forty, and he stayed in Mecca for fifteen years; sometime in peace and sometime in dread, and (lived) for ten years after his migration to Medina.",
                "hadithUrdu": "وفات کے وقت رسول اللہ صلی اللہ علیہ وسلم ( کی عمر مبارک ) کے کتنے سال گزرے تھے؟انھوں نے کہا : میں نہیں سمجھتا تھا کہ تم جیسے شخص پر ، جو آپ صلی اللہ علیہ وسلم کی ہی قوم سے ( متعلق ) تھا ، یہ بات مخفی ہوگی ۔ کہا : میں نے عرض کی : میں نے لوگوں سے اس کے بارے میں سوال کیا تو میرے سامنے ان لوگوں نے باہم اختلاف کیا ۔ تو مجھے اچھامعلوم ہوا کہ میں اس کے بارے میں آپ کا قول معلوم کروں ، انھوں نے کہا : تم حساب کرسکتے ہو؟کہا : میں نے عرض کی : جی ہاں ، انھوں نے کہا : ( پہلے ) تو چالیس لو ، جب آپ کو مبعوث کیا گیا ، ( پھر ) پندرہ سال مکہ میں ، کبھی امن میں اور کبھی خوف میں دس سال مدینہ کی طرف ہجرت سے ( لے کر جمع کرلو ۔ )",
                "urduNarrator": "نابینا ابن منہال نے مجھ سے کہا, یزید بن زریع نے کہا : ہمیں یونس ب عبید نے بنو ہاشم کے آزادکردہ غلام عمار سے روایت کی ، کہا : میں نے حضرت ابن عباس رضی اللہ  عنہ سے سوال کیا کہ",
                "hadithArabic": "وحَدَّثَنِي ابْنُ مِنْهَالٍ الضَّرِيرُ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا يُونُسُ بْنُ عُبَيْدٍ، عَنْ عَمَّارٍ، مَوْلَى بَنِي هَاشِمٍ، قَالَ: سَأَلْتُ ابْنَ عَبَّاسٍ: كَمْ أَتَى لِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَوْمَ مَاتَ؟ فَقَالَ: مَا كُنْتُ أَحْسِبُ مِثْلَكَ مِنْ قَوْمِهِ يَخْفَى عَلَيْهِ ذَاكَ، قَالَ قُلْتُ: إِنِّي قَدْ سَأَلْتُ النَّاسَ فَاخْتَلَفُوا عَلَيَّ، فَأَحْبَبْتُ أَنْ أَعْلَمَ قَوْلَكَ فِيهِ، قَالَ: أَتَحْسُبُ؟ قَالَ قُلْتُ: نَعَمْ، قَالَ: «أَمْسِكْ أَرْبَعِينَ، بُعِثَ لَهَا خَمْسَ عَشْرَةَ بِمَكَّةَ يَأْمَنُ وَيَخَافُ، وَعَشْرَ مِنْ مُهَاجَرِهِ إِلَى الْمَدِينَةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 13351,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=534",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=532",
                "label": "532",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=533",
                "label": "533",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=534",
                "label": "534",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=535",
                "label": "535",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=536",
                "label": "536",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=537",
                "label": "537",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=538",
                "label": "538",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=536",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=536",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=534",
        "to": 13375,
        "total": 40465
    }
}