{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 345,
        "data": [
            {
                "id": 8889,
                "hadithNumber": "1325",
                "englishNarrator": "A'isha, the wife of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) reported:",
                "hadithEnglish": "The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to supplicate in prayer thus: O Allah! I seek refuge with Thee from the torment of the grave, and I seek refuge with Thee from the trial of the Masih al-Dajjal (Antichrist) and I seek refuge with Thee from the trial of life and death. O Allah! I seek refuge with Thee from sin and debt. She ('A'isha) reported: Someone said to him - (the Holy Prophet ﷺ): Messenger of Allah! why is it that you so often seek refuge from debt? He said: When a (person) incurs debt, (he is obliged) to tell lies and break promise.",
                "hadithUrdu": "نبی اکرم ﷺ نماز میں ( یہ ) دعا مانگتے تھے : اے اللہ ! میں قبر کے عذاب سے تیری پنا ہ چاہتا ہوں اور مسیح دجال کے فتنے سے تیری پناہ کا طالب ہوں ، میں زندگی اور موت کے فتنے سے تیری پناہ مانگتا ہوں ، اے اللہ ! میں گناہ اور قرض ( میں پھنس جانے سے تیری پناہ چاہتا ہوں ۔ ‘ ‘ ) حضرت عائشہ ؓ نے کہا : کسی کہنے والے نے کہا : اللہ رسول ﷺ آپ قرض سے کس قدر پناہ مانگتے ہیں ! آپ ﷺ نے فرمایا : ”جب آدمی مقروض ہو جائے تو بات کرتا ہے تو جھوٹ بولتا ہے اور وعدہ کرتا ہے تو اس کی خلاف ورزی کرتا ہے ‘ ‘",
                "urduNarrator": "مجھ سے ابوبکر بن اسحاق نے بیان کیا، کہا ہم سے ابوالیمان نے بیان کیا، کہا ہم سے شعیب نے بیان کیا، وہ زہری کی سند سے، انہوں نے کہا: مجھ سے عروہ بن الزبیر نے بیان کیا, نبی کریم ﷺ کی زوجہ حضرت عائشہ ؓ نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنِي أَبُو بَكْرِ بْنُ إِسْحَاقَ، أَخْبَرَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ: أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَخْبَرَتْهُ، أَنَّ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ يَدْعُو فِي الصَّلَاةِ «اللهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، اللهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْمَأْثَمِ وَالْمَغْرَمِ» قَالَتْ: فَقَالَ لَهُ قَائِلٌ: مَا أَكْثَرَ مَا تَسْتَعِيذُ مِنَ الْمَغْرَمِ يَا رَسُولَ اللهِ فَقَالَ: «إِنَّ الرَّجُلَ إِذَا غَرِمَ، حَدَّثَ فَكَذَبَ، وَوَعَدَ فَأَخْلَفَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8890,
                "hadithNumber": "1326",
                "englishNarrator": "Abu Huraira رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: When any one of you completes the last tashahhud. he should seek refuge with Allah from four (trials). I.e. from the torment of Hell, from the torment of grave, from the trial of life and death, and from the mischief of Masih at-Dajjal (Antichrist).",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’ جب تم میں سے کوئی آخر ی تشہد سے فارغ ہو جائے تو چار چیزوں سے اللہ تعالیٰ کی پناہ طلب کرے : جہنم کے عذاب سے ، قبر کے عذاب سے زندگی اور موت کی آزمائش سے اور مسیح دجال کے شر سے ۔ ‘ ‘",
                "urduNarrator": "مجھ سے زہیر بن حرب نے کہا,ولید بن مسلم نےکہا : مجھے اوزاعی نے حدیث سنائی ، انہوں نے کہا : ہمیں حسان بن عطیہ نےحدیث سنائی ، کہا : مجھے محمد بن ابی عائشہ نے حدیث سنائی کہ انھوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو یہ کہتے ہوئے سنا کہ",
                "hadithArabic": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنِي الْأَوْزَاعِيُّ، حَدَّثَنَا حَسَّانُ بْنُ عَطِيَّةَ، حَدَّثَنِي مُحَمَّدُ بْنُ أَبِي عَائِشَةَ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: إِذَا فَرَغَ أَحَدُكُمْ مِنَ التَّشَهُّدِ الْآخِرِ، فَلْيَتَعَوَّذْ بِاللهِ مِنْ أَرْبَعٍ: مِنْ عَذَابِ جَهَنَّمَ، وَمِنْ عَذَابِ الْقَبْرِ، وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، وَمِنْ شَرِّ الْمَسِيحِ الدَّجَّالِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8891,
                "hadithNumber": "1327",
                "englishNarrator": "It was narrated from Al-Awzai with this chain (no. 1326):",
                "hadithEnglish": "But he said \"When one of you has finished the Tashahhud,\" and he did not say: \"final.\"",
                "hadithUrdu": "آپ نے فرمایا ’’جب تم میں سے کوئی تشہد سے فارغ ہو ۔ ۔ ۔ ۔ ۔ ‘ ‘ انھوں نے الآخر ( آخری تشہد ) کے الفاظ نہیں کہے ۔",
                "urduNarrator": "مجھ سے الحکم بن موسیٰ نے کہا, ہقل بن زیاد اور عیسیٰ بن یونس دونوں نے اوزاعی کی مذکورہ سند سے یہی حدیث روایت کی ، ا س میں ہے",
                "hadithArabic": "وحَدَّثَنِيهِ الْحَكَمُ بْنُ مُوسَى، حَدَّثَنَا هِقْلُ بْنُ زِيَادٍ، ح قَالَ: وَحَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ، أَخْبَرَنَا عِيسَى يَعْنِي ابْنَ يُونُسَ، جَمِيعًا عَنِ الْأَوْزَاعِيِّ، بِهَذَا الْإِسْنَادِ، وَقَالَ: «إِذَا فَرَغَ أَحَدُكُمْ مِنَ التَّشَهُّدِ» وَلَمْ يَذْكُرِ «الْآخِرَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8892,
                "hadithNumber": "1328",
                "englishNarrator": "Abu Huraira رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: O Allah! I seek refuge with Thee from the torment of the grave, and the torment of Hell, and the trial of life and death and the mischief of Masih al-Dajjal.",
                "hadithUrdu": "اللہ کے نبی ﷺ نے دعا کی : ’’اے اللہ ! میں قبر کے عذاب سے تیری پناہ میں آتا ہوں اور آگ کے عذاب سے اور زندگی اور موت کی آزمائش سے اور مسیح دجال کے شر سے ۔ ‘ ‘",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا، کہا ہم سے ابن ابی عدی نے بیان کیا,ہشام نے یحییٰ سے اور انھوں نے ابو سلمہ سے روایت کی کہ انھوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنا ، وہ کہتے تھے",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ هِشَامٍ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ: قَالَ نَبِيُّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «اللهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَعَذَابِ النَّارِ، وَفِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، وَشَرِّ الْمَسِيحِ الدَّجَّالِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8893,
                "hadithNumber": "1329",
                "englishNarrator": "Abu Huraira reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Seek refuge with Allah from the torment of Hell, seek refuge with Allah from the torment of the grave, and seek refuge with Allah from the trial of Masih al-Dajjal and seek refuge with Allah from the trial of life and death.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’اللہ کے عذاب سے اللہ کی پناہ طلب کرو ، قبر کے عذاب سے اللہ کی پناہ مانگوں ، مسیح دجال کے فتنے سے اللہ کی پناہ طلب کرو اور زندگی اور موت کے فتنے سے اللہ کی پناہ مانگو ۔ ‘ ‘",
                "urduNarrator": "ہم سے محمد بن عباد نے بیان کیا، کہا ہم سے سفیان نے بیان کیا,عمرو ( بن دینار ) نے طاؤس سے روایت کی ، انھوں نے کہا : میں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنا ، وہ کہتے تھے کہ",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبَّادٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ طَاوُسٍ، قَالَ: سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «عُوذُوا بِاللهِ مِنْ عَذَابِ اللهِ، عُوذُوا بِاللهِ مِنْ عَذَابِ الْقَبْرِ، عُوذُوا بِاللهِ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، عُوذُوا بِاللهِ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8894,
                "hadithNumber": "1330",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been transmitted by Ibn Tawus from his father on the authority of Abu Huraira رضی اللہ عنہ .",
                "hadithUrdu": "ہم سے محمد بن عباد نے بیان کیا، کہا ہم سے سفیان نے بیان کیا، وہ ابن طاؤس سے، انہوں نے اپنے والد سے، وہ ابوہریرہ رضی اللہ عنہ سے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبَّادٍ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8895,
                "hadithNumber": "1331",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been transmitted by A'raj on the authority of Abu Huraira رضی ‌اللہ ‌عنہ .",
                "hadithUrdu": "ہم سے محمد بن عباد، ابوبکر بن ابی شیبہ اور زہیر بن حرب نے بیان کیا، انہوں نے کہا: ہم سے سفیان نے ابو الزناد کی سند سے، اعرج نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انھوں نے نبی ﷺ سے اسی کی مانند روایت کی.",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ عَبَّادٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالُوا: حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8896,
                "hadithNumber": "1332",
                "englishNarrator": "Abu Huraira رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to seek refuge from the torment of the grave, torment of Hell and the trial of Dajjal.",
                "hadithUrdu": "آپ ﷺ قبر کے عذاب سے ، جہنم کے عذاب سے اور دجال کے فتنے سے پناہ مانگا کرتے تھے ۔",
                "urduNarrator": "ہم سے محمد بن المثنیٰ نے بیان کیا، کہا ہم سے محمد بن جعفر نے بیان کیا، کہا ہم سے شعبہ نے متبادل کے بارے میں بیان کیا,عبداللہ بن شقیق نے حضرت ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انھوں نے نبی ﷺ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ بُدَيْلٍ، عَنْ عَبْدِ اللهِ بْنِ شَقِيقٍ، عَنْ أَبِي هُرَيْرَةَ: «عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَتَعَوَّذُ مِنْ عَذَابِ الْقَبْرِ، وَعَذَابِ جَهَنَّمَ، وَفِتْنَةِ الدَّجَّالِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8897,
                "hadithNumber": "1333",
                "englishNarrator": "Ibn 'Abbas رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to teach them this supplication (in the same spirit) with which he used to teach them a surah of the Qur'an. He would thus instruct us: Say, O Allah, we seek refuge with Thee from the torment of Hell. And I seek refuge with Thee from the torment of the grave, and I seek refuge with Thee from the trial of al-Masih ad-Dajjal, and I seek refuge with Thee from the trial of life and death. Muslim bin Hajjaj said: It has reached me that Tawus said to his son: Did you make this supplication in prayer? He said: No. (Upon this) he (Tawus) said: Repeat the prayer. Tawus has narrated this hadith through three or four (transmitters) with words to the same effect.",
                "hadithUrdu": "رسول اللہ ﷺ ان ( سب صحابہ ) کو اس دعا کی تعلیم اسی طرح دیتے تھے جس طرح انھیں قرآن مجید کی کسی سورت کی تعلیم دیتے تھے ۔ آپ فرماتے تھے : ’’سب کہو : اے اللہ ! ہم جہنم کے عذاب سے تیری پناہ مانگتے ہیں اور میں قبر کے عذاب سے تیری پناہ مانگتا ہوں اور مسیح دجال کے فتنے سے تیری پناہ مانگتا ہوں اور زندگی اور موت کے فتنے سے تیری پناہ مانگتا ہوں ۔ ‘ ‘ امام مسلم  نے کہا مجھے یہ بات پہنچی کہ طاوس نے اپنے بیٹے سے پوچھا : کیا تم نے اپنی نماز میں یہ دعا مانگی ہے ؟ اس نے جواب دیا : نہیں ۔ اس پرطاوس نے کہا : دوبارہ نماز پرھو کیونکہ انھوں نے ( حدیث میں مذکور ) یہ دعا تین یا چار صحابہ سے روایت کی یا جیسے انھوں نے کہا ۔ ( یعنی جتنے صحابہ سے انھوں نے کہا ۔ )",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے مالک بن انس کی سند سے بیان کیا، ابو الزبیر رضی اللہ عنہ کی روایت سے جو ان کو پڑھا گیا,طاوس نے حضرت ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، فِيمَا قُرِئَ عَلَيْهِ عَنْ أَبِي الزُّبَيْرِ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ يُعَلِّمُهُمْ هَذَا الدُّعَاءَ كَمَا يُعَلِّمُهُمُ السُّورَةَ مِنَ الْقُرْآنِ يَقُولُ قُولُوا: «اللهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ عَذَابِ جَهَنَّمَ، وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ 'قَالَ مُسْلِمُ بْنُ الْحَجَّاجِ: بَلَغَنِي أَنَّ طَاوُسًا قَالَ لِابْنِهِ: أَدَعَوْتَ بِهَا فِي صَلَاتِكَ؟ فَقَالَ: لَا، قَالَ: أَعِدْ صَلَاتَكَ، لِأَنَّ طَاوُسًا رَوَاهُ عَنْ ثَلَاثَةٍ أَوْ أَرْبَعَةٍ، أَوْ كَمَا قَالَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8898,
                "hadithNumber": "1334",
                "englishNarrator": "Thauban رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) finished his prayer. He begged forgiveness three times and said: O Allah! Thou art Peace, and peace comes from Thee; Blessed art Thou, O Possessor of Glory and Honour. Walid reported: I said to Auza'i: How is the seeking of forgiveness? He replied: You should say: I beg forgiveness from Allah, I beg forgiveness from Allah.",
                "hadithUrdu": "رسول اللہ ﷺ جب اپنی نماز سے فارغ ہوتے تو تین دفعہ استغفار کرتےاور اس کے بعد کہتے : اللہم انت السلام و منك السلام ، تباركت ذاالجلال والاكرام ’’ اے اللہ ! تو ہی سلام ہے اور سلامتی تیری ہی طرف سے ہے ، تو صاحب رفعت و برکت ہے ، اے جلال والے اور عزت بخشنے والے ! ‘ ‘ ولید نے کہا : میں نے اوزاعی سے پوچھا : استغفار کیسے کیا جائے ؟ انھوں نے کہا : استغفر اللہ ، استغفر اللہ کہے ۔",
                "urduNarrator": "ہم سے داؤد بن رشید نے بیان کیا, ولید نے اوزاعی سے ، انہوں نے ابو عمار ۔ ان کا نام شداد بن عبداللہ ہے ۔ سے ، انھوں نے ابو اسماء سے اور انھوں نے حضرت ثوبان ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا دَاوُدُ بْنُ رُشَيْدٍ، حَدَّثَنَا الْوَلِيدُ، عَنِ الْأَوْزَاعِيِّ، عَنْ أَبِي عَمَّارٍ، اسْمُهُ شَدَّادُ بْنُ عَبْدِ اللهِ، عَنْ أَبِي أَسْمَاءَ، عَنْ ثَوْبَانَ، قَالَ: كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، إِذَا انْصَرَفَ مِنْ صَلَاتِهِ اسْتَغْفَرَ ثَلَاثًا وَقَالَ: «اللهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ، تَبَارَكْتَ ذَا الْجَلَالِ وَالْإِكْرَامِ» قَالَ الْوَلِيدُ: فَقُلْتُ لِلْأَوْزَاعِيِّ: كَيْفَ الْاسْتِغْفَارُ؟ قَالَ: تَقُولُ: أَسْتَغْفِرُ اللهَ، أَسْتَغْفِرُ اللهَ.",
                "headingArabic": "اسْتِحْبَابِ الذِّكْرِ بَعْدَ الصَّلاَةِ وَبَيَان صِفَتِهِ ‏",
                "headingUrdu": "نماز کے بعد ذکر کے کلمات پڑھنا مستحب ہے، اور یہ کیسے کیا جائے؟",
                "headingEnglish": "It is recommended to recite statements of remembrance after the prayer, and how that is to be done",
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8899,
                "hadithNumber": "1335",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) pronounced salutation, he salutation longer than it took him to say: O Allah: Thou art Peace, and peace comes from Thee, blessed art Thou, Possessor of Glory and ]Honour; and in the narration of Ibn Numair the words are: O Possessor of Glory and Honour.",
                "hadithUrdu": "کہا رسول اللہ ﷺ سلام پھیرنے کے بعد صرف یہ ذکر پڑھنے تک ہی ( قبلہ رخ ) بیٹھتے : اللہم ! انت السلام ومنک السلام تبارکت ذاالجلال والاکرام ’’اے اللہ ! تو ہی سلام ہے اور سلامتی تیری ہی طرف سے ہے ، تو صاحب رفعت وبرکت ہے ، اے جلال والے اور عزت بخشنے والے ! ‘ ‘ ابن نمیر کی روایت میں : یا ذالجلال والاکرام ( یا کے اضافے کے ساتھ ) ہے.",
                "urduNarrator": "ابو بکر بن ابی شبیہ اور ابن نمیر نے حدیث بیان کی ، کہا ہمیں ابو معاویہ نے عاصم سے حدیث سنائی ، انھوں نے عبداللہ بن حارث سے اور انھوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ، نُمَيْرٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنْ عَاصِمٍ، عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا سَلَّمَ لَمْ يَقْعُدْ إِلاَّ مِقْدَارَ مَا يَقُولُ ‏ ‏ اللَّهُمَّ أَنْتَ السَّلاَمُ وَمِنْكَ السَّلاَمُ تَبَارَكْتَ ذَا الْجَلاَلِ وَالإِكْرَامِ ‏ ‏ ‏.‏ وَفِي رِوَايَةِ ابْنِ نُمَيْرٍ ‏ ‏ يَا ذَا الْجَلاَلِ وَالإِكْرَامِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8900,
                "hadithNumber": "1336",
                "englishNarrator": "Ibn Numair narrated it with the same chain of transmitters and said:",
                "hadithEnglish": "O Possessor of Glory and Honour.",
                "hadithUrdu": "یا ذالجلال والاکرام ( یا کے اضافے کے ساتھ ) کہا ۔",
                "urduNarrator": "ابن نمیر نے ہم سے کہا, ابو خالد احمر نے عاصم سے اسی سند کے ساتھ یہی حدیث بیان کی اور",
                "hadithArabic": "وَحَدَّثَنَاهُ ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبُو خَالِدٍ يَعْنِي الْأَحْمَرَ، عَنْ عَاصِمٍ، بِهَذَا الْإِسْنَادِ. وَقَالَ: «يَا ذَا الْجَلَالِ وَالْإِكْرَامِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8901,
                "hadithNumber": "1337",
                "englishNarrator": "A hadith like this has been transmitted by Abdullah bin Harith on the authority of A'isha رضی اللہ عنہا except for the words:",
                "hadithEnglish": "He (the Holy Prophet ﷺ) used to say: 0 Possessor of Glory and Honour.",
                "hadithUrdu": "انھوں نے نبی ﷺ سے اسی کے مانند روایت کی ، مگر وہ ( شعبہ یا کے اضافے کے ساتھ ) یا ذاالجلال والاکرام کہا کرتے تھے ۔",
                "urduNarrator": "ہم سے عبد الوارث بن عبد الصمد نے بیان کیا، مجھ سے میرے والد نے بیان کیا,شعبہ نے عاصم اور خالد سے روایت کرتے ہوئے عبداللہ بن حارث سے حدیث بیان کی ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے اور",
                "hadithArabic": "وَحَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ عَبْدِ الصَّمَدِ، حَدَّثَنِي أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ عَاصِمٍ، عَنْ عَبْدِ اللهِ بْنِ الْحَارِثِ، وَخَالِدٍ، عَنْ عَبْدِ اللهِ بْنِ الْحَارِثِ، كِلَاهُمَا عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ بِمِثْلِهِ، غَيْرَ أَنَّهُ كَانَ يَقُولُ: «يَا ذَا الْجَلَالِ وَالْإِكْرَامِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8902,
                "hadithNumber": "1338",
                "englishNarrator": "Mughira bin Shu'ba ‌رضی ‌اللہ ‌عنہ ‌wrote to Mu'awiya ‌رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) finished the prayer and pronounced salutation he uttered (this supplication): There is no god but Allah. He is alone, Who has no partner. To Him belongs the sovereignty and to Him praise is due and He is Potent over every. thing. O Allah! no one can withhold what Thou givest, or give what Thou with holdest, and the riches cannot avail a wealthy person with Thee.",
                "hadithUrdu": "جب رسول اللہ ﷺ نماز سے فارغ ہو کر سلام پھیرتے تو فرماتے : ’’ ایک اللہ کے سوا کوئی عبادت کے لائق نہیں ، وہ یکتا ہے ، اس کا کوئی شریک نہیں ، حکومت اور فرمانروائی اسی کی ہے ، وہی شکرو ستائش کا حقدار ہے اور ہر چیز پر قدرت رکھنے والا ہے ۔ اے اللہ ! جو کچھ تو کسی کودے اسے کوئی روک سکنے والا نہیں اورجس چیز کو تو روک لے کوئی اسے دے سکنے والا نہیں اور تیرے سامنے کسی شان والے کو اس کی شان کوئی فاعدہ نہیں دے سکتی.",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے جریر نے بیان کیا, منصور نے مسیّب بن رافع سے ، انھوں نے مغیرہ بن شعبہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے مولیٰ وراد سے روایت کی ، انھوں نے کہا : حضرت مغیرہ بن شعبہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ( ان کے مطالبے پر ) معاویہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو لکھ کر بھیجا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنِ الْمُسَيَّبِ بْنِ رَافِعٍ، عَنْ وَرَّادٍ، مَوْلَى الْمُغِيرَةِ بْنِ شُعْبَةَ، قَالَ: كَتَبَ الْمُغِيرَةُ بْنُ شُعْبَةَ إِلَى مُعَاوِيَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ، إِذَا فَرَغَ مِنَ الصَّلَاةِ وَسَلَّمَ، قَالَ: «لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، اللهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ، وَلَا مُعْطِيَ لِمَا مَنَعْتَ، وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8903,
                "hadithNumber": "1339",
                "englishNarrator": "A hadith like this has been narrated by Mughira bin Shu'ba ‌رضی ‌اللہ ‌عنہ ‌with another chain of transmitters. Abu Bakr and Abu Kuraib narrated in their narration (that Warrad reported):",
                "hadithEnglish": "Mughira ‌رضی ‌اللہ ‌عنہ ‌gave me dictation of it and 1 wrote it to Mu'awiya ‌رضی ‌اللہ ‌عنہ .",
                "hadithUrdu": "مغیرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے یہ بات مجھے لکھوائی اور میں نے یہ بات حضرت معاویہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی طرف لکھ بھیجی ۔",
                "urduNarrator": "ابوبکر بن ابی شیبہ ، ابو کریب اور احمد بن سنان نے ہمیں حدیث بیان کی ، ان سب نے کہا : ہمیں ابو معاویہ نے اعمش سےحدیث سنائی ، انھوں نے مسیب بن رافع سے ، انھون نے مغیرہ بن شعبہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے مولیٰ وراد سے ، انھوں نےحضرت مغیرہ بن شعبہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انھوں نے نبی ﷺ سے اسی طرح روایت بیا ن کی ۔ ابو بکر اور ابو کریب نے اپنی روایت میں : ( وراد نے ) کہا",
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، وَأَحْمَدُ بْنُ سِنَانٍ، قَالُوا: حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنِ الْمُسَيَّبِ بْنِ رَافِعٍ، عَنْ وَرَّادٍ مَوْلَى الْمُغِيرَةِ بْنِ شُعْبَةَ، عَنِ الْمُغِيرَةِ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ. قَالَ أَبُو بَكْرٍ: وَأَبُو كُرَيْبٍ فِي رِوَايَتِهِمَا: قَالَ فَأَمْلَاهَا عَلَيَّ الْمُغِيرَةُ، وَكَتَبْتُ بِهَا إِلَى مُعَاوِيَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8904,
                "hadithNumber": "1340",
                "englishNarrator": "Warrad, the freed slave of Mughira bin Shu'ba رضی ‌اللہ ‌عنہ ‌, reported: Mughira bin Shu'ba رضی ‌اللہ ‌عنہ ‌wrote to Mu'awiya رضی ‌اللہ ‌عنہ ‌(it was Warrad who wrote this letter for him, i. e. Mughira):",
                "hadithEnglish": "I heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saying: When the salutation is pronounced. and the rest of the hadith is the same except this that he made no mention of: He is Potent over everything.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا: جب آپ صلی اللہ علیہ وسلم نے سلام کیا تو ان کی گفتگو کی طرح، سوائے ان کے اس قول کے کہ \"اور وہ ہر چیز پر قادر ہے۔\" خانقاہ\" کیونکہ اس کا ذکر نہیں کیا گیا تھا۔",
                "urduNarrator": "مجھ سے محمد بن حاتم نے بیان کیا، کہا ہم سے محمد بن بکر نے بیان کیا، کہا ہم سے ابن جریج نے بیان کیا، کہا کہ مجھ سے عبدہ بن ابی لبابہ نے بیان کیا کہ المغیرہ رہ بن شعبہ کے موکل وردہ نے، انہوں نے کہا: المغیرہ بن شعبہ نے ان کو لکھا۔ معاویہ نے وہ خط لکھا اور اس کا ایک ماخذ ہے۔اس نے وہ کتاب لکھی ہے اور اس کا ایک راوی ہے",
                "hadithArabic": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عَبْدَةُ بْنُ أَبِي لُبَابَةَ، أَنَّ وَرَّادًا، مَوْلَى الْمُغِيرَةِ بْنِ شُعْبَةَ، قَالَ: كَتَبَ الْمُغِيرَةُ بْنُ شُعْبَةَ، إِلَى مُعَاوِيَةَ - كَتَبَ ذَلِكَ الْكِتَابَ لَهُ وَرَّادٌ - إِنِّي سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: حِينَ سَلَّمَ، بِمِثْلِ حَدِيثِهِمَا، إِلَّا قَوْلَهُ «وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ» فَإِنَّهُ لَمْ يَذْكُرْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8905,
                "hadithNumber": "1341",
                "englishNarrator": "Warrad, the scribe of Mughira bin Shu'ba رضی ‌اللہ ‌عنہ , reported:",
                "hadithEnglish": "Mu'awiya رضی ‌اللہ ‌عنہ wrote to Mughira رضی ‌اللہ ‌عنہ (the contents) of the hadith as transmitted by Mansur and A'mash.",
                "hadithUrdu": "معاویہ نے المغیرہ کو منصور اور الاعمش جیسی حدیث لکھی۔",
                "urduNarrator": "ہم سے حمید بن عمر البکراوی نے بیان کیا، ان سے بشر یعنی ابن المفضل نے بیان کیا، انہوں نے کہا: ہم سے محمد بن المثنیٰ نے بیان کیا، مجھ سے ازہر نے بیان کیا، یہ سب ابن عون کی روایت سے ہیں۔ ابو سعید کی سند سے، المغیرہ بن شعبہ کے مصنف نے کہا",
                "hadithArabic": "وَحَدَّثَنَا حَامِدُ بْنُ عُمَرَ الْبَكْرَاوِيُّ، حَدَّثَنَا بِشْرٌ يَعْنِي ابْنَ الْمُفَضَّلِ، ح قَالَ: وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنِي أَزْهَرُ، جَمِيعًا عَنِ ابْنِ عَوْنٍ، عَنْ أَبِي سَعِيدٍ، عَنْ وَرَّادٍ، كَاتِبِ الْمُغِيرَةِ بْنِ شُعْبَةَ، قَالَ: كَتَبَ مُعَاوِيَةُ، إِلَى الْمُغِيرَةِ بِمِثْلِ حَدِيثِ مَنْصُورٍ، وَالْأَعْمَشِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8906,
                "hadithNumber": "1342",
                "englishNarrator": "Warrad, the scribe of Mughira bin Shu'ba ‌رضی ‌اللہ ‌عنہ ‌, reported Mu'awiya ‌رضی ‌اللہ ‌عنہ ‌wrote to Mughira ‌رضی ‌اللہ ‌عنہ ‌: :",
                "hadithEnglish": "Write to me anything which you heard from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). So he (Mughira) wrote to him (Mu'awiya): I heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) uttering (these words) at the completion of prayer: There is no god but Allah. He is alone and there is no partner with Him. Sovereignty belongs to Him and to Him is praise due and He is Potent over everything. O Allah! no one can withhold what Thou givest, or give what Thou withholdest, and riches cannot avail a wealthy person with Thee.",
                "hadithUrdu": "مجھے کوئی ایسی چیز لکھ بھیجیں جو آپ نے رسول اللہ ﷺ سے سنی ہو ، تو انھوں نے لکھ بھیجا کہ میں نے رسول اللہ ﷺ سے سنا ، جب آپ نماز ختم کر لیتے تو فرماتے : لاإله إلا الله وحده لاشريك له ، له مالملك ولاه الحمد ، وهو علي كل شيء قدير ، اللهم لا مانع لما أعطيت ولا معطي لما منعت ولا ينفع ذالجد منك الجد ’’ اللہ کے سوا کوئی عبادت کے لائق نہیں ، وہ اکیلا اور یکتا ہے ، اس کا کوئی شریک نہیں ، حکومت اور فرمانروائی اسی کی ہے ، وہی شکرو ستائش کا حقدار ہے اور وہی ہر چیز پر قدرت رکھنے والا ہے ۔ اے اللہ ! جو کچھ تو کسی کو دینا چاہے اسے کوئی روک سکنے والا نہیں اور تیرے سامنے کسی شان والے کو اس کی شان کوئی فائدہ نہیں دے سکتی ۔ ‘ ‘",
                "urduNarrator": "ہم سے ابن ابی عمر المکی نے بیان کیا, سفیان نے کہا : ہمیں عبدہ بن ابی لبابہ اور عبدالملک بن عمیر نے حدیث سنائی ، انھوں نے مغیرہ بن شعبہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے کاتب ورّاد سے سنا ، وہ کہتے تھے : حضرت معاویہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے مغیرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو خط لکھا کہ",
                "hadithArabic": "وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ الْمَكِّيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا عَبْدَةُ بْنُ أَبِي لُبَابَةَ، وَعَبْدُ الْمَلِكِ بْنُ عُمَيْرٍ، سَمِعَا وَرَّادًا، كَاتِبَ الْمُغِيرَةِ بْنِ شُعْبَةَ يَقُولُ: كَتَبَ مُعَاوِيَةُ إِلَى الْمُغِيرَةِ: اكْتُبْ إِلَيَّ بِشَيْءٍ سَمِعْتَهُ مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ فَكَتَبَ إِلَيْهِ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ إِذَا قَضَى الصَّلَاةَ: «لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، اللهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ، وَلَا مُعْطِيَ لِمَا مَنَعْتَ، وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8907,
                "hadithNumber": "1343",
                "englishNarrator": "Abu Zubair reported:",
                "hadithEnglish": "Ibn Zubair رضی اللہ عنہما uttered at the end of every prayer after pronouncing salutation (these words): There is no god but Allah. He is alone. There is no partner with Him. Sovereignty belongs to Him and He is Potent over everything. There is no might or power except with Allah. There is no god but Allah and we do not worship but Him alone. To Him belong all bounties, to Him belongs all Grace, and to Him is worthy praise accorded. There is no god but Allah, to Whom we are sincere in devotion, even though the unbelievers should disapprove it. (The narrator said): He (the Holy Prophet ﷺ) uttered it at the end of every (obligatory) prayer.",
                "hadithUrdu": "( عبداللہ ) زبیر رضی اللہ عنہما سلام پھیر کر ہر نماز کے بعد یہ کلمات کہتے تھے : ’’ ایک اللہ کے سوا کوئی عبادت کے لائق نہیں ، اس کا کوئی شریک نہیں ، حکومت اور فرمانروائی اسی کی ہے اور وہی شکر و ستائش کا حقدار ہے اور وہی ہر چیز پر قادر ہے ۔ گناہوں سے بچنے کی توفیق اور نیکی کرنے کی قوت اللہ ہی سے ( ملتی ) ہے ، اس کے سوا کوئی الہ و معبود نہیں ۔ ہم اس کےسوا کسی کی بندگی نہیں کرتے ، ہر طرح کی نعمت اور سارا فضل و کرم اسی کا ہے ، خوبصورت تعریف کا سزا وار بھی وہی ہے ، اللہ کے سوا کوئی معبود نہیں ، ہم اس کے لیے دین میں اخلاص رکھنے والے ہیں ، چاہے کافر اس کو ( کتنا ہی ) نا پسند کریں ۔ ‘ ‘ اور کہا کہ رسو ل اللہ ﷺ ہر نماز کے بعد بلند آواز سے لا الہ الا اللہ والے یہ کلمات کہا کرتے تھے ۔",
                "urduNarrator": "محمد کے والد عبداللہ بن نمیر نے کہا : ہمیں ہشام نے ابو زبیر سے حدیث سنائی ، کہا",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا هِشَامٌ، عَنْ أَبِي الزُّبَيْرِ، قَالَ: كَانَ ابْنُ الزُّبَيْرِ، يَقُولُ: فِي دُبُرِ كُلِّ صَلَاةٍ حِينَ يُسَلِّمُ «لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ، لَا إِلَهَ إِلَّا اللهُ، وَلَا نَعْبُدُ إِلَّا إِيَّاهُ، لَهُ النِّعْمَةُ وَلَهُ الْفَضْلُ، وَلَهُ الثَّنَاءُ الْحَسَنُ، لَا إِلَهَ إِلَّا اللهُ مُخْلِصِينَ لَهُ الدِّينَ وَلَوْ كَرِهَ الْكَافِرُونَ» وَقَالَ: «كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُهَلِّلُ بِهِنَّ دُبُرَ كُلِّ صَلَاةٍ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8908,
                "hadithNumber": "1344",
                "englishNarrator": "Abu Zubair reported:",
                "hadithEnglish": "Abdullah bin Zubair ‌رضی ‌اللہ ‌عنہ used to say La ilaha il-Allah at the end of every prayer like the hadith narrated by Ibn Numair and he reported it in the end, and then reported Ibn Zubair saying: The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) uttered La ilaha il-Allah at the end of every prayer.",
                "hadithUrdu": "حضرت عبداللہ بن زبیر ‌رضی ‌اللہ ‌عنہ ‌ ‌ ہر نماز کے بعد بلند آواز سے پڑھتے تھے ( آگے ) ابن نمیر کی روایت کے مانند ہے اور انھوں نے اپنی حدیث کے آخر میں کہا : پھر ابن زبیر کہتےکہ رسول اللہ ﷺہر نماز کے بعد ان ( کلمات ) کو بلند آواز سے کہتے تھے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, عبدہ بن سلیمان نے ہشام بن عروہ سے اور انھوں نے اپنے خاندان کے مولیٰ ابو زبیر سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِي الزُّبَيْرِ مَوْلًى لَهُمْ أَنَّ عَبْدَ اللهِ بْنَ الزُّبَيْرِ كَانَ يُهَلِّلُ دُبُرَ كُلِّ صَلَاةٍ بِمِثْلِ حَدِيثِ ابْنِ نُمَيْرٍ وَقَالَ فِي آخِرِهِ: ثُمَّ يَقُولُ ابْنُ الزُّبَيْرِ: كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُهَلِّلُ بِهِنَّ دُبُرَ كُلِّ صَلَاةٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8909,
                "hadithNumber": "1345",
                "englishNarrator": "Abu Zubair ‌reported:",
                "hadithEnglish": "I heard Abdullah bin Zubair رضی ‌اللہ ‌عنہ ‌addressing (people) on the pulpit and saying: When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) pronounced salutation at the end of the prayer or prayers, and then he made a mention of the hadith as transmitted by Hisham bin 'Urwa.",
                "hadithUrdu": "میں نے عبداللہ بن زبیر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنا ، وہ اس منبر پر خطبہ دے رہے تھے اور کہہ رہے تھے کہ رسول اللہ ﷺ نماز یا نمازوں کے آخر میں سلام پھیرنے کے بعد کہا کرتے تھے ۔ ۔ ۔ ۔ ۔ ۔ ۔ ( آگے ) ہشام بن عروہ کی حدیث کی طرح بیان کیا ۔",
                "urduNarrator": "مجھ سے یعقوب بن ابراہیم الدورقی نے بیان کیا، کہا ہم سے ابن اوعلیہ نے بیان کیا, (ہشام کے بجائے ) حجاج بن ابی عثمان نے مجھے حدیث بیان کی ، کہا : مجھ سے ابو زبیر نے حدیث بیان کی کہا",
                "hadithArabic": "وَحَدَّثَنِي يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، حَدَّثَنَا ابْنُ عُلَيَّةَ، حَدَّثَنَا الْحَجَّاجُ بْنُ أَبِي عُثْمَانَ، حَدَّثَنِي أَبُو الزُّبَيْرِ، قَالَ: سَمِعْتُ عَبْدَ اللهِ بْنَ الزُّبَيْرِ، يَخْطُبُ عَلَى هَذَا الْمِنْبَرِ وَهُوَ يَقُولُ: كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ إِذَا سَلَّمَ فِي دُبُرِ الصَّلَاةِ أَوِ الصَّلَوَاتِ، فَذَكَرَ بِمِثْلِ حَدِيثِ هِشَامِ بْنِ عُرْوَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8910,
                "hadithNumber": "1346",
                "englishNarrator": "Abu Zubair al-Makki reported:",
                "hadithEnglish": "He had heard 'Abdullah bin Zubair ‌رضی ‌اللہ ‌عنہ ‌uttering (the words) like that of the hadith (narrated above) at the end of the prayer after pronouncing salutation. He at the conclusion also said that he was making a mention of that from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌).",
                "hadithUrdu": "انھوں نے عبداللہ بن زبیر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنا ، جب وہ نماز کے بعد سلام پھیرتے تو کہتے ۔ ۔ ۔ ( بقیہ روایت ) ان دونوں ( ہشام اور حجاج ) کی ( مذکورہ بالا ) روایت کے مانند ہے ، اور آخر میں کہا : وہ اسے رسو ل اللہ ﷺ سے بیان کیا کرتے تھے.",
                "urduNarrator": "مجھ سے محمد بن سلمہ المرادی نے بیان کیا، کہا ہم سے عبداللہ بن وہب نے بیان کیا، وہ یحییٰ بن عبداللہ بن سالم کی سند سے,موسیٰ بن عقبہ سے روایت ہے کہ ابو زبیر مکی نے انھیں حدیث سنائی کہ",
                "hadithArabic": "وَحَدَّثَنِي مُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِيُّ، حَدَّثَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، عَنْ يَحْيَى بْنِ عَبْدِ اللهِ بْنِ سَالِمٍ، عَنْ مُوسَى بْنِ عُقْبَةَ، أَنَّ أَبَا الزُّبَيْرِ الْمَكِّيَّ، حَدَّثَهُ، أَنَّهُ سَمِعَ عَبْدَ اللهِ بْنَ الزُّبَيْرِ، وَهُوَ يَقُولُ: فِي إِثْرِ الصَّلَاةِ إِذَا سَلَّمَ، بِمِثْلِ حَدِيثِهِمَا، وَقَالَ فِي آخِرِهِ: وَكَانَ يَذْكُرُ ذَلِكَ عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8911,
                "hadithNumber": "1347",
                "englishNarrator": "Abu Huraira ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The poor amongst the emigrants came to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: The possessors of great wealth have obtained the highest ranks and the lasting bliss. He (the Holy Prophet ﷺ) said: How is that? They said: They pray as we pray, and they observe fast as we observe fast, and they give charity but we do not give charity, and they set slaves free but we do not set slaves free. Upon this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Shall I not teach you something by which you will catch upon those who have preceded you, and get ahead of those who come after you, only those who do as you do being more excellent than you? They said: Yes, Messenger of Allah. He (the Holy Prophet ﷺ) said: Extol Allah, declare His Greatness, and Praise Him thirty-three times after every prayer. Abu Salih said: The poor amongst the emigrants returned to the Messenger of Allah (may peace upon him) saying: Our brethren, the possessors, of property have heard what we have done and they did the same. So the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: This is Allah's Grace which He gives to whom He wishes. Sumayy reported: I made a mention of this hadith to some members of my family (and one of them) said: You have forgotten; he (the Holy Prophet) had said (like this): Extol Allah thirty-three time, praise Allah thirty-three times and declare His Greatness thirty-three times. Ibn `Ajlan said: I made a mention of this hadith to Raja' bin Haiwa and he narrated to me a hadith like this from Abu Salih from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) on the authority of Abu Huraira رضی ‌اللہ ‌عنہ ‌.",
                "hadithUrdu": "کچھ تنگدست مہاجر رسو ل اللہ ﷺ کی خدمت میں حاضر ہوئے اور گزارش کی : بلند درجے اور دائمی نعمت تو زیادہ مال والے لوگ لے گئے ! آپ نے پوچھا : ’’ وہ کیسے ؟ ‘ ‘ انھوں نے کہا : وہ اسی طرح نمازیں پڑھتے ہیں جس طرح ہم پڑھتے ہیں ، وہ اسی طرح روزے رکھتے ہیں جیسے ہم رکھتے ہیں اور وہ صدقہ کرتے ہیں جبکہ ہم صدقہ نہیں کر سکتے ، وہ ( بندھے ہوؤں اور غلاموں کو ) آزاد کرتے ہیں جبکہ ہم آزاد نہیں کر سکتے تو رسو ل اللہ ﷺ نے فرمایا ’’تو کیا پھر میں تمھیں اسی چیز نہ سکھاؤں جس سے تم ان لوگوں کو پالو گے جو تم سے سبقت لے گے ہیں اور اس کے ذریعے سے ان سے بھی سبقت لے جاؤ گے جو تم سے بعد ( آنے والے ) ہیں ؟ اور تم سے وہی افضل ہو گا جو تمھاری طرح عمل کرے گا ۔ ‘ ‘ انھوں نے کہا : کیوں نہیں اے اللہ کے رسول ! ( ضرور بتائیں ۔ ) آپ نے فرمایا : ’’تم ہر نماز کے بعد تینتیس مرتبہ تسبیح : تکبیر اور تحمید ( سبحان اللہ : اللہ اکبر ، اور الحمد اللہ ) کا ورد کیا کرو ‘ ‘ ابو صالح نےکہا : فقرائے مہاجرین دوبارہ رسو ل اللہ ﷺ کے پاس حاضر ہوئے اور کہنے لگے : ہمارے مالدار بھائیوں نے بھی جو ہم کرتے ہیں اس کے بارے میں سن لیا ہے اور اسی طرح عمل کرنا شروع کر دیا ہے ( وہ بھی تسبیح ، تکبیر اور تحمید کرنے لگے ہیں ۔ ) تو رسول اللہ ﷺ نے فرمایا : ’’ یہ اللہ کا فضل ہے جسے چاہے عنایت فرمادے ۔ ‘ ‘ قتیبہ کے علاوہ لیث سے ابن عجلان کے حوالے سے دیگر روایت کرنے والوں نے یہ اضافہ کیا کہ سمی نے کہا : میں نے یہ حدیث اپنے گھر کے ایک فرد کو سنائی تو انھوں نے کہا : تمھیں وہم ہوا ہے ، انھوں ( ابو صالح ) نے تو کہا تھا : ’’تینتیس مرتبہ سبحان اللہ کہو ، تینتیس بار الحمد اللہ کہو اور تینتیس بار اللہ اکبر کہو ۔ ‘ ‘ میں دوبارہ ابو صالح کی خدمت میں حاضر ہوا اور انھیں یہ بتا یا تو انھوں نے میرا ہاتھ پکڑ کر کہا : اللہ اکبر ، سبحان اللہ اور الحمد اللہ ، اللہ اکبر ، سبحان اللہ اور الحمد اللہ ( اس طرح کہو ) کہ سب کی تعداد تینتیس ہو جائے ۔ ابن عجلان نے کہا : میں نے یہ حدیث رجاء بن حیوہ کو سنائی تو انھوں نے مجھے ابو صالح کے واسطے سے ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے ، انھوں نے رسول اللہ ﷺ سے ( روایت کرتے ہوئے ) اسی کی مانند حدیث سنائی ۔",
                "urduNarrator": "عاصم بن نضر تیمی نے کہا : ہمین معتمر نے حدیث سنائی ، کہا : ہمین عبیداللہ نے حدیث سنائی نیز ( ایک اور سند سے ) قتیبہ بن سعید نے کہا : ہمیں لیث نے ابن عجلان سے حدیث سنائی ، ان دونوں ( عبیداللہ اور ابن عجلان ) نے سًمَیّ سے ، انھوں نے ابو صالح سے اور انھوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ۔ ۔ یہ قتیبہ کی روایت کردہ حدیث ہے ۔ کہ",
                "hadithArabic": "حَدَّثَنَا عَاصِمُ بْنُ النَّضْرِ التَّيْمِيُّ، حَدَّثَنَا الْمُعْتَمِرُ، حَدَّثَنَا عُبَيْدُ اللهِ، ح قَالَ: وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنِ ابْنِ عَجْلَانَ، كِلَاهُمَا عَنْ سُمَيٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ - وَهَذَا حَدِيثُ قُتَيْبَةَ - أَنَّ فُقَرَاءَ الْمُهَاجِرِينَ أَتَوْا رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالُوا: ذَهَبَ أَهْلُ الدُّثُورِ بِالدَّرَجَاتِ الْعُلَى، وَالنَّعِيمِ الْمُقِيمِ، فَقَالَ: «وَمَا ذَاكَ؟» قَالُوا: يُصَلُّونَ كَمَا نُصَلِّي، وَيَصُومُونَ كَمَا نَصُومُ، وَيَتَصَدَّقُونَ وَلَا نَتَصَدَّقُ، وَيُعْتِقُونَ وَلَا نُعْتِقُ، فَقَالَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَفَلَا أُعَلِّمُكُمْ شَيْئًا تُدْرِكُونَ بِهِ مَنْ سَبَقَكُمْ وَتَسْبِقُونَ بِهِ مَنْ بَعْدَكُمْ؟ وَلَا يَكُونُ أَحَدٌ أَفْضَلَ مِنْكُمْ إِلَّا مَنْ صَنَعَ مِثْلَ مَا صَنَعْتُمْ» قَالُوا: بَلَى، يَا رَسُولُ اللهِ قَالَ: «تُسَبِّحُونَ، وَتُكَبِّرُونَ، وَتَحْمَدُونَ، دُبُرَ كُلِّ صَلَاةٍ ثَلَاثًا وَثَلَاثِينَ مَرَّةً» قَالَ أَبُو صَالِحٍ: فَرَجَعَ فُقَرَاءُ الْمُهَاجِرِينَ إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالُوا: سَمِعَ إِخْوَانُنَا أَهْلُ الْأَمْوَالِ بِمَا فَعَلْنَا، فَفَعَلُوا مِثْلَهُ، فَقَالَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «ذَلِكَ فَضْلُ اللهِ يُؤْتِيهِ مَنْ يَشَاءُ» وَزَادَ غَيْرُ قُتَيْبَةَ فِي هَذَا الْحَدِيثِ عَنِ اللَّيْثِ، عَنِ ابْنِ عَجْلَانَ، قَالَ سُمَيٌّ: فَحَدَّثْتُ بَعْضَ أَهْلِي هَذَا الْحَدِيثَ، فَقَالَ: وَهِمْتَ، إِنَّمَا قَالَ «تُسَبِّحُ اللهَ ثَلَاثًا وَثَلَاثِينَ، وَتَحْمَدُ اللهَ ثَلَاثًا وَثَلَاثِينَ، وَتُكَبِّرُ اللهَ ثَلَاثًا وَثَلَاثِينَ» فَرَجَعْتُ إِلَى أَبِي صَالِحٍ فَقُلْتُ لَهُ ذَلِكَ، فَأَخَذَ بِيَدِي فَقَالَ: اللهُ أَكْبَرُ، وَسُبْحَانَ اللهِ، وَالْحَمْدُ لِلَّهِ، اللهُ أَكْبَرُ، وَسُبْحَانَ اللهِ، وَالْحَمْدُ لِلَّهِ، حَتَّى تَبْلُغَ مِنْ جَمِيعِهِنَّ ثَلَاثَةً وَثَلَاثِينَ. قَالَ ابْنُ عَجْلَانَ: فَحَدَّثْتُ بِهَذَا الْحَدِيثِ رَجَاءَ بْنَ حَيْوَةَ، فَحَدَّثَنِي بِمِثْلِهِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8912,
                "hadithNumber": "1348",
                "englishNarrator": "Abu Huraira رضی ‌اللہ ‌عنہ ‌narrated it from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) that :",
                "hadithEnglish": "They (the poor among the emigrants) said Messenger of Allah, the possessors of great wealth have obtained the highest ranks and lasting bliss, and the rest of the hadith is the same as transmitted by Qutaiba on the authority of Laith except that he inserted the words of Abu Salih in the narration of Abu Huraira رضی ‌اللہ ‌عنہ that the poor of the emigrants came back, to the end of the hadith,, but this addition was made that Suhail said (that every part of the supplication, i. e. Glorification of Allah, His Praise and declaration of His Greatness) should be uttered eleven times making the total as thirty-three.",
                "hadithUrdu": "لوگوں نے کہا : اے اللہ کے رسول ! بلند مراتب اور دائمی نعمتیں تو زیادہ مال والے لوگ لے گئے ۔ ۔ ۔ جس طرح لیث سےقتیبہ کی بیان کی ہوئی حدیث ہے ، مگر انھوں نے ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی حدیث میں ابو صالح کا یہ قول داخل کر دیا ہے کہ پھر فقراء مہاجرین لوٹ کر آئے ، حدیث کے آخر تک ۔ اور حدیث میں اس بات کا اضافہ کیا : سہیل کہتے تھے : ( ہر کلمہ ) گیارہ گیارہ دفعہ اور یہ سب ملا کر تینتیس بار ۔ ( یہ سہیل کا اپنا فہم تھا ۔ )",
                "urduNarrator": "امیہ بسطام عیشی نے مجھے حدیث سنائی ، کہا : ہمیں یزید بن زریع نےحدیث سنائی ، کہا ہمیں روح نے سہیل سے حدیث سنائی انھون نے اپنے والد ( ابو صالح سے ) سے ، انھوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انھوں نے رسو اللہ ﷺ سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنِي أُمَيَّةُ بْنُ بِسْطَامَ الْعَيْشِيُّ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا رَوْحٌ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُمْ قَالُوا: يَا رَسُولَ اللهِ ذَهَبَ أَهْلُ الدُّثُورِ بِالدَّرَجَاتِ الْعُلَى، وَالنَّعِيمِ الْمُقِيمِ، بِمِثْلِ حَدِيثِ قُتَيْبَةَ، عَنِ اللَّيْثِ إِلَّا أَنَّهُ أَدْرَجَ فِي حَدِيثِ أَبِي هُرَيْرَةَ قَوْلَ أَبِي صَالِحٍ، ثُمَّ رَجَعَ فُقَرَاءُ الْمُهَاجِرِينَ إِلَى آخِرِ الْحَدِيثِ، وَزَادَ فِي الْحَدِيثِ: يَقُولُ سُهَيْلٌ: إِحْدَى عَشْرَةَ، إِحْدَى عَشْرَةَ، فَجَمِيعُ ذَلِكَ كُلِّهِ ثَلَاثَةٌ وَثَلَاثُونَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8913,
                "hadithNumber": "1349",
                "englishNarrator": "Ka'b bin 'Ujra ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: There are certain ejaculations, the repeaters of which or the performers of which after every prescribed prayer will never be caused disappointment: Glory be to Allah thirty-three times. Praise be to Allah thirty-three times, and Allah is most Great thirty-four times.",
                "hadithUrdu": "آپ نے فرمایا : ’’ ( نماز کے یا ) ایک دوسرے کے پیچھے کہے جانے والے ایسے کلمات ہیں کہ ہرفرض نماز کے بعد انھیں کہنے والا ۔ ۔ یا ان کو ادا کرنے والا ۔ کبھی نامراد و ناکام نہیں رہتا ، تینتیس بار سبحان اللہ ، تینتیس بار الحمد اللہ اورچونتیس با ر اللہ اکبر ۔ ‘ ‘",
                "urduNarrator": "ہم سے حسن بن عیسیٰ نے بیان کیا، کہا ہم سے ابن مبارک نے بیان کیا، انہوں نے بیان کیا, مالک بن مغول نے ہمیں خبر دی ، کہا : میں نے حکم بن عتیبہ سے سنا ، وہ عبدالرحمن بن ابی لیلیٰ سے حدیث بیان کررہے تھے ، انھوں نے حضرت کعب بن عجرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انھوں نے رسو ل اللہ سے روایت کی",
                "hadithArabic": "وحَدَّثَنَا الْحَسَنُ بْنُ عِيسَى، أَخْبَرَنَا ابْنُ الْمُبَارَكِ، أَخْبَرَنَا مَالِكُ بْنُ مِغْوَلٍ، قَالَ: سَمِعْتُ الْحَكَمَ بْنَ عُتَيْبَةَ، يُحَدِّثُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ كَعْبِ بْنِ عُجْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مُعَقِّبَاتٌ لَا يَخِيبُ قَائِلُهُنَّ - أَوْ فَاعِلُهُنَّ - دُبُرَ كُلِّ صَلَاةٍ مَكْتُوبَةٍ، ثَلَاثٌ وَثَلَاثُونَ تَسْبِيحَةً، وَثَلَاثٌ وَثَلَاثُونَ تَحْمِيدَةً، وَأَرْبَعٌ وَثَلَاثُونَ تَكْبِيرَةً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 8601,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=344",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=342",
                "label": "342",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=343",
                "label": "343",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=344",
                "label": "344",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=345",
                "label": "345",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=346",
                "label": "346",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=347",
                "label": "347",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=348",
                "label": "348",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=346",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=346",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=344",
        "to": 8625,
        "total": 40465
    }
}