{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 388,
        "data": [
            {
                "id": 9964,
                "hadithNumber": "2400",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: It is letter for one among you to bring a load of firewood on his back and give charity out of it (and satisfy his own need) and be independent of people, than that he should beg from people, whether they give him anything or refuse him. Verily the upper hand is better than the lower hand, and begin (charity) with your dependants.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کوفرماتے ہوئے سنا : \" تم میں سے کوئی شخص صبح کو نکلے اپنی پشت پر لکڑیاں اکھٹی کر لائےاور اس سے صدقہ کرے اور لوگوں ( کے عطیوں ) سے بے نیاز ہوجائے ، وہ اس سے بہترہے کہ کسی آدمی سے مانگے ، وہ ( چاہے تو ) اسےدے یا ( چاہے تو ) محروم رکھے ، بلاشبہ اوپر والا ہاتھ نیچے والے ہاتھ سے افضل ہے اور ( خرچ کرے کی ) ابتدا ان سے کرو جن کی تم کفالت کرتے ہو ۔ \"",
                "urduNarrator": "مجھ سے ہناد بن سری نے بیان کیا، ہم سے ابو الاحواس نے بیان کیا, بیان بن ابی بشر نے قیس بن ابی حازم سے اور انھوں نے حضرت ابو ہریرہ  رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنِي هَنَّادُ بْنُ السَّرِيِّ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ بَيَانٍ أَبِي بِشْرٍ عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَأَنْ يَغْدُوَ أَحَدُكُمْ فَيَحْطِبَ عَلَى ظَهْرِهِ فَيَتَصَدَّقَ بِهِ وَيَسْتَغْنِيَ بِهِ مِنْ النَّاسِ خَيْرٌ لَهُ مِنْ أَنْ يَسْأَلَ رَجُلًا أَعْطَاهُ أَوْ مَنَعَهُ ذَلِكَ فَإِنَّ الْيَدَ الْعُلْيَا أَفْضَلُ مِنْ الْيَدِ السُّفْلَى وَابْدَأْ بِمَنْ تَعُولُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9965,
                "hadithNumber": "2401",
                "englishNarrator": "Qais bin Abu Hizam reported:",
                "hadithEnglish": "We came to Abu Huraira رضی اللہ تعالیٰ عنہ and he told Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) having said this: By Allah, (it is better) that one among you should go and bring a load of firewood on his back and he should sell it, and the rest of the hadith was narrated (like the previous one).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ کی قسم!تم میں سے ایک صبح کو نکلے ، اپنی پیٹھ پر لکڑیاں لائے اور انھیں بیچے ۔ ۔ ۔ پھر بیان کی حدیث کے مانند حدیث سنائی ۔",
                "urduNarrator": "اور مجھ سے محمد بن حاتم نے بیان کیا، ہم سے یحییٰ بن سعید نے بیان کیا, اسماعیل نے کہا : مجھے قیس بن ابی حازم نے حدیث سنائی ، انھوں نے کہا : ہم حضر ت ابو ہریرہ رضی اللہ تعالیٰ عنہ کے پاس حاضر ہوئے تو انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ إِسْمَعِيلَ حَدَّثَنِي قَيْسُ بْنُ أَبِي حَازِمٍ قَالَ أَتَيْنَا أَبَا هُرَيْرَةَ فَقَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاللَّهِ لَأَنْ يَغْدُوَ أَحَدُكُمْ فَيَحْطِبَ عَلَى ظَهْرِهِ فَيَبِيعَهُ ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ بَيَانٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9966,
                "hadithNumber": "2402",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: It is better for any one of you to tie a bundle of firewood and carry it on his back and sell it than to beg a person, he may give or may refuse.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم میں سے کوئی ایندھن کا گٹھا باندھے اور اپنی پیٹھ پرلادے ، اور بیچ دے ، اس کے لئے اس سے بہتر ہے کہ کسی آدمی سے سوال کرے ، ( چاہے ) وہ اسے دے یا نہ دے ۔ \"",
                "urduNarrator": "مجھ سے ابو الطاہر اور یونس بن عبد العلی نے بیان کیا، انہوں نے کہا: ہم سے ابن وہب نے بیان کیا، مجھ سے عمرو بن الحارث نے بیان کیا، وہ ابن شہاب سے اور ابو عبید مال کی سند سے, حضرت عبدالرحمن بن عوف رضی اللہ تعالیٰ عنہ کے آزادکردہ غلام ابو عبید سے روایت کی کہ انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے سنا ، کہہ رہے تھے",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ وَيُونُسُ بْنُ عَبْدِ الْأَعْلَى قَالَا حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي عُبَيْدٍ مَوْلَى عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَأَنْ يَحْتَزِمَ أَحَدُكُمْ حُزْمَةً مِنْ حَطَبٍ فَيَحْمِلَهَا عَلَى ظَهْرِهِ فَيَبِيعَهَا خَيْرٌ لَهُ مِنْ أَنْ يَسْأَلَ رَجُلًا يُعْطِيهِ أَوْ يَمْنَعُهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9967,
                "hadithNumber": "2403",
                "englishNarrator": "Malik al-Ashja'i رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "We, nine, eight or seven men, were in the company of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and he said: Why don't you pledge allegiance to the Messenger of Allah? -while we had recently pledged allegiance. So we said: Messenger of Allah, we have already pledged allegiance to you. He again said: Why don't you pledge allegiance to the Messenger of Allah? And we said: Messenger of Allah, we have already pledged allegiance to you. He again said: Why don't you pledge allegiance to the Messenger of Allah? We stretched our hands and said: Messenger of Allah. we have already pledged allegiance to you. Now tell (on what things) should we pledge allegiance to you. He said I (You must pledge allegiance) that you would worship Allah only and would not associate with Him anything, (and observe) five prayers, and obey- (and he said onething in an undertone) -that you would not beg people of anything. (And as a consequence of that) I saw that some of these people did not ask anyone to pick up the whip for them if it fell down.",
                "hadithUrdu": "ہم نو ، آٹھ یا سات آدمی رسول اللہ صلی اللہ علیہ وسلم کے سامنے ( حاضر ) تھے تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" کیا تم اللہ کے رسول صلی اللہ علیہ وسلم سے بیعت نہیں کروگے؟ \" اور ہم نے ابھی نئی نئی بیعت کی تھی ۔ تو ہم نے عرض کی : اے اللہ کے رسول صلی اللہ علیہ وسلم !ہم آپ سے بیعت کرچکے ہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" تم اللہ کے رسول سے بیعت نہیں کرو گے؟ \" ہم نے عرض کی : اے اللہ کے رسول صلی اللہ علیہ وسلم !ہم آپ سے بیعت کرچکے ہیں ۔ آپ صلی اللہ علیہ وسلم نے پھر فرمایا : \" تم اللہ کے رسول سے بیعت نہیں کرو گے؟ \" تو ہم نے اپنے ہاتھ بڑھا دیئے اور عرض کی : اے اللہ کے رسول صلی اللہ علیہ وسلم !ہم ( ایک بار ) آپ سے بیعت کرچکے ہیں ، اب کس بات پر آپ سے بیعت کریں؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" اس بات پر کہ تم اللہ کی عبادت کروگےاور اس کے ساتھ کسی چیز کو شریک نہیں ٹھہراؤ گے اور پانچ نمازوں پر ، اور اس بات پر کہ اطاعت کرو گے ۔ اور ایک جملہ آہستہ سے فرمایا ۔ اور لوگوں سے کسی چیز کا سوال نہ کرو گے ۔ \" اس کے بعد میں نے ان میں سے بعض افراد کو دیکھا کہ ان میں سے کسی کا کوڑا کرجاتا تو کسی سے نہ کہتا کہ اٹھا کر اس کے ہاتھ میں دے دے ۔",
                "urduNarrator": "ہم سے عبداللہ بن عبدالرحمٰن الدارمی اور سلمہ بن شبیب نے بیان کیا، اور ہم سے دارمی نے بیان کیا، کہا کہ ہم سے مروان نے جو محمد الدمشقی کے بیٹے ہیں، ہم سے سعید نے، جو کہ ابن عبد العزیز ہیں، بیان کیا۔ ہمیں ربیعہ بن یزید کی سند سے، ابو ادریس الخولانی کی سند سے، ابو مسلم خولانی سے روایت ہے ، انھوں نے کہا : مجھ سے ایک پیارے امانت دار ( شخص ) نے حدیث بیان کی وہ ایساہے کہ مجھے پیارا بھی ہے اور وہ ایسا ہے کہ میرے نزدیک امانت دار بھی ہے ۔ یعنی حضرت عوف بن مالک اشجعی رضی اللہ تعالیٰ عنہ ۔ ۔ ۔ انھوں نے کہا",
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ وَسَلَمَةُ بْنُ شَبِيبٍ قَالَ سَلَمَةُ حَدَّثَنَا وَقَالَ الدَّارِمِيُّ أَخْبَرَنَا مَرْوَانُ وَهُوَ ابْنُ مُحَمَّدٍ الدِّمَشْقِيُّ حَدَّثَنَا سَعِيدٌ وَهُوَ ابْنُ عَبْدِ الْعَزِيزِ عَنْ رَبِيعَةَ بْنِ يَزِيدَ عَنْ أَبِي إِدْرِيسَ الْخَوْلَانِيِّ عَنْ أَبِي مُسْلِمٍ الْخَوْلَانِيِّ قَالَ حَدَّثَنِي الْحَبِيبُ الْأَمِينُ أَمَّا هُوَ فَحَبِيبٌ إِلَيَّ وَأَمَّا هُوَ عِنْدِي فَأَمِينٌ عَوْفُ بْنُ مَالِكٍ الْأَشْجَعِيُّ قَالَ كُنَّا عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تِسْعَةً أَوْ ثَمَانِيَةً أَوْ سَبْعَةً فَقَالَ أَلَا تُبَايِعُونَ رَسُولَ اللَّهِ وَكُنَّا حَدِيثَ عَهْدٍ بِبَيْعَةٍ فَقُلْنَا قَدْ بَايَعْنَاكَ يَا رَسُولَ اللَّهِ ثُمَّ قَالَ أَلَا تُبَايِعُونَ رَسُولَ اللَّهِ فَقُلْنَا قَدْ بَايَعْنَاكَ يَا رَسُولَ اللَّهِ ثُمَّ قَالَ أَلَا تُبَايِعُونَ رَسُولَ اللَّهِ قَالَ فَبَسَطْنَا أَيْدِيَنَا وَقُلْنَا قَدْ بَايَعْنَاكَ يَا رَسُولَ اللَّهِ فَعَلَامَ نُبَايِعُكَ قَالَ عَلَى أَنْ تَعْبُدُوا اللَّهَ وَلَا تُشْرِكُوا بِهِ شَيْئًا وَالصَّلَوَاتِ الْخَمْسِ وَتُطِيعُوا وَأَسَرَّ كَلِمَةً خَفِيَّةً وَلَا تَسْأَلُوا النَّاسَ شَيْئًا فَلَقَدْ رَأَيْتُ بَعْضَ أُولَئِكَ النَّفَرِ يَسْقُطُ سَوْطُ أَحَدِهِمْ فَمَا يَسْأَلُ أَحَدًا يُنَاوِلُهُ إِيَّاهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9968,
                "hadithNumber": "2404",
                "englishNarrator": "Qabisa bin Mukhariq al-Hilali رضی اللہ تعالیٰ عنہ said:",
                "hadithEnglish": "I was under debt and I came to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and begged from him regarding it. He said: Wait till we receive Sadaqa, so that we order that to be given to you. He again said: Qabisa, begging is not permissible but for one of the three (classes) of persons: one who has incurred debt, for him begging is permissible till he pays that off, after which he must stop it; a man whose property has been destroyed by a calamity which has smitten him, for him begging is permissible till he gets what will support life, or will provide him reasonable subsistence; and a person who has been smitten by poverty. the genuineness of which is confirmed by three intelligent members of this peoples for him begging is permissible till he gets what will support him, or will provide him subsistence. Qabisa, besides these three (every other reason) for begging is forbidden, and one who engages in such consumes that what is forbidden.",
                "hadithUrdu": "میں نے ( لوگوں کے معاملات میں اصلاح کے لئے ) ادائیگی کی ایک ذمہ داری قبول کی اور رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضرہوا کہ آپ سے اس کے لئے کچھ مانگوں تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" ٹھہرو حتیٰ کہ ہمارے پاس صدقہ آجائے تو ہم وہ تمھیں دے دینے کا حکم دیں ۔ \" پھرآپ صلی اللہ علیہ وسلم نے فرمایا : \" اے قبیصہ!تین قسم کے افراد میں سے کسی ایک کے سوا اور کسی کے لئے سوال کرناجائز نہیں : ایک وہ آدمی جس نے کسی بڑی ادائیگی کی ذمہ داری قبول کرلی ، اس کے لئے اس وقت تک سوال کرنا حلال ہوجاتا ہے حتیٰ کہ اس کو حاصل کرلے ، اس کے بعد ( سوال سے ) رک جائے ، دوسرا وہ آدمی جس پر کوئی آفت آپڑی ہو جس نے اس کا مال تباہ کردیا ہو ، اس کے لئے سوال کرنا حلال ہوجاتا ہے یہاں تک کہ وہ زندگی کی گزران درست کرلے ۔ یا فرمایا : زندگی کی بقا کاسامان کرلے ۔ اور تیسرا وہ آدمی جو فاقے کا شکار ہوگیا ، یہاں تک کہ اس کی قوم کے تین عقلمند افراد کھڑے ہوجائیں ( اور کہہ دیں ) کہ فلاں آدمی فاقہ زدہ ہوگیا ہے تو اس کے لئے بھی مانگنا حلال ہوگیا یہاں تک کہ وہ درست گزران حاصل کرلے ۔ ۔ ۔ یا فرمایا : زندگی باقی رکھنے جتنا حاصل کرلے ۔ ۔ ۔ اے قبیصہ!ان صورتوں کے سوا سوال کرناحرام ہے اور سوال کرنے والا حرام کھاتا ہے ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ اور قتیبہ بن سعید دونوں نے حماد بن یحییٰ کی سند سے بیان کیا، کہا کہ ہم سے حماد بن زید نے ہارون بن ریاب حد کنانہ بن نعیم العدوی سے روایت کی ہے, حضرت قبیصہ بن مخارق ہلالی رضی اللہ تعالیٰ عنہ سے روایت ہے ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَقُتَيْبَةُ بْنُ سَعِيدٍ كِلَاهُمَا عَنْ حَمَّادِ بْنِ زَيْدٍ قَالَ يَحْيَى أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ هَارُونَ بْنِ رِيَابٍ حَدَّثَنِي كِنَانَةُ بْنُ نُعَيْمٍ الْعَدَوِيُّ عَنْ قَبِيصَةَ بْنِ مُخَارِقٍ الْهِلَالِيِّ قَالَ تَحَمَّلْتُ حَمَالَةً فَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْأَلُهُ فِيهَا فَقَالَ أَقِمْ حَتَّى تَأْتِيَنَا الصَّدَقَةُ فَنَأْمُرَ لَكَ بِهَا قَالَ ثُمَّ قَالَ يَا قَبِيصَةُ إِنَّ الْمَسْأَلَةَ لَا تَحِلُّ إِلَّا لِأَحَدِ ثَلَاثَةٍ رَجُلٍ تَحَمَّلَ حَمَالَةً فَحَلَّتْ لَهُ الْمَسْأَلَةُ حَتَّى يُصِيبَهَا ثُمَّ يُمْسِكُ وَرَجُلٌ أَصَابَتْهُ جَائِحَةٌ اجْتَاحَتْ مَالَهُ فَحَلَّتْ لَهُ الْمَسْأَلَةُ حَتَّى يُصِيبَ قِوَامًا مِنْ عَيْشٍ أَوْ قَالَ سِدَادًا مِنْ عَيْشٍ وَرَجُلٌ أَصَابَتْهُ فَاقَةٌ حَتَّى يَقُومَ ثَلَاثَةٌ مِنْ ذَوِي الْحِجَا مِنْ قَوْمِهِ لَقَدْ أَصَابَتْ فُلَانًا فَاقَةٌ فَحَلَّتْ لَهُ الْمَسْأَلَةُ حَتَّى يُصِيبَ قِوَامًا مِنْ عَيْشٍ أَوْ قَالَ سِدَادًا مِنْ عَيْشٍ فَمَا سِوَاهُنَّ مِنْ الْمَسْأَلَةِ يَا قَبِيصَةُ سُحْتًا يَأْكُلُهَا صَاحِبُهَا سُحْتًا.",
                "headingArabic": "مَنْ تَحِلُّ لَهُ الْمَسْأَلَةُ ‏",
                "headingUrdu": "جس کے لیے مدد مانگنا جائز ہے۔",
                "headingEnglish": "The one for whom it is permissible to ask for help",
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9969,
                "hadithNumber": "2405",
                "englishNarrator": "Salim bin Abdullah bin 'Umar رضی اللہ تعالیٰ عنہ reported on the authority of his father ('Abdullah bin 'Umar رضی اللہ تعالیٰ عنہ ):",
                "hadithEnglish": "He had heard 'Umar bin Khattab رضی اللہ تعالیٰ عنہ saying: The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) gave me a gift, but I said: Give it to one who needs it more than I. He gave me wealth for the second time but I said: Give it to one who needs it more than I. Upon this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Take out of this wealth which comes to you without your being avaricious and without begging, but in other circumstance's do not let your heart hanker after it.",
                "hadithUrdu": "میں نے حضر ت عمر بن خطاب رضی اللہ تعالیٰ عنہ سے سنا ، کہہ رہے تھے کہ رسول اللہ صلی اللہ علیہ وسلم کبھی مجھے عنایت فرماتے تھے تو میں عرض کرتا : کسی ایسے آدمی کو عنایت فرمادیجئے جو اس کا مجھ سے زیادہ ضرورت مند ہو حتیٰ کہ ایک دفعہ آپ نے مجھے بہت سارا مال عطا کردیا تو میں نے عرض کی : کسی ایسے فرد کو عطا کردیجئے جو اس کا مجھ سے زیادہ محتاج ہو ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اسے لے لو اور ایسا جو مال تمھارے پاس اس طرح آئے کہ نہ تو تم اس کے خواہش مند ہو اور نہ ہی مانگنے والے ہو تو اس کو لے لو اور جو مال اس طرح نہ ملے اس کا خیال بھی دل میں نہ لاؤ ۔ \"",
                "urduNarrator": "اور ہم سے ہارون بن معروف نے بیان کیا، کہا ہم سے عبداللہ بن وہب نے بیان کیا، اور ہم سے ہرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، انہوں نے کہا یونس نے ابن شہاب سے ، انہوں نے سالم بن عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے اور انھوں نے اپنے والد ( عبداللہ بن عمر رضی اللہ تعالیٰ عنہ ) سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ ح و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِيهِ قَالَ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ يَقُولُ قَدْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعْطِينِي الْعَطَاءَ فَأَقُولُ أَعْطِهِ أَفْقَرَ إِلَيْهِ مِنِّي حَتَّى أَعْطَانِي مَرَّةً مَالًا فَقُلْتُ أَعْطِهِ أَفْقَرَ إِلَيْهِ مِنِّي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُذْهُ وَمَا جَاءَكَ مِنْ هَذَا الْمَالِ وَأَنْتَ غَيْرُ مُشْرِفٍ وَلَا سَائِلٍ فَخُذْهُ وَمَا لَا فَلَا تُتْبِعْهُ نَفْسَكَ.",
                "headingArabic": "إِبَاحَةِ الأَخْذِ لِمَنْ أُعْطِيَ مِنْ غَيْرِ مَسْأَلَةٍ وَلاَ إِشْرَافٍ ‏",
                "headingUrdu": "مانگے یا امید لگائے بغیر لینا جائز ہے۔",
                "headingEnglish": "It is permissible to take without asking for it or hoping for it",
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9970,
                "hadithNumber": "2406",
                "englishNarrator": "Salim bin 'Abdullah رضی اللہ تعالیٰ عنہ reported on the authority of his father:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) gave to 'Umar bin Khattab رضی اللہ تعالیٰ عنہ some gift. Umar said to him: Messenger of Allah, give it to one who needs it more than I. Upon this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Take it; either keep it with you or give it as a charity, and whatever comes to you in the form of this type of wealth, without your being avaricious or begging for it, accept it, but in other circumstances do not let your heart hanker after it. And it was on account of this that Ibn 'Umar never begged anything from anyone, nor refused anything given to him.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم حضرت عمر بن خطاب رضی اللہ تعالیٰ عنہ کو عطیہ دیتے تو عمر رضی اللہ تعالیٰ عنہ عرض کرتے : اے اللہ کے رسول صلی اللہ علیہ وسلم !یہ مجھ سے زیادہ ضرورت مند شخص کو دے دیجئے ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" اس کو لے لو اور اپنا مال بنالو یا اسے صدقہ کردو اور اس مال میں سے جو تمہار ےپاس اس طرح آئے کہ تم نہ اس کے خواہش مند ہو نہ مانگنے والے تو اس کو لے لو اور جو ( مال ) اس طرح نہ ملے تو اس کا خیال بھی دل میں نہ لاؤ ۔ \"\" سالم نے کہا : اسی وجہ سے حضرت ابن عمر رضی اللہ تعالیٰ عنہ بھی کسی سے کچھ نہیں مانگتے تھے اور جو چیز انھیں پیش کی جاتی تھی اس کو رد نہیں کرتے تھے ۔",
                "urduNarrator": "مجھ سے ابو الطاہر نے بیان کیا، مجھ سے ابن وہب نے بیان کیا، انہوں نے کہا عمرو بن حارث نے ابن شہاب سے ، انھوں نے سالم سے اور انھوں نے اپنے والد حضرت عبداللہ رضی اللہ تعالیٰ عنہ سے ر وایت کی کہ",
                "hadithArabic": "و حَدَّثَنِي أَبُو الطَّاهِرِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُعْطِي عُمَرَ بْنَ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ الْعَطَاءَ فَيَقُولُ لَهُ عُمَرُ أَعْطِهِ يَا رَسُولَ اللَّهِ أَفْقَرَ إِلَيْهِ مِنِّي فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُذْهُ فَتَمَوَّلْهُ أَوْ تَصَدَّقْ بِهِ وَمَا جَاءَكَ مِنْ هَذَا الْمَالِ وَأَنْتَ غَيْرُ مُشْرِفٍ وَلَا سَائِلٍ فَخُذْهُ وَمَا لَا فَلَا تُتْبِعْهُ نَفْسَكَ قَالَ سَالِمٌ فَمِنْ أَجْلِ ذَلِكَ كَانَ ابْنُ عُمَرَ لَا يَسْأَلُ أَحَدًا شَيْئًا وَلَا يَرُدُّ شَيْئًا أُعْطِيَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9971,
                "hadithNumber": "2407",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated by Abdullah bin al-Sa'di from 'Umar bin al-Khattab رضی اللہ تعالیٰ عنہ who heard it from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ).",
                "hadithUrdu": "مجھ سے ابو الطاہر نے بیان کیا، ہم سے ابن وہب نے بیان کیا، عمرو نے اور مجھ سے ابن شہاب نے اسی طرح بیان کیا, سائب بن یزید نے عبداللہ بن سعدی سے ، انھوں نے حضرت عمر بن خطاب رضی اللہ تعالیٰ عنہ سے اور انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے ( اسی کے مانند ) حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنِي أَبُو الطَّاهِرِ أَخْبَرَنَا ابْنُ وَهْبٍ قَالَ عَمْرٌو وَحَدَّثَنِي ابْنُ شِهَابٍ بِمِثْلِ ذَلِكَ عَنْ السَّائِبِ بْنِ يَزِيدَ عَنْ عَبْدِ اللَّهِ بْنِ السَّعْدِيِّ عَنْ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9972,
                "hadithNumber": "2408",
                "englishNarrator": "Ibn al-Sa'di Maliki reported:",
                "hadithEnglish": "'Umar bin Khattab رضی اللہ تعالیٰ عنہ appointed me as a collector of Sadaqa. When I had finished that (the task assigned to me) and I handed over that to him (to 'Umar), he commanded me to (accept) some remuneration (for the work). I said: I performed this duty for Allah and my reward is with Allah. He said: Take whatever has been given to you, for I also performed this duty during the time of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). He assigned me the task of a collector and I said as you say, and the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said to me: When you are given anything without your begging for it, (then accept it), eat it and give it in charity.",
                "hadithUrdu": "مجھے حضرت عمر بن خطاب رضی اللہ تعالیٰ عنہ نے صدقے ( کی وصولی ) کےلئے عامل مقرر کیا ، جب میں اس کام سے فارغ ہوا اور انھیں ( وصول کردہ ) مال لا کر ادا کردیا ، تو انھوں نے مجھے کام کی اجرت دینے کا حکم دیا ۔ میں نے عرض کی : میں نے تو یہ کام محض اللہ کی ( رضا کی ) خاطر کیا ہے اور میرا اجر اللہ نے دینا ہے ۔ تو انھوں نے کہا : جو تمھیں دیا جائے اسے لے لو کیونکہ میں نے رسول اللہ صلی اللہ علیہ وسلم کے عہد مبارک میں کام کیا تھا ، آپ نے مجھے میرے کام کی مزدوری دی تو میں نے بھی تمہاری جیسی بات کہی تو مجھے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تمھیں تمہارے مانگے بغیر کوئی چیز دی جائے تو کھاؤ اور صدقہ کرو ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا,  لیث نے بکیر سے ، انھوں نے بسر بن سعید سے اور انھوں نے ابن ساعدی مالکی سے روایت کی کہ انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ عَنْ بُكَيْرٍ عَنْ بُسْرِ بْنِ سَعِيدٍ عَنْ ابْنِ السَّاعِدِيِّ الْمَالِكِيِّ أَنَّهُ قَالَ اسْتَعْمَلَنِي عُمَرُ بْنُ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ عَلَى الصَّدَقَةِ فَلَمَّا فَرَغْتُ مِنْهَا وَأَدَّيْتُهَا إِلَيْهِ أَمَرَ لِي بِعُمَالَةٍ فَقُلْتُ إِنَّمَا عَمِلْتُ لِلَّهِ وَأَجْرِي عَلَى اللَّهِ فَقَالَ خُذْ مَا أُعْطِيتَ فَإِنِّي عَمِلْتُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَعَمَّلَنِي فَقُلْتُ مِثْلَ قَوْلِكَ فَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أُعْطِيتَ شَيْئًا مِنْ غَيْرِ أَنْ تَسْأَلَ فَكُلْ وَتَصَدَّقْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9973,
                "hadithNumber": "2409",
                "englishNarrator": "Ibn al-Sa'di reported:",
                "hadithEnglish": "'Umar bin Khattab رضی اللہ تعالیٰ عنہ appointed me as a collector of Sadaqat. The rest of the hadith in the same.",
                "hadithUrdu": "مجھے حضرت عمر بن خطاب رضی اللہ تعالیٰ عنہ نے صدقہ وصول کرنے کے لئے عامل بنایا ۔ ۔ ۔ ( آگے ) لیث کی حدیث کی طرح ( روایت بیان کی ۔ )",
                "urduNarrator": "مجھ سے ہارون بن سعید الایلی نے بیان کیا، مجھ سے ابن وہب نے بیان کیا، انہوں نے کہا عمرو بن حارث نے بکیر بن اشج سے ، انھوں نے بسر بن سعید سے اور انھوں نے ابن سعدی سے روایت کی کہ انھوں نےکہا",
                "hadithArabic": "و حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ عَنْ بُكَيْرِ بْنِ الْأَشَجِّ عَنْ بُسْرِ بْنِ سَعِيدٍ عَنْ ابْنِ السَّعْدِيِّ أَنَّهُ قَالَ اسْتَعْمَلَنِي عُمَرُ بْنُ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ عَلَى الصَّدَقَةِ بِمِثْلِ حَدِيثِ اللَّيْثِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9974,
                "hadithNumber": "2410",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: The heart of an old person feels young for the love of two things: love for long life and wealth.",
                "hadithUrdu": "آپ نے فرمایا : \" بوڑھے آدمی کا دل دو چیزوں کی محبت میں جوان ہوتاہے : زندگی کی محبت اور مال کی ۔ \"",
                "urduNarrator": "ہم سے زہیر بن حرب نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے ابو الزناد کی سند سے بیان کیا, اعرج نےحضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے اسے نبی اکرم صلی اللہ علیہ وسلم تک مرفوع بیان کیا",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ يَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قَلْبُ الشَّيْخِ شَابٌّ عَلَى حُبِّ اثْنَتَيْنِ حُبِّ الْعَيْشِ وَالْمَالِ.",
                "headingArabic": "كَرَاهَةِ الْحِرْصِ عَلَى الدُّنْيَا ‏",
                "headingUrdu": "دنیاوی نفع حاصل کرنے کی آرزو مندی ناپسند ہے۔",
                "headingEnglish": "It is disliked to be eager to acquire worldly gains",
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9975,
                "hadithNumber": "2411",
                "englishNarrator": "Abu Huraira reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had said this: The heart of an old person is young for two things: for long life and love for wealth.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" دو چیزوں کی محبت میں بوڑھے کا دل بھی جوان رہتا ہے : زندگی لمبی ہونے اور مال کی محبت میں ۔ \"",
                "urduNarrator": "مجھ سے ابو الطاہر اور حرملہ نے بیان کیا، انہوں نے کہا: ہم سے ابن وہب نے یونس کی سند سے، ابن شہاب کی سند سے، انہوں نے کہا سعید بن مسیب نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنِي أَبُو الطَّاهِرِ وَحَرْمَلَةُ قَالَا أَخْبَرَنَا ابْنُ وَهْبٍ عَنْ يُونُسَ عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قَلْبُ الشَّيْخِ شَابٌّ عَلَى حُبِّ اثْنَتَيْنِ طُولُ الْحَيَاةِ وَحُبُّ الْمَالِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9976,
                "hadithNumber": "2412",
                "englishNarrator": "Anas رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The son of Adam grows old, but two (desires) in him remain young: desire for wealth and desire for life.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" آدم کابیٹا بوڑھا ہوجاتاہے مگر اس کی دو چیزیں جوان رہتی ہیں : دولت کی حرص اور عمر کی حرص ۔ \"",
                "urduNarrator": "یحییٰ بن یحییٰ، سعید بن منصور اور قتیبہ بن سعید نے مجھ سے روایت کی ہے, ابوعوانہ نے قتادہ سے اور انھوں نے حضرت انس رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنِي يَحْيَى بْنُ يَحْيَى وَسَعِيدُ بْنُ مَنْصُورٍ وَقُتَيْبَةُ بْنُ سَعِيدٍ كُلُّهُمْ عَنْ أَبِي عَوَانَةَ قَالَ يَحْيَى أَخْبَرَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَهْرَمُ ابْنُ آدَمَ وَتَشِبُّ مِنْهُ اثْنَتَانِ الْحِرْصُ عَلَى الْمَالِ وَالْحِرْصُ عَلَى الْعُمُرِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9977,
                "hadithNumber": "2413",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been narrated by Anas رضی اللہ تعالیٰ عنہ through another chain of transmitters.",
                "hadithUrdu": "مجھ سے ابو غسان المسماعی اور محمد بن المثنیٰ نے بیان کیا، کہا: ہم سے بیان کیا معاذ بن ہشام کے والد ہشام نے قتادہ سے اور انھوں نے حضرت انس رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ۔ ۔ ۔ ( آگے ) اسی طرح ہے ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنِي أَبُو غَسَّانَ الْمِسْمَعِيُّ وَمُحَمَّدُ بْنُ الْمُثَنَّى قَالَا حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ أَنَسٍ أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9978,
                "hadithNumber": "2414",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Anas رضی اللہ تعالیٰ عنہ through another chain of transmitters.",
                "hadithUrdu": "ہم سے محمد بن المثنیٰ اور ابن بشار نے بیان کیا، کہا: ہم سے محمد بن جعفر نے بیان کیا ,شعبہ نے کہا : میں نے قتادہ سے سنا ، وہ حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے حدیث بیان کررہے تھے ، انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی ۔ ۔ ۔ ( آگے ) اسی طرح ہے ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ قَتَادَةَ يُحَدِّثُ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9979,
                "hadithNumber": "2415",
                "englishNarrator": "Anas رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: If the son of Adam were to possess two valleys of riches. he would long for the third one. And the stomach of the son of Adam is not filled but with dust. And Allah returns to him who repents.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" اگر آدم کے بیٹے کے پاس مال کی ( بھری ہو ئی ) دو وادیاں ہوں تو وہ تیسری حاصل کرنا چا ہے گا آدمی کا پیٹ مٹی کے سوا کو ئی اور چیز نہیں بھر سکتی اور اللہ اسی کی طرف تو جہ فر ما تا ہے جو ( اس کی طرف ) تو جہ کرتا ہے ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ، سعید بن منصور اور قتیبہ بن سعید نے بیان کیا، یحییٰ نے کہا کہ ہمیں خبر دو اور باقی دو نے کہا کہ ہمیں خبر دو۔ابو عوانہ نے قتادہ سے انھوں نے حضرت انس رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَسَعِيدُ بْنُ مَنْصُورٍ وَقُتَيْبَةُ بْنُ سَعِيدٍ قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الْآخَرَانِ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ كَانَ لِابْنِ آدَمَ وَادِيَانِ مِنْ مَالٍ لَابْتَغَى وَادِيًا ثَالِثًا وَلَا يَمْلَأُ جَوْفَ ابْنِ آدَمَ إِلَّا التُّرَابُ وَيَتُوبُ اللَّهُ عَلَى مَنْ تَابَ.",
                "headingArabic": "لَوْ أَنَّ لاِبْنِ آدَمَ وَادِيَيْنِ لاَبْتَغَى ثَالِثًا ‏",
                "headingUrdu": "اگر ابن آدم کے پاس دو وادیاں ہوں تو وہ تیسری کی خواہش کرے گا۔",
                "headingEnglish": "If the Son of Adam had two valleys, he would desire a third",
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9980,
                "hadithNumber": "2416",
                "englishNarrator": "Anas bin Malik رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "I heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying this, but I do not know whether this thing was revealed to him or not, but he said to.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا فر ما رہے تھے مجھے پتہ نہیں ہے کہ یہ الفا ظ آپ پر نازل ہو ئے تھے یا آپ ( خودہی ) فر ما رہے تھے ۔ ( آگے ) ابو عوانہ کی حدیث کے مانند ہے ۔",
                "urduNarrator": "ہم سے ابن المثنی اور ابن بشار نے بیان کیا ہم سے محمد بن جعفر نے بیان کیا, شعبہ نے کہا : قتادہ سے سنا وہ حضرت انس رضی اللہ تعالیٰ عنہ سے روایت کر رہے تھے کہا",
                "hadithArabic": "و حَدَّثَنَا ابْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ أَخْبَرَنَا شُعْبَةُ قَالَ سَمِعْتُ قَتَادَةَ يُحَدِّثُ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فَلَا أَدْرِي أَشَيْءٌ أُنْزِلَ أَمْ شَيْءٌ كَانَ يَقُولُهُ بِمِثْلِ حَدِيثِ أَبِي عَوَانَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9981,
                "hadithNumber": "2417",
                "englishNarrator": "Anas bin Malik reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: If there were two valleys of gold for the son of Adam, he would long for another one. and his mouth will not be filled but with dust, and Allah returns to him who repents.",
                "hadithUrdu": "آپ نے فر ما یا : \" اگر ابن آدم کے پاس سونے کی ( بھری ہو ئی ) ایک وادی ہو تو وہ چا ہے گا کہ اس کے پاس ایک ا ور وای بھی ہو ، اس کا منہ مٹی کے سوا کو ئی اور چیز نہیں بھرتی اللہ اس کی طرف تو جہ فر ما تا ہے جو اللہ کی طرف تو جہ کرتا ہے ۔",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، کہا کہ مجھ سے یونس نے بیان کیا, ابن شہاب نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے اور انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ لَوْ كَانَ لِابْنِ آدَمَ وَادٍ مِنْ ذَهَبٍ أَحَبَّ أَنَّ لَهُ وَادِيًا آخَرَ وَلَنْ يَمْلَأَ فَاهُ إِلَّا التُّرَابُ وَاللَّهُ يَتُوبُ عَلَى مَنْ تَابَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9982,
                "hadithNumber": "2418",
                "englishNarrator": "Ibn Abbas رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: If there were for the son of Adam a valley full of riches, he would long to possess another one like it. and Ibn Adam does not feel satiated but with dust. And Allah returns to him who returns (to Him). Ibn Abbas رضی اللہ تعالیٰ عنہ said: I do not know whether it is from the Qur'an or not; and in the narration transmitted by Zuhair it was said: I do not know whether it is from the Qur'an, and he made no mention of Ibn Abbas رضی اللہ تعالیٰ عنہ .",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فر ما تے ہو ئے سنا : \"\" اگر آدم کے بیٹے کے پاس مال سے بھر ی ہو ئی ایک وادی ہو تو وہ چا ہے گا کہ اس کے پاس اس جیسی اور وادی بھی ہو آدمی کے دل کو مٹی کے سوا کچھ اور نہیں بھر سکتا اور اللہ اس پر تو جہ فر ما تا ہے جو اس کی طرف متوجہ ہو ، حضرت ابن عبا س رضی اللہ تعالیٰ عنہ نے کہا مجھے معلوم نہیں یہ قرآن میں سے ہے یا نہیں اور زہیر کی روایت میں ہے انھوں نے کہا : مجھے معلوم نہیں یہ با ت قرآن میں سے ہے ( یا نہیں ) انھوں نے ابن عباس رضی اللہ تعالیٰ عنہ کا ذکر نہیں کیا ۔",
                "urduNarrator": "مجھے زہیر بن حرب اور ہا رون بن عبد اللہ نے حدیث سنا ئی دو نوں نے کہا : ہمیں حجا ج بن محمد نے ابن جریج سے حدیث بیان کی ، کہا : میں نے عطا ء سے سنا کہہ رہے تھے میں نے حضرت ابن عبا س رضی اللہ تعالیٰ عنہ سے سنا کہہ",
                "hadithArabic": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ وَهَارُونُ بْنُ عَبْدِ اللَّهِ قَالَا حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ عَنْ ابْنِ جُرَيْجٍ قَالَ سَمِعْتُ عَطَاءً يَقُولُ سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَوْ أَنَّ لِابْنِ آدَمَ مِلْءَ وَادٍ مَالًا لَأَحَبَّ أَنْ يَكُونَ إِلَيْهِ مِثْلُهُ وَلَا يَمْلَأُ نَفْسَ ابْنِ آدَمَ إِلَّا التُّرَابُ وَاللَّهُ يَتُوبُ عَلَى مَنْ تَابَ قَالَ ابْنُ عَبَّاسٍ فَلَا أَدْرِي أَمِنْ الْقُرْآنِ هُوَ أَمْ لَا وَفِي رِوَايَةِ زُهَيْرٍ قَالَ فَلَا أَدْرِي أَمِنْ الْقُرْآنِ لَمْ يَذْكُرْ ابْنَ عَبَّاسٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9983,
                "hadithNumber": "2419",
                "englishNarrator": "Abu Harb bin Abu al-Aswad reported on the authority of his father:",
                "hadithEnglish": "Abu Musa al-Ash'ari رضی اللہ تعالیٰ عنہ sent for the reciters of Basra. They came to him and they were three hundred in number. They recited the Qur'an and he said: You are the best among the inhabitants of Basra, for you are the reciters among them. So continue to recite it. (But bear in mind) that your reciting for a long time may not harden your hearts as were hardened the hearts of those before you. We used to recite a surah which resembled in length and severity to (Surah) Bara'at. I have, however, forgotten it with the exception of this which I remember out of it: If there were two valleys full of riches, for the son of Adam, he would long for a third valley, and nothing would fill the stomach of the son of Adam but dust. And we used so recite a surah which resembled one of the surahs of Musabbihat, and I have forgotten it, but remember (this much) out of it: Oh people who believe, why do you say that which you do not practise (lxi 2.) and that is recorded in your necks as a witness (against you) and you would be asked about it on the Day of Resurrection (xvii. 13).",
                "hadithUrdu": "حضرت ابو موسیٰ اشعری رضی اللہ تعالیٰ عنہ نے اہل بصرہ کے قاریوں کی طرف ( انھیں بلا نے کے لیے قاصد ) بھیجا تو ان کے ہاں تین سو آدی آئے جو قرآن پڑھ چکے تھے تو انھوں ( ابو موسیٰ رضی اللہ تعالیٰ عنہ ) نے کہا : تم اہل بصرہ کے بہترین لو گ اور ان کے قاری ہو اس کی تلا وت کرتے رہا کرو تم پر لمبی مدت ( کا وقفہ ) نہ گزرے کہ تمھا رے دل سخت ہو جا ئیں جس طرح ان کے دل سخت ہو گئے تھے جو تم سے پہلے تھے ہم ایک سورت پڑھا کرتے تھے جسے ہم لمبا ئی اور ( ڈرا نے کی ) شدت میں ( سورہ ) براۃ تشبیہ دیا کرتے تو وہ مجھے بھلا دی گئی اس کے سوا کہ اس کا یہ ٹکڑا مجھے یا د رہ گیا آگر آدم کے بیٹے کے پاس مال کی دو وادیا ہوں تو وہ تیسری وادی کا متلا شی ہو گا اور ابن آدم کا پیٹ تو مٹی کے سوا کو ئی شے نہیں بھرتی ۔ ہم ایک اور سورت پڑھا کرتے تھے جس کو ہم تسبیح والی سورتوں میں سے ایک سورت سے تشبیہ دیا کرتے تھے وہ بھی مجھے بھلا دی گئی ہاں اس میں سے مجھے یہ یا د ہے \" اے ایمان والو! وہ بات کہتے کیوں ہو جو کرتے نہیں وہ بطور شہادت تمھا ری گردنوں میں لکھ دی جا ئے گی اور قیامت کے دن تم سے اس کے بارے میں سوال کیا جا ئے گا ۔",
                "urduNarrator": "مجھ سے سوید بن سعید نے بیان کیا، ہم سے علی بن مشر نے بیان کیا، داؤد کی سند سے, ابو حرب بن ابی اسود کے والد سے روایت ہے انھوں نے کہا",
                "hadithArabic": "حَدَّثَنِي سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ دَاوُدَ عَنْ أَبِي حَرْبِ بْنِ أَبِي الْأَسْوَدِ عَنْ أَبِيهِ قَالَ بَعَثَ أَبُو مُوسَى الْأَشْعَرِيُّ إِلَى قُرَّاءِ أَهْلِ الْبَصْرَةِ فَدَخَلَ عَلَيْهِ ثَلَاثُ مِائَةِ رَجُلٍ قَدْ قَرَءُوا الْقُرْآنَ فَقَالَ أَنْتُمْ خِيَارُ أَهْلِ الْبَصْرَةِ وَقُرَّاؤُهُمْ فَاتْلُوهُ وَلَا يَطُولَنَّ عَلَيْكُمْ الْأَمَدُ فَتَقْسُوَ قُلُوبُكُمْ كَمَا قَسَتْ قُلُوبُ مَنْ كَانَ قَبْلَكُمْ وَإِنَّا كُنَّا نَقْرَأُ سُورَةً كُنَّا نُشَبِّهُهَا فِي الطُّولِ وَالشِّدَّةِ بِبَرَاءَةَ فَأُنْسِيتُهَا غَيْرَ أَنِّي قَدْ حَفِظْتُ مِنْهَا لَوْ كَانَ لِابْنِ آدَمَ وَادِيَانِ مِنْ مَالٍ لَابْتَغَى وَادِيًا ثَالِثًا وَلَا يَمْلَأُ جَوْفَ ابْنِ آدَمَ إِلَّا التُّرَابُ وَكُنَّا نَقْرَأُ سُورَةً كُنَّا نُشَبِّهُهَا بِإِحْدَى الْمُسَبِّحَاتِ فَأُنْسِيتُهَا غَيْرَ أَنِّي حَفِظْتُ مِنْهَا يَا أَيُّهَا الَّذِينَ آمَنُوا لِمَ تَقُولُونَ مَا لَا تَفْعَلُونَ فَتُكْتَبُ شَهَادَةً فِي أَعْنَاقِكُمْ فَتُسْأَلُونَ عَنْهَا يَوْمَ الْقِيَامَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9984,
                "hadithNumber": "2420",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had said: Richness does not lie in the abundance of (worldly) goods but richness is the richness of the soul (heart, self).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" غنا مال و اسباب کی کثرت سے نہیں بلکہ حقیقی غنا دل کی بے نیا زی ہے ۔",
                "urduNarrator": "ہم سے زہیر بن حرب اور ابن نمیر نے بیان کیا، کہا: ہم سے سفیان بن عیینہ نے ابو الزیناد سے، انہوں نے العرج کی سند سے بیان کیا, حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت ہے انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَابْنُ نُمَيْرٍ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ الْغِنَى عَنْ كَثْرَةِ الْعَرَضِ وَلَكِنَّ الْغِنَى غِنَى النَّفْسِ.",
                "headingArabic": "لَيْسَ الْغِنَى عَنْ كَثْرَةِ الْعَرَضِ",
                "headingUrdu": "قناعت اور اس کی حوصلہ افزائی کی فضیلت",
                "headingEnglish": "The virtue of contentment and encouragement thereof",
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9985,
                "hadithNumber": "2421",
                "englishNarrator": "Abu Sa'id al-Khudri رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) stood up and addressed the people thus: O people, by Allah, I do not entertain fear about you in regard to anything else than that which Allah would bring forth for you in the form of adornment of the world. A person said: Messenger of Allah, does good produce evil? The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) remained silent for a while and he then said: What did you say? He replied: Messenger of Allah, I said: Does good produce evil? The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to him: The good does not produce but good. but among the plants the spring rain produces There some which kill with a tremour or nearly kill all but the animal which feeds on vegetation. It eats and when its flanks are distended, it faces the can. then when it has donged or urinated and chewed it returns and eats. He who accepts wealth rightly, Allah confers blessing on it for him. and he who takes wealth without any right, he is like one who eats and is not satisfied.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے کھڑے ہو کر لو گوں کو خطبہ دیا اور فر ما یا : \" نہیں اللہ کی قسم !لو گو!مجھے تمھا رے بارے کسی چیز کا ڈر نہیں سوائے دنیا کی اس زینت کے جو اللہ تعالیٰ تمھا رے لیے ظا ہر کرے گا ۔ ایک آدمی کہنے لگا ۔ اے اللہ کے رسول اللہ صلی اللہ علیہ وسلم !کیا خیر شر کو لے آئے گی ؟ رسول اللہ صلی اللہ علیہ وسلم گھڑی بھر خا مو ش رہے پھر فر ما یا : \" تم نے کس طرح کہا ؟ اس نے کہا اللہ کے رسول اللہ صلی اللہ علیہ وسلم !میں نے عرض کی تھی کیا خیر شر کو لا ئے گی ؟ تو رسول اللہ صلی اللہ علیہ وسلم نے اس سے کہا : \" خیر خیر ہی کو لا تی ہے لیکن کیا وہ ( دنیا کی زیب و زینت فی ذاتہ ) خیر ہے ؟ وہ سب کچھ جو بہا ر لگا تی ہے ( جا نور کو ) اُپھا رے سے ما رڈا لتا ہے یا مو ت کے قریب کر دیتا ہے ایسے سبزہ کھا نے والے جا نور کے سوا جس نے کھا یا اور جب اس کی کو کھیں بھر گئیں ( وہ سیر ہو گیا ) تو مزید کھا نے کے بجا ئے ) اس نے سورج کا رخ کر لیا اور بیٹھ کر گو بر یا پیشاب کیا پھر جگا لی کی اور دوبارہ کھا یا تو ( اسی طرح ) جو انسا ن اس ( مال ) کے حق کے مطا بق مال لیتا ہے اس کے لیے اس میں بر کت دا ل دیا جا تی ہے اور جو انسان اس کے حق کے بغیر مال لیتا ہے وہ اس کی طرح ہے جو کھا تا ہے لیکن سیر نہیں ہو تا ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، ہم سے لیث بن سعد نے بیان کیا اور ہم سے قتیبہ بن سعید نے بیان کیا، اور وہ الفاظ میں ایک جیسے تھے، انہوں نے کہا کہ ہم سے لیث نے سعید بن ابی سعید کی سند سے بیان کیا۔ مقبری کے اختیار پر, عیاض بن عبد اللہ بن سعد سے روایت ہے کہ انھوں نے حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ سے سنا وہ کہہ رہے تھے",
                "hadithArabic": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا اللَّيْثُ بْنُ سَعْدٍ ح و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَتَقَارَبَا فِي اللَّفْظِ قَالَ حَدَّثَنَا لَيْثٌ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ بْنِ سَعْدٍ أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ يَقُولُ قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَخَطَبَ النَّاسَ فَقَالَ لَا وَاللَّهِ مَا أَخْشَى عَلَيْكُمْ أَيُّهَا النَّاسُ إِلَّا مَا يُخْرِجُ اللَّهُ لَكُمْ مِنْ زَهْرَةِ الدُّنْيَا فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ أَيَأْتِي الْخَيْرُ بِالشَّرِّ فَصَمَتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَاعَةً ثُمَّ قَالَ كَيْفَ قُلْتَ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أَيَأْتِي الْخَيْرُ بِالشَّرِّ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الْخَيْرَ لَا يَأْتِي إِلَّا بِخَيْرٍ أَوَ خَيْرٌ هُوَ إِنَّ كُلَّ مَا يُنْبِتُ الرَّبِيعُ يَقْتُلُ حَبَطًا أَوْ يُلِمُّ إِلَّا آكِلَةَ الْخَضِرِ أَكَلَتْ حَتَّى إِذَا امْتَلَأَتْ خَاصِرَتَاهَا اسْتَقْبَلَتْ الشَّمْسَ ثَلَطَتْ أَوْ بَالَتْ ثُمَّ اجْتَرَّتْ فَعَادَتْ فَأَكَلَتْ فَمَنْ يَأْخُذْ مَالًا بِحَقِّهِ يُبَارَكْ لَهُ فِيهِ وَمَنْ يَأْخُذْ مَالًا بِغَيْرِ حَقِّهِ فَمَثَلُهُ كَمَثَلِ الَّذِي يَأْكُلُ وَلَا يَشْبَعُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9986,
                "hadithNumber": "2422",
                "englishNarrator": "Abu Sa'id al-Khudri reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had said: The most dreadful thing I fear in your case is what Allah brings forth for you in the form of the adornment of the world. They (the Prophet's Companions) said: Messenger of Allah, what is the adornment of the world? He said: Blessings (the natural resources) of the earth. They (again) said: Messenger of Allah, does good produce evil? He said: No, only good comes out of good. No, only good comes out of good. No. only good comes out of good. All that which the spring rain helps to grow kills or is about to kill but (the animal) which feeds on vegetation. It eats and when its flanks are distended, it faces the sun, it chews the cud, it has dunged and urinated. it returns and eats. This wealth is green and sweet, and he who accepts it and applies it rightly, finds it a good help, but he who takes it wrongfully is like one who eats without being satisfied.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" مجھے تمھارے بارے میں سب سے زیادہ ڈر دنیا کی اس شادابی اور زینت سے ہے جو اللہ تعا لیٰ تمھا رے لیے ظا ہر کر ے گا ۔ صحابہ کرام رضوان اللہ عنھم اجمعین نے عرض کی دنیا کی شادا بی اور زینت کیا ہے ؟ آپ نے فر ما یا : \" زمین کی بر کا ت ۔ انھوں نے کہا : اے اللہ کے رسول صلی اللہ علیہ وسلم ! کیا خیر شر کو لے آتی ہے ؟ آپ نے فر ما یا : \" خیر سوائے خیر کے کچھ نہیں لا تی خیر سوائے خیر کے کچھ نہیں لاتی خیر سوائے خیر کے کچھ نہیں لا تی خیر سوائے خیر کے کچھ نہیں لا تی وہ سب کچھ جو بہا ر اگا تی ہے وہ ( زیادہ کھا نے کی وجہ سے ہو نے والی بد ہضمی کا سبب بن کر ) مار دیتا ہے یا موت کے قریب کر دیتا ہے سوائے اس چارہ کھا نے والے جا نور کے جو کھا تا ہے یہاں تک کہ جب اس کی دونوں کو کھیں پھول جا تی ہیں ( وہ سیر ہو جا تا ہے ) تو وہ ( مزید کھا نا چھوڑ کر ) سورج کی طرف منہ کر لیتا ہے پھر جگا لی کرتا ہے پیشاب کرتا ہے گو بر کرتا ہے پھر لو ٹتا ہے اور کھاتا ہے بلا شبہ یہ ما ل شادا ب اور شیریں ہے جس نے اسے اس کے حق کے مطا بق لیا اور حق ( کے مصرف ) ہی میں خرچ کیا تو وہ ( مال ) بہت ہی معاون و مددد گا ر ہو گا اور جس نے اسے حق کے بغیر لیا وہ اس انسان کی طرح ہو گا جو کھا تا ہے لیکن سیر نہیں ہو تا ۔",
                "urduNarrator": "مجھ سے ابو الطاہر نے بیان کیا، کہا ہم سے عبداللہ بن وہب نے بیان کیا، کہا کہ مجھ سے مالک بن انس نے بیان کیا,  زید بن اسلم نے عطا ء بن یسار سے اور انھوں نے حضرت خدری رضی اللہ تعالیٰ عنہ سے روا یت کی کہ",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ قَالَ أَخْبَرَنِي مَالِكُ بْنُ أَنَسٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَخْوَفُ مَا أَخَافُ عَلَيْكُمْ مَا يُخْرِجُ اللَّهُ لَكُمْ مِنْ زَهْرَةِ الدُّنْيَا قَالُوا وَمَا زَهْرَةُ الدُّنْيَا يَا رَسُولَ اللَّهِ قَالَ بَرَكَاتُ الْأَرْضِ قَالُوا يَا رَسُولَ اللَّهِ وَهَلْ يَأْتِي الْخَيْرُ بِالشَّرِّ قَالَ لَا يَأْتِي الْخَيْرُ إِلَّا بِالْخَيْرِ لَا يَأْتِي الْخَيْرُ إِلَّا بِالْخَيْرِ لَا يَأْتِي الْخَيْرُ إِلَّا بِالْخَيْرِ إِنَّ كُلَّ مَا أَنْبَتَ الرَّبِيعُ يَقْتُلُ أَوْ يُلِمُّ إِلَّا آكِلَةَ الْخَضِرِ فَإِنَّهَا تَأْكُلُ حَتَّى إِذَا امْتَدَّتْ خَاصِرَتَاهَا اسْتَقْبَلَتْ الشَّمْسَ ثُمَّ اجْتَرَّتْ وَبَالَتْ وَثَلَطَتْ ثُمَّ عَادَتْ فَأَكَلَتْ إِنَّ هَذَا الْمَالَ خَضِرَةٌ حُلْوَةٌ فَمَنْ أَخَذَهُ بِحَقِّهِ وَوَضَعَهُ فِي حَقِّهِ فَنِعْمَ الْمَعُونَةُ هُوَ وَمَنْ أَخَذَهُ بِغَيْرِ حَقِّهِ كَانَ كَالَّذِي يَأْكُلُ وَلَا يَشْبَعُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9987,
                "hadithNumber": "2423",
                "englishNarrator": "Abu Said al-Khudri رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was sitting on the pulpit and we were sitting around him, and he said: What I am afraid of in regard to you after my death is that there would be opened for you the adornments of the world and its beauties. A person said: Messenger of Allah, does good produce evil? The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) remained silent. And it was said to him (the man who had asked the question from the Holy Prophet): What Is the matter with you, that you speak with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) but he does not speak with you? We thought as if revelation was descending upon him. He regained himself and wiped the sweat from him and said: He was the inquirer (and his style of expression showed as if he praised him and then added): Verily good does not produce evil. Whatever the spring rainfall causes to grow kills or is about to kill, but that (animal) which feeds on vegetation. It eats till its flanks are filled; it faces the sun and dungs and urinates. and then returns to eat. And this Wealth is a sweet vegetation, and it is a good companion for a Muslim who gives out of it to the needy, to the orphan. to the wayfarer, or something like that as the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: He who takes it without his right is like one who eats but does not feel satisfied, and it would stand witness against him on the Day of judgment.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم منبر پر تشریف فر ما ہوئے اور ہم آپ کے ارد گرد بیٹھ گئے تو آپ نے فرمایا : \" مجھے اپنے بعد تمھا رے بارے میں جس چیز کا خوف ہے وہ دنیا کی شادابی اور زینت ہے جس کے دروازے تم پر کھول دیے جا ئیں گے ۔ تو ایک آدمی نے عرض کی : اے اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! کیا خیر شر کو لے آئے گی؟ رسول اللہ صلی اللہ علیہ وسلم اس کے جواب میں ( کچھ دیر ) خا مو ش رہے اس سے کہا گیا : تیرا کیا معاملہ ہے ؟ تم رسول اللہ صلی اللہ علیہ وسلم سے بات کرتے ہو ( جبکہ ) وہ تم سے بات نہیں کر رہے ؟ کہا : اور ہم نے دیکھا کہ آپ پر وحی اتاری جا رہی ہے پھر آپ پسینہ پو نچھتے ہو ئے اپنے معمول کی حا لت میں آگئے اور فرمایا : \" یہ سا ئل کہاں سے آیا ؟ گو یا آپ نے اس کی تحسین فر ما ئی ۔ ۔ ۔ پھر فر ما یا : \" واقعہ یہ ہے کہ خیر شر کو نہیں لا تی اور بلا شبہ مو سم بہار جو اگا تا ہے وہ ( اپنی دفرت شادابی اور مرغوبیت کی بنا پر ) مار دیتا ہے یا مو ت کے قریب کر دیتا ہے سوائے سبز دکھا نے والے اس حیوان کے جس نے کھا یا یہاں تک کہ جب اس کی کو کھیں بھرگئیں تو اس نے سورج کی آنکھ کی طرف منہ کر لیا ( اور آرام سے بیٹھ کر کھا یا ہوا ہضم کیا ) پھر لید کی ، پیشاب کیا اس کے بعد ( پھر سے ) گھا س کھا ئی ۔ یقیناً یہ ما ل شاداب اور شریں ہے اور یہ اس مسلمان کا بہترین ساتھی ہے جس نے اس میں سے مسکین یتیم اور مسافر کو دیا ۔ ۔ ۔ یا الفا ظ رسول اللہ صلی اللہ علیہ وسلم نے فر ما ئے ۔ ۔ ۔ اور حقیقت یہ ہے جو اسے اس کے حق کے بغیر لیتا ہے وہ اس آدمی کی طرح ہے جو کھا تا ہے اور سیر نہیں ہو تا اور قیامت کے دن وہ ( مال ) اس کے خلاف گواہ ہو گا ۔",
                "urduNarrator": "ہمجھ سے علی بن حجر نے بیان کیا، کہا ہم سے اسماعیل بن ابراہیم نے بیان کیا، وہ ہشام کے صحابی دستاوی سے، انہوں نے یحییٰ بن ابی کثیر کی سند سے۔لال بن ابی میمونہ نے عطا ء بن یسار سے اور انھوں نے حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے کہا",
                "hadithArabic": "حَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ أَخْبَرَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ عَنْ هِشَامٍ صَاحِبِ الدَّسْتَوَائِيِّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ هِلَالِ بْنِ أَبِي مَيْمُونَةَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ جَلَسَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ وَجَلَسْنَا حَوْلَهُ فَقَالَ إِنَّ مِمَّا أَخَافُ عَلَيْكُمْ بَعْدِي مَا يُفْتَحُ عَلَيْكُمْ مِنْ زَهْرَةِ الدُّنْيَا وَزِينَتِهَا فَقَالَ رَجُلٌ أَوَ يَأْتِي الْخَيْرُ بِالشَّرِّ يَا رَسُولَ اللَّهِ قَالَ فَسَكَتَ عَنْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقِيلَ لَهُ مَا شَأْنُكَ تُكَلِّمُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَا يُكَلِّمُكَ قَالَ وَرَأَيْنَا أَنَّهُ يُنْزَلُ عَلَيْهِ فَأَفَاقَ يَمْسَحُ عَنْهُ الرُّحَضَاءَ وَقَالَ إِنَّ هَذَا السَّائِلَ وَكَأَنَّهُ حَمِدَهُ فَقَالَ إِنَّهُ لَا يَأْتِي الْخَيْرُ بِالشَّرِّ وَإِنَّ مِمَّا يُنْبِتُ الرَّبِيعُ يَقْتُلُ أَوْ يُلِمُّ إِلَّا آكِلَةَ الْخَضِرِ فَإِنَّهَا أَكَلَتْ حَتَّى إِذَا امْتَلَأَتْ خَاصِرَتَاهَا اسْتَقْبَلَتْ عَيْنَ الشَّمْسِ فَثَلَطَتْ وَبَالَتْ ثُمَّ رَتَعَتْ وَإِنَّ هَذَا الْمَالَ خَضِرٌ حُلْوٌ وَنِعْمَ صَاحِبُ الْمُسْلِمِ هُوَ لِمَنْ أَعْطَى مِنْهُ الْمِسْكِينَ وَالْيَتِيمَ وَابْنَ السَّبِيلَ أَوْ كَمَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَإِنَّهُ مَنْ يَأْخُذُهُ بِغَيْرِ حَقِّهِ كَانَ كَالَّذِي يَأْكُلُ وَلَا يَشْبَعُ وَيَكُونُ عَلَيْهِ شَهِيدًا يَوْمَ الْقِيَامَةِ.",
                "headingArabic": "تَخَوُّفِ مَا يَخْرُجُ مِنْ زَهْرَةِ الدُّنْيَا ‏",
                "headingUrdu": "اس دنیا کی رونق اور عیش و عشرت کے فریب میں نہ آنے کی تنبیہ",
                "headingEnglish": "Warning against being deceived by the splendor and luxury of this world",
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9988,
                "hadithNumber": "2424",
                "englishNarrator": "Abu Sa'id al-Khudri رضی اللہ عنہ reported:",
                "hadithEnglish": "Some people from among the Ansar begged from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and he gave them. They again begged him and he again gave them, till when what was in his possession was exhausted he said: Whatever good (riches, goods) I have, I will not withhold it from you. He who refrains from begging Allah safeguards him against want. and he who seeks sufficiency, Allah would keep him in a state of sufficiency, and he who shows endurance. Allah would grant him power to endure, and none is blessed with an endowment better and greater than endurance.",
                "hadithUrdu": "انصار کے کچھ لوگو ں نے رسول اللہ صلی اللہ علیہ وسلم سے مال کا سوال کیا آپ نے ان کو دے دیا انھوں نے پھر مانگا آپ نے دے دیا حتیٰ کہ آپ کے پاس جو کچھ تھا وہ ختم ہو گیا تو آپ نے فر ما یا : \" میرے پاس جو بھی مال ہو گا میں اسے ہر گز تم سے ( بچا کر ذخیرہ نہ کروں گا ( تمھی میں بانٹ دو ں گا ) جو شخص سوال سے بچنے کی کو شش کرے گا اللہ اسے بچا ئے گا اور جو استغنا ( بے نیازی ) اختیار کرے گا اللہ اس کو بے نیاز کر دے گا اورجو صبر کرے گا ( سوال سے باز رہے گا ) اللہ تعا لیٰ اس کو صبر ( کی قوت ) قناعت فر ما ئے گا اور کسی کو ایسا کو ئی عطیہ نہیں دیا گیا جو صبر سے بہتر اور وسیع تر ہو ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, امام مالک بن انس نے ابن شہاب زہری سے انھوں نے عطا ء بن یزید لیثی سے اور انھوں نے حضرت ابو سعید خدری رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكِ بْنِ أَنَسٍ فِيمَا قُرِئَ عَلَيْهِ عَنْ ابْنِ شِهَابٍ عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ نَاسًا مِنْ الْأَنْصَارِ سَأَلُوا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَعْطَاهُمْ ثُمَّ سَأَلُوهُ فَأَعْطَاهُمْ حَتَّى إِذَا نَفِدَ مَا عِنْدَهُ قَالَ مَا يَكُنْ عِنْدِي مِنْ خَيْرٍ فَلَنْ أَدَّخِرَهُ عَنْكُمْ وَمَنْ يَسْتَعْفِفْ يُعِفَّهُ اللَّهُ وَمَنْ يَسْتَغْنِ يُغْنِهِ اللَّهُ وَمَنْ يَصْبِرْ يُصَبِّرْهُ اللَّهُ وَمَا أُعْطِيَ أَحَدٌ مِنْ عَطَاءٍ خَيْرٌ وَأَوْسَعُ مِنْ الصَّبْرِ.",
                "headingArabic": "فَضْلِ التَّعَفُّفِ وَالصَّبْرِ ‏",
                "headingUrdu": "The virtue of refraining from asking and being patient and content",
                "headingEnglish": "The virtue of refraining from asking and being patient and content",
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 9676,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=387",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=385",
                "label": "385",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=386",
                "label": "386",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=387",
                "label": "387",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=388",
                "label": "388",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=389",
                "label": "389",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=390",
                "label": "390",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=391",
                "label": "391",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=389",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=389",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=387",
        "to": 9700,
        "total": 40465
    }
}