{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 546,
        "data": [
            {
                "id": 13914,
                "hadithNumber": "6351",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was presented a garment of sundus and he prohibited the use of silk. The persons admired it, whereupon he said: By Him in Whose Hand is the life of Muhammad, the kerchiefs of Sa'd bin Mu'adh in Paradise are better than this.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کو سندس ( باریک ریشم ) کا ایک جبہ ہدیہ کیاگیا ، حالانکہ آپ ریشم ( پہننے ) سے منع فرماتے تھے ، لوگوں کو اس ( کی خوبصورتی ) سے تعجب ہوا ، آپ صلی اللہ علیہ وسلم نے فرمایا : \" اس ذات کی قسم جس کےہاتھ میں محمد کی جان ہے!جنت میں سعد بن معاذ کے رومال اس سے زیادہ اچھے ہیں ۔ \"",
                "urduNarrator": "ہم سے زہیر بن حرب نے بیان کیا، کہا ہم سے یونس بن محمد نے بیان کیا ,شیبان نے قتادہ سے روایت کی ، کہا : ہمیں حضرت انس بن مالک رضی اللہ عنہ نے حدیث بیان کی کہ",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، حَدَّثَنَا شَيْبَانُ، عَنْ قَتَادَةَ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، أَنَّهُ أُهْدِيَ لِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ جُبَّةٌ مِنْ سُنْدُسٍ، وَكَانَ يَنْهَى عَنِ الْحَرِيرِ، فَعَجِبَ النَّاسُ مِنْهَا، فَقَالَ: «وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ إِنَّ مَنَادِيلَ سَعْدِ بْنِ مُعَاذٍ فِي الْجَنَّةِ أَحْسَنُ مِنْ هَذَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13915,
                "hadithNumber": "6352",
                "englishNarrator": "Anas رضی اللہ عنہ reported:",
                "hadithEnglish": "The king of Dumat al-Jandal presented to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) the garment and lie made no mention (of the fact) that he prohibited the use of silk.",
                "hadithUrdu": "دومۃ الجندل کے ( بادشاہ ) اکیدرنے رسول اللہ صلی اللہ علیہ وسلم کو ایک حلہ ہدیہ کیا ، پھر اسی کے مانند بیان کیا ، البتہ اس میں یہ ذکر نہیں کیا : \" حالانکہ آپ صلی اللہ علیہ وسلم ریشم سے منع فرماتے تھے ۔ \"",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا، کہا ہم سے سالم بن نوح نے بیان کیا, عمر بن عامر نے قتادہ سے ، انھوں نے حضرت انس رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَاهُ مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا سَالِمُ بْنُ نُوحٍ، حَدَّثَنَا عُمَرُ بْنُ عَامِرٍ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، أَنَّ أُكَيْدِرَ دُومَةِ الْجَنْدَلِ أَهْدَى لِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، حُلَّةً فَذَكَرَ نَحْوَهُ، وَلَمْ يَذْكُرْ فِيهِ وَكَانَ يَنْهَى عَنِ الْحَرِيرِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13916,
                "hadithNumber": "6353",
                "englishNarrator": "Anas رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) took hold of his sword on the Day of Uhud and said: Who would take it from me? All the persons stretched their hands saying: I would do it, I would do it. He (Allah's Apostle) said: Who would take it in order to fulfil its rights? Then the people withdrew their hands. Simak bin Kharasha Abu Dujana رضی اللہ عنہ said: I am here to take it and fulfil its rights. He took it and struck the heads of the polytheists.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے احد کے دن تلوار پکڑی اور فرمایا کہ یہ مجھ سے کون لیتا ہے؟ لوگوں نے ہاتھ پھیلائے اور ہر ایک کہتا تھا کہ میں لوں گا میں لوں گا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس کا حق کون ادا کرے گا؟ یہ سنتے ہی لوگ پیچھے ہٹے ( کیونکہ احد کے دن کافروں کا غلبہ تھا ) سیدنا سماک بن خرشہ ابودجانہ رضی اللہ عنہ نے کہا کہ میں اس کا حق ادا کروں گا ۔ پھر انہوں نے اس کو لے لیا اور مشرکوں کے سر اس تلوار سے چیرے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے عفان نے بیان کیا، ہم سے حماد بن سلمہ نے بیان کیا, ثابت نے ہمیں حضرت انس رضی اللہ عنہ سے روایت کی ، کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَخَذَ سَيْفًا يَوْمَ أُحُدٍ فَقَالَ: «مَنْ يَأْخُذُ مِنِّي هَذَا؟» فَبَسَطُوا أَيْدِيَهُمْ، كُلُّ إِنْسَانٍ مِنْهُمْ يَقُولُ: أَنَا، أَنَا، قَالَ: «فَمَنْ يَأْخُذُهُ بِحَقِّهِ؟» قَالَ فَأَحْجَمَ الْقَوْمُ. فَقَالَ سِمَاكُ بْنُ خَرَشَةَ أَبُو دُجَانَةَ: أَنَا آخُذُهُ بِحَقِّهِ. قَالَ: فَأَخَذَهُ فَفَلَقَ بِهِ هَامَ الْمُشْرِكِينَ.",
                "headingArabic": "مِنْ فَضَائِلِ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ حَرَامٍ وَالِدِ جَابِرٍ رضى الله تعالى عنهما",
                "headingUrdu": "ابو دجانہ سماک بن خراشہ رضی اللہ عنہ کے فضائل",
                "headingEnglish": "The Virtues Of Abu Dujanah Simak Bin Kharashah (RA)",
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13917,
                "hadithNumber": "6354",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "The dead body of my father was brought and he was covered (with cloth) and it had been mutilated. I made an attempt to lift the cloth, but my people prohibited me to do so. I again made an attempt to lift the cloth, but my people prohibited me. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) lifted it or he commanded it to be lifted. He heard the noise (of a loud) weeping, or the noise of a woman mourner. He inquired who she was. They said: The daughter of 'Amr or the sister of Amr, whereupon he said: Why does she weep? The Angels provide him shade with the help of their Wings until he would be lifted (to his heavenly abode)",
                "hadithUrdu": "جب احد کی جنگ ہوئی تو میرے والد کو کپڑے سے ڈھانپ کر لایاگیا ، ان کا مثلہ کیاگیا تھا ( ان کے چہرے تک کے اعضاء کاٹ دیے گئے تھے ) میں نے چاہا کہ میں کپڑا اٹھاؤں ( اوردیکھوں ) تو میری قوم کے لوگوں نے مجھے روک دیا ، میں نے پھر کپڑا اٹھانا چاہا تو میری قوم نے مجھے روک دیا ۔ پھر رسول اللہ صلی اللہ علیہ وسلم نے آکر کپڑا اٹھایا ، یا آپ صلی اللہ علیہ وسلم نے حکم دیا تو کپڑا اٹھایا گیا تو ( اس وقت ) ایک رونے والی یا چیخنے والی کی آواز آئی ۔ آپ صلی اللہ علیہ وسلم نے پوچھا : \" یہ کون ہے؟ \" تو لوگوں نے بتایا : عمرو کی بیٹی ( شہید ہونے والے عبداللہ کی بہن ) ہے یا ( کہا : ) عمرو کی بہن ( شہید کی پھوپھی ) ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" وہ کیوں روتی ہے؟ان ( کے جنازے ) کو اٹھائے جانے تک فرشتوں نے اپنے پروں سے ان پر سایہ کیا ہواہے ۔ \"",
                "urduNarrator": "ہمیں عبید اللہ بن عمر القواریری اور عمرو ناقد نے بیان کیا, سفیان بن عیینہ نے کہا : میں نے ابن منکدر کو یہ کہتے ہوئے سنا : میں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سےسنا ، کہہ رہے تھے",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، وَعَمْرٌو النَّاقِدُ، كِلَاهُمَا عَنْ سُفْيَانَ، قَالَ: عُبَيْدُ اللهِ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، قَالَ: سَمِعْتُ ابْنَ الْمُنْكَدِرِ، يَقُولُ: سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللهِ، يَقُولُ: لَمَّا كَانَ يَوْمُ أُحُدٍ، جِيءَ بِأَبِي مُسَجًّى، وَقَدْ مُثِّلَ بِهِ، قَالَ: فَأَرَدْتُ أَنْ أَرْفَعَ الثَّوْبَ، فَنَهَانِي قَوْمِي، ثُمَّ أَرَدْتُ أَنْ أَرْفَعَ الثَّوْبَ، فَنَهَانِي قَوْمِي، فَرَفَعَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، أَوْ أَمَرَ بِهِ فَرُفِعَ فَسَمِعَ صَوْتَ بَاكِيَةٍ أَوْ صَائِحَةٍ، فَقَالَ: «مَنْ هَذِهِ؟» فَقَالُوا بِنْتُ عَمْرٍو، أَوْ أُخْتُ عَمْرٍو، فَقَالَ: «وَلِمَ تَبْكِي؟ فَمَا زَالَتِ الْمَلَائِكَةُ تُظِلُّهُ بِأَجْنِحَتِهَا حَتَّى رُفِعَ».",
                "headingArabic": "مِنْ فَضَائِلِ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ حَرَامٍ وَالِدِ جَابِرٍ رضى الله تعالى عنهما",
                "headingUrdu": "جابر رضی اللہ عنہ کے والد عبداللہ بن عمرو بن حرام کے فضائل",
                "headingEnglish": "The Virtues Of 'Abdullah Bin 'Amr Bin Haram, The Father Of Jabir (RA)",
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13918,
                "hadithNumber": "6355",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "My father fell as a martyr on the Day of Uhud and I attempted to uncover his face and weep, but they (the Companions of the Holy Prophet) forbade me to do this, whereas Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) did not forbid me and Fatima bint Amr, the sister of my father, was also weeping There- upon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: You may weep or you may not weep; the Angels provide him shade with the help of their wings until you lift him (to be buried in the grave).",
                "hadithUrdu": "میرا باپ احد کے دن شہید ہوا تو میں اس کے منہ سے کپڑا اٹھاتا تھا اور روتا تھا ۔ لوگ مجھے منع کرتے تھے اور رسول اللہ صلی اللہ علیہ وسلم منع نہ کرتے تھے ۔ اور عمرو کی بیٹی فاطمہ ( یعنی میری پھوپھی ) وہ بھی اس پر رو رہی تھی ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ تو روئے یا نہ روئے ، تمہارے اسے اٹھانے تک فرشتے اس پر اپنے پروں کا سایہ کئے ہوئے تھے ۔",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا، کہا ہم سے وہب بن جریر نے بیان کیا، شعبہ نے محمد بن منکدر سے ، انھوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت کی ، کہا : کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، قَالَ: أُصِيبَ أَبِي يَوْمَ أُحُدٍ، فَجَعَلْتُ أَكْشِفُ الثَّوْبَ عَنْ وَجْهِهِ، وَأَبْكِي وَجَعَلُوا يَنْهَوْنَنِي، وَرَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لَا يَنْهَانِي، قَالَ: وَجَعَلَتْ فَاطِمَةُ بِنْتُ عَمْرٍو، تَبْكِيهِ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: تَبْكِيهِ، أَوْ لَا تَبْكِيهِ، مَا زَالَتِ الْمَلَائِكَةُ تُظِلُّهُ بِأَجْنِحَتِهَا، حَتَّى رَفَعْتُمُوهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13919,
                "hadithNumber": "6356",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Jabir رضی اللہ عنہ through another chain of transmitters, but with this difference that there is no mention of the Angels and the weeping of a female mourner.",
                "hadithUrdu": "ہم سے عبد بن حمید نے بیان کیا، کہا ہم سے روح بن عبادہ نے بیان کیا, ابن جریج اور معمر دونوں نے محمد بن منکدر سے ، انھوں نے حضرت جابر رضی اللہ عنہ سے یہی حدیث بیان کی ، مگر ابن جریج کی حدیث میں فرشتوں اور رونے والی کے رونے کا ذکر نہیں ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، كِلَاهُمَا، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ، بِهَذَا الْحَدِيثِ، غَيْرَ أَنَّ ابْنَ جُرَيْجٍ لَيْسَ فِي حَدِيثِهِ ذِكْرُ الْمَلَائِكَةِ وَبُكَاءُ الْبَاكِيَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13920,
                "hadithNumber": "6357",
                "englishNarrator": "Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "My father was brought in a state that his ears had been cut off and (his dead body) was placed before Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), the rest of the hadith is the same.",
                "hadithUrdu": "اُحد کے دن میرے والد کو اس طرح لایاگیا کہ ان کی ناک اور ان کے کان کاٹ دیے گئے تھے ، انھیں لا کررسول اللہ صلی اللہ علیہ وسلم کے سامنے ر کھ دیا گیا ، پھر ان سب کی حدیث کی طرح بیان کیا ۔",
                "urduNarrator": "ہم سے محمد بن احمد بن ابی خلف نے بیان کیا، کہا ہم سے زکریا بن عدی نے بیان کیا، کہا ہم سے عبید اللہ بن عمرو نے بیان کیا, عبدالکریم نے محمد بن منکدر سے ، انھوں نے حضرت جابر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ، حَدَّثَنَا زَكَرِيَّاءُ بْنُ عَدِيٍّ، أَخْبَرَنَا عُبَيْدُ اللهِ بْنُ عَمْرٍو، عَنْ عَبْدِ الْكَرِيمِ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ، قَالَ: جِيءَ بِأَبِي يَوْمَ أُحُدٍ مُجَدَّعًا، فَوُضِعَ بَيْنَ يَدَيِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَذَكَرَ نَحْوَ حَدِيثِهِمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13921,
                "hadithNumber": "6358",
                "englishNarrator": "Abu Barza رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was there in a battlefield that Allah conferred upon him the spoils of war. He said to his Companions: Is anyone missing amongst you? They said: So and so and so. He again said: Is there anyone missing amongst you? They said: So and so and so. He then said: Is there anyone missing amongst you? They said: No. Thereupon he (the Holy Prophet) said: But I am missing Julaibib رضی اللہ عنہ . They (his Companions) searched him amongst those who had been killed and they found him by the side of seven (dead bodies) whom he had killed and he had been killed (by the oppoments). Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came there and stood (by his side) and said: He killed seven (persons). Then (his opponents) killed him. He is mine and I am his. He then placed him upon his hands and there was none else to lift but Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). Then the grave was dug for him and he was placed in the grave and no mention is made of a bath.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم اپنی ایک جنگ میں تھے ، اللہ تعالیٰ نے آپ صلی اللہ علیہ وسلم کو ( فتح کے ساتھ ) مال غنیمت دیا ۔ آپ صلی اللہ علیہ وسلم نے اپنے لوگوں سے فرمایا کہ تم میں سے کوئی غائب تو نہیں ہے؟ لوگوں نے عرض کیا کہ ہاں فلاں فلاں فلاں شخص غائب ہیں ۔ پھر آپ صلی اللہ علیہ وسلم نے پوچھا کہ کوئی اور تو غائب نہیں ہے؟ لوگوں نے کہا کہ فلاں فلاں شخص غائب ہیں ۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ اور تو کوئی غائب نہیں ہے؟ لوگوں نے عرض کیا کہ کوئی نہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں جلیبیب رضی اللہ عنہ کو نہیں دیکھتا ۔ لوگوں نے ان کو مردوں میں ڈھونڈا تو ان کی لاش سات لاشوں کے پاس پائی گئی جن کو سیدنا جلیبیب نے مارا تھا ۔ وہ سات کو مار کر شہید ہو گئے ۔ رسول اللہ صلی اللہ علیہ وسلم ان کے پاس آئے اور وہاں کھڑے ہو کر پھر فرمایا کہ اس نے سات آدمیوں کو مارا ، اس کے بعد خود مارا گیا ۔ یہ مجھ سے ہے اور میں اس سے ہوں ۔ پھر آپ صلی اللہ علیہ وسلم نے اس کو اپنے دونوں ہاتھوں پر رکھا اور صرف آپ صلی اللہ علیہ وسلم کے ہاتھ ہی اس کی چارپائی تھے ۔ اس کے بعد قبر کھدوا کر اس میں رکھ دیا ۔ اور راوی نے غسل کا بیان نہیں کیا ۔",
                "urduNarrator": "ہم سے اسحاق بن عمر بن سلط نے بیان کیا، کہا ہم سے حماد بن سلمہ نے، ثابت کی سند سے، کنانہ بن نعیم سے, حضرت ابو برزہ رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ عُمَرَ بْنِ سَلِيطٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ كِنَانَةَ بْنِ نُعَيْمٍ، عَنْ أَبِي بَرْزَةَ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، كَانَ فِي مَغْزًى لَهُ، فَأَفَاءَ اللهُ عَلَيْهِ، فَقَالَ لِأَصْحَابِهِ: «هَلْ تَفْقِدُونَ مِنْ أَحَدٍ؟» قَالُوا: نَعَمْ، فُلَانًا، وَفُلَانًا، وَفُلَانًا، ثُمَّ قَالَ: «هَلْ تَفْقِدُونَ مِنْ أَحَدٍ؟» قَالُوا: نَعَمْ، فُلَانًا، وَفُلَانًا، وَفُلَانًا، ثُمَّ قَالَ: «هَلْ تَفْقِدُونَ مِنْ أَحَدٍ؟» قَالُوا: لَا، قَالَ: «لَكِنِّي أَفْقِدُ جُلَيْبِيبًا، فَاطْلُبُوهُ» فَطُلِبَ فِي الْقَتْلَى، فَوَجَدُوهُ إِلَى جَنْبِ سَبْعَةٍ قَدْ قَتَلَهُمْ، ثُمَّ قَتَلُوهُ، فَأَتَى النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَوَقَفَ عَلَيْهِ، فَقَالَ: «قَتَلَ سَبْعَةً، ثُمَّ قَتَلُوهُ هَذَا مِنِّي وَأَنَا مِنْهُ، هَذَا مِنِّي وَأَنَا مِنْهُ» قَالَ: فَوَضَعَهُ عَلَى سَاعِدَيْهِ لَيْسَ لَهُ إِلَّا سَاعِدَا النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: فَحُفِرَ لَهُ وَوُضِعَ فِي قَبْرِهِ، وَلَمْ يَذْكُرْ غَسْلًا.",
                "headingArabic": "مِنْ فَضَائِلِ جُلَيْبِيبٍ رضى الله عنه",
                "headingUrdu": "جلیبیب رضی اللہ عنہ کے فضائل",
                "headingEnglish": "The Virtues Of Julaibib (RA)",
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13922,
                "hadithNumber": "6359",
                "englishNarrator": "Abdullah bin Samit reported:",
                "hadithEnglish": "Abu Dharr رضی اللہ عنہ said: We set out from our tribe Ghafir who look upon the prohibited months as permissible months. I and my brother Unais and our mother stayed with our maternal uncle who treated us well. The men of his tribe fell jealous and they said: When you are anay from your house, Unais commits adultery with your wife. Our -naternal uncle came and he accused us of the sin which was conveyed to him. I said: You have undone the good you did to us. We cannot stay with you after this. We came to our camels and loaded (our) luggage. Our maternal uncle began to weep covering himself with (a piece of) cloth. We proceeded on until we encamped by the side of Mecca. Unais cast lot on the camels (we had) and an equal number (above that). They both went to a Kahin and he made Unais win and Unais came with our camels and an equal number along with them. He (Abu Dharr رضی اللہ عنہ) said: My nephew, I used to observe prayer three years before my meeting with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). I said: For whom did you say prayer? He said: For Allah. I said: To which direction did you turn your face (for observing prayer)? He said: I used to turn my face as Allah has directed me to turn my face. I used to observe the night prayer at the time of the end of night and I fell down in prostration like the mantle until the sun rose over me. Unais said: I have a work in Mecca, so you better stay here. Unais went until he came to Mecca and he came to me late. I said: What did you do? He said: I met a person in Mecca who is on your religion and he claims that verily it is Allah Who has sent him. I said: What do the people say about him? He said: They say that he is a poet or a Kahin or a magician. Unais who was himself one of the poets said. I have heard the words of a Kahin but his words in no way resemble his (words). And 1 also compared his words to the verses of poets but such words cannot be uttered by any poet. By Allah, he is truthful and they are liars. Then I said: you stay here, until I go, so that I should see him. He said: I came to Mecca and I selected an insignificant person from amongst them and said to him: Where is he whom you call as-Sabi? He pointed out towards me saying: He is Sabi. Thereupon the people of the valley attacked me with sods and bows until I fell down unconscious. I stood up after havin. regained my consciousness and I found as if I was a red idol. I came to Zamzarn and washed blood from me and drank water from it and listen, O son of my brother, I stayed there for thirty nights or days and there was no food for me but the water of Zamzarn. And I became so bulky that there appeared wrinkles upon my stomach, and I did not feel any hunger in my stomach. It was during this time that the people of Mecca slept in the moonlit night and none was there to eircumambulate the House but only two women who had been invoking the name of Isafa, and Na'ila (the two idols). They came to me while in their circuit and I said: Marry one with the other, but they did not dissuade from their invoking. They came to me and I said to them: Insert wood (in the idols' private parts). (I said this to them in such plain words) as I could not express in metaphorical terms. These women went away crying and saying: Had there been one amongst our people (he would have taught a lesson to you for the obscene words used for our idols before us). These women met Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and Abu Bakr رضی اللہ عنہ who had also been coming down the hill. He asked them: What has happened to you? They said: There is Sabi, who has hidden himself between the Ka'ba and its curtain. He said: What did he say to you? They said: He uttered such words before us as we cannot express. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came and he kissed the Black Stone and circumambulated the House along with his Companion and then observed prayer, and when he had finished his prayer, Abu Dharr رضی اللہ عنہ said: I was the first to greet him with the salutation of peace and uttered (these words) in this way; Allah's Messenger, may there be peace upon you, whereupon he said: It may be upon you too and the mercy of Allah. He then said: Who are you? I said: From the tribe of Ghifar. He leaned his hand and placed his finger on his forehead and I said to myself: Perhaps he has not liked it that I belong to the tribe of Ghifar. I attempted to catch hold of his hand but his friend who knew about him more than I dissuaded me f rom doing so. He then lifted his head and said: Since how long have you been here? I said: I have been here for the last thirty nights or days. He said: Who has been feeding you? I said: There has been no food for me but the water of Zamzam. I have grown so bulky that there appear wrinkles upon my stomach and I do not feel any hunger. He said: It is blessed (water) and it also serves as food. Thereupon Abu Bakr رضی اللہ عنہ said: Allah's Messenger, let me serve as a host to him for tonight, and then Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) proceeded forth and so did Abu Bakr رضی اللہ عنہ and I went along with them. Abu Bakr رضی اللہ عنہ opened the door and then he brought for us the raisins of Ta'if and that was the first food which I ate there. Then I stayed as long as I had to stay. I then came to Allah's Messenaer ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and he said: I have been shown the land abounding in trees and I think it cannot be but that of Yathrib (that is the old name of Medina). You are a preacher to your people on my behalf. I hope Allah would benefit them through you and He would reward you. I came to Unais and he said: What have you done? I said: I have done that I have embraced Islam and I have testified (to the prophethood of Allah's Messenger). He said: I have no aversion for your religion and I also embrace Islam and testify (to the prophethood of Muhammad). Then both of us came to our mother and she said: I have no aversion for your religion and I also embrace Islam and testify to the prophethood of Muhammad. We then loaded our camels and came to our tribe Ghifir and half of the tribe embraced Islam and their chief was Aimi' bin Rahada Ghifirl and he was their leader and hall of the tribe said: We will embrace Islam when Allah's Messenger (ﷺ) would come to Medina, and when Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came to Medina the remaining half also embraced Islam. Then a tribe Aslam came to the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and said: Allah's Messenger, we also embrace Islam like our brothers who have embraced Islam. And they also embraced Islam. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Allah granted pardon to the tribe of Ghifar and Allah saved (from destruction) the tribe of Aslam.",
                "hadithUrdu": "سیدنا ابوذر رضی اللہ عنہ نے کہا کہ میں ، میرا بھائی انیس اور ہماری ماں تینوں اپنی قوم غفار میں سے نکلے جو حرام مہینے کو بھی حلال سمجھتے تھے ۔ پس ہم اپنے ایک ماموں کے پاس اترے ۔ اس نے ہماری خاطر کی اور ہمارے ساتھ نیکی کی تو اس کی قوم نے ہم سے حسد کیا اور ( ہمارے ماموں سے ) کہنے لگے کہ جب تو اپنے گھر سے باہر نکلتا ہے تو انیس تیری بی بی کے ساتھ زنا کرتا ہے ۔ وہ ہمارے پاس آیا اور اس نے یہ بات ( حماقت سے ) مشہور کر دی ۔ میں نے کہا کہ تو نے ہمارے ساتھ جو احسان کیا تھا وہ بھی خراب ہو گیا ہے ، اب ہم تیرے ساتھ نہیں رہ سکتے ۔ آخر ہم اپنے اونٹوں کے پاس گئے اور اپنا اسباب لادا اور ہمارے ماموں نے اپنا کپڑا اوڑھ کر رونا شروع کر دیا ۔ ہم چلے ، یہاں تک کہ مکہ کے سامنے اترے ۔ انیس نے ہمارے اونٹوں کے ساتھ اتنے ہی اور کی شرط لگائی ۔ پھر دونوں کاہن کے پاس گئے تو کاہن نے انیس کو کہا کہ یہ بہتر ہے ۔ پس انیس ہمارے پاس سارے اونٹ اور اتنے ہی اور اونٹ لایا ۔ ابوذر نے کہا کہ اے میرے بھائی کے بیٹے! میں نے رسول اللہ صلی اللہ علیہ وسلم کی ملاقات سے پہلے تین برس پہلے نماز پڑھی ہے ۔ میں نے کہا کہ کس کے لئے پڑھتے تھے؟ سیدنا ابوذر رضی اللہ عنہ نے کہا کہ اللہ تعالیٰ کے لئے ۔ میں نے کہا کہ کدھر منہ کرتے تھے؟ انہوں نے کہا کہ ادھر منہ کرتا تھا جدھر اللہ تعالیٰ میرا منہ کر دیتا تھا ۔ میں رات کے آخر حصہ میں عشاء کی نماز پڑھتا اور سورج طلوع ہونے تک کمبل کی طرح پڑ رہتا تھا ۔ انیس نے کہا کہ مجھے مکہ میں کام ہے ، تم یہاں رہو میں جاتا ہوں ۔ وہ گیا اور اس نے آنے میں دیر کی ۔ پھر آیا تو میں نے کہا کہ تو نے کیا کیا؟ وہ بولا کہ میں مکہ میں ایک شخص سے ملا جو تیرے دین پر ہے اور وہ کہتا ہے کہ اللہ تعالیٰ نے اس کو بھیجا ہے ۔ میں نے کہا کہ لوگ اسے کیا کہتے ہیں؟ اس نے کہا کہ لوگ اس کو شاعر ، کاہن اور جادوگر کہتے ہیں ۔ اور انیس خود بھی شاعر تھا ۔ اس نے کہا کہ میں نے کاہنوں کی بات سنی ہے لیکن جو کلام یہ شخص پڑھتا ہے وہ کاہنوں کا کلام نہیں ہے اور میں نے اس کا کلام شعر کے تمام بحروں پر رکھا تو وہ کسی کی زبان پر میرے بعد شعر کی طرح نہ جڑے گا ۔ اللہ کی قسم وہ سچا ہے اور لوگ جھوٹے ہیں ۔ میں نے کہا کہ تم یہاں رہو میں اس شخص کو جا کر دیکھتا ہوں ۔ پھر میں مکہ میں آیا تو میں نے ایک ناتواں شخص کو مکہ والوں میں سے چھانٹا ( اس لئے کہ طاقتور شخص شاید مجھے کوئی تکلیف پہنچائے ) ، اور اس سے پوچھا کہ وہ شخص کہاں ہے جس کو تم صابی ( بےدین ) کہتے ہو؟ اس نے میری طرف اشارہ کیا اور کہا کہ یہ صابی ہے ( جب تو صابی کا پوچھتا ہے ) یہ سن کر تمام وادی والوں نے ڈھیلے اور ہڈیاں لے کر مجھ پر حملہ کر دیا ، یہاں تک کہ میں بیہوش ہو کر گر پڑا ۔ جب میں ہوش میں آ کر اٹھا تو کیا دیکھتا ہوں کہ گویا میں لال بت ہوں ( یعنی سر سے پیر تک خون سے سرخ ہوں ) ۔ پھر میں زمزم کے پاس آیا اور میں نے سب خون دھویا اور زمزم کا پانی پیا ۔ پس اے میرے بھتیجے! میں وہاں تیس راتیں یا تیس دن رہا اور میرے پاس سوائے زمزم کے پانی کے کوئی کھانا نہ تھا ( جب بھوک لگتی تو میں اسی کو پیتا ) ۔ پھر میں موٹا ہو گیا یہاں تک کہ میرے پیٹ کی بٹیں ( موٹاپے سے ) جھک گئیں اور میں نے اپنے کلیجہ میں بھوک کی ناتوانی نہیں پائی ۔ ایک بار مکہ والے چاندنی رات میں سو گئے کہ اس وقت بیت اللہ کا طواف کوئی نہ کرتا تھا ، صرف دو عورتیں اساف اور نائلہ کو پکار رہی تھیں ( اساف اور نائلہ مکہ میں دو بت تھے اساف مرد تھا اور نائلہ عورت تھی اور کفار کا یہ اعتقاد تھا کہ ان دونوں نے وہاں زنا کیا تھا ، اس وجہ سے مسخ ہو کر بت ہو گئے تھے ) ، وہ طواف کرتی کرتی میرے سامنے آئیں ۔ میں نے کہا کہ ایک کا نکاح دوسرے سے کر دو ( یعنی اساف کا نائلہ سے ) ۔ یہ سن کر بھی وہ اپنی بات سے باز نہ آئیں ۔ پھر میں نے صاف کہہ دیا کہ ان کے فلاں میں لکڑی ( یعنی یہ فخش اساف اور نائلہ کی پرستش کی وجہ سے ) اور میں نے کنایہ نہ کیا ( یعنی کنایہ اشارہ میں میں نے گالی نہیں دی بلکہ ان مردود عورتوں کو غصہ دلانے کے لئے اساف اور نائلہ کو کھلم کھلا گالی دی ، جو اللہ تعالیٰ کے گھر میں اللہ کو چھوڑ کر اساف اور نائلہ کو پکارتی تھیں ) یہ سن کر وہ دونوں عورتیں چلاتی اور کہتی ہوئی چلیں کہ کاش اس وقت ہمارے لوگوں میں سے کوئی ہوتا ( جو اس شخص کو بے ادبی کی سزا دیتا ) ۔ راہ میں ان عورتوں کو رسول اللہ صلی اللہ علیہ وسلم اور سیدنا ابوبکر رضی اللہ عنہ ملے اور وہ پہاڑ سے اتر رہے تھے ۔ انہوں نے عورتوں سے پوچھا کہ کیا ہوا؟ وہ بولیں کہ ایک صابی آیا ہے جو کعبہ کے پردوں میں چھپا ہوا ہے ۔ انہوں نے کہا کہ اس صابی نے کیا کہا؟ وہ بولیں کہ ایسی بات بولا جس سے منہ بھر جاتا ہے ( یعنی اس کو زبان سے نہیں نکال سکتیں ) ۔ اور رسول اللہ صلی اللہ علیہ وسلم تشریف لائے ، یہاں تک حجراسود کو بوسہ دیا اور اپنے ساتھی کے ساتھ طواف کیا اور نماز پڑھی ۔ جب نماز پڑھ چکے تو سیدنا ابوذر رضی اللہ عنہ نے کہا کہ اول میں نے ہی سلام کی سنت ادا کی اور کہا کہ السلام علیکم یا رسول اللہ! آپ صلی اللہ علیہ وسلم نے فرمایا کہ وعلیک ورحمۃ اللہ ۔ پھر پوچھا کہ تو کون ہے؟ میں نے کہا کہ غفار کا ایک شخص ہوں ۔ آپ صلی اللہ علیہ وسلم نے ہاتھ جھکایا اور اپنی انگلیاں پیشانی پر رکھیں ( جیسے کوئی ذکر کرتا ہے ) میں نے اپنے دل میں کہا کہ شاید آپ صلی اللہ علیہ وسلم کو یہ کہنا برا معلوم ہوا کہ میں ( قبیلہ ) غفار میں سے ہوں ۔ میں آپ صلی اللہ علیہ وسلم کا ہاتھ پکڑنے کو لپکا لیکن آپ صلی اللہ علیہ وسلم کے ساتھی ( سیدنا ابوبکر رضی اللہ عنہ ) نے جو مجھ سے زیادہ آپ صلی اللہ علیہ وسلم کا حال جانتے تھے مجھے روکا ، پھر آپ صلی اللہ علیہ وسلم نے سر اٹھایا اور فرمایا کہ تو یہاں کب آیا؟ میں نے عرض کیا میں یہاں تیس رات یا دن سے ہوں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تجھے کھانا کون کھلاتا ہے؟ میں نے کہا کہ کھانا وغیرہ کچھ نہیں سوائے زمزم کے پانی کے ۔ پھر میں موٹا ہو گیا یہاں تک کہ میرے پیٹ کے بٹ مڑ گئے اور میں اپنے کلیجہ میں بھوک کی ناتوانی نہیں پاتا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ زمزم کا پانی برکت والا ہے اور وہ کھانا بھی ہے اور کھانے کی طرح پیٹ بھر دیتا ہے ۔ سیدنا ابوبکر رضی اللہ عنہ نے کہا کہ یا رسول اللہ! آج کی رات اس کو کھلانے کی اجازت مجھے دیجئے ۔ پھر رسول اللہ صلی اللہ علیہ وسلم چلے اور سیدنا ابوبکر رضی اللہ عنہ بھی میں بھی ان دونوں کے ساتھ چلا ۔ سیدنا ابوبکر رضی اللہ عنہ نے ایک دروازہ کھولا اور اس میں سے طائف کی سوکھی ہوئی کشمش نکالیں ، یہ پہلا کھانا تھا جو میں نے مکہ میں کھایا ۔ پھر میں رہا جب تک کہ رہا ، اس کے بعد رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ مجھے ایک کھجور والی زمین دکھلائی گئی ہے میں سمجھتا ہوں کہ وہ زمین یثرب کے سوا کوئی اور نہیں ہے ۔ ( یثرب مدینہ کا نام تھا ) ، پس تو میری طرف سے اپنی قوم کو دین کی دعوت دے ، شاید اللہ تعالیٰ ان کو تیری وجہ سے نفع دے اور تجھے ثواب دے ۔ میں انیس کے پاس آیا تو اس نے پوچھا کہ تو نے کیا کیا؟ میں نے کہا کہ میں اسلام لایا اور میں نے آپ صلی اللہ علیہ وسلم کی نبوت کی تصدیق کی ۔ وہ بولا کہ تمہارے دین سے مجھے بھی نفرت نہیں ہے میں بھی اسلام لایا اور میں نے آپ صلی اللہ علیہ وسلم کی نبوت کی تصدیق کی ۔ پھر ہم دونوں اپنی ماں کے پاس آئے وہ بولی کہ مجھے بھی تم دونوں کے دین سے نفرت نہیں ہے میں بھی اسلام لائی اور میں نے تصدیق کی ۔ پھر ہم نے اونٹوں پر اسباب لادا ، یہاں تک کہ ہم اپنی قوم غفار میں پہنچے ۔ آدھی قوم تو مسلمان ہو گئی اور ان کا امام ایماء بن رحضہ غفاری تھا وہ ان کا سردار بھی تھا ۔ اور آدھی قوم نے یہ کہا کہ جب رسول اللہ صلی اللہ علیہ وسلم مدینہ میں تشریف لائیں گے تو ہم مسلمان ہوں گے ، پھر رسول اللہ صلی اللہ علیہ وسلم مدینہ میں تشریف لائے اور آدھی قوم جو باقی تھی وہ بھی مسلمان ہو گئی اور ( قبیلہ ) اسلم کے لوگ آئے اور انہوں نے کہا کہ یا رسول اللہ! ہم بھی اپنے غفاری بھائیوں کی طرح مسلمان ہوتے ہیں تو وہ بھی مسلمان ہو گئے تب رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ غفار کو اللہ نے بخش دیا اور اسلم کو اللہ تعالیٰ نے بچا دیا ۔",
                "urduNarrator": "ہداب بن خالد ازدی نے کہا : ہمیں سلیمان بن مغیرہ نے حدیث بیان کی ، کہا : ہمیں حمید بن ہلال نے عبداللہ بن صامت سے خبر دی ، انھوں نے کہا ، کہ",
                "hadithArabic": "حَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ الْأَزْدِيُّ، حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، أَخْبَرَنَا حُمَيْدُ بْنُ هِلَالٍ، عَنْ عَبْدِ اللهِ بْنِ الصَّامِتِ، قَالَ: قَالَ أَبُو ذَرٍّ: خَرَجْنَا مِنْ قَوْمِنَا غِفَارٍ، وَكَانُوا يُحِلُّونَ الشَّهْرَ الْحَرَامَ، فَخَرَجْتُ أَنَا وَأَخِي أُنَيْسٌ وَأُمُّنَا، فَنَزَلْنَا عَلَى خَالٍ لَنَا، فَأَكْرَمَنَا خَالُنَا وَأَحْسَنَ إِلَيْنَا، فَحَسَدَنَا قَوْمُهُ فَقَالُوا: إِنَّكَ إِذَا خَرَجْتَ عَنْ أَهْلِكَ خَالَفَ إِلَيْهِمْ أُنَيْسٌ، فَجَاءَ خَالُنَا فَنَثَا عَلَيْنَا الَّذِي قِيلَ لَهُ، فَقُلْتُ: أَمَّا مَا مَضَى مِنْ مَعْرُوفِكَ فَقَدْ كَدَّرْتَهُ، وَلَا جِمَاعَ لَكَ فِيمَا بَعْدُ، فَقَرَّبْنَا صِرْمَتَنَا، فَاحْتَمَلْنَا عَلَيْهَا، وَتَغَطَّى خَالُنَا ثَوْبَهُ فَجَعَلَ يَبْكِي، فَانْطَلَقْنَا حَتَّى نَزَلْنَا بِحَضْرَةِ مَكَّةَ، فَنَافَرَ أُنَيْسٌ عَنْ صِرْمَتِنَا وَعَنْ مِثْلِهَا، فَأَتَيَا الْكَاهِنَ، فَخَيَّرَ أُنَيْسًا، فَأَتَانَا أُنَيْسٌ بِصِرْمَتِنَا وَمِثْلِهَا مَعَهَا [ص:1920]. قَالَ: وَقَدْ صَلَّيْتُ، يَا ابْنَ أَخِي قَبْلَ أَنْ أَلْقَى رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِثَلَاثِ سِنِينَ، قُلْتُ: لِمَنْ؟ قَالَ: لِلَّهِ، قُلْتُ: فَأَيْنَ تَوَجَّهُ؟ قَالَ: أَتَوَجَّهُ حَيْثُ يُوَجِّهُنِي رَبِّي، أُصَلِّي عِشَاءً حَتَّى إِذَا كَانَ مِنْ آخِرِ اللَّيْلِ أُلْقِيتُ كَأَنِّي خِفَاءٌ، حَتَّى تَعْلُوَنِي الشَّمْسُ. فَقَالَ أُنَيْسٌ: إِنَّ لِي حَاجَةً بِمَكَّةَ فَاكْفِنِي، فَانْطَلَقَ أُنَيْسٌ حَتَّى أَتَى مَكَّةَ، فَرَاثَ عَلَيَّ، ثُمَّ جَاءَ فَقُلْتُ: مَا صَنَعْتَ؟ قَالَ: لَقِيتُ رَجُلًا بِمَكَّةَ عَلَى دِينِكَ، يَزْعُمُ أَنَّ اللهَ أَرْسَلَهُ، قُلْتُ: فَمَا يَقُولُ النَّاسُ؟ قَالَ: يَقُولُونَ: شَاعِرٌ، كَاهِنٌ، سَاحِرٌ، وَكَانَ أُنَيْسٌ أَحَدَ الشُّعَرَاءِ. قَالَ أُنَيْسٌ: لَقَدْ سَمِعْتُ قَوْلَ الْكَهَنَةِ، فَمَا هُوَ بِقَوْلِهِمْ، وَلَقَدْ وَضَعْتُ قَوْلَهُ عَلَى أَقْرَاءِ الشِّعْرِ، فَمَا يَلْتَئِمُ عَلَى لِسَانِ أَحَدٍ بَعْدِي، أَنَّهُ شِعْرٌ، وَاللهِ إِنَّهُ لَصَادِقٌ، وَإِنَّهُمْ لَكَاذِبُونَ. قَالَ: قُلْتُ: فَاكْفِنِي حَتَّى أَذْهَبَ فَأَنْظُرَ، قَالَ فَأَتَيْتُ مَكَّةَ فَتَضَعَّفْتُ رَجُلًا مِنْهُمْ، فَقُلْتُ: أَيْنَ هَذَا الَّذِي تَدْعُونَهُ الصَّابِئَ؟ فَأَشَارَ إِلَيَّ، فَقَالَ: الصَّابِئَ، فَمَالَ عَلَيَّ أَهْلُ الْوَادِي بِكُلٍّ مَدَرَةٍ وَعَظْمٍ، حَتَّى خَرَرْتُ مَغْشِيًّا عَلَيَّ، قَالَ: فَارْتَفَعْتُ حِينَ ارْتَفَعْتُ، كَأَنِّي نُصُبٌ أَحْمَرُ، قَالَ: فَأَتَيْتُ زَمْزَمَ فَغَسَلْتُ عَنِّي الدِّمَاءَ: وَشَرِبْتُ مِنْ مَائِهَا، وَلَقَدْ لَبِثْتُ، يَا ابْنَ أَخِي ثَلَاثِينَ، بَيْنَ لَيْلَةٍ وَيَوْمٍ، مَا كَانَ لِي طَعَامٌ إِلَّا مَاءُ زَمْزَمَ، فَسَمِنْتُ حَتَّى تَكَسَّرَتْ عُكَنُ بَطْنِي، وَمَا وَجَدْتُ عَلَى كَبِدِي سُخْفَةَ جُوعٍ [ص:1921]. قَالَ فَبَيْنَا أَهْلِ مَكَّةَ فِي لَيْلَةٍ قَمْرَاءَ إِضْحِيَانٍ، إِذْ ضُرِبَ عَلَى أَسْمِخَتِهِمْ، فَمَا يَطُوفُ بِالْبَيْتِ أَحَدٌ. وَامْرَأَتَانِ مِنْهُمْ تَدْعُوَانِ إِسَافًا، وَنَائِلَةَ، قَالَ: فَأَتَتَا عَلَيَّ فِي طَوَافِهِمَا فَقُلْتُ: أَنْكِحَا أَحَدَهُمَا الْأُخْرَى، قَالَ: فَمَا تَنَاهَتَا عَنْ قَوْلِهِمَا قَالَ: فَأَتَتَا عَلَيَّ فَقُلْتُ: هَنٌ مِثْلُ الْخَشَبَةِ، غَيْرَ أَنِّي لَا أَكْنِي فَانْطَلَقَتَا تُوَلْوِلَانِ، وَتَقُولَانِ: لَوْ كَانَ هَاهُنَا أَحَدٌ مِنْ أَنْفَارِنَا قَالَ فَاسْتَقْبَلَهُمَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَأَبُو بَكْرٍ، وَهُمَا هَابِطَانِ، قَالَ: «مَا لَكُمَا؟» قَالَتَا: الصَّابِئُ بَيْنَ الْكَعْبَةِ وَأَسْتَارِهَا، قَالَ: «مَا قَالَ لَكُمَا؟» قَالَتَا: إِنَّهُ قَالَ لَنَا كَلِمَةً تَمْلَأُ الْفَمَ، وَجَاءَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حَتَّى اسْتَلَمَ الْحَجَرَ، وَطَافَ بِالْبَيْتِ هُوَ وَصَاحِبُهُ، ثُمَّ صَلَّى فَلَمَّا قَضَى صَلَاتَهُ - قَالَ أَبُو ذَرٍّ - فَكُنْتُ أَنَا أَوَّلَ مَنْ حَيَّاهُ بِتَحِيَّةِ الْإِسْلَامِ، قَالَ فَقُلْتُ: السَّلَامُ عَلَيْكَ يَا رَسُولَ اللهِ فَقَالَ: «وَعَلَيْكَ وَرَحْمَةُ اللهِ» ثُمَّ قَالَ «مَنْ أَنْتَ؟» قَالَ قُلْتُ: مِنْ غِفَارٍ، قَالَ: فَأَهْوَى بِيَدِهِ فَوَضَعَ أَصَابِعَهُ عَلَى جَبْهَتِهِ، فَقُلْتُ فِي نَفْسِي: كَرِهَ أَنِ انْتَمَيْتُ إِلَى غِفَارٍ، فَذَهَبْتُ آخُذُ بِيَدِهِ، فَقَدَعَنِي صَاحِبُهُ، وَكَانَ أَعْلَمَ بِهِ مِنِّي، ثُمَّ رَفَعَ رَأْسَهُ، ثُمَّ قَالَ: «مَتَى كُنْتَ هَاهُنَا؟» قَالَ قُلْتُ [ص:1922]: قَدْ كُنْتُ هَاهُنَا مُنْذُ ثَلَاثِينَ بَيْنَ لَيْلَةٍ وَيَوْمٍ، قَالَ: «فَمَنْ كَانَ يُطْعِمُكَ؟» قَالَ قُلْتُ: مَا كَانَ لِي طَعَامٌ إِلَّا مَاءُ زَمْزَمَ فَسَمِنْتُ حَتَّى تَكَسَّرَتْ عُكَنُ بَطْنِي، وَمَا أَجِدُ عَلَى كَبِدِي سُخْفَةَ جُوعٍ، قَالَ: «إِنَّهَا مُبَارَكَةٌ، إِنَّهَا طَعَامُ طُعْمٍ» فَقَالَ أَبُو بَكْرٍ: يَا رَسُولَ اللهِ ائْذَنْ لِي فِي طَعَامِهِ اللَّيْلَةَ، فَانْطَلَقَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَأَبُو بَكْرٍ، وَانْطَلَقْتُ مَعَهُمَا، فَفَتَحَ أَبُو بَكْرٍ بَابًا، فَجَعَلَ يَقْبِضُ لَنَا مِنْ زَبِيبِ الطَّائِفِ وَكَانَ ذَلِكَ أَوَّلَ طَعَامٍ أَكَلْتُهُ بِهَا، ثُمَّ غَبَرْتُ مَا غَبَرْتُ، ثُمَّ أَتَيْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «إِنَّهُ قَدْ وُجِّهَتْ لِي أَرْضٌ ذَاتُ نَخْلٍ، لَا أُرَاهَا إِلَّا يَثْرِبَ، فَهَلْ أَنْتَ مُبَلِّغٌ عَنِّي قَوْمَكَ؟ عَسَى اللهُ أَنْ يَنْفَعَهُمْ بِكَ وَيَأْجُرَكَ فِيهِمْ» فَأَتَيْتُ أُنَيْسًا فَقَالَ: مَا صَنَعْتَ؟ قُلْتُ: صَنَعْتُ أَنِّي قَدْ أَسْلَمْتُ وَصَدَّقْتُ، قَالَ: مَا بِي رَغْبَةٌ عَنْ دِينِكَ، فَإِنِّي قَدْ أَسْلَمْتُ وَصَدَّقْتُ، فَأَتَيْنَا أُمَّنَا، فَقَالَتْ: مَا بِي رَغْبَةٌ عَنْ دِينِكُمَا، فَإِنِّي قَدْ أَسْلَمْتُ وَصَدَّقْتُ، فَاحْتَمَلْنَا حَتَّى أَتَيْنَا قَوْمَنَا غِفَارًا، فَأَسْلَمَ نِصْفُهُمْ وَكَانَ يَؤُمُّهُمْ أَيْمَاءُ بْنُ رَحَضَةَ الْغِفَارِيُّ وَكَانَ سَيِّدَهُمْ. وَقَالَ نِصْفُهُمْ: إِذَا قَدِمَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ أَسْلَمْنَا، فَقَدِمَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ، فَأَسْلَمَ نِصْفُهُمُ الْبَاقِي وَجَاءَتْ أَسْلَمُ، فَقَالُوا: يَا رَسُولَ اللهِ إِخْوَتُنَا، نُسْلِمُ عَلَى الَّذِي أَسْلَمُوا عَلَيْهِ، فَأَسْلَمُوا، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «غِفَارُ غَفَرَ اللهُ لَهَا، وَأسْلَمُ سَالَمَهَا اللهُ».",
                "headingArabic": "مِنْ فَضَائِلِ أَبِي ذَرٍّ رضى الله عنه ‏‏",
                "headingUrdu": "ابوذر رضی اللہ عنہ کے فضائل",
                "headingEnglish": "The Virtues Of Abu Dharr (RA)",
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13923,
                "hadithNumber": "6360",
                "englishNarrator": "This hadith has been narrated on the authority of Humaid bin Hilal with the same chain of transmitters but with this addition:",
                "hadithEnglish": "As I came to Mecca, Unais said: (Well), go but be on your guard against the Meccans for they are his enemies and are annoyed with him.",
                "hadithUrdu": "اب میری طرف سے تو ( سب کام ) سنبھال تاکہ میں جاؤں اور دیکھوں ۔ کے بعد مزید یہ کہا : اس نے کہا : ہاں اور اہل مکہ سے محتاط رہنا کیونکہ وہ ان ( رسول اللہ صلی اللہ علیہ وسلم ) سے نفرت کرنے لگے ہیں اور بُری طرح پیش آتے ہیں ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم الحنظَلی نے بیان کیا،  ہمیں نضر بن شمیل نے خبر دی ، کہا : ہمیں سلیمان بن مغیرہ نے حدیث بیان کی ، کہا : ہمیں حمید بن ہلال نے اسی سند کے ساتھ روایت کی",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا النَّضْرُ بْنُ شُمَيْلٍ، حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، حَدَّثَنَا حُمَيْدُ بْنُ هِلَالٍ، بِهَذَا الْإِسْنَادِ، وَزَادَ بَعْدَ قَوْلِهِ - قُلْتُ فَاكْفِنِي حَتَّى أَذْهَبَ فَأَنْظُرَ - قَالَ: نَعَمْ، وَكُنْ عَلَى حَذَرٍ مِنْ أَهْلِ مَكَّةَ، فَإِنَّهُمْ قَدْ شَنِفُوا لَهُ وَتَجَهَّمُوا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13924,
                "hadithNumber": "6361",
                "englishNarrator": "Abdullah bin Samit reported that Abu Dharr رضی اللہ عنہ said:",
                "hadithEnglish": "Son of my brother, I used to observe prayer two years before the advent of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). I said: To which direction did you turn your face? He said: To which Allah directed me to turn my face. The rest of the hadith is the same but with this addition that they went to a Kahin and his brother Unais began to praise him until he (in verses declared) him (Unais) as winner (in the contest of poetry), and so we got his camels, mixed them with our camels, and there is in this hadith also these words that Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came there and he circumambulated the House and observed two Rak'ahs of prayer behind the Station (of Ibrahim). I came to him and I was the first amongst persons to greet him with Assalam-o-'Alaikum, and I said to Allah's Messenger Let there be peace upon you. And he said: Let there be peace upon you too; who are you? And in the hadith (these words are) also found: Since how long have you been here? And Abu Bakr رضی اللہ عنہ said: Let him be my guest tonight.",
                "hadithUrdu": "بھتیجے!میں نے نبی کریم صلی اللہ علیہ وسلم کی بعثت سے دو سال پہلے نماز پڑھی ہے ، کہا : میں نے پوچھا : آپ کس طرف رخ کیاکرتے تھے؟انھوں نے کہا : جس طرح اللہ تعالیٰ میرا رخ کردیتاتھا؟پھر ( ابن عون نے ) سلیمان بن مغیرہ کی حدیث کی طرح حدیث بیان کی اور حدیث میں یہ کہا : \" ان دونوں کا آپس میں مقابلہ کاہنوں میں سے ایک آدمی کے سامنے ہوا اور میرا بھائی انیس ( اشعار میں مسلسل ) اس ( کاہن ) کی مدح کرتا رہا یہاں تک کہ اس شخص پر غالب آگیا تو ہم نے اس کا گلہ بھی لے لیا اور اسے اپنے گلے میں شامل کرلیا ۔ انھوں نے اپنی حدیث میں یہ بھی کہا : ( ابوزر رضی اللہ تعالیٰ عنہ نے ) کہا : تو رسول اللہ صلی اللہ علیہ وسلم تشریف لے آئے ، بیت اللہ کاطواف کیا اور مقام ابراہیم کے پیچھے دو رکعتیں ادا کیں ۔ کہا : تو میں آپ کی خدمت میں حاضر ہوا اور میں پہلا شخص ہوں جس نے آپ کو اسلامی طریقے سے سلام کیا ۔ تو کہا : میں نے کہا : اللہ کے رسول صلی اللہ علیہ وسلم !آپ پر سلامتی ہو!آپ صلی اللہ علیہ وسلم نے فرمایا؛ \" اورتم پر بھی سلامتی ہو!تم کون ہو؟اور ان کی حدیث میں یہ بھی ہے : آپ نے پوچھا : \" تم کتنے دنوں سے یہاں ہو؟ \" کہا : میں نے عرض کی : پندرہ دن سے ، اور اس میں یہ ( بھی ) ہے کہ کہا : ابو بکر رضی اللہ عنہ نے کہا : اس کی آج رات کی میزبانی بطور تحفہ مجھے عطا کردیجئے ۔",
                "urduNarrator": "ہم سے محمد بن المثنی  العنزی نے بیان کیا، کہا کہ مجھ سے ابن ابی عدی نے بیان کیا، انہوں نے کہا: ابن عون نے حمید بن ہلال سے ، انھوں نے عبداللہ بن صامت سے روایت کی ، کہا : حضرت ابوزر رضی اللہ عنہ نےکہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى الْعَنَزِيُّ، حَدَّثَنِي ابْنُ أَبِي عَدِيٍّ، قَالَ: أَنْبَأَنَا ابْنُ عَوْنٍ، عَنْ حُمَيْدِ بْنِ هِلَالٍ، عَنْ عَبْدِ اللهِ بْنِ الصَّامِتِ، قَالَ: قَالَ أَبُو ذَرٍّ: يَا ابْنَ أَخِي صَلَّيْتُ سَنَتَيْنِ قَبْلَ مَبْعَثِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: قُلْتُ: فَأَيْنَ كُنْتَ تَوَجَّهُ؟ قَالَ: حَيْثُ وَجَّهَنِيَ اللهُ، وَاقْتَصَّ الْحَدِيثَ بِنَحْوِ حَدِيثِ سُلَيْمَانَ بْنِ الْمُغِيرَةِ، وَقَالَ فِي الْحَدِيثِ: فَتَنَافَرَا إِلَى رَجُلٍ مِنَ الْكُهَّانِ، قَالَ: فَلَمْ يَزَلْ أَخِي، أُنَيْسٌ يَمْدَحُهُ حَتَّى غَلَبَهُ، قَالَ: فَأَخَذْنَا صِرْمَتَهُ فَضَمَمْنَاهَا إِلَى صِرْمَتِنَا، وَقَالَ أَيْضًا فِي حَدِيثِهِ: قَالَ فَجَاءَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَطَافَ بِالْبَيْتِ وَصَلَّى رَكْعَتَيْنِ خَلْفَ الْمَقَامِ، قَالَ فَأَتَيْتُهُ، فَإِنِّي لَأَوَّلُ النَّاسِ حَيَّاهُ بِتَحِيَّةِ الْإِسْلَامِ، قَالَ قُلْتُ: السَّلَامُ عَلَيْكَ يَا رَسُولَ اللهِ قَالَ «وَعَلَيْكَ السَّلَامُ. مَنْ أَنْتَ» وَفِي حَدِيثِهِ أَيْضًا: فَقَالَ: «مُنْذُ كَمْ أَنْتَ هَاهُنَا؟» قَالَ قُلْتُ: مُنْذُ خَمْسَ عَشْرَةَ، وَفِيهِ: فَقَالَ أَبُو بَكْرٍ: أَتْحِفْنِي بِضِيَافَتِهِ اللَّيْلَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13925,
                "hadithNumber": "6362",
                "englishNarrator": "Ibn `Abbas رضی اللہ عنہ reported:",
                "hadithEnglish": "When Abu Dharr رضی اللہ عنہ heard of the advent of the Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) in Mecca he said: Brother, ride in this valley and bring information for me about the person who claims that there comes to him information from the Heavens. Listen to his words and then come to me. So he rode on until he came to Mecca and he heard his words (the sacred words of the Holy Prophet) and then came back to Abu Dharr رضی اللہ عنہ and said: I have seen him exhorting (people) to develop good morals and his expressions can in no way be termed as poetry. He (Abu Dharr رضی اللہ عنہ ) said: I have not been satisfied with it regarding that which I had in my mind (as I sent you). So he took up provisions for the journey and a small water-skin containing water (and set forth) until he came to Mecca. He came to the mosque (Ka`bah) and began to look for Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and he did not recognize him (the Holy Prophet) and he did not even like that he should ask about him from anyone until it was night, and he slept. `Ali رضی اللہ عنہ saw him and found him to be a stranger. So he went with him. He followed him but one did not make any inquiry from the other about anything until it was morning. He then brought the water and his provisions to the mosque and spent a day there, but he did not see Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) until it was night. He then returned to his bed, and there happened to pass `Ali رضی اللہ عنہ and he said: This man has not been able to find his destination until this time. He made him stand and he went with him and no one made an inquiry from his companion about anything. And when it was the third day he did the same. `Ali رضی اللہ عنہ made him stand up and brought him along with him. He said: By Him, besides Whom there is no god, why don't you tell me (the reason) which brought you here to this town? He said: (I shall do this) provided you hold me promise and a covenant that you would guide me aright. He then did that. He (`Ali رضی اللہ عنہ) said: Verily, he is truthful and he is a Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and when it is morning, follow me and if I would say anything from which I would sense fear about you I would stand (in a manner) as if I was throwing water and if I move on, you then follow me until I get in (some house). He did that and I followed him until he came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). He entered (the house) of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) along with him and listened to his words and embraced Islam at this very place. Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said to him: Go to your people and inform them until my command reaches you. Thereupon he said: By Him in Whose Hand is my life, I shall say to the people of Mecca this thing at the top of my voice. So he set forth until he came to the mosque and then spoke at the top of his voice (saying): I bear testimony to the fact that there is no god but Allah and that Muhammad is the Messenger of Allah. The people attacked him and made him fall down when al-`Abbas came and he leaned over him and said: Woe be upon you, don't you know that he is from amongst the tribe of Ghifar and your trading route to Syria passes through (the settlements of this tribe), and he rescued him. He (Abu Dharr رضی اللہ عنہ) did the same on the next day and they (the Meccans) again attacked him and al-`Abbas رضی اللہ عنہ leaned upon him and he rescued him.",
                "hadithUrdu": "جب سیدنا ابوذر رضی اللہ عنہ کو رسول اللہ صلی اللہ علیہ وسلم کے مکہ میں مبعوث ہونے کی خبر پہنچی تو انہوں نے اپنے بھائی سے کہا کہ سوار ہو کر اس وادی کو جا اور اس شخص کو دیکھ کر آ جو کہتا ہے مجھے آسمان سے خبر آتی ہے ، ان کی بات سن پھر میرے پاس آ ۔ وہ روانہ ہوا ، یہاں تک کہ مکہ میں آیا اور آپ صلی اللہ علیہ وسلم کا کلام سنا ، پھر سیدنا ابوذر رضی اللہ عنہ کے پاس لوٹ کر گیا اور بولا کہ میں نے اس شخص کو دیکھا ، وہ اچھی خصلتوں کا حکم کرتا ہے اور ایک کلام سناتا ہے جو شعر نہیں ہے ۔ سیدنا ابوذر رضی اللہ عنہ نے کہا کہ مجھے اس سے تسلی نہیں ہوئی ۔ پھر انہوں نے خود زادراہ لیا اور پانی کی ایک مشک لی یہاں تک کہ مکہ میں آئے اور مسجدالحرام میں داخل ہوئے ۔ وہاں رسول اللہ صلی اللہ علیہ وسلم کو ڈھونڈا اور وہ آپ صلی اللہ علیہ وسلم کو پہچانتے نہ تھے اور انہوں نے پوچھنا بھی مناسب نہ جانا ، یہاں تک کہ رات ہو گئی اور وہ لیٹ رہے ۔ سیدنا علی رضی اللہ عنہ نے ان کو دیکھا اور پہچانا کہ کوئی مسافر ہے پھر ان کے پیچھے گئے لیکن کسی نے دوسرے سے بات نہیں کی یہاں تک کہ صبح ہو گئی ۔ پھر وہ اپنا توشہ اور مشک مسجد میں اٹھا لائے اور سارا دن وہاں رہے اور رسول اللہ صلی اللہ علیہ وسلم کو شام تک نہ دیکھا ۔ پھر وہ اپنے سونے کی جگہ میں چلے گئے ۔ وہاں سے سیدنا علی رضی اللہ عنہ گزرے اور کہا کہ ابھی وہ وقت نہیں آیا کہ اس شخص کو اپنا ٹھکانہ معلوم ہو ۔ پھر ان کو کھڑا کیا اور ان کو ساتھ لے گئے لیکن کسی نے دوسرے سے بات نہ کی ۔ پھر تیسرے دن بھی ایسا ہی ہوا ۔ اور سیدنا علی رضی اللہ عنہ نے ان کو اپنے ساتھ کھڑا کیا ، پھر کہا کہ تم مجھ سے وہ بات کیوں نہیں کہتے جس کے لئے تم اس شہر میں آئے ہو؟ سیدنا ابوذر رضی اللہ عنہ نے کہا کہ اگر تم مجھ سے عہد اور وعدہ کرتے ہو کہ راہ بتلاؤ گے تو میں بتاتا ہوں ۔ سیدنا علی رضی اللہ عنہ نے وعدہ کیا تو انہوں نے بتایا ۔ سیدنا علی رضی اللہ عنہ نے کہا کہ وہ شخص سچے ہیں اور وہ بیشک اللہ تعالیٰ کے رسول ہیں اور تم صبح کو میرے ساتھ چلنا ، اگر میں کوئی خوف کی بات دیکھوں گا جس میں تمہاری جان کا ڈر ہو تو میں کھڑا ہو جاؤں گا جیسے کوئی پانی بہاتا ہے ( یعنی پیشاب کا بہانہ کروں گا ) اور اگر چلا جاؤں تو تم بھی میرے پیچھے پیچھے چلے آنا ۔ جہاں میں گھسوں وہاں تم بھی گھس آنا ۔ سیدنا ابوذر رضی اللہ عنہ نے ایسا ہی کیا اور ان کے پیچھے پیچھے چلے یہاں تک کہ سیدنا علی رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم کے پاس پہنچے اور سیدنا ابوذر رضی اللہ عنہ بھی ان کے ساتھ پہنچے ۔ پھر سیدنا ابوذر رضی اللہ عنہ نے آپ صلی اللہ علیہ وسلم کی باتیں سنیں اور اسی جگہ مسلمان ہوئے اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اپنی قوم کے پاس جا اور ان کو دین کی خبر کر یہاں تک کہ میرا حکم تجھے پہنچے ۔ سیدنا ابوذر رضی اللہ عنہ نے کہا کہ قسم اس کی جس کے ہاتھ میں میری جان ہے کہ میں تو یہ بات ( یعنی دین قبول کرنے کی ) مکہ والوں کو پکار کر سنا دوں گا ۔ پھر سیدنا ابوذر رضی اللہ عنہ نکل کر مسجد میں آئے اور چلا کر بولے کہ ”میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود برحق نہیں ہے اور محمد صلی اللہ علیہ وسلم اللہ کے سچے رسول ہیں“ ۔ لوگوں نے ان پر حملہ کیا اور ان کو مارتے مارتے لٹا دیا ۔ سیدنا عباس رضی اللہ عنہ وہاں آئے اور سیدنا ابوذر رضی اللہ عنہ پر جھکے اور لوگوں سے کہا کہ تمہای خرابی ہو ، تم نہیں جانتے کہ یہ شخص ( قوم ) غفار کا ہے اور تمہارا سوداگری کا راستہ شام کی طرف ( قوم ) غفار کے ملک پر سے ہے ( تو وہ تمہاری تجارت بند کر دیں گے ) ۔ پھر سیدنا ابوذر رضی اللہ عنہ کو ان لوگوں سے چھڑا لیا ۔ سیدنا ابوذر رضی اللہ عنہ نے دوسرے دن پھر ویسا ہی کیا اور لوگ دوڑے اور مارا اور سیدنا عباس رضی اللہ عنہ آئے اور انہیں چھڑا لیا ۔",
                "urduNarrator": "مجھ سے ابراہیم بن محمد بن عرعرہ السامی اور محمد بن حاتم نے بیان کیا - اور وہ حدیث کے ضمن میں قریب آئے، اور الفاظ ابن حاتم کا ہے - انہوں نے کہا: ہمیں بتاؤ؟ ہم سے عبدالرحمٰن بن مہدی، المثنیٰ بن سعید نے بیان کیا، ابو جمرہ نے حضرت ابن عباس رضی اللہ عنہ سے روایت کی ، کہا : کہ",
                "hadithArabic": "وحَدَّثَنِي إِبْرَاهِيمُ بْنُ مُحَمَّدِ بْنِ عَرْعَرَةَ السَّامِيُّ، وَمُحَمَّدُ بْنُ حَاتِمٍ - وَتَقَارَبَا فِي سِيَاقِ الْحَدِيثِ، وَاللَّفْظُ لِابْنِ حَاتِمٍ - قَالَا: حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا الْمُثَنَّى بْنُ سَعِيدٍ، عَنْ أَبِي جَمْرَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ: لَمَّا بَلَغَ أَبَا ذَرٍّ مَبْعَثُ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمَكَّةَ قَالَ لِأَخِيهِ: ارْكَبْ إِلَى هَذَا الْوَادِي، فَاعْلَمْ لِي عِلْمَ هَذَا الرَّجُلِ الَّذِي يَزْعُمُ أَنَّهُ يَأْتِيهِ الْخَبَرُ مِنَ السَّمَاءِ، فَاسْمَعْ مِنْ قَوْلِهِ ثُمَّ ائْتِنِي، فَانْطَلَقَ الْآخَرُ حَتَّى قَدِمَ مَكَّةَ، وَسَمِعَ مِنْ قَوْلِهِ، ثُمَّ رَجَعَ إِلَى أَبِي ذَرٍّ فَقَالَ: رَأَيْتُهُ يَأْمُرُ بِمَكَارِمِ الْأَخْلَاقِ [ص:1924]، وَكَلَامًا مَا هُوَ بِالشِّعْرِ، فَقَالَ: مَا شَفَيْتَنِي فِيمَا أَرَدْتُ فَتَزَوَّدَ وَحَمَلَ شَنَّةً لَهُ، فِيهَا مَاءٌ حَتَّى قَدِمَ مَكَّةَ، فَأَتَى الْمَسْجِدَ فَالْتَمَسَ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَلَا يَعْرِفُهُ، وَكَرِهَ أَنْ يَسْأَلَ عَنْهُ، حَتَّى أَدْرَكَهُ - يَعْنِي اللَّيْلَ - فَاضْطَجَعَ، فَرَآهُ عَلِيٌّ فَعَرَفَ أَنَّهُ غَرِيبٌ، فَلَمَّا رَآهُ تَبِعَهُ، فَلَمْ يَسْأَلْ وَاحِدٌ مِنْهُمَا صَاحِبَهُ عَنْ شَيْءٍ، حَتَّى أَصْبَحَ، ثُمَّ احْتَمَلَ قِرْبَتَهُ وَزَادَهُ إِلَى الْمَسْجِدِ، فَظَلَّ ذَلِكَ الْيَوْمَ، وَلَا يَرَى النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، حَتَّى أَمْسَى، فَعَادَ إِلَى مَضْجَعِهِ، فَمَرَّ بِهِ عَلِيٌّ، فَقَالَ: مَا آنَ لِلرَّجُلِ أَنْ يَعْلَمَ مَنْزِلَهُ؟ فَأَقَامَهُ، فَذَهَبَ بِهِ مَعَهُ، وَلَا يَسْأَلُ وَاحِدٌ مِنْهُمَا صَاحِبَهُ عَنْ شَيْءٍ، حَتَّى إِذَا كَانَ يَوْمُ الثَّالِثِ فَعَلَ مِثْلَ ذَلِكَ، فَأَقَامَهُ عَلِيٌّ مَعَهُ، ثُمَّ قَالَ لَهُ: أَلَا تُحَدِّثُنِي؟ مَا الَّذِي أَقْدَمَكَ هَذَا الْبَلَدَ؟ قَالَ: إِنْ أَعْطَيْتَنِي عَهْدًا وَمِيثَاقًا لَتُرْشِدَنِّي، فَعَلْتُ، فَفَعَلَ. فَأَخْبَرَهُ فَقَالَ: فَإِنَّهُ حَقٌّ وَهُوَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَإِذَا أَصْبَحْتَ فَاتَّبِعْنِي، فَإِنِّي إِنْ رَأَيْتُ شَيْئًا أَخَافُ عَلَيْكَ، قُمْتُ كَأَنِّي أُرِيقُ الْمَاءَ، فَإِنْ مَضَيْتُ فَاتَّبِعْنِي حَتَّى تَدْخُلَ مَدْخَلِي، فَفَعَلَ، فَانْطَلَقَ يَقْفُوهُ، حَتَّى دَخَلَ عَلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَدَخَلَ مَعَهُ، فَسَمِعَ مِنْ قَوْلِهِ، وَأَسْلَمَ مَكَانَهُ، فَقَالَ لَهُ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «ارْجِعْ إِلَى قَوْمِكَ فَأَخْبِرْهُمْ حَتَّى يَأْتِيَكَ أَمْرِي» فَقَالَ: وَالَّذِي نَفْسِي بِيَدِهِ لَأَصْرُخَنَّ بِهَا بَيْنَ ظَهْرَانَيْهِمْ فَخَرَجَ حَتَّى أَتَى الْمَسْجِدَ، فَنَادَى بِأَعْلَى صَوْتِهِ: أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللهُ، وَأَنَّ مُحَمَّدًا رَسُولُ اللهِ، وَثَارَ الْقَوْمُ فَضَرَبُوهُ حَتَّى أَضْجَعُوهُ، فَأَتَى الْعَبَّاسُ فَأَكَبَّ عَلَيْهِ، فَقَالَ: وَيْلَكُمْ أَلَسْتُمْ تَعْلَمُونَ أَنَّهُ مِنْ غِفَارٍ، وَأَنَّ طَرِيقَ تُجَّارِكُمْ إِلَى الشَّامِ عَلَيْهِمْ، فَأَنْقَذَهُ مِنْهُمْ، ثُمَّ عَادَ مِنَ الْغَدِ بِمِثْلِهَا، وَثَارُوا إِلَيْهِ فَضَرَبُوهُ، فَأَكَبَّ عَلَيْهِ الْعَبَّاسُ فَأَنْقَذَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13926,
                "hadithNumber": "6363",
                "englishNarrator": "Jarir bin 'Abdullah رضی اللہ عنہ said:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) never refused me permission to see him since I embraced Islam and never looked at me but with a smile.",
                "hadithUrdu": "میں نے جب سے اسلام قبول کیا ۔ رسول اللہ صلی اللہ علیہ وسلم نے مجھے کبھی اپنے حجرے سے باہر نہیں روکا اور آپ نے جب بھی مجھے دیکھا آپ ہنس دیے ۔",
                "urduNarrator": "یحییٰ بن یحییٰ تمیمی اور عبد الحمید بن بیان واسطی نے خالد بن عبد اللہ سے ، انھوں نے بیان سے روایت کی ، کہا : میں نے قیس بن ابی حازم رضی اللہ تعالیٰ عنہ کو یہ کہتے ہو ئے سنا ، حضرت جریر بن عبد اللہ رضی اللہ عنہ نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللهِ، عَنْ بَيَانٍ، عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ، عَنْ جَرِيرِ بْنِ عَبْدِ اللهِ، ح وحَدَّثَنِي عَبْدُ الْحَمِيدِ بْنُ بَيَانٍ، حَدَّثَنَا خَالِدٌ، عَنْ بَيانٍ، قَالَ: سَمِعْتُ قَيْسَ بْنَ أَبِي حَازِمٍ، يَقُولُ: قَالَ جَرِيرُ بْنُ عَبْدِ اللهِ «مَا حَجَبَنِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مُنْذُ أَسْلَمْتُ وَلَا رَآنِي إِلَّا ضَحِكَ».",
                "headingArabic": "مِنْ فَضَائِلِ جَرِيرِ بْنِ عَبْدِ اللَّهِ رضى الله تعالى عنه ‏‏",
                "headingUrdu": "جریر بن عبداللہ رضی اللہ عنہ کے فضائل",
                "headingEnglish": "The Virtues Of Jarir Bin 'Abdullah (RA)",
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13927,
                "hadithNumber": "6364",
                "englishNarrator": "Jarir رضی اللہ عنہ reported:",
                "hadithEnglish": "Since I embraced Islam Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) never refused to see me and he did not see me but with a smile on his face. Ibn Numair has made this addition to this hadith which has been reported on the authority of Ibn Idris that he (Jarir) made this complaint to him (to the Holy Prophet): I cannot sit upon the horse with firmness, whereupon he (Allah's Apostle) struck his chest with his hand and prayed: O Allah, make him steadfast and rightly-guided.",
                "hadithUrdu": "جب سے میں اسلام لا یا ہوں رسول اللہ صلی اللہ علیہ وسلم نے مجھے کبھی گھر سے باہر نہیں رو کا اور آپ نے کبھی مجھے نہیں مگر آپ ہمیشہ میرے سامنے مسکرا ئے ہیں ۔ ابن نمیر نے ابن ادریس سے اپنی روایت میں مزید یہ کہا : میں نے آپ سے شکا یت کی کہ میں گھوڑےپر جم کر نہیں بیٹھ سکتا تو آپ نے میرے سینے پر اپنا ہاتھ مارا اور فر ما یا : \" اے اللہ!اسے ثبات ( مضبوطی ) عطا کر اور اسے ہدایت پہنچانے والاہدایت پا نے والابنا دے ۔",
                "urduNarrator": "بو بکربن ابی شیبہ نے کہا : ہمیں وکیع اور ابو اسامہ نے اسماعیل سے حدیث بیان کی ، نیز ابن نمیر نے کہا : ہمیں عبد اللہ بن ادریس نے حدیث بیان کی ، کہا : ہمیں اسماعیل نے قیس سے حدیث بیان کی ، انھوں نے حضرت جریر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، وَأَبُو أُسَامَةَ، عَنْ إِسْمَاعِيلَ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا عَبْدُ اللهِ بْنُ إِدْرِيسَ، حَدَّثَنَا إِسْمَاعِيلُ، عَنْ قَيْسٍ، عَنْ جَرِيرٍ، قَالَ: مَا حَجَبَنِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مُنْذُ أَسْلَمْتُ، وَلَا رَآنِي إِلَّا تَبَسَّمَ فِي وَجْهِي. زَادَ ابْنُ نُمَيْرٍ، فِي حَدِيثِهِ عَنِ ابْنِ إِدْرِيسَ: وَلَقَدْ شَكَوْتُ إِلَيْهِ أَنِّي لَا أَثْبُتُ عَلَى الْخَيْلِ، فَضَرَبَ بِيَدِهِ فِي صَدْرِي وَقَالَ: «اللهُمَّ ثَبِّتْهُ وَاجْعَلْهُ هَادِيًا مَهْدِيًّا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13928,
                "hadithNumber": "6365",
                "englishNarrator": "Jarir رضی اللہ عنہ reported:",
                "hadithEnglish": "There was in pre-Islamic days a temple called Dhu'l- Khalasah and it was called the Yamanite Ka'ba or the northern Ka'ba. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said unto me: Will you rid me of Dhu'l-Khalasah and so I went forth at the head of 350 horsemen of the tribe of Ahmas and we destroyed it and killed whomsoever we found there. Then we came back to him (to the Holy Prophet) and informed him and he blessed us and the tribe of Ahmas.",
                "hadithUrdu": "زمانہ جاہلیت میں ایک عبادت گاہ تھی جس کو ذوالخلصہ کہتے تھے اور اس کو کعبہ یمانیہ اور کعبہ شامیہ بھی کہا جا تا تھا رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فرما یا : \" کیا تم مجھے ذوالخلصہ کعبہ یمانیہ اور کعبہ شامیہ کی اذیت سے راحت دلا ؤ گے؟ \" تو میں قبیلہ احمس کے ڈیڑھ سو جوانوں کے ساتھ اس کی طرف گیا ۔ ہم نے اس بت خانے کو تو ڑ دیا اور جن لو گوں کو وہاں پا یا ان سب کو قتل کر دیا پھر میں آپ کی خدمت میں حاضر ہوا اور آپ کو خبر سنائی تو آپ نے ہمارے لیے اور ( پورے ) قبیلہ احمس کے لیے دعا فر ما ئی ۔",
                "urduNarrator": "عبد الحمید بن بیان نے کہا : ہمیں خ رحمۃ اللہ علیہ الد نے بیان سے خبر دی ، انھوں نے قیس سے ، انھوں نے حضرت جریر رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنِي عَبْدُ الحَمِيدِ بْنُ بَيَانٍ، أَخْبَرَنَا خَالِدٌ، عَنْ بَيَانٍ، عَنْ قَيْسٍ، عَنْ جَرِيرٍ، قَالَ: كَانَ فِي الْجَاهِلِيَّةِ بَيْتٌ يُقَالُ لَهُ ذُو الْخَلَصَةِ، وَكَانَ يُقَالُ لَهُ الْكَعْبَةُ الْيَمَانِيَةُ، وَالْكَعْبَةُ الشَّامِيَّةُ فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «هَلْ أَنْتَ مُرِيحِي مِنْ ذِي الْخَلَصَةِ، وَالْكَعْبَةِ الْيَمَانِيَةِ وَالشَّامِيَّةِ؟» فَنَفَرْتُ إِلَيْهِ فِي مِائَةٍ وَخَمْسِينَ مِنْ أَحْمَسَ، فَكَسَرْنَاهُ وَقَتَلْنَا مَنْ وَجَدْنَا عِنْدَهُ، فَأَتَيْتُهُ فَأَخْبَرْتُهُ، قَالَ: «فَدَعَا لَنَا وَلِأَحْمَسَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13929,
                "hadithNumber": "6366",
                "englishNarrator": "Jarir bin 'Abdullah al-Bajali رضی اللہ عنہ said:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to me: Can't on rid me of Dhu'I-Khalasah, the idol-house of Khath'am, and this idol-house was called the Yamanite Ka'ba. So I went along with 150 horsemen and I could not sit with steadfastness upon the horse. I made the mention of it to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and he struck his hand on my chest and said: O Allah, grant him steadfastness and make him the guide of righteousness and the rightly-guided one. So he went away and he set fire to it. Then Jarir رضی اللہ عنہ sent some person to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) whose Kunya was Abu Arta to give him the happy news about that. He came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and said: I have not come to you (but with the news) that we have left Dhu'l-Khalasah as a scabed camel. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) blessed the horses of Ahmas and the men of their tribe five times.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فر ما یا : \" جریر!کیا تم مجھے ذوالخلصہ سے راحت نہیں دلا ؤ گے؟ \" یہ خثعم کا بت خانہ تھا جسے کعبہ یمانیہ بھی کہا جا تا تھا ۔ حضرت جریر رضی اللہ تعالیٰ عنہ نے کہا : پھر میں ڈیڑھ سو گھڑسوار لے کر اس کی طرف روانہ ہوا اور میں گھوڑے پر جم کر نہیں بیٹھ سکتا تھا ، میں نے رسول اللہ صلی اللہ علیہ وسلم سے یہ بات عرض کی تو آپ نے میرے سینے پر اپنا مبارک ہاتھ مارا اور دعا فر ما یا : \" اے اللہ !اس کو ( گھوڑے پر ) جماد ے اور اسے ہدایت پہنچانے والا ہدایت پانے والا بنادے ۔ \" ( قیس بن ابی حازم نے ) کہا؛ پھر وہ روانہ ہو ئے اور اس بت خانے کو آگ لگا کر جلا دیا ، پھر حضرت جریر رضی اللہ عنہ نے ایک شخص کو رسول اللہ صلی اللہ علیہ وسلم کے پاس خوشخبری دینے کے لیے روانہ کیا ۔ اس کی کنیت ابوار طاۃ تھی وہ رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور آپ سے عرض کی ، میں آپ کے پاس اسی وقت حاضر ہوا ہوں جب ہم نے اس ( بت خانے ) کو خارش زدہ اونٹ کی طرح ( دیکھنے میں مکروہ ٹوٹا پھوٹا ) کر چھوڑا ہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے قبیلہ احمس کے سواروں اور پیا دوں کے لیے پانچ مرتبہ برکت کی دعا فر ما ئی ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا, جریر نے اسماعیل بن ابی خالد سے انھوں نے قیس بن ابی حازم سے ، انھوں نے حضرت جریر بن عبد اللہ بجلی رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ، عَنْ جَرِيرِ بْنِ عَبْدِ اللهِ الْبَجَلِيِّ، قَالَ: قَالَ لِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «يَا جَرِيرُ أَلَا تُرِيحُنِي مِنْ ذِي الْخَلَصَةِ» بَيْتٍ لِخَثْعَمَ كَانَ يُدْعَى كَعْبَةَ الْيَمَانِيَةِ، قَالَ: فَنَفَرْتُ فِي خَمْسِينَ وَمِائَةِ فَارِسٍ، وَكُنْتُ لَا أَثْبُتُ عَلَى الْخَيْلِ، فَذَكَرْتُ ذَلِكَ لِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَضَرَبَ يَدَهُ فِي صَدْرِي فَقَالَ: «اللهُمَّ ثَبِّتْهُ، وَاجْعَلْهُ هَادِيًا مَهْدِيًّا» قَالَ: فَانْطَلَقَ فَحَرَّقَهَا بِالنَّارِ، ثُمَّ بَعَثَ جَرِيرٌ إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، رَجُلًا يُبَشِّرُهُ يُكْنَى أَبَا أَرْطَاةَ مِنَّا، فَأَتَى رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَهُ: مَا جِئْتُكَ حَتَّى تَرَكْنَاهَا كَأَنَّهَا جَمَلٌ أَجْرَبُ، فَبَرَّكَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، عَلَى خَيْلِ أَحْمَسَ، وَرِجَالِهَا خَمْسَ مَرَّاتٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13930,
                "hadithNumber": "6367",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Ismail with different chains of transmitters and in the hadith transmitted on the authority of Marwan (the words are): A person giving the glad tidings on behalf of Jarir رضی اللہ عنہ came or Abu Husain bin Rabi`a رضی اللہ عنہ came in order to give glad tidings to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌).",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, وکیع عبد اللہ بن نمیر ، سفیان ، مروان فرازی اور ابو اسامہ سب نے اسماعیل سے اسی سند کے ساتھ روایت کی ، اور مروان کی حدیث میں کہا : تو حضرت جریر رضی اللہ عنہ کی طرف سے خوش خبری دینے والے ابو ارطاۃ حصین بن ربیعہ رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم کو خوش خبری دینے والے کے لیے آئے ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبَّادٍ، حَدَّثَنَا سُفْيَانُ، ح وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا مَرْوَانُ يَعْنِي الْفَزَارِيَّ، ح وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا أَبُو أُسَامَةَ كُلُّهُمْ، عَنْ إِسْمَاعِيلَ، بِهَذَا الْإِسْنَادِ، وَقَالَ فِي حَدِيثِ مَرْوَانَ: فَجَاءَ بَشِيرُ جَرِيرٍ أَبُو أَرْطَاةَ حُصَيْنُ بْنُ رَبِيعَةَ، يُبَشِّرُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13931,
                "hadithNumber": "6368",
                "englishNarrator": "Ibn 'Abbas رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came to privy and I placed for him water for ablution, When he came out he said: Who placed it here? And in a version of Zuhair they (the Companions) said, and in the version of Abu Bakr (the words are): I said: It is Ibn 'Abbas  رضی اللہ عنہ (who has done that), whereupon he (the Holy Prophet) said: May Allah grant him deep understanding of religion.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم باہر ( انسانوں سے ) خالی علاقے میں تشریف لے گئے میں نے ( اس دورا ن میں ) آپ کے لیے وضوکا پا نی رکھ دیا ۔ جب آپ آئے تو آپ نے پو چھا : \" یہ پانی کس نے رکھا ہے ۔ ؟ ۔ ۔ ۔ زہیر کی روایت میں ہے ۔ لوگوں نے کہا : اور ابوبکر کی روایت میں ہے ۔ میں نے کہا ۔ ۔ ۔ ابن عباس رضی اللہ عنہ نے ۔ آپ نے فر ما یا : \" اے اللہ !اسے دین کا گہرا فہم عطا کر ۔",
                "urduNarrator": "زہیر بن حرب اور ابو بکر بن نضر نے کہا : ہمیں ہاشم بن قاسم نے حدیث بیان کی ، کہا : ہمیں ورقا ء بن عمر یشکری نے حدیث سنائی ، انھوں نے کہا : میں نے عبید اللہ بن ابی یزید رضی اللہ عنہ کو حضرت عبد اللہ بن عباس رضی اللہ عنہ سے روایت کرتے ہو ئے سنا",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَأَبُو بَكْرِ بْنُ النَّضْرِ قَالَا: حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، حَدَّثَنَا وَرْقَاءُ بْنُ عُمَرَ الْيَشْكُرِيُّ، قَالَ: سَمِعْتُ عُبَيْدَ اللهِ بْنَ أَبِي يَزِيدَ، يُحَدِّثُ عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، أَتَى الْخَلَاءَ فَوَضَعْتُ لَهُ وَضُوءًا، فَلَمَّا خَرَجَ قَالَ: «مَنْ وَضَعَ هَذَا؟» - فِي رِوَايَةِ زُهَيْرٍ قَالُوا: وَفِي رِوَايَةِ أَبِي بَكْرٍ - قُلْتُ: ابْنُ عَبَّاسٍ قَالَ: «اللهُمَّ فَقِّهْهُ».",
                "headingArabic": "فَضَائِلِ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ رضى الله عنهما ‏‏",
                "headingUrdu": "حضرت عبداللہ بن عباس رضی اللہ عنہ کے فضائل",
                "headingEnglish": "The Virtues Of 'Abdullah Bin 'Abbas (RA)",
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13932,
                "hadithNumber": "6369",
                "englishNarrator": "Ibn 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "I saw in a state of sleep as if I have in my hand a piece of silk cloth and there is no place in the Paradise where I intend to reach but that piece of cloth does not fly towards it. I made a mention of it to Hafsa (the sister of Ibn 'Umar) and Hafsa made a mention of it to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), whereupon Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: I find 'Abdullah b 'Umar a pious person.",
                "hadithUrdu": "میں نے خواب میں دیکھا کہ میرے ہاتھ میں باریک ریشم کا ایک ٹکڑا ہے اور جنت میں کو ئی بھی جگہ جہاں میں جا نا چاہ رہا ہوں ، وہ مجھے اڑا کر وہاں لے جا تا ہے ۔ کہا : میں نے یہ خواب حضرت حفصہ رضی اللہ تعالیٰ عنہا کو بتا یا حضرت حفصہ رضی اللہ تعالیٰ عنہا نے نبی صلی اللہ علیہ وسلم سے بیان کیا تو نبی صلی اللہ علیہ وسلم نے فر ما یا : \" میں عبد اللہ ( ابن عمر ) کو ایک نیک آدمی دیکھتا ہوں ۔ \"",
                "urduNarrator": "ہم سے ابو الربیع العتکی، خلف بن ہشام اور ابو کامل الجہدری نے بیان کیا، ان سب نے حماد بن زید سے روایت کی، انہوں نے کہا: ہم سے ابو الربیع نے بیان کیا۔ ہم سے حماد بن زید، ایوب نے بیان کیا, نافع نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو الرَّبِيعِ الْعَتَكِيُّ، وَخَلَفُ بْنُ هِشَامٍ، وَأَبُو كَامِلٍ الْجَحْدَرِيُّ، كُلُّهُمْ عَنْ حَمَّادِ بْنِ زَيْدٍ، قَالَ: أَبُو الرَّبِيعِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا أَيُّوبُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ: رَأَيْتُ فِي الْمَنَامِ كَأَنَّ فِي يَدِي قِطْعَةَ إِسْتَبْرَقٍ، وَلَيْسَ مَكَانٌ أُرِيدُ مِنَ الْجَنَّةِ إِلَّا طَارَتْ إِلَيْهِ، قَالَ فَقَصَصْتُهُ عَلَى حَفْصَةَ، فَقَصَّتْهُ حَفْصَةُ عَلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَرَى عَبْدَ اللهِ رَجُلًا صَالِحًا».",
                "headingArabic": "مِنْ فَضَائِلِ عَبْدِ اللَّهِ بْنِ عُمَرَ رضى الله عنهما ‏‏",
                "headingUrdu": "عبداللہ بن عمر رضی اللہ عنہ کے فضائل",
                "headingEnglish": "The Virtues Of 'Abdullah Bin 'Umar (RA)",
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13933,
                "hadithNumber": "6370",
                "englishNarrator": "Ibn 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "When a person saw anything in sleep during the lifetime of Allah's Messenger (ﷺ) he narrated it to Allah's Messenger, and I also had a longing that I should also see in a dream something which I should narrate to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and I was at that time an unmarried young man. I was sleeping in the mosque during the lifetime of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) it) at I saw in a dream as if two Angels have taken hold of me and they have carried me to the fire, and, lo, it was built like the easing of a well and had two pillars like those of a well; and, lo, there were people in it whom I knew and I cried out: I seek refuge with Allah from Hell-fire; I seek refuge with Allah from Hell-fire. Then another Angel joined the two others, and said unto me: You need not fear I narrated this dream to Hafsa رضی اللہ عنہا and she narrated it to Allah's Messenger, whereupon Allah's Apostle said: Worthy is this man Abdullah رضی اللہ عنہ , O that he would pray at night, and Salim added that Abdullah رضی اللہ عنہ afterwards slept only but for a small part of the night.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کی حیات مبارکہ میں جو شخص کو ئی خواب دیکھتا تو وہ اس کو رسول اللہ صلی اللہ علیہ وسلم کے سامنے بیان کرتا ، میری بھی آرزوتھی کہ میں بھی کو ئی خواب دیکھوں اور اس کو رسول اللہ صلی اللہ علیہ وسلم کے سامنے بیان کروں ۔ میں ایک غیر شادی شدہ نو جوان تھا اور رسول اللہ صلی اللہ علیہ وسلم کے زمانےمیں مسجد میں سویا کرتا تھا ، میں نے خواب میں دیکھا کہ جیسے دوفرشتوں نے مجھے پکڑا اور جہنم کی طرف لے گئے ۔ میں نے دیکھا کہ دوزخ کے کنارے پر کنویں کی منڈیر کی طرح تہ در تہ منڈیر بنی ہو ئی ہے اور اس کے دو ستون ہیں جس طرح کنویں کے ستون ہو تے ہیں اور اس کے اندر لو گ ہیں جن کو میں پہچانتا ہوں تو میں نے کہنا شروع کر دیا ۔ میں آگ سے اللہ کی پناہ میں آتا ہوں ، میں آگ سے اللہ کی پناہ میں آتا ہوں آگ سے اللہ کی پناہ میں آتا ہوں ۔ کہا : تو ان دونوں فرشتوں سے ایک اور فرشتہ آکر ملا ، اس نے مجھ سے کہا : تم مت ڈرو ۔ میں نے یہ خواب حضرت حفصہ رضی اللہ عنہا سے بیان کیا ، حضرت حفصہ رسول اللہ صلی اللہ علیہ وسلم سے بیان کیا تو نبی صلی اللہ علیہ وسلم نے فر ما یا : \" عبد اللہ خوب آدمی ہے! اگر یہ رات کو اٹھ کر نماز پڑھا کرے ۔ \" سالم نے کہا : اس کے بعد حضرت عبد اللہ بن عمر رضی اللہ عنہ رات کو بہت کم سوتے تھے ۔ ( زیادہ وقت نماز پڑھتے تھے ۔ )",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم اور عبد بن حمید نے بیان کیا - اور لفظ عبد کے لیے ہے - انہوں نے کہا: ہمیں عبدالرزاق نے خبر دی، ہمیں معمر نے خبر دی، زہری نے سالم سے ، انھوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبْدُ بْنُ حُمَيْدٍ - وَاللَّفْظُ لِعَبْدٍ - قَالَا: أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، قَالَ: كَانَ الرَّجُلُ فِي حَيَاةِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، إِذَا رَأَى رُؤْيَا، قَصَّهَا عَلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَتَمَنَّيْتُ أَنْ أَرَى رُؤْيَا أَقُصُّهَا عَلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: وَكُنْتُ غُلَامًا شَابًّا عَزَبًا، وَكُنْتُ أَنَامُ فِي الْمَسْجِدِ عَلَى عَهْدِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَرَأَيْتُ فِي النَّوْمِ كَأَنَّ مَلَكَيْنِ أَخَذَانِي فَذَهَبَا بِي إِلَى النَّارِ، فَإِذَا هِيَ مَطْوِيَّةٌ كَطَيِّ الْبِئْرِ، وَإِذَا لَهَا قَرْنَانِ كَقَرْنَيِ الْبِئْرِ، وَإِذَا فِيهَا نَاسٌ قَدْ عَرَفْتُهُمْ، فَجَعَلْتُ أَقُولُ: أَعُوذُ بِاللهِ مِنَ النَّارِ، أَعُوذُ بِاللهِ مِنَ النَّارِ، أَعُوذُ بِاللهِ مِنَ النَّارِ، قَالَ فَلَقِيَهُمَا مَلَكٌ فَقَالَ لِي: لَمْ تُرَعْ، فَقَصَصْتُهَا عَلَى حَفْصَةَ، فَقَصَّتْهَا حَفْصَةُ، عَلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «نِعْمَ الرَّجُلُ عَبْدُ اللهِ لَوْ كَانَ يُصَلِّي مِنَ اللَّيْلِ» قَالَ سَالِمٌ: فَكَانَ عَبْدُ اللهِ، بَعْدَ ذَلِكَ، لَا يَنَامُ مِنَ اللَّيْلِ إِلَّا قَلِيلًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13934,
                "hadithNumber": "6371",
                "englishNarrator": "Ibn Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "I used to spend nights in the mosque and by that time I had no wife and children. I saw in a dream as if I am being taken to a well. I made a mention of it to Allah's Messenger (ﷺ). The rest of the hadith is the same.",
                "hadithUrdu": "میں را ت کو مسجد میں سوتا تھا ( اس وقت ) میرے اہل وعیال نہ تھے میں نے خواب میں دیکھا کہ جیسے مجھے ایک کنویں کی طرف لے جا یا گیا ہے پھر انھوں نے نبی صلی اللہ علیہ وسلم سے اسی حدیث کےہم معنی بیان کیا جو زہری نے سالم سے اور انھوں نے اپنے والد ( عبد اللہ بن عمر رضی اللہ عنہ ) سے بیان کی ۔",
                "urduNarrator": "ہم سے عبداللہ بن عبدالرحمٰن دارمی نے بیان کیا، کہا ہم سے موسیٰ بن خالد، خاتون الفریبی نے، انہوں نے ابواسحاق الفزاری کی سند سے، عبید اللہ بن عمر نے نافع سے ، انھوں نے حضرت عبد اللہ بن عمر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا مُوسَى بْنُ خَالِدٍ، خَتَنُ الْفِرْيَابِيِّ، عَنْ أَبِي إِسْحَاقَ الْفَزَارِيِّ، عَنْ عُبَيْدِ اللهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ: كُنْتُ أَبِيتُ فِي الْمَسْجِدِ، وَلَمْ يَكُنْ لِي أَهْلٌ، فَرَأَيْتُ فِي الْمَنَامِ كَأَنَّمَا انْطُلِقَ بِي إِلَى بِئْرٍ، فَذَكَرَ عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَى حَدِيثِ الزُّهْرِيِّ، عَنْ سَالِمٍ عَنْ أَبِيهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13935,
                "hadithNumber": "6372",
                "englishNarrator": "Anas رضی اللہ عنہ reported that Umm Sulaim رضی اللہ عنہا said:",
                "hadithEnglish": "Allah's Messenger ﷺ, here is your servant Anas رضی اللہ عنہ , invoke blessings of Allah upon him. Thereupon he (the Holy Prophet ﷺ) said: O Allah, make an increase in his wealth, and progeny, and confer blessings upon him in everything Thou hast bestowed upon him.",
                "hadithUrdu": "اللہ کے رسول اللہ صلی اللہ علیہ وسلم !انس آپ کا خادم ہے آپ اس کے لیے اللہ سے دعا کیجئے تو آپ نے کہا : \" اے اللہ !اس کے مال اور اولاد کو زیادہ کر اور اس کو جو کچھ تو نے عطا کیا ہے ، اس میں برکت عطافر ما ! \"",
                "urduNarrator": "ہم سے محمد بن المثنی اور ابن بشار نے بیان کیا، کہا: محمد بن جعفر نے کہا : ہمیں شعبہ نے حدیث سنائی ، انھوں نے کہا : میں نے قتادہ سے سنا ، وہ حضرت انس رضی اللہ عنہ سے حدیث بیان کررہے تھے ، انھوں نے حضرت ام سلیم رضی اللہ عنہا سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، سَمِعْتُ قَتَادَةَ، يُحَدِّثُ عَنْ أَنَسٍ، عَنْ أُمِّ سُلَيْمٍ، أَنَّهَا قَالَتْ: يَا رَسُولَ اللهِ خَادِمُكَ أَنَسٌ، ادْعُ اللهَ لَهُ، فَقَالَ: «اللهُمَّ أَكْثِرْ مَالَهُ وَوَلَدَهُ، وَبَارِكْ لَهُ فِيمَا أَعْطَيْتَهُ».",
                "headingArabic": "مِنْ فَضَائِلِ أَنَسِ بْنِ مَالِكٍ رضى الله عنه ‏‏",
                "headingUrdu": "انس بن مالک رضی اللہ عنہ کے فضائل",
                "headingEnglish": "The Virtues Of Anas bin Malik (RA)",
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13936,
                "hadithNumber": "6373",
                "englishNarrator": "Anas رضی اللہ عنہ reported:",
                "hadithEnglish": "Umm Sulaim رضی اللہ عنہا said (to the Holy Prophet ﷺ) Allah's Messenger ﷺ , here is your servant Anas. The rest of the hadith is the same.",
                "hadithUrdu": "حضرت ام سلیم رضی اللہ عنہا نے عرض کی : اللہ کے رسول اللہ صلی اللہ علیہ وسلم !انس آپ کا خادم ہے ، پھر اسی طرح بیان کیا ( جس طرح پچھلی حدیث میں ہے )",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا, ابو داود نے کہا , ہمیں شعبہ نے قتادہ سے حدیث بیان کی ، میں نے حضرت انس رضی اللہ عنہ کو کہتے ہو ئے سنا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا أَبُو دَاوُدَ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، سَمِعْتُ أَنَسًا يَقُولُ: قَالَتْ أُمُّ سُلَيْمٍ: يَا رَسُولَ اللهِ خَادِمُكَ أَنَسٌ، فَذَكَرَ نَحْوَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13937,
                "hadithNumber": "6374",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been reported on the authority of Anas رضی اللہ عنہ through another chain of transmitters.",
                "hadithUrdu": "ہم سے محمد بن بشار نے بیان کیا, محمد بن جعفر نے کہا : ہمیں شعبہ نے ہشام بن زید سے حدیث بیان کی ، انھوں نے کہا : میں نے حضرت انس بن مالک رضی اللہ عنہ کو اسی طرح کہتے ہوئے سنا ( جس طرح پچھلی حدیث میں ہے ).",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ هِشَامِ بْنِ زَيْدٍ، سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُ مِثْلَ ذَلِكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13938,
                "hadithNumber": "6375",
                "englishNarrator": "Anas رضی اللہ عنہreported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) visited us and there was none else (in the house) but I, my mother and my mother's sister Umm Haram رضی اللہ عنہا. My mother said to him: Allah's Messenger, here is a small servant of yours, invoke blessings of Allah upon him. And he invoked blessings for me (that I should be bestowed upon) every good and this was what he (said) at the end of what be supplicated for me: O Allah, make an increase in his wealth, and progeny, and cqnfer blessings (upon him) in (each one) of them.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم ہمارے ہاں تشریف لا ئے ، اس وقت گھر میں صرف میں میری والدہ اور میری خالہ ام حرا م رضی اللہ عنہا تھیں ، میری والدہ نے کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! انس آپ کا چھوٹاسا خادم ہے آپ اس کے لیے اللہ سے دعا کیجئے ۔ آپ نے میرے لیے ہر بھلا ئی کی دعا کی ، آپ نے میرے لیے جو دعاکی اس کے آخر میں آپ نے فر ما یا : \" اے اللہ !اس کے مال اور اولاد کو زیادہ کر اور اس کو برکت عطافر ما ! \"",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے ہاشم بن القاسم نے بیان کیا، کہا ہم سے سلیمان نے بیان کیا, ثابت نے حضرت انس رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، حَدَّثَنَا سُلَيْمَانُ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ: دَخَلَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَيْنَا، وَمَا هُوَ إِلَّا أَنَا وَأُمِّي وَأُمُّ حَرَامٍ، خَالَتِي. فَقَالَتْ أُمِّي: يَا رَسُولَ اللهِ خُوَيْدِمُكَ، ادْعُ اللهَ لَهُ، قَالَ فَدَعَا لِي بِكُلِّ خَيْرٍ، وَكَانَ فِي آخِرِ مَا دَعَا لِي بِهِ أَنْ قَالَ: «اللهُمَّ أَكْثِرْ مَالَهُ وَوَلَدَهُ، وَبَارِكْ لَهُ فِيهِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 13626,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=545",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=543",
                "label": "543",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=544",
                "label": "544",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=545",
                "label": "545",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=546",
                "label": "546",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=547",
                "label": "547",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=548",
                "label": "548",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=549",
                "label": "549",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=547",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=547",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=545",
        "to": 13650,
        "total": 40465
    }
}