{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 300,
        "data": [
            {
                "id": 7764,
                "hadithNumber": "200",
                "englishNarrator": "Sufyan narrated on the authority of Ziyad b. 'Ilaqa that he heard Jarir bin 'Abdullah ‌رضی ‌اللہ ‌عنہ saying:",
                "hadithEnglish": "I pledged allegiance to the Messenger of Allah ﷺ on sincerity and well-wishing for every Muslim.",
                "hadithUrdu": "میں نے نبی ﷺ سے ہر مسلمان کے ساتھ خیر خواہی کرنے پر بیعت کی ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، زہیر بن حرب اور ابن نمیر نے بیان کیا، انہوں نے کہا کہ ہم سے سفیان نے بیان کیا,زیاد بن علاقہ ( کوفی ) سے روایت ہے ، انہوں نے حضرت جریر بن عبد اللہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنا ، وہ کہہ رہے تھے",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَابْنُ نُمَيْرٍ، قَالُوا: حَدَّثَنَا سُفْيَانُ، عَنْ زِيَادِ بْنِ عِلَاقَةَ، سَمِعَ جَرِيرَ بْنَ عَبْدِ اللهِ، يَقُولُ: «بَايَعْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى النُّصْحِ لِكُلِّ مُسْلِمٍ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7765,
                "hadithNumber": "201",
                "englishNarrator": "It is narrated on the authority of Jarir ‌رضی ‌اللہ ‌عنہ ‌that he observed:",
                "hadithEnglish": "I owed allegiance to the Messenger of Allah ( ﷺ) on hearing ( is commands) and obeying (them) and the Prophet) instructed me (to act) as lay in my power, and sincerity and goodwill for every Muslim.",
                "hadithUrdu": "میں نے نبی اکرمﷺ سے ( اللہ اور اس کے رسول ﷺ کے احکام ) سننے اور اطاعت کرنے پر بیعت کی ۔ رسو ل اللہ ﷺ نے ساتھ یہ کہلوایا : ’’ جہاں تک تمہارے بس میں ہو گا ۔ ‘ ‘ اور ہر مسلمان کے ساتھ خیر خواہی پر ۔ یعقوب نے اپنی روایت میں کہا : ہمیں سیار نے حدیث سنائی ۔ ( یعقوب نے براہ راست سیار سے بھی یہ روایت سنی اور ہشیم کے واسطے سے بھی ، لفظ وہی تھے ۔ )",
                "urduNarrator": "سریج بن یونس اور یعقوب دورقی نے کہا : ہشیم نےہمیں سیار کے واسطے سے شعبی سے حدیث سنائی اور انہوں نے حضرت جریر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا :",
                "hadithArabic": "حَدَّثَنَا سُرَيْجُ بْنُ يُونُسَ، وَيَعْقُوبُ الدَّوْرَقِيُّ، قَالَا: حَدَّثَنَا هُشَيْمٌ، عَنْ سَيَّارٍ، عَنِ الشَّعْبِيِّ، عَنْ جَرِيرٍ، قَالَ: «بَايَعْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى السَّمْعِ وَالطَّاعَةِ - فَلَقَّنَنِي - فِيمَا اسْتَطَعْتُ، وَالنُّصْحِ لِكُلِّ مُسْلِمٍ» قَالَ يَعْقُوبُ فِي رِوَايَتِهِ: قَالَ: حَدَّثَنَا سَيَّارٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7766,
                "hadithNumber": "202",
                "englishNarrator": "Abu Huraira reported:",
                "hadithEnglish": "The Messenger of Allah observed: The fornicator who fornicates is not a believer so long as he commits it and no thief who steals is a believer as long as he commits theft, and no drunkard who drinks wine is a believer as long as he drinks it. 'Abdul-Malik b. Abi Bakr' narrated this on the authority of Abu Bakr b. Abdur-Rahman b. Harith and then said: Abu Huraira made this addition: No plunderer who plunders a valuable thing that attracts the attention of people is a believer so long as he commits this act.",
                "hadithUrdu": "بلاشبہ رسول اللہ ﷺ نے فرمایا : ’’زانی زنا نہیں کرتا کہ جب زنا کر رہا ہو تو وہ مومن ہو ، چور چوری نہیں کرتا کہ جب چوری کرر ہا ہو تو وہ مومن ہو ، شرابی شراب نہیں پیتا کہ جب شراب پی رہا ہو تو وہ مومن ہو ۔ ‘ ‘ ابن شہاب نے بیان کیا کہ عبد الملک بن ابی بکر بن عبد الرحمٰن نے مجھےخبر دی کہ ( اس کے والد ) ابوبکر ان کے سامنے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے یہ سب باتیں روایت کرتے ، پھرکہتے : اور ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ ان میں یہ بات بھی شامل کرتے تھے کہ ’’کسی بڑی قدر و قیمت والی چیز کو ، جس کی وجہ سے لوگ لوٹنے والے کی طرف نظر اٹھا کر دیکھتے ہوں ، وہ نہیں لوٹتا کہ جب لوٹ رہا ہو تو وہ مومن ہو ۔ ‘ ‘",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ بن عبداللہ بن عمران التجیبی نے بیان کیا، کہا کہ ہم سے ابن وہب نے بیان کیا، انہوں نے کہا,مجھ سے یونس بن ابن شہاب سے خبر دی ، انہوں نے کہا : میں نے ابو سلمہ بن عبدالرحمٰن اور سعید بن مسیب سے سنا ، دونوں کہتے تھے کہ حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا",
                "hadithArabic": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى بْنِ عَبْدِ اللهِ بْنِ عِمْرَانَ التُّجِيبِيُّ، أَنْبَأَنَا ابْنُ وَهْبٍ، قَالَ: أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ: سَمِعْتُ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ، وَسَعِيدَ بْنَ الْمُسَيِّبِ، يَقُولَانِ: قَالَ أَبُو هُرَيْرَةَ: إِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَزْنِي الزَّانِي حِينَ يَزْنِي وَهُوَ مُؤْمِنٌ، وَلَا يَسْرِقُ السَّارِقُ حِينَ يَسْرِقُ وَهُوَ مُؤْمِنٌ، وَلَا يَشْرَبُ الْخَمْرَ حِينَ يَشْرَبُهَا وَهُوَ مُؤْمِنٌ» قَالَ ابْنُ شِهَابٍ: فَأَخْبَرَنِي عَبْدُ الْمَلِكِ بْنُ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ أَنَّ أَبَا بَكْرٍ كَانَ يُحَدِّثُهُمْ هَؤُلَاءِ عَنْ أَبِي هُرَيْرَةَ، ثُمَّ يَقُولُ وَكَانَ أَبُو هُرَيْرَةَ يُلْحِقُ مَعَهُنَّ: «وَلَا يَنْتَهِبُ نُهْبَةً ذَاتَ شَرَفٍ يَرْفَعُ النَّاسُ إِلَيْهِ فِيهَا أَبْصَارَهُمْ حِينَ يَنْتَهِبُهَا وَهُوَ مُؤْمِنٌ»",
                "headingArabic": "بَيَانِ نُقْصَانِ الإِيمَانِ بِالْمَعَاصِي وَنَفْيِهِ عَنِ الْمُتَلَبِّسِ بِالْمَعْصِيَةِ عَلَى إِرَادَةِ نَفْيِ كَمَالِهِ",
                "headingUrdu": "یہ واضح کرنا کہ ایمان نافرمانی کی وجہ سے کم ہو جاتا ہے اور معصیت کے مرتکب سے اس کی نفی، اس کے مکمل ہونے کی نفی کے معنی میں",
                "headingEnglish": "Clarifying that faith decreases because of disobedience and negating it from the one committing the act of disobedience, with the meaning of negating its completion",
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7767,
                "hadithNumber": "203",
                "englishNarrator": "Abdul-Malik bin Shu'aib narrated this hadith on the authority of Abu Huraira ‌رضی ‌اللہ ‌عنہ ‌that he observed:",
                "hadithEnglish": "The Messenger of Allah said that a fornicator does not fornicate, and then narrated the hadith like this, and he also made mention of plundering too, but did not mention of a thin having value. Ibn Shihab said: Sa'id b. al-Musayyib and Abu Salama narrated this hadith on the authority of Abu Huraira ‌رضی ‌اللہ ‌عنہ ‌a hadith like that of Abu Bakr ‌رضی ‌اللہ ‌عنہ with the exception of (the mention) of plundering.",
                "hadithUrdu": "آپ ﷺ نے فرمایا : ’’ زانی زنا نہیں کرتا ..... ‘ ‘ پھر گزشتہ حدیث کی طرح بیان کیا جس میں لوٹ کا ذکر تو ہے ، لیکن ’’قدر و منزلت والی چیز ‘ ‘ کے الفاظ نہیں ۔ ابن شہاب ( زہری ) نے کہا : مجھے سعید بن مسیب اور ابو سلمہ بن عبدالرحمٰن نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے حوالے سے رسول اللہ ﷺ سے اسی طرح حدیث سنائی جس طرح ابوبکر کی روایت ہے لیکن اس میں ’’لوٹ ‘ ‘ کا ذکر نہیں ہے.",
                "urduNarrator": "اور مجھ سے عبدالملک بن شعیب بن لیث بن سعد نے بیان کیا، انہوں نے کہا: مجھ سے میرے والد نے بیان کیا، میرے دادا سے، انہوں نے کہا,نہوں نے مجھ سے بیان کیا,عقیل بن خالد نے حدیث سنائی کہ ابن شہاب ( زہری ) نےکہا : مجھے ابو بکر بن عبدالرحمن بن حارث بن ہشام نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے خبر دی کہ",
                "hadithArabic": "وَحَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ بْنِ سَعْدٍ، قَالَ: حَدَّثَنِي أَبِي، عَنْ جَدِّي، قَالَ: حَدَّثَنِي عُقَيْلُ بْنُ خَالِدٍ، قَالَ: قَالَ ابْنُ شِهَابٍ، أَخْبَرَنِي أَبُو بَكْرِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، عَنْ أَبِي هُرَيْرَةَ أَنَّهُ قَالَ: إِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَزْنِي الزَّانِي» وَاقْتَصَّ الْحَدِيثَ بِمِثْلِهِ يَذْكُرُ، مَعَ ذِكْرِ النُّهْبَةِ وَلَمْ يَذْكُرْ ذَاتَ شَرَفٍ، قَالَ ابْنُ شِهَابٍ: حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيِّبِ، وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ أَبِي بَكْرٍ هَذَا إِلَّا النُّهْبَةَ،",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7768,
                "hadithNumber": "204",
                "englishNarrator": null,
                "hadithEnglish": "A Hadith similar to that of 'Uquail Muhammad bin Az-Zuhri was narrated from Abu Hurairah ‌رضی ‌اللہ ‌عنہ ‌ ‌from the prophet ﷺ (in which) he mention \"plunder\" but he did not mention\" that which is precious.\"",
                "hadithUrdu": "اوزاعی نے زہری سے حدیث بیان کی ، انہوں نے ابن مسیب ، ابو سلمہ اور ابوبکر بن عبدالرحمٰن بن حارث بن ہشام سے اور انہوں نے ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے رسول اللہ ﷺ سے اسی طرح روایت بیان کی جس طرح عقیل نےزہری سے حدیث بیان کی اور اس میں ’’لوٹ ‘ ‘ کا تذکرہ کیا لیکن ’’قدر وقیمت والی چیز ‘ ‘ کے الفاظ نہیں کہے ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنِي مُحَمَّدُ بْنُ مِهْرَانَ الرَّازِيُّ، قَالَ: أَخْبَرَنِي عِيسَى بْنُ يُونُسَ، حَدَّثَنَا الْأَوْزَاعِيُّ، عَنِ الزُّهْرِيِّ، عَنِ ابْنِ الْمُسَيِّبِ، وَأَبِي سَلَمَةَ، وَأَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ عُقَيْلٍ، عَنِ الزُّهْرِيِّ، ِ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، وَذَكَرَ النُّهْبَةَ وَلَمْ يَقُلْ ذَاتَ شَرَفٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7769,
                "hadithNumber": "205",
                "englishNarrator": null,
                "hadithEnglish": "Humaid bin 'Abdur-Rehman narrated from Abu Hurairah رضی ‌اللہ ‌عنہ, from the prophet ﷺ (the same as no.202).",
                "hadithUrdu": "مجھ سے حسن بن علی الحلوانی نے بیان کیا، کہا ہم سے یعقوب بن ابراہیم نے بیان کیا، ہم سے عبدالعزیز بن المطلب نے بیان کیا,صفوان بن سلیم نے حضرت میمونہ رضی اللہ عنہا کے آزاد کردہ غلام عطاء بن یسار سے اور حمید بن عبدالرحمٰن سے ، انہوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انہو ں ںے نبی ﷺ سے یہ روایت بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنِي حَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْمُطَّلِبِ، عَنْ صَفْوَانَ بْنِ سُلَيْمٍ، عَنْ عَطَاءِ بْنِ يَسَارٍ مَوْلَى مَيْمُونَةَ، وَحُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7770,
                "hadithNumber": "206",
                "englishNarrator": null,
                "hadithEnglish": "Al-'Ala' bin Abdul-Rehman the same (the same as. 202) narrating from Abu Hurairah رضی ‌اللہ ‌عنہ ‌, from the prophet ﷺ.",
                "hadithUrdu": "قتیبہ بن سعید ‘ عبد العزیز دراوردی ‘ علاء بن عبدالرحمٰن نے ابو ھریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ ، انہوں نے نبی ﷺ سے ( یہی ) حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، يَعْنِي الدَّرَاوَرْدِيَّ، عَنِ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7771,
                "hadithNumber": "207",
                "englishNarrator": "It is narrated on the authority of Abu Huraira رضی ‌اللہ ‌عنہ from the prophet:",
                "hadithEnglish": "A fornicator who fornicates is not a believer as long as he commits fornication, and no one who steals is a believer as long as he commits theft, and no one who drinks wine is a believer as long as he drinks it, and repentance may be accepted after that.",
                "hadithUrdu": "معمر نے ہمام بن منبہ سے ، انہوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انہوں نے نبی ﷺ سے روایت کی ، ان سب ( صفوان ، علاء اور معمر ) کی روایات ( 205 ۔ 207 ) امام زہری کی روایت ( 204 ) کے مانند ہیں ، البتہ علاء اور صفوان کی بیان کردہ حدیث روایت ( 205 ، 206 ) میں ’’ جس کی طرف سے لوگ نظر اٹھاتے ہیں ‘ ‘ کے ا لفاظ موجود نہیں ۔ اور ہمام کی روایت کے الفاظ اس طرح ہیں : ’’مومن لوگ ( اس چیز کی قدر و قیمت کی بنا پر ) اس کی طرف سے اپنی نظریں اٹھاتے ہیں اور وہ ( لوٹتے وقت ) مومن نہیں ہوتا ۔ ‘ ‘ اور معمر نے یہ اضافہ بھی کیا ہے : اور تم میں سے کوئی خیانت نہیں کرتا کہ جب خیانت کررہا ہو تو وہ مومن ہو ، لہٰذا تم ( ان تمام کاموں سے ) بچو ، تم بچو.",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا سُفْيَانُ، عَنِ الْأَعْمَشِ، عَنْ ذَكْوَانَ، عَنْ أَبِي هُرَيْرَةَ، رَفَعَهُ قَالَ: «لَا يَزْنِي الزَّانِي» ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ شُعْبَةَ‘كُلُّ هَؤُلَاءِ بِمِثْلِ حَدِيثِ الزُّهْرِيِّ، غَيْرَ أَنَّ الْعَلَاءَ، وَصَفْوَانَ بْنَ سُلَيْمٍ، لَيْسَ فِي حَدِيثِهِمَا: «يَرْفَعُ النَّاسُ إِلَيْهِ فِيهَا أَبْصَارَهُمْ»، وَفِي حَدِيثِ هَمَّامٍ: «يَرْفَعُ إِلَيْهِ الْمُؤْمِنُونَ أَعْيُنَهُمْ فِيهَا وَهُوَ حِينَ يَنْتَهِبُهَا مُؤْمِنٌ» وَزَادَ: «وَلَا يَغُلُّ أَحَدُكُمْ حِينَ يَغُلُّ وَهُوَ مُؤْمِنٌ، فَإِيَّاكُمْ إِيَّاكُمْ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7772,
                "hadithNumber": "208",
                "englishNarrator": "It was narrated from Abu Hurairah رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "The prophet ﷺ said: \"No adulterer is a believers at the time he is committing adultery; no thief is a believer at the time he is stealing; no drinking of wine is a believer at the time he is drinking it; but repentance may be acceptance may be accepted afterwards.\"",
                "hadithUrdu": "نبی ﷺ نے فرمایا : ’’ زانی زنا نہیں کرتا کہ جب زنا کر رہا ہو تا ہے تو مومن ہو ، چور چوری نہیں کرتا کہ جب چوری کر رہا ہو تو وہ مومن ہو ، شرابی شراب نہیں پیتا کہ جب وہ پی رہا ہو تو مومن ہو ۔ اور ( ان کو ) بعد میں توبہ کا موقع دیا جاتا ہے ۔ ‘ ‘",
                "urduNarrator": "مجھ سے محمد بن المثنی نے بیان کیا، کہا ہم سے ابن ابی عدی نے بیان کیا,شعبہ نے سلیمان سے ، انہوں نے ذکوان سے اور انہوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "دَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ، عَنْ ذَكْوَانَ، عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَزْنِي الزَّانِي حِينَ يَزْنِي وَهُوَ مُؤْمِنٌ، وَلَا يَسْرِقُ حِينَ يَسْرِقُ وَهُوَ مُؤْمِنٌ، وَلَا يَشْرَبُ الْخَمْرَ حِينَ يَشْرَبُهَا وَهُوَ مُؤْمِنٌ، وَالتَّوْبَةُ مَعْرُوضَةٌ بَعْدُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7773,
                "hadithNumber": "209",
                "englishNarrator": "It was narrated from Abu Hurairah رضی ‌اللہ ‌عنہ ‌and attributed to the prophet ﷺ:",
                "hadithEnglish": "No adulterter is a believer at the time he is committing adultery,\" then he mentioned a Hadith similar to that of Shobah.",
                "hadithUrdu": "’’زانی زنا نہیں کرتا کہ جب وہ زنا کر رہا ہو ..... ‘ ‘ آگے ( سفیان نے ) شعبہ کی حدیث کے مانند بیان کیا",
                "urduNarrator": "مجھ سے محمد بن رافع نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا,سفیان نے ( سلیمان ) اعمش کے حوالے سے خبر دی کہ ذکوان نےحضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے نبی ﷺ سے بیان کیا ، فرمایا :",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا سُفْيَانُ، عَنِ الْأَعْمَشِ، عَنْ ذَكْوَانَ، عَنْ أَبِي هُرَيْرَةَ، رَفَعَهُ قَالَ: «لَا يَزْنِي الزَّانِي» ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ شُعْبَةَ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7774,
                "hadithNumber": "210",
                "englishNarrator": "It is narrated on the authority of Abdullah bin 'Amr رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "The Prophet observed: There are four characteristics, whoever has them all is a pure hypocrite, and whoever has one of its characteristics, he has one of the characteristics of hypocrisy, until he gives it up: When he speaks he lies, when he makes a covenant he betrays it, when he makes a promise he breaks it, and when he disputes he resorts to obscene speech. In the narration of Sufyan (one of the narrators) it is: And if he has one of them, he has one of the characteristics of hypocrisy.",
                "hadithUrdu": "رسو ل اللہ ﷺ نے فرمایا : ’’ چار عادتیں ہیں جس میں وہ ( چاروں ) ہوں گی ، وہ خالص منافق ہو گا اور جس کسی میں ان میں سے ایک عادت ہو گی تو اس میں نفاق کی ایک عادت ہو گی یہاں تک کہ اس سے باز آ جائے ۔ ( وہ چار یہ ہیں : ) جب بات کرے تو جھوٹ بولے اور جب معاہدہ کرے تو توڑ ڈالے ، جب وعدہ کرے تو وعدہ خلافی کرے اور جب جھگڑا کرے تو گالی دے ۔ ‘ ‘ البتہ سفیان کی روایت میں خلقة کے بجائے خصلةکا لفظ ہے ( معنی وہی ہیں ۔ )",
                "urduNarrator": "عبد اللہ بن نمیر اور سفیان نے اعمش سے ، انہوں نے نے عبد اللہ بن مرہ سے ، انہوں نے مسروق سے اور انہوں نے حضرت عبد اللہ بن عمرو ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللهِ بْنُ نُمَيْرٍ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الْأَعْمَشُ، وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، عَنِ الْأَعْمَشِ، عَنْ عَبْدِ اللهِ بْنِ مُرَّةَ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللهِ بْنِ عَمْرٍو، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: أَرْبَعٌ مَنْ كُنَّ فِيهِ كَانَ مُنَافِقًا خَالِصًا، وَمَنْ كَانَتْ فِيهِ خَلَّةٌ مِنْهُنَّ كَانَتْ فِيهِ خَلَّةٌ مِنْ نِفَاقٍ حَتَّى يَدَعَهَا: إِذَا حَدَّثَ كَذَبَ، وَإِذَا عَاهَدَ غَدَرَ، وَإِذَا وَعَدَ أَخْلَفَ، وَإِذَا خَاصَمَ فَجَرَ غَيْرَ أَنَّ فِي حَدِيثِ سُفْيَانَ: «وَإِنْ كَانَتْ فِيهِ خَصْلَةٌ مِنْهُنَّ كَانَتْ فِيهِ خَصْلَةٌ مِنَ النِّفَاقِ».",
                "headingArabic": "بَيَانِ خِصَالِ الْمُنَافِقِ ‏‏",
                "headingUrdu": "منافق کی صفات",
                "headingEnglish": "The characteristics of the hypocrite",
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7775,
                "hadithNumber": "211",
                "englishNarrator": "It is reported on the authority of Abu Huraira رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "The Messenger of Allah (ﷺ) said: Three are the signs of a hypocrite: when he spoke he told a lie, when he made a promise he acted treacherously against it, when he was trusted he betrayed.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’ منافق کی تین علامتیں ہیں : جب بات کرے تو جھوٹ بولے ، جب وعدہ کرے تو ( اس کی ) خلاف ورزی کرے اور جب اسے ( کسی چیز کا ) امین بنایا جائے تو ( اس میں ) خیانت کرے ۔ ‘ ‘",
                "urduNarrator": "ہم سے یحییٰ بن ایوب اور قتیبہ بن سعید نے بیان کیا، اور لفظ یحییٰ ہے، انہوں نے کہا: ہم سے اسماعیل بن جعفر نے بیان کیا، انہوں نے کہا: مجھ سے ابو سہیل نافع بن مالک بن ابی عامر نے اپنے والد سے ، انہوں نے حضرت ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَاللَّفْظُ لِيَحْيَى، قَالَا: حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، قَالَ: أَخْبَرَنِي أَبُو سُهَيْلٍ نَافِعُ بْنُ مَالِكِ بْنِ أَبِي عَامِرٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: آيَةُ الْمُنَافِقِ ثَلَاثٌ: إِذَا حَدَّثَ كَذَبَ، وَإِذَا وَعَدَ أَخْلَفَ، وَإِذَا اؤْتُمِنَ خَانَ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7776,
                "hadithNumber": "212",
                "englishNarrator": "Abu Huraira reported that:",
                "hadithEnglish": "The Messenger of Allah (may peace and blessings be upon him) observed: There are three characteristics of a hypocrite: when he spoke he told a lie, when he made promise he acted treacherously, and when he was trusted he betrayed.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’ منافق کی تین علامتیں ہیں : جب بات کرے تو جھوٹ بولے ، وعدہ کرے تو خلاف ورزی کرے اور امین بنایا جائے تو خیانت کرے",
                "urduNarrator": "ہم سے ابوبکر بن اسحاق نے بیان کیا، کہا ہم سے ابن ابی مریم نے بیان کیا، انہوں نے بیان کیا,محمد بن جعفر نے کہا : ہمیں حرقہ کے آزاد کردہ غلام علاء بن عبد الرحمن بن یعقوب نے اپنے والد سے خبر دی اور انہوں نے حضرت ابوہریرہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ إِسْحَاقَ، أَخْبَرَنَا ابْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ: أَخْبَرَنِي الْعَلَاءُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ يَعْقُوبَ مَوْلَى الْحُرَقَةِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: مِنْ عَلَامَاتِ الْمُنَافِقِ ثَلَاثَةٌ: إِذَا حَدَّثَ كَذَبَ، وَإِذَا وَعَدَ أَخْلَفَ، وَإِذَا اؤْتُمِنَ خَانَ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7777,
                "hadithNumber": "213",
                "englishNarrator": "Uqba bin Mukarram al-'Ami reported that he heard 'Ala' bin 'Abdur-Rahman narrating this hadith with this chain of transmitters:",
                "hadithEnglish": "He said: Three are the signs of a hypocrite, even if he observed fast and prayed and asserted that he was a Muslim.",
                "hadithUrdu": "انہوں نے کہا : ’’ منافق کے علامات تین ہیں ، چاہے وہ روزہ رکھے ، نماز پڑھے اور اپنے آپ کو مسلمان سمجھے ۔ ‘ ‘",
                "urduNarrator": "ہم سے عقبہ بن مکرم عمی نے بیان کیا، انہوں نے کہایحییٰ بن محمد بن قیس ابو زکیر نے کہا , میں نے علاء بن عبدالرحمٰن کو اسی ( مذکورہ بالا ) سند کے ساتھ حدیث بیان کرتے ہوئے سنا ،",
                "hadithArabic": "حَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ الْعَمِّيُّ، حَدَّثَنَا يَحْيَى بْنُ مُحَمَّدِ بْنِ قَيْسٍ أَبُو زُكَيْرٍ، قَالَ: سَمِعْتُ الْعَلَاءَ بْنَ عَبْدِ الرَّحْمَنِ يُحَدِّثُ بِهَذَا الْإِسْنَادِ، وَقَالَ: «آيَةُ الْمُنَافِقِ ثَلَاثٌ، وَإِنْ صَامَ وَصَلَّى وَزَعَمَ أَنَّهُ مُسْلِمٌ»،",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7778,
                "hadithNumber": "214",
                "englishNarrator": "It is reported on the authority of Abu Huraira ‌رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "The Messenger of Allah (may peace and blessings of Allah be upon him) made observations like them embodied in the hadith narrated by Yahya bin Muhammad on the authority of 'Ala', and added to it: even if he observed fast and prayed and asserted that he was a Muslim.",
                "hadithUrdu": "جو یحییٰ بن محمد کی علاء سے بیان کردہ روایت کے مطابق ہے اور اس میں بھی یہ الفاظ ہیں : ’’خواہ روزہ رکھے ، نماز پڑھے اور اپنے آپ کو مسلمان سمجھے ۔ ‘ ‘",
                "urduNarrator": "مجھ سے ابو نصر التامر اور عبد الا علی بن حماد بن سلمہ نے داؤد بن ابی ہندہ سے ، انہوں نے سعید بن مسیب کے حوالے سے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی",
                "hadithArabic": "وَحَدَّثَنِي أَبُو نَصْرٍ التَّمَّارُ، وَعَبْدُ الْأَعْلَى بْنُ حَمَّادٍ، قَالَا: حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ دَاوُدَ بْنِ أَبِي هِنْدَ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ يَحْيَى بْنِ مُحَمَّدٍ، عَنِ الْعَلَاءِ، ذَكَرَ فِيهِ: «وَإِنْ صَامَ وَصَلَّى وَزَعَمَ أَنَّهُ مُسْلِمٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7779,
                "hadithNumber": "215",
                "englishNarrator": "It is reported on the authority of Ibn 'Umar رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "The Apostle (may peace and blessings be upon him) observed: When a man calls his brother an unbeliever, it returns (at least) to one of them.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’ جو شخص اپنے بھائی کو کافر قرار دے تو دونوں میں سے ایک ( ضرور ) کفر کے ساتھ واپس لوٹے گا",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے محمد بن بشر اور عبداللہ بن نمیر نے بیان کیا، انہوں نے کہا کہ ہم سے عبید اللہ بن عمر رضی اللہ عنہما نے بیان کیا,نافع نے حضرت عبد اللہ بن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، وَعَبْدُ اللهِ بْنُ نُمَيْرٍ، قَالَا: حَدَّثَنَا عُبَيْدُ اللهِ بْنُ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا كَفَّرَ الرَّجُلُ أَخَاهُ فَقَدْ بَاءَ بِهَا أَحَدُهُمَا».",
                "headingArabic": "بَيَانِ حَالِ إِيمَانِ مَنْ قَالَ لأَخِيهِ الْمُسْلِمِ يَا كَافِرُ ‏‏",
                "headingUrdu": "اس شخص کے لیے ایمان کی شرط کو واضح کرنا جو اپنے مسلمان بھائی سے کہے: اے کافر۔",
                "headingEnglish": "Clarifying the condition of faith for one who says to his muslim brother: \"O Kafir (Disbeliever).\"",
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7780,
                "hadithNumber": "216",
                "englishNarrator": "It is reported on the authority of Ibn 'Umar ‌رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "The Messenger of Allah (may peace and blessings be upon him) said: Any person who called his brother: O unbeliever (has in fact done an act by which this unbelief) would return to one of them. If it were so, as he asserted (then the unbelief of man was confirmed but if it was not true), then it returned to him (to the man who labeled it on his brother Muslim).",
                "hadithUrdu": "رسو ل اللہﷺ نے فرمایا : ’’ جس نے اپنے بھائی سے کہا : اے کافر ! تو دونوں میں سے ایک ( کفرکی ) اس ( نسبت ) کے ساتھ لوٹے گا ۔ اگر وہ ایسا ہی ہے جس طرح اس نےکہا ( تو ٹھیک ) ورنہ یہ بات اسی ( کہنے والے ) پر لوٹ آئے گی ۔ ‘ ‘",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ التمیمی، یحییٰ بن ایوب، قتیبہ بن سعید اور علی بن حجر نے اسماعیل بن جعفر کی سند سے بیان کیا، انہوں نے کہا: حیا بن یحییٰ: اسماعیل بن جعفر نے ہمیں خبر دی،عبد اللہ بن دینار سے روایت ہے ، انہوں نے حضرت ابن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو یہ کہتے سنا کہ",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَيَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَعَلِيُّ بْنُ حُجْرٍ جَمِيعًا، عَنْ إِسْمَاعِيلَ بْنِ جَعْفَرٍ، قَالَ يَحْيَى بْنُ يَحْيَى: أَخْبَرَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ عَبْدِ اللهِ بْنِ دِينَارٍ أَنَّهُ سَمِعَ ابْنَ عُمَرَ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: أَيُّمَا امْرِئٍ قَالَ لِأَخِيهِ: يَا كَافِرُ، فَقَدْ بَاءَ بِهَا أَحَدُهُمَا، إِنْ كَانَ كَمَا قَالَ، وَإِلَّا رَجَعَتْ عَلَيْهِ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7781,
                "hadithNumber": "217",
                "englishNarrator": "It is reported on the authority of Abu Dharr ‌رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "He heard the Messenger of Allah (may peace and blessings be upon him) saying: No person who claimed knowingly anyone else as his father besides (his own) committed nothing but infidelity, and he who made a claim of anything, which (in fact) did not belong to him, is not amongst us; he should make his abode in Fire, and he who labeled anyone with unbelief or called him the enemy of Allah, and he was in fact not so, it rebounded on him.",
                "hadithUrdu": "انہوں نے رسو ل اللہ ﷺ سے سنا : ’’ جس شخص نے دانستہ اپنے والد کے بجائے کسی اور ( کابیٹا ہونے ) کا دعویٰ کیا تو اس نے کفر کیا اور جس نے ایسی چیز کا دعویٰ کیا جواس کی نہیں ہے ، وہ ہم میں سے نہیں ، وہ اپنا ٹھکانا جہنم میں بنا لے ۔ اور جس شخص نے کسی کو کافر کہہ کر پکارا یا اللہ کا دشمن کہا ، حالانکہ وہ ایسا نہیں ہے تو یہ ( الزام ) اسی ( کہنے والے ) کی طرف لوٹ جائے گا ۔ ‘ ‘",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، ہم سے عبد الصمد بن عبد الوارث نے بیان کیا، ہم سے میرے والد نے بیان کیا، ہم سے حسین المعلم نے بیان کیا، ان سے ابن بریدہ نے، وہ یحییٰ بن یحییٰ سے۔ عمر نے کہا کہ ابو الاسود نے ان سے کہاحضرت ابو ذر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ",
                "hadithArabic": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ، حَدَّثَنَا أَبِي، حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ، عَنِ ابْنِ بُرَيْدةَ، عَنْ يَحْيَى بْنِ يَعْمَرَ أَنَّ أَبَا الْأَسْوَدِ، حَدَّثَهُ عَنْ أَبِي ذَرٍّ، أَنَّهُ سَمِعَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: لَيْسَ مِنْ رَجُلٍ ادَّعَى لِغَيْرِ أَبِيهِ وَهُوَ يَعْلَمُهُ إِلَّا كَفَرَ، وَمَنِ ادَّعَى مَا ليْسَ لَهُ فَلَيْسَ مِنَّا، وَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ، وَمَنْ دَعَا رَجُلًا بِالْكُفْرِ، أَوْ قَالَ: عَدُوُّ اللهِ وَلَيْسَ كَذَلِكَ إِلَّا حَارَ عَلَيْهِ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7782,
                "hadithNumber": "218",
                "englishNarrator": "It is narrated on the authority of Abu Huraira ‌رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "The Messenger of Allah (may peace and blessings be upon him) observed: Do not detest your fathers; he who detested his father committed infidelity.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’ اپنے آباء سے بے رغبتی نہ کرو ، چنانچہ جس شخص نے اپنے والد سے انحراف کیا تویہ ( عمل ) کفر ہے ۔ ‘ ‘",
                "urduNarrator": "مجھ سے ہارون بن سعید العیلی نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، انہوں نے کہا: مجھ سے عمرو نے جعفر بن ربیعہ سے اور عرق بن مالک رضی اللہ عنہ سے بیان کیا کہ انہوں نے بلی کے بچے کی آواز سنی,حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ: أَخْبَرَنِي عَمْرٌو، عَنْ جَعْفَرِ بْنِ رَبِيعَةَ، عَنْ عِرَاكِ بْنِ مَالِكٍ، أنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ: إِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تَرْغَبُوا عَنْ آبَائِكُمْ، فَمَنْ رَغِبَ عَنْ أَبِيهِ فَهُوَ كُفْرٌ».",
                "headingArabic": "بَيَانِ حَالِ إِيمَانِ مَنْ رَغِبَ عَنْ أَبِيهِ وَهُوَ يَعْلَمُ ‏‏",
                "headingUrdu": "جان بوجھ کر اپنے باپ کا انکار کرنے والے کے باپ کی حالت کو واضح کرنا",
                "headingEnglish": "Clarifying the condition of the fath of one who knowingly denies his father",
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7783,
                "hadithNumber": "219",
                "englishNarrator": "It is reported on the authority of Sa'd bin Abi Waqqas رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "Both of my ears heard the Messenger of Allah saying this: He who claimed the fatherhood of anyone else besides his real father knowingly (committed a great sin) ;Paradise is forbidden to him. Abu Bakra asserted that he too heard it from the Messenger of Allah (may peace be upon him ).",
                "hadithUrdu": "میرے دونوں کانوں نے رسول اللہ ﷺ سے سنا ، آپ فرما رہے تھے : ’’ جس نے اسلام کی حالت میں اپنے حقیقی باپ کے سوا کسی اور کو باپ بنانے کادعویٰ کیا اور وہ جانتا ہے کہ وہ اس کا باپ نہیں تو اس پر جنت حرام ہے ۔ ‘ ‘ اس پر حضرت ابوبکرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : خود میں نے بھی رسول اللہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سےیہی سنا ہے ۔",
                "urduNarrator": "مجھ سے عمرو النقید نے بیان کیا، کہا ہم سے ہشیم بن بشیر نے بیان کیا، کہا ہم سے خالد نے ابو عثمان سےنقل کیا کہ جب زیاد کی نسبت ( ابوسفیان ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی طرف ہونے ) کا دعویٰ کیا گیا تھا تو میں جناب ابوبکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سےملا اور پوچھا : یہ تم لوگوں نے کیا کیا ؟ میں نے سعد بن ابی وقاص ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنا ، وہ کہہ رہے تھے کہ",
                "hadithArabic": "حَدَّثَنِي عَمْرٌو النَّاقِدُ، حَدَّثَنَا هُشَيْمُ بْنُ بَشِيرٍ، أَخْبَرَنَا خَالِدٌ، عَنْ أَبِي عُثْمَانَ، قَالَ: لَمَّا ادُّعِيَ زِيَادٌ لَقِيتُ أَبَا بَكْرَةَ، فَقُلْتُ لَهُ: مَا هَذَا الَّذِي صَنَعْتُمْ؟ إِنِّي سَمِعْتُ سَعْدَ بْنَ أَبِي وَقَّاصٍ، يَقُولُ: سَمِعَ أُذُنَايَ مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَقُولُ: «مَنِ ادَّعَى أَبًا فِي الْإِسْلَامِ غَيْرَ أَبِيهِ، يَعْلَمُ أَنَّهُ غَيْرُ أَبِيهِ، فَالْجَنَّةُ عَلَيْهِ حَرَامٌ» فَقَالَ أَبُو بَكْرَةَ: أَنَا سَمِعْتُهُ مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7784,
                "hadithNumber": "220",
                "englishNarrator": "Sa'd and Abu Bakra رضی اللہ عنہما each one of them said:",
                "hadithEnglish": "My ears heard and my hearing preserved it that Muhammad (ﷺ) observed: He who claimed for another one his fatherhood besides his own father knowingly that he was not his father-to him Paradise is forbidden.",
                "hadithUrdu": "وہ دونوں کہتے تھے : یہ بات میرے دونوں کانوں نے محمدﷺ سے سنی ( اورمیرے دل نے یاد رکھی ) کہ آپ ﷺ فرما رہے تھے : ’’جس نے اپنے والد کے سوا کسی اور کو والد بنانے کا دعویٰ کیا ، حالانکہ وہ جانتا ہے کہ وہ اس کا والد نہیں ہے ، تو اس پر جنت حرام ہے ۔ ‘ ‘",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے یحییٰ بن زکریا بن ابی زیدہ نے بیان کیا اور ہم سے ابو معاویہ نے عاصم نے ابو عثمان سے اور انہوں نے حضرت سعد اور حضرت ابوبکر رضی اللہ عنہما سے روایت کی ہے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّاءَ بْنِ أَبِي زَائِدَةَ، وَأَبُو مُعَاوِيَةَ، عَنْ عَاصِمٍ، عَنْ أَبِي عُثْمَانَ، عَنْ سَعْدٍ، وَأَبِي بَكْرَةَ كِلَاهُمَا، يَقُولُ: سَمِعَتْهُ أُذُنَايَ، وَوَعَاهُ قَلْبِي مُحَمَّدًا صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنِ ادَّعَى إِلَى غَيْرِ أَبِيهِ، وَهُوَ يَعْلَمُ أَنَّهُ غَيْرُ أَبِيهِ فَالْجَنَّةُ عَلَيْهِ حَرَامٌ»",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7785,
                "hadithNumber": "221",
                "englishNarrator": "It is narrated on the authority of 'Abdullah bin Mas'ud ‌رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "The Messenger of Allah (ﷺ) observed: Abusing a Muslim is an outrage and fighting against him is unbelief. Zubaid said: I asked Abu Wa'il: Did you hear it from Abdullah ‌رضی ‌اللہ ‌عنہ narrating if from the Messenger of Allah (ﷺ)? He replied: Yes. But there is mention of the talk between Zubaid and Abu Wa'il in the hadith narrated by Shu'ba.",
                "hadithUrdu": "رسول اللہﷺ نے فرمایا : ’’ مسلمان کو گالی دینا فسق ہے اور اس سے لڑنا کفر ہے ۔ ‘ ‘ زبید نے کہا : میں نے ابو وائل سے پوچھا : کیا آپ نے عبد اللہ بن مسعود ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو رسول اللہ ﷺ سے روایت کرتے ہوئے خود سنا ہے ؟ انہوں نے کہا : ہاں ۔ شعبہ کی روایت میں زبید کے ابو وائل سے پوچھنے کا ذکر نہیں ہے ۔",
                "urduNarrator": "ہم سے محمد بن بکر بن الریان نے بیان کیا، اور ہم سے عون بن سلام نے بیان کیا، انہوں نے کہا: ہم سے محمد بن طلحہ نے بیان کیا، اور ہم سے محمد بن المثنیٰ نے بیان کیا، کہا کہ ہم سے عبدالرحمٰن نے بیان کیا، ہم سے ابن مہدی نے بیان کیا، ہم سے سفیان نے بیان کیا، ان سے محمد بن العاص نے بیان کیا۔ ہم سے مثنیٰ نے بیان کیا، ہم سے محمد بن جعفر نے بیان کیا, اور شعبہ تینوں نے زبید سے حدیث سنائی ، انہوں نے ابو وائل سے اور انہوں نے حضرت عبد اللہ بن مسعود ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَكَّارِ بْنِ الرَّيَّانِ، وَعَوْنُ بْنُ سَلَّامٍ قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ طَلْحَةَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا سُفْيَانُ، وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، كُلُّهُمْ عَنْ زُبَيْدٍ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللهِ بْنِ مَسْعُودٍ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «سِبَابُ الْمُسْلِمِ فُسُوقٌ وَقِتَالُهُ كُفْرٌ» قَالَ زُبَيْدٌ: فَقُلْتُ لِأَبِي وَائِلٍ: أَنْتَ سَمِعْتَهُ مِنْ عَبْدِ اللهِ يَرْوِيهِ عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ؟ قَالَ: نَعَمْ، وَلَيْسَ فِي حَدِيثِ شُعْبَةَ قَوْلُ زُبَيْدٍ لِأَبِي وَائِلٍ،",
                "headingArabic": "بَيَانِ قَوْلِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ سِبَابُ الْمُسْلِمِ فُسُوقٌ وَقِتَالُهُ كُفْرٌ ‏\"‏ ‏",
                "headingUrdu": "نبی کریم صلی اللہ علیہ وسلم کے ارشادات کی وضاحت: ’’مسلمان کو گالی دینا برا عمل ہے اور اس سے لڑنا کفر ہے‘‘۔",
                "headingEnglish": "Clarifying the words of the prophet (saws): \"Insulting A Muslim is an evil action and fighting him is disbelief (Kufr)\"",
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7786,
                "hadithNumber": "222",
                "englishNarrator": null,
                "hadithEnglish": "Abu Bakr bin Abu Shaiba narrated a hadith like this from the Apostle (ﷺ) on the authority of Abdullah.\r\nA similar hadith was narrated from Abu Wail, from Abdullah, from the prophet ﷺ.",
                "hadithUrdu": "منصور اور اعمش دونوں نے ابووائل سے ، انہون نے حضرت عبداللہ بن مسعود ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انہوں نے نبی اکرم ﷺ سے یہی حدیث بیان کی",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ الْمُثَنَّى، عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ، عَنْ شُعْبَةَ، عَنْ مَنْصُورٍ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، ٍ حَدَّثَنَا عَفَّانُ، حَدَّثَنَا شُعْبَةُ، عَنِ الْأَعْمَشِ، كِلَاهُمَا عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللهِ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7787,
                "hadithNumber": "223",
                "englishNarrator": "It is narrated on the authority of Jarir bin 'Abdullah ‌رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "The Messenger of Allah (ﷺ) asked him on the occasion of the Farewell Pilgrimage to make the people silent and then said: Do not return to unbelief after me by striking the necks of one another.",
                "hadithUrdu": "نبی اکرمﷺ نے حجۃ الوداع کے موقع پر مجھ سے فرمایا : ’’ لوگوں کو چپ کراؤ ۔ ‘ ‘ اس کے بعد آپ نے فرمایا : ’’ میرے بعد کافر نہ بن جانا کہ ایک دوسرے کی گردنیں مارنے لگو ۔ ‘ ‘",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، محمد بن المثنی اور ابن بشار سب نے محمد بن جعفر کی سند سے شعبہ، ح اور عبید اللہ بن معاذ کی سند سے بیان کیا اور تلفظ ان کا ہے۔ ہم سے میرے والد نے بیان کیا، ہم سے شعبہ نے بیان کیا، علی بن مدرک سے,ابو زرعہ ( ہرم بن عمرو بن جریر بن عبد ا للہ البجلی ) نے اپنے دادا حضرت جریر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، جَمِيعًا عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ، ٍ عَنْ شُعْبَةَ، ح وَحَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ، وَاللَّفْظُ لَهُ حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ عَلِيِّ بْنِ مُدْرِكٍ، سَمِعَ أَبَا زُرْعَةَ، يُحَدِّثُ عَنْ جَدِّهِ جَرِيرٍ، قَالَ: قَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ: «اسْتَنْصِتِ النَّاسَ» ثُمَّ قَالَ: «لَا تَرْجِعُوا بَعْدِي كُفَّارًا يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ».",
                "headingArabic": "‏\"‏ لاَ تَرْجِعُوا بَعْدِي كُفَّارًا يَضْرِبُ بَعْضُكمْ رِقَابَ بَعْضٍ ‏\"‏ ‏‏",
                "headingUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے اس فرمان کا مفہوم واضح کرتے ہوئے: ’’میرے جانے کے بعد کفر کی طرف مت لوٹنا، ایک دوسرے کی گردنیں مارنا‘‘۔",
                "headingEnglish": "Clarifying the meaning of the Statement of the Prophet (saws): \"Do not revert to disbelief (Kuffar) after I am Gone, striking one another's necks\"",
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7788,
                "hadithNumber": "224",
                "englishNarrator": null,
                "hadithEnglish": "A similar Hadith was narrated from Ibn-'Umer, from the prophet ﷺ.\r\nAbdullah b. Mu'adh narrated from the Apostle (may peace and blessings be upon him) a hadith like this on the authority on Ibn Umar.",
                "hadithUrdu": "معاذ بن معاذ نے شعبہ سے ، انہوں نے واقد بن محمد سے ، انہوں نے اپنےوالد سے ، ا نہوں نے حضرت ابن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انہوں نے نبی کریم ﷺ سے سابقہ حدیث کے مطابق روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ وَاقِدِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 7476,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=299",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=297",
                "label": "297",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=298",
                "label": "298",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=299",
                "label": "299",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=300",
                "label": "300",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=301",
                "label": "301",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=302",
                "label": "302",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=303",
                "label": "303",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=301",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=301",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=299",
        "to": 7500,
        "total": 40465
    }
}