{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 570,
        "data": [
            {
                "id": 14514,
                "hadithNumber": "6951",
                "englishNarrator": "Abdullah bin 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Three persons belonging to the earlier Ummahs set out on a journey until they had to spend a night in a cave. The rest of the hadith is the same and the additional words are: A person amongst them said: O Allah, I had my aged parents and I served them milk before I (served that) to my wife, children and my servants. And in case of the second one, the words are: She avoided me until she was hard pressed because of famine and she came to me and I gave her one hundred and twenty dinars. And in case of the third one (the words are): I invested his wages, and it brought profit and, as a result thereof, the merchandise increased and there was an abundance of goods. And he (the narrator said) that they got out of the cave and began to walk.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : \" تم سے پہلے لوگوں میں سے تین شخص ( کسی غرض سے ) روانہ ہوئے ، حتی کہ رات گزارنے کی ضرورت انہیں ایک غار کی پناہ گاہ میں لے آئی \" پھر انہوں نے ابن عمر رضی اللہ عنہ سے نافع کی روایت کے مطابق واقعہ بیان کیا مگر کہا : \" اے اللہ! میرے انتہائی بوڑھے والدین تھے ، میں رات کے وقت ان دونوں سے پہلے نہ گھر والوں کو دودھ پلاتا تھا ، نہ مال کو ( اپنی ملکیت کے غلاموں یا مویشیوں کے ان بچوں کو جن کی اپنی مائیں نہ تھیں ) دودھ پلاتا تھا ۔ \" اور ( یہ بھی ) کہا : \" ( میری عم زاد ) مجھ سے دور رہی یہاں تک کہ ایک قحط سالی کا شکار ہو گئی ، وہ میرے پاس آئی تو میں نے اسے ( سو کے بجائے جو اس نے مانگے تھے ) ایک سو بیس دینار دیے ۔ \" اور ( تیسرے شخص کے واقعے میں ) اس نے کہا : \" میں نے اس کی اجرت کو ( کاشتکاری اور تجارت کے ذریعے ) خوب بار آور بنایا ، یہاں تک کہ ایسا کرنے سے مال مویشی بہت بڑھ گئے اور پھیل گئے ۔ \" اور آخر میں کہا : \" تو وہ چلتے ہوئے غار سے باہر آ گئے ۔ \"",
                "urduNarrator": "مجھ سے محمد بن سہل التمیمی، عبداللہ بن عبدالرحمٰن بن بہرام اور ابوبکر بن اسحاق نے بیان کیا , ابن سہل نے کہا ، باقی دو نے کہا: ہمیں ابو الایمان نے خبر دی، ہمیں شعیب نے خبر دی، الزہری کی سند سے, سالم بن عبداللہ ( بن عمر ) نے مجھے خبر دی کہ حضرت عبداللہ بن عمر رضی اللہ عنہ نے کہا",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ سَهْلٍ التَّمِيمِيُّ، وَعَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ بِهْرَامَ وَأَبُو بَكْرِ بْنُ إِسْحَاقَ - قَالَ ابْنُ سَهْلٍ: حَدَّثَنَا، وقَالَ الْآخَرَانِ: أَخْبَرَنَا - أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللهِ، أَنَّ عَبْدَ اللهِ بْنَ عُمَرَ، قَالَ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: «انْطَلَقَ ثَلَاثَةُ رَهْطٍ مِمَّنْ كَانَ قَبْلَكُمْ، حَتَّى آوَاهُمُ الْمَبِيتُ إِلَى غَارٍ» وَاقْتَصَّ الْحَدِيثَ بِمَعْنَى حَدِيثِ نَافِعٍ، عَنِ ابْنِ عُمَرَ غَيْرَ أَنَّهُ قَالَ: قَالَ رَجُلٌ مِنْهُمْ: «اللهُمَّ كَانَ لِي أَبَوَانِ شَيْخَانِ كَبِيرَانِ، فَكُنْتُ لَا أَغْبِقُ قَبْلَهُمَا أَهْلًا وَلَا مَالًا» وَقَالَ: «فَامْتَنَعَتْ مِنِّي حَتَّى أَلَمَّتْ بِهَا سَنَةٌ مِنَ السِّنِينَ، فَجَاءَتْنِي فَأَعْطَيْتُهَا عِشْرِينَ وَمِائَةَ دِينَارٍ» وَقَالَ: «فَثَمَّرْتُ أَجْرَهُ حَتَّى كَثُرَتْ مِنْهُ الْأَمْوَالُ، فَارْتَعَجَتْ» وَقَالَ: «فَخَرَجُوا مِنَ الْغَارِ يَمْشُونَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "49",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 149,
                    "chapterNumber": "49",
                    "chapterEnglish": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
                    "chapterUrdu": "ذکر الٰہی‘دعا ‘توبہ اور استغفار",
                    "chapterArabic": "كتاب الذِّكْرِ وَالدُّعَاءِ وَالتَّوْبَةِ وَالِاسْتِغْفَارِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14515,
                "hadithNumber": "6952",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Allah, the Exalted and Glorious, said: I live in the thought of My servant and I am with him as he remembers Me. (The Holy Prophet) further said: By Allah, Allah is more pleased with the repentance of His servant than what one of you would do on finding the lost camel in the waterless desert. When he draws near Me by the span of his hand. I draw near him by the length of a cubit and when he draws near Me by the length of a cubit. I draw near him by the length of a fathom and when he draws near Me walking I draw close to him hurriedly.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ عزوجل نے فرمایا : میرے بارے میں میرے بندے کا جو گمان ہو میں اس کے ساتھ ( مطابق ہوتا ) ہوں اور وہ مجھے جہاں ( بھی ) یاد کرے میں اس کے پاس ہوتا ہوں ۔ اللہ کی قسم! اللہ تعالیٰ اپنے بندے کی توبہ پر تم میں سے ایسے آدمی کی نسبت بھی زیادہ خوش ہوتا ہے جسے چٹیل بیابان میں اپنی گم شدہ سواری ( سامان سمیت واپس ) مل جاتی ہے ۔ ( میرا ) جو بندہ ایک بالشت میرے قریب آتا ہے ، میں ایک ہاتھ اس کے قریب آ جاتا ہوں اور جو ایک ہاتھ میرے قریب ہوتا ہے ، میں دونوں ہاتھوں کی پوری لمبائی کے برابر اس کے قریب ہو جاتا ہوں اور جو چلتا ہوا میری طرف آتا ہے ، میں دوڑتا ہوا اس کے پاس آتا ہوں ۔ \"",
                "urduNarrator": "مجھ سے سوید بن سعید نے بیان کیا، مجھ سے حفص بن میسرہ نے بیان کیا، مجھ سے زید بن اسلم نے بیان کیا,  ابوصالح نے حضرت ابوہریرہ رضی اللہ عنہ سے اور انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا حَفْصُ بْنُ مَيْسَرَةَ حَدَّثَنِي زَيْدُ بْنُ أَسْلَمَ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ قَالَ اللَّهُ عَزَّ وَجَلَّ أَنَا عِنْدَ ظَنِّ عَبْدِي بِي وَأَنَا مَعَهُ حَيْثُ يَذْكُرُنِي وَاللَّهِ لَلَّهُ أَفْرَحُ بِتَوْبَةِ عَبْدِهِ مِنْ أَحَدِكُمْ يَجِدُ ضَالَّتَهُ بِالْفَلَاةِ وَمَنْ تَقَرَّبَ إِلَيَّ شِبْرًا تَقَرَّبْتُ إِلَيْهِ ذِرَاعًا وَمَنْ تَقَرَّبَ إِلَيَّ ذِرَاعًا تَقَرَّبْتُ إِلَيْهِ بَاعًا وَإِذَا أَقْبَلَ إِلَيَّ يَمْشِي أَقْبَلْتُ إِلَيْهِ أُهَرْوِلُ.",
                "headingArabic": "فِي الْحَضِّ عَلَى التَّوْبَةِ وَالْفَرَحِ بِهَا ‏‏",
                "headingUrdu": "توبہ کی نصیحت اور اس میں خوشی منانا",
                "headingEnglish": "Exhortation To Repent And Rejoicing Therein",
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14516,
                "hadithNumber": "6953",
                "englishNarrator": "Abu Huraira reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Allah is more pleased with the repentance of His servant when he turns penitently towards Him than one of you would be on finding the lost camel.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ تعالیٰ یقینا تم میں سے کسی کے توبہ کرنے پر اس سے زیادہ خوش ہوتا ہے جتنا تم میں سے کوئی شخص اپنی گم شدہ سواری ( واپس ) پا کر خوش ہوتا ہے ۔ \"",
                "urduNarrator": "مجھ سے عبداللہ بن مسلمہ بن قعنب القعنبی نے بیان کیا، ہم سے المغیرہ یعنی ابن عبدالرحمٰن الحزمی نے ابو الزناد کی سند سے بیان کیا, اعرج نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ الْقَعْنَبِيُّ حَدَّثَنَا الْمُغِيرَةُ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْحِزَامِيَّ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَلَّهُ أَشَدُّ فَرَحًا بِتَوْبَةِ أَحَدِكُمْ مِنْ أَحَدِكُمْ بِضَالَّتِهِ إِذَا وَجَدَهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14517,
                "hadithNumber": "6954",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Abu Huraira رضی اللہ عنہ through another chain of transmitters.",
                "hadithUrdu": "ہم سے محمد بن رافع نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، ہم سے معمر نے بیان کیا, ہمام بن منبہ نے حضرت ابوہریرہ رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے اسی کے ہم معنی روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَاه.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14518,
                "hadithNumber": "6955",
                "englishNarrator": "Harith bin Suwaid said:",
                "hadithEnglish": "I went to see 'Abdullah to inquire about his health as he was sick and he narrated to us a hadith of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). He heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Allah is more pleased with the repentance of His believing servant than a person who loses his riding beast carrying food and drink. He sleeps (being disappointed of its recovery) and then gets up and goes in search for that, until he is stricken with thirst. then comes back to the place where he had been before and goes to sleep completely exhausted placing his head upon his hands waiting for death. And when he gets up, lot there is before him his riding beast and his provisions of food and drink. Allah is more pleased with the repentance of His servant than the recovery of this riding beast along with the provisions (of food and drink).",
                "hadithUrdu": "میں حضرت عبداللہ ( بن مسعود رضی اللہ عنہ ) کے ہاں حاضر ہوا ، اس وقت وہ بیمار تھے ، انہوں نے ہمیں وہ حدیثیں بیان کیں ، ایک حدیث اپنی طرف سے اور ایک حدیث رسول اللہ صلی اللہ علیہ وسلم کی طرف سے ، انہوں نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ فرماتے تھے : \" اللہ تعالیٰ اپنے مومن بندے کی توبہ پر اس سے زیادہ خوش ہوتا ہے جتنا وہ آدمی ( خوش ہوتا ہے ) جو ہلاکت خیز سنسان اور بے آب و گیاہ میدان میں ہو ، اس کے ساتھ اس کی سواری ہو ، اس ( سواری ) پر اس کا کھانا اور پانی لدا ہوا ہو ، وہ ( تھکا ہارا کچھ دیر کے لئے ) سو جائے اور جب جاگے تو سواری جا چکی ہو ۔ وہ ڈھونڈتا رہے یہاں تک کہ اسے شدید پیاس لگ جائے ، پھر وہ کہے : میں جہاں پر تھا ، اسی جگہ واپس جاتا ہوں اور سو جاتا ہوں ، یہاں تک کہ ( اس نیند کے عالم میں ) مجھے موت آ جائے ۔ وہ اپنی کلائی پر سر رکھ کر مرنے کے لیے لیٹ جائے اور ( اچانک ) اس کی آنکھ کھلے تو اس کی وہ سواری جس پر اس کا زادراہ کھانا اور پانی تھا اس کے پاس کھڑی ہو ۔ تو اللہ اپنے مومن بندے کی توبہ پر اس سے زیادہ خوش ہوتا ہے جتنا یہ آدمی اپنی سواری اور زادراہ سے خوش ہوتا ہے ۔ \"",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ اور اسحاق بن ابراہیم نے بیان کیا اور یہ لفظ عثمان کے لیے ہے۔ ہمیں اسحاق نے بیان کیا اور عثمان نے کہا, جریر نے اعمش سے ، انہوں نے عمارہ بن عمیر سے اور انہوں نے حارث بن سُوید سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ وَاللَّفْظُ لِعُثْمَانَ قَالَ إِسْحَقُ أَخْبَرَنَا و قَالَ عُثْمَانُ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ عُمَارَةَ بْنِ عُمَيْرٍ عَنْ الْحَارِثِ بْنِ سُوَيْدٍ قَالَ دَخَلْتُ عَلَى عَبْدِ اللَّهِ أَعُودُهُ وَهُوَ مَرِيضٌ فَحَدَّثَنَا بِحَدِيثَيْنِ حَدِيثًا عَنْ نَفْسِهِ وَحَدِيثًا عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَلَّهُ أَشَدُّ فَرَحًا بِتَوْبَةِ عَبْدِهِ الْمُؤْمِنِ مِنْ رَجُلٍ فِي أَرْضٍ دَوِّيَّةٍ مَهْلِكَةٍ مَعَهُ رَاحِلَتُهُ عَلَيْهَا طَعَامُهُ وَشَرَابُهُ فَنَامَ فَاسْتَيْقَظَ وَقَدْ ذَهَبَتْ فَطَلَبَهَا حَتَّى أَدْرَكَهُ الْعَطَشُ ثُمَّ قَالَ أَرْجِعُ إِلَى مَكَانِيَ الَّذِي كُنْتُ فِيهِ فَأَنَامُ حَتَّى أَمُوتَ فَوَضَعَ رَأْسَهُ عَلَى سَاعِدِهِ لِيَمُوتَ فَاسْتَيْقَظَ وَعِنْدَهُ رَاحِلَتُهُ وَعَلَيْهَا زَادُهُ وَطَعَامُهُ وَشَرَابُهُ فَاللَّهُ أَشَدُّ فَرَحًا بِتَوْبَةِ الْعَبْدِ الْمُؤْمِنِ مِنْ هَذَا بِرَاحِلَتِهِ وَزَادِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14519,
                "hadithNumber": "6956",
                "englishNarrator": "It was narrated from Al-A'mash with this chain of narrators (a Hadith similar to no. 6955):",
                "hadithEnglish": "And he said: \"...then a man in a desolate land.\"",
                "hadithUrdu": "\" اس آدمی کی نسبت ( زیادہ خوش ہوتا ہے ) جو زمین کے سنسان بے آب و گیاہ صحرا میں ہو ۔ \" دوية کے بجائے داوية کا لفظ بولا ، معنی ایک ہی ہے ۔ )",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے یحییٰ بن آدم نے بیان کیا, قطبہ بن عبدالعزیز نے اعمش سے اسی سند کے ساتھ روایت کی اور کہا",
                "hadithArabic": "و حَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ عَنْ قُطْبَةَ بْنِ عَبْدِ الْعَزِيزِ عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ وَقَالَ مِنْ رَجُلٍ بِدَاوِيَّةٍ مِنْ الْأَرْضِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14520,
                "hadithNumber": "6957",
                "englishNarrator": "Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Allah is more pleased with the repentance of a believing man. The rest of the hadith is the same.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" بلاشبہ اللہ اپنے مومن بندے کی توبہ سے ( اس آدمی کی نسبت ) زیادہ خوش ہوتا ہے \" ( آگے ) جریر کی حدیث کے مانند ۔",
                "urduNarrator": "مجھ سے اسحاق بن منصور نے بیان کیا, ابواسامہ نے کہا : ہمیں اعمش نے حدیث بیان کی ، انہوں نے کہا : ہمیں عمارہ بن عمیر نے حدیث سنائی ، انہوں نے کہا : میں نے حارث بن سوید سے سنا ، کہا : مجھے حضرت عبداللہ ( بن مسعود رضی اللہ عنہ ) نے وہ حدیثیں بیان کیں ، ایک رسول اللہ صلی اللہ علیہ وسلم سے ( نقل کرتے ہوئے ) اور دوسری اپنی طرف سے ، چنانچہ انہوں نے کہا کہ",
                "hadithArabic": "و حَدَّثَنِي إِسْحَقُ بْنُ مَنْصُورٍ حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنَا الْأَعْمَشُ حَدَّثَنَا عُمَارَةُ بْنُ عُمَيْرٍ قَالَ سَمِعْتُ الْحَارِثَ بْنَ سُوَيْدٍ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ حَدِيثَيْنِ أَحَدُهُمَا عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالْآخَرُ عَنْ نَفْسِهِ فَقَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَلَّهُ أَشَدُّ فَرَحًا بِتَوْبَةِ عَبْدِهِ الْمُؤْمِنِ بِمِثْلِ حَدِيثِ جَرِيرٍ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14521,
                "hadithNumber": "6958",
                "englishNarrator": "Nu'man bin Bashir رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah is more pleased with the repentance of a believing servant than of a person who set out on a journey with a provision of food and drink on the back of his camel. He went on until he came to a waterless desert and he felt like sleeping. So he got down under the shade of a tree and was overcome by sleep and his camel ran away. As he got up he tried to see (the camel) standing upon a mound. but did not find it. He then got upon the other mound, but could not see anything. He then climbed upon the third mound but did not see anything until he came back to the place where he had been previously. And as he was sitting (in utter disappointment) there came to him the camel, till that (camel) placed its nosestring in his hand. Allah is more pleased with the repentance of His servant than the person who found (his lost camel) in this very state. Simak reported that Sha'bi was of the opinion that Nu'min traced it to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). Simak, however, did not hear that himself.",
                "hadithUrdu": "\"\" اللہ تعالیٰ کو اپنے بندے کی توبہ پر اس شخص کی نسبت زیادہ خوشی ہوتی ہے جس نے اپنا زادراہ اور اپنی پانی کی بڑی مشک کو اونٹ پر لادا ، پھر ( سفر پر ) چل پڑا ، یہاں تک کہ جب وہ ایک چٹیل زمین پر تھا تو اسے دوپہر کی نیند نے بے بس کر دیا ، وہ اترا اور ایک درخت کے نیچے دوپہر کے آرام کے لیے لیٹ گیا ، اس کی آنکھ لگ گئی اور اس کا اونٹ کسی طرف کو نکل گیا ، پھر وہ جاگا تو کوشش کر کے ایک ٹیلے پر چڑھا ( ہر طرف دیکھا ) لیکن اسے کچھ نظر نہ آیا ، پھر وہ مشقت اٹھا کر دوسرے ٹیلے پر چڑھا ، اسے کچھ نظر نہ آیا ، پھر ( مزید ) مشقت سے تیسرے ٹیلے پر چڑھا تو اسے کچھ نظر نہ آیا ، پھر وہ آیا ، اسی جگہ پہنچا جہاں دوپہر کا آرام کیا تھا ، وہ ( اس جگہ ) بیٹھا ہوا تھا کہ اس کا اونٹ چلتا ہوا ( واپس ) آ گیا اور اپنی مہار ( نکیل سے بندھی ہوئی رسی ) اس آدمی کے ہاتھ پر گرا دی ۔ ( اسے اٹھ کر مہار پکڑنے کی زحمت بھی نہ کرنی پڑی ) تو اللہ اپنے بندے کی توبہ پر اس شخص کی نسبت زیادہ خوش ہوتا ہے جب یہ آدمی اپنی سواری کو اس کی اصل حالت میں ( زادراہ اور پانی سمیت صحیح سالم ) پا لیتا ہے ۔ \"\" سماک نے کہا : تو شعبی نے سمجھا کہ حضرت نعمان ( بن بشیر رضی اللہ عنہ ) نے یہ بات مرفوع ( رسول اللہ صلی اللہ علیہ وسلم سے ) بیان کی ہے ، لیکن میں نے ان کو ( مرفوع بیان کرتے ) نہیں سنا ۔",
                "urduNarrator": "ہم سے عبید اللہ بن معاذ اعنبری نے بیان کیا، ہم سے میرے والد نے بیان کیا,  ابو یونس نے سماک سے روایت کی ، کہا : حضرت نعمان بن بشیر رضی اللہ عنہ نے خطبہ دیا اور ( آپ صلی اللہ علیہ وسلم کا فرمان ) بیان کیا",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا أَبُو يُونُسَ عَنْ سِمَاكٍ قَالَ خَطَبَ النُّعْمَانُ بْنُ بَشِيرٍ فَقَالَ لَلَّهُ أَشَدُّ فَرَحًا بِتَوْبَةِ عَبْدِهِ مِنْ رَجُلٍ حَمَلَ زَادَهُ وَمَزَادَهُ عَلَى بَعِيرٍ ثُمَّ سَارَ حَتَّى كَانَ بِفَلَاةٍ مِنْ الْأَرْضِ فَأَدْرَكَتْهُ الْقَائِلَةُ فَنَزَلَ فَقَالَ تَحْتَ شَجَرَةٍ فَغَلَبَتْهُ عَيْنُهُ وَانْسَلَّ بَعِيرُهُ فَاسْتَيْقَظَ فَسَعَى شَرَفًا فَلَمْ يَرَ شَيْئًا ثُمَّ سَعَى شَرَفًا ثَانِيًا فَلَمْ يَرَ شَيْئًا ثُمَّ سَعَى شَرَفًا ثَالِثًا فَلَمْ يَرَ شَيْئًا فَأَقْبَلَ حَتَّى أَتَى مَكَانَهُ الَّذِي قَالَ فِيهِ فَبَيْنَمَا هُوَ قَاعِدٌ إِذْ جَاءَهُ بَعِيرُهُ يَمْشِي حَتَّى وَضَعَ خِطَامَهُ فِي يَدِهِ فَلَلَّهُ أَشَدُّ فَرَحًا بِتَوْبَةِ الْعَبْدِ مِنْ هَذَا حِينَ وَجَدَ بَعِيرَهُ عَلَى حَالِهِ قَالَ سِمَاكٌ فَزَعَمَ الشَّعْبِيُّ أَنَّ النُّعْمَانَ رَفَعَ هَذَا الْحَدِيثَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَمَّا أَنَا فَلَمْ أَسْمَعْهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14522,
                "hadithNumber": "6959",
                "englishNarrator": "Al-Bara' bin 'Azib رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: What is your opinion about the delight of a person whose camel loaded with the provisions of food and drink is lost and that moves about with its nosestring trailing upon the waterless desert in which there is neither food nor drink, and lie wanders about in search of that until he is completely exhausted and then accidentally it happens to pass by the trunk of a tree and its nosestring gets entangled in that and he finds it entangled therein? He (in response to the question of the Holy Prophet) said: Allah's Messenger, he would feel highly delighted. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said. By Allah, Allah is more delighted at the repentance of His servant than that person (as he finds his lost) camel.\r\nJafar said: \"Ubaidullah bin Iyad narrated form his father.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" تم اس شخص کی خوشی کے متعلق کیا کہتے ہو جس کی اونٹنی ایسی بے آب و گیاہ زمین میں ، جہاں کھانے کی کوئی چیز ہو نہ پینے کی ، اپنی نکیل کی رسی کھینچتی ہوئی ( کسی طرف ) نکل گئی ۔ اس کا کھانا اور پانی بھی اسی پر تھا ۔ اس شخص نے اسے ( بہت ) ڈھونڈا حتی کہ تھک کر ہار گیا ، پھر وہ ( اونٹنی چلتے چلتے ) ایک درخت کے ٹنڈ منڈ تنے کے پاس سے گزری تو اس کی نکیل کی رسی اس کے ساتھ اٹک گئی اور اس شخص نے اس ( اونٹنی ) کو اس ( تنے ) کے ساتھ لگی کھڑی پا لیا؟ \"\" ہم نے عرض کی : اللہ کے رسول! ( اس شخص کی خوشی ) بے پناہ ہو گی ۔ اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" اللہ تعالیٰ اپنے بندے کی توبہ پر اس سے کہیں زیادہ خوش ہوتا ہے جتنا یہ شخص اپنی سواری کو پا کر ہوتا ہے ۔ \"\" جعفر نے کہا : ہمیں عبیداللہ بن یاد نے اپنے والد سے حدیث بیان کی ۔",
                "urduNarrator": "یحییٰ بن یحییٰ اور جعفر بن حمید نے ہمیں عبیداللہ بن ایاد بن لقیط سے ، انہوں نے ایاد سے حدیث بیان کی ، انہوں نے حضرت براء بن عازب رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَجَعْفَرُ بْنُ حُمَيْدٍ قَالَ جَعْفَرٌ حَدَّثَنَا و قَالَ يَحْيَى أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ إِيَادِ بْنِ لَقِيطٍ عَنْ إِيَادٍ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَيْفَ تَقُولُونَ بِفَرَحِ رَجُلٍ انْفَلَتَتْ مِنْهُ رَاحِلَتُهُ تَجُرُّ زِمَامَهَا بِأَرْضٍ قَفْرٍ لَيْسَ بِهَا طَعَامٌ وَلَا شَرَابٌ وَعَلَيْهَا لَهُ طَعَامٌ وَشَرَابٌ فَطَلَبَهَا حَتَّى شَقَّ عَلَيْهِ ثُمَّ مَرَّتْ بِجِذْلِ شَجَرَةٍ فَتَعَلَّقَ زِمَامُهَا فَوَجَدَهَا مُتَعَلِّقَةً بِهِ قُلْنَا شَدِيدًا يَا رَسُولَ اللَّهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَا وَاللَّهِ لَلَّهُ أَشَدُّ فَرَحًا بِتَوْبَةِ عَبْدِهِ مِنْ الرَّجُلِ بِرَاحِلَتِهِ قَالَ جَعْفَرٌ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ إِيَادٍ عَنْ أَبِيهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14523,
                "hadithNumber": "6960",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Allah is more pleased with the repentance of a servant as he turns towards Him for repentance than this that one amongst you is upon the camel in a waterless desert and there is upon (that camel) his provision of food and drink also and it is lost by him, and he having lost all hope (to get that) lies down in the shadow and is disappointed about his camel and there he finds that camel standing before him. He takes hold of his nosestring and then out of boundless joy says: O Lord, Thou art my servant and I am Thine Lord. He commits this mistake out of extreme delight.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ تعالیٰ اپنے بندے کی توبہ پر ، جب وہ ( بندہ ) اس کی طرف توبہ کرتا ہے ، تم میں سے کسی ایسے شخص کی نسبت کہیں زیادہ خوش ہوتا ہے جو ایک بے آب و گیاہ صحرا میں اپنی سواری پر ( سفر کر رہا ) تھا تو وہ اس کے ہاتھ سے نکل ( کر گم ہو ) گئی ، اس کا کھانا اور پانی اسی ( سواری ) پر ہے ۔ وہ اس ( کے ملنے ) سے مایوس ہو گیا تو ایک درخت کے پاس آیا اور اس کے سائے میں لیٹ گیا ۔ وہ اپنی سواری ( ملنے ) سے ناامید ہو چکا تھا ۔ وہ اسی عالم میں ہے کہ اچانک وہ ( آدمی ) اس کے پاس ہے ، وہ ( اونٹنی ) اس کے پاس کھڑی ہے ، اس نے اس کو نکیل کی رسی سے پکڑ لیا ، پھر بے پناہ خوشی کی شدت میں کہہ بیٹھا ، اے اللہ! تو میرا بندہ ہے اور میں تیرا رب ہوں ۔ خوشی کی شدت کی وجہ سے غلطی کر گیا ۔ \"",
                "urduNarrator": "ہم سے محمد بن الصباح اور زہیر بن حرب نے بیان کیا، کہا کہ ہم سے عمر بن یونس نے بیان کیا، ہم سے عکرمہ بن عمار نے بیان کیا,  اسحاق بن عبداللہ بن ابی طلحہ نے کہا : ہمیں حضرت انس بن مالک رضی اللہ عنہ نے حدیث بیان کی اور وہ ( حضرت انس رضی اللہ عنہ ) ان کے چچا ہیں ، کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ وَزُهَيْرُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا عُمَرُ بْنُ يُونُسَ حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ حَدَّثَنَا إِسْحَقُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ وَهُوَ عَمُّهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَلَّهُ أَشَدُّ فَرَحًا بِتَوْبَةِ عَبْدِهِ حِينَ يَتُوبُ إِلَيْهِ مِنْ أَحَدِكُمْ كَانَ عَلَى رَاحِلَتِهِ بِأَرْضِ فَلَاةٍ فَانْفَلَتَتْ مِنْهُ وَعَلَيْهَا طَعَامُهُ وَشَرَابُهُ فَأَيِسَ مِنْهَا فَأَتَى شَجَرَةً فَاضْطَجَعَ فِي ظِلِّهَا قَدْ أَيِسَ مِنْ رَاحِلَتِهِ فَبَيْنَا هُوَ كَذَلِكَ إِذَا هُوَ بِهَا قَائِمَةً عِنْدَهُ فَأَخَذَ بِخِطَامِهَا ثُمَّ قَالَ مِنْ شِدَّةِ الْفَرَحِ اللَّهُمَّ أَنْتَ عَبْدِي وَأَنَا رَبُّكَ أَخْطَأَ مِنْ شِدَّةِ الْفَرَحِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14524,
                "hadithNumber": "6961",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Allah is more pleased with the repentance of His servant than if one of you gets up and he finds his camel missing in a waterless desert (and then he accidentally finds it).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ تعالیٰ کو اپنے بندے کی توبہ سے ، تم میں سے کسی ایسے شخص کی نسبت ہمیں زیادہ خوشی ہوتی ہے جب کٹیل صحرا میں اس کے ( اس ) اونٹ ( کے آں ے ) پر اس کی آنکھ کھلتی ہے جسے وہ صحرا میں گم کر چکا ہوتا ہے ۔ \"",
                "urduNarrator": "ہداب بن خالد نے کہا : ہمیں ہمام نے حدیث بیان کی ، انہوں نے کہا : ہمیں قتادہ نے حضرت انس بن مالک رضی اللہ عنہ سے حدیث سنائی کہ",
                "hadithArabic": "حَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَلَّهُ أَشَدُّ فَرَحًا بِتَوْبَةِ عَبْدِهِ مِنْ أَحَدِكُمْ إِذَا اسْتَيْقَظَ عَلَى بَعِيرِهِ قَدْ أَضَلَّهُ بِأَرْضِ فَلَاةٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14525,
                "hadithNumber": "6962",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Anas bin Malik رضی اللہ عنہ through another chain of transmitters.",
                "hadithUrdu": "مجھے احمد الدارمی نے روایت کیا ہے, حبان نے کہا , ہمیں ہمام نے حدیث بیان کی ۔ کہا : ہمیں قتادہ نے حدیث سنائی ، کہا : ہمیں حضرت انس بن مالک رضی اللہ عنہ نے نبی صلی اللہ علیہ وسلم سے اسی کے مانند حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنِيهِ أَحْمَدُ الدَّارِمِيُّ حَدَّثَنَا حَبَّانُ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14526,
                "hadithNumber": "6963",
                "englishNarrator": "Abu Sirma reported:",
                "hadithEnglish": "When the time of the death of Abu Ayyub Ansari رضی اللہ عنہ drew near, he said: I used to conceal from you a thing which I heard from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Had you not committed sins, Allah would have brought into existence a creation that would have committed sin (and Allah) would have forgiven them.",
                "hadithUrdu": "حضرت ابو ایوب انصاری رضی اللہ عنہ سے روایت کی کہ جب ان کی وفات کا وقت آیا تو انہوں نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنی ہوئی ایک حدیث تم سے چھپا رکھی تھی ، میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا تھا : \" اگر تم ( لوگ ) گناہ نہ کرو تو ( تمہاری جگہ ) اللہ تعالیٰ ایسی مخلوق کو پیدا فرما دے جو گناہ کریں ( پھر اللہ سے توبہ کریں اور ) وہ ان کی مغفرت فرما دے ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے لیث نے بیان کیا، ان سے محمد بن قیس نے, عمر بن عبدالعزیز کے قصہ گو محمد بن قیس نے ابوصرمہ سے ، انہوں نے",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ عَنْ مُحَمَّدِ بْنِ قَيْسٍ قَاصِّ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنْ أَبِي صِرْمَةَ عَنْ أَبِي أَيُّوبَ أَنَّهُ قَالَ حِينَ حَضَرَتْهُ الْوَفَاةُ كُنْتُ كَتَمْتُ عَنْكُمْ شَيْئًا سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَوْلَا أَنَّكُمْ تُذْنِبُونَ لَخَلَقَ اللَّهُ خَلْقًا يُذْنِبُونَ يَغْفِرُ لَهُمْ.",
                "headingArabic": "سُقُوطِ الذُّنُوبِ بِالاِسْتِغْفَارِ تَوْبَةً ‏‏",
                "headingUrdu": "استغفار اور توبہ کرنے سے گناہ مٹ جاتے ہیں۔",
                "headingEnglish": "Sins Are Erased By Praying For Forgiveness And Repenting",
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14527,
                "hadithNumber": "6964",
                "englishNarrator": "Abu Ayyub Ansari رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: If you were not to commit sins, Allah would have swept you out of existence and would have replaced you by another people who have committed sin, and then asked forgiveness from Allah, and He would have granted them pardon.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" اگر تم ایسے ہوتے کہ تمہارے ( نامہ اعمال میں کچھ بھی ) گناہ نہ ہوتے جن کی اللہ تعالیٰ تمہارے لیے بخشش فرماتا تو وہ ایسی قوم کو ( اس دنیا میں ) لے آتا جن کے گناہ ہوتے اور وہ ان کے لیے ان ( گناہوں ) کی مغفرت فرماتا ۔ \"",
                "urduNarrator": "ہم سے ہارون بن سعید الا یلی نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، ان سے عیاض نے جو ابن عبداللہ الفہری ہیں، مجھ سے ابراہیم بن عبید بن رفاعہ نے بیان کیا, محمد بن کعب قرظی نے ابوصرمہ سے ، انہوں نے حضرت ابوایوب انصاری رضی اللہ عنہ سے اور انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ حَدَّثَنَا ابْنُ وَهْبٍ حَدَّثَنِي عِيَاضٌ وَهُوَ ابْنُ عَبْدِ اللَّهِ الْفِهْرِيُّ حَدَّثَنِي إِبْرَاهِيمُ بْنُ عُبَيْدِ بْنِ رِفَاعَةَ عَنْ مُحَمَّدِ بْنِ كَعْبٍ الْقُرَظِيِّ عَنْ أَبِي صِرْمَةَ عَنْ أَبِي أَيُّوبَ الْأَنْصَارِيِّ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ لَوْ أَنَّكُمْ لَمْ تَكُنْ لَكُمْ ذُنُوبٌ يَغْفِرُهَا اللَّهُ لَكُمْ لَجَاءَ اللَّهُ بِقَوْمٍ لَهُمْ ذُنُوبٌ يَغْفِرُهَا لَهُمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14528,
                "hadithNumber": "6965",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) having said: By Him in Whose Hand is my life, if you were not to commit sin, Allah would sweep you out of existence and He would replace (you by) those people who would commit sin and seek forgiveness from Allah, and He would have pardoned them.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اس ذات کی قسم جس کے ہاتھ میں میری جان ہے! اگر تم ( لوگ ) گناہ نہ کرو تو اللہ تعالیٰ تم کو ( اس دنیا سے ) لے جائے اور ( تمہارے بدلے میں ) ایسی قوم کو لے آئے جو گناہ کریں اور اللہ تعالیٰ سے مغفرت مانگیں تو وہ ان کی مغفرت فرمائے ۔ \"",
                "urduNarrator": "مجھ سے محمد بن رافع نے بیان کیا، ہم سے عبدالرزاق نے بیان کیا، ہم سے معمر نے، جعفر الجزاری کی سند سے، یزید بن الاصم کی سند سے, حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ جَعْفَرٍ الْجَزَرِيِّ عَنْ يَزِيدَ بْنِ الْأَصَمِّ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالَّذِي نَفْسِي بِيَدِهِ لَوْ لَمْ تُذْنِبُوا لَذَهَبَ اللَّهُ بِكُمْ وَلَجَاءَ بِقَوْمٍ يُذْنِبُونَ فَيَسْتَغْفِرُونَ اللَّهَ فَيَغْفِرُ لَهُمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14529,
                "hadithNumber": "6966",
                "englishNarrator": "Hanzala Usayyidi رضی اللہ عنہ , who was amongst the scribes of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). reported:",
                "hadithEnglish": "I met Abu Bakr رضی اللہ عنہ . He said: Who are you? He (Hanzala) said: Hanzala has turned to be a hypocrite. He (Abu Bakr رضی اللہ عنہ ) said: Hallowed be Allah, what are you saying? Thereupon he said: I say that when we are in the company of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) we ponder over Hell-Fire and Paradise as if we are seeing them with our very eyes and when we are away from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) we attend to our wives, our children, our business; most of these things (pertaining to After-life) slip out of our minds. Abu Bakr رضی اللہ عنہ said: By Allah, I also experience the same. So I and Abu Bakr رضی اللہ عنہ went to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said to him: Allah's Messenger, Hanzala has turned to be a hypocrite. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: What has happened to you? I said: Allah's Messenger, when we are in your company, we are reminded of Hell-Fire and Paradise as if we are seeing them with our own eyes, but whenever we go away from you and attend to our wives, children and business, much of these things go out of our minds. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: By Him in Whose Hand is my life, if your state of mind remains the same as it is in my presence and you are always busy in remembrance (of Allah), the Angels will shake hands with you in your beds and in your paths but, Hanzala, time should be devoted (to the worldly affairs) and time (should be devoted to prayer and meditation). He (the Holy Prophet) said this thrice.",
                "hadithUrdu": "حضرت ابوبکر رضی اللہ عنہ مجھ سے ملے اور دریافت کیا : حنظلہ! آپ کیسے ہیں؟ میں نے کہا : حنظلہ منافق ہو گیا ہے ، ( حضرت ابوبکر رضی اللہ عنہ نے ) کہا : سبحان اللہ! تم کیا کہہ رہے ہو؟ میں نے کہا : ہم رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوتے ہیں ، آپ ہمیں جنت اور دوزخ کی یاد دلاتے ہیں حتی کہ ایسے لگتے ہیں گویا ہم ( انہیں ) آنکھوں سے دیکھ رہے ہیں ، پھر جب ہم رسول اللہ صلی اللہ علیہ وسلم کے ہاں سے نکلتے ہیں تو بیویوں ، بچوں اور کھیتی باڑی ( اور دوسرے کام کاج ) کو سنبھالنے میں لگ جاتے ہیں اور بہت سی چیزیں بھول بھلا جاتے ہیں ۔ حضرت ابوبکر رضی اللہ عنہ نے کہا : اللہ کی قسم! یہی کچھ ہمیں بھی پیش آتا ہے ، پھر میں اور حضرت ابوبکر رضی اللہ عنہ چل پڑے اور رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے ۔ میں نے عرض کی : اللہ کے رسول! حنظلہ منافق ہو گیا ہے ، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" وہ کیا معاملہ ہے؟ \" میں نے عرض کی : اللہ کے رسول! ہم آپ کے پاس حاضر ہوتے ہیں ، آپ ہمیں جنت اور دوزخ کی یاد دلاتے ہیں ، تو حالت یہ ہوتی ہے گویا ہم ( جنت اور دوزخ کو ) اپنی آنکھوں سے دیکھ رہے ہیں اور جب ہم آپ کے ہاں سے باہر نکلتے ہیں تو بیویوں ، بچوں اور کام کاج کی دیکھ بھال میں لگ جاتے ہیں ۔ ۔ ہم بہت کچھ بھول جاتے ہیں ۔ ۔ اس پر رسول اللہ صلی اللہ علیہ وسلم نے تین بار ارشاد فرمایا : \" اس ذات کی قسم جس کے ہاتھ میں میری جان ہے! اگر تم ہمیشہ اسی کیفیت میں رہو جس طرح میرے پاس ہوتے اور ذکر میں لگے رہو تو تمہارے بچھونوں پر اور تمہارے راستوں میں فرشتے ( آ کر ) تمہارے ساتھ مصافحے کریں ، لیکن اے حنظلہ! کوئی گھڑی کسی طرح ہوتی ہے اور کوئی گھڑی کسی ( اور ) طرح ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ التیمی اور قطن بن نسیٰر نے بیان کیا اور لفظ یحییٰ کا ہے, جعفر بن سلیمان نے سعید بن ایاس جریری سے ، انہوں نے ابوعثمان نہدی سے اور انہوں نے حضرت حنظلہ ( بن ربیع ) اُسیدی رضی اللہ عنہ سے روایت کی ، انہوں نے کہا ۔ ۔ اور وہ رسول اللہ صلی اللہ علیہ وسلم کے کاتبوں میں سے تھے ۔ ۔ کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّيْمِيُّ وَقَطَنُ بْنُ نُسَيْرٍ وَاللَّفْظُ لِيَحْيَى أَخْبَرَنَا جَعْفَرُ بْنُ سُلَيْمَانَ عَنْ سَعِيدِ بْنِ إِيَاسٍ الْجُرَيْرِيِّ عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ عَنْ حَنْظَلَةَ الْأُسَيِّدِيِّ قَالَ وَكَانَ مِنْ كُتَّابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَقِيَنِي أَبُو بَكْرٍ فَقَالَ كَيْفَ أَنْتَ يَا حَنْظَلَةُ قَالَ قُلْتُ نَافَقَ حَنْظَلَةُ قَالَ سُبْحَانَ اللَّهِ مَا تَقُولُ قَالَ قُلْتُ نَكُونُ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُذَكِّرُنَا بِالنَّارِ وَالْجَنَّةِ حَتَّى كَأَنَّا رَأْيُ عَيْنٍ فَإِذَا خَرَجْنَا مِنْ عِنْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَافَسْنَا الْأَزْوَاجَ وَالْأَوْلَادَ وَالضَّيْعَاتِ فَنَسِينَا كَثِيرًا قَالَ أَبُو بَكْرٍ فَوَاللَّهِ إِنَّا لَنَلْقَى مِثْلَ هَذَا فَانْطَلَقْتُ أَنَا وَأَبُو بَكْرٍ حَتَّى دَخَلْنَا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُلْتُ نَافَقَ حَنْظَلَةُ يَا رَسُولَ اللَّهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَا ذَاكَ قُلْتُ يَا رَسُولَ اللَّهِ نَكُونُ عِنْدَكَ تُذَكِّرُنَا بِالنَّارِ وَالْجَنَّةِ حَتَّى كَأَنَّا رَأْيُ عَيْنٍ فَإِذَا خَرَجْنَا مِنْ عِنْدِكَ عَافَسْنَا الْأَزْوَاجَ وَالْأَوْلَادَ وَالضَّيْعَاتِ نَسِينَا كَثِيرًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالَّذِي نَفْسِي بِيَدِهِ إِنْ لَوْ تَدُومُونَ عَلَى مَا تَكُونُونَ عِنْدِي وَفِي الذِّكْرِ لَصَافَحَتْكُمْ الْمَلَائِكَةُ عَلَى فُرُشِكُمْ وَفِي طُرُقِكُمْ وَلَكِنْ يَا حَنْظَلَةُ سَاعَةً وَسَاعَةً ثَلَاثَ مَرَّاتٍ.",
                "headingArabic": "فَضْلِ دَوَامِ الذِّكْرِ وَالْفِكْرِ فِي أُمُورِ الْآخِرَةِ وَالْمُرَاقَبَةِ وَجَوَازِ تَرْكِ ذَلِكَ فِي بَعْضِ الْأَوْقَاتِ وَالِاشْتِغَالِ بِالدُّنْيَا",
                "headingUrdu": "مسلسل ذکر کی فضیلت، آخرت کا خیال، اور یاد رکھنا کہ اللہ ہر وقت دیکھ رہا ہے۔ کبھی کبھار اسے روکنے اور دنیاوی معاملات میں شرکت کی اجازت",
                "headingEnglish": "The Virtue Of Constant Dhikr, Thinking Of The Hereafter, And Remembering That Allah Is Always Watching; Permissibility Of Stopping That Sometimes, And Attending To Worldly Matters",
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14530,
                "hadithNumber": "6967",
                "englishNarrator": "Hanzala رضی اللہ عنہ reported:",
                "hadithEnglish": "We were in the company of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and he delivered to us a sermon and made a mention of Hell-Fire. Then I came to my house and began to laugh with my children and sport with my wife. (Hanzala) further reported: I went out and met Abu Bakr and made a mention of that to him. Thereupon he said: I have done the same as you have mentioned. So we went to see Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and said to him: Allah's Messenger, Hanzala has turned to he a hypocrite. And he (the Holy Prophet) said Show respite. And then I narrated to him the story, and Abu Bakr رضی اللہ عنہ said: I have done the same as he has done. Thereupon he (the Holy Prophet) said: Hanzala, there is a time for worldly affairs and a time for (worship and devotion), and if your state of mind is always the same as it is at the time of remembrance of Allah, the Angels would shake hands with you and would greet you on the path by saying: As-Salamu-Alaikum.",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے پاس تھے تو آپ نے ہمیں وعظ فرمایا اور دوزخ کی یاد دلائی ۔ کہا : پھر میں گھر آیا تو بچوں کے ساتھ ہنسی مذاق کیا اور بیوی سے خوش طبعی کی ، پھر میں باہر نکلا تو حضرت ابوبکر رضی اللہ عنہ سے ملاقات ہوئی ، ، میں نے یہی بات ان کو بتائی ۔ انہوں نے کہا : میں نے بھی یہی کیا ہے جس طرح تم نے ذکر کیا ہے ، پھر ہم دونوں رسول اللہ صلی اللہ علیہ وسلم سے ملے ، میں نے عرض کی : اللہ کے رسول! حنظلہ منافق ہو گیا ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" یہ کیا بات ہے؟ \" تو میں نے پوری بات آپ سے عرض کر دی ، پھر حضرت ابوبکر رضی اللہ عنہ نے کہا : جس طرح انہوں نے کیا ہے ، میں بھی بالکل یہی کیا ہے ( گھر جا کر بیوی بچوں کے ساتھ مشغول ہو گیا ۔ ) آپ صلی اللہ علیہ وسلم نے فرمایا : \" حنظلہ ( یہ ) گھڑی گھڑی کا معاملہ ہے ( ایک گھڑی کسی طرح ہوتی ہے اور دوسری کسی اور طرح ۔ ) اگر تمہارے دل ہر وقت اسی طرح رہیں جیسے تذکیر و تلقین کے وقت ہوتے ہیں تو تمہارے ساتھ فرشتے مصافحے کریں حتی کہ راستوں میں تم کو سلام کہیں ۔ \"",
                "urduNarrator": "مجھ سے اسحاق بن منصور نے بیان کیا, عبدالصمد کے والد ( عبدالوارث بن سعید ) نے کہا : ہمیں سعید جریری نے ابوعثمان نہدی سے حدیث بیان کی ، انہوں نے حضرت حنظلہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي إِسْحَقُ بْنُ مَنْصُورٍ أَخْبَرَنَا عَبْدُ الصَّمَدِ سَمِعْتُ أَبِي يُحَدِّثُ حَدَّثَنَا سَعِيدٌ الْجُرَيْرِيُّ عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ عَنْ حَنْظَلَةَ قَالَ كُنَّا عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَوَعَظَنَا فَذَكَّرَ النَّارَ قَالَ ثُمَّ جِئْتُ إِلَى الْبَيْتِ فَضَاحَكْتُ الصِّبْيَانَ وَلَاعَبْتُ الْمَرْأَةَ قَالَ فَخَرَجْتُ فَلَقِيتُ أَبَا بَكْرٍ فَذَكَرْتُ ذَلِكَ لَهُ فَقَالَ وَأَنَا قَدْ فَعَلْتُ مِثْلَ مَا تَذْكُرُ فَلَقِينَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ نَافَقَ حَنْظَلَةُ فَقَالَ مَهْ فَحَدَّثْتُهُ بِالْحَدِيثِ فَقَالَ أَبُو بَكْرٍ وَأَنَا قَدْ فَعَلْتُ مِثْلَ مَا فَعَلَ فَقَالَ يَا حَنْظَلَةُ سَاعَةً وَسَاعَةً وَلَوْ كَانَتْ تَكُونُ قُلُوبُكُمْ كَمَا تَكُونُ عِنْدَ الذِّكْرِ لَصَافَحَتْكُمْ الْمَلَائِكَةُ حَتَّى تُسَلِّمَ عَلَيْكُمْ فِي الطُّرُقِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14531,
                "hadithNumber": "6968",
                "englishNarrator": "Hanzala Taimi Ufayyidi, the scribe of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), reported:",
                "hadithEnglish": "We were in the presence of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and he brought to our minds the problems pertaining to Paradise and Hell-Fire. The rest of the hadith is the same.",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوتے تھے اور آپ ہمیں جنت اور دوزخ کی یاد دلاتے ۔ ۔ ۔ پھر ان دونوں ( جعفر بن سلیمان اور عبدالوارث بن سعید ) کی حدیث کی طرح بیان کیا ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے الفضل بن دکین نے بیان کیا, سفیان نے سعید جریری سے ، انہوں نے ابوعثمان نہدی سے اور انہوں نے حضرت حنظلہ تمیمی اُسیدی کاتب ( رسول اللہ صلی اللہ علیہ وسلم ) سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ حَدَّثَنَا سُفْيَانُ عَنْ سَعِيدٍ الْجُرَيْرِيِّ عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ عَنْ حَنْظَلَةَ التَّمِيمِيِّ الْأُسَيِّدِيِّ الْكَاتِبِ قَالَ كُنَّا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَّرَنَا الْجَنَّةَ وَالنَّارَ فَذَكَرَ نَحْوَ حَدِيثِهِمَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14532,
                "hadithNumber": "6969",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: When Allah created the creation as He was upon the Throne, He put down in His Book: Verily, My mercy predominates My wrath.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے فرمایا : اللہ تعالیٰ نے جب مخلوق کو پیدا فرمایا تو اپنی کتاب میں لکھ دیا اور وہ ( کتاب ) عرش کے اوپر اس کے پاس ہے : یقینا میری رحمت میرے غضب پر غالب ہو گی ۔ \"",
                "urduNarrator": "مغیرہ حزامی نے ابوزناد سے ، انہوں نے اعرج سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا الْمُغِيرَةُ يَعْنِي الْحِزَامِيَّ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَمَّا خَلَقَ اللَّهُ الْخَلْقَ كَتَبَ فِي كِتَابِهِ فَهُوَ عِنْدَهُ فَوْقَ الْعَرْشِ إِنَّ رَحْمَتِي تَغْلِبُ غَضَبِي.",
                "headingArabic": "فِي سَعَةِ رَحْمَةِ اللَّهِ تَعَالَى وَأَنَّهَا سَبَقَتْ غَضَبَهُ ‏‏",
                "headingUrdu": "اللہ کی رحمت کی وسعت، جو اس کے غضب پر غالب ہے۔",
                "headingEnglish": "The Vastaess Of Allah's Mercy, Which Prevails Over His Wrath",
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14533,
                "hadithNumber": "6970",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Allah, the Exalted and Glorious, said: My mercy excels My wrath.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ عزوجل نے فرمایا : میری رحمت میرے غضب پر سبقت لے گئی ہے ۔ \"",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا, سفیان بن عیینہ نے ابوزناد سے ، انہوں نے اعرج سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اللَّهُ عَزَّ وَجَلَّ سَبَقَتْ رَحْمَتِي غَضَبِي.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14534,
                "hadithNumber": "6971",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When Allah created the creation, He ordained for Himself and this document is with Him: Verily, My mercy predominates Mv wrath.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ تعالیٰ نے جب مخلوق کے بارے میں فیصلہ فرما لیا تو اس نے اپنی کتاب میں اپنے اوپر لازم کرتے ہوئے لکھ دیا ، وہ اس کے پاس رکھی ہوئی ہے : یقینا میری رحمت میرے غضب پر غالب رہے گی ۔ \"",
                "urduNarrator": "ہم سے علی بن خشرم نے بیان کیا، کہا ہم سے ابودامرہ نے بیان کیا، وہ حارث بن عبدالرحمٰن کی سند سے, عطاء بن مینا نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ أَخْبَرَنَا أَبُو ضَمْرَةَ عَنْ الْحَارِثِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَطَاءِ بْنِ مِينَاءَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا قَضَى اللَّهُ الْخَلْقَ كَتَبَ فِي كِتَابِهِ عَلَى نَفْسِهِ فَهُوَ مَوْضُوعٌ عِنْدَهُ إِنَّ رَحْمَتِي تَغْلِبُ غَضَبِي.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14535,
                "hadithNumber": "6972",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Allah created mercy in one hundred parts and He retained with Him ninety-nine parts, and He has sent down upon the earth one part, and it is because of this one part that there is mutual love among the creation so much so that the animal lifts up its hoof from its young one, fearing that it might harm it.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : \" اللہ تعالیٰ نے رحمت کے ایک سو حصے کیے ، ننانوے حصے اپنے پاس روک کر رکھ لیے اور ایک حصہ زمین پر اتارا ، اسی ایک حصے میں سے مخلوق ایک دوسرے پر رحم کرتی ہے حتی کہ ایک چوپایہ اس ڈر سے اپنا سم اپنے بچے اوپر اٹھا لیتا ہے کہ کہیں اس کو لگ نہ جائے ۔ \"",
                "urduNarrator": "ہم سے حرملہ بن یحییٰ التجیبی نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، کہا کہ مجھ سے یونس نے ابن شہاب کی سند سے بیان کیا, سعید بن مسیب نے بتایا کہ حضرت ابوہریرہ رضی اللہ عنہ نے کہا",
                "hadithArabic": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى التُّجِيبِيُّ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ أَخْبَرَهُ أَنَّ أَبَا هُرَيْرَةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ جَعَلَ اللَّهُ الرَّحْمَةَ مِائَةَ جُزْءٍ فَأَمْسَكَ عِنْدَهُ تِسْعَةً وَتِسْعِينَ وَأَنْزَلَ فِي الْأَرْضِ جُزْءًا وَاحِدًا فَمِنْ ذَلِكَ الْجُزْءِ تَتَرَاحَمُ الْخَلَائِقُ حَتَّى تَرْفَعَ الدَّابَّةُ حَافِرَهَا عَنْ وَلَدِهَا خَشْيَةَ أَنْ تُصِيبَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14536,
                "hadithNumber": "6973",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Allah created one hundred (parts of mercy) and He distributed one amongst His creation and kept this one hundred excepting one with Himself (for the Day of Resurrection).",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے فرمایا : \" اللہ تعالیٰ نے سو رحمتیں پیدا کیں ، اس نے ایک رحمت اپنی مخلوق میں رکھی اور ایک کم سو رحمتیں ( آئندہ کے لیے ) اپنے پاس چھپا کر رکھ لیں ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن ایوب، قتیبہ اور ابن حجر نے بیان کیا، انہوں نے کہا: ہم سے اسماعیل یعنی ابن جعفر نے بیان کیا, علاء کے والد ( عبدالرحمٰن ) نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ وَابْنُ حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَعِيلُ يَعْنُونَ ابْنَ جَعْفَرٍ عَنْ الْعَلَاءِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ خَلَقَ اللَّهُ مِائَةَ رَحْمَةٍ فَوَضَعَ وَاحِدَةً بَيْنَ خَلْقِهِ وَخَبَأَ عِنْدَهُ مِائَةً إِلَّا وَاحِدَةً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14537,
                "hadithNumber": "6974",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: There are one hundred (parts of) mercy for Allah and He has sent down out of these one part of mercy upon the jinn and human beings and animals and the insects, and it is because of this (one part) that they love one another, show kindness to one another and even the beast treats its young one with affection, and Allah has reserved ninety nine parts of mercy with which He would treat His servants on the Day of Resurrection.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ تعالیٰ کی سو رحمتیں ہیں ، ان میں سے ایک رحمت اس نے جن و انس ، حیوانات اور حشرات الارض کے درمیان نازل فرما دی ، اسی ( ایک حصے کے ذریعے ) سے وہ ایک دوسرے پر شفقت کرتے ہیں ، آپس میں رحمت کا برتاؤ کرتے ہیں ، اسی سے وحشی جانور اپنے بچوں پر شفقت کرتے ہیں اور اللہ تعالیٰ نے ننانوے رحمتیں مؤخر کر کے رکھ لی ہیں ، ان سے قیامت کے دن اپنے بندوں پر رحم فرمائے گا ۔ \"",
                "urduNarrator": "ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا، کہا ہم سے میرے والد نے بیان کیا، کہا ہم سے عبدالملک نے بیان کیا, عطاء نے حضرت ابوہریرہ رضی اللہ عنہ سے ، انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا عَبْدُ الْمَلِكِ عَنْ عَطَاءٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ لِلَّهِ مِائَةَ رَحْمَةٍ أَنْزَلَ مِنْهَا رَحْمَةً وَاحِدَةً بَيْنَ الْجِنِّ وَالْإِنْسِ وَالْبَهَائِمِ وَالْهَوَامِّ فَبِهَا يَتَعَاطَفُونَ وَبِهَا يَتَرَاحَمُونَ وَبِهَا تَعْطِفُ الْوَحْشُ عَلَى وَلَدِهَا وَأَخَّرَ اللَّهُ تِسْعًا وَتِسْعِينَ رَحْمَةً يَرْحَمُ بِهَا عِبَادَهُ يَوْمَ الْقِيَامَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14538,
                "hadithNumber": "6975",
                "englishNarrator": "Salman Farisi رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Verily, there are one hundred (parts of) mercy for Allah, and it is one part of this mercy by virtue of which there is mutual love between the people and ninety-nine reserved for the Day of Resurrection.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ تعالیٰ کی سو رحمتیں ہیں ، ان میں سے ایک رحمت ہے جس کے ذریعے سے مخلوق آپس میں ایک دوسرے پر رحم کرتی ہے اور ننانوے ( رحمتیں ) قیامت کے دن کے لیے ( محفوظ ) ہیں ۔ \"",
                "urduNarrator": "مجھ سے الحکم بن موسیٰ نے بیان کیا, معاذ نے کہا : ہمیں سلیمان تیمی نے حدیث بیان کی ، انہوں نے کہا : ہمیں ابوعثمان نہدی نے حضرت سلمان فارسی رضی اللہ عنہ سے حدیث سنائی ، کہا",
                "hadithArabic": "حَدَّثَنِي الْحَكَمُ بْنُ مُوسَى حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ حَدَّثَنَا سُلَيْمَانُ التَّيْمِيُّ حَدَّثَنَا أَبُو عُثْمَانَ النَّهْدِيُّ عَنْ سَلْمَانَ الْفَارِسِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ لِلَّهِ مِائَةَ رَحْمَةٍ فَمِنْهَا رَحْمَةٌ بِهَا يَتَرَاحَمُ الْخَلْقُ بَيْنَهُمْ وَتِسْعَةٌ وَتِسْعُونَ لِيَوْمِ الْقِيَامَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 14226,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=569",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=567",
                "label": "567",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=568",
                "label": "568",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=569",
                "label": "569",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=570",
                "label": "570",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=571",
                "label": "571",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=572",
                "label": "572",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=573",
                "label": "573",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=571",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=571",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=569",
        "to": 14250,
        "total": 40465
    }
}