{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 425,
        "data": [
            {
                "id": 10889,
                "hadithNumber": "3325",
                "englishNarrator": "Anas bin Malik ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Allah bless them in their measurements, bless them in their sa's and bless them in their mudd.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" اےاللہ !ان ( اہل مدینہ ) کے لیے ان کے ناپنے کے پیمانے میں بر کت عطا فر ما ، ان کے صاع میں بر کت عطا فر ما ۔ اور ان کے مد میں بر کت فر ما ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے مالک بن انس کی روایت سے بیان کیا کہ ان سے جو کچھ پڑھا گیا, اسحاق بن عبد اللہ بن ابی طلحہ نے  انس بن مالک رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، فِيمَا قُرِئَ عَلَيْهِ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «اللهُمَّ بَارِكْ لَهُمْ فِي مِكْيَالِهِمْ، وَبَارِكْ لَهُمْ فِي صَاعِهِمْ، وَبَارِكْ لَهُمْ فِي مُدِّهِمْ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10890,
                "hadithNumber": "3326",
                "englishNarrator": "Anas bin Malik ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: O Allah, increase in Medina twice the blessings (Thou showered) on Mecca.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : اے اللہ !مدینہ میں اس سے دگنی برکت رکھ جتنی مکہ میں ہے ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب اور ابراہیم بن محمد سامی نے بیان کیا، کہا  ہم سے وہب بن جریر نے بیان کیا، ہم سے میرے والد نے بیان کیا، انہوں نے کہا: میں نے یونس کو یہ کہتے ہوئے سنا, زہری نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَإِبْرَاهِيمُ بْنُ مُحَمَّدٍ السَّامِيُّ، قَالَا: حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا أَبِي، قَالَ: سَمِعْتُ يُونُسَ، يُحَدِّثُ عَنِ الزُّهْرِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «اللهُمَّ اجْعَلْ بِالْمَدِينَةِ ضِعْفَيْ مَا بِمَكَّةَ مِنَ الْبَرَكَةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10891,
                "hadithNumber": "3327",
                "englishNarrator": "Ibrahim al-Taimi reported on the authority of his father:",
                "hadithEnglish": "'Ali bin Abi Talib ( رضی اللہ تعالیٰ عنہ) addressed us and said: He who thought that we have besides the Holy Qur'an anything else that we recite, he told a lie. And this document which is hanging by the sheath of the sword contains but the ages of the camels, and the nature of the wounds. He (Hadrat 'Ali) reported Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Medina is sacred from 'Air to Thaur; So if anyone makes an innovation or accommodates an innovator, the curse of Allah, the angels, and all persons will fall upon him, and Allah will not accept any obligatory or supererogatory act as recompense from them. And the protection granted by the Muslims is one and must be respected by the humblest of them. If anyone makes a false claim to paternity, or being a client of other than his own masters, there is upon him the curse of Allah, the angels, and all the people. Allah will not accept from him any recompense in the form of obligatory acts or supererogatory acts. The hadith transmitted on the authority of Abu Bakr and Zabair ends with (these words): The humblest among them should respect it; and what follows after it is not mentioned there, and in the hadith transmitted by them (these words are) not found: (The document was hanging) on the sheath of his sword.",
                "hadithUrdu": "ہمیں علی بن ابی طا لب رضی اللہ تعالیٰ عنہ نے خطبہ دیا اور کہا : جس نے یہ گمان کیا کہ ہمارے پاس کتاب اللہ اور اس صحیفہ ۔ ۔ ۔ ( راوی نے ) کہا : اور وہ صحیفہ ان کی تلوار کے تھیلے کے ساتھ لٹکا ہوا تھا ۔ ۔ ۔ کے علاوہ کچھ ہے جسے ہم پڑھتے ہیں تو اس نے جھوٹ بولا اس میں ( دیت کے ) کچھ احکام ہیں ۔ اور اس میں یہ ہے کہ نبی صلی اللہ علیہ وسلم نے فرما یا : \"\" عیر سے ثور تک کے درمیان ( سارا ) مدینہ حرم ہے : جس نے اس میں کسی بدعت کا ارتکاب کیا بدعت کے کسی مرتکب کو پناہ دی تو اس پر اللہ کی فرشتوں کی اور سب لوگوں کی لعنت ہو گی ۔ قیامت کے دن اللہ تعا لیٰ اس سے کو ئی عذر قبول کرے گا نہ کو ئی بدلہ اور سب مسلمانوں کی ذمہ داری ( امان ) ایک ( جیسی ) ہے ان کا ادنیٰ شخص بھی ایسا کرسکتا ہے ( امان دے سکتا ہے ) جس شخص نے اپنے والد کے سواکسی اور کا ( بیٹا ) ہو نے کا دعویٰ کیا یا جس ( غلام ) نے اپنے موالی ( آزاد کرنے والوں ) کے سوا کسی اور کی طرف نسبت اختیار کی اس پر اللہ کی ، فرشتوں کی ا اور سب لوگوں کی لعنت ہے ۔ قیامت کے دن اللہ تعا لیٰ اس سے کو ئی عذر قبول فرمائے گا نہ بدلہ ابو بکر اور زہیر کی حدیث آپ صلی اللہ علیہ وسلم کے فرمان \"\" ان کا ادنیٰ شخص بھی ایسا کر سکتا ہے \"\" پر ختم ہو گئی اور ان دونوں نے وہ حصہ ذکر نہیں کیا جو اس کے بعد ہے اور نہ ان کی حدیث میں یہ الفاظ ہیں : \"\" وہ ان کی تلوار کے تھیلے کے ساتھ لٹکا ہوا تھا ۔",
                "urduNarrator": "ہمیں ابو بکر بن ابی شیبہ زہیر بن حرب اور ابو کریب سب نے ابو معاویہ سے حدیث بیان کی ( کہا ) ہمیں اعمش نے ابراہیم تیمی سے انھوں نے اپنے والد سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَأَبُو كُرَيْبٍ، جَمِيعًا عَنْ أَبِي مُعَاوِيَةَ، قَالَ أَبُو كُرَيْبٍ: حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَاى الْأَعْمَشُ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنْ أَبِيهِ، قَالَ [ص:995]: خَطَبَنَا عَلِيُّ بْنُ أَبِي طَالِبٍ، فَقَالَ: مَنْ زَعَمَ أَنَّ عِنْدَنَا شَيْئًا نَقْرَؤُهُ إِلَّا كِتَابَ اللهِ وَهَذِهِ الصَّحِيفَةَ - قَالَ: وَصَحِيفَةٌ مُعَلَّقَةٌ فِي قِرَابِ سَيْفِهِ - فَقَدْ كَذَبَ، فِيهَا أَسْنَانُ الْإِبِلِ، وَأَشْيَاءُ مِنَ الْجِرَاحَاتِ، وَفِيهَا قَالَ النَّبِيُّ صَلَّى اللهُ تَعَالَى عَلَيْهِ وَسَلَّمَ: «الْمَدِينَةُ حَرَمٌ مَا بَيْنَ عَيْرٍ إِلَى ثَوْرٍ، فَمَنْ أَحْدَثَ فِيهَا حَدَثًا [ص:996]، أَوْ آوَى مُحْدِثًا، فَعَلَيْهِ لَعْنَةُ اللهِ وَالْمَلَائِكَةِ وَالنَّاسِ أَجْمَعِينَ، لَا يَقْبَلُ اللهُ مِنْهُ يَوْمَ الْقِيَامَةِ صَرْفًا [ص:998]، وَلَا عَدْلًا، وَذِمَّةُ الْمُسْلِمِينَ وَاحِدَةٌ، يَسْعَى بِهَا أَدْنَاهُمْ، وَمَنِ ادَّعَى إِلَى غَيْرِ أَبِيهِ، أَوِ انْتَمَى إِلَى غَيْرِ مَوَالِيهِ، فَعَلَيْهِ لَعْنَةُ اللهِ وَالْمَلَائِكَةِ وَالنَّاسِ أَجْمَعِينَ، لَا يَقْبَلُ اللهُ مِنْهُ يَوْمَ الْقِيَامَةِ صَرْفًا، وَلَا عَدْلًا» وَانْتَهَى حَدِيثُ أَبِي بَكْرٍ، وَزُهَيْرٍ عِنْدَ قَوْلِهِ «يَسْعَى بِهَا أَدْنَاهُمْ»، وَلَمْ يَذْكُرَا مَا بَعْدَهُ. وَلَيْسَ فِي حَدِيثِهِمَا: مُعَلَّقَةٌ فِي قِرَابِ سَيْفِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10892,
                "hadithNumber": "3328",
                "englishNarrator": "A hadith like this has been narrated on the authority of A'mash with the same chain of transmitters (but at the end) these words are added:",
                "hadithEnglish": "He who violated the covenant with a Muslim, there is upon him the curse of Allah, of angels and of all people. Neither an obligatory act nor a supererogatory act would be accepted from him as recompense on the Day of Resurrection; and in the hadith transmitted by two other narrators these words are not found: He who claimed false paternity. And in the hadith transmitted by Waki' there is no mention of the Day of Resurrection.",
                "hadithUrdu": "\" لہٰذا جس نے کسی مسلمان کی امان تو ڑی اس پر اللہ تعا لیٰ کی ( تمام ) فرشتوں کی اور سب انسانوں کی لعنت ہے قیامت کے دن اس سے کو ئی عذرقبول کیا جا جا ئے گا نہ بدلہ ۔ ان دونوں کی حدیث میں یہ الفا ظ نہیں ہیں \" جس نے اپنے والد کے سوا کسی اور کی نسبت اختیار کی \" اور نہ وکیع کی روایت میں قیامت کے دن کا تذکرہ ہے ۔",
                "urduNarrator": "مجھ سے علی بن حجر السعدی نے بیان کیا، انہوں نے ہم سے بیان کیا علی بن مسہر اور وکیع دونوں نے اعمش سے سی سند کے ساتھ اسی طرح حدیث بیان کی جس طرح آخر تک ابو معاویہ سے ابو کریب کی روایت کردہ حدیث ہے اور ( اسمیں ) یہ اجافہ کیا",
                "hadithArabic": "وحَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، أَخْبَرَنَا عَلِيُّ بْنُ مُسْهِرٍ، ح وحَدَّثَنِي أَبُو سَعِيدٍ الْأَشَجُّ، حَدَّثَنَا وَكِيعٌ، جَمِيعًا عَنِ الْأَعْمَشِ، بِهَذَا الْإِسْنَادِ، نَحْوَ حَدِيثِ أَبِي كُرَيْبٍ، عَنْ أَبِي مُعَاوِيَةَ إِلَى آخِرِهِ، وَزَادَ فِي الْحَدِيثِ: «فَمَنْ أَخْفَرَ مُسْلِمًا فَعَلَيْهِ لَعْنَةُ اللهِ وَالْمَلَائِكَةِ وَالنَّاسِ أَجْمَعِينَ، لَا يُقْبَلُ مِنْهُ يَوْمَ الْقِيَامَةِ صَرْفٌ، وَلَا عَدْلٌ»، وَلَيْسَ فِي حَدِيثِهِمَا: «مَنِ ادَّعَى إِلَى غَيْرِ أَبِيهِ»، وَلَيْسَ فِي رِوَايَةِ وَكِيعٍ ذِكْرُ يَوْمِ الْقِيَامَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10893,
                "hadithNumber": "3329",
                "englishNarrator": "A hadith similar to that of Ibn Mushir and Waki (no. 3328) was narrated by Al-Amash with this chain, except the phrase:",
                "hadithEnglish": "\"Whoever claims to belong to someone other than his Mawla\" and the mention of the curse that is upon him.",
                "hadithUrdu": "\" جس نے اپنے موالی ( آزاد کرنے والوں ) کے علاوہ کسی کی طرف نسبت اختیار کی \" اور اس پر لعنت کا ذکر نہیں ہے ۔",
                "urduNarrator": "مجھ سے عبید اللہ بن عمر القواری اور محمد بن ابی بکر المقدمی نے بیان کیا، کہا: ہم سے عبدالرحمٰن بن مہدی نے بیان کیا، سفیان نے اعمش سے اسی سند کے ساتھ ابن مسہر اور وکیع کی حدیث کی طرح بیان کی مگر اس میں",
                "hadithArabic": "وحَدَّثَنِي عُبَيْدُ اللهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، وَمُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، قَالَا: حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا سُفْيَانُ، عَنِ الْأَعْمَشِ، بِهَذَا الْإِسْنَادِ، نَحْوَ حَدِيثِ ابْنِ مُسْهِرٍ، وَوَكِيعٍ، إِلَّا قَوْلَهُ: «مَنْ تَوَلَّى غَيْرَ مَوَالِيهِ»، وَذِكْرَ اللَّعْنَةِ لَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10894,
                "hadithNumber": "3330",
                "englishNarrator": "Abu Huraira (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Medina is a sacred territory, so he who made any innovation in it. or gave protection to an innovator, there is upon him the curse of Allah, that of the angels and that of all the people. There would not be accepted on the Day of Resurrection either obligatory acts or supererogatory acts from him.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فر مایا : \" مدینہ حرم ہے جس نے اس میں کسی بدعت کا ارتکاب کیا یا کسی بدعت کے مرتکب کو پنا ہ دی اس پر اللہ کی فرشتوں کی اور سب انسانوں کی لعنت ہے ۔ قیامت کے دن اس سے کو ئی عذر قبول کیا جا ئے گا نہ کو ئی بدلہ ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے حسین بن علی الجعفی نے بیان کیا, زائد ہ نے سلیمان سے انھوں نے ابو صالح سے انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ الْجُعْفِيُّ، عَنْ زَائِدَةَ، عَنْ سُلَيْمَانَ، عَنْ أَبِي صَالِح، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْمَدِينَةُ حَرَمٌ، فَمَنْ أَحْدَثَ فِيهَا حَدَثًا، أَوْ آوَى مُحْدِثًا، فَعَلَيْهِ لَعْنَةُ اللهِ وَالْمَلَائِكَةِ وَالنَّاسِ أَجْمَعِينَ، لَا يُقْبَلُ مِنْهُ يَوْمَ الْقِيَامَةِ عَدْلٌ، وَلَا صَرْفٌ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10895,
                "hadithNumber": "3331",
                "englishNarrator": "A hadith like this has been narrated on the authority of A'mash with the same chain of transmitters, but no mention has been made of the Day of Resurrection. But this addition is made:",
                "hadithEnglish": "The protection granted by Muslims is one and must be respected by the humblest of them. And he who broke the covenant made by a Muslim, there is a curse of Allah, of his angels, and of the whole people upon him, and neither an obligatory act nor a supererogatory act would be accepted from him as recompense on the Day of Resurrection.",
                "hadithUrdu": "\" اور تمام مسلمانوں کا ذمہ ایک ( جیسا ) ہے ان کا ادنیٰ آدمی بھی پناہ کی پیش کش کر سکتا ہے جس نے کسی مسلمان کی امان توڑی اس پر اللہ کی فرشتوں کی اور سب انسانوں کی لعنت ہے ۔ قیامت کے دن اس سے کو ئی بدلہ قبول کیا جا ئے گا نہ کو ئی عذر ۔",
                "urduNarrator": "ہم سے ابوبکر بن النضر بن ابی النضر نے بیان کیا، کہا کہ مجھ سے ابو النضر نے بیان کیا، مجھ سے عبید اللہ اشجعی نے بیان کیا, سفیان نے اعمش سے اسی سند کے ساتھ اسی کے مانند روایت کی ، اور انھوں نے \" قیامت کے دن \" کے الفاظ نہیں کہے اور یہ اضافہ کیا",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ النَّضْرِ بْنِ أَبِي النَّضْرِ، حَدَّثَنِي أَبُو النَّضْرِ، حَدَّثَنِي عُبَيْدُ اللهِ الْأَشْجَعِيُّ، عَنْ سُفْيَانَ، عَنِ الْأَعْمَشِ، بِهَذَا الْإِسْنَادِ مِثْلَهُ، وَلَمْ يَقُلْ: «يَوْمَ الْقِيَامَةِ» وَزَادَ: «وَذِمَّةُ الْمُسْلِمِينَ وَاحِدَةٌ يَسْعَى بِهَا أَدْنَاهُمْ، فَمَنْ أَخْفَرَ مُسْلِمًا، فَعَلَيْهِ لَعْنَةُ اللهِ وَالْمَلَائِكَةِ وَالنَّاسِ أَجْمَعِينَ، لَا يُقْبَلُ مِنْهُ يَوْمَ الْقِيَامَةِ عَدْلٌ، وَلَا صَرْفٌ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10896,
                "hadithNumber": "3332",
                "englishNarrator": "Abu Huraira ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "If I were to see deer grazing in Medina, I would have never molested them, for Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) has stated: There is between the two lava mountains a sacred territory.",
                "hadithUrdu": "اگر میں مدینہ میں ہرنیاں چرتی ہو ئی دیکھوں ، تو میں انھیں ہراساں نہیں کروگا ( کیونکہ ) رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اس کے دو سیاہ پتھریلے میدانوں کے درمیان کا علاقہ حرم ہے ۔",
                "urduNarrator": "ہمیں یحییٰ بن یحییٰ نے حدیث سنا ئی کہا : میں نے امام مالک کے سامنے قراءت کی کہ ابن شہاب سے روایت ہے ۔ انھوں نے سعید بن مسیب سے انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، وہ کہا کرتے تھے",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ كَانَ يَقُولُ: لَوْ رَأَيْتُ الظِّبَاءَ تَرْتَعُ بِالْمَدِينَةِ مَا ذَعَرْتُهَا، قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَا بَيْنَ لَابَتَيْهَا حَرَامٌ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10897,
                "hadithNumber": "3333",
                "englishNarrator": "Abu Huraira ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) declared sacred the territory between two lava mountains of Medina. Abu Huraira said: If I were to find deer in the territory between the two mountains, I would not molest them, and he (the Holy Prophet) declared twelve miles of suburb around Medina as a prohibited pasture.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے مدینہ کے دو سیاہ پتھروں والے میدانوں کے درمیانی حصے کو حرم قرار دیا ہے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ نے کہا : اگر میں ان دو سیاہ پتھریلے میدانوں کے درمیان ہرنیوں کو پاؤں تو میں انھیں ہراساں نہیں کروں گا آپ صلی اللہ علیہ وسلم نے مدینہ کے اردگرد بارہ میل کا علاقہ محفوظ چراگاہ قراردیا ہے ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم، محمد بن رافع اور عبد بن حمید نے بیان کیا کہ ہم کو عبدالرزاق نے خبر دی, معمر نے ہمیں زہری سے حدیث بیان کی انھوں نے سعید بن مسیب سے انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ إِسْحَاقُ: أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: «حَرَّمَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مَا بَيْنَ لَابَتَيِ الْمَدِينَةِ»، قَالَ أَبُو هُرَيْرَةَ: «فَلَوْ وَجَدْتُ الظِّبَاءَ مَا بَيْنَ لَابَتَيْهَا مَا ذَعَرْتُهَا»، وَجَعَلَ اثْنَيْ عَشَرَ مِيلًا حَوْلَ الْمَدِينَةِ حِمًى.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10898,
                "hadithNumber": "3334",
                "englishNarrator": "Abu Huraira ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "When the people saw the first fruit (of the season or of plantation) they brought it to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). When he received it he said: O Allah, bless us in our fruits; and bless us in our city; and bless us in our sa's and bless us in our mudd. O Allah, Ibrahim was Thy servant, Thy friend, and Thy apostle; and I am Thy servant and Thy apostle. He (Ibrahim) made supplication to Thee for (the showering of blessings upon) Mecca, and I am making supplication to Thee for Medina just as he made supplication to Thee for Mecca, and the like of it in addition. He would then call to him the youngest child and give him these fruits.",
                "hadithUrdu": "لوگ جب ( کسی موسم کا ) پہلا پھل دیکھتے تو اسے نبی صلی اللہ علیہ وسلم کی خدمت میں لے آتے رسول اللہ صلی اللہ علیہ وسلم جب اسے پکڑ تے تو فرماتے اے اللہ !ہمارے پھلوں میں برکت عطا فرما ۔ ہمارے لیے شہر ( مدینہ ) میں برکت عطا فرما ہمارے لیے ہمارے صاع میں بر کت عطا فر ما اور ہمارے مد میں بر کت عطا فر ما ۔ اےاللہ !بلا شبہ ابرا ہیم ؑتیرے بندے تیرے خلیل اور تیرے نبی تھے میں تیرا بندہ اور نبی ہوں انھوں نے تجھ سے مکہ کے لیے دعا کی ، میں تجھ سے مدینہ کے لیے اتنی ( برکت ) کی دعا کرتا ہوں جو انھوں نے مکہ کے لیے کی اور اس کے ساتھ اتنی ہی مزید برکت کی بھی ۔ ( با ہریرہ رضی اللہ تعالیٰ عنہ نے ) کہا : پھر آپ اپنے بچوں میں سب سے چھوٹے بچے کو بلا تے اور وہ پھل اسے دے دیتے ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, امام مالک بن انس کے سامنے جن احادیث کی قراءت کی گئی ان میں سے سہیل بن ابی صالح نے اپنے والد سے اور انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، فِيمَا قُرِئَ عَلَيْهِ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِح، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ: كَانَ النَّاسُ إِذَا رَأَوْا أَوَّلَ الثَّمَرِ جَاءُوا بِهِ إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَإِذَا أَخَذَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «اللهُمَّ بَارِكْ لَنَا فِي ثَمَرِنَا، وَبَارِكْ لَنَا فِي مَدِينَتِنَا، وَبَارِكْ لَنَا فِي صَاعِنَا، وَبَارِكْ لَنَا فِي مُدِّنَا، اللهُمَّ إِنَّ إِبْرَاهِيمَ عَبْدُكَ وَخَلِيلُكَ وَنَبِيُّكَ، وَإِنِّي عَبْدُكَ وَنَبِيُّكَ، وَإِنَّهُ دَعَاكَ لِمَكَّةَ، وَإِنِّي أَدْعُوكَ لِلْمَدِينَةِ بِمِثْلِ مَا دَعَاكَ لِمَكَّةَ، وَمِثْلِهِ مَعَهُ»، قَالَ: ثُمَّ يَدْعُو أَصْغَرَ وَلِيدٍ لَهُ فَيُعْطِيهِ ذَلِكَ الثَّمَرَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10899,
                "hadithNumber": "3335",
                "englishNarrator": "Abu Huraira (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was given the first fruit and he said: O Allah, shower blessings upon us in our city, and in our fruits, in our mudd and in our sa's, blessings upon blessings, and he would then give that to the youngest of the children present there.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے سامنے جب ( کسی موسم کا ) پہلا پھل پیش کیا جا تا تو آپ فر ما تے : \" اے اللہ !ہمارے لیے ہمارے شہر ( مدینہ ) میں ہمارے پھلوں میں ہمارے مد میں اور ہمارے صاع میں برکت پر بر کت فر ما \" پھر آپ وہ پھل اپنے پاس موجود بچوں میں سب سے چھوٹے بچے کو دے دیتے ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے بیان کیا عبد العزیز بن محمد مدنی نے ہمیں سہیل بن ابی صالح سے خبر دی انھوں نے اپنے والد سے انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ الْمَدَنِيُّ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِح، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ يُؤْتَى بِأَوَّلِ الثَّمَرِ، فَيَقُولُ: «اللهُمَّ بَارِكْ لَنَا فِي مَدِينَتِنَا، وَفِي ثِمَارِنَا، وَفِي مُدِّنَا، وَفِي صَاعِنَا بَرَكَةً مَعَ بَرَكَةٍ»، ثُمَّ يُعْطِيهِ أَصْغَرَ مَنْ يَحْضُرُهُ مِنَ الْوِلْدَانِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10900,
                "hadithNumber": "3336",
                "englishNarrator": "Abu Sa'id Maula al-Mahri reported:",
                "hadithEnglish": "They were hard pressed by the distress and hardship of Medina, and he come to Abu Sa'Id al-Khudri رضی اللہ تعالیٰ عنہ and said to him: I have a large family (to support) and we are enduring hardships; I have, therefore, made up my mind to take my family to some fertile land. Thereupon Abu Sa'id رضی اللہ تعالیٰ عنہ said: Don't do that, stick to Medina, for we have come out with Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), and (I think that he also said) until we reached 'Usfan, and he (the Prophet along with his Companions) stayed there for some nights. There the people said: By Allah, we are lying here idle, whereas our children are unprotected behind us, and we do not feel secure about them. This (apprehension of theirs) reached Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), whereupon he said: What is this matter concerning you that has reached me? (I do not retain how he said it, whether he said like this: ) By Him (in the name of Whom) I take oath, (or he said like this: ) By Him in Whose Hand is my life, I made up my mind or if you like (I do not retain what word did he actually say), I should command my camel to proceed and not to let it halt until it comes to Medina and then said: Ibrahim declared Mecca as the sacred territory and it became sacred, and I declare Medina as the sacred territory-the area between the two mountains ('Air and Uhud). Thus no blood is to be shed within its (bounds) and no weapon is to be carried for fighting, and the leaves of the trees there should not be beaten off except for fodder. O Allah, bless us in our city; O Allah, bless us in our sil; O Allah, bless us in our mudd; O Allah, bless us in our sa; O Allah, bless us in our mudd. O Allah, bless us in our city. O Allah, bless with this blessing two more blessings. By Him in Whose Hand is my life, there is no ravine or mountain path of Medina which is not protected by two angels until you reach there. (He then said to the people: ) Proceed, and we, therefore, proceeded and we came to Medina By Him (in Whose name) we take oath and (in Whose name) oath is taken (Hammad is in doubt about it), we had hardly put down our camel saddles on arriving at Medina that we were attacked by the people of the tribe of 'Abdullah b. Ghatafan but none dared to do it before.",
                "hadithUrdu": "انھیں مدینہ میں بدحالی اورسختی نےآلیا ، وہ ابو سعید خدری رضی اللہ تعالیٰ عنہ کے پاس آئے اور ان سے کہا : میں کثیر العیال ہوں اورہمیں تنگدستی نے آلیا ہے ، میرا ارادہ ہے کہ میں ا پنے افراد خانہ کو کسی سر سبز وشاداب علاقے کی طرف منتقل کردوں ۔ تو ابو سعید خدری رضی اللہ تعالیٰ عنہ نےکہا : ایسا مت کرنا ، مدینہ میں ہی ٹھہرے رہو ، کیونکہ ہم اللہ کے نبی کریم صلی اللہ علیہ وسلم کے ساتھ ( سفر پر ) نکلے ۔ میرا خیال ہے انھوں نےکہا ۔ حتیٰ کہ ہم عسفان پہنچے ۔ آپ صلی اللہ علیہ وسلم نے وہاں چند راتیں قیام فرمایا ، تو لوگوں نے کہا : ہم یہاں کسی خاص مقصد کے تحت نہیں ٹھہر ے ہوئے ، اور ہمارے افراد خانہ پیچھے ( اکیلے ) ہیں ہم انھیں محفوظ نہیں سمجھتے ، ان کی یہ بات نبی صلی اللہ علیہ وسلم تک پہنچی تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" یہ کیا بات ہے جو تمھاری طرف سے مجھے پہنچی ہے؟ \" ۔ میں نہیں جانتا آپ صلی اللہ علیہ وسلم نےکس طرح فرمایا ۔ \" اس ذات کی قسم جس کی میں قسم کھاتا ہوں ۔ \" یا ( فرمایا ) \" اس ذات کی قسم جس کے ہاتھ میں میری جان ہے!میں نےارادہ کیایا ( فرمایا ) اگرتم چاہو ۔ میں نہیں جانتا کہ آپ نے ان دونوں میں سے کون سا جملہ ارشاد فرمایا : میں اپنی اونٹنی پر پالان رکھنے کا حکم د وں ، پھر اس کی ایک گرہ بھی نہ کھولوں یہاں تک کہ مدینہ پہنچ جاؤں ۔ \" اور آپ صلی اللہ علیہ وسلم نے فرمایا؛ \" اے اللہ!بلاشبہ ابراہیم علیہ السلام نے مکہ کی حرمت کا اعلان کیا ، اور اسے حرم بنایا ، اور میں نے مدینہ کو اس کے دونوں پہاڑوں کے درمیان کو حرمت والا قرار دیا کہ اس میں خون نہ بہایا جائے ، اس میں لڑائی کے لئے اسلحہ نہ اٹھایا جائے اور اس میں چارے کے سوا ( کسی اورغرض سے ) اس کے درختوں کے پتے نہ جھاڑے جائیں ۔ اے اللہ !ہمارے لئے ہمارے شہر ( مدینہ ) میں برکت عطا فرما ۔ اے اللہ !ہمارے لئے ہمارے صاع میں برکت عطا فرما ، اے اللہ!ہمارے لیے ہمارے مد میں برکت عطا فرما ، اے اللہ !ہمارے لئے ہمارے صاع میں برکت عطا فرما ، اے اللہ!ہمارے لیے ہمارے مد میں برکت عطا فرما ، اے اللہ !ہمارے لئے ہمارے شہر ( مدینہ ) میں برکت عطا فرما ۔ اور اس برکت کے ساتھ دو برکتیں ( مزید عطا ) کردے ۔ اس ذات کی قسم جس کے ہاتھ میں میری جان ہے!مدینہ کی کوئی گھاٹی اور درہ نہیں مگر اس پر دوفرشتے ہیں جو اس کی حفاظت کریں گے یہاں تکہ کہ تم اس میں واپس آجاؤ ۔ \" پھر آپ صلی اللہ علیہ وسلم نے لوگوں سے فرمایا \" کوچ کرو ۔ \" تو ہم نے کوچ کیا اور مدینہ آگئے ۔ اس ذات کی قسم جس کی ہم قسم کھاتے ہیں! یا جس کی قسم کھائی جاتی ہے ۔ یہ شک حماد کی طرف سےہے ۔ مدینہ میں داخل ہوکر ہم نے اپنی سواریوں کے پالان بھی نہیں اتارے تھے کہ بنو عبداللہ بن غطفان نے ہم پر حملہ کردیا اور اس سے پہلے کوئی چیز انھیں مشتعل نہیں کررہی تھی ۔",
                "urduNarrator": "حماد بن اسماعیل بن علیہ نے ہمیں ہمیں حدیث بیا ن کی ، ( کہا : ) ہمیں میرے والد نے وہیب سے حدیث بیان کی ، انھوں نے یحییٰ بن ابی اسحاق سے روایت کی کہ انھوں نےمہری کےمولیٰ ابو سعید سے حدیث بیان کی کہ",
                "hadithArabic": "حَدَّثَنَا حَمَّادُ بْنُ إِسْمَاعِيلَ ابْنِ عُلَيَّةَ، حَدَّثَنَا أَبِي، عَنْ وُهَيْبٍ، عَنْ يَحْيَى بْنِ أَبِي إِسْحَاقَ، أَنَّهُ حَدَّثَ عَنْ أَبِي سَعِيدٍ، مَوْلَى الْمَهْرِيِّ، أَنَّهُ أَصَابَهُمْ بِالْمَدِينَةِ جَهْدٌ وَشِدَّةٌ، وَأَنَّهُ أَتَى أَبَا سَعِيدٍ الْخُدْرِيَّ، فَقَالَ لَهُ: إِنِّي كَثِيرُ الْعِيَالِ، وَقَدْ أَصَابَتْنَا شِدَّةٌ، فَأَرَدْتُ أَنْ أَنْقُلَ عِيَالِي إِلَى بَعْضِ الرِّيفِ، فَقَالَ أَبُو سَعِيدٍ: لَا تَفْعَلْ، الْزَمِ الْمَدِينَةَ، فَإِنَّا خَرَجْنَا مَعَ نَبِيِّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - أَظُنُّ أَنَّهُ قَالَ - حَتَّى قَدِمْنَا عُسْفَانَ، فَأَقَامَ بِهَا لَيَالِيَ، فَقَالَ النَّاسُ: وَاللهِ مَا نَحْنُ هَا هُنَا فِي شَيْءٍ، وَإِنَّ عِيَالَنَا لَخُلُوفٌ مَا نَأْمَنُ عَلَيْهِمْ، فَبَلَغَ ذَلِكَ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «مَا هَذَا الَّذِي بَلَغَنِي مِنْ حَدِيثِكُمْ؟» - مَا أَدْرِي كَيْفَ قَالَ - «وَالَّذِي أَحْلِفُ بِهِ - أَوْ وَالَّذِي نَفْسِي بِيَدِهِ - لَقَدْ هَمَمْتُ - أَوْ إِنْ شِئْتُمْ لَا أَدْرِي أَيَّتَهُمَا قَالَ - لَآمُرَنَّ بِنَاقَتِي تُرْحَلُ، ثُمَّ لَا أَحُلُّ لَهَا عُقْدَةً حَتَّى أَقْدَمَ الْمَدِينَةَ»، وَقَالَ: «اللهُمَّ إِنَّ إِبْرَاهِيمَ حَرَّمَ مَكَّةَ فَجَعَلَهَا حَرَمًا، وَإِنِّي حَرَّمْتُ الْمَدِينَةَ حَرَامًا مَا بَيْنَ مَأْزِمَيْهَا، أَنْ لَا يُهْرَاقَ فِيهَا دَمٌ، وَلَا يُحْمَلَ فِيهَا سِلَاحٌ لِقِتَالٍ، وَلَا تُخْبَطَ فِيهَا شَجَرَةٌ إِلَّا لِعَلْفٍ، اللهُمَّ بَارِكْ لَنَا فِي مَدِينَتِنَا، اللهُمَّ بَارِكْ لَنَا فِي صَاعِنَا، اللهُمَّ بَارِكْ لَنَا فِي مُدِّنَا، اللهُمَّ بَارِكْ لَنَا فِي صَاعِنَا، اللهُمَّ بَارِكْ لَنَا فِي مُدِّنَا، اللهُمَّ بَارِكْ لَنَا فِي مَدِينَتِنَا، اللهُمَّ اجْعَلْ مَعَ الْبَرَكَةِ بَرَكَتَيْنِ، وَالَّذِي نَفْسِي بِيَدِهِ، مَا مِنَ الْمَدِينَةِ شِعْبٌ، وَلَا نَقْبٌ إِلَّا عَلَيْهِ مَلَكَانِ يَحْرُسَانِهَا حَتَّى تَقْدَمُوا إِلَيْهَا»، ثُمَّ قَالَ لِلنَّاسِ: «ارْتَحِلُوا»، فَارْتَحَلْنَا، فَأَقْبَلْنَا إِلَى الْمَدِينَةِ، فَوَالَّذِي نَحْلِفُ بِهِ أَوْ يُحْلَفُ بِهِ - الشَّكُّ مِنْ حَمَّادٍ - مَا وَضَعْنَا رِحَالَنَا حِينَ دَخَلْنَا الْمَدِينَةَ حَتَّى أَغَارَ عَلَيْنَا بَنُو عَبْدِ اللهِ بْنِ غَطَفَانَ، وَمَا يَهِيجُهُمْ قَبْلَ ذَلِكَ شَيْءٌ.",
                "headingArabic": "التَّرْغِيبِ فِي سُكْنَى الْمَدِينَةِ وَالصَّبْرِ عَلَى لأْوَائِهَا ‏‏",
                "headingUrdu": "مدینہ منورہ میں رہنے کی ترغیب اور اس کی تکالیف اور مشکلات پر صبر کرنا",
                "headingEnglish": "Encouragement to live in Al-Madinah and to be patient on bearing its distress and hardships",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10901,
                "hadithNumber": "3337",
                "englishNarrator": "Abu Sa'id al-Kbudri (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: O Allah, bless us in our sa' and mud and shower with its blessings two other blessings (multiply blessings showerted upon it).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ! نے فرمایا : \" اللہ ہمارے! مد اور صاع میں برکت عطا فرما اورایک برکت کے ساتھ دو برکتیں ( مزید ) عطافرما ۔ \"",
                "urduNarrator": "ہم سے زہیر بن حرب نے بیان کیا، ہم سے اسماعیل بن علیہ نے بیان کیا، علی بن مبارک سے روایت ہے ، ( کہا : ) ہمیں یحییٰ بن ابی کثیر نے حدیث بیان کی ، ( کہا : ) ہمیں مہری کے مولیٰ ابوسعید نے حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ سے حدیث بیان کی کہ",
                "hadithArabic": "وحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ عَلِيِّ بْنِ الْمُبَارَكِ، حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ، حَدَّثَنَا أَبُو سَعِيدٍ، مَوْلَى الْمَهْرِيِّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «اللهُمَّ بَارِكْ لَنَا فِي صَاعِنَا وَمُدِّنَا، وَاجْعَلْ مَعَ الْبَرَكَةِ بَرَكَتَيْنِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10902,
                "hadithNumber": "3338",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been narrated by Yabya bin Abu Kathir with the same chain of transmitters.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے عبید اللہ بن موسیٰ نے بیان کیا، کہا ہم سے شیبان اورحرب ، یعنی ابن شداد دونوں نے یحییٰ بن ابی کثیر سے اسی سندکے ساتھ ، اسی کے مانند حدیث بیان کی .",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُوسَى، أَخْبَرَنَا شَيْبَانُ، ح وحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا حَرْبٌ يَعْنِي ابْنَ شَدَّادٍ، كِلَاهُمَا عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ بِهَذَا الْإِسْنَادِ، مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10903,
                "hadithNumber": "3339",
                "englishNarrator": "Abu Sa'id Maula al-Mahri reported:",
                "hadithEnglish": "He came to Abu Sa'id al-Khudri رضی اللہ عنہ during the nights (of the turmoil) of al-Barrah, and sought his advice about leaving Medina, and complained of the high prices prevailing therein and his large family, and informed him that he could not stand the hardships of Medina and its rugged surrounding. He said to him: Woe to you; I will not advise you to do it, for I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: No one will endure hardships of Medina without my being an intercessor or a witness on his behalf on the Day of Resurrection), if he is a Muslim.",
                "hadithUrdu": "ابو سعید سے روایت کی وہ سیدنا ابو سعید خدری رضی اللہ عنہ کے پاس حرہ کی راتوں میں آئے ( یعنی جن دنوں مدینہ طیبہ میں ایک فتنہ مشہور ہوا تھا اور ظالموں نے مدینہ کو لوٹا تھا ) اور ان سے مشورہ کیا کہ مدینہ سے کہیں اور چلے جائیں اور ان سے وہاں کی گرانی نرخ ( مہنگائی ) اور کثرت عیال کی شکایت کی اور خبر دی کہ مجھے مدینہ کی محنت اور بھوک پر صبر نہیں آ سکتا تو سیدنا ابو سعید خدری رضی اللہ عنہ نے کہا کہ تیری خرابی ہو میں تجھے اس کا مشورہ نہیں دوں گا ( کیونکہ ) میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے کہ وہ فرماتے تھے کہ کوئی شخص یہاں کی تکلیفوں پر صبر نہیں کرتا اور پھر مر جاتا ہے ، مگر یہ کہ میں قیامت کے دن اس کا شفیع یا گواہ ہوں گا اگر وہ مسلمان ہو ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ہم سے لیث نے بیان کیا،سعید بن ابوسعید نے مہری کے آزاد کردہ غلام",
                "hadithArabic": "وحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِي سَعِيدٍ، مَوْلَى الْمَهْرِيِّ، أَنَّهُ جَاءَ أَبَا سَعِيدٍ الْخُدْرِيَّ لَيَالِي الْحَرَّةِ، فَاسْتَشَارَهُ فِي الْجَلَاءِ مِنَ الْمَدِينَةِ، وَشَكَا إِلَيْهِ أَسْعَارَهَا وَكَثْرَةَ عِيَالِهِ، وَأَخْبَرَهُ أَنْ لَا صَبْرَ لَهُ عَلَى جَهْدِ الْمَدِينَةِ وَلَأْوَائِهَا، فَقَالَ لَهُ: وَيْحَكَ لَا آمُرُكَ بِذَلِكَ، إِنِّي سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا يَصْبِرُ أَحَدٌ عَلَى لَأْوَائِهَا، فَيَمُوتَ، إِلَّا كُنْتُ لَهُ شَفِيعًا - أَوْ شَهِيدًا - يَوْمَ الْقِيَامَةِ إِذَا كَانَ مُسْلِمًا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10904,
                "hadithNumber": "3340",
                "englishNarrator": "Abdul-Rahman reported on the authority of his father Abu Sa'id (رضی اللہ عنہ):",
                "hadithEnglish": "He heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: I have declared sacred what is between the two lava grounds of Medina just as Ibrahim (peace be upon him) declared Mecca as sacred. He (the narrator) then said: Abu Sa'id رضی اللہ عنہ caught hold of (Abu Bakr, another narrator, used the word found ) a bird in his hand and then released it from his hand and set it free.",
                "hadithUrdu": "انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم فرمارہے تھے : \" میں مدینہ کی دوسیاہ پتھروں والی زمین کے درمیانی حصے کوحرم قرار دیتا ہوں ، جیسے ابراہیم علیہ السلام نے مکہ کوحرم قرار دیا تھا ۔ \" کہا : پھر ابو سعید رضی اللہ تعالیٰ عنہ ہم میں سے کسی کو پکڑ لیتے ، اور ابو بکر نے کہا : ہم میں سے کسی کو دیکھتے کہ اس کے ہاتھ میں پرندہ ہے ۔ تو اسے اس کے ہاتھ سے چھڑاتے ، پھر اسے آزاد کردیتے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، محمد بن عبداللہ بن نمیر اور ابو کریب نے ابو اسامہ کی سند سے بیان کیا اور یہ قول ابوبکر کا ہے۔ اور ابن نمیر نے کہا: ہم سے ابو اسامہ نے بیان کیا، ولید بن کثیر کی سند سے، انہوں نے مجھ سے بیان کیا سعید بن عبدالرحمن بن ابی سعیدخدری رضی اللہ تعالیٰ عنہ نے حدیث بیان کی کہ عبدالرحمن نے انھیں اپنےوالد ابوسعید رضی اللہ عنہ سے حدیث بیان کی",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، وَأَبُو كُرَيْبٍ، جَمِيعًا عَنْ أَبِي أُسَامَةَ، وَاللَّفْظُ لِأَبِي بَكْرٍ، وَابْنِ نُمَيْرٍ، قَالَا: حَدَّثَنَا أَبُو أُسَامَةَ، عَنِ الْوَلِيدِ بْنِ كَثِيرٍ، حَدَّثَنِي سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ عَبْدَ الرَّحْمَنِ، حَدَّثَهُ، عَنْ أَبِيهِ أَبِي سَعِيدٍ، أَنَّهُ سَمِعَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: «إِنِّي حَرَّمْتُ مَا بَيْنَ لَابَتَيِ الْمَدِينَةِ كَمَا حَرَّمَ إِبْرَاهِيمُ مَكَّةَ»، قَالَ: ثُمَّ كَانَ أَبُو سَعِيدٍ يَأْخُذُ، وَقَالَ أَبُو بَكْرٍ: يَجِدُ أَحَدَنَا فِي يَدِهِ الطَّيْرُ، فَيَفُكُّهُ مِنْ يَدِهِ، ثُمَّ يُرْسِلُهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10905,
                "hadithNumber": "3341",
                "englishNarrator": "Sahl bin Hunif رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) pointed with his hands towards Medina and said: That is a sacred territory and a place of safety.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے اپنے ہاتھ سے مدینہ کی طرف اشارہ کیا اورفرمایا : \" بلاشبہ یہ حرم ہے ، امن والاہے ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے علی بن مسہر نے بیان کیا، انہوں نے شیبانی کی سند سے یاسر بن عمرو کی سند سے, سہل بن حنیف رضی اللہ تعالیٰ عنہ سے روایت ہے ، انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنِ الشَّيْبَانِيِّ، عَنْ يُسَيْرِ بْنِ عَمْرٍو، عَنْ سَهْلِ بْنِ حُنَيْفٍ، قَالَ: أَهْوَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِيَدِهِ إِلَى الْمَدِينَةِ، فَقَالَ: «إِنَّهَا حَرَمٌ آمِنٌ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10906,
                "hadithNumber": "3342",
                "englishNarrator": "A'isha (رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "When we came to Medina, and it was an unhealthy, uncogenial place, Abu Bakr رضی اللہ تعالیٰ عنہا fell sick and Bilal رضی اللہ تعالیٰ عنہ also fell sick; and when Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saw the illness of his Companions he said: O Allah, make Medina as congenial to us as you made Mecca congenial or more than that; make it conducive to health, and bleesus in its sa' and in its mudd, and transfer its fever to al-juhfa.",
                "hadithUrdu": "جب ہم مدینہ میں ( ہجرت کر کے ) آئے تو وہاں وبائی بخار پھیلا ہوا تھا ۔ اور سیدنا ابوبکر رضی اللہ عنہ اور سیدنا بلال رضی اللہ عنہ بیمار ہو گئے پھر جب رسول اللہ صلی اللہ علیہ وسلم نے اپنے اصحاب کی بیماری دیکھی تو دعا کی کہ اے اللہ! ہمارے مدینہ کو ہمارے لئے دوست کر دے جیسے تو نے مکہ کو دوست کیا تھا یا اس سے بھی زیادہ اور اس کو صحت کی جگہ بنا دے اور ہمیں اس کے ”صاع“ اور ”مد“ میں برکت دے اور اس کے بخار کو جحفہ کی طرف پھیر دے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، انہوں نے کہا عبدہ نے ہمیں ہشام سے حدیث بیان کی ، انھوں نے اپنے والدسے اورانھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا کہتی ہیں کہ",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ: قَدِمْنَا الْمَدِينَةَ وَهِيَ وَبِيئَةٌ، فَاشْتَكَى أَبُو بَكْرٍ، وَاشْتَكَى بِلَالٌ، فَلَمَّا رَأَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ شَكْوَى أَصْحَابِهِ، قَالَ: «اللهُمَّ حَبِّبْ إِلَيْنَا الْمَدِينَةَ كَمَا حَبَّبْتَ مَكَّةَ أَوْ أَشَدَّ، وَصَحِّحْهَا، وَبَارِكْ لَنَا فِي صَاعِهَا وَمُدِّهَا، وَحَوِّلْ حُمَّاهَا إِلَى الْجُحْفَةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10907,
                "hadithNumber": "3343",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated by Hisham bin 'Urwa with the same chain of transmitters.",
                "hadithUrdu": "ہم سے ابو کریب نے بیان کیا، انہوں نے کہا ابو اسامہ اور ابن نمیر دونوں نے ہشام بن عروہ سے اسی سند کےساتھ اسی کے ہم معنی حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، وَابْنُ نُمَيْرٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ بِهَذَا الْإِسْنَادِ، نَحْوَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10908,
                "hadithNumber": "3344",
                "englishNarrator": "Ibn 'Umar (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who patiently endures the hardships of it (of this city of Medina), I would be an intercessor or a witness on his behalf on the Day of Resurrection.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم فرمارہے تھے : \" جس نے اس ( مدینہ ) کی تنگ دستی پر صبر کیا ، میں قیامت کے دن اس کے لئے سفارشی ہوں گایا گواہ ۔ \"",
                "urduNarrator": "ہم سے زہیر بن حرب نے بیان کیا، کہا ہم سے عثمان بن عمر نے بیان کیا، کہا ہم سے عیسیٰ بن حفص بن عاصم نے بیان کیا، انہوں نے کہا نافع نے ہمیں حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے حدیث بیان کی ، انھوں نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، أَخْبَرَنَا عِيسَى بْنُ حَفْصِ بْنِ عَاصِمٍ، حَدَّثَنَا نَافِعٌ، عَنِ ابْنِ عُمَرَ، قَالَ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ صَبَرَ عَلَى لَأْوَائِهَا، كُنْتُ لَهُ شَفِيعًا أَوْ شَهِيدًا يَوْمَ الْقِيَامَةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10909,
                "hadithNumber": "3345",
                "englishNarrator": "Yuhannis, the freed slave of Zubair, narrated:",
                "hadithEnglish": "When he was sitting with Abdullah bin 'Umar (رضی اللہ تعالیٰ عنہ) during the days of turmoil, his freed slave-girl came to him. After saluting him she said: Abu Abdul-Rahman, I have decided to leave (Medina) for the time is hard for us, whereupon Abdullah رضی اللہ تعالیٰ عنہ said to her: Stay here, foolish lady, for I have heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: For one who shows endurance on the hardships and rigour of it (of Medina) I would be an intercessor or a witness on his behalf on the Day of Resurrection.",
                "hadithUrdu": "میں حضرت عبداللہ بن عمر رضی اللہ تعالیٰ عنہ کے پاس بیٹھے ہوئے تھے ، ان کے پاس ان کی ایک آزاد کردہ لونڈی سلام کرنے پر حاضر ہوئی اور عرض کی : ابو عبدالرحمن ! ہمارےلیے گزرا اوقات مشکل ہوگئی ہے لہذا میں مدینہ سے نقل مکانی کرنا چاہتی ہوں ۔ اس پر حضرت عبداللہ رضی اللہ تعالیٰ عنہ نے اس سے کہا : ( یہیں مدینہ میں ) بیٹھی رہو ، نادان عورت! بلاشبہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے سنا : \" کوئی بھی اس تنگدستی اور سختی پر صبر نہیں کرتا مگر قیامت کےدن میں اس کے لئے گواہ ہوں گا یاسفارشی ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے پڑھا امام مالک نے قطن بن وہب بن عویمر بن اجدع سےروایت کی ، انھوں نے حضرت زبیر کے آزاد کردہ غلام یحس سے روایت کی ، انھوں نے انھیں ( قطن کو ) خبردی کہ وہ فتنہ ( واقعہ حرہ ) کے دوران",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ قَطَنِ بْنِ وَهْبِ بْنِ عُوَيْمِرِ بْنِ الْأَجْدَعِ، عَنْ يُحَنَّسَ، مَوْلَى الزُّبَيْرِ، أَخْبَرَهُ أَنَّهُ كَانَ جَالِسًا عِنْدَ عَبْدِ اللهِ بْنِ عُمَرَ فِي الْفِتْنَةِ، فَأَتَتْهُ مَوْلَاةٌ لَهُ تُسَلِّمُ عَلَيْهِ، فَقَالَتْ: إِنِّي أَرَدْتُ الْخُرُوجَ، يَا أَبَا عَبْدِ الرَّحْمَنِ، اشْتَدَّ عَلَيْنَا الزَّمَانُ، فَقَالَ لَهَا عَبْدُ اللهِ: اقْعُدِي لَكَاعِ، فَإِنِّي سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: «لَا يَصْبِرُ عَلَى لَأْوَائِهَا وَشِدَّتِهَا أَحَدٌ، إِلَّا كُنْتُ لَهُ شَهِيدًا أَوْ شَفِيعًا يَوْمَ الْقِيَامَةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10910,
                "hadithNumber": "3346",
                "englishNarrator": "Abdullah bin 'Umar (رضی اللہ عنہ) said:",
                "hadithEnglish": "I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who patiently endured the hardships and rigours of (this city, i.e. Medina), I would be his witness and intercessor on the Day of Resurrection.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا : \" جس نے اس ( شہر ) کی تنگدستی اورسختی پر صبر کیا ، میں قیامت کے دن اس کا گواہ ہوں گایا سفارشی ۔ \" ان کی مراد مدینہ سے تھی ۔",
                "urduNarrator": "ہم سے ابن رافع نے بیان کیا، کہا ہم سے ابن ابی فدیک نے بیان کیا، انہوں نے کہا ضحاک نے ہمیں قطن خزاعی سے خبر دی ، انھوں نے مصعب کے مولیٰ یحس سے ، انھوں نے حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا ابْنُ رَافِعٍ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، أَخْبَرَنَا الضَّحَّاكُ، عَنْ قَطَنٍ الْخُزَاعِيِّ، عَنْ يُحَنَّسَ، مَوْلَى مُصْعَبٍ، عَنْ عَبْدِ اللهِ بْنِ عُمَرَ، قَالَ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: «مَنْ صَبَرَ عَلَى لَأْوَائِهَا وَشِدَّتِهَا، كُنْتُ لَهُ شَهِيدًا أَوْ شَفِيعًا يَوْمَ الْقِيَامَةِ» يَعْنِي الْمَدِينَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10911,
                "hadithNumber": "3347",
                "englishNarrator": "Abu Huraira (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: For one among my Ummah who shows endurance against the hardships and rigours of Medina, I would be an intercessor or a witness on his behalf on the Day of Resurrection.",
                "hadithUrdu": "اللہ کے رسول صلی اللہ علیہ وسلم نےفرمایا : \" میری امت میں سے کوئی شخص مدینہ کی تنگدستی اور مشقت پر صبر نہیں کرتا مگر قیامت کےدن ، میں اس کا سفارشی یاگواہ ہوں گا ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن ایوب، قتیبہ اور ابن حجر نے اسماعیل بن جعفر کی سند سے بیان کیا, علاء بن عبدالرحمن ( بن یعقوب ) نے اپنے والدسے ، انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی",
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ حُجْرٍ، جَمِيعًا عَنْ إِسْمَاعِيلَ بْنِ جَعْفَرٍ، عَنِ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَصْبِرُ عَلَى لَأْوَاءِ الْمَدِينَةِ وَشِدَّتِهَا أَحَدٌ مِنْ أُمَّتِي، إِلَّا كُنْتُ لَهُ شَفِيعًا يَوْمَ الْقِيَامَةِ أَوْ شَهِيدًا»،",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10912,
                "hadithNumber": "3348",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been narrated on the authority of Abu Huraira (رضی اللہ تعالیٰ عنہ) through another chain of transmitters.",
                "hadithUrdu": "ہم سے ابن ابی عمر نے بیان کیا، ہم سے سفیان نے بیان کیا، ان سے ابو ہارون موسیٰ بن ابی عیسیٰ نے بیان کیا کہ انہوں نے سنا ابو عبداللہ قر اظ کہتے ہیں : میں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ کو یہ کہتے ہوئے سنا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ۔ ۔ ۔ ( آگے ) اسی کے مانند ہے ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي هَارُونَ مُوسَى بْنِ أَبِي عِيسَى، أَنَّهُ سَمِعَ أَبَا عَبْدِ اللهِ الْقَرَّاظَ، يَقُولُ: سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10913,
                "hadithNumber": "3349",
                "englishNarrator": "Abu Huraira ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) as saying: None who shows endurance on the hardships of Medina,... (the rest of the hadith is the same).",
                "hadithUrdu": "\" رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کوئی بھی مدینہ کی مشقتوں پرصبر نہیں ۔ کرتا \" ۔ ۔ ۔ ( آگے ) اسی کے مانند ہے ۔",
                "urduNarrator": "ہم سے یوسف بن عیسیٰ نے بیان کیا، کہا ہم سے الفضل بن موسیٰ نے بیان کیا، ہم سے ہشام بن عروہ نے بیان کیا, صالح بن ابو صالح نے اپنے والد سے ، انھوں نے حضرت ابوہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وحَدَّثَنَا يُوسُفُ بْنُ عِيسَى، حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ صَالِحِ بْنِ أَبِي صَالِح، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يَصْبِرُ أَحَدٌ عَلَى لَأْوَاءِ الْمَدِينَةِ» بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 10601,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=424",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=422",
                "label": "422",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=423",
                "label": "423",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=424",
                "label": "424",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=425",
                "label": "425",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=426",
                "label": "426",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=427",
                "label": "427",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=428",
                "label": "428",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=426",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=426",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=424",
        "to": 10625,
        "total": 40465
    }
}