{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 558,
        "data": [
            {
                "id": 14214,
                "hadithNumber": "6651",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When any one of you fights with his brother he should avoid striking at the face.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم میں سے کوئی شخص اپنے ( مسلمان ) بھائی سے لڑے تو چہرے ( پر مارنے ) سے اجتناب کرے ۔ \"",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ بن قعنب نے بیان کیا, مغیرہ حزامی نے ہمیں ابوزناد سے حدیث بیان کی ، انہوں نے اعرج سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ حَدَّثَنَا الْمُغِيرَةُ يَعْنِي الْحِزَامِيَّ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَاتَلَ أَحَدُكُمْ أَخَاهُ فَلْيَجْتَنِبْ الْوَجْهَ.",
                "headingArabic": "النَّهْىِ عَنْ ضَرْبِ الْوَجْهِ، ‏‏",
                "headingUrdu": "چہرے پر مارنے کی ممانعت",
                "headingEnglish": "The Prohibition Of Striking The Face",
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14215,
                "hadithNumber": "6652",
                "englishNarrator": "This hadith has been transmitted on the authority of Abu Zinad and he said:",
                "hadithEnglish": "When one amongst you strikes (at the face).",
                "hadithUrdu": "\" جب تم میں سے کوئی ( دوسرے کو ) مارے ۔ \"",
                "urduNarrator": "ہم سے عمرو ناقد اور زہیر بن حرب نے بیان کیا، انہوں نے کہا: ہمیں سفیان بن عیینہ نے ابوزناد سے اسی سند کے ساتھ روایت کی اور کہا",
                "hadithArabic": "حَدَّثَنَاه عَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَبِي الزِّنَادِ بِهَذَا الْإِسْنَادِ وَقَالَ إِذَا ضَرَبَ أَحَدُكُمْ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14216,
                "hadithNumber": "6653",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When any one of you fights with his brother, he should spare his face.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم میں سے کوئی شخص اپنے بھائی سے لڑے تو چہرے ( پر مارنے ) سے بچے ۔ \"",
                "urduNarrator": "ہم سے شیبان بن فروخ نے بیان کیا، کہا ہم سے ابو عوانہ نے بیان کیا, سہیل کے والد ( ابوصالح ) نے حضرت ابوہریرہ رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا قَاتَلَ أَحَدُكُمْ أَخَاهُ فَلْيَتَّقِ الْوَجْهَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14217,
                "hadithNumber": "6654",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When any one of you fights with his brother, he should not slap at the face.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم میں سے کوئی شخص اپنے بھائی سے لڑے تو اس کے چہرے پر طمانچہ نہ مارے ۔ \"",
                "urduNarrator": "ہم سے عبید اللہ بن معاذ العنبری نے بیان کیا، ہم سے میرے والد نے بیان کیا, شعبہ نے ہمیں قتادہ سے حدیث بیان کی ، انہوں نے ابوایوب سے سنا ، حضرت ابوہریرہ رضی اللہ عنہ سے حدیث بیان کر رہے تھے ۔ انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ سَمِعَ أَبَا أَيُّوبَ يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَاتَلَ أَحَدُكُمْ أَخَاهُ فَلَا يَلْطِمَنَّ الْوَجْهَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14218,
                "hadithNumber": "6655",
                "englishNarrator": "This hadith has been transmitted on the authority of Abu Huraira رضی اللہ عنہ and in the hadith transmitted on the authority of Ibn Hatim Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) is reported to have said:",
                "hadithEnglish": "When any one of you fights with his brother, he should avoid his face for Allah created Adam in His own image.",
                "hadithUrdu": "\" جب تم میں سے کوئی اپنے بھائی سے لڑے تو چہرے سے اجتناب کرے کیونکہ اللہ نے آدم کو اس کی صورت پر بنایا ہے ۔ \"",
                "urduNarrator": "نصر بن علی جبضمی نے کہا : ہمیں میرے والد نے حدیث بیان کی ، انہوں نے کہا : ہمیں مثنیٰ ( بن سعید ) نے حدیث بیان کی ، نیز مجھے محمد بن حاتم نے حدیث بیان کی ، کہا : ہمیں عبدالرحمٰن بن مہدی نے مثنیٰ بن سعید سے حدیث بیان کی ، انہوں نے قتادہ سے ، انہوں نے ابوایوب سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اور ابن ابی حاتم کی حدیث میں ہے : نبی صلی اللہ علیہ وسلم سے روایت ہے ، آپ نے فرمایا",
                "hadithArabic": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنِي أَبِي حَدَّثَنَا الْمُثَنَّى ح و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ الْمُثَنَّى بْنِ سَعِيدٍ عَنْ قَتَادَةَ عَنْ أَبِي أَيُّوبَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَفِي حَدِيثِ ابْنِ حَاتِمٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا قَاتَلَ أَحَدُكُمْ أَخَاهُ فَلْيَجْتَنِبْ الْوَجْهَ فَإِنَّ اللَّهَ خَلَقَ آدَمَ عَلَى صُورَتِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14219,
                "hadithNumber": "6656",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When any one of you fights with his brother, he should avoid the face.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم میں سے کوئی شخص اپنے بھائی سے لڑے تو چہرے ( پر مارنے ) سے اجتناب کرے ۔ \"",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا، کہا کہ مجھ سے عبد الصمد نے بیان کیا, ہمام نے کہا ,  ہمیں قتادہ نے ابوایوب یحییٰ بن مالک مراغی سے حدیث بیان کی ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنِي عَبْدُ الصَّمَدِ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ عَنْ يَحْيَى بْنِ مَالِكٍ الْمَرَاغِيِّ وَهُوَ أَبُو أَيُّوبَ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا قَاتَلَ أَحَدُكُمْ أَخَاهُ فَلْيَجْتَنِبْ الْوَجْهَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14220,
                "hadithNumber": "6657",
                "englishNarrator": "Urwa reported on the authority of his father:",
                "hadithEnglish": "Hisham bin Hakim bin Hizam رضی اللہ عنہ happened to pass by some people in Syria who had been made to stand in the sun and olive-oil was being poured upon their heads. He said: What is this? It was said: They are being punished for (not paying) the Kharaj (the government revenue). Thereupon he said: Allah would punish those who torment people in this world (without any genuine reason).",
                "hadithUrdu": "انہوں نے حضرت ہشام بن حکیم بن حزام رضی اللہ عنہ سے روایت کی ، کہا شام میں ان کا کچھ لوگوں کے قریب سے گزرا ہوا جن کو دھوپ میں کھڑا کیا گیا تھا اور ان کے سروں پر زیتون کا تیل ڈالا کیا تھا ، انہوں نے پوچھا : یہ کیا ہو رہا ہے؟ بتایا گیا : ان کو خراج ( نہ دینے ) کی وجہ سے سزا دی جا رہی ہے تو ( حضرت ہشام بن حکیم بن حزام رضی اللہ عنہ نے ) کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ نے فرمایا : \" اللہ تعالیٰ ان لوگوں کو عذاب میں مبتلا کرنے کا جو دنیا میں لوگوں کو عذاب دیتے ہیں ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, حفص بن غیاث نے ہشام بن عروہ سے ، انہوں نے اپنے والد سے ،",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ هِشَامِ بْنِ حَكِيمِ بْنِ حِزَامٍ قَالَ مَرَّ بِالشَّامِ عَلَى أُنَاسٍ وَقَدْ أُقِيمُوا فِي الشَّمْسِ وَصُبَّ عَلَى رُءُوسِهِمْ الزَّيْتُ فَقَالَ مَا هَذَا قِيلَ يُعَذَّبُونَ فِي الْخَرَاجِ فَقَالَ أَمَا إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ اللَّهَ يُعَذِّبُ الَّذِينَ يُعَذِّبُونَ فِي الدُّنْيَا.",
                "headingArabic": "الْوَعِيدِ الشَّدِيدِ لِمَنْ عَذَّبَ النَّاسَ بِغَيْرِ حَقٍّ ‏‏",
                "headingUrdu": "لوگوں کو غیر قانونی طور پر اذیت دینے والے کے لیے سخت تنبیہ",
                "headingEnglish": "Stern Warning To One Who Torments People Unlawfully",
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14221,
                "hadithNumber": "6658",
                "englishNarrator": "Hisham reported on the authority of his father:",
                "hadithEnglish": "Hisham bin Hakim bin Hizam رضی اللہ عنہ happened to pass by people, the farmers of Syria, who had been made to stand in the sun. He said: What is the matter with them? They said: They have been detained for Jizya. Thereupon Hisham رضی اللہ عنہ said: I bear testimony to the fact that I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Allah would torment those who torment people in the world.",
                "hadithUrdu": "حضرت ہشام بن حکیم بن حزام رضی اللہ عنہ شام کے چند نبطیوں ( سامی قوم زمیندار لوگوں ) کے قریب سے گزرے ، انہوں دھوپ میں کھڑا کیا گیا تھا ، انہوں نے پوچھا : ان کا معاملہ کیا ہے؟ لوگوں نے بتایا : انہیں جزیے ( کی ادائیگی کے معاملے ) میں محبوس کیا گیا ہے ، تو حضرت ہشام رضی اللہ عنہ نے کہا : میں گواہی دیتا ہوں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا : \" اللہ تعالیٰ ان لوگوں کو عذاب دے گا جو دنیا میں لوگوں کو عذاب دیتے ہیں ۔ \"",
                "urduNarrator": "ہم سے ابو کریب نے بیان کیا, ابواسامہ نے ہشام سے ، انہوں نے اپنے والد سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ هِشَامٍ عَنْ أَبِيهِ قَالَ مَرَّ هِشَامُ بْنُ حَكِيمِ بْنِ حِزَامٍ عَلَى أُنَاسٍ مِنْ الْأَنْبَاطِ بِالشَّامِ قَدْ أُقِيمُوا فِي الشَّمْسِ فَقَالَ مَا شَأْنُهُمْ قَالُوا حُبِسُوا فِي الْجِزْيَةِ فَقَالَ هِشَامٌ أَشْهَدُ لَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ اللَّهَ يُعَذِّبُ الَّذِينَ يُعَذِّبُونَ النَّاسَ فِي الدُّنْيَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14222,
                "hadithNumber": "6659",
                "englishNarrator": "This hadith has been narrated on the authority of Hisham with the same chain of transmitters and he made this addition of Jarir:",
                "hadithEnglish": "(Hisham bin Hakim) went to Umair bin Sa'd who was then ruler in Palestine and he narrated to him this hadith and he (submitting before the words of the Prophet) commanded that they should be let off and so they were let off.",
                "hadithUrdu": "اور فلسطین پر ان دنوں ان لوگوں کا امیر عمیر بن سعد ( انصاری ) تھا تو وہ ( ہشام رضی اللہ عنہ ) ان کے پاس گئے ، ان کو حدیث سنائی تو انہوں نے ان کے بارے میں حکم دیا ، چنانچہ ان کو چھوڑ دیا گیا ۔",
                "urduNarrator": "ہم سے ابو کریب نے بیان کیا, وکیع ، ابومعاویہ اور جریر سب نے ہشام سے اسی سند کے ساتھ حدیث بیان کی ، اور جریر کی حدیث میں مزید یہ ہے ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا وَكِيعٌ وَأَبُو مُعَاوِيَةَ ح و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا جَرِيرٌ كُلُّهُمْ عَنْ هِشَامٍ بِهَذَا الْإِسْنَادِ وَزَادَ فِي حَدِيثِ جَرِيرٍ قَالَ وَأَمِيرُهُمْ يَوْمَئِذٍ عُمَيْرُ بْنُ سَعْدٍ عَلَى فِلَسْطِينَ فَدَخَلَ عَلَيْهِ فَحَدَّثَهُ فَأَمَرَ بِهِمْ فَخُلُّوا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14223,
                "hadithNumber": "6660",
                "englishNarrator": "Urwa bin Zubair reported:",
                "hadithEnglish": "Hisham bin Hakim رضی اللہ عنہ found a person (the ruler of Hims) who had been detaining some Nabateans in connection with the dues of Jizya. He said: What is this? I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Allah would torment those persons who torment people in the world.",
                "hadithUrdu": "حضرت ہشام بن حکیم رضی اللہ عنہ نے ایک شخص کو دیکھا ، وہ حمص کا عامل تھا ۔ اس نے نبطیوں میں سے کچھ لوگوں کو جزیے کی ادائیگی کے سلسلے میں دھوپ میں کھڑا کیا ہوا تھا تو انہوں نے پوچھا : یہ کیا ہے؟ میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا : \" بلاشبہ اللہ تعالیٰ ان لوگوں کو مبتلائے عذاب کرے گا جو دنیا میں لوگوں کو عذاب میں مبتلا کرتے ہیں ۔ \"",
                "urduNarrator": "مجھ سے ابو الطاہر نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، مجھ سے یونس نے بیان کیا, ابن شہاب نے عروہ بن زبیر سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ أَنَّ هِشَامَ بْنَ حَكِيمٍ وَجَدَ رَجُلًا وَهُوَ عَلَى حِمْصَ يُشَمِّسُ نَاسًا مِنْ النَّبْطِ فِي أَدَاءِ الْجِزْيَةِ فَقَالَ مَا هَذَا إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ اللَّهَ يُعَذِّبُ الَّذِينَ يُعَذِّبُونَ النَّاسَ فِي الدُّنْيَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14224,
                "hadithNumber": "6661",
                "englishNarrator": "Amr heard Jabir رضی اللہ عنہ as saying:",
                "hadithEnglish": "A person happened to come to the mosque with an arrow; thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said to him: Take hold of its pointed head.",
                "hadithUrdu": "ایک شخص چند تیر لے کر مسجد میں سے گزرا تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ان تیروں کو ان کی نوکوں ( کی طرف سے ) پکڑو ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا اور ہم سے اسحاق بن ابراہیم نے بیان کیا اور ابوبکر نے کہا, سفیان بن عیینہ نے عمرو ( بن دینار ) سے روایت کی ، انہوں نے حضرت جابر رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ إِسْحَقُ أَخْبَرَنَا و قَالَ أَبُو بَكْرٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرٍو سَمِعَ جَابِرًا يَقُولُ مَرَّ رَجُلٌ فِي الْمَسْجِدِ بِسِهَامٍ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمْسِكْ بِنِصَالِهَا.",
                "headingArabic": "أَمْرِ مَنْ مَرَّ بِسِلاَحٍ فِي مَسْجِدٍ أَوْ سُوقٍ أَوْ غَيْرِهِمَا مِنَ الْمَوَاضِعِ الْجَامِعَةِ لِ",
                "headingUrdu": "مسجد، بازار یا دوسری جگہ جہاں لوگ جمع ہوں ہتھیار اٹھانے والے کو اس کی جگہ پر رکھنا",
                "headingEnglish": "Telling The One Who Carries A Weapon In The Masjid, Marketplace Or Other Place Where People Gather, To Hold It By Its Point",
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14225,
                "hadithNumber": "6662",
                "englishNarrator": "Jabir bin Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "A person happened to come to the mosque with arrows and their iron-ends were exposed, so he was commanded that he should grasp the pointed heads so that these might not do any harm to a Muslim.",
                "hadithUrdu": "ایک شخص چند تیر لے کر مسجد میں سے گزرا ، اس نے ان کے پیکان کھول رکھے تھے ، آپ نے حکم دیا کہ وہ انہیں پیکانوں ( آگے والے لوہے کے نوکدار حصوں ) کی طرف سے پکڑے تاکہ وہ کسی مسلمان کو خراچ نہ لگا دیں ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ اور ابو الربیع نے بیان کیا، کہا کہ ہم سے یحییٰ نے بیان کیا اور تلفظ ان کا ہے, حماد بن زید نے عمرو بن دینار سے ، انہوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو الرَّبِيعِ قَالَ أَبُو الرَّبِيعِ حَدَّثَنَا و قَالَ يَحْيَى وَاللَّفْظُ لَهُ أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ رَجُلًا مَرَّ بِأَسْهُمٍ فِي الْمَسْجِدِ قَدْ أَبْدَى نُصُولَهَا فَأُمِرَ أَنْ يَأْخُذَ بِنُصُولِهَا كَيْ لَا يَخْدِشَ مُسْلِمًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14226,
                "hadithNumber": "6663",
                "englishNarrator": "Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) commanded a person who had been distributing arrows freely in the mosque that he should not move about in the mosque but by catching hold of their iron-heads. Ibn Rumh narrated this with a slight variation of wording.",
                "hadithUrdu": "آپ نے ایک شخص کو جو مسجد میں کچھ تیر بطور صدقہ لوگوں میں تقسیم کر رہا تھا ، حکم دیا کہ وہ کو نوکوں سے پکڑے بغیر انہیں لے کر ( لوگوں کے درمیان میں سے ) نہ گزرے ۔ ابن رمح نے ( اپنی روایت میں ) کہا : وہ تیروں کو بطور صدقہ دے رہا تھا ۔",
                "urduNarrator": "قتیبہ بن سعید اور محمد بن رمح نے کہا : ہمیں لیث اور ابوزبیر سے حدیث بیان کی ، انہوں نے حضرت جابر رضی اللہ عنہ سے روایت کی ، انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ أَمَرَ رَجُلًا كَانَ يَتَصَدَّقُ بِالنَّبْلِ فِي الْمَسْجِدِ أَنْ لَا يَمُرَّ بِهَا إِلَّا وَهُوَ آخِذٌ بِنُصُولِهَا و قَالَ ابْنُ رُمْحٍ كَانَ يَصَّدَّقُ بِالنَّبْلِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14227,
                "hadithNumber": "6664",
                "englishNarrator": "Abu Musa رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: When any one of you happens to go to a meeting or the bazar with an arrow in his hand he must grasp its pointed head; then (he again said): He must grasp its pointed head. Abu Musa رضی اللہ عنہ said: By Allah, we did not court death until some of us had flung arrows upon the faces of one another.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" جب تم میں سے کوئی شخص مجلس یا بازار میں سے گزرے اور اس کے ہاتھ میں تیر ہوں تو وہ انہیں ان کے پیکانوں ( نوکدار حصوں ) سے پکڑے ، پھر ( تنبیہ ہے ) ان کے نوکیلے حصے کی طرف سے پکڑے ، پھر ( تاکید ہے ) ان کے نوکیلے حصوں کی طرف سے پکڑے ۔ \"\" کہا : تو حضرت ابوموسیٰ رضی اللہ عنہ نے کہا : اللہ کی قسم! ( ہمارا یہ حال ہے کہ ) ہم نے مرنے سے پہلے ( اپنی اسی زندگی میں ) ان تیروں کو ایک دوسرے کے چہروں کی طرف سیدھا کر لیا ہے ۔",
                "urduNarrator": "ہم سے حداب بن خالد نے بیان کیا، کہا ہم سے حماد بن سلمہ نے بیان کیا, ثابت نے ابوبردہ سے ، انہوں نے حضرت ابوموسیٰ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ ثَابِتٍ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَى أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا مَرَّ أَحَدُكُمْ فِي مَجْلِسٍ أَوْ سُوقٍ وَبِيَدِهِ نَبْلٌ فَلْيَأْخُذْ بِنِصَالِهَا ثُمَّ لِيَأْخُذْ بِنِصَالِهَا ثُمَّ لِيَأْخُذْ بِنِصَالِهَا قَالَ فَقَالَ أَبُو مُوسَى وَاللَّهِ مَا مُتْنَا حَتَّى سَدَّدْنَاهَا بَعْضُنَا فِي وُجُوهِ بَعْضٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14228,
                "hadithNumber": "6665",
                "englishNarrator": "Abu Musa رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) assaying: He who amongst you moves in the mosque or in the bazar and there is an arrow with him he should take hold of its iron-head in his palm, so that none amongst the Muslims should receive any injury from it, or he said, should catch its iron-head.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" جب تم میں سے کوئی شخص ہماری مسجد یا ہمارے بازار میں سے گزرے اور اس کے پاس تیر ہوں تو وہ انہیں اپنی ہتھیلی سے ان کے تیز نوکدار حصوں کی طرف سے پکڑے ، کہیں ایسا نہ ہو کہ اس کا کوئی حصہ مسلمانوں میں سے کسی شخص کو لگ جائے ۔ \"\" یا فرمایا : \"\" وہ ان کے پیکانوں کو اپنی مٹھی میں پکڑے ۔ \"\"",
                "urduNarrator": "ہم سے عبداللہ بن براد اشعری اور محمد بن الاعلٰی نے بیان کیا، اور انہوں نے کہا کہ ہم سے ابو اسامہ نے بیان کیا, بُرید نے ابوبردہ سے ، انہوں نے حضرت ابوموسیٰ رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَرَّادٍ الْأَشْعَرِيُّ وَمُحَمَّدُ بْنُ الْعَلَاءِ وَاللَّفْظُ لِعَبْدِ اللَّهِ قَالَا حَدَّثَنَا أَبُو أُسَامَةَ عَنْ بُرَيْدٍ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَى عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا مَرَّ أَحَدُكُمْ فِي مَسْجِدِنَا أَوْ فِي سُوقِنَا وَمَعَهُ نَبْلٌ فَلْيُمْسِكْ عَلَى نِصَالِهَا بِكَفِّهِ أَنْ يُصِيبَ أَحَدًا مِنْ الْمُسْلِمِينَ مِنْهَا بِشَيْءٍ أَوْ قَالَ لِيَقْبِضَ عَلَى نِصَالِهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14229,
                "hadithNumber": "6666",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Abu'l-Qasim (the kunya of Allah's Messenger, ﷺ), said: He who pointed a weapon towards his brother the angels invoke curse upon him even if he is his real brother so long as he does not abandon it (the pointing of weapon towards one's brother Muslim).",
                "hadithUrdu": "ابوالقاسم صلی اللہ علیہ وسلم نے فرمایا : \" جس نے اپنے بھائی کی طرف لوہے کے کسی ہتھیار سے اشارہ کیا تو اس پر فرشتے لعنت کرتے رہتے ہیں یہاں تک کہ وہ اس کام کو ترک کر دے ، چاہے وہ اس کا ماں باپ جایا بھائی ہی کیوں نہ ہو ۔ \"",
                "urduNarrator": "مجھ سے عمرو ناقد نے بیان کیا اور مجھ سے ابن ابی عمر نے بیان کیا، ہم سے سفیان بن عیینہ نے بیان کیا, ایوب نے ( محمد ) ابن سیرین سے روایت کی ، کہا : میں نے حضرت ابوہریرہ رضی اللہ عنہ کو یہ کہتے ہوئے سنا کہ",
                "hadithArabic": "حَدَّثَنِي عَمْرٌو النَّاقِدُ وَابْنُ أَبِي عُمَرَ قَالَ عَمْرٌو حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَيُّوبَ عَنْ ابْنِ سِيرِينَ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ قَالَ أَبُو الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَشَارَ إِلَى أَخِيهِ بِحَدِيدَةٍ فَإِنَّ الْمَلَائِكَةَ تَلْعَنُهُ حَتَّى يَدَعَهُ وَإِنْ كَانَ أَخَاهُ لِأَبِيهِ وَأُمِّهِ.",
                "headingArabic": "النَّهْىِ عَنِ الإِشَارَةِ، بِالسِّلاَحِ إِلَى مُسْلِمٍ ‏ ‏",
                "headingUrdu": "مسلمان کی طرف ہتھیار سے اشارہ کرنے کی ممانعت",
                "headingEnglish": "The Prohibition Of Pointing At A Muslim With A Weapon",
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14230,
                "hadithNumber": "6667",
                "englishNarrator": null,
                "hadithEnglish": "Abu Huraira رضی اللہ عنہ reported a hadith like this from Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) through another chain of transmitters.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے یزید بن ہارون نے بیان کیا,ابن عون نے محمد ( بن سیرین ) سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ عَنْ ابْنِ عَوْنٍ عَنْ مُحَمَّدٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14231,
                "hadithNumber": "6668",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported a hadith from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌); (one of them was this):",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: None amongst you should point a weapon towards his brother, for he does not know that Satan might cause the weapon (to slip) from his hand and (he may injure anyone) and thus he may fall into Hell-Fire.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم میں سے کوئی شخص اپنے بھائی کی طرف ہتھیار سے اشارہ نہ کرے ، کیونکہ تم میں سے کوئی شخص نہیں جانتا کہ شاید شیطان اچانک اس کے ہاتھ میں اسے حرکت دے ( اور وہ دوسرے مسلمان کو لگ جائے ) اور وہ ( جس کے ہاتھ سے ہتھیار چلے ) جہنم کے گڑھے میں گر جائے ۔ \"",
                "urduNarrator": "ہم سے محمد بن رافع نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، ہم سے معمر نے بیان کیا, ہمام بن منبہ سے روایت ہے ، کہا : یہ احادیث ہیں جو حضرت ابوہریرہ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کیں ، پھر انہوں نے کئی احادیث ذکر کیں ، ان میں سے ایک یہ ہے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُشِيرُ أَحَدُكُمْ إِلَى أَخِيهِ بِالسِّلَاحِ فَإِنَّهُ لَا يَدْرِي أَحَدُكُمْ لَعَلَّ الشَّيْطَانَ يَنْزِعُ فِي يَدِهِ فَيَقَعُ فِي حُفْرَةٍ مِنْ النَّارِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14232,
                "hadithNumber": "6669",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: While a person was going along the path he found a thorny branch upon it. He pushed it to a side and Allah approved (this action) of his and (as a mark of appreciation) granted him pardon.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ایک شخص راستے پر چلا جا رہا تھا ، اس نے راستے پر ایک کانٹے دار ٹہنی دیکھی تو اسے ( ایک طرف ) ہٹا دیا ۔ اللہ تعالیٰ کے اسے اس کا انعام دیا تو اس کی بخشش فرما دی ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے مالک رضی اللہ عنہ کے پاس ایک خادمہ سمیع رضی اللہ عنہ سے پڑھی, ابو بکر کے آزاد کردہ غلام سُمی نے ابوصالح سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ سُمَيٍّ مَوْلَى أَبِي بَكْرٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ بَيْنَمَا رَجُلٌ يَمْشِي بِطَرِيقٍ وَجَدَ غُصْنَ شَوْكٍ عَلَى الطَّرِيقِ فَأَخَّرَهُ فَشَكَرَ اللَّهُ لَهُ فَغَفَرَ لَهُ.",
                "headingArabic": "فَضْلِ إِزَالَةِ الأَذَى عَنِ الطَّرِيقِ، ‏ ‏",
                "headingUrdu": "کسی نقصان دہ چیز کو راستے سے ہٹانے کی فضیلت",
                "headingEnglish": "The Virtue Of Removing A Harmful Thing From The Road",
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14233,
                "hadithNumber": "6670",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: A person while walking along the path saw the branches of a tree lying there. He said: By Allah, I shall remove these from this so that these may not do harm to the Muslims, and he was admitted to Paradise.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ایک شخص راستے سے اوپر پڑی ہوئی درخت کی ایک شاخ کے پاس سے گزرا تو اس نے کہا : اللہ کی قسم! میں اس شاخ و مسلمانوں کے راستے سے ہٹا دوں کا تاکہ یہ ان کو ایذا نہ دے تو اس شخص کو جنت میں داخل کر دیا گیا ۔ \"",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے جریر نے بیان کیا, سہیل نے اپنے والد سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ رَجُلٌ بِغُصْنِ شَجَرَةٍ عَلَى ظَهْرِ طَرِيقٍ فَقَالَ وَاللَّهِ لَأُنَحِّيَنَّ هَذَا عَنْ الْمُسْلِمِينَ لَا يُؤْذِيهِمْ فَأُدْخِلَ الْجَنَّةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14234,
                "hadithNumber": "6671",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying that he saw a person enjoying himself in Paradise because of the tree that he cut from the path which was a source of inconvenience to the people.",
                "hadithUrdu": "آپ نے فرمایا : \" میں نے ایک شخص کو دیکھا کہ وہ ( اس عمل کے بدلے ) جنت میں ہر طرف ( نعمتوں کے مزے ) لوٹ رہا تھا ( کیونکہ ) اس نے راستے کے درمیان سے ایک ایسے درخت کو کاٹ دیا تھا جو لوگوں کو اذیت دیتا تھا ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے عبید اللہ نے بیان کیا، ہم سے شیبان نے بیان کیا, اعمش نے ابوصالح سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی",
                "hadithArabic": "حَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عُبَيْدُ اللَّهِ حَدَّثَنَا شَيْبَانُ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَقَدْ رَأَيْتُ رَجُلًا يَتَقَلَّبُ فِي الْجَنَّةِ فِي شَجَرَةٍ قَطَعَهَا مِنْ ظَهْرِ الطَّرِيقِ كَانَتْ تُؤْذِي النَّاسَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14235,
                "hadithNumber": "6672",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying that there was a tree which caused inconvenience to the Muslims; a person came there and cut that (tree) (and thus entered ) Paradise).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ایک درخت مسلمانوں کو اذیت دیتا تھا ، چنانچہ ایک شخص آیا اور اسے کاٹ دیا تو وہ جنت میں داخل ہو گیا ۔ \"",
                "urduNarrator": "ہم سے محمد بن حاتم نے بیان کیا، کہا ہم سے بہز نے بیان کیا، کہا ہم سے حماد بن سلمہ نے بیان کیا، ثابت کی سند سے, ابورافع نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا بَهْزٌ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ ثَابِتٍ عَنْ أَبِي رَافِعٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ شَجَرَةً كَانَتْ تُؤْذِي الْمُسْلِمِينَ فَجَاءَ رَجُلٌ فَقَطَعَهَا فَدَخَلَ الْجَنَّةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14236,
                "hadithNumber": "6673",
                "englishNarrator": "Abu Barza رضی اللہ عنہ reported:",
                "hadithEnglish": "I said: Allah's Messenger, teach me something so that I may derive benefit from it. He said: Remove the troublesome thing from the paths of the Muslims.",
                "hadithUrdu": "میں نے عرض کی : اللہ کے نبی! آپ مجھے کوئی ایسی بات سکھا دیں جس سے میں نفع حاصل کروں ۔ آپ نے فرمایا : \" مسلمانوں کے راستے سے تکلیف دینے والی چیز کو ہٹا دیا کرو ۔ \"",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے یحییٰ بن سعید نے بیان کیا, ابان نے صمعہ نے کہا , مجھے ابووازع نے حدیث بیان کی ، کہا : مجھے حضرت ابوبرزہ رضی اللہ عنہ نے حدیث بیان کی ، کہا",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ أَبَانَ بْنِ صَمْعَةَ حَدَّثَنِي أَبُو الْوَازِعِ حَدَّثَنِي أَبُو بَرْزَةَ قَالَ قُلْتُ يَا نَبِيَّ اللَّهِ عَلِّمْنِي شَيْئًا أَنْتَفِعُ بِهِ قَالَ اعْزِلْ الْأَذَى عَنْ طَرِيقِ الْمُسْلِمِينَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14237,
                "hadithNumber": "6674",
                "englishNarrator": "Abu Barza رضی اللہ عنہ reported:",
                "hadithEnglish": "He said to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ): Allah's Messenger, I do not know whether I would survive after you, so confer upon me something by which Allah should benefit me. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Do this and that and remove the troublesome things from the paths.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے عرض کی : اللہ کے رسول! میں نہیں جانتا ، ہو سکتا ہے کہ آپ ( دنیا سے ) تشریف لے جائیں اور میں آپ کے بعد زندہ رہ جاؤں ، اس لیے آپ مجھے ( آخرت کے سفر کے لیے ) کوئی زاد راہ عطا کر دیجئے جس سے اللہ تعالیٰ مجھے نفع عطا فرمائے ، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اس طرح کرو ، اس طرح کرو ۔ ۔ ابوبکر بن شعیب ان باتوں کو بھول گئے ۔ ۔ اور ( فرمایا : ) راستے سے تکلیف دہ چیزوں کو دُور کر دیا کرو ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا, ابوبکر بن شعیب بن حبحاب نے ابووازع راسبی سے ، انہوں نے حضرت ابوبرزہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو بَكْرِ بْنُ شُعَيْبِ بْنِ الْحَبْحَابِ عَنْ أَبِي الْوَازِعِ الرَّاسِبِيِّ عَنْ أَبِي بَرْزَةَ الْأَسْلَمِيِّ أَنَّ أَبَا بَرْزَةَ قَالَ قُلْتُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا رَسُولَ اللَّهِ إِنِّي لَا أَدْرِي لَعَسَى أَنْ تَمْضِيَ وَأَبْقَى بَعْدَكَ فَزَوِّدْنِي شَيْئًا يَنْفَعُنِي اللَّهُ بِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ افْعَلْ كَذَا افْعَلْ كَذَا أَبُو بَكْرٍ نَسِيَهُ وَأَمِرَّ الْأَذَى عَنْ الطَّرِيقِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14238,
                "hadithNumber": "6675",
                "englishNarrator": "Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: A woman was tormented because of a cat which she had confined until it died and she had to get into Hell. She did not allow it either to eat or drink as it was confined, nor did she free it so that it might eat the vermin of the earth.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ایک عورت کو بلی کی وجہ سے عذاب دیا گیا ، اس نے بلی کو باندھے رکھا حتی کہ وہ مر گئی تو وہ اسی وجہ سے جہنم میں داخل ہو گئی ، کیونکہ جب اس نے بلی کو باندھا تو نہ اس کو کھلایا ، نہ پلایا اور نہ اس کو چھوڑا کہ وہ ( خود ہی ) زمین کے کیڑے مکوڑے کھا لیتی ۔ \"",
                "urduNarrator": "مجھ سے عبداللہ بن محمد بن اسماء بن عبید الضبعی نے بیان کیا, جویریہ بن اسماء نے نافع سے ، انہوں نے حضرت عبداللہ ( بن عمر رضی اللہ عنہ ) سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ بْنِ عُبَيْدٍ الضُّبَعِيُّ حَدَّثَنَا جُوَيْرِيَةُ يَعْنِي ابْنَ أَسْمَاءَ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ عُذِّبَتْ امْرَأَةٌ فِي هِرَّةٍ سَجَنَتْهَا حَتَّى مَاتَتْ فَدَخَلَتْ فِيهَا النَّارَ لَا هِيَ أَطْعَمَتْهَا وَسَقَتْهَا إِذْ هِيَ حَبَسَتْهَا وَلَا هِيَ تَرَكَتْهَا تَأْكُلُ مِنْ خَشَاشِ الْأَرْضِ.",
                "headingArabic": "تَحْرِيمِ تَعْذِيبِ الْهِرَّةِ وَنَحْوِهَا مِنَ الْحَيَوَانِ الَّذِي لاَ يُؤْذِي ‏ ‏",
                "headingUrdu": "بلیوں اور دوسرے جانوروں کو اذیت دینے کی ممانعت جو نقصان دہ نہیں ہیں۔",
                "headingEnglish": "The Prohibition Of Tormenting Cats And Other Animals That Are Not Harmful",
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 13926,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=557",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=555",
                "label": "555",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=556",
                "label": "556",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=557",
                "label": "557",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=558",
                "label": "558",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=559",
                "label": "559",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=560",
                "label": "560",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=561",
                "label": "561",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=559",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=559",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=557",
        "to": 13950,
        "total": 40465
    }
}