{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 348,
        "data": [
            {
                "id": 8964,
                "hadithNumber": "1400",
                "englishNarrator": "Abu Dharr ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Mu'adhin (the announcer of the hour of prayer) of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) called for the noon prayer. Upon this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Let it cool down, let it cool down, or he said: Wait, wait for the intensity of heat is from the exhalation of Hell. When the heat is intense, delay the prayer till it becomes cooler. Abu Dharr ‌رضی ‌اللہ ‌عنہ said: (We waited) till we saw the shadow of the mounds.",
                "hadithUrdu": "رسول اللہ ﷺ کا مؤذن ظہر کے اذان دینے لگا تو آپ نے فرمایا : ’’ ( وقت کو ) ٹھنڈا ہونے دو ، ٹھنڈا ہونے دو ۔ ‘ ‘ یا فرمایا : انتظار کرو ، انتظار کر و ‘ ‘ ۔ اور فرمایا : ’’ بلاشبہ گرمی کی شدت جہنم کی لپٹوں میں سے ہے ، اس لیے جب گرمی شدید ہو جائے تو نماز ٹھنڈے وقت تک مؤخر کرو ۔ ‘ ‘ ابوذر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کا قول ہے : ( نماز میں اتنی تاخیر کی گئی ) حتی کہ ہم نے ٹیلوں کا سایہ دیکھا ۔",
                "urduNarrator": "ہم سے محمد بن المثنیٰ نے بیان کیا، کہا ہم سے محمد بن جعفر نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، انہوں نے کہا کہ میں نے ایک مہاجر ابو الحسن رضی اللہ عنہ کو بیان کرتے ہوئے سنا کہ انہوں نے زید بن وہب کو سنا,حضرت ابو ذر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے ، انھوں نے کہا",
                "hadithArabic": "دَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ: سَمِعْتُ مُهَاجِرًا أَبَا الْحَسَنِ، يُحَدِّثُ أَنَّهُ سَمِعَ زَيْدَ بْنَ وَهْبٍ، يُحَدِّثُ عَنْ أَبِي ذَرٍّ، قَالَ: أَذَّنَ مُؤَذِّنُ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِالظُّهْرِ، فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَبْرِدْ، أَبْرِدْ»، أَوْ قَالَ: «انْتَظِرِ، انْتَظِرْ»، وَقَالَ: «إِنَّ شِدَّةَ الْحَرِّ مِنْ فَيْحِ جَهَنَّمَ، فَإِذَا اشْتَدَّ الْحَرُّ، فَأَبْرِدُوا عَنِ الصَّلَاةِ»، قَالَ أَبُو ذَرٍّ: «حَتَّى رَأَيْنَا فَيْءَ التُّلُولِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8965,
                "hadithNumber": "1401",
                "englishNarrator": "Abu Huraira رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: The Fire made a complaint before the Lord saying. O Lord, some parts of mine have consumed the others. So it was allowed to take two exhalations, one exhalation in winter and the other exhalation in summer. That is why you find extreme heat (in summer) and extreme cold (in winter).",
                "hadithUrdu": "رسو ل اللہ ﷺ نے فرمایا : ’’آگ نےاپنے رب کے حضور شکایت کی اور کہا : اے میرے رب ! میرا ایک حصہ دوسرے کو کھارہا ہے ۔ تو اللہ نے اسے دو سانس لینے کی اجازت عطا کردی : ایک سانس سردی میں اور ایک سانس گرمی ، گرمی اور سردی کے موسم میں جو تم شدید ترسین گرمی اور شدید ترین سردی محسوس کرتے ہو تو یہ وہی ( چیز ) ہے ۔ ‘ ‘",
                "urduNarrator": "مجھ سے عمرو بن سواد اور حرملہ بن یحییٰ نے بیان کیا اور ہم سے حرملہ کا لفظ ابن وہب نے بیان کیا، مجھ سے یونس نے بیان کیا, ابن شہاب سے روایت ہے ، کہا : مجھ سے ابو سلمہ بن عبدالرحمن نے حدیث نے حدیث بیان کی کہ انھوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو یہ کہتے ہوئے سنا",
                "hadithArabic": "وَحَدَّثَنِي عَمْرُو بْنُ سَوَّادٍ، وَحَرْمَلَةُ بْنُ يَحْيَى، وَاللَّفْظُ لِحَرْمَلَةَ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ: حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: اشْتَكَتِ النَّارُ إِلَى رَبِّهَا، فَقَالَتْ: يَا رَبِّ أَكَلَ بَعْضِي بَعْضًا، فَأَذِنَ لَهَا بِنَفَسَيْنِ، نَفَسٍ فِي الشِّتَاءِ، وَنَفَسٍ فِي الصَّيْفِ، فَهْوَ أَشَدُّ مَا تَجِدُونَ مِنَ الْحَرِّ، وَأَشَدُّ مَا تَجِدُونَ مِنَ الزَّمْهَرِيرِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8966,
                "hadithNumber": "1402",
                "englishNarrator": "Abu Huraira رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: When it is hot, make delay (in the noon prayer) till it cools down, for the intensity of beat is from the Exhalation of Hell; and he also mentioned that Hellfire complained to the Lord (about the congested atmosphere) and so it was permitted to take two exhalations during the whole year, one exhalation during the winter and one exhalation during the summer.",
                "hadithUrdu": "رسو ل اللہ ﷺ نے فرمایا : ’’جب گرمی ہو تو نماز ٹھنڈے وقت تک مؤخر کر کے پڑھوکیونکہ گرمی کی شدت جہنم کی لپٹ سے ہوتی ہے ۔ ‘ ‘ اور آپ ﷺ نے یہ ( یہ بھی ذکر فرمایا : ) ’’جہنم کی ) آگ نے اپنے رب کےحضور شکایت کی تو اللہ نےاسے سال میں دو سانس لینے کی اجازت دی : ایک سانس سردی مین اور ایک سانس گرمی میں ۔ ‘ ‘",
                "urduNarrator": "مجھ سے اسحاق بن موسیٰ الانصاری نے بیان کیا، ہم سے معن نے بیان کیا، ہم سے مالک نے بیان کیا، عبداللہ بن یزید کے ایک خادم سے, اسود بن سفیان کے آزاد کردہ غلام عبداللہ بن یزید نے ابو سلمہ بن عبدالرحمن اور محمد بن عبدالرحمن بن ثوبان سے اور انھوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنِي إِسْحَاقُ بْنُ مُوسَى الْأَنْصَارِيُّ، حَدَّثَنَا مَعْنٌ، حَدَّثَنَا مَالِكٌ، عَنْ عَبْدِ اللهِ بْنِ يَزِيدَ مَوْلَى الْأَسْوَدِ بْنِ سُفْيَانَ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، وَمُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ ثَوْبَانَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «إِذَا كَانَ الْحَرُّ، فَأَبْرِدُوا عَنِ الصَّلَاةِ، فَإِنَّ شِدَّةَ الْحَرِّ مِنْ فَيْحِ جَهَنَّمَ» وَذَكَرَ «أَنَّ النَّارَ اشْتَكَتْ إِلَى رَبِّهَا، فَأَذِنَ لَهَا فِي كُلِّ عَامٍ بِنَفَسَيْنِ، نَفَسٍ فِي الشِّتَاءِ، وَنَفَسٍ فِي الصَّيْفِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8967,
                "hadithNumber": "1403",
                "englishNarrator": "Abu Huraira ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: The Fire said to the Lord: O Lord! some parts of mine have consumed the others, so allow me to exhale (in order to find some relief from this congestion). It was granted permission to take two exhalations, one exhalation during the winter and the other exhalation during the summer So whatever you perceive in the form of intense cold or hurting cold is from the exhalation of Hell. And whatever you perceive in the form of extreme heat or intense beat is from the exhalation of Hell.",
                "hadithUrdu": "آپ نے فرمایا : ’’آگ نے عرض کی : اے میرے رب ! میرا ایک حصہ دوسرے کو کھا رہا ہے ، مجھے سانس لینے کی اجازت مرحمت فرما ۔ تو ( اللہ نے ) اسے دو سانس لینے کی اجازت دی : ایک سانس سردی میں اور ایک سانس گرمی میں ۔ تم جو سردی یا ٹھنڈک کی شدت پاتے ہو ، وہ جہنم کی سانس سے ہے اور جو تم حرارت یا گرمی کی شدت پاتے ہو تو وہ ( بھی ) جہنم کی سانس سے ہے ۔ ‘ ‘",
                "urduNarrator": "ہم سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے عبداللہ بن وہب نے بیان کیا، کہا ہم سے حیوہ نے بیان کیا، کہا کہ مجھ سے یزید بن عبداللہ بن اسامہ بن الحاد نے بیان کیا،محمد بن ابراہیم نےابو سلمہ سے ، انھوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انھوں نے رسول اللہ ﷺسے روایت کی",
                "hadithArabic": "وَحَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، أَخْبَرَنَا حَيْوَةُ، قَالَ: حَدَّثَنِي يَزِيدُ بْنُ عَبْدِ اللهِ بْنِ أُسَامَةَ بْنِ الْهَادِ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: قَالَتِ النَّارُ: رَبِّ أَكَلَ بَعْضِي بَعْضًا، فَأْذَنْ لِي أَتَنَفَّسْ، فَأْذِنْ لَهَا بِنَفَسَيْنِ، نَفَسٍ فِي الشِّتَاءِ، وَنَفَسٍ فِي الصَّيْفِ، فَمَا وَجَدْتُمْ مِنْ بَرْدٍ، أَوْ زَمْهَرِيرٍ فَمِنْ نَفَسِ جَهَنَّمَ، وَمَا وَجَدْتُمْ مِنْ حَرٍّ، أَوْ حَرُورٍ فَمِنْ نَفَسِ جَهَنَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8968,
                "hadithNumber": "1404",
                "englishNarrator": "Jabir bin Samura ‌رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to offer the noon prayer when the sun declined.",
                "hadithUrdu": "نبی اکرم ﷺ ظہر کی نماز اس وقت پڑھتے تھے جب سورج ڈھلتا تھا.",
                "urduNarrator": "ہم سے محمد بن المثنی اور محمد بن بشار نے بیان کیا، دونوں نے یحییٰ القطان اور ابن مہدی نے کہا: مجھ سے یحییٰ بن سعید نے شعبہ کی سند سے بیان کیا، انہوں نے کہا: سماک بن حرب نے ہم سے کہا, حضرت جابر بن سمرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، كِلَاهُمَا عَنْ يَحْيَى الْقَطَّانِ، وَابْنِ مَهْدِيٍّ، ح قَالَ ابْنُ الْمُثَنَّى: حَدَّثَنِي يَحْيَى بْنُ سَعِيدٍ، عَنْ شُعْبَةَ، قَالَ: حَدَّثَنَا سِمَاكُ بْنُ حَرْبٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، ح قَالَ ابْنُ الْمُثَنَّى، وَحَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ شُعْبَةَ، عَنْ سِمَاكٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ: «كَانَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي الظُّهْرَ إِذَا دَحَضَتِ الشَّمْسُ».",
                "headingArabic": "اسْتِحْبَابِ تَقْدِيمِ الظُّهْرِ فِي أَوَّلِ الْوَقْتِ فِي غَيْرِ شِدَّةِ الْحَرِّ ‏‏",
                "headingUrdu": "ظہر کی نماز اس وقت کے شروع میں پڑھنا مستحب ہے جب شدید گرمی نہ ہو۔",
                "headingEnglish": "It is recommended to pray Zuhr at the beginning of its time when there is no intense heat",
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8969,
                "hadithNumber": "1405",
                "englishNarrator": "Khabbab رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "We complained to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) (the difficulty of) saying prayer on the intensely heated (ground or sand), but he paid no heed to our complaint.",
                "hadithUrdu": "ہم نے رسول اللہ ﷺ سے شدید گرم ریت پر نماز ادا کرنے کی شکایت کی تو آپ نے ہماری شکایت کا ازالہ نہ فرمایا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, ابو احوص سلام بن سلیم نے ہمیں حدیث سنائی ، انھوں نے ابو اسحاق سے ، انھوں نے سعید بن وہب سے اور انھوں حضرت خباب ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو الْأَحْوَصِ سَلَّامُ بْنُ سُلَيْمٍ، عَنْ أَبِي إِسْحَاقَ، عَنْ سَعِيدِ بْنِ وَهْبٍ، عَنْ خَبَّابٍ، قَالَ: «شَكَوْنَا إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الصَّلَاةَ فِي الرَّمْضَاءِ، فَلَمْ يُشْكِنَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8970,
                "hadithNumber": "1406",
                "englishNarrator": "Khabbab رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "We came to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and we complained to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) about (saying prayer) on the extremely heated ground (or sand), but he paid no heed to us. Zuhair said: I asked Abu Ishaq whether it was about the noon prayer. He said: Yes. I again said whether it concerned the (offering) of the noon (prayer) in earlier hours. He said: Yes. I said: Did it concern expediting it? He said: Yes.",
                "hadithUrdu": "ہم رسول اللہ ﷺ کی خدمت میں حاضر ہوئے اور آپ سے ریت کی گرمی کی شکایت کی تو آپ نے ہماری شکایت کا ازالہ نہ فرمایا ۔ زہیر نے کہا : میں نے ابو اسحاق سے پوچھا : کیا ظہر کے بارے میں ( شکایت کی ؟ ) انھوں نے جواب دیا : ہاں ۔ میں نےکہا : کیا اس کو جلد ی پڑھنے ( کی مشقت ) کے بارے میں ؟ انھوں نے جواب دیا : ہاں ۔",
                "urduNarrator": "ہم سے احمد بن یونس اور عون بن سلام نے بیان کیا، عون نے کہا: انہوں نے بیان کیا، اور ابن یونس نے کہا: اور تلفظ ان کا ہے, زہیر نے کہا : ہمیں ابو اسحاق نے سعید بن وہب سے حدیث سنائی اور انھوں نے حضرت خباب ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، وَعَوْنُ بْنُ سَلَّامٍ، قَالَ عَوْنٌ: أَخْبَرَنَا، وقَالَ ابْنُ يُونُسَ: وَاللَّفْظُ لَهُ، حَدَّثَنَا زُهَيْرٌ، قَالَ: حَدَّثَنَا أَبُو إِسْحَاقَ، عَنْ سَعِيدِ بْنِ وَهْبٍ، عَنْ خَبَّابٍ، قَالَ: أَتَيْنَا رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «فَشَكَوْنَا إِلَيْهِ حَرَّ الرَّمْضَاءِ، فَلَمْ يُشْكِنَا» قَالَ زُهَيْرٌ: قُلْتُ لِأَبِي إِسْحَاقَ: أَفِي الظُّهْرِ؟ قَالَ: نَعَمْ، قُلْتُ: أَفِي تَعْجِيلِهَا؟ قَالَ: نَعَمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8971,
                "hadithNumber": "1407",
                "englishNarrator": "Anas bin Malik reported:",
                "hadithEnglish": "We used to say (the noonprayer) with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) in the intense heat, but when someone amongst us found it hard to place his forehead on the ground, he spread his cloth and prostrated on it.",
                "hadithUrdu": "ہم گرمی کی شدت میں رسول اللہ ﷺ کے ساتھ نماز پڑھتے تھے ، جب ہم میں سے کوئی اپنی پیشانی زمین پر نہ رکھ سکتا تو اپنا کپڑا پھیلا کر اس پر سجدہ کر لیتا.",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا ہم سے بشر بن المفضل نے بیان کیا، انہوں نے غالب القطان سے اور بکر بن عبداللہ کی سند سے, حضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، عَنْ غَالِبٍ الْقَطَّانِ، عَنْ بَكْرِ بْنِ عَبْدِ اللهِ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ: «كُنَّا نُصَلِّي مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي شِدَّةِ الْحَرِّ، فَإِذَا لَمْ يَسْتَطِعْ أَحَدُنَا أَنْ يُمَكِّنَ جَبْهَتَهُ مِنَ الْأَرْضِ، بَسَطَ ثَوْبَهُ، فَسَجَدَ عَلَيْهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8972,
                "hadithNumber": "1408",
                "englishNarrator": "Anas bin Malik ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to pray the afternoon prayer when the sun was high and bright, then one would go off to al-'Awali and get there while the sun was still high. Ibn Qutaiba made no mention of one would go off to al-'Awali .",
                "hadithUrdu": "رسول اللہ ﷺ عصرکی نماز ( ایسے وقت میں ) پڑھتے تھے جب سورج بلند اور زندہ ( روشنی میں کمی کے بغیر ) ہوتا تھا ، عوالی کی طرف جانے والا ( عصر پڑھ کر ) چلتا اور عوالی ( مدینہ کے بالائی حصے کی بستیوں میں ) پہنچتا تو سورج ابھی بلند ہوتا تھا ۔ یہ بستیاں مدینہ سے دو تا آٹھ میل کی میل کی مسافت پر تھیں ۔ قتیبہ نے ( اپنی حدیث میں ) عوالی پہنچنے کا ذکر نہیں کیا ۔",
                "urduNarrator": "قتیبہ بن سعید اور محمد بن رمح نے کہا : لیث نے ہمیں ابن شہاب سے روایت کی ، انھوں نے حضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ انھوں نے ان کو بتایا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح قَالَ: وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ أَخْبَرَهُ: «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي الْعَصْرَ وَالشَّمْسُ مُرْتَفِعَةٌ حَيَّةٌ، فَيَذْهَبُ الذَّاهِبُ إِلَى الْعَوَالِي، فَيَأْتِي الْعَوَالِي وَالشَّمْسُ مُرْتَفِعَةٌ» وَلَمْ يَذْكُرْ قُتَيْبَةُ: فَيَأْتِي الْعَوَالِيَ.",
                "headingArabic": "اسْتِحْبَابِ التَّبْكِيرِ بِالْعَصْرِ",
                "headingUrdu": "عصر کی نماز جلد پڑھنا مستحب ہے۔",
                "headingEnglish": "It is recommended to pray `Asr early",
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8973,
                "hadithNumber": "1409",
                "englishNarrator": "It was narrated from Anas رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "The Messenger of Allah ﷺ used to pray 'Asr... a similar report (as no. 1408).",
                "hadithUrdu": "رسول اللہ ﷺ عصر کی نماز پڑھتے تھے ۔ ۔ ۔ ( آگے ) بالکل ( اوپرکی روایت ) کے مطابق ہے ۔",
                "urduNarrator": "مجھ سے ہارون بن سعید العیلی نے بیان کیا، ہم سے ابن وہب نے بیان کیا, عمرو نے ابن شہاب سے ، انھوں نے حضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي الْعَصْرَ بِمِثْلِهِ سَوَاءً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8974,
                "hadithNumber": "1410",
                "englishNarrator": "Anas bin Malik ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "We used to offer the 'Asr prayer, then one would go to Quba' and reach there and the sun would be still high.",
                "hadithUrdu": "ہم عصر کی نماز پڑھتے تھے ، پھر جانے والا قباء جاتا ، ان لوگوں کے پاس پہنچتا اور سورج ابھی اونچا ہوتا ۔ ( قباء مدینہ سے دو میل کی مسافت پر ہے ۔ )",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا, امام مالک نے ابن شہاب سے ، انھوں نے حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ: «كُنَّا نُصَلِّي الْعَصْرَ، ثُمَّ يَذْهَبُ الذَّاهِبُ إِلَى قُبَاءٍ، فَيَأْتِيهِمْ وَالشَّمْسُ مُرْتَفِعَةٌ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8975,
                "hadithNumber": "1411",
                "englishNarrator": "Anas bin Malik رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "We used to offer the afternoon prayer (at such a time) that a person would go to Bani 'Amr bin Auf and he would find them busy offering the afternoon prayer.",
                "hadithUrdu": "کہا ہم عصر کی نماز پڑھتے ، پھر ایک انسان بنو عمرو بن عوف کے محلے ( قباء میں ) جاتا تو انھیں عصر کی نماز پڑھتے ہوئے پاتا ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا: میں نے مالک رضی اللہ عنہ سے پڑھا, اسحاق بن عبداللہ بن ابی طلحہ نے حضرت اسن بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ: «كُنَّا نُصَلِّي الْعَصْرَ، ثُمَّ يَخْرُجُ الْإِنْسَانُ إِلَى بَنِي عَمْرِو بْنِ عَوْفٍ، فَيَجِدُهُمْ يُصَلُّونَ الْعَصْرَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8976,
                "hadithNumber": "1412",
                "englishNarrator": "Ala' bin 'Abdul-Rahman reported:",
                "hadithEnglish": "They came to the house of Anas bin Malik ‌رضی ‌اللہ ‌عنہ ‌in Basra after saying the noon prayer. His (Anas) house was situated by the side of the mosque. As revisited him he (Anas) said: Have you said the afternoon prayer? We said to him: It is just a few minutes before that we finished the noon prayer. He said: Offer the afternoon prayer. So we stood up and said our prayer. And when we completed it, he said: I have heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saying: This is how the hypocrite prays: he sits watching the sun, and when it is between the horns of devil, he rises and strikes the ground four times (in haste) mentioning Allah a little during it.",
                "hadithUrdu": "وہ نماز ظہر سے فارغ ہو کر حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے ہاں بصرہ میں ان کے گھر حاضر ہوئے ، ان کا گھر مسجد کے پہلو میں تھا ، جب ہم ان کی خدمت میں پہنچے تو انھوں نے پوچھا : کیا تم لوگوں نے عصر کی نماز پڑھ لی ہے ؟ ہم نے ان سے عرض کی : ہم تو ابھی ظہر کی نماز پڑھ کر لوٹے ہیں ۔ انھوں نے فرمایا : تو عصر پڑھ لو ۔ ہم نے اٹھ کر ( عصر کی ) نماز پڑھ لی ، جب ہم فارغ ہوئے تو انھوں نےکہا : میں نے رسول اللہ ﷺ کو فرماتے ہوئے سنا ’’ یہ منافق کی نماز ہے ، وہ بیٹھا ہوا سورج کو دیکھتا رہتا ہے یہاں تک کہ ( جب وہ زرد پڑ کر ) شیطان کے دو سنگوں کے درمیان چلا جاتا ہے تو کھڑا ہو کر اس ( نماز ) کی چار ٹھونگیں مار دیتا ہے اور اس میں اللہ کو بہت ہی کم یاد کرتا ہے ۔ ‘ ‘",
                "urduNarrator": "ہم سے یحییٰ بن ایوب، محمد بن الصباح، قتیبہ اور ابن حجر نے بیان کیا، کہا کہ ہم سے اسماعیل بن جعفر نے بیان کیا،علاء بن عبدالرحمن سے روایت ہے کہ",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَمُحَمَّدُ بْنُ الصَّبَّاحِ، وَقُتَيْبَةُ، وَابْنُ حُجْرٍ، قَالُوا: حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنِ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّهُ دَخَلَ عَلَى أَنَسِ بْنِ مَالِكٍ فِي دَارِهِ بِالْبَصْرَةِ، حِينَ انْصَرَفَ مِنَ الظُّهْرِ، وَدَارُهُ بِجَنْبِ الْمَسْجِدِ، فَلَمَّا دَخَلْنَا عَلَيْهِ، قَالَ: أَصَلَّيْتُمُ الْعَصْرَ؟ فَقُلْنَا لَهُ: إِنَّمَا انْصَرَفْنَا السَّاعَةَ مِنَ الظُّهْرِ، قَالَ: فَصَلُّوا الْعَصْرَ، فَقُمْنَا، فَصَلَّيْنَا، فَلَمَّا انْصَرَفْنَا، قَالَ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: «تِلْكَ صَلَاةُ الْمُنَافِقِ، يَجْلِسُ يَرْقُبُ الشَّمْسَ حَتَّى إِذَا كَانَتْ بَيْنَ قَرْنَيِ الشَّيْطَانِ، قَامَ فَنَقَرَهَا أَرْبَعًا، لَا يَذْكُرُ اللهَ فِيهَا إِلَّا قَلِيلًا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8977,
                "hadithNumber": "1413",
                "englishNarrator": "Abu Umama bin Sahl رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "We offered the noon prayer with Umar bin 'Abdul-'Aziz. We then set out till we came to Anas bin Malik رضی ‌اللہ ‌عنہ ‌and found him busy in saying the afternoon prayer. I said to him: O uncle! which is this prayer that you are offering? He said: It is the afternoon prayer and this is the prayer of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) that we offered along with him.",
                "hadithUrdu": "ہم نے عمر بن عبدالعزیز رحمۃ اللہ علیہ کے ساتھ ظہر کی نماز پڑھی ، پھر ہم باہر نکلے اور انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی خدمت میں حاضر ہوئے تو ہم نے انھیں حاصر کی نماز پڑھتے ہوئے پایا ، میں نے پوچھا : چچا جان! یہ کون سی نماز ہےجو آپ نے پڑھی ہے ؟ انھوں نے جواب دیا : عصر کی ہے ، اور یہی رسول اللہ ﷺ کی نماز ہے جو ہم آپ کے ساتھ پڑھا کرتے تھے ۔",
                "urduNarrator": "ہم سے منصور بن ابی مزاحم نے بیان کیا، کہا ہم سے عبداللہ بن المبارک نے بیان کیا، وہ ابوبکر بن عثمان بن سہل بن حنیف کی سند سے، انہوں نے کہا: میں نے سناحضرت ابو اامامہ بن سہل ‌رضی ‌اللہ ‌عنہ ‌ ‌ بیان کرتے ہیں",
                "hadithArabic": "حَدَّثَنَا مَنْصُورُ بْنُ أَبِي مُزَاحِمٍ، حَدَّثَنَا عَبْدُ اللهِ بْنُ الْمُبَارَكِ، عَنْ أَبِي بَكْرِ بْنِ عُثْمَانَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، قَالَ: سَمِعْتُ أَبَا أُمَامَةَ بْنَ سَهْلٍ، يَقُولُ: صَلَّيْنَا مَعَ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ الظُّهْرَ، ثُمَّ خَرَجْنَا حَتَّى دَخَلْنَا عَلَى أَنَسِ بْنِ مَالِكٍ، فَوَجَدْنَاهُ يُصَلِّي الْعَصْرَ، فَقُلْتُ: يَا عَمِّ، مَا هَذِهِ الصَّلَاةُ الَّتِي صَلَّيْتَ؟ قَالَ: «الْعَصْرَ، وَهَذِهِ صَلَاةُ رَسُولِ اللهِ صَلَّى اللهُ تَعَالَى عَلَيْهِ وَسَلَّمَ الَّتِي كُنَّا نُصَلِّي مَعَهُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8978,
                "hadithNumber": "1414",
                "englishNarrator": "Anas bin Malik ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) led us in the afternoon prayer. When he completed it, a person from Bani Salama came to him and said: Messenger of Allah, we intend to slaughter our came and we are desirous that you should also be present there (on this occasion). He (the Holy Prophet ﷺ) said: Yes. He (the person) went and we also went along with him and we found that the camel had not been slaughtered yet. Then it was slaughtered, and it was cut into pieces and then some of those were cooked, and then we ate (them) before the setting of the sun. This hadith has also been narrated by another chain of transmitters.",
                "hadithUrdu": "رسول اللہ ﷺ نے ہمیں عصر کی نماز پڑھا ئی تو جب آپ فارغ ہوئے ، آپ کے پاس بنو سلمہ کا ایک آدمی آیا اور کہا : اللہ کے رسول ! ہم اپنا اونٹ نحر کرنے کا اردہ رکھتے ہیں ۔ اور ہم چاہتے ہیں آپ بھی اس موقع پر موجود ہوں ۔ آپ نے فرمایا : ’’ اچھا ۔ ‘ ‘ آپ نکل پڑے ، ہم بھی آپ کے ساتھ چل پڑے ، ہم نے دیکھا ، اونٹ ابھی ذبح نہیں کیا گیا تھا ، اسے ذبح کیا گیا ، پھر اس کا گوشت کاٹا گیا ، پھر اس میں سے کچھ پکایا گیا ، پھر ہم نے سورج غروب ہونے سے پہلے ( اسے ) کھا لیا ۔ مرادی کا قول ہے کہ ہمیں یہ حدیث ابن وہب نے ابن لہیعہ اورعمروبن حارث دونوں سے روایت کرتے ہوئے سنائی ۔",
                "urduNarrator": "عمرو بن سواد عامری ، محمد بن سلمہ مرادی اور احم د بن عیسیٰ نےہمیں حدیث بیان کی ۔ اس سب کے الفاظ ملتے جلتے ہیں ۔ عمرو نے کیا : ہمیں خبر دی اور باقی دونوں نے کہا : ہمیں حدیث سنائی ابن وہب نے ، کہا : مجھے عمرو بن حارث نے یزید بن ابی حبیب سے خبر دی کہ موسیٰ بن سعد انصاری نےانھیں حدیث بیان کی ، انھوں نے حفص بن عبید اللہ سے اورانھوں نے حضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ سَوَّادٍ الْعَامِرِيُّ، وَمُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِيُّ، وَأَحْمَدُ بْنُ عِيسَى، وَأَلْفَاظُهُمْ مُتَقَارِبَةٌ، قَالَ عَمْرٌو: أَخْبَرَنَا، وَقَالَ الْآخَرَانِ: حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، أَنَّ مُوسَى بْنَ سَعْدٍ الْأَنْصَارِيَّ، حَدَّثَهُ عَنْ حَفْصِ بْنِ عُبَيْدِ اللهِ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ قَالَ: صَلَّى لَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الْعَصْرَ، فَلَمَّا انْصَرَفَ أَتَاهُ رَجُلٌ مِنْ بَنِي سَلَمَةَ، فَقَالَ: يَا رَسُولَ اللهِ، إِنَّا نُرِيدُ أَنْ نَنْحَرَ جَزُورًا لَنَا، وَنَحْنُ نُحِبُّ أَنْ تَحْضُرَهَا ، قَالَ: «نَعَمْ، فَانْطَلَقَ وَانْطَلَقْنَا مَعَهُ، فَوَجَدْنَا الْجَزُورَ لَمْ تُنْحَرْ، فَنُحِرَتْ، ثُمَّ قُطِّعَتْ، ثُمَّ طُبِخَ مِنْهَا، ثُمَّ أَكَلْنَا قَبْلَ أَنْ تَغِيبَ الشَّمْسُ» وقَالَ الْمُرَادِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، عَنِ ابْنِ لَهِيعَةَ، وَعَمْرِو بْنِ الْحَارِثِ فِي هَذَا الْحَدِيثِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8979,
                "hadithNumber": "1415",
                "englishNarrator": "Rafi' bin Khadij رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "We used to say the afternoon prayer with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), and then the camel was slaughtered and ten parts of it were distributed; then it was cooked and then we ate this cooked meat before the sinking of the sun.",
                "hadithUrdu": "ہم رسول اللہ ﷺ کے ساتھ نماز عصر پڑھتے ، پھر اونٹ ذبح کیا جاتا ، اس کے دس حصے کیے جاتے ، پھر ہم اسے پکاتے اور سورج کےغروب ہونے سے پہلے ہم اچھی طرح پکا ہوا گوشت کھا لیتے ۔",
                "urduNarrator": "ہم سے محمد بن مہران الرازی نے بیان کیا, ہمیں ولید بن مسلم نےحدیث سنائی ، کہا : اوزاعی نےہمیں حدیث بیان کی ، انھوں نے ابو نجاشی سے روایت کی ، انھوں نے کہا : میں نےحضرت رافع بن خدیج ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنا ، کہہ رہے تھے",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مِهْرَانَ الرَّازِيُّ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا الْأَوْزَاعِيُّ، عَنْ أَبِي النَّجَاشِيِّ، قَالَ: سَمِعْتُ رَافِعَ بْنَ خَدِيجٍ، يَقُولُ: «كُنَّا نُصَلِّي الْعَصْرَ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، ثُمَّ تُنْحَرُ الْجَزُورُ، فَتُقْسَمُ عَشَرَ قِسَمٍ، ثُمَّ تُطْبَخُ، فَنَأْكُلُ لَحْمًا نَضِيجًا قَبْلَ مَغِيبِ الشَّمْسِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8980,
                "hadithNumber": "1416",
                "englishNarrator": "This hadith has been reported by 'Auza'i with the same chain of transmitters:",
                "hadithEnglish": "We used to slaughter the camel during the lifetime of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم) after the 'Asr prayer, but he made no mention of: We used to pray along with him.",
                "hadithUrdu": "ہم رسول اللہ ﷺ کےعہدمیں عصر کے بعد اونٹ ذبح کرتےتھے ، نہیں کہا : ہم آپ کے ساتھ نماز پڑھتے تھے ۔",
                "urduNarrator": "اسحاق بن ابراہیم نے کہا : ہمیں عیسیٰ بن یونس اور شعیب بن اسحاق دمشقی نے خبر دی ، ان دونوں نے کہا : ہمیں اوزاعی نے اسی سند کے ساتھ یہی حدیث بیان کی ، البتہ انھوں ( اسحاق ) نے کہا",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، وَشُعَيْبُ بْنُ إِسْحَاقَ الدِّمَشْقِيُّ، قَالَا: حَدَّثَنَا الْأَوْزَاعِيُّ بِهَذَا الْإِسْنَادِ، غَيْرَ أَنَّهُ قَالَ: كُنَّا نَنْحَرُ الْجَزُورُ عَلَى عَهْدِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَعْدَ الْعَصْرِ، وَلَمْ يَقُلْ: كُنَّا نُصَلِّي مَعَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8981,
                "hadithNumber": "1417",
                "englishNarrator": "Ibn Umar رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: He who misses the afternoon prayer, it is as though he has been deprived of his family and his property.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’جس شخص کی نماز عصر رہ گئی تو گیا اس کے اہل وعیال اور اس کا مال تباہ وبرباد ہو گئے ۔ ‘ ‘",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا: میں نے مالک رضی اللہ عنہ سے پڑھا, نافع نے حضرت ابن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «الَّذِي تَفُوتُهُ صَلَاةُ الْعَصْرِ، كَأَنَّمَا وُتِرَ أَهْلَهُ وَمَالَهُ».",
                "headingArabic": "التَّغْلِيظِ فِي تَفْوِيتِ صَلاَةِ الْعَصْرِ ‏",
                "headingUrdu": "عصر کی نماز نہ چھوڑنے پر سخت تنبیہ",
                "headingEnglish": "Stern warning against missing the `Asr prayer",
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8982,
                "hadithNumber": "1418",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated as Marfu by another chain of transmitters.",
                "hadithUrdu": "ابو بکر بن ابی شبیہ اور عمرو الناقد نے کہا : ہمیں سفیان نے زہر سے ، انھوں نے سالم سے اور انھوں نے اپنے والد ( ابن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) سے حدیث بیان کی ۔ عمرو نے کہا : ( ابن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) اس حدیث کی سند کو ( رسول اللہ ﷺ تک ) پہنچاتے تھے ۔ ابو بکر نے کہا : ( انھوں نے ) اس حدیث کو مرفوعا بیان کیا ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، قَالَا: حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، قَالَ عَمْرٌو: يَبْلُغُ بِهِ، وقَالَ أَبُو بَكْرٍ رَفَعَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8983,
                "hadithNumber": "1419",
                "englishNarrator": "Abdullah relates on the authority of his father:",
                "hadithEnglish": "He who missed his afternoon prayer it is as though he was deprived of his family and property.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’جس شخص کی عصر کی نماز رہ گئی تو گویا اس کے ہل وعیال اور اسکا مال بتاہ و برباد ہو گئے ۔ ‘ ‘",
                "urduNarrator": "مجھ سے ہارون بن سعید الایلی نے بیان کیا، اور ان کا قول ہے، انہوں نے کہا: ہم سے ابن وہب نے بیان کیا, عمرو بن حارث نے ابن شہاب سے ، انھوں نے سالم بن عبداللہ سے اور انھوں نے اپنے والد سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ، وَاللَّفْظُ لَهُ، قَالَ: حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللهِ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «مَنْ فَاتَتْهُ الْعَصْرُ، فَكَأَنَّمَا وُتِرَ أَهْلَهُ وَمَالَهُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8984,
                "hadithNumber": "1420",
                "englishNarrator": "Ali ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "When it was the day (of the Battle) of Ahzab, the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: May Allah fill their graves and houses with fire, as they detained us and diverted us from the middle prayer, till the sun set.",
                "hadithUrdu": "رسول اللہﷺ نے غزوہ احزاب کےدن فرمایا : ’’اللہ تعالٰی ان ( مشرکین ) کی قبروں اور گھروں کو آگ سے بھر دے ، جس طرح انھوں نے ہمیں درمیانی نماز ( عصر ) سے روکا اور ( جنگ میں ) مشغول کیے رکھا حتی کہ سورج غروب ہو گیا ۔ ‘ ‘",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا ,ابوسامہ نے ہمیں حدیث سنائی ، انھوں نے ہشام سے ، انھوں نے محمد سے انھوں نے عبیدہ سے اور انھوں نےحضرت علی ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ مُحَمَّدٍ، عَنْ عَبِيدَةَ، عَنْ عَلِيٍّ، قَالَ: لَمَّا كَانَ يَوْمُ الْأَحْزَابِ، قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَلَأَ اللهُ قُبُورَهُمْ وَبُيُوتَهُمْ نَارًا، كَمَا حَبَسُونَا، وَشَغَلُونَا عَنِ الصَّلَاةِ الْوُسْطَى، حَتَّى غَابَتِ الشَّمْسُ.",
                "headingArabic": "الدَّلِيلِ لِمَنْ قَالَ الصَّلاَةُ الْوُسْطَى هِيَ صَلاَةُ الْعَصْرِ ‏",
                "headingUrdu": "ان لوگوں کی دلیل جو کہتے ہیں کہ درمیانی نماز عصر کی نماز ہے۔",
                "headingEnglish": "The evidence for those who say that “the middle prayer” is the `Asr prayer",
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8985,
                "hadithNumber": "1421",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated by Hisham with the same chain of transmitters.",
                "hadithUrdu": "ہم سے محمد بن ابی بکر المقدمی نے بیان کیا، کہا ہم سے یحییٰ بن سعید نے بیان کیا، کہا ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے معتمر بن سلیمان نے بیان کیا، اس سند کے ساتھ ہشام کی سند کے ساتھ جیم نے بیان کیا۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، ح وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ، جَمِيعًا عَنْ هِشَامٍ، بِهَذَا الْإِسْنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8986,
                "hadithNumber": "1422",
                "englishNarrator": "Ali ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: On the day (of the Battle) of Ahzab we were diverted from the middle prayer, till the sun set. May Allah fill their graves or their houses, or their stomachs with fire. The narrator is in doubt about houses and stomachs .",
                "hadithUrdu": "رسول اللہ ﷺ نے جنگ احزاب کے دن فرمایا : ’’ان لوگوں نے ہمیں درمیانی نماز سے مشغول کیے رکھا حتی کہ سورج غروب ہو گیا ‘ اللہ تعالیٰ ان کی قبروں کو اور گھروں کو یا ( فرمایا : ) ان کے پیٹوں کو آگ سے بھر دے ۔ ’’گھروں یا پیٹوں کے بارےمیں شعبہ کو شک ہوا ۔",
                "urduNarrator": "ہم سے محمد بن مثنیٰ اور محمد بن بشار نے بیان کیا، کہا: ہم سے محمد بن جعفر نے بیان کیا, شعبہ نے کہے : ہمیں قتادہ سے سنا ، وہ ابو حسان سے حدیث بیان کررہےتھے ، انھوں نے عبیدہ سے اور انھوں حضرت علی ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہا",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالَ ابْنُ الْمُثَنَّى: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ: سَمِعْتُ قَتَادَةَ، يُحَدِّثُ عَنْ أَبِي حَسَّانَ، عَنْ عَبِيدَةَ، عَنْ عَلِيٍّ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْأَحْزَابِ: «شَغَلُونَا عَنْ صَلَاةِ الْوُسْطَى حَتَّى آبَتِ الشَّمْسُ، مَلَأَ اللهُ قُبُورَهُمْ نَارًا، أَوْ بُيُوتَهُمْ، أَوْ بُطُونَهُمْ» - شَكَّ شُعْبَةُ فِي الْبُيُوتِ وَالْبُطُونِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8987,
                "hadithNumber": "1423",
                "englishNarrator": "This hadith has heed narrated by Qatada with the same chain of transmitters. And he said:",
                "hadithEnglish": "Their houses and their graves (be filled with fire), and did not express doubt over the words, houses and graves .",
                "hadithUrdu": "ان کے گھر اور ان کی قبریں (آگ سے بھر جائیں) اور الفاظ، گھروں اور قبروں پر شک کا اظہار نہ کیا۔",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا، کہا ہم سے ابن ابی عدی نے بیان کیا, سعید نے قتادہ سے اسی سند کے ساتھ مذکورہ بالا روایت بیان کی",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، بِهَذَا الْإِسْنَادِ، وَقَالَ: «بُيُوتَهُمْ وَقُبُورَهُمْ»، وَلَمْ يَشُكَّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8988,
                "hadithNumber": "1424",
                "englishNarrator": "Yahya heard 'Ali ‌رضی ‌اللہ ‌عنہ saying:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said on the day (of the Battle) of Ahzab, while sitting in one of the openings of the ditch: They (the enemies) have diverted us from the middle prayer till the sun set. May Allah fill their graves and their houses with fire, or their graves and stomachs with fire.",
                "hadithUrdu": "رسول اللہ ﷺ نے غزوہ احزاب کے موقع پر جب آپ خندق کی گزر گاہوں میں سے کسی گزر گا ہ پر تشریف فرما تھے ، فرمایا : انھوں نے ہمیں درمیانی نما ( عصر ) سے مشغول کر دیا حتی کہ سورج ڈوب گیا ، اللہ تعالیٰ ان کی قبروں اور گھروں کو یا فرمایا : ان کی قبروں او ر پیٹوں کو آگ سے بھر دے ۔ ‘ ‘",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور زہیر بن حرب نے بیان کیا، کہا: ہم سے وکیع نے شعبہ کی سند سے، الحکم کی سند سے بیان کیا, یحییٰ بن جزار نے حضرت علی ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالَا: حَدَّثَنَا وَكِيعٌ، عَنْ شُعْبَةَ، عَنِ الْحَكَمِ، عَنْ يَحْيَى بْنِ الْجَزَّارِ، عَنْ عَلِيٍّ، ح وَحَدَّثَنَاهُ عُبَيْدُ اللهِ بْنُ مُعَاذٍ، وَاللَّفْظُ لَهُ، قَالَ: حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ يَحْيَى، سَمِعَ عَلِيًّا، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْأَحْزَابِ، وَهُوَ قَاعِدٌ عَلَى فُرْضَةٍ مِنْ فُرَضِ الْخَنْدَقِ: «شَغَلُونَا عَنِ الصَّلَاةِ الْوُسْطَى حَتَّى غَرَبَتِ الشَّمْسُ، مَلَأَ اللهُ قُبُورَهُمْ وَبُيُوتَهُمْ»، أَوْ قَالَ: «قُبُورَهُمْ وَبُطُونَهُمْ نَارًا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 105,
                    "chapterNumber": "5",
                    "chapterEnglish": "The Book of Mosques and Places of Prayer",
                    "chapterUrdu": "مسجدیں اور نماز کی جگہیں",
                    "chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 8676,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=347",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=345",
                "label": "345",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=346",
                "label": "346",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=347",
                "label": "347",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=348",
                "label": "348",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=349",
                "label": "349",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=350",
                "label": "350",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=351",
                "label": "351",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=349",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=349",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=347",
        "to": 8700,
        "total": 40465
    }
}