{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 394,
        "data": [
            {
                "id": 10114,
                "hadithNumber": "2550",
                "englishNarrator": "Amr bin al-'As رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The difference between our fasting and that of the people of the Book is eating shortly before dawn.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ارشاد فرمایا ہمارےروزے اور اہل کتاب کے روزے کے درمیان سحری کھانے کافرق ہے ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، انہوں نے بیان کیا لیث ، موسیٰ بن علی ، ابی قیس ، مولی عمرو بن عاص ، حضرت عمر بن العاص رضی اللہ تعالیٰ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ مُوسَى بْنِ عُلَيٍّ، عَنْ أَبِيهِ، عَنْ أَبِي قَيْسٍ، مَوْلَى عَمْرِو بْنِ الْعَاصِ، عَنْ عَمْرِو بْنِ الْعَاصِ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «فَصْلُ مَا بَيْنَ صِيَامِنَا وَصِيَامِ أَهْلِ الْكِتَابِ، أَكْلَةُ السَّحَرِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10115,
                "hadithNumber": "2551",
                "englishNarrator": null,
                "hadithEnglish": "Musa bin 'Ali رضی اللہ تعالیٰ عنہ has narrated this hadith through the same chain of transmitters.",
                "hadithUrdu": "ہم سے یحییٰ بن یحییٰ اور ابوبکر بن ابی شیبہ نے روایت کی ہے , وکیع اور وہب دونون نے موسیٰ بن علی رضی اللہ تعالیٰ عنہ سے اسی طرح ر وایت نقل کی گئی ہے ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، جَمِيعًا عَنْ وَكِيعٍ، ح وحَدَّثَنِيهِ أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، كِلَاهُمَا عَنْ مُوسَى بْنِ عُلَيٍّ بِهَذَا الْإِسْنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10116,
                "hadithNumber": "2552",
                "englishNarrator": "Zaid bin Thabit رضی اللہ تعالیٰ عنہ said:",
                "hadithEnglish": "We took meal shortly before dawn along with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). We then stood up for prayer. I said: How much span of time was there between the two (acts, i. e. taking of Sahri and observing of prayer)? He said (a span of reciting) fifty verses.",
                "hadithUrdu": "انہوں نے فرمایا کہ ہم نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ سحری کھائی پھر نماز کےلئے کھڑے ہوئے میں نے عرض کیا کہ سحری کھانے اور نماز کے درمیان کتنا وقفہ تھا آپ نے فرمایا پچاس آیات کے برابر ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے وکیع نے بیان کیا, ہشام ، قتادہ ، انس ، حضرت زید بن ثابت رضی اللہ تعالیٰ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ هِشَامٍ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، عَنْ زَيْدِ بْنِ ثَابِتٍ رَضِيَ اللهُ عَنْهُ، قَالَ: «تَسَحَّرْنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، ثُمَّ قُمْنَا إِلَى الصَّلَاةِ» قُلْتُ: كَمْ كَانَ قَدْرُ مَا بَيْنَهُمَا؟ قَالَ: خَمْسِينَ آيَةً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10117,
                "hadithNumber": "2553",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been transmitted on the authority of Qatada رضی اللہ تعالیٰ عنہ too.",
                "hadithUrdu": "عمرو ناقد ، یزیدبن ہارون ، ہمام ، ابن مثنی ، سالم بن نوح ، عمربن عامر ، قتادہ اس سند کے ساتھ حضرت قتادہ رضی اللہ تعالیٰ عنہ سے روایت نقل کی گئی ہے ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا هَمَّامٌ، ح وحَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا سَالِمُ بْنُ نُوحٍ، حَدَّثَنَا عُمَرُ بْنُ عَامِرٍ، كِلَاهُمَا عَنْ قَتَادَةَ، بِهَذَا الْإِسْنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10118,
                "hadithNumber": "2554",
                "englishNarrator": "Sahl bin Sa'd رضی اللہ تعالیٰ عنہ repotted:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The people will continue to prosper as long as they hasten the breaking of the fast.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا لوگ ہمیشہ بھلائی کے ساتھ رہیں گے جب تک روزہ جلد افطار کرتے رہیں گے ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے بیان کیا عبدالعزیز بن ابی حازم ، حضرت سہل بن سعد رضی اللہ تعالیٰ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ سَهْلِ بْنِ سَعْدٍ رَضِيَ اللهُ عَنْهُ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَزَالُ النَّاسُ بِخَيْرٍ مَا عَجَّلُوا الْفِطْرَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10119,
                "hadithNumber": "2555",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been transmitted by Sahl bin Sa'd رضی اللہ تعالیٰ عنہ .",
                "hadithUrdu": "قتیبہ ، یعقوب ، زہیر بن حرب ، عبدالرحمٰن ابن مہدی ، سفیان ، حضرت سہل بن سعد رضی اللہ تعالیٰ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے اسی حدیث مبارکہ کی طرح روایت نقل کی ہے ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَاه قُتَيْبَةُ، حَدَّثَنَا يَعْقُوبُ، ح وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ سُفْيَانَ كِلَاهُمَا، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ رَضِيَ اللهُ عَنْهُ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10120,
                "hadithNumber": "2556",
                "englishNarrator": "Abu 'Atiyya رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "I and Masruq went to 'A'isha رضی اللہ تعالیٰ عنہا and said to her: Mother of the Believers, there are two persons among the Companions of Muhammad ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) one among whom hastens in breaking the fast and in observing prayer, and the other delays breaking the fast and delays observing prayer. She said: Who among the two hastens in breaking fast and observing prayers? We said, It is 'Abdullah رضی اللہ تعالیٰ عنہ . i. e. son of Mas'ud. whereupon she said: This is how the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) did. Abu Kuraib added: The second one was Abu Musa رضی اللہ تعالیٰ عنہ .",
                "hadithUrdu": "میں اور مسروق دونوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا کی خدمت میں حاضر ہوکر عرض کیا اے ام المومنین رضی اللہ تعالیٰ عنہا ! محمد صلی اللہ علیہ وسلم کے ساتھیوں میں سے دو آدمی ہیں ان میں سے ایک افطاری میں جلدی کرتا ہے اور نماز میں بھی جلدی کرتاہے دوسرا ساتھی افطاری میں تاخیر کرتاہے اور نماز میں بھی تاخیر کرتاہے ۔ حضرت عائشہ رضی اللہ تعالیٰ عنہا نے فرمایا!کہ ان میں سے وہ کون ہیں جو افطاری میں جلدی کرتے ہیں اور نماز بھی جلدی پڑھتے ہیں ۔ حضرت ابو عطیہ کہتے ہیں کہ ہم نے عرض کیا کہ وہ حضرت عبداللہ رضی اللہ تعالیٰ عنہ ہیں ۔ یعنی ابن مسعود ، حضرت عائشہ رضی اللہ تعالیٰ عنہا نے فرمایا کہ رسول اللہ صلی اللہ علیہ وسلم بھی اسی طرح کیا کرتے تھے اب کریب کی روایت میں اتنا زائد ہے کہ دوسرے ساتھی ابوموسیٰ رضی اللہ تعالیٰ عنہ ہیں ۔",
                "urduNarrator": "یحییٰ بن یحییٰ ، ابو کریب ، محمد بن علاء ، ابو معاویہ ، اعمش ، عمارہ بن عمیر ، حضرت ابو عطیہ رضی اللہ تعالیٰ عنہ سے روایت ہے انہوں نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ، قَالَا: أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ عُمَارَةَ بْنِ عُمَيْرٍ، عَنْ أَبِي عَطِيَّةَ، قَالَ: دَخَلْتُ أَنَا وَمَسْرُوقٌ، عَلَى عَائِشَةَ فَقُلْنَا: يَا أُمَّ الْمُؤْمِنِينَ، رَجُلَانِ مِنْ أَصْحَابِ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، أَحَدُهُمَا «يُعَجِّلُ الْإِفْطَارَ وَيُعَجِّلُ الصَّلَاةَ»، وَالْآخَرُ يُؤَخِّرُ الْإِفْطَارَ وَيُؤَخِّرُ الصَّلَاةَ، قَالَتْ: أَيُّهُمَا الَّذِي يُعَجِّلُ الْإِفْطَارَ وَيُعَجِّلُ الصَّلَاةَ؟ قَالَ: قُلْنَا عَبْدُ اللهِ يَعْنِي ابْنَ مَسْعُودٍ قَالَتْ: «كَذَلِكَ كَانَ يَصْنَعُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ» زَادَ أَبُو كُرَيْبٍ: وَالْآخَرُ أَبُو مُوسَى.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10121,
                "hadithNumber": "2557",
                "englishNarrator": "Abu 'Atiyya رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "I and Misruq رضی اللہ تعالیٰ عنہ went to 'A'isha رضی اللہ تعالیٰ عنہا and Masruq رضی اللہ تعالیٰ عنہ said to her: There are two persons among the Companions of Muhammad ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) none of whom abandons the good, but one of them hastens to observe sunset prayer and break the fast, and the other delays in observing the sunset prayer and in breaking the fast, whereupon she said: Who hastens to observe sunset prayer and break the fast? He said: It is 'Abdullah. Upon this she said: This is how the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to do.",
                "hadithUrdu": "میں اور حضرت مسروق رضی اللہ تعالیٰ عنہ حضرت عائشہ رضی اللہ تعالیٰ عنہا کی خدمت میں حاضر ہوئے تو آپ سے حضرت مسروق رضی اللہ تعالیٰ عنہ نے عرض کیا کہ محمد صلی اللہ علیہ وسلم کے ساتھیوں میں سے دو ایسے ہیں جو بھلائی کے بارے میں کمی نہیں کرتے ان میں سے ایک مغرب کی نماز اورافطاری میں جلدی کرتا ہے ۔ دوسرا مغرب کی نماز اور افطاری میں تاخیر کرتاہے ۔ تو حضرت عائشہ رضی اللہ تعالیٰ عنہا نے فرمایا کہ مغرب کی نماز اور افطاری میں کون جلدی کرتا ہے؟مسروق رضی اللہ تعالیٰ عنہ نے عرض کیا کہ حضرت عبداللہ تو حضرت عائشہ رضی اللہ تعالیٰ عنہا نے فرمایا کہ رسول اللہ صلی اللہ علیہ وسلم بھی اسی طرح کیا کرتے تھے ۔",
                "urduNarrator": "ہم سے ابو کریب نے بیان کیا، ابن ابی زائد ، اعمش ، عمارہ ، حضرت ابو عطیہ رضی اللہ تعالیٰ عنہ سے روایت ہے انہوں نے فرمایا کہ",
                "hadithArabic": "وحَدَّثَنَا أَبُو كُرَيْبٍ، أَخْبَرَنَا ابْنُ أَبِي زَائِدَةَ، عَنِ الْأَعْمَشِ، عَنْ عُمَارَةَ، عَنْ أَبِي عَطِيَّةَ، قَالَ: دَخَلْتُ أَنَا وَمَسْرُوقٌ، عَلَى عَائِشَةَ رَضِيَ اللهُ عَنْهَا، فَقَالَ لَهَا مَسْرُوقٌ: رَجُلَانِ مِنْ أَصْحَابِ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، كِلَاهُمَا لَا يَأْلُو عَنِ الْخَيْرِ، أَحَدُهُمَا «يُعَجِّلُ الْمَغْرِبَ وَالْإِفْطَارَ»، وَالْآخَرُ يُؤَخِّرُ الْمَغْرِبَ وَالْإِفْطَارَ، فَقَالَتْ: مَنْ يُعَجِّلُ الْمَغْرِبَ وَالْإِفْطَارَ؟ قَالَ: عَبْدُ اللهِ، فَقَالَتْ: «هَكَذَا كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَصْنَعُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10122,
                "hadithNumber": "2558",
                "englishNarrator": "Umar (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When the night approaches and the day retreates and the sun sinks down, then the observer of the fast should break it. Ibn Numair made no mention of the word then .",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر مایا کہ جب رات آجائے اور دن چلا جائے اور سورج غروب ہوجائے تو روزہ رکھنے والے کو روزہ افطار کرلیناچاہیے ۔ ابن نمیر نے فقد ( حقیقتاً ) کا لفظ بیان نہیں کیا ۔",
                "urduNarrator": "یحییٰ بن یحییٰ ، ابو کریب ، ابن نمیر ، یحییٰ ، ابو معاویہ ، ابن نمیر ، ابو کریب ، اسامہ ، ہشام ، عروہ ، عاصم ، ابن عمر ، حضرت عمر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو كُرَيْبٍ، وَابْنُ نُمَيْرٍ، وَاتَّفَقُوا فِي اللَّفْظِ قَالَ يَحْيَى: أَخْبَرَنَا أَبُو مُعَاوِيَةَ، وَقَالَ ابْنُ نُمَيْرٍ: حَدَّثَنَا أَبِي، وقَالَ أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، جَمِيعًا عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَاصِمِ بْنِ عُمَرَ، عَنْ عُمَرَ رَضِيَ اللهُ عَنْهُ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا أَقْبَلَ اللَّيْلُ وَأَدْبَرَ النَّهَارُ، وَغَابَتِ الشَّمْسُ فَقَدْ أَفْطَرَ الصَّائِمُ» لَمْ يَذْكُرْ ابْنُ نُمَيْرٍ: «فَقَدْ».",
                "headingArabic": "بَيَانِ وَقْتِ انْقِضَاءِ الصَّوْمِ وَخُرُوجِ النَّهَارِ ‏‏",
                "headingUrdu": "روزہ ختم کرنے اور دن کے اختتام کے وقت کی وضاحت",
                "headingEnglish": "Clarifying the time for ending the fast and the end of the day",
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10123,
                "hadithNumber": "2559",
                "englishNarrator": "Abdullah bin Abi Aufa رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "We were with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) on a journey during the month of Ramadan. When the sun had sunk he said: So and so, get down (from your ride) and prepare the meal of parched barley for us. He said: Messenger of Allah, still (there is light of) day. He (the Holy Prophet) said: Get down and prepare meal of parched barley for us. So he got down and prepared the meal of parched barley and offered him, and the apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) drank that (liquid meal). He then told with the gesture of his hand that when the sun sank from that side and the night appeared from that side, then the observer of the fast should break it.",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ رمضان کے مہینے میں ایک سفر میں تھے جب سورج غروب ہوگیا تو آپ نے فرمایا اے فلاں!اتر اور ہمارے لئے ستو ملااس نے عرض کیا اے اللہ کے رسول صلی اللہ علیہ وسلم !ابھی تو دن ہے آپ صلی اللہ علیہ وسلم نے فرمایا اتر اور ہمارے لئے ستو ملا تو وہ اترا اور اس نے ستو ملا کر آپ صلی اللہ علیہ وسلم کی خدمت میں پیش کیا نبی کریم صلی اللہ علیہ وسلم نے ستو پیا پھر آپ نے اپنے ہاتھ مبارک سے فرمایا جب سورج اس طرف سے غروب ہوجائے اور اس طرف سے رات آجائے تو روزہ رکھنے والے کو افطار کرلیناچاہیے ۔ ( اس کا روزہ ختم ہوچکا )",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے بیان کیا ہشیم ، ابی اسحاق شیبانی ، حضرت عبداللہ بن ابی اوفیٰ رضی اللہ تعالیٰ عنہ  سے روایت ہے انہوں نے فرمایا کہ",
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، عَنْ أَبِي إِسْحَاقَ الشَّيْبَانِيِّ، عَنْ عَبْدِ اللهِ بْنِ أَبِي أَوْفَى رَضِيَ اللهُ عَنْهُ، قَالَ: كُنَّا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فِي شَهْرِ رَمَضَانَ، فَلَمَّا غَابَتِ الشَّمْسُ قَالَ: «يَا فُلَانُ، انْزِلْ فَاجْدَحْ لَنَا» قَالَ: يَا رَسُولَ اللهِ، إِنَّ عَلَيْكَ نَهَارًا، قَالَ: «انْزِلْ فَاجْدَحْ لَنَا» قَالَ: فَنَزَلَ فَجَدَحَ، فَأَتَاهُ بِهِ، فَشَرِبَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، ثُمَّ قَالَ: بِيَدِهِ «إِذَا غَابَتِ الشَّمْسُ مِنْ هَا هُنَا، وَجَاءَ اللَّيْلُ مِنْ هَا هُنَا، فَقَدْ أَفْطَرَ الصَّائِمُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10124,
                "hadithNumber": "2560",
                "englishNarrator": "Ibn Abi Aufa رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "We were with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) on a journey. When the sun sank he said to a person: Get down and prepare barley meal for us. Upon this he said: Messenger of Allah, let there be dusk. (He the Holy Prophet) said: Get down and prepare barley meal for us. He (the person) said: There is still (the light of) day upon us. (But) he got down (in obedience to the command of the Holy Prophet) and prepared a barley meal for him and he (the Holy Prophet) drank that (liquid meal) and then said: When you see the night approaching from that side (west) (and he pointed towards the east with his hand), then the observer of the fast should break it.",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک سفر میں تھے جب سورج غروب ہوگیا تو آپ نے ایک آدمی سے فرمایا اتر اور ہمارے لئے ستو ملا اس نے عرض کیا اے اللہ کے رسول صلی اللہ علیہ وسلم اگر آپ شام ہونے دیں؟تو آپ نے فرمایا اتر اور ہمارے لئے ستو ملا اس نے عرض کیا ابھی تو دن ہے وہ اترا اور اس نے ستو ملایا آپ نے ستو پیا پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ جب تم دیکھو کہ رات اس طرف آگئی ہے اور آپ نے مشرق کی طرف اپنے ہاتھ سے اشارہ فرمایا تو روزہ دار کو روزہ افطار کرلینا چاہیے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، انہوں نے کہا علی بن مسہر ، عباد بن عوام ، شیبانی ، حضرت ابن ابی اوفیٰ رضی اللہ تعالیٰ عنہ سے روایت ہے انہوں نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، وَعَبَّادُ بْنُ الْعَوَّامِ، عَنِ الشَّيْبَانِيِّ، عَنِ ابْنِ أَبِي أَوْفَى رَضِيَ اللهُ عَنْهُ، قَالَ: كُنَّا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ، فَلَمَّا غَابَتِ الشَّمْسُ قَالَ لِرَجُلٍ: «انْزِلْ فَاجْدَحْ لَنَا» فَقَالَ: يَا رَسُولَ اللهِ، لَوْ أَمْسَيْتَ، قَالَ: «انْزِلْ فَاجْدَحْ لَنَا» قَالَ: إِنَّ عَلَيْنَا نَهَارًا، فَنَزَلَ فَجَدَحَ لَهُ فَشَرِبَ، ثُمَّ قَالَ: «إِذَا رَأَيْتُمُ اللَّيْلَ قَدْ أَقْبَلَ مِنْ هَا هُنَا - وَأَشَارَ بِيَدِهِ نَحْوَ الْمَشْرِقِ - فَقَدْ أَفْطَرَ الصَّائِمُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10125,
                "hadithNumber": "2561",
                "englishNarrator": "Abdullah bin Abi Aufa رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "We travelled with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as he had been observing fast. When the sun sank he said: So and so, get down and prepare barley meal for us. The rest of the hadith is the same.",
                "hadithUrdu": "تم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک سفر میں تھے اور آپ روزہ کی حالت میں تھے تو جب سورج غروب ہوگیا تو آپ صلی اللہ علیہ وسلم نے فرمایا اے فلاں! اتر اور ہمارے لئے ستو لا آگے حدیث اسی طرح ہے ۔",
                "urduNarrator": "ابوکامل ، عبدالواحد ، سلیمان شیبانی ، حضرت عبداللہ بن اوفیٰ رضی اللہ تعالیٰ عنہ فرماتے ہیں کہ",
                "hadithArabic": "وحَدَّثَنَا أَبُو كَامِلٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا سُلَيْمَانُ الشَّيْبَانِيُّ، قَالَ: سَمِعْتُ عَبْدَ اللهِ بْنَ أَبِي أَوْفَى رَضِيَ اللهُ عَنْهُ، يَقُولُ: سِرْنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَهُوَ صَائِمٌ، فَلَمَّا غَرَبَتِ الشَّمْسُ قَالَ: «يَا فُلَانُ، انْزِلْ فَاجْدَحْ لَنَا» مِثْلَ حَدِيثِ ابْنِ مُسْهِرٍ وَعَبَّادِ بْنِ الْعَوَّامِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10126,
                "hadithNumber": "2562",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Ibn Abi Aufa رضی اللہ تعالیٰ عنہ through another chain of transmitters (but with a sight alteration of words): In this hadith transmitted by one of the narrators (neither these words are found): During the month of Ramadan. nor his statement: And the night prevails from that side (the eastern side). (These words are found in the narration of) Hushaim only.",
                "hadithUrdu": "ابن ابی عمر ، سفیان ، اسحاق ، جریر ، شیبانی ، ابن ابی اوفیٰ ، عبیداللہ بن معاذ ، ابن مثنی ، محمد بن جعفر ، شعبہ اس سند کے ساتھ حضرت ابن اوفیٰ رضی اللہ تعالیٰ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے اس طرح روایت نقل کی ہے لیکن اس میں بعض الفاظ کی کمی ہے ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا ابْنُ أَبِي عُمَرَ، أَخْبَرَنَا سُفْيَانُ، ح وحَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا جَرِيرٌ، كِلَاهُمَا عَنِ الشَّيْبَانِيِّ، عَنِ ابْنِ أَبِي أَوْفَى، ح وحَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، ح وحَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَا: حَدَّثَنَا شُعْبَةُ، عَنِ الشَّيْبَانِيِّ، عَنِ ابْنِ أَبِي أَوْفَى رَضِيَ اللهُ عَنْهُ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، بِمَعْنَى حَدِيثِ ابْنِ مُسْهِرٍ، وَعَبَّادٍ، وَعَبْدِ الْوَاحِدِ، وَلَيْسَ فِي حَدِيثِ أَحَدٍ مِنْهُمْ: فِي شَهْرِ رَمَضَانَ، وَلَا قَوْلُهُ «وَجَاءَ اللَّيْلُ مِنْ هَا هُنَا» إِلَّا فِي رِوَايَةِ هُشَيْمٍ وَحْدَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10127,
                "hadithNumber": "2563",
                "englishNarrator": "Ibn 'Umar رضی اللہ تعالیٰ عنہ said:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade uninterrupted fasting. They (some of the Companions) said: You yourself fast uninterruptedly, whereupon he said: I am not like you. I am fed and supplied drink (by Allah).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے صوم وصال سے منع فرمایا ہے صحابہ رضوان اللہ عنھم اجمعین نے عرض کیا کہ آپ تو وصال کرتے ہیں آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں تمہاری طرح نہیں ہوں کیونکہ مجھے تو کھلایا اور پلایا جاتا ہے ۔",
                "urduNarrator": "یحییٰ بن یحییٰ ، نافع ، حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ رَضِيَ اللهُ عَنْهُمَا، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، نَهَى عَنِ الْوِصَالِ، قَالُوا: إِنَّكَ تُوَاصِلُ، قَالَ: «إِنِّي لَسْتُ كَهَيْئَتِكُمْ إِنِّي أُطْعَمُ وَأُسْقَى».",
                "headingArabic": "النَّهْىِ عَنِ الْوِصَالِ، فِي الصَّوْمِ ‏‏",
                "headingUrdu": "الوصال کی ممانعت",
                "headingEnglish": "The prohibition of Al-Wisal",
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10128,
                "hadithNumber": "2564",
                "englishNarrator": "Ibn 'Umar رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) observed fasts uninterruptedly in Ramadan and the people (in his wake) did this. But he forbade them to do so. It was said to him (to the Holy Prophet): You yourself observe the fasts uninterruptedly (but you forbid us to do so) Upon this he said: I am not like you; I am fed and supplied drink (by Allah).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے رمضان میں وصال فرمایا ( یعنی بغیر افطاری کے مسلسل روزے رکھے ) لہذا صحابہ رضوان اللہ عنھم اجمعین نے بھی وصال شروع کردیا تو آپ نے ان کو منع فرمایا ۔ آپ سے عرض کیا گیا کہ آپ بھی تو وہ وصال کرتے ہیں ۔ آپ نے فرمایا کہ میں تمہاری طرح نہیں ہوں کیونکہ مجھے کھلایا اور پلایاجاتا ہے ۔",
                "urduNarrator": "ابو بکر بن ابی شیبہ ، عبداللہ بن نمیر ، عبیداللہ ، نافع ، حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ",
                "hadithArabic": "وحَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللهِ بْنُ نُمَيْرٍ، ح وحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ رَضِيَ اللهُ عَنْهُمَا، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَاصَلَ فِي رَمَضَانَ، فَوَاصَلَ النَّاسُ، فَنَهَاهُمْ قِيلَ لَهُ: أَنْتَ تُوَاصِلُ؟ قَالَ: «إِنِّي لَسْتُ مِثْلَكُمْ إِنِّي أُطْعَمُ وَأُسْقَى».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10129,
                "hadithNumber": "2565",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been transmitted by Ibn 'Umar رضی اللہ تعالیٰ عنہ , but he did not make mention of (the words): During the month of Ramadan.",
                "hadithUrdu": "عبدالوارث بن عبدالصمد ، ایوب ، نافع ، ابن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم سے اسی حدیث کی طرح نقل فرمایا ہے لیکن اس میں رمضان کالفظ نہیں ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ عَبْدِ الصَّمَدِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ رَضِيَ اللهُ عَنْهُمَا، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ، وَلَمْ يَقُلْ: فِي رَمَضَانَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10130,
                "hadithNumber": "2566",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) forbade (his Companions) from observing fast uninterruptedly. One of the Muslims said: Messenger of Allah, you yourself observe Saum Wisal, whereupon the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Who among you is like me? I spend night (in a state) that my Allah feeds me and provides me drink. When they (the Companions of the Holy Prophet) did not agree in abandoning the uninterrupted fast, then the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) also observed this fast with them for a day, and then for a day. They then saw the new moon and he (the Holy Prophet) said: If the appearance of the new moon were delayed. I would have observed more (fasts) with you (and he did it) by way of warning to them as they had not agreed to refrain (from observing Saum Wisal)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے وصال سے منع فرمایا مسلمانوں میں سے ایک آدمی نے عرض کیا کہ اے اللہ کے رسول صلی اللہ علیہ وسلم ! آ پ بھی تو مسلسل روزے رکھتے ہیں ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تم میں سے میری طرح کون ہے؟میں تو اس حالت میں رات گزارتا ہوں کہ میرا رب مجھ کھلاتا اورپلاتاہے ۔ جب اس کے باوجود صحابہ رضوان اللہ عنھم اجمعین صوم وصال سے نہ رکے تو آپ نے ان کے ساتھ ایک افطاری کے بغیر روزہ رکھا اور پھر افطارکے بغیر روزہ رکھا پھر انہوں نے چاند دیکھ لیا آپ نے فرمایا کہ اگر چاند تاخیر کرتا تو میں اور زیادہ وصال کرتا گویا کہ آپ نے ان کے نہ رکنے پر ناپسندیدگی کا اظہار فرمایا ۔",
                "urduNarrator": "حرملہ بن یحییٰ ، ابن وہب ، یونس ، ابن شہاب ، ابو سلمہ بن عبدالرحمٰن ، حضرت ابوہریرہ رضی اللہ تعالیٰ عنہ سے روایت ہے انہوں نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ، قَالَ: نَهَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ الْوِصَالِ، فَقَالَ رَجُلٌ مِنَ الْمُسْلِمِينَ: فَإِنَّكَ يَا رَسُولَ اللهِ تُوَاصِلُ، قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «وَأَيُّكُمْ مِثْلِي؟ إِنِّي أَبِيتُ يُطْعِمُنِي رَبِّي وَيَسْقِينِي» فَلَمَّا أَبَوْا أَنْ يَنْتَهُوا عَنِ الْوِصَالِ وَاصَلَ بِهِمْ يَوْمًا، ثُمَّ يَوْمًا، ثُمَّ رَأَوُا الْهِلَالَ، فَقَالَ: «لَوْ تَأَخَّرَ الْهِلَالُ لَزِدْتُكُمْ» كَالْمُنَكِّلِ لَهُمْ حِينَ أَبَوْا أَنْ يَنْتَهُوا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10131,
                "hadithNumber": "2567",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Abstain from Saum-Wisal. They (his Companions) said: Messenger of Allah, but you observe Saum Wisal. Upon this he said: You are not like me in this matter, for I spend my night (in a state) that my Lord feeds me and provides me drink Devote yourselves to the deeds (the burden of which) you can bear.",
                "hadithUrdu": "رسول اللہ رضوان اللہ عنھم اجمعین نے فرمایاکہ تم وصال کے روزے رکھنے سے بچو صحابہ رضوان اللہ عنھم اجمعین نے عرض کیا اے اللہ کےرسول صلی اللہ علیہ وسلم !آپ بھی تو وصال کے روزے رکھتے ہیں؟آپ صلی اللہ علیہ وسلم نے فرمایاتم اس معاملے میں میری طرح نہیں ہوکیونکہ میں اس حالت میں رات گزارتاہوں کہ میرا رب مجھے کھلاتا اور پلاتا ہے ۔ تو تم وہ کام کرو جس کی تم طاقت رکھتے ہو ۔",
                "urduNarrator": "زہیر بن حرب ، اسحاق ، زہیر ، جریر ، عمارہ ، ابی زرعہ ، حضرت ابوہریرۃ رضی اللہ تعالیٰ عنہ سے روایت ہے کہ",
                "hadithArabic": "وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ، قَالَ زُهَيْرٌ: حَدَّثَنَا جَرِيرٌ، عَنْ عُمَارَةَ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِيَّاكُمْ وَالْوِصَالَ» قَالُوا: فَإِنَّكَ تُوَاصِلُ، يَا رَسُولَ اللهِ، قَالَ: «إِنَّكُمْ لَسْتُمْ فِي ذَلِكَ مِثْلِي، إِنِّي أَبِيتُ يُطْعِمُنِي رَبِّي وَيَسْقِينِي، فَاكْلَفُوا مِنَ الْأَعْمَالِ مَا تُطِيقُونَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10132,
                "hadithNumber": "2568",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying (the words as said in the previous hadith) but with this alteration (of words): Take upon yourselves (the burden of the deeds) for which you have the strength to bear.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے ارشاد فرمایا جس کام کی تم طاقت رکھو وہ کام کرو ۔",
                "urduNarrator": "قتیبہ ، مغیرہ ، ابی زناد ، اعرج ، حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے اسی طرح روایت کیاہے سوائے اس کے کہ اس میں ہے",
                "hadithArabic": "وحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا الْمُغِيرَةُ، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ، غَيْرَ أَنَّهُ قَالَ: «فَاكْلَفُوا مَا لَكُمْ بِهِ طَاقَةٌ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10133,
                "hadithNumber": "2569",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade (his Companions) to observe Saum Wisal.",
                "hadithUrdu": "آپ نے وصال سے منع فرمایا ۔ ( آگے ) ابو زرعہ سے عمارہ کی حدیث کے مانندہے ۔",
                "urduNarrator": "ابن نمیر ، اعمش ، ابی صالح ، حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ نے نبی سے اسی طرح روایت کیا ہے جس میں ہے کہ",
                "hadithArabic": "وحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الْأَعْمَشُ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، أَنَّهُ نَهَى عَنِ الْوِصَالِ، بِمِثْلِ حَدِيثِ عُمَارَةَ، عَنْ أَبِي زُرْعَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10134,
                "hadithNumber": "2570",
                "englishNarrator": "Anas رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was observing prayer during Ramadan. I came and stood by his side. Then another man came and he stood likewise till we became a group. When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) perceived that we were behind him, he lightened the prayer. He then went to his abode and observed such (a long) prayer (the like of which) he never observed with us. When it was morning we said to him: Did you perceive us during the night? Upon this he said: Yes, it was this (realisation) that induced me to do that which I did. He (the narrator) said: The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) began to observe Saum Wisal at the end of the month (of Ramadan), and some persons among his Companions began to observe this uninter- rupted fast, whereupon the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: What about such persons who observe uninterrupted fasts? You are not like me. By Allah. if the month were lengthened for me, I would have observed Saum Wisal, so that those who act with an exaggeration would (have been obliged) to abandon their exaggeration.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم رمضان میں نماز پڑھ رہے تھے تو میں آکر آپ صلی اللہ علیہ وسلم کے پہلو کی جانب کھڑا ہوگیا یہاں تک کہ ہماری ایک جماعت بن گئی جب نبی کریم صلی اللہ علیہ وسلم نے محسوس فرمایاکہ میں آپ کے پیچھے ہوں تو آپ صلی اللہ علیہ وسلم نے نماز میں تخفیف شروع فرمادی پھر آپ صلی اللہ علیہ وسلم میں داخل ہوئے ۔ آپ نے ایک ایسی نماز پڑھی جیسی نماز آپ ہمارے ساتھ نہیں پڑھتے تھے جب صبح ہوئی تو ہم نے آپ صلی اللہ علیہ وسلم سے عرض کیا کہ کیا رات آپ کو ہمارا علم ہوگیا تھا؟آپ صلی اللہ علیہ وسلم نے فرمایا ہاں اسی وجہ سے وہ کام کیا جو میں نے کیا حضرت انس رضی اللہ تعالیٰ عنہ کہتے ہیں کہ پھر رسول اللہ صلی اللہ علیہ وسلم نے وصال کے روزے رکھنے شروع فرمادیئے وہ مہینہ کے آخر میں تھے آپ کے صحابہ رضوان اللہ عنھم اجمعین میں سے بھی کچھ لوگوں نے وصال کے روزے رکھنے شروع کردیئے تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ یہ لوگ صوم وصال کیوں رکھ رہے ہیں؟تم لوگ میر ی طرح نہیں ہو اللہ کی قسم! اگر یہ مہینہ لمبا ہوتا تو میں اس قدر وصال کے روزے رکھتا کہ ضد کرنے والے اپنی ضد چھوڑ دیتے ۔",
                "urduNarrator": "زہیر بن حرب ابو نضر ہاشم بن قاسم سلیمان ثابت حضرت انس رضی اللہ تعالیٰ عنہ نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا أَبُو النَّضْرِ هَاشِمُ بْنُ الْقَاسِمِ، حَدَّثَنَا سُلَيْمَانُ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ رَضِيَ اللهُ عَنْهُ، قَالَ: كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يُصَلِّي فِي رَمَضَانَ، فَجِئْتُ فَقُمْتُ إِلَى جَنْبِهِ وَجَاءَ رَجُلٌ آخَرُ، فَقَامَ أَيْضًا حَتَّى كُنَّا رَهْطًا فَلَمَّا حَسَّ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّا خَلْفَهُ جَعَلَ يَتَجَوَّزُ فِي الصَّلَاةِ، ثُمَّ دَخَلَ رَحْلَهُ، فَصَلَّى صَلَاةً لَا يُصَلِّيهَا عِنْدَنَا، قَالَ: قُلْنَا لَهُ: حِينَ أَصْبَحْنَا أَفَطَنْتَ لَنَا اللَّيْلَةَ قَالَ: فَقَالَ: «نَعَمْ، ذَاكَ الَّذِي حَمَلَنِي عَلَى الَّذِي صَنَعْتُ» قَالَ: فَأَخَذَ يُوَاصِلُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَذَاكَ فِي آخِرِ الشَّهْرِ، فَأَخَذَ رِجَالٌ مِنْ أَصْحَابِهِ يُوَاصِلُونَ، فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَا بَالُ رِجَالٍ يُوَاصِلُونَ، إِنَّكُمْ لَسْتُمْ مِثْلِي، أَمَا وَاللهِ، لَوْ تَمَادَّ لِي الشَّهْرُ لَوَاصَلْتُ وِصَالًا يَدَعُ الْمُتَعَمِّقُونَ تَعَمُّقَهُمْ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10135,
                "hadithNumber": "2571",
                "englishNarrator": "Anas رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) observed Saum Wisal during the early part of the month of Ramadan. The people among Muslims also observed uninterrupted fast. This (news) reached him (the Holy Prophet) and he said: Had the month been lengthened for me I would have continued observing Saum Wisal, so that those who act with forced hardness would (have been obliged) to abandon it. You are not like me (or he said): I am not like you. I continue to do so (in a state) that my Lord feeds me and provides me drink.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے رمضان کے مہینہ کے آخر میں وصال کے روزے رکھے تو مسلمانوں میں سےکچھ لوگوں نے وصال کے روزے رکھنے شروع کردیئے آپ صلی اللہ علیہ وسلم تک یہ بات پہنچی تو آپ صلی اللہ علیہ وسلم نے فرمایا اگر ہمارے لئے یہ مہینہ لمبا ہوجائے تو میں اس قدر وصال کے روزے رکھتا کہ ضد کرنے والے اپنی ضدچھوڑ دیتے کیونکہ تم میری طرح نہیں ہو آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں تمہاری طرح نہیں ہوں میں تو اس حالت میں رات گزارتا ہوں ۔ کہ میرا رب مجھے کھلاتا اور پلاتاہے ۔",
                "urduNarrator": "عاصم بن نضر تیمی ، خالد ، ابن حارث ، حمید ، ثابت ، حضرت انس رضی اللہ تعالیٰ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا عَاصِمُ بْنُ النَّضْرِ التَّيْمِيُّ، حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ، حَدَّثَنَا حُمَيْدٌ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ رَضِيَ اللهُ عَنْهُ، قَالَ: وَاصَلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي أَوَّلِ شَهْرِ رَمَضَانَ، فَوَاصَلَ نَاسٌ مِنَ الْمُسْلِمِينَ، فَبَلَغَهُ ذَلِكَ، فَقَالَ: «لَوْ مُدَّ لَنَا الشَّهْرُ لَوَاصَلْنَا وِصَالًا، يَدَعُ الْمُتَعَمِّقُونَ تَعَمُّقَهُمْ، إِنَّكُمْ لَسْتُمْ مِثْلِي، - أَوْ قَالَ - إِنِّي لَسْتُ مِثْلَكُمْ، إِنِّي أَظَلُّ يُطْعِمُنِي رَبِّي وَيَسْقِينِي».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10136,
                "hadithNumber": "2572",
                "englishNarrator": "A'isha رضی اللہ تعالیٰ عنہا said:",
                "hadithEnglish": "The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade them (his Companions) to observe Saum Wisal out of mercy for them. They said: You (Holy Prophet) yourself observe it. Upon this he said: I am not like you. My Lord feeds me and provides me drink.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ان کو شفقت کے طور پر وصال کے روزوں سے منع فرمایا صحابہ رضوان اللہ عنھم اجمعین نے عرض کیاکہ آپ صلی اللہ علیہ وسلم تو وصال کے روزے رکھتے ہیں؟آپ صلی اللہ علیہ وسلم نے فرمایا میں تمہاری طرح نہیں ہوں ۔ کیونکہ میرا رب مجھے کھلاتا اور پلاتا ہے ۔",
                "urduNarrator": "اسحاق بن ابراہیم ، عثمان بن ابی شیبہ ، عبدہ بن سلیمان ، ہشام بن عروہ ، حضرت عائشہ رضی اللہ تعالیٰ عنہا فرماتی ہیں کہ",
                "hadithArabic": "وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ، جَمِيعًا عَنْ عَبْدَةَ، قَالَ إِسْحَاقُ: أَخْبَرَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ رَضِيَ اللهُ عَنْهَا، قَالَتْ: نَهَاهُمُ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ الْوِصَالِ رَحْمَةً لَهُمْ، فَقَالُوا: إِنَّكَ تُوَاصِلُ، قَالَ: «إِنِّي لَسْتُ كَهَيْئَتِكُمْ، إِنِّي يُطْعِمُنِي رَبِّي وَيَسْقِينِي».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10137,
                "hadithNumber": "2573",
                "englishNarrator": "A'isha رضی اللہ تعالیٰ عنہا said:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) kissed one of his wives while he was fasting, and then she ('A'isha رضی اللہ تعالیٰ عنہا) smiled (as she narrated).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم اپنی ازواج مطہرات میں سے کسی کا بوسہ لے لیا کرتے تھے ۔ حضرت عائشہ صدیقہ رضی اللہ تعالیٰ عنہا مسکرپڑیں ۔",
                "urduNarrator": "علی بن حجر ، سفیان ، ہشام بن عروہ ، سیدہ عائشہ رضی اللہ تعالیٰ عنہا فرماتی ہیں کہ",
                "hadithArabic": "حَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ، حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ رَضِيَ اللهُ عَنْهَا، قَالَتْ: «كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُقَبِّلُ إِحْدَى نِسَائِهِ، وَهُوَ صَائِمٌ» ثُمَّ تَضْحَكُ.",
                "headingArabic": "بَيَانِ أَنَّ الْقُبْلَةَ فِي الصَّوْمِ لَيْسَتْ مُحَرَّمَةً عَلَى مَنْ لَمْ تُحَرِّكْ شَهْوَتَهُ ‏‏",
                "headingUrdu": "یہ واضح کرنا کہ روزے کی حالت میں بوسہ لینا اس کے لیے حرام نہیں ہے جس کی خواہش اس سے مشتعل نہ ہو۔",
                "headingEnglish": "Clarifying that Kissing when fasting is not unlawful for the one whose desire is not provoked by that",
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10138,
                "hadithNumber": "2574",
                "englishNarrator": "Sufyan رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "I said to 'Abdul-Rahman bin Qasim: Have you heard from your father narrating from 'A'isha (رضی اللہ تعالیٰ عنہا) that he kissed her while observing fast? He ('Abdul-Rahman bin Qasim) kept silence for a short while and then said: Yes.",
                "hadithUrdu": "میں نے عبدالرحمٰن بن قاسم سے پوچھا کہ کیا تم نے اپنے باپ کو عائشہ رضی اللہ تعالیٰ عنہا سے روایت بیان کرتے ہوئے سنا کہ نبی کریم صلی اللہ علیہ وسلم روزہ کی حالت میں ان کا بوسہ لے لیا کرتے تھے؟حضرت عبدالرحمٰن تھوڑی دیر خاموش رہے پھر فرمایا ہاں ۔",
                "urduNarrator": "علی بن حجر ، ابن ابی عمر ، حضرت سفیان رضی اللہ تعالیٰ عنہ فرماتے ہیں کہ",
                "hadithArabic": "حَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، وَابْنُ أَبِي عُمَرَ، قَالَا: حَدَّثَنَا سُفْيَانُ، قَالَ: قُلْتُ لِعَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ: أَسَمِعْتَ أَبَاكَ يُحَدِّثُ، عَنْ عَائِشَةَ رَضِيَ اللهُ عَنْهَا: «أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ يُقَبِّلُهَا وَهُوَ صَائِمٌ» فَسَكَتَ سَاعَةً، ثُمَّ قَالَ: نَعَمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 9826,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=393",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=391",
                "label": "391",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=392",
                "label": "392",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=393",
                "label": "393",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=394",
                "label": "394",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=395",
                "label": "395",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=396",
                "label": "396",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=397",
                "label": "397",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=395",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=395",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=393",
        "to": 9850,
        "total": 40465
    }
}