{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 382,
        "data": [
            {
                "id": 9814,
                "hadithNumber": "2250",
                "englishNarrator": "Abu Marthad al-Ghanawi رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Do not sit on the graves and do not pray facing towards them.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" قبروں پر نہ بیٹھو اور نہ ان کی طرف ( رخ کرکے ) نماز پڑھو ۔ \"",
                "urduNarrator": "مجھ سے علی بن حجر السعدی نے بیان کیا، ہم سے ولید بن مسلم نے بیان کیا، ابن جابر کی سند سے, بسر بن عبیداللہ نے حضرت و اثلہ ( بن اسقع بن کعب رضی اللہ تعالیٰ عنہ ) سے اور انھوں نے حضرت ابو مرثد غنوی رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ عَنْ ابْنِ جَابِرٍ عَنْ بُسْرِ بْنِ عُبَيْدِ اللَّهِ عَنْ وَاثِلَةَ عَنْ أَبِي مَرْثَدٍ الْغَنَوِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَجْلِسُوا عَلَى الْقُبُورِ وَلَا تُصَلُّوا إِلَيْهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 112,
                    "chapterNumber": "12",
                    "chapterEnglish": "The Book of Prayer - Funerals",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجَنَائِزِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9815,
                "hadithNumber": "2251",
                "englishNarrator": "Abu Marthad al-Ghanawi رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Do not pray facing towards the graves, and do not sit on them.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا : \" قبروں کی طرف ( رخ کرکے ) نماز نہ پڑھو اور نہ ان پر بیٹھو ۔ \"",
                "urduNarrator": "اور ہم سے حسن بن ربیع البجلی نے بیان کیا، ہم سے ابن المبارک نے بیان کیا، ان سے عبدالرحمٰن بن یزید نے، وہ بسر بن عبید اللہ کی سند سے, ابو ادریس خولانی نے حضرت و اثلہ بن اسقع رضی اللہ تعالیٰ عنہ سے اور انھوں نے اور حضرت ابو مرثد غنوی رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا حَسَنُ بْنُ الرَّبِيعِ الْبَجَلِيُّ حَدَّثَنَا ابْنُ الْمُبَارَكِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ عَنْ بُسْرِ بْنِ عُبَيْدِ اللَّهِ عَنْ أَبِي إِدْرِيسَ الْخَوْلَانِيِّ عَنْ وَاثِلَةَ بْنِ الْأَسْقَعِ عَنْ أَبِي مَرْثَدٍ الْغَنَوِيِّ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تُصَلُّوا إِلَى الْقُبُورِ وَلَا تَجْلِسُوا عَلَيْهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 112,
                    "chapterNumber": "12",
                    "chapterEnglish": "The Book of Prayer - Funerals",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجَنَائِزِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9816,
                "hadithNumber": "2252",
                "englishNarrator": "Abbad bin 'Abdullah bin Zubair reported:",
                "hadithEnglish": "'A'isha رضی اللہ تعالیٰ عنہا ordered the bier of Sa'd bin Abu Waqqas رضی اللہ تعالیٰ عنہ to be brought into the mosque so that she should pray for him. The people disapproved this (act) of hers. She said: How soon the people have forgotten that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) offered not the funeral prayer of Suhail bin al-Baida' رضی اللہ تعالیٰ عنہا but in a mosque.",
                "hadithUrdu": "حضرت عائشہ رضی اللہ تعالیٰ عنہا نے حکم دیا کہ حضرت سعد بن ابی وقاص رضی اللہ تعالیٰ عنہ کا جنازہ مسجد میں سے گزارا جائے ( تاکہ ) وہ بھی ان کا جنازہ ادا کرسکیں ۔ آپ کی بات پر لوگوں نے اعتراض کیا تو حضرت عائشہ رضی اللہ تعالیٰ عنہا نے فرمایا : لوگ کس قدر جلد بھول گئے! رسول اللہ صلی اللہ علیہ وسلم نے ( بدری صحابی ) سہیل بن بیضاء رضی اللہ تعالیٰ عنہ کی نماز جنازہ مسجد ہی میں ادا کی تھی ۔",
                "urduNarrator": "مجھ سے علی بن حجر السعدی اور اسحاق بن ابراہیم الحنظلی نے بیان کیا، اور لفظ اسحاق کا ہے، علی نے کہا، انہوں نے ہم سے بیان کیا، اور انہوں نے کہا کہ ہمیں اسحاق نے خبر دی, عبدالعزیز بن محمد نے عبدالواحد بن حمزہ سے اور انھوں نے عباد بن عبداللہ بن زبیر سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ وَاللَّفْظُ لِإِسْحَقَ قَالَ عَلِيٌّ حَدَّثَنَا وَقَالَ إِسْحَقُ أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ عَبْدِ الْوَاحِدِ بْنِ حَمْزَةَ عَنْ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ أَنَّ عَائِشَةَ أَمَرَتْ أَنْ يَمُرَّ بِجَنَازَةِ سَعْدِ بْنِ أَبِي وَقَّاصٍ فِي الْمَسْجِدِ فَتُصَلِّيَ عَلَيْهِ فَأَنْكَرَ النَّاسُ ذَلِكَ عَلَيْهَا فَقَالَتْ مَا أَسْرَعَ مَا نَسِيَ النَّاسُ مَا صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى سُهَيْلِ بْنِ الْبَيْضَاءِ إِلَّا فِي الْمَسْجِدِ.",
                "headingArabic": "الصَّلاَةِ عَلَى الْجَنَازَةِ فِي الْمَسْجِدِ ‏‏",
                "headingUrdu": "نماز جنازہ مسجد میں پڑھنا",
                "headingEnglish": "Offering the funeral prayer in the masjid",
                "chapterId": "12",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 112,
                    "chapterNumber": "12",
                    "chapterEnglish": "The Book of Prayer - Funerals",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجَنَائِزِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9817,
                "hadithNumber": "2253",
                "englishNarrator": "Abbad bin 'Abdullah bin Zubair reported on the authority of 'A'isha رضی اللہ تعالیٰ عنہا :",
                "hadithEnglish": "When Sa'd bin Abu Waqqas رضی اللہ تعالیٰ عنہ died, the wives of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sent message to bring his bier into the mosque so that they should offer prayer for him. They (the participants of the funeral) did accordingly, and it was placed in front of their apartments and they offered prayer for him. It was brought out of the door (known as) Bab al-Jana'iz which was towards the side of Maqa'id, and the news reached them (the wives of the Holy Prophet) that the people bad criticised this (i. e. offering of funeral prayer in the mosque) saying that it was not desirable to take the bier inside the mosque. This was conveyed to 'A'isha رضی اللہ تعالیٰ عنہ. She said: How hastily the people criticise that about which they know little. They criticise us for carrying the bier in the mosque. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) offered not the funeral prayer of Suhail bin Baida' رضی اللہ تعالیٰ عنہ but in the innermost part of the mosque.",
                "hadithUrdu": "جب حضرت سعد بن ابی وقاص رضی اللہ تعالیٰ عنہ فوت ہوئے تو نبی اکرم صلی اللہ علیہ وسلم کی ازواج مطہرات نے پیغام بھیجا کہ ان کے جنازے کو مسجد میں سے گزار کرلے جائیں تا کہ وہ بھی ان کی نماز جنازہ ادا کرسکیں تو انھوں ( صحابہ رضوان اللہ عنھم اجمعین ) نے ایسا ہی کیا ، اس جنازے کو ان کے حجروں کے سامنے روک ( کررکھ ) دیا گیا ( تاکہ ) وہ نماز جنازہ پڑھ لیں ۔ ( پھر ) اس ( جنازے ) کو باب الجنائز سے ، جو مقاعد کی طرف ( کھلتا ) تھا ، باہر نکالا گیا ۔ اس کے بعد ان ( ازواج ) کو یہ بات پہنچی کہ لوگوں نے معیوب سمجھا ہے اور کہا ہے : جنازوں کو مسجد میں نہیں لایا جاتا تھا ۔ یہ بات حضرت عائشہ رضی اللہ تعالیٰ عنہا تک پہنچی تو انھوں نے فرمایا : لوگوں نےاس کام کو معیوب سمجھنے میں کتنی جلدی کی جس کا انھیں علم نہیں!انھوں نے ہماری اس بات پر اعتراض کیا ہے کہ جنازہ مسجد میں لایاجائے ، حالانکہ رسول اللہ صلی اللہ علیہ وسلم نے سہیل بن بیضاء رضی اللہ تعالیٰ عنہ کا جنازہ مسجد کے اندر ہی پڑھا تھا ۔",
                "urduNarrator": "اور مجھ سے محمد بن حاتم نے بیان کیا، ہم سے بہز نے بیان کیا، ہم سے وہیب نے بیان کیا,موسیٰ بن عقبہ نے عبدالواحد سے اور انھوں نے عباد بن عبداللہ بن زبیر سے روایت کی ، وہ حضرت عائشہ رضی اللہ تعالیٰ عنہا سے حدیث بیان کرتے ہیں کہ",
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا بَهْزٌ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ عَنْ عَبْدِ الْوَاحِدِ عَنْ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ يُحَدِّثُ عَنْ عَائِشَةَ أَنَّهَا لَمَّا تُوُفِّيَ سَعْدُ بْنُ أَبِي وَقَّاصٍ أَرْسَلَ أَزْوَاجُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَمُرُّوا بِجَنَازَتِهِ فِي الْمَسْجِدِ فَيُصَلِّينَ عَلَيْهِ فَفَعَلُوا فَوُقِفَ بِهِ عَلَى حُجَرِهِنَّ يُصَلِّينَ عَلَيْهِ أُخْرِجَ بِهِ مِنْ بَابِ الْجَنَائِزِ الَّذِي كَانَ إِلَى الْمَقَاعِدِ فَبَلَغَهُنَّ أَنَّ النَّاسَ عَابُوا ذَلِكَ وَقَالُوا مَا كَانَتْ الْجَنَائِزُ يُدْخَلُ بِهَا الْمَسْجِدَ فَبَلَغَ ذَلِكَ عَائِشَةَ فَقَالَتْ مَا أَسْرَعَ النَّاسَ إِلَى أَنْ يَعِيبُوا مَا لَا عِلْمَ لَهُمْ بِهِ عَابُوا عَلَيْنَا أَنْ يُمَرَّ بِجَنَازَةٍ فِي الْمَسْجِدِ وَمَا صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى سُهَيْلِ بْنِ بَيْضَاءَ إِلَّا فِي جَوْفِ الْمَسْجِدِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 112,
                    "chapterNumber": "12",
                    "chapterEnglish": "The Book of Prayer - Funerals",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجَنَائِزِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9818,
                "hadithNumber": "2254",
                "englishNarrator": "Abu Salama bin 'Abdul-Rahman reported:",
                "hadithEnglish": "When Sa'd bin Abu Waqqas رضی اللہ تعالیٰ عنہ died 'A'isha رضی اللہ تعالیٰ عنہا  said: Bring it (the bier) into the mosque so that I offer prayer for him. But, this act of hers was disapproved. She said: By Allah, the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) offered prayer in the mosque for the two sons of Baida', viz, for Suhail and his brother.",
                "hadithUrdu": "جب حضر ت سعد بن ابی وقاص رضی اللہ تعالیٰ عنہ کی وفات ہوئی تو حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : ان کو مسجد میں لاؤ تاکہ میں بھی انکی نماز جنازہ ادا کرسکوں ۔ ان کی اس بات پر اعتراض کیا گیا تو انھوں نے کہا : اللہ کی قسم!رسول اللہ صلی اللہ علیہ وسلم نے بیضاء کے دو بیٹوں سہیل اور اس کے بھائی ( سہل ) رضوان اللہ عنھم اجمعین کا جنازہ مسجد میں ہی پڑھا تھا ۔",
                "urduNarrator": "مجھ سے ہارون بن عبداللہ اور محمد بن رافع نے بیان کیا، اور یہ قول ابن رافع سے ہے، انہوں نے کہا: ہم سے ابن ابی فدائک نے بیان کیا، اور ہم سے الضحاک نے بیان کیا، جس کا مطلب ہے کہ ابن عثمان نے ابو النضر کی سند سے بیان کیا, حضرت ابوسلمہ بن عبدالرحمن سے روایت ہے کہ",
                "hadithArabic": "و حَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ وَمُحَمَّدُ بْنُ رَافِعٍ وَاللَّفْظُ لِابْنِ رَافِعٍ قَالَا حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ أَخْبَرَنَا الضَّحَّاكُ يَعْنِي ابْنَ عُثْمَانَ عَنْ أَبِي النَّضْرِ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ أَنَّ عَائِشَةَ لَمَّا تُوُفِّيَ سَعْدُ بْنُ أَبِي وَقَّاصٍ قَالَتْ ادْخُلُوا بِهِ الْمَسْجِدَ حَتَّى أُصَلِّيَ عَلَيْهِ فَأُنْكِرَ ذَلِكَ عَلَيْهَا فَقَالَتْ وَاللَّهِ لَقَدْ صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى ابْنَيْ بَيْضَاءَ فِي الْمَسْجِدِ سُهَيْلٍ وَأَخِيهِ قَالَ مُسْلِم سُهَيْلُ بْنُ دَعْدٍ وَهُوَ ابْنُ الْبَيْضَاءِ أُمُّهُ بَيْضَاءُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 112,
                    "chapterNumber": "12",
                    "chapterEnglish": "The Book of Prayer - Funerals",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجَنَائِزِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9819,
                "hadithNumber": "2255",
                "englishNarrator": "A'isha رضی اللہ تعالیٰ عنہا reported:",
                "hadithEnglish": "(that whenever it was her turn for Allah's Messenger ﷺ to spend the night with her) he would go out towards the end of the night to al-Baqi' and say: Peace be upon you, abode of a people who are believers. What you were promised would come to you tomorrow, you receiving it after some delay; and God willing we shall join you. O Allah, grant forgiveness to the inhabitants of Baqi' al-Gharqad. Qutaiba did not mention his words: would come to you .",
                "hadithUrdu": "۔ ۔ ۔ جس رات رسول اللہ صلی اللہ علیہ وسلم کی باری ان کے پاس ہوتی تو ۔ ۔ ۔ رسول اللہ صلی اللہ علیہ وسلم رات کے آخری حصے میں بقیع ( کے قبرستان میں ) تشریف لے جاتے اور فرماتے : \" اے ایمان رکھنے والی قوم کے گھرانے!تم پر اللہ کی سلامتی ہو ، کل کے بارے میں تم سے جس کا وعدہ کیا جاتا تھا ، وہ تم تک پہنچ گیا ۔ تم کو ( قیامت ) تک مہلت دے دی گئی اور ہم بھی ، اگر اللہ نے چاہا تم سے ملنے والے ہیں ۔ اے اللہ!بقیع غرقد ( میں رہنے ) والوں کو بخش دے ۔ \" قتیبہ نے ( اپنی روایت ) میں \" واتاكم \" ( تم تک پہنچ گیا ) نہیں کہا ۔ ۔ ۔",
                "urduNarrator": "یحییٰ بن یحییٰ تمیمی ، یحییٰ بن ایوب اور قتیبہ بن سعید نے ہمیں حدیث سنائی ۔ ۔ ۔ یحییٰ بن یحییٰ نے کہا : ہمیں خبر دی اور دوسرے دونوں نے کہا : ہمیں حدیث سنائی ۔ ۔ ۔ اسماعیل بن جعفر نے شریک سے ، انھوں نے عطاء بن یسار سے اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ وَيَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ بْنُ سَعِيدٍ قَالَ يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا و قَالَ الْآخَرَانِ حَدَّثَنَا إِسْمَعِيلُ بْنُ جَعْفَرٍ عَنْ شَرِيكٍ وَهُوَ ابْنُ أَبِي نَمِرٍ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ عَائِشَةَ أَنَّهَا قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلَّمَا كَانَ لَيْلَتُهَا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْرُجُ مِنْ آخِرِ اللَّيْلِ إِلَى الْبَقِيعِ فَيَقُولُ السَّلَامُ عَلَيْكُمْ دَارَ قَوْمٍ مُؤْمِنِينَ وَأَتَاكُمْ مَا تُوعَدُونَ غَدًا مُؤَجَّلُونَ وَإِنَّا إِنْ شَاءَ اللَّهُ بِكُمْ لَاحِقُونَ اللَّهُمَّ اغْفِرْ لِأَهْلِ بَقِيعِ الْغَرْقَدِ وَلَمْ يُقِمْ قُتَيْبَةُ قَوْلَهُ وَأَتَاكُمْ.",
                "headingArabic": "مَا يُقَالُ عِنْدَ دُخُولِ الْقُبُورِ وَالدُّعَاءِ لأَهْلِهَا ‏‏",
                "headingUrdu": "قبرستان میں داخل ہوتے وقت اور اس کے مکینوں کے لیے دعا کیا کیا جائے؟",
                "headingEnglish": "What is to be said when entering the graveyard and supplicating for its occupants",
                "chapterId": "12",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 112,
                    "chapterNumber": "12",
                    "chapterEnglish": "The Book of Prayer - Funerals",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجَنَائِزِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9820,
                "hadithNumber": "2256",
                "englishNarrator": "Muhammad bin Qais said (to the people):",
                "hadithEnglish": "Should I not narrate to you (a hadith of the Holy Prophet) on my authority and on the authority of my mother? We thought that he meant the mother who had given him birth. He (Muhammad b. Qais) then reported that it was 'A'isha رضی اللہ تعالیٰ عنہا who had narrated this: Should I not narrate to you about myself and about the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ )? We said: Yes. She said: When it was my turn for Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) to spend the night with me, he turned his side, put on his mantle and took off his shoes and placed them near his feet, and spread the corner of his shawl on his bed and then lay down till he thought that I had gone to sleep. He took hold of his mantle slowly and put on the shoes slowly, and opened the door and went out and then closed it lightly. I covered my head, put on my veil and tightened my waist wrapper, and then went out following his steps till he reached Baqi'. He stood there and he stood for a long time. He then lifted his hands three times, and then returned and I also returned. He hastened his steps and I also hastened my steps. He ran and I too ran. He came (to the house) and I also came (to the house). I, however, preceded him and I entered (the house), and as I lay down in the bed, he (the Holy Prophet) entered the (house), and said: Why is it, O 'A'isha, that you are out of breath? I said: There is nothing. He said: Tell me or the Subtle and the Aware would inform me. I said: Messenger of Allah, may my father and mother be ransom for you, and then I told him (the whole story). He said: Was it the darkness (of your shadow) that I saw in front of me? I said: Yes. He gave me a nudge on the chest which I felt, and then said: Did you think that Allah and His Apostle would deal unjustly with you? She said: Whatsoever the people conceal, Allah will know it. He said: Gabriel came to me when you saw me. He called me and he concealed it from you. I responded to his call, but I too concealed it from you (for he did not come to you), as you were not fully dressed. I thought that you had gone to sleep, and I did not like to awaken you, fearing that you may be frightened. He (Gabriel) said: Your Lord has commanded you to go to the inhabitants of Baqi' (to those lying in the graves) and beg pardon for them. I said: Messenger of Allah, how should I pray for them (How should I beg forgiveness for them)? He said: Say, Peace be upon the inhabitants of this city (graveyard) from among the Believers and the Muslims, and may Allah have mercy on those who have gone ahead of us, and those who come later on, and we shall, God willing, join you.",
                "hadithUrdu": "ایک دن انھوں نے کہا؛کیا میں تمھیں اپنی اور اپنی ماں کی طرف سے حدیث نہ سناؤں؟کہا : ہم نے سمجھا کہ ان کی مراد اپنی اس ماں سے ہے جس نے انھیں جنم دیا ( لیکن انھوں نے ) کہا : حضرت عائشہ رضی اللہ تعالیٰ عنہا نے فرمایا : کیا میں تمھیں اپنی طرف سے اور ر سول اللہ صلی اللہ علیہ وسلم کی طرف سے حدیث نہ سناؤں؟ہم نے کہا : کیوں نہیں!کہا : حضرت عائشہ رضی اللہ تعالیٰ عنہا نے فرمایا : ( ایک دفعہ ) جب میری ( باری کی ) رات ہوئی جس میں نبی کریم صلی اللہ علیہ وسلم میرے ہاں تھے ، آپ ( مسجد سے ) لوٹے ، اپنی چادر ( سرہانے ) رکھی ، اپنے دونوں جوتے اتار کر اپنے دونوں پاؤں کے پاس رکھے اور اپنے تہبند کا ایک حصہ بستر پر بچھایا ، پھر لیٹ گئے ۔ آپ نے صرف اتنی دیر انتظار کیا کہ آپ نے خیال کیا میں سو گئی ہوں ، تو آپ نے آہستہ سے اپنی چادر اٹھائی ، آہستہ سے اپنے جوتے پہنے اور آہستہ سے دروازہ کھولا ، نکلے ، پھر آہستہ سے اس کو بند کردیا ۔ ( یہ دیکھ کر ) میں نے بھی اپنی قمیص سر سے گزاری ( جلدی سے پہنی ) اپنا دوپٹا اوڑھا اور اپنی آزار ( کمر پر ) باندھی ، پھر آپ کے پیچھے چل پڑی حتیٰ کہ آپ بقیع ( کے قبرستان میں ) پہنچے اور کھڑے ہوگئے اور آپ لمبی دیر تک کھڑے رہے ، پھر آپ نے تین دفعہ ہاتھ اٹھائے ، پھر آپ پلٹے اور میں بھی واپس لوٹی ، آپ تیز ہوگئے تو میں بھی تیز ہوگئی ، آپ تیز تر ہوگئے تو میں بھی تیز تر ہوگئی ۔ آپ دوڑ کر چلے تو میں نے بھی دوڑنا شروع کردیا ۔ میں آپ سے آگے نکل آئی اور گھر میں داخل ہوگئی ۔ جونہی میں لیٹی آپ صلی اللہ علیہ وسلم بھی گھر میں داخل ہوگئے اور فرمایا : \" عائشہ! تمھیں کیا ہوا کانپ رہی ہو؟سانس چڑھی ہوئی ہے ۔ \" میں نے کہا کوئی بات نہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" تم مجھے بتاؤ گی یا پھر وہ مجھے بتائے گا جو لطیف وخبیر ہے ( باریک بین ہے اور انتہائی باخبر ) ہے ۔ \" میں نے کہا : اے اللہ کے رسول صلی اللہ علیہ وسلم میرے ماں باپ آپ پر فدا ہوں!اور میں نے ( پوری بات ) آپ کو بتادی ۔ آپ نے فرمایا : \" تو وہ سیاہ ( ہیولا ) جو میں نے اپنے آگے دیکھا تھا ، تم تھیں؟ \" میں نے کہا : ہاں ۔ آپ نے میرے سینے کو زور سے دھکیلا جس سے مجھے تکلیف ہوئی ۔ پھر آپ نے فرمایا : \" کیا تم نے یہ خیال کیا کہ اللہ تم پر زیادتی کرے گا اور اس کا رسول صلی اللہ علیہ وسلم ؟ \" ( حضرت عائشہ رضی اللہ تعالیٰ عنہا نے ) کہا : لوگ ( کسی بات کو ) کتنا ہی چھپا لیں اللہ اس کوجانتا ہے ، ہاں ۔ آپ نے فرمایا : \" جب تو نے ( مجھے جاتے ہوئے ) دیکھاتھا اس وقت جبرئیل علیہ السلام میرے پاس آئے تھے ۔ انھوں نے ( آکر ) مجھے آواز دی اور اپنی آواز کو تم سے مخفی رکھا ، میں نے ان کو جواب دیا تو میں نے بھی تم سے اس کو مخفی رکھا اور وہ تمہارے پاس اندر نہیں آسکتے تھے تم کپڑے اتار چکیں تھیں اور میں نے خیال کیا کہ تم سوچکی ہو تو میں نے تمھیں بیدار کرنا مناسب نہ سمجھا اور مجھے خدشہ محسوس ہواکہ تم ( اکیلی ) وحشت محسوس کروگی ۔ تو انھوں ( جبرئیل علیہ السلام ) نے کہا : آپ کا رب آپ کو حکم دیتاہے کہ آپ اہل بقیع کے پاس جائیں اور ان کے لئے بخشش کی دعا کریں ۔ \" ( حضرت عائشہ رضی اللہ تعالیٰ عنہا نے ) کہا : میں نے پوچھا : اے اللہ کےرسول صلی اللہ علیہ وسلم !میں ان کے حق میں ( دعا کے لئے ) کیسے کہوں؟آپ نے فرمایا : \" تم کہو ، مومنوں اور مسلمانوں میں سے ان ٹھکانوں میں رہنے والوں پر سلامتی ہو ، اللہ تعالیٰ ہم سے آگے جانے والوں اور بعد میں آنے والوں پر رحم کرے ، اور ہم ان شاء اللہ ضرور تمہارے ساتھ ملنے والے ہیں ۔ \"",
                "urduNarrator": "مجھ سے ہارون بن سعید العیلی نے بیان کیا، انہوں نے ہم سے بیان کیا عبداللہ بن وہب نے ہمیں حدیث سنائی اور کہا : ابن جریج نے عبداللہ بن کثیر بن مطلب سے روایت کی ، انھوں نے محمد بن قیس بن مخرمہ بن مطلب ( المطلبی ) کو کہتے ہوئے سنا کہ ,میں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے سنا ، وہ حدیث بیان کررہی تھیں ، انھوں نے کہا : کیا میں تمھیں رسول اللہ صلی اللہ علیہ وسلم اور اپنی طرف سے حدیث نہ سناؤں؟ہم نے کہا : کیوں نہیں ۔ ۔ ۔ اور حجاج بن محمد نے ہمیں حدیث سنائی ، کہا : ہمیں ابن جریج نے حدیث سنائی ، کہا : قریش کے ایک فرد عبداللہ نے محمد بن قیس بن مخرمہ بن مطلب سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ عَنْ عَبْدِ اللَّهِ بْنِ كَثِيرِ بْنِ الْمُطَّلِبِ أَنَّهُ سَمِعَ مُحَمَّدَ بْنَ قَيْسٍ يَقُولُ سَمِعْتُ عَائِشَةَ تُحَدِّثُ فَقَالَتْ أَلَا أُحَدِّثُكُمْ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَنِّي قُلْنَا بَلَى ح و حَدَّثَنِي مَنْ سَمِعَ حَجَّاجًا الْأَعْوَرَ وَاللَّفْظُ لَهُ قَالَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ حَدَّثَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي عَبْدُ اللَّهِ رَجُلٌ مِنْ قُرَيْشٍ عَنْ مُحَمَّدِ بْنِ قَيْسِ بْنِ مَخْرَمَةَ بْنِ الْمُطَّلِبِ أَنَّهُ قَالَ يَوْمًا أَلَا أُحَدِّثُكُمْ عَنِّي وَعَنْ أُمِّي قَالَ فَظَنَنَّا أَنَّهُ يُرِيدُ أُمَّهُ الَّتِي وَلَدَتْهُ قَالَ قَالَتْ عَائِشَةُ أَلَا أُحَدِّثُكُمْ عَنِّي وَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُلْنَا بَلَى قَالَ قَالَتْ لَمَّا كَانَتْ لَيْلَتِي الَّتِي كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهَا عِنْدِي انْقَلَبَ فَوَضَعَ رِدَاءَهُ وَخَلَعَ نَعْلَيْهِ فَوَضَعَهُمَا عِنْدَ رِجْلَيْهِ وَبَسَطَ طَرَفَ إِزَارِهِ عَلَى فِرَاشِهِ فَاضْطَجَعَ فَلَمْ يَلْبَثْ إِلَّا رَيْثَمَا ظَنَّ أَنْ قَدْ رَقَدْتُ فَأَخَذَ رِدَاءَهُ رُوَيْدًا وَانْتَعَلَ رُوَيْدًا وَفَتَحَ الْبَابَ فَخَرَجَ ثُمَّ أَجَافَهُ رُوَيْدًا فَجَعَلْتُ دِرْعِي فِي رَأْسِي وَاخْتَمَرْتُ وَتَقَنَّعْتُ إِزَارِي ثُمَّ انْطَلَقْتُ عَلَى إِثْرِهِ حَتَّى جَاءَ الْبَقِيعَ فَقَامَ فَأَطَالَ الْقِيَامَ ثُمَّ رَفَعَ يَدَيْهِ ثَلَاثَ مَرَّاتٍ ثُمَّ انْحَرَفَ فَانْحَرَفْتُ فَأَسْرَعَ فَأَسْرَعْتُ فَهَرْوَلَ فَهَرْوَلْتُ فَأَحْضَرَ فَأَحْضَرْتُ فَسَبَقْتُهُ فَدَخَلْتُ فَلَيْسَ إِلَّا أَنْ اضْطَجَعْتُ فَدَخَلَ فَقَالَ مَا لَكِ يَا عَائِشُ حَشْيَا رَابِيَةً قَالَتْ قُلْتُ لَا شَيْءَ قَالَ لَتُخْبِرِينِي أَوْ لَيُخْبِرَنِّي اللَّطِيفُ الْخَبِيرُ قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ بِأَبِي أَنْتَ وَأُمِّي فَأَخْبَرْتُهُ قَالَ فَأَنْتِ السَّوَادُ الَّذِي رَأَيْتُ أَمَامِي قُلْتُ نَعَمْ فَلَهَدَنِي فِي صَدْرِي لَهْدَةً أَوْجَعَتْنِي ثُمَّ قَالَ أَظَنَنْتِ أَنْ يَحِيفَ اللَّهُ عَلَيْكِ وَرَسُولُهُ قَالَتْ مَهْمَا يَكْتُمِ النَّاسُ يَعْلَمْهُ اللَّهُ نَعَمْ قَالَ فَإِنَّ جِبْرِيلَ أَتَانِي حِينَ رَأَيْتِ فَنَادَانِي فَأَخْفَاهُ مِنْكِ فَأَجَبْتُهُ فَأَخْفَيْتُهُ مِنْكِ وَلَمْ يَكُنْ يَدْخُلُ عَلَيْكِ وَقَدْ وَضَعْتِ ثِيَابَكِ وَظَنَنْتُ أَنْ قَدْ رَقَدْتِ فَكَرِهْتُ أَنْ أُوقِظَكِ وَخَشِيتُ أَنْ تَسْتَوْحِشِي فَقَالَ إِنَّ رَبَّكَ يَأْمُرُكَ أَنْ تَأْتِيَ أَهْلَ الْبَقِيعِ فَتَسْتَغْفِرَ لَهُمْ قَالَتْ قُلْتُ كَيْفَ أَقُولُ لَهُمْ يَا رَسُولَ اللَّهِ قَالَ قُولِي السَّلَامُ عَلَى أَهْلِ الدِّيَارِ مِنْ الْمُؤْمِنِينَ وَالْمُسْلِمِينَ وَيَرْحَمُ اللَّهُ الْمُسْتَقْدِمِينَ مِنَّا وَالْمُسْتَأْخِرِينَ وَإِنَّا إِنْ شَاءَ اللَّهُ بِكُمْ لَلَاحِقُونَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 112,
                    "chapterNumber": "12",
                    "chapterEnglish": "The Book of Prayer - Funerals",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجَنَائِزِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9821,
                "hadithNumber": "2257",
                "englishNarrator": "Sulaiman bin Buraida رضی اللہ تعالیٰ عنہ narrated on the authority of his father:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) used to teach them when they went out to the graveyard. One of the narrators used to say this in the narration transmitted on the authority of Abu Bakr: Peace be upon the inhabitants of the city (i. e. graveyard). In the hadith transmitted by Zuhair (the words are): Peace be upon you, the inhabitants of the city, among the believers, and Muslims, and God willing we shall join you. I beg of Allah peace for us and for you.",
                "hadithUrdu": "جب وہ قبرستان جاتے تو رسول اللہ صلی اللہ علیہ وسلم ان کو تعلیم دیا کرتے تھے تو ( سیکھنے کے بعد ) ان کا کہنے والا کہتا : ابو بکر کی روایت میں ہے : \" سلامتی ہو مسلمانوں اور مومنوں کے ٹھکانوں میں رہنے والوں پر \" اورزہیر کی روایت میں ہے؛ \" مسلمانوں اور مومنوں کے ٹھکانے میں رہنے والو تم پر ۔ ۔ ۔ اور ہم ان شاء اللہ ضرور ( تمہارے ساتھ ) ملنے والے ہیں ، میں اللہ تعالیٰ سے اپنے اور تمھارے لئے عافیت مانگتا ہوں ۔ \"",
                "urduNarrator": "ابو بکر بن ابی شیبہ اور زہیر بن حرب نے کہا : ہمیں محمد بن عبد اللہ اسدی نے سفیان سے حدیث سنائی ، انھوں نے علقمہ بن مرثد سے ، انھوں نے سلیمان بن بریدہ سے اور انھوں نے ا پنے والد ( بریدہ اسلمی رضی اللہ تعالیٰ عنہ ) سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْأَسَدِيُّ عَنْ سُفْيَانَ عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ عَنْ أَبِيهِ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعَلِّمُهُمْ إِذَا خَرَجُوا إِلَى الْمَقَابِرِ فَكَانَ قَائِلُهُمْ يَقُولُ فِي رِوَايَةِ أَبِي بَكْرٍ السَّلَامُ عَلَى أَهْلِ الدِّيَارِ وَفِي رِوَايَةِ زُهَيْرٍ السَّلَامُ عَلَيْكُمْ أَهْلَ الدِّيَارِ مِنْ الْمُؤْمِنِينَ وَالْمُسْلِمِينَ وَإِنَّا إِنْ شَاءَ اللَّهُ لَلَاحِقُونَ أَسْأَلُ اللَّهَ لَنَا وَلَكُمْ الْعَافِيَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 112,
                    "chapterNumber": "12",
                    "chapterEnglish": "The Book of Prayer - Funerals",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجَنَائِزِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9822,
                "hadithNumber": "2258",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger, ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: I sought permission to beg forgiveness for my mother, but He did not grant it to me. I sought permission from Him to visit her grave, and He granted it (permission) to me.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" میں نے اپنے رب سے اپنی ماں کے استغفار کی اجازت مانگی تو اس نے مجھے اجازت نہیں دی اور میں نے اس سے ان کی قبر کی زیارت کی اجازت مانگی تو مجھے اجازت دے دی ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن ایوب اور محمد بن عباد نے بیان کیا، اور یہ قول یحییٰ سے ہے، انہوں نے کہا مروان بن معاویہ نے یزید ، یعنی ابن کیسان سے ، انھوں نے ابو حازم سےاور انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ وَمُحَمَّدُ بْنُ عَبَّادٍ وَاللَّفْظُ لِيَحْيَى قَالَا حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ عَنْ يَزِيدَ يَعْنِي ابْنَ كَيْسَانَ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَأْذَنْتُ رَبِّي أَنْ أَسْتَغْفِرَ لِأُمِّي فَلَمْ يَأْذَنْ لِي وَاسْتَأْذَنْتُهُ أَنْ أَزُورَ قَبْرَهَا فَأَذِنَ لِي.",
                "headingArabic": "اسْتِئْذَانِ النَّبِيِّ صلى الله عليه وسلم رَبَّهُ عَزَّ وَجَلَّ فِي زِيَارَةِ قَبْرِ أُمِّهِ ‏‏",
                "headingUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے اپنے رب سے اپنی والدہ کی قبر کی زیارت کی اجازت طلب کی۔",
                "headingEnglish": "The prophet (saws) asked his Lord for permission to visit the grave of his mother",
                "chapterId": "12",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 112,
                    "chapterNumber": "12",
                    "chapterEnglish": "The Book of Prayer - Funerals",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجَنَائِزِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9823,
                "hadithNumber": "2259",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) visited the grave of his mother and he wept, and moved others around him to tears, and said: I sought permission from my Lord to beg forgiveness for her but it was not granted to me, and I sought permission to visit her grave and it was granted to me so visit the graves, for that makes you mindful of death.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے اپنی ماں کی قبر کی زیارت کی ، آپ روئے اور اپنے اردگرد والوں کو بھی رلایا ، پھر فرمایا : \" میں نے اپنے رب سے اجازت مانگی کہ میں ان کے لئے بخشش کی طلب کروں تو مجھے اجازت نہیں دی گئی اور میں نے اجازت مانگی کہ میں ان کی قبر کی زیارت کروں تو اس نے مجھے اجازت دے دی ، پس تم بھی قبروں کی زیارت کیاکرو کیونکہ وہ تمھیں موت کی یاددلاتی ہیں ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور زہیر بن حرب نے بیان کیا، انہوں نے کہا کہ ہم سے انہوں نےمحمد بن عبید نے یزید بن کیسان سے ، انھوں نے ابو حازم سے اور اور انھوں نے حضرت ابو ہریرہ  رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ عَنْ يَزِيدَ بْنِ كَيْسَانَ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَ زَارَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَبْرَ أُمِّهِ فَبَكَى وَأَبْكَى مَنْ حَوْلَهُ فَقَالَ اسْتَأْذَنْتُ رَبِّي فِي أَنْ أَسْتَغْفِرَ لَهَا فَلَمْ يُؤْذَنْ لِي وَاسْتَأْذَنْتُهُ فِي أَنْ أَزُورَ قَبْرَهَا فَأُذِنَ لِي فَزُورُوا الْقُبُورَ فَإِنَّهَا تُذَكِّرُ الْمَوْتَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 112,
                    "chapterNumber": "12",
                    "chapterEnglish": "The Book of Prayer - Funerals",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجَنَائِزِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9824,
                "hadithNumber": "2260",
                "englishNarrator": "Ibn Buraida reported on the authority of his father:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: I forbade you to visit graves, but you may now visit them; I forbade you to eat the flesh of sacrificial animals after three days, but you way now keep it as along as you feel inclined; and I forbade you nabidh except in a water-skin, you may drink it from all kinds of water-skins, but you must not drink anything intoxicating.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" میں نے تمھیں قبروں کی زیارت سے منع کیا تھاتو ( اب ) تم ان کی زیارت کیا کرو ۔ اور میں نے تمھیں تین دن سے اوپر قربانیوں کے گوشت ( رکھنے ) سے منع کیا تھا ( اب ) تم جب تک چاہو رکھ سکتے ہو اور میں نے تمھیں مشکیزوں کے سوا کسی اور برتن میں نبیذ پینے سے منع کیا تھا ، اب تم ہر قسم کے برتنوں میں سے پی سکتے ہولیکن کوئی نشہ آورچیز نہ پیو ۔ \"\"\r\n\r\nابن نمیر نے اپنی روایت میں کہا : عبداللہ بن بریدہ سے روایت ہے ، انھوں نے اپنے والد سے روایت کی ۔ ( انھوں نے ابن بریدہ کے نام ، عبداللہ کی صراحت کی ۔ )",
                "urduNarrator": "ابو بکر بن ابی شیبہ ، محمد بن عبداللہ بن نمیر اور محمد بن مثنی نے ہمیں حدیث سنائی ۔ ۔ ۔ الفاظ ابو بکر اور ابن نمیر کے ہیں ۔ ۔ ۔ انھوں نے کہا : ہمیں محمد بن فضیل نے ابو سنان سے ، جو ضرار بن مرہ ہیں ، حدیث سنائی ، انھوں نے محارب بن دثار سے ، انھوں نے ابن بریدہ سے ، اور انھوں نے اپنے والد ( حضرت بریرہ بن حصیب اسلمی رضی اللہ تعالیٰ عنہ ) سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ وَمُحَمَّدُ بْنُ الْمُثَنَّى وَاللَّفْظُ لِأَبِي بَكْرٍ وَابْنِ نُمَيْرٍ قَالُوا حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ أَبِي سِنَانٍ وَهُوَ ضِرَارُ بْنُ مُرَّةَ عَنْ مُحَارِبِ بْنِ دِثَارٍ عَنْ ابْنِ بُرَيْدَةَ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَيْتُكُمْ عَنْ زِيَارَةِ الْقُبُورِ فَزُورُوهَا وَنَهَيْتُكُمْ عَنْ لُحُومِ الْأَضَاحِيِّ فَوْقَ ثَلَاثٍ فَأَمْسِكُوا مَا بَدَا لَكُمْ وَنَهَيْتُكُمْ عَنْ النَّبِيذِ إِلَّا فِي سِقَاءٍ فَاشْرَبُوا فِي الْأَسْقِيَةِ كُلِّهَا وَلَا تَشْرَبُوا مُسْكِرًا \r\n\r\nقَالَ ابْنُ نُمَيْرٍ فِي رِوَايَتِهِ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ أَبِيهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 112,
                    "chapterNumber": "12",
                    "chapterEnglish": "The Book of Prayer - Funerals",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجَنَائِزِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9825,
                "hadithNumber": "2261",
                "englishNarrator": null,
                "hadithEnglish": "Abdullah bin Buraidah narrated from his father from the prophet ﷺ -a Hadith similar to that of Sinan (no. 2260).",
                "hadithUrdu": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے بیان کیا,ابو خیثمہ نے زبید الیامی سے ، انھوں نے محارب بن دثار سے ، انھوں نے ابن بریدہ سے ، انھوں نے ، میرا خیال ہے اپنے والدسےشک ابو خیثمہ کی طرف سے ہے ۔ ۔ ۔ اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی ۔ ( اسی طرح ) سفیان نے علقمہ بن مرثد سے ، انھوں نے سلیمان بن بریدہ سے ، انھوں نے اپنے والد سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی ۔ ( اسی طرح ) معمر نے عطاء خراسانی سے روایت کی ، انھو ں نے کہا : مجھے عبداللہ بن بریدہ نے اپنے والد سے حدیث سنائی اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی ۔ ان سب ( زبید ، سفیان اور معمر ) نے ابو سنان کی حدیث کے ہم معنی حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو خَيْثَمَةَ عَنْ زُبَيْدٍ الْيَامِيِّ عَنْ مُحَارِبِ بْنِ دِثَارٍ عَنْ ابْنِ بُرَيْدَةَ أُرَاهُ عَنْ أَبِيهِ الشَّكُّ مِنْ أَبِي خَيْثَمَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا قَبِيصَةُ بْنُ عُقْبَةَ عَنْ سُفْيَانَ عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ح و حَدَّثَنَا ابْنُ أَبِي عُمَرَ وَمُحَمَّدُ بْنُ رَافِعٍ وَعَبْدُ بْنُ حُمَيْدٍ جَمِيعًا عَنْ عَبْدِ الرَّزَّاقِ عَنْ مَعْمَرٍ عَنْ عَطَاءٍ الْخُرَاسَانِيِّ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُّهُمْ بِمَعْنَى حَدِيثِ أَبِي سِنَانٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 112,
                    "chapterNumber": "12",
                    "chapterEnglish": "The Book of Prayer - Funerals",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجَنَائِزِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9826,
                "hadithNumber": "2262",
                "englishNarrator": "Jabir bin Samura رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "(The dead body) of a person who had killed himself with a broad-headed arrow was brought before the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), but he did not offer prayers for him.",
                "hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم کے پاس ایک آدمی لایا گیا جس نے اپنے آپ کو ایک چوڑے تیر سے قتل کرڈالا تھا تو آپ نے ( خود ) اس کی نماز جنازہ نہیں پڑھی ۔ ( دوسروں کو پڑھنے کا حکم دیا جس طرح ابتداء میں آپ دوسروں کو مقروض کا جنازہ پڑھنے کا حکم دیتے تھے ۔ )",
                "urduNarrator": "ہم سے عون بن سلام الکوفی نے بیان کیا، کہا ہم سے زہیر نے سماک کی سند سے بیان کیا, حضرت جابر بن سمرہ رضی اللہ تعالیٰ عنہ سے روایت ہے ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا عَوْنُ بْنُ سَلَّامٍ الْكُوفِيُّ أَخْبَرَنَا زُهَيْرٌ عَنْ سِمَاكٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ أُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِرَجُلٍ قَتَلَ نَفْسَهُ بِمَشَاقِصَ فَلَمْ يُصَلِّ عَلَيْهِ.",
                "headingArabic": "تَرْكِ الصَّلاَةِ عَلَى الْقَاتِلِ نَفْسَهُ ‏‏",
                "headingUrdu": "خودکشی کرنے والے کی نماز جنازہ چھوڑنا",
                "headingEnglish": "Leaving the funeral prayer for one who committed suicide",
                "chapterId": "12",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 112,
                    "chapterNumber": "12",
                    "chapterEnglish": "The Book of Prayer - Funerals",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجَنَائِزِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9827,
                "hadithNumber": "2263",
                "englishNarrator": "Abu Sa'id al-Khudri رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger (ﷺ) as saying: No sadaqa (zakat) is payable on less than five wasqs of (dates or grains), on less than five camel-heads and on less than five uqiyas (of silver).",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" پانچ وسق سے کم ( غلے یا کھجور ) میں صدقہ ( زکاۃ ) نہیں اور نہ پانچ سے کم اونٹوں میں صدقہ ہے اور نہ ہی پانچ اوقیہ سے کم ( چاندی ) میں صدقہ ہے ۔ \"",
                "urduNarrator": "مجھ سے عمرو بن محمد بن بکیر الناقد نے بیان کیا, سفیان بن عینیہ نے کہا : میں نے عمرو بن یحییٰ بن عمارہ سے پوچھا تو انھوں نے مجھے اپنے والد سے خبر دی ، انھوں نے حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی",
                "hadithArabic": "و حَدَّثَنِي عَمْرُو بْنُ مُحَمَّدِ بْنِ بُكَيْرٍ النَّاقِدُ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ قَالَ سَأَلْتُ عَمْرَو بْنَ يَحْيَى بْنِ عُمَارَةَ فَأَخْبَرَنِي عَنْ أَبِيهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ صَدَقَةٌ وَلَا فِيمَا دُونَ خَمْسِ ذَوْدٍ صَدَقَةٌ وَلَا فِيمَا دُونَ خَمْسِ أَوَاقٍ صَدَقَةٌ.",
                "headingArabic": "ليس فيما دون خمسة أوسق صدقة",
                "headingUrdu": "پانچ وسق سے کم پر زکوٰۃ نہیں ہے۔",
                "headingEnglish": "There is no Zakat due on less than five Wasq",
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9828,
                "hadithNumber": "2264",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been narrated by 'Amr bin Yahya with the same chain of transmitters.",
                "hadithUrdu": "ہم سے محمد بن رومح بن المہاجر نے بیان کیا، کہا ہم سے لیث نے بیان کیا، اور ہم سے عمرو الناقد نے بیان کیا، کہا کہ ہم سے عبداللہ بن ادریس نے بیان کیا، ان دونوں نےیحییٰ بن سعید نے عمرو بن یحییٰ سے مذکورہ بالا سند کے ساتھ اسی کے مانند بیان کیا ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ أَخْبَرَنَا اللَّيْثُ ح و حَدَّثَنِي عَمْرٌو النَّاقِدُ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ كِلَاهُمَا عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَمْرِو بْنِ يَحْيَى بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9829,
                "hadithNumber": "2265",
                "englishNarrator": "Umara reported:",
                "hadithEnglish": "I heard Abd Sa'id al-Khudri رضی اللہ تعالیٰ عنہ as saying that he had heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) make (this) observation with a gesture of his five fingers, and then he narrated the hadith as transmitted by 'Uyaina (hadith 2134).",
                "hadithUrdu": "میں حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ سے سنا ، کہہ رہے تھے : میں نے ر سول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا اور نبی کریم صلی اللہ علیہ وسلم نے اپنی ہتھیلی سے اپنی پانچوں انگلیوں سے اشارہ کیا ۔ ۔ ۔ پھر ( ابن جریج نے سفیان ) بن عینیہ کی حدیث کی طرح بیان کیا ۔",
                "urduNarrator": "ہم سے محمد بن رافع نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، انہوں نے بیان کیا  ابن جریج نے کہا : مجھے عمرو بن یحییٰ بن عمارہ نے اپنے والد یحییٰ بن عمارہ سے خبر دی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي عَمْرُو بْنُ يَحْيَى بْنِ عُمَارَةَ عَنْ أَبِيهِ يَحْيَى بْنِ عُمَارَةَ قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ وَأَشَارَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِكَفِّهِ بِخَمْسِ أَصَابِعِهِ ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ ابْنِ عُيَيْنَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9830,
                "hadithNumber": "2266",
                "englishNarrator": "Abu Sa'id al-Khudri رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Sadaqa (zakat) is payable on less than five wasqs of (dates or grains), on less than five camel-heads, and on less than five uqiyas (of silver).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" پانچ وسق سے کم ( کھجور یا غلے ) میں صدقہ نہیں اور پانچ سے کم اونٹوں میں صدقہ نہیں اور پانچ اوقیہ سے کم ( چاندی ) میں صدقہ نہیں ۔ \"",
                "urduNarrator": "مجھ سے ابو کامل فضیل بن حسین الجہداری نے بیان کیا، ہم سے بشر یعنی ابن مفضل نے بیان کیا, عمارہ بن غزیہ نے یحییٰ بن عمارہ سے حدیث بیان کی ، انھوں نے کہا : میں نے حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ کو کہتے ہوئے سنا ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنِي أَبُو كَامِلٍ فُضَيْلُ بْنُ حُسَيْنٍ الْجَحْدَرِيُّ حَدَّثَنَا بِشْرٌ يَعْنِي ابْنَ مُفَضَّلٍ حَدَّثَنَا عُمَارَةُ بْنُ غَزِيَّةَ عَنْ يَحْيَى بْنِ عُمَارَةَ قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ صَدَقَةٌ وَلَيْسَ فِيمَا دُونَ خَمْسِ ذَوْدٍ صَدَقَةٌ وَلَيْسَ فِيمَا دُونَ خَمْسِ أَوَاقٍ صَدَقَةٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9831,
                "hadithNumber": "2267",
                "englishNarrator": "Abu Sa'id al-Khudri reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: No Sadaqa is payable on less than five wasqs of dates or grains.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" پانچ وسق سے کم کھجور اور غلے میں صدقہ نہیں ہے ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، عمرو ناقد اور زہیر بن حرب نے بیان کیا، انہوں نے کہا: ہم سے انہوں نے بیان کیا وکیع نے سفیان سے ، انھوں نے اسماعیل بن امیہ سے ، انھوں نے محمد بن یحییٰ بن حبان سے ، انھوں نے یحییٰ بن عمارہ سے اور انھوں نے حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نےکہا",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ قَالُوا حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ إِسْمَعِيلَ بْنِ أُمَيَّةَ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ يَحْيَى بْنِ عُمَارَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسَاقٍ مِنْ تَمْرٍ وَلَا حَبٍّ صَدَقَةٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9832,
                "hadithNumber": "2268",
                "englishNarrator": "Abu Sa'id al-Khudri reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: No Sadaqa is payable on the grains and dates till it (comes to the Weight) of five wasqs, or less than five heads of camels, or less than five uqiyas (of silver).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا : \" نہ غلے میں صدقہ ہے نہ کھجور میں حتیٰ کہ وہ پانچ وسق تک پہنچ جائیں اور نہ پانچ سے کم اونٹوں میں صدقہ ہے اور نہ پانچ اوقیہ سے کم ( چاندی ) میں صدقہ ہے ۔ \"",
                "urduNarrator": "ہم سے اسحاق بن منصور نے بیان کیا، کہا ہم سے عبدالرحمٰن نے بیان کیا، کہا ہم سے ابن مہدی نے بیان کیا، کہا ہم سے سفیان نے اسماعیل بن امیہ کے واسطہ سے، وہ محمد بن یحییٰ بن حبان کے واسطہ سے، وہ یحییٰ بن عمارہ کے واسطہ سے۔ ابو سعید الخدری",
                "hadithArabic": "و حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ أَخْبَرَنَا عَبْدُ الرَّحْمَنِ يَعْنِي ابْنَ مَهْدِيٍّ حَدَّثَنَا سُفْيَانُ عَنْ إِسْمَعِيلَ بْنِ أُمَيَّةَ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ يَحْيَى بْنِ عُمَارَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ فِي حَبٍّ وَلَا تَمْرٍ صَدَقَةٌ حَتَّى يَبْلُغَ خَمْسَةَ أَوْسُقٍ وَلَا فِيمَا دُونَ خَمْسِ ذَوْدٍ صَدَقَةٌ وَلَا فِيمَا دُونَ خَمْسِ أَوَاقٍ صَدَقَةٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9833,
                "hadithNumber": "2269",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been narrated by Isma'il bin Umayya with the same chain of transmitters.",
                "hadithUrdu": "اور مجھ سے عبد بن حمید نے بیان کیا، انہوں نے ہم سے بیان کیا  یحییٰ بن آدم نے کہا : ہمیں سفیان ثوری نے اسماعیل بن امیہ سے اسی مذکورہ بالا سند کے ساتھ ابن مہدی کی حدیث کی طرح بیان کیا ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنِي عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا سُفْيَانُ الثَّوْرِيُّ عَنْ إِسْمَعِيلَ بْنِ أُمَيَّةَ بِهَذَا الْإِسْنَادِ مِثْلَ حَدِيثِ ابْنِ مَهْدِيٍّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9834,
                "hadithNumber": "2270",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been narrated by Isma'il bin Umayya with the same chain of transmitters, but instead of the word dates, fruit has been used.",
                "hadithUrdu": "اور مجھ سے محمد بن رافع نے بیان کیا,عبدالرزاق نے کہا : ہمیں ثوری اور معمر نے اسماعیل بن امیہ سے اسی سندکے ساتھ ، ابن مہدی اور یحییٰ بن آدم کی حدیث کی طرح بیان کیا ، البتہ انھوں نے تمر ( کھجور ) کے بجائے ثمر ( پھل ) کہا ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا الثَّوْرِيُّ وَمَعْمَرٌ عَنْ إِسْمَعِيلَ بْنِ أُمَيَّةَ بِهَذَا الْإِسْنَادِ مِثْلَ حَدِيثِ ابْنِ مَهْدِيٍّ وَيَحْيَى بْنِ آدَمَ غَيْرَ أَنَّهُ قَالَ بَدَلَ التَّمْرِ ثَمَرٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9835,
                "hadithNumber": "2271",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: No Sadaqa is payable on less than five fiqiyas of silver, and on less than five heads of camels, and less than five wasqs of dates.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" پانچ اوقیہ سے کم چاندی میں صدقہ نہیں اور نہ پانچ اونٹوں سے کم میں صدقہ ہے اور نہ ہی پانچ وسق سے کم کھجوروں میں صدقہ ہے ۔ \"",
                "urduNarrator": "ہم سے ہارون بن معروف اور ہارون بن سعید العیلی نے بیان کیا، کہا: ہم سے ابن وہب نے بیان کیا، کہا: مجھ سے عیاض بن عبداللہ نے ابو الزبیر کی سند سے بیان کیا, حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے خبردی کہ",
                "hadithArabic": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ وَهَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ قَالَا حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عِيَاضُ بْنُ عَبْدِ اللَّهِ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ لَيْسَ فِيمَا دُونَ خَمْسِ أَوَاقٍ مِنْ الْوَرِقِ صَدَقَةٌ وَلَيْسَ فِيمَا دُونَ خَمْسِ ذَوْدٍ مِنْ الْإِبِلِ صَدَقَةٌ وَلَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ مِنْ التَّمْرِ صَدَقَةٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9836,
                "hadithNumber": "2272",
                "englishNarrator": "Jabir bin Abdullah رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: A tenth is payable on what is watered by rivers, or rains, and a twentieth on what is watered by camels.",
                "hadithUrdu": "آپ نے فر ما یا : \" جس ( کھیتی ) کو دریا کا پانی یا بارش سیرا ب کرے ان میں عشر ( دسواں حصہ ) ہے اور جس کو اونٹ ( وغیرہ کسی جا نور کے ذریعے ) سے سیراب کیا جا ئے ان میں نصف عشر ( بیسواں حصہ ) ہے ۔",
                "urduNarrator": "ابو الطاہر احمد بن عمرو بن عبداللہ بن عمرو بن سرح، ہارون بن سعید العیلی، عمرو بن سواد اور ولید بن شجاع نے ان سب کو ابن وہب کی سند سے بیان کیا۔ ہم سے عبداللہ بن وہب نے عمرو بن حارث کی سند سے بیان کیا کہ ان سے ابو الزبیر نے بیان کیا کہ میں نے سنا, حضرت جا بر بن عبد اللہ رضی اللہ تعالیٰ عنہ بیان کرتے ہیں کہ انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ أَحْمَدُ بْنُ عَمْرِو بْنِ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ سَرْحٍ وَهَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ وَعَمْرُو بْنُ سَوَّادٍ وَالْوَلِيدُ بْنُ شُجَاعٍ كُلُّهُمْ عَنْ ابْنِ وَهْبٍ قَالَ أَبُو الطَّاهِرِ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ عَنْ عَمْرِو بْنِ الْحَارِثِ أَنَّ أَبَا الزُّبَيْرِ حَدَّثَهُ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَذْكُرُ أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِيمَا سَقَتْ الْأَنْهَارُ وَالْغَيْمُ الْعُشُورُ وَفِيمَا سُقِيَ بِالسَّانِيَةِ نِصْفُ الْعُشْرِ.",
                "headingArabic": "مَا فِيهِ الْعُشْرُ أَوْ نِصْفُ الْعُشْرِ ‏‏",
                "headingUrdu": "دسواں حصہ کس چیز پر واجب الادا ہے؟",
                "headingEnglish": "On what one-tenth or half of one-tenth is due",
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9837,
                "hadithNumber": "2273",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messsenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: No Sadaqa is due from a Muslim on his slave or horse.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" مسلمان کے ذمے نہ اس کے غلام میں صدقہ ( زکاۃ ) ہے اور نہ اس کے گھوڑے میں ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ تمیمی نے بیان کیا، کہا کہ میں نے مالک رضی اللہ عنہ سے اس کے متعلق پڑھا, عبد اللہ بن دینا ر نے سلیمان بن یسارسے انھوں نے عراک بن مالک سے اور انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ عِرَاكِ بْنِ مَالِكٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ عَلَى الْمُسْلِمِ فِي عَبْدِهِ وَلَا فَرَسِهِ صَدَقَةٌ.",
                "headingArabic": "لاَ زَكَاةَ عَلَى الْمُسْلِمِ فِي عَبْدِهِ وَفَرَسِهِ ‏‏",
                "headingUrdu": "مسلمان پر اپنے غلام اور گھوڑے کی زکوٰۃ واجب نہیں ہے۔",
                "headingEnglish": "The Muslim is not obliged to give Zakat on his slave nor his horse",
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9838,
                "hadithNumber": "2274",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: No Sadaqa is due from a Muslim on his slave or horse.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے   فر ما یا : \" مسلمان پر اس کے غلام اور گھوڑے میں صدقہ نہیں ۔ \"",
                "urduNarrator": "عمرو الناقد اور زہیر بن حرب نے کہا : ہمیں سفیان بن عیینہ نے حدیث سنائی انھوں نے کہا : ہمیں ایوب بن موسیٰ نے مکحول سے حدیث بیان کی ، انھوں نے سلیمان بن یسار سے انھوں نے عراک بن مالک سے اور انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ۔ ۔ ۔ عمرو نے کہا : ( ابو ہریرہ رضی اللہ تعالیٰ عنہ نے ) نبی صلی اللہ علیہ وسلم سے روایت کی اور زہیر نے کہا , انھوں نے اسے نبی صلی اللہ علیہ وسلم تک پہنچا یا یعنی آپ سے بیان کیا ۔ ۔ ۔",
                "hadithArabic": "و حَدَّثَنِي عَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ حَدَّثَنَا أَيُّوبُ بْنُ مُوسَى عَنْ مَكْحُولٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ عِرَاكِ بْنِ مَالِكٍ عَنْ أَبِي هُرَيْرَةَ قَالَ عَمْرٌو عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ زُهَيْرٌ يَبْلُغُ بِهِ لَيْسَ عَلَى الْمُسْلِمِ فِي عَبْدِهِ وَلَا فَرَسِهِ صَدَقَةٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 9526,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=381",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=379",
                "label": "379",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=380",
                "label": "380",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=381",
                "label": "381",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=382",
                "label": "382",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=383",
                "label": "383",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=384",
                "label": "384",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=385",
                "label": "385",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=383",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=383",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=381",
        "to": 9550,
        "total": 40465
    }
}