{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 403,
        "data": [
            {
                "id": 10339,
                "hadithNumber": "2775",
                "englishNarrator": "Abdullah bin Unais رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: I was shown Lailat-ul-Qadr; then I was made to forget it, and saw that I was prostrating in water and clay in the morning of that (night). He (the narrator) said: There was a downpour on the twenty-third night and the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) led us in prayer, and as he went back, there was a trace of water and clay on his forehead and on his nose. He (the narrator) said: 'Abdullah bin Unais رضی اللہ تعالیٰ عنہ used to say that it was the twenty-third (night).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \"\" مجھے شب قدر دکھا ئی گئی پھر مجھے بھلا دی گئی ۔ اس کی صبح میں اپنے آپ کو دیکھتا ہوں کہ پانی اور مٹی میں سجدہ کر رہا ہوں ۔ کہا : تیئسویں رات ہم پر بارش ہوئی ۔ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں نماز پڑھا ئی پھر آپ نے ( رخ ) پھیرا تو آپ کی پیشانی اور ناک پر پانی اور مٹی کے نشانات تھے ، کہا : اور عبد اللہ بن انیس رضی اللہ تعالیٰ عنہ کہا کرتے تھے ( لیلۃالقدر ) تیئیسویں ہے ۔",
                "urduNarrator": "ہم سے سعید بن عمرو بن سہل بن اسحاق بن محمد بن اشعث بن قیس الکندی اور علی بن خشرم نے بیان کیا، کہا کہ ہم سے ابو دمرہ نے ضحاک بن عثمان نے بیان کیا اور ابن خشرم نے کہا: الضحاک بن عثمان - عمر بن عبید اللہ کے خادم ابو الندر کی سند سے ,بسر بن سعید نے حضرت عبد اللہ بن انیس رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَا سَعِيدُ بْنُ عَمْرِو بْنِ سَهْلِ بْنِ إِسْحَاقَ بْنِ مُحَمَّدِ بْنِ الْأَشْعَثِ بْنِ قَيْسٍ الْكِنْدِيُّ، وَعَلِيُّ بْنُ خَشْرَمٍ، قَالَا: حَدَّثَنَا أَبُو ضَمْرَةَ، حَدَّثَنِي الضَّحَّاكُ بْنُ عُثْمَانَ - وَقَالَ ابْنُ خَشْرَمٍ: عَنِ الضَّحَّاكِ بْنِ عُثْمَانَ - عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللهِ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ عَبْدِ اللهِ بْنِ أُنَيْسٍ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «أُرِيتُ لَيْلَةَ الْقَدْرِ، ثُمَّ أُنْسِيتُهَا، وَأَرَانِي صُبْحَهَا أَسْجُدُ فِي مَاءٍ وَطِينٍ» قَالَ: فَمُطِرْنَا لَيْلَةَ ثَلَاثٍ وَعِشْرِينَ، فَصَلَّى بِنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَانْصَرَفَ وَإِنَّ أَثَرَ الْمَاءِ وَالطِّينِ عَلَى جَبْهَتِهِ وَأَنْفِهِ قَالَ: وَكَانَ عَبْدُ اللهِ بْنُ أُنَيْسٍ يَقُولُ: ثَلَاثٍ وَعِشْرِينَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10340,
                "hadithNumber": "2776",
                "englishNarrator": "A'isha ( رضی اللہ تعالیٰ عنہا) and Ibn Numair reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Look for (and in the words of Waki, seek) Lailat-ul-Qadr in the last ten nights of Ramadan.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" لیلۃالقدر کو رمضا ن کی آخری دس راتوں میں تلا ش کرو ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے ابن نمیر اور وکیع نے بیان کیا، انہوں نے ہشام سے اور اپنے والد سے, حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت ہے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ نُمَيْرٍ، وَوَكِيعٌ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، رَضِيَ اللهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: - قَالَ ابْنُ نُمَيْرٍ الْتَمِسُوا وَقَالَ وَكِيعٌ - «تَحَرَّوْا لَيْلَةَ الْقَدْرِ فِي الْعَشْرِ الْأَوَاخِرِ مِنْ رَمَضَانَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10341,
                "hadithNumber": "2777",
                "englishNarrator": "Zirr bin Habaish reported:",
                "hadithEnglish": "I thu asked Ubayy bin Ka'b ( رضی اللہ تعالیٰ عنہ ): Your brother (in faith) Ibn Mas'ud رضی اللہ تعالیٰ عنہ says: He who stands (for the night prayer) throughout the year would find Lailat-ul-Qadr, whereupon he said: May Allah have mercy upon him; (he said these words) with the intention that people might not rely only (on one night), whereas he knew that it (Lailat-ul-Qadr) is in the month of Ramadan and it is the twenty-seventh night. He then took oath (without making any exception, i. e. without saying In sha Allah) that it was the twenty-seventh night. I said to him: Abu Mundhir, on what ground do you say that? Thereupon he said: By the indication or by the sign which the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) gave us, and that is that on that day (the sun) would rise without having any ray in it.",
                "hadithUrdu": "میں نے حضرت ابی بن کعب رضی اللہ تعالیٰ عنہ سے سوال کیا ، میں نے کہا : آپ کے بھا ئی عبد اللہ بن مسعود رضی اللہ تعالیٰ عنہ کہتے ہیں جو سال بھر ( رات کو ) قیام کرے گا ۔ وہ لیلۃ القدر کو پا لے گا ۔ انھوں نے فر ما یا : \" اللہ ان پر رحم فر ما ئے انھوں نے چا ہا کہ لو گ ( کم راتوں کی عبادت پر ) قناعت نہ کر لیں ورنہ وہ خوب جا نتے ہیں کہ وہ رمضان ہی میں ہے اور آخری عشرے میں ہے اور یہ بھی کہ وہ ستا ئیسویں رات ہے ۔ پھر انھوں نے استثناکیے ( ان شاء اللہ کہے ) بغیر قسم کھا کر کہا : وہ ستا ئیسویں رات ہی ہے اس پر میں نے کہا : ابو منذرا ! یہ بات آپ کس بنا پر کہتے ہیں ؟انھوں نے کہا : اس علامت یا نشانی کی بنا پر جو رسول اللہ صلی اللہ علیہ وسلم نے ہمیں بتا ئی ہے کہ اس دن سورج نکلتا ہے اس کی شعائیں ( نما یاں ) نہیں ہو تیں ۔",
                "urduNarrator": "ہم سے محمد بن حاتم اور ابن ابی عمر نے بیان کیا، ان دونوں نے ابن عیینہ کی سند سے کہا: ہم سے بیان کیا سفیان بن عیینہ نے عبد ہ اور عا صم بن ابی نجود سے روایت کی ، ان دو نوں نے حضرت زربن حبیش ؒ سے سنا ، کہہ رہے تھے",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمٍ، وَابْنُ أَبِي عُمَرَ، كِلَاهُمَا عَنِ ابْنِ عُيَيْنَةَ، قَالَ ابْنُ حَاتِمٍ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَبْدَةَ، وَعَاصِمِ بْنِ أَبِي النَّجُودِ، سَمِعَا زِرَّ بْنَ حُبَيْشٍ، يَقُولُ: سَأَلْتُ أُبَيَّ بْنَ كَعْبٍ رَضِيَ اللهُ عَنْهُ، فَقُلْتُ: إِنَّ أَخَاكَ ابْنَ مَسْعُودٍ يَقُولُ: مَنْ يَقُمِ الْحَوْلَ يُصِبْ لَيْلَةَ الْقَدْرِ؟ فَقَالَ رَحِمَهُ اللهُ: أَرَادَ أَنْ لَا يَتَّكِلَ النَّاسُ، أَمَا إِنَّهُ قَدْ عَلِمَ أَنَّهَا فِي رَمَضَانَ، وَأَنَّهَا فِي الْعَشْرِ الْأَوَاخِرِ، وَأَنَّهَا لَيْلَةُ سَبْعٍ وَعِشْرِينَ، ثُمَّ حَلَفَ لَا يَسْتَثْنِي، أَنَّهَا لَيْلَةُ سَبْعٍ وَعِشْرِينَ، فَقُلْتُ: بِأَيِّ شَيْءٍ تَقُولُ ذَلِكَ؟ يَا أَبَا الْمُنْذِرِ، قَالَ: بِالْعَلَامَةِ، أَوْ بِالْآيَةِ الَّتِي «أَخْبَرَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهَا تَطْلُعُ يَوْمَئِذٍ، لَا شُعَاعَ لَهَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10342,
                "hadithNumber": "2778",
                "englishNarrator": "Zirr bin Hubaish reported that Ubayy bin Ka'b (رضی اللہ تعالیٰ عنہ ) said about Lailat-ul-Qadr:",
                "hadithEnglish": "By Allah, I know well about it. Shu'ba said: To the best of my knowledge it was the twenty-seventh night for which the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) commanded us to stand for prayer. Shu'ba doubted these words: That it was the night for which the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) commanded us to stand for prayer. And (he further) said: This was narrated to me by a friend of mine from him (the Holy Prophet).",
                "hadithUrdu": "اللہ کی قسم!میں اس کو جا نتا ہوں شعبہ نے ( روایت کے الفا ظ بیان کرتے ہو ئے ) کہا : میرا غالب گمان ہے کہ یہ وہی رات ہے جس ( پر پوری رات ) کے قیام کا رسول اللہ صلی اللہ علیہ وسلم نے ہمیں حکم دیا تھا ( اور ) وہ ستائیسویں رات ہے ۔ اس فقرے میں شعبہ نے شک کیا : یہ وہی را ت ہے جس کے بارے میں رسول اللہ صلی اللہ علیہ وسلم نے ہمیں حکم دیا ۔ \"\" اور کہا : اس کے بارے میں مجھے میرے ایک ساتھی نے ان ( عبد ہ ) کے حوالے سے حدیث بیان کی ۔",
                "urduNarrator": "ہم سے محمد بن مثنیٰ نے بیان کیا، ہم سے محمد بن جعفر نے بیان کیا، ہم سے انہوں نے بیان کیا شعبہ نے کہا : میں نے عبد ہ بن ابی لبابہ سے سنا ، وہ حضرت زر بن حبیشؒ سے حدیث بیان کر رہے تھے ۔ انھوں نے حضرت ابی بن کعب رضی اللہ تعالیٰ عنہ سے روایت کی ۔ کہا : حضرت ابی رضی اللہ تعالیٰ عنہ نے لیلۃالقدر کے بارے میں کہا",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ: سَمِعْتُ عَبْدَةَ بْنَ أَبِي لُبَابَةَ، يُحَدِّثُ عَنْ زِرِّ بْنِ حُبَيْشٍ، عَنْ أُبَيِّ بْنِ كَعْبٍ رَضِيَ اللهُ عَنْهُ، قَالَ: قَالَ أُبَيٌّ فِي لَيْلَةِ الْقَدْرِ: وَاللهِ، إِنِّي لَأَعْلَمُهَا، - قَالَ شُعْبَةُ: - «وَأَكْبَرُ عِلْمِي هِيَ اللَّيْلَةُ الَّتِي أَمَرَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِقِيَامِهَا، هِيَ لَيْلَةُ سَبْعٍ وَعِشْرِينَ» وَإِنَّمَا شَكَّ شُعْبَةُ فِي هَذَا الْحَرْفِ: هِيَ اللَّيْلَةُ الَّتِي أَمَرَنَا بِهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: وَحَدَّثَنِي بِهَا صَاحِبٌ لِي عَنْهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10343,
                "hadithNumber": "2779",
                "englishNarrator": "Abu Huraira ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "We were talking about Lailat-ul-Qadr in the presence of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and he said: He who amongst you remembers (the night) when the moon arose and it was like a piece of plate (at the fag end of the month in a state of waning).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے سامنے ہم نے آپ میں لیلۃ القدر کا ذکر کیا تو آپ نے فر مایا : \" تم میں سے کس کو یا د ہے جب چا ند طلوع ہوا اور وہ پیا لے کے ایک ٹکڑے کے مانند تھا ( وہی رات تھی )",
                "urduNarrator": "ہم سے محمد بن عباد اور ابن ابی عمر نے بیان کیا، کہا: ہم سے مروان نے جو الفزاری ہے، انہوں نے یزید کی سند سے، جو ابن کیسان نے، ابوحازم کی سند سے بیان کیا, حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت ہے کہا",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ عَبَّادٍ، وَابْنُ أَبِي عُمَرَ، قَالَا: حَدَّثَنَا مَرْوَانُ وَهُوَ الْفَزَارِيُّ، عَنْ يَزِيدَ وَهُوَ ابْنُ كَيْسَانَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ، قَالَ: تَذَاكَرْنَا لَيْلَةَ الْقَدْرِ عِنْدَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «أَيُّكُمْ يَذْكُرُ حِينَ طَلَعَ الْقَمَرُ، وَهُوَ مِثْلُ شِقِّ جَفْنَةٍ؟».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 114,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Book of Fasting",
                    "chapterUrdu": "روزے کے احکام و مسائل",
                    "chapterArabic": "كتاب الصِّيَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10344,
                "hadithNumber": "2780",
                "englishNarrator": "Ibn 'Umar (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to observe i'tikaf in the last ten days of Ramadan.",
                "hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم رمضان المبارک کے آخری عشرے میں اعتکاف فرمایا کرتے تھے ۔",
                "urduNarrator": "ہم سے محمد بن مہران الرازی نے بیان کیا، کہا ہم سے حاتم بن اسماعیل نے بیان کیا, موسیٰ بن عقبہ نے نافع سے اور انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مِهْرَانَ الرَّازِيُّ، حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ رَضِيَ اللهُ عَنْهُمَا: «أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ يَعْتَكِفُ فِي الْعَشْرِ الْأَوَاخِرِ مِنْ رَمَضَانَ».",
                "headingArabic": "اعْتِكَافِ الْعَشْرِ الأَوَاخِرِ مِنْ رَمَضَانَ ‏",
                "headingUrdu": "رمضان کے آخری عشرہ میں اعتکاف",
                "headingEnglish": "I'tikaf during the last ten days of Ramadan",
                "chapterId": "15",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 115,
                    "chapterNumber": "15",
                    "chapterEnglish": "The Book of I'tikaaf",
                    "chapterUrdu": "اعتکاف کے احکام و مسائل",
                    "chapterArabic": "كتاب الِاعْتِكَافِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10345,
                "hadithNumber": "2781",
                "englishNarrator": "Abdullah bin Umar (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to observe i'tikaf in the last ten days of Ramadan. Nafi' said: Abdullah (رضی اللہ تعالیٰ عنہ) showed me the place in the mosque where the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to observe i'tikaf.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم رمضان کے آخری عشرے میں اعتکاف فرماتے تھے ۔ نافع نے کہا : عبداللہ رضی اللہ تعالیٰ عنہ نے مجھے مسجد میں وہ جگہ بھی دیکھائی جہاں رسول اللہ صلی اللہ علیہ وسلم ا عتکاف کیا کرتے تھے ۔",
                "urduNarrator": "مجھ سے ابو الطاہر نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، انہوں نے کہا یونس بن یزید نے مجھے خبر دی کہ نافع نے انھیں حضرت عبداللہ بن عمر رضی اللہ تعالیٰ عنہ کے واسطے سے حدیث بیان کی کہ",
                "hadithArabic": "وحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ بْنُ يَزِيدَ، أَنَّ نَافِعًا، حَدَّثَهُ عَنْ عَبْدِ اللهِ بْنِ عُمَرَ رَضِيَ اللهُ عَنْهُمَا: «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ يَعْتَكِفُ الْعَشْرَ الْأَوَاخِرَ مِنْ رَمَضَانَ» قَالَ نَافِعٌ: وَقَدْ أَرَانِي عَبْدُ اللهِ رَضِيَ اللهُ عَنْهُ: «الْمَكَانَ الَّذِي كَانَ يَعْتَكِفُ فِيهِ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنَ الْمَسْجِدِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "15",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 115,
                    "chapterNumber": "15",
                    "chapterEnglish": "The Book of I'tikaaf",
                    "chapterUrdu": "اعتکاف کے احکام و مسائل",
                    "chapterArabic": "كتاب الِاعْتِكَافِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10346,
                "hadithNumber": "2782",
                "englishNarrator": "A'isha ( رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to observe i'tikaf in the last ten days of Ramadan.",
                "hadithUrdu": "انھوں نے فرمایا : اللہ کےرسول صلی اللہ علیہ وسلم رمضان کے آخری عشرے میں اعتکاف کیا کرتے تھے ۔",
                "urduNarrator": "ہم سے سہل بن عثمان نے بیان کیا، کہا ہم سے عقبہ بن خالد السکونی نے بیان کیا، ان سے عبید اللہ بن عمر رضی اللہ عنہما سے۔عبدالرحمن بن قاسم نے اپنے والد سے ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی",
                "hadithArabic": "وحَدَّثَنَا سَهْلُ بْنُ عُثْمَانَ، حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ السَّكُونِيُّ، عَنْ عُبَيْدِ اللهِ بْنِ عُمَرَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ رَضِيَ اللهُ عَنْهَا، قَالَتْ: «كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَعْتَكِفُ الْعَشْرَ الْأَوَاخِرَ مِنْ رَمَضَانَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "15",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 115,
                    "chapterNumber": "15",
                    "chapterEnglish": "The Book of I'tikaaf",
                    "chapterUrdu": "اعتکاف کے احکام و مسائل",
                    "chapterArabic": "كتاب الِاعْتِكَافِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10347,
                "hadithNumber": "2783",
                "englishNarrator": "It was narrated that 'A'isha (رضی اللہ تعالیٰ عنہا) said:",
                "hadithEnglish": "The Messenger of Allah ﷺ used to observe I'tikaf during the last ten days.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم رمضان المبارک کے آخری عشرے میں اعتکاف کیا کرتے تھے ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا ہم سے ابو معاویہ نے بیان کیا، کہا ہم سے سہل بن عثمان نے بیان کیا، کہا ہم سے حفص بن غیث نے بیان کیا، ہشام بن عروہ نے اپنے والد ( عروہ ) سے ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، فرمایا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، ح وحَدَّثَنَا سَهْلُ بْنُ عُثْمَانَ، أَخْبَرَنَا حَفْصُ بْنُ غِيَاثٍ، جَمِيعًا عَنْ هِشَامٍ، ح وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ - وَاللَّفْظُ لَهُمَا - قَالَا: حَدَّثَنَا ابْنُ نُمَيْرٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، رَضِيَ اللهُ عَنْهَا، قَالَتْ: كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «يَعْتَكِفُ الْعَشْرَ الْأَوَاخِرَ مِنْ رَمَضَانَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "15",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 115,
                    "chapterNumber": "15",
                    "chapterEnglish": "The Book of I'tikaaf",
                    "chapterUrdu": "اعتکاف کے احکام و مسائل",
                    "chapterArabic": "كتاب الِاعْتِكَافِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10348,
                "hadithNumber": "2784",
                "englishNarrator": "A'isha ( رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "The Messenger of Allah (ﷺ) used to observe i'tikif in the last ten days of Ramadan till Allah called him back (to his heavenly home). Then his wives observed i'tikaf after him.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم رمضان کےآخری دس دنوں میں اعتکاف فرمایا کرتے تھے ، یہاں تک کہ اللہ تعالیٰ نے آپ کو وفات دی ، پھر آپ صلی اللہ علیہ وسلم کی ازواج مطہرات آپ صلی اللہ علیہ وسلم کے بعد ( آخری عشرے میں ) اعتکاف کرتی رہیں ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ہم سے لیث نے بیان کیا، عقیل رضی اللہ عنہ سے, زہری نے عروہ کے واسطے سے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ عُقَيْلٍ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ رَضِيَ اللهُ عَنْهَا، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «كَانَ يَعْتَكِفُ الْعَشْرَ الْأَوَاخِرَ مِنْ رَمَضَانَ، حَتَّى تَوَفَّاهُ اللهُ عَزَّ وَجَلَّ، ثُمَّ اعْتَكَفَ أَزْوَاجُهُ مِنْ بَعْدِهِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "15",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 115,
                    "chapterNumber": "15",
                    "chapterEnglish": "The Book of I'tikaaf",
                    "chapterUrdu": "اعتکاف کے احکام و مسائل",
                    "chapterArabic": "كتاب الِاعْتِكَافِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10349,
                "hadithNumber": "2785",
                "englishNarrator": "A'isha ( رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) decided to observe i'tikaf, he prayed in the morning and then went to the place of his i'tikaf, and he commanded that a tent should be pitched for him, and it was pitched. He (once) decided to observe i'tikaf in the last ten days of Ramadan. Zainab ( رضی اللہ عنہا) commanded that a tent should be pitched for her. It was pitched accordingly. And some other wives of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) commanded that tents should be pitched for them too. And they were pitched. When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) offered the morning prayer, he looked and found (so many) tents. Thereupon he said: What is this virtue that these (ladies) have decided to acquire? He commanded his tent to be struck and abandoned i'tikaf in the month of Ramadan and postponed it to the first ten days of Shawwal.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم جب اعتکاف کا ارادہ کرتے تو صبح کی نماز پڑھ کر اعتکاف کی جگہ میں داخل ہو جاتے ۔ اور ایک بار آپ صلی اللہ علیہ وسلم نے ( مسجد میں ) اپنا خیمہ لگانے کا حکم فرمایا ۔ وہ لگا دیا گیا اور آپ صلی اللہ علیہ وسلم نے رمضان کے عشرہ اخیر میں اعتکاف کا ارادہ کیا تھا تو ام المؤمنین زینب رضی اللہ عنہا نے اپنے لئے خیمہ لگانے کا کہا تو ان کے لئے بھی خیمہ لگا دیا گیا ۔ پھر دوسری امہات المؤمنین نے کہا تو ان کے خیمے بھی لگا دئیے گئے ۔ پھر جب رسول اللہ صلی اللہ علیہ وسلم فجر کی نماز پڑھ چکے تو سب خیموں کو دیکھا اور فرمایا کہ ان لوگوں نے کیا نیکی کا ارادہ کیا ہے؟ ( اس میں بوئے ریا پائی جاتی ہے ) چنانچہ آپ صلی اللہ علیہ وسلم نے اپنا خیمہ کھولنے کا حکم دیا تو اسے کھول دیا گیا اور آپ نے رمضان میں اعتکاف ترک کر دیا یہاں تک کہ پھر شوال کے پہلے عشرہ میں اعتکاف کیا ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے بیان کیا ابو معاویہ نے ہمیں یحییٰ بن سعید سے خبر دی ، انھوں نے عمرہ سے ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سےروایت کی ، انھوں نے کہا : ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا کہتی ہیں کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ رَضِيَ اللهُ عَنْهَا، قَالَتْ: كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، إِذَا أَرَادَ أَنْ يَعْتَكِفَ صَلَّى الْفَجْرَ، ثُمَّ دَخَلَ مُعْتَكَفَهُ وَإِنَّهُ أَمَرَ بِخِبَائِهِ فَضُرِبَ، أَرَادَ الِاعْتِكَافَ فِي الْعَشْرِ الْأَوَاخِرِ مِنْ رَمَضَانَ، فَأَمَرَتْ زَيْنَبُ بِخِبَائِهَا فَضُرِبَ، وَأَمَرَ غَيْرُهَا مِنْ أَزْوَاجِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِخِبَائِهِ فَضُرِبَ، فَلَمَّا صَلَّى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الْفَجْرَ، نَظَرَ، فَإِذَا الْأَخْبِيَةُ فَقَالَ: «آلْبِرَّ تُرِدْنَ؟» فَأَمَرَ بِخِبَائِهِ فَقُوِّضَ، وَتَرَكَ الِاعْتِكَافَ فِي شَهْرِ رَمَضَانَ، حَتَّى اعْتَكَفَ فِي الْعَشْرِ الْأَوَّلِ مِنْ شَوَّالٍ.",
                "headingArabic": "مَتَى يَدْخُلُ مَنْ أَرَادَ الاِعْتِكَافَ فِي مُعْتَكَفِهِ ‏",
                "headingUrdu": "اعتکاف کرنے والا اپنے اعتکاف کی جگہ کب داخل ہو؟",
                "headingEnglish": "When should the one who wants to observe I'tikaf enter his place of I'tikaf?",
                "chapterId": "15",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 115,
                    "chapterNumber": "15",
                    "chapterEnglish": "The Book of I'tikaaf",
                    "chapterUrdu": "اعتکاف کے احکام و مسائل",
                    "chapterArabic": "كتاب الِاعْتِكَافِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10350,
                "hadithNumber": "2786",
                "englishNarrator": "A hadith similar to that of Abu Muawiyah (no.2785) was narrated from 'Aishah رضی اللہ  عنہا from the prophet ﷺ. In the Hadith of Ibn Uyaynah, Amr bin Al-Harith and Ibn Ishaq, it mention:",
                "hadithEnglish": "'A'isha رضی اللہ عنہا , Hafsa رضی اللہ عنہا and Zainab ( رضی اللہ عنہا) setting up of tents for i'tikaf.",
                "hadithUrdu": "حضرت عائشہ رضی اللہ عنہا ، حضرت حفصہ رضی اللہ عنہا اور حضرت زینب رضی اللہ عنہا کا ذکر ہے کہ انھوں نے اعتکاف کے لیے خیمے لگائے تھے ۔",
                "urduNarrator": "ہم سے ابن ابی عمر نے بیان کیا, سفیان بن عینیہ ، عمرو بن حارث ، سفیان ثوری ، اوزاعی ، اور محمد بن اسحاق سب نے یحییٰ بن سعید سے ، انھوں نے عمرہ سے ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے اور انہوں نے نبی کریم صلی اللہ علیہ وسلم سے ابو معاویہ کی روایت کے ہم معنی روایت بیا ن کی ۔ ابن عینیہ نے عمرو بن حارث اورابن اسحاق کی روایت میں",
                "hadithArabic": "وحَدَّثَنَاه ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، ح وحَدَّثَنِي عَمْرُو بْنُ سَوَّادٍ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنَا عَمْرُو بْنُ الْحَارِثِ، ح وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا أَبُو أَحْمَدَ، حَدَّثَنَا سُفْيَانُ، ح وحَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا أَبُو الْمُغِيرَةِ، حَدَّثَنَا الْأَوْزَاعِيُّ، ح وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنِ ابْنِ إِسْحَاقَ، كُلُّ هَؤُلَاءِ عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ رَضِيَ اللهُ عَنْهَا، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، بِمَعْنَى حَدِيثِ أَبِي مُعَاوِيَةَ. وَفِي حَدِيثِ ابْنِ عُيَيْنَةَ، وَعَمْرِو بْنِ الْحَارِثِ، وَابْنِ إِسْحَاقَ، ذِكْرُ عَائِشَةَ، وَحَفْصَةَ، وَزَيْنَبَ رَضِيَ اللهُ عَنْهُنَّ، أَنَّهُنَّ ضَرَبْنَ الْأَخْبِيَةَ لِلِاعْتِكَافِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "15",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 115,
                    "chapterNumber": "15",
                    "chapterEnglish": "The Book of I'tikaaf",
                    "chapterUrdu": "اعتکاف کے احکام و مسائل",
                    "chapterArabic": "كتاب الِاعْتِكَافِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10351,
                "hadithNumber": "2787",
                "englishNarrator": "A'isha (رضی اللہ عنہا) reported:",
                "hadithEnglish": "When the last ten nights began Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) kept awake at night (for prayer and devotion), wakened his family, and prepared himself to observe prayer (with more vigour).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کی عادت مبارکہ تھی کہ جب رمضان کا آخری عشرہ آتا تو آپ صلی اللہ علیہ وسلم رات بھر جاگتے اور گھر والوں کو بھی جگاتے ، ( عبادت میں ) نہایت کوشش کرتے اور کمر ، ہمت باندھ لیتے تھے ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم الحنظَلی اور ابن ابی عمر نے بیان کیا، ابن عیینہ کی سند سے، انہوں نے کہا: ہم سے سفیان بن عیینہ نے ابو یعفور کی سند سے، مسلم بن صبیح کی سند سے, مسروق نے حضرت عائشہ سے روایت کی کہ ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا کہتی ہیں کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، وَابْنُ أَبِي عُمَرَ، جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، قَالَ إِسْحَاقُ: أَخْبَرَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَبِي يَعْفُورٍ، عَنْ مُسْلِمِ بْنِ صُبَيْحٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ رَضِيَ اللهُ عَنْهَا، قَالَتْ: كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، «إِذَا دَخَلَ الْعَشْرُ، أَحْيَا اللَّيْلَ، وَأَيْقَظَ أَهْلَهُ، وَجَدَّ وَشَدَّ الْمِئْزَرَ».",
                "headingArabic": "الاِجْتِهَادِ فِي الْعَشْرِ الأَوَاخِرِ مِنْ شَهْرِ رَمَضَانَ ‏",
                "headingUrdu": "رمضان کے آخری عشرہ میں عبادت میں زیادہ محنت کرنا",
                "headingEnglish": "Striving harder in worship during the last ten days of Ramadan",
                "chapterId": "15",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 115,
                    "chapterNumber": "15",
                    "chapterEnglish": "The Book of I'tikaaf",
                    "chapterUrdu": "اعتکاف کے احکام و مسائل",
                    "chapterArabic": "كتاب الِاعْتِكَافِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10352,
                "hadithNumber": "2788",
                "englishNarrator": "A'isha (Allah be pleased with her) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to exert himself in devotion during the last ten nights to a greater extent than at any other time.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ( رمضان کے ) آخری دس دن ( عبادت ) میں اس قدر محنت کرتے ( اور عام دنوں میں بھی آپ صلی اللہ علیہ وسلم بہت زیادہ محنت کرتے تھے ۔ )",
                "urduNarrator": "ہم سے قتیبہ بن سعید اور ابو کامل الجہدری نے بیان کیا، ان دونوں نے عبد الواحد بن زیاد کی سند سے کہا: ہم سے عبد الواحد نے بیان کیا, حسن بن عبیداللہ سے روایت ہے ، کہا : میں نے ابراہیم نخعی سےسنا ، کہہ رہے تھے : میں نے اسود بن یزید سے سنا ، وہ کہہ رہے تھے حضرت عائشہ رضی اللہ تعالیٰ عنہا نے فرمایا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو كَامِلٍ الْجَحْدَرِيُّ، كِلَاهُمَا عَنْ عَبْدِ الْوَاحِدِ بْنِ زِيَادٍ، قَالَ قُتَيْبَةُ: حَدَّثَنَا عَبْدُ الْوَاحِدِ، عَنِ الْحَسَنِ بْنِ عُبَيْدِ اللهِ، قَالَ: سَمِعْتُ إِبْرَاهِيمَ، يَقُولُ: سَمِعْتُ الْأَسْوَدَ بْنَ يَزِيدَ، يَقُولُ: قَالَتْ عَائِشَةُ رَضِيَ اللهُ عَنْهَا: «كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَجْتَهِدُ فِي الْعَشْرِ الْأَوَاخِرِ، مَا لَا يَجْتَهِدُ فِي غَيْرِهِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "15",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 115,
                    "chapterNumber": "15",
                    "chapterEnglish": "The Book of I'tikaaf",
                    "chapterUrdu": "اعتکاف کے احکام و مسائل",
                    "chapterArabic": "كتاب الِاعْتِكَافِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10353,
                "hadithNumber": "2789",
                "englishNarrator": "A'isha ( رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "I never saw the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) fasting in the ten days of Dhu'I-Hijja.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو ذی الحجہ کے دس دنوں میں روزے سے نہیں دیکھا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، ابو کریب اور اسحاق نے بیان کیا - اسحاق نے کہا: ہم سے انہوں نے بیان کیا اور باقی دو نے کہا: ہم سے اس نے بیان کیا ابو معاویہ نے اعمش سے ، انھوں نےابراہیم سے ، انھوں نے اسود سے ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے ر وایت کی ، ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا کہتی ہیں کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ وَإِسْحَاقُ - قَالَ إِسْحَاقُ: أَخْبَرَنَا، وَقَالَ الْآخَرَانِ: - حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الْأَسْوَدِ، عَنْ عَائِشَةَ رَضِيَ اللهُ عَنْهَا، قَالَتْ: «مَا رَأَيْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ صَائِمًا فِي الْعَشْرِ قَطُّ».",
                "headingArabic": "صَوْمِ عَشْرِ ذِي الْحِجَّةِ ‏",
                "headingUrdu": "ذوالحجہ کے (پہلے) عشرہ کے روزے رکھنا",
                "headingEnglish": "Fasting the (first) ten days of Dhul Hijjah",
                "chapterId": "15",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 115,
                    "chapterNumber": "15",
                    "chapterEnglish": "The Book of I'tikaaf",
                    "chapterUrdu": "اعتکاف کے احکام و مسائل",
                    "chapterArabic": "كتاب الِاعْتِكَافِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10354,
                "hadithNumber": "2790",
                "englishNarrator": "A'isha (رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) did not observe fast in the ten days of Dhul-Hijja.",
                "hadithUrdu": "اللہ کے رسول صلی اللہ علیہ وسلم نے کبھی ( ذوالحجہ کے ) دس دنوں میں روزے نہیں رکھے ۔",
                "urduNarrator": "مجھ سے ابوبکر بن نافع العبدی نے بیان کیا، ہم سے عبدالرحمٰن نے بیان کیا، ہم سے انہوں نے بیان کیا سفیان نے اعمش سے باقی ماندہ سابقہ سند کے ساتھ حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ الْعَبْدِيُّ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، عَنِ الْأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الْأَسْوَدِ، عَنْ عَائِشَةَ رَضِيَ اللهُ عَنْهَا: «أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لَمْ يَصُمِ الْعَشْرَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "15",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 115,
                    "chapterNumber": "15",
                    "chapterEnglish": "The Book of I'tikaaf",
                    "chapterUrdu": "اعتکاف کے احکام و مسائل",
                    "chapterArabic": "كتاب الِاعْتِكَافِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10355,
                "hadithNumber": "2791",
                "englishNarrator": "Ibn 'Umar (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "A person asked the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) what a Muhrim should put on as dress. Thereupon the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Do not put on a shirt or a turban, or trousers or a cap, or leather stockings except one who does not find shoes; he may put on stockings but he should trim them below the ankles. And do not wear clothes to which saffron or wars is applied.",
                "hadithUrdu": "ایک آدمی نے رسول اللہ صلی اللہ علیہ وسلم سے سوال کیا کہ احرام باندھنے والا کیسے کپڑے پہنے؟رسول اللہ صلی اللہ علیہ وسلم نے جواب دیا : \" نہ قمیص پہنو نہ عمامہ ، نہ شلوار ، نہ کوٹ ( ٹوپی جڑا لبادہ ) اور نہ موزے پہنو ، سوائے اس کے جسے جوتے میسر نہ ہوں وہ موزے پہن لے ، اور انھیں ٹخنوں کے نیچے تک کاٹ لے ۔ اور ایسا کپڑا نہ پہنو جسے کچھ بھی زعفران یا ورس ( زرد چولہ ) لگا ہو ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے مالک رضی اللہ عنہ سے پڑھا, نافع نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ رَضِيَ اللهُ عَنْهُمَا، أَنَّ رَجُلًا سَأَلَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: مَا يَلْبَسُ الْمُحْرِمُ مِنَ الثِّيَابِ؟ فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تَلْبَسُوا الْقُمُصَ، وَلَا الْعَمَائِمَ، وَلَا السَّرَاوِيلَاتِ، وَلَا الْبَرَانِسَ، وَلَا الْخِفَافَ، إِلَّا أَحَدٌ لَا يَجِدُ النَّعْلَيْنِ، فَلْيَلْبَسِ الْخُفَّيْنِ، وَلْيَقْطَعْهُمَا أَسْفَلَ مِنَ الْكَعْبَيْنِ، وَلَا تَلْبَسُوا مِنَ الثِّيَابِ شَيْئًا مَسَّهُ الزَّعْفَرَانُ وَلَا الْوَرْسُ».",
                "headingArabic": "مَا يُبَاحُ لِلْمُحْرِمِ بِحَجٍّ أَوْ عُمْرَةٍ وَمَا لاَ يُبَاحُ وَبَيَانِ تَحْرِيمِ الطِّيبِ عَلَيْهِ",
                "headingUrdu": "جس نے حج یا عمرہ کا احرام باندھا ہو اس کے لیے کیا پہننا جائز ہے اور کیا حلال نہیں اور خوشبو اس کے لیے حرام ہے؟",
                "headingEnglish": "What one who has entered Ihram for Hajj or Umrah is permitted to wear, and what is not permissible, and perfume is forbidden for him",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10356,
                "hadithNumber": "2792",
                "englishNarrator": "Salim reported on the authority of his father ('Abdullah bin 'Umar رضی اللہ تعالیٰ عنہ):",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was asked what a Muhrim should wear, whereupon he said: A Muhrim should not wear a shirt, or a turban, or a cap, or trousers, or a cloth touched with wars or with saffron, nor (should he wear) stockings, but in case he does not find shoes, but (before wearing stockings) be should trim them (in such a way) that these should become lower than the ankles.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم سے پوچھا گیا ، احرام باندھنے والا کیسا لباس پہنے؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" محرم نہ قمیص پہنے ، نہ عمامہ ، نہ ٹوپی جرا لبادہ ، نہ شلوار ، نہ ایسے کپڑے پہنے جسے ورس یا زعفرا ن لگاہو ، اور نہ موزے پہنے ، مگر جسے جوتے نہ ملیں تو ( وہ موزے پہن لے اور ) انھیں ( اوپر سے ) اتنا کاٹ ے کہ وہ ٹخنوں سے نیچے ہوجائیں ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ، عمرو الناقد اور زہیر بن حرب نے بیان کیا، ان سب نے ابن عیینہ کی سند سے کہا: سفیان بن عیینہ، الزہری کی سند پر، حضرت سالم نے اپنے والد ( ابن عمر رضی اللہ تعالیٰ عنہ ) سے روایت کی ، کہا",
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، كُلُّهُمْ عَنِ ابْنِ عُيَيْنَةَ، قَالَ يَحْيَى: أَخْبَرَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ رَضِيَ اللهُ عَنْهُ، قَالَ: سُئِلَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: مَا يَلْبَسُ الْمُحْرِمُ؟ قَالَ: «لَا يَلْبَسُ الْمُحْرِمُ الْقَمِيصَ، وَلَا الْعِمَامَةَ، وَلَا الْبُرْنُسَ، وَلَا السَّرَاوِيلَ، وَلَا ثَوْبًا مَسَّهُ وَرْسٌ وَلَا زَعْفَرَانٌ وَلَا الْخُفَّيْنِ، إِلَّا أَنْ لَا يَجِدَ نَعْلَيْنِ فَلْيَقْطَعْهُمَا، حَتَّى يَكُونَا أَسْفَلَ مِنَ الْكَعْبَيْنِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10357,
                "hadithNumber": "2793",
                "englishNarrator": "Ibn 'Umar رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade the Muhrim to put on a cloth dyed in saffron or wars and he further said: One who does not find shoes (to wear) he may wear stockings, but (only) after trimming them below the ankles.",
                "hadithUrdu": "اللہ کے رسول صلی اللہ علیہ وسلم نے احرام باندھنے والے کو زعفران یا ورس میں رنگے ہوئے کپڑے پہننے سے منع کیا ، نیز فرمایا؛ \" جو جوتے نہ پائے تو وہ موزے پہن لے اورانھیں ٹخنوں کےنیچے تک کاٹ لے ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا: میں نے مالک رضی اللہ عنہ سے پڑھا, عبداللہ بن دینار نے عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا کہ",
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ عَبْدِ اللهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ رَضِيَ اللهُ عَنْهُمَا، أَنَّهُ قَالَ: «نَهَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ يَلْبَسَ الْمُحْرِمُ ثَوْبًا مَصْبُوغًا بِزَعْفَرَانٍ أَوْ وَرْسٍ» وَقَالَ: «مَنْ لَمْ يَجِدْ نَعْلَيْنِ، فَلْيَلْبَسِ الْخُفَّيْنِ وَلْيَقْطَعْهُمَا أَسْفَلَ مِنَ الْكَعْبَيْنِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10358,
                "hadithNumber": "2794",
                "englishNarrator": "Ibn 'Abbas (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) say as he was delivering an address: So far as the trousers are concerned, one who does not find lower garment, he may wear them; as also socks, he may wear them who does not find shoes. It concerns the Muhrim.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو خطبہ دیتے ہوئے سنا ، آپ فرمارہے تھے : \" شلوار اس کے لئے ( جائز ) ہے جسے تہبند نہ ملے ، اور موزے اس کے لئے جسے جوتے میسر نہ ہو ، \" یعنی احرام باندھنے والے کے لئے ۔",
                "urduNarrator": "ہمیں یحییٰ بن یحییٰ، ابو الربیع الزہرانی اور قتیبہ بن سعید نے بیان کیا, حماد بن زید نے عمرو بن دینار سے ، انھوں نے جابر بن زید سے ، انھوں نے حضرت عبداللہ بن عباس رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو الرَّبِيعِ الزَّهْرَانِيُّ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، جَمِيعًا عَنْ حَمَّادٍ، قَالَ يَحْيَى: أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرٍو، عَنْ جَابِرِ بْنِ زَيْدٍ، عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا، قَالَ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَخْطُبُ يَقُولُ: «السَّرَاوِيلُ، لِمَنْ لَمْ يَجِدِ الْإِزَارَ وَالْخُفَّانِ، لِمَنْ لَمْ يَجِدِ النَّعْلَيْنِ» يَعْنِي الْمُحْرِمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10359,
                "hadithNumber": "2795",
                "englishNarrator": "Amr bin Dinar narrated with the same chain of transmitters:",
                "hadithEnglish": "He heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) delivering sermon at 'Arafat, and he made a mention of this hadith (as quoted above).",
                "hadithUrdu": "انھوں ( ابن عباس رضی اللہ تعالیٰ عنہ ) نے رسول اللہ صلی اللہ علیہ وسلم کو عرفات میں خطبہ دیتے سنا ، پھر یہی حدیث سنائی ۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا، کہا ہم سے محمد نے، یعنی ہم سے ابن جعفر نے بیان کیا، اور مجھ سے ابو غسان رازی نے بیان کیا، کہا کہ ہم سے بہز نے بیان کیا، انہوں نے کہا: ان سب نےشعبہ نے عمرو بن دینار سے یہ روایت اسی سندکے ساتھ بیان کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدٌ يَعْنِي ابْنَ جَعْفَرٍ، ح وحَدَّثَنِي أَبُو غَسَّانَ الرَّازِيُّ، حَدَّثَنَا بَهْزٌ، قَالَا: جَمِيعًا، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ دِينَارٍ، بِهَذَا الْإِسْنَادِ، أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ بِعَرَفَاتٍ فَذَكَرَ هَذَا الْحَدِيثَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10360,
                "hadithNumber": "2796",
                "englishNarrator": "This hadith has been narrated on the authority of 'Amr bin Dinar with the same chain of transmitters, but none of them (the narrators) made a mention:",
                "hadithEnglish": "He (the Holy Prophet) was delivering address at 'Arafat except Shu'ba.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم عرفات میں خطبہ ارشادفرمارہے تھے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، انہوں نے کہا ابن عینیہ ، ہشیم ، سفیان ثوری ، ابن جریج اور ایوب ( سختیانی ) ان تمام نے عمرو بن دینار سے مذکورہ سند کےساتھ روایت کی ، ان تمام میں سے اکیلے شعبہ کے علاوہ کسی نے یہ ذکر نہیں کیا کہ",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ح وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، ح وحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، ح وحَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، عَنِ ابْنِ جُرَيْجٍ، ح وحَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ، حَدَّثَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ كُلُّ هَؤُلَاءِ عَنْ عَمْرِو بْنِ دِينَارٍ، بِهَذَا الْإِسْنَادِ وَلَمْ يَذْكُرْ أَحَدٌ مِنْهُمْ يَخْطُبُ بِعَرَفَاتٍ غَيْرُ شُعْبَةَ وَحْدَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10361,
                "hadithNumber": "2797",
                "englishNarrator": "Jabir (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who does not find shoes to wear may wear socks, and he who does not find lower garment to wear may put on trousers.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \" جسے جوتے نہ ملیں وہ موزے پہن لے ، اور جسے تہبند نہ ملے وہ شلوار پہن لے ۔ \"",
                "urduNarrator": "ہم سے احمد بن عبداللہ بن یونس نے بیان کیا، ہم سے زہیر نے بیان کیا، ہم سے ابو الزبیر نے بیان کیا، حضرت جابر رضی اللہ تعالیٰ عنہ سے ر وایت ہے ، کہا",
                "hadithArabic": "وحَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللهِ بْنِ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ رَضِيَ اللهُ عَنْهُ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ لَمْ يَجِدْ نَعْلَيْنِ، فَلْيَلْبَسْ خُفَّيْنِ وَمَنْ لَمْ يَجِدْ إِزَارًا، فَلْيَلْبَسْ سَرَاوِيلَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10362,
                "hadithNumber": "2798",
                "englishNarrator": "Ya'la bin Umayya reported on the authority of his father (رضی اللہ تعالیٰ عنہ):",
                "hadithEnglish": "A person came to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as he was at Ji'rana and he (the person) had been putting on a cloak which was perfumed, or he (the narrator) said: There was a trace of yellowness on it. He said (to the Holy Prophet): What do you command me to do during my Umra? (It was at this juncture) that the revelation came to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and he was covered with a cloth, and Ya'la رضی اللہ تعالیٰ عنہ said: Would that I see revelation coming to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). He (Hadrat 'Umar رضی اللہ تعالیٰ عنہ) said: Would it please you to see the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) receiving the revelations 'Umar رضی اللہ تعالیٰ عنہ lifted a corner of the cloth and I looked at him and he was emitting a sound of snorting. He (the narrator) said: I thought it was the sound of a camel. When he was relieved of this he said: Where is he who asked about Umra? When the person came, the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Wash out the trace of yellowness, or he said: the trace of perfume and put off the cloak and do in your 'Umra what you do in your Hajj.",
                "hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم کے پاس ایک شخص حاضر ہوا ۔ ( اس وقت ) آپ صلی اللہ علیہ وسلم جعرانہ ( کے مقام ) پر تھے ، اس ( کے بدن ) پر جبہ تھا ، اس پر زعفران ملی خوشبو ( لگی ہوئی ) تھی ۔ یاکہا : زردی کا نشان تھا ۔ اس نے کہا : آپ مجھے میرے عمرے میں کیا کرنے کا حکم دیتے ہیں؟ ( یعلیٰ رضی اللہ تعالیٰ عنہ نے ) کہا : ( اتنے میں ) نبی صلی اللہ علیہ وسلم پر وحی اترنے لگی تو آپ صلی اللہ علیہ وسلم پرکپڑا تان دیا گیا ۔ یعلیٰ رضی اللہ تعالیٰ عنہ کہا کرتے تھے کہ میں نبی کریم صلی اللہ علیہ وسلم کو ( اس عالم میں ) دیکھوں جب آپ پروحی اتر رہی ہو ۔ ( یعلیٰ رضی اللہ تعالیٰ عنہ نے کہا : ) ( عمر رضی اللہ تعالیٰ عنہ ) کہنے لگے : کیاتمھیں پسند ہے کہ جب نبی کریم صلی اللہ علیہ وسلم پر وحی اتر رہی ہوتو تم انھیں دیکھو؟ ( یعلی رضی اللہ تعالیٰ عنہ نے ) کہا : عمر رضی اللہ تعالیٰ عنہ نے کپڑے کا ایک کنارا اٹھایا میں نے آپ صلی اللہ علیہ وسلم کی طرف دیکھا ۔ آپ صلی اللہ علیہ وسلم کے سانس لینے کی بھاری آواز آرہی تھی ۔ صفوان نے کہا : میرا گمان ہے انھوں نے کہا : ۔ ۔ ۔ جس طرح جوان اونٹ کے سانس کی آواز ہوتی ہے ۔ ( یعلیٰ رضی اللہ تعالیٰ عنہ نے ) کہا : جب آپ صلی اللہ علیہ وسلم کی یہ کیفیت دو ر ہوئی ( تو ) آپ صلی اللہ علیہ وسلم نے فرمایا : \" عمرے کے بارے میں سوال کرنے والا کہاں ہے؟ ( پھر اس نے فرمایا : ) تم اپنے ( کپڑوں ) سے زردی ( زعفران ) کا نشان ۔ ۔ ۔ یا فرمایا : خوشبو کا اثر ۔ ۔ دھو ڈالو ، اپنا جبہ اتار دو اور عمرے میں وہی کچھ کرو جو تم اپنے حج میں کرتے ہو ۔ \"",
                "urduNarrator": "ہم سے شیبان بن فروخ نے بیان کیا، انہوں نے بیان کیا ہمام نے کہا : ہمیں عطا ابن ابی رباح نے صفوان بن یعلیٰ بن امیہ سے حدیث بیان کی ، انھوں نے اپنے والد ( یعلیٰ بن امیہ تمیمی رضی اللہ تعالیٰ عنہ ) سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا عَطَاءُ بْنُ أَبِي رَبَاحٍ، عَنْ صَفْوَانَ بْنِ يَعْلَى بْنِ أُمَيَّةَ، عَنْ أَبِيهِ رَضِيَ اللهُ عَنْهُ، قَالَ: جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَهُوَ بِالْجِعْرَانَةِ، عَلَيْهِ جُبَّةٌ وَعَلَيْهَا خَلُوقٌ - أَوْ قَالَ أَثَرُ صُفْرَةٍ - فَقَالَ: كَيْفَ تَأْمُرُنِي أَنْ أَصْنَعَ فِي عُمْرَتِي؟ قَالَ: وَأُنْزِلَ عَلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الْوَحْيُ، فَسُتِرَ بِثَوْبٍ، وَكَانَ يَعْلَى يَقُولُ: وَدِدْتُ أَنِّي أَرَى النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَقَدْ نَزَلَ عَلَيْهِ الْوَحْيُ، قَالَ فَقَالَ: أَيَسُرُّكَ أَنْ تَنْظُرَ إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَقَدْ أُنْزِلَ عَلَيْهِ الْوَحْيُ؟ قَالَ: فَرَفَعَ عُمَرُ طَرَفَ الثَّوْبِ، فَنَظَرْتُ إِلَيْهِ لَهُ غَطِيطٌ، - قَالَ وَأَحْسَبُهُ قَالَ - كَغَطِيطِ الْبَكْرِ، قَالَ فَلَمَّا سُرِّيَ عَنْهُ قَالَ: «أَيْنَ السَّائِلُ عَنِ الْعُمْرَةِ؟ اغْسِلْ عَنْكَ أَثَرَ الصُّفْرَةِ - أَوْ قَالَ أَثَرَ الْخَلُوقِ - وَاخْلَعْ عَنْكَ جُبَّتَكَ، وَاصْنَعْ فِي عُمْرَتِكَ مَا أَنْتَ صَانِعٌ فِي حَجِّكَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10363,
                "hadithNumber": "2799",
                "englishNarrator": "Safwan bin Ya'la رضی اللہ تعالیٰ عنہ reported on the authority of his father (who said):",
                "hadithEnglish": "A person came to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as he was staying at Ji'rana and I (the narrator's father) was at that time in the apostle's ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) company and (the person) was donning a cloak having the marks of perfume on it, and he said: I am in a state of Ihram for the sake of Umra, and it (this cloak) is upon me and I am perfumed. The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to him: What would you do in your Hajj? He said: I would take off the clothes and would wash from me this perfume. Thereupon the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: What you do in your Hajj do it in your Umra.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم جعرانہ میں تھے ، آپ صلی اللہ علیہ وسلم کے پاس ایک شخص آیا ، میں ( یعلیٰ رضی اللہ تعالیٰ عنہ ) بھی آپ صلی اللہ علیہ وسلم کی خدمت میں موجود تھا ، اس ( کے بدن ) پر ٹکڑیوں والا ( لباس ) ، یعنی جبہ تھا وہ زعفران ملی خوشبوسے لت پت تھا ۔ اس نے کہا میں نے عمرے کا احرام باندھا ہے ۔ اور میرے جسم پر یہ لباس ہے ۔ اور میں نے خوشبو بھی لگائی ہے ۔ ( کیایہ درست ہے؟ ) نبی صلی اللہ علیہ وسلم نے اس سے فرمایا : \" تم اپنے حج میں کیا کرتے؟ \" اس نے کہا : میں یہ اپنے کپڑے اتار دیتا تو نبی کریم صلی اللہ علیہ وسلم نے اس سے فرمایا : \" جو تم اپنے حج میں کرتے ہو وہی اپنے عمرے میں کرو ۔ \"",
                "urduNarrator": "ہم سے ابن ابی عمر نے بیان کیا، انہوں نے کہا کہ ہم سے سفیان نے بیان کیا , عمرو بن دینار نے عطاء سے انھوں نے صفوان بن یعلیٰ رضی اللہ تعالیٰ عنہ سے ، انھوں نے اپنے والد سے روایت کی ، کہا",
                "hadithArabic": "وحَدَّثَنَا ابْنُ أَبِي عُمَرَ، قَالَ: حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ عَطَاءٍ، عَنْ صَفْوَانَ بْنِ يَعْلَى، عَنْ أَبِيهِ، قَالَ: أَتَى النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ رَجُلٌ وَهُوَ بِالْجِعْرَانَةِ، وَأَنَا عِنْدَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَيْهِ مُقَطَّعَاتٌ - يَعْنِي جُبَّةً - وَهُوَ مُتَضَمِّخٌ بِالْخَلُوقِ، فَقَالَ: إِنِّي أَحْرَمْتُ بِالْعُمْرَةِ وَعَلَيَّ هَذَا، وَأَنَا مُتَضَمِّخٌ بِالْخَلُوقِ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَا كُنْتَ صَانِعًا فِي حَجِّكَ؟» قَالَ: أَنْزِعُ عَنِّي هَذِهِ الثِّيَابَ، وَأَغْسِلُ عَنِّي هَذَا الْخَلُوقَ، فَقَالَ لَهُ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَا كُنْتَ صَانِعًا فِي حَجِّكَ، فَاصْنَعْهُ فِي عُمْرَتِكَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 10051,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=402",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=400",
                "label": "400",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=401",
                "label": "401",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=402",
                "label": "402",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=403",
                "label": "403",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=404",
                "label": "404",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=405",
                "label": "405",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=406",
                "label": "406",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=404",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=404",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=402",
        "to": 10075,
        "total": 40465
    }
}