{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 530,
        "data": [
            {
                "id": 13514,
                "hadithNumber": "5951",
                "englishNarrator": "Jabir bin 'Abdullah al-Ansari رضی اللہ عنہ :",
                "hadithEnglish": "Who was one amongst the Companions of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), reported that he went on an expedition along with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) towards Najd and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) stayed there, and when Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came back he also came back along with him. They, for one day, stayed for rest; the rest of the hadith is the same.",
                "hadithUrdu": "جو نبی کریم صلی اللہ علیہ وسلم کے صحابہ میں سے ہیں ، ان دونوں کو خبر دی کہ انھوں نے رسول اللہ صلی اللہ علیہ وسلم کی معیت میں نجد کی طرف ایک جنگ میں حصہ لیا ۔ جب رسول اللہ صلی اللہ علیہ وسلم واپس ہوئے تو وہ بھی آپ کے ساتھ واپس ہوئے ، ایک دن دوپہر کے آرام کا وقت ہوگیا ، اس کے بعد انھوں نے ابراہیم بن سعد اور معمر کی حدیث کی طرح بیان کیا ۔",
                "urduNarrator": "مجھ سے عبداللہ بن عبدالرحمٰن الدارمی اور ابوبکر بن اسحاق نے بیان کیا، کہا کہ ہم سے ابو الایمان نے بیان کیا,شعیب نے زہری سے روایت کی ، کہا : مجھے سنان بن ابی سنان دؤلی اور ابو سلمہ بن عبدالرحمن نے حدیث بیان کی کہ حضرت جابر بن عبداللہ انصاری رضی اللہ عنہ نے",
                "hadithArabic": "وحَدَّثَنِي عَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، وَأَبُو بَكْرِ بْنُ إِسْحَاقَ، قَالَا: أَخْبَرَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، حَدَّثَنِي سِنَانُ بْنُ أَبِي سِنَانٍ الدُّؤَلِيُّ، وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ جَابِرَ بْنَ عَبْدِ اللهِ الْأَنْصَارِيَّ وَكَانَ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَخْبَرَهُمَا، أَنَّهُ غَزَا مَعَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ غَزْوَةً قِبَلَ نَجْدٍ، فَلَمَّا قَفَلَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَفَلَ مَعَهُ، فَأَدْرَكَتْهُمُ الْقَائِلَةُ يَوْمًا، ثُمَّ ذَكَرَ نَحْوَ حَدِيثِ إِبْرَاهِيمَ بْنِ سَعْدٍ وَمَعْمَرٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13515,
                "hadithNumber": "5952",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "We went along with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and as we reached the place Dhat-ur-Riqa'; the rest of the hadith is the same, but there is no mention of the word that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) did not harm him.",
                "hadithUrdu": "جب ہم ذات الرقاع پہنچے ، ( پھر ) زہری کی حدیث کے ہم معنی روایت کی اور یہ نہیں کہا : پھر رسول اللہ صلی اللہ علیہ وسلم نے اس سے کوئی تعرض نہ فرمایا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے عفان نے بیان کیا، کہا ہم سے ابان بن یزید نے بیان کیا, یحییٰ بن ابی کثیر نے ابو سلمہ سے ، انھوں نے حضرت جابر رضی اللہ عنہ سے روایت کی ، کہا : ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ( واپس ) آئے ، یہاں تک کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا أَبَانُ بْنُ يَزِيدَ، حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ جَابِرٍ، قَالَ: أَقْبَلْنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حَتَّى إِذَا كُنَّا بِذَاتِ الرِّقَاعِ، بِمَعْنَى حَدِيثِ الزُّهْرِيِّ وَلَمْ يَذْكُرْ: ثُمَّ لَمْ يَعْرِضْ لَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13516,
                "hadithNumber": "5953",
                "englishNarrator": "Abu Musa reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The similitude of that guidance and knowledge with which Allah, the Exalted and Glorious, has sent me is that of rain falling upon the earth. There is a good piece of land which receives the rainfall (eagerly) and as a result of it there is grown in it herbage and grass abundantly. Then there is a land hard and barren which retains water and the people derive benefit from it and they drink it and make the animals drink. Then there is another land which is barren. Neither water is retained in it, nor is the grass grown in it. And that is the similitude of the first one who develops the understanding of the religion of Allah and it becomes a source of benefit to him with which Allah sent me. (The second one is that) who acquires the knowledge of religion and imparts it to others. (Then the other type is) one who does not pay attention to (the revealed knowledge) and thus does not accept guidance of Allah with which I have been sent.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : اس کی مثال جو اللہ نے مجھے ہدایت اور علم دیا ، ایسی ہے جیسے زمین پر بارش برسی اور اس ( زمین ) میں کچھ حصہ ایسا تھا جس نے پانی کو چوس لیا اور چارا اور بہت سا سبزہ اگایا ۔ اور اس کا کچھ حصہ کڑا سخت تھا ، اس نے پانی کو جمع رکھا ، پھر اللہ تعالیٰ نے اس ( پانی ) سے لوگوں کو فائدہ پہنچایا کہ انہوں نے اس میں سے پیا ، پلایا اور چرایا ۔ اور اس کا کچھ حصہ چٹیل میدان ہے کہ نہ تو پانی کو روکے اور نہ گھاس اگائے ۔ ( جیسے چکنی چٹان کہ پانی لگا اور چل دیا ) تو یہ اس کی مثال ہے کہ جس نے اللہ کے دین کو سمجھا اور اللہ نے اس کو اس چیز سے فائدہ دیا جو مجھے عطا فرمائی ، اس نے آپ بھی جانا اور دوسروں کو بھی سکھایا اور جس نے اس طرف سر نہ اٹھایا ( یعنی توجہ نہ کی ) اور اللہ کی ہدایت کو جس کو میں دے کر بھیجا گیا قبول نہ کیا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، ابو عامر اشعری اور محمد بن العلٰا نے بیان کیا اور یہ قول ابو عامر سے ہے انہوں نے کہا, سیدنا ابوموسیٰ اشعری رضی اللہ عنہ نبی کریم صلی اللہ علیہ وسلم سے روایت کرتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو عَامِرٍ الْأَشْعَرِيُّ، وَمُحَمَّدُ بْنُ الْعَلَاءِ - وَاللَّفْظُ لِأَبِي عَامِرٍ - قَالُوا: حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ مَثَلَ مَا بَعَثَنِيَ اللهُ بِهِ عَزَّ وَجَلَّ مِنَ الْهُدَى، وَالْعِلْمِ كَمَثَلِ غَيْثٍ أَصَابَ أَرْضًا، فَكَانَتْ مِنْهَا طَائِفَةٌ طَيِّبَةٌ، قَبِلَتِ الْمَاءَ فَأَنْبَتَتِ الْكَلَأَ وَالْعُشْبَ الْكَثِيرَ، وَكَانَ مِنْهَا أَجَادِبُ أَمْسَكَتِ الْمَاءَ، فَنَفَعَ اللهُ بِهَا النَّاسَ، فَشَرِبُوا مِنْهَا وَسَقَوْا وَرَعَوْا، وَأَصَابَ طَائِفَةً مِنْهَا أُخْرَى، إِنَّمَا هِيَ قِيعَانٌ لَا تُمْسِكُ مَاءً، وَلَا تُنْبِتُ كَلَأً، فَذَلِكَ مَثَلُ مَنْ فَقُهَ فِي دِينِ اللهِ، وَنَفَعَهُ بِمَا بَعَثَنِيَ اللهُ بِهِ، فَعَلِمَ وَعَلَّمَ، وَمَثَلُ مَنْ لَمْ يَرْفَعْ بِذَلِكَ رَأْسًا، وَلَمْ يَقْبَلْ هُدَى اللهِ الَّذِي أُرْسِلْتُ بِهِ».",
                "headingArabic": "بَيَانِ مَثَلِ مَا بُعِثَ بِهِ النَّبِيُّ صلى الله عليه وسلم مِنَ الْهُدَى وَالْعِلْمِ ‏‏",
                "headingUrdu": "اس ہدایت اور علم کی مثال جس کے ساتھ نبی صلی اللہ علیہ وسلم کو بھیجا گیا تھا۔",
                "headingEnglish": "The Likeness Of The Guidance And Knowledge With Which The Prophet (ﷺ) Was Sent",
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13517,
                "hadithNumber": "5954",
                "englishNarrator": "Abu Musa رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The similitude of mine and of that with which Allah sent me is that of a person who came to us and said: O people, I have seen an army with my eyes and I am a plain warner (and issue you warning) that you should immediately manage to find an escape. A group of people from amongst them paying heed (to his warning) fled to a place of protection and a group amongst them belied him and the morning overtook them in their houses and the army attacked them and killed them and they were routed. And that is the similitude of the one who obeyed me, followed with which I had been sent and the similitude of the other is of one who disobeyed and belied me and the Truth with which I have been sent.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : میری مثال اور میرے دین کی مثال جو کہ اللہ نے مجھے دے کر بھیجا ہے ، ایسی ہے جیسے اس شخص کی مثال جو اپنی قوم کے پاس آیا اور کہنے لگا کہ اے میری قوم! میں نے لشکر کو اپنی دونوں آنکھوں سے دیکھا ہے ( یعنی دشمن کی فوج کو ) اور میں صاف صاف ڈرانے والا ہوں ، پس جلدی بھاگو ۔ اب اس کی قوم میں سے بعض نے اس کا کہنا مانا اور وہ شام ہوتے ہی بھاگ گئے اور آرام سے چلے گئے اور بعض نے جھٹلایا اور وہ صبح تک اس ٹھکانے میں رہے اور صبح ہوتے ہی لشکر ان پر ٹوٹ پڑا اور ان کو تباہ کیا اور جڑ سے اکھیڑ دیا ۔ پس یہی اس شخص کی مثال ہے جس نے میری اطاعت کی اور جو کچھ میں لے کر آیا ہوں اس کی اتباع کی اور جس نے میرا کہنا نہ مانا اور سچے دین کو جھٹلایا ۔",
                "urduNarrator": "ہم سے عبداللہ بن براد اشعری اور ابو کریب نے بیان کیا - اور لفظ ابو کریب ہے - انہوں نے کہا: ہم سے ابو اسامہ نے بریدہ سے اور ابو کریب کی سند سے بیان کیا ، سیدنا ابوموسیٰ رضی اللہ عنہ نبی کریم صلی اللہ علیہ وسلم سے روایت کرتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللهِ بْنُ بَرَّادٍ الْأَشْعَرِيُّ، وَأَبُو كُرَيْبٍ - وَاللَّفْظُ لِأَبِي كُرَيْبٍ - قَالَا: حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: إِنَّ مَثَلِي وَمَثَلَ مَا بَعَثَنِيَ اللهُ بِهِ كَمَثَلِ رَجُلٍ أَتَى قَوْمَهُ، فَقَالَ: يَا قَوْمِ إِنِّي رَأَيْتُ الْجَيْشَ بِعَيْنَيَّ، وَإِنِّي أَنَا النَّذِيرُ الْعُرْيَانُ، فَالنَّجَاءَ، فَأَطَاعَهُ طَائِفَةٌ مِنْ قَوْمِهِ، فَأَدْلَجُوا فَانْطَلَقُوا عَلَى مُهْلَتِهِمْ، وَكَذَّبَتْ طَائِفَةٌ مِنْهُمْ فَأَصْبَحُوا مَكَانَهُمْ، فَصَبَّحَهُمُ الْجَيْشُ فَأَهْلَكَهُمْ وَاجْتَاحَهُمْ، فَذَلِكَ مَثَلُ مَنْ أَطَاعَنِي وَاتَّبَعَ مَا جِئْتُ بِهِ، وَمَثَلُ مَنْ عَصَانِي وَكَذَّبَ مَا جِئْتُ بِهِ مِنَ الْحَقِّ حَدَّثَنَا عَبْدُ اللهِ بْنُ بَرَّادٍ الْأَشْعَرِيُّ، وَأَبُو كُرَيْبٍ - وَاللَّفْظُ لِأَبِي كُرَيْبٍ - قَالَا: حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: إِنَّ مَثَلِي وَمَثَلَ مَا بَعَثَنِيَ اللهُ بِهِ كَمَثَلِ رَجُلٍ أَتَى قَوْمَهُ، فَقَالَ: يَا قَوْمِ إِنِّي رَأَيْتُ الْجَيْشَ بِعَيْنَيَّ، وَإِنِّي أَنَا النَّذِيرُ الْعُرْيَانُ، فَالنَّجَاءَ، فَأَطَاعَهُ طَائِفَةٌ مِنْ قَوْمِهِ، فَأَدْلَجُوا فَانْطَلَقُوا عَلَى مُهْلَتِهِمْ، وَكَذَّبَتْ طَائِفَةٌ مِنْهُمْ فَأَصْبَحُوا مَكَانَهُمْ، فَصَبَّحَهُمُ الْجَيْشُ فَأَهْلَكَهُمْ وَاجْتَاحَهُمْ، فَذَلِكَ مَثَلُ مَنْ أَطَاعَنِي وَاتَّبَعَ مَا جِئْتُ بِهِ، وَمَثَلُ مَنْ عَصَانِي وَكَذَّبَ مَا جِئْتُ بِهِ مِنَ الْحَقِّ.",
                "headingArabic": "شَفَقَتِهِ صلى الله عليه وسلم عَلَى أُمَّتِهِ وَمُبَالَغَتِهِ فِي تَحْذِيرِهِمْ مِمَّا يَضُرُّهُمْ ‏",
                "headingUrdu": "اس کی امت کے تئیں اس کی ہمدردی، اور اس کی شدید تشویش ان کو ان چیزوں کے خلاف خبردار کرنے کے لیے جو انہیں نقصان پہنچا سکتی ہے۔",
                "headingEnglish": "His Compassion Towards His Ummah, And His Intense Concern To Warn Them Against That Which May Harm Them",
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13518,
                "hadithNumber": "5955",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The similitude of mine and that of my Umma is that of a person who lit fire and there began to fall into it insects and moths. And I am there to hold you back, but you plunge into it.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" میری اور میری امت کی مثال اس شخص کی طرح ہے جس نے آگ روشن کی تو حشرات الارض اور پتنگے اس آگ میں گرنے لگے ۔ تو میں تم کو کمر سے پکڑ کر روکنے والا ہوں اور تم زبردستی اس میں گرتے جارہے ہو ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, مغیرہ بن عبدالرحمن قرشی نے ہمیں ابو زناد سے حدیث بیان کی ، انھوں نے اعرج سے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ الْقُرَشِيُّ، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّمَا مَثَلِي وَمَثَلُ أُمَّتِي كَمَثَلِ رَجُلٍ اسْتَوْقَدَ نَارًا، فَجَعَلَتِ الدَّوَابُّ وَالْفَرَاشُ يَقَعْنَ فِيهِ، فَأَنَا آخِذٌ بِحُجَزِكُمْ وَأَنْتُمْ تَقَحَّمُونَ فِيهِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13519,
                "hadithNumber": "5956",
                "englishNarrator": null,
                "hadithEnglish": "A similar report (as no. 5955) was narrated from Abu Az-Zinnad with this chain.",
                "hadithUrdu": "ہم سے عمرو ناقد اور ابن ابی عمر نے بیان کیا، کہا: سفیان نے ابو زناد سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَاهُ عَمْرٌو النَّاقِدُ، وَابْنُ أَبِي عُمَرَ، قَالَا: حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزِّنَادِ بِهَذَا الْإِسْنَادِ نَحْوَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13520,
                "hadithNumber": "5957",
                "englishNarrator": "Hammam bin Munabbih reported:",
                "hadithEnglish": "Abu Huraira رضی اللہ عنہ reported us some ahadith from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) amongst many, (and) one is this that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: A person lit fire and when the atmosphere was aglow, moths and insects began to fall into the fire, but I am there to hold them back, but they are plunging into it despite my efforts, and he further added: That is your example and mine. I am there to hold you back from fire and to save you from it, but you are plunging into it despite my efforts.",
                "hadithUrdu": "یہ احادیث ہیں جو ابوہریرہ رضی اللہ عنہ نے ہمیں رسول سے بیان کیں ۔ انھوں نے کئی احادیث بیان کیں ، ان میں سے ایک یہ ہے : اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : کہ میری مثال اس شخص کی سی ہے جس نے آگ جلائی ، جب اس کے گرد روشنی ہوئی تو اس میں کیڑے اور یہ جانور جو آگ میں ہیں ، گرنے لگے اور وہ شخص ان کو روکنے لگا ، لیکن وہ نہ رکے اور اس میں گرنے لگے ۔ یہ مثال ہے میری اور تمہاری ، میں تمہاری کمر پکڑ کر جہنم سے روکتا ہوں اور کہتا ہوں کہ جہنم کے پاس سے چلے آؤ اور تم نہیں مانتے اسی میں گھسے جاتے ہو ۔",
                "urduNarrator": "ہم سے محمد بن رافع نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، کہا ہم سے معمر نے بیان کیا, ہمام بن منبہ نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ: هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ أَحَادِيثَ مِنْهَا، وَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَثَلِي كَمَثَلِ رَجُلٍ اسْتَوْقَدَ نَارًا، فَلَمَّا أَضَاءَتْ مَا حَوْلَهَا جَعَلَ الْفَرَاشُ وَهَذِهِ الدَّوَابُّ الَّتِي فِي النَّارِ يَقَعْنَ فِيهَا، وَجَعَلَ يَحْجُزُهُنَّ وَيَغْلِبْنَهُ فَيَتَقَحَّمْنَ فِيهَا، قَالَ فَذَلِكُمْ مَثَلِي وَمَثَلُكُمْ، أَنَا آخِذٌ بِحُجَزِكُمْ عَنِ النَّارِ، هَلُمَّ عَنِ النَّارِ، هَلُمَّ عَنِ النَّارِ فَتَغْلِبُونِي تَقَحَّمُونَ فِيهَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13521,
                "hadithNumber": "5958",
                "englishNarrator": "Jabir bin Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying. My example and your example is that of a person who lit the fire and insects and moths began to fall in it and he would be making efforts to take them out, and I am going to hold you back from fire, but you are slipping from my hand.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \" میری اور تمھاری مثال اس شخص جیسی ہے جس نے آگ جلائی تو مکڑے اور پتنگے اس میں گرنے لگے ۔ وہ شخص ہے کہ ان کو اس سے روک رہا ہے ، میں تمھاری کمروں پر پکڑ کر تمھیں آگ سے ہٹا رہا ہوں اور تم ہو کہ م میرے ہاتھوں سے نکلے جارہے ہو ۔ \"",
                "urduNarrator": "مجھ سے محمد بن حاتم نے بیان کیا، ہم سے ابن مہدی نے بیان کیا، ہم سے سلیم نے سعید بن منیٰ سے بیان کیا، حضرت جابر رضی اللہ عنہ سے روایت ہے ، کہا",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا ابْنُ مَهْدِيٍّ، حَدَّثَنَا سَلِيمٌ، عَنْ سَعِيدِ بْنِ مِينَاءَ، عَنْ جَابِرٍ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَثَلِي وَمَثَلُكُمْ كَمَثَلِ رَجُلٍ أَوْقَدَ نَارًا، فَجَعَلَ الْجَنَادِبُ وَالْفَرَاشُ يَقَعْنَ فِيهَا، وَهُوَ يَذُبُّهُنَّ عَنْهَا، وَأَنَا آخِذٌ بِحُجَزِكُمْ عَنِ النَّارِ، وَأَنْتُمْ تَفَلَّتُونَ مِنْ يَدِي».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13522,
                "hadithNumber": "5959",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The similitude of mine and that of the Apostles (before me) is that of a person who constructed a building and he built it fine and well and the people went round it saying: Never have we seen a building more imposing than this. but for one brick, and I am that brick (with which you give the finishing touch to the building).",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" میری اور دوسرے پیغمبروں کی مثال جو کہ میرے سے پہلے ہو چکے ہیں ، ایسی ہے جیسے کسی شخص نے گھر بنایا اور اس کی زیبائش اور آرائش کی ، لیکن اس کے کونوں میں سے ایک کونے میں ایک اینٹ کی جگہ چھوڑ دی پس لوگ اس کے گرد پھرنے لگے اور انہیں وہ عمارت پسند آئی اور وہ کہنے لگے کہ یہ تو نے ایک اینٹ یہاں کیوں نہ رکھ دی گئی؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ میں وہ اینٹ ہوں ۔",
                "urduNarrator": "ہم سے عمرو بن محمد ناقد نے بیان کیا، ہم سے سفیان بن عیینہ نے بیان کیا، ابو الزناد سے, اعرج نے حضرت ابوہریرہ رضی اللہ عنہ سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ مُحَمَّدٍ النَّاقِدُ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: مَثَلِي وَمَثَلُ الْأَنْبِيَاءِ كَمَثَلِ رَجُلٍ بَنَى بُنْيَانًا فَأَحْسَنَهُ وَأَجْمَلَهُ، فَجَعَلَ النَّاسُ يُطِيفُونَ بِهِ، يَقُولُونَ: مَا رَأَيْنَا بُنْيَانًا أَحْسَنَ مِنْ هَذَا، إِلَّا هَذِهِ اللَّبِنَةَ، فَكُنْتُ أَنَا تِلْكَ اللَّبِنَةَ.",
                "headingArabic": "ذِكْرِ كَوْنِهِ صلى الله عليه وسلم خَاتَمَ النَّبِيِّينَ ‏‏",
                "headingUrdu": "آپ خاتم النبیین تھے۔",
                "headingEnglish": "He (SAW) Was The Seal Of The Prophets",
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13523,
                "hadithNumber": "5960",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: The similitude of mine and that of the Apostles before me is that of a person who built a house quite imposing and beautiful and he made it complete but for one brick in one of its corners. People began to walk round it, and the building pleased them and they would say: But for this brick your building would have been perfect. Muhammad ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: And I am that final brick.",
                "hadithUrdu": "ابو القاسم نے فرمایا : \" میری اور مجھ سے پہلے انبیاء علیہ السلام کی مثال اس شخص کی طرح ہے جس نے ( ایک عمارت میں ) کئی گھر بنائے ، انھیں بہت اچھا ، بہت خوبصورت بنایا اور اس کے کونوں میں سے ایک کونے میں ، ایک اینٹ کی جگہ کے سوا اس ( پوری عمارت ) کو اچھی طرح مکمل کردیا ، لوگ اس کے ارد گرد گھومنے لگے وہ عمارت انھیں بہت اچھی لگتی اور وہ کہتے : آپ نے اس جگہ ایک اینٹ کیوں نہ لگادی تاکہ تمھاری عمارت مکمل ہوجاتی ۔ \" تو محمد صلی اللہ علیہ وسلم نے فرمایا : \" میں ہی وہ اینٹ تھا ( جس کے لگ جانے کے بعد وہ عمارت مکمل ہوگئی ۔ ) \"",
                "urduNarrator": "ہم سے محمد بن رافع نے بیان کیا، ہم سے عبدالرزاق نے بیان کیا، معمر نے ہمیں ہمام بن منبہ سے حدیث بیان کی ، کہا : یہ ( احادیث ) ہمیں ابو ہریرہ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے بیان کیں ، انھوں نے کئی احادیث بیان کیں ، ان میں سے ایک یہ ہے کہ",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ: هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ أَحَادِيثَ مِنْهَا، وَقَالَ: أَبُو الْقَاسِمِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: مَثَلِي وَمَثَلُ الْأَنْبِيَاءِ مِنْ قَبْلِي كَمَثَلِ رَجُلٍ ابْتَنَى بُيُوتًا فَأَحْسَنَهَا وَأَجْمَلَهَا وَأَكْمَلَهَا، إِلَّا مَوْضِعَ لَبِنَةٍ مِنْ زَاوِيَةٍ مِنْ زَوَايَاهَا، فَجَعَلَ النَّاسُ يَطُوفُونَ وَيُعْجِبُهُمُ الْبُنْيَانُ فَيَقُولُونَ: أَلَّا وَضَعْتَ هَاهُنَا لَبِنَةً فَيَتِمَّ بُنْيَانُكَ فَقَالَ مُحَمَّدٌ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «فَكُنْتُ أَنَا اللَّبِنَةَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13524,
                "hadithNumber": "5961",
                "englishNarrator": "Abu Hurairah رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: The similitude of mine and that of the Apostles before me is that of a person who built a house quite imposing and beautiful, but for one brick in one of its corners. People would go round it, appreciating the building, but saying: Why has the brick not been fixed here? He said: I am that brick and I am the last of the Apostles.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" : میری اور دوسرے پیغمبروں کی مثال جو کہ میرے سے پہلے ہو چکے ہیں ، ایسی ہے جیسے کسی شخص نے گھر بنایا اور اس کی زیبائش اور آرائش کی ، لیکن اس کے کونوں میں سے ایک کونے میں ایک اینٹ کی جگہ چھوڑ دی پس لوگ اس کے گرد پھرنے لگے اور انہیں وہ عمارت پسند آئی اور وہ کہنے لگے کہ یہ تو نے ایک اینٹ یہاں کیوں نہ رکھ دی گئی؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ میں وہ اینٹ ہوں اور میں خاتم الانبیاء ہوں ۔",
                "urduNarrator": "ہم سے یحییٰ بن ایوب، قتیبہ اور ابن حجر نے بیان کیا، کہا: ہم سے اسماعیل، یعنی ابن جعفر نے، عبداللہ بن دینار کی سند سے بیان کیا, ابو صالح سمان نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ حُجْرٍ، قَالُوا: حَدَّثَنَا إِسْمَاعِيلُ يَعْنُونَ ابْنَ جَعْفَرٍ، عَنْ عَبْدِ اللهِ بْنِ دِينَارٍ، عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: مَثَلِي وَمَثَلُ الْأَنْبِيَاءِ مِنْ قَبْلِي كَمَثَلِ رَجُلٍ بَنَى بُنْيَانًا فَأَحْسَنَهُ وَأَجْمَلَهُ، إِلَّا مَوْضِعَ لَبِنَةٍ مِنْ زَاوِيَةٍ مِنْ زَوَايَاهُ، فَجَعَلَ النَّاسُ يَطُوفُونَ بِهِ وَيَعْجَبُونَ لَهُ وَيَقُولُونَ: هَلَّا وُضِعَتْ هَذِهِ اللَّبِنَةُ قَالَ فَأَنَا اللَّبِنَةُ، وَأَنَا خَاتَمُ النَّبِيِّينَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13525,
                "hadithNumber": "5962",
                "englishNarrator": "Abu Sa'id رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The similitude of mine and that of the Apostles; the rest of the hadith is the same.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \" میری اور ( سابقہ ) انبیاء علیہ السلام کی مثال \" پھر اسی ( سابقہ حدیث کی ) طرح حدیث بیان کی ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، کہا کہ ہم سے ابو معاویہ نے اعمش کی سند سے اور ابو صالح کی سند سے بیان کیا, حضرت ابو سعید خدری رضی اللہ عنہ سے روایت ہے ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، قَالَا: حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي سَعِيدٍ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَثَلِي وَمَثَلُ النَّبِيِّينَ» فَذَكَرَ نَحْوَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13526,
                "hadithNumber": "5963",
                "englishNarrator": "Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The similitude of mine and that of the Apostles is like that of a person who built a house and he completed it and made it perfect but for the space of a brick. People entered therein and they were surprised at it and said: Had there been a brick (it would have been complete in all respects). Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: I am that place where the brick (completing the building is to be placed), and I have come to finalise the chain of Apostles.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا؛ \" میری اور ( مجھ سے پہلے ) انبیاء علیہ السلام کی مثال اس شخص کی طرح ہے جس نے ایک گھر بنایا اور ایک اینٹ کی جگہ کے سوا اس ( سارے گھر ) کو پورا کردیا اور اچھی طرح مکمل کردیا ۔ لوگ اس میں داخل ہوتے ، اس ( کی خوبصورتی ) پر حیران ہوتے اور کہتے : کاش!اس اینٹ کی جگہ ( خالی ) نہ ہوتی! \" رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اس اینٹ کی جگہ ( کو پرکرنے والا ) میں ہوں ، میں آیا تو انبیاء علیہ السلام کے سلسلے کو مکمل کردیا ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, عفان نے ہمیں حدیث بیان کی ، کہا : ہمیں سلیم بن حیان نے حدیث بیان کی ، کہا : ہمیں سعید بن میناء نے حضرت جابر رضی اللہ عنہ سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا سَلِيمُ بْنُ حَيَّانَ، حَدَّثَنَا سَعِيدُ بْنُ مِينَاءَ، عَنْ جَابِرٍ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: مَثَلِي وَمَثَلُ الْأَنْبِيَاءِ، كَمَثَلِ رَجُلٍ بَنَى دَارًا فَأَتَمَّهَا وَأَكْمَلَهَا إِلَّا مَوْضِعَ لَبِنَةٍ، فَجَعَلَ النَّاسُ يَدْخُلُونَهَا وَيَتَعَجَّبُونَ مِنْهَا، وَيَقُولُونَ: لَوْلَا مَوْضِعُ اللَّبِنَةِ قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «فَأَنَا مَوْضِعُ اللَّبِنَةِ، جِئْتُ فَخَتَمْتُ الْأَنْبِيَاءَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13527,
                "hadithNumber": "5964",
                "englishNarrator": null,
                "hadithEnglish": "Salim narrated a similar report with this chain of narrators, and instead of saying 'made it complete' he said 'made it beautiful.'",
                "hadithUrdu": "مجھ سے محمد بن حاتم نے کہا, ابن مہدی نے کہا , ہمیں سلیم نے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ۔ اور \" اسے پورا کیا \" کے بجائے \" اسے خوبصورت بنایا \" کہا ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِيهِ مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا ابْنُ مَهْدِيٍّ، حَدَّثَنَا سَلِيمٌ بِهَذَا الْإِسْنَادِ مِثْلَهُ، وَقَالَ بَدَلَ - أَتَمَّهَا - أَحْسَنَهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13528,
                "hadithNumber": "5965",
                "englishNarrator": "Abu Musa رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When Allah, the Exalted and Glorious, intends to show mercy to an Umma from amongst His servants He calls back His Apostle to his eternal home and makes him a harbinger and recompense in the world to come; and when He intends to cause destruction to an Umma, He punishes it while its Apostle is alive and He destroys it as he (the Apostle) witnesses it and he cools his eyes by destruction as they had belied him and disobeyed his command",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نےفرمایا؛ \" جب اللہ تعالیٰ اپنے بندوں میں سے ایک اُمت پر رحمت کرنا چاہتاہے تو وہ اس امت سے پہلے اس کے نبی کو اٹھا لیتا ہے اور اسے ( امت ) سے آگےپہلے پہنچنے والا ، ( اس کا ) پیش رو بنادیتاہے ۔ اور جب وہ کسی امت کو ہلاک کرنا چاہتاہےتو اسے اس کے نبی کی زندگی میں عذاب میں مبتلا کردیتا ہے اوراس کی نظروں کے سامنے انھیں ہلاک کرتاہے ۔ انھوں نے جو اس کو جھٹلایا تھا اور اس کے حکم کی نافرمانی کی تھی تو وہ انھیں ہلاک کرکے اس ( نبی ) کی آنکھیں ٹھنڈی کرتاہے ۔ \"",
                "urduNarrator": "میں نے ابواسامہ کی سند سے بیان کیا، اور ان سے روایت کرنے والوں میں سے ابراہیم بن سعید الجوہری تھے، ہم سے ابواسامہ نے بیان کیا، مجھ سے برید بن عبداللہ نے بیان کیا، ابو بردہ رضی اللہ عنہ سے مروی ہے, حضرت ابوموسیٰ رضی اللہ عنہ سے روایت ہے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "وَحُدِّثْتُ عَنْ أَبِي أُسَامَةَ، وَمِمَّنْ رَوَى ذَلِكَ عَنْهُ إِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنِي بُرَيْدُ بْنُ عَبْدِ اللهِ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ اللهَ عَزَّ وَجَلَّ إِذَا أَرَادَ رَحْمَةَ أُمَّةٍ مِنْ عِبَادِهِ، قَبَضَ نَبِيَّهَا قَبْلَهَا، فَجَعَلَهُ لَهَا فَرَطًا وَسَلَفًا بَيْنَ يَدَيْهَا، وَإِذَا أَرَادَ هَلَكَةَ أُمَّةٍ، عَذَّبَهَا وَنَبِيُّهَا حَيٌّ، فَأَهْلَكَهَا وَهُوَ يَنْظُرُ، فَأَقَرَّ عَيْنَهُ بِهَلَكَتِهَا حِينَ كَذَّبُوهُ وَعَصَوْا أَمْرَهُ».",
                "headingArabic": "إِذَا أَرَادَ اللَّهُ تَعَالَى رَحْمَةَ أُمَّةٍ قَبَضَ نَبِيَّهَا قَبْلَهَا",
                "headingUrdu": "جب اللہ کسی قوم پر رحم کرنا چاہتا ہے تو ان کے نبی کو ان سے پہلے لے جاتا ہے۔",
                "headingEnglish": "When Allah Wants To Show Mercy To A Nation, He takes Their Prophet Before Them",
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13529,
                "hadithNumber": "5966",
                "englishNarrator": "Jundab رضی اللہ عنہ reported:",
                "hadithEnglish": "I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: I shall be there at the Cistern before you.",
                "hadithUrdu": "میں نے نبی اکرم صلی اللہ علیہ وسلم سے سنا ، آپ فرمارہے تھے : \" میں حوض پرتمھارا پیش رو ہوں ۔ \"",
                "urduNarrator": "مجھ سے احمد بن عبداللہ بن یونس نے کہا, ہمیں زائدہ نے حدیث سنائی ، کہا : ہمیں عبدالمطلب بن عمیر نے حدیث بیان کی ، کہا : میں نے حضرت جندب ( بن عبداللہ بجلی رضی اللہ عنہ ) کو یہ کہتے ہوئے سنا کہ",
                "hadithArabic": "حَدَّثَنِي أَحْمَدُ بْنُ عَبْدِ اللهِ بْنِ يُونُسَ، حَدَّثَنَا زَائِدَةُ، حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عُمَيْرٍ، قَالَ: سَمِعْتُ جُنْدَبًا، يَقُولُ: سَمِعْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «أَنَا فَرَطُكُمْ عَلَى الْحَوْضِ».",
                "headingArabic": "إِثْبَاتِ حَوْضِ نَبِيِّنَا صلى الله عليه وسلم وَصِفَاتِهِ ‏‏",
                "headingUrdu": "ہمارے نبی صلی اللہ علیہ وسلم کا حوض اور اس کی صفات",
                "headingEnglish": "The Cistern Of Our Prophet (SAW) And Its Attributes",
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13530,
                "hadithNumber": "5967",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Jundab رضی اللہ عنہ through another chain of transmitters.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے وکیع نے بیان کیا، ہم سے ابو کریب نے بیان کیا، ہم سے ابن بشر نے بیان کیا, مسعر اور شعبہ دونوں نے عبدالملک بن عمیر سے ، انھوں نے حضرت جندب رضی اللہ عنہ سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے ا س کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا ابْنُ بِشْرٍ جَمِيعًا، عَنْ مِسْعَرٍ، ح وَحَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَا: حَدَّثَنَا شُعْبَةُ كِلَاهُمَا، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ جُنْدَبٍ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13531,
                "hadithNumber": "5968",
                "englishNarrator": "Sahl (bin Sa'd) رضی اللہ عنہ reported:",
                "hadithEnglish": "I heard Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: I shall go to the Cistern before you and he who comes would drink and he who drinks would never feel thirsty, and there would come to me people whom I would know and who would know me. Then there would be intervention between me and them. Abu Hazim said that Nu'man bin Abu 'Ayyash heard it and I narrated to them this hadith, and said: Is it this that you heard Sahl رضی اللہ عنہ saying? He said: Yes, and I bear witness to the fact that I heard it from Abu Sa'id Khudri also, but he made this addition that he (the Holy Prophet ﷺ) would say: They are my followers, and it would be said to him: You do not know what they did after you and I will say to them: Woe to him who changes (his religion) after me.",
                "hadithUrdu": "میں نے حضرت سہل رضی اللہ عنہ ( ابن سعد ساعدی ) سے سنا ، کہہ رہے تھے : میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم فرمارہے تھے : \"\" میں تم سے پہلے اپنے حوض پر پہنچنے والا ہوں ، جو اس حوض پر پینے کے لئے آجائے گا ، پی لے گا اور جو پی لے گا وہ کبھی پیا سا نہیں ہوگا ۔ میرے پاس بہت سے لوگ آئیں گے میں انھیں جانتا ہوں گا ، وہ مجھے جانتے ہوں گے ، پھر میرے اور ان کے درمیان ر کاوٹ حائل کردی جائے گی ۔ \"\" ابوحازم نے کہا : میں یہ حدیث ( سننے والوں کو ) سنا رہا تھا کہ نعمان بن ابی عیاش نے بھی یہ حدیث سنی تو کہنے لگے : آپ نے سہل رضی اللہ عنہ کو اسی طرح کہتے ہوئے سنا ہے؟میں نے کہا : جی ہاں ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, یعقوب بن عبدالرحمن القاری نے ابو حازم سے ر وایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْقَارِيَّ، عَنْ أَبِي حَازِمٍ، قَالَ: سَمِعْتُ سَهْلًا، يَقُولُ: سَمِعْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «أَنَا فَرَطُكُمْ عَلَى الْحَوْضِ، مَنْ وَرَدَ شَرِبَ، وَمَنْ شَرِبَ لَمْ يَظْمَأْ أَبَدًا، وَلَيَرِدَنَّ عَلَيَّ أَقْوَامٌ أَعْرِفُهُمْ وَيَعْرِفُونِي، ثُمَّ يُحَالُ بَيْنِي وَبَيْنَهُمْ» قَالَ أَبُو حَازِمٍ: فَسَمِعَ النُّعْمَانُ بْنُ أَبِي عَيَّاشٍ وَأَنَا أُحَدِّثُهُمْ هَذَا الْحَدِيثَ، فَقَالَ: هَكَذَا سَمِعْتَ سَهْلًا يَقُولُ؟ قَالَ فَقُلْتُ: نَعَمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13532,
                "hadithNumber": "5969",
                "englishNarrator": "And I bear witness that I heard Abu Saeed Al-Khudri add something and say:",
                "hadithEnglish": "(The Messenger of Allah ﷺ and said): \"They belong to me.\" But it will be said: \"You do not know what they did after you were gone.\" And I will say: \"Away, away with the one who changed (the religion) after I was gone.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم فرمائیں گے : \" یہ میرے ( لوگ ) ہیں تو کہا جائے گا : آپ نہیں جانتے کہ انھوں نے آپ کے بعد کیا کیا ۔ تو میں کہوں گا : دوری ہو ، ہلاکت ہو!ان کے لئے جنھوں نے میرے بعد ( دین میں ) تبدیلی کردی ۔ \"",
                "urduNarrator": "انھوں ( نعمان بن ابی عیاش ) نے کہا : اور میں گواہی دیتا ہوں کہ میں نے حضرت ابو سعید خدری سے سنا ، وہ اس ( حدیث ) میں مزید یہ بیان کرتے تھےکہ",
                "hadithArabic": "قَالَ وَأَنَا أَشْهَدُ عَلَى أَبِي سَعِيدٍ الْخُدْرِيِّ لَسَمِعْتُهُ يَزِيدُ فَيَقُولُ «إِنَّهُمْ مِنِّي»، فَيُقَالُ: إِنَّكَ لَا تَدْرِي مَا عَمِلُوا بَعْدَكَ، فَأَقُولُ: «سُحْقًا سُحْقًا لِمَنْ بَدَّلَ بَعْدِي».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13533,
                "hadithNumber": "5970",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Abu Sa'id Khudri رضی اللہ عنہ through another chain of transmitters.",
                "hadithUrdu": "ہم سے ہارون بن سعید العیلی نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، کہا کہ مجھ سےابو اسامہ نے ابو حازم سے ، انھوں نے سہل رضی اللہ عنہ سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سےاور ( دوسری سند کے ساتھ ابو حازم نے ) نعمان بن ابی عیاش سے ، انھوں نے حضرت ابو سعید خدری رضی اللہ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے یعقوب ( بن عبدالرحمن القاری ) کی حدیث کے مانند بیا ن کیا ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي أُسَامَةُ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلٍ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَنِ النُّعْمَانِ بْنِ أَبِي عَيَّاشٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ يَعْقُوبَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13534,
                "hadithNumber": "5971",
                "englishNarrator": "`Abdullah bin `Amr al-`As رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: My Cistern (is as wide and broad that it requires) a month's journey (to go round it) all, and its sides are equal and its water is whiter than silver, and its odour is more fragrant than the fragrance of musk, and its jugs (placed around it) are like stars in the sky; and he who would drink from it would never feel thirsty after that.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \" میر احوض ( لمبائی چوڑائی میں ) ایک ماہ کی مسافت کے برابر ہے اور اس کے ( چاروں ) کنارے برابر ہیں ( مربع ہے ) ، اس کاپانی چاندی سے زیادہ چمکدار ، اور اس کی خوشبو کستوری سے زیادہ معطر ہے ، اس کے کوزے آسمان کےستاروں جتنے ہیں ۔ جو شخص اس میں سے پی لے گا ، اسے اس کے بعد کبھی پیاس نہیں لگے گی ۔ \"",
                "urduNarrator": "ہم سے داؤد بن عمرو الضّبی نے بیان کیا, نافع بن عمر جحمی نے ابن ابی ملیکہ سے روایت کی ، کہا : حضرت عبداللہ بن عمرو بن عاص رضی اللہ عنہ نے کہا کہ",
                "hadithArabic": "وَحَدَّثَنَا دَاوُدُ بْنُ عَمْرٍو الضَّبِّيُّ، حَدَّثَنَا نَافِعُ بْنُ عُمَرَ الْجُمَحِيُّ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، قَالَ: قَالَ عَبْدُ اللهِ بْنُ عَمْرِو بْنِ الْعَاصِ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «حَوْضِي مَسِيرَةُ شَهْرٍ، وَزَوَايَاهُ سَوَاءٌ، وَمَاؤُهُ أَبْيَضُ مِنَ الْوَرِقِ، وَرِيحُهُ أَطْيَبُ مِنَ الْمِسْكِ، وَكِيزَانُهُ كَنُجُومِ السَّمَاءِ، فَمَنْ شَرِبَ مِنْهُ فَلَا يَظْمَأُ بَعْدَهُ أَبَدًا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13535,
                "hadithNumber": "5972",
                "englishNarrator": "Asma' daughter of Abu Bakr رضی اللہ عنہا said:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: I would be on the Cistern so that I would be seeing those who would be coming to me from you, but some people would be detained (before reaching me). I would say: My Lord, they are my followers and belong to my Ummah, and it would be said to me: Do you know what they did after you? By Allah, they did not do good after you, and they turned back upon their heels. He (the narrator) said: lbn Abu Mulaika used to say (in supplication): O Allah, I seek refuge with Thee that we should turn back upon our heels or put to any trial about our religion.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" حوض میں ( موجود ) میں ہوں گا تا کہ دیکھوں کہ تم میں سے کو ن میرے پاس آتا ہے ، کچھ لوگوں کو مجھ ( تک پہنچنے ) سے پہلے ہی پکڑ لیا جا ئے گا ۔ تو میں کہوں گا : اے میرے رب !یہ میرے ہیں میری امت میں سے ہیں ۔ تو کہا جا ئے گا ، آپ کو معلوم نہیں کہ آپ کے بعد انھوں نے کیا ( کچھ ) کیا؟آپ کے بعد انھوں نے اپنی ایڑیوں پرواپس گھومنے میں ( ذرا ) دیر نہیں کی ۔ ( نافع نے ) کہا : ابن ابی ملیکہ یہ دعا کرتے تھے : \" اے اللہ !ہم اس بات سے تیری پناہ میں آتے ہیں کہ ہم اپنی ایڑیوں پر پلٹ جا ئیں یا ہمیں کسی آزمائش میں دال کر اپنے دین سے ہٹا دیا جا ئے ۔ \"",
                "urduNarrator": "حضرت اسماءبنت ابی بکر رضی اللہ عنہا نے کہا  کہ",
                "hadithArabic": "وَقَالَتْ: أَسْمَاءُ بِنْتُ أَبِي بَكْرٍ قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: إِنِّي عَلَى الْحَوْضِ حَتَّى أَنْظُرَ مَنْ يَرِدُ عَلَيَّ مِنْكُمْ، وَسَيُؤْخَذُ أُنَاسٌ دُونِي، فَأَقُولُ: يَا رَبِّ مِنِّي وَمِنْ أُمَّتِي، فَيُقَالُ: أَمَا شَعَرْتَ مَا عَمِلُوا بَعْدَكَ؟ وَاللهِ مَا بَرِحُوا بَعْدَكَ يَرْجِعُونَ عَلَى أَعْقَابِهِمْ قَالَ: فَكَانَ ابْنُ أَبِي مُلَيْكَةَ يَقُولُ: «اللهُمَّ إِنَّا نَعُوذُ بِكَ أَنْ نَرْجِعَ عَلَى أَعْقَابِنَا أَوْ أَنْ نُفْتَنَ عَنْ دِينِنَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13536,
                "hadithNumber": "5973",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) say in the company of his Companions: I would be on the Cistern waiting for those who would be coming to me from amongst you. By Allah, some persons would be prevented from coming to me, and I would say: My Lord, they are my followers and people of my Umma. And He would say,: You don't know what they did after you; they had been constantly turning back on their heels (from their religion).",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ صحابہ کرام رضوان اللہ عنھم اجمعین کے ساتھ تھے اور فرما رہے تھے ۔ : \" میں حوض پر ہوں گا ۔ انتظار کر رہا ہو ں گا کہ پاس پینے کے لیے کون آتا ہے ۔ اللہ کی قسم! مجھ ( تک پہنچنے ) سے پہلے کچھ لو گوں کو کا ٹ ( کر الگ کر ) دیا جا ئےگا ، تو میں کہوں گا : میرے رب! ( یہ ) میرے ہیں میری امت میں سے ہیں ۔ تو اللہ تعا لیٰ فرما ئے گا ، آپ نے جا نتے کہ انھوں نے آپ کے بعد کیا کیا ؟یہ مسلسل اپنی ایڑیوں پر پلٹتے رہے ۔",
                "urduNarrator": "ہم سے ابن ابی عمر نے بیان کیا، کہا ہم سے یحییٰ بن سلیم نے بیان کیا، انہوں نے ابن خثم سے، وہ عبداللہ بن عبید اللہ بن ابی ملیکہ سے کہ انہوں نے سنا, حضرت عائشہ رضی اللہ عنہا کہتی ہیں کہ",
                "hadithArabic": "وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا يَحْيَى بْنُ سُلَيْمٍ، عَنِ ابْنِ خُثَيْمٍ، عَنْ عَبْدِ اللهِ بْنِ عُبَيْدِ اللهِ بْنِ أَبِي مُلَيْكَةَ، أَنَّهُ سَمِعَ عَائِشَةَ، تَقُولُ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: وَهُوَ بَيْنَ ظَهْرَانَيْ أَصْحَابِهِ إِنِّي عَلَى الْحَوْضِ أَنْتَظِرُ مَنْ يَرِدُ عَلَيَّ مِنْكُمْ، فَوَاللهِ لَيُقْتَطَعَنَّ دُونِي رِجَالٌ، فَلَأَقُولَنَّ: أَيْ رَبِّ مِنِّي وَمِنْ أُمَّتِي، فَيَقُولُ: «إِنَّكَ لَا تَدْرِي مَا عَمِلُوا بَعْدَكَ، مَا زَالُوا يَرْجِعُونَ عَلَى أَعْقَابِهِمْ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13537,
                "hadithNumber": "5974",
                "englishNarrator": "Umm Salama رضی اللہ عنہا the wife of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), said:",
                "hadithEnglish": "I used to hear from people making a mention of the Cistern, but I did not hear about it from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). One day while a girl was combing me I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) say: O people. I said to that girl: Keep away from me. She said: He (the Holy Prophet) has addressed the men only and he has not invited the attention of the women. I said: I am amongst the people also (and have thus every right to listen to the things pertaining to religion). Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: I shall be your harbinger on the Cistern; therefore, be cautious lest one of you should come (to me) and may be driven away like a stray camel. I would ask the reasons, and it would be said to me: You don't know what innovations they made after you. And I would then also say: Be away.",
                "hadithUrdu": "میں لو گوں سے سنتی تھی کہ وہ حوض ( کوثر ) کا ذکر کرتے تھے ۔ میں نے یہ بات خود رسول اللہ صلی اللہ علیہ وسلم سے نہیں سنی تھی ، پھر ان ( میری باری کے ) دنوں میں سے ایک دن ہوا ۔ اور خادمہ میری کنگھی کر رہی تھی کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ کہتے ہو ئے سنا : \" اے لوگو! \" میں نے خادمہ سے کہا : مجھ سے پیچھے ہٹ جاؤ !وہ کہنے لگی ، آپ صلی اللہ علیہ وسلم نے مردوں کو پکا را ( مخاطب فر ما یا ) ہے عورتوں کو نہیں ۔ میں نے کہا : میں بھی لوگوں میں سے ہوں ( صرف مرد ہی لو گ نہیں ہو تے ) تو رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" میں حوض پر تمھارا پیش رو ہوں گا ۔ میرے پاس تم میں سے کو ئی اس طرح نہ آئے کہ اسے مجھ سے دور دھکیلا جا رہا ہو ، جس طرح بھٹکے ہو ئے اونٹ کو ( ریوڑ سے ) اور دور دھکیلا جا تا ہے ۔ میں پوچھوں گا ۔ یہ کس وجہ سے ہو رہا ہے؟ تو کہا جا ئے گا ۔ آپ نہیں جا نتے کہ انھوں نے آپ کے بعد ( دین میں ) کیا نئے کا م نکا لے تھے ۔ تو میں کہوں گا دوری ہو! \"",
                "urduNarrator": "مجھ سے یونس بن عبد الاعلی الصدفی نے بیان کیا، مجھ سے عبداللہ بن وہب نے بیان کیا، مجھ سے عمرو نے جو ابن حارث ہیں، بیان کیا: بکیر نے قاسم بن عباس ہاشمی سے روایت کی ، انھوں نےحضرت ام سلمہ رضی اللہ عنہا کے مولیٰ عبید اللہ بن رافع سے ، انھوں نے نبی صلی اللہ علیہ وسلم کی اہلیہ حضرت ام سلمہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي يُونُسُ بْنُ عَبْدِ الْأَعْلَى الصَّدَفِيُّ، أَخْبَرَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو وَهُوَ ابْنُ الْحَارِثِ أَنَّ بُكَيْرًا، حَدَّثَهُ عَنِ الْقَاسِمِ بْنِ عَبَّاسٍ الْهَاشِمِيِّ، عَنْ عَبْدِ اللهِ بْنِ رَافِعٍ، مَوْلَى أُمِّ سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، زَوْجِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، أَنَّهَا قَالَتْ: كُنْتُ أَسْمَعُ النَّاسَ يَذْكُرُونَ الْحَوْضَ، وَلَمْ أَسْمَعْ ذَلِكَ مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَلَمَّا كَانَ يَوْمًا مِنْ ذَلِكَ، وَالْجَارِيَةُ تَمْشُطُنِي، فَسَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «أَيُّهَا النَّاسُ» فَقُلْتُ لِلْجَارِيَةِ: اسْتَأْخِرِي عَنِّي، قَالَتْ: إِنَّمَا دَعَا الرِّجَالَ وَلَمْ يَدْعُ النِّسَاءَ، فَقُلْتُ: إِنِّي مِنَ النَّاسِ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: إِنِّي لَكُمْ فَرَطٌ عَلَى الْحَوْضِ، فَإِيَّايَ لَا يَأْتِيَنَّ أَحَدُكُمْ فَيُذَبُّ عَنِّي كَمَا يُذَبُّ الْبَعِيرُ الضَّالُّ، فَأَقُولُ: فِيمَ هَذَا؟ فَيُقَالُ: إِنَّكَ لَا تَدْرِي مَا أَحْدَثُوا بَعْدَكَ، فَأَقُولُ: سُحْقًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13538,
                "hadithNumber": "5975",
                "englishNarrator": "Umm Salama رضی اللہ عنہا reported:",
                "hadithEnglish": "She heard Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saying this as he was sitting on the pulpit and she was getting her hair combed. (He uttered these words): O people. And she said to one who was combing: Leave my head; the rest of the hadith is the same.",
                "hadithUrdu": "انھوں نے نبی صلی اللہ علیہ وسلم کو منبر پر یہ فرما تے ہو ئے سنا ، اس وقت وہ کنگھی کرارہی تھیں ، ( آپ صلی اللہ علیہ وسلم نے فرمایا ) \" اے لوگو! \" انھوں نے اپنی کنگھی کرنے والی سے کہا : میرا سر چھوڑ دو! جس طرح بکیر نے قاسم بن عباس سے حدیث بیان کی ۔",
                "urduNarrator": "مجھ سے ابو معن الرقاشی، ابوبکر بن نافع اور عبد بن حمید نے بیان کیا، انہوں نے کہا: ابو عامر جو کہ عبد الملک بن عمرو ہیں، نے کہا: ہمیں افلح بن سعید نے حدیث بیان کی کہا : ہمیں عبد اللہ بن رافع نے حدیث سنائی ، کہا؛ حضرت ام سلمہ رضی اللہ عنہا بیان کیا کرتی تھیں کہ",
                "hadithArabic": "وحَدَّثَنِي أَبُو مَعْنٍ الرَّقَاشِيُّ، وَأَبُو بَكْرِ بْنُ نَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالُوا: حَدَّثَنَا أَبُو عَامِرٍ وَهُوَ عَبْدُ الْمَلِكِ بْنُ عَمْرٍو، حَدَّثَنَا أَفْلَحُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ اللهِ بْنُ رَافِعٍ، قَالَ: كَانَتْ أُمُّ سَلَمَةَ تُحَدِّثُ، أَنَّهَا سَمِعَتِ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ عَلَى الْمِنْبَرِ، وَهِيَ تَمْتَشِطُ: «أَيُّهَا النَّاسُ» فَقَالَتْ لِمَاشِطَتِهَا: كُفِّي رَأْسِي، بِنَحْوِ حَدِيثِ بُكَيْرٍ، عَنِ الْقَاسِمِ بْنِ عَبَّاسٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 13226,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=529",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=527",
                "label": "527",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=528",
                "label": "528",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=529",
                "label": "529",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=530",
                "label": "530",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=531",
                "label": "531",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=532",
                "label": "532",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=533",
                "label": "533",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=531",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=531",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=529",
        "to": 13250,
        "total": 40465
    }
}