{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 419,
        "data": [
            {
                "id": 10739,
                "hadithNumber": "3175",
                "englishNarrator": "Abu Huraira (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to us as we were at Mina: We would observe halt tomorrow at-Khaif of Banu Kinanah, where (the polytheists) had taken an oath on unbelief, and that was that the Quraish and Banu Kinanah had, pledged against Banu Hashim and Banu Muttalib that they would neither marry nor do any transaction with them unless they deliver Allah's Messenger (way peace be upon him) to them. And (this pledge was) taken at this (place) Muhassab.",
                "hadithUrdu": "ہم منیٰ میں تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں فر ما یا کل ہم خیف بنو کنا نہ میں قیام کر یں گے جہا ں انھوں ( قر یش ) نے آپس میں مل کر کفر پر ( ڈٹے رہنے کی ) قسم کھا ئی تھی ۔ واقعہ یہ تھا کہ قریش اور بنو کنا نہ نے بنو ہاشم اور بنو مطلب کے خلاف ایک دوسرے کے ساتھ معاہدہ کیا تھا کہ وہ نہ ان سے شادی بیاہ کریں گے نہ ان سے لین دین کریں گے ۔ یہاں تک کہ وہ رسول اللہ صلی اللہ علیہ وسلم کو ان کے حوالے کردیں ۔ اس ( خیف بنی کنانہ ) سے آپ کی مراد وادی محصب تھی ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے ولید بن مسلم نے بیان کیا، اوزاعی نے حدیث بیان کی ، ( کہا ) مجھے زہری نے حدیث سنا ئی ہے ( کہا ) مجھ سے ابو سلمہ نے حدیث بیان کی کہا : ہمیں حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ نے حدیث بیان کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنِي الْأَوْزَاعِيُّ، حَدَّثَنِي الزُّهْرِيُّ، حَدَّثَنِي أَبُو سَلَمَةَ، حَدَّثَنَا أَبُو هُرَيْرَةَ، قَالَ: قَالَ لَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَنَحْنُ بِمِنًى: «نَحْنُ نَازِلُونَ غَدًا بِخَيْفِ بَنِي كِنَانَةَ، حَيْثُ تَقَاسَمُوا عَلَى الْكُفْرِ» وَذَلِكَ إِنَّ قُرَيْشًا وَبَنِي كِنَانَةَ تَحَالَفَتْ عَلَى بَنِي هَاشِمٍ وَبَنِي الْمُطَّلِبِ أَنْ لَا يُنَاكِحُوهُمْ وَلَا يُبَايِعُوهُمْ، حَتَّى يُسْلِمُوا إِلَيْهِمْ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَعْنِي بِذَلِكَ، الْمُحَصَّبَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10740,
                "hadithNumber": "3176",
                "englishNarrator": "Abu Huraira (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: God willing, when Allah has granted us victory, our halt tomorrow will be at Khaif, where they (the unbelievers of Mecca) had taken an oath on unbelief.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فر ما یا ان شاء اللہ جب اللہ نے فتح دی تو ہمارا قیام خیف ( محصب ) میں ہو گا ۔ جہاں انھوں ( قریش ) نے باہم مل کر کفر پر ( قائم رہنے کی قسم کھا ئی تھی ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، مجھے شبابہ نے بیان کیا، مجھ سے ورقہ نے بیان کیا، ابو الزناد کی سند سے, اعرج نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی",
                "hadithArabic": "وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنِي وَرْقَاءُ، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «مَنْزِلُنَا إِنْ شَاءَ اللهُ، إِذَا فَتَحَ اللهُ الْخَيْفُ، حَيْثُ تَقَاسَمُوا عَلَى الْكُفْرِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10741,
                "hadithNumber": "3177",
                "englishNarrator": "Ibn Umar (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Al-'A'bbas bin Abdul-Muttalib ( رضی اللہ تعالیٰ عنہ) sought permission from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) to spend in Mecca the nights (which be was required to spend) at Mina on account of his office of supplier of water, and he (the Holy Prophet) granted him permission.",
                "hadithUrdu": "حضرت عباس بن المطلب رضی اللہ تعالیٰ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے اجازت مانگی کہ وہ ( زمزم پر حاجیوں کو ) پا نی پلانے کے لیے منیٰ کی را تیں مکہ میں گزار لیں؟ تو آپ نے انھیں اجا زت دے دی.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے ابن نمیر اور ابو اسامہ نے بیان کیا، انہوں نے کہا: ہم سے عبید اللہ نے نافع سے اور ابن عمر رضی اللہ عنہما سے اور انہوں نے ہم سے بیان کیا۔ ( محمد بن عبد اللہ ) بن نمیر اور ابو اسامہ دو نوں نے کہا ہمیں عبید اللہ نے حدیث بیان کی اور ابن نمیر نے ۔ ۔ ۔ الفا ظ انھی کے ہیں ۔ ۔ ۔ اپنے والد کے واسطے سے بھی عبید اللہ سے روایت کی کہا : مجھے نافع نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے حدیث بیان کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ نُمَيْرٍ، وَأَبُو أُسَامَةَ، قَالَا: حَدَّثَنَا عُبَيْدُ اللهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، ح وحَدَّثَنَا ابْنُ نُمَيْرٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللهِ، حَدَّثَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، «أَنَّ الْعَبَّاسَ بْنَ عَبْدِ الْمُطَّلِبِ، اسْتَأْذَنَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، أَنْ يَبِيتَ بِمَكَّةَ لَيَالِي مِنًى، مِنْ أَجْلِ سِقَايَتِهِ، فَأَذِنَ لَهُ».",
                "headingArabic": "وُجُوبِ الْمَبِيتِ بِمِنًى لَيَالِيَ أَيَّامِ التَّشْرِيقِ وَالتَّرْخِيصِ فِي تَرْكِهِ لأَهْلِ السِّقَايَةِ",
                "headingUrdu": "ایام تشریق کی راتوں میں منیٰ میں رات گزارنا واجب ہے، اور پانی فراہم کرنے والوں کو باہر جانے کی اجازت ہے۔",
                "headingEnglish": "It is obligatory to stay overnight in Mina during the nights of the days of At-Tashriq, and the concession allowing those who supply water to leave",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10742,
                "hadithNumber": "3178",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been narrated by 'Ubaidullah bin Umar with the the same chain of transmitters.",
                "hadithUrdu": "اور ہم سے اسحاق بن ابراہیم نے بیان کیا، انہوں نے بیان کیا عیسیٰ بن یو نس اور ابن جریج دونوں نے عبید اللہ بن عمر ( بن حفص ) سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَاه إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، ح وحَدَّثَنِيهِ مُحَمَّدُ بْنُ حَاتِمٍ، وَعَبْدُ بْنُ حُمَيْدٍ، جَمِيعًا عَنْ مُحَمَّدِ بْنِ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، كِلَاهُمَا عَنْ عُبَيْدِ اللهِ بْنِ عُمَرَ، بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10743,
                "hadithNumber": "3179",
                "englishNarrator": "Bakr bin 'Abdullah al-Muzani said:",
                "hadithEnglish": "While I was sitting along with Ibn 'Abbas ( رضی اللہ تعالیٰ عنہ) near the Ka'ba, there came a bedouin to him and said: What is the matter that I see that the progeny of your uncle supply honey and milk (as drink to the travellers), whereas you supply al-nabidh (water sweetened with dates)? Is it due to your poverty or due to your close-fistedness? Thereupon Ibn 'Abbas رضی اللہ تعالیٰ عنہ said: Allah be praised, it is neither due to poverty nor due to close-fistedness (but due to the fact) that Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came here riding his she-came, and there was sitting behind him Usama  رضی اللہ تعالیٰ عنہ . He asked for water, and we gave him a cup full of nabidh and he drank it, and gave the remaining (part) to Usama; and he (the Holy Prophet ﷺ) said: You have done Food, You have done well. So continue doing like it So we do not like to change what Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had commanded us to do.",
                "hadithUrdu": "میں کعبہ کے پاس حضرت ابن عبا س رضی اللہ تعالیٰ عنہ کے ساتھ بیٹھا ہو اتھا کہ ان کے پا س ایک دیہاتی آیا اور کہنے لگا : کہا وجہ ہے میں دیکھتا ہوں کہ تمھا رے چچا زاد ( حاجیوں کو ) دودھ اور شہد پلا تے ہیں اور تم نبیذ پلا تے ہو ؟ یہ تمھیں لا حق حاجت مندی کی وجہ سے ہے یا بخیلی کی وجہ سے ؟ حضرت ابن عباس رضی اللہ تعالیٰ عنہ نے جواب دیا الحمد اللہ نہ ہمیں حاجت مندی لا حق ہے اور نہ بخیلی ( اصل بات یہ ہے کہ ) نبی اکرم صلی اللہ علیہ وسلم اپنی سواری پر ( سوار ہو کر ) تشریف لا ئے اور آپ کے پیچھے اسامہ رضی اللہ تعالیٰ عنہ سوار تھے آپ نے پانی طلب فر ما یا تو ہم نے آپ کو نبیذ کا ایک برتن پیش کیا آپ نے خود پیا اور باقی ماندہ اسامہ رضی اللہ تعالیٰ عنہ کو پلا یا اور فر ما یا : \" تم لوگوں نے اچھا کیا اور بہت خوب کیا اسی طرح کرتے رہنا ۔ لہٰذا ہم نہیں چا ہتے کہ جس کا کا رسول اللہ صلی اللہ علیہ وسلم نے حکم دیا ہم اسے بدل دیں ۔",
                "urduNarrator": "مجھ سے محمد بن المنہال الضدیر نے بیان کیا، ہم سے یزید بن زریع نے بیان کیا، ہم سے حمید الطویل نے بیان کیا، بکر بن عبد اللہ مزنی نے کہا",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ الْمِنْهَالِ الضَّرِيرُ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا حُمَيْدٌ الطَّوِيلُ، عَنْ بَكْرِ بْنِ عَبْدِ اللهِ الْمُزَنِيِّ، قَالَ: كُنْتُ جَالِسًا مَعَ ابْنِ عَبَّاسٍ عِنْدَ الْكَعْبَةِ، فَأَتَاهُ أَعْرَابِيٌّ فَقَالَ: مَا لِي أَرَى بَنِي عَمِّكُمْ يَسْقُونَ الْعَسَلَ وَاللَّبَنَ وَأَنْتُمْ تَسْقُونَ النَّبِيذَ؟ أَمِنْ حَاجَةٍ بِكُمْ أَمْ مِنْ بُخْلٍ؟ فَقَالَ ابْنُ عَبَّاسٍ: الْحَمْدُ لِلَّهِ، مَا بِنَا مِنْ حَاجَةٍ وَلَا بُخْلٍ، قَدِمَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى رَاحِلَتِهِ وَخَلْفَهُ أُسَامَةُ، فَاسْتَسْقَى فَأَتَيْنَاهُ بِإِنَاءٍ مِنْ نَبِيذٍ فَشَرِبَ، وَسَقَى فَضْلَهُ أُسَامَةَ، وَقَالَ: «أَحْسَنْتُمْ وَأَجْمَلْتُمْ، كَذَا فَاصْنَعُوا» فَلَا نُرِيدُ تَغْيِيرَ مَا أَمَرَ بِهِ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": "فضل القيام بالسقاية والثناء على أهلها واستحباب الشرب منها",
                "headingUrdu": "پانی فراہم کرنے کی فضیلت اور ایسا کرنے والوں کی تعریف، اور اس میں سے پینا مستحب ہے۔",
                "headingEnglish": "The virtue Supplying water nd praise for those who do that, and it is recommended to drink from it.",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10744,
                "hadithNumber": "3180",
                "englishNarrator": "Ali (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) put me in charge of his sacrificial animals, that I should give their flesh. skins and saddle cloths as sadaqa, but not to give anything to the butcher, saying: We would pay him ourselves.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے مجھے حکم دیا کہ میں آپ کے قر با نی کے اونٹوں کی نگرا نی کروں اور یہ کہ ان گو کا گو شت کھا لیں اور جھولیں صدقہ کروں نیز ان میں سے قصاب کو بطور اجرتکچھ بھی ) نہ دو ں آپ صلی اللہ علیہ وسلم نے فر ما یا : \" ہم اس کو اپنے پاس سے ( اجرت ) دیں گے ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے بیان کیا ابو خثیمہ نے ہمیں عبد الکریم سے خبر دی انھوں نے مجاہدسے انھوں نے عبد الرحمٰن بن ابی لیلیٰ سے اور انھوں نے حضرت علی رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو خَيْثَمَةَ، عَنْ عَبْدِ الْكَرِيمِ، عَنْ مُجَاهِدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ عَلِيٍّ، قَالَ: «أَمَرَنِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ أَقُومَ عَلَى بُدْنِهِ، وَأَنْ أَتَصَدَّقَ بِلَحْمِهَا وَجُلُودِهَا وَأَجِلَّتِهَا، وَأَنْ لَا أُعْطِيَ الْجَزَّارَ مِنْهَا»، قَالَ: «نَحْنُ نُعْطِيهِ مِنْ عِنْدِنَا».",
                "headingArabic": "الصدقة بلحوم الهدايا وجلودها وجلالها وأن لا يعطي الجزار منها شيا وجواز الاستنابة في القيام عليها",
                "headingUrdu": "ہدی کا گوشت، کھال اور کمبل صدقہ کرنا؛ قصاب کو اس میں سے کچھ نہ دیا جائے۔ قربانی کے لیے کسی دوسرے کو سپرد کرنا جائز ہے۔",
                "headingEnglish": "Giving the meat, skin and blankets of the Hadi in charity; the butcher should not be given any of it; It is permissible to delegate someone else to offer the sacrifice",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10745,
                "hadithNumber": "3181",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Abdul-Karim al-Jazari with the same chain of transmitters.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ، عمرو ناقد اور زہیر بن حرب نے بیان کیا، انہوں نے کہا ابن عیینہ نے عبد الکریم جزری سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالُوا: حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنْ عَبْدِ الْكَرِيمِ الْجَزَرِيِّ، بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10746,
                "hadithNumber": "3182",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of 'Ali (Allah be pleased with him) with another chain of transmitters, but there is no mention of the wages of the butcher in it.",
                "hadithUrdu": "ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سےسفیان اور ہشام دونوں نے ابن ابی نجیح انھوں نے مجاہد سے باقی ماندہ سابقہ سند کے ساتھ نبی صلی اللہ علیہ وسلم سے روایت کی ان دونوں کی حدیث میں قصاب کی اجرت کا ذکر نہیں ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا سُفْيَانُ، وَقَالَ إِسْحَاقُ بْنُ إِبْرَاهِيمَ: أَخْبَرَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ: أَخْبَرَنِي أَبِي، كِلَاهُمَا عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ أَبِي لَيْلَى، عَنْ عَلِيٍّ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَلَيْسَ فِي حَدِيثِهِمَا أَجْرُ الْجَازِرِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10747,
                "hadithNumber": "3183",
                "englishNarrator": "Ali bin Abi Talib ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) put him in charge of his sacrificial animals, and commanded him to distribute the whole of their meat, hides, and saddle cloths to the poor, and not to give to the butcher anything out of them.",
                "hadithUrdu": "اللہ کے نبی صلی اللہ علیہ وسلم نے انھیں حکم دیا کہ وہ آپ کی قر بانی کے اونٹوں کی نگرانی کریں اور انھیں حکم دیا کہ آپ کی پو ری قر با نیوں کو ( یعنی ) ان کے گو شت کھالوں اور ( ان کی پشت پر ڈالی ہو ئی ) جھولوں کو مسکینوں میں تقسیم کر دیں اور ان میں سے کچھ بھی ذبح کی اجرت کے طور پر نہ دیں ۔",
                "urduNarrator": "مجھ سے محمد بن حاتم بن میمون، محمد بن مرزوق اور عبد بن حمید نے بیان کیا - عبد نے کہا: اس نے ہم سے بیان کیا، اور باقی دو نے کہا: - ہم سے محمد نے بیان کیا۔ ہم سے ابن بکر، ابن جریج نے بیان کیا، انہوں نے مجھ سے بیان کیا حسن بن مسلم نے خبر دی کہ انھیں مجا ہد نے خبر دی انھیں عبد الرحمٰن بن ابی لیلیٰ نے خبردی انھیں علی بن ابی طا لب رضی اللہ عنہ نے خبردی کہ",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمِ بْنِ مَيْمُونٍ، وَمُحَمَّدُ بْنُ مَرْزُوقٍ، وَعَبْدُ بْنُ حُمَيْدٍ، - قَالَ عَبْدٌ: أَخْبَرَنَا، وقَالَ الْآخَرَانِ: - حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي الْحَسَنُ بْنُ مُسْلِمٍ، أَنَّ مُجَاهِدًا، أَخْبَرَهُ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ أَبِي لَيْلَى، أَخْبَرَهُ أَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ، أَخْبَرَهُ: «أَنَّ نَبِيَّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَمَرَهُ أَنْ يَقُومَ عَلَى بُدْنِهِ، وَأَمَرَهُ أَنْ يَقْسِمَ بُدْنَهُ كُلَّهَا، لُحُومَهَا وَجُلُودَهَا وَجِلَالَهَا، فِي الْمَسَاكِينِ وَلَا يُعْطِيَ فِي جِزَارَتِهَا مِنْهَا شَيْئًا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10748,
                "hadithNumber": "3184",
                "englishNarrator": null,
                "hadithEnglish": "Ali bin Abi Talib narrate that the prophet ﷺ told him a similar report.",
                "hadithUrdu": "مجھ سے محمد بن حاتم نے بیان کیا، کہا ہم سے محمد بن بکر نے بیان کیا، کہا ہم سے ابن جریج نے بیان کیا، کہا کہ مجھ سےعبد الکریم بن ما لک جزری نے مجا ہد ، اس نے ان سے کہا کہ عبدالرحمٰن بن ابی لیلیٰ نے ان سے بیان کیا کہ انہیں علی بن ابی طالب نے بتایا کہ رسول اللہ صلی اللہ علیہ وسلم نے انھیں حکم دیا ۔ ۔ ( آگے ) اسی کے مانند ہے ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عَبْدُ الْكَرِيمِ بْنُ مَالِكٍ الْجَزَرِيُّ، أَنَّ مُجَاهِدًا، أَخْبَرَهُ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ أَبِي لَيْلَى، أَخْبَرَهُ أَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ، أَخْبَرَهُ أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَمَرَهُ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10749,
                "hadithNumber": "3185",
                "englishNarrator": "Jabir bin 'Abdullah (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "In the year of Hudaibiya, we, along with Allah's Messenger (ﷺ), sacrificed a camel for seven persons and a cow for seven persons.",
                "hadithUrdu": "حدیبیہ کے سال رسول اللہ صلی اللہ علیہ وسلم کی معیت میں ہم نے ساتھ افراد کی طرف سے ایک اونٹ ساتھ کی طرف سے ایک گا ئے کی قربانیاں دیں ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے مالک نے بیان کیا، اور ہم سے یحییٰ بن یحییٰ نے بیان کیا - اور تلفظ ان کا ہے - انہوں نے کہا: میں نے پڑھا امام ما لک نے ابو زبیر سے اور انھوں نے جابر بن عبد اللہ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا مَالِكٌ، ح وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، - وَاللَّفْظُ لَهُ - قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، قَالَ: «نَحَرْنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَامَ الْحُدَيْبِيَةِ الْبَدَنَةَ عَنْ سَبْعَةٍ، وَالْبَقَرَةَ عَنْ سَبْعَةٍ».",
                "headingArabic": "الاِشْتِرَاكِ فِي الْهَدْىِ وَإِجْزَاءِ الْبَقَرَةِ وَالْبَدَنَةِ كُلٍّ مِنْهُمَا عَنْ سَبْعَةٍ ‏‏",
                "headingUrdu": "قربانی میں شریک ہونا جائز ہے اور سات آدمیوں کے لیے ایک اونٹ یا گائے کافی ہے۔",
                "headingEnglish": "It is permissible to share in the sacrifice, and a camel or a cow is sufficient for seven people",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10750,
                "hadithNumber": "3186",
                "englishNarrator": "Jabir (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "We set out in the state of Ihram for Hajj along, with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). He commanded us that seven persons should join in a camel and a cow for offering sacrifice.",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ حج کا تلبیہ کہتے ہو ئے نکلے رسول اللہ صلی اللہ علیہ وسلم نے ہمیں حکم دیا کہ ہم اونٹ اور گا ئے میں شریک ہو جا ئیں ہم میں سے ساتھ آدمی ایک قر با نی میں شر یک ہوں ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا ہم سے ابو خیثمہ نے بیان کیا, ہمیں زہیر نے حدیث بیان کی کہا : ہمیں ابو زبیر نے حضرت جا بر رضی اللہ تعالیٰ عنہ سے حدیث بیان کی انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو خَيْثَمَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، ح وحَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ: خَرَجْنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مُهِلِّينَ بِالْحَجِّ: «فَأَمَرَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ نَشْتَرِكَ فِي الْإِبِلِ وَالْبَقَرِ، كُلُّ سَبْعَةٍ مِنَّا فِي بَدَنَةٍ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10751,
                "hadithNumber": "3187",
                "englishNarrator": "Jabir bin 'Abdullah ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "We performed Hajj along with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), and we sacrificed a camel on behalf of seven persons, and a cow on behalf of seven persons.",
                "hadithUrdu": "ہم نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ حج کیا ہم نے ساتھ آدمیوں کی طرف سے ایک اونٹ نحر کیا اور سات آدمیوں کی طرف سے ایک گا ئے ( ذبح کی ).",
                "urduNarrator": "مجھ سے محمد بن حاتم نے بیان کیا، ہم سے وکیع نے بیان کیا، ہم سے انہوں نے بیان کیا ہمیں عزرہ بن ثابت نے ابو زبیر سے حدیث بیان کی انھوں نے جا بر بن عبد اللہ رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا عَزْرَةُ بْنُ ثَابِتٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، قَالَ: «حَجَجْنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَنَحَرْنَا الْبَعِيرَ عَنْ سَبْعَةٍ، وَالْبَقَرَةَ عَنْ سَبْعَةٍ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10752,
                "hadithNumber": "3188",
                "englishNarrator": "Jabir bin 'Abdullah (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "We joined Allah's Apostle (ﷺ) in Hajj and Umra and seven persons shared in the sacrifice of an animal. A person said to Jabir (Allah be pleased with him): Can seven persons share in the sacrifice of al-Badnah (a camel) as he shares in al- Jazur (a cow)? He, (Jabir) said: It (al-Jazur) is nothing but one among the budun. Jabir رضی اللہ تعالیٰ عنہ was present at Hudaibiya and he said: We sacrificed on that day seventy camel, and seven men shared in each sacrifice (of camel).",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ حج و عمرے میں سات آدمی ایک قربانی میں شر یک ہو ئے تو ایک آدمی نے حضرت جابر رضی اللہ تعالیٰ عنہ سے پو چھا کیا احرام کے وقت سے ساتھ لا ئے گئے قر با نی کے جانوروں میں بھی اس طرح شراکت کی جا سکتی ہے جیسے بعد میں خریدے گئے جا نوروں میں شراکت ہو سکتی ہے ؟ انھوں نے جواب دیا : وہ بھی ساتھ لا ئے گئے قربانی کے جانوروں ہی کی طرح ہیں ۔ اور جابر رضی اللہ تعالیٰ عنہ حدیبیہ کے موقع پر موجود تھے انھوں نے کہا ہم نے اس دن ستر اونٹ نحر کیے ہم سات سات آدمی ( قربانی کے ایک ) اونٹ شر یک ہو ئے تھے ۔",
                "urduNarrator": "مجھ سے محمد بن حاتم نے بیان کیا، انہوں نے ہم سے بیان کیا یحییٰ بن سعید نے ابن جریج سے حدیث بیان کی ( کہا ) مجھے ابو زبیر نے خبرد ی کہ انھوں نے جا بر بن عبد اللہ رضی اللہ تعالیٰ عنہ سے سنا انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ، قَالَ: «اشْتَرَكْنَا مَعَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي الْحَجِّ وَالْعُمْرَةِ كُلُّ سَبْعَةٍ فِي بَدَنَةٍ» فَقَالَ رَجُلٌ لِجَابِرٍ: أَيُشْتَرَكُ فِي الْبَدَنَةِ مَا يُشْتَرَكُ فِي الْجَزُورِ؟ قَالَ: مَا هِيَ إِلَّا مِنَ الْبُدْنِ، وَحَضَرَ جَابِرٌ الْحُدَيْبِيَةَ، قَالَ: نَحَرْنَا يَوْمَئِذٍ سَبْعِينَ بَدَنَةً اشْتَرَكْنَا كُلُّ سَبْعَةٍ فِي بَدَنَةٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10753,
                "hadithNumber": "3189",
                "englishNarrator": "Abu Az-Zubair narrated:",
                "hadithEnglish": "Jabir bin 'Abdullah ( رضی اللہ تعالیٰ عنہ), describing the Hajj of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: He (the Holy Prophet) commanded us as we had entered into the state of Ihram to sacrifice the animals (as a rite of Hajj) and a group (of person; amongst us, i. e. seven) shared in the sacrifice of one (camel or cow), and it happened at that time when he commanded them to put off Ihram for Hajj (after performing 'Umra).",
                "hadithUrdu": "انھوں نے جا بر بن عبد اللہ رضی اللہ تعالیٰ عنہ سے سنا وہ نبی صلی اللہ علیہ وسلم کے حج کا حال سنا رہے تھے انھوں نے اس حدیث میں کہا : ( آپ صلی اللہ علیہ وسلم نے ) ہمیں حکم دیا کہ جب ہم احرا م کھولیں تو قر بانی کریں اور ہم میں سے چند ( سات ) آدمی ایک قر بانی میں شر یک ہو جا ئیں اور یہ ( حکم اس وقت دیا ) جب آپ نے ہمیں اپنے حج کے احرا م کھولنے کا حکم دیا ، یہ بات بھی اس حدیث میں ہے ۔",
                "urduNarrator": "مجھ سے محمد بن حاتم نے بیان کیا، انہوں نے ہم سے بیان کیا ہمیں محمد بن بکر نے حدیث بیان کی ( کہا ) ہمیں ابن جریج نے خبردی ( کہا ) ہمیں ابو زبیر نے بتا یا کہ",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنَا أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ، يُحَدِّثُ عَنْ حَجَّةِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «فَأَمَرَنَا إِذَا أَحْلَلْنَا أَنْ نُهْدِيَ، وَيَجْتَمِعَ النَّفَرُ مِنَّا فِي الْهَدِيَّةِ» وَذَلِكَ حِينَ أَمَرَهُمْ أَنْ يَحِلُّوا مِنْ حَجِّهِمْ، فِي هَذَا الْحَدِيثِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10754,
                "hadithNumber": "3190",
                "englishNarrator": "Jabir bin 'Abdullah ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "We performed Hajj Tamattu' along with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and we slaughtered a cow on behalf of seven persons sharing in it.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ( حج کے مہینوں میں ) عمرہ کرنے کا فائدہ اٹھا تے ( حج تمتع کرتے ) تو ہم ( یو م النحر اور بقیہ ایام تشر یق میں ) سات افراد کی طرف سے ایک گا ئے ذبح کرتے اس ( ایک ) میں شریک ہو جا تے ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا ہم سے ہشیم نے بیان کیا، وہ عبد الملک کی سند سے, عطاء نے جابر بن عبد اللہ رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، عَنْ عَبْدِ الْمَلِكِ، عَنْ عَطَاءٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، قَالَ: «كُنَّا نَتَمَتَّعُ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِالْعُمْرَةِ، فَنَذْبَحُ الْبَقَرَةَ عَنْ سَبْعَةٍ نَشْتَرِكُ فِيهَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10755,
                "hadithNumber": "3191",
                "englishNarrator": "Jabir رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sacrificed a cow on behalf of 'A'isha رضی اللہ تعالیٰ عنہا on the Day of Nahr (10th of Dhu'l-Hijja).",
                "hadithUrdu": "قر بانی کے دن رسول اللہ صلی اللہ علیہ وسلم نے حضرت عائشہ رضی اللہ تعالیٰ عنہا ( اور دیگر امہارت المومنین ) کی طرف سے ایک گا ئے ذبح کی ۔",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ نے بیان کیا, ہمیں یحییٰ بن زکریا بن ابی زائدہ نے ابن جریج سے حدیث بیان کی انھوں نے ابو زبیر سے انھوں نے جا بر رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّاءَ بْنِ أَبِي زَائِدَةَ، عَنِ ابْنِ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ: «ذَبَحَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ عَائِشَةَ بَقَرَةً يَوْمَ النَّحْرِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10756,
                "hadithNumber": "3192",
                "englishNarrator": "Jabir bin 'Abdullah (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sacrificed (animals) on behalf of his wives, and in the hadith transmitted by Ibn Abu Bakr (the words are): A cow on behalf of 'A'isha رضی اللہ تعالیٰ عنہا on the occasion of the Hajj.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے اپنی ازواج کی طرف سے اور ابن بکر کی حدیث میں ہے اپنے حج میں عائشہ رضی اللہ تعالیٰ عنہا کی طرف سے ایک گا ئے ذبح کی ۔",
                "urduNarrator": "مجھ سے محمد بن حاتم نے کہا, محمد بن بکر اور یحییٰ بن سعید نے کہا ہمیں ابن جریج نے حدیث بیان کی کہا ہمیں ابو زبیر نے خبردی کہ انھوں نے جا بر بن عبد اللہ رضی اللہ تعالیٰ عنہ سے سنا کہہ رہے تھے",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، ح وحَدَّثَنِي سَعِيدُ بْنُ يَحْيَى الْأُمَوِيُّ، حَدَّثَنِي أَبِي، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ، يَقُولُ: «نَحَرَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، عَنْ نِسَائِهِ» وَفِي حَدِيثِ ابْنِ بَكْرٍ عَنْ عَائِشَةَ بَقَرَةً فِي حَجَّتِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10757,
                "hadithNumber": "3193",
                "englishNarrator": "Ziyad bin Jubair reported:",
                "hadithEnglish": "Ibn 'Umar came upon a person who was slaughtering (sacrificing) his camel and had made him kneel down. So he told him to make it stand up festered (and then sacrifice it) according to the Sunnah of the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ).",
                "hadithUrdu": "حضرت ابن عمر رضی اللہ تعالیٰ عنہ ایک آدمی کے پاس آئے اور وہ اپنی قر بانی کے اونٹ کو بٹھا کر نحر کر رہا تھا انھوں نے فر ما یا : \" اسے اٹھا کر کھڑی حالت میں گھٹنا باند ھ کر ( نحر کرو یہی ) تمھا رے نبی صلی اللہ علیہ وسلم کی سنت ہے ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا ہم سے خالد بن عبداللہ نے بیان کیا، یونس سے, زیاد بن جبیر سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللهِ، عَنْ يُونُسَ، عَنْ زِيَادِ بْنِ جُبَيْرٍ، أَنَّ ابْنَ عُمَرَ، أَتَى عَلَى رَجُلٍ وَهُوَ يَنْحَرُ بَدَنَتَهُ بَارِكَةً، فَقَالَ: «ابْعَثْهَا قِيَامًا مُقَيَّدَةً، سُنَّةَ نَبِيِّكُمْ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ».",
                "headingArabic": "نَحْرِ الْبُدْنِ قِيَامًا مُقَيَّدَةً ‏‏",
                "headingUrdu": "جب اونٹ کھڑا ہو اور بندھا ہو تو قربانی کرنا مستحب ہے۔",
                "headingEnglish": "It is recommended to sacrifice the camel when it is standing and tied",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10758,
                "hadithNumber": "3194",
                "englishNarrator": "A'isha (رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sent the sacrificial animals from Medina. I wove garlands for his sacrificial animals (and then he hung them round their necks), and he would not avoid doing anything which the Muhrim avoids.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم مدینہ سے قر بانی کے جا نوروں کا ہدیہ بھیجا کرتے تھے اور میں آپ کے ہدیے ( کے جانوروں ) کے لیے ہار بٹتی تھی پھر آپ کسی بھی ایسی چیز سے اجتناب نہ کرتے جس سے ایک احرام والا شخص اجتناب کرتا ہے ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ اور محمد بن رہم نے بیان کیا، کہا: ہم سے انہوں نے بیان کیا ہمیں لیث نے ابن شہاب سے حدیث بیان کی انھوں نے عروہ بن زبیر اور عمر ہ بنت عبد الرحمٰن سے روایت کی کہ حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا",
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَمُحَمَّدُ بْنُ رُمْحٍ، قَالَا: أَخْبَرَنَا اللَّيْثُ، ح وحَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا لَيْثٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، وَعَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، أَنَّ عَائِشَةَ، قَالَتْ: «كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُهْدِي مِنَ الْمَدِينَةِ فَأَفْتِلُ قَلَائِدَ هَدْيِهِ، ثُمَّ لَا يَجْتَنِبُ شَيْئًا مِمَّا يَجْتَنِبُ الْمُحْرِمُ».",
                "headingArabic": "اسْتِحْبَابِ بَعْثِ الْهَدْىِ إِلَى الْحَرَمِ لِمَنْ لاَ يُرِيدُ الذَّهَابَ بِنَفْسِهِ وَاسْتِحْبَابِ تَقْلِيدِهِ وَفَتْلِ الْقَلاَئِدِ وَأَنَّ بَاعِثَهُ لاَ يَصِيرُ مُحْرِمًا وَلاَ يَحْرُمُ عَلَيْهِ شيء بِذَلِكَ",
                "headingUrdu": "اس کے لیے قربانی کا جانور حرم میں بھیجنا مستحب ہے جو خود وہاں جانے کا ارادہ نہیں رکھتا۔ اسے ہار پہنانا اور مالا پہنانا مستحب ہے، لیکن بھیجنے والا احرام کی حالت میں نہیں آتا اور اس کی وجہ سے اس پر کوئی چیز حرام نہیں ہے۔",
                "headingEnglish": "It is recommended to send the sacrificial animal to the Haram for one who does not intend to go there himself; It is reommended to garland it and to make the garland, but the one who sends it does not enter a state of Ihram, and nothing is forbidden to him because of that",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10759,
                "hadithNumber": "3195",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been transmitted on the authority of Ibn Shihab.",
                "hadithUrdu": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، مجھ سے یونس نے بیان کیا, یو نس نے ابن شہاب سے اسی سند کے ساتھ اس کے مانند حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِيهِ حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10760,
                "hadithNumber": "3196",
                "englishNarrator": "`A'isha رضی اللہ تعالیٰ عنہا narrated (in another hadith narrated through another chain of transmitters) these words:",
                "hadithEnglish": "As if I am seeing myself weaving the garlands for the sacrificial animals of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌)...\" a similar report(as no. 3194).",
                "hadithUrdu": "میں رسول اللہ صلی اللہ علیہ وسلم کی قر بانی کے ہار بٹ رہی ہوں ۔ ۔ ۔ ( آگے ) اسی طرح ہے ۔",
                "urduNarrator": "ہم سے سعید بن منصور اور زہیر بن حرب نے بیان کیا، کہا: ہم سے انہوں نے بیان کیا ہمیں سفیان نے زہری سے حدیث بیان کی انھوں نے عروہ سے انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی نیز ہشام بن عروہ نے اپنے والد سے اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی انھوں نے کہا جیسے میں خود کو دیکھتی رہی ہوں کہ",
                "hadithArabic": "وحَدَّثَنَاه سَعِيدُ بْنُ مَنْصُورٍ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالَا: حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، ح وحَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، وَخَلَفُ بْنُ هِشَامٍ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، قَالُوا: أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ: كَأَنِّي أَنْظُرُ إِلَيَّ أَفْتِلُ قَلَائِدَ هَدْيِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10761,
                "hadithNumber": "3197",
                "englishNarrator": "Abdul-Rahman bin al-Qasim reported on the authority of his father:",
                "hadithEnglish": "He heard 'A'isha ( رضی اللہ تعالیٰ عنہا) saying: I used to weave garlands for the sacrificial animals of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) with these hands of mine, but he (Allah's Apostle) neither avoided anything nor gave up anything (which a Muhrim should avoid or give up).",
                "hadithUrdu": "میں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے سنا وہ فر ما رہی تھیں : میں اپنے ان دونوں ہاتھوں سے رسول اللہ صلی اللہ علیہ وسلم کی طرف سے بھیجے جا نے والے جانوروں کے ہا ر بٹتی تھی پھر آپ نہ ( ایسی ) کسی چیز سے الگ ہو تے اور نہ ( ایسی کوئی چیز ) ترک کرتے تھے ( جو احرام کے بغیر آپ کیا کرتے تھے ).",
                "urduNarrator": "ہم سے سعید بن منصور نے بیان کیا، کہا ہم سے سفیان نے بیان کیا, عبد الرحمٰن بن قاسم نے اپنے والد سے روایت کی انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، قَالَ: سَمِعْتُ عَائِشَةَ، تَقُولُ: «كُنْتُ أَفْتِلُ قَلَائِدَ هَدْيِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِيَدَيَّ هَاتَيْنِ، ثُمَّ لَا يَعْتَزِلُ شَيْئًا وَلَا يَتْرُكُهُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10762,
                "hadithNumber": "3198",
                "englishNarrator": "A'isha رضی اللہ تعالیٰ عنہا reported:",
                "hadithEnglish": "I wove the garlands for the sacrificial animals of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) with my own bands, and then he (the Holy Prophet ﷺ) marked them, and garlanded them, and then sent them to the House, and stayed at Medina and nothing was forbidden to him which was lawful for him (before).",
                "hadithUrdu": "میں نے اپنے دونوں ہاتھوں سے رسول اللہ صلی اللہ علیہ وسلم کی قر بانیوں کے ہار بٹے پھر آپ نے ان کا اشعار کیا ( کوہان پر چیر لگا ئے ) اور ہا ر پہنائے پھر انھیں بیت اللہ کی طرف بھیج دیا اور ( خود ) مدینہ میں مقیم رہے اور آپ پر ( انکی وجہ سے ) کو ئی چیز جو ( پہلے ) آپ کے لیے حلال تھی حرا م نہ ہو ئی ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ بن قعنب نے بیان کیا، انہوں نے ہم سے بیان کیا افلح نے ہمیں قاسم سے حدیث بیان کی انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا عَبْدُ اللهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا أَفْلَحُ، عَنِ الْقَاسِمِ، عَنْ عَائِشَةَ، قَالَتْ: «فَتَلْتُ قَلَائِدَ بُدْنِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِيَدَيَّ، ثُمَّ أَشْعَرَهَا وَقَلَّدَهَا، ثُمَّ بَعَثَ بِهَا إِلَى الْبَيْتِ، وَأَقَامَ بِالْمَدِينَةِ، فَمَا حَرُمَ عَلَيْهِ شَيْءٌ كَانَ لَهُ حِلًّا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10763,
                "hadithNumber": "3199",
                "englishNarrator": "A'isha ( رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sent the sacrificial animals and I wove garlands for them with my own 'hands, and he did not refrain from doing anything which he did not avoid in the state of non-Muhrim.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ( بیت اللہ کی طرف ) ہدی بھیجتے تھے میں اپنے دونوں ہاتھوں سے ان کے ہار بٹتی تھی پھر آپ کسی بھی ایسی چیز سے اجتنا ب نہ کرتے تھے جس سے کو ئی بھی غیر محرم ( بغیر احرام والا شخص ) اجتناب نہیں کرتا ۔",
                "urduNarrator": "ہم سے علی بن حجر السعدی اور یعقوب بن ابراہیم الدورقی نے بیان کیا، کہا: ہم سے اسماعیل بن ابراہیم نے بیان کیا, ایوب نے قاسم اور ابو قلابہ سے اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، وَيَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، قَالَ ابْنُ حُجْرٍ: حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ أَيُّوبَ، عَنِ الْقَاسِمِ، وَأَبِي قِلَابَةَ، عَنْ عَائِشَةَ، قَالَتْ: كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «يَبْعَثُ بِالْهَدْيِ أَفْتِلُ قَلَائِدَهَا بِيَدَيَّ، ثُمَّ لَا يُمْسِكُ عَنْ شَيْءٍ لَا يُمْسِكُ عَنْهُ الْحَلَالُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 10451,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=418",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=416",
                "label": "416",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=417",
                "label": "417",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=418",
                "label": "418",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=419",
                "label": "419",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=420",
                "label": "420",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=421",
                "label": "421",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=422",
                "label": "422",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=420",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=420",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=418",
        "to": 10475,
        "total": 40465
    }
}