{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 477,
        "data": [
            {
                "id": 12189,
                "hadithNumber": "4625",
                "englishNarrator": "It has been narrated by Ibn Abdullah رضی اللہ عنہ who said:",
                "hadithEnglish": "The Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) entered Mecca. There were three hundred and sixty idols around the Ka'ba. He began to thrust them with the stick that was in his hand saying: Truth has come and falsehood has vanished. Lo! falsehood was destined to vanish (xvii. 8). Truth has arrived, and falsehood can neither create anything from the beginning nor can It restore to life. Ibn Umar added: One the day of the conquest.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم مکہ میں داخل ہوئے تو کعبہ کے گرد تین سو ساٹھ بت تھے ۔ آپ صلی اللہ علیہ وسلم ہر ایک کو اپنے ہاتھ میں پکڑی ہوئی لکڑی سے کچوکا دے کر گرانے لگے اور یہ فرمانے لگے : \" حق آ گیا اور باطل مٹ گیا ، بلاشبہ باطل مٹنے والا ہے ۔ حق آ گیا اور باطل نہ آغاز کرتا ہے اور نہ لوٹاتا ہے \" ( بلکہ دونوں اللہ عزوجل جلالہ کے کام ہیں ۔ ) ابن ابی عمر نے اضافہ کیا : فتح مکہ کے دن.",
                "urduNarrator": "ابوبکر بن ابی شیبہ ، عمرو ناقد اور ابن ابی عمر نے ۔ ۔ الفاظ ابن ابی شیبہ کے ہیں ۔ ۔ کہا : ہمیں سفیان بن عیینہ نے ابن ابی نجیح سے حدیث بیان کی ، انہوں نے مجاہد سے ، انہوں نے ابومعمر سے ، انہوں نے حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَابْنُ أَبِي عُمَرَ، وَاللَّفْظُ لِابْنِ أَبِي شَيْبَةَ، قَالُوا: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ مُجَاهِدٍ، عَنْ أَبِي مَعْمَرٍ، عَنْ عَبْدِ اللهِ، قَالَ: دَخَلَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مَكَّةَ، وَحَوْلَ الْكَعْبَةِ ثَلَاثُ مِائَةٍ وَسِتُّونَ نُصُبًا، فَجَعَلَ يَطْعُنُهَا بِعُودٍ كَانَ بِيَدِهِ، وَيَقُولُ: {جَاءَ الْحَقُّ وَزَهَقَ الْبَاطِلُ إِنَّ الْبَاطِلَ كَانَ زَهُوقًا} [الإسراء: 81] {جَاءَ الْحَقُّ وَمَا يُبْدِئُ الْبَاطِلُ وَمَا يُعِيدُ} [سبأ: 49]، زَادَ ابْنُ أَبِي عُمَرَ: يَوْمَ الْفَتْحِ.",
                "headingArabic": "إِزَالَةِ الأَصْنَامِ مِنْ حَوْلِ الْكَعْبَةِ ‏‏",
                "headingUrdu": "کعبہ کے اطراف سے بتوں کو ہٹانا",
                "headingEnglish": "Removal of Idols from around the Ka'bah",
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12190,
                "hadithNumber": "4626",
                "englishNarrator": "This tradition has been narrated by Ibn Abu Najah through a different chain of transmitters up to the word:",
                "hadithEnglish": "Zahaqa, (This version) does not contain the second verse and substitutes Sanam for Nusub (both the words mean idol or image that is worshipped).",
                "hadithUrdu": "زهوقا ( پہلی آیت کے آخر ) تک روایت کی ، دوسری آیت بیان نہیں کی اور ۔ ۔ نصبا کے بجائے ‘ صنما کہا : ( دونوں کے معنی بت کے ہیں.",
                "urduNarrator": "ہم سے حسن بن علی الحلوانی اور عبد بن حمید نے بیان کیا، ان دونوں نے عبد الرزاق کی سند سے, ثوری نے ابن ابی نجیح سے اسی سند کے ساتھ",
                "hadithArabic": "وَحَدَّثَنَاهُ حَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، وَعَبْدُ بْنُ حُمَيْدٍ، كِلَاهُمَا عَنْ عَبْدِ الرَّزَّاقِ، أَخْبَرَنَا الثَّوْرِيُّ، عَنِ ابْنِ أَبِي نَجِيحٍ، بِهَذَا الْإِسْنَادِ إِلَى قَوْلِهِ: زَهُوقًا، وَلَمْ يَذْكُرِ الْآيَةَ الْأُخْرَى، وَقَالَ: بَدَلَ نُصُبًا صَنَمًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12191,
                "hadithNumber": "4627",
                "englishNarrator": "It has been narrated on the authority of Abdullah bin Muti' رضی اللہ عنہ who heard from his father and said:",
                "hadithEnglish": "I heard the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) say on the day of the Conquest of Mecca: No Quraishite will be killed hound hand and foot from this day until the Day of judgment.",
                "hadithUrdu": "جس دن مکہ فتح ہوا میں نے رسول اللہ صلی اللہ علیہ وسلم کو کہتے ہوئے سنا : \" آج کے بعد قیامت تک کوئی قریشی باندھ کر قتل نہ کیا جائے.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, علی بن مسہر اور وکیع نے زکریا سے ، انہوں نے شعبی سے روایت کی ، انہوں نے کہا : مجھے عبداللہ بن مطیع نے اپنے باپ ( مطیع بن اسود رضی اللہ عنہ ) سے خبر دی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، وَوَكِيعٌ، عَنْ زَكَرِيَّا، عَنِ الشَّعْبِيِّ، قَالَ: أَخْبَرَنِي عَبْدُ اللهِ بْنُ مُطِيعٍ، عَنْ أَبِيهِ، قَالَ: سَمِعْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ يَوْمَ فَتْحِ مَكَّةَ: «لَا يُقْتَلُ قُرَشِيٌّ صَبْرًا بَعْدَ هَذَا الْيَوْمِ إِلَى يَوْمِ الْقِيَامَةِ.",
                "headingArabic": "لاَ يُقْتَلُ قُرَشِيٌّ صَبْرًا بَعْدَ الْفَتْحِ ‏‏",
                "headingUrdu": "کوئی آدمی نہیں اگر قریش کو پکڑنا ہے تو قتل کیا جائے، فتح کے بعد",
                "headingEnglish": "No man if Quraish is to be captured then killed, after the conquest",
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12192,
                "hadithNumber": "4628",
                "englishNarrator": "The same tradition has been narrated on the authority of Zakriyya through the same chain of transmitters with the following addition:",
                "hadithEnglish": "No rebellious Quraishite with al-Asi as his name embraced Islam that day except Muti. His name-was al-Asi, but the Messenger of Allah (way peace be upon him) changed his name to Muti.",
                "hadithUrdu": "اس دن قریش کے عاص ( نافرمان ) نام کے لوگوں میں سے ، مطیع کے سوا ، کوئی مسلمان نہیں ہوا ۔ اس کا نام ( تخفیف کے ساتھ عاص اور تخفیف کے بغیر ) عاصی تھا ، آپ صلی اللہ علیہ وسلم نے اس کا نام ( بدل کر ) مطیع رکھ دیا.",
                "urduNarrator": "عبداللہ بن نمیر نے کہا : ہمیں زکریا نے اسی سند کے ساتھ یہی حدیث سنائی اور یہ اضافہ کیا ، کہا",
                "hadithArabic": "حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا زَكَرِيَّا، بِهَذَا الْإِسْنَادِ وَزَادَ قَالَ: وَلَمْ يَكُنْ أَسْلَمَ أَحَدٌ مِنْ عُصَاةِ قُرَيْشٍ غَيْرَ مُطِيعٍ، كَانَ اسْمُهُ الْعَاصِي، فَسَمَّاهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مُطِيعًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12193,
                "hadithNumber": "4629",
                "englishNarrator": "It has been narrated on the authority of al-Bara' bin 'Azib رضی اللہ عنہ who said:",
                "hadithEnglish": "'Ali bin Abu Talib رضی اللہ عنہ penned the treaty between the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and the polytheists on the Day of Hudaibiya. He wrote: This is what Muhammad, the Messenger of Allah, has settled. They (the polytheists) said: Do not write words the Messenger of Allah . If we knew that you were the Messenger of Allah, we would not fight against you. The Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to 'Ali رضی اللہ عنہ : Strike out these words. He (Ali) said: I am not going to strike them out. So the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) struck them out with his own hand. The narrator said that the conditions upon which the two sides had agreed included that the Muslims would enter Mecca (next year) and would stay there for three days, and that they would not enter bearing arms except in their sheaths or bolsters.",
                "hadithUrdu": "حضرت علی رضی اللہ عنہ نے اس صلح کا معاہدہ لکھا جو رسول اللہ صلی اللہ علیہ وسلم اور مشرکوں کے درمیان حدیبیہ کے دن ہوئی تھی ۔ انہوں نے لکھا : \"\" یہ ( معاہدہ ) ہے جس پر تحریری صلح کی اللہ کے رسول ، محمد صلی اللہ علیہ وسلم نے ۔ \"\" ان لوگوں ( مشرکوں ) نے کہا : \"\" اللہ کے رسول \"\" مت لکھیے ، اس لیے کہ اگر ہم یقین جانتے کہ آپ اللہ کے رسول ہیں تو ہم آپ سے نہ لڑتے ۔ رسول اللہ صلی اللہ علیہ وسلم نے حضرت علی رضی اللہ عنہ سے فرمایا : \"\" اس لفظ کو مٹا دو ۔ \"\" انہوں نے عرض کی : جو اس ( لفظ ) کو مٹائے گا وہ میں نہیں ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے اس کو اپنے ہاتھ سے مٹا دیا ، کہا : انہوں نے جو شرطیں رکھیں ان میں یہ بھی تھا کہ ( مسلمان ) مکہ میں آئیں اور تین دن تک مقیم رہیں اور ہتھیار لے کر مکہ میں داخل نہ ہوں ، الا یہ کہ چمڑے کے تھیلے میں ہوں ۔ ( شعبہ نے کہا ) میں نے ابواسحاق سے کہا : چمڑے کے تھیلے سے کیا مراد ہے؟ انہوں نے کہا : نیام اور جو اس کے اندر ہے.",
                "urduNarrator": "عبید اللہ بن معاذ عنبری نے کہا : ہمیں شعبہ نے ابواسحاق سے حدیث سنائی ، انہوں نے کہا : میں نے براء بن عازب رضی اللہ عنہ کو کہتے ہوئے سنا",
                "hadithArabic": "حَدَّثَنِي عُبَيْدُ اللهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، قَالَ: سَمِعْتُ الْبَرَاءَ بْنَ عَازِبٍ، يَقُولُ: كَتَبَ عَلِيُّ بْنُ أَبِي طَالِبٍ الصُّلْحَ بَيْنَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَبَيْنَ الْمُشْرِكِينَ يَوْمَ الْحُدَيْبِيَةِ، فَكَتَبَ: «هَذَا مَا كَاتَبَ عَلَيْهِ مُحَمَّدٌ رَسُولُ اللهِ»، فَقَالُوا: لَا تَكْتُبْ رَسُولُ اللهِ، فَلَوْ نَعْلَمُ أَنَّكَ رَسُولُ اللهِ لَمْ نُقَاتِلْكَ، فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِعَلِيٍّ: «امْحُهُ»، فَقَالَ: مَا أَنَا بِالَّذِي أَمْحَاهُ، فَمَحَاهُ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِيَدِهِ، قَالَ: وَكَانَ فِيمَا اشْتَرَطُوا أَنْ يَدْخُلُوا مَكَّةَ فَيُقِيمُوا بِهَا ثَلَاثًا، وَلَا يَدْخُلُهَا بِسِلَاحٍ إِلَّا جُلُبَّانَ السِّلَاحِ، قُلْتُ لِأَبِي إِسْحَاقَ: وَمَا جُلُبَّانُ السِّلَاحِ؟ قَالَ: «الْقِرَابُ وَمَا فِيهِ.",
                "headingArabic": "صُلْحِ الْحُدَيْبِيَةِ فِي الْحُدَيْبِيَةِ ‏‏",
                "headingUrdu": "الحدیبیہ کی جنگ بندی",
                "headingEnglish": "The truce of Al-Hudaybiyah",
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12194,
                "hadithNumber": "4630",
                "englishNarrator": "It has been narrated on the authority of Abu Ishaq, who heard Bars' bin Azib رضی اللہ عنہ say:",
                "hadithEnglish": "When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) made peace with the people of Hudaibiya, 'Ali رضی اللہ عنہ drew up the agreement between them, and so he wrote: Muhammad, the Messenger of Allah. (This is followed by the same wording as we have in the previous tradition except the omission of the words: This is what he has settled.)",
                "hadithUrdu": "جب رسول اللہ صلی اللہ علیہ وسلم نے حدیبیہ ( میں آ کر صلح کی گفتگو کرنے ) والوں سے صلح کی تو ان کے مابین حضرت علی رضی اللہ عنہ نے تحریر لکھی ، کہا : انہوں نے \" محمد رسول اللہ صلی اللہ علیہ وسلم \" لکھا ، پھر معاذ کی حدیث کی طرح بیان کیا ، مگر انہوں نے : \" یہ ہے جس پر تحریر صلح کی \" ( کا جملہ ) بیان نہیں کیا)",
                "urduNarrator": "ہم سے محمد بن المثنا اور ابن بشار نے بیان کیا، انہوں نے کہا: محمد بن جعفر نے کہا : ہمیں شعبہ نے ابواسحٰق سے حدیث بیان کی ، انہوں نے کہا : میں نے حضرت براء بن عازب رضی اللہ عنہ سے سنا ، کہہ رہے تھے",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، قَالَ: سَمِعْتُ الْبَرَاءَ بْنَ عَازِبٍ، يَقُولُ: لَمَّا صَالَحَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَهْلَ الْحُدَيْبِيَةِ كَتَبَ عَلِيٌّ كِتَابًا بَيْنَهُمْ، قَالَ: فَكَتَبَ مُحَمَّدٌ رَسُولُ اللهِ، ثُمَّ ذَكَرَ بِنَحْوِ حَدِيثِ مُعَاذٍ، غَيْرَ أَنَّهُ لَمْ يَذْكُرْ فِي الْحَدِيثِ: هَذَا مَا كَاتَبَ عَلَيْهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12195,
                "hadithNumber": "4631",
                "englishNarrator": "It has been narrated on the authority of Bara' رضی اللہ عنہ who said:",
                "hadithEnglish": "When the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was checked from going to the Ka'ba, the people of Mecca made peace with him'on the condition that he would (be allowed to) enter Mecca (next year) and stay there for three days, that he would not enter (the city) except with swords in their sheaths and arms encased in their covers, that he would not take eway with him anyone from its dwellers, nor would he prevent anyone from those with him to stay on in Mecca (if he so desired). He said to 'Ali رضی اللہ عنہ : Write down the terms settled between us. (So 'Ali wrote): In the name of Allah, most Gracious and most Merciful. This is what Muhammad, the Messenger of Allah, has settled (with the Meccans), The polytheists said to him: If we knew that thou art the Messenger of of Allah, we would follow you. But write: Muhammad bin 'Abdullah. So he told 'Ali to strike out these words. 'Ali رضی اللہ عنہ said: No, by Allah, I will not strike them out. The Messenger of Allah (may Peace be upon him) said: Show me their place (on the parchment). So he ('Ali) showed him their place and he (the Holy Prophet) struck them out; and 'Ali رضی اللہ عنہ wrote: Ibn 'Abdullah. (According to the terms of the treaty, next year) the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) stayed there for three days When it was the third day, they said to 'Ali رضی اللہ عنہ : This is the last day according to the terms of your companion. So tell him to leave. 'Ali رضی اللہ عنہ informed the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) accordingly. He said: Yes, and left (the city). Ibn Janab in his version of the tradition used: we would swear allegiance to you instead of we would follow you .",
                "hadithUrdu": "جب رسول اللہ صلی اللہ علیہ وسلم کو بیت اللہ کے پاس روک لیا گیا ، آپ صلی اللہ علیہ وسلم سے مکہ والوں نے اس بات پر صلح کی کہ ( آئندہ سال ) مکہ میں داخل ہوں اور تین دن تک اس میں رہیں اور ہتھیار رکھنے کے تھیلوں : تلوار اور اس کے نیام کے علاوہ ( کوئی ہتھیار لے کر ) اس شہر میں داخل نہ ہوں اور کسی مکہ والے کو اپنے ساتھ نہ لے جائیں اور ان کے ساتھ آنے والوں میں سے جو وہاں رہ جائے ( مشرکوں کا ساتھ قبول کر لے ) تو اس کو منع نہ کریں ۔ آپ صلی اللہ علیہ وسلم نے حضرت علی رضی اللہ عنہ سے فرمایا : \"\" اس شرط کو ہمارے درمیان لکھو بسم الله الرحمن الرحيم یہ ہے جس پر باہمی فیصلہ کیا اللہ تعالیٰ کے رسول صلی اللہ علیہ وسلم نے ۔ \"\" مشرک بولے : اگر ہم یہ یقین جانتے کہ آپ اللہ تعالیٰ کے رسول ہیں تو آپ کی پیروی کرتے ، بلکہ یوں لکھیے : \"\" محمد بن عبداللہ نے ۔ \"\" آپ صلی اللہ علیہ وسلم نے حضرت علی رضی اللہ عنہ کو حکم دیا ان ( الفاظ ) کو مٹا دیں ۔ انہوں نے کہا : اللہ کی قسم! میں ( اپنے ہاتھ سے ) نہ مٹاؤں گا ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" اچھا ، مجھے اس ( جملے ) کی جگہ دکھاؤ ۔ \"\" حضرت علی رضی اللہ عنہ نے دکھا دی ، آپ صلی اللہ علیہ وسلم نے اس کو مٹا دیا اور ابن عبداللہ لکھ دیا ( جب حسبِ معاہدہ اگلے سال آ کر عمرہ ادا فرمایا ) تو تین روز ہی مکہ معظمہ میں رہے ۔ جب تیسرا دن ہوا تو مشرکوں نے حضرت علی رضی اللہ عنہ سے کہا : یہ تمہارے صاحب کی شرط کا آخری دن ہے ، ان سے کہو : اب وہ چلے جائیں ، انہوں نے آپ کو بتایا تو آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" اچھا ۔ \"\" اور آپ صلی اللہ علیہ وسلم ( مکہ سے ) نکل آئے ۔ ابن جناب نے \"\" ہم آپ کی پیروی کرتے \"\" کے بجائے \"\" ہم آپ کی بیعت کرتے ۔ \"\" کہا",
                "urduNarrator": "اسحاق بن ابراہیم حنظلی اور احمد بن جناب مصیصی دونوں نے عیسیٰ بن یونس سے ۔ ۔ لفظ اسحاق کے ہیں ۔ ۔ روایت کی ، کہا : ہمیں عیسیٰ بن یونس نے خبر دی ، ہمیں زکریا نے ابواسحاق سے حدیث بیان کی ، انہوں نے براء رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، وَأَحْمَدُ بْنُ جَنَابٍ الْمِصِّيصِيُّ، جَمِيعًا عَنْ عِيسَى بْنِ يُونُسَ، وَاللَّفْظُ لِإِسْحَاقَ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، أَخْبَرَنَا زَكَرِيَّا، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ، قَالَ: لَمَّا أُحْصِرَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عِنْدَ الْبَيْتِ، صَالَحَهُ أَهْلُ مَكَّةَ عَلَى أَنْ يَدْخُلَهَا فَيُقِيمَ بِهَا ثَلَاثًا، وَلَا يَدْخُلَهَا إِلَّا بِجُلُبَّانِ السِّلَاحِ، السَّيْفِ وَقِرَابِهِ، وَلَا يَخْرُجَ بِأَحَدٍ مَعَهُ مِنْ أَهْلِهَا، وَلَا يَمْنَعَ أَحَدًا يَمْكُثُ بِهَا مِمَّنْ كَانَ مَعَهُ، قَالَ لِعَلِيٍّ: «اكْتُبِ الشَّرْطَ بَيْنَنَا، بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ، هَذَا مَا قَاضَى عَلَيْهِ مُحَمَّدٌ رَسُولُ اللهِ»، فَقَالَ لَهُ الْمُشْرِكُونَ: لَوْ نَعْلَمُ أَنَّكَ رَسُولُ اللهِ تَابَعْنَاكَ، وَلَكِنِ اكْتُبْ مُحَمَّدُ بْنُ عَبْدِ اللهِ، فَأَمَرَ عَلِيًّا أَنْ يَمْحَاهَا، فَقَالَ عَلِيٌّ: لَا وَاللهِ، لَا أَمْحَاهَا، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَرِنِي مَكَانَهَا»، فَأَرَاهُ مَكَانَهَا فَمَحَاهَا، وَكَتَبَ ابْنُ عَبْدِ اللهِ، فَأَقَامَ بِهَا ثَلَاثَةَ أَيَّامٍ، فَلَمَّا أَنْ كَانَ يَوْمُ الثَّالِثِ قَالُوا لِعَلِيٍّ: هَذَا آخِرُ يَوْمٍ مِنْ شَرْطِ صَاحِبِكَ، فَأْمُرْهُ فَلْيَخْرُجْ فَأَخْبَرَهُ بِذَلِكَ، فَقَالَ: «نَعَمْ»، فَخَرَجَ، وقَالَ ابْنُ جَنَابٍ فِي رِوَايَتِهِ مَكَانَ تَابَعْنَاكَ: بَايَعْنَاكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12196,
                "hadithNumber": "4632",
                "englishNarrator": "It has been narrated on the authority of Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Quraish made peace with the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). Among them was Suhail bin Amr رضی اللہ عنہ . The Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said to 'Ali رضی اللہ عنہ : Write In the name of Allah, most Gracious and most Merciful. Suhail said: As for Bismillah, we do not know what is meant by Bismillah-ir-Rahman-ir-Rahim (In the name of Allah most Gracious and most Merciful). But write what we understand, i.e. Bi ismika allahumma (in thy name. O Allah). Then, the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Write: From Muhammad, the Messenger of Allah. They said: If we knew that thou welt the Messenger of Allah, we would follow you. Therefore, write your name and the name of your father. So the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Write From Muhammad bin 'Abdullah. They laid the condition on the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) that anyone who joined them from the Muslims, the Meccans would not return him, and anyone who joined you (the Muslims) from them, you would send him back to them. The Companions said: Messenger of Allah, should we write this? He said: Yes. One who goes away from us to join them-may Allah keep him away! and one who comes to join us from them (and is sent back) Allah will provide him relief and a way of escape.",
                "hadithUrdu": "قریش نے نبی صلی اللہ علیہ وسلم سے مصالحت کی ، ان میں سہیل بن عمرو رضی اللہ عنہ بھی تھے ۔ رسول اللہ صلی اللہ علیہ وسلم نے حضرت علی رضی اللہ عنہ سے فرمایا : \" لکھو : بسم الله الرحمن الرحيم سہیل کہنے لگے : جہاں تک بسم اللہ کا تعلق ہے تو ہم بسم الله الرحمن الرحيم کو نہیں جانتے ، لیکن وہ لکھو جسے ہم جانتے ہیں : باسمك اللهم پھر آپ صلی اللہ علیہ وسلم نے فرمایا : \" لکھو : محمد رسول اللہ صلی اللہ علیہ وسلم کی طرف سے ۔ \" وہ لوگ کہنے لگے : اگر ہم یقین جانتے کہ آپ اللہ کے رسول ہیں تو ہم آپ کی پیروی کرتے ، لیکن اپنا اور اپنے والد کا نام لکھو ، نبی صلی اللہ علیہ وسلم نے فرمایا : \" لکھو : محمد بن عبداللہ صلی اللہ علیہ وسلم کی طرف سے ۔ \" ان لوگوں نے نبی صلی اللہ علیہ وسلم پر شرط لگائی کہ آپ لوگوں میں سے ( ہمارے پاس ) آ جائے گا ہم اسے آپ لوگوں کو واپس نہ کریں گے اور ہم میں سے جو آپ کے پاس آیا آپ اسے ہم کو واپس کر دیں گے ۔ ( صحابہ نے ) پوچھا : اے اللہ کے رسول! کیا ہم یہ لکھ دیں؟ فرمایا : \" ہاں ، ہم میں سے جو شخص ان کے پاس چلا گیا تو اسے اللہ نے ہم سے دور کر دیا اور ان میں سے جو ہمارے پاس آئے گا اللہ اس کے لیے کشادگی اور نکلنے کا راستہ پیدا فرما دے گا.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے عفان نے بیان کیا، کہا ہم سے حماد بن سلمہ نے بیان کیا، ثابت کی سند سے, حضرت انس رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، أَنَّ قُرَيْشًا صَالَحُوا النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِيهِمْ سُهَيْلُ بْنُ عَمْرٍو، فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِعَلِيٍّ: «اكْتُبْ، بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ»، قَالَ سُهَيْلٌ: أَمَّا بِاسْمِ اللهِ، فَمَا نَدْرِي مَا بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ، وَلَكِنِ اكْتُبْ مَا نَعْرِفُ بِاسْمِكَ اللهُمَّ، فَقَالَ: «اكْتُبْ مِنْ مُحَمَّدٍ رَسُولِ اللهِ»، قَالُوا: لَوْ عَلِمْنَا أَنَّكَ رَسُولُ اللهِ لَاتَّبَعْنَاكَ، وَلَكِنِ اكْتُبِ اسْمَكَ وَاسْمَ أَبِيكَ، فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «اكْتُبْ مِنْ مُحَمَّدِ بْنِ عَبْدِ اللهِ»، فَاشْتَرَطُوا عَلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ مَنْ جَاءَ مِنْكُمْ لَمْ نَرُدَّهُ عَلَيْكُمْ، وَمَنْ جَاءَكُمْ مِنَّا رَدَدْتُمُوهُ عَلَيْنَا، فَقَالُوا: يَا رَسُولَ اللهِ، أَنَكْتُبُ هَذَا؟ قَالَ: «نَعَمْ، إِنَّهُ مَنْ ذَهَبَ مِنَّا إِلَيْهِمْ فَأَبْعَدَهُ اللهُ، وَمَنْ جَاءَنَا مِنْهُمْ سَيَجْعَلُ اللهُ لَهُ فَرَجًا وَمَخْرَجًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12197,
                "hadithNumber": "4633",
                "englishNarrator": "It has been narrated on the authority of Abu Wa'il who said:",
                "hadithEnglish": "Sahal bin Hunaif رضی اللہ عنہ stood up on the Day of Siffin and said: O ye people, blame yourselves (for want of discretion) ; we were with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) on the Day of Hudaibiya. If we had thought it fit to fight, we could fight. This was in the truce between the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and the polytheists. Umar bin Khattab رضی اللہ عنہ came, approached the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and said: Messenger of Allah, aren't we fighting for truth and they for falsehood? He replied: By all means. He asked: Are not those killed from our side in Paradise and those killed. from their side in the Fire? He replied: Yes. He said: Then why should we put a blot upon our religion and return, while Allah has not decided the issue between them and ourselves? He said: Son of Khattab, I am the Messenger of Allah. Allah will never ruin me. (The narrator said): Umar رضی اللہ عنہ went away, but he could not contain himself with rage. So he approached Abu Bakr رضی اللہ عنہ and said: 'Abu Bakr رضی اللہ عنہ , aren't we fighting for truth and they for falsehood? He replied: Yes. He asked: Aren't those killed from our side in Paradise and those killed from their side in the Fire? He replied: Why not? He (then) said: Why should we then disgrace our religion and return while God has not yet decided the issue between them and ourselves? Abu Bakr رضی اللہ عنہ said: Son of Khattab, verily, he is the Messenger of Allah, and Allah will never ruin him. (The narrator continued): At this (a Sura of) the Qur'an (giving glad tidings of the victory) was revealed to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). He sent for Umar رضی اللہ عنہ and made him read it. He asked: Is (this truce) a victory? He (the Messenger of Allah) replied: Yes. At this Umar رضی اللہ عنہ was pleased, and returned.",
                "hadithUrdu": "سہل بن حنیف رضی اللہ عنہ جنگ صفین کے روز کھڑے ہوئے اور ( لوگوں کو مخاطب کر کے ) کہا : لوگو! ( امیر المومنین پر الزام لگانے کے بجائے ) خود کو الزام دو ( صلح کو مسترد کر کے اللہ اور اس کے بتائے ہوئے راستے سے تم ہٹ رہے ہو ) ہم حدیبیہ کے دن رسول اللہ صلی اللہ علیہ وسلم کے ہمراہ تھے اور اگر ہم جنگ ( ہی کو ناگزیر ) دیکھتے تو جنگ کر گزرتے ۔ یہ اس صلح کا واقعہ ہے جو رسول اللہ صلی اللہ علیہ وسلم اور مشرکین کے درمیان ہوئی ۔ ( اب تو مسلمانوں کے دو گروہوں کا معاملہ ہے ۔ ) عمر بن خطاب رضی اللہ عنہ آئے ، رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور کہا : اے اللہ کے رسول! کیا ہم حق پر اور وہ باطل پر نہیں؟ آپ نے فرمایا : \" کیوں نہیں! \" عرض کی : کیا ہمارے مقتول جنت میں اور ان کے مقتول آگ میں نہ جائیں گے؟ فرمایا : \" کیوں نہیں! \" عرض کی : تو ہم اپنے دین میں نیچے لگ کر ( صلح ) کیوں کریں ( نیچے لگ کر کیوں صلح کریں؟ ) اور اس طرح کیوں لوٹ جائیں کہ اللہ نے ہمارے اور ان کے درمیان فیصلہ نہیں کیا؟ تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" خطاب کے بیٹے! میں اللہ کا رسول ہوں ، ( اس کے حکم سے صلح کر رہا ہوں ) اللہ مجھے کبھی ضائع نہیں کرے گا ۔ \" کہا : عمر رضی اللہ عنہ غصے کے عالم میں چل پڑے اور صبر نہ کر سکے ۔ وہ ابوبکر رضی اللہ عنہ کے پاس آئے اور کہا : اے ابوبکر! کیا ہم حق پر اور وہ باطل پر نہیں؟ کہا : کیوں نہیں! کہا : کیا ہمارے مقتول جنت میں اور ان کے مقتول آگ میں نہیں؟ انہوں نے کہا : کیوں نہیں! ( حضرت عمر رضی اللہ عنہ نے ) کہا : تو ہم اپنے دین میں نیچے لگ کر ( جیسی صلح وہ چاہتے ہیں انہیں ) کیوں دیں؟ اور اس طرح کیوں لوٹ جائیں کہ اللہ نے ہمارے اور ان کے درمیان فیصلہ نہیں کیا؟ تو انہوں نے کہا : ابن خطاب! وہ اللہ کے رسول ہیں ، اللہ انہیں ہرگز کبھی ضائع نہیں کرے گا ۔ کہا : تو رسول اللہ صلی اللہ علیہ وسلم پر فتح ( کی خوشخبری ) کے ساتھ قرآن اترا ۔ آپ صلی اللہ علیہ وسلم نے عمر رضی اللہ عنہ کو بلوایا اور انہیں ( جو نازل ہوا تھا ) وہ پڑھوایا ۔ انہوں نے عرض کی : اے اللہ کے رسول! کیا یہ فتح ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا : \" ہاں ۔ \" تو ( اس پر ) عمر رضی اللہ عنہ کا دل خوش ہو گیا اور وہ لوٹ آئے.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے عبداللہ بن نمیر نے بیان کیا، کہا کہ ہم سے ابن نمیر نے بیان کیا، اور ہم سے میرے والد نے بیان کیا، انہوں نے کہا عبدالعزیز بن سیاح، حبیب بن ابی ثابت نے ابووائل ( شقیق ) سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللهِ بْنُ نُمَيْرٍ، ح وحَدَّثَنَا ابْنُ نُمَيْرٍ، وَتَقَارَبَا فِي اللَّفْظِ، حَدَّثَنَا أَبِي، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ سِيَاهٍ، حَدَّثَنَا حَبِيبُ بْنُ أَبِي ثَابِتٍ، عَنْ أَبِي وَائِلٍ، قَالَ: قَامَ سَهْلُ بْنُ حُنَيْفٍ يَوْمَ صِفِّينَ، فَقَالَ: أَيُّهَا النَّاسُ، اتَّهِمُوا أَنْفُسَكُمْ، لَقَدْ كُنَّا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْحُدَيْبِيَةِ وَلَوْ نَرَى قِتَالًا لَقَاتَلْنَا، وَذَلِكَ فِي الصُّلْحِ الَّذِي كَانَ بَيْنَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَبَيْنَ الْمُشْرِكِينَ، فَجَاءَ عُمَرُ بْنُ الْخَطَّابِ، فَأَتَى رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: يَا رَسُولَ اللهِ، أَلَسْنَا عَلَى حَقٍّ وَهُمْ عَلَى بَاطِلٍ؟ قَالَ: «بَلَى»، قَالَ: أَلَيْسَ قَتْلَانَا فِي الْجَنَّةِ وَقَتْلَاهُمْ فِي النَّارِ؟ قَالَ: «بَلَى»، قَالَ: فَفِيمَ نُعْطِي الدَّنِيَّةَ فِي دِينِنَا، وَنَرْجِعُ، وَلَمَّا يَحْكُمِ اللهُ بَيْنَنَا وَبَيْنَهُمْ، فَقَالَ: «يَا ابْنَ الْخَطَّابِ، إِنِّي رَسُولُ اللهِ وَلَنْ يُضَيِّعَنِي اللهُ أَبَدًا»، قَالَ: فَانْطَلَقَ عُمَرُ فَلَمْ يَصْبِرْ مُتَغَيِّظًا، فَأَتَى أَبَا بَكْرٍ، فَقَالَ: يَا أَبَا بَكْرٍ أَلَسْنَا عَلَى حَقٍّ وَهُمْ عَلَى بَاطِلٍ؟ قَالَ: بَلَى، قَالَ: أَلَيْسَ قَتْلَانَا فِي الْجَنَّةِ وَقَتْلَاهُمْ فِي النَّارِ؟ قَالَ: بَلَى، قَالَ: فَعَلَامَ نُعْطِي الدَّنِيَّةَ فِي دِينِنَا، وَنَرْجِعُ وَلَمَّا يَحْكُمِ اللهُ بَيْنَنَا وَبَيْنَهُمْ؟ فَقَالَ: يَا ابْنَ الْخَطَّابِ، إِنَّهُ رَسُولُ اللهِ وَلَنْ يُضَيِّعَهُ اللهُ أَبَدًا، قَالَ: فَنَزَلَ الْقُرْآنُ عَلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِالْفَتْحِ، فَأَرْسَلَ إِلَى عُمَرَ، فَأَقْرَأَهُ إِيَّاهُ، فَقَالَ: يَا رَسُولَ اللهِ، أَوْ فَتْحٌ هُو؟ قَالَ: «نَعَمْ»، فَطَابَتْ نَفْسُهُ وَرَجَعَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12198,
                "hadithNumber": "4634",
                "englishNarrator": "It has been narrated on the authority of Shaqiq who said:",
                "hadithEnglish": "I heard Sahl bin Hunaif  رضی اللہ عنہ say at Siffin: O ye people, find fault with your (own) discretion. By Allah, on the Day of Abu Jandal (i. e. the day of Hudaibiya), I thought to myself that, if I could, I would reverse the order of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) (the terms of the truce being unpalatable). By Allah, we have never hung our swords on our shoulders in any situation whatsoever except when they made easy for us to realise the goal envisaged by us, but this battle of yours (seems to be an exception). Ibn Numair (in his version) did not mention the words: In any situation whatsoever",
                "hadithUrdu": "میں نے صفین میں سہل بن حنیف رضی اللہ عنہ کو یہ کہتے ہوئے سنا : لوگو! اپنی رائے پر ( غلط ہونے کا ) الزام لگاؤ ۔ اللہ کی قسم! میں نے ابوجندل ( کے واقعے ) کے دن اپنے آپ کو اس حالت میں دیکھا کہ اگر میں رسول اللہ صلی اللہ علیہ وسلم کے ( صلح کے ) معاملے کو رد کر سکتا تو رد کر دیتا ۔ اللہ کی قسم! ہم نے کبھی کسی کام کے لیے اپنے کندھوں پر تلواریں نہیں رکھیں تھیں مگر ان تلواروں نے ہمارے لیے ایسے معاملے تک پہنچنے میں آسانی کر دی جس کو ہم جانتے تھے ، سوائے تمہارے موجودہ معاملے کے ۔ ابن نمیر نے \" کبھی کسی معاملے کے لیے \" کے الفاظ بیان نہیں کیے.",
                "urduNarrator": "ابوکریب محمد بن علاء اور محمد بن عبداللہ بن نمیر دونوں نے کہا : ہمیں ابومعاویہ نے اعمش سے ، انہوں نے شقیق ( بن سلمہ ابو وائل ) سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ، وَمُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، قَالَا: حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ شَقِيقٍ، قَالَ: سَمِعْتُ سَهْلَ بْنَ حُنَيْفٍ، يَقُولُ بِصِفِّينَ: «أَيُّهَا النَّاسُ، اتَّهِمُوا رَأْيَكُمْ، وَاللهِ، لَقَدْ رَأَيْتُنِي يَوْمَ أَبِي جَنْدَلٍ، وَلَوْ أَنِّي أَسْتَطِيعُ أَنْ أَرُدَّ أَمْرَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لَرَدَدْتُهُ، وَاللهِ، مَا وَضَعْنَا سُيُوفَنَا عَلَى عَوَاتِقِنَا إِلَى أَمْرٍ قَطُّ، إِلَّا أَسْهَلْنَ بِنَا إِلَى أَمْرٍ نَعْرِفُهُ إِلَّا أَمْرَكُمْ هَذَا»، لَمْ يَذْكُرِ ابْنُ نُمَيْرٍ إِلَى أَمْرٍ قَطُّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12199,
                "hadithNumber": "4635",
                "englishNarrator": "It was narrated from Al-Amash with this chain (a similar hadith as no. 4634), except that he said:",
                "hadithEnglish": "For any purpose that could be difficult for us.",
                "hadithUrdu": "\" ایسے کام کی طرف جو ہمیں مشکل میں مبتلا کر رہا تھا\".",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ اور اسحاق نے بیان کیا, جریر اور وکیع دونوں نے اعمش سے اسی سند کے ساتھ روایت کی ، ان دونوں کی حدیث میں یہ الفاظ ہیں",
                "hadithArabic": "وَحَدَّثَنَاهُ عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ جَمِيعًا عَنْ جَرِيرٍ، ح وحَدَّثَنِي أَبُو سَعِيدٍ الْأَشَجُّ، حَدَّثَنَا وَكِيعٌ، كِلَاهُمَا عَنِ الْأَعْمَشِ، بِهَذَا الْإِسْنَادِ، وَفِي حَدِيثِهِمَا إِلَى أَمْرٍ يُفْظِعُنَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12200,
                "hadithNumber": "4636",
                "englishNarrator": "It has been narrated through a different chain of transmitters on the authority of Abu Wa'il who said:",
                "hadithEnglish": "I heard Sahl bin Hunaif رضی اللہ عنہ say at Siffin: Blame (the hollowness) of your views about your religion. I thought to myself on the day of Abu Jandal that if I could turn down the order of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), I would. The situation was so difficult that if we mended it at one place, it was rent at another.",
                "hadithUrdu": "میں نے صفین میں سہل بن حنیف رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے : اپنے دین کے مقابلے میں اپنی رائے پر الزام دھرو ۔ ابوجندل ( کے واقعے ) کے دن میں نے خود کو اس حالت میں دیکھا کہ اگر میں رسول اللہ صلی اللہ علیہ وسلم کے فیصلے کو رد کر سکتا ( تو حاشا و کلا رد کر دیتا ۔ ) لیکن یہ معاملہ ایسا ہے کہ ہم اس کے ایک کونے کو مضبوط نہیں کر پاتے کہ ہمارے سامنے اس کا دوسرا کونا کھل جاتا ہے ۔ ( کیونکہ یہ مسلمانوں کا آپس میں اختلاف ہے)",
                "urduNarrator": "مجھ سے ابراہیم بن سعید الجوہری نے بیان کیا، ہم سے ابو اسامہ نے بیان کیا، مالک بن مغل کی سند سے, ابوحصین نے ابووائل سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي إِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ مَالِكِ بْنِ مِغْوَلٍ، عَنْ أَبِي حَصِينٍ، عَنْ أَبِي وَائِلٍ، قَالَ: سَمِعْتُ سَهْلَ بْنَ حُنَيْفٍ بِصِفِّينَ، يَقُولُ: «اتَّهِمُوا رَأْيَكُمْ عَلَى دِينِكُمْ، فَلَقَدْ رَأَيْتُنِي يَوْمَ أَبِي جَنْدَلٍ وَلَوْ أَسْتَطِيعُ أَنْ أَرُدَّ أَمْرَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مَا فَتَحْنَا مِنْهُ فِي خُصْمٍ، إِلَّا انْفَجَرَ عَلَيْنَا مِنْهُ خُصْمٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12201,
                "hadithNumber": "4637",
                "englishNarrator": "It has been narrated on the authority of Anas bin Malik رضی اللہ عنہ who said:",
                "hadithEnglish": "When they (Companions of the Holy Prophet ﷺ) were overwhelmed with grief and distress on his return from Hudaibiya where he had slaughtered his sacrificial beasts (not being allowed to proceed to Mecca), the Qur'anic verse: Inna fatahna... laka fathan mobinan to fauzan 'aziman, was revealed to him. (At this) he said: On me has descended a verse that is dearer to me than the whole world.",
                "hadithUrdu": "جب آیت : ( إِنَّا فَتَحْنَا لَكَ فَتْحًا مُّبِينًا ﴿﴾ لِّيَغْفِرَ لَكَ ٱللَّـهُ ۔ ۔ ۔ فَوْزًا عَظِيمًا ﴿﴾ ) تک اتری ( تو یہ ) آپ صلی اللہ علیہ وسلم کی حدیبیہ سے واپسی کا موقع تھا اور لوگوں کے دلوں میں غم اور دکھ کی کیفیت طاری تھی ، آپ صلی اللہ علیہ وسلم نے حدیبیہ میں قربانی کے اونٹ نحر کر دیے تھے تو ( اس موقع پر ) آپ نے فرمایا : \" مجھ پر ایک ایسی آیت نازل کی گئی ہے جو مجھے پوری دنیا سے زیادہ محبوب ہے.",
                "urduNarrator": "ہم سے نصر بن علی الجضمی نے بیان کیا، کہا ہم سے خالد بن حارث نے بیان کیا، سعید بن ابی عروبہ نے ہمیں قتادہ سے حدیث سنائی کہ حضرت انس بن مالک رضی اللہ عنہ نے انہیں حدیث سنائی ، کہا",
                "hadithArabic": "وحَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، أَنَّ أَنَسَ بْنَ مَالِكٍ، حَدَّثَهُمْ، قَالَ: لَمَّا نَزَلَتْ: {إِنَّا فَتَحْنَا لَكَ فَتْحًا مُبِينًا لِيَغْفِرَ لَكَ اللهُ} [الفتح: 2] إِلَى قَوْلِهِ {فَوْزًا عَظِيمًا} [النساء: 73] مَرْجِعَهُ مِنَ الْحُدَيْبِيَةِ، وَهُمْ يُخَالِطُهُمُ الْحُزْنُ وَالْكَآبَةُ، وَقَدْ نَحَرَ الْهَدْيَ بِالْحُدَيْبِيَةِ، فَقَالَ: «لَقَدْ أُنْزِلَتْ عَلَيَّ آيَةٌ هِيَ أَحَبُّ إِلَيَّ مِنَ الدُّنْيَا جَمِيعًا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12202,
                "hadithNumber": "4638",
                "englishNarrator": null,
                "hadithEnglish": "A Hadith like that of Ibn Abi Arubah (no. 4639) was narrated from Qatadah, from Anas رضی اللہ عنہ .",
                "hadithUrdu": "ہم سے عاصم بن الندر التیمی نے بیان کیا, معتمر کے والد ( سلیمان ) ، ہمام اور شیبان سب نے قتادہ سے روایت کی ، انہوں نے حضرت انس رضی اللہ عنہ سے سعید بن ابی عروبہ کی حدیث کی طرح روایت کی.",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا عَاصِمُ بْنُ النَّضْرِ التَّيْمِيُّ، حَدَّثَنَا مُعْتَمِرٌ، قَالَ: سَمِعْتُ أَبِي، حَدَّثَنَا قَتَادَةُ، قَالَ: سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، ح وحَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا أَبُو دَاوُدَ، حَدَّثَنَا هَمَّامٌ، ح وحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، حَدَّثَنَا شَيْبَانُ، جَمِيعًا عَنْ قَتَادَةَ، عَنْ أَنَسٍ، نَحْوَ حَدِيثِ ابْنِ أَبِي عَرُوبَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12203,
                "hadithNumber": "4639",
                "englishNarrator": "It has been reported on the authority of Hudbaifa bin al-Yaman رضی اللہ عنہ who said:",
                "hadithEnglish": "Nothing prevented me from being present at! he Battle of Badr except this incident. I came out with my father Husail (to participate in the Battle), but we were caught by the disbelievers of Quraish. They said: (Do) you intend to go to Muhammad? We said: We do not intend to go to him, but we wish to go (back) to Medina. So they took from us a covenant in the name of God that we would turn back to Medina and would not fight on the side of Muhammad ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). So, we came to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and related the incident to him. He said: Both, of you proceed (to Medina); we will fulfil the covenant made with them and seek God's help against them.",
                "hadithUrdu": "مجھے بدر کی گواہی سے کسی چیز نے نہیں روکا سوائے اس کے کہ میں اور میرے والس حسیل رضی اللہ عنہ ( جو یمان کے لقب سے معروف تھے ) دونوں نکلے تو ہمیں کفار قریش نے پکڑ لیا اور کہا : تم محمد صلی اللہ علیہ وسلم کے پاس جانا چاہتے ہو؟ ہم نے کہا : ان کے پاس جانا نہیں چاہتے ، ہم تو صرف مدینہ منورہ جانا چاہتے ہیں ۔ انہوں نے ہم سے اللہ کے نام پر یہ عہد اور میثاق لیا کہ ہم مدینہ جائیں گے لیکن آپ صلی اللہ علیہ وسلم کے ساتھ مل کر جنگ نہیں کریں گے ، ہم نے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو کر آپ کو یہ خبر دی ، آپ صلی اللہ علیہ وسلم نے فرمایا : \" تم دونوں لوٹ جاؤ ، ہم ان سے کیا ہوا عہد پورا کریں گے اور ان کے خلاف اللہ تعالیٰ سے مدد مانگیں گے.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے ابو اسامہ نے بیان کیا، ان سے ولید بن جمعہ نے بیان کیا، ہم سے ابو طفیل نے بیان کیا، وہ حذیفہ بن الیمان انہوں نے کہ",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنِ الْوَلِيدِ بْنِ جُمَيْعٍ، حَدَّثَنَا أَبُو الطُّفَيْلِ، حَدَّثَنَا حُذَيْفَةُ بْنُ الْيَمَانِ، قَالَ: مَا مَنَعَنِي أَنْ أَشْهَدَ بَدْرًا إِلَّا أَنِّي خَرَجْتُ أَنَا وَأَبِي حُسَيْلٌ، قَالَ: فَأَخَذَنَا كُفَّارُ قُرَيْشٍ، قَالُوا: إِنَّكُمْ تُرِيدُونَ مُحَمَّدًا، فَقُلْنَا: مَا نُرِيدُهُ، مَا نُرِيدُ إِلَّا الْمَدِينَةَ، فَأَخَذُوا مِنَّا عَهْدَ اللهِ وَمِيثَاقَهُ لَنَنْصَرِفَنَّ إِلَى الْمَدِينَةِ، وَلَا نُقَاتِلُ مَعَهُ، فَأَتَيْنَا رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَأَخْبَرْنَاهُ الْخَبَرَ، فَقَالَ: «انْصَرِفَا، نَفِي لَهُمْ بِعَهْدِهِمْ، وَنَسْتَعِينُ اللهَ عَلَيْهِمْ.",
                "headingArabic": "الْوَفَاءِ بِالْعَهْدِ",
                "headingUrdu": "معاہدوں کو برقرار رکھنا",
                "headingEnglish": "Upholding Covenants",
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12204,
                "hadithNumber": "4640",
                "englishNarrator": "It has been narrated by Ibrahim al-Taimi on the authority of his father who said:",
                "hadithEnglish": "We were sitting in the company of Hudhaifa رضی اللہ عنہ . A man said: If I were in the time of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), I would have fought by his side and would have striven hard for his causes. Hudhaifa رضی اللہ عنہ said: You might have done that, (but you should not make a flourish of your enthusiasm). I was with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) on the night of the Battle of Abzib and we were gripped by a violent wind and severe cold. The Messenger of Allah (may peace be him) said: Hark, the man who (goes reconnoitring and) brings me the news of the enemy shall be ranked with me on the Day of Judgment by Allah (the Glorious and Exalted). We all kept quiet and none of us responed to him. (Again) he said: Hark, a man who (goes reconnoitring and) brings me the news of the enemy shall be ranked with me on the Day of Judgment by Allah (the Glorious and Exalted). We kept quiet and none of us responded to him. He again said: Hark, a man who (goes reconnoitring and) brings me the news of the enemy shall be ranked with me on the Day of Judgtuent by Allah (the Glorious and Exalted) Then he said: Get up Hudhaifa, bring me the news of the enemy. When he called me by name I had no alternative but to get up. He said: Go and bring me information about the enemy, and do nothing that may provoke them against me. When I left him, I felt warm as if I were walking in a heated bath untill I reached them. I saw Abu Sufyan warming his back against fire I put an arrow in the middle of the bow. intending to shoot at him, when I recalled the words of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) Do not provoke them against me. Had I shot at him, I would have hit him. But I returned and (felt warm as if) I were walking in a heated bath (hammam). Presenting myself before him, I gave him information about the enemy. When I had done so, I began to feel cold, so the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) wrapped me in a blanket that he had in excess to his own requirement and with which he used to cover himself while saying his prayers. So I continued to sleep until it was morning. When it was morning he said: Get up, O heavy sleeper.",
                "hadithUrdu": "ہم حضرت حذیفہ رضی اللہ عنہ کے پاس تھے ، ایک آدمی نے کہا : اگر میں رسول اللہ صلی اللہ علیہ وسلم کے عہد مبارک کو پا لیتا تو آپ کی معیت میں جہاد کرتا اور خوب لڑتا ، حضرت حذیفہ رضی اللہ عنہ نے فرمایا : کیا تم ایسا کرتے؟ میں نے غزوہ احزاب کی رات ہم سب کو دیکھا کہ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے ، ہمیں تیز ہوا اور سردی نے اپنی گرفت میں لے رکھا تھا ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کیا کوئی ایسا مرد ہے جو مجھے ( اس ) قوم ( کے اندر ) کی خبر لا دے؟ قیامت کے دن اللہ تعالیٰ اس کو میرے ساتھ رکھے! \" ہم خاموش رہے اور ہم میں سے کسی نے آپ کو کوئی جواب نہ دیا ، آپ صلی اللہ علیہ وسلم نے پھر فرمایا : \" کوئی شخص ہے جو میرے پاس ان لوگوں کی خبر لے آئے؟ قیامت کے دن اللہ تعالیٰ اس کو میرے ساتھ رکھے! \" ہم خاموش رہے اور ہم میں سے کسی نے کوئی جواب نہ دیا ۔ آپ صلی اللہ علیہ وسلم نے پھر فرمایا : \" ہے کوئی شخص جو ان لوگوں کی خبر لا دے؟ قیامت کے دن اللہ تعالیٰ اس کو میری رفاقت عطا فرمائے! \" ہم خاموش رہے ، ہم میں سے کسی نے کوئی جواب نہ دیا ، آپ نے فرمایا : \" حذیفہ! کھڑے ہو جاؤ اور تم مجھے ان کی خبر لا کے دو ۔ \" جب آپ نے میرا نام لے کر بلایا تو میں نے اُٹھنے کے سوا کئی چارہ نہ پایا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" جاؤ ان لوگوں کی خبریں مجھے لا دو اور انہیں میرے خلاف بھڑکا نہ دینا ۔ \" ( کوئی ایسی بات یا حرکت نہ کرنا کہ تم پکڑے جاؤ ، اور وہ میرے خلاف بھڑک اٹھیں ) جب میں آپ کے پاس سے گیا تو میری حالت یہ ہو گئی جیسے میں حمام میں چل رہا ہوں ، ( پسینے میں نہایا ہوا تھا ) یہاں تک کہ میں ان کے پاس پہنچا ، میں نے دیکھا کہ ابوسفیان اپنی پشت آگ سے سینک رہا ہے ، میں نے تیر کو کمان کی وسط میں رکھا اور اس کو نشانہ بنا دینا چاہا ، پھر مجھے رسول اللہ صلی اللہ علیہ وسلم کا یہ فرمان یاد آ گیا کہ \" انہیں میرے خلاف بھڑکا نہ دینا \" ( کہ جنگ اور تیز ہو جائے ) اگر میں اس وقت تیر چلا دیتا تو وہ نشانہ بن جاتا ، میں لوٹا تو ( مجھے ایسے لگ رہا تھا ) جیسے میں حمام میں چل رہا ہوں ، پھر جب میں آپ کی خدمت میں حاضر ہوا تو میں نے آپ کو ان لوگوں کی ( ساری ) خبربتائی اور میں فارغ ہوا تو مجھے ٹھنڈ لگنے لگی ، رسول اللہ صلی اللہ علیہ وسلم نے مجھے ( اپنی اس ) عبا کا بچا ہوا حصہ اوڑھا دیا جو آپ ( کے جسم اطہر ) پر تھی ، آپ اس میں نماز پڑھ رہے تھے ۔ میں ( اس کو اوڈھ کر ) صبح تک سوتا رہا ، جب صبح ہوئی تو آپ نے فرمایا : \" اے خوب سونے والے! اُٹھ جاو.",
                "urduNarrator": "ہم سے زہیر بن حرب اور اسحاق بن ابراہیم نے جریر کی سند سے بیان کیا، انہوں نے کہا: ہم سے جریر نے اعمش کی سند سے بیان کیا, ابراہیم تیمی کے والد ( یزید بن شریک ) سے روایت ہے ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، جَمِيعًا عَنْ جَرِيرٍ، قَالَ زُهَيْرٌ: حَدَّثَنَا جَرِيرٌ، عَنِ الْأَعْمَشِ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنْ أَبِيهِ، قَالَ: كُنَّا عِنْدَ حُذَيْفَةَ، فَقَالَ رَجُلٌ: لَوْ أَدْرَكْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَاتَلْتُ مَعَهُ وَأَبْلَيْتُ، فَقَالَ حُذَيْفَةُ: أَنْتَ كُنْتَ تَفْعَلُ ذَلِكَ؟ لَقَدْ رَأَيْتُنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لَيْلَةَ الْأَحْزَابِ، وَأَخَذَتْنَا رِيحٌ شَدِيدَةٌ وَقُرٌّ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَلَا رَجُلٌ يَأْتِينِي بِخَبَرِ الْقَوْمِ جَعَلَهُ اللهُ مَعِي يَوْمَ الْقِيَامَةِ؟» فَسَكَتْنَا فَلَمْ يُجِبْهُ مِنَّا أَحَدٌ، ثُمَّ قَالَ: «أَلَا رَجُلٌ يَأْتِينَا بِخَبَرِ الْقَوْمِ جَعَلَهُ اللهُ مَعِي يَوْمَ الْقِيَامَةِ؟» فَسَكَتْنَا فَلَمْ يُجِبْهُ مِنَّا أَحَدٌ، ثُمَّ قَالَ: «أَلَا رَجُلٌ يَأْتِينَا بِخَبَرِ الْقَوْمِ جَعَلَهُ اللهُ مَعِي يَوْمَ الْقِيَامَةِ؟»، فَسَكَتْنَا فَلَمْ يُجِبْهُ مِنَّا أَحَدٌ، فَقَالَ: «قُمْ يَا حُذَيْفَةُ، فَأْتِنَا بِخَبَرِ الْقَوْمِ»، فَلَمْ أَجِدْ بُدًّا إِذْ دَعَانِي بِاسْمِي أَنْ أَقُومَ، قَالَ: «اذْهَبْ فَأْتِنِي بِخَبَرِ الْقَوْمِ، وَلَا تَذْعَرْهُمْ عَلَيَّ»، فَلَمَّا وَلَّيْتُ مِنْ عِنْدِهِ جَعَلْتُ كَأَنَّمَا أَمْشِي فِي حَمَّامٍ حَتَّى أَتَيْتُهُمْ، فَرَأَيْتُ أَبَا سُفْيَانَ يَصْلِي ظَهْرَهُ بِالنَّارِ، فَوَضَعْتُ سَهْمًا فِي كَبِدِ الْقَوْسِ فَأَرَدْتُ أَنْ أَرْمِيَهُ، فَذَكَرْتُ قَوْلَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «وَلَا تَذْعَرْهُمْ عَلَيَّ»، وَلَوْ رَمَيْتُهُ لَأَصَبْتُهُ فَرَجَعْتُ وَأَنَا أَمْشِي فِي مِثْلِ الْحَمَّامِ، فَلَمَّا أَتَيْتُهُ فَأَخْبَرْتُهُ بِخَبَرِ الْقَوْمِ، وَفَرَغْتُ قُرِرْتُ، فَأَلْبَسَنِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنْ فَضْلِ عَبَاءَةٍ كَانَتْ عَلَيْهِ يُصَلِّي فِيهَا، فَلَمْ أَزَلْ نَائِمًا حَتَّى أَصْبَحْتُ، فَلَمَّا أَصْبَحْتُ قَالَ: «قُمْ يَا نَوْمَانُ».",
                "headingArabic": "غَزْوَةِ الأَحْزَابِ ‏‏",
                "headingUrdu": "جنگ الاحزاب (ملفوظات)",
                "headingEnglish": "The Battle of Al-Ahzab (The Confederates)",
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12205,
                "hadithNumber": "4641",
                "englishNarrator": "It has been reported on the authority of Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "(when the enemy got the upper hand) on the day of the Battle of Uhud, the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was left with only seven men from the Ansar and two men from the Quraish. When the enemy advanced towards him and overwhelmed him, he said: Whoso turns them away from us will attain Paradise or will be my Companion in Paradise. A man from the Ansar came forward and fought (the enemy) until he was killed. The enemy advanced and overwhelmed him again and he repeated the words: Whoso turns them away, from us will attain Paradise or will be my Companion in Paradise. A man from the Ansar came forward and fought until he was killed. This state continued until the seven Ansar were killed (one after the other). Now, the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to his two Companions: We have not done justice to our Companions.",
                "hadithUrdu": "جنگ اُحد کے دن رسول اللہ صلی اللہ علیہ وسلم ، انصار کے سات اور قریش کے دو آدمیوں ( سعد بن ابی وقاص اور طلحہ بن عبیداللہ تیمی رضی اللہ عنہ ) کے ساتھ ( لشکر سے الگ کر کے ) تنہا کر دیے گئے ، جب انہوں نے آپ کو گھیر لیا تو آپ نے فرمایا : \" ان کو ہم سے کون ہٹائے گا؟ اس کے لیے جنت ہے ، یا ( فرمایا : ) وہ جنت میں میرا رفیق ہو گا ۔ \" تو انصار میں سے ایک شخص آگے بڑھا اور اس وقت تک لڑتا رہا ، یہاں تک کہ وہ شہید ہو گیا ، انہوں نے پھر سے آپ کو گھیر لیا ، آپ نے فرمایا : \" انہیں کون ہم سے دور ہٹائے گا؟ اس کے لیے جنت ہے ، یا ( فرمایا : ) وہ جنت میں میرا رفیق ہو گا ۔ \" پھر انصار میں سے ایک شخص آگے بڑھا وہ لڑا حتی کہ شہید ہو گیا ، پھر یہ سلسلہ یونہی چلتا رہا حتی کہ وہ ساتوں انصاری شہید ہو گئے ، پھر رسول اللہ صلی اللہ علیہ وسلم نے اپنے ( ان قریشی ) ساتھیوں سے فرمایا : \" ہم نے اپنے ساتھیوں کے ساتھ انصاف نہیں کیا.",
                "urduNarrator": "ہم سے حداب بن خالد الازدی نے بیان کیا، کہا ہم سے حماد بن سلمہ نے بیان کیا، علی بن زید اور ثابت البنانی نے, حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "وحَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ الْأَزْدِيُّ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ عَلِيِّ بْنِ زَيْدٍ، وَثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أُفْرِدَ يَوْمَ أُحُدٍ فِي سَبْعَةٍ مِنَ الْأَنْصَارِ وَرَجُلَيْنِ مِنْ قُرَيْشٍ، فَلَمَّا رَهِقُوهُ، قَالَ: «مَنْ يَرُدُّهُمْ عَنَّا وَلَهُ الْجَنَّةُ؟» - أَوْ «هُوَ رَفِيقِي فِي الْجَنَّةِ» -، فَتَقَدَّمَ رَجُلٌ مِنَ الْأَنْصَارِ، فَقَاتَلَ حَتَّى قُتِلَ، ثُمَّ رَهِقُوهُ أَيْضًا، فَقَالَ: «مَنْ يَرُدُّهُمْ عَنَّا وَلَهُ الْجَنَّةُ؟ -» أَوْ «هُوَ رَفِيقِي فِي الْجَنَّةِ» -، فَتَقَدَّمَ رَجُلٌ مِنَ الْأَنْصَارِ، فَقَاتَلَ حَتَّى قُتِلَ، فَلَمْ يَزَلْ كَذَلِكَ حَتَّى قُتِلَ السَّبْعَةُ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِصَاحِبَيْهِ: «مَا أَنْصَفْنَا أَصْحَابَنَا».",
                "headingArabic": "غَزْوَةِ أُحُدٍ ‏‏",
                "headingUrdu": "جنگ احد",
                "headingEnglish": "The Battle of Uhud",
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12206,
                "hadithNumber": "4642",
                "englishNarrator": "It has been narrated on the authority of Abd-ul-'Aziz bin Abu Hazim, who learnt from his father (Abu Hazim):",
                "hadithEnglish": "The latter heard it from Sahl bin Sa'd رضی اللہ عنہ who was asked about the injury which the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) got on the day of the Battle of Uhud. He said: The face of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was injured, his front teeth were damaged and his helmet was crushed. Fatima رضی اللہ عنہا , the daughter of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), was washing the blood (from his head), and 'Ali bin Abu Talib رضی اللہ عنہ was pouring water on it from a shield. When Fatima رضی اللہ عنہا saw that the bleeding had increased on account of (pouring) water (on the wound), she took a piece of mat and burnt it until it was reduced to ashes. She put the ashes on the wound and the bleeding stopped.",
                "hadithUrdu": "انہوں نے حضرت سہل بن سعد رضی اللہ عنہ سے سنا ، ان سے جنگ اُحد کے دن رسول اللہ صلی اللہ علیہ وسلم کے زخمی ہونے کے متعلق سوال کیا جا رہا تھا ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم کا چہرہ مبارک زخمی ہو گیا تھا اور سامنے ( ثنایا کے ساتھ ) کا ایک دانت ( رباعی ) ٹوٹ گیا تھا اور خود سر مبارک پر ٹکڑے ٹکڑے ہو گیا تھا ۔ رسول اللہ صلی اللہ علیہ وسلم کی صاجزادی سیدہ فاطمہ رضی اللہ عنہا ( آپ کے چہرے سے ) خود دھو رہی تھیں اور حضرت علی بن ابی طالب رضی اللہ عنہ ڈھال سے اس ( زخم ) پر پانی ڈال رہے تھے ، جب سیدہ فاطمہ رضی اللہ عنہا نے یہ دیکھا کہ پانی ڈالنے سے خون نکلنے میں اضافہ ہو رہا ہے تو انہوں نے چٹائی کا ایک ٹکڑا لے کر جلایا وہ راکھ ہو گیا ، پھر اس کو زخم پر لگا دیا تو خون رک گیا.",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ التمیمی نے بیان کیا، کہا ہم سے عبدالعزیز بن نے بیان کیا, ابوحازم کے بیٹے عبدالعزیز نے اپنے والد سے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، أَنَّهُ سَمِعَ سَهْلَ بْنَ سَعْدٍ، يَسْأَلُ عَنْ جُرْحِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَوْمَ أُحُدٍ، فَقَالَ: «جُرِحَ وَجْهُ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَكُسِرَتْ رَبَاعِيَتُهُ، وَهُشِمَتِ الْبَيْضَةُ عَلَى رَأْسِهِ، فَكَانَتْ فَاطِمَةُ بِنْتُ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ تَغْسِلُ الدَّمَ، وَكَانَ عَلِيُّ بْنُ أَبِي طَالِبٍ يَسْكُبُ عَلَيْهَا بِالْمِجَنِّ، فَلَمَّا رَأَتْ فَاطِمَةُ أَنَّ الْمَاءَ لَا يَزِيدُ الدَّمَ إِلَّا كَثْرَةً، أَخَذَتْ قِطْعَةَ حَصِيرٍ فَأَحْرَقَتْهُ حَتَّى صَارَ رَمَادًا، ثُمَّ أَلْصَقَتْهُ بِالْجُرْحِ، فَاسْتَمْسَكَ الدَّمُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12207,
                "hadithNumber": "4643",
                "englishNarrator": "It has been reported on the authority of Abu Hazim who heard from Sahl bin Sa'd رضی اللہ عنہ :",
                "hadithEnglish": "The latter was asked about the injury of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). He said: By God, I know the person who washed the wound of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), who poured water on it and with what the wound was treated. Then Sahl narrated the same tradition as has been narrated by 'Abdul-'Aziz except that he added the words: And his face was injured and replaced the word Hushimat by Kusirat (i.e. it was broken).",
                "hadithUrdu": "ان سے رسول اللہ صلی اللہ علیہ وسلم کے زخم کے متعلق سوال کیا جا رہا تھا ، انہوں نے کہا : سنو! اللہ کی قسم! مجھے اچھی طرح معلوم ہے کہ رسول اللہ صلی اللہ علیہ وسلم کا زخم کون دھو رہا تھا اور پانی کون ڈال رہا تھا اور آپ کے زخم پر کون سی دوائی لگائی گئی ، پھر عبدالعزیز کی حدیث کی طرح بیان کیا ، مگر انہوں نے یہ اضافہ کیا : اور آپ کا چہرہ انور زخمی ہو گیا اور ۔ ۔ ( خود ) ٹکڑے ٹکڑے ہو گیا ۔ ۔ کی جگہ \" ٹوٹ گیا \" کہا.",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, یعقوب بن عبدالرحمن القاری نے ابوحازم سے بیان کیا کہ انہوں نے حضرت سہل بن سعد رضی اللہ عنہ سے سنا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْقَارِيَّ، عَنْ أَبِي حَازِمٍ، أَنَّهُ سَمِعَ سَهْلَ بْنَ سَعْدٍ، وَهُوَ يَسْأَلُ عَنْ جُرْحِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: أَمَ وَاللهِ، إِنِّي لَأَعْرِفُ مَنْ كَانَ يَغْسِلُ جُرْحَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَمَنْ كَانَ يَسْكُبُ الْمَاءَ، وَبِمَاذَا دُووِيَ جُرْحُهُ، ثُمَّ ذَكَرَ نَحْوَ حَدِيثِ عَبْدِ الْعَزِيزِ، غَيْرَ أَنَّهُ زَادَ: وَجُرِحَ وَجْهُهُ، وَقَالَ مَكَانَ هُشِمَتْ: كُسِرَتْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12208,
                "hadithNumber": "4644",
                "englishNarrator": "This hadith was narrated from Sahl bin Sa'd رضی اللہ عنہ ( a similar hadith to no. 4642) from the prophet ﷺ. In the Hadith of Ibn Abi Hilal (it say):",
                "hadithEnglish": "His face was injured. And in the Hadith of Ibn Mutarrif it say: His face was wounded.",
                "hadithUrdu": "\" آپ کا چہرہ مبارک نشانہ بنایا گیا \" اور ابن مطرف کی حدیث میں ہے : \" آپ کا چہرہ مبارک زخمی ہوا.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، زہیر بن حرب، اسحاق بن ابراہیم اور ابن ابی عمر نے روایت کی ہے, ابن عیینہ ، سعید بن ابی ہلال اور محمد بن مطرف ، ان سب نے ابوحازم سے ، انہوں نے حضرت سہل بن سعد رضی اللہ عنہ سے یہی حدیث نبی صلی اللہ علیہ وسلم سے روایت کی ، ابن ابی ہلال کی حدیث میں ہے",
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ أَبِي عُمَرَ، جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، ح وحَدَّثَنَا عَمْرُو بْنُ سَوَّادٍ الْعَامِرِيُّ، أَخْبَرَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ سَعِيدِ بْنِ أَبِي هِلَالٍ، ح وحَدَّثَنِي مُحَمَّدُ بْنُ سَهْلٍ التَّمِيمِيُّ، حَدَّثَنِي ابْنُ أَبِي مَرْيَمَ، حَدَّثَنَا مُحَمَّدٌ يَعْنِي ابْنَ مُطَرِّفٍ، كُلُّهُمْ عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، بِهَذَا الْحَدِيثِ عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فِي حَدِيثِ ابْنِ أَبِي هِلَالٍ أُصِيبَ وَجْهُهُ، وَفِي حَدِيثِ ابْنِ مُطَرِّفٍ جُرِحَ وَجْهُهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12209,
                "hadithNumber": "4645",
                "englishNarrator": "It has been narrated on the authority of Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had his front teeth damaged on the day of the Battle of Uhud, and got a wound on his head. He was wiping the blood (from his face) and was saying: How will these people attain salvation who have wounded their Prophet and broken his tooth while he called them towards God? At this time, God, the Exalted and Glorious, revealed the Verse: Thou hast no authority (iii. 127).",
                "hadithUrdu": "جنگ اُحد کے دن رسول اللہ صلی اللہ علیہ وسلم کا ( ثنائیہ کے ساتھ والا ) رباعی دانت ٹوٹ گیا اور آپ کے سر اقدس میں زخم لگا ، آپ اپنے سر سے خون پونچھتے تھے اور فرماتے تھے : \" وہ قوم کیسے فلاح پائے گی جس نے اپنے نبی کے سر میں زخم لگایا اور اس کا رباعی کا دانت توڑ دیا ، اور وہ انہیں اللہ کی طرف بلا رہا تھا ۔ \" اس موقع پر اللہ تعالیٰ نے یہ آیت نازل فرمائی : \" اس معاملے میں آپ کے ہاتھ میں کوئی چیز نہیں ( کہ وہ اللہ ان کی طرف توجہ فرمائے یا ان کو عذاب دے کہ وہ ظالم ہیں.",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ بن قعنب نے بیان کیا، کہا ہم سے حماد بن سلمہ نے، ثابت کی سند سے, حضرت انس رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كُسِرَتْ رَبَاعِيَتُهُ يَوْمَ أُحُدٍ، وَشُجَّ فِي رَأْسِهِ، فَجَعَلَ يَسْلُتُ الدَّمَ عَنْهُ، وَيَقُولُ: «كَيْفَ يُفْلِحُ قَوْمٌ شَجُّوا نَبِيَّهُمْ، وَكَسَرُوا رَبَاعِيَتَهُ، وَهُوَ يَدْعُوهُمْ إِلَى اللهِ؟»، فَأَنْزَلَ اللهُ عَزَّ وَجَلَّ: {لَيْسَ لَكَ مِنَ الْأَمْرِ شَيْءٌ} [آل عمران: 128",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12210,
                "hadithNumber": "4646",
                "englishNarrator": "It has been narrated on the authority of 'Abdullah رضی اللہ عنہ who said:",
                "hadithEnglish": "It appeared to me as if I saw the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) (and heard him) relate the story of a Prophet who had been beaten by his people, was wiping the blood from his face and was saying. My Lord, forgive my people, for they do not know.",
                "hadithUrdu": "جیسے میں رسول اللہ صلی اللہ علیہ وسلم کی طرف دیکھ رہا ہوں ، آپ انبیاء میں سے ایک نبی کا واقعہ بیان فرما رہے تھے جنہیں ان کی قوم نے مارا ، وہ اپنے چہرے سے خون پونچھ رہے تھے اور ( یہ ) فرما رہے تھے : \" اے اللہ! میری قوم کو معاف کر دے ، وہ نہیں جانتے ( کہ وہ کیا کر رہے ہیں).",
                "urduNarrator": "محمد بن عبداللہ بن نمیر نے ہمیں حدیث بیان کی ، کہا : ہمیں وکیع نے حدیث بیان کی ، کہا : ہمیں اعمش نے شقیق سے حدیث بیان کی ، انہوں نے عبداللہ ( بن مسعود ) رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا الْأَعْمَشُ، عَنْ شَقِيقٍ، عَنْ عَبْدِ اللهِ، قَالَ: كَأَنِّي أَنْظُرُ إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَحْكِي نَبِيًّا مِنَ الْأَنْبِيَاءِ ضَرَبَهُ قَوْمُهُ، وَهُوَ يَمْسَحُ الدَّمَ عَنْ وَجْهِهِ، وَيَقُولُ: «رَبِّ اغْفِرْ لِقَوْمِي فَإِنَّهُمْ لَا يَعْلَمُونَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12211,
                "hadithNumber": "4647",
                "englishNarrator": "It was narrated from Al-Amash with this chain (a hadith similar to no. 4645), except that he said:",
                "hadithEnglish": "He wiped the blood from his forehead.",
                "hadithUrdu": "تو وہ ( نبی علیہ السلام ) اپنی پیشانی سے خون پونچھتے جاتے تھے.",
                "urduNarrator": "ابوبکر بن ابی شیبہ نے کہا : ہمیں وکیع اور محمد بن بشر نے اعمش سے اسی سند کے ساتھ روایت بیان کی ، اس میں انہوں نے یہ کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، وَمُحَمَّدُ بْنُ بِشْرٍ، عَنِ الْأَعْمَشِ، بِهَذَا الْإِسْنَادِ غَيْرَ أَنَّهُ قَالَ: فَهُوَ يَنْضِحُ الدَّمَ عَنْ جَبِينِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12212,
                "hadithNumber": "4648",
                "englishNarrator": "It has been narrated by Hammam bin Munabbih who said:",
                "hadithEnglish": "This is what has been related to us by Abu Huraira رضی اللہ عنہ from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). (With this introduction) he narrated a number of traditions. One of these was that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Great is the wrath of Allah upon a people who have done this to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), and he was at that time pointing to his front teeth. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) also said: Great is the wrath of Allah upon a person who has been killed by the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) in the way of Allah, the Exalted and Glorious.",
                "hadithUrdu": "یہ احادیث ہیں جو ہمیں حضرت ابوہریرہ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے بیان کیں ، انہوں نے کئی احادیث بیان کیں ، ان میں سے ایک یہ ہے : اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اس قوم پر اللہ کا غضب شدید ہو گیا جنہوں نے اللہ کے رسول صلی اللہ علیہ وسلم کے ساتھ یہ کیا \" آپ اس وقت اپنے رباعی دانت کی طرف اشارہ فرما رہے تھے ۔ اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ تعالیٰ اس شخص پر سخت غضب ناک ہوتا ہے جس کو اللہ کا رسول صلی اللہ علیہ وسلم اللہ کی راہ میں ( جہاد کرتے ہوئے ) قتل کر دے.",
                "urduNarrator": "ہم سے محمد بن رافع نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، کہا ہم سے معمر نے بیان کیا, ہمام بن منبہ سے روایت ہے ، کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ: هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَذَكَرَ أَحَادِيثَ مِنْهَا، وَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «اشْتَدَّ غَضَبُ اللهِ عَلَى قَوْمٍ فَعَلُوا هَذَا بِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ» وَهُوَ حِينَئِذٍ يُشِيرُ إِلَى رَبَاعِيَتِهِ وَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «اشْتَدَّ غَضَبُ اللهِ عَلَى رَجُلٍ يَقْتُلُهُ رَسُولُ اللهِ فِي سَبِيلِ اللهِ عَزَّ وَجَلَّ.",
                "headingArabic": "اشْتِدَادِ غَضَبِ اللَّهِ عَلَى مَنْ قَتَلَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏‏",
                "headingUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے ہاتھوں قتل ہونے والے پر اللہ کا شدید غضب",
                "headingEnglish": "The intense wrath of Allah towards the one who was killed by the messenger of Allah (saws)",
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12213,
                "hadithNumber": "4649",
                "englishNarrator": "It has been narrated on the authority of Ibn Mas'ud رضی اللہ عنہ who said:",
                "hadithEnglish": "While the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was saying his prayer near the Ka'ba and Abu Jahl with his companions was sitting (near by), Abu Jahl said, referring to the she-camel that had been slaughtered the previous day: Who will rise to fetch the foetus of the she-camel of so and so, and place it between the shoulders of Muhammad when he goes down in prostration (a posture in prayer). The one most accursed among the people got up, brought the foetus and, when the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) went down in prostration, placed it between his shoulders. Then they laughed at him and some of them leaned upon the others with laughter. And I stood looking. If I had the power, I would have thrown it away from the back of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). The Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had bent down his head in prostration and did not raise it, until a man went (to his house) and informed (his daughter) Fatima رضی اللہ عنہا, who was a young girl (at that time) (about this ugly incident). She came and removed (the filthy thing) from him. Then she turned towards them rebuking them (the mischief-mongers). When the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had finished his prayer, he invoked God's imprecations upon them in a loud voice. When he prayed, he prayed thrice, and when he asked for God's blessings, he asked thrice. Then he said thrice: O Allah, it is for Thee to deal with the Quraish. When they heard his voice, laughter vanished from them and they feared his malediction. Then he said: O God, it is for Thee to deal with Abu Jahl bin Hisham, 'Utba bin Rabi'a, Shaiba bin Rabi'a. Walid bin Uqba, Umayya bin Khalaf, Uqba bin Abu Mu'ait (and he mentioned the name of the seventh person. which I did not remember). By One Who sent Muhammad with truth, I saw (all) those he had named lying slain on the Day of Badr. Their dead bodies were dragged to be thrown into a pit near the battlefield. Abu Ishaq had said that the name of Walid bin 'Uqba has been wrongly mentioned in this tradition.",
                "hadithUrdu": "ایک بار رسول اللہ صلی اللہ علیہ وسلم بیت اللہ کے پاس نماز پڑھ رہے تھے ، ابوجہل اور اس کے ساتھی بھی بیٹھے ہوئے تھے ، اور ایک دن پہلے ایک اونٹنی ذبح ہوئی تھی ۔ ابوجہل نے کہا : تم میں سے کون اٹھ کر بنی فلاں کے محلے سے اونٹنی کی بچے والی جھلی ( بچہ دانی ) لائے گا اور محمد سجدے میں جائیں تو اس کو ان کے کندھوں کے درمیان رکھ دے گا؟ قوم کا سب سے بدبخت شخص ( عقبہ بن ابی معیط ) اٹھا اور اس کو لے آیا ۔ جب نبی صلی اللہ علیہ وسلم سجدے میں گئے تو اس نے وہ جھلی آپ کے کندھوں کے درمیان رکھ دیا ، پھر وہ آپس میں خوب ہنسے اور ایک دورے پر گرنے لگے ۔ میں کھڑا ہوا دیکھ رہا تھا ، کاش! مجھے کچھ بھی تحفظ حاصل ہوتا تو میں اس جھلی کو رسول اللہ صلی اللہ علیہ وسلم کی پشت سے اٹھا کر پھینک دیتا ، نبی صلی اللہ علیہ وسلم سجدے میں تھے ۔ اپنا سر مبارک نہیں اٹھا رہے تھے ، حتی کہ ایک شخص نے جا کر حضرت فاطمہ رضی اللہ عنہا کو خبر دی ، وہ آئیں ، حالانکہ وہ اس وقت کم سن بچی تھیں ، انہوں نے وہ جھلی اٹھا کر آپ سے دور پھینکی ۔ پھر وہ ان لوگوں کی طرف متوجہ ہوئیں اور انہیں سخت سست کہا ۔ جب نبی صلی اللہ علیہ وسلم نے اپنی نماز مکمل کر لی تو آپ نے بآزاو بلند ان کے خلاف دعا کی ، آپ جب کوئی دعا کرتے تھے تو تین مرتبہ دہراتے اور آپ صلی اللہ علیہ وسلم اگر کچھ مانگتے تو تین بار مانگتے تھے ، پھر آپ نے تین مرتبہ فرمایا : \"\" اے اللہ! قریش پر گرفت فرما ۔ \"\" جب قریش نے آپ کی آواز سنی تو ان کی ہنسی جاتی رہی اور وہ آپ کی بددعا سے خوف زدہ ہو گئے ۔ آپ نے پھر بددعا فرمائی : اے اللہ! ابوجہل بن ہشام پر گرفت فرما اور عتبہ بن ربیعہ ، شیبہ بن ربیعہ ، ولید بن عقبہ ، امیہ بن خلف ، عقبہ بن ابی معیط پر گرفت فرما ۔ \"\" ۔ ۔ ( ابواسحاق نے کہا : ) انہوں ( عمرو بن میمون ) نے ساتویں شخص کا نام بھی لیا تھا لیکن وہ مجھے یاد نہیں رہا ( بعد ازاں ابواسحاق کو ساتویں شخص عمارہ بن ولید کا نام یاد آ گیا تھا ، صحیح البخاری ، حدیث : 520 ) ۔ ۔ ( ابن مسعود رضی اللہ عنہ نے کہا : ) اس ذات کی قسم جس نے محمد صلی اللہ علیہ وسلم کو حق کے ساتھ مبعوث کیا ہے! جن کا آپ نے نام لیا تھا میں نے بدر کے دن ان کو مقتول پڑے دیکھا ، پھر ان سب کو گھسیٹ کر کنویں ، بدر کے کنویں کی طرف لے جایا گیا اور انہیں اس میں ڈال دیا گیا ۔ ابواسحاق نے کہا : اس حدیث میں ولید بن عقبہ ( کا نام ) غلط ہے ۔ ( صحیح ولید بن عتبہ ہے)",
                "urduNarrator": "ہم سے عبداللہ بن عمر بن محمد بن ابان الجعفی نے بیان کیا، ان سے عبد الرحیم نے، یعنی ہم سے ابن سلیمان نے بیان کیا, زکریا ( بن ابی زائدہ ) نے ابواسحاق سے ، انہوں نے عمرو بن میمون اودی سے ، انہوں نے ابن مسعود رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا عَبْدُ اللهِ بْنُ عُمَرَ بْنِ مُحَمَّدِ بْنِ أَبَانَ الْجُعْفِيُّ، حَدَّثَنَا عَبْدُ الرَّحِيمِ يَعْنِي ابْنَ سُلَيْمَانَ، عَنْ زَكَرِيَّا، عَنْ أَبِي إِسْحَاقَ، عَنْ عَمْرِو بْنِ مَيْمُونٍ الْأَوْدِيِّ، عَنِ ابْنِ مَسْعُودٍ، قَالَ: بَيْنَمَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي عِنْدَ الْبَيْتِ، وَأَبُو جَهْلٍ وَأَصْحَابٌ لَهُ جُلُوسٌ، وَقَدْ نُحِرَتْ جَزُورٌ بِالْأَمْسِ، فَقَالَ أَبُو جَهْلٍ: أَيُّكُمْ يَقُومُ إِلَى سَلَا جَزُورِ بَنِي فُلَانٍ، فَيَأْخُذُهُ فَيَضَعُهُ فِي كَتِفَيْ مُحَمَّدٍ إِذَا سَجَدَ؟ فَانْبَعَثَ أَشْقَى الْقَوْمِ فَأَخَذَهُ، فَلَمَّا سَجَدَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَضَعَهُ بَيْنَ كَتِفَيْهِ، قَالَ: فَاسْتَضْحَكُوا، وَجَعَلَ بَعْضُهُمْ يَمِيلُ عَلَى بَعْضٍ وَأَنَا قَائِمٌ أَنْظُرُ، لَوْ كَانَتْ لِي مَنَعَةٌ طَرَحْتُهُ عَنْ ظَهْرِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَالنَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ سَاجِدٌ مَا يَرْفَعُ رَأْسَهُ حَتَّى انْطَلَقَ إِنْسَانٌ فَأَخْبَرَ فَاطِمَةَ، فَجَاءَتْ وَهِيَ جُوَيْرِيَةٌ، فَطَرَحَتْهُ عَنْهُ، ثُمَّ أَقْبَلَتْ عَلَيْهِمْ تَشْتِمُهُمْ، فَلَمَّا قَضَى النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ صَلَاتَهُ، رَفَعَ صَوْتَهُ، ثُمَّ دَعَا عَلَيْهِمْ، وَكَانَ إِذَا دَعَا دَعَا ثَلَاثًا، وَإِذَا سَأَلَ سَأَلَ ثَلَاثًا، ثُمَّ قَالَ: «اللهُمَّ، عَلَيْكَ بِقُرَيْشٍ» ثَلَاثَ مَرَّاتٍ، فَلَمَّا سَمِعُوا صَوْتَهُ ذَهَبَ عَنْهُمُ الضِّحْكُ، وَخَافُوا دَعْوَتَهُ، ثُمَّ قَالَ: «اللهُمَّ، عَلَيْكَ بِأَبِي جَهْلِ بْنِ هِشَامٍ، وَعُتْبَةَ بْنِ رَبِيعَةَ، وَشَيْبَةَ بْنِ رَبِيعَةَ، وَالْوَلِيدِ بْنِ عُقْبَةَ، وَأُمَيَّةَ بْنِ خَلَفٍ، وَعُقْبَةَ بْنِ أَبِي مُعَيْطٍ» - وَذَكَرَ السَّابِعَ وَلَمْ أَحْفَظْهُ - فَوَالَّذِي بَعَثَ مُحَمَّدًا صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِالْحَقِّ، لَقَدْ رَأَيْتُ الَّذِينَ سَمَّى صَرْعَى يَوْمَ بَدْرٍ، ثُمَّ سُحِبُوا إِلَى الْقَلِيبِ - قَلِيبِ بَدْرٍ - قَالَ أَبُو إِسْحَاقَ: «الْوَلِيدُ بْنُ عُقْبَةَ غَلَطٌ فِي هَذَا الْحَدِيثِ.",
                "headingArabic": "مَا لَقِيَ النَّبِيُّ صلى الله عليه وسلم مِنْ أَذَى الْمُشْرِكِينَ وَالْمُنَافِقِينَ ‏‏",
                "headingUrdu": "مشرکین اور منافقوں کے ہاتھوں نبی صلی اللہ علیہ وسلم کو جو ظلم و ستم برداشت کرنا پڑا",
                "headingEnglish": "The persecution suffered by the prophet (saws) at the hands of the idolaters and hypocrites",
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 11901,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=476",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=474",
                "label": "474",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=475",
                "label": "475",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=476",
                "label": "476",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=477",
                "label": "477",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=478",
                "label": "478",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=479",
                "label": "479",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=480",
                "label": "480",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=478",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=478",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=476",
        "to": 11925,
        "total": 40465
    }
}