{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 435,
        "data": [
            {
                "id": 11139,
                "hadithNumber": "3575",
                "englishNarrator": "A'isha (رضی اللہ عنہا) reported:",
                "hadithEnglish": "My foster uncle came to me and sought permission (to enter the house), but I refused him permission until I had solicited the opinion of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). When Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came, I said to him: My foster-uncle sought my permission to (enter the house), but I did not permit him, whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: You better admit your uncle (into the house). I ('A'isha) said: It was the woman who suckled me and not the man. (But he) said: He is your uncle, admit him.",
                "hadithUrdu": "میرے رضاعی چچا آئے ، وہ مجھ سے ( گھر کے ) اندر آنے کی اجازت چاہتے تھے ، میں نے انہیں اجازت دینے سے انکار کر دیا حتیٰ کہ رسول اللہ صلی اللہ علیہ وسلم سے اجازت لے لوں ۔ جب رسول اللہ صلی اللہ علیہ وسلم تشریف لائے تو میں نے عرض کی : میرے رضاعی چچا نے میرے پاس ( گھر کے اندر ) آنے کی اجازت مانگی تو میں نے انہیں اجازت دینے سے انکار کر دیا ۔ اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تمہارے چچا تمہارے پاس ( گھر میں ) آ جائیں ۔ \" میں نے کہا : مجھے عورت نے دودھ پلایا تھا ، مرد نے نہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" وہ تمہارے چچا ہیں ، وہ تمہارے گھر میں آ سکتے ہیں.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، کہا کہ ہم سے انہوں نے بیان کیا ابن نمیر نے ہشام سے حدیث بیان کی ، انہوں نے اپنے والد ( عروہ بن زبیر ) سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، قَالَا: حَدَّثَنَا ابْنُ نُمَيْرٍ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ: جَاءَ عَمِّي مِنَ الرَّضَاعَةِ يَسْتَأْذِنُ عَلَيَّ، فَأَبَيْتُ أَنْ آذَنَ لَهُ حَتَّى أَسْتَأْمِرَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَلَمَّا جَاءَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قُلْتُ: إِنَّ عَمِّي مِنَ الرَّضَاعَةِ اسْتَأْذَنَ عَلَيَّ فَأَبَيْتُ أَنْ آذَنَ لَهُ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «فَلْيَلِجْ عَلَيْكِ عَمُّكِ»، قُلْتُ: إِنَّمَا أَرْضَعَتْنِي الْمَرْأَةُ، وَلَمْ يُرْضِعْنِي الرَّجُلُ، قَالَ: «إِنَّهُ عَمُّكِ، فَلْيَلِجْ عَلَيْكِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11140,
                "hadithNumber": "3576",
                "englishNarrator": "This hadith has been narrated on the authority of Hisham with the same chain of transmitters (and the words are):",
                "hadithEnglish": "The brother of Abu'l-Qu'ais sought permission from her ('A'isha رضی اللہ عنہا ) (to enter the house). The rest is the same.",
                "hadithUrdu": "ابوقعیس کے بھائی نے ان ( حضرت عائشہ رضی اللہ عنہا ) کے ہاں آنے کی اجازت مانگی ۔ ۔ ۔ آگے اسی طرح بیان کیا.",
                "urduNarrator": "مجھ سے ابو الربیع الزہرانی نے بیان کیا، انہوں نے ہم سے بیان کیا حماد ، یعنی ابن زید نے ہمیں حدیث بیان کی ، کہا : ہمیں ہشام نے اسی سند سے حدیث بیان کی کہ",
                "hadithArabic": "وحَدَّثَنِي أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ، حَدَّثَنَا هِشَامٌ، بِهَذَا الْإِسْنَادِ، أَنَّ أَخَا أَبِي الْقُعَيْسِ اسْتَأْذَنَ عَلَيْهَا فَذَكَرَ نَحْوَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11141,
                "hadithNumber": "3577",
                "englishNarrator": "A similar report (as no. 3575) was narrated from Hisham, with this chain, except that he said:",
                "hadithEnglish": "\"Abu Al-Quais asked from permission to enter upon her.",
                "hadithUrdu": "ابوقیس نے ان کے ہاں آنے کی اجازت مانگی.",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے بیان کیا ابومعاویہ نے ہشام سے اسی سند کے ساتھ اسی کی طرح حدیث بیان کی مگر انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنْ هِشَامٍ، بِهَذَا الْإِسْنَادِ. نَحْوَهُ غَيْرَ أَنَّهُ قَالَ: اسْتَأْذَنَ عَلَيْهَا أَبُو الْقُعَيْسِ .",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11142,
                "hadithNumber": "3578",
                "englishNarrator": "A'isha (رضی اللہ عنہا) reported:",
                "hadithEnglish": "My foster-uncle Abu'l Ja'd (kunya of Aflah) sought permission from me, which I refused. (Hisham said to me that Abu'l-Ja'd was in fact Abu'l-Qu'ais). When Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came, I ('A'isha) informed him about it. He said: Why did you not permit him? Let your right hand or hand be besmeared with dust.",
                "hadithUrdu": "میرے رضاعی چچا ابوالجعد نے میرے پاس آنے کی اجازت مانگی تو میں نے انہیں انکار کر دیا ۔ ہشام نے مجھ سے کہا : یہ ابوقعیس ہی تھے ۔ پھر جب نبی صلی اللہ علیہ وسلم تشریف لائے تو میں نے آپ کو یہ بات بتائی ۔ آپ نے فرمایا : \" تم نے انہیں اجازت کیوں نہ دی؟ تمہارا دایاں ہاتھ یا تمہارا ہاتھ خاک آلود ہو.",
                "urduNarrator": "مجھ سے حسن بن علی الحلوانی اور محمد بن رافع نے بیان کیا، کہا کہ ہم سے عبدالرزاق نے بیان کیا، ہم سے ابن جریج نے بیان کیا,عطاء سے روایت ہے ، کہا : مجھے عروہ بن زبیر نے خبر دی کہ انہیں حضرت عائشہ رضی اللہ عنہا نے خبر دی ، کہا",
                "hadithArabic": "وحَدَّثَنِي الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، وَمُحَمَّدُ بْنُ رَافِعٍ، قَالَا: أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، عَنْ عَطَاءٍ، أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ، أَخْبَرَتْهُ قَالَتْ: اسْتَأْذَنَ عَلَيَّ عَمِّي مِنَ الرَّضَاعَةِ أَبُو الْجَعْدِ، فَرَدَدْتُهُ - قَالَ لِي هِشَامٌ: إِنَّمَا هُوَ أَبُو الْقُعَيْسِ - فَلَمَّا جَاءَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَخْبَرْتُهُ بِذَلِكَ، قَالَ: «فَهَلَّا أَذِنْتِ لَهُ تَرِبَتْ يَمِينُكِ» أَوْ «يَدُكِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11143,
                "hadithNumber": "3579",
                "englishNarrator": "A'isha (رضی اللہ عنہا) reported:",
                "hadithEnglish": "Her foster-uncle whose name was Aflah sought permission from her (to enter the house) but she observed seclusion from him, and informed Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) who said to her: Don't observe veil from him for he is Mahram (one with whom marriage cannot be contracted) on account of fosterage as one is Mahram on account of consanguinity.",
                "hadithUrdu": "ان کے رضاعی چچا نے ، جن کا نام افلح تھا ، ان کے ہاں آنے کی اجازت مانگی تو انہوں نے ان کے آگے پردہ کیا ( انہیں روک دیا ) اس کے بعد انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو بتایا تو آپ نے فرمایا : \" تم ان سے پردہ نہ کرو کیونکہ رضاعت سے بھی وہ سب رشتے حرام ہو جاتے ہیں جو نسب سے حرام ہوتے ہیں.",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ہم سے لیث نے بیان کیا، اور ہم سے محمد بن رومہ نے بیان کیا، ہم سے لیث نے بیان کیا، یزید بن ابی حبیب نے عراک ( بن مالک غفاری ) سے ، انہوں نے عروہ سے ، انہوں نے سیدہ عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے اسے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ رُمْح، أَخْبَرَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ عِرَاكٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّهَا أَخْبَرَتْهُ: أَنَّ عَمَّهَا مِنَ الرَّضَاعَةِ يُسَمَّى أَفْلَحَ. اسْتَأْذَنَ عَلَيْهَا فَحَجَبَتْهُ، فَأَخْبَرَتْ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ. فَقَالَ لَهَا: «لَا تَحْتَجِبِي مِنْهُ، فَإِنَّهُ يَحْرُمُ مِنَ الرَّضَاعَةِ مَا يَحْرُمُ مِنَ النَّسَبِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11144,
                "hadithNumber": "3580",
                "englishNarrator": "A'isha ( رضی اللہ عنہا) reported:",
                "hadithEnglish": "Aflah bin Qu'ais sought permission from me (to enter the house), but I refused to grant him the permission, and he sent me (the message saying): I am your uncle (in the sense) that the wife of my brother has suckled you, (but still) I refused to grant him permission. There came the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and I made a mention of it to him, and he said: He can enter (your house), for he is your uncle.",
                "hadithUrdu": "قعیس کے بیٹے افلح نے میرے ہاں آنے کی اجازت مانگی تو میں نے انہیں اجازت دینے سے انکار کر دیا ، انہوں نے پیغام بھیجا : میں آپ کا چچا ہوں ، میرے بھائی کی بیوی نے آپ کو دودھ پلایا ہے ، اس پر بھی میں نے انہیں اجازت دینے سے انکار کر دیا ، اس کے بعد رسول اللہ صلی اللہ علیہ وسلم تشریف لائے تو میں نے آپ صلی اللہ علیہ وسلم کے سامنے اس واقعے کا ذکر کیا ، آپ نے فرمایا : \" وہ تمہارے سامنے آ سکتا ہے وہ تمہارا چچا ہے.",
                "urduNarrator": "ہم سے عبید اللہ بن معاذ الانبری نے بیان کیا، کہا ہم سے میرے والد نے بیان کیا، کہا ہم سے شعبہ رضی اللہ عنہ نے بیان کیا, حکم نے عراک بن مالک سے ، انہوں نے عروہ سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ عِرَاكِ بْنِ مَالِكٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ: اسْتَأْذَنَ عَلَيَّ أَفْلَحُ بْنُ قُعَيْسٍ، فَأَبَيْتُ أَنْ آذَنَ لَهُ، فَأَرْسَلَ: إِنِّي عَمُّكِ، أَرْضَعَتْكِ امْرَأَةُ أَخِي، فَأَبَيْتُ أَنْ آذَنَ لَهُ، فَجَاءَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَذَكَرْتُ ذَلِكَ لَهُ، فَقَالَ: «لِيَدْخُلْ عَلَيْكِ فَإِنَّهُ عَمُّكِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11145,
                "hadithNumber": "3581",
                "englishNarrator": "Ali ( رضی اللہ عنہ) reported having said this:",
                "hadithEnglish": "Messenger of Allah, why is it that you select (your wife) from among the Quraish, but you ignore us (the nearest of the kin)? Thereupon he said: Have you anything for me (a suitable match for me)? I said; Yes, the daughter of Hamza رضی اللہ عنہ , whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: She is not lawful for me, for she is the daughter of my brother by reason of fosterage.",
                "hadithUrdu": "اللہ کے رسول! کیا وجہ ہے آپ ( نکاح کے لیے ) قریش ( کی عورتوں ) کے انتخاب کا اہتمام کرتے ہیں اور ہمیں ( بنو ہاشم کو ) چھوڑ دیتے ہیں ۔ آپ صلی اللہ علیہ وسلم نے پوچھا : \" تمہارے پاس کوئی شے ( رشتہ ) ہے؟ \" میں نے عرض کی : جی ہاں ، حمزہ رضی اللہ عنہ کی بیٹی ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" وہ میرے لیے حلال نہیں ( کیونکہ ) وہ میرے رضاعی بھائی کی بیٹی ہے.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، زہیر بن حرب اور محمد بن الاعلٰی نے بیان کیا، اور انہوں نے کہا ابومعاویہ نے ہمیں اعمش سے خبر دی ، انہوں نے سعد بن عبیدہ سے ، انہوں نے ابوعبدالرحمٰن سے اور انہوں نے حضرت علی رضی اللہ عنہ سے روایت کی ، انہوں نے کہا  میں نے عرض کی",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ الْعَلَاءِ، وَاللَّفْظُ لِأَبِي بَكْرٍ، قَالُوا: حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ سَعْدِ بْنِ عُبَيْدَةَ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ عَلِيٍّ، قَالَ: قُلْتُ: يَا رَسُولَ اللهِ، مَا لَكَ تَنَوَّقُ فِي قُرَيْشٍ وَتَدَعُنَا؟ فَقَالَ: «وَعِنْدَكُمْ شَيْءٌ؟» قُلْتُ: نَعَمْ، بِنْتُ حَمْزَةَ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّهَا لَا تَحِلُّ لِي، إِنَّهَا ابْنَةُ أَخِي مِنَ الرَّضَاعَةِ.",
                "headingArabic": "تَحْرِيمِ ابْنَةِ الأَخِ مِنَ الرَّضَاعَةِ ‏",
                "headingUrdu": "دودھ پلانے سے بھائی کی بیٹی کا نکاح حرام ہے۔",
                "headingEnglish": "The daughter of one's brother through breastfeeding is forbidden in marriage",
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11146,
                "hadithNumber": "3582",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been narrated on the authority of A'mash with the same chain of transmitters.",
                "hadithUrdu": "ہم سے عثمان بن ابی شیبہ اور اسحاق بن ابراہیم نے بیان کیا , جریر ، عبداللہ بن نمیر اور سفیان سب نے اعمش سے اسی سند کے ساتھ اسی کے مانند روایت کی.",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، عَنْ جَرِيرٍ، ح وحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، ح وحَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ سُفْيَانَ، كُلُّهُمْ عَنِ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11147,
                "hadithNumber": "3583",
                "englishNarrator": "Ibn Abbas ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "It was proposed that he (the Holy Prophet ﷺ) be married to the daughter of Hamza رضی اللہ عنہ , whereupon he said: She is not lawful for me for she is the daughter of my foster-brother, and that is unlawful by reason of fosterage what is unlawful by reason of genealogy.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم سے حضرت حمزہ رضی اللہ عنہ کی بیٹی ( کے ساتھ نکاح کرنے ) کے بارے میں خواہش کا اظہار کیا گیا تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" وہ میرے لیے حلال نہیں کیونکہ وہ میرے رضاعی بھائی کی بیٹی ہے اور رضاعت سے وہ سب رشتے حرام ہو جاتے ہیں جو رحم ( ولادت اور نسب ) سے حرام ہوتے ہیں.",
                "urduNarrator": "ہم سے حداب بن خالد نے بیان کیا, ہمام نے ہمیں حدیث بیان کی ، کہا : ہمیں قتادہ نے جابر بن زید سے حدیث بیان کی ، انہوں نے ابن عباس رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، عَنْ جَابِرِ بْنِ زَيْدٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أُرِيدَ عَلَى ابْنَةِ حَمْزَةَ، فَقَالَ: «إِنَّهَا لَا تَحِلُّ لِي، إِنَّهَا ابْنَةُ أَخِي مِنَ الرَّضَاعَةِ، وَيَحْرُمُ مِنَ الرَّضَاعَةِ مَا يَحْرُمُ مِنَ الرَّحِمِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11148,
                "hadithNumber": "3584",
                "englishNarrator": "The same report (no.3583) was narrated from Qatadah with the chain of Hamam, except that the Hadith of Shoubah ends with the words \"...",
                "hadithEnglish": "The daughter of my brother through the breastfeeding.\" In the Hadith of Saeed it says: \"Verily what become unlawful through breastfeeding is that which becomes unlawful through blood ties. \"And in the hadith of Bishr bin Umar (instead of the hadith from Jabir bin Zayd), it is: \"I heard from Jabir bin Zayd.\"",
                "hadithUrdu": "میرے رضاعی بھائی کی بیٹی ہے \" پر ختم ہو گئی اور سعید کی حدیث میں ہے : \" رضاعت سے وہ رشتے حرام ہو جاتے ہیں جو نسب سے حرام ہوتے ہیں ۔ \" اور بشر بن عمر کی روایت میں ( جابر بن زید سے روایت ہے کی بجائے یہ ) ہے : \" میں نے جابر بن زید سے سنا.",
                "urduNarrator": "ہم سے زہیر بن حرب نے بیان کیا، انہوں نے بیان کیا یحییٰ قطان اور بشر بن عمر نے شعبہ سے حدیث بیان کی ، شعبہ اور سعید بن ابی عروبہ دونوں نے قتادہ سے ہمام کی ( سابقہ ) سند کے ساتھ بالکل اسی طرح روایت کی ، مگر شعبہ کی حدیث آپ صلی اللہ علیہ وسلم کے قول : \"",
                "hadithArabic": "وَحَدَّثَنَاهُ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى وَهُوَ الْقَطَّانُ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ مِهْرَانَ الْقُطَعِيُّ، حَدَّثَنَا بِشْرُ بْنُ عُمَرَ، جَمِيعًا عَنْ شُعْبَةَ، ح وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، كِلَاهُمَا عَنْ قَتَادَةَ، بِإِسْنَادِ هَمَّامٍ سَوَاءً، غَيْرَ أَنَّ حَدِيثَ شُعْبَةَ، انْتَهَى عِنْدَ قَوْلِهِ: «ابْنَةُ أَخِي مِنَ الرَّضَاعَةِ»، وَفِي حَدِيثِ سَعِيدٍ : وَإِنَّهُ يَحْرُمُ مِنَ الرَّضَاعَةِ مَا يَحْرُمُ مِنَ النَّسَبِ ، وَفِي رِوَايَةِ بِشْرِ بْنِ عُمَرَ: سَمِعْتُ جَابِرَ بْنَ زَيْدٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11149,
                "hadithNumber": "3585",
                "englishNarrator": "Umm Salama (رضی اللہ عنہا), the wife of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ), said:",
                "hadithEnglish": "It was said to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌): Is not the daughter of Hamza رضی اللہ عنہ a suitable match for you? Or it was said: Why don't you propose to marry the daughter of Hamza, the son of Abdul-Muttalib رضی اللہ عنہ? Thereupon he said: Hamza رضی اللہ عنہ is my brother by reason of fosterage.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم سے عرض کی گئی : اللہ کے رسول! آپ حمزہ رضی اللہ عنہ کی بیٹی ( کے ساتھ نکاح کرنے ) سے ( دور یا قریب ) کہاں ہیں؟ یا کہا گیا : کیا آپ حمزہ بن عبدالمطلب رضی اللہ عنہ کی بیٹی کو نکاح کا پیغام نہیں بھیجیں گے؟ آپ صلی اللہ علیہ وسلم نے فرمایا : \" حمزہ رضاعت کی بنا پر یقینی طور پر میرے بھائی ہیں.",
                "urduNarrator": "ہم سے ہارون بن سعید الایلی اور احمد بن عیسیٰ نے بیان کیا، کہا کہ ہم سے ابن وہب نے بیان کیا، مجھ سے مخرمہ بن بکیر نے اپنے والد سے بیان کیا، انہوں نے کہا: میں نے عبداللہ بن مسلم کو کہتے سنا: میں نے محمد بن مسلم کو کہتے سنا: میں نے حمید بن عبدالرحمٰن کو کہتے سنا, نبی صلی اللہ علیہ وسلم کی زوجہ محترمہ حضرت ام سلمہ رضی اللہ عنہا فرماتی ہیں کہ",
                "hadithArabic": "وحَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ، وَأَحْمَدُ بْنُ عِيسَى، قَالَا: حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي مَخْرَمَةُ بْنُ بُكَيْرٍ، عَنْ أَبِيهِ، قَالَ: سَمِعْتُ عَبْدَ اللهِ بْنَ مُسْلِمٍ، يَقُولُ: سَمِعْتُ مُحَمَّدَ بْنَ مُسْلِمٍ، يَقُولُ: سَمِعْتُ حُمَيْدَ بْنَ عَبْدِ الرَّحْمَنِ، يَقُولُ: سَمِعْتُ أُمَّ سَلَمَةَ، زَوْجَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ تَقُولُ: قِيلَ لِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: أَيْنَ أَنْتَ يَا رَسُولَ اللهِ؟ عَنِ ابْنَةِ حَمْزَةَ - أَوْ قِيلَ: أَلَا تَخْطُبُ بِنْتَ حَمْزَةَ بْنِ عَبْدِ الْمُطَّلِبِ؟ - قَالَ: «إِنَّ حَمْزَةَ أَخِي مِنَ الرَّضَاعَةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11150,
                "hadithNumber": "3586",
                "englishNarrator": "Umm Habiba, the daughter of Abu Sufyan رضی اللہ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came to me and I said to him: Have you any inclination towards my the daughter of Abu Sufyan رضی اللہ عنہ ? He (the Holy Prophet) said: Then what should I do? I said: Marry her. He said: Do you like that? I said: I am not the exclusive (wife) of yours; I, therefore, wish to join my sister in good. He, said: She is not lawful for me. I said: I have been informed that you have given the proposal of marriage to Durrah daughter of Abu Salama He raid: You mean the daughter of Umm Salama? I said: Yes. He said: Even if she had not been my step-daughter brought up under my guardianship, she would not have been lawful for me, for she is the daughter of my foster-brother (Hamza), for Thuwaiba had suckled me and her father. So do not give me the proposal of the marriage of your daughters and sisters.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم میرے ہاں تشریف لائے ، میں نے آپ سے عرض کی : کیا آپ میری بہن ( عَزہ ) بنت ابوسفیان کے بارے میں کوئی سوچ رکھتے ہیں؟ آپ نے پوچھا : \" میں کیا کروں؟ \" میں نے عرض کی : آپ اس سے نکاح کر لیں ، آپ نے فرمایا : \" کیا تم اس بات کو پسند کرتی ہو؟ \" میں نے عرض کی : میں اکیلی ہی آپ کی بیوی نہیں ہوں اور اپنے ساتھ خیر میں شریک ہونے ( کے معاملے ) میں ( میرے لیے ) سب سے زیادہ محبوب میری بہن ہے ۔ آپ نے فرمایا : \" وہ میرے لیے حلال نہیں ہے ۔ \" میں نے عرض کی : مجھے خبر دی گئی ہے کہ آپ دُرہ بنت ابوسلمہ رضی اللہ عنہا کے لیے نکاح کا پیغام بھیج رہے ہیں ۔ آپ نے پوچھا : \" ام سلمہ کی بیٹی کے لئے؟ \" میں نے عرض کی : جی ہاں ۔ آپ نے فرمایا : \" اگر وہ میری گود میں پروردہ ( ربیبہ ) نہ ہوتی تو بھی میرے لیے حلال نہ تھی ، وہ میرے رضاعی بھائی کی بیٹی ہے ، مجھے اور اس کے والد کو ثوبیہ نے دودھ پلایا تھا ، اس لیے تم خواتین میرے سامنے اپنی بیٹیوں اور بہنوں کے بارے میں پیش کش نہ کیا کرو.",
                "urduNarrator": "ہم سے ابو کریب محمد بن الاعلٰی نے بیان کیا,ابواسامہ نے ہمیں حدیث بیان کی ، کہا : ہمیں ہشام نے خبر دی ، کہا : مجھے میرے والد ( عروہ بن زبیر ) نے زینب بنت ام سلمہ رضی اللہ عنہا سے خبر دی ، انہوں نے ام حبیبہ بنت ابو سفیان رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ، حَدَّثَنَا أَبُو أُسَامَةَ، أَخْبَرَنَا هِشَامٌ، أَخْبَرَنِي أَبِي، عَنْ زَيْنَبَ بِنْتِ أُمِّ سَلَمَةَ، عَنْ أُمِّ حَبِيبَةَ بِنْتِ أَبِي سُفْيَانَ، قَالَتْ: دَخَلَ عَلَيَّ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقُلْتُ لَهُ: هَلْ لَكَ فِي أُخْتِي بِنْتِ أَبِي سُفْيَانَ؟ فَقَالَ: «أَفْعَلُ مَاذَا؟» قُلْتُ: تَنْكِحُهَا، قَالَ: «أَوَ تُحِبِّينَ ذَلِكِ؟» قُلْتُ: لَسْتُ لَكَ بِمُخْلِيَةٍ، وَأَحَبُّ مَنْ شَرِكَنِي فِي الْخَيْرِ أُخْتِي، قَالَ: «فَإِنَّهَا لَا تَحِلُّ لِي»، قُلْتُ: فَإِنِّي أُخْبِرْتُ أَنَّكَ تَخْطُبُ دُرَّةَ بِنْتَ أَبِي سَلَمَةَ، قَالَ: «بِنْتَ أُمِّ سَلَمَةَ؟» قُلْتُ: نَعَمْ، قَالَ: «لَوْ أَنَّهَا لَمْ تَكُنْ رَبِيبَتِي فِي حِجْرِي مَا حَلَّتْ لِي، إِنَّهَا ابْنَةُ أَخِي مِنَ الرَّضَاعَةِ، أَرْضَعَتْنِي وَأَبَاهَا ثُوَيْبَةُ، فَلَا تَعْرِضْنَ عَلَيَّ بَنَاتِكُنَّ، وَلَا أَخَوَاتِكُنَّ.",
                "headingArabic": "تَحْرِيمِ الرَّبِيبَةِ وَأُخْتِ الْمَرْأَةِ ‏",
                "headingUrdu": "سوتیلی بیٹی اور بیوی کی بہن سے نکاح کی ممانعت",
                "headingEnglish": "The prohibition of marriage to one's stepdaughter and the sister of one's wife",
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11151,
                "hadithNumber": "3587",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Hisham with the same chain of transmitters.",
                "hadithUrdu": "مجھ سے سوید بن سعید نے بیان کیا، انہوں نے ہم سے بیان کیا یحییٰ بن زکریا بن ابی زائدہ اور زہیر دونوں نے ہشام بن عروہ سے اسی سند کے ساتھ بالکل اسی طرح حدیث بیان کی.",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِيهِ سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّاءَ بْنِ أَبِي زَائِدَةَ، ح وحَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا الْأَسْوَدُ بْنُ عَامِرٍ، أَخْبَرَنَا زُهَيْرٌ، كِلَاهُمَا عَنْ هِشَامِ بْنِ عُرْوَةَ، بِهَذَا الْإِسْنَادِ سَوَاءً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11152,
                "hadithNumber": "3588",
                "englishNarrator": "Umm Habiba رضی اللہ عنہا the wife of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) reported:",
                "hadithEnglish": "She said to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌): Messenger of Allah, marry my sister 'Azza, whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Do you like it? She said: Yes, Messenger of Allah, I am not the exclusive wife of yours, and I wish that the person who joins me in good should be my sister. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: That is not lawful for me. I said: Messenger of Allah, we discussed that You intend to marry Durrah bint Abu Salama  رضی اللہ عنہا. He (the Holy Prophet) said: You mean the daughter of Abu Salama رضی اللہ عنہا? She said: Yes, whereupon Allah's Messenger (may. peace be upon him) said: Even if she were not the step-daughter of mine, brought up under my guardianship, she would not have been lawful for me, for she is the daughter of my foster-brother. Thuwaiba gave me suck and to Abu Salama (also), so do not offer to me your daughters and sisters.",
                "hadithUrdu": "انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے عرض کی ، اے اللہ کے رسول! میری بہن عزہ سے نکاح کر لیجئے ۔ رسول اللہ صلی اللہ علیہ وسلم نے پوچھا : \" کیا تم یہ پسند کرو گی؟ \" انہوں نے کہا : جی ہاں ، اللہ کے رسول! میں اکیلی آپ کی بیوی تو ہوں نہیں ، اور ( مجھے ) سب سے زیادہ محبوب ، جو خیر میں میرے ساتھ شریک ہو ، میری بہن ہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" وہ میرے لیے حلال نہیں ہے ۔ \" انہوں نے کہا : میں نے عرض کی : اے اللہ کے رسول! ہم سے یہ بات کی جاتی ہے کہ آپ درہ بنت ابوسلمہ رضی اللہ عنہا سے نکاح کرنا چاہتے ہیں ۔ آپ نے پوچھا : \" کیا ابوسلمہ کی بیٹی سے؟ \" انہوں نے جواب دیا : جی ہاں ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اگر وہ میری گود کی پروردہ ( ربیبہ ) نہ ہوتی تو بھی میرے لیے حلال نہ تھی ، وہ میرے رضاعی بھائی کی بیٹی ہے ، مجھے اور اس کے والد ابوسلمہ کو ثوبیہ نے دودھ پلایا تھا ، اس لیے تم مجھے اپنی بیٹیوں اور بہنوں ( کے ساتھ نکاح ) کی پیش کش نہ کیا کرو.",
                "urduNarrator": "ہم سے محمد بن روم بن المہاجر نے بیان کیا، کہا ہم سے لیث نے بیان کیا, یزید بن ابوحبیب سے روایت ہے کہ محمد بن شہاب ( زہری ) نے ( ان کی طرف ) یہ بیان کرتے ہوئے لکھا کہ عروہ نے انہیں حدیث سنائی ، زینب بنت ابوسلمہ رضی اللہ عنہا نے انہیں حدیث بیان کی کہ نبی صلی اللہ علیہ وسلم کی زوجہ محترمہ ام حبیبہ رضی اللہ عنہا نے ان سے بیان کیا",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ، أَخْبَرَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، أَنَّ مُحَمَّدَ بْنَ شِهَابٍ، كَتَبَ يَذْكُرُ، أَنَّ عُرْوَةَ، حَدَّثَهُ، أَنَّ زَيْنَبَ بِنْتَ أَبِي سَلَمَةَ، حَدَّثَتْهُ، أَنَّ أُمَّ حَبِيبَةَ زَوْجَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حَدَّثَتْهَا، أَنَّهَا قَالَتْ لِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: يَا رَسُولَ اللهِ، انْكِحْ أُخْتِي عَزَّةَ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَتُحِبِّينَ ذَلِكِ؟» فَقَالَتْ: نَعَمْ، يَا رَسُولَ اللهِ، لَسْتُ لَكَ بِمُخْلِيَةٍ، وَأَحَبُّ مَنْ شَرِكَنِي فِي خَيْرٍ أُخْتِي، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «فَإِنَّ ذَلِكِ لَا يَحِلُّ لِي»، قَالَتْ: فَقُلْتُ: يَا رَسُولَ اللهِ، فَإِنَّا نَتَحَدَّثُ أَنَّكَ تُرِيدُ أَنْ تَنْكِحَ دُرَّةَ بِنْتَ أَبِي سَلَمَةَ، قَالَ: «بِنْتَ أَبِي سَلَمَةَ؟» قَالَتْ: نَعَمْ، قَالَ: رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَوْ أَنَّهَا لَمْ تَكُنْ رَبِيبَتِي فِي حِجْرِي مَا حَلَّتْ لِي، إِنَّهَا ابْنَةُ أَخِي مِنَ الرَّضَاعَةِ، أَرْضَعَتْنِي وَأَبَا سَلَمَةَ ثُوَيْبَةُ فَلَا تَعْرِضْنَ عَلَيَّ بَنَاتِكُنَّ وَلَا أَخَوَاتِكُنَّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11153,
                "hadithNumber": "3589",
                "englishNarrator": null,
                "hadithEnglish": "The above hadith is narratted through other chains except they did not mention 'Azza like the chain of Yazid Bin Abi Habib.",
                "hadithUrdu": "مجھ سے عبدالملک بن شعیب بن لیث نے بیان کیا، میرے دادا نے مجھ سے بیان کیا,عقیل بن خالد اور محمد بن عبداللہ بن مسلم دونوں نے زہری سے ابن ابی حبیب کی ( سابقہ ) سند کے ساتھ اسی کی حدیث کے ہم معنی حدیث بیان کی اور یزید بن ابی حبیب کے سوا ان میں سے کسی نے اپنی حدیث میں عزہ ( بنت ابی سفیان رضی اللہ عنہا ) کا نام نہیں لیا.",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِيهِ عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي عُقَيْلُ بْنُ خَالِدٍ، ح وحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنِي يَعْقُوبُ بْنُ إِبْرَاهِيمَ الزُّهْرِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ مُسْلِمٍ، كِلَاهُمَا عَنِ الزُّهْرِيِّ، بِإِسْنَادِ ابْنِ أَبِي حَبِيبٍ، عَنْهُ نَحْوَ حَدِيثِهِ، وَلَمْ يُسَمِّ أَحَدٌ مِنْهُمْ فِي حَدِيثِهِ عَزَّةَ، غَيْرُ يَزِيدَ بْنِ أَبِي حَبِيبٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11154,
                "hadithNumber": "3590",
                "englishNarrator": "It was narrated that A'isha ( رضی اللہ عنہا) said:",
                "hadithEnglish": "Suwaid and Zubair reported Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: One suckling or two do not make (marriage) unlawful.",
                "hadithUrdu": "سوید اور زہیر نے کہا :بے شک نبی صلی اللہ علیہ وسلم نے فرمایا ۔ ۔ : \" ( دودھ کی ) ایک یا دو چسکیاں حرمت کا سبب نہیں بنتیں.\"",
                "urduNarrator": "زہیر بن حرب ، محمد بن عبداللہ بن نمیر اور سوید بن سعید نے ، اپنی اپنی سندوں سے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ۔ ۔",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، حَدَّثَنَا إِسْمَاعِيلُ، ح وحَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ، كِلَاهُمَا عَنْ أَيُّوبَ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عَبْدِ اللهِ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، قَالَتْ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: - وَقَالَ سُوَيْدٌ وَزُهَيْرٌ إِنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ -: «لَا تُحَرِّمُ الْمَصَّةُ وَالْمَصَّتَانِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11155,
                "hadithNumber": "3591",
                "englishNarrator": "Umm al-Fadl رضی اللہ عنہا reported:",
                "hadithEnglish": "A Bedouin came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) when he was in my house and said: Allah's Apostle, I have had a wife and I married another besides her, and my first wife claimed that she had suckled once or twice my newly married wife, thereupon Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: One suckling or two do not make the (marriage) unlawful.",
                "hadithUrdu": "ایک اعرابی اللہ کے نبی صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا جبکہ آپ میرے گھر میں تشریف فرما تھے ، اس نے عرض کی : اے اللہ کے نبی! ( پہلے ) میری ایک بیوی تھی ، اس پر میں نے دوسری سے شادی کر لی ، میری پہلی بیوی کا خیال ہے کہ اس نے میری نئی بیوی کو ایک یا دو مرتبہ دودھ پلایا تھا ۔ تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا : \" ایک دو مرتبہ دودھ دینا ( رشتے کو ) حرام نہیں کرتا ۔ \" عمرو نے اپنی روایت میں کہا : عبداللہ بن حارث بن نوفل سے روایت ہے ( عبداللہ کے والد کے ساتھ دادا کا نام بھی لیا).",
                "urduNarrator": "یحییٰ بن یحییٰ ، عمرو ناقد اور اسحاق بن ابراہیم سب نے معتمر سے حدیث بیان کی ۔ ۔ الفاظ یحییٰ کےہیں ۔ ۔ کہا : ہمیں معتمر بن سلیمان نے ایوب سے خبر دی ، وہ ابوخلیل سے حدیث بیان کر رہے تھے ، انہوں نے عبداللہ بن حارث سے ، انہوں نے ام فضل رضی اللہ عنہا سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَعَمْرٌو النَّاقِدُ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، كُلُّهُمْ عَنِ الْمُعْتَمِرِ، وَاللَّفْظُ لِيَحْيَى، أَخْبَرَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ، عَنْ أَيُّوبَ، يُحَدِّثُ عَنْ أَبِي الْخَلِيلِ، عَنْ عَبْدِ اللهِ بْنِ الْحَارِثِ، عَنْ أُمِّ الْفَضْلِ، قَالَتْ: دَخَلَ أَعْرَابِيٌّ عَلَى نَبِيِّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَهُوَ فِي بَيْتِي، فَقَالَ: يَا نَبِيَّ اللهِ، إِنِّي كَانَتْ لِي امْرَأَةٌ، فَتَزَوَّجْتُ عَلَيْهَا أُخْرَى، فَزَعَمَتِ امْرَأَتِي الْأُولَى أَنَّهَا أَرْضَعَتِ امْرَأَتِي الْحُدْثَى رَضْعَةً أَوْ رَضْعَتَيْنِ، فَقَالَ نَبِيُّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تُحَرِّمُ الْإِمْلَاجَةُ وَالْإِمْلَاجَتَانِ»، قَالَ عَمْرٌو فِي رِوَايَتِهِ: عَنْ عَبْدِ اللهِ بْنِ الْحَارِثِ بْنِ نَوْفَلٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11156,
                "hadithNumber": "3592",
                "englishNarrator": "Umm Fadl (رضی اللہ عنہا) reported:",
                "hadithEnglish": "A person from Banu 'Amir bin Sa'sa said: Allah's Apostle, does one suckling make the (marriage) unlawful? He said: No",
                "hadithUrdu": "بنو عامر بن صعصعہ کے ایک آدمی نے کہا : اے اللہ کے نبی! کیا ایک مرتبہ دودھ پینا رشتوں کو حرام کر دیتا ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا : \" نہیں.",
                "urduNarrator": "مجھ سے ابو غسان المسمعی نے بیان کیا، ہم سے معاذ نے بیان کیا، ہم سے ابن المثنیٰ اور ابن بشار نے بیان کیا، انہوں نے کہا: معاذ بن ہشام نے مجھے قتادہ سے حدیث بیان کی ، انہوں نے ابوخلیل صالح بن ابی مریم سے ، انہوں نے عبداللہ بن حارث سے اور انہوں نے ام فضل رضی اللہ عنہا سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنِي أَبُو غَسَّانَ الْمِسْمَعِيُّ، حَدَّثَنَا مُعَاذٌ، ح وحَدَّثَنَا ابْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنْ صَالِحِ بْنِ أَبِي مَرْيَمَ أَبِي الْخَلِيلِ، عَنْ عَبْدِ اللهِ بْنِ الْحَارِثِ، عَنْ أُمِّ الْفَضْلِ، أَنَّ رَجُلًا مِنْ بَنِي عَامِرِ بْنِ صَعْصَعَةَ، قَالَ: يَا نَبِيَّ اللهِ، هَلْ تُحَرِّمُ الرَّضْعَةُ الْوَاحِدَةُ؟ قَالَ: «لَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11157,
                "hadithNumber": "3593",
                "englishNarrator": "Umm Fadl (رضی اللہ عنہا) reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Being suckled once or twice, or one suckling or two, do not make marriage unlawful.",
                "hadithUrdu": "اللہ کے نبی صلی اللہ علیہ وسلم نے فرمایا : \" ایک یا دو مرتبہ دودھ پینا یا ایک دو مرتبہ دودھ چوسنا حرمت کا سبب نہیں بنتا.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، انہوں نے کہا ہمیں محمد بن بشر نے حدیث بیان کی ، کہا : ہمیں سعید بن ابی عروبہ نے قتادہ سے باقی ماندہ سابقہ سند کے ساتھ عبداللہ بن حارث سے روایت کی کہ ام فضل رضی اللہ عنہا نے حدیث بیان کی",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنْ أَبِي الْخَلِيلِ، عَنْ عَبْدِ اللهِ بْنِ الْحَارِثِ، أَنَّ أُمَّ الْفَضْلِ، حَدَّثَتْ، أَنَّ نَبِيَّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تُحَرِّمُ الرَّضْعَةُ أَوِ الرَّضْعَتَانِ، أَوِ الْمَصَّةُ أَوِ الْمَصَّتَانِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11158,
                "hadithNumber": "3594",
                "englishNarrator": "It was narration from Ibn Abi Arubah, with this chain (a Hadith similar to no. 3593) as for Ishaq, he said, as in the report Ibn Bashir:",
                "hadithEnglish": "\"...or two breastfeeding or two sucks.\" As for Ibn Abi Shaibah, he said: \"...and two breastfeeding and two sucks.\"",
                "hadithUrdu": "\" یا دو مرتبہ دودھ پینا یا دو مرتبہ دودھ چوسنا \" اور ابن ابی شیبہ نے کہا : \" اور دو مرتبہ دودھ پینا اور دو مربہ دودھ چوسنا.",
                "urduNarrator": "ابوبکر بن ابی شیبہ اور اسحاق بن ابراہیم دونوں نے عبدہ بن سلیمان سے اور انہوں نے ابن ابو عروبہ سے اسی سند کے ساتھ روایت کی لیکن اسحاق نے ابن بشر کی روایت کی طرح کہا",
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، جَمِيعًا عَنْ عَبْدَةَ بْنِ سُلَيْمَانَ، عَنِ ابْنِ أَبِي عَرُوبَةَ بِهَذَا الْإِسْنَادِ، أَمَّا إِسْحَاقُ، فَقَالَ كَرِوَايَةِ ابْنِ بِشْرٍ، أَوِ الرَّضْعَتَانِ أَوِ الْمَصَّتَانِ، وَأَمَّا ابْنُ أَبِي شَيْبَةَ، فَقَالَ: وَالرَّضْعَتَانِ وَالْمَصَّتَانِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11159,
                "hadithNumber": "3595",
                "englishNarrator": "Umm Fadl (رضی اللہ عنہا) reported:",
                "hadithEnglish": "Allah's Apostle (ﷺ) having said this: One or two sucklings do not make (the marriage) unlawful.",
                "hadithUrdu": "آپ نے فرمایا : \" ایک دو مرتبہ دودھ دینا حرمت کا سبب نہیں بنتا.",
                "urduNarrator": "ہم سے ابن ابی عمر نے بیان کیا، ہم سے بشر بن الساری نے بیان کیا، انہوں نے ہم سے بیان کیا حماد بن سلمہ نے ہمیں قتادہ سے باقی ماندہ اسی سند کے ساتھ ام فضل رضی اللہ عنہا سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی",
                "hadithArabic": "وحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ قَتَادَةَ، عَنْ أَبِي الْخَلِيلِ، عَنْ عَبْدِ اللهِ بْنِ الْحَارِثِ بْنِ نَوْفَلٍ، عَنْ أُمِّ الْفَضْلِ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تُحَرِّمُ الْإِمْلَاجَةُ وَالْإِمْلَاجَتَانِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11160,
                "hadithNumber": "3596",
                "englishNarrator": "Umm Fadl ( رضی اللہ عنہا) reported:",
                "hadithEnglish": "A person asked Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌): Does one suckling make (the marriage) unlawful? He said: No.",
                "hadithUrdu": "ایک آدمی نے نبی صلی اللہ علیہ وسلم سے سوال کیا : کیا ایک مرتبہ دودھ چوسنا ( رشتے کو ) حرام کر دیتا ہے؟ تو آپ نے جواب دیا : \" نہیں.",
                "urduNarrator": "مجھ سے احمد بن سعید الدارمی نے بیان کیا، کہا ہم سے حبان نے بیان کیا، انہوں نے بیان کیا ہمام نے ہمیں حدیث بیان کی ، کہا : ہمیں قتادہ نے باقی ماندہ اسی سند کے ساتھ ام فضل رضی اللہ عنہا سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي أَحْمَدُ بْنُ سَعِيدٍ الدَّارِمِيُّ، حَدَّثَنَا حَبَّانُ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، عَنْ أَبِي الْخَلِيلِ، عَنْ عَبْدِ اللهِ بْنِ الْحَارِثِ، عَنْ أُمِّ الْفَضْلِ، سَأَلَ رَجُلٌ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَتُحَرِّمُ الْمَصَّةُ؟ فَقَالَ: «لَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11161,
                "hadithNumber": "3597",
                "englishNarrator": "A'isha (رضی اللہ عنہا) reported:",
                "hadithEnglish": "It had been revealed in the Holy Qur'an that ten clear sucklings make the marriage unlawful, then it was abrogated (and substituted) by five sucklings and Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) died and it was before that time (found) in the Holy Qur'an (and recited by the Muslims).",
                "hadithUrdu": "قرآن میں نازل کیا گیا تھا کہ دس بار دودھ پلانا جن کا علم ہو ، حرمت کا سبب بن جاتا ہے ، پھر انہیں پانچ بار دودھ پلانے ( کے حکم ) سے جن کا علم ہو ، منسوخ کر دیا گیا ، رسول اللہ صلی اللہ علیہ وسلم فوت ہوئے تو یہ ان آیات میں تھی جن کی ( نسخ کا حکم نہ جاننے والے بعض لوگوں کی طرف سے ) قرآن میں تلاوت کی جاتی تھی.",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے مالک رضی اللہ عنہ سے پڑھا, عبداللہ بن ابی بکرہ نے عمرہ سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ عَبْدِ اللهِ بْنِ أَبِي بَكْرٍ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ: كَانَ فِيمَا أُنْزِلَ مِنَ الْقُرْآنِ: عَشْرُ رَضَعَاتٍ مَعْلُومَاتٍ يُحَرِّمْنَ، ثُمَّ نُسِخْنَ، بِخَمْسٍ مَعْلُومَاتٍ، فَتُوُفِّيَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَهُنَّ فِيمَا يُقْرَأُ مِنَ الْقُرْآنِ.",
                "headingArabic": "التَّحْرِيمِ بِخَمْسِ رَضَعَاتٍ ‏",
                "headingUrdu": "پانچ دودھ پلانے سے محرم بنتا ہے۔",
                "headingEnglish": "Becoming Mahram is established by Five Breastfeedings",
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11162,
                "hadithNumber": "3598",
                "englishNarrator": "Amra reported:",
                "hadithEnglish": "She heard 'A'isha (رضی اللہ عنہا) discussing fosterage which (makes marriage) unlawful; and she ('A'isha رضی اللہ عنہا ) said: There was revealed in the Holy Qur'an ten clear sucklings, and then five clear (sucklings).",
                "hadithUrdu": "حضرت عائشہ رضی اللہ عنہا نے کہا : قرآن میں دس بار دودھ پلانے سے جن کا علم ہو ، ( حرمت ثابت ہونے ) کا حکم نازل ہوا تھا ، پھر یہ ( حکم ) بھی نازل ہوا تھا : پانچ بار دودھ پلانے سے جن کا علم ہو.",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ القنبی نے بیان کیا,سلیمان بن بلال نے ہمیں یحییٰ بن سعید سے حدیث بیان کی ، انہوں نے عمرہ سے روایت کی کہ انہوں نے حضرت عائشہ رضی اللہ عنہا سے سنا ۔ ۔ ۔ وہ اس رضاعت کا ذکر کر رہی تھیں جس سے حرمت ثابت ہوتی ہے ۔ عمرہ نے کہا",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ، عَنْ يَحْيَى وَهُوَ ابْنُ سَعِيدٍ، عَنْ عَمْرَةَ، أَنَّهَا سَمِعَتْ عَائِشَةَ، تَقُولُ: - وَهِيَ تَذْكُرُ الَّذِي يُحَرِّمُ مِنَ الرَّضَاعَةِ قَالَتْ عَمْرَةُ: فَقَالَتْ: عَائِشَةُ - «نَزَلَ فِي الْقُرْآنِ عَشْرُ رَضَعَاتٍ مَعْلُومَاتٍ، ثُمَّ نَزَلَ أَيْضًا خَمْسٌ مَعْلُومَاتٌ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11163,
                "hadithNumber": "3599",
                "englishNarrator": null,
                "hadithEnglish": "Ahadith like this is transmitted by 'A'isha رضی اللہ عنہا through another chain of narrators.",
                "hadithUrdu": "ہم سے محمد بن المثنی نے بیان کیا,عبدالوہاب نے ہمیں حدیث بیان کی ، کہا : میں نے یحییٰ بن سعید سے سنا ، انہوں نے کہا : مجھے عمرہ نے خبر دی کہ انہوں نے حضرت عائشہ رضی اللہ عنہا سے سنا وہ کہہ رہی تھیں ۔ ۔ ( آگے ) اسی کے مانند ( ہے.",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ: سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ، قَالَ: أَخْبَرَتْنِي عَمْرَةُ، أَنَّهَا سَمِعَتْ عَائِشَةَ تَقُولُ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 10851,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=434",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=432",
                "label": "432",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=433",
                "label": "433",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=434",
                "label": "434",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=435",
                "label": "435",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=436",
                "label": "436",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=437",
                "label": "437",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=438",
                "label": "438",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=436",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=436",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=434",
        "to": 10875,
        "total": 40465
    }
}