{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 594,
        "data": [
            {
                "id": 15114,
                "hadithNumber": "7553",
                "englishNarrator": "Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "'Abdullah bin Ubayy bin Salul had two slave-girls; one was called Musaika and the other one was called Umaima and he compelled them to prostitution (for which'Abdullah bin Ubayy bin Salul compelled them). They made a complaint about this to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and it was upon this that this verse was revealed: And compel not your slave-girls to prostitute up to the words: Allah is Forgiving, Merciful.",
                "hadithUrdu": "عبداللہ بن ابی ابن سلول کی ایک باندی تھی ، اس کا نام مسیکہ تھا ، اوردوسری ( باندی ) کو امیمہ کہا جاتا تھا ۔ وہ ان دونوں سے ( زبردستی ) زنا کرانا چاہتا تھا ۔ ان دونوں نے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں اس بات کی شکایت کی تو اللہ عزوجل نے آیت : \" اور اپنی نوجوان لونڈیوں کو بدکاری پر نہ اکساؤ اگر وہ پاکدامن رہنا چاہتی ہوں ۔ \" اس ( اللہ ) کے فرمان : \" بڑا بخشنے والا ، ہمیشہ رحم کرنے والا ہے ۔ \" تک نازل فرمائی ۔",
                "urduNarrator": "ابو کامل الجہداری نے مجھ سے کہا, ابو عوانہ نے اعمش سے ، انھوں نے ابو سفیان سے اور انھوں نے حضرت جابر رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنِي أَبُو كَامِلٍ الْجَحْدَرِيُّ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ أَنَّ جَارِيَةً لِعَبْدِ اللَّهِ بْنِ أُبَيٍّ ابْنِ سَلُولَ يُقَالُ لَهَا مُسَيْكَةُ وَأُخْرَى يُقَالُ لَهَا أُمَيْمَةُ فَكَانَ يُكْرِهُهُمَا عَلَى الزِّنَى فَشَكَتَا ذَلِكَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَنْزَلَ اللَّهُ وَلَا تُكْرِهُوا فَتَيَاتِكُمْ عَلَى الْبِغَاءِ إِلَى قَوْلِهِ غَفُورٌ رَحِيمٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "55",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 155,
                    "chapterNumber": "55",
                    "chapterEnglish": "The Book of Commentary on the Qur'an",
                    "chapterUrdu": "قرآن مجید کی تفسیر کا بیان",
                    "chapterArabic": "كتاب التَّفْسِيرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 15115,
                "hadithNumber": "7554",
                "englishNarrator": "Abdullah bin Mas'ud رضی اللہ عنہ reported in connection with the words of Allah, the Exalted and Glorious:",
                "hadithEnglish": "Those to whom they call upon, themselves seek the means or access to their Lord as to whoever of them becomes nearest (xvii. 57) that it related to a party of Jinn who were being worshipped and they embraced Islam but those who worshipped them kept on worshipping them (though the Jinn whom the misguided people worshipped had become Muslims). It was then that this verse was revealed.",
                "hadithUrdu": "\" وہ لوگ جنھیں یہ ( کافر ) پکارتے ہیں وہ خود اپنے رب کی طرف وسیلہ تلاش کرتے ہیں کہ ان میں سے کو ن زیادہ نزدیک ہوگا ۔ \" ( ابن مسعود رضی اللہ عنہ نے ) کہا : جنوں کی ایک جماعت مسلمان ہوگئی تھی اور ( اس سے پہلے ) ان کی پوجاکی جاتی تھی ، تو جو ان کی عبادت کیاکرتے تھے ، ان کی عبادت پرقائم رہے جبکہ جنوں کی یہ جماعت خود اسلام لے آئی ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, عبداللہ بن ادریس نے اعمش سے ، انھوں نے ابراہیم سے ، انھوں نے ابو معمر سے اور انھوں نے حضرت عبداللہ بن مسعود رضی اللہ عنہ سے اللہ عزوجل کے اس فرمان کے متعلق روایت کی",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ أَبِي مَعْمَرٍ عَنْ عَبْدِ اللَّهِ فِي قَوْلِهِ عَزَّ وَجَلَّ أُولَئِكَ الَّذِينَ يَدْعُونَ يَبْتَغُونَ إِلَى رَبِّهِمْ الْوَسِيلَةَ أَيُّهُمْ أَقْرَبُ قَالَ كَانَ نَفَرٌ مِنْ الْجِنِّ أَسْلَمُوا وَكَانُوا يُعْبَدُونَ فَبَقِيَ الَّذِينَ كَانُوا يَعْبُدُونَ عَلَى عِبَادَتِهِمْ وَقَدْ أَسْلَمَ النَّفَرُ مِنْ الْجِنِّ.",
                "headingArabic": "فِي قَوْلِهِ تَعَالَى ‏{‏ أُولَئِكَ الَّذِينَ يَدْعُونَ يَبْتَغُونَ إِلَى رَبِّهِمْ الْوَسِيلَةَ}",
                "headingUrdu": "اللہ کی حفاظت: \"جن کو وہ اپنے رب (اللہ) تک رسائی کا ذریعہ پکارتے ہیں\"",
                "headingEnglish": "Allah's Saving: \"Those Whom They Call Upon Desire Means Of Access To Their Lord (Allah)\"",
                "chapterId": "55",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 155,
                    "chapterNumber": "55",
                    "chapterEnglish": "The Book of Commentary on the Qur'an",
                    "chapterUrdu": "قرآن مجید کی تفسیر کا بیان",
                    "chapterArabic": "كتاب التَّفْسِيرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 15116,
                "hadithNumber": "7555",
                "englishNarrator": "Abdullah bin Mas'ud رضی اللہ عنہ reported in connection with the verse:",
                "hadithEnglish": "Those whom they call upon, themselves seek the means of access to their Lord, that it related to a group of people who worshipped a party amongst the Jinn. The group from amongst the Jinn embraced Islam, but the people kept worshipping them as they did before, and it was (on this occasion) that the verse was revealed: Those whom they call upon, themselves seek the means of access to their Lord.",
                "hadithUrdu": "\" وہ لوگ جنھیں یہ ( کافر ) پکارتے ہیں ، وہ خود اپنے رب کی طرف وسیلہ تلاش کرتے ہیں ۔ \" ( ابن مسعود رضی اللہ تعالیٰ عنہ نے ) کہا : انسانوں کی ایک جماعت جنوں کی ایک جماعت کی پرستش کرتی تھی ، تو جنوں کی جماعت نے اسلام قبول کرلیا اور انسان بدستور ان کی عبادت سے لگے رہے ۔ اس پر ( یہ آیت ) نازل ہوئی : \" وہ لوگ جنھیں یہ پکارتے ہیں ، وہ خود اپنے رب کی طرف ( کسی نیک عمل کا ) وسیلہ تلاش کرتے ہیں ۔ \"",
                "urduNarrator": "مجھ سے ابوبکر بن نافع العبدی نے بیان کیا کہ ہم سے عبدالرحمٰن نے بیان کیا, سفیان نے اعمش سے انھوں نے ابراہیم سے ، انھوں نے ابو معمر سے اور انھوں نے حضرت عبداللہ رضی اللہ عنہ سے ( اس آیت کے متعلق ) روایت کی",
                "hadithArabic": "حَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ الْعَبْدِيُّ حَدَّثَنَا عَبْدُ الرَّحْمَنِ حَدَّثَنَا سُفْيَانُ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ أَبِي مَعْمَرٍ عَنْ عَبْدِ اللَّهِ أُولَئِكَ الَّذِينَ يَدْعُونَ يَبْتَغُونَ إِلَى رَبِّهِمْ الْوَسِيلَةَ قَالَ كَانَ نَفَرٌ مِنْ الْإِنْسِ يَعْبُدُونَ نَفَرًا مِنْ الْجِنِّ فَأَسْلَمَ النَّفَرُ مِنْ الْجِنِّ وَاسْتَمْسَكَ الْإِنْسُ بِعِبَادَتِهِمْ فَنَزَلَتْ أُولَئِكَ الَّذِينَ يَدْعُونَ يَبْتَغُونَ إِلَى رَبِّهِمْ الْوَسِيلَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "55",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 155,
                    "chapterNumber": "55",
                    "chapterEnglish": "The Book of Commentary on the Qur'an",
                    "chapterUrdu": "قرآن مجید کی تفسیر کا بیان",
                    "chapterArabic": "كتاب التَّفْسِيرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 15117,
                "hadithNumber": "7556",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Sulaiman with the same chain of transmitters.",
                "hadithUrdu": "اور مجھ سے بشر بن خالد نے کہا,  ہم سے محمد نے بیان کیا، یعنی ابن جعفر نے, شعبہ نے سلیمان ( اعمش ) سے اسی سندکے ساتھ یہی روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنِيهِ بِشْرُ بْنُ خَالِدٍ أَخْبَرَنَا مُحَمَّدٌ يَعْنِي ابْنَ جَعْفَرٍ عَنْ شُعْبَةَ عَنْ سُلَيْمَانَ بِهَذَا الْإِسْنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "55",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 155,
                    "chapterNumber": "55",
                    "chapterEnglish": "The Book of Commentary on the Qur'an",
                    "chapterUrdu": "قرآن مجید کی تفسیر کا بیان",
                    "chapterArabic": "كتاب التَّفْسِيرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 15118,
                "hadithNumber": "7557",
                "englishNarrator": "Abdullah bin Mas'ud رضی اللہ عنہ said in connection with the verse:",
                "hadithEnglish": "Those whom they call upon, themselves seek the means of access to their Lord, that that verse was revealed in connection with a party of Arabs who used to worship a group amnogst the jinn; the jinn embraced Islam but the people kept worshipping them without being conscious of it. Then this verse was revealed: Those whom they call upon, themselves seek the means of access to their Lord.",
                "hadithUrdu": "\" وہ لوگ جنھیں یہ ( کافر ) پکارتے ہیں ، وہ خود اپنے رب کی طرف ( کسی نیک عمل کا ) و سیلہ ڈھونڈتے ہیں ہیں ۔ \" انھوں نے کہا : یہ ( آیت ) عربوں کے ایک ایسے گروہ کے بارے میں نازل ہوئی جو جنوں کے ایک گروہ کی عبادت کیا کرتے تھے ۔ جنوں نے اسلام قبول کرلیا جبکہ وہ انسان جو ان کی عبادت کیا کرتے تھے ، انھیں پتہ تک نہ چلا ۔ اس پر یہ آیت اتری : \" وہ لوگ جنھیں یہ ( کافر ) پکارتے ہیں ، وہ خود ا پنے رب کی طرف وسیلہ تلاش کر تے ہیں ۔ \"",
                "urduNarrator": "مجھ سے حجاج بن شعر نے بیان کیا، کہا ہم سے عبد الصمد بن عبد الوارث نے بیان کیا، ہم سے میرے والد نے بیان کیا، ہم سے حسین نے قتادہ کی سند سے اور عبداللہ بن معبد الزمانی کی سند سے, عبداللہ بن عتبہ نے حضرت عبداللہ بن مسعود رضی اللہ عنہ سے ( اس آیت کے متعلق ) روایت کی",
                "hadithArabic": "و حَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ حَدَّثَنِي أَبِي حَدَّثَنَا حُسَيْنٌ عَنْ قَتَادَةَ عَنْ عَبْدِ اللَّهِ بْنِ مَعْبَدٍ الزِّمَّانِيِّ عَنْ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ أُولَئِكَ الَّذِينَ يَدْعُونَ يَبْتَغُونَ إِلَى رَبِّهِمْ الْوَسِيلَةَ قَالَ نَزَلَتْ فِي نَفَرٍ مِنْ الْعَرَبِ كَانُوا يَعْبُدُونَ نَفَرًا مِنْ الْجِنِّ فَأَسْلَمَ الْجِنِّيُّونَ وَالْإِنْسُ الَّذِينَ كَانُوا يَعْبُدُونَهُمْ لَا يَشْعُرُونَ فَنَزَلَتْ أُولَئِكَ الَّذِينَ يَدْعُونَ يَبْتَغُونَ إِلَى رَبِّهِمْ الْوَسِيلَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "55",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 155,
                    "chapterNumber": "55",
                    "chapterEnglish": "The Book of Commentary on the Qur'an",
                    "chapterUrdu": "قرآن مجید کی تفسیر کا بیان",
                    "chapterArabic": "كتاب التَّفْسِيرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 15119,
                "hadithNumber": "7558",
                "englishNarrator": "Sa'id bin Jubair reported:",
                "hadithEnglish": "I said to Ibn 'Abbas رضی اللہ عنہما about Sura Tauba, whereupon he said: As for Sura Tauba, it is meant to humiliate (the non-believers and the hypocrites). There is constantly revealed in it (the pronoun) minhum (of them) and minhom (of them, i. e. such is the condition of some of them) till they (the Muslims) thought that none would be left unmentioned out of them who would not be blamed (for one fault or the other). I again said: What about Sura Anfal? He said: It pertains to the Battle of Badr. I again asked him about Sura al-Hashr. He said: It was revealed in connection with (the tribe) of Banu Nadir.",
                "hadithUrdu": "میں نے سیدنا ابن عباس رضی اللہ عنہما سے کہا کہ سورۃ التوبہ؟ انہوں نے کہا کہ سورۃ التوبہ؟ اور کہا کہ بلکہ وہ سورت تو ذلیل کرنے والی ہے اور فضیحت کرنے والی ہے ( کافروں اور منافقوں کی ) ۔ اس سورت میں برابر اترتا رہا کہ ”اور ان میں سے“ ”اور ان میں سے“ یہاں تک کہ منافق لوگ سمجھے کہ کوئی باقی نہ رہے گا جس کا ذکر اس سورت میں نہ کیا جائے گا ۔ میں نے کہا کہ سورۃ الانفال؟ انہوں نے کہا کہ وہ سورت تو بدر کی لڑائی کے بارے میں ہے ( اس میں مال غنیمت کے احکام مذکور ہیں ) ۔ میں نے کہا کہ سورۃ الحشر؟ انہوں نے کہا کہ وہ بنی نضیر ( کے انجام ) کے بارے میں نازل ہوئی ۔",
                "urduNarrator": "مجھ سے عبداللہ بن مطیع نے بیان کیا، ہم سے ہشیم نے بیان کیا, ابو بشر نے سعید بن جبیر سے روایت کی ، کہا : کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُطِيعٍ حَدَّثَنَا هُشَيْمٌ عَنْ أَبِي بِشْرٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ قَالَ قُلْتُ لِابْنِ عَبَّاسٍ سُورَةُ التَّوْبَةِ قَالَ آلتَّوْبَةِ قَالَ بَلْ هِيَ الْفَاضِحَةُ مَا زَالَتْ تَنْزِلُ وَمِنْهُمْ وَمِنْهُمْ حَتَّى ظَنُّوا أَنْ لَا يَبْقَى مِنَّا أَحَدٌ إِلَّا ذُكِرَ فِيهَا قَالَ قُلْتُ سُورَةُ الْأَنْفَالِ قَالَ تِلْكَ سُورَةُ بَدْرٍ قَالَ قُلْتُ فَالْحَشْرُ قَالَ نَزَلَتْ فِي بَنِي النَّضِيرِ.",
                "headingArabic": "فِي سُورَةِ بَرَاءَةَ وَالأَنْفَالِ وَالْحَشْرِ",
                "headingUrdu": "سورۃ براء (التوبہ)، الانفال اور الحشر",
                "headingEnglish": "Sural Baraah (Ar-Tawbah), Al-Anfal And Al-Hashr",
                "chapterId": "55",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 155,
                    "chapterNumber": "55",
                    "chapterEnglish": "The Book of Commentary on the Qur'an",
                    "chapterUrdu": "قرآن مجید کی تفسیر کا بیان",
                    "chapterArabic": "كتاب التَّفْسِيرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 15120,
                "hadithNumber": "7559",
                "englishNarrator": "Ibn 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Umar رضی اللہ عنہ delivered a sermon on the pulpit of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and he praised Allah and lauded Him and then said: Now coming to the point. Behold I when the command pertaining to the prohibition of wine was revealed, it was prepared from five things: from wheat, barley, date, grape, honey; and wine is that which clouds the intellect; and O people, I wish Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) could have explained to us in (more) detail the laws pertaining to the inheritance of the grandfather, about one who dies leaving no issue, and some of the problems pertaining to interest.",
                "hadithUrdu": "حضرت عمر رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم کے منبر پر ( کھڑے ہوکر ) خطبہ دیا ، اللہ تعالیٰ کی حمدوثنا بیان کی ، پھر کہا : اس کے بعد : سنو !شراب کی حرمت نازل ہوئی ، جس دن وہ نازل ہوئی ( اس وقت ) وہ پانچ چیزوں سے بنتی تھی ۔ گندم ، جو ، خشک کھجور ، انگور اور شہد سے ، خمر وہ ہے جو عقل کو ڈھانپ لے ۔ اورلوگو!تین چیزیں ایسی ہیں جن کے متعلق میں شدت سے چاہتا ہوں کہ رسول اللہ صلی اللہ علیہ وسلم نے ان کے بارے میں ہمیں اور زیادہ قطعیت سے بتایا ہوتا : دادا اور کلالہ کی میراث اور سود کے ابواب میں سے چند ابواب ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, علی بن مسہر نے ابو حیان سے ، انھوں نے شعبی سے اور انھوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ أَبِي حَيَّانَ عَنْ الشَّعْبِيِّ عَنْ ابْنِ عُمَرَ قَالَ خَطَبَ عُمَرُ عَلَى مِنْبَرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ أَمَّا بَعْدُ أَلَا وَإِنَّ الْخَمْرَ نَزَلَ تَحْرِيمُهَا يَوْمَ نَزَلَ وَهِيَ مِنْ خَمْسَةِ أَشْيَاءَ مِنْ الْحِنْطَةِ وَالشَّعِيرِ وَالتَّمْرِ وَالزَّبِيبِ وَالْعَسَلِ وَالْخَمْرُ مَا خَامَرَ الْعَقْلَ وَثَلَاثَةُ أَشْيَاءَ وَدِدْتُ أَيُّهَا النَّاسُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ عَهِدَ إِلَيْنَا فِيهَا الْجَدُّ وَالْكَلَالَةُ وَأَبْوَابٌ مِنْ أَبْوَابِ الرِّبَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "55",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 155,
                    "chapterNumber": "55",
                    "chapterEnglish": "The Book of Commentary on the Qur'an",
                    "chapterUrdu": "قرآن مجید کی تفسیر کا بیان",
                    "chapterArabic": "كتاب التَّفْسِيرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 15121,
                "hadithNumber": "7560",
                "englishNarrator": "Ibn 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "I heard 'Umar bin Khattab رضی اللہ عنہ delivering sermon on the pulpit ol Allah's messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and saying': Now, coming to the point, O people, there was revealed (the command pertaining to the prohibition of wine) and it was prepared (at that time) out of five things: grape, date, honey, wheat, barley, and wine is that which clouds the intellect, and, O people, I wish Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had explained to us in greater detail three things: the inheritance of the grandfather, of one who dies without leaving any issue, and some of the problems of interest.",
                "hadithUrdu": "میں نے حضرت عمر بن خطاب رضی اللہ عنہ کو رسول اللہ صلی اللہ علیہ وسلم کے منبر پر فرماتے ہوئے سنا : حمد وثنا کےبعد ، لوگو!شراب کی حرمت نازل ہوئی تو وہ پانچ چیزوں سے بنائی جاتی تھی ، انگور ، کھجور ، شہد ، گندم اور جو سے اور خمر ( شراب ) وہ ہے جو عقل کو ڈھانک دے ۔ لوگو!تین چیزیں ایسی ہیں جن کے متعلق میں چاہتا تھا کہ رسول اللہ صلی اللہ علیہ وسلم ہمیں اور زیادہ قطیعت سے واضح فرمادیتے : دادا اور کلالہ کی میراث اور سود کی صورتوں میں سے چند صورتیں ۔",
                "urduNarrator": "ابو کریب نے ہم سے کہا, ابن ادریس نے کہا ,  ہمیں ابو حیان نے شعبی سے حدیث بیان کی ۔ انھوں نے حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنَا أَبُو كُرَيْبٍ أَخْبَرَنَا ابْنُ إِدْرِيسَ حَدَّثَنَا أَبُو حَيَّانَ عَنْ الشَّعْبِيِّ عَنْ ابْنِ عُمَرَ قَالَ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ عَلَى مِنْبَرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولَ أَمَّا بَعْدُ أَيُّهَا النَّاسُ فَإِنَّهُ نَزَلَ تَحْرِيمُ الْخَمْرِ وَهِيَ مِنْ خَمْسَةٍ مِنْ الْعِنَبِ وَالتَّمْرِ وَالْعَسَلِ وَالْحِنْطَةِ وَالشَّعِيرِ وَالْخَمْرُ مَا خَامَرَ الْعَقْلَ وَثَلَاثٌ أَيُّهَا النَّاسُ وَدِدْتُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ عَهِدَ إِلَيْنَا فِيهِنَّ عَهْدًا نَنْتَهِي إِلَيْهِ الْجَدُّ وَالْكَلَالَةُ وَأَبْوَابٌ مِنْ أَبْوَابِ الرِّبَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "55",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 155,
                    "chapterNumber": "55",
                    "chapterEnglish": "The Book of Commentary on the Qur'an",
                    "chapterUrdu": "قرآن مجید کی تفسیر کا بیان",
                    "chapterArabic": "كتاب التَّفْسِيرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 15122,
                "hadithNumber": "7561",
                "englishNarrator": null,
                "hadithEnglish": "A similar hadith (as no. 7560) was narrated from Abu Hayyan with this chain of narrators, except that in his hadith Ibn 'Ulayyah say grapes, as Ibn Idris said, and in the hadith of 'Eisa it says rasins, as Ibn Mushir said.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, اسماعیل بن علیہ اور عیسیٰ بن یونس دونوں نے ابوحیان سے اسی سند کے ساتھ ان دونوں کی حدیث کے مانند روایت کی ، البتہ ابن علیہ کی حدیث میں ہے : انگور ، جس طرح ابن ادریس نے کہا ہے ۔ اور عیسیٰ کی روایت میں کشمش ہے ۔ جس طرح ابن مسہر نے کہا ہے ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ كِلَاهُمَا عَنْ أَبِي حَيَّانَ بِهَذَا الْإِسْنَادِ بِمِثْلِ حَدِيثِهِمَا غَيْرَ أَنَّ ابْنَ عُلَيَّةَ فِي حَدِيثِهِ الْعِنَبِ كَمَا قَالَ ابْنُ إِدْرِيسَ وَفِي حَدِيثِ عِيسَى الزَّبِيبِ كَمَا قَالَ ابْنُ مُسْهِرٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "55",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 155,
                    "chapterNumber": "55",
                    "chapterEnglish": "The Book of Commentary on the Qur'an",
                    "chapterUrdu": "قرآن مجید کی تفسیر کا بیان",
                    "chapterArabic": "كتاب التَّفْسِيرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 15123,
                "hadithNumber": "7562",
                "englishNarrator": "It was narrated that Qais bin 'Ubad said:",
                "hadithEnglish": "I heard Abu Dharr رضی اللہ عنہ took an oath that this verse: These two adversaries who dispute about their Lord (xxii. 19) was revealed in connection with those who on the Day of Badr came out (of rows to fight against the non-believers and they were) Hamza, 'Ali, 'Ubaida bin Harith رضی اللہ عنہ (from the side of the Muslims) and 'Utba and Shaiba, both of them the sons of Rabi'a and Walid bin 'Utba (from the side of the non-believers of Mecca).",
                "hadithUrdu": "میں نے حضرت ابو زر رضی اللہ عنہ کو قسم کھا کر کہتے ہوئے سنا کہ ( آیت ) : \" یہ دو جھگڑنے والے ہیں جنھوں نے اپنے رب کے معاملے میں جھگڑا کیا ۔ \" ان لوگوں کے متعلق نازل ہوئی جنھوں نے بدر کے دن مبارزت ( رودرودسیدھی لڑائی ) کی : حضرت حمزہ ، علی اور عبیدہ بن حارث رضی اللہ عنہ اور ( دوسری طرف سے ) ربیعہ کے دو بیٹے : عتبہ اور شیبہ اور عتبہ کا بیٹا ولید ۔",
                "urduNarrator": "ہم سے عمرو بن زرارہ نے بیان کیا, ہشیم نے ابو ہاشم سے ، انھوں نے ابو مجلز سے اور انھوں نے قیس بن عباد سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ زُرَارَةَ حَدَّثَنَا هُشَيْمٌ عَنْ أَبِي هَاشِمٍ عَنْ أَبِي مِجْلَزٍ عَنْ قَيْسِ بْنِ عُبَادٍ قَالَ سَمِعْتُ أَبَا ذَرٍّ يُقْسِمُ قَسَمًا إِنَّ هَذَانِ خَصْمَانِ اخْتَصَمُوا فِي رَبِّهِمْ إِنَّهَا نَزَلَتْ فِي الَّذِينَ بَرَزُوا يَوْمَ بَدْرٍ حَمْزَةُ وَعَلِيٌّ وَعُبَيْدَةُ بْنُ الْحَارِثِ وَعُتْبَةُ وَشَيْبَةُ ابْنَا رَبِيعَةَ وَالْوَلِيدُ بْنُ عُتْبَةَ.",
                "headingArabic": "فِي قَوْلِهِ تَعَالَى ‏{‏هَذَانِ خَصْمَانِ اخْتَصَمُوا فِي رَبِّهِمْ}",
                "headingUrdu": "اللہ تعالیٰ کا ارشاد ہے: ’’یہ دونوں مخالف اپنے رب کے بارے میں ایک دوسرے سے جھگڑتے ہیں‘‘۔",
                "headingEnglish": "Allah's Saying: \"These Two Opponents Dispute With Each Other About Their Lord\"",
                "chapterId": "55",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 155,
                    "chapterNumber": "55",
                    "chapterEnglish": "The Book of Commentary on the Qur'an",
                    "chapterUrdu": "قرآن مجید کی تفسیر کا بیان",
                    "chapterArabic": "كتاب التَّفْسِيرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 15124,
                "hadithNumber": "7563",
                "englishNarrator": null,
                "hadithEnglish": "It was narrated that Qais bin 'Ubad said: \"I heard Abu Dharr رضی اللہ عنہ, swearing that the verse: 'There two opponents was revealed...\" a hadith like that of Hushaim.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے وکیع نے بیان کیا، اور ہم سے محمد بن المثنیٰ نے بیان کیا اور ہم سے عبدالرحمٰن نے بیان کیا,سفیان نے ابو ہاشم سے ، انھوں نے ابو مجلز سے ، انھوں نے قیس بن عباد سے روایت کی ، کہا : میں نے حضرت ابو ذرکو قسم کھا کر یہ کہتے ہوئے سنا : هَذَانِ خَصْمَانِ یہ آیت نازل ہوئی ۔ ( آگے ) ہشیم کی حدیث کے مانند ہے ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ و حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الرَّحْمَنِ جَمِيعًا عَنْ سُفْيَانَ عَنْ أَبِي هَاشِمٍ عَنْ أَبِي مِجْلَزٍ عَنْ قَيْسِ بْنِ عُبَادٍ قَالَ سَمِعْتُ أَبَا ذَرٍّ يُقْسِمُ لَنَزَلَتْ هَذَانِ خَصْمَانِ بِمِثْلِ حَدِيثِ هُشَيْمٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "55",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 155,
                    "chapterNumber": "55",
                    "chapterEnglish": "The Book of Commentary on the Qur'an",
                    "chapterUrdu": "قرآن مجید کی تفسیر کا بیان",
                    "chapterArabic": "كتاب التَّفْسِيرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 15125,
                "hadithNumber": "1",
                "englishNarrator": "Ibn `Umar رضی اللہ عنہما narrated:",
                "hadithEnglish": "The Prophet said: Salat will not be accepted without purification, nor Charity from Ghulul. Hannad said in his narration, except with purification [Abu `Eisa said: This Hadith is the most correct thing on this topic, and the best. There are also narrations on this topic from Abu Al-Malih, from his father; and Abu Hurairah and Anas رضی اللہ عنہم. \r\nAnd Abu Al-Malih bin Usamah's name is `Amir, and they also say it was Zaid bin Usamah bin `Umair Al-Hudhali.",
                "hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”نماز بغیر وضو کے قبول نہیں کی جاتی ۲؎ اور نہ صدقہ حرام مال سے قبول کیا جاتا ہے“۔ امام ترمذی کہتے ہیں: ۱- اس باب میں یہ حدیث سب سے صحیح اور حسن ہے ۳؎۔ ۲- اس باب میں ابوالملیح کے والد اسامہ، ابوہریرہ اور انس رضی اللہ عنہم سے بھی احادیث آئی ہیں۔\r\nاور ابو الملیح بن اسامہ کا نام عامر ہے اور وہ یہ بھی کہتے ہیں کہ یہ زید بن اسامہ بن عمیر الحذلی تھے۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ہم سے ابو عوانہ نے سماک بن حرب سے بیان کیا۔ ہم سے ہناد نے بیان کیا، ہم سے وکیع نے، اسرائیل سے، سماک سے، مصعب بن سعد کی سند سے,عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ سِمَاكِ بْنِ حَرْبٍ. ح وحَدَّثَنَا هَنَّادٌ، حَدَّثَنَا وَكِيعٌ، عَنْ إِسْرَائِيلَ، عَنْ سِمَاكٍ، عَنْ مُصْعَبِ بْنِ سَعْدٍ، عَنْ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَا تُقْبَلُ صَلَاةٌ بِغَيْرِ طُهُورٍ وَلَا صَدَقَةٌ مِنْ غُلُولٍ . قَالَ هَنَّادٌ فِي حَدِيثِهِ:‏‏‏‏ إِلَّا بِطُهُورٍ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا الْحَدِيثُ أَصَحُّ شَيْءٍ فِي هَذَا الْبَابِ وَأَحْسَنُ،‏‏‏‏ وَفِي الْبَاب عَنْ أَبِي الْمَلِيحِ، ‏‏‏‏‏‏عَنْ أَبِيهِ،‏‏‏‏ وَأَبِي هُرَيْرَةَ،‏‏‏‏ وَأَنَسٍ،‏‏‏‏ وَأَبُو الْمَلِيحِ بْنُ أُسَامَةَ اسْمُهُ عَامِرٌ، ‏‏‏‏‏‏وَيُقَالُ:‏‏‏‏ زَيْدُ بْنُ أُسَامَةَ بْنِ عُمَيْرٍ الْهُذَلِيُّ.",
                "headingArabic": "مَا جَاءَ لاَ تُقْبَلُ صَلاَةٌ بِغَيْرِ طُهُورٍ ‏",
                "headingUrdu": "اس کا کیا تعلق ہے کہ بغیر طہارت کے نماز قبول نہیں ہوتی",
                "headingEnglish": "What Has Been Related That Salat Is Not Accepted Without Purification",
                "chapterId": "1",
                "bookSlug": "al-tirmidhi",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 4,
                    "bookName": "Jami' Al-Tirmidhi",
                    "writerName": "Abu `Isa Muhammad at-Tirmidhi",
                    "aboutWriter": null,
                    "writerDeath": "279",
                    "bookSlug": "al-tirmidhi"
                },
                "chapter": {
                    "id": 156,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book on Purification",
                    "chapterUrdu": "طہارت کے احکام و مسائل",
                    "chapterArabic": "كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
                    "bookSlug": "al-tirmidhi"
                }
            },
            {
                "id": 15126,
                "hadithNumber": "2",
                "englishNarrator": "Abu Hurairah رضی اللہ عنہ narrated:",
                "hadithEnglish": "Allah's Messenger صلی اللہ علیہ وسلم said: When a Muslim, or believer, performs Wudu', washing his face, every evil that he looked at with his eyes leaves with the water - or with the last drop of water, or an expression similar to that - and when he washes his hands, every evil he did with his hands leaves with the water - or with the last drop of water - until he becomes free of sin.\r\n[Abu Eisa said:] This Hadith is Hasan Sahih: it is a hadith of Malik, from Suhail from his father, from Abu Hurairah. And Abu Salih (one of the narrators), the father of suhail, is Abu Salih As-Samman, nd his name is Dhkkwan. As for Abu Hurairah, there is dispute over his name. They say it was 'Abdu Shams, and the say it was 'Abdullah bin 'Amr. This is what Muhammad bin Isma'il said, nd this is the most correct.\r\n[Abu Eisa said:] There are narrations on this topic from 'Uthman [bin Affan], Thwban, As-Sunabihi, the one who narrate from Abu Bakr Siddiq رضی اللہ عنہ , did not himself hear from Allah's Messenger صلی اللہ علیہ وسلم , and his name is 'Abdur-Rahman bin 'Usailah, and his Kunya is Abu 'Abdullah. He traveled to meet the prophet , but the prophet died while he was on the way to him. He has reported some Ahadith from the prophet . There is a Companion of the prophet named As-Sunabih bin Al-A'sr Al-Ahmasi, and they call him As-Sunbihi as well, but his only Hadith is that he said, \"I heard the prophet, saying: 'Indeed I will boast before the other nations because of you. So do not fight each other after me.'\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب مسلمان یا مومن بندہ وضو کرتا اور اپنا چہرہ دھوتا ہے تو پانی کے ساتھ یا پانی کے آخری قطرے کے ساتھ اس کے چہرے سے وہ تمام گناہ جھڑ جاتے ہیں ۱؎، جو اس کی آنکھوں نے کیے تھے یا اسی طرح کی کوئی اور بات فرمائی، پھر جب وہ اپنے ہاتھوں کو دھوتا ہے تو پانی کے ساتھ یا پانی کے آخری قطرے کے ساتھ وہ تمام گناہ جھڑ جاتے ہیں جو اس کے ہاتھوں سے ہوئے ہیں، یہاں تک کہ وہ گناہوں سے پاک و صاف ہو کر نکلتا ہے“ ۲؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے ۳؎، ۲- اس باب میں عثمان بن عفان، ثوبان، صنابحی، عمرو بن عبسہ، سلمان اور عبداللہ بن عمرو رضی اللہ عنہم  سے بھی احادیث آئی ہیں، ۳- صنابحی جنہوں نے ابوبکر صدیق رضی اللہ عنہ سے روایت کی ہے، ان کا سماع رسول اللہ صلی اللہ علیہ وسلم سے نہیں ہے، ان کا نام عبدالرحمٰن بن عسیلہ، اور کنیت ابوعبداللہ ہے، انہوں نے رسول اللہ صلی اللہ علیہ وسلم  کے پاس سفر کیا، راستے ہی میں تھے کہ رسول اللہ صلی الله علیہ وسلم کا انتقال ہو گیا، انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے متعدد احادیث روایت کی ہیں۔ اور صنابح بن اعسرا حمسی صحابی رسول ہیں، ان کو صنابحی بھی کہا جاتا ہے، انہی کی حدیث ہے کہ میں نے نبی اکرم صلی اللہ علیہ وسلم  کو فرماتے سنا: ”میں تمہارے ذریعہ سے دوسری امتوں میں اپنی اکثریت پر فخر کروں گا تو میرے بعد تم ہرگز ایک دوسرے کو قتل نہ کرنا“۔",
                "urduNarrator": "ہم سے اسحاق بن موسیٰ الانصاری نے بیان کیا، ہم سے معن بن عیسیٰ القزاز نے بیان کیا، ہم سے مالک بن انس نے بیان کیا۔ ہم سے قتیبہ نے مالک کی سند سے، سہیل بن ابی صالح کی سند سے، اپنے والد سے، ان سے روایت کی ابوہریرہ رضی اللہ عنہ  کہتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاق بْنُ مُوسَى الْأَنْصَارِيُّ، حَدَّثَنَا مَعْنُ بْنُ عِيسَى الْقَزَّازُ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ. وحَدَّثَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ، ‏‏‏‏‏‏أَبِي هُرَيْرَةَ،‏‏‏‏ قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِذَا تَوَضَّأَ الْعَبْدُ الْمُسْلِمُ أَوِ الْمُؤْمِنُ فَغَسَلَ وَجْهَهُ، ‏‏‏‏‏‏خَرَجَتْ مِنْ وَجْهِهِ كُلُّ خَطِيئَةٍ نَظَرَ إِلَيْهَا بِعَيْنَيْهِ مَعَ الْمَاءِ، ‏‏‏‏‏‏أَوْ مَعَ آخِرِ قَطْرِ الْمَاءِ أَوْ نَحْوَ هَذَا، ‏‏‏‏‏‏وَإِذَا غَسَلَ يَدَيْهِ خَرَجَتْ مِنْ يَدَيْهِ كُلُّ خَطِيئَةٍ بَطَشَتْهَا يَدَاهُ مَعَ الْمَاءِ، ‏‏‏‏‏‏أَوْ مَعَ آخِرِ قَطْرِ الْمَاءِ، ‏‏‏‏‏‏حَتَّى يَخْرُجَ نَقِيًّا مِنَ الذُّنُوبِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَسَنٌ صَحِيحٌ وَهُوَ حَدِيثُ مَالِكٍ، ‏‏‏‏‏‏عَنْ سُهَيْلٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ،‏‏‏‏ وَأَبُو صَالِحٍ وَالِدُ سُهَيْلٍ هُوَ أَبُو صَالِحٍ السَّمَّانُ، ‏‏‏‏‏‏وَاسْمُهُ ذَكْوَانُ، ‏‏‏‏‏‏وَأَبُو هُرَيْرَةَ اخْتُلِفَ فِي اسْمِهِ، ‏‏‏‏‏‏فَقَالُوا:‏‏‏‏ عَبْدُ شَمْسٍ، ‏‏‏‏‏‏وَقَالُوا:‏‏‏‏ عَبْدُ اللَّهِ بْنُ عَمْرٍو، ‏‏‏‏‏‏وَهَكَذَا قَالَ:‏‏‏‏ مُحَمَّدُ بْنُ إِسْمَاعِيل وَهُوَ الْأَصَحُّ. قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب عَنْ عُثْمَانَ بْنِ عَفَّانَ،‏‏‏‏ وَثَوْبَانَ،‏‏‏‏ وَالصُّنَابِحِيِّ،‏‏‏‏ وَعَمْرِو بْنِ عَبَسَةَ،‏‏‏‏ وَسَلْمَانَ،‏‏‏‏ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو،‏‏‏‏ وَالصُّنَابِحِيُّ الَّذِي رَوَى عَنْ أَبِي بَكْرٍ الصِّدِّيقِ لَيْسَ لَهُ سَمَاعٌ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏وَاسْمُهُ:‏‏‏‏ عَبْدُ الرَّحْمَنِ بْنُ عُسَيْلَةَ وَيُكْنَى أَبَا عَبْدِ اللَّهِ، ‏‏‏‏‏‏رَحَلَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُبِضَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ فِي الطَّرِيقِ، ‏‏‏‏‏‏وَقَدْ رَوَى عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحَادِيثَ، ‏‏‏‏‏‏وَالصُّنَابِحُ بْنُ الْأَعْسَرِ الْأَحْمَسِيُّ صَاحِبُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏يُقَالُ لَهُ:‏‏‏‏ الصُّنَابِحِيُّ أَيْضًا، ‏‏‏‏‏‏وَإِنَّمَا حَدِيثُهُ قَالَ:‏‏‏‏ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ إِنِّي مُكَاثِرٌ بِكُمُ الْأُمَمَ فَلَا تَقْتَتِلُنَّ بَعْدِي.",
                "headingArabic": "مَا جَاءَ فِي فَضْلِ الطُّهُورِ ‏",
                "headingUrdu": "طہارت کی فضیلت کے بارے میں کیا بیان کیا گیا ہے۔",
                "headingEnglish": "What Has Been Related About The Virtue Of Purification",
                "chapterId": "1",
                "bookSlug": "al-tirmidhi",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 4,
                    "bookName": "Jami' Al-Tirmidhi",
                    "writerName": "Abu `Isa Muhammad at-Tirmidhi",
                    "aboutWriter": null,
                    "writerDeath": "279",
                    "bookSlug": "al-tirmidhi"
                },
                "chapter": {
                    "id": 156,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book on Purification",
                    "chapterUrdu": "طہارت کے احکام و مسائل",
                    "chapterArabic": "كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
                    "bookSlug": "al-tirmidhi"
                }
            },
            {
                "id": 15127,
                "hadithNumber": "3",
                "englishNarrator": "Ali رضی الله عنہ narrated:",
                "hadithEnglish": "The Prophet, said: The key to Salat is the purification, its Tahrlm is the Takblr, and its Tahlil is the Taslim.\r\nAbu Eisa said: This Hadith is the most correct thing  related bout this topic, and the best. \r\nAs for Abdullah bin Muhammad bin Aqil (one of the narrators), he is truthful, some of the people of knowledge have criticized him due to his memory.\r\n[Abu Eisa said:] There are narration of this topic from Jabir and from Sa'eed رضی الله عنہما .",
                "hadithUrdu": "رسول اللہ صلی الله علیہ وسلم نے فرمایا: ”نماز کی کنجی وضو ہے، اور اس کا تحریمہ صرف «اللہ اکبر» کہنا ہے ۱؎ اور نماز میں جو چیزیں حرام تھیں وہ «السلام علیکم ورحمة اللہ» کہنے ہی سے حلال ہوتی ہیں“ ۲؎۔\r\n امام ترمذی کہتے ہیں: ۱- اس باب میں یہ حدیث سب سے صحیح اور حسن ہے، ۲- عبداللہ بن محمد بن عقیل صدوق ہیں ۳؎، بعض اہل علم نے ان کے حافظہ کے تعلق سے ان پر کلام کیا ہے، میں نے محمد بن اسماعیل بخاری کو یہ کہتے ہوئے سنا کہ احمد بن حنبل، اسحاق بن ابراہیم بن راہویہ اور حمیدی: عبداللہ بن محمد بن عقیل کی روایت سے حجت پکڑتے تھے، اور وہ مقارب الحدیث ۴؎ ہیں، ۳- اس باب میں جابر اور ابو سعید خدری رضی الله عنہما سے بھی احادیث آئی ہیں۔",
                "urduNarrator": "ہم سے قتیبہ، ہناد اور محمود بن غیلان نے بیان کیا: ہم سے وکیع نے سفیان کی سند سے بیان کیا۔ اور ہم سے محمد بن بشار نے بیان کیا، کہا ہم سے عبدالرحمٰن بن مہدی نے بیان کیا، کہا ہم سے سفیان نے بیان کیا، وہ عبداللہ بن محمد بن عقیل کی سند سے، وہ محمد بن حنفیہ کی سند سے, علی رضی الله عنہ کہتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ وَهَنَّادٌ،‏‏‏‏ وَمَحْمُودُ بْنُ غَيْلَانَ،‏‏‏‏ قَالُوا:‏‏‏‏ حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ. ح وحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ، عَنْ مُحَمَّدِ بْنِ الْحَنَفِيَّةِ، عَنْ عَلِيٍّ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مِفْتَاحُ الصَّلَاةِ الطُّهُورُ وَتَحْرِيمُهَا التَّكْبِيرُ وَتَحْلِيلُهَا التَّسْلِيمُ .\r\n قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا الْحَدِيثُ أَصَحُّ شَيْءٍ فِي هَذَا الْبَابِ وَأَحْسَن.\r\n ‏‏‏‏‏‏وَعَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَقِيلٍ:‏‏‏‏ هُوَ صَدُوقٌ، ‏‏‏‏‏‏وَقَدْ تَكَلَّمَ فِيهِ بَعْضُ أَهْلِ الْعِلْمِ مِنْ قِبَلِ حِفْظِهِ.\r\n قَالَ أَبُو عِيسَى:‏‏‏‏ وسَمِعْت مُحَمَّدَ بْنَ إِسْمَاعِيل، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ كَانَ أَحْمَدُ بْنُ حَنْبَلٍ،‏‏‏‏ وَإِسْحَاق بْنُ إِبْرَاهِيمَ،‏‏‏‏ وَالْحُمَيْدِيُّ يَحْتَجُّونَ بِحَدِيثِ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ، ‏‏‏‏‏‏قَالَ مُحَمَّدٌ:‏‏‏‏ وَهُوَ مُقَارِبُ الْحَدِيثِ.\r\n قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب عَنْ جَابِرٍ،‏‏‏‏ وَأَبِي سَعِيدٍ.",
                "headingArabic": "مَا جَاءَ أَنَّ مِفْتَاحَ الصَّلاَةِ الطُّهُورُ ‏",
                "headingUrdu": "اس کا کیا تعلق ہے کہ نماز کی کنجی طہارت ہے۔",
                "headingEnglish": "What Has been Related That The Key To Salat Is Purification",
                "chapterId": "1",
                "bookSlug": "al-tirmidhi",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 4,
                    "bookName": "Jami' Al-Tirmidhi",
                    "writerName": "Abu `Isa Muhammad at-Tirmidhi",
                    "aboutWriter": null,
                    "writerDeath": "279",
                    "bookSlug": "al-tirmidhi"
                },
                "chapter": {
                    "id": 156,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book on Purification",
                    "chapterUrdu": "طہارت کے احکام و مسائل",
                    "chapterArabic": "كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
                    "bookSlug": "al-tirmidhi"
                }
            },
            {
                "id": 15128,
                "hadithNumber": "4",
                "englishNarrator": "Jabir bin 'Abdullah رضی الله عنہما narrated:",
                "hadithEnglish": "Allah's Messenger صلی الله علیہ وسلم said: The key to Paradise is Salat, and the key to Salat is Wudu'.",
                "hadithUrdu": "رسول اللہ صلی الله علیہ وسلم نے فرمایا: ”نماز جنت کی کنجی ہے، اور نماز کی کنجی وضو ہے“۔",
                "urduNarrator": "ابو بکر محمد بن زنجویہ البغدادی اور ایک سے زیادہ دوسرے نے روایت کی ہے, الحسین بن محمد نے بیان کیا ہے, سلیمان بن قرام نے بیان کیا ہے, ابو یحییٰ القطات نے بیان کیا ہے,  مجاہد نے بیان کیا ہے, جابر بن عبداللہ رضی الله عنہما کہتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرٍ مُحَمَّدُ بْنُ زَنْجَوَيْهِ الْبَغْدَادِيُّ، وَغَيْرُ وَاحِدٍ،‏‏‏‏ قَالَ:‏‏‏‏ حَدَّثَنَا الْحُسَيْنُ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُلَيْمَانُ بْنُ قَرْمٍ، عَنْ أَبِي يَحْيَى الْقَتَّاتِ، عَنْ مُجَاهِدٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ رَضِيَ اللَّهُ عَنْهُمَا قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مِفْتَاحُ الْجَنَّةِ الصَّلَاةُ وَمِفْتَاحُ الصَّلَاةِ الْوُضُوءُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "al-tirmidhi",
                "volume": "1",
                "status": "Da`eef",
                "book": {
                    "id": 4,
                    "bookName": "Jami' Al-Tirmidhi",
                    "writerName": "Abu `Isa Muhammad at-Tirmidhi",
                    "aboutWriter": null,
                    "writerDeath": "279",
                    "bookSlug": "al-tirmidhi"
                },
                "chapter": {
                    "id": 156,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book on Purification",
                    "chapterUrdu": "طہارت کے احکام و مسائل",
                    "chapterArabic": "كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
                    "bookSlug": "al-tirmidhi"
                }
            },
            {
                "id": 15129,
                "hadithNumber": "5",
                "englishNarrator": "Anas bin Malik رضی الله عنہ said:",
                "hadithEnglish": "When the Prophet entered the toilet he would say: 'O Allah Indeed I seek refuge in You.' Shu'bah (one of the narrators) said: Another time he said: 'I seek refuge in You from AI-Khubthi and al-Khablth.' Or: 'Al-Khubthi and Al-Khaba'ith.'\r\n[Abu Eisa said:] There are narrations on this topic from 'Ali, Zaid bin Arqam, Jabir, and Ibn Masud.\r\nAbu Eisa said: This hadith of Anas is the most correct thing narrated on this topic, and it is the best.\r\nThe chain for the hadith of Zaid bin Arqam has some confused (Idhtirab)in it: It was reported by Hisham Ad-Dstawai and Saeed bin Abi 'Arubah, from Qatadah (So Saeed said): \"From Al-Qasim bin 'Awf Ash-Shaybani, from Zid bin Arqam. And Hisham said: \"From Qatadah from Zaid bin Arqam.\" Shu'bah nd Ma'mar reported it from Qatadah, from An-Nadr bin Anas. Shu'bah said: \"From An-Nadr bin Anas, from his father [from the prophet].'\"\r\nAbu Eisa said: I asked Muhammad about this. He said: \"It implies that Qatadah narrated it from both of them.\"",
                "hadithUrdu": "نبی اکرم صلی الله علیہ وسلم جب قضائے حاجت کے لیے پاخانہ میں داخل ہوتے تو یہ دعا پڑھتے: «اللهم إني أعوذ بك من الخبث والخبيث أو الخبث والخبائث» ”اے اللہ! میں تیری پناہ چاہتا ہوں ناپاکی سے اور ناپاک شخص سے، یا ناپاک جنوں سے اور ناپاک جنیوں سے“ ۱؎۔ شعبہ کہتے ہیں: عبدالعزیز نے دوسری بار «اللهم إني أعوذ بك» کے بجائے «أعوذ بالله» کہا۔ امام ترمذی کہتے ہیں: ۱- اس باب میں علی، زید بن ارقم، جابر اور ابن مسعود رضی الله عنہم سے بھی احادیث آئی ہیں، ۲- انس رضی الله عنہ کی حدیث اس باب میں سب سے صحیح اور عمدہ ہے، ۳- زید بن ارقم کی سند میں اضطراب ہے، امام بخاری کہتے ہیں: کہ ہو سکتا ہے قتادہ نے اسے ( زید بن ارقم سے اور نضر بن انس عن أبیہ ) دونوں سے ایک ساتھ روایت کیا ہو۔",
                "urduNarrator": "ہم سے قتیبہ اور ہناد نے بیان کیا,  ہم سے وکیع نے شعبہ کی سند سے اور عبدالعزیز بن صہیب کی سند سے بیان کیا, انس بن مالک رضی الله عنہ کہتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ،‏‏‏‏ وَهَنَّادٌ،‏‏‏‏ قَالَا:‏‏‏‏ حَدَّثَنَا وَكِيعٌ، عَنْ شُعْبَةَ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَخَلَ الْخَلَاءَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ قَالَ شُعْبَةُ:‏‏‏‏ وَقَدْ قَالَ مَرَّةً أُخْرَى:‏‏‏‏ أَعُوذُ بِكَ مِنَ الْخُبْثِ وَالْخَبِيثِ أَوْ الْخُبُثِ وَالْخَبَائِثِ . قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب عَنْ عَلِيٍّ،‏‏‏‏ وَزَيْدِ بْنِ أَرْقَمَ،‏‏‏‏ وَجَابِرٍ،‏‏‏‏ وَابْنِ مَسْعُودٍ. قال أبو عيسى:‏‏‏‏ حَدِيثُ أَنَسٍ أَصَحُّ شَيْءٍ فِي هَذَا الْبَابِ وَأَحْسَنُ، ‏‏‏‏‏‏وَحَدِيثُ زَيْدِ بْنِ أَرْقَمَ فِي إِسْنَادِهِ اضْطِرَابٌ، ‏‏‏‏‏‏رَوَى هِشَامٌ الدَّسْتَوَائِيُّ،‏‏‏‏ وَسَعِيدُ بْنُ أَبِي عَرُوبَةَ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏فَقَالَ سَعِيدٌ:‏‏‏‏ عَنْ الْقَاسِمِ بْنِ عَوْفٍ الشَّيْبَانِيِّ، ‏‏‏‏‏‏عَنْ زَيْدِ بْنِ أَرْقَمَ، ‏‏‏‏‏‏وقَالَ هِشَامٌ الدَّسْتَوَائِيُّ:‏‏‏‏ عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ زَيْدِ بْنِ أَرْقَمَ، ‏‏‏‏‏‏وَرَوَاهُ شُعْبَةُ،‏‏‏‏ وَمَعْمَرٌ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ النَّضْرِ بْنِ أَنَسٍ، ‏‏‏‏‏‏فَقَالَ شُعْبَةُ:‏‏‏‏ عَنْ زَيْدِ بْنِ أَرْقَمَ، ‏‏‏‏‏‏وَقَالَ مَعْمَرٌ:‏‏‏‏ عَنْ النَّضْرِ بْنِ أَنَسٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. قَالَ أَبُو عِيسَى:‏‏‏‏ سَأَلْتُ مُحَمَّدًا عَنْ هَذَا فَقَالَ:‏‏‏‏ يُحْتَمَلُ أَنْ يَكُونَ قَتَادَةُ رَوَى عَنْهُمَا جَمِيعًا.",
                "headingArabic": "مَا يَقُولُ إِذَا دَخَلَ الْخَلاَءَ ‏",
                "headingUrdu": "ٹوائلٹ میں داخل ہوتے وقت کیا کہا جاتا ہے۔",
                "headingEnglish": "What Is Said When entering The Toilet",
                "chapterId": "1",
                "bookSlug": "al-tirmidhi",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 4,
                    "bookName": "Jami' Al-Tirmidhi",
                    "writerName": "Abu `Isa Muhammad at-Tirmidhi",
                    "aboutWriter": null,
                    "writerDeath": "279",
                    "bookSlug": "al-tirmidhi"
                },
                "chapter": {
                    "id": 156,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book on Purification",
                    "chapterUrdu": "طہارت کے احکام و مسائل",
                    "chapterArabic": "كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
                    "bookSlug": "al-tirmidhi"
                }
            },
            {
                "id": 15130,
                "hadithNumber": "6",
                "englishNarrator": "Anas bin Malik رضی الله عنہ said:",
                "hadithEnglish": "When the Prophet would enter the toilet 'He said: O Allah! Indeed I seek refuge in You from Al-Khubith and Al- Khaba'ith.",
                "hadithUrdu": "نبی اکرم صلی الله علیہ وسلم جب قضائے حاجت کے لیے بیت الخلاء میں داخل ہوتے تو پڑھتے: «اللهم إني أعوذ بك من الخبث والخبائث» ”اے اللہ میں تیری پناہ چاہتا ہوں ناپاک جنوں اور ناپاک جنیوں سے“ ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
                "urduNarrator": "ہمیں احمد بن عبدہ الضبی البصری نے خبر دی، ہمیں حماد بن زید نے خبر دی، وہ عبدالعزیز بن صہیب کی سند سے, انس بن مالک رضی الله عنہ کہتے ہیں کہ",
                "hadithArabic": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ الْبَصْرِيُّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا دَخَلَ الْخَلَاءَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبْثِ وَالْخَبَائِثِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "al-tirmidhi",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 4,
                    "bookName": "Jami' Al-Tirmidhi",
                    "writerName": "Abu `Isa Muhammad at-Tirmidhi",
                    "aboutWriter": null,
                    "writerDeath": "279",
                    "bookSlug": "al-tirmidhi"
                },
                "chapter": {
                    "id": 156,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book on Purification",
                    "chapterUrdu": "طہارت کے احکام و مسائل",
                    "chapterArabic": "كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
                    "bookSlug": "al-tirmidhi"
                }
            },
            {
                "id": 15131,
                "hadithNumber": "7",
                "englishNarrator": "Aishah [رضی الله عنہا] said:",
                "hadithEnglish": "When the Prophet would exit the toilet he would say: 'Ghufranak.'\r\n[Abu Eisa said:] This Hadith is Gharib Hassan. We do not now of it except from the narration of Isra'il, from Yunus bin Abu Burdah, and Abu  Burdah bin Abu Musa's name is 'Amir bin Abdullah bin Qais Al-Ashari. And we do not know of any narrations of this topic except for the hadith of Aishah رضی الله عنہا , from the prophet صلی الله علیہ وسلم .",
                "hadithUrdu": "نبی اکرم صلی الله علیہ وسلم قضائے حاجت کے بعد جب پاخانہ سے نکلتے تو فرماتے: «غفرانك‏» یعنی ”اے اللہ: میں تیری بخشش کا طلب گار ہوں“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن غریب ہے ۲؎، ۲- اس باب میں عائشہ رضی الله عنہا ہی کی حدیث معروف ہے ۳؎۔",
                "urduNarrator": "ہم سے محمد بن اسماعیل نے بیان کیا، ہم سے مالک بن اسماعیل نے بیان کیا، ان سے اسرائیل بن یونس نے، یوسف بن ابی بردہ سے، اپنے والد کی سند سے، ان سے ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيل، حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيل، عَنْ إِسْرَائِيلَ بْنِ يُونُسَ، عَنْ يُوسُفَ بْنِ أَبِي بُرْدَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا،‏‏‏‏ قَالَتْ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا خَرَجَ مِنَ الْخَلَاءِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ غُفْرَانَكَ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ، ‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ إِسْرَائِيلَ، ‏‏‏‏‏‏عَنْ يُوسُفَ بْنِ أَبِي بُرْدَةَ، ‏‏‏‏‏‏وَأَبُو بُرْدَةَ بْنُ أَبِي مُوسَى اسْمُهُ:‏‏‏‏ عَامِرُ بْنُ عَبْدِ اللَّهِ بْنِ قَيْسٍ الْأَشْعَرِيُّ، ‏‏‏‏‏‏وَلَا نَعْرِفُ فِي هَذَا الْبَابِ إِلَّا حَدِيثَ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": "مَا يَقُولُ إِذَا خَرَجَ مِنَ الْخَلاَءِ ‏",
                "headingUrdu": "ٹوائلٹ سے باہر نکلتے وقت کیا کہا جاتا ہے۔",
                "headingEnglish": "What Is Said When Exiting The Toilet",
                "chapterId": "1",
                "bookSlug": "al-tirmidhi",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 4,
                    "bookName": "Jami' Al-Tirmidhi",
                    "writerName": "Abu `Isa Muhammad at-Tirmidhi",
                    "aboutWriter": null,
                    "writerDeath": "279",
                    "bookSlug": "al-tirmidhi"
                },
                "chapter": {
                    "id": 156,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book on Purification",
                    "chapterUrdu": "طہارت کے احکام و مسائل",
                    "chapterArabic": "كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
                    "bookSlug": "al-tirmidhi"
                }
            },
            {
                "id": 15132,
                "hadithNumber": "8",
                "englishNarrator": "Abu Ayyub Al-Ansari رضی الله عنہ narrated:",
                "hadithEnglish": "Allah's Messenger said: When one of you arrives to defecate, then let none of you face the Qiblah while defecating, nor while urinating. And do not have your back towards it, but have it east of you or west of you.\"\r\nAbu Ayyub said: \"We arrived in Ash-Sham to find lavatories which were built facing the Qiblah, So we would turn from it, seeking Allah's forgiveness.\r\n[Abu Eisa said:] There are narrations on this topic from Abdullah bin Al-Harith [bin jaz'i Az-Zubaidi], Ma'qil bin Abi Ma'qil and Abu Umamah, Abu Hurairah, and Sahl bi Hunaif.\"\r\n[Abu Eisa said:] The hadith of Abu Ayyub is the best thing of this topic and the most correct.\r\nAbu Ayyub's name is Khalid bin Zaid, and Az-Zuhri's name is Muhammad bin Muslim bin 'Ubaidullah bin Shihab Az-Zuhri, and his Kunya is Abu Bakr. Abu Al-Walid Al-Makki said, \"Abdullah [Muhammad bin Idris] Ash Shafi said, 'The saying of the prophet  صلی الله علیہ وسلم : \"Do not face the Qiblah for defecation, nor for urination, nor turn your back to it\" only means in desert. As for a lavatory that is constructed, there is an allowance to face it in that.'\"\r\nIshaq (bin Ibrahim) also said this. Ahmad bin Hanbal said: There is only an allowance from the prophet to have one's back towards the Qiblah. As for facing the Qiblah, then it is not to be faced.\" \r\nIt is as If he did not hold the views that one could face the Qiblah in the desert nor in the lavatory.",
                "hadithUrdu": "رسول اللہ صلی الله علیہ وسلم نے فرمایا: ”جب تم قضائے حاجت کے لیے جاؤ تو پاخانہ یا پیشاب کے وقت قبلہ کی طرف منہ نہ کرو اور نہ پیٹھ، بلکہ منہ کو پورب یا پچھم کی طرف کرو“ ۱؎۔ ابوایوب انصاری کہتے ہیں: ہم شام آئے تو ہم نے دیکھا کہ پاخانے قبلہ رخ بنائے گئے ہیں تو قبلہ کی سمت سے ترچھے مڑ جاتے اور ہم اللہ سے مغفرت طلب کرتے۔ امام ترمذی کہتے ہیں: ۱- اس باب میں عبداللہ بن حارث بن جزء زبیدی، معقل بن ابی ہیشم ( معقل بن ابی معقل ) ابوامامہ، ابوہریرہ اور سہل بن حنیفqے بھی احادیث آئی ہیں، ۲- ابوایوب کی حدیث اس باب میں سب سے عمدہ اور سب سے صحیح ہے، ۳- ابوالولید مکی کہتے ہیں: ابوعبداللہ محمد بن ادریس شافعی کا کہنا ہے کہ نبی اکرم صلی الله علیہ وسلم نے جو یہ فرمایا ہے کہ پاخانہ یا پیشاب کے وقت قبلہ کی طرف منہ نہ کرو اور نہ پیٹھ، اس سے مراد صرف صحراء ( میدان ) میں نہ کرنا ہے، رہے بنے بنائے پاخانہ گھر تو ان میں قبلہ کی طرف منہ کرنا جائز ہے، اسی طرح اسحاق بن ابراہیم بن راہویہ نے بھی کہا ہے، احمد بن حنبل کہتے ہیں کہ نبی اکرم صلی الله علیہ وسلم سے پاخانہ یا پیشاب کے وقت قبلہ کی طرف صرف پیٹھ کرنے کی رخصت ہے، رہا قبلہ کی طرف منہ کرنا تو یہ کسی بھی طرح جائز نہیں، گویا کہ ( امام احمد ) قبلہ کی طرف منہ کرنے کو نہ صحراء میں جائز قرار دیتے ہیں اور نہ ہی بنے بنائے پاخانہ گھر میں ( البتہ پیٹھ کرنے کو بیت الخلاء میں جائز سمجھتے ہیں ) ۔",
                "urduNarrator": "ہم سے سعید بن عبدالرحمٰن مخزومی نے بیان کیا، ہم سے سفیان بن عیینہ نے، زہری کی سند سے، عطاء بن یزید لیثی کی سند سے بیان کیا, ابوایوب انصاری رضی الله عنہ کہتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ الْمَخْزُومِيُّ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ الزُّهْرِيِّ، عَنْ عَطَاءَ بْنِ يَزِيدَ اللَّيْثِيِّ، عَنْ أَبِي أَيُّوبَ الْأَنْصَارِيِّ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِذَا أَتَيْتُمُ الْغَائِطَ فَلَا تَسْتَقْبِلُوا الْقِبْلَةَ بِغَائِطٍ وَلَا بَوْلٍ وَلَا تَسْتَدْبِرُوهَا وَلَكِنْ شَرِّقُوا أَوْ غَرِّبُوا . فقَالَ أَبُو أَيُّوبَ:‏‏‏‏ فَقَدِمْنَا الشَّامَ فَوَجَدْنَا مَرَاحِيضَ قَدْ بُنِيَتْ مُسْتَقْبَلَ الْقِبْلَةِ فَنَنْحَرِفُ عَنْهَا وَنَسْتَغْفِرُ اللَّهَ. قال أبو عيسى:‏‏‏‏ وَفِي الْبَاب عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ بْنِ جَزْءٍ الزُّبَيْدِيِّ،‏‏‏‏ وَمَعْقِلِ بْنِ أَبِي الْهَيْثَمِ، ‏‏‏‏‏‏وَيُقَالُ:‏‏‏‏ مَعْقِلُ بْنُ أَبِي مَعْقِلٍ،‏‏‏‏ وَأَبِي أُمَامَةَ،‏‏‏‏ وَأَبِي هُرَيْرَةَ،‏‏‏‏ وَسَهْلِ بْنِ حُنَيْفٍ. قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ أَبِي أَيُّوبَ أَحْسَنُ شَيْءٍ فِي هَذَا الْبَابِ وَأَصَحُّ، ‏‏‏‏‏‏وَأَبُو أَيُّوبَ اسْمُهُ:‏‏‏‏ خَالِدُ بْنُ زَيْدٍ، ‏‏‏‏‏‏وَالزُّهْرِيُّ اسْمُهُ:‏‏‏‏ مُحَمَّدُ بْنُ مُسْلِمٍ بْنِ عُبَيْدِ اللَّهِ بْنِ شِهَابٍ الزُّهْرِيُّ، ‏‏‏‏‏‏وَكُنْيَتُهُ:‏‏‏‏ أَبُو بَكْرٍ، ‏‏‏‏‏‏قَالَ أَبُو الْوَلِيدِ الْمَكِّيُّ:‏‏‏‏ قَالَ أَبُو عَبْدِ اللَّهِ مُحَمَّدُ بْنُ إِدْرِيسَ الشَّافِعِيُّ:‏‏‏‏ إِنَّمَا مَعْنَى قَوْلِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا تَسْتَقْبِلُوا الْقِبْلَةَ بِغَائِطٍ وَلَا بِبَوْلٍ وَلَا تَسْتَدْبِرُوهَا إِنَّمَا هَذَا فِي الْفَيَافِي، ‏‏‏‏‏‏وَأَمَّا فِي الْكُنُفِ الْمَبْنِيَّةِ لَهُ رُخْصَةٌ فِي أَنْ يَسْتَقْبِلَهَا، ‏‏‏‏‏‏وَهَكَذَا قَالَ إِسْحَاق بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏وقَالَ أَحْمَدُ بْنُ حَنْبَلٍ رَحِمَهُ اللَّهُ:‏‏‏‏ إِنَّمَا الرُّخْصَةُ مِنَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي اسْتِدْبَارِ الْقِبْلَةِ بِغَائِطٍ أَوْ بَوْلٍ، ‏‏‏‏‏‏وَأَمَّا اسْتِقْبَالُ الْقِبْلَةِ فَلَا يَسْتَقْبِلُهَا كَأَنَّهُ لَمْ يَرَ فِي الصَّحْرَاءِ وَلَا فِي الْكُنُفِ أَنْ يَسْتَقْبِلَ الْقِبْلَةَ.",
                "headingArabic": "فِي النَّهْىِ عَنِ اسْتِقْبَالِ الْقِبْلَةِ، بِغَائِطٍ أَوْ بَوْلٍ ‏",
                "headingUrdu": "رفع حاجت اور پیشاب کرتے وقت قبلہ کی طرف منہ کرنے کی ممانعت کے بارے میں۔",
                "headingEnglish": "Regarding The Prohibition Of Facing The Qiblah When Defecating And Urinating.",
                "chapterId": "1",
                "bookSlug": "al-tirmidhi",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 4,
                    "bookName": "Jami' Al-Tirmidhi",
                    "writerName": "Abu `Isa Muhammad at-Tirmidhi",
                    "aboutWriter": null,
                    "writerDeath": "279",
                    "bookSlug": "al-tirmidhi"
                },
                "chapter": {
                    "id": 156,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book on Purification",
                    "chapterUrdu": "طہارت کے احکام و مسائل",
                    "chapterArabic": "كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
                    "bookSlug": "al-tirmidhi"
                }
            },
            {
                "id": 15133,
                "hadithNumber": "9",
                "englishNarrator": "Jabir bin Abdullah رضی الله عنہما said:",
                "hadithEnglish": "The Prophet prohibited us from facing the Qiblah while urinating. Then i saw him facing it a year before he died.\r\nThere are narrations on this topic from Abu Qatadah, Aishah, and Ammar [bin Yasar رضی الله عنہم].\r\n[Abu Eisa said:] The Hadith of Jabir on this topic is a Hassan Gharib Hadith.",
                "hadithUrdu": "نبی اکرم صلی الله علیہ وسلم نے اس بات سے منع فرمایا کہ ہم پیشاب کے وقت قبلہ کی طرف منہ کریں، پھر میں نے وفات سے ایک سال پہلے آپ کو قبلہ کی طرف منہ کر کے پیشاب کرتے ہوئے دیکھا۔ امام ترمذی کہتے ہیں: ۱- اس باب میں جابر رضی الله عنہ کی یہ حدیث حسن غریب ہے، ۲- اس باب میں ابوقتادہ، عائشہ، اور عمار بن یاسر رضی الله عنہم سے بھی احادیث آئی ہیں۔",
                "urduNarrator": "ہم سے محمد بن بشار اور محمد بن المثنیٰ نے بیان کیا، کہا ہم سے وہب بن جریر نے بیان کیا، کہا ہم سے میرے والد نے بیان کیا، ان سے محمد بن اسحاق نے، وہ ابان بن صالح کی سند سے، انہوں نے مجاہد کی سند سے, جابر بن عبداللہ رضی الله عنہما کہتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،‏‏‏‏ وَمُحَمَّدُ بْنُ الْمُثَنَّى،‏‏‏‏ قَالَا:‏‏‏‏ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا أَبِي، عَنْ مُحَمَّدِ بْنِ إِسْحَاق، عَنْ أَبَانَ بْنِ صَالِحٍ، عَنْ مُجَاهِدٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ:‏‏‏‏ نَهَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَسْتَقْبِلَ الْقِبْلَةَ بِبَوْلٍ، ‏‏‏‏‏‏فَرَأَيْتُهُ قَبْلَ أَنْ يُقْبَضَ بِعَامٍ يَسْتَقْبِلُهَا . وَفِي الْبَاب عَنْ أَبِي قَتَادَةَ،‏‏‏‏ وَعَائِشَةَ،‏‏‏‏ وَعَمَّارِ بْنِ يَاسِرٍ. قال أبو عيسى:‏‏‏‏ حَدِيثُ جَابِرٍ فِي هَذَا الْبَابِ حَسَنٌ غَرِيبٌ.",
                "headingArabic": "مَا جَاءَ مِنَ الرُّخْصَةِ فِي ذَلِكَ ‏",
                "headingUrdu": "اس کی اجازت کے بارے میں کیا کیا گیا ہے؟",
                "headingEnglish": "What Has Been Related About The Permission for That",
                "chapterId": "1",
                "bookSlug": "al-tirmidhi",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 4,
                    "bookName": "Jami' Al-Tirmidhi",
                    "writerName": "Abu `Isa Muhammad at-Tirmidhi",
                    "aboutWriter": null,
                    "writerDeath": "279",
                    "bookSlug": "al-tirmidhi"
                },
                "chapter": {
                    "id": 156,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book on Purification",
                    "chapterUrdu": "طہارت کے احکام و مسائل",
                    "chapterArabic": "كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
                    "bookSlug": "al-tirmidhi"
                }
            },
            {
                "id": 15134,
                "hadithNumber": "10",
                "englishNarrator": "Abu Qatadah رضی الله عنہ narrated:",
                "hadithEnglish": "He saw the Prophet urinating while facing the Qiblah. Qutaibah narrated that to us, he said: Ibn Lahi'ah informed us. Jabir's Hadlth about the Prophet is more correct than the Hadith of Ibn Lahi'ah. Ibn Lahi'ah is weak according to the scholars of Hadith. He was graded weak by Yahya bin Sa'eed Al-Qattan, and others, [due to his memorization].",
                "hadithUrdu": "انہوں نے نبی اکرم صلی الله علیہ وسلم کو قبلہ کی طرف منہ کر کے پیشاب کرتے ہوئے دیکھا ہے۔ جابر رضی الله عنہ کی نبی اکرم صلی الله علیہ وسلم سے یہ حدیث ابن لہیعہ کی حدیث ( جس میں جابر کے بعد ابوقتادہ رضی الله عنہ کا واسطہ ہے ) سے زیادہ صحیح ہے، ابن لہیعہ محدّثین کے نزدیک ضعیف ہیں، یحییٰ بن سعیدالقطان وغیرہ نے ان کی حفظ کے اعتبار سے تضعیف کی ہے۔",
                "urduNarrator": "عبداللہ بن لہیعہ نے یہ حدیث ابوالزبیر سے اور ابوالزبیر نے جابر رضی الله عنہ سے کہ ابوقتادہ رضی الله عنہ نے",
                "hadithArabic": "وَقَدْ رَوَى هَذَا الْحَدِيثَ ابْنُ لَهِيعَةَ، ‏‏‏‏‏‏عَنْ أَبِي الزُّبَيْرِ،‏‏‏‏ عَنْ جَابِرٍ، عَنْ أَبِي قَتَادَةَ، أَنَّهُ رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَبُولُ مُسْتَقْبِلَ الْقِبْلَةِ . حَدَّثَنَا بِذَلِكَ قُتَيْبَةُ، حَدَّثَنَا ابْنُ لَهِيعَةَ، وَحَدِيثُ جَابِرٍ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَصَحُّ مِنْ حَدِيثِ ابْنِ لَهِيعَةَ، ‏‏‏‏‏‏وَابْنُ لَهِيعَةَ ضَعِيفٌ عِنْدَ أَهْلِ الْحَدِيثِ، ‏‏‏‏‏‏ضَعَّفَهُ يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ وَغَيْرُهُ مِنْ قِبَلِ حِفْظِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "al-tirmidhi",
                "volume": "1",
                "status": "Da`eef",
                "book": {
                    "id": 4,
                    "bookName": "Jami' Al-Tirmidhi",
                    "writerName": "Abu `Isa Muhammad at-Tirmidhi",
                    "aboutWriter": null,
                    "writerDeath": "279",
                    "bookSlug": "al-tirmidhi"
                },
                "chapter": {
                    "id": 156,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book on Purification",
                    "chapterUrdu": "طہارت کے احکام و مسائل",
                    "chapterArabic": "كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
                    "bookSlug": "al-tirmidhi"
                }
            },
            {
                "id": 15135,
                "hadithNumber": "11",
                "englishNarrator": "Ibn 'Umar رضی الله عنہما said:",
                "hadithEnglish": "One day I climbed on Hafsah's house, and I saw the Prophet relieving himself while facing Ash-Sham, with his back toward the Ka'bah.\r\n[Abu Eisa said:] This Hadith of Hasan Sahih.",
                "hadithUrdu": "ایک روز میں ( اپنی بہن ) حفصہ رضی الله عنہا کے گھر کی چھت پر چڑھا تو نبی اکرم صلی الله علیہ وسلم کو دیکھا کہ آپ شام کی طرف منہ اور کعبہ کی طرف پیٹھ کر کے قضائے حاجت فرما رہے ہیں ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
                "urduNarrator": "ہم سے ہناد نے بیان کیا، ہم سے عبد بن سلیمان نے بیان کیا، ان سے عبید اللہ بن عمر نے، محمد بن یحییٰ بن حبان سے، اپنے چچا وصی بن حبان سے, عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنْ عَمِّهِ وَاسِعِ بْنِ حَبَّانَ، عَنْ ابْنِ عُمَرَ، قَالَ:‏‏‏‏ رَقِيتُ يَوْمًا عَلَى بَيْتِ حَفْصَةَ، ‏‏‏‏‏‏فَرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى حَاجَتِهِ مُسْتَقْبِلَ الشَّامِ مُسْتَدْبِرَ الْكَعْبَةِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَسَنٌ صَحِيحٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "al-tirmidhi",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 4,
                    "bookName": "Jami' Al-Tirmidhi",
                    "writerName": "Abu `Isa Muhammad at-Tirmidhi",
                    "aboutWriter": null,
                    "writerDeath": "279",
                    "bookSlug": "al-tirmidhi"
                },
                "chapter": {
                    "id": 156,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book on Purification",
                    "chapterUrdu": "طہارت کے احکام و مسائل",
                    "chapterArabic": "كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
                    "bookSlug": "al-tirmidhi"
                }
            },
            {
                "id": 15136,
                "hadithNumber": "12",
                "englishNarrator": "Aishah رضی الله عنہا said:",
                "hadithEnglish": "Whoever narrated to you that the Prophet would urinate while standing; then do not believe him. He would not urinate except while squatting. [He said:] There are narrations on this topic from Umar رضی الله عنہ , Buraidah رضی الله عنہ , [and Abdur-Rahman bin Hasanah].\r\n[Abu Eisa said:] The hadith of 'Aishah is the best thing narrated on this topic and the most correct.\r\nThe Hadith of 'Umar is only reported from the narration of Abdul Karim bin Abi Al-Mukhariq, from Nafi, from Ibn Umar, from 'Umar who said: \"I saw the prophet [While I was] urination standing. So he said: 'O 'Umar! Do not urinate while standing. While standing. So I did not urinate while standing afterwards.\"\r\n[Abu Eisa said:] This Hadith was only attributed to the prophet صلی الله علیہ وسلم in the narration of Abdul Karim bin Abi Al-Mukhriq. He is weak according to the scholars of Hadith. Ayyub As-Sakhtiyani graded him weak and criticized him.\r\n'Ubidullah reported from Nafi from Ibn 'Umar رضی الله عنہ who said, \"Umar رضی الله عنہ said: 'I have urinated while standing since I accepted Islam.'\"\r\nThis is more correct them the hadith of 'Abdul Karim. And the Hadith of Buraidah about this is not safe. And the meaning of the prohibition of urinating while standing is for discipline, not to make it unlawful. Indeed it has been reported from 'Abdullah bin Mas'ud that he said: \"Among the loathsome things is urinating while you are standing.",
                "hadithUrdu": "جو تم سے یہ کہے کہ نبی اکرم صلی الله علیہ وسلم کھڑے ہو کر پیشاب کرتے تھے تو تم اس کی تصدیق نہ کرنا، آپ بیٹھ کر ہی پیشاب کرتے تھے ۱؎۔ امام ترمذی کہتے ہیں: ۱- اس باب میں عمر، بریدہ، عبدالرحمٰن بن حسنہ رضی الله عنہم سے بھی احادیث آئی ہیں، ۲- اس باب میں عائشہ رضی الله عنہا کی یہ حدیث سب سے زیادہ عمدہ اور صحیح ہے، ۳- عمر رضی الله عنہ کی حدیث میں ہے کہ مجھے نبی اکرم صلی الله علیہ وسلم نے کھڑے ہو کر پیشاب کرتے ہوئے دیکھا تو فرمایا: ”عمر! کھڑے ہو کر پیشاب نہ کرو“، چنانچہ اس کے بعد سے میں نے کبھی بھی کھڑے ہو کر پیشاب نہیں کیا۔ عمر رضی الله عنہ کی اس حدیث کو عبدالکریم ابن ابی المخارق نے مرفوعاً روایت کیا ہے اور وہ محدثین کے نزدیک ضعیف ہیں، ایوب سختیانی نے ان کی تضعیف کی ہے اور ان پر کلام کیا ہے، نیز یہ حدیث عبیداللہ نے نافع سے اور نافع نے ابن عمر سے کہ عمر رضی الله عنہ کہتے ہیں کہ میں نے جب سے اسلام قبول کیا کبھی کھڑے ہو کر پیشاب نہیں کیا۔ یہ حدیث عبدالکریم بن ابی المخارق کی حدیث سے ( روایت کے اعتبار سے ) زیادہ صحیح ہے ۲؎، ۴- اس باب میں بریدۃ رضی الله عنہ کی حدیث محفوظ نہیں ہے، ۵- کھڑے ہو کر پیشاب کرنے کی ممانعت ادب کے اعتبار سے ہے حرام نہیں ہے ۳؎، ۶- عبداللہ بن مسعود رضی الله عنہ سے منقول ہے کہ تم کھڑے ہو کر پیشاب کرو یہ پھوہڑ پن ہے ۴؎۔",
                "urduNarrator": "ہم سے علی بن حجر نے بیان کیا، کہا ہم سے شریک نے بیان کیا، مقدام بن شریح نے اپنے والد سے, ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، أَخْبَرَنَا شَرِيكٌ، عَنْ الْمِقْدَامِ بْنِ شُرَيْحٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ:‏‏‏‏ مَنْ حَدَّثَكُمْ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَبُولُ قَائِمًا فَلَا تُصَدِّقُوهُ مَا كَانَ يَبُولُ إِلَّا قَاعِدًا . قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ عُمَرَ،‏‏‏‏ وَبُرَيْدَةَ،‏‏‏‏ وَعَبْدِ الرَّحْمَنِ بْنِ حَسَنَةَ. قال أبو عيسى:‏‏‏‏ حَدِيثُ عَائِشَةَ أَحْسَنُ شَيْءٍ فِي هَذَا الْبَابِ وَأَصَحُّ، ‏‏‏‏‏‏وَحَدِيثُ عُمَرَ إِنَّمَا رُوِيَ مِنْ حَدِيثِ عَبْدِ الْكَرِيمِ بْنِ أَبِي الْمُخَارِقِ، ‏‏‏‏‏‏عَنْ نَافِعٍ، ‏‏‏‏‏‏عَنْ ابْنِ عُمَرَ، ‏‏‏‏‏‏عَنْ عُمَرَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ رَآنِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا أَبُولُ قَائِمًا، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا عُمَرُ لَا تَبُلْ قَائِمًا ،‏‏‏‏ فَمَا بُلْتُ قَائِمًا بَعْدُ. قَالَ أَبُو عِيسَى:‏‏‏‏ وَإِنَّمَا رَفَعَ هَذَا الْحَدِيثَ عَبْدُ الْكَرِيمِ بْنُ أَبِي الْمُخَارِقِ وَهُوَ ضَعِيفٌ عِنْدَ أَهْلِ الْحَدِيثِ، ‏‏‏‏‏‏ضَعَّفَهُ أَيُّوبُ السَّخْتِيَانِيُّ وَتَكَلَّمَ فِيهِ،‏‏‏‏ وَرَوَى عُبَيْدُ اللَّهِ، ‏‏‏‏‏‏عَنْ نَافِعٍ، ‏‏‏‏‏‏عَنْ ابْنِ عُمَرَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ:‏‏‏‏ مَا بُلْتُ قَائِمًا مُنْذُ أَسْلَمْتُ. وَهَذَا أَصَحُّ مِنْ حَدِيثِ عَبْدِ الْكَرِيمِ،‏‏‏‏ وَحَدِيثُ بُرَيْدَةَ فِي هَذَا غَيْرُ مَحْفُوظٍ، ‏‏‏‏‏‏وَمَعْنَى النَّهْيِ عَنِ الْبَوْلِ قَائِمًا عَلَى التَّأْدِيبِ لَا عَلَى التَّحْرِيمِ، ‏‏‏‏‏‏وَقَدْ رُوِيَ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ إِنَّ مِنَ الْجَفَاءِ أَنْ تَبُولَ وَأَنْتَ قَائِمٌ.",
                "headingArabic": "مَا جَاءَ فِي النَّهْىِ عَنِ الْبَوْلِ، قَائِمًا ‏",
                "headingUrdu": "(جس کا تعلق ہے) کھڑے ہوکر پیشاب کرنے کی ممانعت",
                "headingEnglish": "(What Has Been Related About) The Prohibition Of Urinating While Standing",
                "chapterId": "1",
                "bookSlug": "al-tirmidhi",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 4,
                    "bookName": "Jami' Al-Tirmidhi",
                    "writerName": "Abu `Isa Muhammad at-Tirmidhi",
                    "aboutWriter": null,
                    "writerDeath": "279",
                    "bookSlug": "al-tirmidhi"
                },
                "chapter": {
                    "id": 156,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book on Purification",
                    "chapterUrdu": "طہارت کے احکام و مسائل",
                    "chapterArabic": "كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
                    "bookSlug": "al-tirmidhi"
                }
            },
            {
                "id": 15137,
                "hadithNumber": "13",
                "englishNarrator": "Hudhaifah رضی الله عنہ narrated:",
                "hadithEnglish": "Allah's Messenger صلی الله علیہ وسلم came to a waste area used by people, so he urinated on it while standing. I brought him the (water for) Wudu. Then I left to be away from him, but he called me until I was behind him. So he performed Wudu and wiped (Masaba) over his Khuff.\r\n[Abu Eisa said:] I heard Al-Jarud saying: \"I heard 'Waki narrating this Hadith from Al-Amash, then Waki said, This is the most correct Hadith reported from the prophet about wiping (over khuff)'\" And I heard Abu Ammar Al-Husain bin Huraith saying: \"I heard Waki,\" then he mentioned a similar narration.]\r\n[Abu Eisa said:] Like this was reported by Mansur, And 'Ubaidah Ad-Dabbi, from \r\n Abu Wail from Hudhaifah, (all) similar to the narration of Al-Amash. Hammd bin Abu Sulaiman and 'Asim bin Bahdalah reported it from Abu Wail from Al-Mughirah bin Shubah, from the prophet . But the Hadith of Abu Wail from Hudhaifah is more correct.\r\nThere are those among the people of knowledge who have permitted urinating from while standing.\r\n[Abu Eisa said: It was reported from Abidah bin Amr As- Salmani by Ibrahim An-Nakha'i and Abidah is one of the major Tabi'in, It is reported that Abidah said, I accepted Islam from the prophet died by two years.\" 'Ubaidah add-Dabbi, the companion of Ibrahim, is Ubaidah bin Mu'attib Ad-Dabbi, and his kunya is Abu 'Abdul karim].",
                "hadithUrdu": "نبی اکرم صلی الله علیہ وسلم کا گزر ایک قوم کے کوڑے کرکٹ کے ڈھیر پر سے ہوا تو آپ نے اس پر کھڑے ہو کر پیشاب کیا، میں آپ کے لیے وضو کا پانی لایا، اسے رکھ کر میں پیچھے ہٹنے لگا، تو آپ نے مجھے اشارے سے بلایا، میں ( آ کر ) آپ کی ایڑیوں کے پاس کھڑا ہو گیا، آپ نے وضو کیا اور اپنے موزوں پر مسح کیا۔ امام ترمذی کہتے ہیں: ۱- وکیع کہتے ہیں: یہ حدیث مسح کے سلسلہ میں نبی اکرم صلی الله علیہ وسلم سے مروی حدیثوں میں سب سے زیادہ صحیح ہے۔ ۲- یہ حدیث بروایت مغیرہ بن شعبہ رضی الله عنہ بھی نبی اکرم صلی الله علیہ وسلم سے مروی ہے ۱؎ ابووائل کی حدیث جسے انہوں نے حذیفہ سے روایت کیا ( مغیرہ کی روایت سے ) زیادہ صحیح ہے ۲؎، ۳- محدثین میں سے اہل علم کی ایک جماعت نے کھڑے ہو کر پیشاب کرنے کی اجازت دی ہے۔",
                "urduNarrator": "ہم سے ہناد نے بیان کیا، وکیع نے، الاعمش کی سند سے، ابو وائل کی سند سے، حذیفہ بن یمان رضی الله عنہ کہتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا وَكِيعٌ، عَنْ الْأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ حُذَيْفَةَ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَى سُبَاطَةَ قَوْمٍ فَبَالَ عَلَيْهَا قَائِمًا، ‏‏‏‏‏‏فَأَتَيْتُهُ بِوَضُوءٍ فَذَهَبْتُ لِأَتَأَخَّرَ عَنْهُ، ‏‏‏‏‏‏فَدَعَانِي حَتَّى كُنْتُ عِنْدَ عَقِبَيْهِ، ‏‏‏‏‏‏فَتَوَضَّأَ وَمَسَحَ عَلَى خُفَّيْهِ . قَالَ أَبُو عِيسَى:‏‏‏‏ وسَمِعْت الْجَارُودَ، يَقُولُ:‏‏‏‏ سَمِعْتُ وَكِيعًا يُحَدِّثُ بِهَذَا الْحَدِيثِ،‏‏‏‏ عَنْ الْأَعْمَشِ، ثُمَّ قَالَ وَكِيعٌ:‏‏‏‏ هَذَا أَصَحُّ حَدِيثٍ رُوِيَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَسْحِ،‏‏‏‏ وسَمِعْت أَبَا عَمَّارٍ الْحُسَيْنَ بْنَ حُرَيْثٍ، يَقُولُ:‏‏‏‏ سَمِعْتُ وَكِيعًا فَذَكَرَ نَحْوَهُ. قال أبو عيسى:‏‏‏‏ وَهَكَذَا رَوَى مَنْصُورٌ،‏‏‏‏ وَعُبَيْدَةُ الضَّبِّيُّ، ‏‏‏‏‏‏عَنْ أَبِي وَائِلٍ، ‏‏‏‏‏‏عَنْ حُذَيْفَةَ مِثْلَ رِوَايَةِ الْأَعْمَشِ، ‏‏‏‏‏‏وَرَوَى حَمَّادُ بْنُ أَبِي سُلَيْمَانَ،‏‏‏‏ وَعَاصِمُ بْنُ بَهْدَلَةَ، ‏‏‏‏‏‏عَنْ أَبِي وَائِلٍ، ‏‏‏‏‏‏عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏وَحَدِيثُ أَبِي وَائِلٍ، ‏‏‏‏‏‏عَنْ حُذَيْفَةَ أَصَحُّ، ‏‏‏‏‏‏وَقَدْ رَخَّصَ قَوْمٌ مِنْ أَهْلِ الْعِلْمِ فِي الْبَوْلِ قَائِمًا. قال أبو عيسى:‏‏‏‏ وَعَبِيدَةُ بْنُ عَمْرٍو السَّلْمَانِيُّ رَوَى عَنْهُ إِبْرَاهِيمُ النَّخَعِيُّ،‏‏‏‏ وَعَبِيدَةُ مِنْ كِبَارِ التَّابِعِينَ، ‏‏‏‏‏‏يُرْوَى عَنْ عَبِيدَةَ، ‏‏‏‏‏‏أَنَّهُ قَالَ:‏‏‏‏ أَسْلَمْتُ قَبْلَ وَفَاةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِسَنَتَيْنِ، ‏‏‏‏‏‏وَعُبَيْدَةُ الضَّبِّيُّ صَاحِبُ إِبْرَاهِيمَ هُوَ عُبَيْدَةُ بْنُ مُعَتِّبٍ الضَّبِّيُّ، ‏‏‏‏‏‏وَيُكْنَى:‏‏‏‏ أَبَا عَبْدِ الْكَرِيمِ.",
                "headingArabic": "مَاجَاءَمِنَ الرُّخْصَةِ فِي ذَلِكَ ‏",
                "headingUrdu": "اس کے لئے اجازت کے بارے میں کیا کیا گیا ہے",
                "headingEnglish": "What Has Been Related About The Permission For That",
                "chapterId": "1",
                "bookSlug": "al-tirmidhi",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 4,
                    "bookName": "Jami' Al-Tirmidhi",
                    "writerName": "Abu `Isa Muhammad at-Tirmidhi",
                    "aboutWriter": null,
                    "writerDeath": "279",
                    "bookSlug": "al-tirmidhi"
                },
                "chapter": {
                    "id": 156,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book on Purification",
                    "chapterUrdu": "طہارت کے احکام و مسائل",
                    "chapterArabic": "كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
                    "bookSlug": "al-tirmidhi"
                }
            },
            {
                "id": 15138,
                "hadithNumber": "14",
                "englishNarrator": "Anas  رضی الله عنہ said:",
                "hadithEnglish": "When the Prophet wanted to relieve himself, he would not raise his garment until he was close to the ground.\r\nWhen the Prophet wanted to relieve himself, he would not raise his garment until he was close to the ground.\r\nAbu Eisa said: This is how Muhammad bin Rabi'ah reported this hadith: \"from Al-Amash, from Anas.\"\r\nWaki, and [Abu Yahya] Al-Himmani reported that Al-Amash said: \"Ibn Umar, may Allah most high be pleased with him, said, when the prophet wanted to relieve himself, he would not raise until he was close to the ground.'\"\r\nBoth of the Ahadith are Mursal. They say that Al-Amash did not hear from Anas, nor any of the companions of the prophet. But he saw Anas bin Malik. He said, \"I saw him prayer.\" And he mention something about him regarding the prayer. And Al-Amash's name is Sulaiman bin Mihran, Abu Muhammad Kahili, being their freed slave. Al-Amash said, \"My father was a Hamil so he made Masruq an heir.\"",
                "hadithUrdu": "نبی اکرم صلی الله علیہ وسلم جب قضائے حاجت کا ارادہ فرماتے تو جب تک زمین سے بالکل قریب نہ ہو جاتے اپنے کپڑے نہیں اٹھاتے تھے۔ دوسری سند میں اعمش سے روایت ہے، ابن عمر رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی الله علیہ وسلم جب قضائے حاجت کا ارادہ فرماتے کپڑے جب تک زمین سے قریب نہیں ہو جاتے نہیں اٹھاتے تھے ۱؎۔ امام ترمذی کہتے ہیں: یہ دونوں احادیث مرسل ہیں، اس لیے کہ کہا جاتا ہے: دونوں احادیث کے راوی سلیمان بن مہران الأعمش نے نہ ہی تو انس بن مالک رضی الله عنہ سے سماعت کی ہے اور نہ ہی کسی اور صحابی سے، صرف اتنا ہے کہ انس کو صرف انہوں نے دیکھا ہے، اعمش کہتے ہیں کہ میں نے انہیں نماز پڑھتے دیکھا ہے پھر ان کی نماز کی کیفیت بیان کی۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا کہ ہم سے عبدالسلام بن حرب ملّی نے اعمش کی سند سے بیان کیا، انس رضی الله عنہ کہتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ السَّلَامِ بْنُ حَرْبٍ الْمُلَائِيُّ، عَنْ الْأَعْمَشِ، عَنْ أَنَسٍ، قَالَ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَرَادَ الْحَاجَةَ لَمْ يَرْفَعْ ثَوْبَهُ حَتَّى يَدْنُوَ مِنَ الْأَرْضِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَكَذَا رَوَى مُحَمَّدُ بْنُ رَبِيعَةَ، ‏‏‏‏‏‏عَنْ الْأَعْمَشِ، ‏‏‏‏‏‏عَنْ أَنَسٍ هَذَا الْحَدِيثَ، ‏‏‏‏‏‏وَرَوَى وَكِيعٌ،‏‏‏‏ وَأَبُو يَحْيَى الْحِمَّانِيُّ، ‏‏‏‏‏‏عَنْ الْأَعْمَشِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ ابْنُ عُمَرَ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَرَادَ الْحَاجَةَ لَمْ يَرْفَعْ ثَوْبَهُ حَتَّى يَدْنُوَ مِنَ الْأَرْضِ . وَكِلَا الْحَدِيثَيْنِ مُرْسَلٌ، ‏‏‏‏‏‏وَيُقَالُ:‏‏‏‏ لَمْ يَسْمَعْ الْأَعْمَشُ مِنْ أَنَسٍ وَلَا مِنْ أَحَدٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏وَقَدْ نَظَرَ إِلَى أَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ رَأَيْتُهُ يُصَلِّي، ‏‏‏‏‏‏فَذَكَرَ عَنْهُ حِكَايَةً فِي الصَّلَاةِ، ‏‏‏‏‏‏وَالْأَعْمَشُ اسْمُهُ:‏‏‏‏ سُلَيْمَانُ بْنُ مِهْرَانَ أَبُو مُحَمَّدٍ الْكَاهِلِيُّ، ‏‏‏‏‏‏وَهُوَ مَوْلًى لَهُمْ، ‏‏‏‏‏‏قَالَ الْأَعْمَشُ:‏‏‏‏ كَانَ أَبِي حَمِيلًا فَوَرَّثَهُ مَسْرُوقٌ.",
                "headingArabic": "مَا جَاءَ فِي الاِسْتِتَارِ عِنْدَ الْحَاجَةِ",
                "headingUrdu": "اپنے آپ کو راحت دیتے وقت اسکریننگ ہونے کے بارے میں",
                "headingEnglish": "[What Has Been Related] About Being Screened While Relieving Oneself",
                "chapterId": "1",
                "bookSlug": "al-tirmidhi",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 4,
                    "bookName": "Jami' Al-Tirmidhi",
                    "writerName": "Abu `Isa Muhammad at-Tirmidhi",
                    "aboutWriter": null,
                    "writerDeath": "279",
                    "bookSlug": "al-tirmidhi"
                },
                "chapter": {
                    "id": 156,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book on Purification",
                    "chapterUrdu": "طہارت کے احکام و مسائل",
                    "chapterArabic": "كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
                    "bookSlug": "al-tirmidhi"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 14826,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=593",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=591",
                "label": "591",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=592",
                "label": "592",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=593",
                "label": "593",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=594",
                "label": "594",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=595",
                "label": "595",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=596",
                "label": "596",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=597",
                "label": "597",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=595",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=595",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=593",
        "to": 14850,
        "total": 40465
    }
}