{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 485,
        "data": [
            {
                "id": 12389,
                "hadithNumber": "4826",
                "englishNarrator": "It has been reported on the authority of Mujashi' bin Mas'ud as-Sulami رضی اللہ عنہ who said:",
                "hadithEnglish": "I came to the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) to offer him my pledge of migration. He said: The period of migration has expired (and those who wereto get the reward for this great act of devotion have got it). You may now give your pledge to serve the cause of Islam, to strive in the way of Allah and to follow the path of virtue.",
                "hadithUrdu": "میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں ہجرت پر بیعت کرنے کے لیے آیا تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ہجرت کی بیعت کرنے والوں کا وقت گزر گیا ، البتہ اسلام ، جہاد اور خیر پر بیعت ( جائز ) ہے ۔ \"",
                "urduNarrator": "ہم سے محمد بن الصباح ابو جعفر نے بیان کیا, اسماعیل بن زکریا نے عاصم احول سے ، انہوں نے ابوعثمان نہدی سے روایت کی ، کہا : مجھے حضرت مجاشع بن مسعود سلمی رضی اللہ عنہ نے حدیث سنائی ، کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَبُو جَعْفَرٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ زَكَرِيَّا، عَنْ عَاصِمٍ الْأَحْوَلِ، عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ، حَدَّثَنِي مُجَاشِعُ بْنُ مَسْعُودٍ السُّلَمِيُّ، قَالَ: أَتَيْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أُبَايِعُهُ عَلَى الْهِجْرَةِ، فَقَالَ: «إِنَّ الْهِجْرَةَ قَدْ مَضَتْ لِأَهْلِهَا، وَلَكِنْ عَلَى الْإِسْلَامِ وَالْجِهَادِ وَالْخَيْرِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12390,
                "hadithNumber": "4827",
                "englishNarrator": "It has been reported on the authority of Mujashi' bin Mas'ud رضی اللہ عنہ who said:",
                "hadithEnglish": "I brought my brother Abu Ma'bad to the Messenger of Allah (ﷺ) after the conquest of Mecca and said: Messenger of Allah, allow him to swear his pledge of migration at your hand. He said: The period of migration is over with those who had to do it (and now nobody can get this meritorious distinctions) I said: For what actions will you allow him to bind himself in oath? He said: (He can do so) for serving the cause of Islam, for fighting in the way of Allah and for fighting in the cause of virtue. Abd Uthman said: I met Abu Ma'bad رضی اللہ عنہ and told him what I had heard from Mujashi' رضی اللہ عنہ . He said: He has told the truth.",
                "hadithUrdu": "میں اپنے بھائی ابومعبد کے ساتھ فتح ( مکہ ) کے بعد نبی صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا ، میں نے عرض کی : اللہ کے رسول! اس سے ہجرت پر بیعت لے لیجیے ، آپ نے فرمایا : \"\" ہجرت والوں کے ساتھ ہجرت ( کا مرحلہ ) گزر گیا ۔ \"\" میں نے عرض کی : پھر آپ کس بات پر اس سے بیعت لیں گے؟ آپ نے فرمایا : \"\" اسلام ، جہاد اور خیر پر ۔ \"\" ابو عثمان نے کہا : میری حضرت ابو معبد رضی اللہ عنہ سے ملاقات ہوئی تو میں نے ان کو حضرت مجاشع رضی اللہ عنہ کی حدیث سنائی ، انہوں نے کہا : اس نے سچ کہا ہے ۔",
                "urduNarrator": "سوید بن سعید نے مجھ سے کہا, علی بن مسہر نے عاصم سے ، انہوں نے ابوعثمان سے روایت کی ، کہا : مجھے مجاشع بن مسعود سلمی رضی اللہ عنہ نے خبر دی ، کہا",
                "hadithArabic": "وحَدَّثَنِي سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ عَاصِمٍ، عَنْ أَبِي عُثْمَانَ، قَالَ: أَخْبَرَنِي مُجَاشِعُ بْنُ مَسْعُودٍ السُّلَمِيُّ، قَالَ: جِئْتُ بِأَخِي أَبِي مَعْبَدٍ إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَعْدَ الْفَتْحِ، فَقُلْتُ: يَا رَسُولَ اللهِ، بَايِعْهُ عَلَى الْهِجْرَةِ، قَالَ: «قَدْ مَضَتِ الْهِجْرَةُ بِأَهْلِهَا»، قُلْتُ: فَبِأَيِّ شَيْءٍ تُبَايِعُهُ؟ قَالَ: «عَلَى الْإِسْلَامِ وَالْجِهَادِ وَالْخَيْرِ»، قَالَ أَبُو عُثْمَانَ: فَلَقِيتُ أَبَا مَعْبَدٍ، فَأَخْبَرْتُهُ بِقَوْلِ مُجَاشِعٍ، فَقَالَ: صَدَقَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12391,
                "hadithNumber": "4828",
                "englishNarrator": null,
                "hadithEnglish": "Another version of the tradition transmitted on the authority of Asim has the same wording but does not mention the name of Abu Ma'bad رضی اللہ عنہ .",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, محمد بن فضیل نے عاصم سے اسی سند کے ساتھ حدیث بیان کی ، کہا : میں حضرت مجاشع رضی اللہ عنہ کے بھائی سے ملا ، انہوں نے کہا : اس نے سچ کہا ، ابومعبد رضی اللہ عنہ کا ذکر نہیں کیا ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ عَاصِمٍ بِهَذَا الْإِسْنَادِ، قَالَ: فَلَقِيتُ أَخَاهُ، فَقَالَ: صَدَقَ مُجَاشِعٌ، وَلَمْ يَذْكُرْ أَبَا مَعْبَدٍ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12392,
                "hadithNumber": "4829",
                "englishNarrator": "It has been narrated on the authority of Ibn 'Abbas رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said on the day of the Conquest of Mecca: There is no Hijra now, but (only) Jihad (fighting for the cause of Islam) and sincerity of purpose (have great reward); when you are asked to set out (on an expedition undertaken for the cause of Islam) you should (readily) do so.",
                "hadithUrdu": "فتح کے دن جب مکہ فتح ہوا تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اب ہجرت نہیں ہے ، لیکن جہاد اور نیت ہے اور جب تم جہاد کے لیے بلایا جائے تو نکلو ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ اور اسحاق بن ابراہیم نے بیان کیا، انہوں نے کہا: جریر نے منصور سے ، انہوں نے مجاہد سے ، انہوں نے طاوس سے ، انہوں نے حضرت ابن عباس رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ قَالَا: أَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ مُجَاهِدٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْفَتْحِ - فَتْحِ مَكَّةَ - «لَا هِجْرَةَ، وَلَكِنْ جِهَادٌ وَنِيَّةٌ، وَإِذَا اسْتُنْفِرْتُمْ فَانْفِرُوا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12393,
                "hadithNumber": "4830",
                "englishNarrator": null,
                "hadithEnglish": "A similar report (as no. 4829) was narrated from Mansur with this chain of narration.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، کہا کہ ہم سے وکیع نے بیان کیا, سفیان ، مفضل بن مُہلہل اور اسرائیل ، سب نے منصور سے اسی سند کے ساتھ اسی کے مانند روایت کی.",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، قَالَا: حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، ح وحَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، وَابْنُ رَافِعٍ، عَنْ يَحْيَى بْنِ آدَمَ، حَدَّثَنَا مُفَضَّلٌ يَعْنِي ابْنَ مُهَلْهِلٍ، ح وحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عُبَيْدُ اللهِ بْنُ مُوسَى، عَنْ إِسْرَائِيلَ، كُلُّهُمْ عَنْ مَنْصُورٍ، بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12394,
                "hadithNumber": "4831",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was asked about migration, whereupon he said: There is no migration after the Conquest (of Mecca), but Jihad and sincere intention. When you are asked to set out (for the cause of Islam), you should set out,",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم سے ہجرت کے متعلق سوال کیا گیا ، آپ نے فرمایا : \" فتح ( مکہ ) کے بعد ہجرت نہیں ہے ، لیکن جہاد اور نیت ہے اور جب تم کو جہاد کے لیے بلایا جائے تو نکلو ۔ \"",
                "urduNarrator": "ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا، کہا ہم سے میرے والد نے بیان کیا، کہا ہم سے عبداللہ بن حبیب بن ابی ثابت نے بیان کیا، وہ عبداللہ بن عبدالرحمٰن کی سند سے۔ ابن ابی حسین، عطاء کی روایت سے، حضرت عائشہ رضی اللہ عنہا نے کہا کہ",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عَبْدُ اللهِ بْنُ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ عَبْدِ اللهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي حُسَيْنٍ، عَنْ عَطَاءٍ، عَنْ عَائِشَةَ، قَالَتْ: سُئِلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ الْهِجْرَةِ، فَقَالَ: «لَا هِجْرَةَ بَعْدَ الْفَتْحِ، وَلَكِنْ جِهَادٌ وَنِيَّةٌ، وَإِذَا اسْتُنْفِرْتُمْ فَانْفِرُوا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12395,
                "hadithNumber": "4832",
                "englishNarrator": "It has been narrated on the authority of Abu Sa'id al-Khudari رضی اللہ عنہ :",
                "hadithEnglish": "A Bedouin asked the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) about Migration. He replied: Do you talk of Hijra? The affair of Hijra is very difficult. But have you got camels? The bedouin said: Yes. He asked: Do you pay the poor-rate payable on their account? He replied: Yes. He (the Holy Prophet) said: Go on doing good deeds (across the seas), for surely God will not leave any of your deeds unrewarded.",
                "hadithUrdu": "ایک اعرابی نے رسول اللہ صلی اللہ علیہ وسلم سے ہجرت کے متعلق سوال کیا ۔ آپ نے فرمایا : \" تم پر افسوس! ہجرت کا معاملہ تو بہت مشکل ہے ، کیا تمہارے پاس کچھ اونٹ ہیں؟ \" اس نے کہا : ہاں ، آپ نے فرمایا : \" کیا تم ان کی زکاۃ ادا کرتے ہو؟ اس نے کہا : ہاں ، آپ نے فرمایا : \" پانیوں ( چشموں ، دریاؤں ، سمندروں وغیرہ ) کے پار ( رہتے ہوئے ) عمل کرتے رہو تو بلاشبہ اللہ تعالیٰ تمہارے کسی عمل کو ہرگز رائیگاں نہیں کرے گا ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن خلاد الباہلی نے بیان کیا, ولید بن مسلم نے کہا : ہمیں عبدلرحمٰن بن عمرو اوزاعی نے حدیث بیان کی ، کہا : مجھے ابن شہاب زہری نے حدیث سنائی ، کہا : مجھے عطاء بن یزید لیثی نے حدیث بیان کی کہ انہوں نے ان سب کو حدیث سنائی ، کہا : ابوسعید خدری رضی اللہ عنہ نے مجھے حدیث بیان کی کہ",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ خَلَّادٍ الْبَاهِلِيُّ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَمْرٍو الْأَوْزَاعِيُّ، حَدَّثَنِي ابْنُ شِهَابٍ الزُّهْرِيِّ، حَدَّثَنِي عَطَاءُ بْنُ يَزِيدَ اللَّيْثِيُّ، أَنَّهُ حَدَّثَهُمْ قَالَ: حَدَّثَنِي أَبُو سَعِيدٍ الْخُدْرِيُّ، أَنَّ أَعْرَابِيًّا سَأَلَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ الْهِجْرَةِ، فَقَالَ: «وَيْحَكَ، إِنَّ شَأْنَ الْهِجْرَةِ لَشَدِيدٌ، فَهَلْ لَكَ مِنْ إِبِلٍ؟» قَالَ: نَعَمْ، قَالَ: «فَهَلْ تُؤْتِي صَدَقَتَهَا؟» قَالَ: نَعَمْ، قَالَ: «فَاعْمَلْ مِنْ وَرَاءِ الْبِحَارِ، فَإِنَّ اللهَ لَنْ يَتِرَكَ مِنْ عَمَلِكَ شَيْئًا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12396,
                "hadithNumber": "4833",
                "englishNarrator": "A similar report (as no. 4832) narrated from Al-Awaz'i with this chain of narration, except that he said:",
                "hadithEnglish": "\"Surely, Allah will never leave any of good your deeds unrewarded.\" And he added in the Hadith: \"Do you milk them on the day that they come to the water?  He replied: Yes.",
                "hadithUrdu": "\" بلاشبہ اللہ تعالیٰ تمہارے عمل میں سے کسی چیز کو ضائع نہیں کرے گا \" اور یہ اضافہ کیا ، آپ نے فرمایا : \" جس دن اونٹنیاں پانی پینے کے لیے ( گھاٹ یا چشمے پر ) آتی ہیں تو کیا تم ( ضرورت مندوں ، مسکینوں ، مسافروں کو پلانے کے لیے ) ان کا دودھ دوہتے ہو؟ \" اس نے کہا : ہاں ۔",
                "urduNarrator": "ہم سے عبداللہ بن عبدالرحمٰن الدارمی نے بیان کیا, محمد بن یوسف نے اوزاعی سے اسی سند کے ساتھ اسی کے مانند روایت کی مگر انہوں نے کہا",
                "hadithArabic": "وَحَدَّثَنَاهُ عَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، عَنِ الْأَوْزَاعِيِّ بِهَذَا الْإِسْنَادِ مِثْلَهُ، غَيْرَ أَنَّهُ قَالَ: «إِنَّ اللهَ لَنْ يَتِرَكَ مِنْ عَمَلِكَ شَيْئًا»، وَزَادَ فِي الْحَدِيثِ قَالَ: «فَهَلْ تَحْلُبُهَا يَوْمَ وِرْدِهَا؟» قَالَ: نَعَمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12397,
                "hadithNumber": "4834",
                "englishNarrator": "It has been narrated on the authority of 'A'isha رضی اللہ عنہا , the wife of the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). She said:",
                "hadithEnglish": "When the believing women migrated (to Medina) and came to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), they would be tested in accordance with the following words of Allah. the Almighty and Exalted: O Prophet, when believing women come to thee to take the oath of fealty to thee that they will not associate in worship anything with God, that they will not steal. that, they will not commit adultery... to the end of the verse (lx. 62). Whoso from the believing women accepted these conditions and agreed to abide by them were considered to have offered themselves for swearing fealty. When they had (formally) declared their resolve to do so, the Messenger of Allah (may peace he upon him) would say to them: You may go. I have confirmed your fealty. By God, the hand of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) never touched the hand of a woman. He would take the oath of fealty from them by oral declaration. By God, the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) never took any vow from women except that which God had ordered him to take, and his palm never touched the palm of a woman. When he had taken their vow, he would tell them that he had taken the oath from them orally.",
                "hadithUrdu": "مسلمان عورتیں جب رسول اللہ صلی اللہ علیہ وسلم کے پاس آتیں تو اللہ کے اس فرمان کے مطابق ان کا امتحان لیا جاتا : \"\" اے نبی! جب آپ کے پاس مسلمان عورتیں آئیں ، آپ سے اس پر بیعت کریں کہ وہ کسی کو اللہ کا شریک نہیں بنائیں گی ، نہ چوری کریں گی اور نہ زنا کریں گی \"\" آیت کے آخر تک ۔ حضرت عائشہ رضی اللہ عنہ نے کہا : مومن عورتوں میں سے جو عورت ان باتوں کا اقرار کر لیتی ، وہ امتحان کے ذریعے سے اقرار کرتی ( مثلا : ان سے سوال کیا جاتا : کیا تم شرک نہیں کرو گی؟ تو اگر وہ کہتیں : نہیں کریں گی ، تو یہی ان کا اقرار ہوتا ، آیت کے آخری حصے تک اسی طرح امتحان اور اقرار ہوتا ۔ ) اور جب وہ ان باتوں کا اقرار کر لیتیں تو رسول اللہ صلی اللہ علیہ وسلم ان سے فرماتے : \"\" جاؤ ، میں تم سے بیعت لے چکا ہوں ۔ \"\" اللہ کی قسم! رسول اللہ صلی اللہ علیہ وسلم کا ہاتھ کبھی کسی عورت کے ہاتھ کو نہیں لگا بلکہ نبی صلی اللہ علیہ وسلم ان کے ساتھ بات کر کے بیعت کرتے تھے ۔ حضرت عائشہ رضی اللہ عنہا نے کہا : اللہ کی قسم! رسول اللہ صلی اللہ علیہ وسلم نے ان سے ان باتوں کے علاوہ کسی چیز کا عہد نہیں لیا جن کا اللہ تعالیٰ نے آپ کو حکم دیا تھا اور رسول اللہ صلی اللہ علیہ وسلم کی ہتھیلی کبھی کسی عورت کی ہتھیلی سے مَس نہیں ہوئی ، آپ جب ان سے بیعت لیتے تو زبانی فرما دیتے : \"\" میں نے تم سے بیعت لے لی ۔ \"\"",
                "urduNarrator": "مجھ سے ابو الطاہر احمد بن عمرو بن سرح نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا, یونس بن یزید نے کہا : ابن شہاب نے کہا : مجھے عروہ بن زبیر نے بتایا کہ نبی صلی اللہ علیہ وسلم کی اہلیہ محترمہ حضرت عائشہ رضی اللہ عنہا نے کہا",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ بْنُ يَزِيدَ، قَالَ: قَالَ ابْنُ شِهَابٍ: أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَتْ: كَانَتِ الْمُؤْمِنَاتُ إِذَا هَاجَرْنَ إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُمْتَحَنَّ بِقَوْلِ اللهِ عَزَّ وَجَلَّ: {يَا أَيُّهَا النَّبِيُّ إِذَا جَاءَكَ الْمُؤْمِنَاتُ يُبَايِعْنَكَ عَلَى أَنْ لَا يُشْرِكْنَ بِاللهِ شَيْئًا وَلَا يَسْرِقْنَ وَلَا يَزْنِينَ} [الممتحنة: 12] إِلَى آخِرِ الْآيَةِ، قَالَتْ عَائِشَةُ: فَمَنْ أَقَرَّ بِهَذَا مِنَ الْمُؤْمِنَاتِ، فَقَدْ أَقَرَّ بِالْمِحْنَةِ، وَكَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِذَا أَقْرَرْنَ بِذَلِكَ مِنْ قَوْلِهِنَّ، قَالَ لَهُنَّ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «انْطَلِقْنَ، فَقَدْ بَايَعْتُكُنَّ» وَلَا وَاللهِ مَا مَسَّتْ يَدُ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَدَ امْرَأَةٍ قَطُّ، غَيْرَ أَنَّهُ يُبَايِعُهُنَّ بِالْكَلَامِ قَالَتْ عَائِشَةُ: وَاللهِ، مَا أَخَذَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى النِّسَاءِ قَطُّ إِلَّا بِمَا أَمَرَهُ اللهُ تَعَالَى، وَمَا مَسَّتْ كَفُّ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَفَّ امْرَأَةٍ قَطُّ، وَكَانَ يَقُولُ لَهُنَّ إِذَا أَخَذَ عَلَيْهِنَّ: «قَدْ بَايَعْتُكُنَّ» كَلَامًا.",
                "headingArabic": "كَيْفِيَّةِ بَيْعَةِ النِّسَاءِ",
                "headingUrdu": "خواتین نے اپنی وفاداری کا حلف کیسے دیا؟",
                "headingEnglish": "How women gave their oath of allegiance",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12398,
                "hadithNumber": "4835",
                "englishNarrator": "It has been narrated on the authority of 'Urwa:",
                "hadithEnglish": "'A'isha رضی اللہ عنہا described to him the way the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) took the oath of fealty from women. She said: The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) never touched a woman with his hand. He would only take a vow from her and when he had taken the (verbal) vow, he would say: You may go. I have accepted your fealty.",
                "hadithUrdu": "حضرت عائشہ رضی اللہ عنہا نے انہیں عورتوں کی بیعت کے متعلق بتایا ، کہا : نبی صلی اللہ علیہ وسلم نے کبھی کسی عورت کو اپنے ہاتھ سے نہیں چھوا ، البتہ آپ ان سے ( زبانی ) عہد لیتے تھے اور جب وہ عہد کر لیتیں تو آپ فرماتے : \" جاؤ ، میں نے تم سے بیعت لے لی ۔ \"",
                "urduNarrator": "مجھ سے ہارون بن سعید الایلی اور ابو الطاہر نے بیان کیا، انہوں نے کہا: انہوں نے ہمیں خبر دی، اور ہارون نے کہا: ہم سے ابن وہب نے بیان کیا, امام مالک نے ابن شہاب سے ، انہوں نے عروہ بن زبیر سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ، وَأَبُو الطَّاهِرِ، قَالَ أَبُو الطَّاهِرِ: أَخْبَرَنَا، وقَالَ هَارُونُ: حَدَّثَنَا ابْنُ وَهْبٍ، حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، أَنَّ عَائِشَةَ، أَخْبَرَتْهُ، عَنْ بَيْعَةِ النِّسَاءِ، قَالَتْ: مَا مَسَّ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِيَدِهِ امْرَأَةً قَطُّ، إِلَّا أَنْ يَأْخُذَ عَلَيْهَا، فَإِذَا أَخَذَ عَلَيْهَا، فَأَعْطَتْهُ، قَالَ: «اذْهَبِي، فَقَدْ بَايَعْتُكِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12399,
                "hadithNumber": "4836",
                "englishNarrator": "It has been narrated on the authority of Abdullah bin 'Umar رضی اللہ عنہ who said:",
                "hadithEnglish": "We used to take oath to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) that we would listen to and obey his orders. He would tell us (to say in the oath): As far as it lies in my power.",
                "hadithUrdu": "ہم سننے اور اطاعت کرنے پر رسول اللہ صلی اللہ علیہ وسلم سے بیعت کرتے تھے اور آپ ہم سے فرماتے تھے : \" ( کہو : ) جس کی مجھے استطاعت ہو گی ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن ایوب، قتیبہ اور ابن حجر نے بیان کیا، اور یہ قول ابن ایوب کا ہے، انہوں نے کہا: ہم سے اسماعیل، جو ابن جعفر ہیں، نے بیان کیا, عبداللہ بن دینار نے بتایا کہ انہوں نے حضرت عبداللہ بن عمر رضی اللہ عنہ سے سنا ، کہہ رہے تھے",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ حُجْرٍ، وَاللَّفْظُ لِابْنِ أَيُّوبَ، قَالُوا: حَدَّثَنَا إِسْمَاعِيلُ وَهُوَ ابْنُ جَعْفَرٍ، أَخْبَرَنِي عَبْدُ اللهِ بْنُ دِينَارٍ، أَنَّهُ سَمِعَ عَبْدَ اللهِ بْنَ عُمَرَ، يَقُولُ: كُنَّا نُبَايِعُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى السَّمْعِ وَالطَّاعَةِ، يَقُولُ لَنَا: «فِيمَا اسْتَطَعْتَ».",
                "headingArabic": "الْبَيْعَةِ عَلَى السَّمْعِ وَالطَّاعَةِ فِيمَا اسْتَطَاعَ ‏‏",
                "headingUrdu": "جس قدر ممکن ہو سننے اور ماننے کا عہد کرنا",
                "headingEnglish": "Oath of allegiance pledging to hear and obey as much as possible",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12400,
                "hadithNumber": "4837",
                "englishNarrator": "It has been narrated on the authority of Ibn 'Umar رضی اللہ عنہ who said:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) inspected me on the battlefield on the Day of Uhud, and I was fourteen years old. He did not allow me (to take part in the fight). He inspected me on the Day of Khandaq-and I was fifteen yearsold, and he permitted me (to fight), Nafi' said: I came to 'Umar bin 'Abd al-'Aziz who was then Caliph, and narrated this tradition to him. He said: Surely, this is the demarcation between a minor and a major. So he wrote to his governors that they should pay subsistence allowance to one who was fifteen years old, but should treat those of lesser age among children.",
                "hadithUrdu": "اُحد کے دن رسول اللہ صلی اللہ علیہ وسلم نے جنگ ( کے معاملے ) میں میرا معاینہ فرمایا ، اس وقت میری عمر چودہ سال تھی ، آپ نے مجھے ( جنگ میں شمولیت کی ) اجازت نہیں دی اور غزوہ خندق کے دن میرا معاینہ فرمایا جبکہ میں پندرہ برس کا تھا تو آپ نے مجھے اجازت دے دی ۔ نافع نے کہا : جس زمانے میں عمر بن عبدالعزیز خلیفہ تھے میں نے ان کے پاس جا کر یہ حدیث بیان کی تو انہوں نے کہا : یہ صغیر ( نابالغ ) اور کبیر ( بالغ ) کے درمیان حد ( فاصل ) ہے ، پھر انہوں نے اپنے عاملوں کو لکھ بھیجا کہ جو شخص پندرہ سال کا ہو اس کا ( پورا ) حصہ مقرر کریں اور جو اس سے کم کا ہو اس کو بچوں میں شمار کریں ۔ ( اس کے مطابق وظیفہ دیں ۔ )",
                "urduNarrator": "عبداللہ بن نمیر نے کہا : ہمیں عبیداللہ نے نافع سے حدیث بیان کی ، انہوں نے حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ: عَرَضَنِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَوْمَ أُحُدٍ فِي الْقِتَالِ، وَأَنَا ابْنُ أَرْبَعَ عَشْرَةَ سَنَةً، فَلَمْ يُجِزْنِي، وَعَرَضَنِي يَوْمَ الْخَنْدَقِ، وَأَنَا ابْنُ خَمْسَ عَشْرَةَ سَنَةً، فَأَجَازَنِي، قَالَ نَافِعٌ: فَقَدِمْتُ عَلَى عُمَرَ بْنِ عَبْدِ الْعَزِيزِ وَهُوَ يَوْمَئِذٍ خَلِيفَةٌ، فَحَدَّثْتُهُ هَذَا الْحَدِيثَ، فَقَالَ: «إِنَّ هَذَا لَحَدٌّ بَيْنَ الصَّغِيرِ وَالْكَبِيرِ، فَكَتَبَ إِلَى عُمَّالِهِ أَنْ يَفْرِضُوا لِمَنْ كَانَ ابْنَ خَمْسَ عَشْرَةَ سَنَةً، وَمَنْ كَانَ دُونَ ذَلِكَ فَاجْعَلُوهُ فِي الْعِيَالِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12401,
                "hadithNumber": "4838",
                "englishNarrator": "It was narrated from Ubaidullah with this chain of narration (a hadith similar to no. 4837), except that in their hadith it say:",
                "hadithEnglish": "I was fourteen years old and he thought me too young (to participate in the fight).",
                "hadithUrdu": "\" اور جب میں چودہ سال کا تھا تو رسول اللہ صلی اللہ علیہ وسلم نے مجھے کم سن قرار دیا ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, عبداللہ بن ادریس ، عبدالرحیم بن سلیمان اور عبدالوہاب ثقفی سن نے عبیداللہ سے اسی سند کے ساتھ حدیث بیان کی ، مگر ان کی حدیث میں ہے",
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللهِ بْنُ إِدْرِيسَ، وَعَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ يَعْنِي الثَّقَفِيَّ، جَمِيعًا عَنْ عُبَيْدِ اللهِ، بِهَذَا الْإِسْنَادِ، غَيْرَ أَنَّ فِي حَدِيثِهِمْ، وَأَنَا ابْنُ أَرْبَعَ عَشْرَةَ سَنَةً، فَاسْتَصْغَرَنِي.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12402,
                "hadithNumber": "4839",
                "englishNarrator": "It has been narrated on the authority of Ibn 'Umar رضی اللہ عنہ who said:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade that one should travel to the land of the enemy taking the Qur'an with him.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے دشمن کے ملک میں قرآن مجید کو ساتھ لے کر سفر کرنے سے منع فرمایا ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: امام مالک نے نافع سے ، انہوں نے حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللهِ بْنِ عُمَرَ، قَالَ: «نَهَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ يُسَافَرَ بِالْقُرْآنِ إِلَى أَرْضِ الْعَدُوِّ».",
                "headingArabic": "النَّهْىِ أَنْ يُسَافَرَ بِالْمُصْحَفِ إِلَى أَرْضِ الْكُفَّارِ إِذَا خِيفَ وُقُوعُهُ بِأَيْدِيهِمْ",
                "headingUrdu": "اگر ان کے ہاتھ لگنے کا اندیشہ ہو تو مصحف کے ساتھ کفار کی سرزمین پر جانے کی ممانعت۔",
                "headingEnglish": "The prohibition of travelling with the Mushaf to the land of the disbelievers if there is the fear that it may fall into their hands.",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12403,
                "hadithNumber": "4840",
                "englishNarrator": "It has been narrated on the authority of Abdullah bin Umar رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) used to forbid that one should travel to the land of the enemy taking the Qur'an (with him) lest it should fall into the hands of the enemy.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم اس خوف کی بنا پر کہ دشمن کے ہاتھ لگ جائے گا ، دشمن کی سرزمین میں قرآن مجید کو ساتھ لے کر سفر کرنے سے منع فرماتے تھے ۔",
                "urduNarrator": "قتیبہ نے ہمیں بتایا، لیث نے نافع سے ، انہوں نے حضرت عبداللہ بن عمر رضی اللہ عنہ سے ، انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا لَيْثٌ، ح وحَدَّثَنَا ابْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللهِ بْنِ عُمَرَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، «أَنَّهُ كَانَ يَنْهَى أَنْ يُسَافَرَ بِالْقُرْآنِ إِلَى أَرْضِ الْعَدُوِّ، مَخَافَةَ أَنْ يَنَالَهُ الْعَدُوُّ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12404,
                "hadithNumber": "4841",
                "englishNarrator": "It has been narrated on the authority of Ibn 'Umar رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Do not take the Qur'an on a journey with you, for I am afraid lost it should fall into the hands of the enemy. Ayyub (one of the narrators in the chain of transmitters) said: The enemy may seize it and may quarrel with you over it.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" قرآن کے ساتھ سفر نہ کرو ، کیونکہ مجھے اس بات پر اطمینان نہیں کہ وہ دشمن کے ہاتھ لگ جائے گا ۔ \"\" ایوب نے کہا : قرآن مجید دشمن کے ہاتھ لگ گیا تو وہ قرآن مجید کے ذریعے سے ( اسے آڑ بنا کر ) تمہارے ساتھ مقابلہ کرے گا ۔",
                "urduNarrator": "ہم سے ابو الربیع العتکی اور ابو کامل نے بیان کیا، کہا:حماد نے ایوب سے ، انہوں نے نافع سے ، انہوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وحَدَّثَنَا أَبُو الرَّبِيعِ الْعَتَكِيُّ، وَأَبُو كَامِلٍ، قَالَا: حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تُسَافِرُوا بِالْقُرْآنِ، فَإِنِّي لَا آمَنُ أَنْ يَنَالَهُ الْعَدُو»، قَالَ أَيُّوبُ: «فَقَدْ نَالَهُ الْعَدُوُّ وَخَاصَمُوكُمْ بِهِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12405,
                "hadithNumber": "4842",
                "englishNarrator": "It was narrated from Ibn 'Umar from the prophet ﷺ (a similar hadith as no. 4841). In the Hadith of Ibn 'Ulayyah and Ath-Thaqafi it says: \"I am affarid.\" In the Hadith of Sufyan and Adh-Dhah-hak bin 'Uthman it says:",
                "hadithEnglish": "Let the enemy get hold of it.\"",
                "hadithUrdu": "مجھ سے زہیر بن حرب نے کہا, اسماعیل بن علیہ ، سفیان اور ثقفی سب نے ایوب سے حدیث بیان کی ، ایوب اور ضحاک بن عثمان نے نافع سے ، انہوں نے ابن عمر رضی اللہ عنہ سے ، انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ۔ ابن علیہ اور ثقفی کی حدیث میں ہے : \"\" مجھے خوف ہے \"\" اور سفیان اور ضحاک بن عثمان کی حدیث میں ہے : \"\" اس خوف سے کہ دشمن کے ہاتھ لگ جائے ۔ \"\"",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ يَعْنِي ابْنَ عُلَيَّةَ، ح وحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، وَالثَّقَفِيُّ، كُلُّهُمْ عَنْ أَيُّوبَ، ح وحَدَّثَنَا ابْنُ رَافِعٍ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، أَخْبَرَنَا الضَّحَّاكُ يَعْنِي ابْنَ عُثْمَانَ، جَمِيعًا عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي حَدِيثِ ابْنِ عُلَيَّةَ، وَالثَّقَفِيِّ: «فَإِنِّي أَخَافُ»، وَفِي حَدِيثِ سُفْيَانَ، وَحَدِيثِ الضَّحَّاكِ بْنِ عُثْمَانَ: «مَخَافَةَ أَنْ يَنَالَهُ الْعَدُوُّ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12406,
                "hadithNumber": "4843",
                "englishNarrator": "It has been narrated on the authority of Ibn 'Umar رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had a race of the horses which had been especially prepared for the purpose from Hafya' to Thaniyyat al-Wada' (the latter being the winning post), and of those which had not been trained from Thaniyya to the mosque of Banu Zuraiq, and Ibn Umar was among those who took part in this race.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ایسے گھوڑوں کی حفیاء کے مقام سے مسابقت ( دوڑ ) کروائی جنہیں ( عربی طریقے سے ) فالتو چربی زائل کر کے سبک اندام بنایا گیا تھا ۔ ان کی دوڑ ثنیۃ الوداع تک تھی اور جن کو سبک اندام نہ بنایا گیا تھا ان کی دوڑ ثنیہ سے مسجد بنی زُریق تک کرائی ۔ ابن عمر رضی اللہ عنہ ان میں شامل تھے جنہوں نے گھوڑے دوڑائے ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ التمیمی نے بیان کیا، انہوں نے کہا: امام مالک نے نافع سے ، انہوں نے حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ سَابَقَ بِالْخَيْلِ الَّتِي قَدْ أُضْمِرَتْ مِنَ الْحَفْيَاءِ، وَكَانَ أَمَدُهَا ثَنِيَّةَ الْوَدَاعِ، وَسَابَقَ بَيْنَ الْخَيْلِ الَّتِي لَمْ تُضْمَرْ، مِنَ الثَّنِيَّةِ إِلَى مَسْجِدِ بَنِي زُرَيْقٍ»، «وَكَانَ ابْنُ عُمَرَ فِيمَنْ سَابَقَ بِهَا».",
                "headingArabic": "الْمُسَابَقَةِ بَيْنَ الْخَيْلِ وَتَضْمِيرِهَا ‏‏",
                "headingUrdu": "دوڑ کے لیے گھوڑوں کی دوڑیں اور تربیتی گھوڑے",
                "headingEnglish": "Horse Races and Training Horses for Racing",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12407,
                "hadithNumber": "4844",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like that of Malik from Nafi' (no. 4843) was narrated from Ibn Umar رضی اللہ عنہ , and in the hadith of Ayyub from Hammad and Ibn Ulayyah it adds: \"Abdullah رضی اللہ عنہ said: 'I came first in the race, and the horse Jumped into the Masid me.",
                "hadithUrdu": "یحییٰ بن یحییٰ ، محمد بن رمح اور قتیبہ بن سعید نے لیث بن سعد سے حدیث بیان کی ۔ خلف بن ہشام ، ابو ربیع اور ابو کامل نے کہا : ہمیں حماد بن زید نے ایوب سے حدیث بیان کی ۔ زہیر نے کہا : ہمیں اسماعیل نے ایوب سے حدیث بیان کی ۔ عبداللہ بن نمیر ، ابو اسامہ اور یحییٰ قطان سب نے عبیداللہ سے روایت کی ۔ علی بن حجر ، احمد بن عبدہ اور ابن ابی عمر نے مجھے حدیث سنائی ، سب نے کہا : ہمیں سفیان نے اسماعیل بن امیہ سے حدیث سنائی ۔ ابن جریج نے کہا : مجھے موسیٰ بن عقبہ نے خبر دی ۔ ابن وہب نے کہا : مجھے اسامہ بن زید نے خبر دی ۔ ان سب ( لیث بن سعد ، ایوب ، عبیداللہ ، اسماعیل بن امیہ ، موسیٰ بن عقبہ اور اسامہ بن زید ) نے نافع سے ، انہوں نے ابن عمر رضی اللہ عنہ سے مالک کی نافع سے روایت کردہ حدیث کے ہم معنی روایت کی ، حماد اور ابن علیہ کی ایوب سے روایت میں یہ اضافہ کیا : حضرت عبداللہ ( بن عمر رضی اللہ عنہ ) نے کہا : میں اول آیا اور گھوڑا مجھ سمیت مسجد ( بنو زُریق ) سے آگے نکل گیا ۔ ( جہاں پہنچنا تھا ، تیز رفتاری کی بنا پر اس جگہ سے آگے نکل گیا ۔ )",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَمُحَمَّدُ بْنُ رُمْحٍ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، عَنِ اللَّيْثِ بْنِ سَعْدٍ، ح وحَدَّثَنَا خَلَفُ بْنُ هِشَامٍ، وَأَبُو الرَّبِيعِ، وَأَبُو كَامِلٍ، قَالُوا: حَدَّثَنَا حَمَّادٌ وَهُوَ ابْنُ زَيْدٍ، عَنْ أَيُّوبَ، ح وحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، ح وحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، ح وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَعُبَيْدُ اللهِ بْنُ سَعِيدٍ، قَالَا: حَدَّثَنَا يَحْيَى وَهُوَ الْقَطَّانُ، جَمِيعًا عَنْ عُبَيْدِ اللهِ، ح وحَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ، وَأَحْمَدُ بْنُ عَبْدَةَ، وَابْنُ أَبِي عُمَرَ، قَالُوا: حَدَّثَنَا سُفْيَانُ، عَنْ إِسْمَاعِيلَ بْنِ أُمَيَّةَ، ح وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي مُوسَى بْنُ عُقْبَةَ، ح وحَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي أُسَامَةُ يَعْنِي ابْنَ زَيْدٍ، كُلُّ هَؤُلَاءِ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ بِمَعْنَى حَدِيثِ مَالِكٍ، عَنْ نَافِعٍ، وَزَادَ فِي حَدِيثِ أَيُّوبَ، مِنْ رِوَايَةِ حَمَّادٍ، وَابْنِ عُلَيَّةَ: قَالَ عَبْدُ اللهِ: فَجِئْتُ سَابِقًا فَطَفَّفَ بِي الْفَرَسُ الْمَسْجِدَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12408,
                "hadithNumber": "4845",
                "englishNarrator": "It has been narrated on the authority of Ibn Umar رضی اﷲ عنہما :",
                "hadithEnglish": "The Messenger of Allah (ﷺ) said: There will be great benefit in the forelock of the horses until the Day of judgment.",
                "hadithUrdu": "رسول اﷲ صلی ‌اللہ ‌علیہ ‌وسلم نے فرمایا گھوڑوں کی پیشانی میں برکت ہے اور خوبی قیامت تک۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا کہ میں نے نافع کی سند سے مالک رضی اللہ عنہ سے اور حضرت عبدﷲ بن عمر رضی اﷲ عنہما سے روایت ہے",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ ‏ الْخَيْلُ فِي نَوَاصِيهَا الْخَيْرُ إِلَى يَوْمِ الْقِيَامَةِ ‏.‏",
                "headingArabic": "الْخَيْلُ فِي نَوَاصِيهَا الْخَيْرُ إِلَى يَوْمِ الْقِيَامَةِ",
                "headingUrdu": "گھوڑوں کی فضیلت؛ \"نیکی ان کی پیشانی سے جڑی ہوئی ہے۔\"",
                "headingEnglish": "The virtue of horses; \"Goodness is tied to their Forelocks.\"",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12409,
                "hadithNumber": "4846",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like that of Malik from Nafi (no. 4845) was narrated from Ibn Umar رضی اللہ عنہما from the prophet ﷺ.",
                "hadithUrdu": "ہم سے قتیبہ اور ابن روم نے لیث بن سعد کی سند سے بیان کیا، ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے علی بن مشر اور عبد نے بیان کیا۔ ہم سے اللہ ابن نمیر نے بیان کیا، ہم سے ابی ایچ نے بیان کیا، ہم سے عبید نے بیان کیا، ہم سے اللہ ابن سعید نے بیان کیا، ہم سے یحییٰ نے بیان کیا، یہ سب عبید اللہ سے روایت کرتے ہیں۔ اور اس نے ہم سے بات کی۔ہم سے ہارون بن سعید عیلی، ابن وہب نے بیان کیا، مجھ سے اسامہ نے بیان کیا، ان سب نے نافع کی سند سے، ابن عمر رضی اللہ عنہما سے کہ رسول اللہ صلی اللہ علیہ وسلم نے ان کے ساتھ اسی طرح کی حدیث مالک نافع کی سند پر.",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا قُتَيْبَةُ، وَابْنُ، رُمْحٍ عَنِ اللَّيْثِ بْنِ سَعْدٍ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، وَعَبْدُ اللَّهِ بْنُ نُمَيْرٍ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا عُبَيْدُ، اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا يَحْيَى، كُلُّهُمْ عَنْ عُبَيْدِ اللَّهِ، ح وَحَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، حَدَّثَنِي أُسَامَةُ، كُلُّهُمْ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ بِمِثْلِ حَدِيثِ مَالِكٍ عَنْ نَافِعٍ ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12410,
                "hadithNumber": "4847",
                "englishNarrator": "It has been narrated on the authority of Jarir bin Abdullah رضی ‌اللہ ‌عنہ who said:",
                "hadithEnglish": "I saw that the Messenger of Allah (ﷺ) was twisting the forelock of a horse with his fingers and he was saying: (A great) benefit. i.e. reward (for rearing them for Jihad) and spoils of war, has been tied to the forelocks of horses until the Day of Judgment.",
                "hadithUrdu": "میں نے رسول ﷲؐ کو دیکھا آپ ایک گھوڑے کی پیشانی کے بال انگلی سے مل رہے تھے اور فرماتے تھے گھوڑوں کی پیشانیوں سے برکت بندھی ہوئی ہے قیامت تک یعنی ثواب او رغنیمت۔",
                "urduNarrator": "ہم سے نصر بن علی الجمی اور صالح بن حاتم بن وردان سب نے یزید کی سند سے بیان کیا - الجہدمی نے کہا : ہم سے یزید بن زرعی نے بیان کیا - ہم سے یونس بن عبید نے عمرو بن سعید کی سند سے بیان کیا, جریر بن عبدﷲ رضی ‌اللہ ‌عنہ سے روایت ہے",
                "hadithArabic": "وَحَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، وَصَالِحُ بْنُ حَاتِمِ بْنِ وَرْدَانَ، جَمِيعًا عَنْ يَزِيدَ، - قَالَ الْجَهْضَمِيُّ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، - حَدَّثَنَا يُونُسُ بْنُ عُبَيْدٍ، عَنْ عَمْرِو بْنِ سَعِيدٍ، عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ، عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَلْوِي نَاصِيَةَ فَرَسٍ بِإِصْبَعِهِ وَهُوَ يَقُولُ ‏ ‏ الْخَيْلُ مَعْقُودٌ بِنَوَاصِيهَا الْخَيْرُ إِلَى يَوْمِ الْقِيَامَةِ الأَجْرُ وَالْغَنِيمَةُ ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12411,
                "hadithNumber": "4848",
                "englishNarrator": null,
                "hadithEnglish": "The above tradition has also been narrated on the authority of Yunus through a different chain of transmitters.",
                "hadithUrdu": "ہم سے زہیر بن حرب نے بیان کیا، کہا ہم سے اسماعیل بن ابراہیم نے بیان کیا، کہا ہم سے ابوبکر بن، ابو شیبہ نے بیان کیا، کہا کہ ہم سے وکیع نے بیان کیا، وہ سفیان سے۔ یہ دونوں یونس علیہ السلام کے اختیار میں ہیں، اس سلسلہ کی نشریات اس سے ملتی جلتی ہیں۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ، أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، كِلاَهُمَا عَنْ يُونُسَ، بِهَذَا الإِسْنَادِ مِثْلَهُ.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12412,
                "hadithNumber": "4849",
                "englishNarrator": "The same tradition has been narrated on the authority of Urwat al-Bariqi who said:",
                "hadithEnglish": "The Prophet (ﷺ) said: Great good is attached to the forelock of the horses until the Day of Judgment.",
                "hadithUrdu": "رسول اﷲ صلی ‌اللہ ‌علیہ ‌وسلم نے فرمایا برکت بندھی ہوئی ہے گھوڑوں کی پیشانیوں سے قیامت تک یعنی ثواب اور غنیمت۔",
                "urduNarrator": "ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا، کہا ہم سے میرے والد نے بیان کیا، کہا ہم سے زکریا نے بیان کیا، عامر کی سند سے, عروہ بارقی سے روایت ہے",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا زَكَرِيَّاءُ، عَنْ عَامِرٍ، عَنْ عُرْوَةَ الْبَارِقِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْخَيْلُ مَعْقُودٌ فِي نَوَاصِيهَا الْخَيْرُ إِلَى يَوْمِ الْقِيَامَةِ الأَجْرُ وَالْمَغْنَمُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12413,
                "hadithNumber": "4850",
                "englishNarrator": "Urwat al-Bariqi reported:",
                "hadithEnglish": "Allah's Messenger (ﷺ) having said this: Good is tied to the forelock of the horses. It Was said to him: Messenger of Allah, why is it so? He (the Prophet said): For reward and booty until the Day of Judgment.",
                "hadithUrdu": "رسول اﷲ صلی ‌اللہ ‌علیہ ‌وسلم نے فرمایا برکت بندھی ہوئی ہے گھوڑوں کی پیشانیوں سے۔ لوگوں نے عرض کیا کیونکر یا رسول اﷲ صلی ‌اللہ ‌علیہ ‌وسلم ! آپ نے فرمایا ثواب ہے اور غنیمت قیامت تک ( کیونکہ جہاد قائم رہے گا قیامت تک ) ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ان سے ابن فضیل نے اور ہم سے ابن ادریس نے، حصین رضی اللہ عنہ نے شعبی کی سند سے بیان کیا, عروہ بارقی سے روایت ہے",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ فُضَيْلٍ، وَابْنُ، إِدْرِيسَ عَنْ حُصَيْنٍ، عَنِ الشَّعْبِيِّ، عَنْ عُرْوَةَ الْبَارِقِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ ‏ الْخَيْرُ مَعْقُوصٌ بِنَوَاصِي الْخَيْلِ ‏ ‏ ‏.‏ قَالَ فَقِيلَ لَهُ يَا رَسُولَ اللَّهِ بِمَ ذَاكَ قَالَ ‏ ‏ الأَجْرُ وَالْمَغْنَمُ إِلَى يَوْمِ الْقِيَامَةِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 12101,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=484",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=482",
                "label": "482",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=483",
                "label": "483",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=484",
                "label": "484",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=485",
                "label": "485",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=486",
                "label": "486",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=487",
                "label": "487",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=488",
                "label": "488",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=486",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=486",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=484",
        "to": 12125,
        "total": 40465
    }
}