{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 460,
        "data": [
            {
                "id": 11764,
                "hadithNumber": "4200",
                "englishNarrator": "Jabir bin 'Abdullah  رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Life grant is permissible.",
                "hadithUrdu": "، آپ نے فرمایا : \" عمریٰ جائز ہے ۔ \" ( یہ عطیہ درست ہے اور آگے چلتا ہے).",
                "urduNarrator": "ہم سے محمد بن المثنیٰ اور محمد بن بشار نے بیان کیا، کہا: ہم سے محمد بن جعفر نے بیان کیا، شعبہ نے ہمیں حدیث بیان کی ، کہا : میں نے قتادہ سے سنا ، وہ عطاء کے واسطے سے حضرت جابر بن عبداللہ رضی اللہ عنہ سے حدیث بیان کر رہے تھے ، انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ: سَمِعْتُ قَتَادَةَ، يُحَدِّثُ عَنْ عَطَاءٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْعُمْرَى جَائِزَةٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "25",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 125,
                    "chapterNumber": "25",
                    "chapterEnglish": "The Book Of Gifts",
                    "chapterUrdu": "عطیہ کی گئی چیزوں کا بیان",
                    "chapterArabic": "كتاب الْهِبَاتِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11765,
                "hadithNumber": "4201",
                "englishNarrator": "Jabir bin Abdullah (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Life grant is the heritage of one upon whom it is conferred.",
                "hadithUrdu": "آپ نے فرمایا : \" عمریٰ اس کے خاندان ( میں سے وراثت کے حقداروں ) کی میراث ہے.",
                "urduNarrator": "ہم سے یحییٰ بن حبیب الحارث نے بیان کیا، ان سے خالد نے، یعنی ہم سے ابن حارث نے بیان کیا, سعید نے ہمیں قتادہ سے حدیث بیان کی ، انہوں نے عطاء سے ، انہوں نے حضرت جابر رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: «الْعُمْرَى مِيرَاثٌ لِأَهْلِهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "25",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 125,
                    "chapterNumber": "25",
                    "chapterEnglish": "The Book Of Gifts",
                    "chapterUrdu": "عطیہ کی گئی چیزوں کا بیان",
                    "chapterArabic": "كتاب الْهِبَاتِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11766,
                "hadithNumber": "4202",
                "englishNarrator": "Abu Huraira (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Life grant is permissible.",
                "hadithUrdu": "آپ نے فرمایا : \" عمریٰ درست ہے.",
                "urduNarrator": "ہم سے محمد بن المثنیٰ اور ابن بشار نے بیان کیا، کہا کہ ہم سے محمد بن جعفر نے بیان کیا،شعبہ نے ہمیں قتادہ سے حدیث بیان کی ، انہوں نے نضر بن انس سے ، انہوں نے بشیر بن نہیک سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنِ النَّضْرِ بْنِ أَنَسٍ، عَنْ بَشِيرِ بْنِ نَهِيكٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْعُمْرَى جَائِزَةٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "25",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 125,
                    "chapterNumber": "25",
                    "chapterEnglish": "The Book Of Gifts",
                    "chapterUrdu": "عطیہ کی گئی چیزوں کا بیان",
                    "chapterArabic": "كتاب الْهِبَاتِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11767,
                "hadithNumber": "4203",
                "englishNarrator": null,
                "hadithEnglish": "This hadith is narrated on the authority of Qatada with the same chain of transmitters.",
                "hadithUrdu": "مجھ سے یحییٰ بن حبیب نے بیان کیا، خالد نے، یعنی ہم سے ابن حارث نے بیان کیا, سعید نے ہمیں قتادہ سے اسی سند کے ساتھ حدیث بیان کی ، البتہ انہوں ( قتادہ ) نے کہا : \" اس کے خاندان کی وراثت \" کہا یا \" جائز \" کہا.",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِيهِ يَحْيَى بْنُ حَبِيبٍ، حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، بِهَذَا الْإِسْنَادِ، غَيْرَ أَنَّهُ قَالَ: «مِيرَاثٌ لِأَهْلِهَا»، أَوْ قَالَ: «جَائِزَةٌ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "25",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 125,
                    "chapterNumber": "25",
                    "chapterEnglish": "The Book Of Gifts",
                    "chapterUrdu": "عطیہ کی گئی چیزوں کا بیان",
                    "chapterArabic": "كتاب الْهِبَاتِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11768,
                "hadithNumber": "4204",
                "englishNarrator": "Ibn Umar (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: It is the duty of a Muslim who has something which is to be given as a bequest not to have it for two nights without having his will written down regarding it.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کسی مسلمان کو ، جس کے پاس کچھ ہو اور وہ اس میں وصیت کرنا چاہتا ہو ، اس بات کا حق نہیں کہ وہ دو راتیں ( بھی ) گزارے مگر اس طرح کہ اس کی وصیت اس کے پاس لکھی ہوئی ہو.",
                "urduNarrator": "ہم سے ابو خیثمہ نے بیان کیا، زہیر بن حرب اور محمد بن المثنی نے بیان کیا، اور یہ قول ابن المثنیٰ نے بیان کیا، انہوں نے کہا: ہم سے یحییٰ نے بیان کیا، اور وہ ابن المثنی ہیں, یحییٰ بن سعید قطان نے ہمیں عبیداللہ سے حدیث بیان کی کہا : مجھے نافع نے حضرت ابن عمر رضی اللہ عنہ سے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو خَيْثَمَةَ زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى الْعَنَزِيُّ، وَاللَّفْظُ لِابْنِ الْمُثَنَّى، قَالَا: حَدَّثَنَا يَحْيَى وَهُوَ ابْنُ سَعِيدٍ الْقَطَّانُ، عَنْ عُبَيْدِ اللهِ، أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَا حَقُّ امْرِئٍ مُسْلِمٍ، لَهُ شَيْءٌ يُرِيدُ أَنْ يُوصِيَ فِيهِ، يَبِيتُ لَيْلَتَيْنِ، إِلَّا وَوَصِيَّتُهُ مَكْتُوبَةٌ عِنْدَهُ».",
                "headingArabic": "وصية الرجل مكتوبة عنده",
                "headingUrdu": "اس کے ساتھ مردوں کی وصیت لکھی جائے۔",
                "headingEnglish": "A Men's will should be written with him",
                "chapterId": "26",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 126,
                    "chapterNumber": "26",
                    "chapterEnglish": "The Book Of Wills",
                    "chapterUrdu": "وصیت کے احکام و مسائل",
                    "chapterArabic": "كتاب الْوَصِيَّةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11769,
                "hadithNumber": "4205",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of 'Ubaidullah with the same chain of transmitters. but with a slight variation of words.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, عبدہ بن سلیمان اور عبداللہ بن نمیر دونوں نے عبیداللہ سے اسی سند کے ساتھ روایت کی ، البتہ ان دونوں نے کہا : \" اس کے پاس ( مال ) ہو جس میں وصیت کرے ( قابل وصیت مال ہو ۔ ) \" اور اس طرح نہیں کہا : \" جس میں وصیت کرنا چاہتا ہو ۔ \" ( مفہوم وہی ہے ، الفاظ کا فرق ہے).",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، وَعَبْدُ اللهِ بْنُ نُمَيْرٍ، ح وحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنِي أَبِي، كِلَاهُمَا عَنْ عُبَيْدِ اللهِ، بِهَذَا الْإِسْنَادِ، غَيْرَ أَنَّهُمَا قَالَا: «وَلَهُ شَيْءٌ يُوصِي فِيهِ»، وَلَمْ يَقُولَا: «يُرِيدُ أَنْ يُوصِيَ فِيهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 126,
                    "chapterNumber": "26",
                    "chapterEnglish": "The Book Of Wills",
                    "chapterUrdu": "وصیت کے احکام و مسائل",
                    "chapterArabic": "كتاب الْوَصِيَّةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11770,
                "hadithNumber": "4206",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this have been narrated on the authority of Nafi', who based his narrations of the words of Ibn 'Umar but with a slight variation of words.",
                "hadithUrdu": "ایوب ، یونس ، اسامہ بن زید لیثی اور ہشام بن سعد سب نے نافع سے ، انہوں نے حضرت ابن عمر رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے عبیداللہ کی حدیث کی طرح حدیث بیان کی اور ان سب نے کہا : \" اس کے پاس کوئی ( ایسی ) چیز ہے جس میں وہ وصیت کرے ۔ \" البتہ ایوب کی حدیث میں ہے کہ انہوں نے کہا : \" وہ اس میں وصیت کرنا چاہتا ہو \" عبیداللہ سے یحییٰ کی روایت کی طرح.",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ، حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ، ح وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ يَعْنِي ابْنَ عُلَيَّةَ، كِلَاهُمَا عَنْ أَيُّوبَ، ح وحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، ح وحَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي أُسَامَةُ بْنُ زَيْدٍ اللَّيْثِيُّ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، أَخْبَرَنَا هِشَامٌ يَعْنِي ابْنَ سَعْدٍ، كُلُّهُمْ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ عُبَيْدِ اللهِ، وَقَالُوا جَمِيعًا: «لَهُ شَيْءٌ يُوصِي فِيهِ»، إِلَّا فِي حَدِيثِ أَيُّوبَ، فَإِنَّهُ قَالَ: «يُرِيدُ أَنْ يُوصِيَ فِيهِ»، كَرِوَايَةِ يَحْيَى، عَنْ عُبَيْدِ اللهِ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 126,
                    "chapterNumber": "26",
                    "chapterEnglish": "The Book Of Wills",
                    "chapterUrdu": "وصیت کے احکام و مسائل",
                    "chapterArabic": "كتاب الْوَصِيَّةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11771,
                "hadithNumber": "4207",
                "englishNarrator": "Salim reported on the authority of his father ('Abdullah bin Umar رضی اللہ عنہ):",
                "hadithEnglish": "He (his father) had heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: It is not proper for a Muslim who has got something to bequeathe to spend even three nights without having his will written down with him regarding it. 'Abdullah bin 'Umar (رضی اللہ عنہ) said: Ever since I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) say this I have not spent a night without having my will (written) along with me.",
                "hadithUrdu": "انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ نے فرمایا : کسی مسلمان آدمی کے لیے ، جس کے پاس کوئی ( ایسی ) چیز ہو جس میں وہ وصیت کرے ، یہ جائز نہیں کہ وہ تین راتیں ( بھی ) گزارے مگر اس طرح کہ اس کی وصیت اس کے پاس لکھی ہوئی ہو ۔ \"\" حضرت عبداللہ بن عمر رضی اللہ عنہ نے کہا : میں نے جب سے رسول اللہ صلی اللہ علیہ وسلم کا یہ فرمان سنا ہے مجھ پر ایک رات بھی نہیں گزری مگر میری وصیت میرےپاس موجود تھی.",
                "urduNarrator": "ہم سے ہارون بن معروف نے بیان کیا، کہا ہم سے عبداللہ بن وہب نے بیان کیا, عمرو بن حارث نے مجھے ابن شہاب سے خبر دی ، انہوں نے سالم سے اور انہوں نے اپنے والد سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، حَدَّثَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو وَهُوَ ابْنُ الْحَارِثِ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، أَنَّهُ سَمِعَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَا حَقُّ امْرِئٍ مُسْلِمٍ، لَهُ شَيْءٌ يُوصِي فِيهِ، يَبِيتُ ثَلَاثَ لَيَالٍ، إِلَّا وَوَصِيَّتُهُ عِنْدَهُ مَكْتُوبَةٌ»، قَالَ عَبْدُ اللهِ بْنُ عُمَرَ: «مَا مَرَّتْ عَلَيَّ لَيْلَةٌ مُنْذُ سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ ذَلِكَ إِلَّا وَعِنْدِي وَصِيَّتِي».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 126,
                    "chapterNumber": "26",
                    "chapterEnglish": "The Book Of Wills",
                    "chapterUrdu": "وصیت کے احکام و مسائل",
                    "chapterArabic": "كتاب الْوَصِيَّةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11772,
                "hadithNumber": "4208",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Zuhri with the same chain of transmitters.",
                "hadithUrdu": "مجھ سے ابو الطاہر اور حرملہ نے بیان کیا، کہا: ہم سے ابن وہب نے بیان کیا، یونس ، عقیل اور معمر سب نے زہری سے اسی سند کے ساتھ عمرو بن حارث کی حدیث کی طرح حدیث بیان کی.",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِيهِ أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، قَالَا: أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، ح وحَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي عُقَيْلٌ، ح وحَدَّثَنَا ابْنُ أَبِي عُمَرَ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَا: حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، كُلُّهُمْ عَنِ الزُّهْرِيِّ، بِهَذَا الْإِسْنَادِ نَحْوَ حَدِيثِ عَمْرِو بْنِ الْحَارِثِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 126,
                    "chapterNumber": "26",
                    "chapterEnglish": "The Book Of Wills",
                    "chapterUrdu": "وصیت کے احکام و مسائل",
                    "chapterArabic": "كتاب الْوَصِيَّةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11773,
                "hadithNumber": "4209",
                "englishNarrator": "Amir bin Sa'd reported on the authority of his father (Sa'd bin Abi Waqqas رضی اللہ عنہ ):",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) visited me in my illness which brought me near death in the year of Hajjat-ul-Wada' (Farewell Pilgrimage). I said: Allah's Messenger, you can well see the pain with which I am afflicted and I am a man possessing wealth, and there is none to inherit me except only one daughter. Should I give two-thirds of my property as Sadaqa? He said: No. I said: Should I give half (of my property) as Sadaqa? He said: No. He (further) said: Give one-third (in charity) and that is quite enough. To leave your heirs rich is better than to leave them poor, begging from people; that you would never incur an expense seeking therewith the pleasure of Allah, but you would be rewarded therefor, even for a morsel of food that you put in the mouth of your wife. I said: Allah's Messenger. would I survive my companions? He (the Holy Prophet) said: If you survive them, then do such a deed by means of which you seek the pleasure of Allah, but you would increase in your status (in religion) and prestige; you may survive so that people would benefit from you, and others would be harmed by you. (The Holy Prophet) further said: Allah, complete for my Companions their migration, and not cause them to turn back upon their heels. Sa'd b. Khaula is, however, unfortunate. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) felt grief for him as he had died in Mecca.",
                "hadithUrdu": "حجۃ الوداع کی موقع پر رسول اللہ صلی اللہ علیہ وسلم نے ایسی بیماری میں میری عیادت کی جس کی وجہ سے میں موت کے کنارے پہنچ چکا تھا ۔ میں نے عرض کی : اللہ کے رسول! مجھے ایسی بیماری نے آ لیا ہے جو آپ دیکھ رہے ہیں اور میں مالدار آدمی ہوں اور صرف ایک بیٹی کے سوا میرا کوئی وارث نہیں ( بنتا ۔ ) تو کیا میں اپنے مال کا دو تہائی حصہ صدقہ کر دوں؟ آپ نے فرمایا : \" نہیں ۔ \" میں نے عرض کی : کیا میں اس کا آدھا حصہ صدقہ کر دوں؟ آپ نے فرمایا : \" نہیں ، ( البتہ ) ایک تہائی ( صدقہ کر دو ) اور ایک تہائی بہت ہے ، بلاشبہ اگر تم اپنے ورثاء کو مالدار چھوڑ جاؤ ، وہ لوگوں کے سامنے دست سوال دراز کرتے پھریں ، اور تم کوئی چیز بھی خرچ نہیں کرتے جس کے ذریعے سے تم اللہ کی رضا چاہتے ہو ، مگر تمہیں اس کا اجر دیا جاتا ہے حتی کہ اس لقمے کا بھی جو تم اپنی بیوی کے منہ میں ڈالتے ہو ۔ \" کہا : میں نے عرض کی : اللہ کے رسول! میں اپنے ساتھیوں کے ( مدینہ لوٹ جانے کے بعد ) پیچھے ( یہیں مکہ میں ) چھوڑ دیا جاؤں گا؟ آپ نے فرمایا : \" تمہیں پیچھے نہیں چھوڑا جائے گا ، پھر تم کوئی ایسا عمل نہیں کرو گے جس کے ذریعے سے تم اللہ کی رضا چاہتے ہو گے ، مگر اس کی بنا پر تم درجے اور بلندی میں ( اور ) بڑھ جاؤ گے اور شاید تمہیں چھوڑ دیا جائے ( لمبی عمر دی جائے ) حتی کہ تمہارے ذریعے سے بہت سی قوموں کو نفع ملے اور دوسری بہت سی قوموں کو نقصان پہنچے ۔ اے اللہ! میرے ساتھیوں کے لیے ان کی ہجرت کو جاری رکھ اور انہیں ان کی ایڑیوں کے بل واپس نہ لوٹا ، لیکن بے چارے سعد بن خولہ ( وہ تو فوت ہو ہی گئے ۔ ) کہا : رسول اللہ صلی اللہ علیہ وسلم نے اس وجہ سے ان کے لیے غم کا اظہارِ افسوس کیا کہ وہ ( اس سے پہلے ہی ) مکہ میں ( آ کر ) فوت ہو گئے تھے ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ التمیمی نے بیان کیا، ابراہیم بن سعد ( بن ابراہیم بن عبدالرحمن بن عوف ) نے ہمیں ابن شہاب سے خبر دی ، انہوں نے عامر بن سعد اور انہوں نے اپنے والد ( حضرت سعد بن ابی وقاص رضی اللہ عنہ ) سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "دَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، أَخْبَرَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَامِرِ بْنِ سَعْدٍ، عَنْ أَبِيهِ، قَالَ: عَادَنِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ مِنْ وَجَعٍ أَشْفَيْتُ مِنْهُ عَلَى الْمَوْتِ، فَقُلْتُ: يَا رَسُولَ اللهِ، بَلَغَنِي مَا تَرَى مِنَ الْوَجَعِ، وَأَنَا ذُو مَالٍ، وَلَا يَرِثُنِي إِلَّا ابْنَةٌ لِي وَاحِدَةٌ، أَفَأَتَصَدَّقُ بِثُلُثَيْ مَالِي؟ قَالَ: «لَا»، قَالَ: قُلْتُ: أَفَأَتَصَدَّقُ بِشَطْرِهِ؟ قَالَ: «لَا، الثُّلُثُ، وَالثُّلُثُ كَثِيرٌ [ص:1251]، إِنَّكَ أَنْ تَذَرَ وَرَثَتَكَ أَغْنِيَاءَ، خَيْرٌ مِنْ أَنْ تَذَرَهُمْ عَالَةً يَتَكَفَّفُونَ النَّاسَ، وَلَسْتَ تُنْفِقُ نَفَقَةً تَبْتَغِي بِهَا وَجْهَ اللهِ، إِلَّا أُجِرْتَ بِهَا، حَتَّى اللُّقْمَةُ تَجْعَلُهَا فِي فِي امْرَأَتِكَ»، قَالَ: قُلْتُ: يَا رَسُولَ اللهِ، أُخَلَّفُ بَعْدَ أَصْحَابِي، قَالَ: «إِنَّكَ لَنْ تُخَلَّفَ فَتَعْمَلَ عَمَلًا تَبْتَغِي بِهِ وَجْهَ اللهِ، إِلَّا ازْدَدْتَ بِهِ دَرَجَةً وَرِفْعَةً، وَلَعَلَّكَ تُخَلَّفُ حَتَّى يُنْفَعَ بِكَ أَقْوَامٌ، وَيُضَرَّ بِكَ آخَرُونَ، اللهُمَّ أَمْضِ لِأَصْحَابِي هِجْرَتَهُمْ وَلَا تَرُدَّهُمْ عَلَى أَعْقَابِهِمْ، لَكِنِ الْبَائِسُ سَعْدُ بْنُ خَوْلَةَ»، قَالَ«رَثَى لَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنْ أَنْ تُوُفِّيَ بِمَكَّةَ.",
                "headingArabic": "الْوَصِيَّةِ بِالثُّلُثِ ‏‏",
                "headingUrdu": "ایک تہائی کی وصیت کرنا",
                "headingEnglish": "Bequeathing One-Third",
                "chapterId": "26",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 126,
                    "chapterNumber": "26",
                    "chapterEnglish": "The Book Of Wills",
                    "chapterUrdu": "وصیت کے احکام و مسائل",
                    "chapterArabic": "كتاب الْوَصِيَّةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11774,
                "hadithNumber": "4210",
                "englishNarrator": null,
                "hadithEnglish": "This hadith is narrated on the authority of Zuhri with the same chain of transmitters.",
                "hadithUrdu": "ہم سے قتیبہ بن سعید اور ابوبکر بن ابی شیبہ نے بیان کیا، کہا:سفیان بن عیینہ ، یونس اور معمر سب نے ابن شہاب سے اسی سند کے ساتھ اسی طرح حدیث بیان کی.",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، قَالَا: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ح وحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، قَالَا: أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، ح وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَا: أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، كُلُّهُمْ عَنِ الزُّهْرِيِّ، بِهَذَا الْإِسْنَادِ نَحْوَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 126,
                    "chapterNumber": "26",
                    "chapterEnglish": "The Book Of Wills",
                    "chapterUrdu": "وصیت کے احکام و مسائل",
                    "chapterArabic": "كتاب الْوَصِيَّةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11775,
                "hadithNumber": "4211",
                "englishNarrator": "Amir bin Sa'd reported from S'ad (bin Abu Waqqas رضی اللہ عنہ):",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) visited me to inquire after my health, the rest of the hadith is the same as transmitted on the authority of Zuhri, but lie did not make mention of the words of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) in regard to Sa'd bin Khaula رضی اللہ عنہ except this that he said: He (the Holy Prophet) did not like death in the land from which lie had migrated.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم میری عیادت کرنے کے لیے میرے ہاں تشریف لائے ۔ ۔ ۔ آگے زہری کی حدیث کے ہم معنی بیان کیا اور انہوں نے سعد بن خولہ رضی اللہ عنہ کے بارے میں نبی صلی اللہ علیہ وسلم کے فرمان کا تذکرہ نہیں کیا ، مگر انہوں نے کہا : اور وہ ( حضرت سعد بن خولہ رضی اللہ عنہ ) ناپسند کرتے تھے کہ اس سرزمین میں وفات پائیں جہاں سے ہجرت کر گئے تھے.",
                "urduNarrator": "مجھ سے اسحاق بن منصور نے بیان کیا، ہم سے ابوداؤد الحفری نے بیان کیا، سفیان کی سند سے, سعد بن ابراہیم نے عامر بن سعد سے اور انہوں نے حضرت سعد رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا أَبُو دَاوُدَ الْحَفَرِيُّ، عَنْ سُفْيَانَ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ عَامِرِ بْنِ سَعْدٍ، عَنْ سَعْدٍ، قَالَ: دَخَلَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَيَّ يَعُودُنِي، فَذَكَرَ بِمَعْنَى حَدِيثِ الزُّهْرِيِّ، وَلَمْ يَذْكُرْ قَوْلَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي سَعْدِ بْنِ خَوْلَةَ، غَيْرَ أَنَّهُ قَالَ: وَكَانَ يَكْرَهُ أَنْ يَمُوتَ بِالْأَرْضِ الَّتِي هَاجَرَ مِنْهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 126,
                    "chapterNumber": "26",
                    "chapterEnglish": "The Book Of Wills",
                    "chapterUrdu": "وصیت کے احکام و مسائل",
                    "chapterArabic": "كتاب الْوَصِيَّةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11776,
                "hadithNumber": "4212",
                "englishNarrator": "Mus'ab bin Sa'd reported on the authority of his father:",
                "hadithEnglish": "I was ailing. I sent message to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saying: Permit me to give away my property as I like. He refused. I (again) said: (Permit me) to give away half. He (again refused). I (again said): Then one-third. He (the Holy Prophet ﷺ) observed silence after (I had asked permission to give away) one-third. He (the narrator) said: It was then that endowment of one-third became permissible.",
                "hadithUrdu": "میں بیمار ہوا تو میں نے نبی صلی اللہ علیہ وسلم کے پاس پیغام بھیجا ، میں نے عرض کی : مجھے اجازت دیجیے کہ میں اپنا مال جہاں چاہوں تقسیم کر دوں ۔ آپ نے انکار فرمایا ، میں نےعرض کی : آدھا مال ( تقسیم کر دوں؟ ) آپ نے انکار فرمایا ، میں نے عرض کی : ایک تہائی؟ کہا : ( میرے ) ایک تہائی ( کہنے ) کے بعد آپ خاموش ہو گئے ۔ ( ایک تہائی کی وصیت سے آپ نے منع نہ فرمایا مگر اس کے بارے میں بھی یہ فرمایا : ایک تہائی بھی بہت ہے ، حدیث : 4215 ، 4214 ) کہا : اس کے بعد ایک تہائی ( کی وصیت ) جائز ٹھہری ۔",
                "urduNarrator": "زہیر نے ہمیں حدیث بیان کی ، کہا : ہمیں سماک بن حرب نے حدیث بیان کی ، کہا : مجھے مصعب بن سعد ( بن ابی وقاص ) نے اپنے والد سے حدیث بیان کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا سِمَاكُ بْنُ حَرْبٍ، حَدَّثَنِي مُصْعَبُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، قَالَ: مَرِضْتُ، فَأَرْسَلْتُ إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقُلْتُ: «دَعْنِي أَقْسِمْ مَالِي حَيْثُ شِئْتُ، فَأَبَى»، قُلْتُ: فَالنِّصْفُ؟ فَأَبَى ، قُلْتُ: «فَالثُّلُثُ؟»، قَالَ: «فَسَكَتَ بَعْدَ الثُّلُثِ»، قَالَ: «فَكَانَ بَعْدُ الثُّلُثُ جَائِزًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 126,
                    "chapterNumber": "26",
                    "chapterEnglish": "The Book Of Wills",
                    "chapterUrdu": "وصیت کے احکام و مسائل",
                    "chapterArabic": "كتاب الْوَصِيَّةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11777,
                "hadithNumber": "4213",
                "englishNarrator": "This hadith has been narrated on the authority of Simak with the same chain of transmitters. But he did not mention:",
                "hadithEnglish": "It was then that one-third became permissible.",
                "hadithUrdu": "\" اس کے بعد ایک تہائی ( کی وصیت ) جائز ٹھہری.",
                "urduNarrator": "مجھ سے محمد بن المثنیٰ اور ابن بشار نے بیان کیا، کہا: ہم سے محمد بن جعفر نے بیان کیا، شعبہ نے سماک سے اسی سند کے ساتھ اسی کے ہم معنی حدیث بیان کی اور انہوں نے یہ بیان نہیں کیا",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سِمَاكٍ، بِهَذَا الْإِسْنَادِ نَحْوَهُ، وَلَمْ يَذْكُرْ فَكَانَ بَعْدُ الثُّلُثُ جَائِزًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 126,
                    "chapterNumber": "26",
                    "chapterEnglish": "The Book Of Wills",
                    "chapterUrdu": "وصیت کے احکام و مسائل",
                    "chapterArabic": "كتاب الْوَصِيَّةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11778,
                "hadithNumber": "4214",
                "englishNarrator": "Ibn Sa'd reported his father as saying:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) visited me during my illness. I said: I am willing away the whole of my property. He said: No. I said: Then half? He said: No. I said: Should I will away one-third? He said: Yes, and even one-third is enough.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے میری عیادت کی تو میں نے عرض کی : کیا میں اپنے سارے مال کی وصیت کر دوں؟ آپ نے فرمایا : \" نہیں ۔ \" میں نے عرض کی : تو آدھے کی؟ آپ نے فرمایا : \" نہیں ۔ \" میں نے عرض کی : ایک تہائی کی؟ تو آپ نے فرمایا : \" ہاں ، اور تہائی بھی زیادہ ہے.",
                "urduNarrator": "مجھ سے القاسم بن زکریا نے بیان کیا، ہم سے حسین بن علی نے بیان کیا، زیدہ رضی اللہ عنہ سے, عبدالملک بن عُمَیر نے مُصعب بن سعد سے اور انہوں نے اپنے والد سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي الْقَاسِمُ بْنُ زَكَرِيَّا، حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ، عَنْ زَائِدَةَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ مُصْعَبِ بْنِ سَعْدٍ، عَنْ أَبِيهِ، قَالَ: عَادَنِي النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقُلْتُ: أُوصِي بِمَالِي كُلِّهِ؟ قَالَ: «لَا»، قُلْتُ: فَالنِّصْفُ؟ قَالَ: «لَا»، فَقُلْتُ: أَبِالثُّلُثِ؟ فَقَالَ: «نَعَمْ، وَالثُّلُثُ كَثِيرٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 126,
                    "chapterNumber": "26",
                    "chapterEnglish": "The Book Of Wills",
                    "chapterUrdu": "وصیت کے احکام و مسائل",
                    "chapterArabic": "كتاب الْوَصِيَّةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11779,
                "hadithNumber": "4215",
                "englishNarrator": "Humaid bin 'Abdul-Rahman al-Himyari reported from three of the sons of Sa'd رضی اللہ عنہ all of whom reported from their father:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) visited Sa'd رضی اللہ عنہ as he was ill in Mecca. He (Sa'd) wept. He (the Holy Prophet ﷺ) said: What makes you weep? He said: I am afraid I may die in the land from where I migrated as Sa'd bin Khaula رضی اللہ عنہ had died. Thereupon Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: O Allah, grant health to Sa'd. O Allah, grant health to Sad. He repeated it three times. He (Sa'd) said: Allah's Messenger ﷺ, I own a large property and I have only one daughter as my inheritor. Should I not will away the whole of my property? He (the Holy Prophet ﷺ) said: No. He said: (Should I not will away, ) two-thirds of the property? he (the Holy Prophet ﷺ) said: No. He (Sa'd) (again) said: (Should I not will away) half (of my property)? He said: No. He (Sa'd) said: Then one-third? Thereupon he (the Holy Prophet ﷺ) said: (Yes), one-third, and one-third is quite substanial. And what you spend as charity from your property is Sadaqa and flour spending on your family is also Sadaqa, and what your wife eats from your property is also Sadaqa, and that you leave your heirs well off (or he said: prospreous) is better than to leave them (poor and) begging from people. He (the Holy Prophet ﷺ) pointed this with his hands.",
                "hadithUrdu": "مکہ میں نبی صلی اللہ علیہ وسلم عیادت کرنے کے لیے حضرت سعد رضی اللہ عنہ کے ہاں تشریف لائے تو وہ رونے لگے ، آپ نے پوچھا : \" تمہیں کیا بات رلا رہی ہے؟ \" انہوں نے کہا : مجھے ڈر ہے کہ میں اس سرزمین میں فوت ہو جاؤں گا جہاں سے ہجرت کی تھی ، جیسے سعد بن خولہ رضی اللہ عنہ فوت ہو گئے ۔ تو نبی صلی اللہ علیہ وسلم نے فرمایا : \" اے اللہ! سعد کو شفا دے ۔ اے اللہ! سعد کو شفا دے ۔ \" تین بار فرمایا ۔ انہوں نے کہا : اللہ کے رسول! میرے پاس بہت سا مال ہے اور میری وارث صرف میری بیٹی بنے گی ، کیا میں اپنے سارے مال کی وصیت کر دوں؟ آپ نے فرمایا : \" نہیں ۔ \" انہوں نے کہا : دو تہائی کی؟ آپ صلی اللہ علیہ وسلم نے فرمایا : \" نہیں ۔ \" انہوں نے کہا : نصف کی؟ آپ صلی اللہ علیہ وسلم نے فرمایا : \" نہیں ۔ \" انہوں نے کہا : ایک تہائی کی؟ آپ نے فرمایا : \" ( ہاں ) ایک تہائی کی ( وصیت کر دو ) اور ایک تہائی بھی زیادہ ہے ۔ اپنے مال میں سے تمہارا صدقہ کرنا صدقہ ہے ، اپنے عیال پر تمہارا خرچ کرنا صدقہ ہے اور جو تمہارے مال سے تمہاری بیوی کھاتی ہے صدقہ ہے اور تم اپنے اہل و عیال کو ( کافی مال دے کر ) خیر کے عالم میں چھوڑ جاؤ ۔ ۔ یا فرمایا : ( اچھی ) گزران کے ساتھ چھوڑ جاؤ ۔ ۔ یہ اس سے بہتر ہے کہ تم انہیں اس حال میں چھوڑو کہ وہ لوگوں کے سامنے ہاتھ پھیلاتے پھریں ۔ \" اور آپ نے اپنے ہاتھ سےاشارہ کر کے دکھایا ۔",
                "urduNarrator": "ہم سے محمد بن ابی عمر المکی نے بیان کیا, (عبدالوہاب ) ثقفی نے ہمیں ایوب سختیانی سے حدیث بیان کی ، انہوں نے عمرو بن سعید سے ، انہوں نے حُمید بن عبدالرحمن حمیری سے اور انہوں نے حضرت سعد رضی اللہ عنہ کے ( دس سے زائد میں سے ) تین بیٹوں ( عامر ، مصعب اور محمد ) سے روایت کی ، وہ سب اپنے والد سے حدیث بیان کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْمَكِّيُّ، حَدَّثَنَا الثَّقَفِيُّ، عَنْ أَيُّوبَ السَّخْتِيَانِيِّ، عَنْ عَمْرِو بْنِ سَعِيدٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ الْحِمْيَرِيِّ، عَنْ ثَلَاثَةٍ مِنْ وَلَدِ سَعْدٍ، كُلُّهُمْ يُحَدِّثُهُ عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَى سَعْدٍ يَعُودُهُ بِمَكَّةَ، فَبَكَى، قَالَ: «مَا يُبْكِيكَ؟» فَقَالَ: قَدْ خَشِيتُ أَنْ أَمُوتَ بِالْأَرْضِ الَّتِي هَاجَرْتُ مِنْهَا، كَمَا مَاتَ سَعْدُ بْنُ خَوْلَةَ، فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «اللهُمَّ اشْفِ سَعْدًا، اللهُمَّ اشْفِ سَعْدًا» ثَلَاثَ مِرَارٍ، قَالَ: يَا رَسُولَ اللهِ، إِنَّ لِي مَالًا كَثِيرًا، وَإِنَّمَا يَرِثُنِي ابْنَتِي، أَفَأُوصِي بِمَالِي كُلِّهِ؟ قَالَ: «لَا»، قَالَ: فَبِالثُّلُثَيْنِ؟، قَالَ: «لَا»، قَالَ: «فَالنِّصْفُ؟» قَالَ: «لَا»، قَالَ: فَالثُّلُثُ؟ قَالَ: الثُّلُثُ وَالثُّلُثُ كَثِيرٌ، إِنَّ صَدَقَتَكَ مِنْ مَالِكَ صَدَقَةٌ، وَإِنَّ نَفَقَتَكَ عَلَى عِيَالِكَ صَدَقَةٌ، وَإِنَّ مَا تَأْكُلُ امْرَأَتُكَ مِنْ مَالِكَ صَدَقَةٌ، وَإِنَّكَ أَنْ تَدَعَ أَهْلَكَ بِخَيْرٍ - أَوْ قَالَ: بِعَيْشٍ - خَيْرٌ مِنْ أَنْ تَدَعَهُمْ يَتَكَفَّفُونَ النَّاسَ ‘وَقَالَ: بِيَدِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 126,
                    "chapterNumber": "26",
                    "chapterEnglish": "The Book Of Wills",
                    "chapterUrdu": "وصیت کے احکام و مسائل",
                    "chapterArabic": "كتاب الْوَصِيَّةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11780,
                "hadithNumber": "4216",
                "englishNarrator": "Humaid bin Abdul-Rahmin al-Himayri reported on the authority of the three of the sons of Sa'd رضی اللہ عنہ :",
                "hadithEnglish": "They said: Sa'd رضی اللہ عنہ fell ill in Mecca. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) visited him to inquire after his health. The rest of the hadith is the same.",
                "hadithUrdu": "حضرت سعد رضی اللہ عنہ مکہ میں بیمار ہوئے تو رسول اللہ صلی اللہ علیہ وسلم ان کی عیادت کرنے کے لیے ان کے ہاں تشریف لائے ۔ ۔ آگے ثقفی کی حدیث کے ہم معنی ہے.",
                "urduNarrator": "ابو الربیع العتکی نے مجھ سے کہا, ہمیں حماد نے حدیث بیان کی ، انہوں نے کہا : ہمیں ایوب نے عمرو بن سعید سے حدیث بیان کی ، انہوں نے حمید بن عبدالرحمن حمیری سے اور انہوں نے حضرت سعد رضی اللہ عنہ کے تین بیٹوں سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي أَبُو الرَّبِيعِ الْعَتَكِيُّ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا أَيُّوبُ، عَنْ عَمْرِو بْنِ سَعِيدٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ الْحِمْيَرِيِّ، عَنْ ثَلَاثَةٍ مِنْ وَلَدِ سَعْدٍ، قَالُوا: مَرِضَ سَعْدٌ بِمَكَّةَ، فَأَتَاهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَعُودُهُ بِنَحْوِ حَدِيثِ الثَّقَفِيِّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 126,
                    "chapterNumber": "26",
                    "chapterEnglish": "The Book Of Wills",
                    "chapterUrdu": "وصیت کے احکام و مسائل",
                    "chapterArabic": "كتاب الْوَصِيَّةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11781,
                "hadithNumber": "4217",
                "englishNarrator": "Humaid bin Abdul-Rahman reported:",
                "hadithEnglish": "This hadith on the authority of three of Sa'd's sons: Sa'd رضی اللہ عنہ fell ill in Mecca and Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) visited him. The rest of the hadith is the same.",
                "hadithUrdu": "مجھے حضرت سعد بن مالک رضی اللہ عنہ کے تین بیٹوں نے حدیث بیان کی ، ان میں ہر ایک مجھے اپنے دوسرے ساتھی کے مانند حدیث بیان کر رہا تھا ، کہا : حضرت سعد رضی اللہ عنہ مکہ میں بیمار ہوئے تو نبی صلی اللہ علیہ وسلم ان کی عیادت کے لیے تشریف لائے ۔ ۔ آگے حمید حمیری سے عمرو بن سعید کی حدیث کے ہم معنی ہے.",
                "urduNarrator": "مجھ سے محمد بن المثنیٰ نے بیان کیا، کہا ہم سے عبد الا لعلیٰ  نے بیان کیا، کہا ہم سے ہشام نے بیان کیا, محمد نے حمید بن عبدالرحمن سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْأَعْلَى، حَدَّثَنَا هِشَامٌ، عَنْ مُحَمَّدٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، حَدَّثَنِي ثَلَاثَةٌ مِنْ وَلَدِ سَعْدِ بْنِ مَالِكٍ، كُلُّهُمْ يُحَدِّثُنِيهِ بِمِثْلِ حَدِيثِ صَاحِبِهِ، فَقَالَ: مَرِضَ سَعْدٌ بِمَكَّةَ، فَأَتَاهُ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَعُودُهُ بِمِثْلِ حَدِيثِ عَمْرِو بْنِ سَعِيدٍ، عَنْ حُمَيْدٍ الْحِمْيَرِيِّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 126,
                    "chapterNumber": "26",
                    "chapterEnglish": "The Book Of Wills",
                    "chapterUrdu": "وصیت کے احکام و مسائل",
                    "chapterArabic": "كتاب الْوَصِيَّةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11782,
                "hadithNumber": "4218",
                "englishNarrator": "Ibn 'Abbas (رضی اللہ عنہ) said:",
                "hadithEnglish": "(I wish) if people would reduce from third to fourth (part for making a will of their property), for Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: So far as the third (part) is concerned it is quite substantial. In the hadith transmitted on the authority of Waki (the words are) large or much .",
                "hadithUrdu": "کاش لوگ تہائی سے کم کر کے چوتھائی کی وصیت کریں کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے : \"\" تہائی ( تک کی وصیت کرو ) ، اور تہائی بھی زیادہ ہے وکیع کی حدیث میں \"\" بڑا ہے \"\" یا \"\" زیادہ ہے \"\" کے الفاظ ہیں.",
                "urduNarrator": "مجھ سے ابراہیم بن موسیٰ رازی نے بیان کیا,عیسیٰ بن یونس ، وکیع اور ابن نمیر سب نے ہشام بن عروہ سے حدیث بیان کی ، انہوں نے اپنے والد سے اور انہوں نے حضرت ابن عباس رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ، أَخْبَرَنَا عِيسَى يَعْنِي ابْنَ يُونُسَ، ح وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، قَالَا: حَدَّثَنَا وَكِيعٌ، ح وحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا ابْنُ نُمَيْرٍ، كُلُّهُمْ عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ: لَوْ أَنَّ النَّاسَ غَضُّوا مِنَ الثُّلُثِ إِلَى الرُّبُعِ، فَإِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «الثُّلُثُ، وَالثُّلُثُ كَثِيرٌ»، وَفِي حَدِيثِ وَكِيعٍ: كَبِيرٌ أَوْ كَثِيرٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 126,
                    "chapterNumber": "26",
                    "chapterEnglish": "The Book Of Wills",
                    "chapterUrdu": "وصیت کے احکام و مسائل",
                    "chapterArabic": "كتاب الْوَصِيَّةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11783,
                "hadithNumber": "4219",
                "englishNarrator": "Abu Huraira (رضی اللہ عنہ) reported:",
                "hadithEnglish": "A person said to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌): My father died and left behind property without making any will regarding it. Would he be relieved of the burden of his sins if I give sadaqa on his behalf? He (the Holy Prophet ﷺ) said: Yes.",
                "hadithUrdu": "ایک آدمی نے نبی صلی اللہ علیہ وسلم سے عرض کی : میرے والد فوت ہو گئے ہیں ، انہوں نے مال چھوڑا ہے اور وصیت نہیں کی ، اگر ( یہ مال ) ان کی طرف سے صدقہ کر دیا جائے تو کیا ( یہ ) ان کی طرف سے کفارہ بنے گا؟ آپ نے فرمایا : \" ہاں.",
                "urduNarrator": "ہم سے یحییٰ بن ایوب، قتیبہ بن سعید اور علی بن حجر نے بیان کیا، انہوں نے کہا: ہم سے اسماعیل نے جو ابن جعفر ہیں، انہوں نے علاء کی سند سے بیان کیا۔ اس کے والد،حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَعَلِيُّ بْنُ حُجْرٍ، قَالُوا: حَدَّثَنَا إِسْمَاعِيلُ وَهُوَ ابْنُ جَعْفَرٍ، عَنِ الْعَلَاءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَجُلًا قَالَ لِلنَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: إِنَّ أَبِي مَاتَ وَتَرَكَ مَالًا، وَلَمْ يُوصِ، فَهَلْ يُكَفِّرُ عَنْهُ أَنْ أَتَصَدَّقَ عَنْهُ؟ قَالَ: «نَعَمْ».",
                "headingArabic": "وُصُولِ ثَوَابِ الصَّدَقَاتِ إِلَى الْمَيِّتِ ‏‏",
                "headingUrdu": "صدقہ کا ثواب میت تک پہنچتا ہے۔",
                "headingEnglish": "The Reward For Charity Reaches The Deceased",
                "chapterId": "26",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 126,
                    "chapterNumber": "26",
                    "chapterEnglish": "The Book Of Wills",
                    "chapterUrdu": "وصیت کے احکام و مسائل",
                    "chapterArabic": "كتاب الْوَصِيَّةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11784,
                "hadithNumber": "4220",
                "englishNarrator": "A'isha (رضی اللہ عنہا) reported:",
                "hadithEnglish": "A man said to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌): My mother died all of a sudden, and I think if she (could have the opportunity) to speak she would have (made a will) regarding Sadaqa'. Will I be entitled to reward if I give charity on her behalf? He (the Holy Prophet) said: Yes.",
                "hadithUrdu": "ایک آدمی نے نبی صلی اللہ علیہ وسلم سے عرض کی : میری والدہ اچانک وفات پا گئیں ، مجھے ان کے بارے میں یقین ہے کہ اگر وہ بات کرتیں تو صدقہ کرتیں ، اگر میں ان کی طرف سے صدقہ کر دوں تو کیا میرے لیے اجر ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا : \" ہاں.",
                "urduNarrator": "ہم سے زہیر بن حرب نے بیان کیا, یحییٰ بن سعید نے ہمیں ہشام بن عروہ سے حدیث بیان کی ، کہا : مجھے میرے والد نے حضرت عائشہ رضی اللہ عنہاسے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ، أَنَّ رَجُلًا قَالَ لِلنَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: إِنَّ أُمِّيَ افْتُلِتَتْ نَفْسُهَا، وَإِنِّي أَظُنُّهَا لَوْ تَكَلَّمَتْ تَصَدَّقَتْ، فَلِي أَجْرٌ أَنْ أَتَصَدَّقَ عَنْهَا؟ قَالَ: «نَعَمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 126,
                    "chapterNumber": "26",
                    "chapterEnglish": "The Book Of Wills",
                    "chapterUrdu": "وصیت کے احکام و مسائل",
                    "chapterArabic": "كتاب الْوَصِيَّةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11785,
                "hadithNumber": "4221",
                "englishNarrator": "A'isha (رضی اللہ عنہا) reported:",
                "hadithEnglish": "A man came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: Allah's Messenger ﷺ, my mother died all of a sudden without making any will. I think if (she could have the opportunity) to speak she would have made a Sadaqa. Would there be any reward for her if I give charity on her behalf? He (the Holy Prophet ﷺ) said: Yes.",
                "hadithUrdu": "ایک آدمی نبی صلی اللہ علیہ وسلم کے پاس آیا اور کہا : اللہ کے رسول! میری والدہ اچانک فوت ہو گئی ہیں اور وصیت نہیں کر سکیں ، مجھے ان کے بارے میں یقین ہے کہ اگر وہ کلام کرتیں تو ضرور صدقہ کرتیں ، اگر میں ان کی طرف سے صدقہ کر دوں تو کیا ان کے لیے اجر ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا : \" ہاں.",
                "urduNarrator": "ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا,محمد بن بشر نے ہمیں حدیث بیان کی ، کہا : ہمیں ہشام نے اپنے والد سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے حدیث بیان کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ رَجُلًا أَتَى النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: يَا رَسُولَ اللهِ، إِنَّ أُمِّيَ افْتُلِتَتْ نَفْسُهَا وَلَمْ تُوصِ، وَأَظُنُّهَا لَوْ تَكَلَّمَتْ تَصَدَّقَتْ، أَفَلَهَا أَجْرٌ إِنْ تَصَدَّقْتُ عَنْهَا، قَالَ: «نَعَمْ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 126,
                    "chapterNumber": "26",
                    "chapterEnglish": "The Book Of Wills",
                    "chapterUrdu": "وصیت کے احکام و مسائل",
                    "chapterArabic": "كتاب الْوَصِيَّةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11786,
                "hadithNumber": "4222",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Hisham bin 'Urwa with the same chain of transmitters.",
                "hadithUrdu": "ہم سے ابو کریب نے بیان کیا, ابواسامہ ، شعیب بن اسحاق ، روح بن قاسم اور جعفر بن عون ، سب نے ہشام بن عروہ سے اسی سند کے ساتھ حدیث بیان کی ۔ ابواسامہ اور روح کی حدیث میں ہے : کیا میرے لیے اجر ہے؟ جس طرح یحییٰ بن سعید نے کہا ۔ اور شعیب اور جعفر کی حدیث میں ہے : کیا ان کے لیے اجر ہے؟ جس طرح ابن بشیر کی روایت ہے",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، ح وحَدَّثَنِي الْحَكَمُ بْنُ مُوسَى، حَدَّثَنَا شُعَيْبُ بْنُ إِسْحَاقَ، ح وحَدَّثَنِي أُمَيَّةُ بْنُ بِسْطَامَ، حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ، حَدَّثَنَا رَوْحٌ وَهُوَ ابْنُ الْقَاسِمِ، ح وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ، كُلُّهُمْ عَنْ هِشَامِ بْنِ عُرْوَةَ بِهَذَا الْإِسْنَادِ، أَمَّا أَبُو أُسَامَةَ، وَرَوْحٌ، فَفِي حَدِيثِهِمَا: فَهَلْ لِي أَجْرٌ؟ كَمَا قَالَ يَحْيَى بْنُ سَعِيدٍ، وَأَمَّا شُعَيْبٌ، وَجَعْفَرٌ، فَفِي حَدِيثِهِمَا: أَفَلَهَا أَجْرٌ؟ كَرِوَايَةِ ابْنِ بِشْرٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 126,
                    "chapterNumber": "26",
                    "chapterEnglish": "The Book Of Wills",
                    "chapterUrdu": "وصیت کے احکام و مسائل",
                    "chapterArabic": "كتاب الْوَصِيَّةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11787,
                "hadithNumber": "4223",
                "englishNarrator": "Abu Huraira ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When a man dies, his acts come to an end, but three, recurring charity, or knowledge (by which people) benefit, or a pious son, who prays for him (for the deceased).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب انسان فوت ہو جائے تو اس کا عمل منقطع ہو جاتا ہے سوائے تین اعمال کے ( وہ منقطع نہیں ہوتے ) : صدقہ جاریہ یا ایسا علم جس سے فائدہ اٹھایا جائے یا نیک بیٹا جو اس کے لیے دعا کرے.",
                "urduNarrator": "ہم سے یحییٰ بن ایوب، قتیبہ، یعنی ابن سعید اور ابن حجر نے بیان کیا، کہا: ہم سے جعفر کے بیٹے اسماعیل نے علاء کی سند سے بیان کیا, اس کے والد، حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ يَعْنِي ابْنَ سَعِيدٍ، وَابْنُ حُجْرٍ، قَالُوا: حَدَّثَنَا إِسْمَاعِيلُ هُوَ ابْنُ جَعْفَرٍ، عَنِ الْعَلَاءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ:إِذَا مَاتَ الْإِنْسَانُ انْقَطَعَ عَنْهُ عَمَلُهُ إِلَّا مِنْ ثَلَاثَةٍ: إِلَّا مِنْ صَدَقَةٍ جَارِيَةٍ، أَوْ عِلْمٍ يُنْتَفَعُ بِهِ، أَوْ وَلَدٍ صَالِحٍ يَدْعُو لَهُ.",
                "headingArabic": "مَا يَلْحَقُ الإِنْسَانَ مِنَ الثَّوَابِ بَعْدَ وَفَاتِهِ ‏‏",
                "headingUrdu": "مرنے کے بعد انسان کو کیا ثواب ملتا ہے۔",
                "headingEnglish": "What Reward Reaches A Man After His Death",
                "chapterId": "26",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 126,
                    "chapterNumber": "26",
                    "chapterEnglish": "The Book Of Wills",
                    "chapterUrdu": "وصیت کے احکام و مسائل",
                    "chapterArabic": "كتاب الْوَصِيَّةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11788,
                "hadithNumber": "4224",
                "englishNarrator": "Ibn Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Umar رضی اللہ عنہ acquired a land at Khaibar. He came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and sought his advice in regard to it. He said: Allah's Messenger, I have acquired land in Khaibar. I have never acquired property more valuable for me than this, so what do you command me to do with it? Thereupon he (Allah's Apostle ﷺ) said: If you like, you may keep the corpus intact and give its produce as Sadaqa. So 'Umar رضی اللہ عنہ gave it as Sadaqa declaring that property must not be sold or inherited or given away as gift. And Umar رضی اللہ عنہ devoted it to the poor, to the nearest kin, and to the emancipation of slaves, aired in the way of Allah and guests. There is no sin for one, who administers it if he eats something from it in a reasonable manner, or if he feeds his friends and does not hoard up goods (for himself). He (the narrator) said: I narrated this hadith to Muhammad, but as I reached the (words) without hoarding (for himself) out of it. he (Muhammad' said: without storing the property with a view to becoming rich. Ibn 'Aun said: He who read this book (pertaining to Waqf) informed me that in it (the words are) without storing the property with a view to becoming rich.",
                "hadithUrdu": "حضرت عمر رضی اللہ عنہ کو خیبر میں زمین ملی ، وہ اس کے بارے میں مشورہ کرنے کے لیے نبی صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کی : اے اللہ کے رسول! مجھے خیبر میں زمین ملی ہے ، مجھے کبھی کوئی ایسا مال نہیں ملا جو میرے نزدیک اس سے زیادہ عمدہ ہو ، تو آپ مجھے اس کے بارے میں کیا حکم دیتے ہیں؟ آپ نے فرمایا : \"\" اگر تم چاہو تو اس کی اصل وقف کر دو اور اس ( کی آمدنی ) سے صدقہ کرو ۔ \"\" کہا : حضرت عمر رضی اللہ عنہ نے اسے ( اس شرط کے ساتھ ) صدقہ کیا کہ اس کی اصل نہ بیچی جائے ، نہ اسے خریدا جائے ، نہ ورثے میں حاصل کی جائے اور نہ ہبہ کی جائے ۔ کہا : حضرت عمر رضی اللہ عنہ نے اس ( کی آمدنی ) کو فقراء ، اقرباء ، غلاموں ، فی سبیل اللہ ، مسافروں اور مہمانوں میں صدقہ کیا اور ( قرار دیا کہ ) اس شخص پر کوئی گناہ نہیں جو اس کا نگران ہے کہ وہ اس میں تمول حاصل کیے ( مالدار بنے ) بغیر معروف طریقے سے اس میں سے خود کھائے یا کسی دوست کو کھلائے ۔ ( ابن عون نے ) کہا : میں نے یہ حدیث محمد ( بن سیرین ) کو بیان کی ، جب میں اس جگہ \"\" اس میں تمول حاصل کیے بغیر \"\" پر پہنچا تو محمد نے ( ان الفاظ کے بجائے ) \"\" مال جمع کیے بغیر کے الفاظ کہے ۔ ابن عون نے کہا : مجھے اس شخص نے خبر دی جس نے اس کتاب ( لکھے ہوئے وصیت نامے ) کو پڑھا تھا کہ اس میں \"\" مال جمع کیے بغیر \"\" کے الفاظ ہیں.",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ التمیمی نے بیان کیا،سُلیم بن اخضر نے ہمیں ابن عون سے خبر دی ، انہوں نے نافع سے اور انہوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، أَخْبَرَنَا سُلَيْمُ بْنُ أَخْضَرَ، عَنِ ابْنِ عَوْنٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ: أَصَابَ عُمَرُ أَرْضًا بِخَيْبَرَ، فَأَتَى النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَسْتَأْمِرُهُ فِيهَا، فَقَالَ: يَا رَسُولَ اللهِ، إِنِّي أَصَبْتُ أَرْضًا بِخَيْبَرَ، لَمْ أُصِبْ مَالًا قَطُّ هُوَ أَنْفَسُ عِنْدِي مِنْهُ، فَمَا تَأْمُرُنِي بِهِ؟ قَالَ: «إِنْ شِئْتَ حَبَسْتَ أَصْلَهَا، وَتَصَدَّقْتَ بِهَا»، قَالَ: فَتَصَدَّقَ بِهَا عُمَرُ، أَنَّهُ لَا يُبَاعُ أَصْلُهَا، وَلَا يُبْتَاعُ، وَلَا يُورَثُ، وَلَا يُوهَبُ، قَالَ: فَتَصَدَّقَ عُمَرُ فِي الْفُقَرَاءِ، وَفِي الْقُرْبَى، وَفِي الرِّقَابِ، وَفِي سَبِيلِ اللهِ، وَابْنِ السَّبِيلِ، وَالضَّيْفِ، لَا جُنَاحَ عَلَى مَنْ وَلِيَهَا أَنْ يَأْكُلَ مِنْهَا بِالْمَعْرُوفِ، أَوْ يُطْعِمَ صَدِيقًا غَيْرَ مُتَمَوِّلٍ فِيهِ قَالَ: فَحَدَّثْتُ بِهَذَا الْحَدِيثِ مُحَمَّدًا، فَلَمَّا بَلَغْتُ هَذَا الْمَكَانَ: غَيْرَ مُتَمَوِّلٍ فِيهِ، قَالَ مُحَمَّدٌ: غَيْرَ مُتَأَثِّلٍ مَالًا، قَالَ ابْنُ عَوْنٍ: وَأَنْبَأَنِي مَنْ قَرَأَ هَذَا الْكِتَابَ أَنَّ فِيهِ: غَيْرَ مُتَأَثِّلٍ مَالًا.",
                "headingArabic": "الْوَقْفِ ‏‏",
                "headingUrdu": "وقف (اوقاف)",
                "headingEnglish": "Waqf (Endowment)",
                "chapterId": "26",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 126,
                    "chapterNumber": "26",
                    "chapterEnglish": "The Book Of Wills",
                    "chapterUrdu": "وصیت کے احکام و مسائل",
                    "chapterArabic": "كتاب الْوَصِيَّةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 11476,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=459",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=457",
                "label": "457",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=458",
                "label": "458",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=459",
                "label": "459",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=460",
                "label": "460",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=461",
                "label": "461",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=462",
                "label": "462",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=463",
                "label": "463",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=461",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=461",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=459",
        "to": 11500,
        "total": 40465
    }
}