{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 295,
        "data": [
            {
                "id": 7639,
                "hadithNumber": "75",
                "englishNarrator": "Al-Hasan al-Hulwānī narrated to us, he said, I heard Yazīd bin Hārūn mention Ziyād bin Maymūn, and he said:",
                "hadithEnglish": "‘I swore that I would not transmit anything from him or Khālid bin Mahdūj’. [Yazīd] said: ‘I met Ziyād bin Maymūn and asked him about a Ḥadīth, so he narrated it to me on authority of Bakr al-Muzanī, then I returned to him and he narrated [the same Ḥadīth] to me on authority of Muwarriq; then I returned to him and he narrated it to me on authority of al-Hasan.’ [Al-Hulwānī said]: ‘He [Yazīd] would charge both of them with lying [i.e. Ziyād bin Maymūn and Khālid bin Mahdūj].’ Al-Hulwānī said: ‘I heard [Ḥadīth] from Abd as-Samad and I mentioned Ziyād bin Maymūn near him and he charged him with lying’.",
                "hadithUrdu": "میں نے حلف اٹھایا ہے کہ میں اس سے اور خالد بن محدوجد سے کبھی روایت نہ کروں گا ( اور کہا : ) میں زیاد بن میمون سے ملا ، اس سے ایک حدیث سنانے کا کہا تو اس نے مجھے وہ حدیث بکرمزنی سے روایت کر کے سنائی ، پھر ( کچھ عرصے بعد ) میں دوبارہ اس کے پاس گیا تو اس نے وہی حدیث مُوَرِّق سے بیان کی ، پھر ایک بار اور اس کے پاس گیا تو اس نے وہی حدیث حسن ( بصری ) سے سنائی ۔ وہ ( یزید بن ہارون ) ان دونوں ( زیاد بن میمون اور خالد بن محدوج ) کو جھوٹ کی طرف منسوب کرتے تھے ۔ حلوانی نے کہا : میں نے عبد الصمد سے حدیث سنی اور ان کے سامنے زیاد بن میمون کا ذکر کیا تو انہوں نے اس کی نسبت جھوٹ کی طرف کی",
                "urduNarrator": "حسن حلوانی نے کہا : میں نے یزید بن ہارون سے سنا ، انہوں نے زیاد بن میمون کا ذکر کرتے ہوئے کہا",
                "hadithArabic": "وحَدَّثَنَا الْحَسَنُ الْحُلْوَانِيُّ، قَالَ: سَمِعْتُ يَزِيدَ بْنَ هَارُونَ، وَذَكَرَ زِيَادَ بْنَ مَيْمُونٍ، فَقَالَ: «حَلَفْتُ أَلَّا أَرْوِيَ عَنْهُ شَيْئًا، وَلَا عَنْ خَالِدِ بْنِ مَحْدُوجٍ» وَقَالَ: «لَقِيتُ زِيَادَ بْنَ مَيْمُونٍ، فَسَأَلْتُهُ عَنْ حَدِيثٍ، فَحَدَّثَنِي بِهِ عَنْ بَكْرٍ الْمُزَنِيِّ، ثُمَّ عُدْتُ إِلَيْهِ، فَحَدَّثَنِي بِهِ عَنْ مُوَرِّقٍ، ثُمَّ عُدْتُ إِلَيْهِ، فَحَدَّثَنِي بِهِ عَنِ الْحَسَنِ، وَكَانَ يَنْسُبُهُمَا إِلَى الْكَذِبِ‘قَالَ الْحُلْوَانِيُّ: سَمِعْتُ عَبْدَ الصَّمَدِ، «وَذَكَرْتُ عِنْدَهُ زِيَادَ بْنَ مَيْمُونٍ فَنَسَبَهُ إِلَى الْكَذِبِ»",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7640,
                "hadithNumber": "76",
                "englishNarrator": "Mahmūd bin Ghaylān narrated to us, he said, I said to Abū Dāwud at-Tayālisī:",
                "hadithEnglish": "‘You transmit a great deal on authority of Abbād bin Mansūr - so how is it that you did not hear the Ḥadīth of ‘the lady perfume seller’ from him which an-Naḍr bin Shumayl transmitted to us?’ [Abū Dāwud] said to me: ‘Be quiet, for Abd ar-Rahma bin Mahdī and I met Ziyād bin Maymūn and asked him, saying to him, ‘Are these Ḥadīth you transmit on authority of Anas?’ [Ziyād] said: ‘Have you seen a man sin and then repent- does Allah not turn to him?’ [Abū Dāwud] said: ‘We said, ‘Yes’.’ [Ziyād] said: ‘I did not hear from Anas رضی ‌اللہ ‌عنہ ‌whether a little or a lot; if the people did not know, then you two would not know that I did not meet Anas رضی ‌اللہ ‌عنہ ‌’. Abū Dāwud said: ‘So it reached us afterwards that he was transmitting [from Anas], then Abd ar-Rahman and I went to him and he said: ‘I repented’. Then afterwards he was narrating [again in the same fashion] so we abandoned him ’.",
                "hadithUrdu": "آپ نے عباد بن منصور سے بہت زیادہ روایتیں لی ہیں ، پھر کیا ہوا کہ آپ نے عطارہ والی روایت جو نضر بن شمیل نے ہمارے سامنے بیان کی ، ان سے نہیں سنی؟ انہوں نے مجھ سے کہا : خاموش رہو ، میں اور عبد الرحمن بن مہدی زیاد بن میمون سے ملے اور اس سے پوچھتے ہوئے کہا : یہ احادیث جو تم حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کرتے ہو ( کیا ہیں؟ ) تو وہ کہنے لگا : تم دونوں دیکھو کہ ایک آدمی گناہ کرتا ہے ، پھر توبہ کر لیتا ہے تو کیا اللہ اس کی توبہ قبول نہیں کرتا‍! کہا : ہم نے کہا : ہاں ۔ اس نے کہا : میں نے ان ( احادیث ) میں سے انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے کچھ نہیں سنا ، نہ کم نہ زیادہ ، اگر لوگ نہیں جانتے تو ( کیا ) تم دونوں بھی نہیں جانتے کہ میں انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے نہیں ملا! ۔ ابوداود نے کہا : پھر ہمیں یہ خبر پہنچی کہ وہ ( وہی ) روایتیں بیان کرتا ہے تو میں اور عبد الرحمن اس کے پاس آئے تو وہ کہنے لگا : میں توبہ کرتا ہوں ، پھر اس کے بعد بھی وہ وہی حدیثیں بیان کرتا تھا تو ہم نے اسے ( اس کے حال پر ) چھوڑ دیا ۔",
                "urduNarrator": "محمود بن غیلان نے کہا : میں نے ابوداود طیالسی سے کہا",
                "hadithArabic": "وحَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، قَالَ: قُلْتُ لِأَبِي دَاوُدَ الطَّيَالِسِيِّ: قَدْ أَكْثَرْتَ عَنْ عَبَّادِ بْنِ مَنْصُورٍ، فَمَا لَكَ لَمْ تَسْمَعْ مِنْهُ حَدِيثَ الْعَطَّارَةِ الَّذِي رَوَى لَنَا النَّضْرُ بْنُ شُمَيْلٍ؟ قَالَ لِيَ: اسْكُتْ، فَأَنَا لَقِيتُ زِيَادَ بْنَ مَيْمُونٍ، وَعَبْدَ الرَّحْمَنِ بْنَ مَهْدِيٍّ، فَسَأَلْنَاهُ، فَقُلْنَا لَهُ: هَذِهِ الْأَحَادِيثُ الَّتِي تَرْوِيهَا عَنْ أَنَسٍ؟ فَقَالَ: أَرَأَيْتُمَا رَجُلًا يُذْنِبُ فَيَتُوبُ، أَلَيْسَ يَتُوبُ اللهُ عَلَيْهِ؟ قَالَ: قُلْنَا: نَعَمْ، قَالَ: مَا سَمِعْتُ مِنْ أَنَسٍ مِنْ ذَا قَلِيلًا وَلَا كَثِيرًا، إِنْ كَانَ لَا يَعْلَمُ النَّاسُ فَأَنْتُمَا لَا تَعْلَمَانِ أَنِّي لَمْ أَلْقَ أَنَسًا قَالَ أَبُو دَاوُدَ: فَبَلَغَنَا بَعْدُ أَنَّهُ يَرْوِي، فَأَتَيْنَاهُ أَنَا وَعَبْدُ الرَّحْمَنِ، فَقَالَ: أَتُوبُ، ثُمَّ كَانَ بَعْدُ يُحَدِّثُ فَتَرَكْنَاهُ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7641,
                "hadithNumber": "77",
                "englishNarrator": "Hasan al-Hulwānī narrated to us, he said, I heard Shabābah say:",
                "hadithEnglish": "‘Abd ul-Quddūs was narrating to us saying,‘Suwayd bin Aqalah said…’ [when it should be ‘bin Ghafalah’] Shabābah said: ‘And I heard Abd ul-Quddūs saying, ‘The Messenger of Allah, peace and blessings of Allah upon him, prohibited taking a Rawḥ by accident’. [Shabābah] said: ‘So it was said to him, ‘What does this mean?’ [Abd ul-Quddūs] said: ‘It means to make an opening in a wall [thus letting] a breeze enter [by accident]’.’ [He changed the original Ḥadīth, switching ‘Rūḥ’ meaning ‘soul’ to ‘Rawḥ’ or ‘breeze’, and he switched ‘Gharaḍān’ meaning ‘as a target’ to ‘Arḍān’ or ‘accidentally’. All simply by changing a few letters in the words] Muslim said, I heard Ubayd Allah bin Umar al-Qawārīrī saying, I heard Hammād bin Zayd saying to a man after he sat with Mahdī bin Hilāl for days: ‘What is this salty well [i.e. useless or harmful] which has sprung up in your direction?’ He said: ‘Yes, oh Abā Ismā’īl [in agreement]’.",
                "hadithUrdu": "میں نے بعد القدوس سے سنا ، کہتا تھا : رسول اللہﷺ نے ’’رَوح کو عَرض ‘ ‘ بنانے سے منع فرمایا ہے ( کہا ) اس سے کہا گیا : اس کا کیا مطلب ہے؟ تو اس نے کہا : مطلب یہ ہے کہ دیوار میں سوراخ رکھا جائے تاکہ اس میں ہوا داخل ہو ۔ ( امام ) مسلم نے کہا : میں نے عبید اللہ بن عمر قواریری سے سنا ، کہہ رہے تھے : میں نے حماد بن زید سے سنا ، وہ ( مہدی بن ہلال کے علمی مجلس منعقد کرنے سے چند دن بعد ) ایک آدمی سے کہہ رہے تھے : یہ نمکین چشمہ کیا ہے جو آپ کی طرف سے پھوٹا ہے؟ اس نے کہا : ہاں ، اے ابواسماعیل! ( آپ کی بات ٹھیک ہے).",
                "urduNarrator": "حسن حلوانی نے بیان کیا ، کہا  میں نے شبابہ سے سنا ( کہا : عبد القدوس ہمارے سامنے حدیث بیان کرتا تھا اور کہتا تھا : سوید بن عقلہ ) شبابہ نے کہا :",
                "hadithArabic": "حَدَّثَنَا حَسَنٌ الْحُلْوَانِيُّ، قَالَ: سَمِعْتُ شَبَابَةَ، قَالَ: كَانَ عَبْدُ الْقُدُّوسِ يُحَدِّثُنَا، فَيَقُولُ: سُوَيْدُ بْنُ عَقَلَةَ قَالَ شَبَابَةُ: وَسَمِعْتُ عَبْدَ الْقُدُّوسِ، يَقُولُ: نَهَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ يُتَّخَذَ الرَّوْحُ عَرْضًا، قَالَ: فَقِيلَ لَهُ: أَيُّ شَيْءٍ هَذَا؟ قَالَ: يَعْنِي تُتَّخَذُ كُوَّةٌ فِي حَائِطٍ لِيَدْخُلَ عَلَيْهِ الرَّوْحُ قَالَ مُسْلِمٌ: وسَمِعْتُ عُبَيْدَ اللهِ بْنَ عُمَرَ الْقَوَارِيرِيَّ، يَقُولُ: سَمِعْتُ حَمَّادَ بْنَ زَيْدٍ، يَقُولُ لِرَجُلٍ بَعْدَ مَا جَلَسَ مَهْدِيُّ بْنُ هِلَالٍ بِأَيَّامٍ: «مَا هَذِهِ الْعَيْنُ الْمَالِحَةُ الَّتِي نَبَعَتْ قِبَلَكُمْ؟» قَالَ: نَعَمْ، يَا أَبَا إِسْمَاعِيلَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7642,
                "hadithNumber": "78",
                "englishNarrator": null,
                "hadithEnglish": "Al-Hasan al-Hulwānī narrated to us, he said, I heard Affān say, I heard Abū Awānah say: ‘A Ḥadīth did not reach me on authority of al-Hasan except I presented it to Abān bin Abī Ayyāsh , then he read it to me ’.",
                "hadithUrdu": "عفان نے کہا : میں نے ابو عوانہ سے سنا ، کہا : مجھے حسن ( بصری ) سے کوئی حدیث نہ پہنچی مگر میں اسے ابان بن ابی عیاش کے پاس لے گیا تو اس نے اسے میرے سامنے پڑھا",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا الْحَسَنُ الْحُلْوَانِيُّ، قَالَ: سَمِعْتُ عَفَّانَ، قَالَ: سَمِعْتُ أَبَا عَوَانَةَ، قَالَ: «مَا بَلَغَنِي عَنِ الْحَسَنِ حَدِيثٌ إِلَّا أَتَيْتُ بِهِ أَبَانَ بْنَ أَبِي عَيَّاشٍ، فَقَرَأَهُ عَلَيَّ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7643,
                "hadithNumber": "79",
                "englishNarrator": "Suwayd bin Sa’īd narrated to us, Alī bin Mus’hir narrated to us, he said: ‘Hamzah az-Zayyāt and I heard from Abān bin Abī Ayyāsh something like one thousand Ḥadīth’. Alī said:",
                "hadithEnglish": "‘So I met Hamzah then he informed me that he saw the Prophet, peace and blessings of Allah upon him, [in a dream], and he produced for him what he heard from Abān. However he [the Prophet] didn’t recognize any except a small amount [like] five or six [Ḥadīth]’.",
                "hadithUrdu": "پھر ( کچہ عرصے بعد ) میں حمزہ سے ملا تو اس نے مجھے بتایا کہ ا سنے خواب میں رسول اللہﷺ کو دیکھا تو وہ احادیث جو ابان سے سنی تھیں آپ کی خدمت میں پیش کیں ۔ آپ نے ان میں بہت معمولی حصے ، پانچ یا چھ حدیثوں کے سوا کسی چیز کو نہ پہچانا ۔",
                "urduNarrator": "ہم سے سوید بن سعید نے بیان کیا، انہوں نے بیان کیا,علی بن مسہر نے بیان کیا ، کہا  میں نے اور حمزہ زیات نے ابان بن ابی عیاش سے تقریباً ایک ہزار احادیث سنیں ۔ علی نے کہا",
                "hadithArabic": "وحَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، قَالَ: «سَمِعْتُ أَنَا وَحَمْزَةُ الزَّيَّاتُ مِنْ أَبَانَ بْنِ أَبِي عَيَّاشٍ نَحْوًا مِنْ أَلْفِ حَدِيثٍ»، قَالَ عَلِيٌّ: فَلَقِيتُ حَمْزَةَ، فَأَخْبَرَنِي «أَنَّهُ رَأَى النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي الْمَنَامِ، فَعَرَضَ عَلَيْهِ مَا سَمِعَ مِنْ أَبَانَ، فَمَا عَرَفَ مِنْهَا إِلَّا شَيْئًا يَسِيرًا خَمْسَةً أَوْ سِتَّةً»",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7644,
                "hadithNumber": "80",
                "englishNarrator": "Abd Allah bin Abd ar-Rahman ad-Dārimī narrated to us, Zakariyyā’ bin Adī informed us, he said, Abū Ishāq al-Fazarī said to me:",
                "hadithEnglish": "‘Write from Baqiyyah what he transmits on authority of those who are well-known, and do not write from him what he transmits on authority of those who are not; do not write from Ismā’īl bin Ayyāsh what he transmits on authority of those who are well-known or otherwise ’.",
                "hadithUrdu": "بقیہ سے وہی احادیث لکھو جو اس نے معروف لوگوں سے روایت کی ہیں ، وہ نہ لکھو جو اس نے غیر معروف لوگوں سے روایت کی ہیں اور اسماعیل بن عیاش سے ، جو اس نے معروف لوگوں سے روایت کیں یا غیر معروف سے ، کچھ نہ لکھو ۔",
                "urduNarrator": "ہم سے عبداللہ بن عبدالرحمٰن الدارمی نے بیان کیا، کہا ہم سے زکریا بن عدی نے بیان کیا، انہوں نے کہا مجھ سے ابو اسحاق الفزاری نے بیان کیا",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا زَكَرِيَّاءُ بْنُ عَدِيٍّ، قَالَ: قَالَ لِي أَبُو إِسْحَاقَ الْفَزَارِيُّ: «اكْتُبْ عَنْ بَقِيَّةَ، مَا رَوَى عَنِ الْمَعْرُوفِينَ، وَلَا تَكْتُبْ عَنْهُ مَا رَوَى عَنْ غَيْرِ الْمَعْرُوفِينَ، وَلَا تَكْتُبْ عَنْ إِسْمَاعِيلَ بْنِ عَيَّاشٍ، مَا رَوَى عَنِ الْمَعْرُوفِينَ، وَلَا عَنْ غَيْرِهِمْ»",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7645,
                "hadithNumber": "81",
                "englishNarrator": "Ishāq bin Ibrāhīm al-Hanthalī [bin Rāhwayh] narrated to us, he said:",
                "hadithEnglish": "I heard one of the companions of Abdullah [bin al-Mubārak] say, Ibn al-Mubārak said ‘What an excellent man is Baqiyyah, if it were not for the fact that he would provide a nickname for [those who were better-known by] the birth name, and he would provide the birth name for [those who were better-known by] a nickname. For a long time he would narrated to us on authority of Abī Sa’īd al-Wuhāthī, then when we investigated [we were surprised that] he was Abd ul-Quddūs ’.",
                "hadithUrdu": "میں نے عبد اللہ کے اصحاب ( شاگردوں ) میں سے ایک سے سنا ، کہا : ابن مبارک نے فرمایا : بقیہ اچھا آدمی ہے اگر یہ نہ ہوتا کہ وہ ناموں کو کنیتوں سے بدل دیتا ہے اور کنیتوں کو ناموں سے ۔ وہ ایک زمانے تک ہمیں ابو سعید وحاظی سے روایتیں سناتا رہا ، ہم نے اچھی طرح غور کیا تو وہ عبد القدوس نکلا ۔",
                "urduNarrator": "اسحاق بن ابراہیم حنظلی نے بیان کیا ، کہا :",
                "hadithArabic": "وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، قَالَ: سَمِعْتُ بَعْضَ أَصْحَابِ عَبْدِ اللهِ، قَالَ: قَالَ ابْنُ الْمُبَارَكِ: «نِعْمَ الرَّجُلُ بَقِيَّةُ لَوْلَا أَنَّهُ كَانَ يُكَنِّي الْأَسَامِيَ، وَيُسَمِّي الْكُنَى، كَانَ دَهْرًا يُحَدِّثُنَا عَنْ أَبِي سَعِيدٍ الْوُحَاظِيِّ فَنَظَرْنَا فَإِذَا هُوَ عَبْدُ الْقُدُّوسِ»",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7646,
                "hadithNumber": "82",
                "englishNarrator": "Ahmad bin Yūsuf al-Azdī narrated to me, he said, I heard Abd ar-Razzāq saying:",
                "hadithEnglish": "‘I did not see Ibn al-Mubārak express so plainly the charge of ‘lying’ except towards Abd ul-Quddūs; for indeed I heard him saying to him ‘[You are] a liar’.’",
                "hadithUrdu": "میں نے ابن مبارک کو ( ایسا کرتے ) نہیں دیکھا کہ وہ کھل کر اپنی یہ بات ( رائے ) کہہ دیں کہ فلاں جھوٹا ہے ، سوائے عبد القدوس کے ۔ میں نے انہیں خود یہ کہتے سنا کہ وہ جھوٹا ہے ۔",
                "urduNarrator": "مجھ سے احمد بن یوسف ایزدی نے بیان کیا، کہا: میں نے سناعبد الرزاق کہتے ہیں",
                "hadithArabic": "وحَدَّثَنِي أَحْمَدُ بْنُ يُوسُفَ الْأَزْدِيُّ، قَالَ: سَمِعْتُ عَبْدَ الرَّزَّاقِ، يَقُولُ: مَا رَأَيْتُ ابْنَ الْمُبَارَكِ يُفْصِحُ بِقَوْلِهِ كَذَّابٌ إِلَّا لِعَبْدِ الْقُدُّوسِ، فَإِنِّي سَمِعْتُهُ يَقُولُ لَهُ: «كَذَّابٌ»",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7647,
                "hadithNumber": "83",
                "englishNarrator": "Abdullah bin Abd ar-Rahman ad-Dārimī narrated to me, he said:",
                "hadithEnglish": "‘I heard Abū Nu’aym and he mentioned al-Mu’allā bin Urfān, so [Abū Nu’aym] said, [al-Mu’allā] said: ‘Abū Wā’il narrated to us, he said ‘Ibn Mas’ūd attacked us on the day of Siffīn’. So Abū Nu’aym said: ‘Do you think he was raised after death? [Ibn Mas’ūd passed away in 32 or 33H, several years before the day in question]",
                "hadithUrdu": "میں نے ابو نعیم سے سنا ( اور انہوں نے معلی بن عرفان کا ذکر کیا ) اور کہا : اس نے کہا : ہم سے ابو وائل نے بیان کیا ، کہا : صفین میں ابن مسعود ہمارے سامنے نکلے تو ابو نعیم نے کہا : ان کے بارے میں تمہاری رائے ہے کہ وہ موت کے بعد دوبارہ زندہ ہو گئے تھے؟",
                "urduNarrator": "مجھ سے عبداللہ بن عبدالرحمٰن دارمی نے بیان کیا، انہوں نے کہا: میں نے ابو نعیم کو سنا، انہوں نے معاذ بن عرفان کا ذکر کیا، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي عَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، قَالَ: سَمِعْتُ أَبَا نُعَيْمٍ، وَذَكَرَ الْمُعَلَّى بْنَ عُرْفَانَ، فَقَالَ: قَالَ: حَدَّثَنَا أَبُو وَائِلٍ، قَالَ: خَرَجَ عَلَيْنَا ابْنُ مَسْعُودٍ بِصِفِّينَ فَقَالَ أَبُو نُعَيْمٍ: «أَتُرَاهُ بُعِثَ بَعْدَ الْمَوْتِ؟»",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7648,
                "hadithNumber": "84",
                "englishNarrator": "Amr bin Alī and Hasan al-Hulwānī narrated to me, both of them on authority of Affān bin Muslim, he said:",
                "hadithEnglish": "‘We were near Ismā’īl bin Ulayyah, and a man narrated on authority of another man, so I said: ‘Indeed this is not reliable (Thabt)’. So the man said: ‘Are you backbiting him?’ Ismā’īl said: ‘He is not backbiting him; rather he is judging him unreliable’.",
                "hadithUrdu": "ہم اسماعیل بن عُلیہ کے ہاں تھے تو ایک آدمی نے ایک دوسرے آدمی سے روایت ( بیان ) کی ۔ میں نے کہا : ہ مضبوط ( ثقہ کا ہم پلہ ) نہیں ۔ تو اس آدمی نے کہا : تم نے اس کی غیبت کی ہے ۔ اسماعیل کہنے لگے : انہوں نے اس کی غیبت نہیں کی بلکہ حَکم ( فیصلہ ) بیان کیا ہے وہ ثبت نہیں ہے ۔",
                "urduNarrator": "مجھ سے عمرو بن علی اور حسن الحلوانی نے بیان کیا، ان دونوں نے عفان بن مسلم سے روایت ہے",
                "hadithArabic": "حَدَّثَنِي عَمْرُو بْنُ عَلِيٍّ، وَحَسَنٌ الْحُلْوَانِيُّ، كِلَاهُمَا عَنْ عَفَّانَ بْنِ مُسْلِمٍ، قَالَ: كُنَّا عِنْدَ إِسْمَاعِيلَ ابْنِ عُلَيَّةَ، فَحَدَّثَ رَجُلٌ عَنْ رَجُلٍ، فَقُلْتُ: إِنَّ هَذَا لَيْسَ بِثَبْتٍ، قَالَ: فَقَالَ الرَّجُلُ: اغْتَبْتَهُ، قَالَ إِسْمَاعِيلُ: «مَا اغْتَابَهُ، وَلَكِنَّهُ حَكَمَ أَنَّهُ لَيْسَ بِثَبْتٍ»",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7649,
                "hadithNumber": "85",
                "englishNarrator": "Abū Ja’far ad-Dārimī narrated to us, Bishr bin Umar narrated to us, he said: ‘I asked Mālik bin Anas about Muhammad bin Abd ar-Rahman who transmits on authority of Sa’īd bin al-Musayyib, so he said:",
                "hadithEnglish": "‘He is not trustworthy ‘. I asked him about Sālih, a freed slave of at-Taw’amah, then he said: ‘He is not trustworthy’. I asked him about Abūl-Huwayrith , and he said: ‘He is not trustworthy’. I asked him about Shu’bah on whose authority Ibn Abī Dhi’b transmitted, and he said: ‘He is not trustworthy’. I asked him about Harām bin Uthmān , and he said ‘He is not trustworthy’. I asked Mālik about these five and he said: ‘They are not trustworthy in terms of their Ḥadīth’. I asked him about another man whose name I forget just now, and he said: ‘Did you see him in my book?’ I said: ‘No’. [Then] he said: ‘If he was trustworthy you would see him in my book’.",
                "hadithUrdu": "وہ ثقہ نہیں ۔ میں نے مالک بن انس سے ابو حویرث کے بارے میں سوال کیا تو انہوں نے فرمایا : وہ ثقہ نہیں ۔ ( پھر ) میں نے ان سے اس شعبہ کے بارے میں سوال کیا جس سے ابن ابی ذئب روایت کرتے ہیں تو فرمایا : وہ ثقہ نہیں ۔ میں نے ان سے صالح مولیٰ تَواَمَہ کے بارے میں سوال کیا تو کہا : ثقہ نہیں ۔ میں نے ان سے حرام بن عثمان کے بارے میں پوچھا تو فرمایا : ثقہ نہیں ۔ میں نے امام مالک سے ان پانچوں کے بارے میں پوچھا ، انہوں نے فرمایا : یہ سب حدیث کے بیان کرنے میں ثقہ نہیں ۔ میں نے ان سے ایک اور شخص کے بارے میں پوچھا جس کا ( اب ) میں نام بھول گیا ہوں تو انہوں نے کہا : کیا تم نے میری کتابوں میں اس کا نام دیکھا ہے ۔ میں نے عرض کی : نہیں ۔ فرمایا : اگر ثقہ ہوتا تو تم اس کا ذکر میری کتابوں میں دیکھتے.",
                "urduNarrator": "ہم سے ابو جعفر دارمی نے بیان کیا، کہا کہ بشر بن عمر بنے ہم سے بیان کیا ، کہا : میں نے امام مالک بن انس سے محمد بن عبد الرحمن کے بارے میں پوچھا جو سعید بن مسیب سے احادیث روایت کرتا ہے تو انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا أَبُو جَعْفَرٍ الدَّارِمِيُّ، حَدَّثَنَا بِشْرُ بْنُ عُمَرَ، قَالَ: سَأَلْتُ مَالِكَ بْنَ أَنَسٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ الَّذِي يَرْوِي عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، فَقَالَ: «لَيْسَ بِثِقَةٍ»، وَسَأَلْتُهُ عَنْ صَالِحٍ، مَوْلَى التَّوْأَمَةِ، فَقَالَ: «لَيْسَ بِثِقَةٍ»، وَسَأَلْتُهُ عَنْ أَبِي الْحُوَيْرِثِ، فَقَالَ: «لَيْسَ بِثِقَةٍ»، وَسَأَلْتُهُ عَنْ شُعْبَةَ الَّذِي رَوَى عَنْهُ ابْنُ أَبِي ذِئْبٍ، فَقَالَ: «لَيْسَ بِثِقَةٍ»، وَسَأَلْتُهُ عَنْ حَرَامِ بْنِ عُثْمَانَ، فَقَالَ: «لَيْسَ بِثِقَةٍ»، وَسَأَلْتُ مَالِكًا عَنْ هَؤُلَاءِ الْخَمْسَةِ، فَقَالَ: «لَيْسُوا بِثِقَةٍ فِي حَدِيثِهِمْ»، وَسَأَلْتُهُ عَنْ رَجُلٍ آخَرَ نَسِيتُ اسْمَهُ، فَقَالَ: «هَلْ رَأَيْتَهُ فِي كُتُبِي؟» قُلْتُ: لَا، قَالَ: «لَوْ كَانَ ثِقَةً لَرَأَيْتَهُ فِي كُتُبِي»",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7650,
                "hadithNumber": "86",
                "englishNarrator": "Al-Faḍl bin Sahl narrated to me, he said: ‘Yahyā bin Ma’īn narrated to me, Hajjāj narrated to us:",
                "hadithEnglish": "Ibn Abī Dhi’b narrated to us on authority of Shurahbīl bin Sa’d , and he was imputed [with lying regarding Ḥadīth near the end of his life]’.",
                "hadithUrdu": "ہم سے ابن ابی ذئب نے شرحبیل بن سعد کے حوالے سے حدیث بیان کی اور وہ متہم تھا",
                "urduNarrator": "مجھ سے الفضل بن سہل نے بیان کیا، انہوں نے کہا: مجھ سے یحییٰ بن معین نے بیان کیا، ہم سے حجاج نے بیان کیا,ہم حجاج نے بیان کیا ، کہا",
                "hadithArabic": "وحَدَّثَنِي الْفَضْلُ بْنُ سَهْلٍ، قَالَ: حَدَّثَنِي يَحْيَى بْنُ مَعِينٍ، حَدَّثَنَا حَجَّاجٌ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، «عَنْ شُرَحْبِيلَ بْنِ سَعْدٍ وَكَانَ مُتَّهَمًا",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7651,
                "hadithNumber": "87",
                "englishNarrator": "Muhammad bin Abdullah bin Quhzādh narrated to me, he said, I heard Abū Ishāq at-Tālqānī saying, I heard Ibn al-Mubārak saying:",
                "hadithEnglish": "‘If I had to choose between entering Paradise and meeting Abdullah bin Muharrar, I would have chosen to meet him, then enter Paradise. Then when I saw him, dung was more preferred to me than him’.",
                "hadithUrdu": "( ایک وقت تھا ) اگر مجھے اختیار دیا جاتا کہ جنت میں داخل ہوں یا عبد اللہ بن محرر سے ملوں تو میں اس کا انتخاب کرتا کہ پہلے میں اس سے مل لوں پھر جنت میں جاؤں گا ، پھر جب میں نے اسے دیکھ لیا تو اس کے مقابلے میں ایک مینگنی بھی مجھے زیادہ محبوب تھی ۔ طالقانی کہتے ہیں : میں نے عبد اللہ بن مبارک سے سنا ، کہہ رہے تھے : ( ایک وقت تھا ) اگر مجھے اختیار دیا جاتا کہ جنت میں داخل ہوں یا عبد اللہ بن محرر سے ملوں تو میں اس کا انتخاب کرتا کہ پہلے میں اس سے مل لوں پھر جنت میں جاؤں گا ، پھر جب میں نے اسے دیکھ لیا تو اس کے مقابلے میں ایک مینگنی بھی مجھے زیادہ محبوب تھی ۔",
                "urduNarrator": "مجھ سے محمد بن عبداللہ بن قحزاد نے بیان کیا کہ میں نےابو اسحاق طالقانی کہتے ہیں : میں نے عبد اللہ بن مبارک سے سنا ، کہہ رہے تھے",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ قُهْزَاذَ، قَالَ: سَمِعْتُ أَبَا إِسْحَاقَ الطَّالْقَانِيَّ، يَقُولُ: سَمِعْتُ ابْنَ الْمُبَارَكِ، يَقُولُ: «لَوْ خُيِّرْتُ بَيْنَ أَنْ أَدْخُلَ الْجَنَّةَ، وَبَيْنَ أَنْ أَلْقَى عَبْدَ اللهِ بْنَ مُحَرَّرٍ لَاخْتَرْتُ أَنْ أَلْقَاهُ، ثُمَّ أَدْخُلَ الْجَنَّةَ، فَلَمَّا رَأَيْتُهُ كَانَتْ بَعْرَةٌ أَحَبَّ إِلَيَّ مِنْهُ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7652,
                "hadithNumber": "88",
                "englishNarrator": "Al-Faḍl bin Sahl narrated to me, Walīd bin Sālih narrated to us, he said, Ubayd Allah bin Amr said, Zayd- meaning Ibn Abī Unaysah – said:",
                "hadithEnglish": "‘Do not take [Ḥadīth] from my brother ’.",
                "hadithUrdu": "میرے بھائی ( یحییٰ بن ابی انیسہ ) سے روایت نہ لو ۔",
                "urduNarrator": "مجھ سے الفضل بن سہل نے بیان کیا،ولید بن صالح نے بیان کیا ابواسحاق ، کہا : عبید اللہ بن عمرو نے کہا : زید ، یعنی ابن ابی انیسہ نے کہا :",
                "hadithArabic": "وحَدَّثَنِي الْفَضْلُ بْنُ سَهْلٍ، حَدَّثَنَا وَلِيدُ بْنُ صَالِحٍ، قَالَ: قَالَ عُبَيْدُ اللهِ بْنُ عَمْرٍو، قَالَ زَيْدٌ يَعْنِي ابْنَ أَبِي أُنَيْسَةَ: «لَا تَأْخُذُوا عَنْ أَخِي",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7653,
                "hadithNumber": "89",
                "englishNarrator": "Ahmad bin Ibrāhīm ad-Dawraqī narrated to me, he said, Abd us-Salām al-Wābisī narrated to me, he said, Abdullah bin Ja’far ar-Raqqī narrated to me, on authority of Ubaydullah bin Amr, he said:",
                "hadithEnglish": "‘Yahyā bin Abī Unaysah was a liar’.",
                "hadithUrdu": "یحییٰ بن ابی انیسہ جھوٹا تھا ۔",
                "urduNarrator": "مجھ سے احمد بن ابراہیم الدرقی نے بیان کیا، انہوں نے کہا: مجھ سے عبدالسلام وبیسی نے بیان کیا، انہوں نے کہا: مجھ سے عبد اللہ بن جعفر رقی نے عبید اللہ بن عمرو کے حوالے سے بیان کیا ، کہا :",
                "hadithArabic": "حَدَّثَنِي أَحْمَدُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، قَالَ: حَدَّثَنِي عَبْدُ السَّلَامِ الْوَابِصِيُّ، قَالَ: حَدَّثَنِي عَبْدُ اللهِ بْنُ جَعْفَرٍ الرَّقِّيُّ، عَنْ عُبَيْدِ اللهِ بْنِ عَمْرٍو، قَالَ: «كَانَ يَحْيَى بْنُ أَبِي أُنَيْسَةَ كَذَّابًا",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7654,
                "hadithNumber": "90",
                "englishNarrator": "Ahmad bin Ibrāhīm narrated to me, he said, Sulaymān bin Harb narrated to me, on authority of Hammād bin Zayd, he said, Farqad was mentioned near Ayyūb, so he said:",
                "hadithEnglish": "‘Indeed Farqad is not a companion of Ḥadīth’.",
                "hadithUrdu": "فرقد حدیث ( کی مہارت رکھنے ) والا نہیں ۔",
                "urduNarrator": "مجھ سے احمد بن ابراہیم نے بیان کیا، انہوں نے کہا: مجھ سے سلیمان بن حرب نے حماد بن زید سے روایت ہے ، کہا ایوب سختیانی کے سامنے فرقد کا ذکر کیا گیا تو انہوں نے کہا",
                "hadithArabic": "حَدَّثَنِي أَحْمَدُ بْنُ إِبْرَاهِيمَ، قَالَ: حَدَّثَنِي سُلَيْمَانُ بْنُ حَرْبٍ، عَنْ حَمَّادِ بْنِ زَيْدٍ، قَالَ: ذُكِرَ فَرْقَدٌ عِنْدَ أَيُّوبَ، فَقَالَ: «إِنَّ فَرْقَدًا لَيْسَ صَاحِبَ حَدِيثٍ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7655,
                "hadithNumber": "91",
                "englishNarrator": "Abd ur-Rahman bin Bishr al-Abdī narrated to me, he said, I heard Muhammad bin Abd Allah bin Ubayd bin Umayr al-Laythī was mentioned near Yahyā bin Sa’īd al-Qattān, so he weakened him severely. Then it was said to Yahyā:",
                "hadithEnglish": "‘More weak than Ya’qūb bin Atā ’?’ He said: ‘Yes’. Then he said: ‘I did not see anyone transmitting on authority of Muhammad bin Abdullah bin Ubayd bin Umayr’.",
                "hadithUrdu": "’’یعقوب بن عطاء سے زیادہ کمزور؟‘‘ ہاں ۔ پھر کہا :میں نہیں سمجھتا کہ کوئی ایک انسان بھی محمد بن عبد اللہ بن عبید بن عمیر سے روایت کر سکتا ہے ۔",
                "urduNarrator": "مجھ سے عبد الرحمان بن بشر عبدی نے بیان کیا ، کہا : میں نے یحییٰ بن سعیدقطان سے سنا ، جب ان کے سامنے محمد بن عبد اللہ بن عبید بن عمیر لیثی کا ذکر کیا گیا تو انہوں نے اسے انتہائی ضعیف قرار دیا ۔ ( امام ) یحییٰ سے کہا گیا :",
                "hadithArabic": "وحَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ بِشْرٍ الْعَبْدِيُّ، قَالَ: سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ الْقَطَّانَ، ذُكِرَ عِنْدَهُ مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ عُبَيْدِ بْنِ عُمَيْرٍ اللَّيْثِيُّ فَضَعَّفَهُ جِدًّا، فَقِيلَ لِيَحْيَى: أَضْعَفُ مِنْ يَعْقُوبَ بْنِ عَطَاءٍ؟ قَالَ: «نَعَمْ»، ثُمَّ قَالَ: «مَا كُنْتُ أَرَى أَنَّ أَحَدًا يَرْوِي عَنْ مُحَمَّدِ بْنِ عَبْدِ اللهِ بْنِ عُبَيْدِ بْنِ عُمَيْرٍ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7656,
                "hadithNumber": "92",
                "englishNarrator": "Bishr bin al-Hakam narrated to me, he said, I heard Yahyā bin Sa’īd al-Qattān weaken Hakīm bin Jubayr and Abd al-A’lā; and he weakened Yahyā Mūsā bin Dīnār [there is no ‘bin’ between ‘Yahyā’ and ‘Mūsā’]; [Yahyā] said:",
                "hadithEnglish": "‘His Ḥadīth are Rīh or ‘wind’ [i.e., not established and weak]. [Yahyā] weakened Mūsā bin Dihqān and Īsā bin Abī Īsā al-Madanī. [Muslim] said, ‘I heard al-Hasan bin Īsā saying ‘Ibn al-Mubārak said to me: ‘When you go to Jarīr then write down all of his knowledge except the Ḥadīth of 3 [people] - do not write the Ḥadīth of Ubaydah bin Mu’attib, as-Sarī bin Ismā’īl, or Muhammad bin Sālim’.’",
                "hadithUrdu": "اس کی ( بیان کردہ ) حدیث ہوا ( جیسی ) ہے اور موسیٰ بن دہقان اور عیسیٰ ابی عیسیٰ مدنی کو ( بھی ) ضعیف قرار دیا ۔ کہا : اور میں نے حسن بن عیسیٰ سے سنا ، کہہ رہے تھے : مجھ سے ابن مبارک نے فرمایا : تم جب جریر کے پاس پہنچو تو تین ( راویوں ) کی احادیث کے سوا اس کا سارا علم لکھ لینا ۔ عبیدہ بن معتب ، سری بن اسماعیل اور محمد بن سالم کی احادیث اس سے نہ لکھنا ۔",
                "urduNarrator": "بشر بن حکم نے بیان کیا ، کہا : میں نے یحییٰ بن سعید قطان سے سنا ، انہوں نے حکیم بن جبیر اور عبد الاعلیٰ کو ضعیف قرار دیا اور ( اسی طرح ) یحییٰ نے موسیٰ بن دینار کو بھی ضعیف قرار دیا ( اور ) کہا :",
                "hadithArabic": "حَدَّثَنِي بِشْرُ بْنُ الْحَكَمِ، قَالَ: سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ الْقَطَّانَ، ضَعَّفَ حَكِيمَ بْنَ جُبَيْرٍ، وَعَبْدَ الْأَعْلَى، وَضَعَّفَ يَحْيَى بْنَ مُوسَى بْنَ دِينَارٍ قَالَ: «حَدِيثُهُ رِيحٌ». وَضَعَّفَ مُوسَى بْنَ دِهْقَانَ، وَعِيسَى بْنَ أَبِي عِيسَى الْمَدَنِيَّ قَالَ: وَسَمِعْتُ الْحَسَنَ بْنَ عِيسَى، يَقُولُ: قَالَ لِي ابْنُ الْمُبَارَكِ: «إِذَا قَدِمْتَ عَلَى جَرِيرٍ فَاكْتُبْ عِلْمَهُ كُلَّهُ إِلَّا حَدِيثَ ثَلَاثَةٍ، لَا تَكْتُبْ حَدِيثَ عُبَيْدَةَ بْنِ مُعَتِّبٍ، وَالسَّرِيِّ بْنِ إِسْمَاعِيلَ، وَمُحَمَّدِ بْنِ سَالِمٍ»",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "0",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 100,
                    "chapterNumber": "0",
                    "chapterEnglish": "Introduction",
                    "chapterUrdu": "مقدمہ",
                    "chapterArabic": "كتاب مُقَدِّمَةٌ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7657,
                "hadithNumber": "93",
                "englishNarrator": "It is narrated on the authority of Yahya bin Ya'mur:",
                "hadithEnglish": "The first man who discussed qadr (Divine Decree) in Basra was Ma'bad al-Juhani. I along with Humaid bin 'Abdur-Rahman Himyari set out for pilgrimage or for 'Umrah and said: Should it so happen that we come into contact with one of the Companions of the Messenger of Allah (peace be upon him) we shall ask him about what is talked about taqdir (Divine Decree). Accidentally we came across Abdullah ibn Umar ibn al-Khattab رضی ‌اللہ ‌عنہ ‌, while he was entering the mosque. My companion and I surrounded him. One of us (stood) on his right and the other stood on his left. I expected that my companion would authorize me to speak. I therefore said: Abu Abdur Rahman! There have appeared some people in our land who recite the Qur'an and pursue knowledge. And then after talking about their affairs, added: They (such people) claim that there is no such thing as Divine Decree and events are not predestined. He (Abdullah Ibn Umar) said: When you happen to meet such people tell them that I have nothing to do with them and they have nothing to do with me. And verily they are in no way responsible for my (belief). Abdullah Ibn Umar رضی ‌اللہ ‌عنہ ‌swore by Him (the Lord) (and said): If any one of them (who does not believe in the Divine Decree) had with him gold equal to the bulk of (the mountain) Uhud and spent it (in the way of Allah), Allah would not accept it unless he affirmed his faith in Divine Decree. He further said: My father, Umar Ibn al-Khattab, told me: One day we were sitting in the company of Allah's Apostle (peace be upon him) when there appeared before us a man dressed in pure white clothes, his hair extraordinarily black. There were no signs of travel on him. None amongst us recognized him. At last he sat with the Apostle (peace be upon him) He knelt before him placed his palms on his thighs and said: Muhammad, inform me about al-Islam. The Messenger of Allah (peace be upon him) said: Al-Islam implies that you testify that there is no god but Allah and that Muhammad is the messenger of Allah, and you establish prayer, pay Zakat, observe the fast of Ramadan, and perform pilgrimage to the (House) if you are solvent enough (to bear the expense of) the journey. He (the inquirer) said: You have told the truth. He (Umar ibn al-Khattab) said: It amazed us that he would put the question and then he would himself verify the truth. He (the inquirer) said: Inform me about Iman (faith). He (the Holy Prophet ﷺ) replied: That you affirm your faith in Allah, in His angels, in His Books, in His Apostles, in the Day of Judgment, and you affirm your faith in the Divine Decree about good and evil. He (the inquirer) said: You have told the truth. He (the inquirer) again said: Inform me about al-Ihsan (performance of good deeds). He (the Holy Prophet ﷺ) said: That you worship Allah as if you are seeing Him, for though you don't see Him, He, verily, sees you. He (the enquirer) again said: Inform me about the hour (of the Doom). He (the Holy Prophet ﷺ) remarked: One who is asked knows no more than the one who is inquiring (about it). He (the inquirer) said: Tell me some of its indications. He (the Holy Prophet  ﷺ) said: That the slave-girl will give birth to her mistress and master, that you will find barefooted, destitute goat-herds vying with one another in the construction of magnificent buildings. He (the narrator, Umar Ibn al-Khattab رضی ‌اللہ ‌عنہ ‌) said: Then he (the inquirer) went on his way but I stayed with him (the Holy Prophet ﷺ) for a long while. He then, said to me: Umar رضی ‌اللہ ‌عنہ ‌, do you know who this inquirer was? I replied: Allah and His Apostle knows best. He (the Holy Prophet ﷺ) remarked: He was Gabriel (the angel). He came to you in order to instruct you in matters of religion.",
                "hadithUrdu": "سب سے پہلا شخص جس نے بصرہ میں تقدیر ( سے انکار ) کی بات کی ، معبد جہنی تھا میں ( یحیی ) اور حمید بن عبد الرحمن خمیری حج یا عمرے کے ارادے سے نکلے ، ہم نے ( آپس میں ) کہا : کاش! رسول اللہ ﷺ کے صحابہ میں سے کسی کے ساتھ ہماری ملاقات ہو جائے تو ہم ان سے تقدیر کے بارے میں ان ( آج کل کے ) لوگوں کی کہی ہوئی باتوں کے متعلق دریافت کر لیں ۔ توفیق الہٰی سے ہمیں حضرت عبد اللہ بن عمر بن خطاب ‌رضی ‌اللہ ‌عنہ ‌ ‌ مسجد میں داخل ہوتے ہوئے مل گئے ۔ میں اور میرے ساتھ نے ان کے درمیان میں لے لیا ، ایک ان کی دائیں طرف تھا اور دوسرا ان کی بائیں طرف ۔ مجھے اندازہ تھا کہ میرا ساتھی گفتگو ( کامعاملہ ) میرے سپرد کرے گا ، چنانچہ میں نے عرض کی : اے ابو عبدالرحمن ! ( یہ عبد اللہ بن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی کنیت ہے ) واقعہ یہ ہے کہ ہماری طرف کچھ ایسے لوگ ظاہر ہوئے جو قرآن مجید پڑھتے ہیں اور علم حاصل کرتے ہیں ( اور ان کے حالات بیان کیے ) ان لوگوں کا خیال ہے کہ تقدیر کچھ نہیں ، ( ہر ) کام نئے سرے سے ہو رہا ہے ( پہلے اس بارے میں نہ کچھ طے ہے ، نہ اللہ کا اس کاعلم ہے ۔ ) ابن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے فرمایا : جب تمہاری ان لوگوں سے ملاقات ہو تو انہیں بتا دینا کہ میں ان سے بری ہوں اور وہ مجھ سے بری ہیں ۔ اس ( ذات ) کی قسم جس ( کے نام ) کے ساتھ عبد اللہ بن عمر حلف اٹھاتا ہے ! اگر ان میں سے کسی کو پاس احد پہاڑ کے برابر سونا ہو اور وہ اسے خرچ ( بھی ) کر دے تو اللہ تعالیٰ اس کی طرف سے اس کوقبول نہیں فرمائے گا یہاں تک کہ وہ تقدیر پر ایمان لے آئے ، پھر کہا : مجھے میرے والد عمر بن خطاب ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے بتایا : ایک دن ہم رسول ا للہ ﷺ کی خدمت میں حاضر تھے کہ اچانک ایک شخص ہمارے سامنے نمودار ہوا ۔ اس کے کپڑے انتہائی سفید اوربا ل انتہائی سیاہ تھے ۔ اس پر سفر کا کوئی اثر دکھائی دیتا تھا نہ ہم میں سے کوئی اسے پہچانتا تھا حتیٰ کہ وہ آ کر نبی اکرمﷺ کے پاس بیٹھ گیا اور اپنے گھٹنے آپ کے گھٹنوں سے ملا دیے ، اور اپنے ہاتھ آپﷺ کی را نوں پر رکھ دیے ، اور کہا : اے محمد ( ﷺ ) ! مجھے اسلام کے بارے میں بتائیے ۔ رسول اللہ ﷺ نے فرمایا : ’’اسلام یہ ہے کہ تم اس بات کی گواہی دو کہ اللہ تعالیٰ کے سوا کوئی عبادت کےلائق نہیں اور محمدﷺ اس کے رسول ہیں ، نماز کا اہتمام کرو ، زکاۃ ادا کرو ، رمضان کے روزے رکھو اور اگر اللہ کے گھر تک راستہ ( طے کرنے ) کی استطاعت ہو تو اس کا حج کرو ۔ ‘ ‘ اس نے کہا : آپ نے سچ فرمایا ۔ ( حضرت عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ) کہا : ہمیں اس پر تعجب ہوا کہ آپ سے پوچھتا ہے اور ( خود ہی ) آپ کی تصدیق کرتا ہے ۔ اس نے کہا : مجھے ایمان کے بارے میں بتائیے ۔ آپ نے فرمایا : ’’یہ کہ تم اللہ تعالیٰ ، اس کے فرشتوں ، اس کی کتابوں ، اس کے رسولوں اور آخری دن ( یوم قیامت ) پر ایمان رکھو اور اچھی اور بری تقدیر پر بھی ایمان لاؤ ۔ ‘ ‘ اس نے کہا : آپ نے درست فرمایا ۔ ( پھر ) اس نے کہا : مجھے احسان کے بارے میں بتائیے ۔ آپ نے فرمایا : یہ کہ تم اللہ تعالیٰ کی عبادت اس طرح کرو گویا تم اسے دیکھ رہے ہو اور اگر تم اسے نہیں دیکھ رہے تو وہ تمہیں دیکھ رہا ہے ۔ ‘ ‘ اس نے کہا : تومجھے قیات کے بارے میں بتائیے ۔ آپ نے فرمایا : ’’جس سے اس ( قیامت ) کے بارے میں سوال کیا جا رہا ہے ، وہ پوچھنے والے سے زیادہ نہیں جانتا ۔ ‘ ‘ اس نے کہا : تو مجھے اس کی علامات بتا دیجیے ۔ آپ نے فرمایا : ’’ ( علامات یہ ہیں کہ ) لونڈی اپنی مالکہ کو جنم دے اور یہ کہ تم ننگے پاؤں ، ننگے بدن ، محتاج ، بکریاں چرانے والوں کو دیکھو کہ وہ اونچی سے اونچی عمارتیں بنانے میں ایک دوسرے کے ساتھ مقابلہ کر رہے ہیں ۔ ‘ ‘ حضرت عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نےکہا : پھر وہ سائل چلا گیا ، میں کچھ دیر اسی عالم میں رہا ، پھر آپ ﷺ نے مجھ سے کہا : ’’اے عمر !تمہیں معلوم ہے کہ پوچھنے والا کون تھا؟ ‘ ‘ میں نے عرض کی : اللہ اور اس کا رسول زیادہ آگاہ ہیں ۔ آپﷺ نے فرمایا : ’’وہ جبرئیل تھے ، تمہارے پاس آئے تھے ، تمہیں تمہارا دین سکھا رہے تھے ۔ ‘ ‘",
                "urduNarrator": "مجھ سے ابو خیثمہ نے بیان کیا، ان سے زہیر بن حرب نے، ہم سے وکیع نے سرگوشی کی سند سے بیان کیا,کہمس سے ا بن بریدہ سے ، انہوں نے یحیی بن یعمر سےروایت کی ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنِي أَبُو خَيْثَمَةَ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا وَكِيعٌ، عَنْ كَهْمَسٍ، عَنْ عَبْدِ اللهِ بْنِ بُرَيْدَةَ، عَنْ يَحْيَى بْنِ يَعْمَرَ، ح وحَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ - وَهَذَا حَدِيثُهُ - حَدَّثَنَا أَبِي، حَدَّثَنَا كَهْمَسٌ، عَنِ ابْنِ بُرَيْدَةَ، عَنْ يَحْيَى بْنِ يَعْمَرَ، قَالَ: كَانَ أَوَّلَ مَنْ قَالَ فِي الْقَدَرِ بِالْبَصْرَةِ مَعْبَدٌ الْجُهَنِيُّ، فَانْطَلَقْتُ أَنَا وَحُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ الْحِمْيَرِيُّ حَاجَّيْنِ - أَوْ مُعْتَمِرَيْنِ - فَقُلْنَا: لَوْ لَقِينَا أَحَدًا مَنْ أَصْحَابِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَسَأَلْنَاهُ عَمَّا يَقُولُ هَؤُلَاءِ فِي الْقَدَرِ، فَوُفِّقَ لَنَا عَبْدُ اللهِ بْنُ عُمَرَ بْنِ الْخَطَّابِ دَاخِلًا الْمَسْجِدَ، فَاكْتَنَفْتُهُ أَنَا وَصَاحِبِي أَحَدُنَا عَنْ يَمِينِهِ، وَالْآخَرُ عَنْ شِمَالِهِ، فَظَنَنْتُ أَنَّ صَاحِبِي سَيَكِلُ الْكَلَامَ إِلَيَّ، فَقُلْتُ [ص:37]: أَبَا عَبْدِ الرَّحْمَنِ إِنَّهُ قَدْ ظَهَرَ قِبَلَنَا نَاسٌ يَقْرَءُونَ الْقُرْآنَ، وَيَتَقَفَّرُونَ الْعِلْمَ، وَذَكَرَ مِنْ شَأْنِهِمْ، وَأَنَّهُمْ يَزْعُمُونَ أَنْ لَا قَدَرَ، وَأَنَّ الْأَمْرَ أُنُفٌ، قَالَ: «فَإِذَا لَقِيتَ أُولَئِكَ فَأَخْبِرْهُمْ أَنِّي بَرِيءٌ مِنْهُمْ، وَأَنَّهُمْ بُرَآءُ مِنِّي»، وَالَّذِي يَحْلِفُ بِهِ عَبْدُ اللهِ بْنُ عُمَرَ «لَوْ أَنَّ لِأَحَدِهِمْ مِثْلَ أُحُدٍ ذَهَبًا، فَأَنْفَقَهُ مَا قَبِلَ اللهُ مِنْهُ حَتَّى يُؤْمِنَ بِالْقَدَرِ» ثُمَّ قَالَ: حَدَّثَنِي أَبِي عُمَرُ بْنُ الْخَطَّابِ قَالَ: بَيْنَمَا نَحْنُ عِنْدَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ذَاتَ يَوْمٍ، إِذْ طَلَعَ عَلَيْنَا رَجُلٌ شَدِيدُ بَيَاضِ الثِّيَابِ، شَدِيدُ سَوَادِ الشَّعَرِ، لَا يُرَى عَلَيْهِ أَثَرُ السَّفَرِ، وَلَا يَعْرِفُهُ مِنَّا أَحَدٌ، حَتَّى جَلَسَ إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَأَسْنَدَ رُكْبَتَيْهِ إِلَى رُكْبَتَيْهِ، وَوَضَعَ كَفَّيْهِ عَلَى فَخِذَيْهِ، وَقَالَ: يَا مُحَمَّدُ أَخْبِرْنِي عَنِ الْإِسْلَامِ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الْإِسْلَامُ أَنْ تَشْهَدَ أَنْ لَا إِلَهَ إِلَّا اللهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَتُقِيمَ الصَّلَاةَ، وَتُؤْتِيَ الزَّكَاةَ، وَتَصُومَ رَمَضَانَ، وَتَحُجَّ الْبَيْتَ إِنِ اسْتَطَعْتَ إِلَيْهِ سَبِيلًا»، قَالَ: صَدَقْتَ، قَالَ: فَعَجِبْنَا لَهُ يَسْأَلُهُ، وَيُصَدِّقُهُ، قَالَ: فَأَخْبِرْنِي عَنِ الْإِيمَانِ، قَالَ: «أَنْ تُؤْمِنَ بِاللهِ، وَمَلَائِكَتِهِ، وَكُتُبِهِ، وَرُسُلِهِ، وَالْيَوْمِ الْآخِرِ، وَتُؤْمِنَ بِالْقَدَرِ خَيْرِهِ وَشَرِّهِ»، قَالَ: صَدَقْتَ، قَالَ: فَأَخْبِرْنِي عَنِ الْإِحْسَانِ، قَالَ: «أَنْ تَعْبُدَ اللهَ كَأَنَّكَ تَرَاهُ، فَإِنْ لَمْ تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاكَ»، قَالَ: فَأَخْبِرْنِي عَنِ السَّاعَةِ، قَالَ: «مَا الْمَسْئُولُ عَنْهَا بِأَعْلَمَ مِنَ السَّائِلِ» قَالَ: فَأَخْبِرْنِي عَنْ أَمَارَتِهَا، قَالَ: «أَنْ تَلِدَ الْأَمَةُ رَبَّتَهَا، وَأَنْ تَرَى الْحُفَاةَ الْعُرَاةَ الْعَالَةَ رِعَاءَ الشَّاءِ يَتَطَاوَلُونَ فِي الْبُنْيَانِ»، قَالَ: ثُمَّ انْطَلَقَ فَلَبِثْتُ مَلِيًّا، ثُمَّ قَالَ لِي: «يَا عُمَرُ أَتَدْرِي مَنِ السَّائِلُ؟» قُلْتُ: اللهُ وَرَسُولُهُ أَعْلَمُ، قَالَ: «فَإِنَّهُ جِبْرِيلُ أَتَاكُمْ يُعَلِّمُكُمْ دِينَكُمْ»",
                "headingArabic": "بيان الإيمان والإسلام والإحسان ووجوب الإيمان بإثبات قدر الله سبحانه وتعالى وبيان الدليل على التبري ممن لا يؤمن بالقدر وإغلاظ القول في حقه",
                "headingUrdu": "الایمان، الاسلام اور الاحسان اور ایمان کے فرائض کو اللہ کی قدر کے اثبات کے ساتھ بیان کرنا، وہ بزرگ و برتر ہے۔ اور القدر کو نہ ماننے والے کے بے گناہ ہونے کے ثبوت کی وضاحت اور اس کے معاملے میں سخت نظر رکھنا",
                "headingEnglish": "Explaining Al-Iman (Faith), Al-Islam, and Al-Ihsan, and The Obligations of Al-Iman With Affirmation of The Qadar of Allah, Glorious And Most High is He. And Explaining The Evidence For Declaring One's Innocence Of One Who Does Not Believe In Al-Qadar, And Having A Harsh View Of His Case",
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7658,
                "hadithNumber": "94",
                "englishNarrator": "It is narrated on the authority of Yahya b. Ya'mur that:",
                "hadithEnglish": "When Ma'bad discussed the problem pertaining to Divine Decree, we refuted that. He (the narrator) said I and Humaid b. Abdur-Rahman Himyari argued. And they carried on the conversation about the purport of the hadith related by Kahmas and its chain of transmission too, and there is some variation of words.",
                "hadithUrdu": "جب معبد ( جہنی ) نے تقدیر کے بارے میں وہ ( سب ) کہا جو کہا ، تو ہم نے اسے سخت ناپسند کیا ( یحییٰ نے کہا ) میں اور حمید بن عبد الرحمٰن حمیری نے حج کیا .... اس کے بعد انہوں نے کہمس کے واسطے سے بیان کردہ حدیث کے مطابق حدیث بیان کی ، البتہ الفاظ میں کچھ کمی بیشی ہے",
                "urduNarrator": "مجھ سے محمد بن عبید الغباری، ابو کامل الجہدری اور احمد بن عبدہ نے بیان کیا، انہوں نے کہا: ہم سے حماد بن زید نے مطر الوراق سے اور بد اللہ بن بریدہ کی سند سے بیان کیا۔ یحییٰ بن  یعمر  کی سند پر، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ عُبَيْدٍ الْغُبَرِيُّ، وَأَبُو كَامِلٍ الْجَحْدَرِيُّ، وَأَحْمَدُ بْنُ عَبْدَةَ قَالُوا: حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ مَطَرٍ الْوَرَّاقِ، عَنْ عَبْدِ اللهِ بْنِ بُرَيْدَةَ، عَنْ يَحْيَى بْنِ يَعْمَرَ، قَالَ: لَمَّا تَكَلَّمَ مَعْبَدٌ بِمَا تَكَلَّمَ بِهِ فِي شَأْنِ الْقَدَرِ أَنْكَرْنَا ذَلِكَ، قَالَ: فَحَجَجْتُ أَنَا وَحُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ الْحِمْيَرِيُّ حَجَّةً، وَسَاقُوا الْحَدِيثَ بِمَعْنَى حَدِيثِ كَهْمَسٍ وَإِسْنَادِهِ، وَفِيهِ بَعْضُ زِيَادَةٍ وَنُقْصَانُ أَحْرُفٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7659,
                "hadithNumber": "95",
                "englishNarrator": "It is narrated on the authority of Yahya bin Ya'mur and Humaid bin 'Abdur-Rahman that they said:",
                "hadithEnglish": "We met Abdullah bin 'Umar رضی ‌اللہ ‌عنہ and we discussed about the Divine Decree, and what they talked about it and he narrated the hadith that has been transmitted by 'Umar رضی ‌اللہ ‌عنہ from the Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). There is a slight variation in that.",
                "hadithUrdu": "ہم عبد اللہ بن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے ملے اور ہم سے تقدیر کی بات کی اور وہ لوگ ( منکرین تقدیر ) جو کچھ کہتے ہیں ، اس کا ذکر کیا ۔ اس کے بعد ( عثمان بن غیاث نے ) سابقہ راویوں کے مطابق حضرت عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے مرفوعاً روایت کی ۔ اس روایت میں کچھ الفاظ زیادہ ہیں اور کچھ انہوں نے کم کیے ہیں ۔",
                "urduNarrator": "مجھ سے محمد بن حاتم نے بیان کیا، ہم سے یحییٰ بن سعید القطان نے بیان کیا، ہم سے ( عبد اللہ بن بریدہ کے ایک تیسرے شاگرد ) عثمان بن غیاث نے یحییٰ بن یعمر اور حمید بن عبد الرحمٰن دونوں سے روایت کی ، دونوں نےکہا :",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ، حَدَّثَنَا عُثْمَانُ بْنُ غِيَاثٍ، حَدَّثَنَا عَبْدُ اللهِ بْنُ بُرَيْدَةَ، عَنْ يَحْيَى بْنِ يَعْمَرَ، وَحُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ قَالَا: لَقِينَا عَبْدَ اللهِ بْنَ عُمَرَ، فَذَكَرْنَا الْقَدَرَ، وَمَا يَقُولُونَ فِيهِ، فَاقْتَصَّ الْحَدِيثَ كَنَحْوِ حَدِيثِهِمْ، عَنْ عُمَرَ رَضِيَ اللهُ عَنْهُ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَفِيهِ شَيْءٌ مِنْ زِيَادَةٍ وَقَدْ نَقَصَ مِنْهُ شَيْئًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7660,
                "hadithNumber": "96",
                "englishNarrator": null,
                "hadithEnglish": "A similar Hadith was narrator from Yahya bin Ya'mar, from Ibn 'Umar رضی ‌اللہ ‌عنہ ‌, from the prophet ﷺ.",
                "hadithUrdu": "مجھ سے حجاج بن الشعر نے بیان کیا، ہم سے یونس بن محمد نے بیان کیا، ہم سےمعتمر کے والد ( سلیمان بن طرخان ) نے یحییٰ بن یعمر سے ، انہوں نے عبد اللہ بن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے ، انہوں نے حضرت عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انہوں نے نبی ﷺ سے اسی طرح روایت کی جس طرح مذکورہ اساتذہ نے روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، حَدَّثَنَا الْمُعْتَمِرُ، عَنْ أَبِيهِ، عَنْ يَحْيَى بْنِ يَعْمَرَ، عَنِ ابْنِ عُمَرَ، عَنْ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِ حَدِيثِهِمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7661,
                "hadithNumber": "97",
                "englishNarrator": null,
                "hadithEnglish": "Abu Huraira reported: One day the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) appeared before the public that a man came to him and said: Prophet of Allah, (tell me) what is Iman. Upon this he (the Holy Prophet) replied: That you affirm your faith in Allah, His angels, His Books, His meeting, His Messengers and that you affirm your faith in the Resurrection hereafter. He (again) said: Messenger of Allah, (tell me) what does al-Islam signify. He (the Holy Prophet) replied: Al-Islam signifies that you worship Allah and do not associate anything with Him and you establish obligatory prayer and you pay the obligatory poor-rate (Zakat) and you observe the fast of Ramadan. He (the inquirer) again said: Messenger of Allah, what does al-Ihsan imply? He (the Holy Prophet) replied: That you worship Allah as if you are seeing Him, and in case you fail to see Him, then observe prayer (with this idea in your mind) that (at least) He is seeing you. He (the inquirer ) again said: Messenger of Allah, when would there be the hour (of Doom)? He (the Holy Prophet) replied: The one who is asked about it is no better informed than the inquirer. I, however, narrate some of its signs (and these are): when the slave-girl will give birth to he master, when the naked, barefooted would become the chiefs of the people - these are some of the signs of (Doom). (Moreover) when the shepherds of the black (camels) would exult themselves in buildings, this is one of the signs of (Doom). (Doom) is one of the five (happenings wrapped in the unseen) which no one knows but Allah. Then he (the Messenger of Allah) recited (the verse): Verily Allah! with Him alone is the knowledge of the hour and He it is Who sends (down the rain) and knows that which is in the wombs and no person knows whatsoever he shall earn tomorrow, and a person knows not in whatsoever land he shall die. Verily Allah is Knowing, Aware. He (the narrator, Abu Huraira) said: Then the person turned back and went away. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Bring that man back to me. They (the Companions of the Prophet present there) went to bring him back, but they saw nothing there. Upon this the Messenger of Allah remarked: he was Gabriel, who came to teach the people their religion",
                "hadithUrdu": "اسماعیل بن ابراہیم ( ابن علیہ ) نے ابو حیان سے ، انہوں نے ابو زرعہ بن عمرو بن جریر سے اور انہوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا : رسول اللہ ﷺ ایک دن لوگوں کے سامنے ( تشریف فرما ) تھے ، ایک آدمی آپﷺ کے پاس آیا اور پوچھا : اے اللہ کے رسول ! ایمان کیا ہے ؟ آپ نے فرمایا : ’’تم اللہ تعالیٰ ، اس کے فرشتوں ، اس کی کتاب ، ( قیامت کے روز ) اس سے ملاقات ( اس کے سامنے حاضری ) اور اس کے رسولوں پر ایمان لاؤ اور آخری ( بار زندہ ہو کر ) اٹھنے پر ( بھی ) ایمان لے آؤ ۔ ‘ ‘ اس نے کہا : اے اللہ کے رسول ! اسلام کیا ہے ؟ آپﷺ نے فرمایا : ’’اسلام یہ ہے کہ اللہ تعالیٰ کی عبادت کرو اور اس کے ساتھ کسی چیز کو شریک نہ ٹھہراؤ ، لکھی ( فرض کی ) گئی نمازوں کی ‎پابندی کرو ، فرض کی گئی زکاۃ ادا کرو ۔ اور رمضان کے روزے رکھو ۔ ‘ ‘ اس نے کہا : اے اللہ کے رسول ! احسان کیا ہے ؟ آپﷺ نے فرمایا : ’’ اللہ تعالیٰ کی عبادت اس طرح کرو گویا تم اسے دیکھ رہے ہو اور اگر تم اسے نہیں دیکھ رہے ہو تو وہ یقیناً تمہیں دیکھ رہا ہے ۔ ‘ ‘ اس نے کہا : اے اللہ کے رسول ! قیامت کب ( قائم ) ہو گی ؟ آپ ﷺ نے فرمایا : ’’جس سے سوال کیا گیا ہے ، وہ ا س کے بارے میں پوچھنے والے سےزیادہ آگاہ نہیں ۔ لیکن میں تمہیں قیامت کی نشانیاں بتائے دیتا ہوں : جب لونڈی اپنا مالک جنے گی تو یہ اس کی نشانیوں میں سے ہے ، اور جب ننگے بدن اور ننگے پاؤں والے لوگوں کے سردار بن جائیں گے تو یہ اس کی نشانیوں میں سے ہے ، اور جب بھیڑ بکریاں چرانے والے ، اونچی اونچی عمارتیں بنانے میں ایک دوسرے سے مقابلہ کریں گے تو یہ اس کی علامات میں سے ہے ۔ ( قیامت کے وقت کا علم ) ان پانچ چیزوں میں سے ہے جنہیں اللہ تعالیٰ کے سوا کوئی نہیں جانتا ہے ‘ ‘ پھر آپ ﷺ نے یہ آیت پڑھی : ’’بے شک اللہ تعالیٰ ہی کے پاس قیامت کا علم ہے ، وہی بارش برساتا ہے اور وہی جانتا ہے کہ ارحام ( ماؤں کے پیٹوں ) میں کیا ہے ، کوئی ذی روح نہیں جانتا کہ وہ کل کیا کرے گا ، نہ کسی متنفس کویہ معلوم ہے کہ وہ زمین کے کس حصے میں فوت ہو گا ، بلاشبہ اللہ تعالیٰ علم والا خبردار ہے ۔ ‘ ‘ حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ) کہا : پھر وہ آدمی واپس چلا گیا تو رسول اللہ ﷺ نے فرمایا : ’’ اس آ دمی کو میرے پاس واپس لاؤ ۔ ‘ ‘ صحابہ کرام ‌رضی ‌اللہ ‌عنہ ‌ ‌ اسے واپس لانے کے لیے بھاک دوڑ کرنےلگے تو انہیں کچھ نظر نہ آیا ، رسول اللہ نے فرمایا : ’’یہ جبریل ‌علیہ ‌السلام ‌ تھے جو لوگوں کو ان کا دین سکھانے آئے تھے ۔ ‘ ‘",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، جَمِيعًا عَنِ ابْنِ عُلَيَّةَ، قَالَ زُهَيْرٌ: حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ أَبِي حَيَّانَ، عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَوْمًا بَارِزًا لِلنَّاسِ، فَأَتَاهُ رَجُلٌ، فَقَالَ: يَا رَسُولُ اللهِ، مَا الْإِيمَانُ؟ قَالَ: «أَنْ تُؤْمِنَ بِاللهِ، وَمَلَائِكَتِهِ، وَكِتَابِهِ، وَلِقَائِهِ، وَرُسُلِهِ، وَتُؤْمِنَ بِالْبَعْثِ الْآخِرِ»، قَالَ: يَا رَسُولَ اللهِ، مَا الْإِسْلَامُ؟ قَالَ: «الْإِسْلَامُ أَنْ تَعْبُدَ اللهَ، وَلَا تُشْرِكَ بِهِ شَيْئًا، وَتُقِيمَ الصَّلَاةَ الْمَكْتُوبَةَ، وَتُؤَدِّيَ الزَّكَاةَ الْمَفْرُوضَةَ، وَتَصُومَ رَمَضَانَ» قَالَ: يَا رَسُولَ اللهِ، مَا الْإِحْسَانُ؟ قَالَ: «أَنْ تَعْبُدَ اللهَ كَأَنَّكَ تَرَاهُ، فَإِنَّكَ إِنْ لَا تَرَاهُ فَإِنَّهُ يَرَاكَ»، قَالَ: يَا رَسُولَ اللهَ، مَتَى السَّاعَةُ؟ قَالَ: مَا الْمَسْئُولُ عَنْهَا بِأَعْلَمَ مِنَ السَّائِلِ، وَلَكِنْ سَأُحَدِّثُكَ عَنْ أَشْرَاطِهَا: إِذَا وَلَدَتِ الْأَمَةُ رَبَّهَا، فَذَاكَ مِنْ أَشْرَاطِهَا، وَإِذَا كَانَتِ الْعُرَاةُ الْحُفَاةُ رُءُوسَ النَّاسِ، فَذَاكَ مِنْ أَشْرَاطِهَا، وَإِذَا تَطَاوَلَ رِعَاءُ الْبَهْمِ فِي الْبُنْيَانِ، فَذَاكَ مِنْ أَشْرَاطِهَا فِي خَمْسٍ لَا يَعْلَمُهُنَّ إِلَّا اللهُ، ثُمَّ تَلَا صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: {إِنَّ اللهِ عِنْدَهُ عِلْمُ السَّاعَةِ وَيُنَزِّلُ الْغَيْثَ وَيَعْلَمُ مَا فِي الْأَرْحَامِ وَمَا تَدْرِي نَفْسٌ مَاذَا تَكْسِبُ غَدًا وَمَا تَدْرِي نَفْسٌ بِأَيِّ أَرْضٍ تَمُوتُ إِنَّ اللهَ عَلِيمٌ خَبِيرٌ} [لقمان: 34] قَالَ: ثُمَّ أَدْبَرَ الرَّجُلُ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «رُدُّوا عَلَيَّ الرَّجُلَ»، فَأَخَذُوا لِيَرُدُّوهُ، فَلَمْ يَرَوْا شَيْئًا، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «هَذَا جِبْرِيلُ جَاءَ لِيُعَلِّمَ النَّاسَ دِينَهُمْ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7662,
                "hadithNumber": "98",
                "englishNarrator": null,
                "hadithEnglish": "This hadith is narrated to us on the authority of Muhammad bin 'Abdullah bin Numair, on the authority of Muhammad bin Bishr, on the authority of Abd Hayyan al-Taymi with the exception that in this narration (instead of the words (Iza Waladat al'amah rabbaha), the words are (Iza Waladat al'amah Ba'laha), i.e, when slave-girl gives birth to her master.",
                "hadithUrdu": "ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا,( ابن علیہ کے بجائے ) محمد بن بشر نےکہا : ہمیں ابو حیان نے سابقہ سند سے وہی حدیث بیان کی ، البتہ ان کی روایت میں : إذا ولدت الأمة بعلها ’’ جب لونڈی اپنا مالک جنے گی ‘ ‘ ( رب کی جگہ بعل ، یعنی مالک ) کے الفاظ ہیں ۔ ( أمة سے مملوکہ ) لونڈیاں مراد ہیں ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا أَبُو حَيَّانَ التَّيْمِيُّ، بِهَذَا الْإِسْنَادِ مِثْلَهُ، غَيْرَ أَنَّ فِي رِوَايَتِهِ: «إِذَا وَلَدَتِ الْأَمَةُ بَعْلَهَا» يَعْنِي السَّرَارِيَّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7663,
                "hadithNumber": "99",
                "englishNarrator": null,
                "hadithEnglish": "It is narrated on the authority of Abu Huraira that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Ask me (about matters pertaining to religion), but they (the Companions of the Holy Prophet) were too much overawed out of profound respect for him to ask him (anything). In the meanwhile a man came there, and sat near his knees and said: Messenger of Allah, what al-lslam is? -to which he (the Holy Prophet) replied: You must not associate anything with Allah, and establish prayer, pay the poor-rate (Zakat) and observe (the fasts) of Ramadan. He said: You (have) told the truth. He (again) said: Messenger of Allah, what al-Iman (the faith) is? He (the Holy Prophet) said: That you affirm your faith in Allah, His angels, His Books, His meeting, His Apostles, and that you believe in Resurrection and that you believe in Qadr (Divine Decree) in all its entirety, He (the inquirer) said: You (have) told the truth. He (again) said: Messenger of Allah, what al-Ihsan is? Upon this he (the Holy Prophet) said: (Al-Ihsan implies) that you fear Allah as if you are seeing Him, and though you see Him not, verily He is seeing you. He (the inquirer) said: You (have) told the truth. He (the inquirer) said: When there would be the hour (of Doom)? (Upon this) he (the HolyProphet said: The one who is being asked about it is no better informed than the inquirer himself. I, however, narrate some of its signs (and these are): when you see a slave (woman) giving birth to her master - that is one of the signs of (Doom) ; when you see barefooted, naked, deaf and dumb (ignorant and foolish persons) as the rulers of the earth - that is one of the signs of the Doom. And when you see the shepherds of black camels exult in buildings - that is one of the signs of Doom. The (Doom) is one of the five things (wrapped) in the unseen. No one knows them except Allah. Then (the Holy Prophet) recited (the folowing verse): Verily Allah! with Him alone is the knowledge of the hour and He it is Who sends down the rain and knows that which is in the wombs and no person knows whatsoever he shall earn on morrow and a person knows not in whatsoever land he shall die. Verily Allah is Knowing, Aware. He (the narrator, Abu Huraira) said: Then the person stood up an (made his way). The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Bring him back to me. He was searched for, but they (the Companions of the Holy Prophet) could not find him. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) thereupon said: He was Gabriel and he wanted to teach you (things pertaining to religion) when you did not ask (them yourselves).",
                "hadithUrdu": "حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا : ’’مجھ سے ( دین کے بارے میں ) پوچھ لو ۔ ‘ ‘ صحابہ کرام ‌رضی ‌اللہ ‌عنہ ‌ ‌ آپ ﷺ سے اتنے مرعوب ہوئے کہ سوال نہ کر سکے ، تب ایک آدمی آیا اور آپ ﷺ کے دونوں گھٹنوں کے قریب بیٹھ گیا ، پھر کہنے لگا : اے اللہ کے رسول ! اسلام کیا ؟ آپ نے فرمایا : ’’ تم اللہ تعالیٰ کے ساتھ کسی کو شریک نہ ٹھہراؤ ، نماز کا اہتمام کرو ، زکاۃ ادا کرو اور رمضان کے روزے رکھو ۔ ‘ ‘ اس نے کہا : آپ نے سچ فرمایا ۔ ( پھر ) پوچھا : اے اللہ کے رسول ! ایمان کیا ہے ؟ آپ نے فرمایا : ’’یہ کہ تم اللہ ، اس کے فرشتوں ، اس کی کتاب ، ( قیات کے روز ) اس سے ملاقات اور اس کے رسولوں پر ایمان لاؤ ، مرنے کے بعد اٹھنے پر ایمان لاؤ اور ہر ( امر کی ) تقدیر پر ایمان لاؤ ۔ ‘ ‘ اس نے کہا : آپ نے درست فرمایا ۔ ( پھر ) کہنے لگا : اے اللہ کے رسول ! احسان کیا ہے ؟ آپ نے فرمایا : ’’تم اللہ تعالیٰ سےاس طرح ڈرو گویا تم اسے دیکھ رہے ہو ، پھر اگر تم اسے نہیں رہے تو وہ یقینا ً تمہیں دیکھ رہا ہے ۔ ‘ ‘ اس نے کہا : آپ نے صحیح فرمایا : ( پھر ) پوچھا : اے اللہ کے رسول ! قیامت کب قائم ہو گی ؟ آپ نے جواب دیا : ’’جس سے قیامت کے بارے میں پوچھا جا رہا ہے ، وہ پوچھنے والے سے زیادہ نہیں جانتا ۔ میں تمہیں اس کی علامات بتائے دیتا ہوں : جب دیکھو کہ عورت اپنے آقا کو جنم دیتی ہے تو یہ اس کی نشانیوں میں سے ہے اور جب دیکھو کہ ننگے پاؤں اور ننگے بدن والے ، گونگے اور بہرے زمین کے بادشاہ ہیں تو یہ اس کی علامات میں سے ہے اور جب دیکھو کہ بھیڑ بکریوں کے چروا ہے اونچی سے اونچی عمارات بنانے میں باہم مقابلہ کر رہے ہیں تو یہ بھی اس کی نشانیوں میں سے ہے ۔ یہ ( قیامت کا وقوع ) غیب کی ان پانچ چیزوں میں سے ہے ۔ جن کو اللہ تعالیٰ کے سوا کوئی نہیں جانتا ۔ ‘ ‘ پھر آپ نے یہ آیت پڑھی : ’’بے شک اللہ تعالیٰ ہی کے پاس قیامت کا علم ہے ، وہی بارش برساتا ہے اور وہی جانتا ہے کہ ارحام ( ماؤں کے پیٹوں ) میں کیا ہےاور کوئی شخص نہیں جانتا کہ وہ آنے والے کل میں کیا کرے گا اور کوئی شخص نہیں جانتا کہ وہ ( کہاں ) کس زمین میں فوت ہو گا ...... ‘ ‘ سورت کے آخر تک ۔ حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : پھر وہ آدمی کھڑا ہو گیا ( اور چلا گیا ) تو رسول اللہ ﷺ نے فرمایا : ’’اسے میرے پاس واپس لاؤ ۔ ‘ ‘ اسے تلاش کیا گیا تو وہ انہیں ( صحابہ کرام کو ) نہ ملا ۔ رسو ل اللہ ﷺ نے فرمایا : ’’ یہ جبریل تھے ، انہوں نے چاہا کہ تم نہیں پوچھ رہے تو تم ( دین ) سیکھ لو ( انہوں نے آکر تمہاری طرف سے سوال کیا",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ عُمَارَةَ وَهُوَ ابْنُ الْقَعْقَاعِ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «سَلُونِي»، فَهَابُوهُ أَنْ يَسْأَلُوهُ، فَجَاءَ رَجُلٌ، فَجَلَسَ عِنْدَ رُكْبَتَيْهِ، فَقَالَ: يَا رَسُولَ اللهِ، مَا الْإِسْلَامُ؟ قَالَ: «لَا تُشْرِكُ بِاللهِ شَيْئًا، وَتُقِيمُ الصَّلَاةَ، وَتُؤْتِي الزَّكَاةَ، وَتَصُومُ رَمَضَانَ»، قَالَ: صَدَقْتَ، قَالَ: يَا رَسُولَ اللهِ، مَا الْإِيمَانُ؟ قَالَ: «أَنْ تُؤْمِنَ بِاللهِ، وَمَلَائِكَتِهِ، وَكِتَابِهِ، وَلِقَائِهِ، وَرُسُلِهِ، وَتُؤْمِنَ بِالْبَعْثِ، وَتُؤْمِنَ بِالْقَدَرِ كُلِّهِ»، قَالَ: صَدَقْتَ، قَالَ: يَا رَسُولَ اللهِ، مَا الْإِحْسَانُ؟ قَالَ: «أَنْ تَخْشَى اللهَ كَأَنَّكَ تَرَاهُ، فَإِنَّكَ إِنْ لَا تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاكَ»، قَالَ: صَدَقْتَ. قَالَ: يَا رَسُولَ اللهِ، مَتَى تَقُومُ السَّاعَةُ؟ قَالَ: مَا الْمَسْئُولُ عَنْهَا بِأَعْلَمَ مِنَ السَّائِلِ، وَسَأُحَدِّثُكَ عَنْ أَشْرَاطِهَا: إِذَا رَأَيْتَ الْمَرْأَةَ تَلِدُ رَبَّهَا، فَذَاكَ مِنْ أَشْرَاطِهَا، وَإِذَا رَأَيْتَ الْحُفَاةَ الْعُرَاةَ الصُّمَّ الْبُكْمَ مُلُوكَ الْأَرْضِ، فَذَاكَ مِنْ أَشْرَاطِهَا، وَإِذَا رَأَيْتَ رِعَاءَ الْبَهْمِ يَتَطَاوَلُونَ فِي الْبُنْيَانِ، فَذَاكَ مِنْ أَشْرَاطِهَا فِي خَمْسٍ مِنَ الْغَيْبِ لَا يَعْلَمُهُنَّ إِلَّا اللهُ ، ثُمَّ قَرَأَ: {إِنَّ اللهَ عِنْدَهُ عِلْمُ السَّاعَةِ وَيُنَزِّلُ الْغَيْثَ وَيَعْلَمُ مَا فِي الْأَرْحَامِ وَمَا تَدْرِي نَفْسٌ مَاذَا تَكْسِبُ غَدًا وَمَا تَدْرِي نَفْسٌ بِأَيِّ أَرْضٍ تَمُوتُ إِنَّ اللهِ عَلِيمٌ خَبِيرٌ} [لقمان: 34] قَالَ: ثُمَّ قَامَ الرَّجُلُ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «رُدُّوهُ عَلَيَّ»، فَالْتُمِسَ، فَلَمْ يَجِدُوهُ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «هَذَا جِبْرِيلُ، أَرَادَ أَنْ تَعَلَّمُوا إِذْ لَمْ تَسْأَلُوا",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 7351,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=294",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=292",
                "label": "292",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=293",
                "label": "293",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=294",
                "label": "294",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=295",
                "label": "295",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=296",
                "label": "296",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=297",
                "label": "297",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=298",
                "label": "298",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=296",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=296",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=294",
        "to": 7375,
        "total": 40465
    }
}