{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 549,
        "data": [
            {
                "id": 13989,
                "hadithNumber": "6426",
                "englishNarrator": "Abu Usaid Ansari رضی اللہ عنہ reported:",
                "hadithEnglish": "He heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The worthiest of the Ansar or the worthiest of the settlements and the clans of Ansar; the rest of the hadith is the same, but there is no mention of the story of Sa'd bin 'Ubida (رضی اللہ عنہ).",
                "hadithUrdu": "انھوں نے رسول اللہ صلی اللہ علیہ وسلم کو فر ما تے ہو ئے سنا : \" انصار میں سے یا ( فر ما یا : ) انصار کے گھرانوں میں سے بہترین ۔ ۔ ۔ \" ( آگے انصار کے ) گھرا نوں کے بارے میں ان سب ( راویوں ) کی حدیث کے مانند ہے ۔ انھوں نے حضرت سعد بن عبادہ رضی اللہ عنہ کا واقعہ بیان نہیں کیا ۔",
                "urduNarrator": "ہم سے عمرو بن علی بن بحر نے بیان کیا، کہا ہم سے ابوداؤد نے بیان کیا، کہا ہم سے حرب بن شداد نے بیان کیا, یحییٰ بن ابی کثیر نے کہا : مجھے ابو سلمہ نے حدیث بیان کی ، انھیں حضرت ابو اسید انصاری رضی اللہ عنہ نے حدیث سنائی کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ عَلِيِّ بْنِ بَحْرٍ، حَدَّثَنِي أَبُو دَاوُدَ، حَدَّثَنَا حَرْبُ بْنُ شَدَّادٍ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، حَدَّثَنِي أَبُو سَلَمَةَ، أَنَّ أَبَا أُسَيْدٍ الْأَنْصَارِيَّ، حَدَّثَهُ، أَنَّهُ سَمِعَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «خَيْرُ الْأَنْصَارِ، أَوْ خَيْرُ دُورِ الْأَنْصَارِ» بِمِثْلِ حَدِيثِهِمْ، فِي ذِكْرِ الدُّورِ، وَلَمْ يَذْكُرْ قِصَّةَ سَعْدِ بْنِ عُبَادَةَ رَضِيَ اللهُ عَنْهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13990,
                "hadithNumber": "6427",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) as saying in a large gathering of the Muslims: Should I not tell you of the best clans of the Ansar? They said: Allah's Messenger, (kindly) do this. Thereupon Allah's Messenger said: That is Banu Abd al-Ashhal. They said: Allah's Messenger, then next? He said: Banu Najjar. They again said: Allah's Messenger, then next? He said: Then of Banu Harith bin Khazraj. They then said: Allah's Messenger, then next? He said. Then of Banu Sa'ida. They said: Allah's Messenger, then next? He said: There is good in all the clans of the Ansar. It was upon this that Sa'd bin Ubida رضی اللہ عنہ stood up in annoyance and said: Are we the last of the four as Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) has determined (the order of precedence) of their clans? He decided to talk with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) on this issue, but the people Of his tribe said to him: Be seated, are you not happy with this that Allah's Messenger' ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) has mentioned your clan as one of the four (best) clans and those whom he left and did not mention (the order of their precedence) are more than those whom he mentioned? And Sa'd bin 'Ubada رضی اللہ عنہ dropped the idea of talking to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) (on this issue).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے جب آپ مسلمانوں کی ایک بڑی مجلس میں تھے فرما یا : \" میں تم کو انصار کا بہترین گھرا نہ بتاؤں؟ \" صحابہ کرام رضوان اللہ عنھم اجمعین نے کہا : جی ہاں اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! آپ نے فر ما یا : \" بنو عبدالاشہل ۔ \" صحابہ کرام رضوان اللہ عنھم اجمعین نے کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! پھر کون ہیں ؟فرما یا : \" بنو نجا ر ۔ ۔ \" صحابہ کرام رضوان اللہ عنھم اجمعین نے کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! پھر کو ن ہیں؟فر ما یا : \" پھر بنو حارث بن خزرج ۔ \" صحابہ کرام رضوان اللہ عنھم اجمعین نے کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! پھر کو ن ؟فر ما یا : \" پھر بنو ساعدہ ۔ \" صحابہ کرام رضوان اللہ عنھم اجمعین نے کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! پھر کون ہیں ؟فر ما یا : \" پھر انصار کے تمام گھرا نوں میں خیر ہے ۔ \" جب رسول اللہ صلی اللہ علیہ وسلم نے ان کے گھرانےکا نا م لیا تو حضرت سعد بن عبادہ رضی اللہ عنہ غصے میں کھڑے ہو گئے اور کہا : کیا ہم چاروں میں سے آخری ہیں ؟انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے بات کرنی چا ہی تو ان کی قوم کے لوگوں نے کہا : بیٹھ جاؤ کیا تم اس پر راضی نہیں ہو کہ رسول اللہ صلی اللہ علیہ وسلم نے تمھا رے گھرا نے کا نام ان چار گھرانوں میں لیا ہے جن کا آپ نے نام لیا ہے ۔ حالانکہ جن گھرانوں کو آپ نے چھوڑ دیا اور ان کا نام نہیں لیا ، ان کی تعداد ان سے زیادہ ہے جن کا نام لیا ۔ پھر حضرت سعد بن عبادہ رضی اللہ تعالیٰ عنہ رسول اللہ صلی اللہ علیہ وسلم سے بات کرنے سے رک گئے ۔",
                "urduNarrator": "مجھ سے عمرو ناقد اور عبد بن حمید نے بیان کیا، کہا: ہم سے یعقوب نے، جو ابراہیم بن سعد کے بیٹے ہیں، ہم سے میرے والد نے، صالح کی سند سے، ابن کی سند سے بیان کیا، اس نے کہا: ابو سلمہ اور عبید اللہ بن عبد اللہ بن عتبہ بن مسعود نے کہا : کہ ان دونوں نے حضرت ابو ہریرہ رضی اللہ عنہ کو کہتے ہو ئے سنا",
                "hadithArabic": "وحَدَّثَنِي عَمْرٌو النَّاقِدُ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَا: حَدَّثَنَا يَعْقُوبُ وَهُوَ ابْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، قَالَ: قَالَ أَبُو سَلَمَةَ، وَعُبَيْدُ اللهِ بْنُ عَبْدِ اللهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، سَمِعَا أَبَا هُرَيْرَةَ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: وَهُوَ فِي مَجْلِسٍ عَظِيمٍ مِنَ الْمُسْلِمِينَ «أُحَدِّثُكُمْ بِخَيْرِ دُورِ الْأَنْصَارِ» قَالُوا: نَعَمْ، يَا رَسُولَ اللهِ قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «بَنُو عَبْدِ الْأَشْهَلِ» قَالُوا: ثُمَّ مَنْ؟ يَا رَسُولَ اللهِ ‍‍ قَالَ: «ثُمَّ بَنُو النَّجَّارِ» قَالُوا: ثُمَّ مَنْ؟ يَا رَسُولَ اللهِ قَالَ: ثُمَّ «بَنُو الْحَارِثِ بْنِ الْخَزْرَجِ» قَالُوا: ثُمَّ مَنْ؟ يَا رَسُولَ اللهِ قَالَ: ثُمَّ «بَنُو سَاعِدَةَ» قَالُوا: ثُمَّ مَنْ؟ يَا رَسُولَ اللهِ قَالَ: «ثُمَّ فِي كُلِّ دُورِ الْأَنْصَارِ خَيْرٌ» فَقَامَ سَعْدُ بْنُ عُبَادَةَ مُغْضَبًا، فَقَالَ: أَنَحْنُ آخِرُ الْأَرْبَعِ؟ حِينَ سَمَّى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ دَارَهُمْ، فَأَرَادَ كَلَامَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ لَهُ رِجَالٌ مِنْ قَوْمِهِ: اجْلِسْ، أَلَا تَرْضَى أَنْ سَمَّى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ دَارَكُمْ فِي الْأَرْبَعِ الدُّورِ الَّتِي سَمَّى؟ فَمَنْ تَرَكَ فَلَمْ يُسَمِّ أَكْثَرُ مِمَّنْ سَمَّى، فَانْتَهَى سَعْدُ بْنُ عُبَادَةَ عَنْ كَلَامِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13991,
                "hadithNumber": "6428",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "I set out along with Jarir bin 'Abdullah al-Bajali رضی اللہ عنہ on a journey and he used to serve me. I said to him: Don't do that. Thereupon he said: I have seen Ansar doing this with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). I swore by Allah whenever I accompany any one of the Ansar, I would serve him and Ibn Muthanni, and Ibn Bashshir made this addition in their narrations: Jarir رضی اللہ عنہ was older than Anas رضی اللہ عنہ , and Ibn Bashshir said: He was of a more advanced age as compared with Anas رضی اللہ عنہ.",
                "hadithUrdu": "میں حضرت جریر بن عبد اللہ بجلی رضی اللہ عنہ کے ساتھ سفر کے لیے نکلا ، وہ ( اس سفر میں ) میری خدمت کرتے تھے ، میں نے ان سے کہا : ایسا نہ کریں ، انھوں نے کہا کہ میں نے ( جب ) انصار کو دیکھا کہ وہ نبی صلی اللہ علیہ وسلم کے ساتھ ( خدمت و تواضع ) کا سلوک کرتے ہیں تو میں نے قسم کھا ئی کہ میں جب بھی کسی انصاری کے ساتھ ہوں گا تو اس کی خدمت کروں گا ۔ ابن مثنیٰ اور ابن بشار نے اپنی اپنی حدیث میں مزید یہ بیان کیا ، ( ابن مثنیٰ نے کہا ) حضرت جریر رضی اللہ عنہ حضرت انس رضی اللہ عنہ سے بڑے تھے ابن بشار نے کہا : حضرت انس رضی اللہ عنہ سے عمر میں زیادہ تھے ۔",
                "urduNarrator": "نصر بن علی جہضمی ، محمد بن مثنیٰ اور ابن بشار نے ابن عرعرہ سے روایت کی ۔ الفاظ جہضمی کے ہیں ۔ انھوں نے کہا : مجھے عرعرہ نے حدیث بیان کی ، انھوں نے کہا : ہمیں شعبہ نے یو نس بن عبید سے حدیث بیان کی ، انھوں نے ثابت بنانی سے ، انھوں نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، جَمِيعًا عَنِ ابْنِ عَرْعَرَةَ - وَاللَّفْظُ لِلْجَهْضَمِيِّ - حَدَّثَنِي مُحَمَّدُ بْنُ عَرْعَرَةَ، حَدَّثَنَا شُعْبَةُ، عَنْ يُونُسَ بْنِ عُبَيْدٍ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ: خَرَجْتُ مَعَ جَرِيرِ بْنِ عَبْدِ اللهِ الْبَجَلِيِّ فِي سَفَرٍ فَكَانَ يَخْدُمُنِي فَقُلْتُ لَهُ: لَا تَفْعَلْ، فَقَالَ: «إِنِّي قَدْ رَأَيْتُ الْأَنْصَارَ تَصْنَعُ بِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ شَيْئًا، آلَيْتُ أَنْ لَا أَصْحَبَ أَحَدًا مِنْهُمْ إِلَّا خَدَمْتُهُ».\r\n زَادَ ابْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ فِي حَدِيثِهِمَا: وَكَانَ جَرِيرٌ أَكْبَرَ مِنْ أَنَسٍ، وَقَالَ ابْنُ بَشَّارٍ: أَسَنَّ مِنْ أَنَسٍ.",
                "headingArabic": "فِي حُسْنِ صُحْبَةِ الأَنْصَارِ رضى الله عنهم ‏‏",
                "headingUrdu": "انصار (رضی اللہ عنہ) کے ساتھ اچھی صحبت رکھنا",
                "headingEnglish": "Keeping Good Company With The Ansar (RA)",
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13992,
                "hadithNumber": "6429",
                "englishNarrator": "Abu Dharr رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Go to your people and say that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) says: Ghifar (is a tribe) to whom Allah granted pardon, and Aslam (is the tribe) to whom Allah granted safety.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" غفار ، اللہ ان کی مغفرت کرے اور اسلم ، اللہ انھیں سلامت رکھے ۔ \"",
                "urduNarrator": "ہم سے حداب بن خالد نے بیان کیا، ہم سے سلیمان بن المغیرہ نے بیان کیا، ہم سے حمید بن ہلال نے بیان کیا، انہوں نے عبداللہ بن صامت کی سند سے، انہوں نے کہا: حضرت ابو ذر رضی اللہ عنہ نے کہا",
                "hadithArabic": "حَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ، حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، حَدَّثَنَا حُمَيْدُ بْنُ هِلَالٍ، عَنْ عَبْدِ اللهِ بْنِ الصَّامِتِ، قَالَ: قَالَ أَبُو ذَرٍّ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «غِفَارُ غَفَرَ اللهُ لَهَا، وَأَسْلَمُ سَالَمَهَا اللهُ».",
                "headingArabic": "دُعَاءِ النَّبِيِّ صلى الله عليه وسلم لِغِفَارَ وَأَسْلَمَ ‏‏",
                "headingUrdu": "غفار اور اسلم کے لیے رسول اللہ صلی اللہ علیہ وسلم کی دعا",
                "headingEnglish": "The Supplication Of The Prophet (SAW) For Ghifar And Aslam",
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13993,
                "hadithNumber": "6430",
                "englishNarrator": "Abu Dharr رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: To the tribe of Aslam Allah has granted safety and to the tribe of Ghifar Allah has granted pardon.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے مجھ سےفرمایا : \" اپنی قوم کے پاس جاؤاور ( ان سے ) کہو کہ رسول اللہ صلی اللہ علیہ وسلم نےفرما یا ہے ۔ \" اسلم کو اللہ تعا لیٰ سلامت رکھے ۔ \" اورغفار کی اللہ تعالیٰ مغفرت فرمائے !",
                "urduNarrator": "عبید اللہ بن عمر القواری، محمد بن المثنی اور ابن بشار نے ہمیں ابن مہدی کی سند سے بیان کیا، انہوں نے کہا: ابن المثنی نے کہا, عبد الرحمٰن  ابن مہدی نے کہا , ہمیں شعبہ نے ابو عمران جونی سے حدیث بیان کی ، انھوں نے عبد اللہ بن صامت سے ، انھوں نے حضرت ابو ذر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، جَمِيعًا عَنِ ابْنِ مَهْدِيٍّ، قَالَ: قَالَ ابْنُ الْمُثَنَّى: حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ، عَنْ عَبْدِ اللهِ بْنِ الصَّامِتِ، عَنْ أَبِي ذَرٍّ، قَالَ: قَالَ لِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: ائْتِ قَوْمَكَ فَقُلْ: إِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَسْلَمُ سَالَمَهَا اللهُ، وَغِفَارُ غَفَرَ اللهُ لَهَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13994,
                "hadithNumber": "6431",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been reported on the authority of Shu'ba with the same chain of transmitters.",
                "hadithUrdu": "ہم سے محمد بن المثنا اور ابن بشار نے بیان کیا، انہوں نے کہا: ابو داؤد نے کہا : ہمیں شعبہ نے یہ حدیث اسی سند سے بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا أَبُو دَاوُدَ، حَدَّثَنَا شُعْبَةُ، فِي هَذَا الْإِسْنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13995,
                "hadithNumber": "6432",
                "englishNarrator": "This hadith has been narrated through other chains of transmitters on the authority of Jabir رضی اللہ عنہ and Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: To the tribe of Aslam Allah has granted safety and to the tribe of Ghifar Allah has granted pardon.",
                "hadithUrdu": "آپ نے فرمایا : \" اسلم کو اللہ تعالیٰ سلامتی عطاکرے ۔ \" اورغفار کی اللہ تعالیٰ مغفرت فرمائے ! \"",
                "urduNarrator": "ہم سے محمد بن المثنی، ابن بشار، سوید بن سعید اور ابن ابی عمر نے بیان کیا، انہوں نے کہا: ہم سے عبدالوہاب ثقفی نے ایوب رضی اللہ عنہ کی سند سے بیان کیا۔ محمد نے ابوہریرہ سے، ہم سے عبید اللہ بن معاذ نے بیان کیا، ہم سے میرے والد نے بیان کیا، ہم سے محمد بن المثنی نے بیان کیا، ہم سے عبدالرحمٰن بن مہدی نے بیان کیا، انہوں نے کہا: ہم سے شعبہ نے بیان کیا, محمد ( بن سیرین ) محمد بن زیاد اور اعرج نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی ، نیز ابن جریج اور معقل نے ابو زبیر سے انھوں نے حضرت جابر رضی اللہ عنہ سے روایت کی ، سب نے کہا :نبی صلی اللہ علیہ وسلم سے روایت ہےکہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ وَسُوَيْدُ بْنُ سَعِيدٍ، وَابْنُ أَبِي عُمَرَ، قَالُوا: حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ، ح وَحَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، قَالَا: حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ زِيَادٍ، عَنْ أَبِي هُرَيْرَةَ، ح وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنِي وَرْقَاءُ، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، ح وَحَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، وَعَبْدُ بْنُ حُمَيْدٍ، عَنْ أَبِي عَاصِمٍ، كِلَاهُمَا عَنِ ابْنِ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، ح وحَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، كُلُّهُمْ قَالَ عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَسْلَمُ سَالَمَهَا اللهُ، وَغِفَارُ غَفَرَ اللهُ لَهَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13996,
                "hadithNumber": "6433",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: To the tribe of Aslam Allah has granted safety and to the tribe of Ghifar Allah has granted pardon. Verily it is not I that say this, but (it is) Allah the Exalted and Glorious. (who) says this.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : اسلم کو اللہ تعا لیٰ نےسلامتی عطا کی ۔ \" اورغفار کی اللہ تعالیٰ نے مغفرت فرمادی ، یہ میں نے نہیں کہا ، اللہ تعا لیٰ نے فرما یا ہے ۔",
                "urduNarrator": "مجھ سے حسین بن حارث نے بیان کیا، ہم سے الفضل بن موسیٰ نے بیان کیا, خثیم بن عراک نے اپنے والد سے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنِي حُسَيْنُ بْنُ حُرَيْثٍ، حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى، عَنْ خُثَيْمِ بْنِ عِرَاكٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «أَسْلَمُ سَالَمَهَا اللهُ، وَغِفَارُ غَفَرَ اللهُ لَهَا، أَمَا إِنِّي لَمْ أَقُلْهَا وَلَكِنْ قَالَهَا اللهُ عَزَّ وَجَلَّ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13997,
                "hadithNumber": "6434",
                "englishNarrator": "Khufaf bin Jura' رضی اللہ عنہreported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said in prayer: O Allah, hurl curse upon the tribe of Lihyan and Ri'l aid Dhakwan and Usayya for they disobeyed Allah and His Messenger, (and for) Ghifar Allah has granted pardon and for the tribe of Aslam Allah has granted safety.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے نماز میں دعا کرتےہو ئے فرما یا : اے اللہ !بنو لحیان ، رعل ، ذکوان اور عصیہ پر لعنت فر ما جنھوں نے اللہ اور رسول اللہ صلی اللہ علیہ وسلم کی نافرمانی کی ، اورغفار کی اللہ مغفرت فر ما ئے اسلم کو اللہ سلامتی عطا کرے! \"",
                "urduNarrator": "مجھ سے ابو الطاہر نے بیان کیا، ہم سے ابن وہب نے لیث کی سند سے اور عمران بن ابی انس کی سند سے بیان کیا, حنظلہ بن علی نے حضرت خفاف بن ایماء غفاری رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ، حَدَّثَنَا ابْنُ وَهْبٍ، عَنِ اللَّيْثِ، عَنْ عِمْرَانَ بْنِ أَبِي أَنَسٍ، عَنْ حَنْظَلَةَ بْنِ عَلِيٍّ، عَنْ خُفَافِ بْنِ إِيْمَاءَ الْغِفَارِيِّ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «فِي صَلَاةٍ اللهُمَّ الْعَنْ بَنِي لِحْيَانَ، وَرِعْلًا، وَذَكْوَانَ، وَعُصَيَّةَ عَصَوُا اللهَ وَرَسُولَهُ، غِفَارُ غَفَرَ اللهُ لَهَا، وَأَسْلَمُ سَالَمَهَا اللهُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13998,
                "hadithNumber": "6435",
                "englishNarrator": "Ibn 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Allah has granted pardon to the tribe of Ghifar and to the tribe of Aslam Allah has granted safety and as for Usayya tribe, they disobeyed Allah and His Messenger.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" غفار کی اللہ نے مغفرت فرمائی اور اسلم کو اللہ سلامتی عطا کیاور عصیہ نے اللہ اور اس کے رسول اللہ صلی اللہ علیہ وسلم کی نافر ما نی کی ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ، یحییٰ بن ایوب، قتیبہ اور ابن حجر نے بیان کیا، انہوں نے کہا: ہم سے یحییٰ بن یحییٰ نے بیان کیا، اور دوسروں نے کہا: ہم سے اسمٰعیل بن جعفر نے بیان کیا, عبد اللہ بن دینار سے روایت ہے کہ انھوں نے حضرت ابن عمر رضی اللہ عنہ سے سنا ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَيَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ حُجْرٍ - قَالَ: يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا وقَالَ الْآخَرُونَ: حَدَّثَنَا - إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ عَبْدِ اللهِ بْنِ دِينَارٍ، أَنَّهُ سَمِعَ ابْنَ عُمَرَ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «غِفَارُ غَفَرَ اللهُ لَهَا، وَأَسْلَمُ سَالَمَهَا اللهُ، وَعُصَيَّةُ عَصَتِ اللهَ وَرَسُولَهُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13999,
                "hadithNumber": "6436",
                "englishNarrator": "This hadith has been transmitted on the authority of Ibn Umar رضی اللہ عنہ with a slight variation of wording (and the wording):",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said this on the pulpit.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے یہ بات منبر پر ارشاد فر ما ئی ۔",
                "urduNarrator": "ہم سے ابن المثنی نے بیان کیا، کہا ہم سے عبد الوہاب نے بیان کیاعبید اللہ ، اسامہ اور ابو صالح سب نے نافع سے ، انھوں نے حضرت ابن عمر رضی اللہ عنہ سےانھوں نے نبی صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی صالح اور اسامہ کی حدیث میں ہے کہ",
                "hadithArabic": "حَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا عُبَيْدُ اللهِ، وَحَدَّثَنَا عَمْرُو بْنُ سَوَّادٍ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي أُسَامَةُ، ح وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَالْحُلْوَانِيُّ، وَعَبْدُ بْنُ حُمَيْدٍ، عَنْ يَعْقُوبَ بْنِ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ كُلُّهُمْ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ، وَفِي حَدِيثِ صَالِحٍ، وَأُسَامَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ ذَلِكَ عَلَى الْمِنْبَرِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14000,
                "hadithNumber": "6437",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been reported on the authority of Ibn Umar رضی اللہ عنہ but through another chain of transmitters.",
                "hadithUrdu": "مجھ سے حجاج بن شعر نے بیان کیا، ہم سے ابوداؤد طیالسی نے بیان کیا، ہم سے حرب بن شداد نے بیان کیا، یحییٰ کی سند سے, ابو سلمہ نے کہا : مجھے حضرت ابن عمر رضی اللہ عنہ نے حدیث بیان کی ، کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرما تے ہو ئے سنا ، ان سب ( سابقہ حدیث کے راویوں ) کی حضرت ابن عمر رضی اللہ عنہ سے روایت کردہ حدیث کے مانند.",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِيهِ حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ، حَدَّثَنَا حَرْبُ بْنُ شَدَّادٍ، عَنْ يَحْيَى، حَدَّثَنِي أَبُو سَلَمَةَ، حَدَّثَنِي ابْنُ عُمَرَ، قَالَ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: مِثْلَ حَدِيثِ هَؤُلَاءِ، عَنِ ابْنِ عُمَرَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14001,
                "hadithNumber": "6438",
                "englishNarrator": "Abu Ayyub رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The tribes of Ansar, Muzaina and Juhaina and Ghifar and Ashja' and those from Banu 'Abdullah, they are my friends amongst the people and Allah and His Messenger are their protectors.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" انصار مزینہ ، جہینہ ، غفار ، اشجع اور جو بھی بنو عبد اللہ میں سے ہیں ( ان کے علاقے میں رہنے والے ) باقی لوگوں کو چھوڑ کر میرے اپنے مدد گار ہیں اور اللہ اور اس کا رسول ان کے مددگار ہیں ۔ \"",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے یزید نے جو ہارون کے بیٹے ہیں، بیان کیا، کہا ہم سے ابو مالک اشجعی نے بیان کیا، وہ موسیٰ بن طلحہ سے, حضرت ابو ایوب رضی اللہ عنہ سے روایت ہے کہا",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَزِيدُ وَهُوَ ابْنُ هَارُونَ، أَخْبَرَنَا أَبُو مَالِكٍ الْأَشْجَعِيُّ، عَنْ مُوسَى بْنِ طَلْحَةَ، عَنْ أَبِي أَيُّوبَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الْأَنْصَارُ، وَمُزَيْنَةُ، وَجُهَيْنَةُ، وَغِفَارُ، وَأَشْجَعُ، وَمَنْ كَانَ مِنْ بَنِي عَبْدِ اللهِ، مَوَالِيَّ دُونَ النَّاسِ، وَاللهُ وَرَسُولُهُ مَوْلَاهُمْ».",
                "headingArabic": "مِنْ فَضَائِلِ غِفَارَ وَأَسْلَمَ وُجُهَيْنَةَ وَأَشْجَعَ وَمُزَيْنَةَ وَتَمِيمٍ وَدَوْسٍ وَطَيِّئٍ",
                "headingUrdu": "غفار، اسلم، جہینہ، اشجع، مزینہ، تمیم، دوس اور طی کے فضائل",
                "headingEnglish": "The Virtues Of Ghifar, Aslam, Juhainah, Ashja', Muzainah, Tamim, Daws and Tayy'",
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14002,
                "hadithNumber": "6439",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Quraish, Ansar, Muzaina, Juhaina and Ghifar, they are my friends and there is no friend of theirs besides Allah and His Messenger.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" قریش ، انصار مزینہ جہینہ ، اسلم ، غفار اور اشجع ( میرے ) مدد گار ہیں اور ان کا اللہ اور رسول اللہ صلی اللہ علیہ وسلم کے سوا کو ئی اور مددگار نہیں ہے ۔ ( انھیں خالصتاً اللہ اور اس کے رسول اللہ صلی اللہ علیہ وسلم کی حمایت حاصل ہے ۔ )",
                "urduNarrator": "ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا، کہا ہم سے میرے والد نے بیان کیا, سفیان ( بن سعید ) نے سعد بن ابرا ہیم سے ، انھوں نے عبد الرحمن بن ہر مز اعرج سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا سُفْيَانُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «قُرَيْشٌ، وَالْأَنْصَارُ، وَمُزَيْنَةُ، وَجُهَيْنَةُ، وَأَسْلَمُ، وَغِفَارُ، وَأَشْجَعُ، مَوَالِيَّ لَيْسَ لَهُمْ مَوْلًى دُونَ اللهِ وَرَسُولِهِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14003,
                "hadithNumber": "6440",
                "englishNarrator": "A similar report was narrated from Sad bin Ibrahim with this chain of narrators, except that in Hadith (it says):",
                "hadithEnglish": "\"Sa'd said concerning some of this: 'As far as I know.\"",
                "hadithUrdu": "سعد نے ان میں سے بعض قبائل کے بارے میں کہا : \" میرے علم کے مطابق ۔ \"",
                "urduNarrator": "عبید اللہ بن معاذ کے والد نے کہا : ہمیں شعبہ نے سعد بن ابرا ہیم سے اسی سند کے ساتھ اسی کے مانند روایت کی ، مگر اس حدیث میں یہ ہے کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، بِهَذَا الإِسْنَادِ ‏.‏ مِثْلَهُ غَيْرَ أَنَّ فِي الْحَدِيثِ قَالَ سَعْدٌ فِي بَعْضِ هَذَا فِيمَا أَعْلَمُ.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14004,
                "hadithNumber": "6441",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The tribes of Ashja', Ghifar and Muzaina and from the tribe of Juhaina they are better than Banu Tamim, Banu Amir and the allies of Asad and Ghatfan.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : اسلم ، غفاراور مزینہ اور جو لوگ جہینہ سے ہیں یاآپ نے جہینہ فرما یا ، بنو تمیم اور بنو عامر اور دو باہمی حلیفوں اسد اور غطفان سے بہتر ہیں ۔ \"",
                "urduNarrator": "ہم سے محمد بن المثنیٰ نے بیان کیا، اور ہم سے محمد بن بشار نے بیان کیا، انہوں نے کہا: ہم سے ابن المثنیٰ نے بیان کیا، ہم سے محمد بن جعفر نے بیان کیا، ہم سے شعبہ نے بیان کیا، سعد بن ابرا ہیم سے روایت ہے ، کہا : میں نے ابو سلمہ سے سنا ، وہ حضرت ابو ہریرہ رضی اللہ عنہ سے اور نبی صلی اللہ علیہ وسلم سے روایت کر رہے تھے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالَ: ابْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، قَالَ: سَمِعْتُ أَبَا سَلَمَةَ، يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، أَنَّهُ قَالَ: «أَسْلَمُ، وَغِفَارُ، وَمُزَيْنَةُ، وَمَنْ كَانَ مِنْ جُهَيْنَةَ، أَوْ جُهَيْنَةُ، خَيْرٌ مِنْ بَنِي تَمِيمٍ، وَبَنِي عَامِرٍ، وَالْحَلِيفَيْنِ أَسَدٍ، وَغَطَفَانَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14005,
                "hadithNumber": "6442",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: By Him in Whose Hand is the life of Muhammad, (the tribes of) Ghifar, Aslam, Muzaina, or from the tribe of Juhaina or from the tribe of Muzaina, they would be better in the eye of Allah than Asad, Tayyi, and Ghatfan on the Day of Resurrection.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" اس ذات کی قسم جس کے ہاتھ میں محمد صلی اللہ علیہ وسلم کی جا ن ہے! یقیناً غفار ، اسلم مزینہ اورجو لوگ جہینہ سے ہیں یا آپ نے فرمایا : \" جہینہ اور جو لو گ مزینہ سے ہیں ( خود آکر اسلام قبول کرنے کی بنا پر ) قیامت کے دن اللہ کے نزدیک اسد طے اور غطفان سے بہتر ہوں گے ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا کہ ہم سے المغیرہ یعنی الحز امی نے بیان کیا, ابو زناد العرج کی سند سے ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ انہوں نے کہا: رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ہم سے عمرو نقید، حسن الحلوانی اور عبد بن حمید نے بیان کیا۔ عبدل نے کہا: اس نے مجھے بتایا، اور دوسرے دو نے کہا: اس نے ہم سے بیان کیا، یعقوب بن ابراہیم بن سعد، ہم سے میرے والد نے بیان کیا، صالح نے اعرج سے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا الْمُغِيرَةُ يَعْنِي الْحِزَامِيَّ، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: ح وَحَدَّثَنَا عَمْرٌو النَّاقِدُ وَحَسَنٌ الْحُلْوَانِيُّ، وَعَبْدُ بْنُ حُمَيْدٍ - قَالَ عَبْدٌ: أَخْبَرَنِي، وقَالَ الْآخَرَانِ: حَدَّثَنَا - يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ الْأَعْرَجِ، قَالَ: قَالَ أَبُو هُرَيْرَةَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَغِفَارُ، وَأَسْلَمُ، وَمُزَيْنَةُ، وَمَنْ كَانَ مِنْ جُهَيْنَةَ، - أَوْ قَالَ: جُهَيْنَةُ، وَمَنْ كَانَ مِنْ مُزَيْنَةَ، خَيْرٌ عِنْدَ اللهِ - يَوْمَ الْقِيَامَةِ، مِنْ أَسَدٍ، وَطَيِّئٍ، وَغَطَفَانَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14006,
                "hadithNumber": "6443",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Aslam, Ghifar or some people from Muzaina, Juhaina (with the variation of words) are better in the eye of Allah than Asad, Ghatfan, Hawizin and Tamim. The narrator said: I think he also said: On the Day of Resurrection.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" اسلم ، غفار اور مزینہ کے کچھ گھرا نے اور جہینہ یا جہینہ کے کچھ گھرا نے اور مزینہ ، اللہ کے نزدیک ۔ کہا : میرا خیال ہے ( محمد بن سیرین نے ) کہا ۔ ۔ قیامت کے دن اسد ، غطفان ، ہوازن اور تمیم سے ( جنھوں نے خود آکر اسلام قبول نہ کیا ) بہتر ہوں گے ۔ \"",
                "urduNarrator": "مجھ سے زہیر بن حرب اور یعقوب الدورقی نے بیان کیا، انہوں نے کہا: ہم سے اسماعیل یانیان بن اولیاء نے بیان کیا, ایوب نے محمد ( بن سیرین ) سے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَيَعْقُوبُ الدَّوْرَقِيُّ، قَالَا: حَدَّثَنَا إِسْمَاعِيلُ يَعْنِيَانِ ابْنَ عُلَيَّةَ، حَدَّثَنَا أَيُّوبُ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَأَسْلَمُ، وَغِفَارُ، وَشَيْءٌ مِنْ مُزَيْنَةَ، وَجُهَيْنَةَ، أَوْ شَيْءٌ مِنْ جُهَيْنَةَ، وَمُزَيْنَةَ، خَيْرٌ عِنْدَ اللهِ - قَالَ أَحْسِبُهُ قَالَ - يَوْمَ الْقِيَامَةِ، مِنْ أَسَدٍ، وَغَطَفَانَ، وَهَوَازِنَ، وَتَمِيمٍ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14007,
                "hadithNumber": "6444",
                "englishNarrator": "Abu Bakra reported from his father:",
                "hadithEnglish": "Al-Aqra' bin Habis رضی اللہ عنہ reported that he came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and said to him: How did the tribes of Aslam, Ghifar, Muzaina (and I think he also said Juhaina and the narrator is in doubt about it) owe allegiance to you, whereas they plundered the pilgrims? Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: you were to say that Aslam, Ghifar, Muzaina and I think Juhaina are better than Banu Tamim, Banu 'Amir and Asad, Ghatfan, then would these people (of latter group of tribes) be in loss? He said: Yes. Thereupon he (the Holy Prophet) said: By Him in Whose Hand is my life, these people are better than Banu Tamim, Banu Amir, Asad and Ghatfan, and in this hadith of Abu Shaiba (these words are not found) that Muhammad (the narrator) had a doubt about.",
                "hadithUrdu": "حضرت اقرع بن حابس ( تمیمی ) رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے اور کہا : آپ سے حاجیوں کا سامان چرا نے والے ( قبائل ) اسلم اور غفار اور مزینہ اور میرا خیال ہے جہینہ ( کابھی نام لیا ) ۔ ۔ ۔ محمد ( بن یعقوب ) ہیں جنھیں شک ہوا ۔ نے بیعت کر لی ہے تو رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" تمھا را کیا خیال ہے کہ اگر اسلم اور غفار اور مزینہ اور میرا خیال ہے ( آپ نے فرما یا ) جہینہ بنو تمیم ، بنو عامر بنو اسد اور غطفان سے بہتر ہوں تو کیا یہ ( قبیلے لوگوں کی نظر میں مرتبے کے اعتبار سے ) ناکام ہو جا ئیں گے ، خسارے میں رہیں گے؟ \" اس نے کہا : جی ہاں ۔ آپ نے فرما یا : \" مجھے اس ذات کی قسم جس کے ہاتھ میں میری جان ہے! وہ ان سے بہت بہتر ہیں ۔ \" ابن ابی شیبہ کی حدیث میں : \" محمد ( بن یعقوب ) ہیں جنھیں شک ہوا ۔ \" ( کے الفاظ ) نہیں ۔",
                "urduNarrator": "ابو بکربن ابی شیبہ نے ہمیں حدیث بیان کی ، کہا : ہمیں غندر نے شعبہ سے حدیث بیان کی ، اسی طرح محمد بن مثنیٰ اور ابن بشار نے حدیث بیان کی ، دونوں نے کہا : ہمیں محمد بن جعفر نے حدیث بیان کی ، کہا : ہمیں شعبہ نے محمد بن ابی یعقوب سے حدیث بیان کی ، کہا : میں نے عبدالرحمن بن ابی بکرہ سے سنا ، وہ اپنے والد سے حدیث بیان کررہے تھے  کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا غُنْدَرٌ، عَنْ شُعْبَةَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ أَبِي يَعْقُوبَ، سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرَةَ، يُحَدِّثُ عَنْ أَبِيهِ، أَنَّ الْأَقْرَعَ بْنَ حَابِسٍ، جَاءَ إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: إِنَّمَا بَايَعَكَ سُرَّاقُ الْحَجِيجِ مِنْ أَسْلَمَ، وَغِفَارَ، وَمُزَيْنَةَ، وَأَحْسِبُ جُهَيْنَةَ - مُحَمَّدٌ الَّذِي شَكَّ - فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَرَأَيْتَ إِنْ كَانَ أَسْلَمُ، وَغِفَارُ، وَمُزَيْنَةُ - وَأَحْسِبُ جُهَيْنَةُ - خَيْرًا مِنْ بَنِي تَمِيمٍ، وَبَنِي عَامِرٍ، وَأَسَدٍ، وَغَطَفَانَ، أَخَابُوا وَخَسِرُوا؟» فَقَالَ: نَعَمْ، قَالَ: «فَوَالَّذِي نَفْسِي بِيَدِهِ إِنَّهُمْ لَأَخْيَرُ مِنْهُمْ» وَلَيْسَ فِي حَدِيثِ ابْنِ أَبِي شَيْبَةَ: مُحَمَّدٌ الَّذِي شَكَّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14008,
                "hadithNumber": "6445",
                "englishNarrator": null,
                "hadithEnglish": "The chief of Banu Tamim, Muhammad bin Abdullah bin Abi Yaqub Ad-Dabbi narrated a similar report (as Hadith no. 6444) with this chain of narrators, and he said: \"and Juhainah\" and he did not say: \"I think.\"",
                "hadithUrdu": "عبد الصمد نے ہمیں حدیث بیان کی ، کہا : ہمیں شعبہ نے حدیث سنائی کہا : مجھے بنو تمیم کے سردار محمد بن عبد اللہ بن ابی یعقوب ضبی نے اسی سند کے ساتھ اسی کے مانند حدیث سنائی اور انھوں نے صرف جہینہ کہا : ۔ \" میرا خیال ہے \" ( کاجملہ ) نہیں کہا ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللهِ، حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنِي سَيِّدُ بَنِي تَمِيمٍ مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ أَبِي يَعْقُوبَ الضَّبِّيُّ، بِهَذَا الْإِسْنَادِ مِثْلَهُ. وَقَالَ وَجُهَيْنَةُ وَلَمْ يَقُلْ أَحْسِبُ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14009,
                "hadithNumber": "6446",
                "englishNarrator": "Abu Bakra reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) that Aslam, Ghifar, Muzaina and Juhaina are better than Banu Tamim, Banu Amir and their allies Banu Asad and Ghatfan.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فر مایا : \" \" اسلم ، غفار مزینہ اور جہینہ بنو تمیم ، بنو عامر اور دو حلیف قبیلوں بنو اسد اور بنو غطفان سے بہتر ہیں ۔",
                "urduNarrator": "نصر بن علی جہضمی کے والد نے ہمیں حدیث بیان کی ، کہا : ہمیں شعبہ نے ابو بشر سے ، انھوں نے عبد الرحمن بن ابی بکرہ سے انھوں نے اپنے والد سے اور انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے حدیث بیان کی کہ",
                "hadithArabic": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي بِشْرٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ، عَنْ أَبِيهِ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَسْلَمُ، وَغِفَارُ، وَمُزَيْنَةُ، وَجُهَيْنَةُ، خَيْرٌ مِنْ بَنِي تَمِيمٍ، وَمِنْ بَنِي عَامِرٍ، وَالْحَلِيفَيْنِ، بَنِي أَسَدٍ، وَغَطَفَانَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14010,
                "hadithNumber": "6447",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been reported on the authority of Abu Bishr with the same chain of transmitters.",
                "hadithUrdu": "ہم سے محمد بن المثنی اور ہارون بن عبداللہ نے بیان کیا، انہوں نے کہا: عبد الصمد اور شبابہ بن سوار نے کہا : ہمیں شعبہ نے ابوبشر سے اسی سند کے ساتھ حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَهَارُونُ بْنُ عَبْدِ اللهِ، قَالَا: حَدَّثَنَا عَبْدُ الصَّمَدِ، ح وحَدَّثَنِيهِ عَمْرٌو النَّاقِدُ، حَدَّثَنَا شَبَابَةُ بْنُ سَوَّارٍ، قَالَا: حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي بِشْرٍ، بِهَذَا الْإِسْنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14011,
                "hadithNumber": "6448",
                "englishNarrator": "Abu Bakra reported on the authority of his father:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: What is your view if Juhaina, Aslam, Ghifar were better than Banu Tamim, Banu 'Abdullah bin Ghatfan and 'Amir bin Sa'sa'a' respectively (then what would be status of the latter one)? He said this in a loud voice. They said: Allah's Messenger, they would be definitely at a loss and disadvantage. Thereupon he said: They (the first group) are decidedly better than the others; and in the hadith transmitted on the authority of Abu Kuraib the words are: It you were to find that Juhaina, Muzaina and Aslam and Ghifar (are better than...).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" تم لوگ کیا سمجھتے ہو اگر جہینہ ، اسلم اور غفار بنو تمیم ، بنو عبد اللہ بن غطفان اور عامر بن صعصہ سے بہتر ہوں ۔ \" اور ( پوچھتے ہو ئے ) آپ نے آواز بلند کی تو صحابہ کرام رضوان اللہ عنھم اجمعین نے کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! پھر وہ ( لوگوں کے نزدیک اپنی عزت بڑھانے میں ) ناکام ہوں گے اورکم مرتبہ ہو جائیں گے ۔ آپ نے فرما یا : \" بے شک وہ ان سے بہتر ہیں ۔ \" ابو کریب کی روایت میں ہے : \" تم کیا سمجھتے ہو اگر جہینہ اور مزینہ اور اسلم اور غفار \" ( مزینہ کے نام کا اضافہ ہے جس طرح متعدد دوسری روایات میں بھی مزینہ کا نا م شامل ہے )",
                "urduNarrator": "ابو بکر بن ابی شیبہ اور کریب نے ۔ ۔ ۔ اور الفاظ ابو بکر کے ہیں ۔ ۔ ۔ حدیث بیان کی ، دونوں نے کہا : ہمیں وکیع نے سفیان سے حدیث بیان کی ، انھوں نے عبد الملک بن عمیر سے ، انھوں نے عبد الرحمٰن بن ابی بکرہ سے انھوں نے اپنے والد سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ - وَاللَّفْظُ لِأَبِي بَكْرٍ - قَالَا: حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ، عَنْ أَبِيهِ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَرَأَيْتُمْ إِنْ كَانَ جُهَيْنَةُ، وَأَسْلَمُ، وَغِفَارُ، خَيْرًا مِنْ بَنِي تَمِيمٍ، وَبَنِي عَبْدِ اللهِ بْنِ غَطَفَانَ، وَعَامِرِ بْنِ صَعْصَعَةَ» وَمَدَّ بِهَا صَوْتَهُ فَقَالُوا: يَا رَسُولَ اللهِ فَقَدْ خَابُوا وَخَسِرُوا، قَالَ: «فَإِنَّهُمْ خَيْرٌ» وَفِي رِوَايَةِ أَبِي كُرَيْبٍ «أَرَأَيْتُمْ إِنْ كَانَ جُهَيْنَةُ، وَمُزَيْنَةُ، وَأَسْلَمُ، وَغِفَارُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14012,
                "hadithNumber": "6449",
                "englishNarrator": "Adi bin Hatim reported:",
                "hadithEnglish": "I came to Umar bin Khattab رضی اللہ عنہ and he said to me: The first consignment of Sadaqa brought to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) which brightened the face of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and the faces of his Companions was that of Tayyi.",
                "hadithUrdu": "میں حضرت عمر بن خطاب رضی اللہ عنہ کے پاس آیا تو انھوں نے مجھ سے کہا : سب سے پہلا صدقہ ( باقاعدہ وصول شدہ زکاۃ ) جس نے رسول اللہ صلی اللہ علیہ وسلم اور آپ کے صحا بہ کرام رضوان اللہ عنھم اجمعین کے چہروں کو روشن کر دیا تھا بنو طے کا صدقہ تھا ، جس کو آپ ( عدی رضی اللہ عنہ ) رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں لے کر آئے تھے ۔",
                "urduNarrator": "ہم سے زہیر بن حرب نے بیان کیا، کہا ہم سے احمد بن اسحاق نے بیان کیا، کہا ہم سے ابو عونہ نے بیان کیا، وہ مغیرہ کی سند سے، انہوں نے عامر کی سند سے, عدی بن حاتم سے روایت ہے ، کہا",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا أَحْمَدُ بْنُ إِسْحَاقَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ مُغِيرَةَ، عَنْ عَامِرٍ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ: أَتَيْتُ عُمَرَ بْنَ الْخَطَّابِ، فَقَالَ لِي: «إِنَّ أَوَّلَ صَدَقَةٍ بَيَّضَتْ وَجْهَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَوُجُوهَ أَصْحَابِهِ، صَدَقَةُ طَيِّئٍ، جِئْتَ بِهَا إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14013,
                "hadithNumber": "6450",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Tufail رضی اللہ عنہ and his companions said: Allah's Messenger ﷺ, the tribe of Daws has disbelieved and has belied you, so invoke curse upon them. It was said: Let Daws be destroyed, whereupon he (Allah's Messenger ﷺ) said: Allah guide aright the tribe of Daws and direct them to me.",
                "hadithUrdu": "حضرت طفیل ( بن عمرو دوسی ) رضی اللہ عنہ اور ان کے ساتھی آئے اور آکر عرض کی : اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! ( ہمارے قبیلے ) دوس نے کفر کیا اور ( اسلام لا نے سے ) انکا ر کیا ، آپ ان کے خلا ف دعا کیجیے! ( بعض لوگوں کی طرف سے ) کہا گیا ۔ کہ اب دوس ہلا ک ہو گئے ۔ ( لیکن ) آپ نے ( دعا کرتے ہو ئے ) فر ما یا : \" اے اللہ !دوس کو ہدایت دےاور ان کو ( یہاں ) لےآ ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا ہم سے المغیرہ بن عبدالرحمٰن نے بیان کیا، انہوں نے ابو الزناد سے، انہوں نے العرج کی سند سے, حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَدِمَ الطُّفَيْلُ وَأَصْحَابُهُ فَقَالُوا: يَا رَسُولَ اللهِ إِنَّ دَوْسًا قَدْ كَفَرَتْ وَأَبَتْ، فَادْعُ اللهَ عَلَيْهَا فَقِيلَ: هَلَكَتْ دَوْسٌ فَقَالَ: «اللهُمَّ اهْدِ دَوْسًا وَائْتِ بِهِمْ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 13701,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=548",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=546",
                "label": "546",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=547",
                "label": "547",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=548",
                "label": "548",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=549",
                "label": "549",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=550",
                "label": "550",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=551",
                "label": "551",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=552",
                "label": "552",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=550",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=550",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=548",
        "to": 13725,
        "total": 40465
    }
}