{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 375,
        "data": [
            {
                "id": 9639,
                "hadithNumber": "2075",
                "englishNarrator": "Anas bin Malik رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) prayed for rain pointing the back of his hands to the sky.",
                "hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم نے بارش مانگنے کے لیے دعا فرمائی تو اپنے ہاتھوں کی پشت کے ساتھ آسمان کی طرف اشارہ کیا ۔",
                "urduNarrator": "اور ہم سے عبد بن حمید نے بیان کیا، کہا ہم سے حسن بن موسیٰ نے بیان کیا، انہوں نے بیان کیا  حمادبن سلمہ نے ثابت سے اور انھوں نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے ر وایت کی کہ",
                "hadithArabic": "و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ ثَابِتٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَسْقَى فَأَشَارَ بِظَهْرِ كَفَّيْهِ إِلَى السَّمَاءِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "10",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 110,
                    "chapterNumber": "10",
                    "chapterEnglish": "The Book of Prayer - Rain",
                    "chapterUrdu": "بارش طلب کرنے کی نماز",
                    "chapterArabic": "كتاب صَلَاةِ الِاسْتِسْقَاءِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9640,
                "hadithNumber": "2076",
                "englishNarrator": "Anas رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was not accustomed to raice his hands in any supplication he made except when praying for rain. (He would then raise [his hands] high enough) that the whiteness of his armpits became visible. 'Abd al-A'la said that (he was in doubt whether it was) the whiteness of his armpit or armpits.",
                "hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم استسقاء کے سوا کسی اور دعا کے لئے اپنے ہاتھ ( اتنے زیادہ ) بلند نہیں کرتےتھے ۔ یہاں تک کہ اس سے آپ کی بغلوں کی سفیدی دیکھائی دینے لگتی ، البتہ عبدالاعلیٰ نے ( شک کے ساتھ ) کہا \" يري بياض ابطه اوبياض ابطيه \" ( آپ کی بغل کی سفیدی یا دونوں بغلوں کی سفیدی دیکھائی دینے لگتی ۔ )",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا, ابن ابی عدی اور عبدالاعلیٰ نے سعید ( بن ابی عروبہ ) سے ، انھوں نے قتادہ سے اور انھوں نے حضرت انس رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ وَعَبْدُ الْأَعْلَى عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ أَنَسٍ أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ لَا يَرْفَعُ يَدَيْهِ فِي شَيْءٍ مِنْ دُعَائِهِ إِلَّا فِي الِاسْتِسْقَاءِ حَتَّى يُرَى بَيَاضُ إِبْطَيْهِ غَيْرَ أَنَّ عَبْدَ الْأَعْلَى قَالَ يُرَى بَيَاضُ إِبْطِهِ أَوْ بَيَاضُ إِبْطَيْهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "10",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 110,
                    "chapterNumber": "10",
                    "chapterEnglish": "The Book of Prayer - Rain",
                    "chapterUrdu": "بارش طلب کرنے کی نماز",
                    "chapterArabic": "كتاب صَلَاةِ الِاسْتِسْقَاءِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9641,
                "hadithNumber": "2077",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated by Anas bin Malik رضی اللہ تعالیٰ عنہ through another chain of transmitters.",
                "hadithUrdu": "ہم سے ابن المثنی نے بیان کیا، کہا ہم سےیحییٰ بن سعید نے ( سعید ) بن ابی عروبہ سے اور انھوں نے قتادہ سے روایت کی کہ ان کو حضرت انس بن مالک رضی اللہ تعالیٰ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے اسی ( سابقہ حدیث ) کے ہم معنی حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ ابْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ أَنَّ أَنَسَ بْنَ مَالِكٍ حَدَّثَهُمْ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "10",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 110,
                    "chapterNumber": "10",
                    "chapterEnglish": "The Book of Prayer - Rain",
                    "chapterUrdu": "بارش طلب کرنے کی نماز",
                    "chapterArabic": "كتاب صَلَاةِ الِاسْتِسْقَاءِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9642,
                "hadithNumber": "2078",
                "englishNarrator": "Anas bin Malik رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "A person entered the mosque through the door situated on theside of Daral-Qada' during Friday (prayer) and the messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was delivering the sermon while standing. He came and stood in front of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and said: Messenger of Allah, the camels died and the passages were blocked; so supplicate Allah to send down rain upon us. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) raised his hands and then said: (O Allah, send down rain upon us; O Allah, send dowp rain upon us; O Allah, send down rain upon us. Anas رضی اللہ تعالیٰ عنہ said: By Allah, we did not see any cloud or any patch of it, and there was neither any house or building standing between us and the (hillock) Sal'a. There appeared a cloud in the shape of a shield from behind it, and as it (came high) in the sky it spread and then there was a downpour of rain. By Allah, we did not see the sun throughout the week. Then (that very man) came on the coming Friday through the same door when the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was standing and delivering the sermon. He stood in front of him and said: Messenger of Allah, our animals died and the passages blocked. Supplicate Allah to stop the rain for us. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) again raised his hands and said: O Allah, let it (rain) fall in our suburbs and not on us, O Allah (send it down) on the hillocks and small mountains and the river-beds and at places where trees grow. The rain stopped, and as we stepped out we were walking in sun- shine. He (the narrator) said to Sharik: I asked Anas bin Malik رضی اللہ تعالیٰ عنہ if he was the same man. He said: I do not know.",
                "hadithUrdu": "جمعے کے روز ایک آدمی اس دروازے سے مسجد میں داخل ہوا جو دارالقضاء کی طرف تھا اور رسول اللہ صلی اللہ علیہ وسلم کھڑے خطبہ ارشاد فرمارہے تھے ، اس نے کھڑے کھڑے رسول اللہ صلی اللہ علیہ وسلم کی طرف رخ کیا ، پھر کہا : اےاللہ کے رسول صلی اللہ علیہ وسلم !مال مویشی ہلاک ہوگئے اور راستے منقطع ہوچکے ، اللہ تعالیٰ سے دعا فرمائیں کہ وہ ہمیں بارش عطا کرے ۔ اس پر رسول اللہ صلی اللہ علیہ وسلم نے اپنے دونوں ہاتھ اٹھا دیئے ، پھر کہا : \"\" اے اللہ!ہمیں بارش عنایت فرما ، اے اللہ!ہمیں بارش عنایت فرما ، اے اللہ!ہمیں بارش سے نوازدے ۔ \"\" حضرت انس رضی اللہ تعالیٰ عنہ نے کہا : اللہ کی قسم!ہم آسمان میں نہ کوئی گھٹا دیکھ رہے تھے اور نہ بادل کا کوئی ٹکڑا ۔ ہمارے اور سلع پہاڑ کے درمیان کوئی گھر تھا نہ محلہ ۔ پھر اس کے پیچھے سے ڈھال جیسی چھوٹی سی بدلی اٹھی ، جب وہ آسمان کے وسط میں پہنچی تو پھیل گئی ، پھر وہ برسی ، اللہ کی قسم!ہم نے ہفتہ بھر سورج نہ دیکھا ۔ پھر اگلے جمعے اسی دروازے سے ایک آدمی داخل ہوا ، رسول اللہ صلی اللہ علیہ وسلم کھڑے خطبہ ارشاد فرمارہے تھے ، اس نے کھڑے کھڑے آپ صلی اللہ علیہ وسلم کی طرف رخ کرکے کہا : اے اللہ کے رسول صلی اللہ علیہ وسلم ! ( بارش کی کثرت سے ) مال مویشی ہلاک ہوگئے اور راستے بند ہوگئے ، اس لئے اللہ تعالیٰ سے دعا فرمائیں کہ وہ ہم سے بارش روک لے ۔ اس پر رسول اللہ صلی اللہ علیہ وسلم نے دونوں ہاتھ اٹھادیے ، پھر فرمایا : \"\" اے اللہ!ہمارے ارد گرد ( بارش برسا ) ہم پر نہیں ، اے اللہ!پہاڑیوں پر ، ٹیلوں پر ، وادیوں کے اندر ( ندیوں میں ) اور درخت اگنے کے مقامات پر ( برسا ۔ ) \"\" کہا : \"\" ( فوراً ) بادل چھٹ گئے اور ہم ( مسجد سے ) نکلے تو دھوپ میں چل رہے تھے ۔ شریک نے کہا : میں نے حضرت انس رضی اللہ تعالیٰ عنہ سے پوچھا : کیا وہ پہلے آدمی تھا؟انھوں نے جواب دیا : میں نہیں جانتا ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ، یحییٰ بن ایوب، قتیبہ اور ابن حجر نے بیان کیا اور ہم سے یحییٰ نے بیان کیا, شریک بن ابی نمر نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَيَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ وَابْنُ حُجْرٍ قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الْآخَرُونَ حَدَّثَنَا إِسْمَعِيلُ بْنُ جَعْفَرٍ عَنْ شَرِيكِ بْنِ أَبِي نَمِرٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ رَجُلًا دَخَلَ الْمَسْجِدَ يَوْمَ جُمُعَةٍ مِنْ بَابٍ كَانَ نَحْوَ دَارِ الْقَضَاءِ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَائِمٌ يَخْطُبُ فَاسْتَقْبَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَائِمًا ثُمَّ قَالَ يَا رَسُولَ اللَّهِ هَلَكَتْ الْأَمْوَالُ وَانْقَطَعَتْ السُّبُلُ فَادْعُ اللَّهَ يُغِثْنَا قَالَ فَرَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَيْهِ ثُمَّ قَالَ اللَّهُمَّ أَغِثْنَا اللَّهُمَّ أَغِثْنَا اللَّهُمَّ أَغِثْنَا قَالَ أَنَسٌ وَلَا وَاللَّهِ مَا نَرَى فِي السَّمَاءِ مِنْ سَحَابٍ وَلَا قَزَعَةٍ وَمَا بَيْنَنَا وَبَيْنَ سَلْعٍ مِنْ بَيْتٍ وَلَا دَارٍ قَالَ فَطَلَعَتْ مِنْ وَرَائِهِ سَحَابَةٌ مِثْلُ التُّرْسِ فَلَمَّا تَوَسَّطَتْ السَّمَاءَ انْتَشَرَتْ ثُمَّ أَمْطَرَتْ قَالَ فَلَا وَاللَّهِ مَا رَأَيْنَا الشَّمْسَ سَبْتًا قَالَ ثُمَّ دَخَلَ رَجُلٌ مِنْ ذَلِكَ الْبَابِ فِي الْجُمُعَةِ الْمُقْبِلَةِ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَائِمٌ يَخْطُبُ فَاسْتَقْبَلَهُ قَائِمًا فَقَالَ يَا رَسُولَ اللَّهِ هَلَكَتْ الْأَمْوَالُ وَانْقَطَعَتْ السُّبُلُ فَادْعُ اللَّهَ يُمْسِكْهَا عَنَّا قَالَ فَرَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَيْهِ ثُمَّ قَالَ اللَّهُمَّ حَوْلَنَا وَلَا عَلَيْنَا اللَّهُمَّ عَلَى الْآكَامِ وَالظِّرَابِ وَبُطُونِ الْأَوْدِيَةِ وَمَنَابِتِ الشَّجَرِ فَانْقَلَعَتْ وَخَرَجْنَا نَمْشِي فِي الشَّمْسِ قَالَ شَرِيكٌ فَسَأَلْتُ أَنَسَ بْنَ مَالِكٍ أَهُوَ الرَّجُلُ الْأَوَّلُ قَالَ لَا أَدْرِي.",
                "headingArabic": "الدُّعَاءِ فِي الاِسْتِسْقَاءِ ‏",
                "headingUrdu": "بارش کی دعا کرتے وقت دعا",
                "headingEnglish": "The Supplication When Praying For Rain",
                "chapterId": "10",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 110,
                    "chapterNumber": "10",
                    "chapterEnglish": "The Book of Prayer - Rain",
                    "chapterUrdu": "بارش طلب کرنے کی نماز",
                    "chapterArabic": "كتاب صَلَاةِ الِاسْتِسْقَاءِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9643,
                "hadithNumber": "2079",
                "englishNarrator": "Anas bin Malik رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "The people were in the grip of famine during the lifetime of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), and (once) as the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was delivering the sermon standing on the pulpit on Friday, a bedouin stood up and said: Messenger of Allah, the animals died and the children suffered starvation. The rest of the hadith is the same (and the words are) that he (the Holy Prophet) said: O Allah, send down rain in our suburbs but not on us. He (the narrator) said: To whichever directions he pointed with his hands, the clouds broke up and I saw Medina like the opening of a (courtyard) and the stream of Qanat flowed for one month, and none came from any part (of Arabia) but with the news of heavy rainfall.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں لوگوں کوخشک سالی نے آلیا ۔ اسی اثنا میں کہ رسول اللہ صلی اللہ علیہ وسلم جمعے کے دن منبر پر لوگوں کے سامنے خطبہ دے رہے تھے کہ اچانک ایک بدوی کھڑا ہوا اور کہا : اے اللہ کے رسول : مال مویشی ہلاک ہوگئے ، بال بچے بھوکے مرنے لگے ۔ ۔ ۔ ( آگے ) اسی ( سابقہ حدیث ) کے ہم معنی حدیث بیان کی ۔ اور اس میں ہے ، آپ صلی اللہ علیہ وسلم نے فرمایا : \" ا ے اللہ!ہمارے ارد گرد ( برسا ) ہمارے اوپر نہیں ۔ \" کہا : اور آپ اپنے ہاتھ سے جس طرف بھی اشارہ کرتے تھے اسی طرف سے بادل چھٹ جاتے تھےحتیٰ کہ میں نے مدینہ منورہ کو ( زمین کے ) خالی ٹکڑے کے مانند دیکھا اور وادی قناۃ ایک ماہ تک بہتی رہی اور کسی طرف سے بھی کوئی شخص نہیں آیا مگر اس نے موسلادھار بارش کی خبر دی ۔",
                "urduNarrator": "ہم سے داؤد بن راشد نے بیان کیا، کہا ہم سے ولید بن مسلم نے بیان کیا، انہوں نے اوزاعی کی سند سے بیان کیا, اسحق بن عبداللہ بن ابی طلحہ نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نےکہا",
                "hadithArabic": "و حَدَّثَنَا دَاوُدُ بْنُ رُشَيْدٍ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ عَنْ الْأَوْزَاعِيِّ حَدَّثَنِي إِسْحَقُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ أَصَابَتْ النَّاسَ سَنَةٌ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَبَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ النَّاسَ عَلَى الْمِنْبَرِ يَوْمَ الْجُمُعَةِ إِذْ قَامَ أَعْرَابِيٌّ فَقَالَ يَا رَسُولَ اللَّهِ هَلَكَ الْمَالُ وَجَاعَ الْعِيَالُ وَسَاقَ الْحَدِيثَ بِمَعْنَاهُ وَفِيهِ قَالَ اللَّهُمَّ حَوَالَيْنَا وَلَا عَلَيْنَا قَالَ فَمَا يُشِيرُ بِيَدِهِ إِلَى نَاحِيَةٍ إِلَّا تَفَرَّجَتْ حَتَّى رَأَيْتُ الْمَدِينَةَ فِي مِثْلِ الْجَوْبَةِ وَسَالَ وَادِي قَنَاةَ شَهْرًا وَلَمْ يَجِئْ أَحَدٌ مِنْ نَاحِيَةٍ إِلَّا أَخْبَرَ بِجَوْدٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "10",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 110,
                    "chapterNumber": "10",
                    "chapterEnglish": "The Book of Prayer - Rain",
                    "chapterUrdu": "بارش طلب کرنے کی نماز",
                    "chapterArabic": "كتاب صَلَاةِ الِاسْتِسْقَاءِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9644,
                "hadithNumber": "2080",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "While the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was delivering the sermon on Friday, people stood up before him and said in a loud voice: Apostle of Allah, there is a drought and the trees have become yellow, the animals have died; and the rest of the hadith is the same, and in the narration transmitted by 'Abd al-A'la the words are: The clouds cleard from Medina and it began to rain around it and not a single drop of rain fell in Medina. And as I looked towards Medina, I found it hollow like (the hollowness of) a basin.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم جمعے کے دن خطبہ دے رہے تھے کہ لوگ آپ کے سامنے کھڑے ہوگئے ، ( بات شروع کرنے والے بدو کے ساتھ دوسرے بھی شامل ہوگئے ) وہ فریاد کرنے لگے اور کہنے لگے : اےاللہ کے نبی !بارش بندہوگئی ، درختوں ( کے پتے سوکھ کر ) سرخ ہوگئے اور مویشی ہلاک ہوگئے ۔ ۔ ۔ اور ( آگے مذکورہ بالا حدیث کے مانند ) حدیث بیان کی ۔ اس میں عبدالاعلیٰ کی روایت سے یہ ( الفاظ ) ہیں : مدینہ سے بادل چھٹ گئے اور اس کے ارد گرد بارش برسانے لگے جبکہ مدینہ میں ایک قطرہ بھی نہیں برس رہاتھا میں نے مدینہ کو دیکھا وہ ایک طرح کے تاج کے اندر ( بارش سے محفوظ ) تھا ۔",
                "urduNarrator": "عبدالاعلیٰ بن حماد اور محمد بن ابی بکر مقدمی نے کہا : ہمیں معتمر نے حدیث بیا ن کی ، انھوں نے کہا : ہمیں عبیداللہ نے ثابت بنانی سے انس بن مالک رضی اللہ عنہ نے کہا, اور انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنِي عَبْدُ الْأَعْلَى بْنُ حَمَّادٍ وَمُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ قَالَا حَدَّثَنَا مُعْتَمِرٌ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ يَوْمَ الْجُمُعَةِ فَقَامَ إِلَيْهِ النَّاسُ فَصَاحُوا وَقَالُوا يَا نَبِيَّ اللَّهِ قَحَطَ الْمَطَرُ وَاحْمَرَّ الشَّجَرُ وَهَلَكَتْ الْبَهَائِمُ وَسَاقَ الْحَدِيثَ وَفِيهِ مِنْ رِوَايَةِ عَبْدِ الْأَعْلَى فَتَقَشَّعَتْ عَنْ الْمَدِينَةِ فَجَعَلَتْ تُمْطِرُ حَوَالَيْهَا وَمَا تُمْطِرُ بِالْمَدِينَةِ قَطْرَةً فَنَظَرْتُ إِلَى الْمَدِينَةِ وَإِنَّهَا لَفِي مِثْلِ الْإِكْلِيلِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "10",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 110,
                    "chapterNumber": "10",
                    "chapterEnglish": "The Book of Prayer - Rain",
                    "chapterUrdu": "بارش طلب کرنے کی نماز",
                    "chapterArabic": "كتاب صَلَاةِ الِاسْتِسْقَاءِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9645,
                "hadithNumber": "2081",
                "englishNarrator": "This hadith has been narrated on the authority of Anas رضی اللہ تعالیٰ عنہ but with this addition:",
                "hadithEnglish": "Allah gathered the clouds and as we (were obliged) to stay back I saw that even the strong man, impelled by a desire to go to his family, (could not do so).",
                "hadithUrdu": "اللہ تعالیٰ نے بادلوں کو جوڑ دیا اور ہم اسی ( حالت ) میں رہے حتیٰ کہ میں نے دیکھا ایک قوی اور مضبوط آدمی کو بھی اس کا دل ( بارش کی کثرت کی بناء پر ) اس فکر میں مبتلا کردیتاتھا کہ وہ ا پنے اہل وعیال کے پاس پہنچے ۔",
                "urduNarrator": "ہم سے ابو کریب نے بیان کیا، ہم سے ابو اسامہ نے بیان کیا, سلمان بن مغیرۃ نے ثابت اور انھوں نے حضرت انس رضی اللہ تعالیٰ عنہ سے اسی کے ہم معنی روایت کی اور یہ اضافہ کیا",
                "hadithArabic": "و حَدَّثَنَاه أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ سُلَيْمَانَ بْنِ الْمُغِيرَةِ عَنْ ثَابِتٍ عَنْ أَنَسٍ بِنَحْوِهِ وَزَادَ فَأَلَّفَ اللَّهُ بَيْنَ السَّحَابِ وَمَكَثْنَا حَتَّى رَأَيْتُ الرَّجُلَ الشَّدِيدَ تَهُمُّهُ نَفْسُهُ أَنْ يَأْتِيَ أَهْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "10",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 110,
                    "chapterNumber": "10",
                    "chapterEnglish": "The Book of Prayer - Rain",
                    "chapterUrdu": "بارش طلب کرنے کی نماز",
                    "chapterArabic": "كتاب صَلَاةِ الِاسْتِسْقَاءِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9646,
                "hadithNumber": "2082",
                "englishNarrator": "Ubaidullah bin Anas bin Malik heard (his father) Anas bin Malik رضی اللہ تعالیٰ عنہ as saying:",
                "hadithEnglish": "A bedouin came to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) on Friday as he was (delivering the sermon on his) pulpit; and the rest of the hadith is the same but with this addition: I saw the cloud clearing just as a sheet is folded.",
                "hadithUrdu": "جمعے کے دن ایک اعرابی رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا جبکہ آپ منبر پر تھے ۔ ۔ ۔ ( آگے مذکورہ بالاحدیث کے مانند ) حدیث بیان کی اور اس میں یہ اضافہ کیا : میں نے بادل کو دیکھاوہ اس طرح چھٹ رہا تھا جیسے وہ ایک بڑی چادر ہوجب اسے لپیٹا جارہا ہو ۔",
                "urduNarrator": "ہم سے ہارون بن سعید الایلی نے بیان کیا، ہم سے ابن وہب نے بیان کیا، مجھ سے اسامہ نے بیان کیا, حفص بن عبیداللہ بن انس بن مالک نے بیان کیاکہ انھوں نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے سنا ، وہ کہہ رہے تھے",
                "hadithArabic": "و حَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ حَدَّثَنَا ابْنُ وَهْبٍ حَدَّثَنِي أُسَامَةُ أَنَّ حَفْصَ بْنَ عُبَيْدِ اللَّهِ بْنِ أَنَسِ بْنِ مَالِكٍ حَدَّثَهُ أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ يَقُولُ جَاءَ أَعْرَابِيٌّ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْجُمُعَةِ وَهُوَ عَلَى الْمِنْبَرِ وَاقْتَصَّ الْحَدِيثَ وَزَادَ فَرَأَيْتُ السَّحَابَ يَتَمَزَّقُ كَأَنَّهُ الْمُلَاءُ حِينَ تُطْوَى.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "10",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 110,
                    "chapterNumber": "10",
                    "chapterEnglish": "The Book of Prayer - Rain",
                    "chapterUrdu": "بارش طلب کرنے کی نماز",
                    "chapterArabic": "كتاب صَلَاةِ الِاسْتِسْقَاءِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9647,
                "hadithNumber": "2083",
                "englishNarrator": "Anas (bin Malik) رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "It rained upon us as we were with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). The Messenger of Allah (صلی اللہ علیہ وسلم) removed his cloth (from a part of his body) till the rain fell on it. We said: Messenger of Allah, why did you do this? He said: It is because it (the rainfall) has just come from the Exalted Lord.",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے کہ ہم پر بارش برسنے لگی تو رسول اللہ صلی اللہ علیہ وسلم اپنا ( سر اور کندھے کا کپڑا ) کھول دیا حتیٰ کہ بارش آپ پر آنے لگی ۔ ہم نے عرض کی : اے اللہ کے رسول صلی اللہ علیہ وسلم !آپ نے ایسا کیوں کیا؟آپ نے فرمایا : \" کیونکہ وہ نئی نئی ( سیدھی ) اپنے رب عزوجل کی طرف سے آرہی ہے ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا ہم سے جعفر بن سلیمان نے بیان کیا، ثابت البنانی کی سند سے, حضرت انس رضی اللہ تعالیٰ عنہ نے کہا",
                "hadithArabic": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا جَعْفَرُ بْنُ سُلَيْمَانَ عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ أَنَسٍ قَالَ قَالَ أَنَسٌ أَصَابَنَا وَنَحْنُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَطَرٌ قَالَ فَحَسَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَوْبَهُ حَتَّى أَصَابَهُ مِنْ الْمَطَرِ فَقُلْنَا يَا رَسُولَ اللَّهِ لِمَ صَنَعْتَ هَذَا قَالَ لِأَنَّهُ حَدِيثُ عَهْدٍ بِرَبِّهِ تَعَالَى.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "10",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 110,
                    "chapterNumber": "10",
                    "chapterEnglish": "The Book of Prayer - Rain",
                    "chapterUrdu": "بارش طلب کرنے کی نماز",
                    "chapterArabic": "كتاب صَلَاةِ الِاسْتِسْقَاءِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9648,
                "hadithNumber": "2084",
                "englishNarrator": "Ata' bin Abi Rabah reported:",
                "hadithEnglish": "He heard 'A'isha رضی اللہ عنہا , the wife of the Messenger of Allah (way peace be upon him), as saying: When there was on any day windstorm or dark cloud (its effects) could be read on the face of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), and he moved forward and backward (in a state of anxiety) ; and when it rained, he was delighted and it (the state of restlessness) disappeared. 'A'isha رضی اللہ تعالیٰ عنہا said: I asked him the reason of this anxiety and he said: I was afraid that it might be a calamity that might fall upon my Ummah, and when he saw rainfall he said: It is the mercy (of Allah).",
                "hadithUrdu": "انھوں نے نبی کریم صلی اللہ علیہ وسلم کی ذوجہ محترمہ حضرت عائشہ رضی اللہ عنہا کو کہتے ہوئے سنا : رسول اللہ صلی اللہ علیہ وسلم کی عادت مبارکہ تھیں کہ جب آندھی یا بادل کا دن ہوتا تو آپ کے چہرہ مبارک پر اس کا اثر پہچانا جاسکتا تھا ، آپ صلی اللہ علیہ وسلم ( اضطراب کے عالم میں ) کبھی آگے جاتے اور کبھی پیچھے ہٹتے ، پھر جب بارش برسناشروع ہوجاتی تو آپ اس سے خوش ہوجاتے اور وہ ( پہلی کیفیت ) آ پ سے دور ہوجاتی ، حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : میں نے ( ایک بار ) آپ سے ( اس کا سبب ) پوچھا تو آپ نے فرمایا : \" میں ڈر گیا کہ یہ عذاب نہ ہو جو میری امت پر مسلط کردیا گیا ہو \" اور بارش کو دیکھ لیتے تو فرماتے \" رحمت ہے ۔ \"",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ بن قعنب نے بیان کیا، کہا کہ ہم سے سلیمان نے، یعنی ابن بلال نے بیان کیا, جعفر بن محمد نے عطاء بن ابی ر باح سے روایت کی",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ حَدَّثَنَا سُلَيْمَانُ يَعْنِي ابْنَ بِلَالٍ عَنْ جَعْفَرٍ وَهُوَ ابْنُ مُحَمَّدٍ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ أَنَّهُ سَمِعَ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَقُولُ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كَانَ يَوْمُ الرِّيحِ وَالْغَيْمِ عُرِفَ ذَلِكَ فِي وَجْهِهِ وَأَقْبَلَ وَأَدْبَرَ فَإِذَا مَطَرَتْ سُرَّ بِهِ وَذَهَبَ عَنْهُ ذَلِكَ قَالَتْ عَائِشَةُ فَسَأَلْتُهُ فَقَالَ إِنِّي خَشِيتُ أَنْ يَكُونَ عَذَابًا سُلِّطَ عَلَى أُمَّتِي وَيَقُولُ إِذَا رَأَى الْمَطَرَ رَحْمَةٌ.",
                "headingArabic": "التَّعَوُّذِ عِنْدَ رُؤْيَةِ الرِّيحِ وَالْغَيْمِ وَالْفَرَحِ بِالْمَطَرِ ‏‏",
                "headingUrdu": "آندھی اور گہرے بادلوں کو دیکھ کر اللہ کی پناہ مانگنا اور بارش پر خوش ہونا",
                "headingEnglish": "Seeking Refuge With Allah When Seeing Wind And Dark Clouds, And Rejoicing At The Rain",
                "chapterId": "10",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 110,
                    "chapterNumber": "10",
                    "chapterEnglish": "The Book of Prayer - Rain",
                    "chapterUrdu": "بارش طلب کرنے کی نماز",
                    "chapterArabic": "كتاب صَلَاةِ الِاسْتِسْقَاءِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9649,
                "hadithNumber": "2085",
                "englishNarrator": "Ata' bin Rabah reported on the authority of 'A'isha رضی اللہ تعالیٰ عنہا , the wife of the Messenger of Allah (ﷺ), who said:",
                "hadithEnglish": "Whenever the wind was stormy, the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) used to say: O Allah! I ask Thee for what is good in it, and the good which it contains, and the good of that which it was sent for. I seek refuge with Thee from what is evil in it, what evil it contains, and the evil of that what it was sent for; and when there was a thunder and lightning in the sky, his colour underwent a change, and he went out and in, backwards and forwards; and when the rain came, he felt relieved, and I noticed that (the sign of relief) on his face. 'A'isha رضی اللہ تعالیٰ عنہا asked him (about it) and he said: It may be as the people of 'Ad said: When they saw a cloud formation coming to their valley they said: It is a cloud which would give us rain (Qur'an, xlvi. 24).",
                "hadithUrdu": "جب تیز ہوا چلتی تو نبی اکرم صلی اللہ علیہ وسلم فرمایا کرتے : \" اے اللہ!میں تجھ سے اس کی خیر اور بھلائی کا سوا ل کرتا ہوں ۔ اور جو اس میں ہے اس کی اور جو کچھ اس کے زریعے بھیجا گیا ہے اس کی خیر ( کا طلبگار ہوں ) اور اس کے شر سے اور جو کچھ اس میں ہے اور جو اس میں بھیجا گیا ہے ا س کے شر سے تیری پناہ چاہتاہوں \" ( حضرت عائشہ رضی اللہ تعالیٰ عنہا نے ) کہا : جب آسمان پر بادل گھر آتے تو آپ صلی اللہ علیہ وسلم کا رنگ بدل جاتا اور آ پ ( اضطراب کے عالم میں ) کبھی باہر نکلتے اور کبھی اندر آتے ، کبھی آگے بڑھتے اور کبھی پیچھے ہٹتے ، اس کے بعد جب بارش برسنے لگتی تو آپ صلی اللہ علیہ وسلم سے ( یہ کیفیت ) دورہوجاتی ، مجھے اس کیفیت کا پتہ چل گیا ، حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : تومیں نے آپ صلی اللہ علیہ وسلم سے پوچھا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" عائشہ!ہوسکتاہے ( یہ اسی طرح ہو ) جیسے قوم عاد نے ( بادلوں کو دیکھ کر ) کہا تھا : \" جب انھوں نے اس ( عذاب ) کو بادل کی طرح اپنی بستیوں کی طرف آتے دیکھا تو انھوں نے کہا : یہ بادل ہے جو ہم پربرسے گا ۔ \"",
                "urduNarrator": "مجھ سے ابو الطاہر نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، انہوں نے کہا: میں نے سنا  ابن جریج عطاء بن ابی رباح سے حدیث بیان کرتے ہیں ، انھوں نے نبی اکرم صلی اللہ علیہ وسلم کی زوجہ محترمہ حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روای کی کہ انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنِي أَبُو الطَّاهِرِ أَخْبَرَنَا ابْنُ وَهْبٍ قَالَ سَمِعْتُ ابْنَ جُرَيْجٍ يُحَدِّثُنَا عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهَا قَالَتْ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا عَصَفَتْ الرِّيحُ قَالَ اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا وَخَيْرَ مَا فِيهَا وَخَيْرَ مَا أُرْسِلَتْ بِهِ وَأَعُوذُ بِكَ مِنْ شَرِّهَا وَشَرِّ مَا فِيهَا وَشَرِّ مَا أُرْسِلَتْ بِهِ قَالَتْ وَإِذَا تَخَيَّلَتْ السَّمَاءُ تَغَيَّرَ لَوْنُهُ وَخَرَجَ وَدَخَلَ وَأَقْبَلَ وَأَدْبَرَ فَإِذَا مَطَرَتْ سُرِّيَ عَنْهُ فَعَرَفْتُ ذَلِكَ فِي وَجْهِهِ قَالَتْ عَائِشَةُ فَسَأَلْتُهُ فَقَالَ لَعَلَّهُ يَا عَائِشَةُ كَمَا قَالَ قَوْمُ عَادٍ فَلَمَّا رَأَوْهُ عَارِضًا مُسْتَقْبِلَ أَوْدِيَتِهِمْ قَالُوا هَذَا عَارِضٌ مُمْطِرُنَا )الاحقاف:24).",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "10",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 110,
                    "chapterNumber": "10",
                    "chapterEnglish": "The Book of Prayer - Rain",
                    "chapterUrdu": "بارش طلب کرنے کی نماز",
                    "chapterArabic": "كتاب صَلَاةِ الِاسْتِسْقَاءِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9650,
                "hadithNumber": "2086",
                "englishNarrator": "A'isha رضی اللہ تعالیٰ عنہا , the wife of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), reported:",
                "hadithEnglish": "I never saw Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) laugh to such an extent that I could see his uvula-whereas he used to smile only-and when he saw dark clouds or wind, (the signs of fear) were depicted on his face. I said: Messenger of Allah, I find people being happy when they ace the dark cloud in the hope that it would bring rain, but I find that when you see that (the cloud) there is an anxiety on your face. He said: 'A'isha, I am afraid that there may be a calamity in it, for a people was afflicted with wind, when the people saw the calamity they said: It is a cloud which would give us rain (Qur'an. xlvi. 24).",
                "hadithUrdu": "میں نے اللہ کے رسول صلی اللہ علیہ وسلم کو کبھی پوری طرح ایسا ایسےہنستا ہوانہیں دیکھاکہ میں آپ کے حلق مبارک کے اندر کا ابھرا ہواحصہ دیکھ لوں ، آپ صلی اللہ علیہ وسلم صرف مسکرایا کرتے تھے ، اور جب آپ صلی اللہ علیہ وسلم بادل یا آندھی دیکھتے تو اس کا اثرآپ کے چہرہ انور پرعیاں ہوجاتا تو ( حضرت عائشہ رضی اللہ تعالیٰ عنہا نے ) کہا : اے اللہ کے رسول صلی اللہ علیہ وسلم !میں لوگوں کو دیکھتی ہوں کہ جب بادل دیکھتے ہیں تو اس اُمید پر خوش ہوجاتے ہیں کہ اس میں بارش ہوگی اور میں آپ صلی اللہ علیہ وسلم کو دیکھتی ہوں کہ جب آپ اس ( بادل ) دیکھتے ہیں تو میں آپ کے چہرے پر ناپسندیدگی محسوس کرتی ہوں؟حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : آپ صلی اللہ علیہ وسلم نے فرمایا : \" عائشہ!مجھے اس بات سے کیا چیز امن دلا سکتی ہے کہ کہیں ان میں عذاب ( نہ ) ہو ، ایک قوم آندھی کے عذاب کا شکار ہوئی تھی اور ایک قوم نے عذاب کو ( دور ) سے دیکھا تو کہا : \" یہ بادل ہے جو ہم پر بارش برسائے گا ۔ \"",
                "urduNarrator": "مجھ سے ہارون بن معروف نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، وہ عمرو بن حارث سے اور مجھ سے ابو الطاہر نے بیان کیا، کہا کہ ہم سے عبداللہ بن وہب نے بیان کیا، انہوں نے ہم سے ابن حارث سے روایت کی کہ ابو الحارث نے بیان کیا۔ نادر نے اسے بیان کیا,سیلمان بن یسار نے نبی اکرم صلی اللہ علیہ وسلم کی اہلیہ محترمہ حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنِي هَارُونُ بْنُ مَعْرُوفٍ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ عَمْرِو بْنِ الْحَارِثِ ح و حَدَّثَنِي أَبُو الطَّاهِرِ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنَا عَمْرُو بْنُ الْحَارِثِ أَنَّ أَبَا النَّضْرِ حَدَّثَهُ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهَا قَالَتْ مَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُسْتَجْمِعًا ضَاحِكًا حَتَّى أَرَى مِنْهُ لَهَوَاتِهِ إِنَّمَا كَانَ يَتَبَسَّمُ قَالَتْ وَكَانَ إِذَا رَأَى غَيْمًا أَوْ رِيحًا عُرِفَ ذَلِكَ فِي وَجْهِهِ فَقَالَتْ يَا رَسُولَ اللَّهِ أَرَى النَّاسَ إِذَا رَأَوْا الْغَيْمَ فَرِحُوا رَجَاءَ أَنْ يَكُونَ فِيهِ الْمَطَرُ وَأَرَاكَ إِذَا رَأَيْتَهُ عَرَفْتُ فِي وَجْهِكَ الْكَرَاهِيَةَ قَالَتْ فَقَالَ يَا عَائِشَةُ مَا يُؤَمِّنُنِي أَنْ يَكُونَ فِيهِ عَذَابٌ قَدْ عُذِّبَ قَوْمٌ بِالرِّيحِ وَقَدْ رَأَى قَوْمٌ الْعَذَابَ فَقَالُوا هَذَا عَارِضٌ مُمْطِرُنَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "10",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 110,
                    "chapterNumber": "10",
                    "chapterEnglish": "The Book of Prayer - Rain",
                    "chapterUrdu": "بارش طلب کرنے کی نماز",
                    "chapterArabic": "كتاب صَلَاةِ الِاسْتِسْقَاءِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9651,
                "hadithNumber": "2087",
                "englishNarrator": "Ibn 'Abbas رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: I have been helped by the east wind and the 'Ad were destroyed by the west wind.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" بادصبا ( مشرقی سمت سے چلنے والی ہوا ) سے میری مدد کی گئی ہے اور باددبور ( مغربی سمت سے چلنے والی ہوا ) سے قوم عاد کو ہلاک کیا گیا ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے غندر نے بیان کیا، شعبہ ہذا سے اور ہم سے محمد بن المثنیٰ اور ابن بشار نے بیان کیا، کہا: ہم سے محمد بن جعفر نے بیان کیا، شعبہ نے بیان کیا۔ ہمیں حکم کے بارے میں, مجاہد نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا غُنْدَرٌ عَنْ شُعْبَةَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ نُصِرْتُ بِالصَّبَا وَأُهْلِكَتْ عَادٌ بِالدَّبُورِ.",
                "headingArabic": "فِي رِيحِ الصَّبَا وَالدَّبُورِ ‏‏",
                "headingUrdu": "مشرقی ہوا اور مغربی ہوا",
                "headingEnglish": "The East Wind And The West Wind",
                "chapterId": "10",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 110,
                    "chapterNumber": "10",
                    "chapterEnglish": "The Book of Prayer - Rain",
                    "chapterUrdu": "بارش طلب کرنے کی نماز",
                    "chapterArabic": "كتاب صَلَاةِ الِاسْتِسْقَاءِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9652,
                "hadithNumber": "2088",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Ibn 'Abbas رضی اللہ تعالیٰ عنہ through another chain of transmitters.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، کہا کہ ہم سے ابو معاویہ نے بیان کیا، اور ہم سے عبداللہ بن عمر بن محمد بن ابان الجعفی نے بیان کیا، جس سے عبدہ یعنی ابن سلیمان نے بیان کیا۔ -اعمش، مسعود بن مالک کی سند پر، کے اختیار پرسعید بن جبیر نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے اس کی مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ ح و حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ بْنِ مُحَمَّدِ بْنِ أَبَانٍ الْجُعْفِيُّ حَدَّثَنَا عَبْدَةُ يَعْنِي ابْنَ سُلَيْمَانَ كِلَاهُمَا عَنْ الْأَعْمَشِ عَنْ مَسْعُودِ بْنِ مَالِكٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "10",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 110,
                    "chapterNumber": "10",
                    "chapterEnglish": "The Book of Prayer - Rain",
                    "chapterUrdu": "بارش طلب کرنے کی نماز",
                    "chapterArabic": "كتاب صَلَاةِ الِاسْتِسْقَاءِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9653,
                "hadithNumber": "2089",
                "englishNarrator": "A'isha رضی اللہ تعالیٰ عنہا reported:",
                "hadithEnglish": "There was a solar eclipse in the time of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). He stood up to pray and prolonged his stand very much. He then bowed and prolonged very much his bowing. He then raised his head and prolonged his stand much, but it was less than the (duration) of the first stand. He then bowed and prolonged bowing much, but it was less than the duration of his first bowing. He then prostrated and then stood up and prolonged the stand, but it was less than the first stand. He then bowed and prolonged his bowing, but it was less than the first bowing. He then lifted his head and then stood up and prolonged his stand, but it was less than the first stand. He then bowed and prolonged bowing and it was less than the first bowing. He then prostrated himself; then he turned about, and the sun had become bright, and he addressed the people. He praised Allah and landed Him and said: The sun and the moon are two signs of Allah; they are not eclipsed on account of anyones death or on account of anyone's birth. So when you see them, glorify and supplicate Allah, observe prayer, give alms. O Ummah of Muhammad, none is more indignant than Allah When His servant or maid commits fornication. O people of Muhammad, by Allah, if you knew what I know, you would weep much and laugh little.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے زما نے میں سورج کو گرہن لگ گیا تو رسول اللہ صلی اللہ علیہ وسلم نے نماز پڑھنے کے لیے قیام فر ما یا اور بہت ہی لمبا قیام کیا ، پھر آپ نے رکو ع کیا تو انتہا ئی طویل رکوع کیا پھر آپ نے سر اٹھا یا تو انتہائی طویل قیام کیا اور وہ پہلے قیام سے ( کچھ ) کم تھا پھر آپ نے ( دوبارہ ) رکو ع کیا تو بہت لمبا رکو ع کیا اور وہ پہلے رکوع سے کم تھا پھر آپ نے سجدے کیے پھر آپ کھڑے ہو گئے اور قیام کو لمبا کیا وہ پہلے قیام سے کم تھا پھر آپ نے رکوع کیا اور رکوع کو لمبا کیا اور وہ پہلے رکوع سے کم تھا پھر آپ نے اپنا سر اٹھا یا اور قیا م کیا تو بہت لمبا قیام کیا جبکہ وہ پہلے قیام سے کم تھا پھر آپ نے رکوع کیا تو انتہائی طویل رکوع کیا لیکن وہ پہلے رکوع سے کم تھا پھر سجدے کیے پھر رسول اللہ صلی اللہ علیہ وسلم ( نماز سے فارغ ہو کر ) پلٹے تو سورج روشن ہو چکا تھا اور آپ نے لو گو ں سے خطا ب فر ما یا اللہ تعالیٰ کی حمدو ثناء بیان کی ، پھر فر ما یا : \"\" بے شک سورج اور چاند اللہ تعا لیٰ کی نشانیوں میں سے ہیں ان کو کسی کی مو ت یا زند گی کی وجہ سے گرہن نہیں لگتا جب تم انھیں ( اس حالت میں ) دیکھو تو اللہ کی بڑائی بیان کرو اللہ تعا لیٰ سے دعا مانگو نماز پڑھو اور صدقہ کرو اے اُمت محمد ( صلی اللہ علیہ وسلم ) کو ئی نہیں جو ( اس بات پر ) اللہ تعالیٰ سے زیادہ غیرت رکھنے والا ہو کہ اس کا بندہ یا اس کی باندی زنا کرے !اے اُمت محمد!اللہ کی قسم !اگر تم ان باتوں کو جان لو جن کو میں جا نتا ہوں ۔ تو تم بہت زیادہ روؤاور بہت کم ہنسو ۔ دیکھو !کیا میں نے ( پیغام ) اچھی طرح پہنچا دیا ؟ \"\" اور امام مالک کی روایت میں ہے : \"\" یقیناً سورج اور چاند اللہ تعا لیٰ کی نشانیوں میں سے دو نشانیاں ہیں ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, امام مالک بن انس اور عبد اللہ بن نمیر نے کہا : ہمیں ہشام نے اپنے والد عروہ سے حدیث سنا ئی انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روا یت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكِ بْنِ أَنَسٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَاللَّفْظُ لَهُ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ حَدَّثَنَا هِشَامٌ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ خَسَفَتْ الشَّمْسُ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فَأَطَالَ الْقِيَامَ جِدًّا ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ جِدًّا ثُمَّ رَفَعَ رَأْسَهُ فَأَطَالَ الْقِيَامَ جِدًّا وَهُوَ دُونَ الْقِيَامِ الْأَوَّلِ ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ جِدًّا وَهُوَ دُونَ الرُّكُوعِ الْأَوَّلِ ثُمَّ سَجَدَ ثُمَّ قَامَ فَأَطَالَ الْقِيَامَ وَهُوَ دُونَ الْقِيَامِ الْأَوَّلِ ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ وَهُوَ دُونَ الرُّكُوعِ الْأَوَّلِ ثُمَّ رَفَعَ رَأْسَهُ فَقَامَ فَأَطَالَ الْقِيَامَ وَهُوَ دُونَ الْقِيَامِ الْأَوَّلِ ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ وَهُوَ دُونَ الرُّكُوعِ الْأَوَّلِ ثُمَّ سَجَدَ ثُمَّ انْصَرَفَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَدْ تَجَلَّتْ الشَّمْسُ فَخَطَبَ النَّاسَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ إِنَّ الشَّمْسَ وَالْقَمَرَ مِنْ آيَاتِ اللَّهِ وَإِنَّهُمَا لَا يَنْخَسِفَانِ لِمَوْتِ أَحَدٍ وَلَا لِحَيَاتِهِ فَإِذَا رَأَيْتُمُوهُمَا فَكَبِّرُوا وَادْعُوا اللَّهَ وَصَلُّوا وَتَصَدَّقُوا يَا أُمَّةَ مُحَمَّدٍ إِنْ مِنْ أَحَدٍ أَغْيَرَ مِنْ اللَّهِ أَنْ يَزْنِيَ عَبْدُهُ أَوْ تَزْنِيَ أَمَتُهُ يَا أُمَّةَ مُحَمَّدٍ وَاللَّهِ لَوْ تَعْلَمُونَ مَا أَعْلَمُ لَبَكَيْتُمْ كَثِيرًا وَلَضَحِكْتُمْ قَلِيلًا أَلَا هَلْ بَلَّغْتُ وَفِي رِوَايَةِ مَالِكٍ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ.",
                "headingArabic": "صَلاَةِ الْكُسُوفِ ‏",
                "headingUrdu": "چاند گرہن کی نماز",
                "headingEnglish": "The Eclipse Prayer",
                "chapterId": "11",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 111,
                    "chapterNumber": "11",
                    "chapterEnglish": "The Book of Prayer - Eclipses",
                    "chapterUrdu": "سورج اور چاند گرہن کے احکام",
                    "chapterArabic": "كتاب الْكُسُوفِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9654,
                "hadithNumber": "2090",
                "englishNarrator": "This hadith has been narrated by Hisham bin 'Urwa with the same chain of transmitters but with this addition:",
                "hadithEnglish": "Verily the sun and the moon are among the signs of Allah. And similarly this addition was made: He then lifted his hands and said: O Allah! have I not conveyed it?",
                "hadithUrdu": "\" امابعد ( حمد و صلاۃ کے بعد ) !بلا شبہ سورج اور چاند اللہ کی نشانیوں میں سے دونشانیاں ہیں ۔ \" اور یہ بھی اضافہ کیا : پھر آپ نے اپنے دونوں ہاتھا اٹھا ئے اور فر ما یا : \" اے اللہ !کیا میں نے ( پیغام ) اچھی طرح پہنچا دیا ؟ \"",
                "urduNarrator": "اور ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے بیان کیا, ابو معاویہ نے ہشام بن عروہ سے اسی سند کے ساتھ ( سابقہ حدیث کے مانند ) روایت کی اور اس میں یہ اضافہ کیا پھر آپ صلی اللہ علیہ وسلم نے فر ما یا",
                "hadithArabic": "و حَدَّثَنَاه يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو مُعَاوِيَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ بِهَذَا الْإِسْنَادِ وَزَادَ ثُمَّ قَالَ أَمَّا بَعْدُ فَإِنَّ الشَّمْسَ وَالْقَمَرَ مِنْ آيَاتِ اللَّهِ وَزَادَ أَيْضًا ثُمَّ رَفَعَ يَدَيْهِ فَقَالَ اللَّهُمَّ هَلْ بَلَّغْتُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "11",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 111,
                    "chapterNumber": "11",
                    "chapterEnglish": "The Book of Prayer - Eclipses",
                    "chapterUrdu": "سورج اور چاند گرہن کے احکام",
                    "chapterArabic": "كتاب الْكُسُوفِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9655,
                "hadithNumber": "2091",
                "englishNarrator": "A'isha رضی اللہ تعالیٰ عنہا , the wife of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), reported:",
                "hadithEnglish": "There was an eclipse of the sun during the lifetime of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). So, the Messenger of Allah (may peace he upon him) went to the mosque and stood up and glorified Allah, and the people formed themselves in rows behind him. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) made a long recital (of the Qur'an) and then pronounced takbir and then observed a long ruku'. He then raised his head and said: Allah listened to him who praised Him: our Lord, praise is due to Thee. He then again stood up and made a long recital, which was less than the first recital. He pronounced takbir and observed a long ruku', and it was less than the first one. He again said: Allah listened to him who praised Him; our Lord, praise is due to Thee. (Abu Tahir, one of the narrators) made no mention of: He then prostrated himself. He did like this in the second rak'ah, till he completed four rak'ahs and four prostrations and the sun became bright before he deported. He then stood up and addressed people, after lauding Allah as He deserved, and then said: The sun and the moon are two signs among the signs of Allah These do not eclipse either on the death of anyone or on his birth. So when you see them, hasten to prayer. He also said this: Observe prayer till Allah dispels the anxiety (of this extraordinary phenomenon) from you. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: I saw in my place everything which you have been promised. I even saw myself desiring to pluck a bunch (of grapes) from Paradise (and it was at the time) when you saw me moving forward. And I saw Hell and some of its parts crushing the others, when you saw me moving back; and I saw in it Ibn Luhayy and he was the person who made the she-camels loiter about. In the hadith transmitted by Abu Tahir the words are: He hastened to prayer, and he made no mention of what follows.",
                "hadithUrdu": "میں سورج کو گرہن لگا تو رسول اللہ صلی اللہ علیہ وسلم باہر مسجد میں تشریف لے گئے آپ نماز کے لیے کھڑے ہو گئے اور تکبیر کہی اور لو گ آپ کے پیچھے صف بستہ ہو گئے پھر رسول اللہ صلی اللہ علیہ وسلم نے طویل قراءت فر ما ئی پھر آپ نےالله اكبرکہا اور ایک لمبا رکو ع کیا پھر آپ نے اپنا سر اٹھا یا اور سمع الله لمن حمده ربنا ولك الحمد کہا پھر آپ نے قیام کیا اور ایک طویل قراءت کی یہ پہلی ( قراءت ) سے کچھ کم تھی پھر الله اكبرکہا اور کہہ کر طویل رکوع کیا یہ پہلے رکوع سے کچھ کم تھا پھر سمع الله لمن حمده ربنا ولك الحمد کہا پھر سجدہ کیا اور ابو طاہر نے ( ثم سجده ) ( پھر آپنے سجدہ کیا ) کے الفا ظ نہیں کہے ۔ پھر دوسری رکعت میں بھی اسی طرح کیا حتیٰ کہ چار رکوع اور چار سجدے مکمل کیے اور آپ کے سلام پھیرنے سے پہلے سورج روشن ہو گیا پھر آپ کھڑے ہو ئے اور لو گوں کو خطاب فر ما یا اور اللہ تعا لیٰ کی ( ایسی ) ثنا بیان کی جو اس کے شایان شان تھی پھر فر ما یا \"\" سورج اور چاند اللہ تعا لیٰ کی نشانیوں میں سے دو نشانیاں ہیں انھیں کسی کی مو ت کی وجہ سے گرہن لگتا ہے نہ کسی کی زندگی کی وجہ سے جب تم انھیں ( گرہن میں ) دیکھو تو فوراًنماز کی طرف لپکو ۔ \"\" آپ نے یہ بھی فر ما یا : \"\" اور نماز پڑھتے رہو یہاں تک کہ اللہ تمھارے لیے کشادگی کر دے اور رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \"\" میں نے اپنی اس جگہ ( پر ہو تے ہو ئے ) ہر وہ چیز دیکھ لی جس کا تمھارے ساتھ وعدہ کیا گیا ہے حتیٰ کہ میں نے اپنے آپ کو دیکھا کہ میں جنت کا ایک گچھا لینا چاہتا ہوں اس وقت جب تم نے مجھے دیکھا تھا کہ میں قدم آگے بڑھا رہا ہوں ۔ اور ( محمد بن سلمہ ) مرادی نے \"\" آگے بڑھ رہا ہوں \"\" کہا ۔ ۔ ۔ اور میں نے جہنم بھی دیکھی اس کا ایک حصہ دوسرے حصے کو ریزہ ریزہ کر رہا تھا یہ اس وقت جب تم نے مجھے دیکھا کہ میں پیچھے ہٹا ۔ اور میں نے جہنم میں عمرو بن لحی کو دیکھا جس نے سب سے پہلے بتوں کی نذر کی اونٹنیاں چھوڑیں ۔ \"\" ابو طا ہر کی روایت \"\" نماز کی طرف لپکو پر ختم ہو گئی انھوں نے بعد والا حصہ بیان نہیں کیا ۔",
                "urduNarrator": "حرملہ بن یحییٰ نے مجھے حدیث بیان کی ، ( کہا ) مجھے ابن وہب نے یونس سے خبر دی نیز ابو طاہر اور محمد بن سلمہ مرادی نے کہا : ابن وہب نے یو نس سے حدیث بیان کی انھوں نے ابن شہاب سے روا یت کی انھوں نے کہا مجھے عروہ بن زبیر نے نبی اکرم صلی اللہ علیہ وسلم کی اہلیہ حضرت عائشہ رضی اللہ تعالیٰ عنہا سے خبر دی انھوں نے کہا رسول اللہ صلی اللہ علیہ وسلم کی حیات مبارکہ",
                "hadithArabic": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنِي ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ ح و حَدَّثَنِي أَبُو الطَّاهِرِ وَمُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِيُّ قَالَا حَدَّثَنَا ابْنُ وَهْبٍ عَنْ يُونُسَ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ خَسَفَتْ الشَّمْسُ فِي حَيَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْمَسْجِدِ فَقَامَ وَكَبَّرَ وَصَفَّ النَّاسُ وَرَاءَهُ فَاقْتَرَأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قِرَاءَةً طَوِيلَةً ثُمَّ كَبَّرَ فَرَكَعَ رُكُوعًا طَوِيلًا ثُمَّ رَفَعَ رَأْسَهُ فَقَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ رَبَّنَا وَلَكَ الْحَمْدُ ثُمَّ قَامَ فَاقْتَرَأَ قِرَاءَةً طَوِيلَةً هِيَ أَدْنَى مِنْ الْقِرَاءَةِ الْأُولَى ثُمَّ كَبَّرَ فَرَكَعَ رُكُوعًا طَوِيلًا هُوَ أَدْنَى مِنْ الرُّكُوعِ الْأَوَّلِ ثُمَّ قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ رَبَّنَا وَلَكَ الْحَمْدُ ثُمَّ سَجَدَ وَلَمْ يَذْكُرْ أَبُو الطَّاهِرِ ثُمَّ سَجَدَ ثُمَّ فَعَلَ فِي الرَّكْعَةِ الْأُخْرَى مِثْلَ ذَلِكَ حَتَّى اسْتَكْمَلَ أَرْبَعَ رَكَعَاتٍ وَأَرْبَعَ سَجَدَاتٍ وَانْجَلَتْ الشَّمْسُ قَبْلَ أَنْ يَنْصَرِفَ ثُمَّ قَامَ فَخَطَبَ النَّاسَ فَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ لَا يَخْسِفَانِ لِمَوْتِ أَحَدٍ وَلَا لِحَيَاتِهِ فَإِذَا رَأَيْتُمُوهَا فَافْزَعُوا لِلصَّلَاةِ وَقَالَ أَيْضًا فَصَلُّوا حَتَّى يُفَرِّجَ اللَّهُ عَنْكُمْ وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَيْتُ فِي مَقَامِي هَذَا كُلَّ شَيْءٍ وُعِدْتُمْ حَتَّى لَقَدْ رَأَيْتُنِي أُرِيدُ أَنْ آخُذَ قِطْفًا مِنْ الْجَنَّةِ حِينَ رَأَيْتُمُونِي جَعَلْتُ أُقَدِّمُ و قَالَ الْمُرَادِيُّ أَتَقَدَّمُ وَلَقَدْ رَأَيْتُ جَهَنَّمَ يَحْطِمُ بَعْضُهَا بَعْضًا حِينَ رَأَيْتُمُونِي تَأَخَّرْتُ وَرَأَيْتُ فِيهَا ابْنَ لُحَيٍّ وَهُوَ الَّذِي سَيَّبَ السَّوَائِبَ وَانْتَهَى حَدِيثُ أَبِي الطَّاهِرِ عِنْدَ قَوْلِهِ فَافْزَعُوا لِلصَّلَاةِ وَلَمْ يَذْكُرْ مَا بَعْدَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "11",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 111,
                    "chapterNumber": "11",
                    "chapterEnglish": "The Book of Prayer - Eclipses",
                    "chapterUrdu": "سورج اور چاند گرہن کے احکام",
                    "chapterArabic": "كتاب الْكُسُوفِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9656,
                "hadithNumber": "2092",
                "englishNarrator": "A'isha رضی اللہ تعالیٰ عنہا reported:",
                "hadithEnglish": "There was a solar eclipse during the lifetime of the Messenger of Allah (way peace be upon him) and he sent the announcer (to summon them) for congregational prayer. The people gathered together and he pronounced takbir and he observed four rak'ahs, in the form of two rak'ahs (i. e. he observed two qiyams and two ruku's in one rak'ah) and four prostrations.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے عہد مبارک میں سورج کوگرہن لگ گیا تو آپ نے یہ اعلان کرنے والا ( ایک شخص ) بھیجاکہ \" کہ نماز جمع کرنے والی ہے ۔ اس پر لوگ جمع ہوگئے ، آپ آگے بڑھے ، تکبیر تحریمہ کہی اور چار رکوعوں اور چار سجدوں کےساتھ دو رکعتیں پڑھیں ۔",
                "urduNarrator": "ہم سے محمد بن مہران رازی نے بیان کیا، ہم سے ولید بن مسلم نے بیان کیا، انہوں نے کہا ابو عمرو اوزاعی اور ان کے علاوہ د وسرے ( راوی ، دونوں میں سے ہرایک ) نے کہا : میں نے ابن شہاب زہری سے سنا ، وہ عروہ سے اور وہ حضرت عائشہ رضی اللہ تعالیٰ عنہا سے خبر دے رہے تھے کہ",
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ مِهْرَانَ الرَّازِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ قَالَ الْأَوْزَاعِيُّ أَبُو عَمْرٍو وَغَيْرُهُ سَمِعْتُ ابْنَ شِهَابٍ الزُّهْرِيَّ يُخْبِرُ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّ الشَّمْسَ خَسَفَتْ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَبَعَثَ مُنَادِيًا الصَّلَاةُ جَامِعَةٌ فَاجْتَمَعُوا وَتَقَدَّمَ فَكَبَّرَ وَصَلَّى أَرْبَعَ رَكَعَاتٍ فِي رَكْعَتَيْنِ وَأَرْبَعَ سَجَدَاتٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "11",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 111,
                    "chapterNumber": "11",
                    "chapterEnglish": "The Book of Prayer - Eclipses",
                    "chapterUrdu": "سورج اور چاند گرہن کے احکام",
                    "chapterArabic": "كتاب الْكُسُوفِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9657,
                "hadithNumber": "2093",
                "englishNarrator": "A'isha رضی اللہ تعالیٰ عنہا reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) recited loudly in the eclipse prayer, and he observed four rak'ahs in the form of two rak'ahs and four prostrations.",
                "hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم نے صلاۃ الخسوف ( چاند یاسورج گرہن کی نماز ) میں بلند آوازسے قراءت کی اور دو رکعتوں میں چار رکوع اور چار سجدے کرکے نماز ادا کی ۔",
                "urduNarrator": "ہم سے محمد بن مہران نے بیان کیا، کہا ہم سے ولید بن مسلم نے بیان کیا، انہوں نے بیان کیا عبدالرحمن بن نمر نے خبر دی کہ انھوں نے ابن شہاب سے سنا ، وہ عروہ اور حضرت عائشہ رضی اللہ تعالیٰ عنہا سے خبر دے رہے تھے کہ",
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ مِهْرَانَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ نَمِرٍ أَنَّهُ سَمِعَ ابْنَ شِهَابٍ يُخْبِرُ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَهَرَ فِي صَلَاةِ الْخُسُوفِ بِقِرَاءَتِهِ فَصَلَّى أَرْبَعَ رَكَعَاتٍ فِي رَكْعَتَيْنِ وَأَرْبَعَ سَجَدَاتٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "11",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 111,
                    "chapterNumber": "11",
                    "chapterEnglish": "The Book of Prayer - Eclipses",
                    "chapterUrdu": "سورج اور چاند گرہن کے احکام",
                    "chapterArabic": "كتاب الْكُسُوفِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9658,
                "hadithNumber": "2094",
                "englishNarrator": "It was narrated that Ibn Abbas رضی اللہ تعالیٰ عنہ :",
                "hadithEnglish": "The prophet ﷺ prayed with four bowing and four prostration in two Rakah.",
                "hadithUrdu": "آپ نے دو رکعتوں میں چار رکوع اور چار سجدے کئے ۔",
                "urduNarrator": "( عبدالرحمان بن نمر نے ہی کہا : ) زہری نے کہا  کثیر بن عباس رضی اللہ تعالیٰ عنہ نے ( اپنے بھائی حضرت عبداللہ ) ابن عباس رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "قَالَ الزُّهْرِيُّ وَأَخْبَرَنِي كَثِيرُ بْنُ عَبَّاسٍ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ صَلَّى أَرْبَعَ رَكَعَاتٍ فِي رَكْعَتَيْنِ وَأَرْبَعَ سَجَدَاتٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "11",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 111,
                    "chapterNumber": "11",
                    "chapterEnglish": "The Book of Prayer - Eclipses",
                    "chapterUrdu": "سورج اور چاند گرہن کے احکام",
                    "chapterArabic": "كتاب الْكُسُوفِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9659,
                "hadithNumber": "2095",
                "englishNarrator": "It was narrated that Kasir Ibn Abbas رضی اللہ تعالیٰ عنہ :",
                "hadithEnglish": "Ibn Abbas رضی اللہ تعالیٰ عنہ used to narrate a narration similar to that of Urwah from Aishah رضی اللہ تعالیٰ عنہا concerning the prayer of the Messenger of Allah ﷺ on the day of the sun was eclipsed.",
                "hadithUrdu": "حضرت ابن عباس رضی اللہ تعالیٰ عنہ رسول اکرم صلی اللہ علیہ وسلم کی سورج گرہن والے دن کی نماز ( اسی طرح ) بیان کرتےتھے جس طرح عروہ نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے بیان کی ۔",
                "urduNarrator": "ہم سے حاجب بن ولید نے بیان کیا، ہم سے محمد بن حرب نے بیان کیا, محمد بن ولید زبیدی نے زہری سے روایت کی ، انھوں نے کہا : کثیر بن عباس رضی اللہ تعالیٰ عنہ حدیث بیان کرتے تھےکہ",
                "hadithArabic": "و حَدَّثَنَا حَاجِبُ بْنُ الْوَلِيدِ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ حَدَّثَنَا مُحَمَّدُ بْنُ الْوَلِيدِ الزُّبَيْدِيُّ عَنْ الزُّهْرِيِّ قَالَ كَانَ كَثِيرُ بْنُ عَبَّاسٍ يُحَدِّثُ أَنَّ ابْنَ عَبَّاسٍ كَانَ يُحَدِّثُ عَنْ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ كَسَفَتْ الشَّمْسُ بِمِثْلِ مَا حَدَّثَ عُرْوَةُ عَنْ عَائِشَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "11",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 111,
                    "chapterNumber": "11",
                    "chapterEnglish": "The Book of Prayer - Eclipses",
                    "chapterUrdu": "سورج اور چاند گرہن کے احکام",
                    "chapterArabic": "كتاب الْكُسُوفِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9660,
                "hadithNumber": "2096",
                "englishNarrator": "It was narrated from 'Ata': Ubaid bin Umair said:",
                "hadithEnglish": "'One whom I regard as truthful' - I think he meant Aishah told me that the sun was eclipsed at the time of Messenger of Allah ﷺ and he stood for a very long time: \"He stood then he bowed, then he stood, then he bowed, then he stood, then he bowed; two Rakah with three bowings and four prostrations. When he finished the eclipsed had ended. When he bowed he said: \"Allahu Akbar,\" When he raised his head he said: Sami Allahu liman Hamidah (Allah hears those who praised him).\" Then he stood and praised and glorified Allah, then he said: the sun and the moon do not become eclipsed for death or birth of anyone. Rather they are sings of Allah with which Allah create fear in his slaves, so If you see them being them being eclised, rememer of Allah until the eclipse all over.\"",
                "hadithUrdu": "مجھ سے اس شخص نے حدیث بیان کی جنھیں میں سچا سمجھتاہوں ۔ ( عطاء نے کہا : ) میرا خیال ہے ان کی مراد حضرت عائشہ رضی اللہ تعالیٰ عنہا سے تھی ۔ کہ رسول اللہ صلی اللہ علیہ وسلم کے عہد مبارک میں سورج کوگرہن لگ گیا تو آپ نے بڑا پُر مشقت قیام کیا ۔ سیدھے کھڑے ہوتے ، پھر رکوع میں چلے جاتے ، پھرکھڑے ہوتے ۔ پھر رکوع کرتے ، پھر کھڑے ہوتے پھر رکوع کرتے ، دو رکعتیں ( تین ) تین رکوع اور چار سجدوں کے ساتھ پڑھیں ، پھر آپ نے سلام پھیر ا تو سورج روشن ہوچکا تھا ۔ جب آپ صلی اللہ علیہ وسلم رکوع کرتے تو الله اكبرکہا کہتے اس کے بعد جب رکوع کرتے اور جب سر اٹھاتے تو \" سمع الله لمن حمده \" کہتے ۔ اسکے بعد آپ ( خطبہ کے لئے ) کھڑے ہوئے ۔ اللہ تعالیٰ کی حمد وثنا بیان کی ، پھر فرمایا : \" سورج اور چاند نہ کسی کی موت پر بےنور ہوتے ہیں اور نہ ہی کسی کی زندگی پر بلکہ وہ اللہ کی نشانیاں ہیں ، ان کے ذریعے سے وہ اپنے بندوں کو خوف دلاتا ہے ، جب تم گرہن دیکھو تو اللہ کو یاد کرو حتیٰ کہ وہ روشن ہوجائیں ۔ \"",
                "urduNarrator": "اور ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے محمد بن بکر نے بیان کیا، انہوں نے بیان کیا, ابن جریج نے کہا : میں نے عطاء ( بن ابی رباح ) کو کہتے ہوئے سنا : میں نے عبید بن عمیر سے سنا ، کہہ رہے تھے",
                "hadithArabic": "و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ سَمِعْتُ عَطَاءً يَقُولُ سَمِعْتُ عُبَيْدَ بْنَ عُمَيْرٍ يَقُولُ حَدَّثَنِي مَنْ أُصَدِّقُ حَسِبْتُهُ يُرِيدُ عَائِشَةَ أَنَّ الشَّمْسَ انْكَسَفَتْ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَامَ قِيَامًا شَدِيدًا يَقُومُ قَائِمًا ثُمَّ يَرْكَعُ ثُمَّ يَقُومُ ثُمَّ يَرْكَعُ ثُمَّ يَقُومُ ثُمَّ يَرْكَعُ رَكْعَتَيْنِ فِي ثَلَاثِ رَكَعَاتٍ وَأَرْبَعِ سَجَدَاتٍ فَانْصَرَفَ وَقَدْ تَجَلَّتْ الشَّمْسُ وَكَانَ إِذَا رَكَعَ قَالَ اللَّهُ أَكْبَرُ ثُمَّ يَرْكَعُ وَإِذَا رَفَعَ رَأْسَهُ قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ فَقَامَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ إِنَّ الشَّمْسَ وَالْقَمَرَ لَا يَكْسِفَانِ لِمَوْتِ أَحَدٍ وَلَا لِحَيَاتِهِ وَلَكِنَّهُمَا مِنْ آيَاتِ اللَّهِ يُخَوِّفُ اللَّهُ بِهِمَا عِبَادَهُ فَإِذَا رَأَيْتُمْ كُسُوفًا فَاذْكُرُوا اللَّهَ حَتَّى يَنْجَلِيَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "11",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 111,
                    "chapterNumber": "11",
                    "chapterEnglish": "The Book of Prayer - Eclipses",
                    "chapterUrdu": "سورج اور چاند گرہن کے احکام",
                    "chapterArabic": "كتاب الْكُسُوفِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9661,
                "hadithNumber": "2097",
                "englishNarrator": "It was narrated from Aishah رضی اللہ عنہا :",
                "hadithEnglish": "The Messenger of Allah prayed with six bowings and four prostration.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے چھ رکعتیں اور چار سجدے پڑھے۔",
                "urduNarrator": "مجھ سے ابو غسان المسماعی اور محمد بن المثنیٰ نے بیان کیا، کہا: معاذ، جو ابن ہشام ہیں، نے بیان کیا: مجھ سے میرے والد نے، قتادہ کی سند سے، عطاء بن ابی کی سند سے بیان کیا۔ عبید بن عمیر, عائشہ رضی اللہ عنہا سے روایت ہے کہ",
                "hadithArabic": "و حَدَّثَنِي أَبُو غَسَّانَ الْمِسْمَعِيُّ وَمُحَمَّدُ بْنُ الْمُثَنَّى قَالَا حَدَّثَنَا مُعَاذٌ وَهُوَ ابْنُ هِشَامٍ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ عَنْ عُبَيْدِ بْنِ عُمَيْرٍ عَنْ عَائِشَةَ أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى سِتَّ رَكَعَاتٍ وَأَرْبَعَ سَجَدَاتٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "11",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 111,
                    "chapterNumber": "11",
                    "chapterEnglish": "The Book of Prayer - Eclipses",
                    "chapterUrdu": "سورج اور چاند گرہن کے احکام",
                    "chapterArabic": "كتاب الْكُسُوفِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9662,
                "hadithNumber": "2098",
                "englishNarrator": "May Allah protect you from the torment of the grave! 'A'isha رضی اللہ عنہا said:",
                "hadithEnglish": "Messenger of Allah, would people be tormented in the graves? The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: (May there be) protection of Allah! The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) mounted one morning on the ride, and the sun eclipsed. 'A'isha رضی اللہ عنہا said: I came in the company of the women in the mosque from behind the rooms. The Messenger of Allah (way peace he upon him) dismounted from his ride and came to the place of worship where he used to pray. He stood up (to pray) and the people stood behind him. 'A'isha رضی اللہ عنہا said: He stood for a long time. He then bowed and it was a long ruku'. He then raised his head and he stood for a long time, less than the first standing. He then bowed and his ruku' was long, but it was less than that (the first) ruku'. He then raised (his head) and the sun had become bright. He (the Holy Prophet) then said: I saw you under trial in the grave like the turmoil of Dajjal. 'Amra said: I heard 'A'isha رضی اللہ عنہا say: I listened after this to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) seeking refuge from the torment of Fire and the torment of the grave.",
                "hadithUrdu": "اے اللہ کے رسول صلی اللہ علیہ وسلم !لوگوں کو قبرمیں عذاب ہوگا؟عمرہ نے کہا : حضرت عائشہ رضی اللہ تعالیٰ عنہا نے بتایاکہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" میں اللہ کی پناہ چاہتا ہوں \"\" پھر رسول اللہ صلی اللہ علیہ وسلم ایک صبح کسی سواری پر سوار ہوکر نکلے تو سورج کوگرہن لگ گیا ، حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : میں بھی عورتوں کے سات حجروں کے درمیان سے نکل کر مسجد میں آئی اور رسول اللہ صلی اللہ علیہ وسلم اپنی سواری سے ( اتر کر ) نماز پڑھنے کی اس جگہ پرآئے جہاں آپ نماز پڑھایا کرتے تھے ، آپ کھڑے ہوگئے اور لوگ بھی آپ کے پیچھے کھڑے ہوگئے ، حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : پھر آپ نے لمبا قیام کیا ، پھر رکوع کیا اور لمبا رکوع کیا ، پھر ( رکوع سے ) سر اٹھایا اور طویل قیام کیا جو پہلے قیام سے چھوٹا تھا ۔ اور پھر ( رکوع سے ) سر اٹھایا تو سورج روشن ہوچکا تھا ، پھر ( نماز سے فراغت کے بعد ) آپ نے فرمایا : \"\" میں نے تمھیں دیکھا ہے کہ تم قبروں میں دجال کی آزمائش کی طرح آزمائش میں ڈالے جاؤگے ۔ \"\" عمرہ نے کہا : میں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا کو یہ کہتے ہوئے سنا کہ میں اس کے بعد رسول اللہ صلی اللہ علیہ وسلم سے سنا کرتی تھی کہ آپ صلی اللہ علیہ وسلم آگ کے عذاب سے اور قبر کے عذاب سے پناہ مانگتے تھے ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ القعنبی نے بیان کیا, سلیمان بن بلال نے یحییٰ ( بن سعید ) سے اور انھوں نے عمرہ سے روایت کی کہ ایک یہودی عورت حضرت عائشہ رضی اللہ عنہا کے پاس مانگنے کے لئے آئی ۔ اس نے آکر ( کہا : اللہ آپ کو عذاب قبر سے پناہ دے ۔ حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : میں نے کہا",
                "hadithArabic": "و حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ حَدَّثَنَا سُلَيْمَانُ يَعْنِي ابْنَ بِلَالٍ عَنْ يَحْيَى عَنْ عَمْرَةَ أَنَّ يَهُودِيَّةً أَتَتْ عَائِشَةَ تَسْأَلُهَا فَقَالَتْ أَعَاذَكِ اللَّهُ مِنْ عَذَابِ الْقَبْرِ قَالَتْ عَائِشَةُ فَقُلْتُ يَا رَسُولَ اللَّهِ يُعَذَّبُ النَّاسُ فِي الْقُبُورِ قَالَتْ عَمْرَةُ فَقَالَتْ عَائِشَةُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَائِذًا بِاللَّهِ ثُمَّ رَكِبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ غَدَاةٍ مَرْكَبًا فَخَسَفَتْ الشَّمْسُ قَالَتْ عَائِشَةُ فَخَرَجْتُ فِي نِسْوَةٍ بَيْنَ ظَهْرَيْ الْحُجَرِ فِي الْمَسْجِدِ فَأَتَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ مَرْكَبِهِ حَتَّى انْتَهَى إِلَى مُصَلَّاهُ الَّذِي كَانَ يُصَلِّي فِيهِ فَقَامَ وَقَامَ النَّاسُ وَرَاءَهُ قَالَتْ عَائِشَةُ فَقَامَ قِيَامًا طَوِيلًا ثُمَّ رَكَعَ فَرَكَعَ رُكُوعًا طَوِيلًا ثُمَّ رَفَعَ فَقَامَ قِيَامًا طَوِيلًا وَهُوَ دُونَ الْقِيَامِ الْأَوَّلِ ثُمَّ رَكَعَ فَرَكَعَ رُكُوعًا طَوِيلًا وَهُوَ دُونَ ذَلِكَ الرُّكُوعِ ثُمَّ رَفَعَ وَقَدْ تَجَلَّتْ الشَّمْسُ فَقَالَ إِنِّي قَدْ رَأَيْتُكُمْ تُفْتَنُونَ فِي الْقُبُورِ كَفِتْنَةِ الدَّجَّالِ قَالَتْ عَمْرَةُ فَسَمِعْتُ عَائِشَةَ تَقُولُ فَكُنْتُ أَسْمَعُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَ ذَلِكَ يَتَعَوَّذُ مِنْ عَذَابِ النَّارِ وَعَذَابِ الْقَبْرِ.",
                "headingArabic": "ذِكْرِ عَذَابِ الْقَبْرِ فِي صَلاَةِ الْخُسُوفِ ‏",
                "headingUrdu": "سورج گرہن کی نماز میں قبر میں عذاب کا ذکر",
                "headingEnglish": "Mentioning The Punishment In The Grave During The Eclipse Prayer",
                "chapterId": "11",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 111,
                    "chapterNumber": "11",
                    "chapterEnglish": "The Book of Prayer - Eclipses",
                    "chapterUrdu": "سورج اور چاند گرہن کے احکام",
                    "chapterArabic": "كتاب الْكُسُوفِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9663,
                "hadithNumber": "2099",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated by Yahya bin Sa'id with the same chain of transmitters.",
                "hadithUrdu": "اور ہم سے محمد بن المثنیٰ نے بیان کیا, عبدالوہاب اور سفیان نے یحییٰ بن سعید سے اسی سند کے ساتھ سلیمان بن بلال کی حدیث کے ہم معنی روایت بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَاه مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْوَهَّابِ ح و حَدَّثَنِي ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ جَمِيعًا عَنْ يَحْيَى بْنِ سَعِيدٍ فِي هَذَا الْإِسْنَادِ بِمِثْلِ مَعْنَى حَدِيثِ سُلَيْمَانَ بْنِ بِلَالٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "11",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 111,
                    "chapterNumber": "11",
                    "chapterEnglish": "The Book of Prayer - Eclipses",
                    "chapterUrdu": "سورج اور چاند گرہن کے احکام",
                    "chapterArabic": "كتاب الْكُسُوفِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 9351,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=374",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=372",
                "label": "372",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=373",
                "label": "373",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=374",
                "label": "374",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=375",
                "label": "375",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=376",
                "label": "376",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=377",
                "label": "377",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=378",
                "label": "378",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=376",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=376",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=374",
        "to": 9375,
        "total": 40465
    }
}