{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 572,
        "data": [
            {
                "id": 14564,
                "hadithNumber": "7001",
                "englishNarrator": "Abdullah bin Mas'ud رضی اللہ عنہ reported:",
                "hadithEnglish": "A person kissed a woman and he came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and made a mention of that to him. It was (on this occasion) that this verse was revealed: And observe prayer at the (two) ends of the day and in the first hours of the night. Surely, good deeds take away evil deeds. That is a reminder for the mindful (xi. 115). That person said: Allah's Messenger, does it concern me only? He (the Holy Prophet) said: It concerns every one of my Unimah, who acts according to it.",
                "hadithUrdu": "ایک شخص نے ایک عورت کو بوسہ دیا ، ( پھر ) وہ نبی اکرم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور اس واقعے کا ذکر کیا ، تب ( یہ آیت ) نازل ہوئی : \" دن کے دونوں حصوں اور رات کے کچھ حصوں میں نماز قائم رکھو ، بےشک نیکیاں برائیوں کو دور کر دیتی ہیں ، یہ یاد دہانی ہے یاد رکھنے والوں کے لیے ۔ \" اس شخص نے کہا : اللہ کے رسول! کیا یہ ( بشارت ) صرف میرے لیے ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا : \" میری امت میں سے جو بھی ( گناہوں سے پاک ہونے کے لیے ) اس پر عمل کرے ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید اور ابو کامل فضیل بن حسین الجہدری نے بیان کیا, یزید نے کہا؛ ہمیں تیمی نے ابوعثمان سے حدیث بیان کی ، انہوں نے حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَأَبُو كَامِلٍ فُضَيْلُ بْنُ حُسَيْنٍ الْجَحْدَرِيُّ كِلَاهُمَا عَنْ يَزِيدَ بْنِ زُرَيْعٍ وَاللَّفْظُ لِأَبِي كَامِلٍ حَدَّثَنَا يَزِيدُ حَدَّثَنَا التَّيْمِيُّ عَنْ أَبِي عُثْمَانَ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ أَنَّ رَجُلًا أَصَابَ مِنْ امْرَأَةٍ قُبْلَةً فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ ذَلِكَ لَهُ قَالَ فَنَزَلَتْ أَقِمْ الصَّلَاةَ طَرَفَيْ النَّهَارِ وَزُلَفًا مِنْ اللَّيْلِ إِنَّ الْحَسَنَاتِ يُذْهِبْنَ السَّيِّئَاتِ ذَلِكَ ذِكْرَى لِلذَّاكِرِينَ قَالَ فَقَالَ الرَّجُلُ أَلِيَ هَذِهِ يَا رَسُولَ اللَّهِ قَالَ لِمَنْ عَمِلَ بِهَا مِنْ أُمَّتِي.",
                "headingArabic": "قَوْلِهِ تَعَالَى ‏{‏ إِنَّ الْحَسَنَاتِ يُذْهِبْنَ السَّيِّئَاتِ}",
                "headingUrdu": "اللہ تعالیٰ کا ارشاد ہے: ’’بے شک نیکیاں برائیوں کو دور کرتی ہیں‘‘۔",
                "headingEnglish": "The Words Of Allah The Most High: \"Verily, The Good Deeds Remove The Evil Deeds\"",
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14565,
                "hadithNumber": "7002",
                "englishNarrator": "Ibn Mas'ud رضی اللہ عنہ reported:",
                "hadithEnglish": "A person came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and told him that he had kissed a woman or touched her with his hand or did something like this. He inquired of him about its expiation. It was (on this occasion) that Allah, the Exalted and Glorious, revealed this verse (as mentioned above)",
                "hadithUrdu": "ایک شخص نبی صلی اللہ علیہ وسلم کی خدمت میں آیا اور اس نے ذکر کیا کہ اس نے ایک عورت کو بوسہ دیا ہے یا اس کو ہاتھ سے مس کیا ہے ( یا ایسا ) کوئی اور کام کیا ہے ، گویا کہ وہ اس کے کفار کے متعلق سوال کر رہا ہے ، کہا : تب اللہ عزوجل نے یہ آیت نازل فرمائی ، پھر یزید کی حدیث کے مانند بیان کیا ۔",
                "urduNarrator": "ہم سے محمد بن عبد العلا نے بیان کیا, معتمر نے اپنے والد ( سلیمان تیمی ) سے روایت کی ، انہوں نے کہا : ہمیں ابوعثمان نے حضرت ابن مسعود رضی اللہ عنہ سے حدیث بیان کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى حَدَّثَنَا الْمُعْتَمِرُ عَنْ أَبِيهِ حَدَّثَنَا أَبُو عُثْمَانَ عَنْ ابْنِ مَسْعُودٍ أَنَّ رَجُلًا أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ أَنَّهُ أَصَابَ مِنْ امْرَأَةٍ إِمَّا قُبْلَةً أَوْ مَسًّا بِيَدٍ أَوْ شَيْئًا كَأَنَّهُ يَسْأَلُ عَنْ كَفَّارَتِهَا قَالَ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ يَزِيدَ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14566,
                "hadithNumber": "7003",
                "englishNarrator": "This hadith has been narrated on the authority of Sulaiman Taimi with the same chain of transmitters:",
                "hadithEnglish": "A person had taken liberty with a woman less than intercourse. He came to 'Umar b. Khattab رضی اللہ عنہ and he took it to be a serious offence. Then he came to Abu Bakr and he also took it to be a serious offence. Then he came the Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and he made a mention of this to him. The rest of the hadith is the same.",
                "hadithUrdu": "ایک شخص نے ایک عورت کے ساتھ زنا سے کم درجے کا کوئی کام کیا ۔ وہ حضرت عمر بن خطاب رضی اللہ عنہ کے پاس گیا ، انہوں نے اس کے سامنے اس کو بہت بڑا گناہ قرار دیا ، پھر وہ حضرت ابوبکر رضی اللہ عنہ کے پاس آیا ، انہوں نے بھی اس کے لیے اس کو بہت بڑی بات قرار دیا ، پھر وہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا ، ( آگے ) یزید اور معتمر کی حدیث کے مانند بیان کیا ۔",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ نے بیان کیا۔ اس نے ہمیں بتایا: جریر نے سلیمان تیمی سے اسی سند کے ساتھ روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ سُلَيْمَانَ التَّيْمِيِّ بِهَذَا الْإِسْنَادِ قَالَ أَصَابَ رَجُلٌ مِنْ امْرَأَةٍ شَيْئًا دُونَ الْفَاحِشَةِ فَأَتَى عُمَرَ بْنَ الْخَطَّابِ فَعَظَّمَ عَلَيْهِ ثُمَّ أَتَى أَبَا بَكْرٍ فَعَظَّمَ عَلَيْهِ ثُمَّ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ بِمِثْلِ حَدِيثِ يَزِيدَ وَالْمُعْتَمِرِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14567,
                "hadithNumber": "7004",
                "englishNarrator": "Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "A person came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and said: Allah's Messenger, I sported with a woman in the outskirts of Medina, and I have committed an offence short of fornication. Here I am (before you), kindly deliver verdict about me which you deem fit. Umar رضی اللہ عنہ said: Allah concealed your fault. You had better conceal it yourself also. Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), however, gave no reply to him. The man stood up and went away and Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) sent a person after him to call him and be recited this verse: And observe prayer at the ends of the day and in the first hours of the night. Surely, good deeds take away evil deeds. That is a reminder for the mindful (xi. 115). A person amongst the people said: Allah's Apostle, does it concern this man only? Thereupon he (the Holy Prophet) said: No, but the people at large.",
                "hadithUrdu": "ایک شخص نبی صلی اللہ علیہ وسلم کے پاس آیا تو اس نے کہا : اللہ کے رسول! میں نے مدینہ کے آخری حصے میں ایک عورت کو قابو کر لیا اور اس کے علاوہ کہ میں اس سے جماع کروں میں نے اس سے اور سب کچھ حاصل کر لیا ۔ تو ( اب ) میں آپ کے سامنے حاضر ہوں ، آپ میرے بارے میں جو چاہیں فیصلہ کر لیں ۔ حضرت عمر رضی اللہ عنہ نے اس سے کہا : اللہ نے تمہارا پردہ رکھا ، کاش! تم خود بھی اپنا پردہ رکھتے ۔ ( حضرت عبداللہ بن مسعود رضی اللہ عنہ نے ) کہا : رسول اللہ صلی اللہ علیہ وسلم نے اسے کوئی جواب نہ دیا ۔ تو ( کچھ دیر بعد ) وہ شخص اٹھا اور چل دیا ۔ نبی صلی اللہ علیہ وسلم نے اس کے پیچھے ایک آدمی بھیج کر اسے بلایا اور اس کے سامنے یہ آیت پڑھی : \" دن کے دونوں حصوں اور رات کے کچھ حصوں میں نماز قائم کرو ، بےشک نیکیاں برائیوں کو ختم کر دیتی ہیں ۔ یہ ان کے لیے یاددہانی ہے جو اچھی بات کو یاد رکھنے والے ہیں ۔ \" اس پر لوگوں میں سے ایک آدمی نے کہا : اللہ کے نبی! کیا یہ خاص اسی کے لیے ہے؟ آپ صلی اللہ علیہ وسلم نے ارشاد فرمایا : \" بلکہ تمام لوگوں کے لیے ہے ۔ \"",
                "urduNarrator": "ابو احوص نے سماک سے ، انہوں نے ابراہیم سے ، انہوں نے علقمہ اور اسود سے اور انہوں نے حضرت عبداللہ ( بن مسعود رضی اللہ عنہ ) سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَقُتَيْبَةُ بْنُ سَعِيدٍ وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَاللَّفْظُ لِيَحْيَى قَالَ يَحْيَى أَخْبَرَنَا و قَالَ الْآخَرَانِ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ سِمَاكٍ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ وَالْأَسْوَدِ عَنْ عَبْدِ اللَّهِ قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي عَالَجْتُ امْرَأَةً فِي أَقْصَى الْمَدِينَةِ وَإِنِّي أَصَبْتُ مِنْهَا مَا دُونَ أَنْ أَمَسَّهَا فَأَنَا هَذَا فَاقْضِ فِيَّ مَا شِئْتَ فَقَالَ لَهُ عُمَرُ لَقَدْ سَتَرَكَ اللَّهُ لَوْ سَتَرْتَ نَفْسَكَ قَالَ فَلَمْ يَرُدَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْئًا فَقَامَ الرَّجُلُ فَانْطَلَقَ فَأَتْبَعَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا دَعَاهُ وَتَلَا عَلَيْهِ هَذِهِ الْآيَةَ أَقِمْ الصَّلَاةَ طَرَفَيْ النَّهَارِ وَزُلَفًا مِنْ اللَّيْلِ إِنَّ الْحَسَنَاتِ يُذْهِبْنَ السَّيِّئَاتِ ذَلِكَ ذِكْرَى لِلذَّاكِرِينَ فَقَالَ رَجُلٌ مِنْ الْقَوْمِ يَا نَبِيَّ اللَّهِ هَذَا لَهُ خَاصَّةً قَالَ بَلْ لِلنَّاسِ كَافَّةً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14568,
                "hadithNumber": "7005",
                "englishNarrator": "This hadith has been transmitted by Abu al-Ahwas and in this (these words are) also found: Mu'adh رضی اللہ عنہ said:",
                "hadithEnglish": "Allah's Messenger, does it concern this particular case or to all of us? And he (the Holy Prophet) said: Of course, to all of you.",
                "hadithUrdu": "اللہ کے رسول! کیا یہ خاص اسی کے لیے ہے یا عمومی طور پر ہم سب کے لیے ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا : \" بلکہ تم سب کے لیے عام ہے ۔ \"",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا، کہا ہم سے ابو النعمان الحکم بن عبداللہ العجلی نے بیان کیا, شعبہ نے سماک بن حرب سے روایت کی ، انہوں نے کہا : میں نے ابراہیم کو اپنے ماموں اسود سے حدیث بیان کرتے ہوئے سنا ، انہوں نے حضرت عبداللہ ( بن مسعود رضی اللہ عنہ ) سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے ابو احوص کی حدیث کے ہم معنی روایت کی ، انہوں نے اپنی حدیث میں کہا : تو حضرت معاذ رضی اللہ عنہ نے عرض کی",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا أَبُو النُّعْمَانِ الْحَكَمُ بْنُ عَبْدِ اللَّهِ الْعِجْلِيُّ حَدَّثَنَا شُعْبَةُ عَنْ سِمَاكِ بْنِ حَرْبٍ قَالَ سَمِعْتُ إِبْرَاهِيمَ يُحَدِّثُ عَنْ خَالِهِ الْأَسْوَدِ عَنْ عَبْدِ اللَّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَى حَدِيثِ أَبِي الْأَحْوَصِ وَقَالَ فِي حَدِيثِهِ فَقَالَ مُعَاذٌ يَا رَسُولَ اللَّهِ هَذَا لِهَذَا خَاصَّةً أَوْ لَنَا عَامَّةً قَالَ بَلْ لَكُمْ عَامَّةً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14569,
                "hadithNumber": "7006",
                "englishNarrator": "Anas رضی اللہ عنہ reported:",
                "hadithEnglish": "A person came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Allah's Messenger, I have committed an offence which deserves imposition of haad, so impose it upon me according to the Book of Allah. Thereupon he said: Were you not present with us at the time of prayer? He said: Yes. Thereupon he said: You have been granted pardon.",
                "hadithUrdu": "ایک شخص نبی صلی اللہ علیہ وسلم کے پاس آیا اور عرض کی : اللہ کے رسول! میں نے حد ( لگنے والے کام ) کا ارتکاب کر لیا ہے ، مجھ پر حد قائم کیجئے ۔ ( حضرت انس رضی اللہ عنہ نے ) کہا : ( تب ) نماز کا وقت آ گیا ، اس نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نماز پڑھی ۔ جب نماز پڑھ لی تو کہنے لگا : اللہ کے رسول! میں نے حد ( کے قابل گناہ ) کا ارتکاب کیا ہے ، میرے بارے میں اللہ کی کتاب کا ( جو ) فیصلہ ( ہے اسے ) نافذ فرمائیے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" کیا تو ہمارے ساتھ نماز میں شامل ہوا؟ \" اس نے عرض کی : ہاں ، فرمایا : \" تیرا گناہ بخش دیا گیا ہے ۔ \"",
                "urduNarrator": "ہم سے حسن بن علی الحلوانی نے بیان کیا، کہا ہم سے عمرو بن عاصم نے بیان کیا، کہا ہم سے ہمام نے بیان کیا، وہ اسحاق بن عبداللہ بن ابی طلحہ کی سند سے, حضرت انس رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ حَدَّثَنَا هَمَّامٌ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ عَنْ أَنَسٍ قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ أَصَبْتُ حَدًّا فَأَقِمْهُ عَلَيَّ قَالَ وَحَضَرَتْ الصَّلَاةُ فَصَلَّى مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا قَضَى الصَّلَاةَ قَالَ يَا رَسُولَ اللَّهِ إِنِّي أَصَبْتُ حَدًّا فَأَقِمْ فِيَّ كِتَابَ اللَّهِ قَالَ هَلْ حَضَرْتَ الصَّلَاةَ مَعَنَا قَالَ نَعَمْ قَالَ قَدْ غُفِرَ لَكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14570,
                "hadithNumber": "7007",
                "englishNarrator": "Abu Umama  رضی اللہ عنہ reported:",
                "hadithEnglish": "We were sitting in the mosque in the company of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). A person came there and said: Allah's Messenger, I have committed an offence which deserves the imposition of hadd upon me, so impose it upon me. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) kept silent. He repeated it and said: Allah's Messenger, I have committed an offence which deserves the imposition of hadd upon me, so impose it upon me. He (the Holy Prophet) kept silent, and it was at this time that Iqama was pronounced for prayer (and the prayer was observed). And when Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had concluded the payer that person followed Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). Abu Umama رضی اللہ عنہ said: I too followed Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) after he had concluded the prayer, so that I should know what answer he would give to that person. That person remained attached to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: Allah's Messenger, I have committed an offence which deserves imposition of hadd upon me, so impose it upon me. Abu Umama رضی اللہ عنہ reported that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to him: Didn't you see that as you got out of the house, you performed ablution perfectly well. He said: Allah's Messenger, of course. I did it. He again said to him: Then you observed prayer along with us. He said: Allah's Messenger, yes, it is so. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said to him: Verily, Allah has exempted you from the imposition of hadd, or he said. From your sin.",
                "hadithUrdu": "ایک بار رسول اللہ صلی اللہ علیہ وسلم مسجد میں تشریف فرما تھے اور ہم بھی آپ کے پاس بیٹھے ہوئے تھے کہ ایک شخص آیا تو کہنے لگا : اللہ کے رسول! میں نے حد ( کے قابل گناہ ) کا ارتکاب کر دیا ہے ، لہذا آپ مجھ پر حد قائم کیجئے ۔ رسول اللہ صلی اللہ علیہ وسلم خاموش رہے ، اس نے دوبارہ کہا : اللہ کے رسول! میں حد کا مستحق ہو گیا ہوں ، آپ مجھ پر حد قائم کیجئے ۔ نبی صلی اللہ علیہ وسلم خاموش رہے ، اس نے تیسری بار ( یہی ) کہا تو ( اس وقت ) نماز کی اقامت کہہ دی گئی ۔ حضرت ابو امامہ رضی اللہ عنہ نے کہا : جب رسول اللہ صلی اللہ علیہ وسلم نماز سے ( فارغ ہو کر ) واپس ہوئے تو وہ شخص آپ کے پیچھے چل پڑا ، میں ( بھی ) رسول اللہ صلی اللہ علیہ وسلم کے پیچھے چل پڑا کہ دیکھوں آپ صلی اللہ علیہ وسلم اس کو کیا جواب دیتے ہیں ۔ وہ شخص رسول اللہ صلی اللہ علیہ وسلم سے جا ملا اور کہا : اللہ کے رسول! میں نے حد ( کے قابل گناہ ) کا ارتکاب کیا ہے ، آپ مجھ پر حد قائم فرمائیں ۔ حضرت ابو امامہ رضی اللہ عنہ نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے اس سے کہا : \" ذرا دیکھو : جب تم اپنے گھر سے نکلے تھے تو تم نے وضو کیا تھا اور اچھی طرح وضو کیا تھا؟ \" اس نے عرض کی : ہاں ، اللہ کے رسول! ( اچھی طرح وضو کیا تھا ۔ ) فرمایا : \" اس کے بعد تم نے ہمارے ساتھ نماز پڑھی؟ \" اس نے عرض کی : جی ہاں ، اللہ کے رسول! ( حضرت ابو امامہ رضی اللہ عنہ نے ) کہا : رسول اللہ صلی اللہ علیہ وسلم نے اُسے فرمایا : \" تو یقینا اللہ تعالیٰ نے تمہاری حد ۔ ۔ یا فرمایا ۔ ۔ تمہارے گناہ کو معاف کر دیا ہے ۔ \"",
                "urduNarrator": "ہم سے نصر بن علی الجہضَمی اور زہیر بن حرب نے بیان کیا اور لفظ زہیر کا ہے۔ انہوں نے کہا کہ ہم سے عمر بن یونس نے بیان کیا، ہم سے عکرمہ بن عمار نے بیان کیا, شداد نے ہمیں حدیث بیان کی ، کہا : ہمیں حضرت ابو امامہ رضی اللہ عنہ نے حدیث بیان کی ، کہا",
                "hadithArabic": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ وَزُهَيْرُ بْنُ حَرْبٍ وَاللَّفْظُ لِزُهَيْرٍ قَالَا حَدَّثَنَا عُمَرُ بْنُ يُونُسَ حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ حَدَّثَنَا شَدَّادٌ حَدَّثَنَا أَبُو أُمَامَةَ قَالَ بَيْنَمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَسْجِدِ وَنَحْنُ قُعُودٌ مَعَهُ إِذْ جَاءَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي أَصَبْتُ حَدًّا فَأَقِمْهُ عَلَيَّ فَسَكَتَ عَنْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ أَعَادَ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي أَصَبْتُ حَدًّا فَأَقِمْهُ عَلَيَّ فَسَكَتَ عَنْهُ وَأُقِيمَتْ الصَّلَاةُ فَلَمَّا انْصَرَفَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَبُو أُمَامَةَ فَاتَّبَعَ الرَّجُلُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ انْصَرَفَ وَاتَّبَعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْظُرُ مَا يَرُدُّ عَلَى الرَّجُلِ فَلَحِقَ الرَّجُلُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي أَصَبْتُ حَدًّا فَأَقِمْهُ عَلَيَّ قَالَ أَبُو أُمَامَةَ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرَأَيْتَ حِينَ خَرَجْتَ مِنْ بَيْتِكَ أَلَيْسَ قَدْ تَوَضَّأْتَ فَأَحْسَنْتَ الْوُضُوءَ قَالَ بَلَى يَا رَسُولَ اللَّهِ قَالَ ثُمَّ شَهِدْتَ الصَّلَاةَ مَعَنَا فَقَالَ نَعَمْ يَا رَسُولَ اللَّهِ قَالَ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِنَّ اللَّهَ قَدْ غَفَرَ لَكَ حَدَّكَ أَوْ قَالَ ذَنْبَكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14571,
                "hadithNumber": "7008",
                "englishNarrator": "Abu Sa'id al-Khudri  رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: There was a person before you who had killed ninety-nine persons and then made an inquiry about the learned persons of the world (who could show him the way to salvation). He was directed to a monk. He came to him and told him that he had killed ninety-nine persons and asked him whether there was any scope for his repentance to be accepted. He said: No. He killed him also and thus completed one hundred. He then asked about the learned persons of the earth and he was directed to a scholar, and he told him that he had killed one hundred persons and asked him whether there was any scope for his repentance to be accepted. He said: Yes; what stands between you and the repentance? You better go to such and such land; there are people devoted to prayer and worship and you also worship along with them and do not come to the land of yours since it was an evil land (for you). So he went away and he had hardly covered half the distance when death came to him and there was a dispute between the angels of mercy and the angels of punishment. The angels of mercy said: This man has come as a penitant and remorseful to Allah and the angels of punishment said: He has done no good at all. Then there came another angel in the form of a human being in order to decide between them. He said: You measure the land to which he has drawn near. They measured it and found him nearer to the land where he intended to go (the land of piety), and so the angels of mercy took possession of it. Qatada said that Hasan told him that it was said to them that as death approached him, he crawled upon his chest (and managed) to slip in the land of mercy.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے فرمایا : \"\" تم سے پہلے لوگوں میں سے ایک شخص تھا اس نے ننانوے قتل کیے ، پھر اس نے زمین پر بسنے والوں میں سے سب سے بڑے عالم کے بارے میں پوچھا ( کہ وہ کون ہے ۔ ) اسے ایک راہب کا پتہ بتایا گیا ۔ وہ اس کے پاس آیا اور پوچھا کہ اس نے ننانوے قتل کیے ہیں ، کیا اس کے لیے توبہ ( کی کوئی سبیل ) ہے؟ اس نے کہا : نہیں ۔ تو اس نے اسے بھی قتل کر دیا اور اس ( کے قتل ) سے سو قتل پورے کر لیے ۔ اس نے پھر اہل زمین میں سے سب سے بڑے عالم کے بارے میں دریافت کیا ۔ اسے ایک عالم کا پتہ بتایا گیا ۔ تو اس نے ( جا کر ) کہا : اس نے سو قتل کیے ہیں ، کیا اس کے لیے توبہ ( کا امکان ) ہے؟ اس ( عالم ) نے کہا : ہاں ، اس کے اور توبہ کے درمیان کون حائل ہو سکتا ہے؟ تم فلاں فلاں سرزمین پر چلے جاؤ ، وہاں ( ایسے ) لوگ ہیں جو اللہ تعالیٰ کی عبادت کرتے ہیں ، تم بھی ان کے ساتھ اللہ کی عبادت میں مشغول ہو جاؤ اور اپنی سرزمین پر واپس نہ آو ، یہ بُری ( باتوں سے بھری ہوئی ) سرزمین ہے ۔ وہ چل پڑا ، یہاں تک کہ جب آدھا راستہ طے کر لیا تو اسے موت آ لیا ۔ اس کے بارے میں رحمت کے فرشتے اور عذاب کے فرشتے جھگڑنے لگے ۔ رحمت کے فرشتوں نے کہا : یہ شخص توبہ کرتا ہوا اپنے دل کو اللہ کی طرف متوجہ کر کے آیا تھا اور عذاب کے فرشتوں نے کہا : اس نے کبھی نیکی کا کوئی کام نہیں کیا ۔ تو ایک فرشتہ آدمی کے روپ میں ان کے پاس آیا ، انہوں نے اسے اپنے درمیان ( ثالث ) مقرر کر لیا ۔ اس نے کہا : دونوں زمینوں کے درمیان فاصلہ ماپ لو ، وہ دونوں میں سے جس زمین کے زیادہ قریب ہو تو وہ اسی ( زمین کے لوگوں ) میں سے ہو گا ۔ انہوں نے مسافت کو ماپا تو اسے اس زمین کے قریب تر پایا جس کی طرف وہ جا رہا تھا ، چنانچہ رحمت کے فرشتوں نے اسے اپنے ہاتھوں میں لے لیا ۔ \"\" قتادہ نے کہا : حسن ( بصری ) نے کہا : ( اس حدیث میں ) ہمیں بتایا گیا کہ جب اسے موت نے آ لیا تھا تو اس نے اپنے سینے سے ( گھسیٹ کر ) خود کو ( گناہوں بھری زمین سے ) دور کر لیا تھا ۔",
                "urduNarrator": "ہم سے محمد بن المثنیٰ اور محمد بن بشار نے بیان کیا، اور قول ابن المثنیٰ کا ہے۔ انہوں نے کہا: ہم سے معاذ بن مثنیٰ نے بیان کیا, ہشام نے قتادہ سے ، انہوں نے ابوصدیق سے اور انہوں نے حضرت ابوسعید خدری رضی اللہ عنہ سے روایت کی ، کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ وَاللَّفْظُ لِابْنِ الْمُثَنَّى قَالَا حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ أَبِي الصِّدِّيقِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كَانَ فِيمَنْ كَانَ قَبْلَكُمْ رَجُلٌ قَتَلَ تِسْعَةً وَتِسْعِينَ نَفْسًا فَسَأَلَ عَنْ أَعْلَمِ أَهْلِ الْأَرْضِ فَدُلَّ عَلَى رَاهِبٍ فَأَتَاهُ فَقَالَ إِنَّهُ قَتَلَ تِسْعَةً وَتِسْعِينَ نَفْسًا فَهَلْ لَهُ مِنْ تَوْبَةٍ فَقَالَ لَا فَقَتَلَهُ فَكَمَّلَ بِهِ مِائَةً ثُمَّ سَأَلَ عَنْ أَعْلَمِ أَهْلِ الْأَرْضِ فَدُلَّ عَلَى رَجُلٍ عَالِمٍ فَقَالَ إِنَّهُ قَتَلَ مِائَةَ نَفْسٍ فَهَلْ لَهُ مِنْ تَوْبَةٍ فَقَالَ نَعَمْ وَمَنْ يَحُولُ بَيْنَهُ وَبَيْنَ التَّوْبَةِ انْطَلِقْ إِلَى أَرْضِ كَذَا وَكَذَا فَإِنَّ بِهَا أُنَاسًا يَعْبُدُونَ اللَّهَ فَاعْبُدْ اللَّهَ مَعَهُمْ وَلَا تَرْجِعْ إِلَى أَرْضِكَ فَإِنَّهَا أَرْضُ سَوْءٍ فَانْطَلَقَ حَتَّى إِذَا نَصَفَ الطَّرِيقَ أَتَاهُ الْمَوْتُ فَاخْتَصَمَتْ فِيهِ مَلَائِكَةُ الرَّحْمَةِ وَمَلَائِكَةُ الْعَذَابِ فَقَالَتْ مَلَائِكَةُ الرَّحْمَةِ جَاءَ تَائِبًا مُقْبِلًا بِقَلْبِهِ إِلَى اللَّهِ وَقَالَتْ مَلَائِكَةُ الْعَذَابِ إِنَّهُ لَمْ يَعْمَلْ خَيْرًا قَطُّ فَأَتَاهُمْ مَلَكٌ فِي صُورَةِ آدَمِيٍّ فَجَعَلُوهُ بَيْنَهُمْ فَقَالَ قِيسُوا مَا بَيْنَ الْأَرْضَيْنِ فَإِلَى أَيَّتِهِمَا كَانَ أَدْنَى فَهُوَ لَهُ فَقَاسُوهُ فَوَجَدُوهُ أَدْنَى إِلَى الْأَرْضِ الَّتِي أَرَادَ فَقَبَضَتْهُ مَلَائِكَةُ الرَّحْمَةِ قَالَ قَتَادَةُ فَقَالَ الْحَسَنُ ذُكِرَ لَنَا أَنَّهُ لَمَّا أَتَاهُ الْمَوْتُ نَأَى بِصَدْرِهِ.",
                "headingArabic": "قَبُولِ تَوْبَةِ الْقَاتِلِ وَإِنْ كَثُرَ قَتْلُهُ ‏‏",
                "headingUrdu": "قتل کرنے والے کی توبہ کی قبولیت، اگرچہ اس نے بہت زیادہ قتل کیا ہو۔",
                "headingEnglish": "The Acceptance Of The Repentance Of The One Who Kills, Even If He Has Killed A Great Deal",
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14572,
                "hadithNumber": "7009",
                "englishNarrator": "Abu Sa'id al-Khudri رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying that a man killed ninety-nine persons and then he began to make an inquiry whether there was any way left for him for repentance. He came to a monk and asked him about that, and he said: There is no chance for repentance for you. He killed the monk also and then began to make an inquiry and moved from one village to another village where there lived pious persons, and as he had covered some distance, he was overtaken by death, but he managed to crawl upon his chest (to the side nearer to the place where the pious men lived). He died and then there was a dispute between the angels of mercy and the angels of punishment and (when it was measured) he was found to be nearer to the village where pious persons were living equal to the Space of a span and he was thus included among them.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم سے روایت کی  \" ایک شخص نے ننانوے انسان قتل کیے ، پھر اس نے یہ پوچھنا شروع کر دیا : کیا اس کی توبہ ( کی کوئی سبیل ) ہو سکتی ہے؟ وہ ایک راہب کے پاس آیا ، اس سے پوچھا تو اس نے جواب دیا : تیرے لیے کوئی توبہ نہیں ۔ اس نے اس راہب کو ( بھی ) قتل کر دیا ۔ اس کے بعد اس نے پھر سے ( توبہ کے متعلق ) پوچھنا شروع کر دیا ، پھر ایک بستی سے ( دوسری ) بستی کی طرف نکل پڑا جس میں نیک لوگ رہتے تھے ۔ وہ راستے کے کسی حصے میں تھا کہ اسے موت نے آن لیا ، وہ ( اس وقت ) اپنے سینے کے ذریعے سے ( پچھلی گناہوں بھری بستی سے ) دور ہوا ، پھر مر گیا ۔ تو اس کے بارے میں رحمت کے فرشتوں اور عذاب کے فرشتوں نے آپس میں جھگڑا کیا ۔ تو وہ شخص ایک بالشت برابر نیک بستی کی طرف قریب تھا ، اسے اس بستی کے لوگوں میں سے ( شمار ) کر لیا گیا ۔ \"",
                "urduNarrator": "عبید اللہ بن معاذ بن عنبری نے کہا : ہمیں شعبہ نے قتادہ سے حدیث سنائی ، انہوں نے ابو صدیق ناجی سے سنا ، انہوں نے حضرت ابوسعید خدری رضی اللہ عنہ سے اور انہوں نے",
                "hadithArabic": "حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ أَنَّهُ سَمِعَ أَبَا الصِّدِّيقِ النَّاجِيَّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ رَجُلًا قَتَلَ تِسْعَةً وَتِسْعِينَ نَفْسًا فَجَعَلَ يَسْأَلُ هَلْ لَهُ مِنْ تَوْبَةٍ فَأَتَى رَاهِبًا فَسَأَلَهُ فَقَالَ لَيْسَتْ لَكَ تَوْبَةٌ فَقَتَلَ الرَّاهِبَ ثُمَّ جَعَلَ يَسْأَلُ ثُمَّ خَرَجَ مِنْ قَرْيَةٍ إِلَى قَرْيَةٍ فِيهَا قَوْمٌ صَالِحُونَ فَلَمَّا كَانَ فِي بَعْضِ الطَّرِيقِ أَدْرَكَهُ الْمَوْتُ فَنَأَى بِصَدْرِهِ ثُمَّ مَاتَ فَاخْتَصَمَتْ فِيهِ مَلَائِكَةُ الرَّحْمَةِ وَمَلَائِكَةُ الْعَذَابِ فَكَانَ إِلَى الْقَرْيَةِ الصَّالِحَةِ أَقْرَبَ مِنْهَا بِشِبْرٍ فَجُعِلَ مِنْ أَهْلِهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14573,
                "hadithNumber": "7010",
                "englishNarrator": "This hadith has been narrated on the authority of Qatida with the same chain of transmitters but (with this variation of wording):",
                "hadithEnglish": "Allah commanded the earth (from where) he wanted to come out to move itself away and to the other earth (where he wanted to go) to draw nearer.",
                "hadithUrdu": "\" تو اللہ نے اس ( گناہگاروں کی بستی ) کو وحی کر دی کہ تو دور ہو جا اور اس ( نیک لوگوں کی بستی ) کو وحی کر دی کہ تو قریب ہو جا ۔ \"",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا، کہا ہم سے ابن ابی عدی نے بیان کیا, شعبہ نے ہمیں قتادہ سے اسی سند کے ساتھ اسی طرح حدیث بیان کی جس طرح معاذ بن معاذ کی حدیث ہے اور اس میں مزید یہ کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ بِهَذَا الْإِسْنَادِ نَحْوَ حَدِيثِ مُعَاذِ بْنِ مُعَاذٍ وَزَادَ فِيهِ فَأَوْحَى اللَّهُ إِلَى هَذِهِ أَنْ تَبَاعَدِي وَإِلَى هَذِهِ أَنْ تَقَرَّبِي.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14574,
                "hadithNumber": "7011",
                "englishNarrator": "Abu Musa' رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: When it will be the Day of Resurrection Allah would deliver to every Muslim a Jew or a Christian and say: That is your rescue from Hell-Fire.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب قیامت کا دن ہو گا تو اللہ تعالیٰ ( ایک مرحلے پر ) ہر مسلمان کو ایک یہودی یا نصرانی عطا کر دے گا ، پھر فرمائے گا : یہ جہنم سے تمہارے لیے چھٹکارے کا ذریعہ بنے گا ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے ابو اسامہ نے بیان کیا, طلحہ بن یحییٰ نے ابوبردہ سے اور انہوں نے حضرت ابوموسیٰ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ طَلْحَةَ بْنِ يَحْيَى عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَى قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كَانَ يَوْمُ الْقِيَامَةِ دَفَعَ اللَّهُ عَزَّ وَجَلَّ إِلَى كُلِّ مُسْلِمٍ يَهُودِيًّا أَوْ نَصْرَانِيًّا فَيَقُولُ هَذَا فِكَاكُكَ مِنْ النَّارِ.",
                "headingArabic": "في سعة رحمة الله تعالٰى على المؤمنين، وفداء كل مسلم بكافرمن النار",
                "headingUrdu": "مومنوں پر اللہ کی رحمت کی وسعت ہے، اور ہر مسلمان کو کافروں کی طرف سے آگ سے نجات ملے گی۔",
                "headingEnglish": "The vaastness of Allah's merce towards the believers, and every Muslim will be ransomed by a disbelievers from the fire.",
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14575,
                "hadithNumber": "7012",
                "englishNarrator": "Abu Burda reported on the authority of his father:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: No Muslim would die but Allah would admit in his stead a Jew or a Christian in Hell-Fire. 'Umar bin Abdul-'Aziz took an oath: By One besides Whom there is no god but He, thrice that his father had narrated that to him from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and he swore to him. Saeed did not tell me that he asked him to swear, but he did not object to what 'Awn said.",
                "hadithUrdu": "آپ نے فرمایا : \" جو مسلمان بھی فوت ہوتا ہے اللہ تعالیٰ اس کی جگہ پر ایک یہودی یا ایک نصرانی کو دوزخ میں داخل کر دیتا ہے ۔ \" کہا : عمر بن عبدالعزیز نے حضرت ابوبُردہ کو تین بار اس اللہ کی قسم دی جس کے سوا کوئی عبادت کے لائق نہیں کہ واقعی ان کے والد نے انہیں رسول اللہ صلی اللہ علیہ وسلم سے یہ حدیث بیان کی تھی ۔ انہوں نے ان ( عمر بن عبدالعزیز ) کے سامنے قسم کھائی ۔ ( قتادہ نے ) کہا : سعید نے مجھ سے یہ بیان نہیں کیا کہ انہوں نے ان سے قسم لی اور نہ انہوں نے عون کی ( بتائی ہوئی ) بات پر کوئی اعتراض کیا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, عفان بن مسلم نے ہمیں حدیث بیان کی ، کہا : ہمیں ہمام نے قتادہ سے حدیث بیان کی کہ عون ( بن عبداللہ ) اور سعید بن ابی بردہ نے انہیں حدیث بیان کی ، وہ دونوں ابو بردہ کے سامنے موجود تھے جب وہ حضرت عمر بن عبدالعزیز کو اپنے والد سے حدیث بیان کر رہے تھے ، انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ أَنَّ عَوْنًا وَسَعِيدَ بْنَ أَبِي بُرْدَةَ حَدَّثَاهُ أَنَّهُمَا شَهِدَا أَبَا بُرْدَةَ يُحَدِّثُ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَمُوتُ رَجُلٌ مُسْلِمٌ إِلَّا أَدْخَلَ اللَّهُ مَكَانَهُ النَّارَ يَهُودِيًّا أَوْ نَصْرَانِيًّا قَالَ فَاسْتَحْلَفَهُ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ بِاللَّهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ ثَلَاثَ مَرَّاتٍ أَنَّ أَبَاهُ حَدَّثَهُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَحَلَفَ لَهُ قَالَ فَلَمْ يُحَدِّثْنِي سَعِيدٌ أَنَّهُ اسْتَحْلَفَهُ وَلَمْ يُنْكِرْ عَلَى عَوْنٍ قَوْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14576,
                "hadithNumber": "7013",
                "englishNarrator": null,
                "hadithEnglish": "Qatadah narrated a Hadith like that of 'Affan (no.7012), with this chain of narrators, and he said: \"Aun bin Utba.\"",
                "hadithUrdu": "ہم سب سے اسحاق بن ابراہیم اور محمد بن المثنیٰ نے بیان کیا, عبدالصمد بن عبدالوارث سے روایت ہے ، کہا : ہمیں ہمام نے خبر دی ، انہوں نے کہا : ہمیں قتادہ نے اسی سند کے ساتھ عفان کی حدیث کے مانند حدیث بیان کی اور ( عون بن عبداللہ کی نسبت اس کے دادا کی طرف کرتے ہوئے ) کہا : عون بن عتبہ ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَمُحَمَّدُ بْنُ الْمُثَنَّى جَمِيعًا عَنْ عَبْدِ الصَّمَدِ بْنِ عَبْدِ الْوَارِثِ أَخْبَرَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ بِهَذَا الْإِسْنَادِ نَحْوَ حَدِيثِ عَفَّانَ وَقَالَ عَوْنُ بْنُ عُتْبَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14577,
                "hadithNumber": "7014",
                "englishNarrator": "Abu Burda reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: There would come people amongst the Muslims on the Day of Resurrection with as heavy sins as a mountain, and Allah would forgive them and He would place in their stead the Jews and the Christians. (As far as I think), Abu Raub said: I do not know as to who is in doubt. Abu Burda said: I narrated it to 'Umar bin 'Abdul-'Aziz, whereupon he said: Was it your father who narrated it to you from Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌)? I said: Yes.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" قیامت کے دن مسلمانوں میں سے کچھ لوگ پہاڑوں جیسے ( بڑے بڑے ) گناہ لے کر آئیں گے ، اللہ تعالیٰ ان کے لیے وہ گناہ بخش دے گا ، اور جہاں تک میں سمجھتا ہوں ، وہ ان ( گناہوں ) کو یہود اور نصاری پر ڈال دے گا ۔ \"\" ابو روح نے کہا : مجھے معلوم نہیں کہ یہ شک کس ( راوی ) کی طرف سے ہے ۔ حضرت ابو بردہ نے کہا : میں نے یہ حدیث عمر بن عبدالعزیز کو بیان کی ، انہوں نے کہا : کیا تمہارے والد نے تمہیں یہ حدیث نبی صلی اللہ علیہ وسلم سے بیان کی تھی؟ میں نے کہا : ہاں ۔",
                "urduNarrator": "ہم سے محمد بن عمرو بن عباد بن جبلہ بن ابی رواد نے بیان کیا, ( ابوروح ) حرمی بن عمارہ نے کہا : ہمیں شداد ابو طلحہ راسبی نے غیلان بن جریر سے حدیث بیان کی ، انہوں نے ابو بردہ سے ، انہوں نے اپنے والد ( حضرت ابو موسی رضی اللہ عنہ ) سے اور انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرِو بْنِ عَبَّادِ بْنِ جَبَلَةَ بْنِ أَبِي رَوَّادٍ حَدَّثَنَا حَرَمِيُّ بْنُ عُمَارَةَ حَدَّثَنَا شَدَّادٌ أَبُو طَلْحَةَ الرَّاسِبِيُّ عَنْ غَيْلَانَ بْنِ جَرِيرٍ عَنْ أَبِي بُرْدَةَ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَجِيءُ يَوْمَ الْقِيَامَةِ نَاسٌ مِنْ الْمُسْلِمِينَ بِذُنُوبٍ أَمْثَالِ الْجِبَالِ فَيَغْفِرُهَا اللَّهُ لَهُمْ وَيَضَعُهَا عَلَى الْيَهُودِ وَالنَّصَارَى فِيمَا أَحْسِبُ أَنَا قَالَ أَبُو رَوْحٍ لَا أَدْرِي مِمَّنْ الشَّكُّ قَالَ أَبُو بُرْدَةَ فَحَدَّثْتُ بِهِ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ فَقَالَ أَبُوكَ حَدَّثَكَ هَذَا عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُلْتُ نَعَمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14578,
                "hadithNumber": "7015",
                "englishNarrator": "Safwan bin Muhriz reported:",
                "hadithEnglish": "A person said to Ibn 'Umar رضی اللہ عنہ: How did you hear Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying something about intimate conversation? He said: I heard him say: A believer will be brought to his Lord, the Exalted and Glorious, on the Day of Resurrection and He would place upon him His veil (of Light) and make him confess his faults and say: Do you recognise (your faults)? He would say: My Lord, I do recognise (them). He (the Lord) would say: I concealed them for you in the world. And today I forgive them. And he would then be given the Book containing (the account of his) good deeds. And so far as the non-believers and hypocrites are concerned, there would be general announcement about them before all creation telling them that these (people, i.e. non-believers and hypocrites) told a lie about Allah.",
                "hadithUrdu": "ایک شخص نے حضرت ابن عمر رضی اللہ عنہ سے پوچھا : آپ نے نبی صلی اللہ علیہ وسلم سے نجویٰ ( مومن سے اللہ کی سرگوشی ) کے متعلق کس طرح سنا تھا؟ انہوں نے کہا : میں نے آپ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا : \" مومن کو قیامت کے دن اس کے رب عزوجل کے قریب کیا جائے گا ، حتی کہ اللہ تعالیٰ اس پر اپنا پردہ ڈال دے گا ( تاکہ کوئی اور اس کے راز پر مطلع نہ ہو ) ، پھر اس سے اس کے گناہوں کا اقرار کرائے گا اور فرمائے گا : کیا تو ( ان سب گناہوں کو ) پہچانتا ہے؟ وہ کہے گا : میرے رب! میں ( ان سب گناہوں کو ) پہچانتا ہوں ۔ ( اللہ تعالیٰ ) فرمائے گا : میں نے دنیا میں تم پر ( رحم کرتے ہوئے ) ان گناہوں کو چھپا لیا تھا اور آج ( تم پر رحم کرتے ہوئے ) تمہارے لیے ان سب کو معاف کرتا ہوں ، پھر اسے ( محض ) اس کی نیکیوں کا صحیفہ پکڑا دیا جائے گا اور رہے کفار اور منافقین تو ساری مخلوقات کے سامنے بلند آواز سے انہیں کہا جائے گا : یہی ہیں جنہوں نے اللہ پر جھوٹ باندھا ۔ \"",
                "urduNarrator": "ہم سے زہیر بن حرب نے بیان کیا، کہا ہم سے اسماعیل بن ابراہیم نے بیان کیا، وہ ہشام دستوی کی سند سے, قتادہ نے صفوان بن محرز سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ عَنْ هِشَامٍ الدَّسْتَوَائِيِّ عَنْ قَتَادَةَ عَنْ صَفْوَانَ بْنِ مُحْرِزٍ قَالَ قَالَ رَجُلٌ لِابْنِ عُمَرَ كَيْفَ سَمِعْتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي النَّجْوَى قَالَ سَمِعْتُهُ يَقُولُ يُدْنَى الْمُؤْمِنُ يَوْمَ الْقِيَامَةِ مِنْ رَبِّهِ عَزَّ وَجَلَّ حَتَّى يَضَعَ عَلَيْهِ كَنَفَهُ فَيُقَرِّرُهُ بِذُنُوبِهِ فَيَقُولُ هَلْ تَعْرِفُ فَيَقُولُ أَيْ رَبِّ أَعْرِفُ قَالَ فَإِنِّي قَدْ سَتَرْتُهَا عَلَيْكَ فِي الدُّنْيَا وَإِنِّي أَغْفِرُهَا لَكَ الْيَوْمَ فَيُعْطَى صَحِيفَةَ حَسَنَاتِهِ وَأَمَّا الْكُفَّارُ وَالْمُنَافِقُونَ فَيُنَادَى بِهِمْ عَلَى رُءُوسِ الْخَلَائِقِ هَؤُلَاءِ الَّذِينَ كَذَبُوا عَلَى اللَّهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14579,
                "hadithNumber": "7017",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Zuhri with the same chain of transmitters.",
                "hadithUrdu": "مجھ سے محمد بن رافع نے بیان کیا، ہم سے حوزین بن المثنیٰ نے بیان کیا، ہم سے لیث نے بیان کیا, عُقیل بن ابن شہاب سے یونس کی سند کے ساتھ زہری سے بالکل اسی طرح روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "ُ و حَدَّثَنِيهِ مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا حُجَيْنُ بْنُ الْمُثَنَّى حَدَّثَنَا اللَّيْثُ عَنْ عُقَيْلٍ عَنْ ابْنِ شِهَابٍ بِإِسْنَادِ يُونُسَ عَنْ الزُّهْرِيِّ سَوَاءً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14580,
                "hadithNumber": "7018",
                "englishNarrator": "Abdullah bin K'ab رضی اللہ عنہ reported:",
                "hadithEnglish": "Who was his (Ka'b's) guide as he became blind, reported that he heard from Ka'b bin Malik رضی اللہ عنہ the story of his staying behind Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) from the expedition of Tabuk. The rest of the hadith is the same (but with this variation) that in the narration transmitted on the authority of Yunus (the words are): When Allah's Messenger (may. peace be upon him) intended to set on an expedition he kept It as a secret, but. be did not do so in this. expedition. And in the narration transmitted on the authority of Muhammad bin Abdullah bin Muslim, there is no mention of Abu Khaithana and no mention of his meeting with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌).",
                "hadithUrdu": "وہ حضرت کعب رضی اللہ عنہ کے نابینا ہونے کے بعد ان کا ہاتھ پکڑ کر ان کی رہنمائی کرتے تھے ، کہا : میں نے کعب بن مالک رضی اللہ عنہ سے سنا ، وہ اپنی حدیث ( اپنا واقعہ ) بیان کرتے تھے جب وہ غزوہ تبوک میں رسول اللہ صلی اللہ علیہ وسلم سے پیچھے رہ گئے تھے ، پھر انہوں نے ( سابقہ حدیث کی طرح ) حدیث بیان کی اور اس میں یونس کی روایت پر مزید یہ کہا : رسول اللہ صلی اللہ علیہ وسلم کم ہی کسی غزوے کا ارادہ فرماتے تھے مگر عملا اس جنگ کے ہونے تک ، کسی اور ( مہم ) کی جہت ظاہر فرماتے حتی کہ یہ غزوہ ( بھی اسی نہج پر ) ہوا ۔ اور انہوں نے زہری کے بھتیجے کی حدیث میں ابوخیثمہ کا اور ان کے نبی صلی اللہ علیہ وسلم سے جا ملنے کا ذکر نہیں لیا ۔",
                "urduNarrator": "مجھ سے عبد بن حمید نے بیان کیا، کہا کہ مجھ سے یعقوب بن ابراہیم بن سعد نے بیان کیا، کہا ہم سے میرے بھتیجے محمد بن عبداللہ بن مسلمہ نے بیان کیا, زہری کے بھتیجے محمد بن عبداللہ بن مسلم نے ہمیں اپنے چچا محمد بن مسلم زہری سے حدیث بیان کی ، انہوں نے کہا : مجھے عبدالرحمن بن عبداللہ بن کعب بن مالک نے خبر دی کہ عبداللہ بن کعب بن مالک نے ، اور",
                "hadithArabic": "و حَدَّثَنِي عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنِي يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ مُسْلِمٍ ابْنُ أَخِي الزُّهْرِيِّ عَنْ عَمِّهِ مُحَمَّدِ بْنِ مُسْلِمٍ الزُّهْرِيِّ أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ أَنَّ عُبَيْدَ اللَّهِ بْنَ كَعْبِ بْنِ مَالِكٍ وَكَانَ قَائِدَ كَعْبٍ حِينَ عَمِيَ قَالَ سَمِعْتُ كَعْبَ بْنَ مَالِكٍ يُحَدِّثُ حَدِيثَهُ حِينَ تَخَلَّفَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةِ تَبُوكَ وَسَاقَ الْحَدِيثَ وَزَادَ فِيهِ عَلَى يُونُسَ فَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَلَّمَا يُرِيدُ غَزْوَةً إِلَّا وَرَّى بِغَيْرِهَا حَتَّى كَانَتْ تِلْكَ الْغَزْوَةُ وَلَمْ يَذْكُرْ فِي حَدِيثِ ابْنِ أَخِي الزُّهْرِيِّ أَبَا خَيْثَمَةَ وَلُحُوقَهُ بِالنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14581,
                "hadithNumber": "7019",
                "englishNarrator": "'Abdur Rahman bin K'ab bin Malik narrated:",
                "hadithEnglish": "Abdullah bin K'ab رضی اللہ عنہ and he was the guide of Ka'b as he lost his eyesight and he was the greatest scholar amongst his people and he retained in his mind many ahadith of the Companions of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). He said: I heard my father Ka'b bin Malik, and he was one of those three whose repentance was accepted (by Allah). He transmitted that He never lagged behind Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم  ) from any expedition that he undertook except two expeditions; the rest of the hadith is the same, and in the tradition narrated through another chain of transmitters the words are: That Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم) set out on an expedition with a large number of persons more than ten thousand and this could not be recorded in the census register.",
                "hadithUrdu": "جب حضرت کعب رضی اللہ عنہ کی آنکھیں جاتی رہیں تو وہی ان کا ہاتھ پکڑ کر ان کی رہنما کرتے تھے ۔ وہ اپنی قوم میں سب سے بڑے عالم اور رسول اللہ صلی اللہ علیہ وسلم کے صحابہ کی احادیث کے سب سے بڑے حافظ تھے ، انہوں نے کہا : میں نے اپنے والد حضرت کعب بن مالک رضی اللہ عنہ سے سنا ، وہ ان تین لوگوں میں سے ایک تھے جن کی توبہ قبول کی گئی ، وہ حدیث بیان کرتے تھے کہ وہ دو غزووں کو چھوڑ کر کبھی کسی غزوے میں جو رسول اللہ صلی اللہ علیہ وسلم سے لڑا ، آپ سے پیچھے نہیں رہے ۔ انہوں نے ( سابقہ حدیث کی طرح ) حدیث بیان کی اور اس میں کہا : \" رسول اللہ صلی اللہ علیہ وسلم لوگوں کی بہت بڑی تعداد کے ساتھ ، جو دس ہزار سے زیادہ تھے اور کسی محفوظ رکھنے والے کے دیوان ( رجسٹر ) میں ان سب کے نام درج نہ تھے ، اس جنگ کے لیے نکلے ۔",
                "urduNarrator": "مجھ سے سلمہ بن شبیب نے بیان کیا، کہا ہم سے حسن بن عیان نے بیان کیا, معقل بن عبیداللہ نے زہری سے روایت کی ، انہوں نے کہا : مجھے عبدالرحمٰن بن عبداللہ بن کعب بن مالک نے اپنے چچا عبیداللہ بن کعب سے روایت کی اور",
                "hadithArabic": "و حَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ حَدَّثَنَا مَعْقِلٌ وَهُوَ ابْنُ عُبَيْدِ اللَّهِ عَنْ الزُّهْرِيِّ أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ عَنْ عَمِّهِ عُبَيْدِ اللَّهِ بْنِ كَعْبٍ وَكَانَ قَائِدَ كَعْبٍ حِينَ أُصِيبَ بَصَرُهُ وَكَانَ أَعْلَمَ قَوْمِهِ وَأَوْعَاهُمْ لِأَحَادِيثِ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ سَمِعْتُ أَبِي كَعْبَ بْنَ مَالِكٍ وَهُوَ أَحَدُ الثَّلَاثَةِ الَّذِينَ تِيبَ عَلَيْهِمْ يُحَدِّثُ أَنَّهُ لَمْ يَتَخَلَّفْ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةٍ غَزَاهَا قَطُّ غَيْرَ غَزْوَتَيْنِ وَسَاقَ الْحَدِيثَ وَقَالَ فِيهِ وَغَزَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَاسٍ كَثِيرٍ يَزِيدُونَ عَلَى عَشْرَةِ آلَافٍ وَلَا يَجْمَعُهُمْ دِيوَانُ حَافِظٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14582,
                "hadithNumber": "7021",
                "englishNarrator": "This hadith has been narrated on the authority of Zuhri through other chains of transmitters but with a slight variation of wording. In the hadith transmitters on the authority of 'Urwa, there is an addition of these words:",
                "hadithEnglish": "'A'isha رضی اللہ عنہا did not like that Hassan should be rebuked in her presence and she used to say: It was he who wrote this verse also: 'Verily, my father and my mother and my honour, those are all meant for defending the honour of Muhammad against you. And 'Urwa further reported that 'A'isha رضی اللہ عنہا said: By Allah, the person, about whom the allegation was trade used to say: Hallowed be Allah, by One, in Whose hand is my life, I have never unveiled any woman, and then he die, & as a martyr in the cause of Allah, and in the narration transmitted on the authority of Ya'qub bin Ibrahim., the word is Mu'irin and in the narration transmitted on the'authority of 'Abd al-Razzaq it is Mughirin. 'Abd bin Humaid said: I said to 'Abd al-Razzaq: What does this word Mughirin mean? And he said: Al- waghra means intense heat.",
                "hadithUrdu": "حضرت عائشہ رضی اللہ عنہا اس بات کو ناپسند کرتی تھیں کہ حسان ( بن ثابت رضی اللہ عنہ ) کو ان کے سامنے برا بھلا کہا جائے ۔ وہ فرماتی تھیں : انہوں نے یہ ( عظیم شعر ) کہا ہے : \"\" بےشک میرا باپ اور اس کا باپ اور میری عزت ، تم لوگوں سے محمد صلی اللہ علیہ وسلم کی آبرو کی حفاظت کے لیے ڈھال ہیں ۔ \"\" اور انہوں نے مزید بھی کہا : عروہ نے کہا : حضرت عائشہ رضی اللہ عنہا نے فرمایا : اللہ کی قسم! جس شخص کے بارے میں وہ ساری باتیں ، جو گھڑی گئی تھیں ، وہ کہتا تھا : سبحان اللہ! ( یہ کیسی باتیں ہیں ) اس ذات کی قسم جس کے ہاتھ میں میری جان ہے! میں نے کبھی کسی عورت کے حجلہ عروسی 0تک کا ) پردہ بھی نہیں اٹھایا ۔ ( حضرت عائشہ رضی اللہ عنہا نے ) کہا : پھر بعد میں وہ اللہ کی راہ میں قتل ہو کر شہید ہو گیا ۔ اور یعقوب بن ابراہیم کی حدیث میں موغرين في نحر الظهيرة ( لوگ دوپہر کے وقت بے سایہ بنجر راستے میں سفر سے بے حال ہو گئے تھے ۔ ) عبدالرزاق نے موغرين ( گرمی کی شدت سے بے حال ہوئے ) کہا ہے ۔ عبد بن حمید نے کہا : میں نے عبدالرزاق سے پوچھا : \"\" موغرين \"\" کا مطلب کیا ہے؟ کہا : الوغرة گرمی کی شدت ہوتی ہے ۔",
                "urduNarrator": "ابو ربیع عتکی نے مجھے حدیث بیان کی ، انہوں نے کہا : ہمیں فلیح بن سلیمان نے حدیث سنائی ، نیز ہمیں حسن بن علی حلوانی اور عبد بن حمید نے حدیث سنائی ، دونوں نے کہا : ہمیں یعقوب بن ابراہیم بن سعد نے حدیث سنائی ، انہوں نے کہا : ہمیں میرے والد نے صالح بن کیسان سے حدیث سنائی ، ان دونوں ( فلیح بن سلیمان اور صالح بن کیسان ) نے زہری سے یونس اور معمر کی روایت کے مطابق انہی کی سند کے ساتھ ( یہی ) حدیث بیان کی ۔ فلیح کی حدیث میں اسی طرح ہے جیسے معمر نے بیان کیا : انہیں ( قبائلی ) حمیت نے جاہلیت ( کے دور ) میں گھسیٹ لیا ۔ اور صالح کی حدیث میں یونس کے قول کی طرح ہے : انہیں ( قبائلی ) حمیت نے اکسا دیا ۔ اور صالح کی حدیث میں مزید یہ ہے : عروہ نے کہا",
                "hadithArabic": "و حَدَّثَنِي أَبُو الرَّبِيعِ الْعَتَكِيُّ حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ ح و حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ وَعَبْدُ بْنُ حُمَيْدٍ قَالَا حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنَا أَبِي عَنْ صَالِحِ بْنِ كَيْسَانَ كِلَاهُمَا عَنْ الزُّهْرِيِّ بِمِثْلِ حَدِيثِ يُونُسَ وَمَعْمَرٍ بِإِسْنَادِهِمَا وَفِي حَدِيثِ فُلَيْحٍ اجْتَهَلَتْهُ الْحَمِيَّةُ كَمَا قَالَ مَعْمَرٌ وَفِي حَدِيثِ صَالِحٍ احْتَمَلَتْهُ الْحَمِيَّةُ كَقَوْلِ يُونُسَ وَزَادَ فِي حَدِيثِ صَالِحٍ قَالَ عُرْوَةُ كَانَتْ عَائِشَةُ تَكْرَهُ أَنْ يُسَبَّ عِنْدَهَا حَسَّانُ وَتَقُولُ فَإِنَّهُ قَالَ فَإِنَّ أَبِي وَوَالِدَهُ وَعِرْضِي لِعِرْضِ مُحَمَّدٍ مِنْكُمْ وِقَاءُ وَزَادَ أَيْضًا قَالَ عُرْوَةُ قَالَتْ عَائِشَةُ وَاللَّهِ إِنَّ الرَّجُلَ الَّذِي قِيلَ لَهُ مَا قِيلَ لَيَقُولُ سُبْحَانَ اللَّهِ فَوَالَّذِي نَفْسِي بِيَدِهِ مَا كَشَفْتُ عَنْ كَنَفِ أُنْثَى قَطُّ قَالَتْ ثُمَّ قُتِلَ بَعْدَ ذَلِكَ شَهِيدًا فِي سَبِيلِ اللَّهِ وَفِي حَدِيثِ يَعْقُوبَ بْنِ إِبْرَاهِيمَ مُوعِرِينَ فِي نَحْرِ الظَّهِيرَةِ و قَالَ عَبْدُ الرَّزَّاقِ مُوغِرِينَ قَالَ عَبْدُ بْنُ حُمَيْدٍ قُلْتُ لِعَبْدِ الرَّزَّاقِ مَا قَوْلُهُ مُوغِرِينَ قَالَ الْوَغْرَةُ شِدَّةُ الْحَرِّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14583,
                "hadithNumber": "7022",
                "englishNarrator": "A'Isha رضی اللہ عنہا reported:",
                "hadithEnglish": "When I came under discussion what the people had to say about me, Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) stood up for delivering an address and he recited tashahhud (I bear witness to the fact that there is no god but Allah) and praised Allah, lauded Him what He rightly deserves and then said: Coming to the point. Give me an advice about them who have brought false charge about my family. By Allah, I know no evil in the members of my family and the person in connection with whom the false charge is being levelled, I know no evil in him too. And he never entered my house but in my presence and when I was away on a journey, he remained with me even in that. The rest of the hadith is the same but with this change that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) came to my house and asked my maidservant and she said: By Allah, I know no fault in her but this that she sleeps, and goat comes and eats the kneaded flour. Some of the Companions (of the Holy Prophet) scolded her and said: State the fact before Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and they even made a pointed reference (to this incident). She said: gallowed be Allah. By Allah, I know about her as does the jeweller know about the pure piece of gold. And when this news reached the person in connection with whom the allegation was made he said: Hallowed be Allah. By Allah, I have never unveiled any woman. 'A'isha رضی اللہ عنہا said: He fell as a martyr in the cause of Allah, and there is this addition in this hadith that the people who had brought false allegation amongst them were Mistah and Hamna and Hassan رضی اللہ عنہم . And so far as the hypocrite 'Abdullah bin Ubayy is concerned, he was one who tried his best to gather the false news and then gave them the wind. And he was in fact a fabricator and there was Hamna رضی اللہ عنہا, daughter of Jahsh with him.",
                "hadithUrdu": "جب میرے معاملے میں وہ باتیں کہی گئیں جو کہی گئیں اور مجھے اس معاملے کا علم نہ تھا ، ( اس وقت ) رسول اللہ صلی اللہ علیہ وسلم خطبہ دینے کے لیے کھڑے ہوئے ۔ شہادتین پڑھیں ، اللہ کی حمد و ثنا کی جو اس کے شایان شان ہے ، پھر فرمایا : \"\" اس ( حمد و ثنا ) کے بعد! مجھے ان لوگوں کے بارے میں مشورہ دو جنہوں نے میری اہلیہ پر بہتان لگایا اور میں اللہ کی قسم کھاتا ہوں کہ میری اہلیہ کے خلاف کبھی کوئی برائی میرے علم میں نہیں آئی ۔ وہ ( صفوان بن معطل رضی اللہ عنہ ) جس کے بارے میں انہوں نے تہمت لگائی ہے ، اللہ کی قسم! مجھے اس کے بارے میں کسی برائی کا علم نہیں ، وہ کبھی میرے گھر نہیں آیا مگر اس وقت جب میں موجود تھا اور میں کبھی سفر کی وجہ سے ( مدینہ سے ) غیر حاضر نہیں رہا مگر وہ بھی ( اس سفر میں ) میرے ساتھ ( مدینہ س ) غیر حاضر تھا ۔ \"\" اور پورے واقعے سمیت حدیث بیان کی اور اس میں یہ ( بھی ) ہے : رسول اللہ صلی اللہ علیہ وسلم میرے گھر میں داخل ہوئے اور میری خادمہ سے پوچھا ۔ اس نے کہا : اللہ کی قسم! میں ان میں کوئی ایک عیب بھی نہیں جانتی ، اس کے سوا کہ وہ سو جایا کرتی تھیں اور بکری اندر آتی اور ان کا آٹا یا کہا : ان کا خمیر ( جو آٹے میں ملایا جاتا ہے ) کھا جاتی ۔ ہشام کو شک ہوا ہے ۔ ۔ تو آپ صلی اللہ علیہ وسلم کے ایک ساتھی نے جھڑکیاں دیں اور کہا : رسول اللہ صلی اللہ علیہ وسلم کو بالکل سچ بتاؤ ، حتی کہ اس معاملے میں ان لوگوں نے اسے تحقیر آمیز باتیں کہیں تو اس نے جواب میں کہا : سبحان اللہ! اللہ کی قسم! میں ان کے بارے میں بالکل اسی طرح جانتی ہوں جس طرح سنار خالص سونے کو جانتا ہے ۔ ( ان میں ذرہ برابر کھوٹ نہیں ، وہ خالص سونا ہیں ۔ ) اور یہ معاملہ اس شخص تک پہنچا جس کے بارے میں یہ بات کہی گئی تو اس نے کہا : سبحان اللہ! اللہ کی قسم! میں نے آج تک کسی عورت کی خلوت گاہ کا پردہ بھی نہیں اٹھایا ۔ حضرت عائشہ رضی اللہ عنہا نے فرمایا : وہ اللہ عزوجل کی راہ میں قتل ہو کر شہید ہو گیا ۔ اور اس حدیث میں مزید یہ بات بھی ہے کہ جن لوگوں نے ( بہتان پر مبنی ) باتیں کی تھیں ان میں مسطح ، حمنہ اور حسان ( بن ثابت ) رضی اللہ عنہم تھے ۔ اور منافق عبداللہ بن ابی وہ شخص تھا جو ( سیدھے سادھے واقعے کے اندر سے ) جھوٹے الزام نکالتا تھا اور ( بہتان کی جھوٹی کہانی کی صورت میں ) انہیں یکجا کرتا تھا ۔ اسی نے اس بہتان تراشی میں سب سے بڑا کردار سنبھالا اور ( اس کے بعد ) حمنہ رضی اللہ عنہا تھی ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور محمد بن علاء نے بیان کیا، انہوں نے کہا: ابو اسامہ نے ہشام بن عروہ سے روایت کی ، انہوں نے اپنے والد سے اور انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ الْعَلَاءِ قَالَا حَدَّثَنَا أَبُو أُسَامَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ لَمَّا ذُكِرَ مِنْ شَأْنِي الَّذِي ذُكِرَ وَمَا عَلِمْتُ بِهِ قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطِيبًا فَتَشَهَّدَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ أَمَّا بَعْدُ أَشِيرُوا عَلَيَّ فِي أُنَاسٍ أَبَنُوا أَهْلِي وَايْمُ اللَّهِ مَا عَلِمْتُ عَلَى أَهْلِي مِنْ سُوءٍ قَطُّ وَأَبَنُوهُمْ بِمَنْ وَاللَّهِ مَا عَلِمْتُ عَلَيْهِ مِنْ سُوءٍ قَطُّ وَلَا دَخَلَ بَيْتِي قَطُّ إِلَّا وَأَنَا حَاضِرٌ وَلَا غِبْتُ فِي سَفَرٍ إِلَّا غَابَ مَعِي وَسَاقَ الْحَدِيثَ بِقِصَّتِهِ وَفِيهِ وَلَقَدْ دَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْتِي فَسَأَلَ جَارِيَتِي فَقَالَتْ وَاللَّهِ مَا عَلِمْتُ عَلَيْهَا عَيْبًا إِلَّا أَنَّهَا كَانَتْ تَرْقُدُ حَتَّى تَدْخُلَ الشَّاةُ فَتَأْكُلَ عَجِينَهَا أَوْ قَالَتْ خَمِيرَهَا شَكَّ هِشَامٌ فَانْتَهَرَهَا بَعْضُ أَصْحَابِهِ فَقَالَ اصْدُقِي رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى أَسْقَطُوا لَهَا بِهِ فَقَالَتْ سُبْحَانَ اللَّهِ وَاللَّهِ مَا عَلِمْتُ عَلَيْهَا إِلَّا مَا يَعْلَمُ الصَّائِغُ عَلَى تِبْرِ الذَّهَبِ الْأَحْمَرِ وَقَدْ بَلَغَ الْأَمْرُ ذَلِكَ الرَّجُلَ الَّذِي قِيلَ لَهُ فَقَالَ سُبْحَانَ اللَّهِ وَاللَّهِ مَا كَشَفْتُ عَنْ كَنَفِ أُنْثَى قَطُّ قَالَتْ عَائِشَةُ وَقُتِلَ شَهِيدًا فِي سَبِيلِ اللَّهِ وَفِيهِ أَيْضًا مِنْ الزِّيَادَةِ وَكَانَ الَّذِينَ تَكَلَّمُوا بِهِ مِسْطَحٌ وَحَمْنَةُ وَحَسَّانُ وَأَمَّا الْمُنَافِقُ عَبْدُ اللَّهِ بْنُ أُبَيٍّ فَهُوَ الَّذِي كَانَ يَسْتَوْشِيهِ وَيَجْمَعُهُ وَهُوَ الَّذِي تَوَلَّى كِبْرَهُ وَحَمْنَةُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14584,
                "hadithNumber": "7023",
                "englishNarrator": "Anas رضی اللہ عنہ reported:",
                "hadithEnglish": "A person was charged with fornication with the slave girl of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said to 'Ali رضی اللہ عنہ: Go and strike his neck. 'Ali رضی اللہ عنہ came to him and he found him in a well making his body cool. 'Ali said to him: Come out, and as he took hold of his hand and brought him out, he found that his sexual organ had been cut. Hadrat 'Ali رضی اللہ عنہ refrained from striking his neck. He came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and said: Allah's Messenger, he has not even the sexual organ with him.",
                "hadithUrdu": "ایک شخص کو رسول اللہ صلی اللہ علیہ وسلم کی ام ولد ( آپ کے فرزند کی والدہ ) کے ساتھ مہتم کیا جاتا تھا تو رسول اللہ صلی اللہ علیہ وسلم نے حضرت علی رضی اللہ عنہ سے کہا : جاؤ اور اس کی گردن اڑا دو ، حضرت علی رضی اللہ عنہ اس کے پاس گئے تو وہ ایک اتھلے ( کم گہرے ) کنویں میں ٹھنڈک کے لیے غسل کر رہا تھا ، حضرت علی رضی اللہ عنہ نے اس سے کہا : نکلو ، اور ( سہارا دینے کے لیے ) اسے اپنا ہاتھ پکڑایا اور اسے باہر نکالا تو دیکھا کہ وہ ہیجڑا ہے ، اس کا عضو مخصوص تھا ہی نہیں ۔ اس پر حضرت علی رضی اللہ عنہ ( اس کو قتل کرنے سے ) رُک گئے اور نبی صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کی : اللہ کے رسول! وہ تو ہیجڑا ہے ، اس کا عضو مخصوص ہے ہی نہیں ۔",
                "urduNarrator": "ہم سے زہیر بن حرب نے بیان کیا، کہا ہم سے عفان نے بیان کیا، ہم سے حماد بن سلمہ نے بیان کیا، ہم سے ثابت نے بیان کیا, حضرت انس رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ أَخْبَرَنَا ثَابِتٌ عَنْ أَنَسٍ أَنَّ رَجُلًا كَانَ يُتَّهَمُ بِأُمِّ وَلَدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِعَلِيٍّ اذْهَبْ فَاضْرِبْ عُنُقَهُ فَأَتَاهُ عَلِيٌّ فَإِذَا هُوَ فِي رَكِيٍّ يَتَبَرَّدُ فِيهَا فَقَالَ لَهُ عَلِيٌّ اخْرُجْ فَنَاوَلَهُ يَدَهُ فَأَخْرَجَهُ فَإِذَا هُوَ مَجْبُوبٌ لَيْسَ لَهُ ذَكَرٌ فَكَفَّ عَلِيٌّ عَنْهُ ثُمَّ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّهُ لَمَجْبُوبٌ مَا لَهُ ذَكَرٌ.",
                "headingArabic": "بَرَاءَةِ حَرَمِ النَّبِيِّ صلى الله عليه وسلم مِنَ الرِّيبَةِ",
                "headingUrdu": "نبی کی لونڈی کی بریت",
                "headingEnglish": "Exoneration Of The Prophet's Concubine",
                "chapterId": "50",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 150,
                    "chapterNumber": "50",
                    "chapterEnglish": "The Book of Repentance",
                    "chapterUrdu": "توبہ کا بیان",
                    "chapterArabic": "كتاب التَّوْبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14585,
                "hadithNumber": "7024",
                "englishNarrator": "Zaid bin Arqam رضی اللہ عنہ reported:",
                "hadithEnglish": "We set out on a journey along with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) in which we faced many hardships. 'Abdullah bin Ubayy said to his friends: Do not give what you have in your possession to those who are with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) until they desert him. Zubair said: That is the reciting of that person who recited as min haulahu (from around him) and the other reciting is man haulahia (who are around him). And in this case when we would return to Medina the honourable would drive out the meaner therefrom (lxiv. 8). I came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and informed him about that and he sent someone to 'Abdullah bin Ubayy and he asked him whether he had said that or not. He took an oath to the fact that he had not done that and told that it was Zaid رضی اللہ عنہ who had stated a lie to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). Zaid رضی اللہ عنہ said: I was much perturbed because of this until this verse was revealed attesting my truth: When the hypocrites come (lxiii. 1). Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) then called them in order to seek forgiveness for them, but they turned away their heads as if they were hooks of wood fixed in the wall (lxiii. 4), and they were in fact apparently good-looking persons.",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک سفر میں نکلے ، اس میں لوگوں کو بہت تکلیف پہنچی تو عبداللہ بن ابی نے اپنے ساتھیوں سے کہا : جو لوگ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ہیں ، جب تک آپ صلی اللہ علیہ وسلم سے الگ نہ ہو جائیں ، ان پر کچھ خرچ نہ کرو ( مہاجرین سے تعاون بند کر دو ۔ ) زہیر نے کہا : اور یہ اس کی قراءت ہے جس نے حوله کو زیر کے ساتھ من حوله پڑھا ۔ اور اس نے ( یہ بھی ) کہا : اگر ہم مدینہ کو لوٹ گئے تو جو عزت والے ہیں وہ وہاں سے ذلت والوں کو نکال دیں گے ۔ ( زید بن ارقم رضی اللہ عنہ نے ) کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کے پاس حاضر ہوا اور آپ کو یہ بات بتا دی ، آپ نے عبداللہ بن اُبی کو بلوایا اور اس سے ( اس بات کے متعلق ) پوچھا ، اس نے بہت پکی قسم کھائی کہ اس نے ایسا نہیں کہا اور کہا : زید نے رسول اللہ صلی اللہ علیہ وسلم سے جھوٹ بولا ہے ۔ ( حضرت زید رضی اللہ عنہ نے ) کہا : میرے دل کو ان لوگوں کی اس بات سے بہت تکلیف پہنچی ، حتی کہ اللہ تعالیٰ نے میری تصدیق میں یہ آیت نازل کی : \"\" جب آپ کے پاس منافقین آتے ہیں \"\" پھر نبی صلی اللہ علیہ وسلم نے ان کے استغفار کے لیے ان کو بلوایا تو انہوں نے ( تمسخر سے ) اپنے سر ٹیڑھے کر لیے ۔ \"\" اور ( اس آیت میں ) اللہ تعالیٰ کے قول : \"\" گویا وہ سہارے سے کھڑے ہوئے شہتیر ہیں \"\" ( سے مراد ) حضرت زید رضی اللہ عنہ نے کہا : ( یہ ہے کہ ) یہ لوگ ( جسمانی اعتبار سے سیدھے ، لمبے اور دیکھنے میں ) بہت خوبصورت تھے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے حسن بن موسیٰ نے بیان کیا,  ہمیں زہیر بن معاویہ نے حدیث بیان کی ، انہوں نے کہا : ہمیں ابواسحٰق نے حدیث بیان کی ، انہوں نے حضرت زید بن ارقم رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى حَدَّثَنَا زُهَيْرُ بْنُ مُعَاوِيَةَ حَدَّثَنَا أَبُو إِسْحَقَ أَنَّهُ سَمِعَ زَيْدَ بْنَ أَرْقَمَ يَقُولُ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ أَصَابَ النَّاسَ فِيهِ شِدَّةٌ فَقَالَ عَبْدُ اللَّهِ بْنُ أُبَيٍّ لِأَصْحَابِهِ لَا تُنْفِقُوا عَلَى مَنْ عِنْدَ رَسُولِ اللَّهِ حَتَّى يَنْفَضُّوا مِنْ حَوْلِهِ قَالَ زُهَيْرٌ وَهِيَ قِرَاءَةُ مَنْ خَفَضَ حَوْلَهُ وَقَالَ لَئِنْ رَجَعْنَا إِلَى الْمَدِينَةِ لَيُخْرِجَنَّ الْأَعَزُّ مِنْهَا الْأَذَلَّ قَالَ فَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرْتُهُ بِذَلِكَ فَأَرْسَلَ إِلَى عَبْدِ اللَّهِ بْنِ أُبَيٍّ فَسَأَلَهُ فَاجْتَهَدَ يَمِينَهُ مَا فَعَلَ فَقَالَ كَذَبَ زَيْدٌ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَوَقَعَ فِي نَفْسِي مِمَّا قَالُوهُ شِدَّةٌ حَتَّى أَنْزَلَ اللَّهُ تَصْدِيقِي إِذَا جَاءَكَ الْمُنَافِقُونَ قَالَ ثُمَّ دَعَاهُمْ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِيَسْتَغْفِرَ لَهُمْ قَالَ فَلَوَّوْا رُءُوسَهُمْ و قَوْله كَأَنَّهُمْ خُشُبٌ مُسَنَّدَةٌ وَقَالَ كَانُوا رِجَالًا أَجْمَلَ شَيْءٍ.",
                "headingArabic": "صفات المنافقين وأحكامهم",
                "headingUrdu": "منافقین کی صفات اور ان کے بارے میں حکم",
                "headingEnglish": "The attributes of the Hypocrites and the ruling concerning them",
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14586,
                "hadithNumber": "7025",
                "englishNarrator": "Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came to the grave of 'Abdullah bin Ubayy, brought him out from that, placed him on his knee and put his saliva in his mouth and shrouded him in his own shirt and Allah knows best.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم عبداللہ بن ابی کی قبر پر تشریف لائے ، اس کو قبر سے نکال کر اپنے گھٹنوں پر رکھا ، اس پر اپنا لعاب مبارک چھڑکا اور اسے اپنی قمیص پہنچائی ، ( ایسا کیوں کیا؟ ) اللہ زیادہ جاننے والا ہے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، زہیر بن حرب اور احمد بن عبدہ الذہبی نے بیان کیا اور یہ قول ابن ابی شیبہ سے ہے۔ ابن عبدہ نے کہا: ہم سے اس نے بیان کیا اور باقی دو نے کہا کہ اس نے ہم سے بیان کیا, سفیان بن عیینہ نے عمرو ( بن دینار ) سے روایت کی ، انہوں نے حضرت جابر رضی اللہ عنہ کو یہ بیان کرتے ہوئے سنا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ وَأَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ وَاللَّفْظُ لِابْنِ أَبِي شَيْبَةَ قَالَ ابْنُ عَبْدَةَ أَخْبَرَنَا و قَالَ الْآخَرَانِ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرٍو أَنَّهُ سَمِعَ جَابِرًا يَقُولُ أَتَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَبْرَ عَبْدِ اللَّهِ بْنِ أُبَيٍّ فَأَخْرَجَهُ مِنْ قَبْرِهِ فَوَضَعَهُ عَلَى رُكْبَتَيْهِ وَنَفَثَ عَلَيْهِ مِنْ رِيقِهِ وَأَلْبَسَهُ قَمِيصَهُ فَاللَّهُ أَعْلَمُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14587,
                "hadithNumber": "7026",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came to the grave of 'Abdullah bin Ubayy as he was placed in that. The rest of the hadith is the same.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم عبداللہ بن ابی کے پاس اس کو اس کے گڑھے میں داخل کر دیے جانے کے بعد آئے ، پھر سفیان کی حدیث کے مانند بیان کیا ۔",
                "urduNarrator": "مجھ سے احمد بن یوسف الازدی نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا, ابن جریج نے کہا , مجھے عمرو بن دینار نے خبر دی ، کہا : میں نے حضرت جابر بن عبداللہ رضی اللہ عنہ کو بیان کرتے ہوئے سنا",
                "hadithArabic": "حَدَّثَنِي أَحْمَدُ بْنُ يُوسُفَ الْأَزْدِيُّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ جَاءَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى عَبْدِ اللَّهِ بْنِ أُبَيٍّ بَعْدَ مَا أُدْخِلَ حُفْرَتَهُ فَذَكَرَ بِمِثْلِ حَدِيثِ سُفْيَانَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14588,
                "hadithNumber": "7027",
                "englishNarrator": "Ibn 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "When 'Abdullah bin Ubayy bin Salul died. His son 'Abdullah bin 'Abdullah (bin Ubayy) رضی اللہ عنہ came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and begged him that he should give him his shirt which he would use as a coffin for his father, he gave him that. He then begged that he should conduct funeral prayer for him. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had hardly got up to observe the prayer for him that 'Umar رضی اللہ عنہ stood up and caught hold of the garment of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: Allah's Messenger, are you going to conduct prayer for this man, whereas Allah has forbidden you to offer prayer for him? Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Allah has given me an option as He has said: You may beg pardon for them or you may not beg pardon for them, and even if you beg pardon for them, seventy times (ix. 80), and I am going to make an addition to the seventy. He was a hypocrite and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) offered prayer for him and Allah, the Exalted and Glorious, revealed this verse: Do not offer prayer for any one of them at all and do not stand upon their graves for (offering prayer over them) (ix. 84).",
                "hadithUrdu": "جب عبداللہ بن ابی ابن سلول مر گیا تو اس کے بیٹے عبداللہ بن عبداللہ رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے ، اور آپ سے سوال کیا کہ آپ اپنی قمیص اس کو عطا فرمائیں ، جس میں وہ اپنے باپ کو کفن دیں تو آپ نے ( وہ قمیص ) ان کو عطا کی ، پھر آپ صلی اللہ علیہ وسلم سے درخواست کی کہ آپ اس کی نماز جنازہ پڑھیں ، چنانچہ رسول اللہ صلی اللہ علیہ وسلم اس پر نماز جنازہ پڑھنے کے لیے کھڑے ہوئے تو حضرت عمر رضی اللہ عنہ کھڑے ہو گئے اور ( التجا کرنے کے لیے ) رسول اللہ صلی اللہ علیہ وسلم کے کپڑے ( کے ایک کنارے ) کو پکڑ لیا اور کہا : اللہ کے رسول! کیا آپ اس کی نماز جنازہ پڑھائیں گے ، حالانکہ اللہ تعالیٰ نے آپ کو اس کی نماز جنازہ پڑھنے سے منع فرمایا ہے تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ تعالیٰ نے مجھے اختیار دیا ہے ، اس نے فرمایا ہے : \" آپ ان کے لیے استغفار کریں یا استغفار نہ کریں ، خواہ آپ ان کے لیے ستر مرتبہ استغفار کریں \" اور میں ستر مرتبہ سے زیادہ استغفار کروں گا ۔ \" ( عمر رضی اللہ عنہ نے ) کہا : یقینا وہ منافق ہے ، ( مگر ) رسول اللہ صلی اللہ علیہ وسلم نے اس کی نماز جنازہ پڑھا دی ، اس پر اللہ عزوجل نے ( واضح حکم ) نازل فرمایا : \" اور ان ( منافقین ) میں سے جو شخص مر جائے آپ کبھی اس کی نماز جنازہ نہ پڑھیں اور نہ اس کی قبر پر کھڑے ہوں ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, ابواسامہ نے کہا , ہمیں عبیداللہ بن عمر نے نافع سے حدیث بیان کی ، انہوں نے حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ لَمَّا تُوُفِّيَ عَبْدُ اللَّهِ بْنُ أُبَيٍّ ابْنُ سَلُولَ جَاءَ ابْنُهُ عَبْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَهُ أَنْ يُعْطِيَهُ قَمِيصَهُ يُكَفِّنُ فِيهِ أَبَاهُ فَأَعْطَاهُ ثُمَّ سَأَلَهُ أَنْ يُصَلِّيَ عَلَيْهِ فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِيُصَلِّيَ عَلَيْهِ فَقَامَ عُمَرُ فَأَخَذَ بِثَوْبِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ أَتُصَلِّي عَلَيْهِ وَقَدْ نَهَاكَ اللَّهُ أَنْ تُصَلِّيَ عَلَيْهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا خَيَّرَنِي اللَّهُ فَقَالَ اسْتَغْفِرْ لَهُمْ أَوْ لَا تَسْتَغْفِرْ لَهُمْ إِنْ تَسْتَغْفِرْ لَهُمْ سَبْعِينَ مَرَّةً وَسَأَزِيدُهُ عَلَى سَبْعِينَ قَالَ إِنَّهُ مُنَافِقٌ فَصَلَّى عَلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ وَلَا تُصَلِّ عَلَى أَحَدٍ مِنْهُمْ مَاتَ أَبَدًا وَلَا تَقُمْ عَلَى قَبْرِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 14276,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=571",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=569",
                "label": "569",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=570",
                "label": "570",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=571",
                "label": "571",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=572",
                "label": "572",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=573",
                "label": "573",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=574",
                "label": "574",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=575",
                "label": "575",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=573",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=573",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=571",
        "to": 14300,
        "total": 40465
    }
}