{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 325,
        "data": [
            {
                "id": 8389,
                "hadithNumber": "825",
                "englishNarrator": "Hudhaifa ‌رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) happened to meet him and he was (sexually) defiled, and he slipped away and took a bath and then came and said: I was (sexually) defiled. Upon this he (the Holy Prophet) remarked: A Muslim is never defiled.",
                "hadithUrdu": "رسول اللہﷺ انہیں ملے جبکہ وہ جنبی تھے تو وہ آپﷺ سے دور ہٹ گئے اور غسل کیا ، پھر آ کر عرض کی کہ میں جنبی تھا ۔ آپﷺ نے فرمایا : ’’مسلمان ناپاک نہیں ہوتا ۔ ‘ ‘",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، کہا: ہم سے وکیع نے مسعر کی سند سے، واصل کی سند سے، ابو وائل سے,حضرت حذیفہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، قَالَا: حَدَّثَنَا وَكِيعٌ، عَنْ مِسْعَرٍ، عَنْ وَاصِلٍ، عَنْ أَبِي وَائِلٍ، عَنْ حُذَيْفَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لَقِيَهُ وَهُوَ جُنُبٌ، فَحَادَ عَنْهُ فَاغْتَسَلَ. ثُمَّ جَاءَ فَقَالَ: كُنْتُ جُنُبًا. قَالَ: «إِنَّ الْمُسْلِمَ لَا يَنْجُسُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8390,
                "hadithNumber": "826",
                "englishNarrator": "A'isha said:",
                "hadithEnglish": "The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) used to remember Allah at all moments.",
                "hadithUrdu": "رسول اللہﷺ اپنے تمام اوقات میں اللہ تعالیٰ کا ذکر کرتے تھے",
                "urduNarrator": "ہم سے ابو کریب محمد بن العلاء اور ابراہیم بن موسیٰ نے بیان کیا، کہا: ہم سے ابن ابی زیدہ نے اپنے والد سے، خالد بن سلمہ سے، الباح کی سند سے، انہوں نے کہا: عروہ کا اختیار، حضرت عائشہؓ سے روایت ہے ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ، وَإِبْرَاهِيمُ بْنُ مُوسَى، قَالَا: حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ، عَنْ أَبِيهِ، عَنْ خَالِدِ بْنِ سَلَمَةَ، عَنِ الْبَهِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ: «كَانَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَذْكُرُ اللهَ عَلَى كُلِّ أَحْيَانِهِ».",
                "headingArabic": "ذِكْرِ اللَّهِ تَعَالَى فِي حَالِ الْجَنَابَةِ وَغَيْرِهَا ‏",
                "headingUrdu": "اللہ تعالیٰ کو یاد کرنا، جب کوئی جنسی طور پر ناپاک ہو، اور دوسرے اوقات میں",
                "headingEnglish": "Remembering Allah, the Most High, when one is sexually impure, and at other times",
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8391,
                "hadithNumber": "827",
                "englishNarrator": "Ibn 'Abbas reported:",
                "hadithEnglish": "The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came out of the privy, and he was presented with some food, and the people reminded him about ablution, but he said: Am I to say prayer that I should perform ablution?",
                "hadithUrdu": "نبی اکرمﷺ ( ہاتھ دھو کر ) بیت الخلا سے نکلے تو آپ کے سامنے کھانا پیش کیا گیا ، لوگوں نے آپ سے وضو کا تذکرہ کیا تو آپ نے فرمایا : ’’ ( کیا ) میں نماز پڑھنا چاہتا ہوں کہ وضو کروں؟ ‘ ‘",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ التمیمی اور ابو الربیع الزہرانی نے بیان کیا , یحییٰ نے کہا,حماد نے عمرو بن سے ، انہوں نے سعید بن حویرث سے ، انہوں نے حضرت ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَأَبُو الرَّبِيعِ الزَّهْرَانِيُّ، - قَالَ يَحْيَى، أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ، وَقَالَ أَبُو الرَّبِيعِ - حَدَّثَنَا حَمَّادٌ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ سَعِيدِ بْنِ الْحُوَيْرِثِ، عَنِ ابْنِ عَبَّاسٍ: «أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ خَرَجَ مِنَ الْخَلَاءِ، فَأُتِيَ بِطَعَامٍ»، فَذَكَرُوا لَهُ الْوُضُوءَ فَقَالَ: «أُرِيدُ أَنْ أُصَلِّيَ فَأَتَوَضَّأَ؟»",
                "headingArabic": "جَوَازِ أَكْلِ الْمُحْدِثِ الطَّعَامَ وَأَنَّهُ لاَ كَرَاهَةَ فِي ذَلِكَ وَأَنَّ الْوُضُوءَ لَيْسَ عَلَى الْفَوْرِ",
                "headingUrdu": "جس نے وضو توڑ دیا ہو اس کے لیے کھانا جائز ہے اور اس میں کوئی چیز ناپسندیدہ نہیں ہے اور فوراً وضو کرنے کی ضرورت نہیں ہے۔",
                "headingEnglish": "It is permissible for one who has broken his wudu’ to eat, and there is nothing disliked about doing so, and wudu’ need not be done immediately",
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8392,
                "hadithNumber": "828",
                "englishNarrator": "Ibn 'Abbas رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "We were with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and he had come out of the privy. Food was presented to him. It was said to him (by the Companions around him): Wouldn't you perform ablution? Upon this he said: Why, am I to say prayer that I should perform ablution?",
                "hadithUrdu": "ہم نبی اکرمﷺ کے پاس تھے کہ آپ قضائے حاجت کی جگہ سے ( ہاتھ دھو کر ) آئے تو آپ کے سامنے کھانا پیش کیا گیا ، آپ سے عرض کی گئی : کیا آپ وضو نہیں فرمائیں گے؟ آپ نے جواب دیا : کس لیے؟ کیا مجھے نماز پڑھنی ہے کہ وضو کروں؟ ‘ ‘",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، انہوں نے کہا,سفیان بن عیینہ نے عمرو سے باقی ماندہ سابقہ سند سے حضرت ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہتے تھے کہ",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، عَنْ سَعِيدِ بْنِ الْحُوَيْرِثِ، سَمِعْتُ ابْنَ عَبَّاسٍ، يَقُولُ: «كُنَّا عِنْدَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَجَاءَ مِنَ الْغَائِطِ، وَأُتِيَ بِطَعَامٍ» فَقِيلَ لَهُ: أَلَا تَوَضَّأُ؟ فَقَالَ: «لِمَ؟ أَأُصَلِّي فَأَتَوَضَّأَ؟",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8393,
                "hadithNumber": "829",
                "englishNarrator": "Ibn 'Abbas ‌رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) went to the privy and when he came back, he was presented with food. It was said to him; Messenger of Allah, wouldn't you perform ablution. He said: Why, am I to say prayer?",
                "hadithUrdu": "اللہ کے رسولﷺ قضائے حاجت کے لیے تشریف لے گئے ، جب آپ آئے تو آپ کو کھانا پیش کیا گیا ، آپ سے عرض کی گئی : اے اللہ کے رسول! کیا آپ وضو نہیں فرمائیں گئے؟ آپ نے جواب دیا : ’’کس لیے؟ کیا نماز کے لیے؟ ‘ ‘",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے بیان کیا,محمد بن مسلم طائفی نے عمرو بن دینار سے ، انہوں نے آل سائب کے آزاد کردہ غلام سعید بن حویرث سے روایت کی کہ اس نے عبد اللہ بن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو ( یہ ) کہتے ہوئے سنا",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا مُحَمَّدُ بْنُ مُسْلِمٍ الطَّائِفِيُّ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ سَعِيدِ بْنِ الْحُوَيْرِثِ، مَوْلَى آلِ السَّائِبِ، أَنَّهُ سَمِعَ عَبْدَ اللهِ بْنَ عَبَّاسٍ، قَالَ: «ذَهَبَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِلَى الْغَائِطِ، فَلَمَّا جَاءَ قُدِّمَ لَهُ طَعَامٌ»، فَقِيلَ: يَا رَسُولَ اللهِ أَلَا تَوَضَّأُ؟ قَالَ: «لِمَ؟ أَلِلصَّلَاةِ؟»",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8394,
                "hadithNumber": "830",
                "englishNarrator": "Ibn Abbas, reported:",
                "hadithEnglish": "The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came out of the privy after relieving himself, and food was brought to him and he took it, and did not touch water. In another narration transmitted by Sa'id b. al-Huwairith it is like this: It was said to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) You have not performed ablution. He said: I do not intend to say prayer that I should perform ablution.",
                "hadithUrdu": "اللہ کے رسولﷺ قضائے حاجت کے لیے تشریف لے گئے ، جب آپ آئے تو آپ کو کھانا پیش کیا گیا ،اور آپ صلی اللہ علیہ وسلم نے بغیر پانی کے کھایا، آپ صلی اللہ علیہ وسلم نے فرمایا: عمرو بن دینار رضی اللہ عنہ نے صاع رضی اللہ عنہ کی سند سے مجھ سے اضافہ کیا۔\" عد بن حویریت رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم سے پوچھا گیا:  اے اللہ کے رسول! کیا آپ وضو نہیں فرمائیں گئے؟ آپ نے جواب دیا : ’’کس لیے؟ کیا نماز کے لیے؟ ‘ ‘ کہ عمرو نے دعوی کیا کہ اس نے سعید بن حویرث سے سنا ہے۔",
                "urduNarrator": "مجھ سے محمد بن عمرو بن عباد بن جبلہ نے بیان کیا، کہا ہم سے ابوعاصم نے بیان کیا، انہوں نے ابن جریج سے، انہوں نے کہا: ہم سے سعید بن حویرِث نے بیان کیا، انہوں نے ابن بدر کو سنا، وہ کہتے ہیں: رسول اللہ صلی اللہ علیہ وسلم اسے سکون عطا فرما، بیت الخلاء میں آرام کیا، تو اس کے پاس کھانا لایا گیا اور اس نے پانی کو چھوئے بغیر کھایا",
                "hadithArabic": "وَحَدَّثَنِي مُحَمَّدُ بْنُ عَمْرِو بْنِ عَبَّادِ بْنِ جَبَلَةَ، حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، قَالَ: حَدَّثَنَا سَعِيدُ بْنُ حُوَيْرِثٍ، أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ، يَقُولُ: «إِنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَضَى حَاجَتَهُ مِنَ الْخَلَاءِ، فَقُرِّبَ إِلَيْهِ طَعَامٌ فَأَكَلَ وَلَمْ يَمَسَّ مَاءً»، قَالَ: وَزَادَنِي عَمْرُو بْنُ دِينَارٍ، عَنْ سَعِيدِ بْنِ الْحُوَيْرِثِ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قِيلَ لَهُ: إِنَّكَ لَمْ تَوَضَّأْ؟ قَالَ: «مَا أَرَدْتُ صَلَاةً فَأَتَوَضَّأَ» وَزَعَمَ عَمْرٌو، أَنَّهُ سَمِعَ مِنْ سَعِيدِ بْنِ الْحُوَيْرِثِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8395,
                "hadithNumber": "831",
                "englishNarrator": "Anas رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) entered the privy, and in the hadith transmitted by Hushaim (the words are): When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) entered the lavatory, be used to say: O Allah, I seek refuge in Thee from wicked and noxious things.",
                "hadithUrdu": "رسول اللہﷺ جب بیت الخلاء میں داخل ہوتے اور ہشیم کے الفاظ ہیں : جب کسی اوٹ والی جگہ میں داخل ہوتے ) تو فرماتے : ’’اے اللہ! میں نر اور مادہ دونوں قسم کی خبیث مخلوق سے تیری پناہ میں آتا ہوں ۔ ‘ ‘",
                "urduNarrator": "یحییٰ بن یحییٰ نے حماد بن زید اور ہشیم سے ، ان دونوں نے عبد العزیز بن صہیب سے ، انہوں نے حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ( حماد کی حدیث میں ہے",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ، وَقَالَ يَحْيَى: أَيْضًا أَخْبَرَنَا هُشَيْمٌ، كِلَاهُمَا عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسٍ، - فِي حَدِيثِ حَمَّادٍ كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِذَا دَخَلَ الْخَلَاءَ وَفِي حَدِيثِ هُشَيْمٍ، - أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا دَخَلَ الْكَنِيفَ قَالَ: «اللهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبْثِ وَالْخَبَائِثِ».",
                "headingArabic": "مَا يَقُولُ إِذَا أَرَادَ دُخُولَ الْخَلاَءِ ‏",
                "headingUrdu": "اس علاقے میں داخل ہوتے وقت کیا کہا جائے جس میں کوئی رفع حاجت کرے۔",
                "headingEnglish": "What should be said when entering the area in which one relieves himself",
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8396,
                "hadithNumber": "832",
                "englishNarrator": "This hadith is also transmitted by 'Abdul-'Aziz with the same chain of transmitters, and the words are:",
                "hadithEnglish": "I seek refuge with Allah from the wicked and noxious things.",
                "hadithUrdu": "أعوذ بالله من الخبث والخبائث ’’میں نر اور مادہ دونوں قسم کی خبیث مخلوق سے اللہ کی پناہ میں آتا ہوں ۔ ‘ ‘",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور زہیر بن حرب نے بیان کیا,اسماعیل بن علیہ نے اسی مذکورہ بالا سند کے ساتھ عبد العزیز سے روایت بیان کی اور ( دعا کے ) یہ الفاظ بیان کیے",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالَا: حَدَّثَنَا إِسْمَاعِيلُ وَهُوَ ابْنُ عُلَيَّةَ، عَنْ عَبْدِ الْعَزِيزِ بِهَذَا الْإِسْنَادِ وَقَالَ: «أَعُوذُ بِاللهِ مِنَ الْخُبْثِ وَالْخَبَائِثِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8397,
                "hadithNumber": "833",
                "englishNarrator": "Anas ‌رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "(The people) stood up for prayer and the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was whispering to a man, and in the narration of 'Abdul-Warith (the words are): The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was having a private conversation with a man, and did not start the prayer till the people dozed off.",
                "hadithUrdu": "نماز کے لیے تکبیر کہہ دی گئی اور رسول اللہﷺ ایک آدمی سے بہت قریب ہو کر آہستہ آہستہ بات کر رہے تھے ۔ ( عبد الوارث کی روایت میں ورسول الله ﷺ نجي لرجل کے بجائے ونبی اللہ ﷺ یناجی الرجل آپ ایک آدمی سے آہستہ آہستہ باتیں کر رہے تھے ہے ۔ مفہوم ایک ہے ) تو آپ نماز کے لیے کھڑے نہیں ہوئے یہاں تک کہ لوگ ( بیٹھےبیٹھے ) سو گئے ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب نے کہا,اسماعیل بن علیہ اور عبد الوارث دونوں نے عبد العزیز سے ، انہوں نے حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ ح، وَحَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا عَبْدُ الْوَارِثِ كِلَاهُمَا عَنْ عَبْدِ الْعَزِيزِ، عَنْ أَنَسٍ، قَالَ: أُقِيمَتِ الصَّلَاةُ وَرَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَجِيٌّ لِرَجُلٍ - وَفِي حَدِيثِ عَبْدِ الْوَارِثِ: وَنَبِيُّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُنَاجِي الرَّجُلَ - فَمَا قَامَ إِلَى الصَّلَاةِ حَتَّى نَامَ الْقَوْمُ.",
                "headingArabic": "الدَّلِيلِ عَلَى أَنَّ نَوْمَ الْجَالِسِ لاَ يَنْقُضُ الْوُضُوءَ ‏",
                "headingUrdu": "اس بات کی دلیل ہے کہ بیٹھ کر سونے سے وضو نہیں ٹوٹتا",
                "headingEnglish": "Evidence that sleeping while sitting does not invalidate wudu’",
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8398,
                "hadithNumber": "834",
                "englishNarrator": "Anas bin Malik ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "(The people) stood up for prayer and the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was talking in whispers with a man, and he did not discontinue the conversation till his Companions dozed off; he then came and led the prayer.",
                "hadithUrdu": "نماز کے لیے تکبیر کہہ دی گئی جبکہ رسول اللہﷺ ایک آدمی سے شرگوشی فرما رہے تھے ۔ آپ اس سے سرگوشی فرماتے رہے یہاں تک کہ آپ کے ساتھی ( بیٹھے بیٹھے ) سو گئے ، اس کےبعد آپ آئے اور انہیں نماز پڑھائی ۔",
                "urduNarrator": "ہم سے عبید اللہ بن معاذ العنبری نے بیان کیا، ہم سے میرے والد نے بیان کیا,شعبہ نے عبد العزیز بن صہیب سے حدیث بیان کی کہ انہوں نے حضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو کہتے ہوئے سنا",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، سَمِعَ أَنَسَ بْنَ مَالِكٍ قَالَ: «أُقِيمَتِ الصَّلَاةُ وَالنَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُنَاجِي رَجُلًا فَلَمْ يَزَلْ يُنَاجِيهِ حَتَّى نَامَ أَصْحَابُهُ ثُمَّ جَاءَ فَصَلَّى بِهِمْ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8399,
                "hadithNumber": "835",
                "englishNarrator": "Qatida reported:",
                "hadithEnglish": "I heard Anas رضی ‌اللہ ‌عنہ ‌as saying that the Companion of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) dozed off and then offered prayer and did not perform ablution. He (the narrator) said: I asked him if he had actually heard it from Anas. He said: By Allah. yes.",
                "hadithUrdu": "میں نے سیدنا انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنا ، کہہ رہے تھے کہ رسول اللہﷺ کے صحابہ ( بیٹھے بیٹھے ) سو جاتے تھے ، پھر وضو کیے بغیر نماز پڑھ لیتے ۔ ( شعبہ کہتے ہیں : ) میں نے ( قتادہ سے ) پوچھا : آپ نے یہ حدیث انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنی ہے؟ انہوں نے کہا : ہاں! اللہ کی قسم!",
                "urduNarrator": "مجھ سے یحییٰ بن حبیب الحارث نے بیان کیا، ہم سے خالد نے جو ابن حارث ہیں، بیان کیا,شعبہ نے قتادہ سے روایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنِي يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، حَدَّثَنَا خَالِدٌ وَهُوَ ابْنُ الْحَارِثِ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، قَالَ: سَمِعْتُ أَنَسًا، يَقُولُ: «كَانَ أَصْحَابُ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَنَامُونَ ثُمَّ يُصَلُّونَ وَلَا يَتَوَضَّئُونَ» قَالَ: قُلْتُ: سَمِعْتَهُ مِنْ أَنَسٍ قَالَ: إِي وَاللهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8400,
                "hadithNumber": "836",
                "englishNarrator": "Anas رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "(The people) stood up for the night prayer when a man spoke forth: I need to say something. The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) entered into secret conversation with him, till the people dozed off or some of the people (dozed off), and then they said the prayer.",
                "hadithUrdu": "عشاء کی نماز کے لیے اقامت کہہ دی گئی تو ایک آدمی نے ( رسول اللہ سے ) کہا : میرا ایک کام ہے ، چنانچہ آپﷺ کھڑے ہو کر اس سے سرگوشی کرنے لگے حتیٰ کہ لوگ یا کچھ لوگ ( بیٹھے بیٹھے ) سو گئے ، پھر سب نے نماز پڑھی ۔",
                "urduNarrator": "مجھ سے احمد بن سعید بن صخر الدارمی نے بیان کیا، کہا ہم سے حبان نے بیان کیا، ہم سے حماد نے بیان کیا,ثابت نے حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ انہوں نے کہا",
                "hadithArabic": "حَدَّثَنِي أَحْمَدُ بْنُ سَعِيدِ بْنِ صَخْرٍ الدَّارِمِيُّ، حَدَّثَنَا حَبَّانُ، حَدَّثَنَا حَمَّادٌ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، أَنَّهُ قَالَ: أُقِيمَتْ صَلَاةُ الْعِشَاءِ فَقَالَ رَجُلٌ: لِي حَاجَةٌ فَقَامَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُنَاجِيهِ حَتَّى نَامَ الْقَوْمُ - أَوْ بَعْضُ الْقَوْمِ - ثُمَّ صَلَّوْا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 103,
                    "chapterNumber": "3",
                    "chapterEnglish": "The Book of Menstruation",
                    "chapterUrdu": "حیض کا معنی و مفہوم",
                    "chapterArabic": "كتاب الْحَيْضِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8401,
                "hadithNumber": "837",
                "englishNarrator": "Ibn Umar رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "When the Muslims came to Medina, they gathered and sought to know the time of prayer but no one summoned them. One day they discussed the matter, and some of them said: Use something like the bell of the Christians and some of them said: Use horn like that of the Jews. Umar ‌رضی ‌اللہ ‌عنہ ‌said: Why may not a be appointed who should call (people) to prayer? The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: O Bilal, get up and summon (the people) to prayer.",
                "hadithUrdu": "جب مسلمان مدینہ آئے تو وہ اکٹھے ہو جاتے اور نمازوں کے اوقات کا انتظار کرتے ، کوئی اس کا اعلان نہیں کرتا تھا ۔ ایک دن انہوں نے اس کے بارے میں گفتگو کی تو بعض نے کہا : عیسائیوں کے گھنٹے کے مانند ایک گھنٹا لے لو اور بعض نے کہا : یہود کے قرنا جیسا قرنا ، البتہ حضرت عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : تم ایک آدمی ہی کیوں نہیں بھیج دیتے جو نماز کا اعلان کرے؟ رسول اللہﷺ نے فرمایا : احضرت عبد اللہ بن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ انہوں نے کہا : اے بلال! اٹھو اور نماز کا اعلان کرو ۔ ‘ ‘",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم  الْحَنظلي، نے بیان کیا، کہا ہم سے محمد بن بکر،  اور ہم سے محمد بن رافع نے بیان کیا، کہا کہ ہم سے عبدالرزاق نے بیان کیا، انہوں نے کہا: مجھ سے ابن جریج، ہارون بن عبداللہ نے بیان کیا اور تلفظ ان کا ہے۔ انہوں نے کہا: ہم سے حجاج بن محمد نے بیان کیا، انہوں نے کہا: ابن جریج نے کہا: انہوں نے مجھے نافع ابن عمر رضی اللہ عنہما کے موکل نے خبر دی,حضرت عبد اللہ بن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَا: أَخْبَرَنَا ابْنُ جُرَيْجٍ، ح وَحَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللهِ - وَاللَّفْظُ لَهُ - قَالَ: حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ: قَالَ ابْنُ جُرَيْجٍ: أَخْبَرَنِي نَافِعٌ، مَوْلَى ابْنِ عُمَرَ، عَنْ عَبْدِ اللهِ بْنِ عُمَرَ أَنَّهُ قَالَ: كَانَ الْمُسْلِمُونَ حِينَ قَدِمُوا الْمَدِينَةَ يَجْتَمِعُونَ فَيَتَحَيَّنُونَ الصَّلَوَاتِ، وَلَيْسَ يُنَادِي بِهَا أَحَدٌ، فَتَكَلَّمُوا يَوْمًا فِي ذَلِكَ فَقَالَ بَعْضُهُمْ: اتَّخِذُوا نَاقُوسًا مِثْلَ نَاقُوسِ النَّصَارَى، وَقَالَ بَعْضُهُمْ: قَرْنًا مِثْلَ قَرْنِ الْيَهُودِ، فَقَالَ عُمَرُ أَوَلَا تَبْعَثُونَ رَجُلًا يُنَادِي بِالصَّلَاةِ؟ قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «يَا بِلَالُ قُمْ فَنَادِ بِالصَّلَاةِ».",
                "headingArabic": "بَدْءِ الأَذَانِ",
                "headingUrdu": "اذان کا آغاز",
                "headingEnglish": "The Beginning Of The Adhan",
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8402,
                "hadithNumber": "838",
                "englishNarrator": "Anas رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "Bilal رضی ‌اللہ ‌عنہ ‌was commanded (by the Messenger of Allah) to repeat (the phrases of) Adhan twice and once in Iqama. The narrator said: I made a mention of it before Ayyub who said: Except for saying: Qamat-is-Salat [the time for prayer has come].",
                "hadithUrdu": "بلال ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو حکم دیا گیا کہ وہ اذان دہرائیں اور اقامت اکہری کہیں ۔ یحییٰ نے ابن علیہ سے ( بیان کردہ ) اپنی روایت میں یہ اضافہ کیا : میں ( اسماعیل ) نے یہ روایت ایوب کو سنائی تو انہوں نے کہا : ( اذان دہرائیں ) اقامت کے سوا.",
                "urduNarrator": "خلف بن ہشام نے کہا : ہمیں حماد بن زید نے حدیث سنائی ، نیز یحییٰ بن یحییٰ نے کہا : ہمیں اسماعیل بن علیہ نے خبر دی ، ان دونوں ( حماد اور یحییٰ ) نے خالد حذاء سے ، انہوں نے ابو قلابہ سے اور انہوں نے حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا خَلَفُ بْنُ هِشَامٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، ح وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، جَمِيعًا عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ أَبِي قِلَابَةَ، عَنْ أَنَسٍ، قَالَ: «أُمِرَ بِلَالٌ أَنْ يَشْفَعَ الْأَذَانَ وَيُوتِرَ الْإِقَامَةَ» زَادَ يَحْيَى، فِي حَدِيثِهِ عَنِ ابْنِ عُلَيَّةَ، فَحَدَّثْتُ بِهِ أَيُّوبَ فَقَالَ: إِلَّا الْإِقَامَةَ.",
                "headingArabic": "الأَمْرِ بِشَفْعِ الأَذَانِ وَإِيتَارِ الإِقَامَةِ",
                "headingUrdu": "اذان کے جملے دو بار اور اقامت کے جملے ایک بار کہنے کا حکم، سوائے اس جملے کے کہ \"نماز شروع ہونے والی ہے\" جو دو بار کہی جائے۔",
                "headingEnglish": "The Command to say the phrases of the Adhan twice and the phrases of the iqamah once, except the phrase, \"Prayer is about to begin,\" which is to be said twice",
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8403,
                "hadithNumber": "839",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "They (the Companions) discussed that they should know the timings of prayer by means of something recognized by all. Some of them said that fire should be lighted or a bell should be rung. But Bilal was ordered to repeat the phrases twice in Adhan, and once in Iqama.",
                "hadithUrdu": "انہوں نے ( صحابہ ) نے ( اس پر ) بات کی کہ کسی ایسی چیز کے ذریعے سے نماز کے وقت کی علامت مقرر کریں جس کو لوگ پہچان لیا کریں ۔ انہوں نے کہا کہ وہ آگ روشن کریں یا ناقوس ( گھنٹی ) بجائیں ، پھر ( آخر کار ) بلال ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو حکم دیا گیا کہ وہ دہری اذان اور اکہری اقامت کہیں ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم الحنثلی نے بیان کیا، کہا ہم سے عبد الوہاب ثقفی نے بیان کیا، کہا ہم سے خالد الحضاۃ نے بیان کیا، وہ ابوقلابہ سے، وہ انس بن مالک رضی اللہ عنہ سے، انہوں نے کہا",
                "hadithArabic": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، حَدَّثَنَا خَالِدٌ الْحَذَّاءُ، عَنْ أَبِي قِلَابَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ: ذَكَرُوا أَنْ يُعْلِمُوا وَقْتَ الصَّلَاةِ بِشَيْءٍ يَعْرِفُونَهُ فَذَكَرُوا أَنْ يُنَوِّرُوا نَارًا، أَوْ يَضْرِبُوا نَاقُوسًا «فَأُمِرَ بِلَالٌ أَنْ يَشْفَعَ الْأَذَانَ وَيُوتِرَ الْإِقَامَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8404,
                "hadithNumber": "840",
                "englishNarrator": "This hadith is transmitted by Khalid Hadhdha with the same chain of transmitters (and the words are):",
                "hadithEnglish": "When the majority of the people discussed they should know, like the hadith narrated by al-Thaqafi (mentioned above) except for the words: They (the people) should kindle fire.",
                "hadithUrdu": "وہ علامت مقرر کریں .... آگے ( عبد الوہاب ) ثقفی کی حدیث کے مانند ہے ، فرق صرف اس قدر ہے کہ اس ( وہیب ) نے ( ينوروا نارا ’’آگ روشن کریں ‘ ‘ کی جگہ ) يوروا نارا ’’آگ جلائیں ‘ ‘ کہا ۔",
                "urduNarrator": "ہم سے محمد بن حاتم نے بیان کیا، ہم سے بہز نے بیان کیا، ہم سے وہیب نے بیان کیا، ہم سے خالد الحضیٰ نے بیان کیا، اس سلسلہ سند کے ساتھ، چونکہ بہت سے لوگوں نے ذکر کیا ہے کہ",
                "hadithArabic": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا خَالِدٌ الْحَذَّاءُ، بِهَذَا الْإِسْنَادِ لَمَّا كَثُرَ النَّاسُ ذَكَرُوا أَنْ يُعْلِمُوا بِمِثْلِ حَدِيثِ الثَّقَفِيِّ، غَيْرَ أَنَّهُ قَالَ: أَنْ يُورُوا نَارًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8405,
                "hadithNumber": "841",
                "englishNarrator": "Anas رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "Bilal رضی ‌اللہ ‌عنہ was commanded (by the Holy Prophet) to repeat the phrases twice in Adhan, and once in lqama.",
                "hadithUrdu": "بلال ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو حکم دیا گیا کہ دہری اذان اور اکہری قامت کہیں ۔",
                "urduNarrator": "مجھ سے عبید اللہ بن عمر القواری نے بیان کیا، ہم سے عبد الوارث بن سعید اور عبد الوہاب بن عبد المجید نے بیان کیا، کہا, ایوب نے ابو قلابہ سے اور انہوں نے حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وَحَدَّثَنِي عُبَيْدُ اللهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ، وَعَبْدُ الْوَهَّابِ بْنُ عَبْدِ الْمَجِيدِ، قَالَا: حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي قِلَابَةَ، عَنْ أَنَسٍ، قَالَ: «أُمِرَ بِلَالٌ أَنْ يَشْفَعَ الْأَذَانَ وَيُوتِرَ الْإِقَامَةَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8406,
                "hadithNumber": "842",
                "englishNarrator": "Abu Mahdhura رضی ‌اللہ ‌عنہ ‌said:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) taught him Adhan like this: Allah is the Greatest, Allah is the Greatest; I testify that there is no god but Allah, I testify that there is no god but Allah; I testify that Muhammad Is the Messenger of Allah, I testify that Muhammad is the Messenger of Allah, and it should be again repeated: I testify that there is no god but Allah, I testify that there is no god but Allah; I testify that Muhammad Is the Messenger of Allah, I testify that Muhammad is the Messenger of Allah. Come to the prayer (twice). Come to success (twice). Ishaq added: Allah is the Greatest, Allah is the Greatest; there Is no god but Allah.",
                "hadithUrdu": "اللہ کے نبیﷺ نے انہیں یہ اذان سکھائی : الله أكبر الله أكبر ، أشهد أن لا إله إلا الله ، أشهد أن لا إله إلا الله ، أشهد أن محمدا رسول الله ، أشهد أن محمدا رسول الله ، پھر دو بار کہے : أشهد أن لا إله إلا الله ، پھر دو بار ، أشهد أن محمدا رسول الله ، دو بار حی على الصلوٰة دو بار حي على الفلاح دوبار ۔ اسحاق نے یہ اضافہ کیا : الله أكبر الله أكبر ، لا إله إلا الله",
                "urduNarrator": "ابو غسان مسمعی اور اسحاق بن ابراہیم نے مجھے حدیث بیان کی ، ( کہا : ) ابو غسان نے کہا : ہمیں معاذ نے حدیث سنائی اور اسحاق نے کہا : ہمیں دستوائی ( کپڑے ) والے ہشام کے بیٹے معاذ نے خبر دی ، انہوں ( معاذ ) نے کہا : مجھے میرے والد نے عامر احول سے حدیث سنائی ، انہوں نے حضرت ابو محذورہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي أَبُو غَسَّانَ الْمِسْمَعِيُّ مَالِكُ بْنُ عَبْدِ الْوَاحِدِ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَبُو غَسَّانَ: حَدَّثَنَا مُعَاذٌ، وَقَالَ إِسْحَاقُ: أَخْبَرَنَا مُعَاذُ بْنُ هِشَامٍ، صَاحِبِ الدَّسْتُوَائِيِّ، وَحَدَّثَنِي أَبِي، عَنْ عَامِرٍ الْأَحْوَلِ، عَنْ مَكْحُولٍ، عَنْ عَبْدِ اللهِ بْنِ مُحَيْرِيزٍ، عَنْ أَبِي مَحْذُورَةَ، أَنَّ نَبِيَّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَّمَهُ هَذَا الْأَذَانَ: «اللهُ أَكْبَرُ اللهُ أَكْبَرُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللهُ، أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللهِ، أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللهِ»، ثُمَّ يَعُودُ فَيَقُولُ: «أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللهُ، أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللهِ، أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللهِ، حَيَّ عَلَى الصَّلَاةِ مَرَّتَيْنِ، حَيَّ عَلَى الْفَلَاحِ مَرَّتَيْنِ» زَادَ إِسْحَاقُ: «اللهُ أَكْبَرُ اللهُ أَكْبَرُ لَا إِلَهَ إِلَّا اللهُ»",
                "headingArabic": "صِفَةِ الأَذَانِ",
                "headingUrdu": "اذان کی تفصیل",
                "headingEnglish": "Description Of The Adhan",
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8407,
                "hadithNumber": "843",
                "englishNarrator": "Ibn Umar ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had two Mu'adhdhins, Bilal and 'Abdullah bin Umm Maktum, who (latter) was blind.",
                "hadithUrdu": "رسول اللہﷺ کے دو مؤذن تھے ، بلال اور نابینا ابن ام مکتومؓ ۔",
                "urduNarrator": "ہم سے ابن نمیر نے بیان کیا، کہا ہم سے میرے والد نے بیان کیا، کہا کہ ہم سے عبید اللہ نے بیان کیا، نافع سے,حضرت ابن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ: «كَانَ لِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مُؤَذِّنَانِ بِلَالٌ، وَابْنُ أُمِّ مَكْتُومٍ الْأَعْمَى».",
                "headingArabic": "اسْتِحْبَابِ اتِّخَاذِ مُؤَذِّنَيْنِ لِلْمَسْجِدِ الْوَاحِدِ ‏‏",
                "headingUrdu": "ایک ہی مسجد میں دو مؤذن رکھنا مستحب ہے۔",
                "headingEnglish": "It Is Recommended To Have Two Mu'adhdhin In A Single Masjid",
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8408,
                "hadithNumber": "844",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of 'A'isha by another chain of transmitters.",
                "hadithUrdu": "ہم سے ابن نمیر نے بیان کیا، ہم سے ابی نے بیان کیا، ہم سے عبید اللہ نے بیان کیا، ہم سے القاسم نے بیان کیا، عائشہ رضی اللہ عنہا سے اسی طرح۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللهِ، حَدَّثَنَا الْقَاسِمُ، عَنْ عَائِشَةَ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8409,
                "hadithNumber": "845",
                "englishNarrator": "A'isha reported:",
                "hadithEnglish": "Ibn Umm Maktum used to pronounce Adhan at the behest of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) (despite the fact) that he was blind.",
                "hadithUrdu": "ابن ام مکتوم رسول اللہﷺ کے لیے اذان دیا کرتے تھے ، حالانکہ وہ نابینا تھے ۔",
                "urduNarrator": "محمد بن جعفر نے کہا : ہمیں ہشام نے اپنے والد سے حدیث بیان کی ، انہوں نے حضرت عائشہؓ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنِي أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ الْهَمْدَانِيُّ، حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ مَخْلَدٍ، عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ قَالَتْ: «كَانَ ابْنُ أُمِّ مَكْتُومٍ يُؤَذِّنُ لِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَهُوَ أَعْمَى».",
                "headingArabic": "جَوَازِ أَذَانِ الأَعْمَى إِذَا كَانَ مَعَهُ بَصِيرٌ ‏",
                "headingUrdu": "نابینا آدمی کے لیے اذان اس وقت تک جائز ہے جب تک کہ اس کے ساتھ دیکھنے والا آدمی ہو۔",
                "headingEnglish": "It Is Permissible For A Blind Man To Call The Adhan So long As There Is A Man With Him Who Sees",
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8410,
                "hadithNumber": "846",
                "englishNarrator": null,
                "hadithEnglish": "A similar report  was narrated from Hisham with this chain.",
                "hadithUrdu": "ہم سے محمد بن سلمہ مرادی نے بیان کیا، کہا ہم سے عبداللہ بن وہب نے بیان کیا,یحییٰ بن عبد اللہ اور سعید بن عبد الرحمن نے ہشام سے اسی سند کے ساتھ اس ( مذکورہ بالا روایت ) کے مانند حدیث بیان کی.",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِيُّ، حَدَّثَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، عَنْ يَحْيَى بْنِ عَبْدِ اللهِ، وَسَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ هِشَامٍ، بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8411,
                "hadithNumber": "847",
                "englishNarrator": "Anas bin Malik ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) used to attack the enemy when it was dawn. He would listen to the Adhan; so if he heard an Adhan, he stopped, otherwise made an attack. Once on hearing a man say: Allah is the Greatest, Allah is the Greatest, the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) remarked: He is following al-Fitra (al-Islam). Then hearing him say: I testify that there is no god but Allah. there is no god but Allah, the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) said: You have come out of the Fire (of Hell). They looked at him and found that he was a goat herd.",
                "hadithUrdu": "رسول اللہﷺ ( دشمن پر ) طلوع فجر کے وقت حملہ کرتے تھے اور اذان کی آواز پر کان لگائے رکھتے تھے ، پھر اگر اذان سن لیتے تو رک جاتے ورنہ حملہ کر دیتے ، ( ایسا ہوا کہ ) آپ نے ایک آدمی کو کہتے ہوئے سنا : الله أكبر الله أكبر تو رسول اللہﷺ نے فرمایا : ’’فطرت ( اسلام ) پر ہے ۔ ‘ ‘ پھر اس نے کہا : أشهد أن لا إله إلا الله ، أشهد أن لا إله إلا الله تو رسول اللہﷺ نے فرمایا : ’’تو آگ سے نکل گیا ۔ ‘ ‘ اس پر صحابہ کرام ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے دیکھا تو وہ بکریوں کا چرواہا تھا ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، ہم سے یحییٰ نے بیان کیا، یعنی ابن سعید نے حماد بن سلمہ سے، ہم سے ثابت نے بیان کیا،انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے ، انہوں نے کہا",
                "hadithArabic": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى يَعْنِي ابْنَ سَعِيدٍ، عَنْ حَمَّادِ بْنِ سَلَمَةَ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ: كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُغِيرُ إِذَا طَلَعَ الْفَجْرُ، وَكَانَ يَسْتَمِعُ الْأَذَانَ، فَإِنْ سَمِعَ أَذَانًا أَمْسَكَ وَإِلَّا أَغَارَ فَسَمِعَ رَجُلًا يَقُولُ: اللهُ أَكْبَرُ اللهُ أَكْبَرُ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «عَلَى الْفِطْرَةِ» ثُمَّ قَالَ: أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللهُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللهُ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «خَرَجْتَ مِنَ النَّارِ» فَنَظَرُوا فَإِذَا هُوَ رَاعِي مِعْزًى.",
                "headingArabic": "الإِمْسَاكِ عَنِ الإِغَارَةِ، عَلَى قَوْمٍ فِي دَارِ الْكُفْرِ إِذَا سُمِعَ فِيهِمُ الأَذَانُ ‏",
                "headingUrdu": "دار الکفر (غیر مسلم سرزمینوں) میں لوگوں پر حملہ کرنے سے باز رہنا اگر ان میں سے اذان سنی جائے",
                "headingEnglish": "Refraining From Attacking People In Dar Al-Kufr (Non-Muslim Lands) If The Adhan Is Heard Among Them",
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8412,
                "hadithNumber": "848",
                "englishNarrator": "Abu Sa'id al-Khudri ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "When you hear the call (to prayer), repeat what the Mu'adhdhin pronounces.",
                "hadithUrdu": "رسول اللہﷺ نے فرمایا : ’’جب تم اذان سنو تو جو مؤذن کہتا ہے اسی کی طرح کہو ۔ ‘ ‘",
                "urduNarrator": "مجھ سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا, میں نے مالک کو ابن شہاب کی سند سے اور عطاء بن یزید لیثی کی سند سے پڑھا,حضرت ابو سعید خدری ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنِي يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا سَمِعْتُمُ النِّدَاءَ، فَقُولُوا مِثْلَ مَا يَقُولُ الْمُؤَذِّنُ».",
                "headingArabic": "اسْتِحْبَابِ الْقَوْلِ مِثْلَ قَوْلِ الْمُؤَذِّنِ لِمَنْ سَمِعَهُ ثُمَّ يُصَلِّي عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ يَسْأَلُ اللَّهَ لَهُ الْوَسِيلَةَ",
                "headingUrdu": "مؤذن کے سننے والے کے لیے مستحب ہے کہ وہ اپنے کلمات کو دہرائے، پھر رسول اللہ صلی اللہ علیہ وسلم پر درود بھیجے اور اللہ سے وسیلہ کی دعا کرے۔",
                "headingEnglish": "It Is Recommended For The One Who Hears The Mu'adhdhin To Repeat His Words, Then To Send Salat Upon The Prophet (saws) And Ask Allah To Grant Him Al-Wasilah",
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8413,
                "hadithNumber": "849",
                "englishNarrator": "Abdullah bin Amr bin al-As reported Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying:",
                "hadithEnglish": "When you hear the Mu'adhdhin, repeat what he says, then invoke a blessing on me, for everyone who invokes a blessing on me will receive ten blessings from Allah; then beg from Allah al-Wasila for me, which is a rank in Paradise fitting for only one of Allah's servants, and I hope that I may be that one. If anyone who asks that I be given the Wasila, he will be assured of my intercession.",
                "hadithUrdu": "’’جب تم مؤذن کو سنو تو اسی طرح کہو جیسے وہ کہتا ہے ، پھر مجھ پر درود بھیجو کیونکہ جو مجھ پر ایک دفعہ درود بھیجتا ہے ، اللہ تعالیٰ اس کے بدلے میں اس پر دس رحمتیں نازل فرماتا ہے ، پھر اللہ تعالیٰ سے میرے لیے وسیلہ مانگو کیونکہ وہ جنت میں ایک مقام ہے جو اللہ کے بندوں میں سے صرف ایک بندے کو ملے گا اور مجھے امید ہے وہ میں ہوں گا ، چنانچہ جس نے میرے لیے وسیلہ طلب کیا اس کے لیے ( میری ) شفاعت واجب ہو گئی ۔ ‘ ‘",
                "urduNarrator": "ہم سے محمد بن سلمہ المرادی نے بیان کیا، کہا ہم سے عبداللہ بن وہب نے بیان کیا، وہ حیوا کی سند سے، سعید بن ابی ایوب نے اور دیگر نے، وہ کعب بن علقمہ کی سند سے،انہوں نے عبدالرحمٰن بن جبیر سے, حضرت عبد اللہ بن عمرو بن عاص ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ انہوں نے نبیﷺ کو سنا ، آپ فرما رہے تھے",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِيُّ، حَدَّثَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، عَنْ حَيْوَةَ، وَسَعِيدِ بْنِ أَبِي أَيُّوبَ، وَغَيْرِهِمَا عَنْ كَعْبِ بْنِ عَلْقَمَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرٍ، عَنْ عَبْدِ اللهِ بْنِ عَمْرِو بْنِ الْعَاصِ، أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِذَا سَمِعْتُمُ الْمُؤَذِّنَ، فَقُولُوا مِثْلَ مَا يَقُولُ ثُمَّ صَلُّوا عَلَيَّ، فَإِنَّهُ مَنْ صَلَّى عَلَيَّ صَلَاةً صَلَّى الله عَلَيْهِ بِهَا عَشْرًا، ثُمَّ سَلُوا اللهَ لِيَ الْوَسِيلَةَ، فَإِنَّهَا مَنْزِلَةٌ فِي الْجَنَّةِ، لَا تَنْبَغِي إِلَّا لِعَبْدٍ مِنْ عِبَادِ اللهِ، وَأَرْجُو أَنْ أَكُونَ أَنَا هُوَ، فَمَنْ سَأَلَ لِي الْوَسِيلَةَ حَلَّتْ لَهُ الشَّفَاعَةُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 8101,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=324",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=322",
                "label": "322",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=323",
                "label": "323",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=324",
                "label": "324",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=325",
                "label": "325",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=326",
                "label": "326",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=327",
                "label": "327",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=328",
                "label": "328",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=326",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=326",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=324",
        "to": 8125,
        "total": 40465
    }
}