{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 329,
        "data": [
            {
                "id": 8489,
                "hadithNumber": "925",
                "englishNarrator": "Anas bin Malik ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) fell down from his horse and his right side was grazed, and the rest of the hadith is the same. In this hadith there are no additions (of words) as transmitted by Yunus and Malik.",
                "hadithUrdu": "نبیﷺ گھوڑے سے گر پڑے جس سے آپ کا دایاں پہلو چھل گیا ... آگے سابقہ حدیث کے مانند حدیث بیان کی ، اس میں یونس اور مالک والا اضافہ نہیں ہے ۔",
                "urduNarrator": "ہم سے عبد بن حمید نے بیان کیا، کہا ہم کو عبدالرزاق نے خبر دی،معمر نے زہری سے روایت کی ، انہوں نے کہا : مجھے حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے خبر دی کہ",
                "hadithArabic": "دَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي أَنَسٌ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ سَقَطَ مِنْ فَرَسِهِ فَجُحِشَ شِقُّهُ الْأَيْمَنُ، وَسَاقَ الْحَدِيثَ وَلَيْسَ فِيهِ زِيَادَةُ يُونُسَ، وَمَالِكٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8490,
                "hadithNumber": "926",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) fell ill and some of his Companions came to inquire after his health. The Messenger of Allah (may peace he upon him) said prayer sitting, while (his Companions) said it (behind him) standing. He (the Holy Prophet) directed them by his gesture to sit down, and they sat down (in prayer). After finishing the (prayer) lie (the Holy Prophet) said: The Imam is appointed so that be should be followed, so bow down when lie bows down, and rise rip when he rises up and say (prayer) sitting when he (the Imam) says (it) sitting.",
                "hadithUrdu": "رسول اللہﷺ بیمار ہو گئے ، آپ کے صحابہ میں سے کچھ لوگ آپ کے پاس آپ کی بیمار پرسی کے لیے حاضر ہوئے ۔ رسول اللہﷺ نے بیٹھ کر نماز پڑھی تو انہوں نے آپ کی اقتدا میں کھڑے ہو کر نماز پڑھنی شروع کی ۔ آپ نے انہیں اشارہ کیا کہ بیٹھ جاؤ تو وہ بیٹھ گئے ۔ جب آپ نماز سے فارغ ہو گئے تو آپ نے فرمایا : ’’ امام اسی لیے بنایا جاتا ہے کہ اس کی اقتدا کی جائے ، جب وہ رکوع کرے تو تم رکوع کرو اور جب وہ ( رکوع وسجود سے سر ) اٹھائے تو ( پھر ) تم ( بھی سر ) اٹھاؤ اور جب وہ بیٹھ کر نماز پڑھے تو تم بھی بیٹھ کر نماز پڑھو ۔ ‘ ‘",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا,عبدہ بن سلیمان نے ہشام ( بن عروہ ) سے روایت کی ، انہوں نے اپنے والد سے اور انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ: اشْتَكَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَدَخَلَ عَلَيْهِ نَاسٌ مِنْ أَصْحَابِهِ يَعُودُونَهُ، فَصَلَّى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ جَالِسًا، فَصَلَّوْا بِصَلَاتِهِ قِيَامًا فَأَشَارَ إِلَيْهِمْ: أَنِ اجْلِسُوا فَجَلَسُوا فَلَمَّا انْصَرَفَ قَالَ: «إِنَّمَا جُعِلَ الْإِمَامُ لِيُؤتَمَّ بِهِ فَإِذَا رَكَعَ فَارْكَعُوا وَإِذَا رَفَعَ فَارْفَعُوا وَإِذَا صَلَّى جَالِسًا فَصَلُّوا جُلُوسًا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8491,
                "hadithNumber": "927",
                "englishNarrator": null,
                "hadithEnglish": "This hadith is narrated with the same chain of transmitters by Hisham bin 'Urwa.",
                "hadithUrdu": "ہم سے ابو الربیع الزہرانی نے بیان کیا، کہا ہم سے حماد نے بیان کیا، کہا ہم سے ابن زید نے بیان کیا، کہا کہ ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، انہوں نے کہا: ہم سے ابن نمیر  نے ہشام بن عروہ سے باقی ماندہ سابقہ سند کے ساتھ اسی کے مانند روایت بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "دَّثَنَا أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، قَالَا: حَدَّثَنَا ابْنُ نُمَيْرٍ ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، قَالَ: حَدَّثَنَا أَبِي، جَمِيعًا عَنْ هِشَامِ بْنِ عُرْوَةَ، بِهَذَا الْإِسْنَادِ نَحْوَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8492,
                "hadithNumber": "928",
                "englishNarrator": "Jabir رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was ill and we said prayer behind him and he was sitting. And Abu Bakr رضی ‌اللہ ‌عنہ ‌was making audible to the people his takbir. As he paid his attention towards us he saw us standing and (directed us to sit down) with a gesture. So we sat down and said our prayer with his prayer in a sitting posture. After uttering salutation he said: You were at this time about to do an act like that of the Persians and the Romans. They stand before their kings while they sit, so don't do that; follow your Imams. If they say prayer standing, you should also do so, and if they say prayer sitting, you should also say prayer sitting.",
                "hadithUrdu": "رسول اللہﷺ  کی ‌بیماری ‌میں ‌ہم ‌نے ‌آپ ‌ کے ‌پیچھے ‌اس ‌طرح ‌نماز ‌پڑھی ‌ کہ ‌آپ ‌نے ‌بیٹھ ‌ کر ‌نماز ‌پڑھائی ‌اور ‌حضرت ‌صدیق ‌ا کبر ‌رضی ‌اللہ ‌عنہ ‌مکبر ‌ ک کی ‌حیثیت ‌میں ‌تکبیرات ‌كہتے ‌تھے ‌. ‌نماز ‌میں ‌ہمیں ‌ کھڑا ‌دیکھ  کر ‌آپ ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌نے ‌ہمیں ‌بیٹھنے ‌ کا ‌حکم ‌دیا ‌تو ‌ہم ‌بیٹھ ‌گئے ‌پھر ‌بعد ‌فراغت ‌نماز ‌ارشاد ‌عالی ‌ہوا ‌تم ‌نے ‌اس ‌وقت ‌وہ ‌ کام ‌ کیا ‌جیسا ‌ کہ ‌فارس ‌اور ‌روم ‌والے ‌اپنے ‌بادشاہ ‌ کے ‌سامنے ‌ کھڑے ‌رہتے ‌ہیں ‌اور ‌بادشاہ ‌بیٹھا ‌رہتا ‌ہے ‌. ‌اب ‌آئندہ ‌ایسا ‌نہ ‌ کرنا ‌بلکہ ‌ہمیشہ ‌اپنے ‌امام ‌ کی ‌پیروی ‌ کرو ‌اگر ‌وہ ‌بیٹھ ‌ کر ‌نماز ‌پڑھائے ‌تو ‌تم ‌بھی ‌بیٹھ ‌ کر ‌نماز ‌پڑھو ‌.",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ہم سے لیث ایچ نے بیان کیا اور ہم سے محمد بن رومح نے بیان کیا،لیث نے ابو زبیر سے اور انہوں نے حضرت جابر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ: اشْتَكَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَصَلَّيْنَا وَرَاءَهُ وَهُوَ قَاعِدٌ، وَأَبُو بَكْرٍ يُسْمِعُ النَّاسَ تَكْبِيرَهُ، فَالْتَفَتَ إِلَيْنَا فَرَآنَا قِيَامًا، فَأَشَارَ إِلَيْنَا فَقَعَدْنَا فَصَلَّيْنَا بِصَلَاتِهِ قُعُودًا فَلَمَّا سَلَّمَ قَالَ: «إِنْ كِدْتُمْ آنِفًا لَتَفْعَلُونَ فِعْلَ فَارِسَ وَالرُّومِ يَقُومُونَ عَلَى مُلُوكِهِمْ، وَهُمْ قُعُودٌ فَلَا تَفْعَلُوا ائْتَمُّوا بِأَئِمَّتِكُمْ إِنْ صَلَّى قَائِمًا فَصَلُّوا قِيَامًا وَإِنْ صَلَّى قَاعِدًا فَصَلُّوا قُعُودًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8493,
                "hadithNumber": "929",
                "englishNarrator": "Jabir ‌رضی ‌اللہ ‌عنہ ‌said:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) led the prayer and Abu Bakr ‌رضی ‌اللہ ‌عنہ ‌ was behind him. When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) recited the takbir, Abu Bakr رضی ‌اللہ ‌عنہ also recited (it) in order to make it audible to us. And the rest of the hadith is like one transmitted by Laith.",
                "hadithUrdu": "رسول اللہﷺ نے ہمیں نماز پڑھائی اور ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ آپ کے پیچھے تھے ۔ جب رسول اللہﷺ تکبیر کہتے تو ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ بھی تکبیر کہتے تاکہ ہمیں سنائیں .... پھر لیث کی مذکورہ بالا روایت کی طرح بیان کیا ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا ہم سے حمید بن عبدالرحمٰن الراوسی نے بیان کیا، انہوں نے اپنے والد سے اور ابو الزبیر رضی اللہ عنہ سے, حضرت جابر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ الرُّؤَاسِيُّ، عَنْ أَبِيهِ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ: «صَلَّى بِنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَأَبُو بَكْرٍ خَلْفَهُ فَإِذَا كَبَّرَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَبَّرَ أَبُو بَكْرٍ لِيُسْمِعَنَا» ثُمَّ ذَكَرَ نَحْوَ حَدِيثِ اللَّيْثِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8494,
                "hadithNumber": "930",
                "englishNarrator": "Abu Huraira رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: The Imam is appointed, so that he should be followed, so don't be at variance with him. Recite takbir when he recites it; bow down when he bows down and when he says: Allah listens to him who praises Him, say: O Allah, our Lord, to Thee be the Praise. And when he (the Imam) prostrates, you should also prostrate, and when he says prayer sitting, you should all observe prayer sitting.",
                "hadithUrdu": "رسول اللہﷺ نے فرمایا : ’’امام اقتدا ہی کے لیے بنایا گیا ہے ، اس لیے اس کی مخالفت نہ کرو ، چنانچہ جب وہ تکبیر کہے تو تم تکبیر کہو اور جب وہ رکوع کرے تو تم رکوع کرو اور جب وہ سمع الله لمن حمده كہے تو تم اللهم ، ربنا لك الحمد کہو اور جب وہ سجدہ کرے تو تم سجدہ کرو اور جب وہ بیٹھ کر نماز پڑھے تو تم بھی بیٹھ کر نماز پڑھو ۔ ‘ ‘",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ان سے المغیرہ یعنی الحزامی نے، ہم سے ابو الزناد نے بیان کیا،اعرج نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا الْمُغِيرَةُ يَعْنِي الْحِزَامِيَّ، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ: أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: إِنَّمَا الْإِمَامُ لِيُؤْتَمَّ بِهِ، فَلَا تَخْتَلِفُوا عَلَيْهِ فَإِذَا كَبَّرَ فَكَبِّرُوا، وَإِذَا رَكَعَ فَارْكَعُوا وَإِذَا قَالَ: سَمِعَ اللهُ لِمَنْ حَمِدَهُ، فَقُولُوا: اللهُمَّ رَبَّنَا لَكَ الْحَمْدُ، وَإِذَا سَجَدَ فَاسْجُدُوا، وَإِذَا صَلَّى جَالِسًا فَصَلُّوا جُلُوسًا أَجْمَعُونَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8495,
                "hadithNumber": "931",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been transmitted by Hammam bin Munabbih from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) on the authority of Abu Huraira ‌رضی ‌اللہ ‌عنہ ‌.",
                "hadithUrdu": "ہم سے محمد بن رافع نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، کہا ہم سے معمر نے بیان کیا,ہمام بن منبہ نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انہوں نے نبی اکرمﷺ سے اسی ( سابقہ حدیث ) کے مانند روایت بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8496,
                "hadithNumber": "932",
                "englishNarrator": null,
                "hadithEnglish": "Abu Huraira reported: The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) while teaching us (the principles of faith), said: Do not try to go ahead of the Imam, recite takbir when he recites it. and when he says: Nor of those who err, you should say Amin, bow down when lie bows down, and when he says: Allah listens to him who praises Him, say: O Allah, our Lord, to Thee be the praise .",
                "hadithUrdu": "اعمش نے ابو صالح سے اور انہوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے کہا : رسول اللہﷺ ہمیں تعلیم دیتے تھے ، فرماتے تھے : ’’ امام سے آگے نہ بڑھو ، جب وہ تکبیر کہے تو تم تکبیر کہو ، جب وہ ﴿ولا الضالين﴾ کہے تو تم آمین کہو اور جب وہ رکوع کرے تو تم رکوع کرو اور جب وہ سمع الله لمن حمده کہے تو تم اللهم ، ربنا لك الحمد کہو ۔ ‘ ‘",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ خَشْرَمٍ قَالَا: أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا الْأَعْمَشُ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُعَلِّمُنَا يَقُولُ: لَا تُبَادِرُوا الْإِمَامَ إِذَا كَبَّرَ فَكَبِّرُوا وَإِذَا قَالَ: وَلَا الضَّالِّينَ فَقُولُوا: آمِينَ، وَإِذَا رَكَعَ فَارْكَعُوا، وَإِذَا قَالَ: سَمِعَ اللهُ لِمَنْ حَمِدَهُ، فَقُولُوا: اللهُمَّ رَبَّنَا لَكَ الْحَمْدُ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8497,
                "hadithNumber": "933",
                "englishNarrator": "Abu Huraira ‌رضی ‌اللہ ‌عنہ reported from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) (a hadith) like it, except the words:",
                "hadithEnglish": "Nor of those who err, say Amin and added: And don't rise up ahead of him.",
                "hadithUrdu": "’’ جب وہ ﴿ولا الضالين﴾ کہے تو تم آمین کہو ‘ ‘ اور یہ حصہ بڑھایا : ’’ اور تم اس سے پہلے ( سر ) نہ اٹھاؤ ۔ ‘ ‘",
                "urduNarrator": "ہم سے قتیبہ نے بیان کیا، ہم سے عبدالعزیز نے بیان کیا، یعنی الدراوردی نے,سہیل بن ابی صالح نے اپنے والد ( ابو صالح ) سے ، انہوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انہوں نے نبیﷺ سے اسی ( سابقہ حدیث ) کے ہم معنیٰ روایت کی ، سوائے اس حصے کے",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي الدَّرَاوَرْدِيَّ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِهِ إِلَّا قَوْلَهُ وَلَا الضَّالِّينَ فَقُولُوا: آمِينَ، وَزَادَ وَلَا تَرْفَعُوا قَبْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8498,
                "hadithNumber": "934",
                "englishNarrator": "Abu Huraira ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Verily the Imam is a shield, say prayer sitting when he says prayer sitting. And when he says: Allah listens to him who praises Him, say: O Allah, our Lord, to Thee be the praise. and when the utterance of the people of the earth synchronises with that of the beings of heaven (angels), all the previous sins would be pardoned.",
                "hadithUrdu": "رسول اللہﷺ نے فرمایا : ’’ یقینا امام ایک ڈھال ہے ( تم اس کے پیچھے پیچھے رہو ) ، چنانچہ جب وہ بیٹھ کر نماز پڑھے تو تم بھی بیٹھ کر نماز پڑھو اور جب وہ سمع الله لمن حمده كہے تو تم اللهم ، ربنا لك الحمد کہو کیونکہ جب زمین والے کا کہا ہوا آسمان والوں کے کہنے کے موافق ہو جائے گا تو اس کے سابقہ گناہ بخش دیے جائیں گے ۔ ‘ ‘",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا، کہا ہم سے محمد بن جعفر نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، کہا کہ ہم سے عبید اللہ بن معاذ نے بیان کیا، اور اس کا لفظ یہ ہے کہ ہم سے ابی نے بیان کیا، ہم سے شعب نے بیان کیا، ان کی سند سے۔ علی کا جو ابن عطا تھا,ابو علقمہ نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنا ، کہہ رہے تھے",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ، وَاللَّفْظُ لَهُ حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبةُ، عَنْ يَعْلَى وَهُوَ ابْنُ عَطَاءٍ، سَمِعَ أَبَا عَلْقَمَةَ، سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: إِنَّمَا الْإِمَامُ جُنَّةٌ، فَإِذَا صَلَّى قَاعِدًا فَصَلُّوا قُعُودًا، وَإِذَا قَالَ: سَمِعَ اللهُ لِمَنْ حَمِدَهُ. فَقُولُوا: اللهُمَّ رَبَّنَا لَكَ الْحَمْدُ، فَإِذَا وَافَقَ قَوْلُ أَهْلِ الْأَرْضِ قَوْلَ أَهْلِ السَّمَاءِ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8499,
                "hadithNumber": "935",
                "englishNarrator": "Abu Huraira رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saying: The Imam is appointed to be followed. So recite takbir when he recites it, and bow down when he bows down and when he utters: Allah listens to him who praises Him, say O Allah, our Lord, for Thee be the praise. And when he prays, standing, you should pray standing. And when he prays sitting, all of you should pray sitting.",
                "hadithUrdu": "آپﷺ نے فرمایا : ’’امام اس لیے بنایا گیا ہے کہ اس کی پیروی کی جائے ، جب وہ تکبیر کہے تو تم تکبیر کہو اور جب وہ رکوع کرے تو تم رکوع اور جب وہ سمع الله لمن حمده کہے تو تم اللهم ، ربنا لك الحمد کہو ، اور جب وہ کھڑا ہو کر نماز پڑھے تو تم بھی کھڑے ہو کر پڑھو اور جب وہ بیٹھ کر پڑھے تو تم بھی سب کے سب بیٹھ کر نماز پڑھو ۔ ‘ ‘",
                "urduNarrator": "مجھ سے ابو الطاہر نے بیان کیا، ہم سے ابن وہب نے حیا کی سند سے بیان کیا کہ ,ابو یونس( ابو علقمہ کے بجائے ) ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے آزاد کردہ غلام ابو یونس نے حدیث بیان کی ، کہا : میں نے ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو رسول اللہﷺ سے روایت کرتے سنا کہ",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ، حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ حَيْوَةَ، أَنَّ أَبَا يُونُسَ مَوْلَى أَبِي هُرَيْرَةَ، حَدَّثَهُ قَالَ: سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ: عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: إِنَّمَا جُعِلَ الْإِمَامُ لِيُؤْتَمَّ بِهِ، فَإِذَا كَبَّرَ فَكَبِّرُوا، وَإِذَا رَكَعَ فَارْكَعُوا، وَإِذَا قَالَ سَمِعَ اللهُ لِمَنْ حَمِدَهُ، فَقُولُوا: اللهُمَّ رَبَّنَا لَكَ الْحَمْدُ، وَإِذَا صَلَّى قَائِمًا، فَصَلُّوا قِيَامًا وَإِذَا صَلَّى قَاعِدًا، فَصَلُّوا قُعُودًا أَجْمَعُونَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8500,
                "hadithNumber": "936",
                "englishNarrator": "Ubaidullah bin Abdullah reported:",
                "hadithEnglish": "I visited 'A'isha and asked her to tell about the illness of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). She agreed and said: The Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was seriously ill and he asked whether the people had prayed. We said: No, they are waiting for you, Messenger of Allah. He (the Holy Prophet) said: Put some water in the tub for me. We did accordingly and he (the Holy Prophet) took a bath;and, when he was about to move with difficulty, he fainted. When he came round, he again said: Have the people said prayer? We said: No, they are waiting for you, Messenger of Allah. He (the Holy Prophet) again said: Put some water for me in the tub. We did accordingly and he took a bag, but when he was about to move with difficultyhe fainted. When he came round, he asked whether the people had prayed. We said: No, they are waiting for you, Messenger of Allah. He said: Put some water for me in the tub. We did accordingly and he took a bath and he was about to move with difficulty when he fainted. When he came roundhe said: Have the people saidprayer? We said: No, they are waiting for you, Messenger of Allah. She ('A'isha) said: The people were staying in the mosque and waiting for the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) to lead the last (night) prayer. She ('A'isha) said: The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sent (instructions) to Abu Bakr ‌رضی ‌اللہ ‌عنہ to lead the people in prayer. When the messenger came, he told him (Abd Bakr): The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) has ordered you to lead the people in prayer. Abu Bakr ‌رضی ‌اللہ ‌عنہ who was a man of very tenderly feelings asked Umar to lead the prayer. 'Umar said: You are more entitled to that. Abu Bakr led the prayers during those days. Afterwards the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) felt some relief and he went out supported by two men, one of them was al-'Abbas, to the noon prayer. Abu Bakr ‌رضی ‌اللہ ‌عنہ was leading the people in prayer. When Abu Bakr ‌رضی ‌اللہ ‌عنہ saw him. he began to withdraw, but the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) told him not to withdraw. He told his two (companions) to seat him down beside him (Abu Bakr ‌رضی ‌اللہ ‌عنہ). They seated him by the side of Abu Bakr ‌رضی ‌اللہ ‌عنہ. Abu Bakr ‌رضی ‌اللہ ‌عنہ said the prayer standing while following the prayer of the Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and the people Bald prayer (standing) while following the prayer of Abu Bakr ‌رضی ‌اللہ ‌عنہ . The Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was seated. Ubaidullah said: I visited 'Abdullah bin 'Abbas ‌رضی ‌اللہ ‌عنہ , and said: Should I submit to you what 'A'isha had told about the illness of the Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌)? He said: Go ahead. I submitted to him what had been transmitted by her ('A'isha). He objected to none of it, only asking whether she had named to him the man who accompanied al-'Abbas ‌رضی ‌اللہ ‌عنہ . I said: No. He said: It was 'Ali ‌رضی ‌اللہ ‌عنہ.",
                "hadithUrdu": "میں حضرت عائشہ رضی اللہ عنہا کی خدمت میں حاضر ہوا اور ان سے کہا : کیا آپ مجھے رسول اللہﷺ کی بیماری کے بارے میں نہیں بتائیں گی؟ انہوں نے کہا : کیوں نہیں! جب ( بیماری کے سبب ) نبی ( کے حرکات وسکنات ) بوجھل ہونے لگے تو آپ نے فرمایا : ’’ کیا لوگوں نے نماز پڑھ لی؟ ‘ ‘ ہم نے عرض کی : اللہ کے رسول! نہیں ، وہ سب آپ کا انتظار کر رہے ہیں ۔ آپ نے فرمایا : میرے لیے بڑے طشت میں پانی رکھو ۔ ‘ ‘ ہم نے پانی رکھا تو آپ نے غسل فرمایا : پھر آپ نے اٹھنے کی کوشش کی تو آپ پر بے ہوشی طاری ہو گئی ، پھر آپ کو افاقہ ہوا تو فرمایا : ’’ کیا لوگوں نے نماز پڑھی لی؟ ‘ ‘ ہم نے کہا : نہیں ، اللہ کے رسول! وہ آپ کے منتظر ہیں ۔ آپ نے فرمایا : ’’ میرے لیے بڑے طشت میں پانی رکھو ۔ ‘ ‘ ہم نے رکھا تو آپ نے غسل فرمایا : پھر آپ اٹھنے لگے توآپ پر غشی طاری ہو کئی ، پھر ہوش میں آئے تو فرمایا : ’’ کیا لوگوں نے نماز پڑھ لی ہے؟ ‘ ‘ ہم نے کہا : نہیں ، اللہ کے رسول! وہ آپ کا انتظار کر رہے ہیں ۔ آپ نے فرمایا : ’’میرے لیے بڑے طشت میں پانی رکھو ۔ ‘ ‘ ہم نے رکھا تو آپ نے غسل فرمایا : پھر اٹھنے لگے تو بے شہوش ہو گئے ، پھر ہوش میں آئے تو فرمایا : ’’ کیا لوگوں نے نماز پڑھ لی؟ ‘ ‘ ہم نے کہا : نہیں ، اللہ کے رسول! وہ رسول اللہﷺ کا انتظار کرر ہے ہیں ۔ حضرت عائشہ رضی اللہ عنہا نے فرمایا : لوگ مسجد میں اکٹھے بیٹھے ہوئے عشاء کی نماز کے لیے رسول اللہﷺ کا انتظار کر رہے تھے ۔ حضرت عائشہ رضی اللہ عنہا نے فرمایا : پھر رسول اللہﷺ نے ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی طرف پیغام بھیجا کہ وہ لوگوں کو نماز پڑھائیں ۔ پیغام لانے والا ان کے پاس آیا اور بولا : رسول اللہﷺ آپ کو حکم دے رہے ہیں کہ آپ لوگوں کو نماز پڑھائیں ۔ ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا ، اور وہ بہت نرم دل انسان تھے : عمر! آپ لوگوں کو نماز پڑھائیں ۔ عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : آپ ہی اس کے زیادہ حقدار ہیں ۔ حضرت عائشہ رضی اللہ عنہا نے فرمایا : ان دنوں ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے لوگوں کو نماز پڑھائی ، پھر یہ ہوا کہ رسول اللہﷺ نے کچھ تخفیف محسوس فرمائی تو دو مردوں کا سہارا لے کر ، جن میں سے ایک عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ تھے ، نماز ظہر کے لیے نکلے ، ( اس وقت ) ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ لوگوں کو نماز پڑھا رہے تھے ، جب ابوبکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے آپ کو دیکھا تو پیچھے ہٹنے لگے ، اس پر نبیﷺ نے انہیں اشارہ کیا کہ پیچھے نہ ہٹیں اور آپ نے ان دونوں سے فرمایا : ’’ مجھے ان کے پہلو میں بٹھا دو ۔ ‘ ‘ ان دونوں نے آپ کو ابوبکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے پہلو میں بٹھا دیا ، ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کھڑے ہو کر نبیﷺ کی اقتدا میں نماز پڑھ رہے تھے اور لوگ ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی نماز کی اقتدا کر رہے تھے اور نبیﷺ بیٹھے ہوئے تھے ۔ ( حضرت عائشہ رضی اللہ عنہا سے روایت کرنے والے راوی ) عبید اللہ نے کہا : پھر میں حضرت عبد اللہ بن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی خدمت میں حاضر ہوا اور ان سے عرض کی : کیا میں آپ کے سامنے وہ حدیث پیش نہ کروں ، جو حضرت عائشہ رضی اللہ عنہا نے مجھے نبی ﷺ کی بیماری کے بارے میں بیان کی ہے؟ انہوں نے کہا : لاؤ ۔ تو میں نے ان کے سامنے عائشہ رضی اللہ عنہا کی حدیث پیش کی ، انہوں نے اس میں سے کسی بات کا انکار نہ کیا ، ہاں! اتنا کہا : کیا حضرت عائشہ رضی اللہ عنہ نے تمہیں اس آدمی کا نام بتایا جو عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے ساتھ تھے؟ میں نے کہا : نہیں ۔ انہوں نے کہا : وہ حضرت علی ‌رضی ‌اللہ ‌عنہ ‌ ‌ تھے ۔",
                "urduNarrator": "ہم سے احمد بن عبداللہ بن یونس نے بیان کیا، کہا ہم سے زائِدہ نے بیان کیا,موسیٰ بن ابی عائشہ نے عبید اللہ بن عبد اللہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللهِ بْنِ يُونُسَ، حَدَّثَنَا زَائِدَةُ، حَدَّثَنَا مُوسَى بْنُ أَبِي عَائِشَةَ، عَنْ عُبَيْدِ اللهِ بْنِ عَبْدِ اللهِ، قَالَ: دَخَلْتُ عَلَى عَائِشَةَ فَقُلْتُ لَهَا أَلَا تُحَدِّثِينِي عَنْ مَرَضِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ؟ قَالَتْ: بَلَى ثَقُلَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «أَصَلَّى النَّاسُ؟» قُلْنَا: لَا، وَهُمْ يَنْتَظِرُونَكَ يَا رَسُولَ اللهِ قَالَ: «ضَعُوا لِي مَاءً فِي الْمِخْضَبِ» فَفَعَلْنَا فَاغْتَسَلَ ثُمَّ ذَهَبَ لِيَنُوءَ فَأُغْمِيَ عَلَيْهِ ثُمَّ أَفَاقَ فَقَالَ: «أَصَلَّى النَّاسُ؟» قُلْنَا لَا، وَهُمْ يَنْتَظِرُونَكَ يَا رَسُولَ اللهِ فَقَالَ: «ضَعُوا لِي مَاءً فِي الْمِخْضَبِ» فَفَعَلْنَا فَاغْتَسَلَ، ثُمَّ ذَهَبَ لِيَنُوءَ فَأُغْمِيَ عَلَيْهِ ثُمَّ أَفَاقَ، فَقَالَ: «أَصَلَّى النَّاسُ؟» قُلْنَا لَا، وَهُمْ يَنْتَظِرُونَكَ يَا رَسُولَ اللهِ، فَقَالَ: «ضَعُوا لِي مَاءً فِي الْمِخْضَبِ» فَفَعَلْنَا فَاغْتَسَلَ ثُمَّ ذَهَبَ لِيَنُوءَ فَأُغْمِيَ عَلَيْهِ، ثُمَّ أَفَاقَ فَقَالَ: «أَصَلَّى النَّاسُ؟» فَقُلْنَا لَا، وَهُمْ يَنْتَظِرُونَكَ يَا رَسُولَ اللهِ، قَالَتْ: وَالنَّاسُ عُكُوفٌ فِي الْمَسْجِدِ يَنْتَظِرُونَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِصَلَاةِ الْعِشَاءِ الْآخِرَةِ، قَالَتْ: فَأَرْسَلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِلَى أَبِي بَكْرٍ أَنْ يُصَلِّيَ بِالنَّاسِ، فَأَتَاهُ الرَّسُولُ فَقَالَ: إِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُكَ أَنْ تُصَلِّيَ بِالنَّاسِ، فَقَالَ أَبُو بَكْرٍ وَكَانَ رَجُلًا رَقِيقًا يَا عُمَرُ صَلِّ بِالنَّاسِ، قَالَ: فَقَالَ عُمَرُ: أَنْتَ أَحَقُّ بِذَلِكَ، قَالَتْ: فَصَلَّى بِهِمْ أَبُو بَكْرٍ تِلْكَ الْأَيَّامَ، ثُمَّ إِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَجَدَ مِنْ نَفْسِهِ خِفَّةً فَخَرَجَ بَيْنَ رَجُلَيْنِ أَحَدُهُمَا الْعَبَّاسُ، لِصَلَاةِ الظُّهْرِ وَأَبُو بَكْرٍ يُصَلِّي بِالنَّاسِ فَلَمَّا رَآهُ أَبُو بَكْرٍ ذَهَبَ لِيَتَأَخَّرَ فَأَوْمَأَ إِلَيْهِ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ لَا يَتَأَخَّرَ وَقَالَ لَهُمَا: «أَجْلِسَانِي إِلَى جَنْبِهِ» فَأَجْلَسَاهُ إِلَى جَنْبِ أَبِي بَكْرٍ، وَكَانَ أَبُو بَكْرٍ يُصَلِّي وَهُوَ قَائِمٌ بِصَلَاةِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَالنَّاسُ يُصَلُّونَ بِصَلَاةِ أَبِي بَكْرٍ، وَالنَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَاعِدٌ قَالَ عُبَيْدُ اللهِ: فَدَخَلْتُ عَلَى عَبْدِ اللهِ بْنِ عَبَّاسٍ فَقُلْتُ لَهُ: أَلَا أَعْرِضُ عَلَيْكَ مَا حَدَّثَتْنِي عَائِشَةُ عَنْ مَرَضِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: هَاتِ فَعَرَضْتُ حَدِيثَهَا عَلَيْهِ فَمَا أَنْكَرَ مِنْهُ شَيْئًا غَيْرَ أَنَّهُ قَالَ: أَسَمَّتْ لَكَ الرَّجُلَ الَّذِي كَانَ مَعَ الْعَبَّاسِ قُلْتُ: لَا. قَالَ: هُوَ عَلِيٌّ.",
                "headingArabic": "اسْتِخْلاَفِ الإِمَامِ إِذَا عَرَضَ لَهُ عُذْرٌ مِنْ مَرَضٍ وَسَفَرٍ وَغَيْرِهِمَا مَنْ يُصَلِّي بِالنَّاسِ وَأَنَّ مَنْ صَلَّى خَلْفَ إِمَامٍ جَالِسٍ لِعَجْزِهِ عَنِ الْقِيَامِ لَزِمَهُ الْقِيَامُ إِذَا قَدَرَ عَلَيْهِ وَنَسْخِ الْقُعُودِ خَلْفَ الْقَاعِدِ فِي حَقِّ مَنْ قَدَرَ عَلَى الْقِيَامِ",
                "headingUrdu": "اگر امام کو بیماری یا سفر وغیرہ کا عذر پیش آئے تو وہ کسی اور کو لوگوں کی امامت کے لیے مقرر کر سکتا ہے۔ جو شخص امام کے پیچھے بیٹھ کر نماز پڑھتا ہے کیونکہ وہ کھڑا ہونے کی طاقت نہیں رکھتا تو اسے کھڑا ہونا چاہیے؛ اور کھڑے ہونے کی استطاعت رکھنے والوں کے لیے بیٹھے ہوئے امام کے پیچھے بیٹھنا منسوخ ہے۔",
                "headingEnglish": "If The Imam Experiences An Excuse, From Illness, Or Travelling, Etc. He May Appoint Someone Else To Lead The People In Prayer; The One Who Offers Prayer Behind The Imam Sitting Because He Is Unable To Stand Must Stand If He Is Able To Do So; And The Abrogation Of Sitting Behind A Sitting Imam For Those Who Are Able To Stand",
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8501,
                "hadithNumber": "937",
                "englishNarrator": null,
                "hadithEnglish": "It was in the house of Maimuna رضی اللہ عنہا that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) first fell ill. He asked permission from his wives to stay in her ('A'isha's) house during his illness. They granted him permission. She ('A'isha) narrated: He (the Holy Prophet) went out (for prayer) with his hand over al-Fadl bin 'Abbas رضی ‌اللہ ‌عنہ and on the other hand there was another person and (due to weakness) his feet dragged on the earth. 'Ubaidullah said: I narrated this hadith to the son of 'Abbas ('Abdullah bin 'Abbas رضی ‌اللہ ‌عنہ) and he said: Do you know who the man was whose name 'A'isha رضی اللہ عنہا did not mention? It was 'Ali رضی ‌اللہ ‌عنہ .",
                "hadithUrdu": "رسول اللہﷺ کی بیماری کا آغاز میمونہ رضی اللہ عنہا کے گھر سے ہوا ، آپ نے اپنی بیویوں سے اجازت مانگی کہ آپ کی تیمار داری میرے گھر میں کی جائے ، انہوں نے اجازت دے دی ۔ ( عائشہ رضی اللہ عنہا نے ) فرمایا : آپ اس طرح نکلے کہ آپ کا ایک ہاتھ فضل بن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ ( کے کندھے ) پر اور دوسرا ہاتھ ایک دوسرے آدمی پر تھا اور ( نقاہت کی وجہ سے ) آپ اپنے باؤں سے زمین پر لکیر بناتے جا رہے تھے ۔ عبید اللہ نے بیان کیا کہ میں نے یہ حدیث ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو سنائی تو انہوں نے کہا : کیا تم جانتے ہو وہ آدمی ، جس کا حضرت عائشہ رضی اللہ عنہا نے نام نہیں لیا ، کون تھے؟ وہ علی ‌رضی ‌اللہ ‌عنہ ‌ ‌ تھا",
                "urduNarrator": "ہم سے محمد بن رافع اور عبد بن حمید نے بیان کیا - اور یہ لفظ ابن رافع کا ہے - انہوں نے کہا: ہم سے عبدالرزاق نے بیان کیا،معمر نے بیان کیا کہ زہری نے کہا : مجھے عبید اللہ بن عبد اللہ بن عتبہ نے خبر دی کہ حضرت عائشہ رضی اللہ عنہا نے اسے خبر کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، - وَاللَّفْظُ لِابْنِ رَافِعٍ -، قَالَا: حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، قَالَ: قَالَ الزُّهْرِيُّ: وَأَخْبَرَنِي عُبَيْدُ اللهِ بْنُ عَبْدِ اللهِ بْنِ عُتْبَةَ، أَنَّ عَائِشَةَ أَخْبَرَتْهُ قَالَتْ: أَوَّلُ مَا اشْتَكَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي بَيْتِ مَيْمُونَةَ فَاسْتَأْذَنَ أَزْوَاجَهُ أَنْ يُمَرَّضَ فِي بَيْتِهَا وَأَذِنَّ لَهُ قَالَتْ: فَخَرَجَ وَيَدٌ لَهُ عَلَى الْفَضْلِ بْنِ عَبَّاسٍ وَيَدٌ لَهُ عَلَى رَجُلٍ آخَرَ، وَهُوَ يَخُطُّ بِرِجْلَيْهِ فِي الْأَرْضِ فَقَالَ عُبَيْدُ اللهِ: فَحَدَّثْتُ بِهِ ابْنَ عَبَّاسٍ فَقَالَ: «أَتَدْرِي مَنِ الرَّجُلُ الَّذِي لَمْ تُسَمِّ عَائِشَةُ هُوَ عَلِيٌّ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8502,
                "hadithNumber": "938",
                "englishNarrator": "A'isha رضی اللہ عنہا , the wife of the Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), said:",
                "hadithEnglish": "When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) fell ill and his illness became serious, he asked permission from his wives to stay in my house during his illness. They gave him permission to do so. He stepped out (of 'A'isha's apartment for prayer) supported by two persons. (He was so much weak) that his feet dragged on the ground and he was being supported by 'Abbas bin 'Abdul-Muttalib ‌رضی ‌اللہ ‌عنہ ‌and another person. 'Ubaidullah said: I informed 'Abdullah (bin 'Abbas) رضی اللہ عنہما about that which 'A'isha had said. 'Abdullah bin 'Abbas ‌رضی ‌اللہ ‌عنہ ‌said: Do you know the man whose name 'A'isha did not mention? He said: No. Ibn 'Abbas ‌رضی ‌اللہ ‌عنہ ‌said: It was 'Ali ‌رضی ‌اللہ ‌عنہ ‌.",
                "hadithUrdu": "رسول اللہﷺ کی زوجہ حضرت عائشہ رضی اللہ عنہا نے کہا : جب رسول اللہﷺ کی بیماری شدت اختیار کر گئی اور آپ کی تکلیف میں اضافہ ہو گیا تو آپ نے اپنی بیویوں سے اجازت طلب کی کہ ان کی تیمار داری میرے گھر میں ہو ، انہوں نے اجازت دے دی ، پھر آپ دو آدمیوں کے درمیان ( ان کا سہارا لے کر ) نکلے ، آپ کے دونوں پاؤں زمین پر لکیر بناتے جا رہے تھے ( اور آپ ) عباس بن عبد المطلب ‌رضی ‌اللہ ‌عنہ ‌ ‌ اور ایک دوسرے آدمی کے درمیان تھے ۔ ( حدیث کے راوی ) عبید اللہ نے کہا : عائشہ رضی اللہ عنہا نے جو کچھ کہا تھا ، میں نے اس کا تذکرہ عبد اللہ ( بن عباس ) رضی اللہ عنہما سے کیا تو انہوں نے مجھ سے کہا : کیا تم جانتے ہو وہ آدمی کون تھا جس کا حضرت عائشہ رضی اللہ عنہا نے نام نہیں لیا؟ انہوں نے کہا : میں نے کہا : نہیں ۔ حضرت ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : وہ حضرت علی بن ابی طالب ‌رضی ‌اللہ ‌عنہ ‌ ‌ تھے ۔",
                "urduNarrator": "مجھ سے عبدالملک بن شعیب بن لیث نے بیان کیا، مجھ سے میرے والد نے بیان کیا، میرے دادا سے، انہوں نے کہا,عقیل بن خالد نے کہا : ابن شہاب ( زہری ) نے کہا : مجھے عبید اللہ بن عبد اللہ بن عتبہ بن مسعود نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، قَالَ: حَدَّثَنِي عُقَيْلُ بْنُ خَالِدٍ، قَالَ: ابْنُ شِهَابٍ، أَخْبَرَنِي عُبَيْدُ اللهِ بْنُ عَبْدِ اللهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، أَنَّ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَتْ: «لَمَّا ثَقُلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَاشْتَدَّ بِهِ وَجَعُهُ اسْتَأْذَنَ أَزْوَاجَهُ أَنْ يُمَرَّضَ فِي بَيْتِي، فَأَذِنَّ لَهُ فَخَرَجَ بَيْنَ رَجُلَيْنِ تَخُطُّ رِجْلَاهُ فِي الْأَرْضِ، بَيْنَ عَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ وَبَيْنَ رَجُلٍ آخَرَ» قَالَ عُبَيْدُ اللهِ: فَأَخْبَرْتُ عَبْدَ اللهِ بِالَّذِي قَالَتْ عَائِشَةُ: فَقَالَ لِي عَبْدُ اللهِ بْنُ عَبَّاسٍ: «هَلْ تَدْرِي مَنِ الرَّجُلُ الْآخَرُ الَّذِي لَمْ تُسَمِّ عَائِشَةُ؟» قَالَ: قُلْتُ: لَا. قَالَ: ابْنُ عَبَّاسٍ: «هُوَ عَلِيٌّ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8503,
                "hadithNumber": "939",
                "englishNarrator": "A'isha رضی اللہ عنہا , the wife of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), said:",
                "hadithEnglish": "I tried to dissuade the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) from it (i. e. from appointing Abu Bakr as the Imam.) and my insistence upon it was not due to the fact that I entertained any apprehension in my mind that the people would not love the man who would occupy his (Prophet's) place (i. e. who would be appointed as his caliph) and I feared that the people would be superstitious about one who would occupy his place. I, therefore, desired that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) should leave Abu Bakr aside in this matter.",
                "hadithUrdu": "میں نے ( حضرت ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو امام بنانے کے ) اس معاملے میں رسول اللہ ﷺ سے بار بار بات کی ۔ میں نے اتنی بار آپ سے صرف اس لیے رجوع کیا کہ میرے دل میں یہ بات بیٹھتی نہ تھی کہ لوگ آپ کے بعد کبھی اس شخص سے محبت کریں گے جو آپ کا قائم مقام ہو گا اور اس کے برعکس میرا خیال یہ تھا کہ آپ کی جگہ پر جو شخص بھی کھڑا ہو گا لوگ اسے برا ( برے شگون کا حامل ) سمجھیں گے ، اس لیے میں چاہتی تھی کہ رسول اللہﷺ امامت ( کی ذمہ داری ) ابو بکر سے ہٹا دیں ۔",
                "urduNarrator": "ہم سے عبدالملک بن شعیب بن لیث نے بیان کیا، مجھ سے میرے والد نے بیان کیا، مجھ سے میرے دادا عقیل بن خالد نے بیان کیا، انہوں نے کہا: ابن شہاب نے کہا,عبید اللہ بن عبد اللہ بن عتبہ بن مسعود نے خبر دی کہ نبیﷺ کی زوجہ حضرت عائشہ رضی اللہ عنہا نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي عُقَيْلُ بْنُ خَالِدٍ، قَالَ: قَالَ ابْنُ شِهَابٍ: أَخْبَرَنِي عُبَيْدُ اللهِ بْنُ عَبْدِ اللهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، أَنَّ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَتْ: «لَقَدْ رَاجَعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي ذَلِكَ وَمَا حَمَلَنِي عَلَى كَثْرَةِ مُرَاجَعَتِهِ، إِلَّا أَنَّهُ لَمْ يَقَعْ فِي قَلْبِي أَنْ يُحِبَّ النَّاسُ بَعْدَهُ رَجُلًا، قَامَ مَقَامَهُ أَبَدًا، وَإِلَّا أَنِّي كُنْتُ أَرَى أَنَّهُ لَنْ يَقُومَ مَقَامَهُ أَحَدٌ إِلَّا تَشَاءَمَ النَّاسُ بِهِ، فَأَرَدْتُ أَنْ يَعْدِلَ ذَلِكَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ أَبِي بَكْرٍ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8504,
                "hadithNumber": "940",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came to my house, he said: Ask Abu Bakr to lead people in prayer. 'A'isha رضی اللہ عنہا narrated: I said, Messenger of Allah, Abu Bakr رضی اللہ عنہ is a man of tenderly feelings; as he recites the Qur'an, he cannot help shedding tears: so better command anyone else to lead the prayer. By Allah, there is nothing disturbing in it for me but the idea that the people may not takeevil omen with regard to one who is the first to occupy the place of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). I tried to dissuade him (the Holy Prophet) twice or thrice (from appointing my father as an Imam in prayer), but he ordered Abu Bakr to lead the people in prayer and said: You women are like those (who had) surrounded Yusuf رضی ‌اللہ ‌عنہ ‌.",
                "hadithUrdu": "جب رسول اللہﷺ ( بیماری کے دوران میں ) میرے گھر تشریف لے آئے تو آپ نے فرمایا : ’’ابو بکر کو حکم پہنچاؤ کہ وہ لوگوں کو نماز پڑھائیں ۔ ‘ ‘ وہ کہتی ہیں : میں نے عرض کی : اے اللہ کے رسول! ابو بکر نرم دل انسان ہیں ، جب وہ قرآن پڑھیں گے تو اپنے آنسوؤں پر قابو نہیں رکھ سکیں گے ، لہٰذا اگر آپ ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے بجائے کسی اور کو حکم دیں ( تو بہتر ہو گا ۔ ) عائشہ رضی اللہ عنہا فرماتی ہیں : اللہ کی قسم! میرے دل میں اس چیز کو ناپسند کرنے کی اس کے علاوہ اور کوئی بات نہ تھی کہ جو شخص سب سے پہلے آپ کی جگہ کھڑا ہو گا لوگ اسے برا سمجھیں گے ، اس لیے میں نے دو یا تین دفعہ اپنی بات دہرائی تو آپ نے فرمایا : ’’ابو بکر ہی لوگوں کو نماز پڑھائیں ، بلاشبہ تم یوسف ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے ساتھ ( معاملہ کرنے ) والی عورتیں ہی ہو ۔ ‘ ‘",
                "urduNarrator": "ہم سے محمد بن رافع اور عبد بن حمید نے بیان کیا - اور یہ لفظ ابن رافع نے بیان کیا ، کہا : ہم سے انہوں نے بیان کیا اور ابن رافع نے کہا - ہم سے عبد الرزاق نے بیان کیا ، ہمیں اخبر معمر نے دیکھا ، الزہری نے کہا , ( عبید اللہ بن عبد اللہ کے بجائے ) حمزہ بن عبد اللہ بن عمر نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، - وَاللَّفْظُ لِابْنِ رَافِعٍ قَالَ عَبْدٌ: أَخْبَرَنَا وَقَالَ ابْنُ رَافِعٍ - حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، قَالَ الزُّهْرِيُّ: وَأَخْبَرَنِي حَمْزَةُ بْنُ عَبْدِ اللهِ بْنِ عُمَرَ، عَنْ عَائِشَةَ، قَالَتْ: لَمَّا دَخَلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَيْتِي قَالَ: «مُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ بِالنَّاسِ» قَالَتْ: فَقُلْتُ يَا رَسُولَ اللهِ، إِنَّ أَبَا بَكْرٍ رَجُلٌ رَقِيقٌ إِذَا قَرَأَ الْقُرْآنَ لَا يَمْلِكُ دَمْعَهُ فَلَوْ أَمَرْتَ غَيْرَ أَبِي بَكْرٍ، قَالَتْ: وَاللهِ، مَا بِي إِلَّا كَرَاهِيَةُ أَنْ يَتَشَاءَمَ النَّاسُ، بِأَوَّلِ مَنْ يَقُومُ فِي مَقَامِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَتْ: فَرَاجَعْتُهُ مَرَّتَيْنِ أَوْ ثَلَاثًا، فَقَالَ: «لِيُصَلِّ بِالنَّاسِ أَبُو بَكْرٍ فَإِنَّكُنَّ صَوَاحِبُ يُوسُفَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8505,
                "hadithNumber": "941",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was confined to bed, Bilal came to him to summon him to prayer. He (the Holy Prophet) said: Ask Abu Bakr رضی اللہ عنہ to lead the people in prayer. She ('A'isha) reported: I said: Messenger of Allah, Abu! Bakr رضی اللہ عنہ is a tenderhearted man, go when ]be would stand at your place (he would be so overwhelmed by feelings) that he would not be able to make the people hear anything (his recitation would not be audible to the followers in prayer). You should better order Umar (to lead the prayer). He (the Holy Prophet) said: Ask Abu Bakr رضی اللہ عنہ to lead people in- prayer. She ('A'isha) said: I asked Hafsa to (convey) my impression to him (the Holy Prophet) that Abu Bakr رضی اللہ عنہ was a tenderhearted man, so when he would stand at his place, he would not be able to make the people bear anything. He better order Umar. Hafsa رضی اللہ عنہا conveyed this (message of Hadrat 'A'isha) to him (the Holy Prophet). The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: (You are behaving) as if you are the females who had gathered around Yusuf. Order Abu Bakr to lead the people in prayer. She ('A'isha) reported: So Abu Bakr رضی اللہ عنہ was ordered to lead the people in prayer. As the prayer began, the Messenger of Allah (رضی اللہ عنہ) felt some relief; he got up and moved supported by two persons and his feet dragged on earth (due to excessive weakness). 'A'isha رضی اللہ عنہا reported: As he (the Holy Prophet) entered the mosque. Abu Bakr رضی اللہ عنہ perceived his (arrival). He was about to with. draw, but the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) by the gesture (of This hand) told him to keep standing at his place. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came and seated himself on the left side of Abu Bakr رضی اللہ عنہ . She ('A'isha) reported: The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was leading people in prayer sitting. Abu Bakr رضی اللہ عنہ was following the prayer of the Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) in a standing posture and the people were following the prayer of Abu Bakr رضی اللہ عنہ .",
                "hadithUrdu": "جب رسول اللہﷺ کی بیماری شدت اختیار کر گئی تو بلال ‌رضی ‌اللہ ‌عنہ ‌ ‌ آپ کو نماز کی اطلاع دینے کے لیے حاضر ہوئے ۔ آپ نے فرمایا : ’’ ابو بکر سے کہو وہ نماز پڑھائیں ۔ ‘ ‘ عائشہ رضی اللہ عنہا کہتی ہیں : میں نے عرض کی : اے اللہ کے رسول! ابو بکر جلد غم زدہ ہو جانے والے انسان ہیں اور وہ جب آپ کی جگہ کھڑے ہوں گے تو لوگوں کو ( قراءت بھی ) نہیں سنا سکیں گے ، لہٰذا اگر آپ عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو حکم دے دیں ( تو بہتر بہتر ہو گا ۔ ) آپ ﷺ نے ( پھر ) فرمایا : ’’ابو بکر سے کہو کہ وہ لوگوں کو نماز پڑھائیں ۔ ‘ ‘ میں نے حفصہ رضی اللہ عنہا سے کہا : نم نبی اکرمﷺ سے کہو کہ ابو بکر جلد غمزدہ ہونے والے انسان ہیں ، جب وہ آپ کی جگہ پر کھڑے ہوں گے تو لوگوں کو ( قراءت ) نہ سنا سکیں ، چنانچہ اگر آپ عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو حکم دیں ( تو بہتر ہو گا ۔ ) حضرت حفصہ رضی اللہ عنہا نے آپ سے کہہ دیا تو آپ نے فرمایا : ’’تم یوسف ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے ساتھ ( معاملہ کرنے ) والی عورتوں ہی طرح ہو ، ابو بکر سے کہو کہ وہ لوگوں کو نماز پڑھائیں ۔ ‘ ‘ عائشہ رضی اللہ عنہا فرماتی ہیں : لوگوں نے ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو حکم پہنچا دیا تو انہوں نے لوگوں کو نماز پڑھائی ۔ جب ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے نماز شروع کر دی تو رسول اللہﷺ نے طبیعت میں قدرے تخفیف محسوس کی ، آپ اٹھے ، دو آدمی آپ کو سہارا دیے ہوئے تھے اور آپ کے پاؤں زمین پر لکیر کھینچتے جا رہے تھے ۔ وہ فرماتی ہیں : جب آپ مسجد میں داخل ہوئے تو ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے آپ کی آہٹ سن لی ، وہ پیچھے ہٹنے لگے تو رسول اللہﷺ نے انہیں اشارہ کیا کہ اپنی جگہ کھڑے رہو ، پھر رسول اللہﷺ آگے بڑے اور ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی بائیں جانب بیٹھ گئے ۔ عائشہ رضی اللہ عنہا فرماتی ہیں کہ رسول اللہﷺ بیٹھ کر لوگوں کو نماز پڑھا رہے تھے اور ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کھڑے ہو کر ۔ ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ رسول اللہﷺ کی نماز کی اقتدا کر رہے تھے اور لوگ ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی اقتدا کر رہے تھے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، انہوں نے کہاابو معاویہ اور وکیع نے اعمش سے ، انہوں نے ابراہیم سے ، انہوں نے اسود سے اور انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، وَوَكِيعٌ، ح وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، - وَاللَّفْظُ لَهُ - قَالَ: أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الْأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ: لَمَّا ثَقُلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ جَاءَ بِلَالٌ يُؤْذِنُهُ بِالصَّلَاةِ. فَقَالَ: «مُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ بِالنَّاسِ» قَالَتْ: فَقُلْتُ يَا رَسُولَ اللهِ، إِنَّ أَبَا بَكْرٍ رَجُلٌ أَسِيفٌ وَإِنَّهُ مَتَى يَقُمْ مَقَامَكَ لَا يُسْمِعِ النَّاسَ فَلَوْ أَمَرْتَ عُمَرَ، فَقَالَ: «مُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ بِالنَّاسِ» قَالَتْ: فَقُلْتُ لِحَفْصَةَ قُولِي لَهُ: إِنَّ أَبَا بَكْرٍ رَجُلٌ أَسِيفٌ وَإِنَّهُ مَتَى يَقُمْ مَقَامَكَ لَا يُسْمِعِ النَّاسَ، فَلَوْ أَمَرْتَ عُمَرَ، فَقَالَتْ لَهُ: فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّكُنَّ لَأَنْتُنَّ صَوَاحِبُ يُوسُفَ» مُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ بِالنَّاسِ، قَالَتْ: فَأَمَرُوا أَبَا بَكْرٍ يُصَلِّي بِالنَّاسِ، قَالَتْ: فَلَمَّا دَخَلَ فِي الصَّلَاةِ وَجَدَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنْ نَفْسِهِ خِفَّةً فَقَامَ يُهَادَى بَيْنَ رَجُلَيْنِ، وَرِجْلَاهُ تَخُطَّانِ فِي الْأَرْضِ، قَالَتْ: فَلَمَّا دَخَلَ الْمَسْجِدَ سَمِعَ أَبُو بَكْرٍ حِسَّهُ، ذَهَبَ يَتَأَخَّرُ، فَأَوْمَأَ إِلَيْهِ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قُمْ مَكَانَكَ، فَجَاءَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حَتَّى جَلَسَ عَنْ يَسَارِ أَبِي بَكْرٍ قَالَتْ: فَكَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي بِالنَّاسِ جَالِسًا وَأَبُو بَكْرٍ قَائِمًا يَقْتَدِي أَبُو بَكْرٍ بِصَلَاةِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَيَقْتَدِي النَّاسُ بِصَلَاةِ أَبِي بَكْرٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8506,
                "hadithNumber": "942",
                "englishNarrator": "A'mash reported:",
                "hadithEnglish": "When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) suffered from illness of which he died, and in the hadith transmitted by Ibn Mushir, the words are: The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was brought till he was seated by his (Abu Bakr's) side and the Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) led the people in prayer and Abu Bakr رضی ‌اللہ ‌عنہ was making takbir audible to them, and in the hadith transmitted by 'Isa the (words are): The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sat and led the people in prayer and Abu Bakr رضی ‌اللہ ‌عنہ was by his side and he was making (takbir) audible to the people.",
                "hadithUrdu": "جب رسول اللہﷺ اس مرض میں مبتلا ہوئے جس میں آپ نے وفات پائی ۔ ابن مسہر کی روایت میں ہے : رسول اللہﷺ کو لایا گیا یہاں تک کہ انہیں ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے پہلو میں بٹھا دیا گیا ۔ رسول اللہﷺ لوگوں کو نماز پڑھا رہے تھے اور ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ لوگوں کو تکبیر سنا رہے تھے ۔ عیسیٰ کی روایت میں ہے : رسول اللہﷺ بیٹھ گئے اور لوگوں کو نماز پڑھانے لگے ، ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ آپ کے پہلو میں تھے اور لوگوں کو ( آپ کی تکبیر ) سنا رہے تھے ۔",
                "urduNarrator": "ہم سے منجاب بن الحارث التمیمی نے بیان کیا، ہم سے ابن مسْهر نے بیان کیا، اور ہم سے اسحاق بن ابراہیم نے بیان کیا, علی بن مسہر اور عیسیٰ بن یونس نے اعمش سے اسی سند کے ساتھ مذکورہ بالا روایت بیان کی ۔ ان دونوں کی حدیث میں ہے کہ",
                "hadithArabic": "حَدَّثَنَا مِنْجَابُ بْنُ الْحَارِثِ التَّمِيمِيُّ، أَخْبَرَنَا ابْنُ مُسْهِرٍ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، كِلَاهُمَا عَنِ الْأَعْمَشِ، بِهَذَا الْإِسْنَادِ نَحْوَهُ، وَفِي حَدِيثِهِمَا لَمَّا مَرِضَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مَرَضَهُ الَّذِي تُوُفِّيَ فِيهِ، وَفِي حَدِيثِ ابْنِ مُسْهِرٍ فَأُتِيَ بِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حَتَّى أُجْلِسَ إِلَى جَنْبِهِ وَكَانَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي بِالنَّاسِ وَأَبُو بَكْرٍ يُسْمِعُهُمُ التَّكْبِيرَ، وَفِي حَدِيثِ عِيسَى فَجَلَسَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي وَأَبُو بَكْرٍ إِلَى جَنْبِهِ وَأَبُو بَكْرٍ يُسْمِعُ النَّاسَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8507,
                "hadithNumber": "943",
                "englishNarrator": "`A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) ordered Abu Bakr رضی ‌اللہ ‌عنہ ‌that he should lead people in prayer during his illness, and he led them in prayer. `Urwa said: The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) felt relief and went (to the mosque) and Abu Bakr رضی ‌اللہ ‌عنہ ‌was leading the people in prayer. When Abu Bakr رضی ‌اللہ ‌عنہ ‌saw him he began to withdraw, but the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) signaled him to remain where he was. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sat opposite to Abu Bakr رضی ‌اللہ ‌عنہ ‌by his side. Abu Bakr رضی ‌اللہ ‌عنہ ‌said prayer following the prayer of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), and the people said prayer following the prayer of Abu Bakr رضی ‌اللہ ‌عنہ ‌.",
                "hadithUrdu": "انہوں نے فرمایا : رسول اللہﷺ نے اپنی بیماری میں ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو حکم دیا کہ وہ لوگوں کو نماز پڑھائیں تو وہ ان کو نماز پڑھاتے رہے ۔ عروہ نے کہا : پھر رسول اللہﷺ نے اپنی طبیعت میں کچھ ہلکا پن محسوس کیا ، تو آپ باہر تشریف لائے ، اس وقت ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ لوگوں کی امت کر رہے تھے ۔ جب ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے آپ کو دیکھا تو پیچھے ہٹنے لگے ۔ رسول اللہ ﷺ نے انہیں اشارہ کیا کہ جیسے ہو ویسے ہی رہو ۔ رسول اللہﷺ ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے برابر ان کے پہلو میں بیٹھ گئے تو ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ رسول اللہﷺ کی امامت میں نماز ادا کر رہے تھے اور لوگ ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی اقتدا میں نماز پڑھ رہے تھے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، انہوں نے کہا: ہم سے ابن نمیر نے بیان کیا، ہشام کی سند سے، ہم سے ابن نمیر نے بیان کیا، اور ان کا قول بھی اسی طرح ہے، انہوں نے کہا: ہم سے میرے والد نے بیان کیا، انہوں نے کہا: ہم سے ہشام نے اپنے والد سے اور عائشہ رضی اللہ عنہا کی روایت سے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، قَالَا: حَدَّثَنَا ابْنُ نُمَيْرٍ، عَنْ هِشَامٍ، ح وحَدَّثَنَا ابْنُ نُمَيْرٍ، - وَأَلْفَاظُهُمْ مُتَقَارِبَةٌ - قَالَ: حَدَّثَنَا أَبِي، قَالَ: حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ: «أَمَرَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَبَا بَكْرٍ أَنْ يُصَلِّيَ بِالنَّاسِ فِي مَرَضِهِ فَكَانَ يُصَلِّي بِهِمْ«فَوَجَدَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنْ نَفْسِهِ خِفَّةً فَخَرَجَ وَإِذَا أَبُو بَكْرٍ يَؤُمُّ النَّاسَ فَلَمَّا رَآهُ أَبُو بَكْرٍ اسْتَأْخَرَ، فَأَشَارَ إِلَيْهِ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَيْ كَمَا أَنْتَ فَجَلَسَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حِذَاءَ أَبِي بَكْرٍ إِلَى جَنْبِهِ فَكَانَ أَبُو بَكْرٍ يُصَلِّي بِصَلَاةِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَالنَّاسُ يُصَلُّونَ بِصَلَاةِ أَبِي بَكْرٍ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8508,
                "hadithNumber": "944",
                "englishNarrator": "Anas bin Malik ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "Abu Bakr ‌رضی ‌اللہ ‌عنہ led them in prayer due to the illness of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) of which be died. It was a Monday and they stood in rows for prayer. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) drew aside the curtain of ('A'isha's) apartment and looked at us while he was standing, and his (Prophet's) face was (as bright) as the paper of the Holy Book. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) felt happy and smiled. And we were confounded with joy while in prayer due to the arrival (among our midst) of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ), Abu Bakr ‌رضی ‌اللہ ‌عنہ stepped back upon his heels to say prayer in a row perceiving that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had come out for prayer. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) with the help of his hand signed to them to complete their prayer. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) went back (to his apartment) and drew the curtain. He (the narrator) said: The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) breathed his last on that very day.",
                "hadithUrdu": "رسول اللہﷺ کی بیماری دوران ، جس میں آپ نے وفات پائی ، ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ لوگوں کو نماز پڑھاتے تھے حتیٰ کہ جب سوموار کا دن آیا اور صحابہ کرام ‌رضی ‌اللہ ‌عنہ ‌ ‌ نماز میں صف بستہ تھے تو رسول اللہﷺ نے حجرے کا پردہ اٹھایا اور ہماری طرف دیکھا ، اس وقت آپ کھڑے ہوئے تھے ، ایسا لگتا تھا کہ آپ کا رخ انور مصحف کا ایک ورق ہے ، پھر آپ نے ہنستے ہوئے تبسم فرمایا ۔ انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ کہتے ہیں کہ ہم نماز ہی میں اس خوشی کے سبب جو رسول اللہﷺ کے باہر آنے سے ہوئی تھی مبہوت ہو کر رہ گئے ۔ ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ الٹے پاؤں لوٹے تالکہ صف میں مل جائیں ، انہوں نے سمجھا کہ نبیﷺ نماز کے لیے باہر تشریف لا رہے ہیں ۔ نبیﷺ نے اپنے ہاتھ سے اشارہ فرمایا کہ اپنی نماز مکمل کرو ، پھر آپ واپس حجرے میں داخل ہو گئے اور پردہ لٹکا دیا ۔ اسی دن رسول اللہﷺ وفات پا گئے.",
                "urduNarrator": "مجھ سے عمرو ناقد، حسن الحلوانی اور عبد بن حمید نے بیان کیا - عبد نے کہا: اس نے مجھے بتایا، اور باقی دو نے کہا: یعقوب، جو ابراہیم بن سعد کے بیٹے ہیں - اور میرے والد نے مجھ سے کہا ،صالح نے ابن شہاب سے روایت کی ، انہوں نے کہا : حضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے مجھے خبر دی کہ",
                "hadithArabic": "حَدَّثَنِي عَمْرٌو النَّاقِدُ، وَحَسَنٌ الْحُلْوَانِيُّ، وَعَبْدُ بْنُ حُمَيْدٍ، - قَالَ عَبْدٌ: أَخْبَرَنِي، وَقَالَ الْآخَرَانِ: حَدَّثَنَا يَعْقُوبُ وَهُوَ ابْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ - وَحَدَّثَنِي أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، قَالَ: أَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ، أَنَّ أَبَا بَكْرٍ كَانَ يُصَلِّي لَهُمْ فِي وَجَعِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، الَّذِي تُوُفِّيَ فِيهِ حَتَّى إِذَا كَانَ يَوْمُ الِاثْنَيْنِ وَهُمْ صُفُوفٌ فِي الصَّلَاةِ «كَشَفَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، سِتْرَ الْحُجْرَةِ، فَنَظَرَ إِلَيْنَا، وَهُوَ قَائِمٌ كَأَنَّ وَجْهَهُ وَرَقَةُ مُصْحَفٍ، ثُمَّ تَبَسَّمَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ضَاحِكًا» قَالَ: «فَبُهِتْنَا وَنَحْنُ فِي الصَّلَاةِ مِنْ فَرَحٍ بِخُرُوجِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَنَكَصَ أَبُو بَكْرٍ عَلَى عَقِبَيْهِ لِيَصِلَ الصَّفَّ، وَظَنَّ أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ خَارِجٌ لِلصَّلَاةِ، فَأَشَارَ إِلَيْهِمْ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِيَدِهِ أَنْ أَتِمُّوا صَلَاتَكُمْ»، قَالَ: «ثُمَّ دَخَلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَأَرْخَى السِّتْرَ» قَالَ: «فَتُوُفِّيَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنْ يَوْمِهِ ذَلِكَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8509,
                "hadithNumber": "945",
                "englishNarrator": "Anas ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The last glance that I have had of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) (before his death) was that when he on Monday drew the curtain aside. The hadith transmitted by Salih is perfect and complete.",
                "hadithUrdu": "رسول اللہﷺ کی طرف میں نے جو آخری نظر ڈالی ( وہ اس طرح تھی کہ ) سوموار کے دن آپ نے ( حجرے کا ) پردہ اٹھایا .... جس طرح اوپر واقعہ ( بیان ہوا ) ہے ۔ ( امام مسلم فرماتے ہیں : ) صالح کی حدیث کامل اور سیر حاصل ہے ۔",
                "urduNarrator": "مجھ سے عمرو ناقد اور زہیر بن حرب نے بیان کیا، کہا,سفیان بن عیینہ نے ( ابن شہاب ) زہری سے ، انہوں نے حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنِيهِ عَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالَا: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ أَنَسٍ، قَالَ آخِرُ نَظْرَةٍ نَظَرْتُهَا إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ. كَشَفَ السِّتَارَةَ يَوْمَ الِاثْنَيْنِ بِهَذِهِ الْقِصَّةِ، وَحَدِيثُ صَالِحٍ أَتَمُّ وَأَشْبَعُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8510,
                "hadithNumber": "946",
                "englishNarrator": "Anas bin Malik رضی ‌اللہ ‌عنہ said:",
                "hadithEnglish": "\"When it was the Monday...\" a similar hadith (as no. 944).",
                "hadithUrdu": "جب سوموار کا دن آیا .... اوپر والے دونوں راویوں کے مطابق ۔",
                "urduNarrator": "محمد بن رافع اور عبد بن حمید سب نے مجھے عبد الرزاق کی سند سے بیان کیا,معمر نے زہری کے حوالے سے خبر دی ، انہوں نے کہا : مجھے حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے خبر دی کہ",
                "hadithArabic": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، جَمِيعًا عَنْ عَبْدِ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، قَالَ: أَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ، قَالَ: لَمَّا كَانَ يَوْمُ الِاثْنَيْنِ بِنَحْوِ حَدِيثِهِمَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8511,
                "hadithNumber": "947",
                "englishNarrator": "Anas رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) did not come to us for three days. When the prayer was about to start. Abu Bakr رضی ‌اللہ ‌عنہ stepped forward (to lead the prayer), and the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) lifted the curtain. When the face of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) became visible to us, we (found) that no sight was more endearing to us than the face of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as it appeared to us. The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) with the gesture of his hand directed Abu Bakr رضی ‌اللہ ‌عنہ to step forward (and lead the prayer). The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) then drew the curtain, and we could not see him till he died.",
                "hadithUrdu": "نبیﷺ ( بیماری کے ایام میں ) تین دن ہماری طرف تشریف نہ لائے ، ( انہی دنوں میں سے ) ایک دن نماز کھڑی کی گئی اور ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ آگے بڑھنے لگے تو نبیﷺ ( کمرے کے ) پردے کی طرف بڑھے اور اسے اٹھا دیا ، جب ہمارے سامنے نبیﷺ کا رخ انور کھلا تو ہم نے کبھی ایسا منظر نہ دیکھا تھا جو ہمارے لیے ، نبیﷺ کے چہرہ مبارک کے نظارے سے ، جو ہمارے سامنے تھا ، زیادہ حسین اور پسندیدہ ہو ۔ وہ کہتے ہیں : پھر آپﷺ نے ابوبکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو ہاتھ سے اشارہ کیا کہ وہ آگے بڑھیں اور آپ نے پردہ گرا دیا ، پھر آپ وفات تک ایسا نہ کر سکے ۔",
                "urduNarrator": "ہم سے محمد بن مثنیٰ اور ہارون بن عبداللہ نے بیان کیا، کہا: ہم سے عبدالصمد نے بیان کیا، کہا: میں نے اپنے والد کو یہ فرماتے ہوئے سنا, عبد العزیز نے حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے حدیث بیان کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَهَارُونُ بْنُ عَبْدِ اللهِ، قَالَا: حَدَّثَنَا عَبْدُ الصَّمَدِ، قَالَ: سَمِعْتُ أَبِي، يُحَدِّثُ قَالَ: حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَنَسٍ، قَالَ: لَمْ يَخْرُجْ إِلَيْنَا نَبِيُّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ثَلَاثًا فَأُقِيمَتِ الصَّلَاةُ، فَذَهَبَ أَبُو بَكْرٍ يَتَقَدَّمُ فَقَالَ: نَبِيُّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِالْحِجَابِ فَرَفَعَهُ، فَلَمَّا وَضَحَ لَنَا وَجْهُ نَبِيِّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، مَا نَظَرْنَا مَنْظَرًا قَطُّ، كَانَ أَعْجَبَ إِلَيْنَا مِنْ وَجْهِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حِينَ وَضَحَ لَنَا، قَالَ: «فَأَوْمَأَ نَبِيُّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِيَدِهِ إِلَى أَبِي بَكْرٍ أَنْ يَتَقَدَّمَ، وَأَرْخَى نَبِيُّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الْحِجَابَ فَلَمْ نَقْدِرْ عَلَيْهِ حَتَّى مَاتَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8512,
                "hadithNumber": "948",
                "englishNarrator": "Abu Musa رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) became ill and illness became serious he ordered Abu Bakr رضی اللہ عنہ to lead the people in prayer. Upon this 'A'isha رضی اللہ عنہا said: Messenger of Allah, Abd Bakr رضی اللہ عنہ is a man of tenderly feelings: when he would stand in your place (he would be so much overwhelmed -by grief that) he would not be able to lead the people in prayer. He (the Holy Prophet) said: You order Abu Bakr رضی اللہ عنہ to lead the people in prayer, and added: You are like the female companions of Yusuf. So Abu Bakr رضی اللہ عنہ led the prayer (during this period of illness) in the life of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ).",
                "hadithUrdu": "رسول اللہﷺ بیمار ہو گئے اور آپ کی بیماری نے شدت اختیار کی تو آپ نے فرمایا : ’’ ابو بکر سے کہو کہ وہ لوگوں کو نماز پڑھائیں ۔ ‘ ‘ اس پر عائشہ رضی اللہ عنہا نے عرض کی : وہ نرم دل آدمی ہیں ، جب آپ کی جگہ کھڑے ہوں گے تو لوگوں کو نماز نہ پڑھا سکیں گے ۔ آپ نے فرمایا : ’’ ( اے عائشہ! ) ابو بکر سے کہو کہ وہ لوگوں کو نماز پڑھائیں ، تم تو یوسف ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے ساتھ ( معاملہ کرنے ) والیوں کی طرح ہو ۔ ‘ ‘ انہوں ( ابو موسیٰ ‌علیہ ‌السلام ‌ ) نے کہا : اس طرح ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ رسول اللہﷺ کی زندگی میں لوگوں کو نماز پڑھانے لگے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے حسین بن علی نے بیان کیا، انہوں نے زائِدہ کی سند سے، انہوں نے عبد الملک بن عمیر کی سند سے، انہوں نے ابو بردہ کی سند سے,حضرت ابو موسیٰ ‌رضی ‌اللہ ‌عنہ ‌ سے روایت ہے ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ، عَنْ زَائِدَةَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ: مَرِضَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَاشْتَدَّ مَرَضُهُ، فَقَالَ: «مُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ بِالنَّاسِ» فَقَالَتْ عَائِشَةُ: يَا رَسُولَ اللهِ إِنَّ أَبَا بَكْرٍ رَجُلٌ رَقِيقٌ مَتَى يَقُمْ مَقَامَكَ لَا يَسْتَطِعْ أَنْ يُصَلِّيَ بِالنَّاسِ، فَقَالَ: «مُرِي أَبَا بَكْرٍ فَلْيُصَلِّ بِالنَّاسِ فَإِنَّكُنَّ صَوَاحِبُ يُوسُفَ» قَالَ: فَصَلَّى بِهِمْ أَبُو بَكْرٍ حَيَاةَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8513,
                "hadithNumber": "949",
                "englishNarrator": "Sahl bin Sa'd al-Sa'idi رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) went to the tribe of Bani Amr bin Auf in order to bring reconciliation amongst (its members), and It was a time of prayer. The Mu'adhdhin came to Abu Bakr رضی ‌اللہ ‌عنہ and said: Would you lead the prayer in case I recite takbir (tahrima, with which the prayer begins)? He (Abu Bakr رضی ‌اللہ ‌عنہ ‌) said: Yes. He (the narrator) said: He (Abu Bakr) started (leading) the prayer. The people were engaged in observing prayer when the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) happened to come there and made his way (through the people) till he stood in a row. The people began to clap (their hands), but Abu Bakr رضی ‌اللہ ‌عنہ ‌paid no heed (to it) in prayer. When the people clapped more vigorously, he (Abu Bakr) then paid heed and saw the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) there. (He was about to withdraw when) the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) signed to him to keep standing at his place. Abu Bakr lifted his hands and praised Allah for what the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had commanded him and then Abu Bakr withdrew himself till he stood in the midst of the row and the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) stepped forward and led the prayer. When (the prayer) was over, he (the Holy Prophet) said: 0 Abu Bakr رضی ‌اللہ ‌عنہ ‌, what prevented you from standing (at that place) as I ordered you to do? Abu Bakr رضی ‌اللہ ‌عنہ ‌said: It does not become the son of Abu Quhafa to lead prayer before the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said (to the people) around him: What is it that I saw you clapping so vigorously? (Behold) when anything happens in prayer, say: Subha Allah, for when you would utter it, it would attract the attention, while clapping of hands is meant for women.",
                "hadithUrdu": "رسول اللہﷺ بنوعمرو بن عوف کے ہاں ، ان کے درمیان صلح کرانے کے لیے تشریف لے گئے ۔ اس دوران میں نماز کا وقت ہو گیا تو مؤذن ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے پاس آیا اور کہا : کیا آپ لوگوں کو نماز پڑھائیں گے تاکہ میں تکبیر کہوں؟ ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : ہاں ۔ انہوں ( سہل بن سعد ) نے کہا : اس طرح ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے نماز شروع کر دی ، اتنے میں رسول اللہ ﷺ تشریف لے آئے جب کہ لوگ نماز میں تھے ، آپ بچ کر گزرتے ہوئے ( پہلی ) صف میں پہنچ کر کھڑے ہو گئے ۔ اس پر لوگوں نے ہاتھوں کو ہاتھوں پر مار کر آواز کرنی شروع کر دی ۔ ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ اپنی نماز میں کسی اور طرف توجہ نہیں دیتے تھے ۔ جب لوگوں نے مسلسل ہاتھوں سے آواز کی تو وہ متوجہ ہوئے اور رسول اللہﷺ کو دیکھا تو رسول اللہﷺ نے انہیں اشارہ کیا کہ اپنی جگہ کھڑے رہیں ، اس پر ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے اپنے دونوں ہاتھ اٹھائے اور اللہ کا شکر ادا کیا کہ رسول اللہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ان کو اس بات کا حکم دیا ، پھر اس کے بعد ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ پیچھے ہٹ کر صف میں صحیح طرح کھڑے ہو گئے اور رسول اللہﷺ آگے بڑھے اور آپ نے نماز پڑھائی ۔ جب آپ فارغ ہوئے تو فرمایا : ’’اے ابو بکر! جب میں نے تمہیں حکم دیا تو اپنی جگہ ٹکے رہنے سے تمہیں کس چیز نے روک دیا؟ ‘ ‘ ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : ابو قحافہ کے بیٹے کے لیے زیبا نہ تھا کہ وہ رسول اللہﷺ کے آگے ( کھڑے ہو کر ) جماعت کرائے ، پھر رسول اللہﷺ نے ( صحابہ کرام ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی طرف متوجہ ہو کر ) فرمایا : ’’ کیا ہوا؟ میں نے تم لوگوں کو دیکھا کہ تم بہت تالیاں بجا رہے تھے؟ جب نماز میں تمہیں کوئی ایسی بات پیش آ جائے ( جس پر توجہ دلانا ضروری ہو ) تو سبحان اللہ کہو ، جب کہو سبحان اللہ کہے گا تواس کی طرف توجہ کی جائے گی ، ہاتھ پر ہاتھ مارنا ، صرف عورتوں کےلیے ہے ۔ ‘ ‘",
                "urduNarrator": "مجھ سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا,امام مالک نے ابو حازم سے اور انہوں نے حضرت سہل بن سعد ساعدی ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ذَهَبَ إِلَى بَنِي عَمْرِو بْنِ عَوْفٍ لِيُصْلِحَ بَيْنَهُمْ فَحَانَتِ الصَّلَاةُ فَجَاءَ الْمُؤَذِّنُ إِلَى أَبِي بَكْرٍ فَقَالَ: أَتُصَلِّي بِالنَّاسِ فَأُقِيمُ؟ قَالَ: نَعَمْ، قَالَ فَصَلَّى أَبُو بَكْرٍ فَجَاءَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَالنَّاسُ فِي الصَّلَاةِ فَتَخَلَّصَ حَتَّى وَقَفَ فِي الصَّفِّ، فَصَفَّقَ النَّاسُ وَكَانَ أَبُو بَكْرٍ لَا يَلْتَفِتُ فِي الصَّلَاةِ، فَلَمَّا أَكْثَرَ النَّاسُ التَّصْفِيقَ الْتَفَتَ فَرَأَى رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَأَشَارَ إِلَيْهِ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنِ امْكُثْ مَكَانَكَ، فَرَفَعَ أَبُو بَكْرٍ يَدَيْهِ فَحَمِدَ اللهَ عَزَّ وَجَلَّ عَلَى مَا أَمَرَهُ بِهِ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنْ ذَلِكَ، ثُمَّ اسْتَأْخَرَ أَبُو بَكْرٍ حَتَّى اسْتَوَى فِي الصَّفِّ، وَتَقَدَّمَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَصَلَّى، ثُمَّ انْصَرَفَ فَقَالَ: «يَا أَبَا بَكْرٍ مَا مَنَعَكَ أَنْ تَثْبُتَ إِذْ أَمَرْتُكَ» قَالَ أَبُو بَكْرٍ: مَا كَانَ لِابْنِ أَبِي قُحَافَةَ أَنْ يُصَلِّيَ بَيْنَ يَدَيْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَا لِي رَأَيْتُكُمْ أَكْثَرْتُمُ التَّصْفِيقَ؟ مَنْ نَابَهُ شَيْءٌ فِي صَلَاتِهِ فَلْيُسَبِّحْ فَإِنَّهُ إِذَا سَبَّحَ الْتُفِتَ إِلَيْهِ وَإِنَّمَا التَّصْفِيحُ لِلنِّسَاءِ.",
                "headingArabic": "تَقْدِيمِ الْجَمَاعَةِ مَنْ يُصَلِّي بِهِمْ إِذَا تَأَخَّرَ الإِمَامُ وَلَمْ يَخَافُوا مَفْسَدَةً بِالتَّقْدِيمِ",
                "headingUrdu": "جماعت کا امامت کے لیے کسی کو مقرر کرنا اگر امام میں تاخیر ہو اور اگر منفی نتائج کا اندیشہ نہ ہو",
                "headingEnglish": "The Congregation Appointing Someone To Lead Them If The Imam Is Delayed And If There Is No Fear Of Negative Repercussions",
                "chapterId": "4",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 104,
                    "chapterNumber": "4",
                    "chapterEnglish": "The Book of Prayers",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصَّلَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 8201,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=328",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=326",
                "label": "326",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=327",
                "label": "327",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=328",
                "label": "328",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=329",
                "label": "329",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=330",
                "label": "330",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=331",
                "label": "331",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=332",
                "label": "332",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=330",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=330",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=328",
        "to": 8225,
        "total": 40465
    }
}