{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 317,
        "data": [
            {
                "id": 8189,
                "hadithNumber": "625",
                "englishNarrator": "Abu Wa'il reported:",
                "hadithEnglish": "Abu Musa رضی ‌اللہ ‌عنہ inflicted extreme rigour upon himself in the matter of urination and urinated in a bottle and said: When the skin of anyone amongst the people of Israel was besmeared with urine, he cut that portion with a cutter. Hudhaifa رضی ‌اللہ ‌عنہ said: I wish that'your friend should not inflict such an extreme rigour. I and the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) were going together till we reached the dumping ground of filth behind an enclosure. He stood up as one among you would stand up. and he urinated, I tried to turn away from him, but he beckoned to me, so I went to him and I stood behind him, till he had relieved himself.",
                "hadithUrdu": "حضرت ابو موسیٰ اشعری ‌رضی ‌اللہ ‌عنہ ‌ ‌ پیشاب کے بارے میں سختی کرتے تھے اور بوتل میں پیشاب کرتے تھے اور کہتے تھے : بنی اسرائیل کے کسی آدمی کی جلد پر پیشاب لگ جاتا تو وہ کھال کے اتنےحصے کو قینچی سے کاٹ ڈالتا تھا ۔ تو حذیفہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نےکہا : میرا دل چاہتا ہے کہ تمہارا صاحب ( استاد ) اس قدر سختی نہ کرے ، میں اور رسول اللہ ﷺساتھ ساتھ چل رہے تھے تو آپ دیوار کے پیچھے کوڑا پھینکنے کی جگہ پرآئے ، آپ اس طرح کھڑےہو گئے جس طرح تم میں سے کوئی کھڑا ہوتا ہے ، پھر آپ پیشاب کرنے لگے تو میں آپ سے دور ہو گیا ، آپ نے مجھے اشارہ کیا تو میں آ گیا اور آپ کے پیچھے کھڑا ہو گیا حتی کہ آپ فارغ ہو گئے ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا ہم سے جریر نے بیان کیا,منصور نے ابو وائل ( شقیق ) سے روایت کی ، انہوں نےکہاکہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، قَالَ: كَانَ أَبُو مُوسَى، يُشَدِّدُ فِي الْبَوْلِ، وَيَبُولُ فِي قَارُورَةٍ وَيَقُولُ: إِنَّ بَنِي إِسْرَائِيلَ كَانَ إِذَا أَصَابَ جِلْدَ أَحَدِهِمْ بَوْلٌ قَرَضَهُ بِالْمَقَارِيضِ، فَقَالَ حُذَيْفَةُ: «لَوَدِدْتُ أَنَّ صَاحِبَكُمْ لَا يُشَدِّدُ هَذَا التَّشْدِيدَ، فَلَقَدْ رَأَيْتُنِي أَنَا وَرَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَتَمَاشَى، فَأَتَى سُبَاطَةً خَلْفَ حَائِطٍ، فَقَامَ كَمَا يَقُومُ أَحَدُكُمْ، فَبَالَ، فَانْتَبَذْتُ مِنْهُ، فَأَشَارَ إِلَيَّ فَجِئْتُ، فَقُمْتُ عِنْدَ عَقِبِهِ حَتَّى فَرَغَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8190,
                "hadithNumber": "626",
                "englishNarrator": "The son of Mughira bin Shu'ba reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) went out for relieving himself. Mughira went with him carrying a jug full of water. When he (the Holy Prophet) came back after relieving himself, he poured water over him and he performed ablution and wiped over his socks; and in the narration of Ibn Rumh there is till instead of when .",
                "hadithUrdu": "‌رسول ‌اللہ ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌اپنے ‌كام ‌كو ‌نكلے ‌ان ‌كی ‌پیچھے ‌مغیرہ ‌پانی ‌كا ‌ڈول ‌لے ‌كر ‌گۓ ‌اور ‌آپ ‌جب ‌حاجت ‌سے ‌فارغ ‌ہوۓ ‌تو ‌پانی ‌ڈالا ‌آپ ‌پر ( ‌یعنی ‌وضو ‌كے ‌وقت ‌ ) پھر ‌وضو ‌كیا ‌اور ‌مسح ‌كیا ‌موزوں ‌پر ‌. ‌ابن ‌رمح ‌كی ‌روایت ‌میں ‌یوں ‌ہے ‌پانی ‌ڈالا ‌آپ ‌پر ‌یہاں ‌تك ‌كہ ‌آپ ‌فارغ ‌ہوےء ‌حاجت ‌سے ( ‌یعنی ‌وضو ‌سے ‌ )",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے لیث ایچ نے بیان کیا، اور ہم سے محمد بن روم بن المہاجر نے بیان کیا، کہا کہ ہم سے لیث نے بیان کیا، وہ یحییٰ بن سعید سے، وہ سعد بن ابراہیم رضی اللہ عنہ سے۔ نافع بن جبیر کی سند، عروہ بن المغیرہ کی سند سے،مغیرہ ‌بن ‌شعبہ ‌سے ‌روایت ‌ہے ‌كہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ ح، وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحِ بْنُ الْمُهَاجِرِ، أَخْبَرَنَا اللَّيْثُ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ نَافِعِ بْنِ جُبَيْرٍ، عَنْ عُرْوَةَ بْنِ الْمُغِيرَةِ، عَنْ أَبِيهِ الْمُغِيرَةِ بْنِ شُعْبَةَ: عَنْ «رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ خَرَجَ لِحَاجَتِهِ فَاتَّبَعَهُ الْمُغِيرَةُ بِإِدَاوَةٍ فِيهَا مَاءٌ فَصَبَّ عَلَيْهِ حِينَ فَرَغَ مِنْ حَاجَتِهِ، فَتَوَضَّأَ وَمَسَحَ عَلَى الْخُفَّيْنِ» وَفِي رِوَايَةِ ابْنِ رُمْحٍ - مَكَانَ حِينَ حَتَّى -.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8191,
                "hadithNumber": "627",
                "englishNarrator": "Mughira bin Shu'ba reported:",
                "hadithEnglish": "I was with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) one night. He came down (from the ride) and relieved himself. He then came and I poured water upon him from the jar that I carried with me. He performed ablution and wiped over his socks.",
                "hadithUrdu": "میں ایک رات رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھا۔ وہ (سواری سے) اتر کر فارغ ہو گیا۔ پھر وہ آیا اور میں نے اس گھڑے سے پانی انڈیل دیا جو میں اپنے ساتھ لایا تھا۔ آپ نے وضو کیا اور اپنے موزوں پر مسح کیا۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ التمیمی نے بیان کیا، کہا ہم سے ابو الاحوص نے اشعث کی سند سے، اسود بن ہلال سے، انہوں نے مغیرہ بن شعبہ کی سند سے، انہوں نے کہا",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، أَخْبَرَنَا أَبُو الْأَحْوَصِ، عَنْ أَشْعَثَ، عَنِ الْأَسْوَدِ بْنِ هِلَالٍ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، قَالَ: «بَيْنَا أَنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ذَاتَ لَيْلَةٍ إِذْ نَزَلَ فَقَضَى حَاجَتَهُ، ثُمَّ جَاءَ فَصَبَبْتُ عَلَيْهِ مِنْ إِدَاوَةٍ كَانَتْ مَعِي، فَتَوَضَّأَ وَمَسَحَ عَلَى خُفَّيْهِ» وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ، سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ بِهَذَا الْإِسْنَادِ وَقَالَ: فَغَسَلَ وَجْهَهُ وَيَدَيْهِ وَمَسَحَ بِرَأْسِهِ ثُمَّ مَسَحَ عَلَى الْخُفَّيْنِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8192,
                "hadithNumber": "628",
                "englishNarrator": "Mughira bin Shu'ba reported:",
                "hadithEnglish": "I was with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) one night. He came down (from the ride) and relieved himself. He then came and I poured water upon him from the jar that I carried with me. He performed ablution and wiped over his socks.",
                "hadithUrdu": "ایک رات میں رسول اللہ ﷺ کے ساتھ تھا جب آپﷺ ( سواری سے ) اترے اورقضائے حاجت کی آپﷺ واپس آئے تو میں نے اس برتن سے جو میر ے پاس تھا ’’پانی ڈالا ‘ ‘ آپﷺ نے وضو کیا اور آپنے موزوں پر مسح کیا ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ التمیمی نے بیان کیا، کہا ہم سے ابو الاحوص نے اشعث کی سند سے بیان کیا,اسود بن ھلال نے حضرت مغیرہ بن شعبہ سے روایت کی ‘ انھو ں نے کہا",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، أَخْبَرَنَا أَبُو الْأَحْوَصِ، عَنْ أَشْعَثَ، عَنِ الْأَسْوَدِ بْنِ هِلَالٍ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، قَالَ: «بَيْنَا أَنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ذَاتَ لَيْلَةٍ إِذْ نَزَلَ فَقَضَى حَاجَتَهُ، ثُمَّ جَاءَ فَصَبَبْتُ عَلَيْهِ مِنْ إِدَاوَةٍ كَانَتْ مَعِي، فَتَوَضَّأَ وَمَسَحَ عَلَى خُفَّيْهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8193,
                "hadithNumber": "629",
                "englishNarrator": "Mughira bin Shu'ba ‌رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "I was in the company of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) on a journey when he said: Mughira take hold of this jar (of water). I took hold of it and I went out with him. (I stopped but) the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) proceeded on till he was out of my sight. He relieved himself and then came back and he was wearing a tight-sleeved Syrian gown. He tried to get his forearms out. but the sleeve of the gown was very narrow, so he brought his hands out from under the gown. I poured water over (his hands) and he performed ablution for prayer, then wiped over his socks and prayed.",
                "hadithUrdu": "میں ایک سفر میں نبی اکرمﷺکے ساتھ تھا ، آپ نے فرمایا : ’’اے مغیرہ !پانی کا برتن لے لو ۔ ‘ ‘ میں نے برتن لے لیا ، پھر آپ کےساتھ نکلا ۔ رسول اللہ ﷺ چل پڑے یہاں تک کہ مجھ سے اوجھل ہو گئے ، قضائے حاجت کی ، پھر آپ واپس آئے ، آپ نے تنگ آستینوں والا شامی جبہ پہنا ہوا تھا ، آپ اس کی آستین سے اپنا ہاتھ نکالنے کی کوشش کرنے لگے ( مگر ) وہ ( جبہ ) تنگ ( ثابت ) ہوا ۔ آپ نے اپنا ہاتھ نیچے سے نکالا ، پھر میں نے پانی ڈالا تو آپ نے نماز جیسا وضو فرمایا ، پھر آپ نے اپنے موزوں پر مسح کیا ، پھر ہمیں نماز پڑھی ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، کہا: ابوبکر,ابو معاویہ نے اعمش سے ، انہوں نے مسلم ( بن صبیح ہمدانی ) سے ، انہوں نے مسروق سے اور انہوں نے حضرت مغیرہ بن شعبہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سےروایت کی ، انہوں نےکہا",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، قَالَ: أَبُو بَكْرٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ مُسْلِمٍ، عَنْ مَسْرُوقٍ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، قَالَ: كُنْتُ مَعَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَقَالَ: «يَا مُغِيرَةُ خُذِ الْإِدَاوَةَ» فَأَخَذْتُهَا، ثُمَّ خَرَجْتُ مَعَهُ، فَانْطَلَقَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حَتَّى تَوَارَى عَنِّي، «فَقَضَى حَاجَتَهُ، ثُمَّ جَاءَ وَعَلَيْهِ جُبَّةٌ شَامِيَّةٌ ضَيِّقَةُ الْكُمَّيْنِ، فَذَهَبَ يُخْرِجُ يَدَهُ مِنْ كُمِّهَا فَضَاقَتْ عَلَيْهِ فَأَخْرَجَ يَدَهُ مِنْ أَسْفَلِهَا، فَصَبَبْتُ عَلَيْهِ فَتَوَضَّأَ وُضُوءَهُ لِلصَّلَاةِ، ثُمَّ مَسَحَ عَلَى خُفَّيْهِ ثُمَّ صَلَّى».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8194,
                "hadithNumber": "630",
                "englishNarrator": "Mughira bin Shu'ba رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) went out for relieving himself. When he came back I brought for him a jar (of water) and poured water upon his hands and He washed his face. He tried to wash his forearms, but as the (sleeves of the) gown were tight. He, therefore, brought them out from under the gown. He then washed them, wiped his head, and wiped his socks and then prayed.",
                "hadithUrdu": "رسول اللہ ﷺ قضائے حاجت کے لیے نکلے ، جب واپس آئے تو میں پانی کا برتن لے کر آپ کو ملا ، میں نے پانی ڈالا ، آپ نے اپنے دونوں ہاتھ دھوئے ، پھر چہرہ دھویا ، پھر ہاتھ دھونے لگے تو جبہ تنگ نکلا ، آپ نے ہاتھ جبے کے نیچے سے نکال لیے ، ان کو دھویا ، سر کا مسح کیا اور اپنے موزوں پرمسح کیا ، پھر ہمیں نماز پڑھائی ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم اور علی بن خشرم نے عیسیٰ بن یونس سے بیان کیا، انہوں نے کہا: ہم سے اسحاق نے بیان کیا,اعمش سے ( ابو معاویہ کےبجائے ) عیسیٰ بن یونس ) نےباقی ماندہ سابقہ سند کے ساتھ حضرت مغیرہ بن شعبہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَلِيُّ بْنُ خَشْرَمٍ، جَمِيعًا عَنْ عِيسَى بْنِ يُونُسَ، قَالَ: إِسْحَاقُ، أَخْبَرَنَا عِيسَى، حَدَّثَنَا الْأَعْمَشُ، عَنْ مُسْلِمٍ، عَنْ مَسْرُوقٍ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، قَالَ: «خَرَجَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِيَقْضِيَ حَاجَتَهُ، فَلَمَّا رَجَعَ تَلَقَّيْتُهُ بِالْإِدَاوَةِ فَصَبَبْتُ عَلَيْهِ، فَغَسَلَ يَدَيْهِ ثُمَّ غَسَلَ وَجْهَهُ، ثُمَّ ذَهَبَ لِيَغْسِلَ ذِرَاعَيْهِ فَضَاقَتِ الْجُبَّةُ، فَأَخْرَجَهُمَا مِنْ تَحْتِ الْجُبَّةِ فَغَسَلَهُمَا، وَمَسَحَ رَأْسَهُ، وَمَسَحَ عَلَى خُفَّيْهِ ثُمَّ صَلَّى بِنَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8195,
                "hadithNumber": "631",
                "englishNarrator": "Urwa bin Mughira reported his father having said:",
                "hadithEnglish": "I was one night with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) on a journey. He said to me: Have you any water with you? I said: Yes. He (the Holy Prophet) came down from his ride and went on till he disappeared in the darkness of night. He then came back and I poured water for him from the jar. He washed his face, He had a woollen gown on him and he could not bring out his forearms from it (i. e. from its sleeves) and consequently he brought them out from under his gown. He washed his forearms, wiped over his head. I then bent down to take off his socks. But he said: Leave them, for my feet were clean when I put them in, and he only wiped over them.",
                "hadithUrdu": "ایک رات میں سفر کےدوران میں نبی اکرم ﷺ کے ساتھ تھا ، آپ نے پوچھا : ’’کیا تمہارے پاس پانی ہے ؟ ‘ ‘ میں نےکہا : جی ہاں ۔ تو آپ اپنی سواری سے اترے ، پھر پیدل چل دیےیہاں تک کہ رات کی سیاہی میں اوجھل ہو گئے ، پھر ( واپس ) آئے تو میں نے برتن سے آپ ( کے ہاتھوں ) پر پانی ڈالا ، آپ نے اپنا چہرہ دھویا ( اس وقت ) آپ اون کا جبہ پہنے ہوئے تھے ، آپ اس میں سے اپنے ہاتھ نہ نکال سکے حتی کہ دونوں ہاتھوں کو جبے کے نیچے سے نکالا اور کہنیوں تک اپنے ہاتھ دھوئے اور اپنے سر کا مسح کیا ، پھر میں نے آپ کے موزے اتارنے چاہے تو آپ نے فرمایا : ’’ان کو چھوڑو ، میں نے باوضو ہو کر دونوں پاؤں ان میں ڈالے تھے ‘ ‘ اور ان پر مسح فرمایا ۔",
                "urduNarrator": "ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا، کہا ہم سے میرے والد نے بیان کیا، کہا ہم سے زکریا نے بیان کیا، عامر سے، انہوں نے کہا,زکریا نےعامر ( شعبی ) سے روایت کی ، کہا : مجھے عروہ بن مغیرہ نے اپنے والد حضرت مغیرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سےحدیث بیان کی ، کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا زَكَرِيَّا، عَنْ عَامِرٍ، قَالَ: أَخْبَرَنِي عُرْوَةُ بْنُ الْمُغِيرَةِ، عَنْ أَبِيهِ، قَالَ: كُنْتُ مَعَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ذَاتَ لَيْلَةٍ فِي مَسِيرٍ، فَقَالَ لِي: «أَمَعَكَ مَاءٌ» قُلْتُ: نَعَمْ «فَنَزَلَ عَنْ رَاحِلَتِهِ، فَمَشَى حَتَّى تَوَارَى فِي سَوَادِ اللَّيْلِ، ثُمَّ جَاءَ فَأَفْرَغْتُ عَلَيْهِ مِنَ الْإِدَاوَةِ، فَغَسَلَ وَجْهَهُ، وَعَلَيْهِ جُبَّةٌ مِنْ صُوفٍ، فَلَمْ يَسْتَطِعْ أَنْ يُخْرِجَ ذِرَاعَيْهِ مِنْهَا حَتَّى أَخْرَجَهُمَا مِنْ أَسْفَلِ الْجُبَّةِ فَغَسَلَ ذِرَاعَيْهِ وَمَسَحَ بِرَأْسِهِ ثُمَّ أَهْوَيْتُ لِأَنْزِعَ خُفَّيْهِ» فَقَالَ: «دَعْهُمَا فَإِنِّي أَدْخَلْتُهُمَا طَاهِرَتَيْنِ وَمَسَحَ عَلَيْهِمَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8196,
                "hadithNumber": "632",
                "englishNarrator": "Urwah al Mughira reported it from his father:",
                "hadithEnglish": "He (Mughira) helped the Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) in performing the ablution, and he performed it and wiped over his shoes. He (Mughira) said to him (about the washing of the feet after putting them off), but he (the Holy Prophet) said: I put them (feet) in when these were clean.",
                "hadithUrdu": "انہوں ( مغیرہ بن شعبہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) نے نبی اکرم ﷺ کو وضو کرایا ، آپ نے وضو کیا اور اپنے موزوں پر مسح کیا ۔ مغیرہ نے آپﷺ سے ( اس بارے میں ) بات کی تو آپ نے فرمایا : ’’میں نے انہیں باوضو حالت میں ( موزوں میں ) داخل کیا تھا ۔ ‘ ‘",
                "urduNarrator": "مجھ سے محمد بن حاتم نے بیان کیا، ہم سے اسحاق بن منصور نے بیان کیا، ہم سے عمر بن ابی زایدہ نے بیان کیا،عامر شعبی کے ایک دوسرے شاگرد عمر بن ابی زائدہ نےعروہ بن مغیرہ کے حوالے سے ان کے والد سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا عُمَرُ بْنُ أَبِي زَائِدَةَ، عَنِ الشَّعْبِيِّ، عَنْ عُرْوَةَ بْنِ الْمُغِيرَةِ، عَنْ أَبِيهِ، أَنَّهُ وَضَّأَ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَتَوَضَّأَ وَمَسَحَ عَلَى خُفَّيْهِ، فَقَالَ لَهُ: فَقَالَ: «إِنِّي أَدْخَلْتُهُمَا طَاهِرَتَيْنِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8197,
                "hadithNumber": "633",
                "englishNarrator": "Urwa bin al Mughira bin Shu'ba reported it on the authority of his father that he said:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) lagged behind (in a journey) and I also lagged behind along with him. After having relieved himself he said: Have you any water with you? I brought to him a jar of water; he washed his palms, and face, and when he tried to get his forearms out (he could not) for the sleeve of the gown was tight. He, therefore, brought them out from under the gown and, throwing it over his shoulders, he washed his forearm. He then wiped his forelock and his turban and his socks. He then mounted and I also mounted (the ride) and came to the people. They had begun the prayer with 'Abd ar-Rabmin bin 'Anf ‌رضی ‌اللہ ‌عنہ ‌leading them and had completed a rak'a. When he perceived the presence of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) he began to retire. He (the Holy Prophet) signed to him to continue and offered prayer along with them. Then when he had pronounced the salutation, the Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) got up and I also got up with him, and we offered the rak'a which had been finished before we came.",
                "hadithUrdu": "رسول اللہ ﷺ ( قافلے سے ) پیچھے رہ گئے اور میں بھی آپ کے ساتھ پیچھے رہ گیا ، جب آپ نے قضائے حاجت کر لی تو فرمایا : ’’کیاتمہارے ساتھ پانی ہے ؟ ‘ ‘ میں آپ کے پاس وضو کرنے کا برتن لایا ، آپ نے اپنے دونوں ہاتھ اور چہرہ دھویا ، پھر دونوں بازو کھولنے لگے تو جبے کی آستین تنگ پڑ گئی ، آپ نے اپنا ہاتھ جبے کے نیچے سے نکالا اور جبہ کندھوں پر ڈال لیا ، اپنے دونوں بازودھوئے اور اپنے سر کے اگلے حصے ، پگڑی اور موزوں پر مسح کیا ، پھر آپ سوار ہوئے اور میں ( بھی ) سوار ہوا ، ہم لوگوں کے پاس پہنچے تووہ نماز کے لیے کھڑے تھے ، عبد الرحمن بن عوف ‌رضی ‌اللہ ‌عنہ ‌ ‌ ان کو نماز پڑھا رہے تھے اور ایک رکعت پڑھا چکے تھے ۔ جب انہیں نبی اکرمﷺ ( کی تشریف آوری ) کا احساس ہوا تو پیچھے ہٹنے لگے ۔ آپ نے انہیں اشارہ کیا ( کہ نماز پوری کرو ) تو انہوں نے نماز پڑھا دی ، جب انہوں نے سلام پھیرا تو نبی اکرمﷺ کھڑے ہو گئے ، میں بھی کھڑا ہو گیا اور ہم نے وہ رکعت پڑھی جوہم سے پہلے ہو چکی تھی ۔",
                "urduNarrator": "مجھ سے محمد بن عبداللہ بن باز نے بیان کیا، ہم سے یزید نے بیان کیا، یعنی ابن زری نے,حمید الطویل نے کہا : ہمیں بکر بن عبد اللہ مزنی نے حدیث بیان کی ، انہوں نے عروہ بن مغیرہ بن شعبہ سے ، انہوں نے اپنے والد سے روایت کی ، انہوں نےکہا کہ",
                "hadithArabic": "وَحَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ بَزِيعٍ، حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ، حَدَّثَنَا حُمَيْدٌ الطَّوِيلُ، حَدَّثَنَا بَكْرُ بْنُ عَبْدِ اللهِ الْمُزَنِيُّ، عَنْ عُرْوَةَ بْنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، عَنْ أَبِيهِ، قَالَ: تَخَلَّفَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَتَخَلَّفْتُ مَعَهُ فَلَمَّا قَضَى حَاجَتَهُ قَالَ: «أَمَعَكَ مَاءٌ؟» فَأَتَيْتُهُ بِمِطْهَرَةٍ، «فَغَسَلَ كَفَّيْهِ وَوَجْهَهُ، ثُمَّ ذَهَبَ يَحْسِرُ عَنْ ذِرَاعَيْهِ فَضَاقَ كُمُّ الْجُبَّةِ، فَأَخْرَجَ يَدَهُ مِنْ تَحْتِ الْجُبَّةِ، وَأَلْقَى الْجُبَّةَ عَلَى مَنْكِبَيْهِ، وَغَسَلَ ذِرَاعَيْهِ، وَمَسَحَ بِنَاصِيَتِهِ وَعَلَى الْعِمَامَةِ وَعَلَى خُفَّيْهِ، ثُمَّ رَكِبَ وَرَكِبْتُ فَانْتَهَيْنَا إِلَى الْقَوْمِ، وَقَدْ قَامُوا فِي الصَّلَاةِ، يُصَلِّي بِهِمْ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ وَقَدْ رَكَعَ بِهِمْ رَكْعَةً، فَلَمَّا أَحَسَّ بِالنَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ذَهَبَ يَتَأَخَّرُ، فَأَوْمَأَ إِلَيْهِ، فَصَلَّى بِهِمْ، فَلَمَّا سَلَّمَ قَامَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَقُمْتُ، فَرَكَعْنَا الرَّكْعَةَ الَّتِي سَبَقَتْنَا».",
                "headingArabic": "الْمَسْحِ عَلَى النَّاصِيَةِ وَالْعِمَامَةِ ‏‏",
                "headingUrdu": "پیشانی اور امامت پر مسح کرنا",
                "headingEnglish": "Wiping over the forehead and the imamah",
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8198,
                "hadithNumber": "634",
                "englishNarrator": "Ibn Mughira رضی ‌اللہ ‌عنہ narrated it from his father:",
                "hadithEnglish": "The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) wiped over his socks and over his forehead and over his turban.",
                "hadithUrdu": "نبی اکرمﷺنے موزوں ، اپنے سر کے سامنے کے حصے اور اپنے عمامے پر مسح فرمایا ۔",
                "urduNarrator": "امیہ بن بسطام اور محمد بن عبد الاعلیٰ نے کہا , ہمیں معتمر نے اپنے والد سے حدیث سنائی ، کہا : مجھے بکر بن عبد اللہ نے حضرت مغیرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے بیٹے کے واسطے سے حضرت مغیرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے حدیث بیان کی کہ",
                "hadithArabic": "حَدَّثَنَا أُمَيَّةُ بْنُ بِسْطَامَ، وَمُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى، قَالَا: حَدَّثَنَا الْمُعْتَمِرُ، عَنْ أَبِيهِ، قَالَ: حَدَّثَنِي بَكْرُ بْنُ عَبْدِ اللهِ، عَنْ ابْنِ الْمُغِيرَةِ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَسَحَ عَلَى الْخُفَّيْنِ، وَمُقَدَّمِ رَأْسِهِ وَعَلَى عِمَامَتِهِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8199,
                "hadithNumber": "635",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been transmitted by Ibn Mughira on the authority of his father by another chain of transmitters.",
                "hadithUrdu": "محمد بن عبدالاعلیٰ نے کہا : ہمیں معتمر نے اپنے والد سے حدیث سنائی ، انہوں نے بکر سے ، انہوں نے حسن سے ، انہوں نےحضرت مغیرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے بیٹے سے ، انہوں نے اپنے والد سے اور انہوں نے نبیﷺ سےیہی روایت بیان کی ۔ ( بکر نے عروہ بن مغیرہ سے حسن کے حوالے سے بھی یہ روایت حاصل کی اور براہ راست بھی سنی ۔ )",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى، حَدَّثَنَا الْمُعْتَمِرُ، عَنْ أَبِيهِ، عَنْ بَكْرٍ، عَنِ الْحَسَنِ، عَنِ ابْنِ الْمُغِيرَةِ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8200,
                "hadithNumber": "636",
                "englishNarrator": "Bakr reported:",
                "hadithEnglish": "He had heard from the son of Mughira رضی ‌اللہ ‌عنہ that verily the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) performed ablution and wiped over his forehead and wiped over his turban and over his socks.",
                "hadithUrdu": "میں نے مغیرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے بیٹے ( بلاواسطہ بھی ) سنا ) کہ نبی کریم ﷺ نے وضو کیا اور اپنے سر کے اگلے حصے پر اور پگڑی پر اور موزوں پر مسح کیا ۔",
                "urduNarrator": "یحییٰ بن سعید نے ( سلیمان ) تیمی سے ، انہوں نے بکر بن عبد اللہ سے ، انہوں نے حسن سے ، انہوں نے مغیرہ بن شعبہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے بیٹے سے ، انہوں نے اپنے والد سے روایت کی ( بکر نےکہا",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، وَمُحَمَّدُ بْنُ حَاتِمٍ، جَمِيعًا عَنْ يَحْيَى الْقَطَّانِ، قَالَ: ابْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنِ التَّيْمِيِّ، عَنْ بَكْرِ بْنِ عَبْدِ اللهِ، عَنِ الْحَسَنِ، عَنِ ابْنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، عَنْ أَبِيهِ، قَالَ: بَكْرٌ، وَقَدْ سَمِعْتَ مِنَ ابْنِ الْمُغِيرَةِ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «تَوَضَّأَ فَمَسَحَ بِنَاصِيَتِهِ، وَعَلَى الْعِمَامَةِ وَعَلَى الْخُفَّيْنِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8201,
                "hadithNumber": "637",
                "englishNarrator": "",
                "hadithEnglish": "It is narrated from Bilal that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) wiped over the socks and turban, and in the hadith transmitted by 'Isa b. Yaunus the words are: Bilal narrated it to me. This tradition is transmitted by A'mash with this addition;, I saw the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ).",
                "hadithUrdu": "ابو معاویہ اور عیسیٰ بن یونس نے اعمش سے ، انہوں نے حکم سے ، انہوں نے عبد الرحمن بن ابی لیلیٰ سے ، انہوں نے کعب بن عجرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انہوں نے حضرت بلال ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ رسول اللہ ﷺنے موزوں پر اور سر ڈھانپنے والے کپڑے پر مسح کیا ۔ عیسیٰ کی حدیث میں ’’حکم سے ( روایات کی ) ‘ ‘ اور ’’بلال سے روایت کی ‘ ‘ کے بجائے مجھے حکم نے حدیث سنائی اور مجھے بلال نےحدیث سنائی ‘ ‘ کے الفاظ ہیں ۔",
                "urduNarrator": "",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ الْعَلَاءِ، قَالَا: حَدَّثَنَا أَبُو مُعَاوِيَةَ ح، وَحَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، كِلَاهُمَا عَنِ الْأَعْمَشِ، عَنِ الْحَكَمِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ كَعْبِ بْنِ عُجْرَةَ، عَنْ بِلَالٍ: «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مَسَحَ عَلَى الْخُفَّيْنِ وَالْخِمَارِ». وَفِي حَدِيثِ عِيسَى، حَدَّثَنِي الْحَكَمُ، حَدَّثَنِي بِلَالٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8202,
                "hadithNumber": "638",
                "englishNarrator": null,
                "hadithEnglish": "It was narrated from Al Amash with this chain. And he said in the Hadith: \"I saw the Messenger of Allah ﷺ...\"",
                "hadithUrdu": "اور یہی روایت مجھ ( امام مسلم ) کو سوید بن سعید نے علی بن مسہر سے اور انہو ں نے اعمش سے مذکورہ بالا سند کے ساتھ بیان کی ۔ اس میں إن رسول اللهﷺ ( یقیناً رسول اللہ ﷺنے ) کے بجائےرأيت رسول الله ﷺ ( میں نے رسول اللہ ﷺ کو دیکھا ) کے الفاظ ہیں ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنِيهِ سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا عَلِيٌّ يَعْنِي ابْنَ مُسْهِرٍ، عَنِ الْأَعْمَشِ، بِهَذَا الْإِسْنَادِ وَقَالَ فِي الْحَدِيثِ: رَأَيْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8203,
                "hadithNumber": "639",
                "englishNarrator": "Shuraih bin Hani said:",
                "hadithEnglish": "I came to 'A'isha to ask her about wiping over the socks. She said: You better ask ('Ali) son of Abu Talib for he used to travel with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). We asked him and he said: The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) stipulated (the upper limit) of three days and three nights for a traveller and one day and one night for the resident.",
                "hadithUrdu": "میں حضرت عائشہ ؓ کے پاس موزوں پر مسح کے بارے میں پوچھنے کی غرض سے حاضر ہوا تو انہوں نے کہا : ابن ابی طالب کے پاس جاؤ اور ان سے پوچھو کیونکہ وہ رسول اللہ ﷺ کے ساتھ سفر کیا کرتے تھے ۔ ہم نے ان سے پوچھا تو انہوں نے کہا : رسول اللہ ﷺ نے مسافر کے لیے تین دن اور تین راتیں اور مقیم کے لیے ایک دن اور ایک رات ( کا وقت ) مقرر فرمایا ۔ ( عبدالر زاق نے ) کہا : سفیان ( ثوری ) جب بھی عمرو ( بن قیس ملائی ) کا تذکرہ کرتے تو ان کی تعریف کرتے ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم الحنثلی نے بیان کیا,عبد الرزاق نے کہا : ہمیں سفیان ثوری نے عمرو بن قیس ملائی سے حدیث سنای ، انہوں نےحکم بن عتیبہ سے ، انہوں نے قاسم بن مخیمرہ سے ، انہوں نے شریح بن ہانی سےروایت کی ، انہوں نے کہا",
                "hadithArabic": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا الثَّوْرِيُّ، عَنْ عَمْرِو بْنِ قَيْسٍ الْمُلَائِيِّ، عَنِ الْحَكَمِ بْنِ عُتَيْبَةَ، عَنِ الْقَاسِمِ بْنِ مُخَيْمِرَةَ، عَنْ شُرَيْحِ بْنِ هَانِئٍ، قَالَ: أَتَيْتُ عَائِشَةَ أَسْأَلُهَا عَنِ الْمَسْحِ عَلَى الْخُفَّيْنِ، فَقَالَتْ: عَلَيْكَ بِابْنِ أَبِي طَالِبٍ، فَسَلْهُ فَإِنَّهُ كَانَ يُسَافِرُ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَسَأَلْنَاهُ فَقَالَ: «جَعَلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ثَلَاثَةَ أَيَّامٍ وَلَيَالِيَهُنَّ لِلْمُسَافِرِ، وَيَوْمًا وَلَيْلَةً لِلْمُقِيمِ» قَالَ: وَكَانَ سُفْيَانُ، إِذَا ذَكَرَ عَمْرًا، أَثْنَى عَلَيْهِ.",
                "headingArabic": "التَّوْقِيتِ فِي الْمَسْحِ عَلَى الْخُفَّيْنِ ‏‏",
                "headingUrdu": "خفیف پر مسح کرنے کے لیے وقت کی حد",
                "headingEnglish": "Time-limit for wiping over the khuff",
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8204,
                "hadithNumber": "640",
                "englishNarrator": null,
                "hadithEnglish": "This hadith is narrated by Ubaidullah bin 'Amr and Zaid bin Abu Unaisa with the same chain of transmitters.",
                "hadithUrdu": "ہم سے اسحاق نے بیان کیا، کہا ہم سے زکریا بن عدی نے بیان کیا، وہ عبید اللہ بن عمرو کی سند سے,زید بن ابی انیسہ نے حکم سے مذکورہ سند کے ساتھ اس ( سابقہ حدیث ) کے مانند حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا زَكَرِيَّا بْنُ عَدِيٍّ، عَنْ عُبَيْدِ اللهِ بْنِ عَمْرٍو، عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ، عَنِ الْحَكَمِ، بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8205,
                "hadithNumber": "641",
                "englishNarrator": "Shuraib bin Hani reported:",
                "hadithEnglish": "I asked 'A'isha about wiping over the shoes. She said: You better go to 'Ali, for he knows more about this than I. I, therefore, came to 'Ali رضی ‌اللہ ‌عنہ ‌and he narrated from the Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) like this.",
                "hadithUrdu": "میں نےحضرت عائشہ ؓ سے موزوں پر مسح کا مسئلہ پوچھا تو انہوں نے کہا : علی ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے پاس جاؤ کیونکہ وہ اس مسئلے کو مجھ سے زیادہ جانتے ہیں ۔ تو میں علی ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی خدمت میں حاضر ہوا ، انہوں نے نبی اکرمﷺ سے اسی ( جواوپر مذکورہے ) کے مطابق بیان کیا ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے ابو معاویہ نے بیان کیا,اعمش نے حکم کے حوالے سے قاسم بن مغیرہ سے اور انہوں نے شریح بن ہانی سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنِ الْحَكَمِ، عَنِ الْقَاسِمِ بْنِ مُخَيْمِرَةَ، عَنْ شُرَيْحِ بْنِ هَانِئٍ، قَالَ سَأَلْتُ عائشةَ، عَنِ الْمَسْحِ عَلَى الْخُفَّيْنِ، فَقَالَتْ: ائْتِ عَلِيًّا فَإِنَّهُ أَعْلَمُ بِذَلِكَ مِنِّي فَأَتَيْتُ عَلِيًّا فَذَكَرَ عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8206,
                "hadithNumber": "642",
                "englishNarrator": "Sulaiman bin Buraida narrated it from his father:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) offered prayers with one ablution on the day of the Conquest (of Mecca) and wiped over the socks. 'Umar رضی ‌اللہ ‌عنہ ‌said to him: You have today done something that you have not been accustomed to before. He (the Holy Prophet) said: 0 'Umar, I have done that on purpose.",
                "hadithUrdu": "نبی اکرم ﷺ نے فتح مکہ کے دن کئی نمازیں ایک وضو سے پڑھیں اوراپنے موزوں پر مسح فرمایا ۔ حضرت عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے آپ سے پوچھا : آپ نے آج ایسا کام کیا جو آپ نے پہلے کبھی نہیں کیا ۔ آپ نے جواب دیا : ’’عمر!میں نے عمداً ایسا کیا ہے ۔ ‘ ‘",
                "urduNarrator": "ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا، کہا ہم سے میرے والد نے بیان کیا، کہا ہم سے سفیان نے بیان کیا، ان سے علقمہ بن مرثد نے اور مجھ سے محمد بن حاتم نے بیان کیا، اور تلفظ کی حد ہے ہم سے یحییٰ بن سعید نے بیان کیا، انہوں نے سفیان سے۔ انہوں نے کہا: مجھ سے علقمہ بن مرثد نے بیان کیا,سلیمان بن بریدہ ( اسلمی ) نے اپنے والد سے روایت کی",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا سُفْيَانُ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ ح، وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، وَاللَّفْظُ لَهُ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ سُفْيَانَ، قَالَ: حَدَّثَنِي عَلْقَمَةُ بْنُ مَرْثَدٍ، عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «صَلَّى الصَّلَوَاتِ يَوْمَ الْفَتْحِ بِوُضُوءٍ وَاحِدٍ، وَمَسَحَ عَلَى خُفَّيْهِ» فَقَالَ لَهُ عُمَرُ: لَقَدْ صَنَعْتَ الْيَوْمَ شَيْئًا لَمْ تَكُنْ تَصْنَعُهُ، قَالَ: «عَمْدًا صَنَعْتُهُ يَا عُمَرُ».",
                "headingArabic": "جَوَازِ الصَّلَوَاتِ كُلِّهَا بِوُضُوءٍ وَاحِدٍ ‏‏",
                "headingUrdu": "ایک وضو سے تمام نمازیں پڑھنے کی اجازت",
                "headingEnglish": "The permissibility of performing all the prayers with one wudu’",
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8207,
                "hadithNumber": "643",
                "englishNarrator": "Abu Huraira رضی ‌اللہ ‌عنہ ‌said:",
                "hadithEnglish": "The prophet ﷺ said: When anyone amongst you wakes up from sleep, he must not put his hand in the utensil till he has washed it three times, for he does not know where his hand was during the night.",
                "hadithUrdu": "نبی اکرمﷺ نے فرمایا : ’’جب تم میں سے کوئی اپنی نیند سے بیدار ہو تو اس وقت تک اپنا ہاتھ برتن میں نہ ڈالے جب تک اسے تین دفعہ دھو نہ لے کیونکہ اسے معلوم نہیں ہے کہ رات کے وقت اس کا ہاتھ کہاں ( کہاں ) رہا ۔ ‘ ‘",
                "urduNarrator": "ہم سے نصر بن علی الجہضَمی اور حمید بن عمر البکراوی نے بیان کیا، کہا: ہم سے بشر بن المفضل نے خالد رضی اللہ عنہ سے بیان کیا،عبد اللہ بن شقیق نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، وَحَامِدُ بْنُ عُمَرَ الْبَكْرَاوِيُّ، قَالَا: حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، عَنْ خَالِدٍ، عَنْ عَبْدِ اللهِ بْنِ شَقِيقٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا اسْتَيْقَظَ أَحَدُكُمْ مِنْ نَوْمِهِ، فَلَا يَغْمِسْ يَدَهُ فِي الْإِنَاءِ حَتَّى يَغْسِلَهَا ثَلَاثًا، فَإِنَّهُ لَا يَدْرِي أَيْنَ بَاتَتْ يَدُهُ».",
                "headingArabic": "كَرَاهَةِ غَمْسِ الْمُتَوَضِّئِ وَغَيْرِهِ يَدَهُ الْمَشْكُوكَ فِي نَجَاسَتِهَا فِي الإِنَاءِ قَبْلَ غَسْلِهَا ثَلاَثًا",
                "headingUrdu": "جو شخص وضو کرنا چاہتا ہو اور دوسرے کے لیے یہ ناپسندیدہ ہے کہ وہ برتن (پانی والے) میں تین بار دھونے سے پہلے ہاتھ ڈالے، اگر اسے یقین نہ ہو کہ اس کے ہاتھ میں نجس چیز ہے یا نہیں۔",
                "headingEnglish": "It is disliked for the person who wants to perform wudu’, and others, to put his hand in the vessel (containing water) before washing it three times, if he is not sure whether something impure is on his hands or not",
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8208,
                "hadithNumber": "644",
                "englishNarrator": null,
                "hadithEnglish": "This hadith is transmitted from Abu Huraira رضی ‌اللہ ‌عنہ ‌by another chain of transmitters.",
                "hadithUrdu": "ہم سے ابو کریب اور ابو سعید اشج نے بیان کیا، کہا:وکیع اور ابو معاویہ کی سندوں سے اعمش سے روایت ہے ، انہوں نے ابو رزین اور ابو صالح سے اور ان دونوں نے حضرت ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سےروایت بیان کی ۔ ابو معاویہ کی روایت میں ہے : ( ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ) کہا : رسول اللہ ﷺ نے فرمایا ۔ ( جبکہ ) وکیع کی روایت میں ( ہے ) کہا : ( اور ) اسے رسول اللہ ﷺ کی طرف منسوب کیا ۔ ( آگے ) اسی ( سابقہ روایت ) کی طرح ہے ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا أَبُو كُرَيْبٍ، وَأَبُو سَعِيدٍ الْأَشَجُّ، قَالَا: حَدَّثَنَا وَكِيعٌ، ح، وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، كِلَاهُمَا عَنِ الْأَعْمَشِ، عَنْ أَبِي رَزِينٍ، وَأَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، فِي حَدِيثِ أَبِي مُعَاوِيَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَفِي حَدِيثِ وَكِيعٍ، قَالَ: يَرْفَعُهُ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8209,
                "hadithNumber": "645",
                "englishNarrator": null,
                "hadithEnglish": "Zahri and Ibn Musayyab have both transmitted a hadith like this from Abu Huraira رضی ‌اللہ ‌عنہ who narrated it from the Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ).",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ، عمرو النقید اور زہیر بن حرب نے بیان کیا، کہا کہ ہم سے سفیان بن عیینہ نے زہری کی سند سے بیان کیا,ابوسلمہ نے ابن مسیب دونوں نے ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے نبی ﷺ سے اسی ( مذکورہ بالاروایت ) کے مانند بیان کیا.",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالُوا: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ ح، وَحَدَّثَنِيهِ مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنِ ابْنِ الْمُسَيِّبِ، كِلَاهُمَا عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8210,
                "hadithNumber": "646",
                "englishNarrator": "Abu Huraira رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: When anyone amongst you wakes up from sleep, he should wash his hands three times before putting it in the utensil, for he does not know where his hand was during the night.",
                "hadithUrdu": "نبی کریم ﷺ نے فرمایا : ’’جب تم میں سے کوئی شخص نیند سے بیدار ہو تو ( وضو کاپانی نکالنے کے لیے ) اپنے برتن میں ہاتھ ڈالنے سے پہلے تین بار اپنے ہاتھ پر پانی ڈالے ( اور ہاتھ دھوئے ) کیونکہ وہ نہیں جانتا اس کے ہاتھ نے کس ( حالت ) میں رات گزاری ۔ ‘ ‘",
                "urduNarrator": "مجھ سے سلمہ بن شبیب نے بیان کیا، انہوں نے کہا: ہم سے حسن بن عیان نے بیان کیا، ہم سے معقل نے بیان کیا، ابو الزبیر رضی اللہ عنہ سے,جابر ( بن عبد اللہ ) ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ انہوں ( ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) نے ان ( جابر ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) کو بتایا کہ",
                "hadithArabic": "وَحَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، قَالَ: حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ أَخْبَرَهُ أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا اسْتَيْقَظَ أَحَدُكُمْ فَلْيُفْرِغْ عَلَى يَدِهِ ثَلَاثَ مَرَّاتٍ قَبْلَ أَنْ يُدْخِلَ يَدَهُ فِي إِنَائِهِ، فَإِنَّهُ لَا يَدْرِي فِيمَ بَاتَتْ يَدُهُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8211,
                "hadithNumber": "647",
                "englishNarrator": "This hadith has been transmitted through other chains of transmitters on the authority of Abu Huraira رضی ‌اللہ ‌عنہ in which it is reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) made a mention of washing the hand, and did not instruct to wash it three times. But the hadith narrated from Jabir ‌رضی ‌اللہ ‌عنہ ‌and Ibn Musayyab. Abu Salama, and Abdullah bin Shaqiq, Abu Salih, Abla Razin, there is a mention of three times .",
                "hadithUrdu": "سبھی نے اپنی ا پنی روایت میں ( ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے واسطے سے ) نبی ﷺ سے یہ حدیث بیان کی ۔ سبھی کہتے ہیں : ’’ حتی کہ اس ( ہاتھ ) کو دھولے ‘ ‘ اور ان میں سے کسی نے بھی ’’تین بار ‘ ‘ کا لفظ نہیں بولا ، سوائے ان روایات کے جو ہم نے اوپر جابر ‌رضی ‌اللہ ‌عنہ ‌ ‌ ، ابن مسیب ، ابو سلمہ ، عبد اللہ بن شقیق ، ابوصالح اور ابو زرین سے بیان کی ہیں کیونکہ ان سب کی احادیث میں ’’تین بار ‘ ‘ کا ذکر ہے ۔",
                "urduNarrator": "اعرج ، محمد ، علاء کے والد عبد الرحمان بن یعقوب ، ہمام بن منبہ اور ثابت بن عیاض ( سب ) نےکہا : ہمیں ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نےحدیث بیان کی ،",
                "hadithArabic": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا الْمُغِيرَةُ يَعْنِي الْحِزَامِيَّ، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، وَحَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، حَدَّثَنَا عَبْدُ الْأَعْلَى، عَنْ هِشَامٍ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ، ح، وَحَدَّثَنِي أَبُو كُرَيْبٍ، حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ مَخْلَدٍ، عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ، عَنِ الْعَلَاءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، ح، وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ، ح، وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، ح، وَحَدَّثَنَا الْحُلْوَانِيُّ، وَابْنُ رَافِعٍ قَالَا: حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَا جَمِيعًا: أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي زِيَادٌ، أَنَّ ثَابِتًا، مَوْلَى عَبْدِ الرَّحْمَنِ بْنِ زَيْدٍ، أَخْبَرَهُ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ فِي رِوَايَتِهِمْ جَمِيعًا عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْحَدِيثِ كُلُّهُمْ يَقُولُ حَتَّى يَغْسِلَهَا، وَلَمْ يَقُلْ وَاحِدٌ مِنْهُمْ ثَلَاثًا إِلَّا مَا قَدَّمْنَا مِنْ رِوَايَةِ جَابِرٍ، وَابْنِ الْمُسَيَّبِ، وَأَبِي سَلَمَةَ، وَعَبْدِ اللهِ بْنِ شَقِيقٍ، وَأَبِي صَالِحٍ، وَأَبِي رَزِينٍ فَإِنَّ فِي حَدِيثِهِمْ ذِكْرَ الثَّلَاثِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8212,
                "hadithNumber": "648",
                "englishNarrator": "Abu Huraira رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) to have said: When a dog licks a utensil belonging to any one of you, (the thing contained in it) should be thrown away and then (the utensil) should be washed seven times.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’ جب تم میں سے کسی کے برتن میں کتا زبان کے ساتھ پی لے اور وہ اس چیز کو بہا دے ، پھربرتن کو سات دفعہ دھولے ۔ ‘ ‘",
                "urduNarrator": "مجھ سے علی بن حجر السعدی نے بیان کیا,علی بن مسہر نے حدیث بیان کی کہ ہمیں اعمش نے ابو زرین اور ابو صالح سے خبر دی ، ان دونوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": ") وَحَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، أَخْبَرَنَا الْأَعْمَشُ، عَنْ أَبِي رَزِينٍ، وَأَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا وَلَغَ الْكَلْبُ فِي إِنَاءِ أَحَدِكُمْ فَلْيُرِقْهُ ثُمَّ لِيَغْسِلْهُ سَبْعَ مِرَارٍ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 8213,
                "hadithNumber": "649",
                "englishNarrator": null,
                "hadithEnglish": "A similar report was narrated from Al Amash with this chain but he did not say: \" Let him through away the content.\"",
                "hadithUrdu": "محمد بن الصباح نے مجھ سے کہا,اسماعیل بن زکریا نے اعمش کےحوالے سے ، باقی ماندہ مذکورہ سند کے ساتھ ، یہی روایت بیان کی لیکن ’’اسے بہادے ‘ ‘ کے الفاظ نہیں کہے ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنِي مُحَمَّدُ بْنُ الصَّبَّاحِ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ زَكَرِيَّا، عَنِ الْأَعْمَشِ، بِهَذَا الْإِسْنَادِ مِثْلَهُ وَلَمْ يَقُلْ فَلْيُرِقْهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 102,
                    "chapterNumber": "2",
                    "chapterEnglish": "The Book of Purification",
                    "chapterUrdu": "پاکی کا بیان",
                    "chapterArabic": "كتاب الطَّهَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 7901,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=316",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=314",
                "label": "314",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=315",
                "label": "315",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=316",
                "label": "316",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=317",
                "label": "317",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=318",
                "label": "318",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=319",
                "label": "319",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=320",
                "label": "320",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=318",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=318",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=316",
        "to": 7925,
        "total": 40465
    }
}