{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 421,
        "data": [
            {
                "id": 10789,
                "hadithNumber": "3225",
                "englishNarrator": "A'isha (رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "We feared that Safiyyah might have entered the period of menses before performing Tawaf Ifada. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) came to us and said: Is Safiyyah going to detain us? Thereupon we said: She has performed Tawaf Ifada. He (the Holy Prophet) said: Then there is no detention (for us) now.",
                "hadithUrdu": "ہم ڈر رہی تھیں کہ حضرت صفیہ رضی اللہ تعالیٰ عنہا طواف افاضہ کرنے سے پہلے حائضہ نہ ہو جا ئیں ۔ کہا رسول اللہ صلی اللہ علیہ وسلم ہمارے پاس تشریف لا ئے اور فر ما یا : \" کیا صفیہ ہمیں روکنے والی ہیں ؟ہم نے عرض کی وہ طواف افاضہ کر چکی ہیں آپ نے فر ما یا تو پھر نہیں روکیں گی ۔ )",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ بن قعنب نے بیان کیا، انہوں نے ہم سے بیان کیا افلح نے ہمیں قاسم بن محمد سے حدیث بیان کی انھوں نے حجرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا عَبْدُ اللهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا أَفْلَح، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، قَالَتْ: كُنَّا نَتَخَوَّفُ أَنْ تَحِيضَ صَفِيَّةُ قَبْلَ أَنْ تُفِيضَ، قَالَتْ: فَجَاءَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «أَحَابِسَتُنَا صَفِيَّةُ؟» قُلْنَا: قَدْ أَفَاضَتْ، قَالَ: «فَلَا إِذَنْ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10790,
                "hadithNumber": "3226",
                "englishNarrator": "A'isha (رضی اللہ تعالیٰ عنہا) said to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌):",
                "hadithEnglish": "O Messenger of Allah ﷺ, Safiyyah bint Huyayy رضی اللہ تعالیٰ عنہا has entered the state of menses, whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Perhaps she is going to detain us. Has she not circumambulated the House along with you (i.e. whether she has not performed Tawaf Ifada)? They said: Yes. He said: Then they should set out.",
                "hadithUrdu": "اے اللہ کے رسول اللہ صلی اللہ علیہ وسلم !صفیہ بنت حیی رضی اللہ تعالیٰ عنہا حائضہ ہو گئی ہیں تو رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" شاید ہمیں ( واپسی سے ) روک لیں گی کیا نھوں نے تمھا رے ساتھ بیت اللہ کا طواف ( طواف افاضہ ) نہیں کیا ؟ انھوں نے کہا کیوں نہیں آپ نے فر ما یا تو پھر کو چ کرو ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے مالک رضی اللہ عنہ سے، عبداللہ بن ابی بکر رضی اللہ عنہ سے، ان کے والد کی سند سے، انہوں نے کہا عمرہ بنت عبد الرحمٰن رضی اللہ تعالیٰ عنہا نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے عرض کی",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ عَبْدِ اللهِ بْنِ أَبِي بَكْرٍ، عَنْ أَبِيهِ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ لِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: يَا رَسُولَ اللهِ، إِنَّ صَفِيَّةَ بِنْتَ حُيَيٍّ قَدْ حَاضَتْ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَعَلَّهَا تَحْبِسُنَا. أَلَمْ تَكُنْ قَدْ طَافَتْ مَعَكُنَّ بِالْبَيْتِ؟» قَالُوا: بَلَى، قَالَ: «فَاخْرُجْنَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10791,
                "hadithNumber": "3227",
                "englishNarrator": "A'isha ( رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) inclined to do with Safiyyah what a man feels inclined to do with his wife. They said: Messenger of Allah, she has entered the state of menses, whereupon he said: (Well) she is going to detain us. They (his wives) said: Messenger of Allah, she performed Tawaf Ziyara (Tawaf Ifada) on the Day of Nahr. Thereupon he said: Then she should proceed along with you",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے حضرت صفیہ رضی اللہ تعالیٰ عنہا سے ایسا کو ئی کا م چا ہا جو ایک آدمی اپنی بیوی سے چا ہتا ہے تو سب ( ازواج ) نے کہا : اے اللہ کے رسول اللہ صلی اللہ علیہ وسلم !وہ حائضہ ہیں آپ نے فر ما یا : \" تو ( کیا ) یہ ہمیں ( کو چ ) کرنے سے ) روکنے والی ہیں ؟ انھوں نے کہا : اے اللہ کے رسول اللہ صلی اللہ علیہ وسلم !انھوں نے قر بانی کے دن طواف زیارت ( طواف افاضہ ) کر لیا تھا آپ نے فر ما یا : \" تو وہ بھی تمھارے ساتھ کو چ کر یں ۔",
                "urduNarrator": "مجھ سے الحکم بن موسیٰ نے بیان کیا، مجھ سے یحییٰ بن حمزہ نے بیان کیا، اوزاعی کی سند سے، شاید انہوں نے کہا: یحییٰ بن ابی کثیر کی سند سے، محمد بن کی سند سے۔ ابراہیم التیمی، کے بارے میں , ابو سلمہ حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي الْحَكَمُ بْنُ مُوسَى، حَدَّثَنِي يَحْيَى بْنُ حَمْزَةَ، عَنِ الْأَوْزَاعِيِّ، لَعَلَّهُ قَالَ: عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ التَّيْمِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَرَادَ مِنْ صَفِيَّةَ بَعْضَ مَا يُرِيدُ الرَّجُلُ مِنْ أَهْلِهِ، فَقَالُوا: إِنَّهَا حَائِضٌ، يَا رَسُولَ اللهِ، قَالَ: «وَإِنَّهَا لَحَابِسَتُنَا؟» فَقَالُوا: يَا رَسُولَ اللهِ، إِنَّهَا قَدْ زَارَتْ يَوْمَ النَّحْرِ، قَالَ: «فَلْتَنْفِرْ مَعَكُمْ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10792,
                "hadithNumber": "3228",
                "englishNarrator": "A'isha (رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "When Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) decided to march (for return journey), he found Safiyyah رضی اللہ تعالیٰ عنہا at the door of her tent, sad and downcast. He remarked. Barren, shaven-head, you are going to detain us, and then said: Did you perform Tawaf Ifada on the Day of Nahr? She replied in the affirmative, whereupon he said: Then march on.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے جب روانگی کا رادہ کیا تو اچا نک ( دیکھا کہ ) حضرت صفیہ رضی اللہ تعالیٰ عنہا اپنے خیمے کے دروازے پر دل گیراور پر یشان کھڑی تھیں آپ نے فر ما یا : \" تمھا را نہ کو ئی بال نہ بچہ ! ( پھر بھی ) تم ہمیں ( یہیں ) روکنے والی ہو ۔ پھر آپ نے ان سے پو چھا : \" کیا تم نے قر بانی کے دن طواف افاضہ کیا تھا ؟انھوں نے جواب دیا : جی ہاں آپ نے فر ما یا : \" تو ( پھر ) چلو ۔ ( یعنی ان کے پاس جا کر ان سے بھی پو چھا اور تصدیق کی ).",
                "urduNarrator": "ہم سے محمد بن المثنیٰ اور ابن بشار نے بیان کیا، کہا کہ ہم سے محمد بن جعفر نے بیان کیا، ان سے شعبہ نے، ان سے حذیفہ نے بیان کیا اور ہم سے عبید اللہ بن معاذ نے بیان کیا، اور کہا کہ ان سے، میرے والد نے ہم سے کہا، شعبہ نے ہمیں بتایا, حکم نے ابرا ہیم سے انھوں نے اسود سے اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، ح وحَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ وَاللَّفْظُ لَهُ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ إِبْرَاهِيمَ، عَنِ الْأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ: لَمَّا أَرَادَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ يَنْفِرَ، إِذَا صَفِيَّةُ عَلَى بَابِ خِبَائِهَا كَئِيبَةً حَزِينَةً، فَقَالَ: «عَقْرَى حَلْقَى، إِنَّكِ لَحَابِسَتُنَا» ثُمَّ قَالَ لَهَا: «أَكُنْتِ أَفَضْتِ يَوْمَ النَّحْرِ؟» قَالَتْ: نَعَمْ، قَالَ: «فَانْفِرِي».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10793,
                "hadithNumber": "3229",
                "englishNarrator": null,
                "hadithEnglish": "A Hadith similar to that of Al-Hakam (as no. 3228) was narrated from 'Aishah رضی اللہ تعالیٰ عنہا , expect that it does not mention that she looked sad and sorrowfull.",
                "hadithUrdu": "ہم سے یحییٰ بن یحییٰ، ابوبکر بن ابی شیبہ اور ابو کریب نے ابو معاویہ کی سند سے بیان کیا, اعمش اور منصور دونوں نے ابر اہیم سے انھوں نے اسود سے انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ۔ ۔ ۔ ( آگے ) حکم کی حدیث کے ہم معنی رو ایت ہے البتہ وہ دونوں ( ان کے ) غمزدہ اور پریشان ہو نے کا ذکر نہیں کرتے ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، عَنْ أَبِي مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، ح وحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، جَمِيعًا عَنْ إِبْرَاهِيمَ، عَنِ الْأَسْوَدِ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَحْوَ حَدِيثِ الْحَكَمِ غَيْرَ أَنَّهُمَا لَا يَذْكُرَانِ: كَئِيبَةً حَزِينَةً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10794,
                "hadithNumber": "3230",
                "englishNarrator": "Ibn Umar (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger (رضی اللہ تعالیٰ عنہ) entered the Ka'ba. Usama, Bilal and 'Uthman bin Talha رضی اللہ تعالیٰ عنہ , the keeper (of the Ka'ba), were along with him. He closed the door and stayed in it for some time. Ibn 'Umar (رضی اللہ تعالیٰ عنہ) said: I asked Bilal رضی اللہ تعالیٰ عنہ as he came out what Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had done there. He said: He prayed there in (such a position) that two pillars were on his left side, one pillar on his right, and three pillars were behind him, and the House at that time was resting on six pillars.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کعبہ میں دا خل ہو ئے آپ صلی اللہ علیہ وسلم اسامہ بلال اور عثمان بن طلحہ حجبی رضی اللہ تعالیٰ عنہ انھوں ( عثمان رضی اللہ تعالیٰ عنہ ) نے ( آپ کے لیے ) اس کا دروازہ بند کر دیا پھر آپ صلی اللہ علیہ وسلم اس کے اندر ٹھہر ے رہے ۔ ابن عمر رضی اللہ تعالیٰ عنہ نے کہا : جب آپ صلی اللہ علیہ وسلم نکلے تو میں نے بلال رضی اللہ تعالیٰ عنہ سے پو چھا رسول اللہ صلی اللہ علیہ وسلم نے ( اندر ) کیا کیا ؟ انھوں نے کہا آپ نے دو ستون اپنی بائیں طرف ایک ستون دائیں طرف اور تین ستون اپنے پیچھے کی طرف رکھے ۔ ان دنوں بیت اللہ ( کی عمارت ) چھ ستونوں پر ( قائم ) تھی پھر آپ نے نماز پڑھی ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ التمیمی نے بیان کیا، انہوں نے کہا: میں نے پڑھا امام مالک نے نافع سے انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، قَالَ قَرَأْتُ عَلَى مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ دَخَلَ الْكَعْبَةَ هُوَ وَأُسَامَةُ، وَبِلَالٌ، وَعُثْمَانُ بْنُ طَلْحَةَ الْحَجَبِيُّ، فَأَغْلَقَهَا عَلَيْهِ، ثُمَّ مَكَثَ فِيهَا. قَالَ ابْنُ عُمَرَ: فَسَأَلْتُ بِلَالًا، حِينَ خَرَجَ: مَا صَنَعَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ؟ قَالَ: «جَعَلَ عَمُودَيْنِ عَنْ يَسَارِهِ، وَعَمُودًا عَنْ يَمِينِهِ، وَثَلَاثَةَ أَعْمِدَةٍ وَرَاءَهُ - وَكَانَ الْبَيْتُ يَوْمَئِذٍ عَلَى سِتَّةِ أَعْمِدَةٍ - ثُمَّ صَلَّى» حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، قَالَ قَرَأْتُ عَلَى مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ دَخَلَ الْكَعْبَةَ هُوَ وَأُسَامَةُ، وَبِلَالٌ، وَعُثْمَانُ بْنُ طَلْحَةَ الْحَجَبِيُّ، فَأَغْلَقَهَا عَلَيْهِ، ثُمَّ مَكَثَ فِيهَا. قَالَ ابْنُ عُمَرَ: فَسَأَلْتُ بِلَالًا، حِينَ خَرَجَ: مَا صَنَعَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ؟ قَالَ: «جَعَلَ عَمُودَيْنِ عَنْ يَسَارِهِ، وَعَمُودًا عَنْ يَمِينِهِ، وَثَلَاثَةَ أَعْمِدَةٍ وَرَاءَهُ - وَكَانَ الْبَيْتُ يَوْمَئِذٍ عَلَى سِتَّةِ أَعْمِدَةٍ - ثُمَّ صَلَّى».",
                "headingArabic": "اسْتِحْبَابِ دُخُولِ الْكَعْبَةِ لِلْحَاجِّ وَغَيْرِهِ وَالصَّلاَةِ فِيهَا وَالدُّعَاءِ فِي نَوَاحِيهَا كُلِّهَا",
                "headingUrdu": "زائرین اور دیگر لوگوں کے لیے مستحب ہے کہ وہ خانہ کعبہ میں داخل ہوں اور اس میں نماز پڑھیں اور اس کے تمام گوشوں میں دعا کریں۔",
                "headingEnglish": "It is recommended for pilgrims and others to enter the Ka'bah and pray therein, and supplicate in all its corners",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10795,
                "hadithNumber": "3231",
                "englishNarrator": "Ibn Umar ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came on the Day of Victory, and got down in the courtyard of the Ka'ba and he sent (a message) for 'Uthman bin Talha ( رضی اللہ تعالیٰ عنہ). He came with the key and opened the door. Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) then entered therein and Bilal, Usama bin Zaid, and 'Uthman bin Talha رضی اللہ تعالیٰ عنہ (along with him), and then commanded the door to be closed. They stayed there for a considerable time, and then the door was opened, and Abdullah رضی اللہ تعالیٰ عنہ said: I was the first to meet Allah's Messenger. ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). outside (the Ka'ba), and Bilal رضی اللہ تعالیٰ عنہ was close behind him. I said to Bilal رضی اللہ تعالیٰ عنہ : Did Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) observe prayer therein? He said: Yes. I said: Where? He said: Between the two pillars in front of his face. He said: I forgot to ask him as to the number of rakahs he prayed.",
                "hadithUrdu": "ہمیں حماد نے حدیث بیان کی ( کہا ) ہمیں ایوب نے نافع سے حدیث بیان کی انھوں نے کہا فتح مکہ کے دن رسول اللہ صلی اللہ علیہ وسلم تشریف لے آئے آ پ بیت اللہ کے صحن میں اترے اور عثمان بن طلحہ رضی اللہ تعالیٰ عنہ کی طرف پیغام بھیجا وہ چا بی لے کر حاضر ہو ئے اور دروازہ کھو لا کہا : پھر نبی صلی اللہ علیہ وسلم بلال اسامہ بن زید اور عثمان  بن طلحہ رضی اللہ تعالیٰ عنہ اندر دا خل ہو ئے آپ نے دروازے کے بارے میں حکم دیا تو اسے بند کر دیا گیا وہ سب خاصی دیر وہاں ٹھہرے پھر انھوں نے ( عثمان رضی اللہ تعالیٰ عنہ ) نے دروازہ کھو لا عبد اللہ رضی اللہ تعالیٰ عنہ نے کہا میں نے سب لوگوں سے سبقت کی اور باہر نکلتے وقت رسول اللہ صلی اللہ علیہ وسلم سے ملا بلال رضی اللہ تعالیٰ عنہ آپ کے پیچھے پیچھے تھے تو میں نے بلال رضی اللہ تعالیٰ عنہ سے پو چھا : کیا رسول اللہ صلی اللہ علیہ وسلم نے اس میں نماز ادا فر ما ئی ہے ؟ انھوں نے کہا : ہاں میں نے پوچھا کہاں ؟ انھوں نے کہا : دو ستونوں کے در میان جو آپ کے سامنے تھے ( عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ نے ) کہا : میں ان سے یہ پو چھنا بھول گیا کہ آپ نے کتنی رکعتیں پڑھیں ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو كَامِلٍ الْجَحْدَرِيُّ، كُلُّهُمْ عَنْ حَمَّادِ بْنِ زَيْدٍ، قَالَ أَبُو كَامِلٍ: حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا أَيُّوبُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ: قَدِمَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْفَتْحِ، فَنَزَلَ بِفِنَاءِ الْكَعْبَةِ، وَأَرْسَلَ إِلَى عُثْمَانَ بْنِ طَلْحَةَ، فَجَاءَ بِالْمِفْتَحِ، فَفَتَحَ الْبَابَ، قَالَ: ثُمَّ دَخَلَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَبِلَالٌ، وَأُسَامَةُ بْنُ زَيْدٍ، وَعُثْمَانُ بْنُ طَلْحَةَ، وَأَمَرَ بِالْبَابِ فَأُغْلِقَ، فَلَبِثُوا فِيهِ مَلِيًّا، ثُمَّ فَتَحَ الْبَابَ، فَقَالَ عَبْدُ اللهِ: فَبَادَرْتُ النَّاسَ فَتَلَقَّيْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ خَارِجًا وَبِلَالٌ عَلَى إِثْرِهِ، فَقُلْتُ لِبِلَالٍ: «هَلْ صَلَّى فِيهِ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ؟» قَالَ: «نَعَمْ»، قُلْتُ: «أَيْنَ؟» قَالَ: «بَيْنَ الْعَمُودَيْنِ تِلْقَاءَ وَجْهِهِ»، قَالَ: وَنَسِيتُ أَنْ أَسْأَلَهُ: كَمْ صَلَّى؟ .",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10796,
                "hadithNumber": "3232",
                "englishNarrator": "lbn Umar ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came daring the year of Victory on the she-camel of Usama bin Zaid رضی اللہ تعالیٰ عنہ until he made her kneel down in the courtyard of the Ka'ba (and got down). He then sent for 'Uthman bin Talha رضی اللہ تعالیٰ عنہ and said: Bring me the key. He went to his mother and she refused to give that to him. He said: By Allah, give that to him or this sword would be thrust into my side. So she gave that to him, and he came with that to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and gave that to him, and he opened the door. The rest of the hadith is the same as the above one.",
                "hadithUrdu": "فتح مکہ کے سال رسول اللہ صلی اللہ علیہ وسلم حضرت اسامہ رضی اللہ تعالیٰ عنہ کی اونٹنی پر ( سوار ہو کر ) تشر یف لا ئے یہاں تک کہ آپ نے اسے کعبہ کے صحن میں لا بٹھا یا پھر عثمان بن طلحہ رضی اللہ تعالیٰ عنہ کو بلوایا اور کہا : مجھے ( بیت اللہ کی ) چابی دو وہ اپنی والدہ کے پاس گئے تو اس نے انھیں چا بی دینے سے انکا ر کر دیا انھوں نے کہا یا تو تم یہ چا بی مجھے دوگی یا پھر یہ تلوار میری پیٹھ سے پار نکل جا ئے گی ، کہا تو اس نے وہ چابی انھیں دے دی وہ اسے لے کر نبی صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے آپ صلی اللہ علیہ وسلم نے وہ چا بی انھی کو دے دی تو انھوں ( ہی ) نے دروازہ کھو لا پھر حماد بن زید کی حدیث کے مانند بیان کی ۔",
                "urduNarrator": "ہم سے ابن ابی عمر نے بیان کیا, سفیان نے ہمیں ایوب سختیانی سے حدیث بیان کی انھون نے نافع سے اور انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَيُّوبَ السَّخْتِيَانِيِّ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ: أَقْبَلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَامَ الْفَتْحِ عَلَى نَاقَةٍ لِأُسَامَةَ بْنِ زَيْدٍ، حَتَّى أَنَاخَ بِفِنَاءِ الْكَعْبَةِ، ثُمَّ دَعَا عُثْمَانَ بْنَ طَلْحَةَ، فَقَالَ: «ائْتِنِي بِالْمِفْتَاحِ»، فَذَهَبَ إِلَى أُمِّهِ، فَأَبَتْ أَنْ تُعْطِيَهُ، فَقَالَ: وَاللهِ، لَتُعْطِينِهِ أَوْ لَيَخْرُجَنَّ هَذَا السَّيْفُ مِنْ صُلْبِي، قَالَ: فَأَعْطَتْهُ إِيَّاهُ، فَجَاءَ بِهِ إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَدَفَعَهُ إِلَيْهِ، فَفَتَحَ الْبَابَ، ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ حَمَّادِ بْنِ زَيْدٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10797,
                "hadithNumber": "3233",
                "englishNarrator": "Ibn 'Umar (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger, ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) entered the House, and Usama, Bilal and Uthman bin Talha رضی اللہ تعالیٰ عنہ were with him, and they kept the door closed for a considerable time. Then it was opened and I was the first to enter the House and meet Bilal رضی اللہ تعالیٰ عنہ, and I said: Where did Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) observe prayer? He said: Between these two front pillars. I, however, forgot to ask him the number of rak'ahs that he observed.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم بیت اللہ میں دا خل ہو ئے آپ کے ساتھ اسامہ بلا ل اور عثمان بن طلحہ رضی اللہ تعالیٰ عنہ بھی تھے انھوں نے اپنے پیچھے خاصی دیر دروازہ بند کیے رکھا پھر ( دروازہ ) کھو لا گیا تو میں پہلا شخص تھا جو ( دروازے سے ) داخل ہوا میں بلا ل رضی اللہ تعالیٰ عنہ سے ملا اور پو چھا رسول اللہ صلی اللہ علیہ وسلم نے ادا کی ؟انھوں نے کہا : آگے کے دو ستونوں کے در میان جو آپ کے سامنے تھے ( عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ نے ) کہا : میں ان سے یہ پو چھنا بھول گیا کہ آپ نے کتنی رکعتیں ادا کی.",
                "urduNarrator": "ہم سے زہیر بن حرب نے بیان کیا، کہا ہم سے یحییٰ جو کہ القطان ہیں، نے بیان کیا، کہا کہ ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے ابو اسامہ نے بیان کیا، انہوں نے کہا کہ اور ابن عباس رضی اللہ عنہما نے, نمیر، اور اس کا تلفظ، عبدہ نے ہمیں، کے اختیار سے بتایا, عبید اللہ نے نافع سے اور انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی کہا",
                "hadithArabic": "وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى وَهُوَ الْقَطَّانُ، ح وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، ح وحَدَّثَنَا ابْنُ نُمَيْرٍ، وَاللَّفْظُ لَهُ، حَدَّثَنَا عَبْدَةُ، عَنْ عُبَيْدِ اللهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ: دَخَلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الْبَيْتَ، وَمَعَهُ أُسَامَةُ، وَبِلَالٌ، وَعُثْمَانُ بْنُ طَلْحَةَ، فَأَجَافُوا عَلَيْهِمِ الْبَابَ طَوِيلًا، ثُمَّ فُتِحَ، فَكُنْتُ أَوَّلَ مَنْ دَخَلَ، فَلَقِيتُ بِلَالًا، فَقُلْتُ: أَيْنَ صَلَّى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ؟ فَقَالَ: «بَيْنَ الْعَمُودَيْنِ الْمُقَدَّمَيْنِ»، فَنَسِيتُ أَنْ أَسْأَلَهُ: كَمْ صَلَّى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ؟",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10798,
                "hadithNumber": "3234",
                "englishNarrator": "Abdullah bin Umar رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "He reached the Ka'ba and Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had entered therein, and Bilal and Usama رضی اللہ تعالیٰ عنہ too. 'Uthman bin Talha رضی اللہ تعالیٰ عنہ closed the door to them, and they stayed there for a considerable time, and then the door was opend and Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came out, and I went upstairs and entered the House and said: Where did Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) observe prayer? They said: At this very place. I, however, forgot to ask them about the (number of) rak'ahs that he observed.",
                "hadithUrdu": "وہ کعبہ کے پاس پہنچے جبکہ نبی صلی اللہ علیہ وسلم بلال اور اسامہ رضی اللہ تعالیٰ عنہ اس میں دا خل ہو چکے تھے عثمان بن طلحہ رضی اللہ تعالیٰ عنہ نے ان کے پیچھے دروازہ بند کیا ۔ کہا وہ اس میں کا فی دیر ٹھہرے پھر دروازہ کھو لا گیا تو نبی صلی اللہ علیہ وسلم باہر تشریف لا ئے میں سیڑھی چڑھا اور بیت اللہ میں دا خل ہوا میں نے پو چھا نبی صلی اللہ علیہ وسلم نے کہا ں نما زپڑھی ؟ انھوں نے کہا اس جگہ کہا میں ان سے یہ پوچھنا بھول گیا کہ آپ نے کتنی رکعتیں پڑھیں ۔",
                "urduNarrator": "مجھ سے حمید بن مسعدہ نے بیان کیا، خالد نے، یعنی ہم سے ابن حارث نے بیان کیا، ہم سے بیان کیا عبد اللہ عون نے ہمیں نا فع سے حدیث بیان کی انھوں نے حضرت عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنِي حُمَيْدُ بْنُ مَسْعَدَةَ، حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ، حَدَّثَنَا عَبْدُ اللهِ بْنُ عَوْنٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللهِ بْنِ عُمَرَ، أَنَّهُ انْتَهَى إِلَى الْكَعْبَةِ وَقَدْ دَخَلَهَا النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَبِلَالٌ، وَأُسَامَةُ، وَأَجَافَ عَلَيْهِمْ عُثْمَانُ بْنُ طَلْحَةَ الْبَابَ، قَالَ: فَمَكَثُوا فِيهِ مَلِيًّا، ثُمَّ فُتِحَ الْبَابُ، فَخَرَجَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَرَقِيتُ الدَّرَجَةَ، فَدَخَلْتُ الْبَيْتَ، فَقُلْتُ: أَيْنَ صَلَّى النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ؟ قَالُوا: «هَا هُنَا»، قَالَ: وَنَسِيتُ أَنْ أَسْأَلَهُمْ: كَمْ صَلَّى؟",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10799,
                "hadithNumber": "3235",
                "englishNarrator": "Salim narrated on the authority of his father (رضی اللہ تعالیٰ عنہ ):",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) entered the House along with Usama bin Zaid, Bilal and Uthman bin Talha رضی اللہ تعالیٰ عنہ . They closed the door from within, and, as they opened it, I was the first to get into it and meet Bilal رضی اللہ تعالیٰ عنہ , and I asked him: Did Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) observe prayer in it? He said: Yes, he observed prayer between these two Yemenite pillars (pillars situated towards the side of Yemen).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم بیت اللہ میں دا خل ہو ئے آپ صلی اللہ علیہ وسلم اسامہ بن زید بلال اور عثمان بن طلحہ رضی اللہ تعالیٰ عنہ انھوں نے اپنے پیچھے دروازہ بند کر لیا جب انھوں نے دروازہ کھو لا تو میں سب سے پہلا شخص تھا جو ( کعبہ میں ) داخل ہوا میں بلا ل رضی اللہ تعالیٰ عنہ سے ملا اور ان سے پو چھا : کیارسول اللہ صلی اللہ علیہ وسلم نے اس میں نماز ادا کی ؟ انھوںنے جواب دیا : ہاں آپ نے دو یمنی ستونوں کے در میان نماز ادا کی ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, لیث نے ہمیں ابن شہاب سے خبر دی انھوں نے سالم سے انھوں نے اپنے والد ( عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ ) سے روایت کی انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وحَدَّثَنَا ابْنُ رُمْح، أَخْبَرَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، أَنَّهُ قَالَ: دَخَلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الْبَيْتَ، هُوَ وَأُسَامَةُ بْنُ زَيْدٍ، وَبِلَالٌ، وَعُثْمَانُ بْنُ طَلْحَةَ، فَأَغْلَقُوا عَلَيْهِمْ، فَلَمَّا فَتَحُوا كُنْتُ فِي أَوَّلِ مَنْ وَلَجَ، فَلَقِيتُ بِلَالًا، فَسَأَلْتُهُ: هَلْ صَلَّى فِيهِ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ؟ قَالَ: نَعَمْ، «صَلَّى بَيْنَ الْعَمُودَيْنِ الْيَمَانِيَيْنِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10800,
                "hadithNumber": "3236",
                "englishNarrator": "Salim bin Abdullah reported his father (رضی اللہ تعالیٰ عنہ) saying:",
                "hadithEnglish": "I saw Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) entering the Ka'ba, and Usama bin Zaid, Bilal and 'Uthman bin Talha رضی اللہ تعالیٰ عنہ were along with him, but none (else) entered therein along with them. Then the door was closed for them from within. 'Abdullah bin Umar (رضی اللہ تعالیٰ عنہ ) said: Bilal and Uthman bin Talha رضی اللہ تعالیٰ عنہ informed me that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) observed prayer in the interior of the Ka'ba between the two Yemenite pillars.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا آپ صلی اللہ علیہ وسلم کعبہ میں دا خل ہو ئے آپ صلی اللہ علیہ وسلم اسامہ بن زید بلال اور عثمان بن طلحہ رضی اللہ تعالیٰ عنہ ان کے ساتھ اور کو ئی دا خل نہیں ہوا پھر ان کے پیچھے دروازہ بند کر دیا گیا ۔ عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ نے کہا مجھے بلال یا عثمان بن طلحہ رضی اللہ تعالیٰ عنہ نے بتا یا کہ رسول اللہ صلی اللہ علیہ وسلم نے کعبہ کے اندر دو یمنی ستونوں کے در میان نماز ادا کی ۔",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا, یو نس نے مجھے ابن شہاب سے خبر دی ( کہا ) مجھے سالم بن عبد اللہ نے اپنے والد ( عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ ) سے خبر دی انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللهِ، عَنْ أَبِيهِ، قَالَ: «رَأَيْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ دَخَلَ الْكَعْبَةَ، هُوَ وَأُسَامَةُ بْنُ زَيْدٍ، وَبِلَالٌ، وَعُثْمَانُ بْنُ طَلْحَةَ، وَلَمْ يَدْخُلْهَا مَعَهُمْ أَحَدٌ، ثُمَّ أُغْلِقَتْ عَلَيْهِمْ» قَالَ عَبْدُ اللهِ بْنُ عُمَرَ: فَأَخْبَرَنِي بِلَالٌ، أَوْ عُثْمَانُ بْنُ طَلْحَةَ، «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ صَلَّى فِي جَوْفِ الْكَعْبَةِ، بَيْنَ الْعَمُودَيْنِ الْيَمَانِيَيْنِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10801,
                "hadithNumber": "3237",
                "englishNarrator": "Ibn Juraij reported: I said to 'Ata':",
                "hadithEnglish": "Have you heard Ibn 'Abbas رضی اللہ تعالیٰ عنہ saying: You have been commanded to observe circumambulation, and not commanded to enter it (the Ka'ba)? He ('Ata') said: He (Ibn Abbas) (at the same time) did not forbid entrance into it. I, however, heard him saying: Usama bin Zaid رضی اللہ تعالیٰ عنہ informed me that when Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) entered the House, he supplicated in all sides of it; and he did not observe prayer therein till he came out, and as he came out he observed two rak'ahs in front of the House, and said: This is your Qibla. I said to him: What is meant by its sides? Does that mean its corners? He said: (In all sides and nooks of the House) there is Qibla.",
                "hadithUrdu": "کیا آپ نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ کو یہ کہتے ہو ئے سنا ہے کہ تمھیں طواف کا حکم دیا گیا ہے اس ( بیت اللہ ) میں دا خل ہو نے کا حکم نہیں دیا گیا انھوں نے جواب دیا وہ اس میں دا خل ہو نے سے منع نہیں کرتے تھے لیکن میں نے ان سے سنا کہہ رہے تھے مجھے اسامہ بن زید رضی اللہ تعالیٰ عنہ نے بتا یا کہ نبی صلی اللہ علیہ وسلم جب بیت اللہ میں داخل ہو ئے آپ صلی اللہ علیہ وسلم نے اس کے تمام اطراف میں دعا کی اور اس میں نماز ادا نہیں کی ۔ یہاںتک کہ باہر آگئے جب آپ تشر یف لا ئے تو قبلہ کے سامنے کی طرف دورکعتیں ادا کیں اور فر ما یا : \" یہ قبلہ ہے میں نے ان سے پو چھا : اس کے اطراف سے کیا مرا د ہے ؟کیا اس کے کو نوں میں؟ انھوں نے کہا : بلکہ بیت اللہ کی ہر جہت میں ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم اور عبد بن حمید نے ابن عبد کی سند سے بیان کیا کہ ہمیں محمد بن بکر نے خبر دی, ابن جریج نے ہمیں خبر دی کہا : میں نے عطا ء سے پو چھا",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبْدُ بْنُ حُمَيْدٍ، جَمِيعًا عَنِ ابْنِ بَكْرٍ، قَالَ عَبْدٌ: أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ: قُلْتُ لِعَطَاءٍ: أَسَمِعْتَ ابْنَ عَبَّاسٍ يَقُولُ: إِنَّمَا أُمِرْتُمْ بِالطَّوَافِ، وَلَمْ تُؤْمَرُوا بِدُخُولِهِ؟ قَالَ: لَمْ يَكُنْ يَنْهَى عَنْ دُخُولِهِ، وَلَكِنِّي سَمِعْتُهُ يَقُولُ: أَخْبَرَنِي أُسَامَةُ بْنُ زَيْدٍ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لَمَّا دَخَلَ الْبَيْتَ، دَعَا فِي نَوَاحِيهِ كُلِّهَا، وَلَمْ يُصَلِّ فِيهِ حَتَّى خَرَجَ، فَلَمَّا خَرَجَ رَكَعَ فِي قُبُلِ الْبَيْتِ رَكْعَتَيْنِ، وَقَالَ «هَذِهِ الْقِبْلَةُ»، قُلْتُ لَهُ: مَا نَوَاحِيهَا؟ أَفِي زَوَايَاهَا؟ قَالَ: بَلْ فِي كُلِّ قِبْلَةٍ مِنَ الْبَيْتِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10802,
                "hadithNumber": "3238",
                "englishNarrator": "Ibn Abbas (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) entered the Ka'ba, and in it there were six pillars, and he stood near a pillar and made supplication, but did not observe the prayer.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم کعبہ میں دا خل ہو ئے اور اس میں چھ ستون تھے آپ نے ایک ستون کے پاس کھڑے ہو کر دعا مانگی اور ( وہاں ) نماز ادا نہیں کی ۔",
                "urduNarrator": "ہم سے شیبان بن فروخ نے بیان کیا، کہا ہم سے ہمام نے بیان کیا، کہا ہم سے عطا نے بیان کیا، حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا عَطَاءٌ، عَنِ ابْنِ عَبَّاسٍ، «أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ دَخَلَ الْكَعْبَةَ وَفِيهَا سِتُّ سَوَارٍ، فَقَامَ عِنْدَ سَارِيَةٍ فَدَعَا، وَلَمْ يُصَلِّ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10803,
                "hadithNumber": "3239",
                "englishNarrator": "Isma'il bin Abu Khalid reported:",
                "hadithEnglish": "I asked Abdullah bin Abu Aufa ( رضی اللہ تعالیٰ عنہ), a Companion of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), whether Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had entered the House, while performing 'Umra, He said: NO.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کے صحابی عبد اللہ بن ابی اوفیٰ رضی اللہ تعالیٰ عنہ سے پوچھا کیا نبی صلی اللہ علیہ وسلم اپنے عمرے کے دوران میں بیت اللہ میں داخل ہو ئے تھے ؟انھوں نے جواب دیا نہیں ۔",
                "urduNarrator": "مجھ سے سریج بن یونس نے بیان کیا، مجھ سے ہشیم نے بیان کیا، انہوں نے ہم سے بیان کیا ہمیں اسماعیل بن ابی خالد نے خبر دی کہا",
                "hadithArabic": "وحَدَّثَنِي سُرَيْجُ بْنُ يُونُسَ، حَدَّثَنِي هُشَيْمٌ، أَخْبَرَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ، قَالَ: قُلْتُ لِعَبْدِ اللهِ بْنِ أَبِي أَوْفَى صَاحِبِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، أَدَخَلَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الْبَيْتَ فِي عُمْرَتِهِ؟ قَالَ: «لَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10804,
                "hadithNumber": "3240",
                "englishNarrator": "A'isha (رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "Allah's Messenger ﷺ said to me: Had your people not been unbelievers in the recent past (had they not quite recently accepted Islam), I would have demolished the Ka'ba and would have rebuilt it on the foundation (laid) by Ibrahim; for when the Quraish had built the Ka'ba, they reduced its (area), and I would also have built (a door) in the rear.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فر ما یا : \" اگر تمھا ری قوم کا زمانہ کفر قریب کا نہ ہو تا تو میں ضرور کعبہ کو گرا تا اور اسے حضرت ابراہیم ؑکی اساس پر استوار کرتا قریش نے جب بیت اللہ کو تعمیر کیا تھا تو اسے چھوٹا کر دیا تھا میں ( اصل تعمیر کے مطا بق ) اس کا پچھلا دروازہ بھی بناتا ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے بیان کیا ابو معاویہ نے ہمیں ہشام بن عروہ سے خبر دی انھوں نے اپنے والد ( عروہ ) سے انھوں نے حجرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ: قَالَ لِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَوْلَا حَدَاثَةُ عَهْدِ قَوْمِكِ بِالْكُفْرِ لَنَقَضْتُ الْكَعْبَةَ، وَلَجَعَلْتُهَا عَلَى أَسَاسِ إِبْرَاهِيمَ، فَإِنَّ قُرَيْشًا حِينَ بَنَتِ الْبَيْتَ اسْتَقْصَرَتْ، وَلَجَعَلْتُ لَهَا خَلْفًا».",
                "headingArabic": "نَقْضِ الْكَعْبَةِ وَبِنَائِهَا ‏‏",
                "headingUrdu": "کعبہ کو گرانا اور دوبارہ تعمیر کرنا",
                "headingEnglish": "Demolishing the Ka'bah and rebuilding it",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10805,
                "hadithNumber": "3241",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Hisham with the same chain of transmitters.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، کہا: ہم سے انہوں نے بیان کیا ابن نمیر نے ہشام سے اسی سند کے ساتھ ( یہی ) حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، قَالَا: حَدَّثَنَا ابْنُ نُمَيْرٍ، عَنْ هِشَامٍ، بِهَذَا الْإِسْنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10806,
                "hadithNumber": "3242",
                "englishNarrator": "A'isha رضی اللہ تعالیٰ عنہا the wife of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as having said this: Didn't you see that when your people built the Ka'ba, they reduced (its area with the result that it no longer remains) on the foundations (laid) by Ibrahim. I said: Messenger of Allah, why don't you rebuild it on the foundations (laid by) Ibrahim? Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Had your people not been new converts to Islam, I would have done that. 'Abdullah bin 'Umar (رضی اللہ تعالیٰ عنہ) said: If 'A'isha (رضی اللہ تعالیٰ عنہا) had heard it from Allah's Messenger (ﷺ), I would not have seen Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) abandoning the touching of the two corners situated near al-Hijr, but (for the fact) that it was not completed on the foundations (laid) by Ibrahim.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \"\" کیا تم نے نہیں دیکھا تمھا ری قوم نے جب کعبہ تعمیر کیا تو اسے حضرت ابرا ہیم ؑ کی بنیا دوں سے کم کر دیا ۔ کہا میں نے عرض کی : اے اللہ کے رسول اللہ صلی اللہ علیہ وسلم !کیا آپ اسے دوبارہ ابرا ہیمؑ کی بنیا دوں پر نہیں لو ٹا ئیں گے ؟ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \"\" اگر تمھا ری قوم کا زمانہ کفر قریب کا نہ ہو تا تو میں ( ضرورایسا ) کرتا ۔ حضرت عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ نے کہا اگر یہ بات حضرت عائشہ رضی اللہ تعالیٰ عنہا نے رسول اللہ صلی اللہ علیہ وسلم سے سنی تھی تو میں نہیں سمجھتا کہ رسول اللہ صلی اللہ علیہ وسلم نے حطیم کے قریبی دونوں ارکان کا استلام اس کے علاوہ کسی اور وجہ سے ترک کیا ( ہواصل وجہ یہ تھی ) کہ بیت اللہ ابرا ہیم ؑ کی بنیا دوں پر پورا 0تعمیر ) نہیں کیا گیا تھا ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے ابن شہاب کی سند سے مالک کو پڑھا, سالم بن عبد اللہ سے روایت ہے کہ عبد اللہ بن محمد بن ابی بکر صدیق رضی اللہ تعالیٰ عنہ نے نے عبداللہ بن عمر رضی اللہ عنہما سے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم کی زوجہ عائشہ رضی اللہ عنہا سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللهِ، أَنَّ عَبْدَ اللهِ بْنَ مُحَمَّدِ بْنِ أَبِي بَكْرٍ الصِّدِّيقِ، أَخْبَرَ عَبْدَ اللهِ بْنَ عُمَرَ، عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَلَمْ تَرَيْ أَنَّ قَوْمَكِ حِينَ بَنَوْا الْكَعْبَةَ اقْتَصَرُوا عَنْ قَوَاعِدِ إِبْرَاهِيمَ» قَالَتْ: فَقُلْتُ: يَا رَسُولَ اللهِ، أَفَلَا تَرُدُّهَا عَلَى قَوَاعِدِ إِبْرَاهِيمَ؟ فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَوْلَا حِدْثَانُ قَوْمِكِ بِالْكُفْرِ لَفَعَلْتُ»، فَقَالَ عَبْدُ اللهِ بْنُ عُمَرَ: «لَئِنْ كَانَتْ عَائِشَةُ سَمِعَتْ هَذَا مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، مَا أُرَى رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ تَرَكَ اسْتِلَامَ الرُّكْنَيْنِ اللَّذَيْنِ يَلِيَانِ الْحِجْرَ، إِلَّا أَنَّ الْبَيْتَ لَمْ يُتَمَّمْ عَلَى قَوَاعِدِ إِبْرَاهِيمَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10807,
                "hadithNumber": "3243",
                "englishNarrator": "A'isha (رضی اللہ تعالیٰ عنہا), wife of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌):",
                "hadithEnglish": "I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: If your people, had not been recent converts to Islam, I would have spent the treasure of the Ka'ba in the way of Allah and would have constructed its door just on the level of the ground and would have encompassed in it the space of Hijr.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا آپ نے فر ما یا : \" اگر تمھا ری قوم جاہلیت ۔ ۔ ۔ یا فر ما یا زمانہ کفر ۔ ۔ ۔ سے ابھی ابھی نہ نکلی ہو تی تو میں ضرورکعبہ کے خزانے اللہ کی را ہ میں خرچ کر دیتا اس کا دروازہ زمین کے برابر کر دیتا اور حجر ( حطیم ) کو کعبہ میں شامل کر دیتا ۔",
                "urduNarrator": "مجھ سے ابو الطاہر نے بیان کیا، ہم سے عبداللہ بن وہب نے مخرمہ کی سند سے بیان کیا، اور مجھ سے ہارون بن سعید العیلی نے بیان کیا، ہم سے ابن وہب نے بیان کیا، مجھ سے مخرمہ بن بکیر نے اپنے والد سے روایت کی، انہوں نے کہا: ابن عمر رضی اللہ تعالیٰ عنہ کے آزاد کردہ غلام نافع کہتے ہیں میں نے عبد اللہ بن ابی بکر ابی قحانہ رضی اللہ تعالیٰ عنہ سے سنا وہ عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ کو نبی صلی اللہ علیہ وسلم کی زوجہ حضرت عائشہ رضی اللہ تعالیٰ عنہا سے حدیث سنارہے تھے انھوں ( عائشہ رضی اللہ تعالیٰ عنہا ) نے کہا",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، عَنْ مَخْرَمَةَ، ح وحَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي مَخْرَمَةُ بْنُ بُكَيْرٍ، عَنْ أَبِيهِ، قَالَ: سَمِعْتُ نَافِعًا، مَوْلَى ابْنِ عُمَرَ، يَقُولُ: سَمِعْتُ عَبْدَ اللهِ بْنَ أَبِي بَكْرِ بْنِ أَبِي قُحَافَةَ، يُحَدِّثُ عَبْدَ اللهِ بْنَ عُمَرَ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، أَنَّهَا قَالَتْ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: لَوْلَا أَنَّ قَوْمَكِ حَدِيثُو عَهْدٍ بِجَاهِلِيَّةٍ - أَوْ قَالَ: بِكُفْرٍ - لَأَنْفَقْتُ كَنْزَ الْكَعْبَةِ فِي سَبِيلِ اللهِ، وَلَجَعَلْتُ بَابَهَا بِالْأَرْضِ، وَلَأَدْخَلْتُ فِيهَا مِنَ الْحِجْرِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10808,
                "hadithNumber": "3244",
                "englishNarrator": "Abdullah bin Zubair (رضی اللہ تعالیٰ عنہ) reported on the authority of his mother's sister ('A'isha رضی اللہ تعالیٰ عنہا ) saying:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: 'A'isha رضی اللہ تعالیٰ عنہا , if your people had not been recently polytheists (and new converts to Islam), I would have demolished the Ka'ba, and would have brought it to the level of the ground and would have constructed two doors, one facing the east and the other one to the west, and would have added to it six cubits of area from Hijr, for the Quraish had reduced it when they rebuilt it.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" عائشہ رضی اللہ تعالیٰ عنہا اگر تمھاری قوم کا شرک کا زمانہ قریب کا نہ ہو تا تو میں ضرور کعبہ کو گرا تا اس ( کے دروازے ) کو زمین کے ساتھ لگا دیتا اور میں اس کے دو دروازے شرقی دروازہ اور دوسرا غربی دروازہ بنا تا اور حجر ( حطیم ) اسے چھ ہاتھ ( کا حصہ ) اس میں شامل کر دیتا ۔ بلا شبہ قریش نے جب کعبہ تعمیر کیا تھا تو اسے چھوٹا کر دیا.",
                "urduNarrator": "مجھ سے محمد بن حاتم نے بیان کیا، مجھ سے ابن مہدی نے بیان کیا، ہم سے سلیم بن حیان نے بیان کیا، سعید یعنی ابن بیناء سے روایت ہے کہا میں نے عبد اللہ بن زبیر رضی اللہ تعالیٰ عنہ سے سنا وہ کہہ رہے تھے ۔ مجھ سے میری خالہ یعنی حضرت عائشہ رضی اللہ تعالیٰ عنہا نے حدیث بیان کی انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنِي ابْنُ مَهْدِيٍّ، حَدَّثَنَا سَلِيمُ بْنُ حَيَّانَ، عَنْ سَعِيدٍ يَعْنِي ابْنَ مِينَاءَ، قَالَ: سَمِعْتُ عَبْدَ اللهِ بْنَ الزُّبَيْرِ، يَقُولُ: حَدَّثَتْنِي خَالَتِي، يَعْنِي عَائِشَةَ، قَالَتْ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: يَا عَائِشَةُ، لَوْلَا أَنَّ قَوْمَكِ حَدِيثُو عَهْدٍ بِشِرْكٍ، لَهَدَمْتُ الْكَعْبَةَ، فَأَلْزَقْتُهَا بِالْأَرْضِ، وَجَعَلْتُ لَهَا بَابَيْنِ: بَابًا شَرْقِيًّا، وَبَابًا غَرْبِيًّا، وَزِدْتُ فِيهَا سِتَّةَ أَذْرُعٍ مِنَ الْحِجْرِ، فَإِنَّ قُرَيْشًا اقْتَصَرَتْهَا حَيْثُ بَنَتِ الْكَعْبَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10809,
                "hadithNumber": "3245",
                "englishNarrator": "Ata' reported:",
                "hadithEnglish": "The House was burnt during the time of Yazid bin Muawiya when the people of Syria had fought (in Mecca). And it happened with it (the Ka'ba) what was (in store for it). Ibn Zubair (رضی اللہ تعالیٰ عنہ) felt it (in the same state) until the people came in the season (of Hajj). (The idea behind was) that he wanted to exhort them or incite them (to war) against the people of Syria. When the people had arrived he said to them: O people, advise me about the Ka'ba. Should I demolish it and then build it from its very foundation, or should I repair whatever has been damaged of it? Ibn 'Abbas رضی اللہ تعالیٰ عنہ said: An idea has occurred to me according to which I think that you should only repair (the portion which has been) damaged, and leave the House (in that very state in which) people embraced Islam (and leave those very stones in the same state) when people embraced Islam, and over which Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had raised it. Thereupon Ibn Zubair رضی اللہ تعالیٰ عنہ said: It the house of any one of you is burnt, he would not be contented until he had reconstructed it, then what about the House of your Lord (which is far more Important than your house)? I would seek good advice from my Lord thrice and then I would make up (my mind) about this affair. After seeking good advice thrice, he made up his mind to demolish it. The people apprehended that calamity might fall from heaven on those persons who would be first to climb (over the building for the purpose of demolishing it), till one (took up courage, and ascended the roof), and threw down one of its stones. When the people saw no calamity befalling him, they followed him, demolished it until it was razed to the ground. Then Ibn Zubair رضی اللہ تعالیٰ عنہ erected pillars and hung cartains on them (in order to provide facilities to the people for observing the time of its construction). And the walls were raised; and Ibn Zubair رضی اللہ تعالیٰ عنہ said: I heard 'A'isha (رضی اللہ تعالیٰ عنہا) say that Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had observed: If the people had Rot recently (abandoned) unbelief, find I had means enough to reconstruct it, which I had not, I would have definitely excompassed in it five cubits of area from Hijr. And I would also have constructed a door for the people to enter, and a door for their exit. I today have (the means to spend) and I entertain no fearfrom the side of people (that they would protest against this change). So he added five cubits of area from the side of Hatim to it that there appeared (the old) foundation (upon which Hadrat Ibrahim had built the Ka'ba). and the people saw that and it was upon this foundation that the wall was raised. The length of the Ka'ba was eighteen cubits. when addition was made to it (which was in its breadth), then naturally the length appears to be) small (as compared with its breadth). Then addition of ten cubits (of area) was made in its length (also). Two doors were also constructed, one of which (was meant) for entrance and the other one for exit. When Ibn Zubair (رضی اللہ تعالیٰ عنہ ) was killed, Hajjaj wrote to 'Abdul-Malik (bin Marwan) informing him about it, and telling him that Ibn Zubair (رضی اللہ تعالیٰ عنہ) had built (the Ka'ba) on those very foundations (which were laid by Ibrahim) and which reliable persons among the Meccans had seen. 'Abdul-Malik wrote to him: We are not concerned with the censuring of Ibn Zubair رضی اللہ تعالیٰ عنہ in anything. Keep intact the addition made by him in the side of length, and whatever he has added from the side of Hijr revert to (its previous) foundation, and wall up the door which he had opened. Thus Hajjaj at the command of Abdul-Malik) demolished it (that portion) and rebuilt it on (its previous) foundations.",
                "hadithUrdu": "یزید بن معاویہ کے دور میں جب اہل شام نے ( مکہ پر ) حملہ کیا اور کعبہ جل گیا تو اس کی جو حالت تھی سو تھی ابن زبیر رضی اللہ تعالیٰ عنہ نے اسے ( اسی حالت پر ) رہنے دیا حتیٰ کہ حج کے مو سم میں لو گ ( مکہ ) آنے لگے وہ چا ہتے تھے کہ انھیں ہمت دلا ئیں ۔ ۔ یا اہل شام کے خلاف جنگ پر ابھا ریں ۔ ۔ ۔ جب لو گ آئے تو انھوں نے کہا اے لوگو! مجھے کعبہ کے بارے میں مشورہ دو میں اسے گرا کر ( از سر نو ) اس کی عمارت بنا دوں یا اس کا جو حصہ بو سیدہ ہو چکا ہے صرف اس کی مرمت کرا دوں ؟ابن عباس رضی اللہ تعالیٰ عنہ نے کہا میرے سامنے ایک رائے واضح ہو ئی ہے میری را ئے یہ ہے کہ اس کا بڑا حصہ کمزور ہو گیا ہے آپ اس می مرمت کرا دیں اور بیت اللہ کو ( اسی طرح باقی ) رہنے دیں جس پر لو گ اسلا م لا ئے اور ان پتھروں کو ( باقی چھوڑ دیں ) جن پر لوگ اسلام لائے اور جن پر نبی صلی اللہ علیہ وسلم کی بعثت ہو ئی ، اس پر ابن زبیر رضی اللہ تعالیٰ عنہ نے کہا اگر تم میں سے کسی کا اپنا گھر جل جا ئے تو وہ اس وقت تک راضی نہیں ہو تا جب تک کہ اسے نیا ( نہ ) بنا لے تو تمھا رے رب کے گھر کا کیا ہو؟ میں تین دن اپنے رب سے استخارہ کروں گا پھر اپنے کام کا پختہ عزم کروں گا ۔ جب تین دن گزر گئے تو انھوں نے اپنی را ئے پختہ کر لی کہ اسے گرا دیں تو لو گ ( اس ڈرسے ) اس سے بچنے لگے کہ جو شخص اس ( عمارت ) پر سب سے پہلے چڑھے گا اس پر آسمان سے کو ئی آفت نازل ہو جا ئے گی یہاں تک کہ ایک آدمی اس پر چڑھا اور اس سے ایک پتھر گرادیا جب لوگوں نے دیکھا کہ اسے کچھ نہیں ہوا تو لوگ ایک دوسرے کے پیچھے ( گرا نے لگے ) حتیٰ کہ اسے زمین تک پہنچا دیا ۔ ابن زبیر رضی اللہ تعالیٰ عنہ نے چند ( عارضی ) ستون بنا ئے اور پردے ان پر لٹکا دیے یہاں تک کہ اس کی عمارت بلند ہو گئی ۔ ابن زبیر رضی اللہ تعالیٰ عنہ نے کہا میں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا کو یہ کہتے سنا بلا شبہ اللہ کے رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \"\" اگر لوگوں کے کفر کا زمانہ قریب کا نہ ہوتا اور میرے پاس اتنا مال بھی نہیں جو اس کی تعمیر ( مکمل کرنے ) میں میرا معاون ہو تو میں حطیم سے پانچ ہاتھ ( زمین ) اس میں ضرور شامل کرتا اور اس کا ایک ( ایسا ) دروازہ بنا تا جس سے لوگ اندر داخل ہو تے اور ایک دروازہ ( ایسا بنا تا ) جس سے باہر نکلتے ۔ ( ابن زبیر رضی اللہ تعالیٰ عنہ نے ) کہا آج میرے پاس اتنا مال ہے جو خرچ کرسکتا ہوں اور مجھے لوگوں کا خوف بھی نہیں ( عطاء نے ) کہا تو انھوں نے حطیم سے پانچ ہاتھ اس میں شامل کیے ( کھدا ئی کی ) حتیٰ کہ انھوں نے ابرا ہیمی ) بنیا د کو ظاہر کر دیا لوگوں نے بھی اسے دیکھا اس کے بعد انھوں نے اس پر عمارت بنا ئی کعبہ کا طول ( اونچا ئی ) اٹھا رہ ہاتھ تھی ( یہ اس طرح ہو ئی کہ ) جب انھوں نے ( حطیم کی طرف سے ) اس میں اضافہ کر دیا تو ( پھر ) انھیں ( پہلی اونچا ئی ) کم محسوس ہو ئی چنانچہ انھوں نے اس کی اونچا ئی میں دس ہاتھ کا اضافہ کر دیا اور اس کے دروازے بنائے ایک میں سے اندر دا خلہ ہو تا تھا اور دوسرے سے باہر نکلا جا تا تھا جب ابن زبیر رضی اللہ تعالیٰ عنہ قتل کر دیے گئے تو حجاج نے عبد الملک بن مروان کو اطلا ع دیتے ہو ئے خط لکھا اور اسے خبر دی کہ ابن زبیر رضی اللہ تعالیٰ عنہ نے اس کی تعمیر اس ( ابرا ہیمی ) بنیا دوں پر استورکی جسے اہل مکہ کے معتبر ( عدول ) لوگوں نے ( خود ) دیکھا عبد الملک نے اسے لکھا ۔ ہمارا ابن زبیر رضی اللہ تعالیٰ عنہ کے ردو بدل سے کو ئی تعلق نہیں البتہ انھوں نے اس کی اونچائی میں جو اضافہ کیا ہے اسے بر قرار رہنے دو اور جو انھوں نے حطیم کی طرف سے اس میں اضافہ کیا ہے اسے ( ختم کر کے ) اس کی سابقہ بنیا د پر لوٹا دو اور اس دروازے کو بند کر دو جو انھوں نے کھو لا ہے چنانچہ اس نے اسے گرادیا اس کی ( پچھلی ) بنیاد پر لو ٹا دیا ۔",
                "urduNarrator": "ہم سے ہناد بن السری نے بیان کیا، کہا ہم سے ابن ابی زایدہ نے بیان کیا، کہا کہ مجھ سے ابن ابی سلیمان نے بیان کیا, عطا ء سے روایت ہے انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ، أَخْبَرَنِي ابْنُ أَبِي سُلَيْمَانَ، عَنْ عَطَاءٍ، قَالَ: لَمَّا احْتَرَقَ الْبَيْتُ زَمَنَ يَزِيدَ بْنِ مُعَاوِيَةَ، حِينَ غَزَاهَا أَهْلُ الشَّامِ، فَكَانَ مِنْ أَمْرِهِ مَا كَانَ، تَرَكَهُ ابْنُ الزُّبَيْرِ حَتَّى قَدِمَ النَّاسُ الْمَوْسِمَ يُرِيدُ أَنْ يُجَرِّئَهُمْ - أَوْ يُحَرِّبَهُمْ - عَلَى أَهْلِ الشَّامِ، فَلَمَّا صَدَرَ النَّاسُ، قَالَ: يَا أَيُّهَا النَّاسُ، أَشِيرُوا عَلَيَّ فِي الْكَعْبَةِ، أَنْقُضُهَا ثُمَّ أَبْنِي بِنَاءَهَا؟ أَوْ أُصْلِحُ مَا وَهَى مِنْهَا؟ قَالَ ابْنُ عَبَّاسٍ: فَإِنِّي قَدْ فُرِقَ لِي رَأْيٌ فِيهَا، أَرَى أَنْ تُصْلِحَ مَا وَهَى مِنْهَا، وَتَدَعَ بَيْتًا أَسْلَمَ النَّاسُ عَلَيْهِ، وَأَحْجَارًا أَسْلَمَ النَّاسُ عَلَيْهَا، وَبُعِثَ عَلَيْهَا النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ ابْنُ الزُّبَيْرِ: لَوْ كَانَ أَحَدُكُمُ احْتَرَقَ بَيْتُهُ، مَا رَضِيَ حَتَّى يُجِدَّهُ، فَكَيْفَ بَيْتُ رَبِّكُمْ؟ إِنِّي مُسْتَخِيرٌ رَبِّي ثَلَاثًا، ثُمَّ عَازِمٌ عَلَى أَمْرِي، فَلَمَّا مَضَى الثَّلَاثُ أَجْمَعَ رَأْيَهُ عَلَى أَنْ يَنْقُضَهَا، فَتَحَامَاهُ النَّاسُ أَنْ يَنْزِلَ بِأَوَّلِ النَّاسِ يَصْعَدُ فِيهِ أَمْرٌ مِنَ السَّمَاءِ، حَتَّى صَعِدَهُ رَجُلٌ، فَأَلْقَى مِنْهُ حِجَارَةً، فَلَمَّا لَمْ يَرَهُ النَّاسُ أَصَابَهُ شَيْءٌ تَتَابَعُوا فَنَقَضُوهُ حَتَّى بَلَغُوا بِهِ الْأَرْضَ، فَجَعَلَ ابْنُ الزُّبَيْرِ أَعْمِدَةً، فَسَتَّرَ عَلَيْهَا السُّتُورَ حَتَّى ارْتَفَعَ بِنَاؤُهُ، وَقَالَ ابْنُ الزُّبَيْرِ: إِنِّي سَمِعْتُ عَائِشَةَ تَقُولُ: إِنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَوْلَا أَنَّ النَّاسَ حَدِيثٌ عَهْدُهُمْ بِكُفْرٍ، وَلَيْسَ عِنْدِي مِنَ النَّفَقَةِ مَا يُقَوِّي عَلَى بِنَائِهِ، لَكُنْتُ أَدْخَلْتُ فِيهِ مِنَ الْحِجْرِ خَمْسَ أَذْرُعٍ، وَلَجَعَلْتُ لَهَا بَابًا يَدْخُلُ النَّاسُ مِنْهُ، وَبَابًا يَخْرُجُونَ مِنْهُ»، قَالَ: «فَأَنَا الْيَوْمَ أَجِدُ مَا أُنْفِقُ، وَلَسْتُ أَخَافُ النَّاسَ»، قَالَ: فَزَادَ فِيهِ خَمْسَ أَذْرُعٍ مِنَ الْحِجْرِ حَتَّى أَبْدَى أُسًّا نَظَرَ النَّاسُ إِلَيْهِ، فَبَنَى عَلَيْهِ الْبِنَاءَ وَكَانَ طُولُ الْكَعْبَةِ ثَمَانِيَ عَشْرَةَ ذِرَاعًا، فَلَمَّا زَادَ فِيهِ اسْتَقْصَرَهُ، فَزَادَ فِي طُولِهِ عَشْرَ أَذْرُعٍ، وَجَعَلَ لَهُ بَابَيْنِ: أَحَدُهُمَا يُدْخَلُ مِنْهُ، وَالْآخَرُ يُخْرَجُ مِنْهُ . فَلَمَّا قُتِلَ ابْنُ الزُّبَيْرِ كَتَبَ الْحَجَّاجُ إِلَى عَبْدِ الْمَلِكِ بْنِ مَرْوَانَ يُخْبِرُهُ بِذَلِكَ وَيُخْبِرُهُ أَنَّ ابْنَ الزُّبَيْرِ قَدْ وَضَعَ الْبِنَاءَ عَلَى أُسٍّ نَظَرَ إِلَيْهِ الْعُدُولُ مِنْ أَهْلِ مَكَّةَ، فَكَتَبَ إِلَيْهِ عَبْدُ الْمَلِكِ: إِنَّا لَسْنَا مِنْ تَلْطِيخِ ابْنِ الزُّبَيْرِ فِي شَيْءٍ، أَمَّا مَا زَادَ فِي طُولِهِ فَأَقِرَّهُ، وَأَمَّا مَا زَادَ فِيهِ مِنَ الْحِجْرِ فَرُدَّهُ إِلَى بِنَائِهِ، وَسُدَّ الْبَابَ الَّذِي فَتَحَهُ، فَنَقَضَهُ وَأَعَادَهُ إِلَى بِنَائِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10810,
                "hadithNumber": "3246",
                "englishNarrator": "Abdullah bin 'Ubaid reported:",
                "hadithEnglish": "Harith bin 'Abdullah led a deputation to 'Abdul-Malik bin Marwan during his caliphate. 'Abdul-Malik said: I do riot think that Abu Khubaib (i.e. Ibn Zabair) had heard from 'A'isha (رضی اللہ تعالیٰ عنہا) (about the intended wish of the Prophet ﷺ In regard to the alteration of the Ka'ba). Harith said: Yes, I myself did hear from her. He ('Abdul-Malik) said: Well, tell me what you heard from her. He stated that she (Hadrat 'A'isha رضی اللہ تعالیٰ عنہا ) had said that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) remarked: Verily your people have reduced (the area) of the House from its (original foundations, and if they had not recently abandoned polytheism (and embraced Islam) I would have reversed it to (those foundations) which they had left out of it. nd if your people would take initiative after me in rebuilding it, then come along with me so that I should show you what they have left out of it. He showed her about fifteen cubits of area from the side of Hatim (that they had separated). This is the narration transmitted by 'Abdullah bin Ubaid. Walid bin 'Ata' has, however, made this addition to it: Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: I would have made two doors on the level of the ground (facing) the east and the west. Do you know why your people raised the level of its door (i. e. the door of the Ka'ba)? She said: No. He said: (They did it) out of vanity so that (they might be in a position) to grant admittance to him only whom they wished. When a person intended to get into it, they let him climb (the stairs), and as he was about to enter, they pushed him and he fell down. 'Abdul-Malik said to Harith; Did you yourself hear her saying this? He said: Yes. He (Harith) said that he ('Abdul-Malik) scratched the ground with his staff for some time and then said: I wish I had left his (Ibn Zubair's) work there.",
                "hadithUrdu": "حارث بن عبد اللہ ۔ عبد الملک بن مروان کی خلا فت کے دوران میں اس کے پاس آئے عبد الملک نے کہا : میرا خیال نہیں کہ ابو خبیب یعنی ابن زبیر رضی اللہ تعالیٰ عنہ حضرت عائشہ رضی اللہ تعالیٰ عنہا سے جو سننے کا دعویٰ کرتے تھے وہ ان سے سنا ہو ۔ حارث نے کہا : کیوں نہیں ! میں نے خود ان ( ( حضرت عائشہ رضی اللہ تعالیٰ عنہا ) سے سنا ہے اس نے کہا : تم نے اس سے سنا وہ کیا کہتی تھیں ؟ کہا : انھوں ( حضرت عائشہ رضی اللہ تعالیٰ عنہا ) نے کہا تھا رسول اللہ صلی اللہ علیہ وسلم نے فر ما ا : \"\" بلا شبہ تمھاریقوم نے ( اللہ کے گھر کی عمارت میں کمی کر دی اور اگر ان کا زمانہ شر ک قریب کا نہ ہو تا تو جو انھوں نے چھوڑ اتھا میں اسے دوبارہ بنا تا اور تمھا ری قوم کا اگر میرے بعد اسے دوبارہ بنا نے کا خیال ہو تو آؤ میں تمھیں دکھا ؤں انھوں نے اس میں سے کیا چھوڑ اتھا پھر آپ نے انھیں ساتھ ہاتھ کے قریب جگہ دکھا ئی ۔ یہ عبد اللہ بن عبید کی حدیث ہے ولید بن عطا ء نے اس میں یہ اضافہ کیا : نبی صلی اللہ علیہ وسلم نے فر ما یا : \"\" اور میں زمین سے لگے ہو ئے اس کے مشرقی اور مغربی دو دروازے بنا تا ۔ اور کیا تو جا نتی ہو تمھا ری قوم نے اس کے دروازے کو اونچا کیوں کیا ؟ \"\" ( حضرت عائشہ رضی اللہ تعالیٰ عنہا نے ) کہا میں نے عرض کی نہیں آپ نے فر ما یا : \"\" خود کو اونچا دکھا نے کے لیے تا کہ اس ( گھر ) میں صرف وہی داخل ہو جسے وہ چا ہیں جب کو ئی آدمی خود اس میں دا خل ہو نا چا ہتا تو وہ اسے ( سیڑھیاں ) چڑھنے دیتے حتیٰ کہ جب وہ داخل ہو نے لگتا تو وہ اسے دھکا دے دیتے اور وہ گر جا تا ۔ عبد الملک نے حارث سے کہا : تم نے خود انھیں یہ کہتے ہو ئے سنا ؟انھوں نے کہا : ہاں !کہا : تو اس نے گھڑی بھر اپنی چھڑی سے زمین کو کریدا ، پھر کہا : کا ش!میں انھیں ( ابن زبیر رضی اللہ تعالیٰ عنہ کو ) اور جس کا م کی ذمہ داری انھوں نے اٹھا ئی اسے چھوڑ دیتا ۔",
                "urduNarrator": "مجھ سے محمد بن حاتم نے بیان کیا، انہوں نے ہم سے بیان کیا محمد بن بکر نے ہمیں حدیث بیان کی ( کہا ) ہمیں ابن جریج نے خبر دی انھوں نے کہا : میں نے عبد اللہ بن عبید بن عمیر اور ولید بن عطاء سے سنا وہ دونوں حارث بن عبداللہ بن ابی عبد اللہ بن ابی ربیعہ سے حدیث بیان کر رہے تھے عبد اللہ بن عبید نے کہا",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ سَمِعْتُ عَبْدَ اللهِ بْنَ عُبَيْدِ بْنِ عُمَيْرٍ، وَالْوَلِيدَ بْنَ عَطَاءٍ، يُحَدِّثَانِ عَنِ الْحَارِثِ بْنِ عَبْدِ اللهِ بْنِ أَبِي رَبِيعَةَ، قَالَ عَبْدُ اللهِ بْنُ عُبَيْدٍ: وَفَدَ الْحَارِثُ بْنُ عَبْدِ اللهِ عَلَى عَبْدِ الْمَلِكِ بْنِ مَرْوَانَ فِي خِلَافَتِهِ، فَقَالَ عَبْدُ الْمَلِكِ: مَا أَظُنُّ أَبَا خُبَيْبٍ يَعْنِي ابْنَ الزُّبَيْرِ، سَمِعَ مِنْ عَائِشَةَ مَا كَانَ يَزْعُمُ أَنَّهُ سَمِعَهُ مِنْهَا، قَالَ الْحَارِثُ: بَلَى أَنَا سَمِعْتُهُ مِنْهَا، قَالَ: سَمِعْتَهَا تَقُولُ مَاذَا؟ قَالَ: قَالَتْ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ قَوْمَكِ اسْتَقْصَرُوا مِنْ بُنْيَانِ الْبَيْتِ، وَلَوْلَا حَدَاثَةُ عَهْدِهِمْ بِالشِّرْكِ، أَعَدْتُ مَا تَرَكُوا مِنْهُ، فَإِنْ بَدَا لِقَوْمِكِ مِنْ بَعْدِي أَنْ يَبْنُوهُ فَهَلُمِّي لِأُرِيَكِ مَا تَرَكُوا مِنْهُ»، فَأَرَاهَا قَرِيبًا مِنْ سَبْعَةِ أَذْرُعٍ، هَذَا حَدِيثُ عَبْدِ اللهِ بْنِ عُبَيْدٍ، وَزَادَ عَلَيْهِ الْوَلِيدُ بْنُ عَطَاءٍ، قَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «وَلَجَعَلْتُ لَهَا بَابَيْنِ مَوْضُوعَيْنِ فِي الْأَرْضِ شَرْقِيًّا وَغَرْبِيًّا، وَهَلْ تَدْرِينَ لِمَ كَانَ قَوْمُكِ رَفَعُوا بَابَهَا؟»، قَالَتْ: قُلْتُ: لَا، قَالَ: «تَعَزُّزًا أَنْ لَا يَدْخُلَهَا إِلَّا مَنْ أَرَادُوا، فَكَانَ الرَّجُلُ إِذَا هُوَ أَرَادَ أَنْ يَدْخُلَهَا يَدَعُونَهُ يَرْتَقِي، حَتَّى إِذَا كَادَ أَنْ يَدْخُلَ دَفَعُوهُ فَسَقَطَ»، قَالَ عَبْدُ الْمَلِكِ، لِلْحَارِثِ: أَنْتَ سَمِعْتَهَا تَقُولُ هَذَا؟ قَالَ: نَعَمْ، قَالَ: فَنَكَتَ سَاعَةً بِعَصَاهُ، ثُمَّ قَالَ: وَدِدْتُ أَنِّي تَرَكْتُهُ وَمَا تَحَمَّلَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10811,
                "hadithNumber": "3247",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Juraij with the same chain of transmitters.",
                "hadithUrdu": "ہم سے محمد بن عمرو بن جبلہ نے بیان کیا، انہوں نے بیان کیا ابو عاصم اور عبد الرزاق دونوں نے ابن جریج سے اسی سند کے ساتھ ( محمد ) بن بکر کی حدیث کے مانند حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ عَمْرِو بْنِ جَبَلَةَ، حَدَّثَنَا أَبُو عَاصِمٍ، ح وحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، كِلَاهُمَا عَنِ ابْنِ جُرَيْجٍ، بِهَذَا الْإِسْنَادِ. مِثْلَ حَدِيثِ ابْنِ بَكْرٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10812,
                "hadithNumber": "3248",
                "englishNarrator": "Abu Qaza'ah reported:",
                "hadithEnglish": "While Abdul-Malik bin Marwan was circumambulating the Ka'ba he said: May Allah ruin Ibn Zubair that he lies in attributing to the Mother of the Faithful, as he says: I heard her stating that Allah's Messenger (ﷺ) had said: 'A'isha, if your people had not been new converts to Islam, I would have demolished the House and would have added (in it area) from the Hijr for your people have reduced the area from its foundations. Harith bin 'Abdullah bin Abu Rabi'a said: Commander of the Faithful, don't say that, for I heard the Mother of the Faithful saying this, whereupon he said: If I had heard this before demolishing it, I would have left it in the state in which Ibn Zabair رضی اللہ تعالیٰ عنہ had built it.",
                "hadithUrdu": "عبد الملک بن مروان جب بیت اللہ کا طواف کر رہا تھا تو اس نے کہا : اللہ ابن زبیر کو ہلا ک کرے کہ وہ ام المومنین پر جھوٹ بو لتا ہے وہ کہتا ہے میں نے انھیں یہ کہتے ہو ئے سنا کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا \"\" اے عائشہ رضی اللہ تعالیٰ عنہا !تمھا ری قوم کے کفر کا زمانہ قریب کا نہ ہو تا تو میں بیت اللہ کو گرا تا حتیٰ کہ اس میں حطیم میں سے ( کچھ حصہ ) بڑھا دیتا بلا شبہ تمھا ری قوم نے اس کی عمارت کو کم کر دیا ہے ۔ اس پر حارث بن عبد اللہ بن ابی ربیعہ نے کہا : امیر المومنین ایسا نہ کہیے ۔ میں نے خود امیر المو منین سے سنا ہے وہ یہ حدیث بیا ن کر رہی تھیں ۔ ( عبد الملک نے ) کہا اگر میں نے یہ بات اسے گرا نے سے پہلے سن لی ہو تی تو میں اسے اسی طرح چھوڑ دیتا جس طرح ابن زبیر رضی اللہ تعالیٰ عنہ نے بنا یا تھا ۔",
                "urduNarrator": "مجھ سے محمد بن حاتم نے بیان کیا، ہم سے عبداللہ بن بکر سہمی نے بیان کیا، ہم سے حاتم بن ابی صغیرہ نے بیان کیا, ابو قزعہ سے روایت ہے کہ",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا عَبْدُ اللهِ بْنُ بَكْرٍ السَّهْمِيُّ، حَدَّثَنَا حَاتِمُ بْنُ أَبِي صَغِيرَةَ، عَنْ أَبِي قَزَعَةَ، أَنَّ عَبْدَ الْمَلِكِ بْنَ مَرْوَانَ بَيْنَمَا هُوَ يَطُوفُ بِالْبَيْتِ إِذْ قَالَ: قَاتَلَ اللهُ ابْنَ الزُّبَيْرِ حَيْثُ يَكْذِبُ عَلَى أُمِّ الْمُؤْمِنِينَ، يَقُولُ: سَمِعْتُهَا تَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «يَا عَائِشَةُ لَوْلَا حِدْثَانُ قَوْمِكِ بِالْكُفْرِ لَنَقَضْتُ الْبَيْتَ حَتَّى أَزِيدَ فِيهِ مِنَ الْحِجْرِ، فَإِنَّ قَوْمَكِ قَصَّرُوا فِي الْبِنَاءِ»، فَقَالَ الْحَارِثُ بْنُ عَبْدِ اللهِ بْنِ أَبِي رَبِيعَةَ: لَا تَقُلْ هَذَا يَا أَمِيرَ الْمُؤْمِنِينَ، فَأَنَا سَمِعْتُ أُمَّ الْمُؤْمِنِينَ تُحَدِّثُ هَذَا قَالَ: لَوْ كُنْتُ سَمِعْتُهُ قَبْلَ أَنْ أَهْدِمَهُ، لَتَرَكْتُهُ عَلَى مَا بَنَى ابْنُ الزُّبَيْرِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10813,
                "hadithNumber": "3249",
                "englishNarrator": "A'isha (رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "I asked Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) about the wall, circumpassing the House (i. e. whether the wall on the side of Hijr was included in the Ka'ba). He said, Yes. I said: Then why did they not include it in the House? He said: 'Your people ran short of the means (to do so). I said: Why is it that the level of its door is raised high? He said: Your people did it so that they should admit one whom they liked, and forbid him whom they disliked, and if your people were not new converts to faith, and I did not apprehend that their hearts would feel agitated at this. I would have definitely included (the area of) this wall-in the House and would have brought the door to the level of the ground.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم سے ( حطیم کی ) دیوار کے بارے میں دریا فت کیا کیا وہ بیت اللہ میں سے ہے ؟آپ ننے فرما یا ہاں ۔ \" میں نے عرض کی : تو انھوں نے اسے بیت اللہ میں شامل کیوں نہیں کیا ؟ آپ نے فر ما یا : \" تمھا ری قوم کے پاس خرچ کم پڑگیا تھا ۔ میں نے عرض کی اس کا دروازہ کیوں اونچا ہے ؟ آپ نے فر ما یا : \" یہ کا م تمھا ری قوم نے کیا تا کہ جسے چا ہیں اندر دا خل ہو نے دیں اور جسے چاہیں منع کر دیں اگر تمھا ری قوم کا زمانہ جاہلیت کے قریب کا نہ ہو تا اس وجہ سے میں ڈرتا ہوں کہ ان کے دل اسے ناپسند کریں گے تو میں اس پر غور کرتا کہ ( حطیم کی ) دیوار کو بیت اللہ میں شامل کردوں اور اس کے دروازے کو زمین کے ساتھ ملا دوں.",
                "urduNarrator": "ہم سے سعید بن منصور نے بیان کیا، انہوں نے کہا ابو حوص نے ہمیں حدیث بیان کی ( کہا ) ہمیں اشعت بن ابو شعثاء نے اسود بن یزید سے حدیث بیان کی انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، حَدَّثَنَا أَبُو الْأَحْوَصِ، حَدَّثَنَا أَشْعَثُ بْنُ أَبِي الشَّعْثَاءِ، عَنِ الْأَسْوَدِ بْنِ يَزِيدَ، عَنْ عَائِشَةَ، قَالَتْ: سَأَلْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ الْجَدْرِ أَمِنَ الْبَيْتِ هُوَ؟ قَالَ: «نَعَمْ»، قُلْتُ: فَلِمَ لَمْ يُدْخِلُوهُ فِي الْبَيْتِ؟ قَالَ: «إِنَّ قَوْمَكِ قَصَّرَتْ بِهِمِ النَّفَقَةُ»، قُلْتُ: فَمَا شَأْنُ بَابِهِ مُرْتَفِعًا؟ قَالَ: «فَعَلَ ذَلِكِ قَوْمُكِ لِيُدْخِلُوا مَنْ شَاءُوا، وَيَمْنَعُوا مَنْ شَاءُوا، وَلَوْلَا أَنَّ قَوْمَكِ حَدِيثٌ عَهْدُهُمْ فِي الْجَاهِلِيَّةِ، فَأَخَافُ أَنْ تُنْكِرَ قُلُوبُهُمْ، لَنَظَرْتُ أَنْ أُدْخِلَ الْجَدْرَ فِي الْبَيْتِ، وَأَنْ أُلْزِقَ بَابَهُ بِالْأَرْضِ».",
                "headingArabic": "جَدْرِ الْكَعْبَةِ وَبَابِهَا ‏‏",
                "headingUrdu": "کعبہ کی دیوار اور دروازہ",
                "headingEnglish": "The wall and the door of the Ka'bah",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 10501,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=420",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=418",
                "label": "418",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=419",
                "label": "419",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=420",
                "label": "420",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=421",
                "label": "421",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=422",
                "label": "422",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=423",
                "label": "423",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=424",
                "label": "424",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=422",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=422",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=420",
        "to": 10525,
        "total": 40465
    }
}