{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 538,
        "data": [
            {
                "id": 13714,
                "hadithNumber": "6151",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "While a Jew was selling goods, he was given something which he did not accept or he did not agree (to accept) that 'Abdul 'Azlz (one of the narrators) is doubtful about it. He (the Jew) said: By Allah, Who chose Moses (peace be upon him) among mankind. A person from the Ansar heard it and gave a blow at his face saying: (You have the audacity) to say: By Him Who chose Moses amongst mankind, whereas Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) is living amongst us. The Jew went to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and said: Abu'l-Qasim, I am a Dhimmi and (thus need your protection) by a covenant, and added: Such and such person has given a blow upon my face. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Why did you give a blow on his face? He said: Allah's Messenger, this man said: By Him Who chose Moses (peace be upon him) amongst mankind, whereas you are living amongst us. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) became angry and signs of anger could be seen on his face, and then said: Don't make distinction amongst the Prophets of Allah. When the horn will be blown and whatever is in the heavens and the earth would swoon but he whom Allah grants exception, then another horn will be blown and I would be the first amongst those who would recover and Moses (علیہ السلام) would be catching hold of the Throne and I do not know whether it is a compensation for that when he swooned on the Day of Tur or he would be resurrected before me and I do not say that anyone is more excellent than Yunus son of Matta (علیہ السلام).",
                "hadithUrdu": "ایک بار ایک یہودی اپنا سامان بیچ رہا تھا اس کو اس کے کچھ معاوضے کی پیش کش کی گئی جو اسے بری لگی یا جس پر وہ راضی نہ ہوا ۔ شک عبد العزیز کو ہوا ۔ وہ کہنے لگا نہیں ، اس ذات کی قسم جس نے موسیٰ علیہ السلام کو تمام انسانوں پر فضیلت دی !انصار میں سے ایک شخص نے اس کی بات سن لی تو اس کے چہرے پر تھپڑلگا یا ، کہا : تم کہتے ہو ۔ اس ذات کی قسم جس نے موسیٰ علیہ السلام کو تمام انسانوں پر فضیلت دی!جبکہ رسول اللہ صلی اللہ علیہ وسلم ( تشریف لا چکے اور ) ہمارے درمیان مو جو د ہیں ۔ کہا : تو وہ یہودی رسول اللہ صلی اللہ علیہ وسلم کے پاس آگیا اور کہنے لگا : ابو القاسم !میری ذمہ داری لی گئی ہے اور ہم سے ( سلامتی کا ) وعدہ کیا گیا ہے ۔ اور کہا : فلا ں شخص نے میرے منہ پر تھپڑ مارا ہے ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے اس سے کہا : \" تم نے اس کے منہ پر تھپڑ کیوں مارا ؟کہا کہ اس نے کہا تھا ۔ اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! ۔ اس ذات کی قسم جس نے حضرت موسیٰ کہا : کو تمام انسانوں پر فضیلت دی ہے جبکہ آپ ہمارے درمیان مو جود ہیں تو رسول اللہ صلی اللہ علیہ وسلم کو غصہ آگیا اور آپ کے چہرہ مبارک سے غصےکا پتہ چلنے لگا ، پھر آپ نے فر ما یا : \" اللہ کے نبیوں کے مابین ( انھیں ایک دوسرے پر ) فضیلت نہ دیا کرو اس لیے کہ جب صور پھونکا جا ئے گا تو سوائے ان کے جنھیں اللہ چا ہے گا آسمانوں اور زمین میں جو مخلوق ہے سب کے ہوش و حواس جا تے رہیں گے ، پھر دوبارہ صور پھونکا جا ئے گا ، تو سب سے پہلے جسے اٹھا یا جا ئے گا وہ میں ہو ں گا یا ( فرمایا ) جنھیں سب سے پہلے اٹھا یا جا ئے گا میں ان میں ہو ں گا ۔ تو ( میں دیکھوں گا ۔ کہ ) حضرت موسیٰ علیہ السلام عرش کو پکڑ ے ہو ئے ہوں گے ، مجھے معلوم نہیں کہ ان کے لیے یوم طور کی بے ہو شی کو شمار کیا جا ئے گا ۔ ( اور وہ اس کے عوض اس بے ہوشی سےمستثنیٰ ہو ں گے ، ) یاانھیں مجھ سے پہلے ہی اٹھا یا جا ئے گا ، میں ( یہ بھی ) نہیں کہتا کہ کو ئی ( نبی ) یو نس بن متی علیہ السلام سے افضل ہے ۔ \"",
                "urduNarrator": "مجھ سے زہیر بن حرب نے کہا, حجین بن مثنیٰ نے کہا : ہمیں عبد العز یز بن عبد اللہ بن ابی سلمہ نے عبد اللہ بن فضل ہاشمی سے حدیث بیان کی ، انھوں نے عبد الرحمٰن اعرج سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا حُجَيْنُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللهِ بْنِ أَبِي سَلَمَةَ، عَنْ عَبْدِ اللهِ بْنِ الْفَضْلِ الْهَاشِمِيِّ، عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: بَيْنَمَا يَهُودِيٌّ يَعْرِضُ سِلْعَةً لَهُ أُعْطِيَ بِهَا شَيْئًا، كَرِهَهُ أَوْ لَمْ يَرْضَهُ - شَكَّ عَبْدُ الْعَزِيزِ - قَالَ: لَا، وَالَّذِي اصْطَفَى مُوسَى عَلَيْهِ السَّلَامُ عَلَى الْبَشَرِ قَالَ: فَسَمِعَهُ رَجُلٌ مِنَ الْأَنْصَارِ فَلَطَمَ وَجْهَهُ، قَالَ: تَقُولُ: وَالَّذِي اصْطَفَى مُوسَى عَلَيْهِ السَّلَامُ عَلَى الْبَشَرِ وَرَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَيْنَ أَظْهُرِنَا؟ قَالَ فَذَهَبَ الْيَهُودِيُّ إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: يَا أَبَا الْقَاسِمِ إِنَّ لِي ذِمَّةً وَعَهْدًا، وَقَالَ: فُلَانٌ لَطَمَ وَجْهِي، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لِمَ لَطَمْتَ وَجْهَهُ؟» قَالَ: قَالَ - يَا رَسُولَ اللهِ - وَالَّذِي اصْطَفَى مُوسَى عَلَيْهِ السَّلَامُ عَلَى الْبَشَرِ وَأَنْتَ بَيْنَ أَظْهُرِنَا، قَالَ: فَغَضِبَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حَتَّى عُرِفَ الْغَضَبُ فِي وَجْهِهِ، ثُمَّ قَالَ: لَا تُفَضِّلُوا بَيْنَ أَنْبِيَاءِ اللهِ، فَإِنَّهُ يُنْفَخُ فِي الصُّورِ فَيَصْعَقُ مَنْ فِي السَّمَاوَاتِ وَمَنْ فِي الْأَرْضِ إِلَّا مَنْ شَاءَ اللهُ، قَالَ: ثُمَّ يُنْفَخُ فِيهِ أُخْرَى، فَأَكُونُ أَوَّلَ مَنْ بُعِثَ، أَوْ فِي أَوَّلِ مَنْ بُعِثَ، فَإِذَا مُوسَى عَلَيْهِ السَّلَامُ آخِذٌ بِالْعَرْشِ، فَلَا أَدْرِي أَحُوسِبَ بِصَعْقَتِهِ يَوْمَ الطُّورِ، أَوْ بُعِثَ قَبْلِي، وَلَا أَقُولُ: إِنَّ أَحَدًا أَفْضَلُ مِنْ يُونُسَ بْنِ مَتَّى عَلَيْهِ السَّلَامُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13715,
                "hadithNumber": "6152",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Abu Salama with the same chain of transmitters.",
                "hadithUrdu": "مجھ سے محمد بن حاتم نے کہا, یزید بن ہارون نے کہا , ہمیں عبد العزیز بن ابی سلمہ نے اسی سند سے بالکل اسی طرح بیان کیا ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِيهِ مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ، بِهَذَا الْإِسْنَادِ سَوَاءً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13716,
                "hadithNumber": "6153",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Two persons, one from amongst the Jews and the other from amongst the Muslims, fell into dispute and began to abuse one another. The Muslim said: By Him Who chose Muhammad ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) in the worlds. And the Jew said: By Him Who chose Moses in the worlds. Thereupon the Muslim lifted his hand and slapped at the face of the Jew. The Jew went to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and told him about his affair and the affair of the Muslim. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Don't make me superior to Moses for mankind will swoon and I would be the first to recover from it and Moses would be at that time seizing the side of the Throne and I do not know (whether) he would swoon and would recover before me or Allah would make an exception for him.",
                "hadithUrdu": "دوآدمیوں کی تکرار ہو گئی ، ایک یہودیوں میں سے تھا اور ایک مسلمانوں میں سے ۔ مسلمان نے کہا : اس ذات کی قسم جس میں محمد صلی اللہ علیہ وسلم کو تمام جہانوں پر فضیلت دی! یہودی نے کہا : اس ذات کی قسم! جس نے موسیٰ علیہ السلام کو تمام جہانوں پر فضیلت دی!تو اس پر مسلمان نے اپنا ہاتھ اٹھا یا اور یہودی کے منہ پر تھپڑ مار دیا ۔ یہودی رسول اللہ صلی اللہ علیہ وسلم کے پاس چلا گیا اور اس کے اپنے اور مسلمان کے درمیان جو کچھ ہوا تھا وہ سب آپ کو بتا دیا ، اس پر رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" مجھے موسیٰ علیہ السلام پر فضیلت نہ دو ( جب ) تمام انسان ہوش و حواس سے بے گانہ ہو جا ئیں گے ، سب سے پہلے میں ہو ش میں آؤں گا تو موسیٰ علیہ السلام عرش کی ایک جانب ( اسے ) پکڑے کھڑے ہوں گے ۔ مجھے معلوم نہیں کہ وہ مجھ سے پہلے بے ہوش ہو ئے تھے ، اس لیے مجھ سے پہلے اٹھا ئے گئے یا وہ ان میں سے ہیں جنھیں اللہ نے إِلَّا مَن شَاءَ اللَّهُ ۖسوائے ان کے جنھیں اللہ چاہے گا ۔ کے تحت ) مستثنیٰ کیا ہے ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب اور ابوبکر بن النضر نے بیان کیا، انہوں نے کہا: یعقوب کے والد ابرا ہیم ( بن سعد ) نے ابن شہاب سے ، انھوں نے ابو سلمہ بن عبد الرحمٰن اور عبدالرحمٰن اعرج سے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَأَبُو بَكْرِ بْنُ النَّضْرِ، قَالَا: حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، وَعَبْدِ الرَّحْمَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: اسْتَبَّ رَجُلَانِ رَجُلٌ مِنَ الْيَهُودِ وَرَجُلٌ مِنَ الْمُسْلِمِينَ فَقَالَ: الْمُسْلِمُ وَالَّذِي اصْطَفَى مُحَمَّدًا صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى الْعَالَمِينَ وَقَالَ الْيَهُودِيُّ: وَالَّذِي اصْطَفَى مُوسَى عَلَيْهِ السَّلَامُ عَلَى الْعَالَمِينَ قَالَ فَرَفَعَ الْمُسْلِمُ يَدَهُ عِنْدَ ذَلِكَ، فَلَطَمَ وَجْهَ الْيَهُودِيِّ، فَذَهَبَ الْيَهُودِيُّ إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَأَخْبَرَهُ بِمَا كَانَ مِنْ أَمْرِهِ وَأَمْرِ الْمُسْلِمِ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تُخَيِّرُونِي عَلَى مُوسَى، فَإِنَّ النَّاسَ يَصْعَقُونَ فَأَكُونُ أَوَّلَ مَنْ يُفِيقُ، فَإِذَا مُوسَى بَاطِشٌ بِجَانِبِ الْعَرْشِ، فَلَا أَدْرِي أَكَانَ، فِيمَنْ صَعِقَ فَأَفَاقَ قَبْلِي أَمْ كَانَ مِمَّنِ اسْتَثْنَى اللهُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13717,
                "hadithNumber": "6154",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: A person from amongst the Muslims and a person from amongst the Jews fell into dispute and reviled each other. The rest of the hadith is the same.",
                "hadithUrdu": "مسلمانوں میں سے ایک شخص اور یہودیوں میں سے ایک شخص کے درمیان تکرار ہو ئی ، جس طرح شہاب سے ابرا ہیم بن سعد کی روایت کردہ حدیث ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن عبدالرحمٰن الدارمی اور ابوبکر بن اسحاق نے بیان کیا، کہا کہ ہم سے ابو الیمان نے بیان کیا,شعیب نے زہری سے روایت کی ، کہا : مجھے ابوسلمہ بن عبد الرحمٰن اور سعید بن مسیب نے خبر دی ، انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنَا عَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، وَأَبُو بَكْرِ بْنُ إِسْحَاقَ، قَالَا: أَخْبَرَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، وَسَعِيدُ بْنُ الْمُسَيِّبِ، عَنْ أَبِي هُرَيْرَةَ قَالَ: اسْتَبَّ رَجُلٌ مِنَ الْمُسْلِمِينَ، وَرَجُلٌ مِنَ الْيَهُودِ بِمِثْلِ حَدِيثِ إِبْرَاهِيمَ بْنِ سَعْدٍ، عَنِ ابْنِ شِهَابٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13718,
                "hadithNumber": "6155",
                "englishNarrator": "Abu Sa'id Khudri رضی اللہ عنہ reported:",
                "hadithEnglish": "A Jew who had received a blow at his face came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) ; the rest of the hadith is the same, up to the hand (where the words are): That he (the Holy Prophet) said: I do not know whether he would be one who would fall into swoon and would recover before me or he would be compensated for his swooning at Tur (and thus he would not swoon on this occasion) of Resurrection.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم کے پاس ایک شخص آیا جس کے چہرے پر تھپڑ مارا گیا تھا ۔ اس کے بعد زہری کی روایت کے ہم معنی حدیث بیان کی ، مگر انھوں نے ( یوں ) کہا : ( رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ) \"\" مجھے معلوم نہیں وہ ( موسیٰ علیہ السلام ) ان میں سے تھے جنھیں بے ہوشی تو ہو ئی لیکن افاقہ مجھ سے پہلے ہو گیا ۔ یا کوہ طور کا صعقہ کافی سمجھا گیا ۔ \"\"",
                "urduNarrator": "عمرو الناقد نے مجھ سے کہا, ابو احمد زبیری نے کہا : ہمیں سفیان نے عمرو بن یحییٰ سے ، انھوں نےاپنے والد سے ، انھوں نے حضرت ابو سعید خدری رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وحَدَّثَنِي عَمْرٌو النَّاقِدُ، حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ يَحْيَى، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: جَاءَ يَهُودِيٌّ إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَدْ لُطِمَ وَجْهُهُ وَسَاقَ الْحَدِيثَ بِمَعْنَى حَدِيثِ الزُّهْرِيِّ، غَيْرَ أَنَّهُ قَالَ: «فَلَا أَدْرِي أَكَانَ مِمَّنْ صَعِقَ فَأَفَاقَ قَبْلِي، أَوِ اكْتَفَى بِصَعْقَةِ الطُّورِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13719,
                "hadithNumber": "6156",
                "englishNarrator": "Abu Sa'id Kudari رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) having, said this: Don't make distinction amongst the Apostles. This hadith has been narrated through another chain of transmitters also.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" انبیاء علیہ السلام کے درمیان کسی کو دوسرے پر بہتر قرار نہ دو ۔ \" اور ابن نمیر کی حدیث ( کی سند ) میں ہے : عمرو بن یحییٰ نے کہا : مجھے میرےوالد نے حدیث سنائی ۔",
                "urduNarrator": "ابو بکر بن ابی شیبہ نے کہا , ہمیں وکیع نے سفیان سے حدیث بیان کی ، ابن نمیر نے کہا : ہمیں میرے والد نے حدیث بیان کی ، کہا : ہمیں سفیان نے عمرو بن یحییٰ سے ، انھوں نے اپنے والد سے ، انھوں نے حضرت ابو سعید خدری رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ يَحْيَى، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تُخَيِّرُوا بَيْنَ الْأَنْبِيَاءِ» وَفِي حَدِيثِ ابْنِ نُمَيْرٍ، عَمْرِو بْنِ يَحْيَى، حَدَّثَنِي أَبِي.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13720,
                "hadithNumber": "6157",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: I came. And in the narration transmitted on the authority of Haddab (the words are): I happened to pass by Moses on the occasion of the Night journey near the red mound (and found him) saying his prayer in his grave.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : معراج کی شب میں سرخ ٹیلے کے قریب آیا ۔ اور ہداب کی روایت میں ہے ۔ میں موسیٰ علیہ السلام کے پاس سے گزرا وہ اپنی قبر میں کھڑے نماز پڑھ رہے تھے ۔ \"",
                "urduNarrator": "ہداب بن خالد اور شیبان بن فروخ نے کہا : ہمیں حماد بن سلمہ نے ثابت بنانی اور سلیمان تیمی سے حدیث بیان کی ، انھوں نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ، وَشَيْبَانُ بْنُ فَرُّوخَ، قَالَا: حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ الْبُنَانِيِّ، وَسُلَيْمَانَ التَّيْمِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: أَتَيْتُ - وَفِي رِوَايَةِ هَدَّابٍ: مَرَرْتُ - عَلَى مُوسَى لَيْلَةَ أُسْرِيَ بِي عِنْدَ الْكَثِيبِ الْأَحْمَرِ، وَهُوَ قَائِمٌ يُصَلِّي فِي قَبْرِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13721,
                "hadithNumber": "6158",
                "englishNarrator": "Anas رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: I happened to pass by Moses as he was busy in saying prayer in his grave, and in the hadith transmitted on the authority of 'Isa there is an addition of these words:, I happened to pass on the occasion of the Night journey.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" میں حضرت موسیٰ علیہ السلام کے پاس سے گزرا وہ اپنی قبر میں نماز پڑھ رہے تھے ۔ \" اور عیسیٰ کی حدیث میں مزید یہ ہے : \" جس رات مجھے اسراء پر لے جا یا گیا میں ( موسیٰ علیہ السلام کے قریب سے ) گزرا ۔ \"",
                "urduNarrator": "ہم سے علی بن خشرم نے بیان کیا, عیسیٰ بن یونس جریر اور سفیان نے سلیمان تیمی سے روایت کی ، کہا : میں نے حضرت انس رضی اللہ عنہ سے سنا ، کہہ رہے تھے کہ",
                "hadithArabic": "وَحَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ، أَخْبَرَنَا عِيسَى يَعْنِي ابْنَ يُونُسَ، ح وَحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، كِلَاهُمَا عَنْ سُلَيْمَانَ التَّيْمِيِّ، عَنْ أَنَسٍ، ح وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ سُفْيَانَ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، سَمِعْتُ أَنَسًا، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَرَرْتُ عَلَى مُوسَى وَهُوَ يُصَلِّي فِي قَبْرِهِ» وَزَادَ فِي حَدِيثِ عِيسَى «مَرَرْتُ لَيْلَةَ أُسْرِيَ بِي».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13722,
                "hadithNumber": "6159",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger (ﷺ) as saying that Allah, the Exalted and Majestic, said: It is not meet for a servant of Mine that he should say: I am better than Yunus bin Matta ( علیہ السلام). Ibn Abi Shaybah said: Muhammad bin Ja'far narrated from Shu'bah.",
                "hadithUrdu": "\" اس نے فر ما یا : ۔ یعنی اللہ تبارک وتعا لیٰ نے ۔ ۔ ۔ کسی بندے کو جو میرا ہے ۔ ۔ ۔ ابن مثنیٰ نے کہا : میرے کسی بندے کو ۔ ۔ ۔ نہیں چا ہیے کہ وہ کہے : میں یو نس بن متیٰ علیہ السلام سے بہتر ہوں ۔ \" ابن ابی شیبہ نے کہا : محمد بن جعفر نے شعبہ سے روایت کی ۔",
                "urduNarrator": "ابو بکر بن ابی شیبہ محمد بن مثنیٰ اور محمد بن بشار نے کہا : ہمیں محمد بن جعفر نے حدیث بیان کی کہا : ہمیں شعبہ نے سعد بن ابرا ہیم سے روایت کی ، انھوں نے کہا : میں نے حمید بن عبد الرحمٰن کو حضرت ابو ہریرہ رضی اللہ عنہ سے حدیث بیان کرتے ہو ئے سنا ، انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالُوا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، قَالَ: سَمِعْتُ حُمَيْدَ بْنَ عَبْدِ الرَّحْمَنِ، يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، أَنَّهُ قَالَ - يَعْنِي اللهَ تَبَارَكَ وَتَعَالَى - لَا يَنْبَغِي لِعَبْدٍ لِي - وقَالَ ابْنُ الْمُثَنَّى: لِعَبْدِي - أَنْ يَقُولَ: أَنَا خَيْرٌ مِنْ يُونُسَ بْنِ مَتَّى عَلَيْهِ السَّلَامُ قَالَ: ابْنُ أَبِي شَيْبَةَ مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ شُعْبَةَ.",
                "headingArabic": "فِي ذِكْرِ يُونُسَ عَلَيْهِ السَّلاَمُ وَقَوْلِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ لاَ يَنْبَغِي لِعَبْ",
                "headingUrdu": "یونس علیہ السلام اور رسول اللہ صلی اللہ علیہ وسلم کے ارشادات: \"کوئی یہ نہ کہے کہ میں یونس بن متی سے بہتر ہوں۔\"",
                "headingEnglish": "Yunus علیہ السلام, And The Words Of The Prophet (SAW): \"No One Should Say: I Am Better Than Yunus Bin Matta.\"",
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13723,
                "hadithNumber": "6160",
                "englishNarrator": "Abu al-Aliya said:",
                "hadithEnglish": "The son of the uncle of your Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), i.e. Ibn Abbas رضی اللہ عنہ , reported Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: It is not meet for a servant that he should say: I am better than Yunus bin Matta (and this Matta) is the name of his father.",
                "hadithUrdu": "تمھارے نبی صلی اللہ علیہ وسلم کے چچا کے بیٹے ( حضرت ابن عباس رضی اللہ عنہ ) نے مجھے نبی صلی اللہ علیہ وسلم سے حدیث بیان کی ، کہ آپ صلی اللہ علیہ وسلم نے فرما یا : \" کسی بندے کو زیب نہیں دیتا کہ وہ کہے : میں یو نس بن متیٰ علیہ السلام سے افضل ہوں ۔ \" آپ نے ان کے والد کی نسبت سے ان کا نام لیا ۔",
                "urduNarrator": "قتادہ سے روایت ہے کہا : میں نے ابو العالیہ سے سنا ، وہ کہہ رہے تھے",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ - وَاللَّفْظُ لِابْنِ الْمُثَنَّى - قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، قَالَ: سَمِعْتُ أَبَا الْعَالِيَةِ، يَقُولُ: حَدَّثَنِي ابْنُ عَمِّ نَبِيِّكُمْ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَعْنِي ابْنَ عَبَّاسٍ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: مَا يَنْبَغِي لِعَبْدٍ أَنْ يَقُولَ: أَنَا خَيْرٌ مِنْ يُونُسَ بْنِ مَتَّى وَنَسَبَهُ إِلَى أَبِيهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13724,
                "hadithNumber": "6161",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "It was said to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as to who was the most worthy of respect amongst people. He said: The most God-conscious amongst you They said: It is not this that we are asking about, whereupon he said: Then he is Yusuf علیہ السلام, the Apostle of Aliah and the son of Allah's Apostle, Ya'qub, who was also the son of Allah's Apostle, the friend of Allah (Ibrahim علیہ السلام) They said: This is not what we are asking you. He said: You mean the tribes of Arabia? Those who are good in pre-Islamic days are good in Islam (after embracing Islam) when they get an understanding of it.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم سے عرض کی گئی ، اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! لو گوں میں سب سے زیادہ کریم ( معزز ) کو ن ہے؟آپ نے فر ما یا : \" جو ان میں سب سے زیادہ متقی ہو ۔ \" صحابہ کرام رضوان اللہ عنھم اجمعین نے کہا : ہم اس کے متعلق آپ سے نہیں پوچھ رہے ۔ آپ نے فر ما یا : \" تو ( پھر سب سے بڑھ کر کریم ) اللہ کے نبی حضرت یوسف علیہ السلام ہیں اللہ کے نبی کے بیٹے ہیں وہ ( ان کے والد ) بھی اللہ کے نبی کے بیٹے ہیں اور وہ اللہ کے خلیل ( حضرت ابرا ہیم علیہ السلام ) کے بیٹے ہیں ۔ \" صحابہ کرام رضوان اللہ عنھم اجمعین نے کہا : ہم اس کے بارے میں بھی آپ سے نہیں پو چھ رہے ۔ آپ نے فرما یا : \" پھر تم قبائل عرب کے حسب و نسب کے بارے میں مجھ سے پو چھ رہے ہو ۔ ؟جو لوگ جاہلیت میں اچھے تھے وہ اسلام میں بھی اچھے ہیں اگر دین کو سمجھ لیں ۔ \"",
                "urduNarrator": "ہم سے زہیر بن حرب، محمد بن المثنی اور عبید اللہ بن سعید نے بیان کیا، انہوں نے کہا کہ ہم سے یحییٰ بن سعید نے بیان کیا، عبید اللہ سے سعید نے بیان کیا۔ ابن ابی سعید اپنے والد کی سند سے, حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہا",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَعُبَيْدُ اللهِ بْنُ سَعِيدٍ، قَالُوا: حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عُبَيْدِ اللهِ، أَخْبَرَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قِيلَ يَا رَسُولَ اللهِ مَنْ أَكْرَمُ النَّاسِ؟ قَالَ: «أَتْقَاهُمْ» قَالُوا: لَيْسَ عَنْ هَذَا نَسْأَلُكَ، قَالَ: «فَيُوسُفُ نَبِيُّ اللهِ ابْنُ نَبِيِّ اللهِ ابْنِ نَبِيِّ اللهِ ابْنِ خَلِيلِ اللهِ» قَالُوا: لَيْسَ عَنْ هَذَا نَسْأَلُكَ، قَالَ «فَعَنْ مَعَادِنِ الْعَرَبِ تَسْأَلُونِي؟ خِيَارُهُمْ فِي الْجَاهِلِيَّةِ خِيَارُهُمْ فِي الْإِسْلَامِ، إِذَا فَقُهُوا».",
                "headingArabic": "مِنْ فَضَائِلِ يُوسُفَ عَلَيْهِ السَّلاَمُ ‏‏",
                "headingUrdu": "حضرت یوسف علیہ السلام کے فضائل",
                "headingEnglish": "The Virtues Of Yusuf, علیہ السلام",
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13725,
                "hadithNumber": "6162",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسل ‌) as saying: Zakariyya was a carpenter.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" حضرت زکریا  ( پیشے کے اعتبار سے ) بڑھئی تھے ۔ \"",
                "urduNarrator": "ہم سے حداب بن خالد نے بیان کیا، کہا ہم سے حماد بن سلمہ نے بیان کیا، ثابت کی سند سے، ابو رافع نے, حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے ۔ کہ",
                "hadithArabic": "حَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «كَانَ زَكَرِيَّاءُ نَجَّارًا».",
                "headingArabic": "فضائل زکریا علیہ السلام",
                "headingUrdu": "فضائل زکریا علیہ السلام",
                "headingEnglish": "The Virtues Of Zakariyya, علیہ السلام",
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13726,
                "hadithNumber": "6163",
                "englishNarrator": "Sa'id bin jubair reported:",
                "hadithEnglish": "I said to Ibn Abbas رضی اللہ عنہما that Nauf al-Bikali was of the opinion that Moses (علیہ السلام ), the Apostle of Bani Isra'il, was not the same who accompanied Khadir, whereupon he said: The enemy of Allah tells a lie. I heard Ubayy bin Ka'b رضی اللہ عنہ say: Moses (علیہ السلام ) stood up to give sermon to the people of Isra'il. He was asked as to who amongst the people has the best knowledge, whereupon he said: I have the best knowledge. Thereupon Allah was annoyed with him that he did not attribute (the best knowledge) to Him. He revealed to him: A servant amongst My servants is at the junction of two rivers who has more knowledge than yours. Moses said: How can I meet him? It was said to him: Carry a fish in the large basket and the place where you find it missing there you will find him. Thereupon Moses proceeded forth along with a young man (Yusha'). Joshua b. Nan and Moses (علیہ السلام ) put the fish in the basket and there went along with him the young man (Yusha') until they came to a certain rock and Moses and his companion went to sleep and the fish stirred in that basket and fell into the ocean and Allah stopped the current of water like a vault until the way was made for the fish. Moses and his youn. companion were astonished and they walked for the rest of the day and the night and the friend of Moses forgot to inform him of this incident. When it was morning, Moses (علیہ السلام ) said to the young man: Bring for us the breakfast for we are dead tired because of this journey, and they did not feel exhausted until they had passed that place where they had been commanded (to stay). He said: Don't you know that when we reached the Sakhra (rock) I forgot the fisii and noth ng made me forget it but the satan that I. could nit remember it? How strange is it that the fish found a way in the river? Moses said: That was what we had been aiming at. Then both of them retraced their steps until they reached Sakhra; there they saw a man covered with a cloth. Moses greeted him. Khadir said to him: Where is as-Salam in our country.? He said: I am Moses, whereupon he (Khadir) said: You mean the Moses of Bani Isra'il? He said: Yes. He (Khadir) said: You have a knowledge out of the knowledge of Allah which in fact Allah imparted to you and about that I know nothing and I have knowledge out of Allah's knowledge which He imparted to me and about that you do not know. Moses (علیہ السلام ) said to him: May I follow you so that you may teach me that with which you have been taught righteousness. He said: You will not be able to bear with me; how you will be able to bear that about which you do not know? Moses said: Thou wilt find me patient, nor shalt I disobey you in aught. Khadir said to him: If you were to follow me, then do not ask me about anything until I myself speak to you about it. He said: Yes. So Khadir and Moses set forth on the bank of the river that there came before them a boat. Both of theni talked to them (the owners of the boat) so that they might carry both of them. They had recognised Khadir and they carried them free. Khadir thereupon took hold of a plank in the boat and broke it away. Moses said: These people have carried us without any charge and you attempt to break their boat so that the people sailing in the boat may drown. This is (something) grievous that you have done. He said: Did I not say that you would not bear with me? He said: Blame me not for what I forgot and be not hard upon what I did. Then both of them got down from the boat and began to walk along the coastline that they saw a boy who had been playing with other boys. Khadir pulled up his head and killed him. Moses said: Have you killed an innocent person who is in no way guilty of slaying another? You have done something horrible. Thereupon he said: Did I not say to you that you will not be able to bear with me? He (Moses) said: This (act) is more grievous than the first one. He (Moses) further said. If I ask you about anything after this, keep not company with me, then you would no doubt find (a plausible) excuse for this. Then they both walked on until they reached the inhabitants of a village. They asked its inhabitants for food but they refused to entertain them as their guests. They found in it a wall which had been bent on one side and was about to fall. Khadir set it right with his own hand. Moses, said to him: It is the people to whom we came but they showed us no hospitality and they did not serve us food. If you wish you can get wages for it. He (Khadir) said: This is the parting of ways between mt and you. Now I wish to reveal to you the significance of that for which you could not bear with me. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said. May Allah have mercy upon Moses! I wish if Moses could show patience and a (fuller) story of both of them could have been told. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said that the first thing which Moses said was out of forgetfulness. Then there came a sparrow until it perched on the wall of the boat and took water from the ocean. Thereupon, Khadir said: My knowledge and your knowledge in comparison with the knowledge of Allah is even less than the water taken by the sparrow in its beak in comparison to the water of the ocean, and Sa'id bin jubair رضی اللہ عنہ used to recite (verses 79 and 80 of Sura Kahf) in this way: There was before them a king who used to seize every boat by force which was in order, the boy was an unbeliever.",
                "hadithUrdu": "میں نے سیدنا ابن عباس رضی اللہ عنہما سے کہا کہ نوف بکالی کہتا ہے کہ سیدنا موسیٰ علیہ السلام جو بنی اسرائیل کے پیغمبر تھے ، وہ اور ہیں اور جو موسیٰ خضر علیہ السلام کے پاس گئے تھے وہ اور ہیں انہوں نے کہا کہ اللہ کا دشمن جھوٹ بولتا ہے ۔ میں نے سیدنا ابی بن کعب رضی اللہ عنہ سے سنا ، وہ کہتے تھے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم فرماتے تھے کہ سیدنا موسیٰ علیہ السلام اپنی قوم بنی اسرائیل پر خطبہ پڑھنے کو کھڑے ہوئے ، ان سے پوچھا گیا کہ سب لوگوں میں زیادہ علم کس کو ہے؟ انہوں نے کہا کہ مجھ کو ہے ( یہ بات اللہ تعالیٰ کو ناپسند ہوئی ) پس اللہ تعالیٰ نے ان پر اس وجہ سے ناراضگی کا اظہار کیا کہ انہوں نے یہ نہیں کہا کہ اللہ تعالیٰ خوب جانتا ہے ۔ پھر اللہ تعالیٰ نے ان کو وحی بھیجی کہ دو دریاؤں کے ملاپ پر میرا ایک بندہ ہے ، وہ تجھ سے زیادہ عالم ہے سیدنا موسیٰ علیہ السلام نے عرض کیا کہ اے پروردگار! میں اس سے کیسے ملوں؟ حکم ہوا کہ ایک مچھلی زنبیل ( ٹوکرے ) میں رکھ ، جہاں وہ مچھلی گم ہو جائے ، وہیں وہ بندہ ملے گا ۔ یہ سن کر سیدنا موسیٰ علیہ السلام اپنے ساتھی یوشع بن نون علیہ السلام کو ساتھ لے کر چلے اور انہوں نے ایک مچھلی زنبیل میں رکھ لی ۔ دونوں چلتے چلتے صخرہ ( ایک مقام ہے ) کے پاس پہنچے تو سیدنا موسیٰ علیہ السلام اور ان کے ساتھی سو گئے ۔ مچھلی تڑپی یہاں تک کہ زنبیل سے نکل کر دریا میں جا پڑی اور اللہ تعالیٰ نے پانی کا بہنا اس پر سے روک دیا ، یہاں تک کہ پانی کھڑا ہو کر طاق کی طرح ہو گیا اور مچھلی کے لئے خشک راستہ بن گیا ۔ سیدنا موسیٰ علیہ السلام اور ان کے ساتھی کے لئے تعجب ہوا پھر دونوں چلے دن بھر اور رات بھر اور موسیٰ علیہ السلام کے ساتھی مچھلی کا حال ان سے کہنا بھول گئے جب صبح ہوئی تو موسیٰ علیہ السلام نے اپنے ساتھی سے کہا کہ ہمارا ناشتہ لاؤ ، ہم تو اس سفر سے تھک گئے ہیں اور تھکاوٹ اسی وقت ہوئی جب اس جگہ سے آگے بڑھے جہاں جانے کا حکم ہوا تھا ۔ انہوں نے کہا کہ آپ کو معلوم نہیں کہ جب ہم ( مقام ) صخرہ پر اترے تو میں مچھلی بھول گیا اور شیطان نے مجھے بھلایا اور تعجب ہے کہ اس مچھلی نے دریا میں جانے کی راہ لی ۔ سیدنا موسیٰ علیہ السلام نے کہا کہ ہم تو اسی مقام کو ڈھونڈھتے تھے ، پھر دونوں اپنے پاؤں کے نشانوں پر لوٹے یہاں تک کہ صخرہ پر پہنچے ۔ وہاں ایک شخص کو کپڑا اوڑھے ہوئے دیکھا تو سیدنا موسیٰ علیہ السلام نے ان کو سلام کیا تو انہوں نے کہا کہ تمہارے ملک میں سلام کہاں سے ہے؟ سیدنا موسیٰ علیہ السلام نے کہا کہ میں موسیٰ ہوں ۔ انہوں نے کہا کہ بنی اسرائیل کے موسیٰ؟ سیدنا موسیٰ نے کہا کہ ہاں ۔ سیدنا خضر علیہ السلام نے کہا کہ تمہیں اللہ تعالیٰ نے وہ علم دیا ہے جو میں نہیں جانتا ۔ اور مجھے وہ علم دیا ہے جو تم نہیں جانتے سیدنا موسیٰ علیہ السلام نے کہا کہ میں تمہارے ساتھ رہنا چاہتا ہوں اس لئے کہ مجھے وہ علم سکھلاؤ جو تمہیں دیا گیا ہے ۔ سیدنا خضر علیہ السلام نے کہا کہ تم میرے ساتھ صبر نہ کر سکو گے اور تم سے اس بات پر کیسے صبر ہو سکے گا جس کو تم نہیں جانتے ہو ۔ سیدنا موسیٰ علیہ السلام نے کہا کہ اگر اللہ نے چاہا تو تم مجھے صابر پاؤ گے اور میں کسی بات میں تمہاری نافرمانی نہیں کروں گا ۔ سیدنا خضر علیہ السلام نے کہا کہ اچھا اگر میرے ساتھ ہوتے ہو تو مجھ سے کوئی بات نہ پوچھنا جب تک میں خود اس کا ذکر نہ کروں ۔ سیدنا موسیٰ علیہ السلام نے کہا کہ بہت اچھا ۔ پس خضر علیہ السلام اور سیدنا موسیٰ علیہ السلام دونوں سمندر کے کنارے چلے جاتے تھے کہ ایک کشتی سامنے سے نکلی ، دونوں نے کشتی والوں سے کہا کہ ہمیں بٹھا لو ، انہوں نے سیدنا خضر علیہ السلام کو پہچان لیا اور دونوں کو بغیر کرایہ چڑھا لیا ۔ سیدنا خضر علیہ السلام نے اس کشتی کا ایک تختہ اکھاڑ ڈالا ۔ سیدنا موسیٰ علیہ السلام نے کہا کہ ان لوگوں نے تو ہمیں بغیر کرایہ کے چڑھایا اور تم نے ان کی کشتی کو توڑ ڈالا تاکہ کشتی والوں کو ڈبو دو ، یہ تم نے بڑا بھاری کام کیا ۔ سیدنا خضر علیہ السلام نے کہا کہ کیا میں نہیں کہتا تھا کہ تم میرے ساتھ صبر نہ کر سکو گے؟ سیدنا موسیٰ علیہ السلام نے کہا کہ بھول چوک پر مت پکڑو اور مجھ پر تنگی مت کرو ۔ پھر دونوں کشتی سے باہر نکلے اور سمندر کے کنارے چلے جاتے تھے کہ ایک لڑکا ملا جو اور لڑکوں کے ساتھ کھیل رہا تھا ، سیدنا خضر علیہ السلام نے اس کا سر پکڑ کر اکھیڑ لیا اور مار ڈالا ۔ سیدنا موسیٰ علیہ السلام نے کہا کہ تم نے ایک بےگناہ کو ناحق مار ڈالا ، یہ تو بہت برا کام کیا ۔ سیدنا خضر علیہ السلام نے کہا کہ کیا میں نہ کہتا تھا کہ تم میرے ساتھ صبر نہ کر سکو گے؟ اور یہ کام پہلے کام سے بھی زیادہ سخت تھا ۔ سیدنا موسیٰ علیہ السلام نے کہا کہ اب میں تم سے کسی بات پر اعتراض کروں تو مجھے اپنے ساتھ نہ رکھنا بیشک تمہارا اعتراض بجا ہو گا ۔ پھر دونوں چلے یہاں تک کہ ایک گاؤں میں پہنچے ، گاؤں والوں سے کھانا مانگا تو انہوں نے انکار کیا ، پھر ایک دیوار ملی جو گرنے کے قریب تھی اور جھک گئی تھی ، سیدنا خضر علیہ السلام نے اس کو اپنے ہاتھ سے سیدھا کر دیا ۔ سیدنا موسیٰ علیہ السلام نے کہا کہ ان گاؤں والوں سے ہم نے کھانا مانگا اور انہوں نے انکار کیا اور کھانا نہ کھلایا ( ایسے لوگوں کا کام مفت کرنا کیا ضروری تھا؟ ) اگر تم چاہتے تو اس کی مزدوری لے سکتے تھے ۔ سیدنا خضر علیہ السلام نے کہا کہ بس ، اب میرے اور تمہارے درمیان جدائی ہے ، اب میں تم سے ان باتوں کا مطلب کہے دیتا ہوں جن پر تم سے صبر نہ ہو سکا ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ موسیٰ علیہ السلام پر رحم کرے ، مجھے آرزو ہے کہ کاش وہ صبر کرتے اور ہمیں ان کی اور باتیں معلوم ہوتیں ۔ اور آپ صلی اللہ علیہ وسلم نے فرمایا کہ پہلی بات سیدنا موسیٰ علیہ السلام نے بھولے سے کی ۔ پھر ایک چڑیا آئی اور کشتی کے کنارے پر بیٹھی اور اس نے سمندر میں چونچ ڈالی ، سیدنا خضر علیہ السلام نے کہا کہ میں نے اور تم نے اللہ تعالیٰ کے علم میں سے اتنا ہی علم سیکھا ہے جتنا اس چڑیا نے سمندر میں سے پانی کم کیا ہے ۔ سیدنا سعید بن جبیر نے کہا کہ سیدنا ابن عباس رضی اللہ عنہما اس طرح پڑھتے تھے کہ ”ان کشتی والوں کے آگے ایک بادشاہ تھا جو ہر ثابت کشتی کو ناحق جبر سے چھین لیتا تھا“ اور پڑھتے تھے کہ ”وہ لڑکا کافر تھا“ ۔",
                "urduNarrator": "عمرو بن محمد ناقد ، اسحاق بن ابراہیم حنظلی ، عبیداللہ بن سعید اور محمد بن ابی عمر مکی ، ان سب نے ہمیں ابن عیینہ سے حدیث بیان کی ۔ الفاظ ابن ابی عمر کے ہیں ۔ سفیان بن عیینہ نے کہا : ہمیں عمرو بن دینار نے سعید بن جبیر سے حدیث بیان کی ، انھوں نے کہا : کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ مُحَمَّدٍ النَّاقِدُ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، وَعُبَيْدُ اللهِ بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ أَبِي عُمَرَ الْمَكِّيُّ، كُلُّهُمْ عَنِ ابْنِ عُيَيْنَةَ، وَاللَّفْظُ لِابْنِ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ: قُلْتُ لِابْنِ عَبَّاسٍ: إِنَّ نَوْفًا الْبِكَالِيَّ يَزْعُمُ أَنَّ مُوسَى عَلَيْهِ السَّلَامُ، صَاحِبَ بَنِي إِسْرَائِيلَ لَيْسَ هُوَ مُوسَى صَاحِبَ الْخَضِرِ، عَلَيْهِ السَّلَامُ، فَقَالَ: كَذَبَ عَدُوُّ اللهِ، سَمِعْتُ أُبَيَّ بْنَ كَعْبٍ يَقُولُ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: قَامَ مُوسَى عَلَيْهِ السَّلَامُ خَطِيبًا فِي بَنِي إِسْرَائِيلَ فَسُئِلَ: أَيُّ النَّاسِ أَعْلَمُ؟ فَقَالَ: أَنَا أَعْلَمُ، قَالَ فَعَتَبَ اللهُ عَلَيْهِ إِذْ لَمْ يَرُدَّ الْعِلْمَ إِلَيْهِ، فَأَوْحَى اللهُ إِلَيْهِ: أَنَّ عَبْدًا مِنْ عِبَادِي بِمَجْمَعِ الْبَحْرَيْنِ هُوَ أَعْلَمُ مِنْكَ، قَالَ مُوسَى: أَيْ رَبِّ كَيْفَ [ص:1848] لِي بِهِ؟ فَقِيلَ لَهُ: احْمِلْ حُوتًا فِي مِكْتَلٍ، فَحَيْثُ تَفْقِدُ الْحُوتَ فَهُوَ ثَمَّ، فَانْطَلَقَ وَانْطَلَقَ مَعَهُ فَتَاهُ، وَهُوَ يُوشَعُ بْنُ نُونٍ، فَحَمَلَ مُوسَى عَلَيْهِ السَّلَامُ، حُوتًا فِي مِكْتَلٍ وَانْطَلَقَ هُوَ وَفَتَاهُ يَمْشِيَانِ حَتَّى أَتَيَا الصَّخْرَةَ، فَرَقَدَ مُوسَى عَلَيْهِ السَّلَامُ وَفَتَاهُ، فَاضْطَرَبَ الْحُوتُ فِي الْمِكْتَلِ، حَتَّى خَرَجَ مِنَ الْمِكْتَلِ، فَسَقَطَ فِي الْبَحْرِ، قَالَ وَأَمْسَكَ اللهُ عَنْهُ جِرْيَةَ الْمَاءِ حَتَّى كَانَ مِثْلَ الطَّاقِ، فَكَانَ لِلْحُوتِ سَرَبًا، وَكَانَ لِمُوسَى وَفَتَاهُ عَجَبًا، فَانْطَلَقَا بَقِيَّةَ يَوْمِهِمَا وَلَيْلَتِهِمَا، وَنَسِيَ صَاحِبُ مُوسَى أَنْ يُخْبِرَهُ، فَلَمَّا أَصْبَحَ مُوسَى عَلَيْهِ السَّلَامُ، قَالَ لِفَتَاهُ: آتِنَا غَدَاءَنَا لَقَدْ لَقِينَا مِنْ سَفَرِنَا هَذَا نَصَبًا، قَالَ وَلَمْ يَنْصَبْ حَتَّى جَاوَزَ الْمَكَانَ الَّذِي أُمِرَ بِهِ، قَالَ: أَرَأَيْتَ إِذْ أَوَيْنَا إِلَى الصَّخْرَةِ، فَإِنِّي نَسِيتُ الْحُوتَ وَمَا أَنْسَانِيهُ إِلَّا الشَّيْطَانُ أَنْ أَذْكُرَهُ وَاتَّخَذَ سَبِيلَهُ فِي الْبَحْرِ عَجَبًا، قَالَ مُوسَى: {ذَلِكَ مَا كُنَّا نَبْغِ فَارْتَدَّا عَلَى آثَارِهِمَا قَصَصًا} [الكهف: 64]، قَالَ يَقُصَّانِ آثَارَهُمَا، حَتَّى أَتَيَا الصَّخْرَةَ، فَرَأَى رَجُلًا مُسَجًّى عَلَيْهِ بِثَوْبٍ، فَسَلَّمَ عَلَيْهِ مُوسَى، فَقَالَ لَهُ الْخَضِرُ: أَنَّى بِأَرْضِكَ السَّلَامُ؟ قَالَ: أَنَا مُوسَى، قَالَ: مُوسَى بَنِي إِسْرَائِيلَ؟ [ص:1849] قَالَ: نَعَمْ، قَالَ: إِنَّكَ عَلَى عِلْمٍ مِنْ عِلْمِ اللهِ عَلَّمَكَهُ اللهُ لَا أَعْلَمُهُ، وَأَنَا عَلَى عِلْمٍ مِنْ عِلْمِ اللهِ عَلَّمَنِيهِ لَا تَعْلَمُهُ، قَالَ لَهُ مُوسَى عَلَيْهِ السَّلَامُ: (هَلْ أَتَّبِعُكَ عَلَى أَنْ تُعَلِّمَنِي مِمَّا عُلِّمْتَ رُشْدًا. قَالَ: إِنَّكَ لَنْ تَسْتَطِيعَ مَعِيَ صَبْرًا. وَكَيْفَ تَصْبِرُ عَلَى مَا لَمْ تُحِطْ بِهِ خُبْرًا. قَالَ سَتَجِدُنِي إِنْ شَاءَ اللهُ صَابِرًا وَلَا أَعْصِي لَكَ أَمْرًا) قَالَ لَهُ الْخَضِرُ {فَإِنِ اتَّبَعْتَنِي فَلَا تَسْأَلْنِي عَنْ شَيْءٍ حَتَّى أُحْدِثَ لَكَ مِنْهُ ذِكْرًا} [الكهف: 70]، قَالَ: نَعَمْ، فَانْطَلَقَ الْخَضِرُ وَمُوسَى يَمْشِيَانِ عَلَى سَاحِلِ الْبَحْرِ، فَمَرَّتْ بِهِمَا سَفِينَةٌ، فَكَلَّمَاهُمْ أَنْ يَحْمِلُوهُمَا، فَعَرَفُوا الْخَضِرَ فَحَمَلُوهُمَا بِغَيْرِ نَوْلٍ، فَعَمَدَ الْخَضِرُ إِلَى لَوْحٍ مِنْ أَلْوَاحِ السَّفِينَةِ فَنَزَعَهُ، فَقَالَ لَهُ مُوسَى: قَوْمٌ حَمَلُونَا بِغَيْرِ نَوْلٍ، عَمَدْتَ إِلَى سَفِينَتِهِمْ فَخَرَقْتَهَا {لِتُغْرِقَ أَهْلَهَا لَقَدْ جِئْتَ شَيْئًا إِمْرًا قَالَ أَلَمْ أَقُلْ إِنَّكَ لَنْ تَسْتَطِيعَ مَعِيَ صَبْرًا قَالَ لَا تُؤَاخِذْنِي بِمَا نَسِيتُ وَلَا تُرْهِقْنِي مِنْ أَمْرِي عُسْرًا} [الكهف: 72]، ثُمَّ خَرَجَا مِنَ السَّفِينَةِ، فَبَيْنَمَا هُمَا يَمْشِيَانِ عَلَى السَّاحِلِ إِذَا غُلَامٌ يَلْعَبُ مَعَ الْغِلْمَانِ، فَأَخَذَ الْخَضِرُ بِرَأْسِهِ، فَاقْتَلَعَهُ بِيَدِهِ، فَقَتَلَهُ، فَقَالَ مُوسَى: (أَقَتَلْتَ نَفْسًا زَاكِيَةً بِغَيْرِ نَفْسٍ لَقَدْ جِئْتَ شَيْئًا نُكْرًا. قَالَ أَلَمْ أَقُلْ لَكَ إِنَّكَ لَنْ تَسْتَطِيعَ مَعِيَ صَبْرًا) قَالَ: وَهَذِهِ أَشَدُّ مِنَ الْأُولَى، {قَالَ إِنْ سَأَلْتُكَ عَنْ شَيْءٍ بَعْدَهَا فَلَا تُصَاحِبْنِي، قَدْ بَلَغْتَ مِنْ لَدُنِّي عُذْرًا، فَانْطَلَقَا حَتَّى إِذَا أَتَيَا أَهْلَ قَرْيَةٍ اسْتَطْعَمَا أَهْلَهَا فَأَبَوْا أَنْ يُضَيِّفُوهُمَا، فَوَجَدَا فِيهَا جِدَارًا يُرِيدُ أَنْ يَنْقَضَّ فَأَقَامَهُ} [الكهف: 76]، يَقُولُ مَائِلٌ، قَالَ الْخَضِرُ بِيَدِهِ هَكَذَا فَأَقَامَهُ، قَالَ لَهُ مُوسَى: قَوْمٌ أَتَيْنَاهُمْ فَلَمْ يُضَيِّفُونَا وَلَمْ يُطْعِمُونَا، لَوْ شِئْتَ لَتَخِذْتَ عَلَيْهِ أَجْرًا، قَالَ: هَذَا فِرَاقُ بَيْنِي وَبَيْنِكَ، سَأُنَبِّئُكَ بِتَأْوِيلِ مَا لَمْ تَسْتَطِعْ عَلَيْهِ صَبْرًا قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «يَرْحَمُ اللهُ مُوسَى، لَوَدِدْتُ أَنَّهُ كَانَ صَبَرَ حَتَّى يُقَصَّ عَلَيْنَا مِنْ أَخْبَارِهِمَا»، قَالَ: وَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «كَانَتِ الْأُولَى مِنْ مُوسَى نِسْيَانًا»، قَالَ: وَجَاءَ عُصْفُورٌ حَتَّى وَقَعَ عَلَى حَرْفِ السَّفِينَةِ، ثُمَّ نَقَرَ فِي الْبَحْرِ، فَقَالَ لَهُ الْخَضِرُ: مَا نَقَصَ عِلْمِي وَعِلْمُكَ مِنْ عِلْمِ اللهِ إِلَّا مِثْلَ مَا نَقَصَ هَذَا الْعُصْفُورُ مِنَ الْبَحْرِ قَالَ سَعِيدُ بْنُ جُبَيْرٍ: وَكَانَ يَقْرَأُ: «وَكَانَ أَمَامَهُمْ مَلِكٌ يَأْخُذُ كُلَّ سَفِينَةٍ صَالِحَةٍ غَصْبًا» وَكَانَ يَقْرَأُ: «وَأَمَّا الْغُلَامُ فَكَانَ كَافِرًا».",
                "headingArabic": "مِنْ فَضَائِلِ الْخَضِرِ عَلَيْهِ السَّلاَمُ ‏‏",
                "headingUrdu": "فضائل الخدیر علیہ السلام",
                "headingEnglish": "The Virtues Of Al-Khadir, علیہ السلام",
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13727,
                "hadithNumber": "6164",
                "englishNarrator": "Sa,id bin jubair reported:",
                "hadithEnglish": "It was said to Ibn 'Abbas رضی اللہ عنہ that Nauf al-Bikali was of the opinion that Moses who went in search of knowledge was not the Moses of Bani Isra'il. He said: Sa'id, did you hear it from him? I said: Yes. Thereupon he said that Nauf had not stated the fact.",
                "hadithUrdu": "حضرت ابن عباس رضی اللہ عنہ سے کہا گیا کہ نوف سمجھتا ہے ۔ کہ جو موسیٰ علیہ السلام علم کے حصول کے لئے گئے تھے وہ بنی اسرائیل کے موسیٰ علیہ السلام نہ تھے ، حضرت ابن عباس رضی اللہ عنہ نے کہا : سعید!کیا آپ نے خود اس سے سنا ہے؟میں نے کہا : جی ہاں ، حضرت ابن عباس رضی اللہ تعالیٰ عنہ نے کہا : نوف نے جھوٹ کہا ۔",
                "urduNarrator": "مجھ سے محمد بن عبد الاعلٰی القیسی نے بیان کیا، معتمر کے والد سلیمان تیمی نے رقبہ سے ، انھوں نے ابو اسحق سے انھوں نے سعید بن جبیر سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى الْقَيْسِيُّ، حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ التَّيْمِيُّ، عَنْ أَبِيهِ، عَنْ رَقَبَةَ، عَنْ أَبِي إِسْحَاقَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ: قِيلَ لِابْنِ عَبَّاسٍ: إِنَّ نَوْفًا يَزْعُمُ أَنَّ مُوسَى الَّذِي ذَهَبَ يَلْتَمِسُ الْعِلْمَ لَيْسَ بِمُوسَى بَنِي إِسْرَائِيلَ، قَالَ: أَسَمِعْتَهُ يَا سَعِيدُ؟ قُلْتُ: نَعَمْ، قَالَ: كَذَبَ نَوْفٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13728,
                "hadithNumber": "6165",
                "englishNarrator": "",
                "hadithEnglish": "Ubayy b. Ka'b narrated to us that he had heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Moses had been delivering sermons to his people. And he made this remark: No person upon the earth has better knowledge than I or nothing better than mine. Thereupon Allah revealed to him: I know one who is better than you (in knowledge) or there is a person on the earth having more knowledge than you. Thereupon he said: My Lord, direct me to him. It was said to him: Keep a salted fish as a provision for journey. The place where that fish would be lost (there you will find that man). So he set forth and a young slave along with him until they came to a place Sakhra. but he did not find any clue. So he proceeded on and left that young man there. The fish began to stir in water and the water assumed the form of an ark over the fish. The young man said: I should meet Allah's Apostle (peace be upon him) and inform him, but he was made to forget and when they had gone beyond that place, he (Moses) said to the young man: Bring breakfast. We have been exhausted because of the journey, and he (Moses) was not exhausted until he had crossed that (particular) place (where he had) to meet Khadir, and the youth was reminded and said: Did you not see that as we reached Sakhra I forgot the fish and it is satan alone who has made me forgetful of it'? It is strange that he has been able to find way in the ocean too. He said: This is what we sought for us. They returned retracing their steps, and he (his companion) pointed to him the location (where) the fish (had been lost). Moses began to search him there. He suddenly saw Khadir wrapped in a cloth and lying on his back. He said to him: As-Salamu-'Alaikum. He removed the cloth from his face and said: Wa 'Alaikum-us-Salam! Who are you? He said: I am Moses. He said: Who Moses? He said: Moses Of Bani Isra'il. He said: What brought you here? He said: I have come so that you may teach me what you have been taught of righteousness. He said: You shall have to bear with me, and how can you have patience about a thing of which you have no comprehensive knowledge? You will not have patience when you see me doing a thing I have been ordered to do. He said: If Allah pleases, you will find me patient, nor shall I disobey you in aught. Khadir said: If you follow me, don't ask me about anything until I explain it to you. So they went on until they embarked upon a boat. He (Khadir) made a hole in that. Thereupon he (Moses) said: You have done this so that you may drown the persons sitting in the boat. You have done something grievous. Thereupon he said: Did I not tell you that you will not be able to bear with me? Thereupon he (Moses) said: Blame me not for what I forgot and be not hard upon me for what I did. (Khadir gave him another chance.) So they went on until they reached a place where boys were playing. He went to one of them and caught hold'of one (apparently) at random and killed him. Moses (peace be upon him) felt agitated and said: You have killed an innocent person not guilty of slaying another. You have done something aboininable. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: May Allah have mercy upon us and Moses. Had he shown patience he would have seen wonderful things, but fear of blame, with respect to his companion, seized him and he said: If I ask anything after this, keep not company with me. You will then have a valid excuse in my case, and had he (Moses) shown patience he would have seen many wonderful things. He (the narrator) said: Whenever he (the Holy Prophet) made mention of any Prophet, he always said: May there be mercy of Allah upon us and upon my brother so and so. They, however, proceeded on until they came to the inhabitants of a village who were very miserly. They went to the meeting places and asked for hospitality but they refused to show any hospitality to them. They both found in that village a wall which was about to fall. He (Khadir) set it right. Thereupon he (Moses) said: If you so liked. you could get wages for it. Thereupon he said: This is the partince, of ways between me and you, and, taking hold of his cloth, he said: Now I will explain to you the real significance (of all these acts) for which you could not show patience. As for the boat, it belonged to the poor people working on the river and I intended to damage it for there was ahead of them (a king) who seized boats by force. (When he came) to catch hold of it he found it a damaged boat, so he spared it (and later on) it was set right with wood. So far as the boy is concerned, he has been, by very nature, an unbeliever, whereas his parents loved him very much. Had he grown up he would have involved them in wrongdoing and unbelief, so we wished that their Lord should give them in its place one better in purity and close to mercy. And as for the wall it belonged to two orphan boys in the city and there was beneath it a (treasure) belongin to them,... up to the last verse.",
                "hadithUrdu": "حضرت ابی ابن کعب رضی اللہ تعالیٰ عنہ نے ہمیں حدیث سنائی ، کہا : میں نےرسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا : \" ایک دن موسیٰ علیہ السلام اپنے لوگوں میں بیٹھے انھیں اللہ کے دن یاد دلارہے تھے ( اور ) اللہ کے دنوں سے مراد اللہ کی نعمتیں اوراس کی آزمائشیں ہیں ، اس وقت انھوں نے ( ایک سوال کے جواب میں ) کہا : میرے علم میں اس وقت روئے زمین پر مجھ سے بہتر اور مجھ سے زیادہ علم رکھنے والا اور کوئی نہیں ، اس پر اللہ تعالیٰ نے ان کی طرف وحی کی کہ میں اس شخص کو جانتاہوں جوان ( موسیٰ علیہ السلام ) سے بہتر ہےیا ( فرمایا : ) جس کے پاس ان سے بڑھ کر ہے زمین پر ایک آدمی ہے جو آپ سے بڑھ کر عالم ہے ۔ ( موسیٰ علیہ السلام نے ) کہا : میرے پروردگار مجھے اس کا پتہ بتائیں ، ( رسول اللہ صلی اللہ علیہ وسلم نے ) فرمایا : ان سے کہا گیا : ایک نمکین مچھلی کا زاد راہ لے لیں ، وہ آدمی وہیں ہوگا جہاں آپ سے وہ مچھلی گم ہوجائے گی ۔ فرمایا : موسیٰ علیہ السلام اور ان کا نوجوان ساتھی چل پڑے ، یہاں تک کہ وہ ایک چٹان کے پاس پہنچے تو ان ( حضرت موسیٰ علیہ السلام ) پر ایک طرح کی بے خبری طاری ہو گئی اور وہ اپنے جوان کو چھوڑ کر آگے چلے گئے ۔ مچھلی ( زندہ ہو کر ) تڑپی اور پانی میں چلی گئی ۔ پانی اس کے اوپر اکٹھا نہیں ہو رہا تھا ، ایک طاقچے کی طرح ہو گیا تھا ۔ اس نو جوان نے ( اس مچھلی کو پانی میں جاتا ہوا دیکھ لیا اور ) کہا : کیا میں اللہ کے نبی ( موسیٰ علیہ السلام ) کے پاس پہنچ کر انھیں اس بات کی خبر نہ دوں!فرمایا : پھر اسے بھی یہ بات بھلا دی گئی ۔ جب وہ آگے نکل گئے تو انھوں نے اپنے جوان سے کہا : ہمارا دن کا کھانا لے آؤ ، اس سفر میں ہمیں بہت تھکاوٹ ہوگئی فرمایا : ان کو اس وقت تک تھکاوٹ محسوس نہ ہوئی تھی ۔ یہاں تک کہ وہ ( اس جگہ سے ) آگے نکل گئے تھے ۔ فرمایا : تو اس ( جوان ) کو یادآگیا اور اس نے کہا : آپ نے دیکھا کہ جب ہم چٹان کے پاس بیٹھے تھے تو میں مچھلی بھول گیا اور مجھے شیطان ہی نے یہ بات بھلائی کہ میں اس کا ذکر کروں اور عجیب بات یہ ہے کہ اس ( مچھلی ) نے ( زندہ ہوکر ) پانی میں اپنا ر استہ پکڑ لیا ۔ انھوں نے فرمایا ہمیں اسی کی تلاش تھی پھر وہ دونوں واپس اپنے قدموں کےنشانات پر چل پڑے ۔ اس نے انھیں مچھلی کی جگہ دیکھائی ۔ انھوں نے کہا مجھے اسی جگہ کے بارے میں بتایا گیا تھا وہ تلاش میں چل پڑے تو انھیں حضرت خضر علیہ السلام اپنے اردگرد کپڑا لپیٹے نظرآگئے گدی کے بل ( سیدھے ) لیٹے ہوئے تھے یا کہا : گدی کے درمیانے حصے کےبل لیٹے ہوئے تھے ۔ انھوں نے کہا : السلام علیکم! ( خضر علیہ السلام نے ) کہا : وعلیکم السلام! پوچھا : آپ کون ہیں؟کہا : میں موسیٰ علیہ السلام ہوں ، پوچھا ، کون موسیٰ؟کہا : بنی اسرائیل کے موسیٰ ، پوچھا : کیسے آنا ہوا ہے؟ کہا : میں اس لئے آیا ہوں کہ صحیح ر استے کا جو علم آپ کو دیاگیا ہے وہ آپ مجھے بھی سکھا دیں ۔ ( خضر علیہ السلام نے ) کہا : میری معیت میں آپ صبر نہ کرپائیں گے ۔ ( موسیٰ علیہ السلام نے ) کہا : ان شاء اللہ ، آپ مجھے صبر کرنے والا پائیں گے اور میں کسی بات میں آپ کی خلاف ورزی نہیں کروں گا ۔ انھوں نے کہا : اگر آپ میرے پیچھے چلتے ہیں تو مجھ سے اس وقت تک کسی چیز کے بارے میں سوال نہ کریں جب تک میں خود اس کا ذکر شروع نہ کروں ، پھر وہ دونوں چل پڑے یہاں تک کہ جب وہ دونوں ایک کشتی میں سوار ہوئے تو انھوں ( خضر علیہ السلام ) نے اس میں لمبا سا سوراخ کردیا ۔ کہا : انھوں نے کشتی پر اپنا پہلو کازور ڈالا ( جس سے اس میں درز آگئی ) موسیٰ علیہ السلام نے انھیں کہا : آپ نے اس لئے اس میں درز ڈالی کہ انھیں غرق کردیں ۔ آپ نے عجیب کام کیا ۔ ( خضر علیہ السلام نے ) کہا : میں نے آپ سے کہا نہ تھا کہ آپ میرے ساتھ کسی صورت صبر نہ کرسکیں گے ۔ ( موسیٰ علیہ السلام نے ) کہا : میرے بھول جانے پر میرا مواخذہ نہ کریں اور میرے معاملے میں مجھ سے سخت برتاؤ نہ کریں ۔ دونوں ( پھر ) چل پڑے یہاں تک کہ وہ کچھ لڑکوں کے پاس پہنچے ، ، وہ کھیل رہے تھے ۔ وہ ( خضر علیہ السلام ) تیزی سے ایک لڑکے کی طرف بڑھے اور اسے قتل کردیا ۔ اس پر موسیٰ علیہ السلام سخت گھبراہٹ کا شکار ہوگئے ۔ انھوں نے کہا : کیا آپ نے ایک معصوم جان کو کسی جان کے بدلے کے بغیر مار دیا؟ \" اس مقام پر رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" ہم پر اور موسیٰ علیہ السلام پر اللہ کی رحمت ہو! اگر وہ جلدبازی نہ کرتے تو ( اور بھی ) عجیب کام دیکھتے ، لیکن انھیں اپنے ساتھی سے شرمندگی محسوس ہو ئی ، کہا : اگر میں اس کے بعد آپ سے کسی چیز کے بارے میں سوال کروں تو آپ مجھے اپنے ساتھ نہ رکھیں ، آپ میری طرف سے عذر کو پہنچ گئے اور ( فرما یا : ) اگر موسیٰ علیہ السلام صبر کرتے تو ( اوربھی ) عجائبات کا مشاہدہ کرتے ۔ \" ( ابھی بن کعب رضی اللہ تعالیٰ عنہ نے ) کہا : رسول اللہ صلی اللہ علیہ وسلم جب انبیاء علیہ السلام میں سے کسی کا ذکر کرتے تو اپنی ذات سے شروع ( فرما تے ) : \" ہم پر اللہ کی رحمت ہو اور ہمارے فلاں بھا ئی پر ہم اللہ کی رحمت ہو! ۔ ۔ ۔ پھر وہ دونوں ( آگے ) چل پڑے یہاں تک کہ ایک بستی کے بخیل لو گوں کے پاس آئے ۔ کئی مجا لس میں پھر ےاور ان لوگوں سے کھا نا طلب کیا لیکن انھوں نے ان کی مہمانداری سے صاف انکار کردیا ، پھر انھوں نے اس ( بستی ) میں ایک دیوار دیکھی جو گرنے ہی والی تھی کہ انھوں ( خضر علیہ السلام ) نے اسے سیدھا کھڑا کردیا ۔ ( موسیٰ علیہ السلام نے ) کہا : اگرآپ چاہتے تو اس پر اُجرت ( بھی ) لے سکتے تھے ۔ انھوں نےکہا : یہ میرے اور آپ کے درمیان مفارقت ( کا وقت ) ہے ۔ اور انھوں ( موسیٰ علیہ السلام ) نے ان کا کپڑا تھام لیا ( تاکہ وہ جدا نہ ہوجائیں اور کہا کہ مجھے ان کی حقیقت بتادو ) کہا : میں ابھی آپ کوان ( کاموں ) کی حقیقت بتاتاہوں جن پر آپ صبر نہیں کرسکے ۔ جو کشتی تھی وہ ایسے مسکین لوگوں کی تھی جو سمندر میں ( ملاحی کا ) کام کرتے ہیں ۔ \" آیت کے آخر تک \" جب اس پر قبضہ کرنے والا آئے گا تو اسے سوراخ والی پائے گا اور آگے بڑھ جائے گا اور یہ لوگ ایک لکڑی ( کے تختے ) سے اس کو ٹھیک کرلیں گے اور جو لڑکا تھا تو جس دن اس کی سرشت ( فطرت ) بنائی گئی وہ کفر پر بنائی گئی ۔ اس کے والدین کو اس کے ساتھ شدید لگاؤ ہے ۔ اگروہ اپنی بلوغت تک پہنچ جاتا تو اپنی سرکشی اور کفر سے انہیں عاجز کردیتا ۔ ہم نے چاہا کہ اللہ ان دنوں کو اس کے بدلے میں پاکبازی میں بڑھ کر صلہ رحمی کے اعتبارسے بہتر بدل عطا فرمادے اور رہی دیوار تو وہ شہر کے دو یتیم لڑکوں کی تھی ( اور اس کے نیچے ان دونوں کاخزانہ دفن تھا ۔ ) \" آیت کے آخرتک ۔",
                "urduNarrator": "",
                "hadithArabic": "حَدَّثَنَا أُبَيُّ بْنُ كَعْبٍ قَالَ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: إِنَّهُ بَيْنَمَا مُوسَى عَلَيْهِ السَّلَامُ، فِي قَوْمِهِ يُذَكِّرُهُمْ بِأَيَّامِ اللهِ، وَأَيَّامُ اللهِ نَعْمَاؤُهُ وَبَلَاؤُهُ، إِذْ قَالَ: مَا أَعْلَمُ فِي الْأَرْضِ رَجُلًا خَيْرًا وَأَعْلَمَ مِنِّي، قَالَ: فَأَوْحَى اللهُ إِلَيْهِ، إِنِّي أَعْلَمُ بِالْخَيْرِ مِنْهُ، أَوْ عِنْدَ مَنْ هُوَ، إِنَّ فِي الْأَرْضِ رَجُلًا هُوَ أَعْلَمُ مِنْكَ، قَالَ: يَا رَبِّ فَدُلَّنِي عَلَيْهِ، قَالَ فَقِيلَ لَهُ: تَزَوَّدْ حُوتًا مَالِحًا، فَإِنَّهُ حَيْثُ تَفْقِدُ الْحُوتَ، قَالَ: فَانْطَلَقَ هُوَ وَفَتَاهُ حَتَّى انْتَهَيَا إِلَى الصَّخْرَةِ، فَعُمِّيَ عَلَيْهِ، فَانْطَلَقَ وَتَرَكَ فَتَاهُ، فَاضْطَرَبَ الْحُوتُ فِي الْمَاءِ، فَجَعَلَ لَا يَلْتَئِمُ عَلَيْهِ، صَارَ مِثْلَ الْكُوَّةِ، قَالَ فَقَالَ فَتَاهُ: أَلَا أَلْحَقُ نَبِيَّ اللهِ فَأُخْبِرَهُ؟ قَالَ: فَنُسِّيَ، فَلَمَّا تَجَاوَزَا قَالَ لِفَتَاهُ: آتِنَا غَدَاءَنَا لَقَدْ لَقِينَا مِنْ سَفَرِنَا هَذَا نَصَبًا، قَالَ: وَلَمْ يُصِبْهُمْ نَصَبٌ حَتَّى [ص:1851] تَجَاوَزَا، قَالَ فَتَذَكَّرَ (قَالَ أَرَأَيْتَ إِذْ أَوَيْنَا إِلَى الصَّخْرَةِ فَإِنِّي نَسِيتُ الْحُوتَ وَمَا أَنْسَانِيهُ إِلَّا الشَّيْطَانُ أَنْ أَذْكُرَهُ وَاتَّخَذَ سَبِيلَهُ فِي الْبَحْرِ عَجَبًا. قَالَ: ذَلِكَ مَا كُنَّا نَبْغِي فَارْتَدَّا عَلَى آثَارِهِمَا قَصَصًا) فَأَرَاهُ مَكَانَ الْحُوتِ، قَالَ: هَا هُنَا وُصِفَ لِي، قَالَ: فَذَهَبَ يَلْتَمِسُ فَإِذَا هُوَ بِالْخَضِرِ مُسَجًّى ثَوْبًا، مُسْتَلْقِيًا عَلَى الْقَفَا، أَوْ قَالَ عَلَى حَلَاوَةِ الْقَفَا. قَالَ: السَّلَامُ عَلَيْكُمْ، فَكَشَفَ الثَّوْبَ عَنْ وَجْهِهِ قَالَ: وَعَلَيْكُمُ السَّلَامُ، مَنْ أَنْتَ؟ قَالَ: أَنَا مُوسَى؟ قَالَ: وَمَنْ مُوسَى؟ قَالَ: مُوسَى بَنِي إِسْرَائِيلَ، قَالَ: مَجِيءٌ مَا جَاءَ بِكَ؟ قَالَ: جِئْتُ لِتُعَلِّمَنِي مِمَّا عُلِّمْتَ رُشْدًا، قَالَ: إِنَّكَ لَنْ تَسْتَطِيعَ مَعِيَ صَبْرًا، وَكَيْفَ تَصْبِرُ عَلَى مَا لَمْ تُحِطْ بِهِ خُبْرًا، شَيْءٌ أُمِرْتُ بِهِ أَنْ أَفْعَلَهُ إِذَا رَأَيْتَهُ لَمْ تَصْبِرْ، قَالَ: سَتَجِدُنِي إِنْ شَاءَ اللهُ صَابِرًا وَلَا أَعْصِي لَكَ أَمْرًا، قَالَ: فَإِنِ اتَّبَعْتَنِي فَلَا تَسْأَلْنِي عَنْ شَيْءٍ حَتَّى أُحْدِثَ لَكَ مِنْهُ ذِكْرًا، فَانْطَلَقَا حَتَّى إِذَا رَكِبَا فِي السَّفِينَةِ خَرَقَهَا، قَالَ: انْتَحَى عَلَيْهَا، قَالَ لَهُ مُوسَى عَلَيْهِ السَّلَامُ: أَخَرَقْتَهَا لِتُغْرِقَ أَهْلَهَا لَقَدْ جِئْتَ شَيْئًا إِمْرًا، قَالَ: أَلَمْ أَقُلْ إِنَّكَ لَنْ تَسْتَطِيعَ مَعِي صَبْرًا؟ قَالَ: لَا تُؤَاخِذْنِي بِمَا نَسِيتُ وَلَا تُرْهِقْنِي مِنْ أَمْرِي عُسْرًا، فَانْطَلَقَا حَتَّى إِذَا لَقِيَا غِلْمَانًا يَلْعَبُونَ، قَالَ: فَانْطَلَقَ إِلَى أَحَدِهِمْ بَادِيَ الرَّأْيِ فَقَتَلَهُ، فَذُعِرَ عِنْدَهَا مُوسَى عَلَيْهِ السَّلَامُ، ذَعْرَةً مُنْكَرَةً، قَالَ: (أَقَتَلْتَ نَفْسًا زَاكِيَةً بِغَيْرِ نَفْسٍ لَقَدْ جِئْتَ شَيْئًا نُكْرًا) فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عِنْدَ هَذَا الْمَكَانِ: رَحْمَةُ اللهِ عَلَيْنَا وَعَلَى مُوسَى، لَوْلَا أَنَّهُ عَجَّلَ لَرَأَى الْعَجَبَ، وَلَكِنَّهُ أَخَذَتْهُ مِنْ صَاحِبِهِ ذَمَامَةٌ، {قَالَ إِنْ سَأَلْتُكَ عَنْ شَيْءٍ بَعْدَهَا فَلَا تُصَاحِبْنِي قَدْ بَلَغْتَ مِنْ لَدُنِّي} [الكهف: 76] عُذْرًا وَلَوْ صَبَرَ لَرَأَى الْعَجَبَ - قَالَ: وَكَانَ إِذَا ذَكَرَ أَحَدًا مِنَ الْأَنْبِيَاءِ بَدَأَ بِنَفْسِهِ رَحْمَةُ اللهِ عَلَيْنَا وَعَلَى أَخِي كَذَا، رَحْمَةُ اللهِ عَلَيْنَا - فَانْطَلَقَا حَتَّى إِذَا أَتَيَا أَهْلَ قَرْيَةٍ لِئَامًا فَطَافَا فِي الْمَجَالِسِ فَاسْتَطْعَمَا أَهْلَهَا، فَأَبَوْا أَنْ يُضَيِّفُوهُمَا فَوَجَدَا فِيهَا جِدَارًا يُرِيدُ أَنْ يَنْقَضَّ فَأَقَامَهُ، قَالَ: لَوْ شِئْتَ لَاتَّخَذْتَ عَلَيْهِ أَجْرًا، قَالَ: هَذَا فِرَاقُ بَيْنِي وَبَيْنِكَ وَأَخَذَ بِثَوْبِهِ، قَالَ: {سَأُنَبِّئُكَ بِتَأْوِيلِ مَا لَمْ تَسْتَطِعْ عَلَيْهِ صَبْرًا، أَمَّا السَّفِينَةُ فَكَانَتْ لِمَسَاكِينَ يَعْمَلُونَ فِي الْبَحْرِ} [الكهف: 79] إِلَى آخِرِ الْآيَةِ، فَإِذَا جَاءَ الَّذِي يُسَخِّرُهَا وَجَدَهَا مُنْخَرِقَةً فَتَجَاوَزَهَا فَأَصْلَحُوهَا بِخَشَبَةٍ، وَأَمَّا الْغُلَامُ فَطُبِعَ يَوْمَ طُبِعَ كَافِرًا، وَكَانَ أَبَوَاهُ قَدْ عَطَفَا عَلَيْهِ، فَلَوْ أَنَّهُ أَدْرَكَ أَرْهَقَهُمَا طُغْيَانًا وَكُفْرًا (فَأَرَدْنَا أَنْ يُبَدِّلَهُمَا رَبُّهُمَا خَيْرًا مِنْهُ زَكَاةً وَأَقْرَبَ رُحْمًا. وَأَمَّا الْجِدَارُ فَكَانَ لِغُلَامَيْنِ يَتِيمَيْنِ فِي الْمَدِينَةِ وَكَانَ تَحْتَهُ) إِلَى آخِرِ الْآيَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13729,
                "hadithNumber": "6166",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been transmitted on the authority of Abu Ishaq.",
                "hadithUrdu": "ہم سے عبداللہ بن عبدالرحمٰن دارمی نے بیان کیا، کہا ہم سے محمد بن یوسف نے بیان کیا، اور ہم سے عبد بن حمید نے بیان کیا، ہم سے عبید اللہ بن موسیٰ نے بیان کیا, اسرائیل نے ابو اسحاق سے تیمی کی سند کے ساتھ ابو اسحاق سے اس کی ابو اسحاق سے روایت کردہ حدیث کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا عَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ، ح وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عُبَيْدُ اللهِ بْنُ مُوسَى، كِلَاهُمَا، عَنْ إِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، بِإِسْنَادِ التَّيْمِيِّ، عَنْ أَبِي إِسْحَاقَ، نَحْوَ حَدِيثِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13730,
                "hadithNumber": "6167",
                "englishNarrator": null,
                "hadithEnglish": "Ibn 'Abbas رضی اللہ عنہ has reported this hadith on the authority of Ubayy bin ka'b رضی اللہ عنہ that Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) used to recite this.",
                "hadithUrdu": "عمروناقد نے کہا : ہمیں سفیان بن عینیہ نے عمرو ( بن دینار ) سے حدیث بیان کی ، انھوں نے سعید بن جبیر سے ، انھوں نے حضرت ابن عباس رضی اللہ عنہ سے ، انھوں نے حضرت ابی ابن کعب رضی اللہ عنہ سے روایت کی کہ نبی کریم صلی اللہ علیہ وسلم نے ( لاتخذتکی بجائے ) اس طرح پڑھا : ( لَاتَّخَذْتَ عَلَيْهِ أَجْرًا ) ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، عَنْ أُبَيِّ بْنِ كَعْبٍ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَرَأَ: (لَتَّخِذْتَ عَلَيْهِ أَجْرًا)",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13731,
                "hadithNumber": "6168",
                "englishNarrator": "Utba bin Mas,ud reported:",
                "hadithEnglish": "'Abdullah bin 'Abbas رضی اللہ عنہ contended with Hurr bin Qais bin Hisn al-Fazari aboat the companion of Moses (peace be upon hiin). Ibn 'Abbas رضی اللہ عنہ aid that he was Khadir. There happened to pass Ubayy bin Ka'b Ansari رضی اللہ عنہ . Ibn Abbas رضی اللہ عنہ called him and said: Abu Tufail, come to us. There has been a difference of opinion between me and my friend about the companion of Moses whom he wanted to meet on the way. Did hear anything from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) making a mention of anything? Ubayy said: I heard Allah's Messenger (may Peace be upon him) as saying: As Moses was amongst the group of Bani Isra'il, there came to him a person and he said to him: Do you know anyone having better knowledge than you? Moses said: No. Thereupon Allah revealed to Moses: Of course, there is amongst Our servants Khadir (who has better knowledge) than you. Moses asked the way of meeting him. Allah made the fish a sign and it was said to him: Where you miss the fish return to that (place) and you will soon find him. So Moses moved on as Allah wished him to move on. He then said to his young companion: Bring for us the breakfast. Thereupon that young man said to Moses. when he asked him for the breakfast: Don't you see that as we had reached the Sakhra I forgot the fish and nobody made it forget (in our mind) but the satan that I should remind you of it? Moses said to that young man: This was what we wanted. So they retraced their steps and met Khadir and the events which followed have been described in His Book except that Yunus (the narrator) said that he followed the traces of fish in the ocean.",
                "hadithUrdu": "ان کا اور حر بن قیس بن حصن فزاری کاحضرت موسیٰ علیہ السلام کے ساتھی کے بارے میں مباحثہ ہوا ، حضرت ابن عباس رضی اللہ تعالیٰ عنہ نے کہا کہ وہ خضر علیہ السلام تھے ، پھر حضرت ابی بن کعب انصاری رضی اللہ عنہ کا ان دونوں کے پاس سے گزر ہوا توحضرت ابن عباس رضی اللہ عنہ نے ان کو بلایا اور کہا : ابوطفیل!ہمارے پاس آیئے ، میں نے اور میرے اس ساتھی نے اس بات پر بحث کی ہے کہ حضرت موسیٰ علیہ السلام کے وہ ساتھی کون تھے جن سے ملاقات کا طریقہ انھوں نے پوچھا تھا؟آپ نے رسول اللہ صلی اللہ علیہ وسلم کو اس کے بارے میں کچھ فر ما تے ہو ئے سناہے؟تو حضرت اُبی رضی اللہ تعالیٰ عنہ نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فر ما تے ہو ئے سنا : \" موسیٰ علیہ السلام اسرائیل کی ایک مجلس میں تھے اور آپ کے پاس ایک آدمی آیا اور کہا : کیاآپ کسی ایسے آدمی کو جا نتے ہیں جو آپ سے زیادہ علم رکھتا ہو؟موسیٰ علیہ السلام نے کہا : نہیں ، اس پر اللہ تعا لیٰ نے حضرت موسیٰ علیہ السلام کی طرف وحی کی ، کیوں نہیں ہمارا بندہ خضرہے فر ما یا : تو موسیٰ علیہ السلام نے ان سے ملنے کا طریقہ پو چھا تو اللہ تعا لیٰ نے مچھلی ان کی نشانی مقرر فرما ئی اور ان سے کہا گیا : جب آپ مچھلی گم پائیں تو لوٹیں ، آپ کی ان سے ضرور ملا قات ہو جائے گی ۔ موسیٰ علیہ السلام جتنا اللہ نے چا ہا سفر کیا ، پھر اپنے جوان سے کہا : ہمارا کھا نا لاؤ ، جب موسیٰ علیہ السلام نے ناشتہ مانگا تو ان کے جوان نے کہا : آپ نے دیکھا کہ جب ہم چٹان کے پاس رکے تھےتو میں مچھلی کو بھول گیا اور شیطان ہی نے مجھے یہ بھلا دیا کہ میں ( آپ کو ) یہ بات بتا ؤں ۔ موسیٰ علیہ السلام نے اپنے جوان سے فر ما یا : ہم اسی کی تلاش کر رہے تھے ، چنانچہ وہ دونوں اپنے پاؤں کے نشانات پر واپس چل پڑے ۔ دونوں کو حضرت خضر علیہ السلام مل گئے ، پھر ان دونوں کے ساتھ وہی ہوا جو اللہ تعا لیٰ نے اپنی کتاب میں بیان فر ما یا ۔ مگر یونس نے یہ کہا : وہ ( موسیٰ علیہ السلام ) سمندر میں مچھلی کے آثار ڈھونڈرہے تھے ۔",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا, یونس نے ابن شہاب سے ، انھوں نے عبیداللہ بن عبداللہ بن عتبہ بن مسعود ، انھوں نے حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللهِ بْنِ عَبْدِ اللهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنْ عَبْدِ اللهِ بْنِ عَبَّاسٍ، أَنَّهُ تَمَارَى، هُوَ وَالْحُرُّ بْنُ قَيْسِ بْنِ [ص:1853] حِصْنٍ الْفَزَارِيُّ فِي صَاحِبِ مُوسَى عَلَيْهِ السَّلَامُ، فَقَالَ ابْنُ عَبَّاسٍ: هُوَ الْخَضِرُ، فَمَرَّ بِهِمَا أُبَيُّ بْنُ كَعْبٍ الْأَنْصَارِيُّ، فَدَعَاهُ ابْنُ عَبَّاسٍ فَقَالَ: يَا أَبَا الطُّفَيْلِ هَلُمَّ إِلَيْنَا، فَإِنِّي قَدْ تَمَارَيْتُ أَنَا وَصَاحِبِي هَذَا فِي صَاحِبِ مُوسَى الَّذِي سَأَلَ السَّبِيلَ إِلَى لُقِيِّهِ، فَهَلْ سَمِعْتَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَذْكُرُ شَأْنَهُ؟ فَقَالَ أُبَيٌّ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: بَيْنَمَا مُوسَى فِي مَلَإٍ مِنْ بَنِي إِسْرَائِيلَ إِذْ جَاءَهُ رَجُلٌ فَقَالَ لَهُ: هَلْ تَعْلَمُ أَحَدًا أَعْلَمَ مِنْكَ؟ قَالَ مُوسَى لَا، فَأَوْحَى اللهُ إِلَى مُوسَى بَلْ عَبْدُنَا الْخَضِرُ قَالَ: فَسَأَلَ مُوسَى السَّبِيلَ إِلَى لُقِيِّهِ، فَجَعَلَ اللهُ لَهُ الْحُوتَ آيَةً، وَقِيلَ لَهُ: إِذَا افْتَقَدْتَ الْحُوتَ فَارْجِعْ فَإِنَّكَ سَتَلْقَاهُ، فَسَارَ مُوسَى مَا شَاءَ اللهُ أَنْ يَسِيرَ، ثُمَّ قَالَ لِفَتَاهُ: آتِنَا غَدَاءَنَا، فَقَالَ فَتَى مُوسَى، حِينَ سَأَلَهُ الْغَدَاءَ: (أَرَأَيْتَ إِذْ أَوَيْنَا إِلَى الصَّخْرَةِ فَإِنِّي نَسِيتُ الْحُوتَ وَمَا أَنْسَانِيهِ إِلَّا الشَّيْطَانُ أَنْ أَذْكُرَهُ)، فَقَالَ مُوسَى لِفَتَاهُ: (ذَلِكَ مَا كُنَّا نَبْغِي فَارْتَدَّا عَلَى آثَارِهِمَا قَصَصًا) فَوَجَدَا خَضِرًا. فَكَانَ مِنْ شَأْنِهِمَا مَا قَصَّ اللهُ فِي كِتَابِهِ إِلَّا أَنَّ يُونُسَ قَالَ: فَكَانَ يَتَّبِعُ أَثَرَ الْحُوتِ فِي الْبَحْرِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "44",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 144,
                    "chapterNumber": "44",
                    "chapterEnglish": "The Book of Virtues",
                    "chapterUrdu": "انبیائے کرام علیہم السلام کے فضائل",
                    "chapterArabic": "كتاب الْفَضَائِلِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13732,
                "hadithNumber": "6169",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "Abu Bakr Siddiq رضی اللہ عنہ reported him thus: I saw the feet of the polytheists very close to us as we were in the cave. I said: Allah's Messenger, if one amongst them were to see at his feet he would have surely seen us. Thereupon he said: Abu Bakr, what can befall two who have Allah as the third One with them.",
                "hadithUrdu": "حضرت ابو بکر صدیق رضی اللہ عنہ نے انھیں بتایا ، کہا : جس وقت ہم غار میں تھے ، میں نے اپنے سرو ں کی جانب ( غار کے اوپر ) مشرکین کے قدم دیکھے ، میں نے عرض کی : اللہ کے رسول صلی اللہ علیہ وسلم ! اگر ان میں سے کسی نے اپنے پیروں کی طرف نظر کی تووہ نیچے ہمیں دیکھ لے گا ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ابو بکر!تمھارا ان دو کے بارے میں کیا گیا گمان ہے جن کے ساتھ تیسرا اللہ ہے؟ \" ( انھیں کوئی ضرر نہیں پہنچ سکتا ۔ )",
                "urduNarrator": "مجھ سے زہیر بن حرب، عبد بن حمید اور عبداللہ بن عبدالرحمٰن دارمی نے بیان کیا - عبداللہ نے کہا کہ ہم سے انہوں نے بیان کیا اور باقی دو نے کہا: اس نے ہم سے بیان کیا - ہم سے حبان بن ہلال، ہمام نے بیان کیا، کہا ہم سے ثابت نے بیان کیا, حضرت انس بن مالک رضی اللہ تعالیٰ عنہ نے حدیث بیان کی کہ",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَعَبْدُ بْنُ حُمَيْدٍ، وَعَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ - قَالَ عَبْدُ اللهِ، أَخْبَرَنَا وقَالَ الْآخَرَانِ: حَدَّثَنَا - حَبَّانُ بْنُ هِلَالٍ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا ثَابِتٌ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، أَنَّ أَبَا بَكْرٍ الصِّدِّيقَ، حَدَّثَهُ قَالَ: نَظَرْتُ إِلَى أَقْدَامِ الْمُشْرِكِينَ عَلَى رُءُوسِنَا وَنَحْنُ فِي الْغَارِ، فَقُلْتُ: يَا رَسُولَ اللهِ لَوْ أَنَّ أَحَدَهُمْ نَظَرَ إِلَى قَدَمَيْهِ أَبْصَرَنَا تَحْتَ قَدَمَيْهِ، فَقَالَ: «يَا أَبَا بَكْرٍ مَا ظَنُّكَ بِاثْنَيْنِ اللهُ ثَالِثُهُمَا».",
                "headingArabic": "مِنْ فَضَائِلِ أَبِي بَكْرٍ الصِّدِّيقِ رضى الله عنه ‏‏",
                "headingUrdu": "حضرت ابوبکر صدیق رضی اللہ عنہ کے فضائل",
                "headingEnglish": "The Virtues Of Abu Bakr As-Siddiq (RA)",
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13733,
                "hadithNumber": "6170",
                "englishNarrator": "Abu Sa'id رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sat on the pulpit and said: Allah gave a choice to His servant that he may opt the beauties of the world or that which is with Him and the servant chose that which was with Him. Thereupon Abu Bakr رضی اللہ عنہ wept and he wept bitterly and said: Let our fathers and our mothers be taken as ransom for you. It was Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) who had been given the choice and Abu Bakr رضی اللہ عنہ knew it better than us, and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) is reported to have said: Behold, of all people the most generous toward me in regard to his companionship and his property was Abu Bakr رضی اللہ عنہ and were I to choose anyone as my bosom friend, I would have chosen Abu Bakr رضی اللہ عنہ as my dear friend, but (for him) I cherish Islamic brotherliness and love. There shall be left open no window in the mosque except Abu Bakr's window.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم منبر پر رونق افروز ہوئے اور فرمایا : \" کہ اللہ تعالیٰ کا ایک بندہ ہے جس کو اللہ نے اختیار دیا ہے کہ چاہے دنیا کی دولت لے اور چاہے اللہ تعالیٰ کے پاس رہنا اختیار کرے ، پھر اس نے اللہ کے پاس رہنا اختیار کیا ۔ یہ سن کر سیدنا ابوبکر رضی اللہ عنہ روئے ( سمجھ گئے کہ آپ صلی اللہ علیہ وسلم کی وفات کا وقت قریب ہے ) اور بہت روئے ۔ پھر کہا کہ ہمارے باپ دادا ہماری مائیں آپ صلی اللہ علیہ وسلم پر قربان ہوں ( پھر معلوم ہوا ) کہ اس بندے سے مراد خود رسول اللہ صلی اللہ علیہ وسلم تھے اور سیدنا ابوبکر رضی اللہ عنہ ہم سب سے زیادہ علم رکھتے تھے ۔ اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ سب لوگوں سے زیادہ مجھ پر ابوبکر کا احسان ہے مال کا بھی اور صحبت کا بھی اور اگر میں کسی کو ( اللہ تعالیٰ کے سوا ) دوست بناتا تو ابوبکر کو دوست بناتا ۔ ( اب خلّت تو نہیں ہے ) لیکن اسلام کی اخوت ( برادری ) ہے ۔ مسجد میں کسی کی کھڑکی نہ رہے ( سب بند کر دی جائیں ) لیکن ابوبکر کے گھر کی کھڑکی قائم رکھو ۔",
                "urduNarrator": "ہم سے عبداللہ بن جعفر بن یحییٰ بن خالد نے بیان کیا، کہا ہم سے معن نے بیان کیا, امام مالک نے ابو نضر سے ، انھوں نے عبید بن حنین سے ، انھوں نے حضرت ابو سعید خدری رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللهِ بْنُ جَعْفَرِ بْنِ يَحْيَى بْنِ خَالِدٍ، حَدَّثَنَا مَعْنٌ، حَدَّثَنَا مَالِكٌ، عَنْ أَبِي النَّضْرِ، عَنْ عُبَيْدِ بْنِ حُنَيْنٍ، عَنْ أَبِي سَعِيدٍ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، جَلَسَ عَلَى الْمِنْبَرِ فَقَالَ: «عَبْدٌ خَيَّرَهُ اللهُ بَيْنَ أَنْ يُؤْتِيَهُ زَهْرَةَ الدُّنْيَا وَبَيْنَ مَا عِنْدَهُ، فَاخْتَارَ مَا عِنْدَهُ» فَبَكَى أَبُو بَكْرٍ وَبَكَى، فَقَالَ: فَدَيْنَاكَ بِآبَائِنَا وَأُمَّهَاتِنَا، قَالَ فَكَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ هُوَ الْمُخَيَّرُ، وَكَانَ أَبُو بَكْرٍ أَعْلَمَنَا بِهِ، وَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ أَمَنَّ النَّاسِ عَلَيَّ فِي مَالِهِ وَصُحْبَتِهِ أَبُو بَكْرٍ، وَلَوْ كُنْتُ مُتَّخِذًا خَلِيلًا لَاتَّخَذْتُ أَبَا بَكْرٍ خَلِيلًا، وَلَكِنْ أُخُوَّةُ الْإِسْلَامِ، لَا تُبْقَيَنَّ فِي الْمَسْجِدِ خَوْخَةٌ إِلَّا خَوْخَةَ أَبِي بَكْرٍ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13734,
                "hadithNumber": "6171",
                "englishNarrator": "It was narrated that Abu Sa'id Khudri رضی اللہ عنہ said:",
                "hadithEnglish": "The Messenger of Allah (ﷺ) addressed the people one day...\" a Hadith like that of Malik (no. 6170).",
                "hadithUrdu": "ایک دن رسول اللہ صلی اللہ علیہ وسلم نے لوگوں کو خطبہ دیا ، ( اس کے بعد ) مالک کی حدیث کی مانند ہے ۔",
                "urduNarrator": "ہم سے سعید بن منصور نے بیان کیا، کہا ہم سے فلیح بن سلیمان نے بیان کیا,سالم نےابو نضر سے ، انھوں نے عبید بن حنین اور بسر بن سعید سے ، انھوں نے ابو سعید خدری رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ، عَنْ سَالِمٍ أَبِي النَّضْرِ، عَنْ عُبَيْدِ بْنِ حُنَيْنٍ، وَبُسْرِ بْنِ سَعِيدٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ: خَطَبَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ النَّاسَ يَوْمًا، بِمِثْلِ حَدِيثِ مَالِكٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13735,
                "hadithNumber": "6172",
                "englishNarrator": "Abdullah bin Mas'ud رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: If I were to choose a bosom friend I would have definitely chosen Abu Bakr as my bosom friend, but he is my brother and my companion and Allah, the Exalted and Glorious. has taken your brother and companion (meaning Prophet himself) as a friend",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" اگر میں کسی شخص کو خلیل بناتا تو ابو بکر کو خلیل بناتا لیکن وہ میرے ( دینی ) بھائی اور ساتھی ہیں اور تمھارے ساتھی ( رسول اللہ صلی اللہ علیہ وسلم ) کو اللہ عزوجل نےاپنا خلیل بنایا ہے ۔ \"",
                "urduNarrator": "ہم سے محمد بن بشار العبدی نے بیان کیا، ہم سے محمد بن جعفر نے بیان کیا، ہم سے شعبہ نے بیان کیا، اسماعیل بن رجاء نے کہا : میں نے عبداللہ بن ابی ہذیل کو ابواحوص سے حدیث بیان کرتے ہوئے سنا ، انھوں نے کہا : میں نے عبداللہ بن مسعود رضی اللہ عنہ سے سنا ، وہ رسول اللہ صلی اللہ علیہ وسلم سے حدیث بیان کررہے تھے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ الْعَبْدِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ إِسْمَاعِيلَ بْنِ رَجَاءٍ، قَالَ: سَمِعْتُ عَبْدَ اللهِ بْنَ أَبِي الْهُذَيْلِ، يُحَدِّثُ عَنْ أَبِي الْأَحْوَصِ، قَالَ: سَمِعْتُ عَبْدَ اللهِ بْنَ مَسْعُودٍ، يُحَدِّثُ عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، أَنَّهُ قَالَ: «لَوْ كُنْتُ مُتَّخِذًا خَلِيلًا لَاتَّخَذْتُ أَبَا بَكْرٍ خَلِيلًا، وَلَكِنَّهُ أَخِي وَصَاحِبِي، وَقَدِ اتَّخَذَ اللهُ عَزَّ وَجَلَّ صَاحِبَكُمْ خَلِيلًا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13736,
                "hadithNumber": "6173",
                "englishNarrator": "Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: If I were to choose from my Umma anyone as my bosom friend, I would have chosen Abu Bakr.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" اگر میں اپنی امت میں سے کسی کو اپنا خلیل بناتا تو ابو بکر کو بناتا ۔ \"",
                "urduNarrator": "ہم سے محمد بن المثنیٰ اور ابن بشار نے بیان کیا - اور یہ لفظ ابن المثنیٰ کا ہے - انہوں نے کہا: ہم سے محمد بن جعفر نے بیان کیا، شعبہ نے ابو اسحاق سے ، انھوں نے ابو احوص سے ، انھوں نے عبداللہ بن مسعود رضی اللہ عنہ سے ، انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ - وَاللَّفْظُ لِابْنِ الْمُثَنَّى - قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي الْأَحْوَصِ، عَنْ عَبْدِ اللهِ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، أَنَّهُ قَالَ: «لَوْ كُنْتُ مُتَّخِذًا مِنْ أُمَّتِي أَحَدًا خَلِيلًا، لَاتَّخَذْتُ أَبَا بَكْرٍ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13737,
                "hadithNumber": "6174",
                "englishNarrator": "Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: If I were to choose as my bosom friend I would have chosen the son of Abu Quhafa (Abu Bakr رضی اللہ عنہ ) as my bosom friend.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اگر میں کسی کو خلیل بناتاتو ابوقحافہ کے فرزند ( ابو بکر رضی اللہ عنہ ) کو خلیل بناتا ۔ \"",
                "urduNarrator": "ہم سے محمد بن المثنیٰ اور ابن بشار نے بیان کیا، کہا: ہم سے عبدالرحمٰن نے بیان کیا، سفیان نے ابو اسحاق سے ، انھوں نے ابو احوص سے ، انھوں نے عبداللہ سے روایت کی ، ابو عمیس نے ابن ابی ملیکہ سے ، انھوں نے عبداللہ ( بن مسعود ) رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنِي سُفْيَانُ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي الْأَحْوَصِ، عَنْ عَبْدِ اللهِ، ح وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا جَعْفَرُ بْنُ عَوْنٍ، أَخْبَرَنَا أَبُو عُمَيْسٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عَبْدِ اللهِ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَوْ كُنْتُ مُتَّخِذًا خَلِيلًا، لَاتَّخَذْتُ ابْنَ أَبِي قُحَافَةَ خَلِيلًا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13738,
                "hadithNumber": "6175",
                "englishNarrator": "Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: If I were to choose amongst the people of earth someone as my bosom friend, I would have chosen the son of Abu Quhafa as my friends but God has taken your companion as a friend.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" اگر میں زمین پر رہنے والوں میں سے کسی کو خلیل بناتا تو ابو قحافہ کے بیٹے کو خلیل بناتا ، لیکن تمہارے صاحب ( رسول اللہ صلی اللہ علیہ وسلم ) اللہ کے خلیل ہیں ۔ \"",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ، زہیر بن حرب اور اسحاق بن ابراہیم نے بیان کیا، انہوں نے کہا کہ ہم سے اسحاق نے بیان کیا اور باقی دو نے کہا: ہم سے جریر نے بیان کیا، مغیرہ کے بارے میں , واصل بن حیان نے عبداللہ بن ابی ہذیل سے ، انھوں نے ابو احوص سے ، انھوں نے عبداللہ ( بن مسعود ) رضی اللہ عنہ سے ، انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ - قَالَ: إِسْحَاقُ، أَخْبَرَنَا وقَالَ الْآخَرَانِ: حَدَّثَنَا - جَرِيرٌ، عَنْ مُغِيرَةَ، عَنْ وَاصِلِ بْنِ حَيَّانَ، عَنْ عَبْدِ اللهِ بْنِ أَبِي الْهُذَيْلِ، عَنْ أَبِي الْأَحْوَصِ، عَنْ عَبْدِ اللهِ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «لَوْ كُنْتُ مُتَّخِذًا مِنْ أَهْلِ الْأَرْضِ خَلِيلًا، لَاتَّخَذْتُ ابْنَ أَبِي قُحَافَةَ خَلِيلًا، وَلَكِنْ صَاحِبُكُمْ خَلِيلُ اللهِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "45",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 145,
                    "chapterNumber": "45",
                    "chapterEnglish": "The Book of the Merits of the Companions",
                    "chapterUrdu": "صحابہ کرام رضی اللہ عنھم کے فضائل و مناقب",
                    "chapterArabic": "كتاب فَضَائِلِ الصَّحَابَةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 13426,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=537",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=535",
                "label": "535",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=536",
                "label": "536",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=537",
                "label": "537",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=538",
                "label": "538",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=539",
                "label": "539",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=540",
                "label": "540",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=541",
                "label": "541",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=539",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=539",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=537",
        "to": 13450,
        "total": 40465
    }
}