{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 373,
        "data": [
            {
                "id": 9589,
                "hadithNumber": "2025",
                "englishNarrator": "Abu Rifa'a رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "I came to the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) when he was delivering the sermon, and I said: Messenger of Allah, here is a stranger and he wants to learn about this religion and he does not know what this religion is. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) looked at me and left his sermon till he came to me, and he was given a chair and I thought that Its legs were made of iron. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) sat In it and he began to teach me what Allah had taught him. He then came (to the pulpit) for his sermon and completed it to the end.",
                "hadithUrdu": "میں نبی صلی اللہ علیہ وسلم کے پاس ( اس وقت ) پہنچا جبکہ آپ خطبہ دے رہے تھے ، میں نے عرض کی : اے اللہ کے رسول صلی اللہ علیہ وسلم !ایک پردیسی آدمی ہے اپنے دین کے بارے میں پوچھنے آیا ہے اسے معلوم نہیں کہ ا س کادین کیا ہے کہا : تو رسول اللہ صلی اللہ علیہ وسلم میری طرف متوجہ ہوئے اور اپنا خطبہ چھوڑا ، یہاں تک کہ میرے پاس پہنچ گئے ۔ ایک کرسی لائی گئی میرے خیال میں اس کے پائے لوہے کے تھے ، کہا : تو رسول اللہ صلی اللہ علیہ وسلم اس پر بیٹھ گئے اور اللہ تعالیٰ نے جو کچھ آپ کو سکھایا تھا اس میں سے مجھے سکھانے لگے پھر اپنے خطبے کے لئے بڑھے اور اس کا آخری حصہ مکمل فرمایا ۔",
                "urduNarrator": "ہم سے شیبان بن فرخ نے بیان کیا، کہا ہم سے سلیمان بن مغیرہ نے بیان کیا، ہم سے حمید بن ہلال نے بیان کیا، انہوں نے کہا حضرت ابو رفاعہ ( تمیم بن اُسید عدوی رضی اللہ تعالیٰ عنہ ) نے کہا کہ",
                "hadithArabic": "و حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ حَدَّثَنَا حُمَيْدُ بْنُ هِلَالٍ قَالَ قَالَ أَبُو رِفَاعَةَ انْتَهَيْتُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَخْطُبُ قَالَ فَقُلْتُ يَا رَسُولَ اللَّهِ رَجُلٌ غَرِيبٌ جَاءَ يَسْأَلُ عَنْ دِينِهِ لَا يَدْرِي مَا دِينُهُ قَالَ فَأَقْبَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَتَرَكَ خُطْبَتَهُ حَتَّى انْتَهَى إِلَيَّ فَأُتِيَ بِكُرْسِيٍّ حَسِبْتُ قَوَائِمَهُ حَدِيدًا قَالَ فَقَعَدَ عَلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَجَعَلَ يُعَلِّمُنِي مِمَّا عَلَّمَهُ اللَّهُ ثُمَّ أَتَى خُطْبَتَهُ فَأَتَمَّ آخِرَهَا.",
                "headingArabic": "حَدِيثِ التَّعْلِيمِ فِي الْخُطْبَةِ ‏",
                "headingUrdu": "خطبہ کے دوران درس کے بارے میں حدیث",
                "headingEnglish": "The hadith about teaching during the khutbah",
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9590,
                "hadithNumber": "2026",
                "englishNarrator": "Ibn Abi Rafi' said:",
                "hadithEnglish": "Marwan appointed Abu Huraira رضی اللہ عنہ as his deputy in Medina and he himself left for Mecca. Abu Huraira رضی اللہ عنہ led us in the Jumu'a prayer and recited after Surah Jumu'a in the second rak'ah: When the hypocrites came to thee (Surah 63). I then met Abu Huraira as he came back and said to him: You have recited two surahs which 'Ali bin Abu Talib used to recite in Kufah. Upon this Abu Huraira رضی اللہ عنہ said: I heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) reciting these two in the Friday (prayer).",
                "hadithUrdu": "مروان نے سیدنا ابوہریرہ رضی اللہ عنہ کو مدینہ میں خلیفہ مقرر کیا اور آپ مکہ کو گیا اور سیدنا ابوہریرہ رضی اللہ عنہ نے جمعہ کی نماز پڑھائی اور سوره جمعہ کے بعد دوسری رکعت میں سوره منافقون پڑھی۔ پھر میں ان سے ملا اور کہا کہ آپ صلی اللہ علیہ وسلم نے وہ سورتیں پڑھیں جو سیدنا علی رضی اللہ عنہ کوفہ میں پڑھتے تھے۔ انہوں نے کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے کہ جمعہ میں یہی پڑھتے تھے، (یعنی سیدنا علی رضی اللہ عنہ کی تقلید سے نہیں پڑھتا بلکہ متبع دلیل ہوں۔ سبحان اللہ صحابہ رضی اللہ عنہم کو اس قدر تقلید سے نفرت تھی کہ یہ کہنا پسند نہیں آیا اور رسول اللہ صلی اللہ علیہ وسلم کے فعل کی سند بتائی افسوس ہے ان پر جو تقلید پر جان دیتے ہیں)۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ بن قنعب نے بیان کیا، کہا ہم سے سلیمان نے جو ابن بلال ہیں، انہوں نے جعفر کی سند سے، اپنے والد کی سند سے، انہوں نے بیان کیا, ابن ابی رافع نے کہا",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ حَدَّثَنَا سُلَيْمَانُ وَهُوَ ابْنُ بِلَالٍ عَنْ جَعْفَرٍ عَنْ أَبِيهِ عَنْ ابْنِ أَبِي رَافِعٍ قَالَ اسْتَخْلَفَ مَرْوَانُ أَبَا هُرَيْرَةَ عَلَى الْمَدِينَةِ وَخَرَجَ إِلَى مَكَّةَ فَصَلَّى لَنَا أَبُو هُرَيْرَةَ الْجُمُعَةَ فَقَرَأَ بَعْدَ سُورَةِ الْجُمُعَةِ فِي الرَّكْعَةِ الْآخِرَةِ إِذَا جَاءَكَ الْمُنَافِقُونَ قَالَ فَأَدْرَكْتُ أَبَا هُرَيْرَةَ حِينَ انْصَرَفَ فَقُلْتُ لَهُ إِنَّكَ قَرَأْتَ بِسُورَتَيْنِ كَانَ عَلِيُّ بْنُ أَبِي طَالِبٍ يَقْرَأُ بِهِمَا بِالْكُوفَةِ فَقَالَ أَبُو هُرَيْرَةَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ بِهِمَا يَوْمَ الْجُمُعَةِ.",
                "headingArabic": "مَا يُقْرَأُ فِي صَلاَةِ الْجُمُعَةِ",
                "headingUrdu": "جمعہ کی نماز میں کیا پڑھا جائے؟",
                "headingEnglish": "What is to be recited in Jumu`ah prayer",
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9591,
                "hadithNumber": "2027",
                "englishNarrator": "This hadith is narrated by Abdullah bin Abu Rafi' with the same chain of transmitters but with this modification:",
                "hadithEnglish": "That he recited Surah Jumu'a (lxii.) in the first rak'ah and The hypocrites came in the second rak'ah.",
                "hadithUrdu": "انھوں نے پہلی رکعت میں سورہ جمعہ پڑھی اور دوسری رکعت میں إِذَا جَاءَكَ الْمُنَافِقُونَ ۔ عبدالعزیز کی روایت سلیمان بن بلال کی ( سابقہ ) ر وایت کی طرح ہے ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید اور ابوبکر بن ابی شیبہ نے بیان کیا، کہا: ہم سے بیان کرو , حاتم بن اسماعیل اور عبدالعزیز دراوردی دونوں نے ( اپنی اپنی سندکے ساتھ ) جعفر سے روایت کی ، انھوں نے اپنے والد سے اور انھوں نے عبیداللہ بن ابی رافع سے روایت کی ، انھوں نے کہا : مروان رضی اللہ تعالیٰ عنہ نے حضرت ابوہریرہ رضی اللہ تعالیٰ عنہ کو قائم مقام گورنر بنایا ۔ ۔ ۔ آگے اسی کے مانندہے ، سوائے اس کے کہ حاتم کی روایت ( ان الفاظ ) میں ہے",
                "hadithArabic": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَا حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ ح و حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي الدَّرَاوَرْدِيَّ كِلَاهُمَا عَنْ جَعْفَرٍ عَنْ أَبِيهِ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ قَالَ اسْتَخْلَفَ مَرْوَانُ أَبَا هُرَيْرَةَ بِمِثْلِهِ غَيْرَ أَنَّ فِي رِوَايَةِ حَاتِمٍ فَقَرَأَ بِسُورَةِ الْجُمُعَةِ فِي السَّجْدَةِ الْأُولَى وَفِي الْآخِرَةِ إِذَا جَاءَكَ الْمُنَافِقُونَ وَرِوَايَةُ عَبْدِ الْعَزِيزِ مِثْلُ حَدِيثِ سُلَيْمَانَ بْنِ بِلَالٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9592,
                "hadithNumber": "2028",
                "englishNarrator": "Nu'man bin Bashir رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) used to recite on two 'Ids and in Friday prayer: Glorify The name of Thy Lord, the Most High (Surah lxxxvii.), and: Has there come to thee the news of the overwhelming event (lxxxviii.). And when the 'Id and Jumu'a combined on a day he recited these two (surah) in both the prayers.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم عیدین اور جمعے میں سَبِّحِ اسْمَ رَ‌بِّكَ الْأَعْلَى اور ) هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ پڑھتے ۔ کہا : اور اگر عید اور جمعہ ایک ہی دن اکھٹے ہوجاتے تو آپ یہی دو سورتیں دونوں نمازوں میں پڑھتے تھے ۔",
                "urduNarrator": "یحییٰ بن یحییٰ، ابوبکر بن ابی شیبہ اور اسحاق نے ہم سے روایت کی ہے, جریر نے ابراہیم بن محمد بن منتشر سے ، انھوں نے اپنے والد سے ، انھوں نے حضرت نعمان بن بشیر کے آزاد کردہ غلام حبیب بن سالم سے اور انھوں نے حضرت نعمان بن بشیر رضی اللہ تعالیٰ عنہ سےروایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ جَمِيعًا عَنْ جَرِيرٍ قَالَ يَحْيَى أَخْبَرَنَا جَرِيرٌ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ عَنْ أَبِيهِ عَنْ حَبِيبِ بْنِ سَالِمٍ مَوْلَى النُّعْمَانِ بْنِ بَشِيرٍ عَنْ النُّعْمَانِ بْنِ بَشِيرٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي الْعِيدَيْنِ وَفِي الْجُمُعَةِ بِسَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى وَهَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ قَالَ وَإِذَا اجْتَمَعَ الْعِيدُ وَالْجُمُعَةُ فِي يَوْمٍ وَاحِدٍ يَقْرَأُ بِهِمَا أَيْضًا فِي الصَّلَاتَيْنِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9593,
                "hadithNumber": "2029",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated by Ibrahim bin Muhammad bin al-Muntashir with the same chain of transmitters.",
                "hadithUrdu": "ہم سے قتیبہ بن سعید نے بیان کیا، ہم سےابو عوانہ نے ابراہیم بن محمد بن منتشر سے اسی سند کے ساتھ ( اسی کے مانند ) ر وایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَاه قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ بِهَذَا الْإِسْنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9594,
                "hadithNumber": "2030",
                "englishNarrator": "Dahhak bin Qais wrote to Nu'man bin Bashir رضی اللہ تعالیٰ عنہ asking him:",
                "hadithEnglish": "What the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) recited on Friday besides Surah Jumu'a He said that he recited: Has there reached... (Surah lxxxviii, ).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے جمعے کے دن سورہ جمعہ کے علاوہ ( اور ) کون سی سورت پڑھی؟انھوں نے جواب دیا : آپ صلی اللہ علیہ وسلم هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ پڑھا کرتے تھے ۔",
                "urduNarrator": "ہم سے عمرو الناقد نے بیان کیا، ان سے سفیان بن عیینہ نے بیان کیا، ان سے دمرہ بن سعید نےعبیداللہ بن عبداللہ نے کہا : ضحاک بن قیس نے حضرت نعمان بن بشیر رضی اللہ تعالیٰ عنہ کوخط لکھ کر پوچھا کہ",
                "hadithArabic": "و حَدَّثَنَا عَمْرٌو النَّاقِدُ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ ضَمْرَةَ بْنِ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ قَالَ كَتَبَ الضَّحَّاكُ بْنُ قَيْسٍ إِلَى النُّعْمَانِ بْنِ بَشِيرٍ يَسْأَلُهُ أَيَّ شَيْءٍ قَرَأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْجُمُعَةِ سِوَى سُورَةِ الْجُمُعَةِ فَقَالَ كَانَ يَقْرَأُ هَلْ أَتَاكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9595,
                "hadithNumber": "2031",
                "englishNarrator": "Ibn Abbas رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to recite in the morning prayer on Friday Surah Alif-Lam-Mim, Tanz'il ul-Sajda (Surah xxxii.): Surely there came over the man a time (Surah lxxvii) and he used to recite in Jumu'a prayer Surahs Jumu'a and al-Munafiqin.",
                "hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم جمعے کے دن فجر کی نماز میں الم ﴿﴾ تَنزِيلُ الْكِتَابِ السجدہ اور هَلْ أَتَىٰ عَلَى الْإِنسَانِ حِينٌ مِّنَ الدَّهْرِ‌ پڑھتے تھے ۔ آپ صلی اللہ علیہ وسلم جمعے کی نماز میں سورہ جمعہ اورسورہ منافقون پڑھتے تھے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, عبدہ بن سلیمان نے سفیان سے روایت کی ، انھوں نے مخول بن راشد سے ، انھوں نے مسلم البطین سے ، انہوں نے سعید بن جبیر سے اورانھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ عَنْ سُفْيَانَ عَنْ مُخَوَّلِ بْنِ رَاشِدٍ عَنْ مُسْلِمٍ الْبَطِينِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ فِي صَلَاةِ الْفَجْرِ يَوْمَ الْجُمُعَةِ الم تَنْزِيلُ السَّجْدَةِ وَهَلْ أَتَى عَلَى الْإِنْسَانِ حِينٌ مِنْ الدَّهْرِ وَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ فِي صَلَاةِ الْجُمُعَةِ سُورَةَ الْجُمُعَةِ وَالْمُنَافِقِينَ.",
                "headingArabic": "مَا يُقْرَأُ فِي يَوْمِ الْجُمُعَةِ ‏",
                "headingUrdu": "جمعہ کے دن کیا پڑھنا ہے؟",
                "headingEnglish": "What is to be recited on Friday",
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9596,
                "hadithNumber": "2032",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been narrated by Sufyan with the same chain of transmitters.",
                "hadithUrdu": "عبداللہ بن نمیر اور وکیع دونوں نے سفیان سے اسی سند کے ساتھ اسی ( سابقہ حدیث ) کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي ح و حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا وَكِيعٌ كِلَاهُمَا عَنْ سُفْيَانَ بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9597,
                "hadithNumber": "2033",
                "englishNarrator": null,
                "hadithEnglish": "A similar report (as no. 2031) was narrated from Mukhawwal with this chain concerning \r\nboth prayers, as Sufyan said.",
                "hadithUrdu": "اور ہم سے محمد بن بشار نے بیان کیا، ہم سے محمد بن جعفر نے بیان کیا, شعبہ نے مخول سے اسی سندکے ساتھ دونوں نمازوں کے بارے میں اسی ( سابقہ حدیث ) کے مانند روایت کی جس طرح سفیان نے ( اپنی روایت میں ) کہا ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ مُخَوَّلٍ بِهَذَا الْإِسْنَادِ مِثْلَهُ فِي الصَّلَاتَيْنِ كِلْتَيْهِمَا كَمَا قَالَ سُفْيَانُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9598,
                "hadithNumber": "2034",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) used to recite in the dawn prayer on Friday Alif-Lam-Mim, Tanzil and Surely there came.",
                "hadithUrdu": "آپ جمعے کے دن فجر کی نماز میں الم ﴿﴾ تَنزِيلُ الْكِتَابِ اور هَلْ أَتَىٰ عَلَى الْإِنسَانِ پڑھتے تھے ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، ہم سے وکیع نے بیان کیا, سفیان نے سعد بن ابراہیم سے ، انہوں نے عبدالرحمان اعرج سے ، انھوں نے ابوہریرۃ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَقْرَأُ فِي الْفَجْرِ يَوْمَ الْجُمُعَةِ الم تَنْزِيلُ وَهَلْ أَتَى.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9599,
                "hadithNumber": "2035",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) used to recite in the dawn prayer on Friday: Alif-Lam-Mim, Tanzil in the first rak'ah, and in the second one: Surely there came over the man a time when he was nothing that could be mentioned.",
                "hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم جمعے کے دن صبح کی نماز کی پہلی رکعت میں الم ﴿﴾ تَنزِيلُ الْكِتَابِ اور دوسری رکعت میں هَلْ أَتَىٰ عَلَى الْإِنسَانِ حِينٌ مِّنَ الدَّهْرِ‌لَمْ يَكُن شَيْئًا مَّذْكُورً‌ا پڑھتے تھے ۔ ۔",
                "urduNarrator": "مجھ سے ابو الطاہر نے بیان کیا، ہم سے ابن وہب نے بیان کیا ,  ابراہیم بن سعد نے اپنے والد ( سعد بن ابراہیم ) سے ، انھوں نے عبدالرحمان اعرج سے اور انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ إِبْرَاهِيمَ بْنِ سَعْدٍ عَنْ أَبِيهِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ فِي الصُّبْحِ يَوْمَ الْجُمُعَةِ بِ الم تَنْزِيلُ فِي الرَّكْعَةِ الْأُولَى وَفِي الثَّانِيَةِ هَلْ أَتَى عَلَى الْإِنْسَانِ حِينٌ مِنْ الدَّهْرِ لَمْ يَكُنْ شَيْئًا مَذْكُورًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9600,
                "hadithNumber": "2036",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: When any one of you observes the Jumu'a prayer (two obligatory rak'ahs in congregation), he should observe four (rak'ahs) afterwards.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم میں سے کوئی جمعہ پڑھ چکے تو اس کے بعد چار رکعتیں پڑھے ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے بیان کیا,  خالد بن عبداللہ نے سہیل سے ، انھوں نے اپنے والد ( ابوصالح ) سے اور انھوں نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى أَحَدُكُمْ الْجُمُعَةَ فَلْيُصَلِّ بَعْدَهَا أَرْبَعًا.",
                "headingArabic": "الصَّلاَةِ بَعْدَ الْجُمُعَةِ ‏",
                "headingUrdu": "نماز جمعہ کے بعد",
                "headingEnglish": "Prayer after Jumu`ah",
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9601,
                "hadithNumber": "2037",
                "englishNarrator": "Suhail reported on the authority of Abu Huraira رضی اللہ تعالیٰ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: When you observe prayer after (the two obligatory rak'ahs) of Jumu'ah, you should observe four rak'ahs (and 'Amr in his narration has made this addition that Ibn Idris said this on the authority of Suhail): And if you are in a hurry on account of something, you should observe two rak'ahs in the mosque and two when you return (to your house).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم جمعے کے بعد نماز پڑھو تو چار رکعتیں پڑھو \" عمرو نے اپنی روایت میں اضافہ کیا ، ابن ادریس نے کہا سہیل نے کہا : اگر تمھیں کسی چیز کی وجہ سے جلدی ہو تو دو رکعتیں مسجد میں پڑھ لو اور دو رکعتیں و اپس جا کر ( گھر میں ) پڑ ھ لو ۔",
                "urduNarrator": "ابوبکر بن ابی شیبہ اور عمرو الناقد نے کہا : ہمیں عبداللہ بن ادریس نے سہیل سے حدیث سنائی ، انھوں نے اپنے والد سے اور انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ قَالَا حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّيْتُمْ بَعْدَ الْجُمُعَةِ فَصَلُّوا أَرْبَعًا زَادَ عَمْرٌو فِي رِوَايَتِهِ قَالَ ابْنُ إِدْرِيسَ قَالَ سُهَيْلٌ فَإِنْ عَجِلَ بِكَ شَيْءٌ فَصَلِّ رَكْعَتَيْنِ فِي الْمَسْجِدِ وَرَكْعَتَيْنِ إِذَا رَجَعْتَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9602,
                "hadithNumber": "2038",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: When any one amongst you observes prayer after Jumu'a, he should observe four rak'ahs. (In the hadith transmitted by Jarir the word minkum is not recorded.)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نےفرمایا : \"\" تم میں سے جو شخص جمعے کے بعد نماز پڑھے توچار رکعتیں پڑھے ۔ \"\" جریر کی حدیث میں \"\" منكم \"\" ( تم میں سے ) کے الفاظ نہیں ہیں ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، انہوں نے ہم سے بیان کیا, جریر اور سفیان نے سہیل سے ، انھوں نے اپنے والد سے اور انھوں نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ ح و حَدَّثَنَا عَمْرٌو النَّاقِدُ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ كِلَاهُمَا عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَانَ مِنْكُمْ مُصَلِّيًا بَعْدَ الْجُمُعَةِ فَلْيُصَلِّ أَرْبَعًا وَلَيْسَ فِي حَدِيثِ جَرِيرٍ مِنْكُمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9603,
                "hadithNumber": "2039",
                "englishNarrator": "Nafi' reported:",
                "hadithEnglish": "When 'Abdullah (bin 'Umar رضی اللہ تعالیٰ عنہ ) observed the Friday prayer and came back he observed two rak'ahs in his house, and then said: The Messenger of Allah (may peace be updn him) used to do this.",
                "hadithUrdu": "حضرت عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت کی کہ جب وہ جمعہ پڑھ لیتے تو واپس جاتے اور اپنے گھر میں دو ر رکعتیں پڑھتے ۔ پھر انھوں ( ابن عمر رضی اللہ تعالیٰ عنہ ) نے بتایا کہ رسول اللہ صلی اللہ علیہ وسلم ایسا ہی کرتے تھے ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ اور محمد بن رومح نے بیان کیا، کہا: ہمیں لیث نے خبر دی، اور ہم سے قتیبہ نے بیان کیا، ہم سے بیان کیالیث نے نافع سے اورانھوں نے",
                "hadithArabic": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَمُحَمَّدُ بْنُ رُمْحٍ قَالَا أَخْبَرَنَا اللَّيْثُ ح و حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا لَيْثٌ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ أَنَّهُ كَانَ إِذَا صَلَّى الْجُمُعَةَ انْصَرَفَ فَسَجَدَ سَجْدَتَيْنِ فِي بَيْتِهِ ثُمَّ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْنَعُ ذَلِكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9604,
                "hadithNumber": "2040",
                "englishNarrator": "Abdullah bin 'Umarرضی اللہ تعالیٰ عنہ :",
                "hadithEnglish": "While describing the Nafl prayer of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), said: He did not observe (Nafl) prayer after Jumu'a till he went back and observed two rak'ahs in his house. Yahya said: I guess that I uttered these words (before Imam Malik) that he of course observed (them).",
                "hadithUrdu": "انھوں نے رسول اللہ صلی اللہ علیہ وسلم کی نفل نماز کو بیان کیا اورکہا کہ آپ جمعے کے بعد کوئی ( نفل ) نماز نہ پڑھے حتیٰ کہ واپس تشریف لے جاتے پھر ا پنے گھر میں د و رکعتیں پڑھتے تھے ۔ یحییٰ بن یحییٰ نے کہا : میرا خیال ہے کہ میں نے ( امام مالکؒ کے سامنے ) \" فيصلي \" پڑھا تھا یا یقین ہے ( کہ یہی پڑھاتھا )",
                "urduNarrator": "یحییٰ بن یحییٰ نے کہا : میں نے امام مالکؒ پر ( حدیث کی ) قراءت کی ، انھوں نے نافع سے اورانھوں نے حضرت عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّهُ وَصَفَ تَطَوُّعَ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَكَانَ لَا يُصَلِّي بَعْدَ الْجُمُعَةِ حَتَّى يَنْصَرِفَ فَيُصَلِّي رَكْعَتَيْنِ فِي بَيْتِهِ قَالَ يَحْيَى أَظُنُّنِي قَرَأْتُ فَيُصَلِّي أَوْ أَلْبَتَّةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9605,
                "hadithNumber": "2041",
                "englishNarrator": "Salim narrated on the authority of his father:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) used to observe two rak'ahs after Jumu'a.",
                "hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم جمعے کےبعددو ر کعتیں پڑھتے تھے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، زہیر بن حرب اور ابن نمیر نے بیان کیا، ہم سے سفیان بن عیینہ نے بیان کیا، ہم سے عمرو نے زہری کی سند سے بیان کیا, سالم نے اپنے والد ( حضرت عبداللہ بن عمر رضی اللہ تعالیٰ عنہ ) سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ وَابْنُ نُمَيْرٍ قَالَ زُهَيْرٌ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ حَدَّثَنَا عَمْرٌو عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي بَعْدَ الْجُمُعَةِ رَكْعَتَيْنِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9606,
                "hadithNumber": "2042",
                "englishNarrator": "`Umar bin `Ata' bin Abu Khuwar said:",
                "hadithEnglish": "Nafi` bin Jubair sent him to al- Sa'ib the son of Namir's sister to ask him about what he had seen in the prayer of Mu`awiya رضی اللہ تعالیٰ عنہ. He said: Yes, I observed the Jumu`a prayer along with him in Maqsura and when the Imam pronounced salutation I stood up at my place and observed (Sunan rak`ahs). As he entered (the apartment) he sent for me and said: Do not repeat what you have done. Whenever you have observed the Jumu`a prayer, do not observe (Sunan prayer) till you, have talked or gone out, for the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had ordered us to do this and not to combine two (types of) prayers without talking or going out.",
                "hadithUrdu": "نافع بن جبیر نے انھیں نمر کے بھانجے سائب کے پاس بھیجے ان سے اس چیز کے بارے میں پوچھنے کے لئے جو حضرت معاویہ رضی اللہ تعالیٰ عنہ نے ان کی نماز میں دیکھی تھی ۔ سائب نے کہا : ہاں ، میں نے مقصورہ ( مسجد کے حجرے ) میں ان کے ساتھ جمعہ پڑھا تھا ۔ اور جب امام نے سلام پھیرا تو میں اپنی جگہ پر کھڑا ہوگیا اور نماز پڑھی ۔ جب معاویہ رضی اللہ تعالیٰ عنہ اندرداخل ہوئے تو مجھے بلوایا اور کہا : جو کام تم نے کیا ہے آئندہ نہ کرنا ۔ جب تم جمعہ پڑھ لو تو اسے کسی دوسری نماز سے نہ ملانا یہاں تک کہ گفتگو کرلو یا اس جگہ سے نکل جاؤ کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں اس بات کا حکم دیاتھا کہ ہم کسی نماز کو دوسری نماز سے نہ ملائیں حتیٰ کہ ہم گفتگو کرلیں یا ( اس جگہ سے ) نکل جائیں ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, غندر نے ابن جریج سے روایت کی ، انھوں نے کہا : مجھے عمر بن عطاء بن ابی خوار نے بتایا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا غُنْدَرٌ عَنْ ابْنِ جُرَيْجٍ قَالَ أَخْبَرَنِي عُمَرُ بْنُ عَطَاءِ بْنِ أَبِي الْخُوَارِ أَنَّ نَافِعَ بْنَ جُبَيْرٍ أَرْسَلَهُ إِلَى السَّائِبِ ابْنِ أُخْتِ نَمِرٍ يَسْأَلُهُ عَنْ شَيْءٍ رَآهُ مِنْهُ مُعَاوِيَةُ فِي الصَّلَاةِ فَقَالَ نَعَمْ صَلَّيْتُ مَعَهُ الْجُمُعَةَ فِي الْمَقْصُورَةِ فَلَمَّا سَلَّمَ الْإِمَامُ قُمْتُ فِي مَقَامِي فَصَلَّيْتُ فَلَمَّا دَخَلَ أَرْسَلَ إِلَيَّ فَقَالَ لَا تَعُدْ لِمَا فَعَلْتَ إِذَا صَلَّيْتَ الْجُمُعَةَ فَلَا تَصِلْهَا بِصَلَاةٍ حَتَّى تَكَلَّمَ أَوْ تَخْرُجَ فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَنَا بِذَلِكَ أَنْ لَا تُوصَلَ صَلَاةٌ بِصَلَاةٍ حَتَّى نَتَكَلَّمَ أَوْ نَخْرُجَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9607,
                "hadithNumber": "2043",
                "englishNarrator": "'Umar bin Ata' narrated:",
                "hadithEnglish": "Nafi bin Jubair sent him to As Saib bin Yazid the son of the sister of Namir... and he quoted a similar Hadith (as no. 2042), that he said: \"When he said the Taslim I stood up where I was,\" and he did not mention the Imam.",
                "hadithUrdu": "نافع بن جبیر نے انھیں نمر کے بھانجے سائب بن یزید کے پاس بھیجا ۔ ۔ ۔ آگے سابقہ حدیث کے کی مانند بیان کیا ۔ مگر ( اس روایت میں ) یہ ہے کہ سائب نے کہا : جب انھوں نے سلام پھیرا تو میں اپنی جگہ کھڑا ہوگیا ۔ انھوں نے ( سلام پھیرا کہا ) امام کا ذکر نہیں کیا ۔",
                "urduNarrator": "ہم سے ہارون بن عبداللہ نے بیان کیا, حجاج بن محمد نے کہا : ابن جریج نے کہا : مجھے عمر بن عطاء نے بتایا کہ",
                "hadithArabic": "و حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي عُمَرُ بْنُ عَطَاءٍ أَنَّ نَافِعَ بْنَ جُبَيْرٍ أَرْسَلَهُ إِلَى السَّائِبِ بْنِ يَزِيدَ ابْنِ أُخْتِ نَمِرٍ وَسَاقَ الْحَدِيثَ بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ فَلَمَّا سَلَّمَ قُمْتُ فِي مَقَامِي وَلَمْ يَذْكُرْ الْإِمَامَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 108,
                    "chapterNumber": "8",
                    "chapterEnglish": "The Book of Prayer - Friday",
                    "chapterUrdu": "جمعہ کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجُمُعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9608,
                "hadithNumber": "2044",
                "englishNarrator": "Ibn 'Abbas رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "I participated in the Fitr prayer with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and Abu Bakr, 'Umar and 'Uthman رضی اللہ تعالیٰ عنہ , and all of them observed this prayer before the Khutba, and then he (the Holy Prophet) delivered the sermon. Then the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) descended (from the pulpit) and I (perceive) as if I am seeing him as he is commanding people with his hand to sit down. He then made his way through their (assembly) till he came to the women. Bilal رضی اللہ تعالیٰ عنہ was with him. He then recited (this verse): O Prophet, when believing women come to thee giving thee a pledge that they will not associate aught with Allah (lx. 12) till he finished (his address to) them and then said: Do you conform to it (what has been described in the verse)? Only one woman among them replied: Yes, Apostle of Allah, but none else replied. He (the narrator) said: It could not be ascertained who actually she was. He (the Holy Prophet) exhorted them to give alms. Bilal رضی اللہ تعالیٰ عنہ  stretched his cloth and then said: Come forward with alms. Let my father and mother be taken as ransom for you. And they began to throw rings and ringlets in the cloth of Bilal رضی اللہ تعالیٰ عنہ .",
                "hadithUrdu": "میں عید الفطر کی نماز میں رسول اللہ صلی اللہ علیہ وسلم ابو بکر رضی اللہ تعالیٰ عنہ عمر اور عثمان رضی اللہ تعالیٰ عنہ کے ساتھ حاضر ہوا ہوں یہ سب خطبے سے پہلے نماز پڑھتے تھے پھر خطبہ دیتے تھے ایک دفعہ اللہ کے نبی صلی اللہ علیہ وسلم ( بلند جگہ سے ) نیچے آئے ایسا محسوس ہو تا ہے کہ میں ( اب بھی ) آپ کو دیکھ رہا ہوں جب آپ اپنے ہاتھ سے مردوں کو بٹھا رہے تھے پھر ان کے در میان میں سے راستہ بنا تے ہو ئے آگے بڑھے حتیٰ کہ عورتوں کے قریب تشریف لے آئے اور بلال رضی اللہ تعالیٰ عنہ آپ کے ساتھ تھے آپ نے ( قرآن کا یہ حصہ تلاوت ) فر ما یا ۔ \" اے نبی صلی اللہ علیہ وسلم !جب آپ کے پاس مومن عورتیں اس بات پر بیعت کرنے کے لیے آئیں کہ وہ اللہ تعا لیٰ کے ساتھ کسی چیز کو شریک نہیں بنا ئیں گی ۔ آپ نے یہ آیت تلاوت فر ما ئی حتیٰ کہ اس سے فارغ ہو ئے پھر فر ما یا ۔ \" تم اس پر قائم ہو؟ \" تو ایک عورت نے ( جبکہ ) آپ کو اس کے علاوہ ان میں سے اور کسی نے جواب نہیں دیا کہا : ہاں اے اللہ کے نبی صلی اللہ علیہ وسلم ! ۔ ۔ اس وقت پتہ نہیں چل رہا تھا کہ وہ کو ن ہے ۔ ۔ ۔ آپ نے فر ما یا ۔ \" تم صدقہ کرو ۔ ۔ ۔ اس پر بلال رضی اللہ تعالیٰ عنہ نے اپنا کپڑا پھیلا دیا پھر کہنے لگے لاؤ تم سب پر میرے ماں باپ قربان ہوں !تو وہ اپنے بڑے بڑے چھلے اور انگوٹھیا ں بلال رضی اللہ تعالیٰ عنہ کے کپڑے میں ڈالنے لگیں ۔",
                "urduNarrator": "اور مجھ سے محمد بن رافع اور عبد بن حمید نے عبد الرزاق کی سند سے بیان کیا کہ ہم کو عبد الرزاق نے خبر دی , حسن بن مسلم نے طاوس سے خبر دی انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روا یت کی انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ وَعَبْدُ بْنُ حُمَيْدٍ جَمِيعًا عَنْ عَبْدِ الرَّزَّاقِ قَالَ ابْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي الْحَسَنُ بْنُ مُسْلِمٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَ شَهِدْتُ صَلَاةَ الْفِطْرِ مَعَ نَبِيِّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبِي بَكْرٍ وَعُمَرَ وَعُثْمَانَ فَكُلُّهُمْ يُصَلِّيهَا قَبْلَ الْخُطْبَةِ ثُمَّ يَخْطُبُ قَالَ فَنَزَلَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَأَنِّي أَنْظُرُ إِلَيْهِ حِينَ يُجَلِّسُ الرِّجَالَ بِيَدِهِ ثُمَّ أَقْبَلَ يَشُقُّهُمْ حَتَّى جَاءَ النِّسَاءَ وَمَعَهُ بِلَالٌ فَقَالَ يَا أَيُّهَا النَّبِيُّ إِذَا جَاءَكَ الْمُؤْمِنَاتُ يُبَايِعْنَكَ عَلَى أَنْ لَا يُشْرِكْنَ بِاللَّهِ شَيْئًا فَتَلَا هَذِهِ الْآيَةَ حَتَّى فَرَغَ مِنْهَا ثُمَّ قَالَ حِينَ فَرَغَ مِنْهَا أَنْتُنَّ عَلَى ذَلِكِ فَقَالَتْ امْرَأَةٌ وَاحِدَةٌ لَمْ يُجِبْهُ غَيْرُهَا مِنْهُنَّ نَعَمْ يَا نَبِيَّ اللَّهِ لَا يُدْرَى حِينَئِذٍ مَنْ هِيَ قَالَ فَتَصَدَّقْنَ فَبَسَطَ بِلَالٌ ثَوْبَهُ ثُمَّ قَالَ هَلُمَّ فِدًى لَكُنَّ أَبِي وَأُمِّي فَجَعَلْنَ يُلْقِينَ الْفَتَخَ وَالْخَوَاتِمَ فِي ثَوْبِ بِلَالٍ.",
                "headingArabic": "صلاة العيدين",
                "headingUrdu": "نماز کی کتاب - دو عیدیں",
                "headingEnglish": "The Book of Prayer - Two Eids",
                "chapterId": "9",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 109,
                    "chapterNumber": "9",
                    "chapterEnglish": "The Book of Prayer - Two Eids",
                    "chapterUrdu": "نماز عیدین کے احکام و مسائل",
                    "chapterArabic": "كتاب صَلَاةِ الْعِيدَيْنِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9609,
                "hadithNumber": "2045",
                "englishNarrator": "Ibn 'Abbas رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "I bear testimony to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) offering prayer before Kbutba. He (after saying prayer) delivered the Kutba, and he found that the women could not hear it, so he came to them and exhorted them and preached them and commanded them to give alms, and Bilal had stretched his cloth and the women were throwing rings, earrings and other things. This hadith has been narrated on the authority of Ayyub with the same chain of transmitters.",
                "hadithUrdu": "میں رسول اللہ صلی اللہ علیہ وسلم کے بارے میں شہادت دیتا ہوں آپ نماز عید خطبہ سے پہلے پڑھی پھر آپ نے خطبہ دیا پھر آپ نے دیکھا کہ آپ نے عورتوں کو ( اپنی بات ) نہیں سنائی تو آپ ان کے پاس آئے اور ان کو یاد دہانی ( تلقین ) فر ما ئی اور انھیں نصیحت کی اور صدقہ کرنے کا حکم دیا اور بلال رضی اللہ تعالیٰ عنہ اپنا کپڑا پھیلا ئے ہو ئے تھے کو ئی عورت ( اس کپڑے میں ) انگوٹھی پھینکتی تھی ( کو ئی حلقے دارزیور ( چھلے بالیاں کڑے کنگن ) اور کوئی دوسری چیزیں ڈالتی تھی ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابن ابی عمر نے بیان کیا، ہم سے ابوبکر نے بیان کیا, سفیان بن عیینہ نے کہا : ہم سے ایوب نے حدیث بیان کی انھوں نے کہا میں نے عطاء سے سنا انھوں نے کہا میں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ کو یہ کہتے ہوئے سنا کہ",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَابْنُ أَبِي عُمَرَ قَالَ أَبُو بَكْرٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ حَدَّثَنَا أَيُّوبُ قَالَ سَمِعْتُ عَطَاءً قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُ أَشْهَدُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَصَلَّى قَبْلَ الْخُطْبَةِ قَالَ ثُمَّ خَطَبَ فَرَأَى أَنَّهُ لَمْ يُسْمِعْ النِّسَاءَ فَأَتَاهُنَّ فَذَكَّرَهُنَّ وَوَعَظَهُنَّ وَأَمَرَهُنَّ بِالصَّدَقَةِ وَبِلَالٌ قَائِلٌ بِثَوْبِهِ فَجَعَلَتْ الْمَرْأَةُ تُلْقِي الْخَاتَمَ وَالْخُرْصَ وَالشَّيْءَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "9",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 109,
                    "chapterNumber": "9",
                    "chapterEnglish": "The Book of Prayer - Two Eids",
                    "chapterUrdu": "نماز عیدین کے احکام و مسائل",
                    "chapterArabic": "كتاب صَلَاةِ الْعِيدَيْنِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9610,
                "hadithNumber": "2046",
                "englishNarrator": null,
                "hadithEnglish": "A similar report (as no. 2045) was narrated from Ayyub with this chain.",
                "hadithUrdu": "حماد اور اسماعیل بن ابرا ہیم نے ایوب سے اسی سند کے ساتھ اسی طرح حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنِيهِ أَبُو الرَّبِيعِ الزَّهْرَانِيُّ حَدَّثَنَا حَمَّادٌ ح و حَدَّثَنِي يَعْقُوبُ الدَّوْرَقِيُّ حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ كِلَاهُمَا عَنْ أَيُّوبَ بِهَذَا الْإِسْنَادِ نَحْوَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "9",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 109,
                    "chapterNumber": "9",
                    "chapterEnglish": "The Book of Prayer - Two Eids",
                    "chapterUrdu": "نماز عیدین کے احکام و مسائل",
                    "chapterArabic": "كتاب صَلَاةِ الْعِيدَيْنِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9611,
                "hadithNumber": "2047",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) stood up on the day of 'Id al-Fitr and observed prayer. And he commenced the prayer before the sermon. He then delivered the sermon. When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had finished (the sermon) he came down from (the pulpit), and made his way to the women and exhorted them (to do good acts), and he was leaning on the hand of Bilal. Bilal had stretched his cloth in which women were throwing alms. I (one of the narrators) said to 'Ata' (the other narrator): It must be Zakat on the day of Fitr. He ('Ata') said: No. It was alms (which) they were giving on that occasion, and a woman gave her ring, and then others gave, and then others gave. I said to 'Ata': Is It right now for the Imam to come to the women when he has finished (his address to the men) that he should exhort them (to good deeds)? He said: (Why not) by my life, it is right for them (to do so). What is the matter with them that they do not do it now?",
                "hadithUrdu": "میں نے ان ( جابر رضی اللہ تعالیٰ عنہ ) کو یہ کہتے ہوئے سنا کہ نبی صلی اللہ علیہ وسلم عید الفطر کے دن ( نماز کے لیے ) کھڑے ہو ئے پھر نماز پڑھا ئی چنانچہ آپ نے خطبے سے پہلے نماز سے ابتدا کی پھر لو گوں کو خطاب فر ما یا ۔ جب نبی صلی اللہ علیہ وسلم ( خطبہ سے ) فارغ ہو ئے تو ( چبوترے سے ) اتر کر عورتوں کے پاس آئے انھیں تذکیر و نصیحت کی جبکہ آپ بلال رضی اللہ تعالیٰ عنہ کے بازوکا سہارا لیے ہو ئے تھے اور بلال رضی اللہ تعالیٰ عنہ اپنا کپڑا پھیلا ئے ہو ئے تھے عورتیں اس میں صدقہ ڈال رہی تھیں ( ابن جریج نے کہا : ) میں نے عطاء سے پوچھا فطر کے دن کا صدقہ ( ڈال رہی تھیں ؟ ) انھوں نے کہا : نہیں اس وقت ( اپنا ) صدقہ کر رہی تھیں ( کو ئی عورت چھلا ڈالتی تھی ( اسی طرح یکے بعد دیگر ے ( ڈال رہی تھیں اور ڈال رہی تھیں ۔ میں نے عطاء سے ( پھر ) پوچھا : کیا اب بھی امام کے لیے لا زم ہے کہ جب ( مردوں کے خطبے سے ) فارغ ہو تو عورتوں کو تلقین اور نصیحت کرے ؟ انھوں نے کہا : ہاں مجھے اپنی زندگی کی قسم ! یہ ان پر عائد شدہ ) حق ہے انھیں کیا ہو گیا ہے کہ وہ ایسا نہیں کرتے ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم اور محمد بن رافع بن رافع نے بیان کیا , ابن جریج نے کہا : ہمیں عطاء نے حجرت جابر بن عبد اللہ رضی اللہ تعالیٰ عنہ سے خبر دی کہا",
                "hadithArabic": "و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَمُحَمَّدُ بْنُ رَافِعٍ ابْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي عَطَاءٌ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ سَمِعْتُهُ يَقُولُ إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ يَوْمَ الْفِطْرِ فَصَلَّى فَبَدَأَ بِالصَّلَاةِ قَبْلَ الْخُطْبَةِ ثُمَّ خَطَبَ النَّاسَ فَلَمَّا فَرَغَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَزَلَ وَأَتَى النِّسَاءَ فَذَكَّرَهُنَّ وَهُوَ يَتَوَكَّأُ عَلَى يَدِ بِلَالٍ وَبِلَالٌ بَاسِطٌ ثَوْبَهُ يُلْقِينَ النِّسَاءُ صَدَقَةً قُلْتُ لِعَطَاءٍ زَكَاةَ يَوْمِ الْفِطْرِ قَالَ لَا وَلَكِنْ صَدَقَةً يَتَصَدَّقْنَ بِهَا حِينَئِذٍ تُلْقِي الْمَرْأَةُ فَتَخَهَا وَيُلْقِينَ وَيُلْقِينَ قُلْتُ لِعَطَاءٍ أَحَقًّا عَلَى الْإِمَامِ الْآنَ أَنْ يَأْتِيَ النِّسَاءَ حِينَ يَفْرُغُ فَيُذَكِّرَهُنَّ قَالَ إِي لَعَمْرِي إِنَّ ذَلِكَ لَحَقٌّ عَلَيْهِمْ وَمَا لَهُمْ لَا يَفْعَلُونَ ذَلِكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "9",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 109,
                    "chapterNumber": "9",
                    "chapterEnglish": "The Book of Prayer - Two Eids",
                    "chapterUrdu": "نماز عیدین کے احکام و مسائل",
                    "chapterArabic": "كتاب صَلَاةِ الْعِيدَيْنِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9612,
                "hadithNumber": "2048",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "I observed prayer with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) on the 'Id day. He commenced with prayer before the sermon without Adhan and Iqama. He then stood up leaning on Bilal رضی اللہ تعالیٰ عنہ , and he commanded (them) to be on guard (against evil for the sake of) Allah, and he exhorted (them) on obedience to Him, and he preached to the people and admonished them. He then walked on till he came to the women and preached to them and admonished them, and asked them to give alms, for most of them are the fuel for Hell. A woman having a dark spot on the cheek stood up and said: Why is it so, Messenger of Allah? He said: For you grumble often and show ingratitude to your spouse. And then they began to give alms out of their ornaments such as their earrings and rings which they threw on to the cloth of Bilal رضی اللہ تعالیٰ عنہ .",
                "hadithUrdu": "میں عید کے دن رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نماز میں حاضر ہوا آپ نے خطبے سے پہلے اذان اور تکبیر کے بغیر نماز سے ابتدا کی پھر بلال رضی اللہ تعالیٰ عنہ کا سہارا لے کر کھڑے ہو ئے اللہ کے تقوے کا حکم دیا اس کی اطاعت پر ابھا را لو گو ں کو نصیحت کی اور انھیں ( دین کی بنیادی باتوں کی ) یاد دہانی کرا ئی پھر چل پڑے حتیٰ کہ عورتوں کے پاس آگئے ( تو ) انھیں وعظ و تلقین ( تذکیر ) کی اور فر ما یا ۔ \" صدقہ کرو کیونکہ تم میں اسے اکثر جہنم کا ایندھن ہیں ۔ \" عورتوں کے در میان سے ایک بھلی سیاہی مائل رخساروں والی عورت نے کھڑے ہو کر پوچھا : اللہ کے رسول صلی اللہ علیہ وسلم !کیوں ؟آپ نے فر ما یا : اس لیے کہ تم شکا یت بہت کرتی ہو اور اپنے رفیق زندگی کی ناشکری کرتی ہو ۔ ( جا بر رضی اللہ تعالیٰ عنہ نے ) کہا اس پردہ عورتیں اپنے زیورات سے صدقہ کرنے لگیں وہ بلال رضی اللہ تعالیٰ عنہ کے کپڑے میں اپنی بالیاں اور انگھوٹھیاں ڈالنے لگیں ۔",
                "urduNarrator": "اور ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا، کہا ہم سے میرے والد نے بیان کیا، انہوں نے بیان کیا عبد الملک بن ابی سلیمان نے عطاء سے اور انھوں نے حضرت جابر بن عبد اللہ رضی اللہ تعالیٰ عنہ سے روا یت کی انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ أَبِي سُلَيْمَانَ عَنْ عَطَاءٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ شَهِدْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصَّلَاةَ يَوْمَ الْعِيدِ فَبَدَأَ بِالصَّلَاةِ قَبْلَ الْخُطْبَةِ بِغَيْرِ أَذَانٍ وَلَا إِقَامَةٍ ثُمَّ قَامَ مُتَوَكِّئًا عَلَى بِلَالٍ فَأَمَرَ بِتَقْوَى اللَّهِ وَحَثَّ عَلَى طَاعَتِهِ وَوَعَظَ النَّاسَ وَذَكَّرَهُمْ ثُمَّ مَضَى حَتَّى أَتَى النِّسَاءَ فَوَعَظَهُنَّ وَذَكَّرَهُنَّ فَقَالَ تَصَدَّقْنَ فَإِنَّ أَكْثَرَكُنَّ حَطَبُ جَهَنَّمَ فَقَامَتْ امْرَأَةٌ مِنْ سِطَةِ النِّسَاءِ سَفْعَاءُ الْخَدَّيْنِ فَقَالَتْ لِمَ يَا رَسُولَ اللَّهِ قَالَ لِأَنَّكُنَّ تُكْثِرْنَ الشَّكَاةَ وَتَكْفُرْنَ الْعَشِيرَ قَالَ فَجَعَلْنَ يَتَصَدَّقْنَ مِنْ حُلِيِّهِنَّ يُلْقِينَ فِي ثَوْبِ بِلَالٍ مِنْ أَقْرِطَتِهِنَّ وَخَوَاتِمِهِنَّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "9",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 109,
                    "chapterNumber": "9",
                    "chapterEnglish": "The Book of Prayer - Two Eids",
                    "chapterUrdu": "نماز عیدین کے احکام و مسائل",
                    "chapterArabic": "كتاب صَلَاةِ الْعِيدَيْنِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9613,
                "hadithNumber": "2049",
                "englishNarrator": "Ibn 'Abbas and Jaibir bin 'Abdullah al-Ansari رضی اللہ عنہ reported:",
                "hadithEnglish": "There was no Adhan on the (occasion) of Id-ul-Fitr and Id-ul-Adha. I (Ibn Juraij) said: I asked him after some time about it. He ('Ata', one of the narrators) said: Jabir b. 'Abdullah al-Ansari told me: There is neither any Adhan on Id-ul-Fitr when the Imam comes out, nor even after his coming out; their is neither lqama nor call nor anything of the sort of calling on that day and nor Iqama.",
                "hadithUrdu": "اذان نہ عیدالفطر میں ہوتی تھی اور نہ عید الاضحیٰ میں ۔ پھر میں نے ان سے پوچھا تھوڑی دیر کے بعد اسی بات کو ، (یہ قول ہے ابن جریج راوی کا) تو انہوں نے کہا (یعنی ان کے شیخ عطاء نے) کہ خبر دی مجھے سیدنا جابر بن عبداللہ انصاری ؓ نے کہ نہ اذان ہوتی تھی عیدالفطر میں جب نکلتا تھا اور نہ بعد اس کے نکلنے کے اور نہ تکبیر ہوتی ، نہ اذان اور نہ اور کچھ وہ دن ایسا ہے کہ اس دن نہ اذان ہے نہ تکبیر ۔",
                "urduNarrator": "مجھ سے محمد بن رافع نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، کہا ہم سے ابن جریج نے بیان کیا، کہا کہ مجھ سے عطاء نے بیان کیا، وہ ابن عباس رضی اللہ عنہما سے اور جابر بن عبداللہ الانصار رضی اللہ عنہ سے کہ انہوں نے کہا کہ",
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي عَطَاءٌ عَنْ ابْنِ عَبَّاسٍ وَعَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ الْأَنْصَارِيِّ قَالَا لَمْ يَكُنْ يُؤَذَّنُ يَوْمَ الْفِطْرِ وَلَا يَوْمَ الْأَضْحَى ثُمَّ سَأَلْتُهُ بَعْدَ حِينٍ عَنْ ذَلِكَ فَأَخْبَرَنِي قَالَ أَخْبَرَنِي جَابِرُ بْنُ عَبْدِ اللَّهِ الْأَنْصَارِيُّ أَنْ لَا أَذَانَ لِلصَّلَاةِ يَوْمَ الْفِطْرِ حِينَ يَخْرُجُ الْإِمَامُ وَلَا بَعْدَ مَا يَخْرُجُ وَلَا إِقَامَةَ وَلَا نِدَاءَ وَلَا شَيْءَ لَا نِدَاءَ يَوْمَئِذٍ وَلَا إِقَامَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "9",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 109,
                    "chapterNumber": "9",
                    "chapterEnglish": "The Book of Prayer - Two Eids",
                    "chapterUrdu": "نماز عیدین کے احکام و مسائل",
                    "chapterArabic": "كتاب صَلَاةِ الْعِيدَيْنِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 9301,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=372",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=370",
                "label": "370",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=371",
                "label": "371",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=372",
                "label": "372",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=373",
                "label": "373",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=374",
                "label": "374",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=375",
                "label": "375",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=376",
                "label": "376",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=374",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=374",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=372",
        "to": 9325,
        "total": 40465
    }
}