{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 379,
        "data": [
            {
                "id": 9739,
                "hadithNumber": "2175",
                "englishNarrator": "Umm 'Atiyya رضی اللہ تعالیٰ عنہا س reported:",
                "hadithEnglish": "When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) asked her to wash his daughter, he told her to start from the right side, and with those parts of the body over which Wudu' is performed.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے جہاں انھیں اپنی بیٹی کو غسل دینے کا حکم دیا تو ( وہاں یہ بھی ) فر ما یا : \" ان کی دائیں جانب سے اور اس کے وضو کے اعضا ء سے ( غسل کی ابتداء کرو ۔ ) \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے بیان کیا ہشیم نے خالد سے خبردی انھوں نے حفصہ بنت سیرین سے اور انھوں نے حضرت ام عطیہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا هُشَيْمٌ عَنْ خَالِدٍ عَنْ حَفْصَةَ بِنْتِ سِيرِينَ عَنْ أُمِّ عَطِيَّةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَيْثُ أَمَرَهَا أَنْ تَغْسِلَ ابْنَتَهُ قَالَ لَهَا ابْدَأْنَ بِمَيَامِنِهَا وَمَوَاضِعِ الْوُضُوءِ مِنْهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 112,
                    "chapterNumber": "12",
                    "chapterEnglish": "The Book of Prayer - Funerals",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجَنَائِزِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9740,
                "hadithNumber": "2176",
                "englishNarrator": "Umm 'Atiyya رضی اللہ تعالیٰ عنہا reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to them (the women) in regard to the washing of his daughter to start from the right side and with those parts of the body over which Wudu' is performed.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے اپنی بیٹی کے غسل کے بارے میں ان سے فر ما یا : \" ان کی دائیں جا نب سے اور ان کے وضو کے اعضاء سے آغاز کرو ۔",
                "urduNarrator": "ہم سے یحییٰ بن ایوب، ابوبکر بن ابی شیبہ اور عمرو ناقد نے بیان کیا، ابوبکر نے ہم سے بیان کیا, اسماعیل ابن علیہ نے خالد سے انھوں نے حفصہ سے اور انھوں نے حضرت ام عطیہ رضی اللہ تعالیٰ عنہا سے روا یت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ كُلُّهُمْ عَنْ ابْنِ عُلَيَّةَ قَالَ أَبُو بَكْرٍ حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ عَنْ خَالِدٍ عَنْ حَفْصَةَ عَنْ أُمِّ عَطِيَّةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهُنَّ فِي غَسْلِ ابْنَتِهِ ابْدَأْنَ بِمَيَامِنِهَا وَمَوَاضِعِ الْوُضُوءِ مِنْهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 112,
                    "chapterNumber": "12",
                    "chapterEnglish": "The Book of Prayer - Funerals",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجَنَائِزِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9741,
                "hadithNumber": "2177",
                "englishNarrator": "Khabbab al-Aratt رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "We migrated with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) in the path of Allah seeking Allah's pleasure alone. Thus our reward was assured with Allah. And amongst us were those who spent life (in such a state of piety and austerity) that nothing consumed their reward. Mus'ab bin 'Umair رضی اللہ تعالیٰ عنہا was one of them. He was killed on the Day of Uhud, and nothing but a woollen cloak was found to shroud him. When we covered his head with it, his feet became uncovered, and when we covered his feet, his head was uncovered. Upon this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Place it (this cloak) on the side of his head and cover his feet with grass. And there is one amongst us for whom the fruit is ripened and he enjoys it.",
                "hadithUrdu": "ہم نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ اللہ کے راستے میں ہجرت کی ۔ ہم اللہ کی رضاچا ہتے تھے تو ( اس کے وعدے کے مطا بق ) ہمارا اجر اللہ پر واجب ہو گیا ۔ ہم میں سے کچھ لو گ چلے گئے انھوں نے ( دنیا میں ) اپنے اجر میں سے کچھ نہیں لیا ان میں سے ایک مصعب بن عمیر رضی اللہ تعالیٰ عنہا تھے وہ احد کے دن شہید ہو ئے تو ان کے لیے ایک دھاری دار چادر کے سوا کو ئی چیز نہ ملی جس میں ان کو کفن دیا جا تا ۔ جب ہم اس کو ان کے سر پر ڈالتے تو ان کے پا ؤں باہر نکل جا تے اور جب ہم اسے ان کے پیروں پر رکھتے تو سر نکل جا تا ۔ اس پر رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" اس کو ان کے سر والے حصے پر ڈال دا اور پاؤں پر کچھ اذخر ( گھاس ) ڈال دو ۔ اور ہم میں سے کو ئی ایسا ہے جس کے لیے پھل پک چکا ہے اور وہ اس کو چن رہا ہے -",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ التمیمی، ابوبکر بن ابی شیبہ، محمد بن عبداللہ بن نمیر اور ابو کریب نے بیان کیا، اور الفاظ یحییٰ کے پاس، یحییٰ نے کہا، \"اس نے ہمیں اطلاع دی،\" اور دوسروں نے کہا، \"اس نے ہمیں اطلاع دی, ابو معاویہ نے اعمش سے انھوں نے شقیق سے اور انھوں نے حضرت خباب بن ارت رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ وَأَبُو كُرَيْبٍ وَاللَّفْظُ لِيَحْيَى قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الْآخَرُونَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ شَقِيقٍ عَنْ خَبَّابِ بْنِ الْأَرَتِّ قَالَ هَاجَرْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَبِيلِ اللَّهِ نَبْتَغِي وَجْهَ اللَّهِ فَوَجَبَ أَجْرُنَا عَلَى اللَّهِ فَمِنَّا مَنْ مَضَى لَمْ يَأْكُلْ مِنْ أَجْرِهِ شَيْئًا مِنْهُمْ مُصْعَبُ بْنُ عُمَيْرٍ قُتِلَ يَوْمَ أُحُدٍ فَلَمْ يُوجَدْ لَهُ شَيْءٌ يُكَفَّنُ فِيهِ إِلَّا نَمِرَةٌ فَكُنَّا إِذَا وَضَعْنَاهَا عَلَى رَأْسِهِ خَرَجَتْ رِجْلَاهُ وَإِذَا وَضَعْنَاهَا عَلَى رِجْلَيْهِ خَرَجَ رَأْسُهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَعُوهَا مِمَّا يَلِي رَأْسَهُ وَاجْعَلُوا عَلَى رِجْلَيْهِ الْإِذْخِرَ وَمِنَّا مَنْ أَيْنَعَتْ لَهُ ثَمَرَتُهُ فَهْوَ يَهْدِبُهَا.",
                "headingArabic": "فِي كَفَنِ الْمَيِّتِ ‏",
                "headingUrdu": "میت کو کفن دینا",
                "headingEnglish": "Shrouding the deceased",
                "chapterId": "12",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 112,
                    "chapterNumber": "12",
                    "chapterEnglish": "The Book of Prayer - Funerals",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجَنَائِزِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9742,
                "hadithNumber": "2178",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been narrated by 'Uyaina on the authority of A'mash with the same chain of transmitters.",
                "hadithUrdu": "ہم سے عثمان بن ابی شیبہ نے بیان کیا, جریر عیسیٰ بن یو نس علی بن مسہر اور ابن عیینہ نے اعمش سے اسی سند کے ساتھ اسی طرح حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ ح و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ ح و حَدَّثَنَا مِنْجَابُ بْنُ الْحَارِثِ التَّمِيمِيُّ أَخْبَرَنَا عَلِيُّ بْنُ مُسْهِرٍ ح و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَابْنُ أَبِي عُمَرَ جَمِيعًا عَنْ ابْنِ عُيَيْنَةَ عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ نَحْوَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 112,
                    "chapterNumber": "12",
                    "chapterEnglish": "The Book of Prayer - Funerals",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجَنَائِزِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9743,
                "hadithNumber": "2179",
                "englishNarrator": "A'isha رضی اللہ تعالیٰ عنہا reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was shrouded in three cotton garments of white Yamani stuff from Sahul, among which was neither a shirt nor a turban; and so far as Hullah is concerned there was some doubt about it in the minds of people, that it was brought for him in order to shroud him with it, but it was abandoned, and he was shrouded in three cotton garments of white Yamani stuff from Sahul. Then 'Abdullah b. Abu Bakr رضی اللہ تعالیٰ عنہ got it and said: I would keep it in order to shroud myself in it. He then said: If Allah, the Exalted and Majestic, would have desired it for His Apostle, he would have been shrouded with it. So he sold it and gave its price in charity.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کو سحول ( یمن ) سے لا ئے جا نے والے تین سفید سوتی کپڑوں میں کفن دیا گیا ان میں نہ قمیص تھی اور نہ عمامہ البتہ حُلے ( ہم رنگ چادروں پر مشتمل جوڑے ) کے حوالے سے لو گ اشتباہ میں پڑگئے بلا شبہ وہ آپ کے لیے خرید ا گیا تھا تا کہ آپ کو اس میں کفن دیا جا ئے ۔ پھر اس حلے کو چھوڑ دیا گیا اور آپ کو سحول کے تین سفید کپڑوں میں کفن دیا گیا اور اس ( حلے ) کو عبد اللہ بن ابی بکر رضی اللہ تعالیٰ عنہ نے لے لیا اور کہا : میں اس کو ( اپنے پاس ) محفوظ رکھوں گا یہاں تک کہ اس میں خود اپنے کفن کا انتظام کروں گا بعد میں کہا : اگر اسکو اللہ تعا لیٰ اپنے نبی کے لیے پسند فر ماتا تو آپ کو اس میں کفن ( دینے کا بندوبست کر ) دیتا اس لیے انھوں نے اسے فروخت کردیا اور اس کی قیمت صدقہ کر دی ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ، ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، اور الفاظ یہ ہیں کہ یحییٰ نے کہا کہ اس نے ہم سے بیان کیا اور باقی دو نے کہا: اس نے ہم سے بیان کیا,ابو معاویہ نے ہشام بن عروہ سے انھوں نے اپنے والد ( عروہ ) سے انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ وَاللَّفْظُ لِيَحْيَى قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الْآخَرَانِ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ كُفِّنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ثَلَاثَةِ أَثْوَابٍ بِيضٍ سَحُولِيَّةٍ مِنْ كُرْسُفٍ لَيْسَ فِيهَا قَمِيصٌ وَلَا عِمَامَةٌ أَمَّا الْحُلَّةُ فَإِنَّمَا شُبِّهَ عَلَى النَّاسِ فِيهَا أَنَّهَا اشْتُرِيَتْ لَهُ لِيُكَفَّنَ فِيهَا فَتُرِكَتْ الْحُلَّةُ وَكُفِّنَ فِي ثَلَاثَةِ أَثْوَابٍ بِيضٍ سَحُولِيَّةٍ فَأَخَذَهَا عَبْدُ اللَّهِ بْنُ أَبِي بَكْرٍ فَقَالَ لَأَحْبِسَنَّهَا حَتَّى أُكَفِّنَ فِيهَا نَفْسِي ثُمَّ قَالَ لَوْ رَضِيَهَا اللَّهُ عَزَّ وَجَلَّ لِنَبِيِّهِ لَكَفَّنَهُ فِيهَا فَبَاعَهَا وَتَصَدَّقَ بِثَمَنِهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 112,
                    "chapterNumber": "12",
                    "chapterEnglish": "The Book of Prayer - Funerals",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجَنَائِزِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9744,
                "hadithNumber": "2180",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was wrapped in a Yamani wrapper which belonged to 'Abdullah bin Abu Bakr رضی اللہ تعالیٰ عنہ ; then it was removed from him, and he was shrouded in three cotton sheets of white Yamani stuff from Sahul among which was neither a shirt nor a turban. 'Abdullah رضی اللہ تعالیٰ عنہ took up the Hullah and said: I would be shrouded in it, but then said: How is it that I should be shrouded in it in which the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was not shrouded! So he gave it in charity.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کو عبد اللہ بن ابی بکر رضی اللہ تعالیٰ عنہ کے ایک یمنی حلے میں لپیٹا ( کفن دیا ) گیا پھر اس کو اتاردیا گیا اور آپ کو سحول کے تین سفید یمنی کپڑوں میں کفن دیا گیا جن میں نہ قمیص تھی اور نہ عمامہ ۔ عبد اللہ رضی اللہ تعالیٰ عنہ نے وہ حلہ اٹھا لیا اور کہا : مجھے اس میں کفن دیا جا ئے گا پھر کہا : رسول اللہ صلی اللہ علیہ وسلم کو اس میں کفن نہیں دیا گیا تو مجھے اس میں کفن دیا جا ئے گا !چنانچہ انھوں نے اس کو صدقہ کردیا ۔",
                "urduNarrator": "اور مجھ سے علی بن حجر السعدی نے بیان کیا، انہوں نے ہم سے بیان کیا, علی بن مسہر نے کہا : ہمیں ہشام بن عروہ نے اپنے والد اور عائشہ رضی اللہ عنہا سے حدیث سنا ئی انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ أَخْبَرَنَا عَلِيُّ بْنُ مُسْهِرٍ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ أُدْرِجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حُلَّةٍ يَمَنِيَّةٍ كَانَتْ لِعَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ ثُمَّ نُزِعَتْ عَنْهُ وَكُفِّنَ فِي ثَلَاثَةِ أَثْوَابٍ سُحُولٍ يَمَانِيَةٍ لَيْسَ فِيهَا عِمَامَةٌ وَلَا قَمِيصٌ فَرَفَعَ عَبْدُ اللَّهِ الْحُلَّةَ فَقَالَ أُكَفَّنُ فِيهَا ثُمَّ قَالَ لَمْ يُكَفَّنْ فِيهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأُكَفَّنُ فِيهَا فَتَصَدَّقَ بِهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 112,
                    "chapterNumber": "12",
                    "chapterEnglish": "The Book of Prayer - Funerals",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجَنَائِزِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9745,
                "hadithNumber": "2181",
                "englishNarrator": null,
                "hadithEnglish": "This hadith is narrated on the authority of Hisham with the same chain of transmitters, but in the hadith narrated by him there is no mention of the story of 'Abdullah bin Abu Bakr رضی اللہ تعالیٰ عنہ .",
                "hadithUrdu": "اور ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, حفص بن غیاث ، ابن عیینہ ، ابن ادریس ، عبدہ ، وکیع اور عبد العزیز سب نے ہشام سے اسی سند کے ساتھ روایت کی اور ان کی حدیث میں عبد اللہ بن ابی بکر رضی اللہ تعالیٰ عنہ کا واقعہ نہیں ہے ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ وَابْنُ عُيَيْنَةَ وَابْنُ إِدْرِيسَ وَعَبْدَةُ وَوَكِيعٌ ح و حَدَّثَنَاه يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ كُلُّهُمْ عَنْ هِشَامٍ بِهَذَا الْإِسْنَادِ وَلَيْسَ فِي حَدِيثِهِمْ قِصَّةُ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 112,
                    "chapterNumber": "12",
                    "chapterEnglish": "The Book of Prayer - Funerals",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجَنَائِزِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9746,
                "hadithNumber": "2182",
                "englishNarrator": "Abu Salama said:",
                "hadithEnglish": "I asked 'A'isha رضی اللہ تعالیٰ عنہا with how many garments the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was shourded. She said: With three garments of Sahul.",
                "hadithUrdu": "میں نے نبی صلی اللہ علیہ وسلم کی اہلیہ حضرت عائشہ رضی اللہ تعالیٰ عنہا سے سوال کیا : میں نے ان سے کہا : رسول اللہ صلی اللہ علیہ وسلم کو کتنے کپڑوں میں کفن دیا گیا تھا ؟تو انھوں نے کہا : تین سحولی کپڑوں میں ۔",
                "urduNarrator": "مجھ سے ابن ابی عمر نے بیان کیا، ہم سے عبدالعزیز نے بیان کیا، یزید کی سند سے، محمد بن ابراہیم کی سند سے, ابو سلمہ ( عبد اللہ بن عبد الرحمان بن عوف رضی اللہ تعالیٰ عنہ ) سے روایت ہے کہ انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنِي ابْنُ أَبِي عُمَرَ حَدَّثَنَا عَبْدُ الْعَزِيزِ عَنْ يَزِيدَ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي سَلَمَةَ أَنَّهُ قَالَ سَأَلْتُ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ لَهَا فِي كَمْ كُفِّنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ فِي ثَلَاثَةِ أَثْوَابٍ سَحُولِيَّةٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 112,
                    "chapterNumber": "12",
                    "chapterEnglish": "The Book of Prayer - Funerals",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجَنَائِزِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9747,
                "hadithNumber": "2183",
                "englishNarrator": "A'isha رضی اللہ تعالیٰ عنہا reported:",
                "hadithEnglish": "When the Messenger of Allah (ﷺ) died, he was covered with a Yamani wrapper.",
                "hadithUrdu": "جب رسول اللہ صلی اللہ علیہ وسلم فوت ہو ئے تو آپ کو دھاری دار یمنی چادر سے ڈھا نپا گیا ۔",
                "urduNarrator": "ہم سے زہیر بن حرب، حسن حلوانی اور عبد بن حمید نے بیان کیا اور باقی دو نے کہا کہ یعقوب کون ہے؟ ہم سے میرے والد ابراہیم بن سعد نے روایت کی, صالح ( بن کیسان ) نے ابن شہاب ( زہری سے روایت کی ، انھیں ابو سلمہ بن عبد الرحمان نے خبردی کہ ام المومنین حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا",
                "hadithArabic": "و حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَحَسَنٌ الْحُلْوَانِيُّ وَعَبْدُ بْنُ حُمَيْدٍ قَالَ عَبْدٌ أَخْبَرَنِي و قَالَ الْآخَرَانِ حَدَّثَنَا يَعْقُوبُ وَهُوَ ابْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنَا أَبِي عَنْ صَالِحٍ عَنْ ابْنِ شِهَابٍ أَنَّ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ أَخْبَرَهُ أَنَّ عَائِشَةَ أُمَّ الْمُؤْمِنِينَ قَالَتْ سُجِّيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ مَاتَ بِثَوْبِ حِبَرَةٍ.",
                "headingArabic": "تَسْجِيَةِ الْمَيِّتِ ‏",
                "headingUrdu": "میت کو ڈھانپنا",
                "headingEnglish": "Covering the deceased",
                "chapterId": "12",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 112,
                    "chapterNumber": "12",
                    "chapterEnglish": "The Book of Prayer - Funerals",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجَنَائِزِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9748,
                "hadithNumber": "2184",
                "englishNarrator": null,
                "hadithEnglish": "The same was narrated from Az-Zuhri with this chain.",
                "hadithUrdu": "ہم سے اسحاق بن ابراہیم اور عبد بن حمید نے بیان کیا، انہوں نے کہا: ہمیں عبدالرزاق نے خبر دی، انہوں نے کہا: ہمیں معمر اور شہاب نے ( ابن شہاب ) زہری سے اسی سند کے ساتھ بالکل اسی طرح حدیث روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَاه إِسْحَقُ بْنُ إِبْرَاهِيمَ وَعَبْدُ بْنُ حُمَيْدٍ قَالَا أَخْبَرَنَا عَبْدُ الرَّزَّاقِ قَالَ أَخْبَرَنَا مَعْمَرٌ ح و حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ أَخْبَرَنَا أَبُو الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ بِهَذَا الْإِسْنَادِ سَوَاءً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 112,
                    "chapterNumber": "12",
                    "chapterEnglish": "The Book of Prayer - Funerals",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجَنَائِزِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9749,
                "hadithNumber": "2185",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) one day in the course of his sermon made mention of a person among his Companions who had died and had been wrapped in a shroud not long (enough to cover his whole body) and was buried during the night. The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) reprimanded (the audience) that a person was buried during the night (in a state that) funeral prayer could not be offered (over him by the Messenger of Allah). (And this is permissible only) when it becomes a dire necessity for a man. The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) also said: When any one of you shrouds his brother, he should shroud him well.",
                "hadithUrdu": "ایک دن نبی اکرم صلی اللہ علیہ وسلم نے خطبہ دیا ، آپ نے اپنے اصحاب میں سے ایک آدمی کا تذکرہ فر ما یا جو فوت ہوا تو اس کو معمولی ( کپڑے میں ) کفن دیا گیا اور رات ہی کو دفن کر دیا گیا تو نبی اکرم صلی اللہ علیہ وسلم نے کسی بھی آدمی کو رات کو دفن کرنے سے ڈانٹ کر روکا یہاں تک کہ اس کی ( شان شایان طریقے سے ) نماز جنازہ ادا کی جا ئے اولاًیہ کہ کو ئی انسان اس پر مجبور ہو جا ئے اور نبی اکرم صلی اللہ علیہ وسلم نے فر ما یا : \" جب تم میں سے کو ئی شخص اپنے بھا ئی کو کفن دے تو اسے اچھا کفن دے ۔",
                "urduNarrator": "ہم سے ہارون بن عبداللہ اور حجاج بن شعر نے بیان کیا، کہا: ہم سے حجاج بن محمد نے بیان کیا، کہا: ابن جریج نے کہا: مجھے ابو الزبیر نے خبر دی کہ انہوں نے سنا, حضرت جا بر بن عبد اللہ رضی اللہ تعالیٰ عنہ بیان کر تے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ وَحَجَّاجُ بْنُ الشَّاعِرِ قَالَا حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يُحَدِّثُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطَبَ يَوْمًا فَذَكَرَ رَجُلًا مِنْ أَصْحَابِهِ قُبِضَ فَكُفِّنَ فِي كَفَنٍ غَيْرِ طَائِلٍ وَقُبِرَ لَيْلًا فَزَجَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُقْبَرَ الرَّجُلُ بِاللَّيْلِ حَتَّى يُصَلَّى عَلَيْهِ إِلَّا أَنْ يُضْطَرَّ إِنْسَانٌ إِلَى ذَلِكَ وَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كَفَّنَ أَحَدُكُمْ أَخَاهُ فَلْيُحَسِّنْ كَفَنَهُ.",
                "headingArabic": "فِي تَحْسِينِ كَفَنِ الْمَيِّتِ ‏",
                "headingUrdu": "میت کو کفن دینا",
                "headingEnglish": "Shrouding the deceased well",
                "chapterId": "12",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 112,
                    "chapterNumber": "12",
                    "chapterEnglish": "The Book of Prayer - Funerals",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجَنَائِزِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9750,
                "hadithNumber": "2186",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Make haste at a funeral; if the dead person was good, it is a good state to which you are sending him on; but if he was otherwise it is an evil of which you are ridding yourselves.",
                "hadithUrdu": "آپ نے فر ما یا جنا زے ( کو لے جا نے ) میں جلدی کرو ، اگر وہ ( میت ) نیک ہے تو جس کی طرف تم اس کو لے جا رہے ہو وہ خیرہے اگر وہ اس کے سوا ہے تو پھر وہ شر ہے جسے تم اپنی گردنوں سے اتاردو گے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور زہیر بن حرب نے ابن عیینہ کی سند سے بیان کیا، ہم سے ابوبکر نے بیان کیا, سفیان بن عیینہ نے زہری سے انھوں نے سعید ( بن مسیب ) سے انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ جَمِيعًا عَنْ ابْنِ عُيَيْنَةَ قَالَ أَبُو بَكْرٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَسْرِعُوا بِالْجَنَازَةِ فَإِنْ تَكُ صَالِحَةً فَخَيْرٌ لَعَلَّهُ قَالَ تُقَدِّمُونَهَا عَلَيْهِ وَإِنْ تَكُنْ غَيْرَ ذَلِكَ فَشَرٌّ تَضَعُونَهُ عَنْ رِقَابِكُمْ.",
                "headingArabic": "الإِسْرَاعِ بِالْجَنَازَةِ ‏",
                "headingUrdu": "جنازے کے ساتھ جلدی کرنا",
                "headingEnglish": "Hastening with the funeral",
                "chapterId": "12",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 112,
                    "chapterNumber": "12",
                    "chapterEnglish": "The Book of Prayer - Funerals",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجَنَائِزِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9751,
                "hadithNumber": "2187",
                "englishNarrator": "It was narrated from Abu Hurairah from the prophet ﷺ (a similar hadith as no. 2186) except that in the Hadith of Mamar it says:",
                "hadithEnglish": "\"I know only that he attributed it to the prophet ﷺ.",
                "hadithUrdu": "انھوں ( ابو ہریرہ رضی اللہ تعالیٰ عنہ ) نے اس حدیث کو مرفوع ( رسول اللہ صلی اللہ علیہ وسلم سے ) بیان کیا ہے ۔",
                "urduNarrator": "مجھے محمد بن رافع اور عبد بن حمید نے عبد الرزاق کی سند سے بیان کیا,معمر اور محمد بن ابی حفصہ دو نوں نے زہری سے ، انھوں نے سعید ( بن مسیب ) سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے ، انھوں نے نبی صلی اللہ علیہ وسلم سے ( یہی حدیث ) روایت کی ، لیکن معمر کی حدیث میں ہے انھوں نے کہا : میں اس کے سوا اور کچھ نہیں جا نتا کہ",
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ وَعَبْدُ بْنُ حُمَيْدٍ جَمِيعًا عَنْ عَبْدِ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ ح و حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي حَفْصَةَ كِلَاهُمَا عَنْ الزُّهْرِيِّ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَيْرَ أَنَّ فِي حَدِيثِ مَعْمَرٍ قَالَ لَا أَعْلَمُهُ إِلَّا رَفَعَ الْحَدِيثَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 112,
                    "chapterNumber": "12",
                    "chapterEnglish": "The Book of Prayer - Funerals",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجَنَائِزِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9752,
                "hadithNumber": "2188",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger as saying: Hasten at a funeral, for if (the dead person) is good, you would (soon) bring him close to the good. And if it is otherwise, it is an evil of which you are ridding yourselves.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فر ما تے ہو ئے سنا ہے : \" جنا زے میں جلدی کرو اگر ( میت ) نیک ہے تو تم نے اسے بھلا ئی کے قریب کر دیا اور اگر وہ اس کے سوا ہے تو شر ہے جسے تم اپنی گردنوں سے اتار دو گے ۔",
                "urduNarrator": "مجھ سے ابو الطاہر، ہرملہ بن یحییٰ اور ہارون بن سعید العیلی نے بیان کیا، انہوں نے کہا کہ ہم سے انہوں نے بیان کیا، اور دو نے کہا: ہم سے ابن وہب نے بیان کیا، اور مجھے نص بن یزید نے بیان کیا۔ ابن شہاب کی روایت سے کہا:  ابو امامہ بن سہل بن حنیف نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روا یت کی انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنِي أَبُو الطَّاهِرِ وَحَرْمَلَةُ بْنُ يَحْيَى وَهَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ قَالَ هَارُونُ حَدَّثَنَا و قَالَ الْآخَرَانِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ بْنُ يَزِيدَ عَنْ ابْنِ شِهَابٍ قَالَ حَدَّثَنِي أَبُو أُمَامَةَ بْنُ سَهْلِ بْنِ حُنَيْفٍ عَنْ أَبِي هُرَيْرَةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ أَسْرِعُوا بِالْجَنَازَةِ فَإِنْ كَانَتْ صَالِحَةً قَرَّبْتُمُوهَا إِلَى الْخَيْرِ وَإِنْ كَانَتْ غَيْرَ ذَلِكَ كَانَ شَرًّا تَضَعُونَهُ عَنْ رِقَابِكُمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 112,
                    "chapterNumber": "12",
                    "chapterEnglish": "The Book of Prayer - Funerals",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجَنَائِزِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9753,
                "hadithNumber": "2189",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who attends the funeral till the prayer is offered for (the dead), for him is the reward of one qirat, and he who attends (and stays) till he is buried, for him is the reward of two qirats. It was said: What are the qirats? He said: They are equivalent to two huge mountains. Two other narrators added: Ibn 'Umar رضی اللہ تعالیٰ عنہ used to pray and then depart (without waiting for the burial of the dead). When the tradition of Abu Huraira رضی اللہ تعالیٰ عنہ reached him, he said: We have lost many qirats.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \"\" جو شخص جنا زے میں شریک رہا یہاں تک کہ نماز جنا زہ ادا کر لی گئی تو اس کے لیے ایک قیراط ہے اور جو اس ( جنازے ) میں شریک رہاحتیٰ کہ اس کو دفن کر دیا گیا تو اس کے لیے دو قیراط ہیں ۔ \"\" پوچھا گیا : دو قیراط سے کہا مراد ہے ؟ آپ صلی اللہ علیہ وسلم نے فر ما یا : \"\" دو بڑے پہاڑوں کے مانند ۔ ابو طا ہر کی حدیث یہاں ختم ہو گئی ۔ دوسرے دو اساتذہ نے اضافہ کیا : ابن شہاب نے کہا : سالم بن عبد اللہ بن عمرنے کہا : کہ حضرت ابن عمر رضی اللہ تعالیٰ عنہ نماز جنازہ پڑھ کر لو ٹ آتے تھے جب ان کو حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ کی حدیث پہنچی تو انھوں نے نے کہایقیناًہم نے بہت سے قیراطوں میں نقصان اٹھا یا ۔",
                "urduNarrator": "ابو طا ہر حرملہ یحییٰ اور ہارون بن سعید ایلی ۔ ۔ ۔ اس روایت کے الفا ظ ہارون اور حرملہ کے ہیں ۔ ۔ ۔ میں سے ہارون نے کہا : ہمیں حدیث سنا ئی اور دو سرے دو نوں نے کہا : ہمیں ابن وہب نے خبر دی ، انھوں نے نے کہا : مجھے یو نس نے ابن شہاب سے خبر دی کہا : مجھے عبد الرحمان بن ہر مزا عرج نے حدیث بیان کی کہ حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ نے کہا",
                "hadithArabic": "و حَدَّثَنِي أَبُو الطَّاهِرِ وَحَرْمَلَةُ بْنُ يَحْيَى وَهَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ وَاللَّفْظُ لِهَارُونَ وَحَرْمَلَةَ قَالَ هَارُونُ حَدَّثَنَا وَقَالَ الْآخَرَانِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ هُرْمُزَ الْأَعْرَجُ أَنَّ أَبَا هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ شَهِدَ الْجَنَازَةَ حَتَّى يُصَلَّى عَلَيْهَا فَلَهُ قِيرَاطٌ وَمَنْ شَهِدَهَا حَتَّى تُدْفَنَ فَلَهُ قِيرَاطَانِ قِيلَ وَمَا الْقِيرَاطَانِ قَالَ مِثْلُ الْجَبَلَيْنِ الْعَظِيمَيْنِ انْتَهَى حَدِيثُ أَبِي الطَّاهِرِ وَزَادَ الْآخَرَانِ قَالَ ابْنُ شِهَابٍ قَالَ سَالِمُ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ وَكَانَ ابْنُ عُمَرَ يُصَلِّي عَلَيْهَا ثُمَّ يَنْصَرِفُ فَلَمَّا بَلَغَهُ حَدِيثُ أَبِي هُرَيْرَةَ قَالَ لَقَدْ ضَيَّعْنَا قَرَارِيطَ كَثِيرَةً.",
                "headingArabic": "فَضْلِ الصَّلاَةِ عَلَى الْجَنَازَةِ وَاتِّبَاعِهَا ‏",
                "headingUrdu": "نماز جنازہ پڑھنے اور اقتداء کرنے کی فضیلت",
                "headingEnglish": "The virtue of offering the funeral prayer and following the bier",
                "chapterId": "12",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 112,
                    "chapterNumber": "12",
                    "chapterEnglish": "The Book of Prayer - Funerals",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجَنَائِزِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9754,
                "hadithNumber": "2190",
                "englishNarrator": "This hadith has been narrated on the authority of Abu Huraira رضی اللہ تعالیٰ عنہ through another chain of narrators up to these words:",
                "hadithEnglish": "Two great mountains. No mention is made of what followed (these words) ; and in the hadith transmitted by 'Abdul- A'la (the words are): till (the burial) is complete. In the hadith transmitted by 'Abdur-Razzaq (the words are): till he is placed in the grave.",
                "hadithUrdu": "\" دو عظیم پہاڑوں تک بیان کی اور اس کے بعد والا حصہ بیان نہیں کیا ۔ اور عبد لاعلیٰ کی حدیث میں ہے ۔ یہاں تک کہ اس ( کے دفن ) سے فراغت ہو جا ئے ۔ \" اور عبد الررزاق کی حدیث میں ہے : \" یہاں تک کہ اس کو لحد میں رکھ دیا جا ئے ۔",
                "urduNarrator": "اور ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, عبد الاعلیٰ اور عبد الررزاق نے معمر سے انھوں ںے زہری سے ، انھوں نے سعید بن مسیب سے انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے اور انھوں ے نبی صلی اللہ علیہ وسلم سے ( یہ روایت ) ان الفاظ",
                "hadithArabic": "و حَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الْأَعْلَى ح و حَدَّثَنَا ابْنُ رَافِعٍ وَعَبْدُ بْنُ حُمَيْدٍ عَنْ عَبْدِ الرَّزَّاقِ كِلَاهُمَا عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى قَوْلِهِ الْجَبَلَيْنِ الْعَظِيمَيْنِ وَلَمْ يَذْكُرَا مَا بَعْدَهُ وَفِي حَدِيثِ عَبْدِ الْأَعْلَى حَتَّى يُفْرَغَ مِنْهَا وَفِي حَدِيثِ عَبْدِ الرَّزَّاقِ حَتَّى تُوضَعَ فِي اللَّحْدِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 112,
                    "chapterNumber": "12",
                    "chapterEnglish": "The Book of Prayer - Funerals",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجَنَائِزِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9755,
                "hadithNumber": "2191",
                "englishNarrator": "A hadith similar to that of Mamar (no. 2190) was narrated from Abu Hurirah from the prophet ﷺ, and he said:",
                "hadithEnglish": "\"Whoever follows (the funeral) until (the deceased) is buried.\"",
                "hadithUrdu": "اور جو اس کو دفن کیے جا نے تک اس کے ساتھ رہا ۔",
                "urduNarrator": "اور مجھ سے عبدالملک بن شعیب بن لیث نے بیان کیا، مجھ سے میرے والد نے میرے دادا کی سند سے بیان کیا، انہوں نے کہا کہ مجھ سے‏عقیل بن خالد نے ابن شہاب سے روایت کی کہ انھوں نے کہا : مجھے کئی لو گوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے حدیث سنا ئی اور انھوں نے نبی صلی اللہ علیہ وسلم سے جس طرح معمر کی حدیث ہے اور کہا",
                "hadithArabic": "و حَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ حَدَّثَنِي أَبِي عَنْ جَدِّي قَالَ حَدَّثَنِي عُقَيْلُ بْنُ خَالِدٍ عَنْ ابْنِ شِهَابٍ أَنَّهُ قَالَ حَدَّثَنِي رِجَالٌ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ مَعْمَرٍ وَقَالَ وَمَنْ اتَّبَعَهَا حَتَّى تُدْفَنَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 112,
                    "chapterNumber": "12",
                    "chapterEnglish": "The Book of Prayer - Funerals",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجَنَائِزِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9756,
                "hadithNumber": "2192",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who offered prayer over the dead, but did not follow the bier, for him is the reward of one qirat, and he who followed it, for him is the reward of two qirats. It was asked what the qirats were. He said: The smaller amongst the two is equivalent to Uhud.",
                "hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم نےفر ما یا : \" جس نے نماز جنازہ ادا کی اور اس کے پیچھے ( قبر ستان ) نہیں گیا تو اس کے لیے ایک قیراط ( اجر ) ہے اور اگر وہ اس کے پیچھے گیا تو اس کے لیے دو قیراط ہیں ۔ پو چھا گیا : دو قیراط کیا ہیں؟ فر ما یا : \" ان دو نوں میں سے چھوٹا اُحد پہاڑ کے مانند ہے ۔",
                "urduNarrator": "اور مجھ سے محمد بن حاتم نے بیان کیا، ہم سے بہز نے بیان کیا، مجھ سے وہیب نے بیان کیا, سہیل کے والد ابو صالح نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے روا یت کی",
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا بَهْزٌ حَدَّثَنَا وُهَيْبٌ حَدَّثَنِي سُهَيْلٌ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ صَلَّى عَلَى جَنَازَةٍ وَلَمْ يَتْبَعْهَا فَلَهُ قِيرَاطٌ فَإِنْ تَبِعَهَا فَلَهُ قِيرَاطَانِ قِيلَ وَمَا الْقِيرَاطَانِ قَالَ أَصْغَرُهُمَا مِثْلُ أُحُدٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 112,
                    "chapterNumber": "12",
                    "chapterEnglish": "The Book of Prayer - Funerals",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجَنَائِزِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9757,
                "hadithNumber": "2193",
                "englishNarrator": "Nafi' narrated that it was said to Ibn 'Umar that",
                "hadithEnglish": "Abu Huraira رضی اللہ تعالیٰ عنہ reported to have heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: He who follows the bier, for him is the reward of one qirat. Ibn 'Umar said: Abu Huraira narrated it too often. So he sent (a messenger to) 'A'isha to ascertain (the fact). She ('A'isha) testified Abu Huraira رضی اللہ تعالیٰ عنہ . Ibn 'Umar said: We missed so many qirats.",
                "hadithUrdu": "آپ نے فر ما یا : \" جس نے نماز جنازہ ادا کی تو اس کے لیے قیراط ہے اور جو اس کے ساتھ گیا حتیٰ کہ اسے قبر میں اتاردیا گیا تو ( اس کے لیے ) دو قیراط ہیں ۔ ( ابو حازم نے ) کہا میں نے کہا : اے ابو ہریرہ رضی اللہ تعالیٰ عنہ قیراط کیا ہے ؟ انھوں نے کہا : احد پہاڑ کے مانند ۔",
                "urduNarrator": "مجھ سے محمد بن حاتم نے بیان کیا، کہا ہم سے یحییٰ بن سعید نے بیان کیا، ان سے یزید بن کیسان نے بیان کیا, ابو حازم نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ يَزِيدَ بْنِ كَيْسَانَ حَدَّثَنِي أَبُو حَازِمٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ صَلَّى عَلَى جَنَازَةٍ فَلَهُ قِيرَاطٌ وَمَنْ اتَّبَعَهَا حَتَّى تُوضَعَ فِي الْقَبْرِ فَقِيرَاطَانِ قَالَ قُلْتُ يَا أَبَا هُرَيْرَةَ وَمَا الْقِيرَاطُ قَالَ مِثْلُ أُحُدٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 112,
                    "chapterNumber": "12",
                    "chapterEnglish": "The Book of Prayer - Funerals",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجَنَائِزِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9758,
                "hadithNumber": "2194",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who offers prayer for the dead, for him is (the reward of) one qirat; and he who follows the bier till it is placed in the grave, for him (is the reward of) two qirats. I (Abu Hazim, one of the narrators) said: Abu Huraira رضی اللہ تعالیٰ عنہ , what is a qirat? He said: It is like the hill of Uhud.",
                "hadithUrdu": "\" جو شخص جنازے کے پیچھے چلا تو اس کے لیے قیراط اجرہے اس پر ابن عمر رضی اللہ تعالیٰ عنہ نے کہا : ابو ہریرہ رضی اللہ تعالیٰ عنہ نے ہمیں کثرت سے احادیث سنا ئی ہیں اس کے بعد انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا کے پا س پیغا م بھیجا اور ان سے پو چھا تو انھوں نے حضرت ابو ہر یرہ رضی اللہ تعالیٰ عنہ کی تصدیق فر ما ئی اس پر حضرت ابن عمر رضی اللہ تعالیٰ عنہ نے کہا : یقیناً ہم نے بہت سے قیراطوں ( کے حصول ) میں کو تا ہی کی ۔",
                "urduNarrator": "ہم سے شیبان بن فرخ نے بیان کیا، ان سے جریر نے، یعنی ہم سے ابن حازم نے بیان کیا۔نا فع نے کہا : حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے کہا گیا کہ ابو ہریرہ رضی اللہ تعالیٰ عنہ کہتے ہیں میں نے رسول اللہ صلی اللہ علیہ وسلم کو فر ما تے ہو ئے سنا",
                "hadithArabic": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا جَرِيرٌ يَعْنِي ابْنَ حَازِمٍ حَدَّثَنَا نَافِعٌ قَالَ قِيلَ لِابْنِ عُمَرَ إِنَّ أَبَا هُرَيْرَةَ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ تَبِعَ جَنَازَةً فَلَهُ قِيرَاطٌ مِنْ الْأَجْرِ فَقَالَ ابْنُ عُمَرَ أَكْثَرَ عَلَيْنَا أَبُو هُرَيْرَةَ فَبَعَثَ إِلَى عَائِشَةَ فَسَأَلَهَا فَصَدَّقَتْ أَبَا هُرَيْرَةَ فَقَالَ ابْنُ عُمَرَ لَقَدْ فَرَّطْنَا فِي قَرَارِيطَ كَثِيرَةٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 112,
                    "chapterNumber": "12",
                    "chapterEnglish": "The Book of Prayer - Funerals",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجَنَائِزِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9759,
                "hadithNumber": "2195",
                "englishNarrator": "Dawud bin 'Amir bin Sa'd bin Abu Waqqas reported on the authority of his father:",
                "hadithEnglish": "While he was sitting along with 'Abdullah bin 'Umar رضی اللہ تعالیٰ عنہ , Khabbab رضی اللہ تعالیٰ عنہ , the owner of Maqsura, said: Ibn 'Umar رضی اللہ تعالیٰ عنہ , do you hear what Abu Huraira رضی اللہ تعالیٰ عنہ says that he heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) say: He who goes out with the bier when taken out from its residence and offers prayer for it and he then follows it till it is buried, he would have two qirats of reward, each qirat being equivalent to Uhud; and he who, after having offered prayer, (directly) came back would have his reward (as great) as Uhud ? Ibn 'Umar رضی اللہ تعالیٰ عنہ sent Khabbab to 'A'isha رضی اللہ تعالیٰ عنہا in order to ask her about the words of Abu Huraira رضی اللہ تعالیٰ عنہ (and also told him) to come back to him (Ibn 'Umar رضی اللہ تعالیٰ عنہ) and inform him what 'A'isha رضی اللہ تعالیٰ عنہا said. (In the meanwhile) Ibn 'Umar رضی اللہ تعالیٰ عنہ took up a handful of pebbles and turned them over in his hand till the messenger (Khabbab) came back to him and told (him) that 'A'isha رضی اللہ تعالیٰ عنہا testified (the statement of) Abu Huraira رضی اللہ تعالیٰ عنہ . Ibn 'Umar رضی اللہ تعالیٰ عنہ threw the pebbles he had in his hand on the ground and then said: We missed a large number of qirats.",
                "hadithUrdu": "وہ حضرت عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ کے پا س بیٹھے ہو ئے تھے کہ صاحب مقصود خباب رضی اللہ تعالیٰ عنہ نے آکر کہا : اے عبد اللہ بن عمر!کیا آپ نے ہمیں سنا ابو ہریرہ رضی اللہ تعالیٰ عنہ کیا کہتے ہیں ؟ بلا شبہ انھوں نے رسول اللہ صلی اللہ علیہ وسلم کو فر ما تے ہو ئے سنا ہے ۔ جو شخص جنازے کے ساتھ اس کے گھر سے نکا اور اس کی نماز جنا زہ ادا کی پھر اس کے ساتھ رہا حتیٰ کے اس کو دفن کر دیا گیا تو اس کے لیے بطور اجر دو قیرا ط ہیں ہر قیراط اُحد ( پہاڑ ) کے مانند ہے اور جس نے اس کی نماز جنازہ اداکی اور لو ٹ آیا اس کا اجر احد پہاڑ جیسا ہے ( یہ بات سنکر ) حضرت ابن عمر رضی اللہ تعالیٰ عنہ نے خباب رضی اللہ تعالیٰ عنہ کو حضرت عائشہ رضی اللہ تعالیٰ عنہا کے پاس بھیجا ( تا کہ ) وہ ان سے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ کے قول کے بارے میں دریافت دریافت کریں اور پھر واپس آکر ان کو بتا ئیں کہ انھوں ( حضرت عائشہ رضی اللہ تعالیٰ عنہا ) نے کیا کہا ۔ ( اس دوران میں ) ابن عمر رضی اللہ تعالیٰ عنہ نے مسجد کی کنکریوں سے ایک مٹھی بھرلی اور ان کواپنے ہاتھ میں الٹ پلٹ کرنے لگے یہاں تک کہ پیام رساں ان کے پاس واپس آگیا اس نے کہا : حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہاہے کہ ابو ہریرہ رضی اللہ تعالیٰ عنہ نے سچ کہا ہے اس پر ابن عمر رضی اللہ تعالیٰ عنہ نے وہ کنکریاں جو ان کے ہاتھ میں تھیں زمین پر دے ماریں پھر کہا یقیناًہم نے بہت قیراطوں ( کے حصول ) میں کو تا ہی کی ۔",
                "urduNarrator": "مجھ سے محمد بن عبداللہ بن نمیر نے بیان کیا، مجھ سے عبداللہ بن یزید نے بیان کیا، مجھ سے حیا نے بیان کیا، مجھ سے ابو صخر نے بیان کیا، ان سے یزید بن عبداللہ بن ق سیط نے بیان کیا کہ انہوں نے ان سے داودبن عامر بن سعد بن ابی وقاص نے اپنے والد ( عامر ) سے حدیث بیان کی کہ",
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ حَدَّثَنِي حَيْوَةُ حَدَّثَنِي أَبُو صَخْرٍ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ قُسَيْطٍ أَنَّهُ حَدَّثَهُ أَنَّ دَاوُدَ بْنَ عَامِرِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ حَدَّثَهُ عَنْ أَبِيهِ أَنَّهُ كَانَ قَاعِدًا عِنْدَ عَبْدِ اللَّهِ بْنِ عُمَرَ إِذْ طَلَعَ خَبَّابٌ صَاحِبُ الْمَقْصُورَةِ فَقَالَ يَا عَبْدَ اللَّهِ بْنَ عُمَرَ أَلَا تَسْمَعُ مَا يَقُولُ أَبُو هُرَيْرَةَ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ خَرَجَ مَعَ جَنَازَةٍ مِنْ بَيْتِهَا وَصَلَّى عَلَيْهَا ثُمَّ تَبِعَهَا حَتَّى تُدْفَنَ كَانَ لَهُ قِيرَاطَانِ مِنْ أَجْرٍ كُلُّ قِيرَاطٍ مِثْلُ أُحُدٍ وَمَنْ صَلَّى عَلَيْهَا ثُمَّ رَجَعَ كَانَ لَهُ مِنْ الْأَجْرِ مِثْلُ أُحُدٍ فَأَرْسَلَ ابْنُ عُمَرَ خَبَّابًا إِلَى عَائِشَةَ يَسْأَلُهَا عَنْ قَوْلِ أَبِي هُرَيْرَةَ ثُمَّ يَرْجِعُ إِلَيْهِ فَيُخْبِرُهُ مَا قَالَتْ وَأَخَذَ ابْنُ عُمَرَ قَبْضَةً مِنْ حَصْبَاءِ الْمَسْجِدِ يُقَلِّبُهَا فِي يَدِهِ حَتَّى رَجَعَ إِلَيْهِ الرَّسُولُ فَقَالَ قَالَتْ عَائِشَةُ صَدَقَ أَبُو هُرَيْرَةَ فَضَرَبَ ابْنُ عُمَرَ بِالْحَصَى الَّذِي كَانَ فِي يَدِهِ الْأَرْضَ ثُمَّ قَالَ لَقَدْ فَرَّطْنَا فِي قَرَارِيطَ كَثِيرَةٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 112,
                    "chapterNumber": "12",
                    "chapterEnglish": "The Book of Prayer - Funerals",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجَنَائِزِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9760,
                "hadithNumber": "2196",
                "englishNarrator": "Thauban, the freed slave of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who offered prayer for the dead, for him is the reward of one qirat, and he who attended its burial, he would have two qirats as his reward. And qirat is equivalent to Uhud.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" جس نے نماز جنا زہ پڑھی اس کے لیے ایک قیراط ہے اور اگر وہ اس کے دفن میں شامل ہوا تو اس کے لیے دو قیرا ط ہیں ( ایک ) قیرا ط احد ( پہاڑ ) کے ما نند ہے ۔",
                "urduNarrator": "اور ہم سے محمد بن بشار نے بیان کیا، ہم سے یحییٰ نے بیان کیا، یعنی ہم سے ابن سعید نے بیان کیا, شعبہ نے کہا : ہمیں قتادہ نے سالم بن ابی جعد سے حدیث سنا ئی انھوں نے معدان ابن ابی طلحہ یعمری سے اور انھوں نے رسول اللہ صلی اللہ علیہ وسلم کے آزاد کردہ غلام ثوبان رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى يَعْنِي ابْنَ سَعِيدٍ حَدَّثَنَا شُعْبَةُ حَدَّثَنِي قَتَادَةُ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ مَعْدَانَ بْنِ أَبِي طَلْحَةَ الْيَعْمَرِيِّ عَنْ ثَوْبَانَ مَوْلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ صَلَّى عَلَى جَنَازَةٍ فَلَهُ قِيرَاطٌ فَإِنْ شَهِدَ دَفْنَهَا فَلَهُ قِيرَاطَانِ الْقِيرَاطُ مِثْلُ أُحُدٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 112,
                    "chapterNumber": "12",
                    "chapterEnglish": "The Book of Prayer - Funerals",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجَنَائِزِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9761,
                "hadithNumber": "2197",
                "englishNarrator": "This hadith has been narrated by Qatada with the same chain of transmitters. And in the hadith transmitted by Sa'id and Hisham, (the words are):",
                "hadithEnglish": "The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was asked about qirat, and he said: It is equivalent to Uhud.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم سے قیراط کے بارے میں دریافت کیا گیا تو آپ نے فر ما یا : \" احد ( پہاڑ ) کے مانند ۔",
                "urduNarrator": "مجھ سے ابن بشار نے بیان کیا، معاذ بن ہشام سعید اور ابان نے قتادہ سے اسی سند کے ساتھ سابقہ حدیث کے مانند روایت کی سعید اور ہشام کی حدیث میں ہے",
                "hadithArabic": "و حَدَّثَنِي ابْنُ بَشَّارٍ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنِي أَبِي قَالَ وَحَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ سَعِيدٍ ح و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا عَفَّانُ حَدَّثَنَا أَبَانُ كُلُّهُمْ عَنْ قَتَادَةَ بِهَذَا الْإِسْنَادِ مِثْلَهُ وَفِي حَدِيثِ سَعِيدٍ وَهِشَامٍ سُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْقِيرَاطِ فَقَالَ مِثْلُ أُحُدٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 112,
                    "chapterNumber": "12",
                    "chapterEnglish": "The Book of Prayer - Funerals",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجَنَائِزِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9762,
                "hadithNumber": "2198",
                "englishNarrator": "A'isha رضی اللہ تعالیٰ عنہا reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saying: If a company of Muslims numbering one hundred pray over a dead person, all of them interceding for him, their intercession for him will be accepted.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \"\" کو ئی بھی ( مسلمان ) مرنے والا جس کی نماز جناز ہ مسلمانو کی ایک جماعت جن کی تعداد سو تک پہنچی ہو ادا کرے وہ سب اس کی سفارش کریں تو اس کے بارے میں ان کی سفارش قبول کر لی جا تی ہے ۔\r\n ( سلام نے ) کہا میں نے یہ حدیث شعیب بن حجاب کو بیان کی تو انھوں نے کہا مجھے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ نے بھی یہ حدیث نبی صلی اللہ علیہ وسلم سے بیان کی ۔",
                "urduNarrator": "ہم سے حسن بن عیسیٰ نے بیان کیا، کہا ہم سے ابن مبارک نے بیان کیا، انہوں نے بیان کیا اسلام بن ابی مطیع نے ایوب سے انھوں نے ابو قلابہ سے انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا کے دودھ شریک بھا ئی عبداللہ بن یزید سے اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روا یت کی کہ",
                "hadithArabic": "حَدَّثَنَا الْحَسَنُ بْنُ عِيسَى حَدَّثَنَا ابْنُ الْمُبَارَكِ أَخْبَرَنَا سَلَّامُ بْنُ أَبِي مُطِيعٍ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ رَضِيعِ عَائِشَةَ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا مِنْ مَيِّتٍ تُصَلِّي عَلَيْهِ أُمَّةٌ مِنْ الْمُسْلِمِينَ يَبْلُغُونَ مِائَةً كُلُّهُمْ يَشْفَعُونَ لَهُ إِلَّا شُفِّعُوا فِيهِ قَالَ فَحَدَّثْتُ بِهِ شُعَيْبَ بْنَ الْحَبْحَابِ فَقَالَ حَدَّثَنِي بِهِ أَنَسُ بْنُ مَالِكٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": "مَنْ صَلَّى عَلَيْهِ مِائَةٌ شُفِّعُوا فِيهِ ‏",
                "headingUrdu": "اگر ایک شخص کے لیے سو لوگ دعا کریں تو وہ اس کی شفاعت کریں گے۔",
                "headingEnglish": "If one hundred (people) pray for a person, they will intercede for him",
                "chapterId": "12",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 112,
                    "chapterNumber": "12",
                    "chapterEnglish": "The Book of Prayer - Funerals",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجَنَائِزِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9763,
                "hadithNumber": "2199",
                "englishNarrator": "Abdullah bin 'Abbas رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "His son died in Qudaid or 'Usfan. He said to Kuraib to see as to how many people had gathered there for his (funeral). He (Kuraib) said: So I went out and I informed him about the people who had gathered there. He (Ibn 'Abbas رضی اللہ تعالیٰ عنہ) said: Do you think they are forty? He (Kuraib) said: Yes. Ibn 'Abbas then said to them: Bring him (the dead body) out for I have heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: If any Muslim dies and forty men who associate nothing with Allah stand over his prayer (they offer prayer over him), Allah will accept them as intercessors for him.",
                "hadithUrdu": "قدید یا عسفان میں ان کے ایک بیٹے کا انتقال ہو گیا تو انھوں نے کہا : کریب !دیکھو اس کے ( جنازے کے ) لیے کتنے لو گ جمع ہو چکے ہیں ۔ میں با ہر نکلا تو دیکھا کہ اس کی خا طر ( خاصے ) لو گ جمع ہو چکے ہیں تو میں نے ان کو اطلا ع دی ۔ انھوں نے پو چھا تو کہتے ہو کہ وہ چا لیس ہوں گے ؟ انھوں نے جواب دیا : ہاں ۔ تو انھوں نے فر ما یا : اس ( میت ) کو ( گھر سے ) باہر نکا لو کیونکہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فر ما تے ہو ئے سنا ہے : جو بھی مسلمان فوت ہو جا تا ہے اور اس کے جنا زے پر ( ایسے ) چالیس آدمی ( نماز ادا کرنے کے لیے ) کھڑے ہو جا تے ہیں جو اللہ کے ساتھ کسی چیز کو شریک نہیں ٹھہر اتے تو اللہ تعا لیٰ اس کے بارے میں ان کی سفارش کو قبول فر ما لیتا ہے ۔ ابن معروف کی روا یت میں ہے انھوں نے شریک بن ابی نمر سے انھوں نے کریب سے اور انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی ۔ ( اس سند میں شریک کے والد اور ابو نمر کے بیٹے عبد اللہ کا نام لیے بغیر داداکی طرف منسوب کرتے ہو ئے شریک بن ابی نمر کہا گیا ہے ۔ )",
                "urduNarrator": "ہارون بن معروف ہارون بن سعید ایلی اور ولید بن شجاع میں سے ولید نے کہا : مجھے حدیث سنا ئی اور دوسرے دو نوں نے کہا : ہمیں حدیث سنا ئی ابن وہب نے انھوں نے کہا : مجھے ابو صخر نے شر یک بن عبد اللہ بن ابی نمر سے خبر دی انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ کے آزاد کردہ غلا م کریب سے اور انھوں نے حضرت عبد اللہ بن عبا س رضی اللہ تعالیٰ عنہ سے روا یت کی کہ",
                "hadithArabic": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ وَهَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ وَالْوَلِيدُ بْنُ شُجَاعٍ السَّكُونِيُّ قَالَ الْوَلِيدُ حَدَّثَنِي و قَالَ الْآخَرَانِ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي أَبُو صَخْرٍ عَنْ شَرِيكِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي نَمِرٍ عَنْ كُرَيْبٍ مَوْلَى ابْنِ عَبَّاسٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ أَنَّهُ مَاتَ ابْنٌ لَهُ بِقُدَيْدٍ أَوْ بِعُسْفَانَ فَقَالَ يَا كُرَيْبُ انْظُرْ مَا اجْتَمَعَ لَهُ مِنْ النَّاسِ قَالَ فَخَرَجْتُ فَإِذَا نَاسٌ قَدْ اجْتَمَعُوا لَهُ فَأَخْبَرْتُهُ فَقَالَ تَقُولُ هُمْ أَرْبَعُونَ قَالَ نَعَمْ قَالَ أَخْرِجُوهُ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا مِنْ رَجُلٍ مُسْلِمٍ يَمُوتُ فَيَقُومُ عَلَى جَنَازَتِهِ أَرْبَعُونَ رَجُلًا لَا يُشْرِكُونَ بِاللَّهِ شَيْئًا إِلَّا شَفَّعَهُمْ اللَّهُ فِيهِ وَفِي رِوَايَةِ ابْنِ مَعْرُوفٍ عَنْ شَرِيكِ بْنِ أَبِي نَمِرٍ عَنْ كُرَيْبٍ عَنْ ابْنِ عَبَّاسٍ.",
                "headingArabic": "مَنْ صَلَّى عَلَيْهِ أَرْبَعُونَ شُفِّعُوا فِيهِ ‏‏",
                "headingUrdu": "اگر چالیس آدمی کسی شخص کے لیے دعا کریں تو وہ اس کی شفاعت کریں گے۔",
                "headingEnglish": "If forty people pray for a person, they will intercede for him",
                "chapterId": "12",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 112,
                    "chapterNumber": "12",
                    "chapterEnglish": "The Book of Prayer - Funerals",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الْجَنَائِزِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 9451,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=378",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=376",
                "label": "376",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=377",
                "label": "377",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=378",
                "label": "378",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=379",
                "label": "379",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=380",
                "label": "380",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=381",
                "label": "381",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=382",
                "label": "382",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=380",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=380",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=378",
        "to": 9475,
        "total": 40465
    }
}