{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 366,
        "data": [
            {
                "id": 9414,
                "hadithNumber": "1850",
                "englishNarrator": null,
                "hadithEnglish": "A hadith similar to that of Yahya bin Abi Kathir (no. 1849) was narrated from Abu Hurairah رضی اللہ تعالیٰ عنہ .",
                "hadithUrdu": "یحییٰ بن ایوب قتیبہ بن سعید اور ابن حجر نے کہا : ہمیں اسماعیل بن جعفر نے محمد بن عمرو سے حدیث بیان کی انھوں نے ابو سلمہ سے انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے یحییٰ بن ابی کثیر کی حدیث کی طرح روا یت بیان کی مگر ابن ایوب نے اپنی روا یت میں ( كاذنه کے بجا ئے ) كاذنه ( جس طرح وہ اجازت دیتا ہے ) کہا ۔ اس ( طرح ما اذن الله کا معنی ہو گا اللہ تعا لیٰ نے ( بار یابی کی اجازت نہیں دی )۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ بْنُ سَعِيدٍ وَابْنُ حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَعِيلُ وَهُوَ ابْنُ جَعْفَرٍ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَ حَدِيثِ يَحْيَى بْنِ أَبِي كَثِيرٍ غَيْرَ أَنَّ ابْنَ أَيُّوبَ قَالَ فِي رِوَايَتِهِ كَإِذْنِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "7",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 107,
                    "chapterNumber": "7",
                    "chapterEnglish": "The Book Of the Merit Of The Holy Quran",
                    "chapterUrdu": "قرآن کے فضائل اور متعلقہ امور",
                    "chapterArabic": "کتاب فَضَائِلِ الْقُرْآنِ وَمَا يَتَعَلَّقُ بِهِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9415,
                "hadithNumber": "1851",
                "englishNarrator": "Buraida رضی اللہ تعالیٰ عنہ reported on the authority of his father:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had said: 'Abdullah bin Qais or al-Ash'ari has been gifted with a sweet melodious voice out of the voices of the family of David.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" عبد اللہ بن قیس ۔ ۔ یا اشعری ۔ ۔ ۔ کو آل داودکی بنسریوں ( خوبصورت آوازوں ) میں سے ایک بنسری ( خوبصورت آواز ) عطاکی گئی ہے",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے عبداللہ بن نمیر ہ نے بیان کیا، کہا ہم سے ابن نمیر نے بیان کیا، کہا ہم سے ابی نے بیان کیا، کہا کہ ہم سے مالک نے جو کہ ابن مغل ہیں، انہوں نے عبداللہ بن کے واسطہ سے بیان کیا, حضرت برید رضی اللہ تعالیٰ عنہ سے روا یت ہے انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا مَالِكٌ وَهُوَ ابْنُ مِغْوَلٍ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ عَبْدَ اللَّهِ بْنَ قَيْسٍ أَوْ الْأَشْعَرِيَّ أُعْطِيَ مِزْمَارًا مِنْ مَزَامِيرِ آلِ دَاوُدَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "7",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 107,
                    "chapterNumber": "7",
                    "chapterEnglish": "The Book Of the Merit Of The Holy Quran",
                    "chapterUrdu": "قرآن کے فضائل اور متعلقہ امور",
                    "chapterArabic": "کتاب فَضَائِلِ الْقُرْآنِ وَمَا يَتَعَلَّقُ بِهِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9416,
                "hadithNumber": "1852",
                "englishNarrator": "Abu Burda narrated on the authority of Abu Musa رضی اللہ تعالیٰ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had said to Abu Musa: If you were to see me, as I was listening to your recitation (of the Qur'an) yester-night (you would have felt delighted). You are in fact endowed with a sweet voice like that of David himself.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فر ما یا ) : کیا ہی خوب ہو تا ) کاش! تم مجھے دیکھتے جب گزشتہ رات میں بڑے انہماک سے تمھاری قراءت سن رہا تھا تمھیں آل داؤدکی خوبصورت آوازوں میں سے ایک خوبصورت آوازدی گئی ہے ۔",
                "urduNarrator": "ہم سے داؤد بن راشد نے بیان کیا، کہا ہم سے یحییٰ بن سعید نے بیان کیا، کہا ہم سے طلحہ نے بیان کیا، وہ ابو بردہ رضی اللہ عنہ کی سند سے,حضرت ابو موسیٰ اشعری رضی اللہ تعالیٰ عنہ سے روا یت ہے انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا دَاوُدُ بْنُ رُشَيْدٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا طَلْحَةُ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَى قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأَبِي مُوسَى لَوْ رَأَيْتَنِي وَأَنَا أَسْتَمِعُ لِقِرَاءَتِكَ الْبَارِحَةَ لَقَدْ أُوتِيتَ مِزْمَارًا مِنْ مَزَامِيرِ آلِ دَاوُدَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "7",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 107,
                    "chapterNumber": "7",
                    "chapterEnglish": "The Book Of the Merit Of The Holy Quran",
                    "chapterUrdu": "قرآن کے فضائل اور متعلقہ امور",
                    "chapterArabic": "کتاب فَضَائِلِ الْقُرْآنِ وَمَا يَتَعَلَّقُ بِهِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9417,
                "hadithNumber": "1853",
                "englishNarrator": "Mu'awiya bin Qurra reported 'Abdullah bin Mughaffal al-Muzani رضی اللہ تعالیٰ عنہ as saying:",
                "hadithEnglish": "The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) recited on his ride Surat al Fath during a journey in the year of the Conquest (of Mecca), and he repeated (the words) in his recitation. Mu'awiya said: If I were not afraid that the people would crowd around me, I would have given a demonstration of (the Prophet's) recitation before you.",
                "hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم نے فتح مکہ والے سال اپنے سفر میں اپنی سواری پر سورہ فتح کی تلاوت فرمائی اور اپنی قراءت میں آواز کو دہرایا ۔ معاویہ نے کہا : اگر مجھے یہ اندیشہ نہ ہوتا کہ لوگ میرے گرد جمع ہوجائیں گے تو میں تمھیں آپ صلی اللہ علیہ وسلم جیسی قراء ت سناتا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, عبداللہ بن ادریس اور وکیع نے شعبہ سے اور انھوں نے معاویہ بن قرہ سے روایت کی ، انھوں نے کہا : میں نے عبداللہ بن مغفل مزنی رضی اللہ تعالیٰ عنہ سے سنا ، وہ کہہ رہے تھے",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ وَوَكِيعٌ عَنْ شُعْبَةَ عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ مُغَفَّلٍ الْمُزَنِيَّ يَقُولُ قَرَأَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ الْفَتْحِ فِي مَسِيرٍ لَهُ سُورَةَ الْفَتْحِ عَلَى رَاحِلَتِهِ فَرَجَّعَ فِي قِرَاءَتِهِ قَالَ مُعَاوِيَةُ لَوْلَا أَنِّي أَخَافُ أَنْ يَجْتَمِعَ عَلَيَّ النَّاسُ لَحَكَيْتُ لَكُمْ قِرَاءَتَهُ.",
                "headingArabic": "ذِكْرِ قِرَاءَةِ النَّبِيِّ صلى الله عليه وسلم سُورَةَ الْفَتْحِ يَوْمَ فَتْحِ مَكَّةَ ‏‏",
                "headingUrdu": "فتح مکہ کے دن سورۃ الفتح کی تلاوت کا تذکرہ",
                "headingEnglish": "Mentioning the recitation of the Prophet (saws) of Surat al-Fath on the day of the conquest of Makkah",
                "chapterId": "7",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 107,
                    "chapterNumber": "7",
                    "chapterEnglish": "The Book Of the Merit Of The Holy Quran",
                    "chapterUrdu": "قرآن کے فضائل اور متعلقہ امور",
                    "chapterArabic": "کتاب فَضَائِلِ الْقُرْآنِ وَمَا يَتَعَلَّقُ بِهِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9418,
                "hadithNumber": "1854",
                "englishNarrator": "Mu'awiya bin Qurra is reported to have heard 'Abdullah bin Mughaffal as saying:",
                "hadithEnglish": "I saw the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) reciting Surah Fath on his camel on the day of the Conquest of Mecca. He (the narrator) said: Ibn Mughaffal رضی اللہ تعالیٰ عنہ recited it and repeated it. Mu'awiya said: Had there been (no crowed of) people, I would have given a practical demonstration of that which Ibn Mughaffal رضی اللہ تعالیٰ عنہ had mentioned from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌).",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو فتح مکہ کے دن اپنی اونٹنی پر ( سوار ) سورہ فتح پڑھتے ہوئے دیکھا ۔ ( معاویہ بن قرہ نے ) کہا : حضرت ابن مغفل رضی اللہ تعالیٰ عنہ نےقراءت کی اور اس میں ترجیع کی ، معاویہ نے کہا : اگر مجھے لوگوں ( کے اکھٹے ہوجانے ) کا اندیشہ نہ ہوتا تو میں تمھارے لئے ( قراءت کا ) وہی ( طریقہ اختیار ) کرتا جو حضرت ابن مغفل رضی اللہ تعالیٰ عنہ نے نبی اکرم صلی اللہ علیہ وسلم کے حوالے سے بیان کیا تھا ۔",
                "urduNarrator": "ہم سے محمد بن مثنیٰ نے بیان کیا اور ہم سے محمد بن بشار نے بیان کیا, محمد بن جعفر نے کہا : شعبہ نے ہمیں معاویہ بن قرہ سے حدیث بیان کی ، انھوں نے کہا : میں نے حضرت عبداللہ بن مغفل سے سنا ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ مُغَفَّلٍ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ فَتْحِ مَكَّةَ عَلَى نَاقَتِهِ يَقْرَأُ سُورَةَ الْفَتْحِ قَالَ فَقَرَأَ ابْنُ مُغَفَّلٍ وَرَجَّعَ فَقَالَ مُعَاوِيَةُ لَوْلَا النَّاسُ لَأَخَذْتُ لَكُمْ بِذَلِكَ الَّذِي ذَكَرَهُ ابْنُ مُغَفَّلٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "7",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 107,
                    "chapterNumber": "7",
                    "chapterEnglish": "The Book Of the Merit Of The Holy Quran",
                    "chapterUrdu": "قرآن کے فضائل اور متعلقہ امور",
                    "chapterArabic": "کتاب فَضَائِلِ الْقُرْآنِ وَمَا يَتَعَلَّقُ بِهِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9419,
                "hadithNumber": "1855",
                "englishNarrator": "This hadlth has been narrated by Khalid al-Harith with the same chain of transmitters (with these words):",
                "hadithEnglish": "(The Holy Prophet) was reciting Surat al-Fath as he was travelling on his mount.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم ( سورہ فتح تلاوت کرتے ہوئے اپنی ) سواری پر سفر کررہے تھے ۔",
                "urduNarrator": "ہم سے یحییٰ بن حبیب الحارثی نے بیان کیا, خالد بن حارث اور معاذ نے کہا : شعبہ نے ہمیں اسی سند کے ساتھ اسی طرح کی حدیث بیان کی ، خالد بن حارث کی روایت میں ہے کہ",
                "hadithArabic": "و حَدَّثَنَاه يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ ح و حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي قَالَا حَدَّثَنَا شُعْبَةُ بِهَذَا الْإِسْنَادِ نَحْوَهُ وَفِي حَدِيثِ خَالِدِ بْنِ الْحَارِثِ قَالَ عَلَى رَاحِلَةٍ يَسِيرُ وَهُوَ يَقْرَأُ سُورَةَ الْفَتْحِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "7",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 107,
                    "chapterNumber": "7",
                    "chapterEnglish": "The Book Of the Merit Of The Holy Quran",
                    "chapterUrdu": "قرآن کے فضائل اور متعلقہ امور",
                    "chapterArabic": "کتاب فَضَائِلِ الْقُرْآنِ وَمَا يَتَعَلَّقُ بِهِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9420,
                "hadithNumber": "1856",
                "englishNarrator": "Al-Bara' رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "A person was reciting Surat al-Kahf and there was a horse tied with two ropes at his side, a cloud overshadowed him, and as it began to come nearer and nearer his horse began to take fright from it. He went and mentioned that to the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) in the morning, and he (the Holy Prophet) said: That was tranquillity which came down at the recitation of the Qur'an.",
                "hadithUrdu": "ایک شخص سورۃ الکہف کی تلاوت کر رہا تھا کہ اس کے پہلو میں ایک گھوڑا دو رسیوں سے بندھا ہوا تھا، ایک بادل نے اس پر سایہ کیا اور جوں جوں وہ قریب آنے لگا تو اس کا گھوڑا اس سے ڈرنے لگا۔ اس نے جا کر صبح کے وقت رسول اللہ صلی اللہ علیہ وسلم سے اس کا ذکر کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا: یہ وہ سکون تھا جو قرآن کی تلاوت سے حاصل ہوتا تھا۔",
                "urduNarrator": "اور ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے بیان کیا, ابو خیثمہ نے ابو اسحاق سے اور انھوں نے حضرت بر اء رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو خَيْثَمَةَ عَنْ أَبِي إِسْحَقَ عَنْ الْبَرَاءِ قَالَ كَانَ رَجُلٌ يَقْرَأُ سُورَةَ الْكَهْفِ وَعِنْدَهُ فَرَسٌ مَرْبُوطٌ بِشَطَنَيْنِ فَتَغَشَّتْهُ سَحَابَةٌ فَجَعَلَتْ تَدُورُ وَتَدْنُو وَجَعَلَ فَرَسُهُ يَنْفِرُ مِنْهَا فَلَمَّا أَصْبَحَ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ ذَلِكَ لَهُ فَقَالَ تِلْكَ السَّكِينَةُ تَنَزَّلَتْ لِلْقُرْآنِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "7",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 107,
                    "chapterNumber": "7",
                    "chapterEnglish": "The Book Of the Merit Of The Holy Quran",
                    "chapterUrdu": "قرآن کے فضائل اور متعلقہ امور",
                    "chapterArabic": "کتاب فَضَائِلِ الْقُرْآنِ وَمَا يَتَعَلَّقُ بِهِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9421,
                "hadithNumber": "1857",
                "englishNarrator": "Ibn Ishaq reported:",
                "hadithEnglish": "I heard al-Bara' رضی اللہ تعالیٰ عنہ as saying that a man recited al-Kahf when an animal was there in the house and it began to take fright. And as he looked around, he found a cloud overshadowing it. He mentioned that to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). Upon this he said: O so and so, recite on (the surah) as-Sakina descends at the (recitation of the Qur'an) or on account (of the recitation) of the Qur'an.",
                "hadithUrdu": "میں نے حضرت براء رضی اللہ تعالیٰ عنہ سے سنا وہ کہہ رہے تھے ,  ایک آدمی نے سورہ کہف کی قراءت کی ۔ گھرمیں ( اس وقت ) ایک چوپا یہ بھی تھا ۔ وہ بدکنے لگا اس شخص نے دیکھا کہ جا نور کے اوپر دھندیا بدلی تھی جو اس پر چھائی ہو ئی ہے تو اس نے یہ واقعہ نبی اکرم صلی اللہ علیہ وسلم کو بتایا آپ نے فر ما یا : اے شخص ! پڑھا کرو یہ تو سکینت تھی جو قراءت کے وقت اتری ( یا قرآن کی خاطر نازل ہو ئی ۔ )",
                "urduNarrator": "ہم سے ابن المثنیٰ اور ابن بشار نے بیان کیا، اور یہ الفاظ ابن المثنیٰ نے بیان کیے، انہوں نے کہا, محمد بن جعفر نے کہا : ہم سے شعبہ نے ابو اسحاق سے حدیث بیان کی ۔ انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا ابْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ وَاللَّفْظُ لِابْنِ الْمُثَنَّى قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ قَالَ سَمِعْتُ الْبَرَاءَ يَقُولُ قَرَأَ رَجُلٌ الْكَهْفَ وَفِي الدَّارِ دَابَّةٌ فَجَعَلَتْ تَنْفِرُ فَنَظَرَ فَإِذَا ضَبَابَةٌ أَوْ سَحَابَةٌ قَدْ غَشِيَتْهُ قَالَ فَذَكَرَ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ اقْرَأْ فُلَانُ فَإِنَّهَا السَّكِينَةُ تَنَزَّلَتْ عِنْدَ الْقُرْآنِ أَوْ تَنَزَّلَتْ لِلْقُرْآنِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "7",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 107,
                    "chapterNumber": "7",
                    "chapterEnglish": "The Book Of the Merit Of The Holy Quran",
                    "chapterUrdu": "قرآن کے فضائل اور متعلقہ امور",
                    "chapterArabic": "کتاب فَضَائِلِ الْقُرْآنِ وَمَا يَتَعَلَّقُ بِهِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9422,
                "hadithNumber": "1858",
                "englishNarrator": "It was narrated that Abu Ishaq said:",
                "hadithEnglish": "\"I heard Al Bara رضی اللہ تعالیٰ عنہ say....\" and he mentioned something similar (to no. 1857), but they said: \" (the horse) jumped.\"",
                "hadithUrdu": "میں نے حضرت براء رضی اللہ تعالیٰ عنہ کو کہتے ہو ئے سنا ۔ ۔ ۔ آگے دونوں ( عبد الرحمٰن بن مہدی اور ابوداؤد ) نے سابقہ حدیث کے مانند ذکر کیا ۔ البتہ اتنا فرق ہے کہ انھوں نے ( تنفر \" وہ بدکنے لگا \" کے بجا ئے ) تنقز ( وہ اچھلنے لگا ) کہا.",
                "urduNarrator": "ہم سے ابن المثنیٰ نے بیان کیا، کہا ہم سےعبد الرحمٰن بن مہدی اور داؤد نے کہا : ہمیں شعبہ نے ابو اسحاق سے حدیث بیان کی انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ وَأَبُو دَاوُدَ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ قَالَ سَمِعْتُ الْبَرَاءَ يَقُولُ فَذَكَرَا نَحْوَهُ غَيْرَ أَنَّهُمَا قَالَا تَنْقُزُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "7",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 107,
                    "chapterNumber": "7",
                    "chapterEnglish": "The Book Of the Merit Of The Holy Quran",
                    "chapterUrdu": "قرآن کے فضائل اور متعلقہ امور",
                    "chapterArabic": "کتاب فَضَائِلِ الْقُرْآنِ وَمَا يَتَعَلَّقُ بِهِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9423,
                "hadithNumber": "1859",
                "englishNarrator": "Abu Sa'id al-Khudri رضی اللہ تعالیٰ عنہ told of Usaid bin Hudair رضی اللہ تعالیٰ عنہ saying:",
                "hadithEnglish": "One night he recited the Qur'an in his enclosure, when the horse began to jump about. He again recited and (the horse) again jumped. He again recited and it jumped as before. Usaid رضی اللہ تعالیٰ عنہ said: I was afraid lest it should trample (his son) Yahya. I stood near it (the horse) and saw something like a canopy over my head with what seemed to be lamps in it, rising up in the sky till it disappeared. I went to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) on the next day and said: Messenger of Allah, I recited the Qur'an during the night in my enclosure and my horse began to jump. Upon this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: You should have kept on reciting, Ibn Hudair. He (Ibn Hudair) said: I recited. It jumped (as before). Upon this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) again said: You should have kept on reciting, Ibn Hudair. He (Ibn Hudair) said: I recited and it again jumped (as before). The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) again said: You should kave kept on reciting, Ibu Hudair. He (Ibn Hudair) said: (Messenger of Allah) I finished (the recitation) for Yahya was near (the horse) and I was afraid lest it should trample him. I saw something like a canopy with what seemed to be lamps in it rising up in the sky till it disappeared. Upon this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Those were the angels who listened to you; and if you had continued reciting, the people would have seen them in the morning and they would not have concealed themselves from them.",
                "hadithUrdu": "اچانک ان کا گھوڑا بدکنے لگا انھوں نے پھر پڑھا وہ دوبارہ بدکا پھر پڑھا وہ پھر بدکا ۔ اسید رضی اللہ تعالیٰ عنہ نے کہا : مجھے خوف پیدا ہوا کہ وہ ( میرے بیٹے ) یحییٰ کو روند ڈالے گا میں اٹھ کر اس کے پاس گیا تو اچانک چھتری جیسی کو ئی چیز میرے سر پر تھی اس میں کچھ چراغوں جیسا تھا وہ فضا میں بلند ہو گئی حتیٰ کہ مجھے نظر آنا بند ہو گئی کہا : میں صبح کو رسول اللہ صلی اللہ علیہ وسلم کے پاس گیا اور عرض کی : اے اللہ کے رسول !اس اثنا میں کہ کل میں آدھی رات کے وقت اپنے باڑے میں قراءت کر رہا تھا کہ اچانک میرا گھوڑا بدکنے لگا ۔ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : ابن حضیر!پڑھتے رہتے ۔ \" میں نے عرض کی : میں پڑھتا رہا پھر اس نے دوبارہ اچھل کود کی ۔ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : ابن حضیر! پڑھتے رہتے ۔ میں نے کہا : میں نے قراءت جاری رکھی اس نے کچھ بدک کر چکر لگانے شروع کر دیے ۔ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" ابن حضیر! پڑھتے رہتے ۔ میں نے کہا : پھر میں نے چھوڑ دیا ۔ ( میرا بیٹا ) یحییٰ اس کے قریب تھا میں ڈر گیا کہ وہ اسے روند دے گا ۔ تو میں چھتری جیسی چیز دیکھی اس میں چراغوں کی طرح کی چیزیں تھیں وہ فضا میں بلند ہو ئی حتیٰ کہ مجھے نظر آنی بند ہو گئی اس پر رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" وہ فرشتے تھے جو تمھاری قراءت سن رہے تھے اور اگر تم پڑھتے رہتے تو لوگ صبح کو دیکھ لیتے وہ ان سے اوجھل نہ ہوتے ۔",
                "urduNarrator": "مجھ سے حسن بن علی الحلوانی اور حجاج بن الشاعر نے بیان کیا، اور وہ کلام میں قریب تھے، کہتے ہیں: ہم سے یعقوب بن ابراہیم نے بیان کیا، انہیں ابی نے بیان کیا، ہم سے یزید بن آل نے بیان کیا، ان سے عبداللہ بن خباب نے بیان کیا کہ حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ نے حدیث بیان کی کہ حجرت اسید بن حضیر رضی اللہ تعالیٰ عنہ ایک رات اپنے باڑے میں قراءت کر رہے تھے کہ",
                "hadithArabic": "و حَدَّثَنِي حَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ وَحَجَّاجُ بْنُ الشَّاعِرِ وَتَقَارَبَا فِي اللَّفْظِ قَالَا حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَبِي حَدَّثَنَا يَزِيدُ بْنُ الْهَادِ أَنَّ عَبْدَ اللَّهِ بْنَ خَبَّابٍ حَدَّثَهُ أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ حَدَّثَهُ أَنَّ أُسَيْدَ بْنَ حُضَيْرٍ بَيْنَمَا هُوَ لَيْلَةً يَقْرَأُ فِي مِرْبَدِهِ إِذْ جَالَتْ فَرَسُهُ فَقَرَأَ ثُمَّ جَالَتْ أُخْرَى فَقَرَأَ ثُمَّ جَالَتْ أَيْضًا قَالَ أُسَيْدٌ فَخَشِيتُ أَنْ تَطَأَ يَحْيَى فَقُمْتُ إِلَيْهَا فَإِذَا مِثْلُ الظُّلَّةِ فَوْقَ رَأْسِي فِيهَا أَمْثَالُ السُّرُجِ عَرَجَتْ فِي الْجَوِّ حَتَّى مَا أَرَاهَا قَالَ فَغَدَوْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ بَيْنَمَا أَنَا الْبَارِحَةَ مِنْ جَوْفِ اللَّيْلِ أَقْرَأُ فِي مِرْبَدِي إِذْ جَالَتْ فَرَسِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْرَأْ ابْنَ حُضَيْرٍ قَالَ فَقَرَأْتُ ثُمَّ جَالَتْ أَيْضًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْرَأْ ابْنَ حُضَيْرٍ قَالَ فَقَرَأْتُ ثُمَّ جَالَتْ أَيْضًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْرَأْ ابْنَ حُضَيْرٍ قَالَ فَانْصَرَفْتُ وَكَانَ يَحْيَى قَرِيبًا مِنْهَا خَشِيتُ أَنْ تَطَأَهُ فَرَأَيْتُ مِثْلَ الظُّلَّةِ فِيهَا أَمْثَالُ السُّرُجِ عَرَجَتْ فِي الْجَوِّ حَتَّى مَا أَرَاهَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تِلْكَ الْمَلَائِكَةُ كَانَتْ تَسْتَمِعُ لَكَ وَلَوْ قَرَأْتَ لَأَصْبَحَتْ يَرَاهَا النَّاسُ مَا تَسْتَتِرُ مِنْهُمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "7",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 107,
                    "chapterNumber": "7",
                    "chapterEnglish": "The Book Of the Merit Of The Holy Quran",
                    "chapterUrdu": "قرآن کے فضائل اور متعلقہ امور",
                    "chapterArabic": "کتاب فَضَائِلِ الْقُرْآنِ وَمَا يَتَعَلَّقُ بِهِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9424,
                "hadithNumber": "1860",
                "englishNarrator": "Abu Musa al-Ash'ari رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: A believer who recites the Qur'an is like an orange whose fragrance is sweet and whose taste is sweet; a believer who does not recite the Qur'an is like a date which has no fragrance but has a sweet taste; and the hypocrite who recites the Qur'an is like a basil whose fragrance is sweet, but whose taste is bitter; and a hypocrite who does not recite the Qur'an is like the colocynth which has no fragrance and has a bitter taste.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : اس مومن کی مثال جو قرآن مجید کی تلاوت کرتا ہے نارنگی کی سی ہے اس کی خوشبوبھی عمدہ ہے اور اس کا ذائقہ ( بھی خوشگوار ہے اور اس مومن کی مثال جو قرآن مجید کی تلاوت نہیں کرتا کھجور کی سی ہے اس کی خوشبو نہیں ہو تی جبکہ اس کا ذائقہ شیریں ہے اور اس منافق کی مثال جو قرآن کی تلاوت کرتا نیاز بو جیسی ہے اس کی خوشبوعمدہ ہے اور ذائقہ کڑوا ہے اور اس منافق کی مثال جو قرآن نہیں پڑھتا اندر ائن ( تمے ) کی طرح ہے جس کی خوشبو بھی نہیں ہو تی اور اس کا ذائقہ ( بھی سخت ) کڑوا ہے ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید اور ابو کامل الجہدری، ان دونوں نے ابو کی سند سے بیان کیا, ابو عوانہ نے قتادہ سے انھوں نے حضرت انس ) سے انھوں نے حضرت ابو موسیٰ اشعری رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَأَبُو كَامِلٍ الْجَحْدَرِيُّ كِلَاهُمَا عَنْ أَبِي عَوَانَةَ قَالَ قُتَيْبَةُ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ أَنَسٍ عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَثَلُ الْمُؤْمِنِ الَّذِي يَقْرَأُ الْقُرْآنَ مَثَلُ الْأُتْرُجَّةِ رِيحُهَا طَيِّبٌ وَطَعْمُهَا طَيِّبٌ وَمَثَلُ الْمُؤْمِنِ الَّذِي لَا يَقْرَأُ الْقُرْآنَ مَثَلُ التَّمْرَةِ لَا رِيحَ لَهَا وَطَعْمُهَا حُلْوٌ وَمَثَلُ الْمُنَافِقِ الَّذِي يَقْرَأُ الْقُرْآنَ مَثَلُ الرَّيْحَانَةِ رِيحُهَا طَيِّبٌ وَطَعْمُهَا مُرٌّ وَمَثَلُ الْمُنَافِقِ الَّذِي لَا يَقْرَأُ الْقُرْآنَ كَمَثَلِ الْحَنْظَلَةِ لَيْسَ لَهَا رِيحٌ وَطَعْمُهَا مُرٌّ.",
                "headingArabic": "فَضِيلَةِ حَافِظِ الْقُرْآنِ ‏",
                "headingUrdu": "قرآن حفظ کرنے والے کی فضیلت",
                "headingEnglish": "The virtue of the one who memorizes the Qur’an",
                "chapterId": "7",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 107,
                    "chapterNumber": "7",
                    "chapterEnglish": "The Book Of the Merit Of The Holy Quran",
                    "chapterUrdu": "قرآن کے فضائل اور متعلقہ امور",
                    "chapterArabic": "کتاب فَضَائِلِ الْقُرْآنِ وَمَا يَتَعَلَّقُ بِهِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9425,
                "hadithNumber": "1861",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated by Qatada with the same chain of transmitters but with one alteration that instead of the word: hypocrite (Munafiq), there it is wicked (fajir).",
                "hadithUrdu": "ہم سے حداب بن خالد نے بیان کیا، ہم سےہمام اور شعبہ نے قتادہ سے اسی سند کے ساتھ اسی کی طرح حدیث روایت کی ۔ اس میں یہ فرق ہے کہ ہمام کی روایت میں منا فق کی جگہ فاجر ( بدکردار ) کا لفظ ہے ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ حَدَّثَنَا هَمَّامٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ شُعْبَةَ كِلَاهُمَا عَنْ قَتَادَةَ بِهَذَا الْإِسْنَادِ مِثْلَهُ غَيْرَ أَنَّ فِي حَدِيثِ هَمَّامٍ بَدَلَ الْمُنَافِقِ الْفَاجِرِ.",
                "headingArabic": "فَضْلِ الْمَاهِرِ بِالْقُرْآنِ وَالَّذِي يَتَتَعْتَعُ فِيهِ ‏‏",
                "headingUrdu": "قرآن کی تلاوت میں مہارت رکھنے والے کی فضیلت اور تلاوت میں سستی کرنے والے کی فضیلت",
                "headingEnglish": "The virtue of the one who is skilled in reciting Qur’an and the one who falters in reciting",
                "chapterId": "7",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 107,
                    "chapterNumber": "7",
                    "chapterEnglish": "The Book Of the Merit Of The Holy Quran",
                    "chapterUrdu": "قرآن کے فضائل اور متعلقہ امور",
                    "chapterArabic": "کتاب فَضَائِلِ الْقُرْآنِ وَمَا يَتَعَلَّقُ بِهِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9426,
                "hadithNumber": "1862",
                "englishNarrator": "A'isha رضی اللہ تعالیٰ عنہا reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) (as saying): One who is proficient in the Qur'an is associated with the noble, upright, recording angels; and he who falters in it, and finds it difficult for him, will have a double reward.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" قرآن مجید کا مہر قرآن لکھنے والے انتہائی معزز اور اللہ تعالیٰ کے فرمانبردار فرشتوں کے ساتھ ہوگا اور جو انسان قرآن مجیدپڑھتاہے اور ہکلاتا ہے ۔ اور وہ ( پڑھنا ) اس کے لئے مشقت کا باعث ہے ، اس کے لئے دو اجر ہیں ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید اور محمد بن عبید الغبری نے بیان کیا, ابو عوانہ نے قتادہؒ سے روایت کی ، انھوں نے زراہ بن اوفیٰ ( عامری ) سے ، انھوں نےسعد بن ہشام سے اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَمُحَمَّدُ بْنُ عُبَيْدٍ الْغُبَرِيُّ جَمِيعًا عَنْ أَبِي عَوَانَةَ قَالَ ابْنُ عُبَيْدٍ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ سَعْدِ بْنِ هِشَامٍ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَاهِرُ بِالْقُرْآنِ مَعَ السَّفَرَةِ الْكِرَامِ الْبَرَرَةِ وَالَّذِي يَقْرَأُ الْقُرْآنَ وَيَتَتَعْتَعُ فِيهِ وَهُوَ عَلَيْهِ شَاقٌّ لَهُ أَجْرَانِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "7",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 107,
                    "chapterNumber": "7",
                    "chapterEnglish": "The Book Of the Merit Of The Holy Quran",
                    "chapterUrdu": "قرآن کے فضائل اور متعلقہ امور",
                    "chapterArabic": "کتاب فَضَائِلِ الْقُرْآنِ وَمَا يَتَعَلَّقُ بِهِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9427,
                "hadithNumber": "1863",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been reported with the same chain of transmitters by Qatada except with this change: He who finds it hard (to recite the Qur'an) will have a double reward.",
                "hadithUrdu": "ہم سے محمد بن المثنیٰ نے بیان کیا, ابن ابی عدی نے سعید سے روایت کی ، وکیع نے ہشام دستوائی سے روایت کی ، ان دونوں نے قتادہ سے اسی سند کے ساتھ حدیث بیان کی البتہ وکیع کی حدیث میں یہ الفاظ ہیں : \" جو اسے پڑھتا ہے اور وہ اس پر گراں ہوتا ہے ، اس کے لئے دو اجر ہیں ۔ \"",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ سَعِيدٍ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ هِشَامٍ الدَّسْتَوَائِيِّ كِلَاهُمَا عَنْ قَتَادَةَ بِهَذَا الْإِسْنَادِ و قَالَ فِي حَدِيثِ وَكِيعٍ وَالَّذِي يَقْرَأُ وَهُوَ يَشْتَدُّ عَلَيْهِ لَهُ أَجْرَانِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "7",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 107,
                    "chapterNumber": "7",
                    "chapterEnglish": "The Book Of the Merit Of The Holy Quran",
                    "chapterUrdu": "قرآن کے فضائل اور متعلقہ امور",
                    "chapterArabic": "کتاب فَضَائِلِ الْقُرْآنِ وَمَا يَتَعَلَّقُ بِهِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9428,
                "hadithNumber": "1864",
                "englishNarrator": "Anas رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying to Ubayy bin Ka'b: Allah has commanded me to recite the Qur'an to you. He said: Did Allah mention me to you by name? He (the Holy Prophet) said: Allah made a mention of your name to me. (On hearing this) Ubayy b. Ka'b wept.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے حضرت ابی رضی اللہ تعالیٰ عنہ سے فرمایا : \" اللہ تعالیٰ نے مجھے حکم دیا ہے کہ میں تمھارے سامنے قراءت کروں ۔ \" انھوں نےکہا : کیا اللہ تعالیٰ نے آپ کے سامنے میرا نام لیا؟ آپ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ تعالیٰ نے میرے سامنے تمہارا نام لیا ۔ \" تو حضرت ابی رضی اللہ تعالیٰ عنہ رونے لگے ۔",
                "urduNarrator": "ہم سے حداب بن خالد نے بیان کیا, ہمام نےکہا : ہم سے قتادہ نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے حدیث بیان کی کہ",
                "hadithArabic": "حَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِأُبَيٍّ إِنَّ اللَّهَ أَمَرَنِي أَنْ أَقْرَأَ عَلَيْكَ قَالَ آللَّهُ سَمَّانِي لَكَ قَالَ اللَّهُ سَمَّاكَ لِي قَالَ فَجَعَلَ أُبَيٌّ يَبْكِي.",
                "headingArabic": "اسْتِحْبَابِ قِرَاءَةِ الْقُرْآنِ عَلَى أَهْلِ الْفَضْلِ وَالْحُذَّاقِ فِيهِ وَإِنْ كَانَ الْقَارِئُ أَفْضَلَ مِنَ الْمَقْرُوءِ عَلَيْهِ",
                "headingUrdu": "مستحب ہے کہ قرآن پاک ان لوگوں کو سنائیں جو اس کی تلاوت میں مہارت رکھتے ہوں، خواہ تلاوت کرنے والا اس سے بہتر کیوں نہ ہو جس کو پڑھا جاتا ہے۔",
                "headingEnglish": "It is recommended to recite the Qur’an to people of virtue who are skilled in its recitation, even if the reciter is better than the one to whom it is recited",
                "chapterId": "7",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 107,
                    "chapterNumber": "7",
                    "chapterEnglish": "The Book Of the Merit Of The Holy Quran",
                    "chapterUrdu": "قرآن کے فضائل اور متعلقہ امور",
                    "chapterArabic": "کتاب فَضَائِلِ الْقُرْآنِ وَمَا يَتَعَلَّقُ بِهِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9429,
                "hadithNumber": "1865",
                "englishNarrator": "Anas رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying to Ubayy bin Ka`b رضی اللہ تعالیٰ عنہ : Allah has commanded me to recite to you: Those who disbelieve were not... (al-Qur'an, xcviii. 1). He said: Did He mention me by name? He (the Prophet said): Yes. Upon this he shed tears (of gratitude).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ابی بن کعب رضی اللہ تعالیٰ عنہ سے فرمایا : \" اللہ تعالیٰ نے حکم دیا ہے کہ میں تمہارے سامنےلَمْ يَكُنِ الَّذِينَ كَفَرُ‌وا کی قراءت کروں ۔ \" انھوں نے کہا : اور ( اللہ تعالیٰ نے ) آپ کے سامنے میرا نام لیا ہے؟آپ نے فرمایا : \" ہاں ۔ \" ( انس رضی اللہ تعالیٰ عنہ نے ) کہا : تو وہ رودیئے ۔",
                "urduNarrator": "ہم سے محمد بن مثنیٰ اور ابن بشار نے بیان کیا، کہا کہ ہم سےمحمد بن جعفر نے کہا : ہم سے شعبہ نے حدیث بیان کی ، انھوں نے کہا : میں نے قتادہ کو حضرت انس رضی اللہ تعالیٰ عنہ سے حدیث بیان کرتے سنا ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ قَتَادَةَ يُحَدِّثُ عَنْ أَنَسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأُبَيِّ بْنِ كَعْبٍ إِنَّ اللَّهَ أَمَرَنِي أَنْ أَقْرَأَ عَلَيْكَ لَمْ يَكُنْ الَّذِينَ كَفَرُوا قَالَ وَسَمَّانِي لَكَ قَالَ نَعَمْ قَالَ فَبَكَى.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "7",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 107,
                    "chapterNumber": "7",
                    "chapterEnglish": "The Book Of the Merit Of The Holy Quran",
                    "chapterUrdu": "قرآن کے فضائل اور متعلقہ امور",
                    "chapterArabic": "کتاب فَضَائِلِ الْقُرْآنِ وَمَا يَتَعَلَّقُ بِهِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9430,
                "hadithNumber": "1866",
                "englishNarrator": "Qatada said:",
                "hadithEnglish": "I heard Anas رضی اللہ تعالیٰ عنہ saying that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to Ubayy رضی اللہ تعالیٰ عنہ the same thing.",
                "hadithUrdu": "میں نے حضرت انس رضی اللہ تعالیٰ عنہ سے سنا ، وہ کہہ رہے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے ابی رضی اللہ تعالیٰ عنہ سے کہا ۔ ۔ ۔ ( آگے سابقہ حدیث ) کے مانند ہے ۔",
                "urduNarrator": "ہم سے محمد بن مثنیٰ اور ابن بشار نے بیان کیا، کہا کہ ہم سےخالد بن حارث نے کہا : شعبہ نے ہمیں قتادہ کے حوالے سے حدیث بیان کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ قَالَ سَمِعْتُ أَنَسًا يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأُبَيٍّ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "7",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 107,
                    "chapterNumber": "7",
                    "chapterEnglish": "The Book Of the Merit Of The Holy Quran",
                    "chapterUrdu": "قرآن کے فضائل اور متعلقہ امور",
                    "chapterArabic": "کتاب فَضَائِلِ الْقُرْآنِ وَمَا يَتَعَلَّقُ بِهِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9431,
                "hadithNumber": "1867",
                "englishNarrator": "Abdullah (bin Mas'ud) رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah (may peace be upon (him) asked me to recite the Qur'an. He said: Messenger of Allah, (how) should I recite to you whereas it has been sent down to you? He (the Holy Prophet) said: I desire to hear it from someone else. So I recited Surat al-Nisa' till I reached the verse: How then shall it be when We shall bring from every people a witness and bring you against them as a witness? (verse 41). I lifted my head or a person touched me in my side, and so I lifted my head and saw his tears falling (from the Holy Prophet's eyes).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فرمایا : \" میرے سامنے قرآن مجید کی قراءت کرو ۔ \" انھوں نے کہا : میں نے عرض کی : اے اللہ کے رسول صلی اللہ علیہ وسلم ! کیا میں آپ کو سناؤں ، جبکہ آپ پر ہی تو ( قرآن مجید ) نازل ہوا ہے؟آپ نے فرمایا : \" میری خواہش ہے کہ میں اسےکسی دوسرے سے سنوں ۔ \" تو میں نے سورہ نساء کی قراءت شروع کی ، جب میں اس آیت پر پہنچا : فَكَيْفَ إِذَا جِئْنَا مِن كُلِّ أُمَّةٍ بِشَهِيدٍ وَجِئْنَا بِكَ عَلَىٰ هَـٰؤُلَاءِ شَهِيدًا \" اس وقت کیا حال ہوگا ، جب ہم ہر امت میں سے ایک گواہ لائیں گے اور آپ کو ان پر گواہ بنا کرلائیں گے ۔ \" تو میں نے اپنا سر اٹھایا ، یا میرے پہلو میں موجود آدمی نے مجھے ٹھوکا دیا تو میں نے اپنا سر اٹھایا ، میں نے دیکھا کہ آپ صلی اللہ علیہ وسلم کے آنسو بہہ رہے تھے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے روایت کی ہے, حفص بن غیاث نے اعمش سے روایت کی ، انھوں نے ابراہیم سے ، انھوں عبیدہ ( سلمانی ) سےاور انھوں نے عبداللہ بن مسعود رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ جَمِيعًا عَنْ حَفْصٍ قَالَ أَبُو بَكْرٍ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَبِيدَةَ عَنْ عَبْدِ اللَّهِ قَالَ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْرَأْ عَلَيَّ الْقُرْآنَ قَالَ فَقُلْتُ يَا رَسُولَ اللَّهِ أَقْرَأُ عَلَيْكَ وَعَلَيْكَ أُنْزِلَ قَالَ إِنِّي أَشْتَهِي أَنْ أَسْمَعَهُ مِنْ غَيْرِي فَقَرَأْتُ النِّسَاءَ حَتَّى إِذَا بَلَغْتُ فَكَيْفَ إِذَا جِئْنَا مِنْ كُلِّ أُمَّةٍ بِشَهِيدٍ وَجِئْنَا بِكَ عَلَى هَؤُلَاءِ شَهِيدًا رَفَعْتُ رَأْسِي أَوْ غَمَزَنِي رَجُلٌ إِلَى جَنْبِي فَرَفَعْتُ رَأْسِي فَرَأَيْتُ دُمُوعَهُ تَسِيلُ.",
                "headingArabic": "فَضْلِ اسْتِمَاعِ الْقُرْآنِ وَطَلَبِ الْقِرَاءَةِ مِنْ حَافِظِهِ لِلاِسْتِمَاعِ وَالْبُكَاءِ عِنْدَ الْقِرَاءَةِ وَالتَّدَبُّرِ",
                "headingUrdu": "قرآن سننے کی فضیلت، حفظ کرنے والے سے تلاوت کرنے کو کہے تاکہ کوئی سن سکے، تلاوت کرتے وقت رونا، اور معانی پر غور کرنا۔",
                "headingEnglish": "The virtue of listening to the Qur’an, asking one who has memorized it to recite so that one may listen, weeping when reciting, and pondering the meanings",
                "chapterId": "7",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 107,
                    "chapterNumber": "7",
                    "chapterEnglish": "The Book Of the Merit Of The Holy Quran",
                    "chapterUrdu": "قرآن کے فضائل اور متعلقہ امور",
                    "chapterArabic": "کتاب فَضَائِلِ الْقُرْآنِ وَمَا يَتَعَلَّقُ بِهِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9432,
                "hadithNumber": "1868",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narratted by A'mash with the same chain of transmitters but with this addition: The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was on the pulpit when he asked me to recite to him.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ، جب آپ منبر پر تشریف فرماتھے ، مجھ سے کہا : \" مجھے قرآن سناؤ \"",
                "urduNarrator": "ہناد بن سری اور منجانب بن الحارث التمیمی نے ہم سب سے علی بن مشار کی سند سے اعمش کی سند سے اس سند کے ساتھ روایت کی اور ہناد نے اپنی روایت میں یہ اضافہ کیا کہ",
                "hadithArabic": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ وَمِنْجَابُ بْنُ الْحَارِثِ التَّمِيمِيُّ جَمِيعًا عَنْ عَلِيِّ بْنِ مُسْهِرٍ عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ وَزَادَ هَنَّادٌ فِي رِوَايَتِهِ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ عَلَى الْمِنْبَرِ اقْرَأْ عَلَيَّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "7",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 107,
                    "chapterNumber": "7",
                    "chapterEnglish": "The Book Of the Merit Of The Holy Quran",
                    "chapterUrdu": "قرآن کے فضائل اور متعلقہ امور",
                    "chapterArabic": "کتاب فَضَائِلِ الْقُرْآنِ وَمَا يَتَعَلَّقُ بِهِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9433,
                "hadithNumber": "1869",
                "englishNarrator": "Ibrahim reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) asked 'Abdullah bin Mas'ud رضی اللہ تعالیٰ عنہ to recite to him (the Qur'an). He said: Should I recite it to you while it has been sent down or revealed to you? He (the Holy Prophet) said: I love to hear it from someone else. So he ('Abdullah b. Mas'ud) recited to him (from the beginning of Surat al Nisa' up to the verse: How shall then it be when We bring from every people a witness and bring you as a witness against them? He (the Holy Prophet) wept (on listening to it). It is narrated on the authority of Ibn Mas'ud رضی اللہ تعالیٰ عنہ through another chain of transmitters that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) also said that he had been a witness to his people as long as (said he): I lived among them or I had been among them.",
                "hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم نے عبداللہ بن مسعود رضی اللہ تعالیٰ عنہ سے کہا : \"\" مجھے قرآن مجید سناؤ ۔ \"\" انھوں نے کہا : کیا میں آپ کو سناؤں جبکہ ( قرآن ) اترا ہی آپ پر ہے؟آپ نے فرمایا : \"\" مجھے اچھا لگتاہے کہ میں اسے کسی دوسرے سے سنوں ۔ \"\" ( ابراہیم ) نے کہا : انھوں نے آپ کے سامنے سورہ نساء ابتداء سے اس آیت تک سنائی : فَكَيْفَ إِذَا جِئْنَا مِن كُلِّ أُمَّةٍ بِشَهِيدٍ وَجِئْنَا بِكَ عَلَىٰ هَـٰؤُلَاءِ شَهِيدًا \"\" اس وقت کیا حال ہوگا ، جب ہم ہر امت میں سے ایک گواہ لائیں گے اور آپ کو ان پر گواہ بنا کرلائیں گے ۔ \"\" تو آپ صلی اللہ علیہ وسلم ( اس آیت پر ) رو پڑے ۔ مسعر نے ایک دوسری سند سے عبداللہ بن مسعود رضی اللہ تعالیٰ عنہ کا یہ قول نقل کیا کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا : \"\" میں ان پر اس وقت تک گواہ تھا جب تک میں ان میں رہا ۔ \"\" مسعر کو شک ہے ۔ ما دمت فيهم کہایا ما كنت فيهم ( جب تک میں ان میں تھا ) کہا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، کہا: ہم سے ابو اسامہ نے بیان کیا، کہا کہ مجھ سے مسعر نے بیان کیا، اور ابو کریب رضی اللہ عنہ نے کہا, مسعر نے عمرو بن مرہ سے اور انھوں نے ابراہیم سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنِي مِسْعَرٌ وَقَالَ أَبُو كُرَيْبٍ عَنْ مِسْعَرٍ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ إِبْرَاهِيمَ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِعَبْدِ اللَّهِ بْنِ مَسْعُودٍ اقْرَأْ عَلَيَّ قَالَ أَقْرَأُ عَلَيْكَ وَعَلَيْكَ أُنْزِلَ قَالَ إِنِّي أُحِبُّ أَنْ أَسْمَعَهُ مِنْ غَيْرِي قَالَ فَقَرَأَ عَلَيْهِ مِنْ أَوَّلِ سُورَةِ النِّسَاءِ إِلَى قَوْلِهِ فَكَيْفَ إِذَا جِئْنَا مِنْ كُلِّ أُمَّةٍ بِشَهِيدٍ وَجِئْنَا بِكَ عَلَى هَؤُلَاءِ شَهِيدًا فَبَكَى قَالَ مِسْعَرٌ فَحَدَّثَنِي مَعْنٌ عَنْ جَعْفَرِ بْنِ عَمْرِو بْنِ حُرَيْثٍ عَنْ أَبِيهِ عَنْ ابْنِ مَسْعُودٍ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَهِيدًا عَلَيْهِمْ مَا دُمْتُ فِيهِمْ أَوْ مَا كُنْتُ فِيهِمْ شَكَّ مِسْعَرٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "7",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 107,
                    "chapterNumber": "7",
                    "chapterEnglish": "The Book Of the Merit Of The Holy Quran",
                    "chapterUrdu": "قرآن کے فضائل اور متعلقہ امور",
                    "chapterArabic": "کتاب فَضَائِلِ الْقُرْآنِ وَمَا يَتَعَلَّقُ بِهِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9434,
                "hadithNumber": "1870",
                "englishNarrator": "Abdullah (bin Mas'ud) رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "I was in Hims when some of the people asked me to recite the Qur'an to them. So I recited Surah Yusuf to them. One of the persons among the people said: By Allah, this is not how it has been sent down. I said: Woe upon you! By Allah, I recited it to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and he said to me: You have (recited) it well. I was talking with him (the man who objected to my recitation) that I sensed the smell of wine from him. So I said to him. Do you drink wine and belie the Book (of Allah)? You would not depart till I would whip you. So I lashed him according to the prescribed punishment (for the offence of drinking wine).",
                "hadithUrdu": "\"\" میں حمص میں تھا تو کچھ لوگوں نے مجھے کہا : ہمیں قرآن مجید سنائیں تو میں نے انھیں سورہ یوسف سنائی ۔ لوگوں میں سے ایک آدمی نے کہا : اللہ کی قسم! یہ اس طرح نہیں اتری تھی ۔ میں نے کہا : تجھ پر افسوس ، اللہ کی قسم!میں نے یہ سورت رسول اللہ صلی اللہ علیہ وسلم کو سنائی تھی تو آ پ نے مجھ سے فرمایا : \"\" تو نے خوب قراءت کی ۔ \"\" اسی اثنا میں کہ میں اس سے گفتگو کررہا تھا تو میں نے اس ( کے منہ ) سے شراب کی بو محسوس کی ، میں نے کہا : تو شراب بھی پیتا ہے اور کتاب اللہ کی تکذیب بھی کرتا ہے؟تو یہاں سے نہیں جاسکتا حتیٰ کہ میں تجھے کوڑے لگاؤں ، پھر میں نے اسے حد کے طور پر کوڑے لگائے ۔",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ نے بیان کیا,جریر نے اعمش سے ، انھوں نے ابراہیم سے ، انھوں نے علقمہ سے اور انھوں نے حضرت عبداللہ بن مسعود رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَ كُنْتُ بِحِمْصَ فَقَالَ لِي بَعْضُ الْقَوْمِ اقْرَأْ عَلَيْنَا فَقَرَأْتُ عَلَيْهِمْ سُورَةَ يُوسُفَ قَالَ فَقَالَ رَجُلٌ مِنْ الْقَوْمِ وَاللَّهِ مَا هَكَذَا أُنْزِلَتْ قَالَ قُلْتُ وَيْحَكَ وَاللَّهِ لَقَدْ قَرَأْتُهَا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لِي أَحْسَنْتَ فَبَيْنَمَا أَنَا أُكَلِّمُهُ إِذْ وَجَدْتُ مِنْهُ رِيحَ الْخَمْرِ قَالَ فَقُلْتُ أَتَشْرَبُ الْخَمْرَ وَتُكَذِّبُ بِالْكِتَابِ لَا تَبْرَحُ حَتَّى أَجْلِدَكَ قَالَ فَجَلَدْتُهُ الْحَدَّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "7",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 107,
                    "chapterNumber": "7",
                    "chapterEnglish": "The Book Of the Merit Of The Holy Quran",
                    "chapterUrdu": "قرآن کے فضائل اور متعلقہ امور",
                    "chapterArabic": "کتاب فَضَائِلِ الْقُرْآنِ وَمَا يَتَعَلَّقُ بِهِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9435,
                "hadithNumber": "1871",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated by A'mash with the same chain of transmitters but with an exception that it is not mentioned in it: He said to me: You recited (the Qur'an) well.",
                "hadithUrdu": "اور ہم سے اسحاق بن ابراہیم اور علی بن خشرم نے بیان کیا، کہا: انہوں نے ہمیں خبر دی,عیسیٰ بن یونس اور ابو معاویہ نے اعمش سے اسی سند کے ساتھ ر وایت کی لیکن ابومعاویہ کی روایت میں فقال لي احسنت ( آپ نے مجھے فرمایا : \" تو نے بہت اچھا پڑھا \" ) کے الفاظ نہیں ہیں ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَعَلِيُّ بْنُ خَشْرَمٍ قَالَا أَخْبَرَنَا عِيسَى بْنُ يُونُسَ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ جَمِيعًا عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ وَلَيْسَ فِي حَدِيثِ أَبِي مُعَاوِيَةَ فَقَالَ لِي أَحْسَنْتَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "7",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 107,
                    "chapterNumber": "7",
                    "chapterEnglish": "The Book Of the Merit Of The Holy Quran",
                    "chapterUrdu": "قرآن کے فضائل اور متعلقہ امور",
                    "chapterArabic": "کتاب فَضَائِلِ الْقُرْآنِ وَمَا يَتَعَلَّقُ بِهِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9436,
                "hadithNumber": "1872",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Would any one of you like, when he returns to his family, to find there three large, fat, pregnant she-camels? We said: Yes. Upon this he said: Three verses that one of you recites in his prayer are better for him than three large, fat, pregnant she-camels.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نےفرمایا : \" کیا تم میں سے کوئی شخص یہ پسند کرتا ہے کہ جب وہ ( باہر سے ) اپنے گھر واپس آئے تو اس میں تین بڑی فربہ حاملہ اونٹنیاں موجود پائے؟ \" ہم نے عرض کی : جی ہاں!آپ نے فرمایا : \" تین آیات جنھیں تم میں سے کوئی شخص اپنی نماز میں پڑھتا ہے ۔ وہ اس کے لئے تین بھاری بھرکم اور موٹی تازی حاملہ اونٹنیوں سے بہتر ہیں ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابو سعید الاشجع نے بیان کیا، کہا: ہم سے وکیع نے، العمش کی سند سے، ابو صالح کی سند سے، انہوں نے کہا, حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روایت ہے ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو سَعِيدٍ الْأَشَجُّ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُحِبُّ أَحَدُكُمْ إِذَا رَجَعَ إِلَى أَهْلِهِ أَنْ يَجِدَ فِيهِ ثَلَاثَ خَلِفَاتٍ عِظَامٍ سِمَانٍ قُلْنَا نَعَمْ قَالَ فَثَلَاثُ آيَاتٍ يَقْرَأُ بِهِنَّ أَحَدُكُمْ فِي صَلَاتِهِ خَيْرٌ لَهُ مِنْ ثَلَاثِ خَلِفَاتٍ عِظَامٍ سِمَانٍ.",
                "headingArabic": "فَضْلِ قِرَاءَةِ الْقُرْآنِ فِي الصَّلاَةِ وَتَعَلُّمِهِ ‏",
                "headingUrdu": "نماز میں قرآن پڑھنے اور سیکھنے کی فضیلت",
                "headingEnglish": "The virtue of reciting the Qur’an in prayer and learning it",
                "chapterId": "7",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 107,
                    "chapterNumber": "7",
                    "chapterEnglish": "The Book Of the Merit Of The Holy Quran",
                    "chapterUrdu": "قرآن کے فضائل اور متعلقہ امور",
                    "chapterArabic": "کتاب فَضَائِلِ الْقُرْآنِ وَمَا يَتَعَلَّقُ بِهِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9437,
                "hadithNumber": "1873",
                "englishNarrator": "Uqba bin 'Amir رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "When we were in Suffa, the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came out and said: Which of you would like to go out every morning to Buthan or al-'Aqiq and bring two large she-camels without being guilty of sin or without severing the ties of kinship? We said: Messenger of Allah, we would like to do it. Upon this he said: Does not one of you go out in the morning to the mosque and teach or recite two verses from the Book of Allah. the Majestic and Glorious? That is better for him than two she-camels, and three verses are better (than three she-camels). and four verses are better for him than four (she-camels), and to on their number in camels.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم گھر سےنکل کر تشریف لائے ۔ ہم صفہ ( چبوترے ) پر مووجودتھے ، آپ نے فرمایا : \" تم میں سے کون پسند کرتا ہے کہ روزانہ صبح بطحان یا عقیق ( کی وادی ) میں جائے اور وہاں سے بغیر کسی گناہ اور قطع رحمی کے دو بڑے بڑے کوہانوں والی اونٹنیاں لائے؟ \" ہم نے عرض کی ، اے اللہ کے رسول صلی اللہ علیہ وسلم ! ہم سب کو یہ بات پسندہے آپ نے فرمایا : \" پھر تم میں سے صبح کوئی شخص مسجد میں کیوں نہیں جاتا کہ وہ اللہ کی کتاب کی دو آیتیں سیکھے یا ان کی قراءت کرے تو یہ اس کے لئے دو اونٹنیوں ( کے حصول ) سے بہتر ہے اور یہ تین آیات تین اونٹنیوں سے بہتر اور چار آیتیں اس کے لئے چار سے بہتر ہیں اور ( آیتوں کی تعداد جو بھی ہو ) اونٹوں کی اتنی تعداد سے بہتر ہے ۔ \"",
                "urduNarrator": "اور ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے الفضل بن د کین نے بیان کیا، ان سے موسیٰ بن علی رضی اللہ عنہ نے کہا کہ میں نے اپنے والد کو فرماتے ہوئے سنا, حضرت عقبہ بن عامر رضی اللہ تعالیٰ عنہ سے روایت ہے ، انھوں نے کہا کہ",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ عَنْ مُوسَى بْنِ عُلَيٍّ قَالَ سَمِعْتُ أَبِي يُحَدِّثُ عَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَ خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ فِي الصُّفَّةِ فَقَالَ أَيُّكُمْ يُحِبُّ أَنْ يَغْدُوَ كُلَّ يَوْمٍ إِلَى بُطْحَانَ أَوْ إِلَى الْعَقِيقِ فَيَأْتِيَ مِنْهُ بِنَاقَتَيْنِ كَوْمَاوَيْنِ فِي غَيْرِ إِثْمٍ وَلَا قَطْعِ رَحِمٍ فَقُلْنَا يَا رَسُولَ اللَّهِ نُحِبُّ ذَلِكَ قَالَ أَفَلَا يَغْدُو أَحَدُكُمْ إِلَى الْمَسْجِدِ فَيَعْلَمُ أَوْ يَقْرَأُ آيَتَيْنِ مِنْ كِتَابِ اللَّهِ عَزَّ وَجَلَّ خَيْرٌ لَهُ مِنْ نَاقَتَيْنِ وَثَلَاثٌ خَيْرٌ لَهُ مِنْ ثَلَاثٍ وَأَرْبَعٌ خَيْرٌ لَهُ مِنْ أَرْبَعٍ وَمِنْ أَعْدَادِهِنَّ مِنْ الْإِبِلِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "7",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 107,
                    "chapterNumber": "7",
                    "chapterEnglish": "The Book Of the Merit Of The Holy Quran",
                    "chapterUrdu": "قرآن کے فضائل اور متعلقہ امور",
                    "chapterArabic": "کتاب فَضَائِلِ الْقُرْآنِ وَمَا يَتَعَلَّقُ بِهِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9438,
                "hadithNumber": "1874",
                "englishNarrator": "Abu Umama رضی اللہ تعالیٰ عنہ said:",
                "hadithEnglish": "He heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) say: Recite the Qur'an, for on the Day of Resurrection it will come as an intercessor for those who recite It. Recite the two bright ones, al-Baqara and Surah Al 'Imran, for on the Day of Resurrection they will come as two clouds or two shades, or two flocks of birds in ranks, pleading for those who recite them. Recite Surah al-Baqara, for to take recourse to it is a blessing and to give it up is a cause of grief, and the magicians cannot confront it. (Mu'awiya said: It has been conveyed to me that here Batala means magicians.)",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کویہ فرماتے ہوئے سنا : \"\" قرآن پڑھا کرو کیونکہ وہ قیامت کے دن اصحاب قرآن ( حفظ وقراءت اور عمل کرنے والوں ) کا سفارشی بن کر آئےگا ۔ دو روشن چمکتی ہوئی سورتیں : البقرہ اور آل عمران پڑھا کرو کیونکہ وہ قیامت کے دن اس طرح آئیں گی جیسے وہ دو بادل یا دو سائبان ہوں یا جیسے وہ ایک سیدھ میں اڑتے پرندوں کی وہ ڈاریں ہوں ، وہ اپنی صحبت میں ( پڑھنے اور عمل کرنے ) والوں کی طرف سے دفاع کریں گی ۔ سورہ بقرہ پڑھا کرو کیونکہ اسے حاصل کرنا باعث برکت اور اسے ترک کرناباعث حسرت ہے اور باطل پرست اس کی طاقت نہیں رکھتے ۔ \"\" معاویہ نے کہا : مجھے یہ خبر پہنچی ہے کہ باطل پرستوں سے ساحر ( جادوگر ) مراد ہیں ۔",
                "urduNarrator": "ہم سے حسن بن علی الحلوانی نے بیان کیا, ابو توبہ ربیع بن نافع نے بیان کیا کہ ہم سے معاویہ ، یعنی ابن اسلام نے حدیث بیان کی ، انھوں نے زید سے روایت کی کہ  انھوں نے ابو سلام سے سنا ، وہ کہتے تھے : مجھ سے حضرت ابو امامہ باہلی رضی اللہ تعالیٰ عنہ نے حدیث بیان کی ، انھوں کہا",
                "hadithArabic": "حَدَّثَنِي الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ حَدَّثَنَا أَبُو تَوْبَةَ وَهُوَ الرَّبِيعُ بْنُ نَافِعٍ حَدَّثَنَا مُعَاوِيَةُ يَعْنِي ابْنَ سَلَّامٍ عَنْ زَيْدٍ أَنَّهُ سَمِعَ أَبَا سَلَّامٍ يَقُولُ حَدَّثَنِي أَبُو أُمَامَةَ الْبَاهِلِيُّ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ اقْرَءُوا الْقُرْآنَ فَإِنَّهُ يَأْتِي يَوْمَ الْقِيَامَةِ شَفِيعًا لِأَصْحَابِهِ اقْرَءُوا الزَّهْرَاوَيْنِ الْبَقَرَةَ وَسُورَةَ آلِ عِمْرَانَ فَإِنَّهُمَا تَأْتِيَانِ يَوْمَ الْقِيَامَةِ كَأَنَّهُمَا غَمَامَتَانِ أَوْ كَأَنَّهُمَا غَيَايَتَانِ أَوْ كَأَنَّهُمَا فِرْقَانِ مِنْ طَيْرٍ صَوَافَّ تُحَاجَّانِ عَنْ أَصْحَابِهِمَا اقْرَءُوا سُورَةَ الْبَقَرَةِ فَإِنَّ أَخْذَهَا بَرَكَةٌ وَتَرْكَهَا حَسْرَةٌ وَلَا تَسْتَطِيعُهَا الْبَطَلَةُ قَالَ مُعَاوِيَةُ بَلَغَنِي أَنَّ الْبَطَلَةَ السَّحَرَةُ.",
                "headingArabic": "فَضْلِ قِرَاءَةِ الْقُرْآنِ وَسُورَةِ الْبَقَرَةِ ‏",
                "headingUrdu": "قرآن اور سورۃ البقرہ کی تلاوت کی فضیلت",
                "headingEnglish": "The virtue of reciting the Qur’an and Surat al-Baqarah",
                "chapterId": "7",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 107,
                    "chapterNumber": "7",
                    "chapterEnglish": "The Book Of the Merit Of The Holy Quran",
                    "chapterUrdu": "قرآن کے فضائل اور متعلقہ امور",
                    "chapterArabic": "کتاب فَضَائِلِ الْقُرْآنِ وَمَا يَتَعَلَّقُ بِهِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 9126,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=365",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=363",
                "label": "363",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=364",
                "label": "364",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=365",
                "label": "365",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=366",
                "label": "366",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=367",
                "label": "367",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=368",
                "label": "368",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=369",
                "label": "369",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=367",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=367",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=365",
        "to": 9150,
        "total": 40465
    }
}