{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 495,
        "data": [
            {
                "id": 12639,
                "hadithNumber": "5076",
                "englishNarrator": "Al-Bara' bin 'Azib رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) addressed us on the day of Nahr and said: None should sacrifice the animal unless he has completed the ('Id) prayer. A person said: I have a milch goat of less than one year, better than two fat goats. Thereupon he said: Sacrifice it, and no goat of less than a year of age will be accepted as sacrifice after you.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ہمیں قربانی کے دن خطبہ دیا اور فرما یا : \" کو ئی شخص نماز پڑھنے سے پہلے قربانی نہ کرے ۔ \" ایک شخص نے کہا : میرے پاس ایک سالہ دودھ پینے والی ( کھیری ) بکری ہے جو گوشت والی دوبکریوں سے بہترہے ۔ آپ صلی اللہ علیہ وسلم نے فر ما یا : \" تم اس کی قربانی کردو ، تمھا رے بعد ایک سالہ بکری کسی کے لیے کا فی نہ ہو گی ۔ \"",
                "urduNarrator": "مجھ سے احمد بن سعید بن صخر الدارمی نے بیان کیا، کہا ہم سے ابو النعمان ارم بن الفضل نے بیان کیا، ہم سے عبد الواحد یعنی ابن زیاد نے بیان کیا, عاصم احول نے شعبی سے روایت کی ، کہا : مجھے حضرت برا ء بن عازب رضی اللہ عنہ نے حدیث سنا ئی ، کہا",
                "hadithArabic": "و حَدَّثَنِي أَحْمَدُ بْنُ سَعِيدِ بْنِ صَخْرٍ الدَّارِمِيُّ حَدَّثَنَا أَبُو النُّعْمَانِ عَارِمُ بْنُ الْفَضْلِ حَدَّثَنَا عَبْدُ الْوَاحِدِ يَعْنِي ابْنَ زِيَادٍ حَدَّثَنَا عَاصِمٌ الْأَحْوَلُ عَنْ الشَّعْبِيِّ حَدَّثَنِي الْبَرَاءُ بْنُ عَازِبٍ قَالَ خَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي يَوْمِ نَحْرٍ فَقَالَ لَا يُضَحِّيَنَّ أَحَدٌ حَتَّى يُصَلِّيَ قَالَ رَجُلٌ عِنْدِي عَنَاقُ لَبَنٍ هِيَ خَيْرٌ مِنْ شَاتَيْ لَحْمٍ قَالَ فَضَحِّ بِهَا وَلَا تَجْزِي جَذَعَةٌ عَنْ أَحَدٍ بَعْدَكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "36",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 136,
                    "chapterNumber": "36",
                    "chapterEnglish": "The Book of Sacrifices",
                    "chapterUrdu": "قربانی کے احکام و مسائل",
                    "chapterArabic": "كتاب الْأَضَاحِيِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12640,
                "hadithNumber": "5077",
                "englishNarrator": "Al-Bara' bin 'Azib رضی اللہ عنہ reported:",
                "hadithEnglish": "Abu Burda رضی اللہ عنہ slaughtered the animal as a sacrifice before the ('Id) prayer. Thereupon Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Offer a substitute for it (since it does not absolve you of the responsibility of sacrifice). Thereupon he said: Allah's Messenger. I have nothing with me but a goat of less than six months. Shu'ba (one of the narrators) said: I think he (al-Bara' bin 'Azib also) said: And it is better than a goat of one year. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Make it a substitute for that (and sacrifice it), but it will not suffice for anyone (as a sacrifice) after you.",
                "hadithUrdu": "حضرت ابو بردہ رضی اللہ عنہ نے نما ز سے پہلے قربانی کا جا نورذبح کر لیا تو نبی صلی اللہ علیہ وسلم نے فرما یا : \" اس کے بدلے میں دوسری قربانی کرو ۔ انھوں نے کہا : اللہ کے رسول صلی اللہ علیہ وسلم ! میرے پاس ایک سالہ بکری ہے ۔ شعبہ نے کہا : میرا خیال ہے کہ انھوں نے کہا : ۔ ۔ ۔ اور وہ دو دانتی بکری سے بہتر ہے رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" اسے اس کی جگہ ( ذبح ) کرلو لیکن یہ تمھارے بعد کسی کے لیے کافی نہ ہو گی ۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا، کہا ہم سے محمد نے، یعنی ہم سے ابن جعفر نے بیان کیا,  ہمیں شعبہ نے سلمہ سے حدیث بیان کی ، انھوں نے ابو جحیفہ رضی اللہ عنہ سے انھوں نے حضرت براء بن عازب رضی اللہ عنہ سے روایت کی کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدٌ يَعْنِي ابْنَ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سَلَمَةَ، عَنْ أَبِي جُحَيْفَةَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ: ذَبَحَ أَبُو بُرْدَةَ قَبْلَ الصَّلَاةِ، فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَبْدِلْهَا»، فَقَالَ: يَا رَسُولَ اللهِ، لَيْسَ عِنْدِي إِلَّا جَذَعَةٌ - قَالَ شُعْبَةُ: وَأَظُنُّهُ قَالَ - وَهِيَ خَيْرٌ مِنْ مُسِنَّةٍ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «اجْعَلْهَا مَكَانَهَا، وَلَنْ تَجْزِيَ عَنْ أَحَدٍ بَعْدَكَ»،",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "36",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 136,
                    "chapterNumber": "36",
                    "chapterEnglish": "The Book of Sacrifices",
                    "chapterUrdu": "قربانی کے احکام و مسائل",
                    "chapterArabic": "كتاب الْأَضَاحِيِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12641,
                "hadithNumber": "5078",
                "englishNarrator": null,
                "hadithEnglish": "Shubah narrated it with this chain of narrators (a hadith similar to no. 5077), but he did not mention the doubt about whether he said: \"It is better than a Musinnah.",
                "hadithUrdu": "ہم سے ابن المثنی نے بیان کیا, وہب بن جریر اور ابو عامر عقدی نے کہا : شعبہ نے ہمیں اسی سند کے ساتھ حدیث بیان کی اور آپ صلی اللہ علیہ وسلم کے فرما ن \"\" یہ دودانتی بکری سے بہتر ہے \"\" کے بارے میں کسی شک کا ظہار نہیں کیا ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَاهُ ابْنُ الْمُثَنَّى، حَدَّثَنِي وَهْبُ بْنُ جَرِيرٍ، ح وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا أَبُو عَامِرٍ الْعَقَدِيُّ، حَدَّثَنَا شُعْبَةُ، بِهَذَا الْإِسْنَادِ وَلَمْ يَذْكُرِ الشَّكَّ فِي قَوْلِهِ: هِيَ خَيْرٌ مِنْ مُسِنَّةٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "36",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 136,
                    "chapterNumber": "36",
                    "chapterEnglish": "The Book of Sacrifices",
                    "chapterUrdu": "قربانی کے احکام و مسائل",
                    "chapterArabic": "كتاب الْأَضَاحِيِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12642,
                "hadithNumber": "5079",
                "englishNarrator": "Anas (bin Malik) رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) having said on the day of Nahr (Sacrifice): He who slaughtered (the animal as a sacrifice) before the ('Id) prayer. should repeat it (i.e. offer another animal). Thereupon a person stood up and said: Messenger of Allah, that is the day when meat is much desired, and he also made a mention of the need of his neighbor, and perhaps Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) attested it. He (the person who had sacrificed the animal before the 'Id prayer) said: I have a goat of less than one year of age with me and I like it more than two fleshy goats; should I offer it as a sacrifice? He permitted him to do so. He (the narrator) said: I do not know whether this permission was granted to anyone else besides him or not. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) then turned towards two rams. and he slaughtered them, and the people' came to the goats and got them distributed amongst themselves (for offering them as sacrifice).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے قربانی کے دن فر ما یا : \" جس شخص نے نماز سے پہلے قربانی کر لی ہے وہ پھر اسے کرے ۔ \" تو ایک آدمی کھڑا ہوا اور کہا : اللہ کے رسول صلی اللہ علیہ وسلم ! یہ ایسا دن ہے کہ اس میں گوشت کی خواہش ہو تی ہے ۔ اس نے اپنے ہمسایوں کی ضرورت مندی کا بھی ذکر کیا ۔ ( ایسا لگا ) جیسے رسول اللہ صلی اللہ علیہ وسلم نے بھی اس کی تصدیق کی ہو ۔ اس نے ( مزید ) کہا : اور میرے پاس ایک سالہ بکری ہے وہ مجھے گو شت والی دوبکریوں سے زیادہ پسند ہے کیا میں اسے ذبح کردوں ؟کہا : آپ نے اسے اس کی اجازت دے دی ۔ ( حضرت انس رضی اللہ عنہ نے ) کہا : مجھے معلوم نہیں کہ آپ کی دی ہو ئی رخصت اس ( شخص ) کے علاوہ دوسروں کے لیے بھی ہے یا نہیں ؟پھر ) کہا : رسول اللہ صلی اللہ علیہ وسلم نے دو مینڈھوں کا رخ کیا اور ان کو ذبحفر ما یا ۔ لوگ کھڑے ہو کر بکریوں کے ایک چھوٹے سے ریوڑ کی طرف متوجہ ہو ئے اور اس کو آپس میں تقسیم کرلیا ۔ ۔ ۔ یا کہا : اس کے حصے کر لیے ۔ ۔ ۔ ۔",
                "urduNarrator": "مجھ سے یحییٰ بن ایوب، عمرو ناقد اور زہیر بن حرب نے ابن اُلیّہ کی سند سے بیان کیا اور یہ لفظ عمرو کا ہے, اسماعیل بن ابرا ہیم ( ابن علیہ ) نے ایوب سے ، انھوں نے محمد ( بن سیرین ) سے انھوں نے حضرت انس رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنِي يَحْيَى بْنُ أَيُّوبَ وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ جَمِيعًا عَنْ ابْنِ عُلَيَّةَ وَاللَّفْظُ لِعَمْرٍو قَالَ حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ عَنْ أَيُّوبَ عَنْ مُحَمَّدٍ عَنْ أَنَسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ النَّحْرِ مَنْ كَانَ ذَبَحَ قَبْلَ الصَّلَاةِ فَلْيُعِدْ فَقَامَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ هَذَا يَوْمٌ يُشْتَهَى فِيهِ اللَّحْمُ وَذَكَرَ هَنَةً مِنْ جِيرَانِهِ كَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَدَّقَهُ قَالَ وَعِنْدِي جَذَعَةٌ هِيَ أَحَبُّ إِلَيَّ مِنْ شَاتَيْ لَحْمٍ أَفَأَذْبَحُهَا قَالَ فَرَخَّصَ لَهُ فَقَالَ لَا أَدْرِي أَبَلَغَتْ رُخْصَتُهُ مَنْ سِوَاهُ أَمْ لَا قَالَ وَانْكَفَأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى كَبْشَيْنِ فَذَبَحَهُمَا فَقَامَ النَّاسُ إِلَى غُنَيْمَةٍ فَتَوَزَّعُوهَا أَوْ قَالَ فَتَجَزَّعُوهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "36",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 136,
                    "chapterNumber": "36",
                    "chapterEnglish": "The Book of Sacrifices",
                    "chapterUrdu": "قربانی کے احکام و مسائل",
                    "chapterArabic": "كتاب الْأَضَاحِيِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12643,
                "hadithNumber": "5080",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) offered the 'Id prayer and then delivered the sermon giving the command: He who slaughtered the animal before prayer should slaughter (another animal as a sacrifice). The rest of the hadith is the same.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے نماز پڑھا ئی پھر خطبہ دیا ، پھر آپ نے حکم دیا کہ جس نے نماز سے پہلے قربانی کی ہے وہ دوبارہ کرے ، اس کے بعد ابن علیہ کی حدیث کے مانند بیان کیا ۔",
                "urduNarrator": "ہم سے محمد بن عبید الغبری نے بیان کیا, حماد بن زید نے کہا : ہمیں ایوب اور ہشام نے محمد سے حدیث بیان کی ، انھوں نے حضرت انس بن ما لک رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الْغُبَرِيُّ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ حَدَّثَنَا أَيُّوبُ وَهِشَامٌ عَنْ مُحَمَّدٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى ثُمَّ خَطَبَ فَأَمَرَ مَنْ كَانَ ذَبَحَ قَبْلَ الصَّلَاةِ أَنْ يُعِيدَ ذِبْحًا ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ ابْنِ عُلَيَّةَ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "36",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 136,
                    "chapterNumber": "36",
                    "chapterEnglish": "The Book of Sacrifices",
                    "chapterUrdu": "قربانی کے احکام و مسائل",
                    "chapterArabic": "كتاب الْأَضَاحِيِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12644,
                "hadithNumber": "5081",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) addressed us on the day of 'Id al-Adha. He smelt the odour of flesh and he prohibited their from slaughtering (the animals before the 'Id prayer), saying: He who slaughtered the animals (before the 'Id prayer) should do that again (as it is not valid as a sacrifice).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ہمیں قربانی کے دن خطبہ دیا کہا : آپ صلی اللہ علیہ وسلم کو گوشت کی بو محسوس ہو ئی تو آپ نے ان کو ذبح کرنے سے منع کیا ، آپ صلی اللہ علیہ وسلم نے فر ما یا : \" جس نے ( نماز سے پہلے ) ذبح لیا ہے وہ دوبارہ ( قربانی ) کرے ۔ \" پھر ( حاتم نے ) ان دونوں ( ابن علیہ اور حمادبن زید ) کی حدیثٖ کے مانند بیان کیا ۔",
                "urduNarrator": "زیاد بن یحییٰ الحسانی نے مجھ سے کہا, حاتم بن وردان نے کہا , ہمیں ایو ب نے محمد بن سیرین سے حدیث بیان کی ، انھوں نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنِي زِيَادُ بْنُ يَحْيَى الْحَسَّانِيُّ حَدَّثَنَا حَاتِمٌ يَعْنِي ابْنَ وَرْدَانَ حَدَّثَنَا أَيُّوبُ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ خَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ أَضْحًى قَالَ فَوَجَدَ رِيحَ لَحْمٍ فَنَهَاهُمْ أَنْ يَذْبَحُوا قَالَ مَنْ كَانَ ضَحَّى فَلْيُعِدْ ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِهِمَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "36",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 136,
                    "chapterNumber": "36",
                    "chapterEnglish": "The Book of Sacrifices",
                    "chapterUrdu": "قربانی کے احکام و مسائل",
                    "chapterArabic": "كتاب الْأَضَاحِيِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12645,
                "hadithNumber": "5082",
                "englishNarrator": "Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Sacrifice only a grown-up animal, unless it is difficult for you, in which case sacrifice a ram (of even less than a year, but more than six months' age).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : صرف مسنہ ( دودانتا ) جا نور کی قربانی کرو ہاں ! اگر تم کو دشوار ہو تو ایک سالہ دنبہ یا مینڈھا ذبح کر دو ۔ \"",
                "urduNarrator": "ہم سے احمد بن یونس نے بیان کیا، کہا ہم سے زہیر نے بیان کیا، کہا ہم سے ابو الزبیر نے بیان کیا, حضرت جا بر رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَذْبَحُوا إِلَّا مُسِنَّةً إِلَّا أَنْ يَعْسُرَ عَلَيْكُمْ فَتَذْبَحُوا جَذَعَةً مِنْ الضَّأْنِ.",
                "headingArabic": "النَّهْىِ عَنِ ابْتِدَاءِ، أَهْلِ الْكِتَابِ بِالسَّلاَمِ وَكَيْفَ يَرُدُّ عَلَيْهِمْ ‏‏",
                "headingUrdu": "اہل کتاب سے سلام شروع کرنے کی ممانعت اور ان کا جواب دینے کا طریقہ",
                "headingEnglish": "The Prohibition Of Initiating The Greeting With The People Of The Book, And How To Respond To Them",
                "chapterId": "36",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 136,
                    "chapterNumber": "36",
                    "chapterEnglish": "The Book of Sacrifices",
                    "chapterUrdu": "قربانی کے احکام و مسائل",
                    "chapterArabic": "كتاب الْأَضَاحِيِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12646,
                "hadithNumber": "5083",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) led us in the 'Id prayer in Medina on the Day of Sacrifice. Some persons slaughtered their animals ahead of him under the impression that Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had-already offered sacrifice. Thereupon Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Those who had slaughtered their animals ahead of him should slaughter the other ones in their stead. And they should not sacrifice the animal before Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had sacrificed (his animal).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ہمیں قربانی کے دن مدینہ میں نما ز پڑھا ئی کچھ لوگوں نے جلدی کی اور قربانی کر لی ۔ ان کا خیال تھا کہ رسول اللہ صلی اللہ علیہ وسلم نے قربانی کر لی ہو ئی ہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے حکم دیا کہ جس نے آپ ( کے نماز اور خطبے سے فارغ ہو نے ) سے پہلے قربانی کر لی وہ ایک اور قربانی کریں ۔ اور نبی اکرم صلی اللہ علیہ وسلم سے پہلے کو ئی شخص قربانی نہ کرے ۔",
                "urduNarrator": "اور ہم سے محمد بن حاتم نے بیان کیا، کہا ہم سے محمد بن بکر نے بیان کیا، کہا ہم سے ابن جریج نے بیان کیا، انہوں نے کہا : ابو زبیر نے حضرت جابر بن عبد اللہ رضی اللہ عنہ کو کہتے ہوئے سنا کہ",
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ صَلَّى بِنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ النَّحْرِ بِالْمَدِينَةِ فَتَقَدَّمَ رِجَالٌ فَنَحَرُوا وَظَنُّوا أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ نَحَرَ فَأَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَانَ نَحَرَ قَبْلَهُ أَنْ يُعِيدَ بِنَحْرٍ آخَرَ وَلَا يَنْحَرُوا حَتَّى يَنْحَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "36",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 136,
                    "chapterNumber": "36",
                    "chapterEnglish": "The Book of Sacrifices",
                    "chapterUrdu": "قربانی کے احکام و مسائل",
                    "chapterArabic": "كتاب الْأَضَاحِيِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12647,
                "hadithNumber": "5084",
                "englishNarrator": "Uqba bin 'Amir رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) gave the gifts of goats to be distributed amongst his Companions. They sacrificed them, but a lamb of one year of age was left. (Someone) made a mention of that to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), whereupon he said: You sacrifice it",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے انھیں کچھ بکریاں عطا کیں کہ وہ ان کو آپ صلی اللہ علیہ وسلم کے ساتھیوں میں قربانی کے لیے تقسیم کر دیں ۔ آخر میں بکری کا ایک سالہ بچہ رہ گیا انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے اس کا ذکر کیا تو آپ نے فرما یا : \" اس کی قربانی تم کر لو ۔ قتیبہ نے ( اصحابه کے بجا ئے ) علي صحابته آپ کے صحابہ میں ( تقسیم کردیں ۔ ) \" کے الفاظ کہے ۔",
                "urduNarrator": "قتیبہ بن سعید اور محمد بن رمح نے لیث سے انھوں نے یزید بن ابی حبیب سے انھوں نے ابو خیر سے انھوں نے حضرت عقبہ بن عامر رضی اللہ عنہ سے روایت کی",
                "hadithArabic": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِى حَبِيبٍ عَنْ أَبِي الْخَيْرِ عَنْ عُقْبَةَ بْنِ عَامِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْطَاهُ غَنَمًا يَقْسِمُهَا عَلَى أَصْحَابِهِ ضَحَايَا فَبَقِيَ عَتُودٌ فَذَكَرَهُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ ضَحِّ بِهِ أَنْتَ قَالَ قُتَيْبَةُ عَلَى صَحَابَتِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "36",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 136,
                    "chapterNumber": "36",
                    "chapterEnglish": "The Book of Sacrifices",
                    "chapterUrdu": "قربانی کے احکام و مسائل",
                    "chapterArabic": "كتاب الْأَضَاحِيِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12648,
                "hadithNumber": "5085",
                "englishNarrator": "Amir al-Juhani رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) distributed sacrificial animals (amongst us for sacrificing them on 'Id al-Adha). So we sacrificed them. There fell to my lot a lamb of less than one year I said: Allah's Messenger, there has fallen to my lot a lamb (Jadha'a), whereupon he said: Sacrifice that.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ہمارے درمیان قربانی کے کچھ جا نور بانٹے تو مجھے ایک سالہ بھیڑ یا بکری ملی ۔ میں نے عرض کی : اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! میرے حصے میں ایک سالہ بھیڑ یا بکری آئی ہے آپ نے فرما یا : \" اسی کی قربانی کردو ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے یزید بن ہارون نے بیان کیا, ہشام دستوائی یحییٰ بن ابی کیثر سے انھوں نے بعجہ جہنی سے انھوں نے حضرت عقبہ بن عامر رضی اللہ عنہ جہنی رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ عَنْ هِشَامٍ الدَّسْتَوَائِيِّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ بَعْجَةَ الْجُهَنِيِّ عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ قَالَ قَسَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِينَا ضَحَايَا فَأَصَابَنِي جَذَعٌ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّهُ أَصَابَنِي جَذَعٌ فَقَالَ ضَحِّ بِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "36",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 136,
                    "chapterNumber": "36",
                    "chapterEnglish": "The Book of Sacrifices",
                    "chapterUrdu": "قربانی کے احکام و مسائل",
                    "chapterArabic": "كتاب الْأَضَاحِيِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12649,
                "hadithNumber": "5086",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been transmitted on the authority of 'Uqba bin 'Amir al-Juhan رضی اللہ تعالیٰ عنہ with a slight change of wording.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے اپنے ساتھیوں میں قربانی کے جا نور تقسیم کیے ۔ اسی ( سابقہ ) حدیث کے ہم معنی ۔",
                "urduNarrator": "مجھ سے عبداللہ بن عبدالرحمٰن دارمی نے بیان کیا، کہا ہم سے یحییٰ نے بیان کیا، یعنی ابن حسن نے, معاویہ بن سلام نے کہا : مجھے یحییٰ بن ابی کثیر نے حدیث بیان کی ، کہا مجھے بعجہ بن عبد اللہ نے بتا یا کہ حضرت عقبہ بن عامر رضی اللہ تعالیٰ عنہ نے انھیں خبر دی کہ",
                "hadithArabic": "و حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ حَدَّثَنَا يَحْيَى يَعْنِي ابْنَ حَسَّانَ أَخْبَرَنَا مُعَاوِيَةُ وَهُوَ ابْنُ سَلَّامٍ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ أَخْبَرَنِي بَعْجَةُ بْنُ عَبْدِ اللَّهِ أَنَّ عُقْبَةَ بْنَ عَامِرٍ الْجُهَنِيَّ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَسَمَ ضَحَايَا بَيْنَ أَصْحَابِهِ بِمِثْلِ مَعْنَاهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "36",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 136,
                    "chapterNumber": "36",
                    "chapterEnglish": "The Book of Sacrifices",
                    "chapterUrdu": "قربانی کے احکام و مسائل",
                    "chapterArabic": "كتاب الْأَضَاحِيِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12650,
                "hadithNumber": "5087",
                "englishNarrator": "Anas رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sacrificed with his own hands two horned rams which were white with black markings reciting the name of Allah and glorifying Him (saying Allah-o-Akbar). He placed his foot on their sides (while sacrificing).",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے دو سفید رنگ کے بڑے سینگوں والے مینڈھوں کی قربانی دی ۔ آپ نے انھیں اپنے ہا تھ سے ذبح کیا بسم اللہ پڑھی اور تکبیر کہی ۔ آپ نے ( قربانی کے وقت انھیں لٹا کر ) ان کے رخسار پر اپنا قدم مبارک رکھا ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, ابو عوانہ نے قتادہ سے انھوں نے حضرت انس رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَ ضَحَّى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِكَبْشَيْنِ أَمْلَحَيْنِ أَقْرَنَيْنِ ذَبَحَهُمَا بِيَدِهِ وَسَمَّى وَكَبَّرَ وَوَضَعَ رِجْلَهُ عَلَى صِفَاحِهِمَا.",
                "headingArabic": "اسْتِحْبَابِ الضَّحِيَّةِ وَذَبْحِهَا مُبَاشَرَةً بِلاَ تَوْكِيلٍ وَالتَّسْمِيَةِ وَالتَّكْبِيرِ ‏‏",
                "headingUrdu": "قربانی کے لیے اچھا جانور چننا اور اسے خود ذبح کرنا مستحب ہے، اسے کسی اور کے سپرد نہ کرنا، اور اللہ کا نام لینا اور تکبیر کہنا۔",
                "headingEnglish": "It is recommended to select a good animal for the sacrifice and to slaughter it oneself, not delegating it to anyone else, and to say the name of Allah, and to say the Takbir",
                "chapterId": "36",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 136,
                    "chapterNumber": "36",
                    "chapterEnglish": "The Book of Sacrifices",
                    "chapterUrdu": "قربانی کے احکام و مسائل",
                    "chapterArabic": "كتاب الْأَضَاحِيِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12651,
                "hadithNumber": "5088",
                "englishNarrator": "Anas رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sacrificed two horned rams of white color with black markings over them. He also stated: I saw him sacrificing them with his own hand and saw him placing his foot on their sides, and recited the name of Allah and Glorified Him.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے دو خوبصورت سفید رنگ کے بڑے سینگوں والے مینڈھوں کی قربانی دی ۔ کہا : میں نے دیکھا کہ آپ انھیں اپنے ہاتھوں سے ذبح کر رہے تھے ۔ اور میں نے دیکھا آپ نے ان کے رخسار پر قدم رکھا ہوا تھا ( اور ) کہا : آپ نے اللہ کا نام لیا ( بسم اللہ پڑھی ) اور تکبیر کہی ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا, وکیع نے شعبہ سے ، انھوں نے قتادہ سے انھوں نے حضرت انس رضی اللہ عنہ سے روایت کی : کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا وَكِيعٌ عَنْ شُعْبَةَ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَ ضَحَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِكَبْشَيْنِ أَمْلَحَيْنِ أَقْرَنَيْنِ قَالَ وَرَأَيْتُهُ يَذْبَحُهُمَا بِيَدِهِ وَرَأَيْتُهُ وَاضِعًا قَدَمَهُ عَلَى صِفَاحِهِمَا قَالَ وَسَمَّى وَكَبَّرَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "36",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 136,
                    "chapterNumber": "36",
                    "chapterEnglish": "The Book of Sacrifices",
                    "chapterUrdu": "قربانی کے احکام و مسائل",
                    "chapterArabic": "كتاب الْأَضَاحِيِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12652,
                "hadithNumber": "5089",
                "englishNarrator": "Shu'ba reported: Qatada informed me that he had heard Anas رضی اللہ عنہ saying:",
                "hadithEnglish": "Allah's Messenger (may peace be npon him) sacrificed (the horned rams) and like that. I said: Did you (Qatada) hear from Anas رضی اللہ عنہ ? He said. Yes.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے قربانی دی اس ( پچھلی حدیث ) کے مانند ۔ ( شعبہ نے ) کہا : میں نے قتادہ سے پو چھا : کیا آپ نے ( خود ) حضرت انس رضی اللہ عنہ سے سنا تھا ؟ کہا : ہاں ۔",
                "urduNarrator": "ہم سے یحییٰ بن حبیب نے بیان کیا, خالد بن حارث نے کہا : ہمیں شعبہ نے حدیث بیان کی , کہا : مجھے قتادہ نے بتا یا کہا , میں نے حضرت انس رضی اللہ عنہ سے سنا کہہ رہے تھے",
                "hadithArabic": "و حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ حَدَّثَنَا شُعْبَةُ أَخْبَرَنِي قَتَادَةُ قَالَ سَمِعْتُ أَنَسًا يَقُولُ ضَحَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ قَالَ قُلْتُ آنْتَ سَمِعْتَهُ مِنْ أَنَسٍ قَالَ نَعَمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "36",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 136,
                    "chapterNumber": "36",
                    "chapterEnglish": "The Book of Sacrifices",
                    "chapterUrdu": "قربانی کے احکام و مسائل",
                    "chapterArabic": "كتاب الْأَضَاحِيِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12653,
                "hadithNumber": "5090",
                "englishNarrator": "A similar report (as no. 5088) was narrated from Anas from the prophet ﷺ, except that he said: \"And he ﷺ said:",
                "hadithEnglish": "'Bismillah, Allahhu-Akbar (in the name of Allah, Allah is most Great).",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم بسم اللہ واللہ اکبرکہہ رہے تھے ۔",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا، کہا ہم سے ابن ابی عدی نے بیان کیا، ان کی سند سے, سعید نے قتادہ سے ، انھوں نے حضرت انس رضی اللہ عنہ سے ، انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے اس حدیث کے مانند روایت کی مگر انھوں نے یہ کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ أَنَسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ وَيَقُولُ بِاسْمِ اللَّهِ وَاللَّهُ أَكْبَرُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "36",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 136,
                    "chapterNumber": "36",
                    "chapterEnglish": "The Book of Sacrifices",
                    "chapterUrdu": "قربانی کے احکام و مسائل",
                    "chapterArabic": "كتاب الْأَضَاحِيِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12654,
                "hadithNumber": "5091",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) commanded that a ram with black legs, black belly and black (circles) round the eyes should be brought to him, so that he should sacrifice it. He said to 'A'isha: Give me the large knife, and then said: Sharpen it on a stone. She did that. He then took it (the knife) and then the ram; he placed it on the ground and then sacrificed it, saying: Bismillah, Allah-humma Taqabbal min Muhammadin wa Al-i-Muhammadin, wa min Ummati Muhammadin (In the name of Allah, O Allah, accept [this sacrifice] on behalf of Muhammad and the family of Muhammad and the Umma of Muhammad ).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ایک سینگوں والا مینڈھا لانے کا حکم دیا جو سیاہی میں چلتا ہو ، سیاہی میں بیٹھتا ہو اور سیاہی میں دیکھتا ہو ( یعنی پاؤں ، پیٹ اور آنکھیں سیاہ ہوں ) ۔ پھر ایک ایسا مینڈھا قربانی کے لئے لایا گیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اے عائشہ! چھری لا ۔ پھر فرمایا کہ اس کو پتھر سے تیز کر لے ۔ میں نے تیز کر دی ۔ پھر آپ صلی اللہ علیہ وسلم نے چھری لی ، مینڈھے کو پکڑا ، اس کو لٹایا ، پھر ذبح کرتے وقت فرمایا کہ بسم اللہ ، اے اللہ! محمد ( صلی اللہ علیہ وسلم ) کی طرف سے اور محمد ( صلی اللہ علیہ وسلم ) کی آل کی طرف سے اور محمد ( صلی اللہ علیہ وسلم ) کی امت کی طرف سے اس کو قبول کر ، پھر اس کی قربانی کی ۔",
                "urduNarrator": "ہم سے ہارون بن معروف نے بیان کیا، کہا ہم سے عبداللہ بن وہب نے بیان کیا، کہا کہ حیوا نے بیان کیا، کہا ہم سے ہارون بن معروف نے بیان کیا، عروہ بن زبیر سے, عروہ بن زبیر نے حضرت عائشہ رضی اللہ عنہا سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ قَالَ قَالَ حَيْوَةُ أَخْبَرَنِي أَبُو صَخْرٍ عَنْ يَزِيدَ بْنِ قُسَيْطٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِكَبْشٍ أَقْرَنَ يَطَأُ فِي سَوَادٍ وَيَبْرُكُ فِي سَوَادٍ وَيَنْظُرُ فِي سَوَادٍ فَأُتِيَ بِهِ لِيُضَحِّيَ بِهِ فَقَالَ لَهَا يَا عَائِشَةُ هَلُمِّي الْمُدْيَةَ ثُمَّ قَالَ اشْحَذِيهَا بِحَجَرٍ فَفَعَلَتْ ثُمَّ أَخَذَهَا وَأَخَذَ الْكَبْشَ فَأَضْجَعَهُ ثُمَّ ذَبَحَهُ ثُمَّ قَالَ بِاسْمِ اللَّهِ اللَّهُمَّ تَقَبَّلْ مِنْ مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَمِنْ أُمَّةِ مُحَمَّدٍ ثُمَّ ضَحَّى بِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "36",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 136,
                    "chapterNumber": "36",
                    "chapterEnglish": "The Book of Sacrifices",
                    "chapterUrdu": "قربانی کے احکام و مسائل",
                    "chapterArabic": "كتاب الْأَضَاحِيِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12655,
                "hadithNumber": "5092",
                "englishNarrator": "Rafi' bin Khadij رضی اللہ عنہ reported:",
                "hadithEnglish": "\"I said: 'O Allah's Messenger, we are going to encounter the enemy tomorrow, but we have no knives with us. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Make haste or be careful (in making arrangements for procuring knives) which would let the blood flow (and along with it) the name of Allah is also to be recited. Then eat, but not the tooth or nail. And I am going to tell you why it is not permissible to slaughter the animal with the help of tooth and bone; and as for the nail. it is a bone, and the bone is the knife of Abyssinians. He (the narrator) said: There fell to our lot as spoils of war camels and goats, and one of the camels among them became wild. A person (amongst usl struck It with an arrow which brought it under control. whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: This camel became wild like wild animals, so if you find any animal getting wild, you do the same with that.",
                "hadithUrdu": "میں نے کہا کہ یا رسول اللہ صلی اللہ علیہ وسلم ! ہم کل دشمن سے لڑنے والے ہیں اور ہمارے پاس چھریاں نہیں ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ جلدی کر یا ہوشیاری کر جو خون بہا دے اور اللہ کا نام لیا جائے اس کو کھا لے ، سوا دانت اور ناخن کے ۔ اور میں تجھ سے کہوں گا اس کی وجہ یہ ہے کہ دانت ہڈی ہے اور ناخن حبشیوں کی چھریاں ہیں ۔ راوی نے کہا کہ ہمیں مال غنیمت میں اونٹ اور بکریاں ملیں ، پھر ان میں سے ایک اونٹ بگڑ گیا ، ایک شخص نے اس کو تیر سے مارا تو وہ ٹھہر گیا ۔ تب رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ان اونٹوں میں بھی بعض بگڑ جاتے ہیں اور بھاگ نکلتے ہیں جیسے جنگلی جانور بھاگتے ہیں ۔ پھر جب کوئی جانور ایسا ہو جائے تو اس کے ساتھ یہی کرو ۔ ( یعنی دور سے تیر سے نشانہ کرو ) ۔",
                "urduNarrator": "یحییٰ بن سعید نے سفیان ( بن سعید ) سے رویت کی ، کہا مجھے میرے والد ( سعید بن مسروق ) نے عبایہ بن رفاعہ بن رافع بن خدیج سے حدیث بیان کی ، انھوں نے حضرت رافع بن خدیج رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى الْعَنَزِيُّ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ سُفْيَانَ حَدَّثَنِي أَبِي عَنْ عَبَايَةَ بْنِ رِفَاعَةَ بْنِ رَافِعِ بْنِ خَدِيجٍ عَنْ رَافِعِ بْنِ خَدِيجٍ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّا لَاقُو الْعَدُوِّ غَدًا وَلَيْسَتْ مَعَنَا مُدًى قَالَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْجِلْ أَوْ أَرْنِي مَا أَنْهَرَ الدَّمَ وَذُكِرَ اسْمُ اللَّهِ فَكُلْ لَيْسَ السِّنَّ وَالظُّفُرَ وَسَأُحَدِّثُكَ أَمَّا السِّنُّ فَعَظْمٌ وَأَمَّا الظُّفُرُ فَمُدَى الْحَبَشَةِ قَالَ وَأَصَبْنَا نَهْبَ إِبِلٍ وَغَنَمٍ فَنَدَّ مِنْهَا بَعِيرٌ فَرَمَاهُ رَجُلٌ بِسَهْمٍ فَحَبَسَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ لِهَذِهِ الْإِبِلِ أَوَابِدَ كَأَوَابِدِ الْوَحْشِ فَإِذَا غَلَبَكُمْ مِنْهَا شَيْءٌ فَاصْنَعُوا بِهِ هَكَذَا.",
                "headingArabic": "جَوَازِ الذَّبْحِ بِكُلِّ مَا أَنْهَرَ الدَّمَ إِلاَّ السِّنَّ وَالظُّفُرَ وَسَائِرَ الْعِظَامِ ‏‏",
                "headingUrdu": "دانتوں اور ہڈیوں کے علاوہ خون بہانے والی ہر چیز سے ذبح کرنے کی اجازت",
                "headingEnglish": "The permissibility of slaughtering with anything that makes the blood flow, except teeth and other bones",
                "chapterId": "36",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 136,
                    "chapterNumber": "36",
                    "chapterEnglish": "The Book of Sacrifices",
                    "chapterUrdu": "قربانی کے احکام و مسائل",
                    "chapterArabic": "كتاب الْأَضَاحِيِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12656,
                "hadithNumber": "5093",
                "englishNarrator": "Rafi' bin Khadij رضی اللہ عنہ reported:",
                "hadithEnglish": "While we were with Allah's Messenger (may peace he upon him) in Dhu'I-Hulaifa in Tihama, we got hold of goats and camels. Some persons (amongst us) made haste and boiled (the flesh of goats and camels) in their earthen pots. He then commanded and these were turned over; then he equalized ten goats for a camel. The rest of the hadith is the same.",
                "hadithUrdu": "ہم تہامہ کے مقام ذوالحلیفہ میں رسول اللہ صلی اللہ علیہ وسلم کے ہمراہ تھے ۔ تو ہمیں ( غنیمت میں ) بکریاں اور اونٹ حاصل ہوئے تو لوگوں نے جلد بازی کی اور ( ان میں سے کچھ جانوروں کو ذبح کیا ، ان کا گوشت کاٹا اور ) ہانڈیاں چڑھادیں ۔ رسول اللہ صلی اللہ علیہ وسلم ( تشریف لائے تو آپ صلی اللہ علیہ وسلم ) نے حکم دیا اور ان ہانڈیوں کو الٹ دیا گیا ۔ پھر آپ نے ( سب کے حصے تقسیم کرنے کے لیے ) دس بکریوں کو ایک اونٹ کے مساوی قرار دیا ۔ اس کے بعد یحییٰ بن سعید کی حدیث کی طرح حدیث بیان کی ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا, وکیع نے کہا , ہمیں سفیان بن سعید بن مسروق نے اپنے والد سے حدیث سنائی ، انھوں نے عبایہ بن رفاعہ بن رافع بن خدیج سے ، انھوں نے حضرت رافع بن خدیج رضی اللہ عنہ سے ر وایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ بْنُ سَعِيدِ بْنِ مَسْرُوقٍ عَنْ أَبِيهِ عَنْ عَبَايَةَ بْنِ رِفَاعَةَ بْنِ رَافِعِ بْنِ خَدِيجٍ عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِذِي الْحُلَيْفَةِ مِنْ تِهَامَةَ فَأَصَبْنَا غَنَمًا وَإِبِلًا فَعَجِلَ الْقَوْمُ فَأَغْلَوْا بِهَا الْقُدُورَ فَأَمَرَ بِهَا فَكُفِئَتْ ثُمَّ عَدَلَ عَشْرًا مِنْ الْغَنَمِ بِجَزُورٍ وَذَكَرَ بَاقِيَ الْحَدِيثِ كَنَحْوِ حَدِيثِ يَحْيَى بْنِ سَعِيدٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "36",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 136,
                    "chapterNumber": "36",
                    "chapterEnglish": "The Book of Sacrifices",
                    "chapterUrdu": "قربانی کے احکام و مسائل",
                    "chapterArabic": "كتاب الْأَضَاحِيِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12657,
                "hadithNumber": "5094",
                "englishNarrator": "Rafi' bin Khadij رضی اللہ عنہ reported from his grandfather:",
                "hadithEnglish": "He said: Allah's Messenger ﷺ, we are going to encounter the enemy tomorrow, but we do not have long knives with us, should we then slaughter them with the peel of the reed? The rest of the hadith is the same. (And at the end the words are): A camel became wild (and got out of our control). We attacked it with arrows until we made it fall down.",
                "hadithUrdu": "ہم نے عرض کی ، اللہ کے رسول اللہ صلی اللہ علیہ وسلم !کل ہم دشمن کا سامنا کریں گے اور ہمارے پاس چھریاں نہیں ہیں ، کیا ہم بانس کے چھلکے ( یا تیز دھار کھپچی ) سے ذبح کر سکتے ہیں ؟اور سارے واقعے سمیت حدیث بیان کی اور کہا : ایک اونٹ ہم سے بدک کر بھا گ نکلا تو ہم نے اس پر تیر چلا ئے یہاں تک کہ اس کو گرا لیا ۔",
                "urduNarrator": "ہم سے ابن ابی عمر نے بیان کیا، ہم سے سفیان نے بیان کیا,  اسماعیل بن مسلم اور عمربن سعید نے سعید بن مسروق سے ، انھوں نے عبایہ بن رفاعہ بن رافع بن خدیج سے ، انھوں نے اپنے دادا حضرت رافع بن خدیج رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ إِسْمَعِيلَ بْنِ مُسْلِمٍ عَنْ سَعِيدِ بْنِ مَسْرُوقٍ عَنْ عَبَايَةَ عَنْ جَدِّهِ رَافِعٍ ثُمَّ حَدَّثَنِيهِ عُمَرُ بْنُ سَعِيدِ بْنِ مَسْرُوقٍ عَنْ أَبِيهِ عَنْ عَبَايَةَ بْنِ رِفَاعَةَ بْنِ رَافِعِ بْنِ خَدِيجٍ عَنْ جَدِّهِ قَالَ قُلْنَا يَا رَسُولَ اللَّهِ إِنَّا لَاقُو الْعَدُوِّ غَدًا وَلَيْسَ مَعَنَا مُدًى فَنُذَكِّي بِاللِّيطِ وَذَكَرَ الْحَدِيثَ بِقِصَّتِهِ وَقَالَ فَنَدَّ عَلَيْنَا بَعِيرٌ مِنْهَا فَرَمَيْنَاهُ بِالنَّبْلِ حَتَّى وَهَصْنَاهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "36",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 136,
                    "chapterNumber": "36",
                    "chapterEnglish": "The Book of Sacrifices",
                    "chapterUrdu": "قربانی کے احکام و مسائل",
                    "chapterArabic": "كتاب الْأَضَاحِيِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12658,
                "hadithNumber": "5095",
                "englishNarrator": "It was narrated from Saeed bin Masruq with this chain of narrators, the same hadith(as no. 5094) until the end. And he said in it:",
                "hadithEnglish": "\"We do not have any knives with us, so can we slaughter with reeds?",
                "hadithUrdu": "ہمارے پاس چھریاں نہیں ہیں تو کیا ہم بانسوں ( کی کچھیوں ) سے جانور ذبح کرلیں ۔",
                "urduNarrator": "مجھ سے القاسم بن زکریا نے بیان کیا، ہم سے حسین بن علی نے بیان کیا, زائدہ نے سعید بن مسروق سے اسی سند کے ساتھ یہ حدیث آخر تک پوری بیان کی اور اس میں کہا ( ہم نے عرض کی : )",
                "hadithArabic": "و حَدَّثَنِيهِ الْقَاسِمُ بْنُ زَكَرِيَّاءَ حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ عَنْ زَائِدَةَ عَنْ سَعِيدِ بْنِ مَسْرُوقٍ بِهَذَا الْإِسْنَادِ الْحَدِيثَ إِلَى آخِرِهِ بِتَمَامِهِ وَقَالَ فِيهِ وَلَيْسَتْ مَعَنَا مُدًى أَفَنَذْبَحُ بِالْقَصَبِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "36",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 136,
                    "chapterNumber": "36",
                    "chapterEnglish": "The Book of Sacrifices",
                    "chapterUrdu": "قربانی کے احکام و مسائل",
                    "chapterArabic": "كتاب الْأَضَاحِيِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12659,
                "hadithNumber": "5096",
                "englishNarrator": "Rafi' bin Khadij رضی اللہ عنہ reported:",
                "hadithEnglish": "He said: Allah's Messenger, we are going to encounter the enemy tomorrow. and we do not have large knives with us. The rest of the hadith is the same, but no mention is made of this: The people hastened and they boiled (flesh) in the earthen pots. He (the Holy Prophet), commanded and these were turned over and the narrator narrated the whole event.",
                "hadithUrdu": "انھوں نے کہا ( ہم نے عرض کی : ) اللہ کے رسول اللہ صلی اللہ علیہ وسلم !کل ہم دشمن سے مقابلہ کرنے والے ہیں اور ہمارے پاس چھریاں نہیں ہیں پھر حدیث بیان کی ، البتہ اس میں یہ نہیں کہا : \" لوگوں نے جلدبازی کی اور ان کے گو شت سے ہانڈیا ں ابالنے لگے آپ صلی اللہ علیہ وسلم نے ان کے بارے میں حکم دیا تو انھیں الٹ دیا گیا ۔ اور انھوں نے باقی سارا قصہ بیان کیا ۔",
                "urduNarrator": "ہم سے محمد بن ولید بن عبد الحمید نے بیان کیا، ہم سے محمد بن جعفر نے بیان کیا، ہم سے شعبہ نے بیان کیا، سعید بن مسروق نے عبایہ بن عبایہ کی سند سے۔ رفاعہ بن رافع رضی اللہ عنہ رافع بن خدیج رضی اللہ عنہ سے روایت کرتے ہیں کہ",
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْوَلِيدِ بْنِ عَبْدِ الْحَمِيدِ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ سَعِيدِ بْنِ مَسْرُوقٍ عَنْ عَبَايَةَ بْنِ رِفَاعَةَ بْنِ رَافِعٍ عَنْ رَافِعِ بْنِ خَدِيجٍ أَنَّهُ قَالَ يَا رَسُولَ اللَّهِ إِنَّا لَاقُو الْعَدُوِّ غَدًا وَلَيْسَ مَعَنَا مُدًى وَسَاقَ الْحَدِيثَ وَلَمْ يَذْكُرْ فَعَجِلَ الْقَوْمُ فَأَغْلَوْا بِهَا الْقُدُورَ فَأَمَرَ بِهَا فَكُفِئَتْ وَذَكَرَ سَائِرَ الْقِصَّةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "36",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 136,
                    "chapterNumber": "36",
                    "chapterEnglish": "The Book of Sacrifices",
                    "chapterUrdu": "قربانی کے احکام و مسائل",
                    "chapterArabic": "كتاب الْأَضَاحِيِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12660,
                "hadithNumber": "5097",
                "englishNarrator": "Abu Ubaid reported:",
                "hadithEnglish": "I was with 'Ali bin Abi Talib رضی اللہ عنہ on the occasion of the 'Id day. He started with the 'Id prayer before delivering the sermon, and said: Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) forbade us to eat the flesh of our sacrificial animals beyond three days.",
                "hadithUrdu": "میں عید کے مو قع پر حضرت علی بن ابی طا لب رضی اللہ عنہ کے ساتھ انھوں نے خطبے سے پہلے نماز پڑھا ئی اور کہا : رسول اللہ صلی اللہ علیہ وسلم نمے اس بات سے منع فر مایا تھا کہ ہم تین دن ( گزرجانے ) کے بعد اپنی قربانیوں کا گوشت کھا ئیں ۔",
                "urduNarrator": "مجھ سے عبدالجبار بن علاء نے بیان کیا, سفیان نے کہا ,  ہمیں زہری نے ابو عبید سے روایت کی کہا",
                "hadithArabic": "حَدَّثَنِي عَبْدُ الْجَبَّارِ بْنُ الْعَلَاءِ حَدَّثَنَا سُفْيَانُ حَدَّثَنَا الزُّهْرِيُّ عَنْ أَبِي عُبَيْدٍ قَالَ شَهِدْتُ الْعِيدَ مَعَ عَلِيِّ بْنِ أَبِي طَالِبٍ فَبَدَأَ بِالصَّلَاةِ قَبْلَ الْخُطْبَةِ وَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَانَا أَنْ نَأْكُلَ مِنْ لُحُومِ نُسُكِنَا بَعْدَ ثَلَاثٍ.",
                "headingArabic": "بَيَانِ مَا كَانَ مِنَ النَّهْىِ عَنْ أَكْلِ لُحُومِ الأَضَاحِيِّ بَعْدَ ثَلاَثٍ فِي أَوَّلِ الإِسْلاَمِ وَبَيَانِ نَسْخِهِ وَإِبَاحَتِهِ إِلَى مَتَى شَاءَ",
                "headingUrdu": "قربانی کا گوشت تین دن سے زیادہ کھانے کی ممانعت جو اسلام کے شروع میں لاگو تھی لیکن پھر اسے منسوخ کر دیا گیا اور اب جب تک چاہے کھانا جائز ہے۔",
                "headingEnglish": "The prohibition of eating sacrificial meat for more than three days, which applied at the beginning of Islam but was then abrogated, and now it is permissible to eat it as long as one wants.",
                "chapterId": "36",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 136,
                    "chapterNumber": "36",
                    "chapterEnglish": "The Book of Sacrifices",
                    "chapterUrdu": "قربانی کے احکام و مسائل",
                    "chapterArabic": "كتاب الْأَضَاحِيِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12661,
                "hadithNumber": "5098",
                "englishNarrator": "Abu 'Ubaid, the freed slave of Ibn Azhar, reported:",
                "hadithEnglish": "He said 'Id (prayer) with Umar bin al-Khattab رضی اللہ عنہ , and then said the 'Id (prayer) with 'Ali bin Abu Talib رضی اللہ عنہ . He (the narrator further) reported: He led us in prayer before delivering the sermon and then addressed the people saying: Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) has forbidden you to eat the flesh of your sacrificial animals beyond three nights, so do not eat that.",
                "hadithUrdu": "انھوں نے حضرت عمر بن خطا ب رضی اللہ عنہ کے ساتھ عید پڑھی کہا : اس کے بعد میں نے حضرت علی رضی اللہ عنہ نے خطبے سے پہلے ہمیں نماز پڑھائی پھر لو گوں کو خطبہ دیا اور فر ما یا کہ رسول اللہ صلی اللہ علیہ وسلم نے تم کو تین راتوں سے زیادہ اپنی قربانی کا گوشت کھانے سے منع فر ما یا ہے اس لیے ( تین راتوں کے بعد یہ گو شت ) نہ کھا ؤ ۔ ان تین دنوں میں کھا کر اور تقسیم کر کے ختم کر دو ۔ )",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا, یو نس نے ابن شہاب سے روایت کی ، کہا : مجھے ابن ازہر کے مو لیٰ ابو عبید نے حدیث بیان کی کہ",
                "hadithArabic": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ حَدَّثَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ حَدَّثَنِي أَبُو عُبَيْدٍ مَوْلَى ابْنِ أَزْهَرَ أَنَّهُ شَهِدَ الْعِيدَ مَعَ عُمَرَ بْنِ الْخَطَّابِ قَالَ ثُمَّ صَلَّيْتُ مَعَ عَلِيِّ بْنِ أَبِي طَالِبٍ قَالَ فَصَلَّى لَنَا قَبْلَ الْخُطْبَةِ ثُمَّ خَطَبَ النَّاسَ فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ نَهَاكُمْ أَنْ تَأْكُلُوا لُحُومَ نُسُكِكُمْ فَوْقَ ثَلَاثِ لَيَالٍ فَلَا تَأْكُلُوا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "36",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 136,
                    "chapterNumber": "36",
                    "chapterEnglish": "The Book of Sacrifices",
                    "chapterUrdu": "قربانی کے احکام و مسائل",
                    "chapterArabic": "كتاب الْأَضَاحِيِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12662,
                "hadithNumber": "5099",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Zuhri with the same chain of transmitters.",
                "hadithUrdu": "مجھ سے زہیر بن حرب نے بیان کیا، ہم سے یعقوب بن ابراہیم نے بیان کیا،  ابن شہاب کے بھتیجے صالح اور معمر سب نے زہری سے اسی سند کے ساتھ اسی کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا ابْنُ أَخِي ابْنِ شِهَابٍ ح و حَدَّثَنَا حَسَنٌ الْحُلْوَانِيُّ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَبِي عَنْ صَالِحٍ ح و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ كُلُّهُمْ عَنْ الزُّهْرِيِّ بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "36",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 136,
                    "chapterNumber": "36",
                    "chapterEnglish": "The Book of Sacrifices",
                    "chapterUrdu": "قربانی کے احکام و مسائل",
                    "chapterArabic": "كتاب الْأَضَاحِيِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12663,
                "hadithNumber": "5100",
                "englishNarrator": "Ibn 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) having said: None of you should eat the flesh of his sacrificial animal beyond three days.",
                "hadithUrdu": "آپ نے فر ما یا : \" تم میں سے کو ئی شخص اپنی قربانی کے گو شت میں سے تین دن کے بعد ( کچھ ) نہ کھائے ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, لیث نے نافع سے ، انھوں نے حضرت ابن عمر رضی اللہ عنہ سے انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ ح و حَدَّثَنِي مُحَمَّدُ بْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ لَا يَأْكُلْ أَحَدٌ مِنْ لَحْمِ أُضْحِيَّتِهِ فَوْقَ ثَلَاثَةِ أَيَّامٍِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "36",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 136,
                    "chapterNumber": "36",
                    "chapterEnglish": "The Book of Sacrifices",
                    "chapterUrdu": "قربانی کے احکام و مسائل",
                    "chapterArabic": "كتاب الْأَضَاحِيِّ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 12351,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=494",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=492",
                "label": "492",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=493",
                "label": "493",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=494",
                "label": "494",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=495",
                "label": "495",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=496",
                "label": "496",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=497",
                "label": "497",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=498",
                "label": "498",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=496",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=496",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=494",
        "to": 12375,
        "total": 40465
    }
}