{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 487,
        "data": [
            {
                "id": 12439,
                "hadithNumber": "4876",
                "englishNarrator": "It has been narrated on the authority of Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: If some persons of my Umma (were not to undertake the hardships of Jihad), and he (Abu Huraira) then narrated the rest of the hadith and then said: A journey undertaken for jihad in the evening or morning merits a reward better than the world and all that is in it.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اگر میری حالت میں ایسے لوگ نہ ہوتے ۔ \" ( جو جہاد پر جانے کے لیے انتہائی ضروری سامان مہیا نہیں کر سکتے اور نہ میں ان کے لیے مہیا کر سکتا ہوں ) پھر آپ نے گفتگو فرمائی ، اس میں آپ نے فرمایا : \" اللہ کی راہ میں صبح کا ایک سفر کرنا یا شام کا ایک سفر کرنا دنیا و ما فہیا سے بہتر ہے ۔ \"",
                "urduNarrator": "ہم سے ابن ابی عمر نے بیان کیا، کہا ہم سے مروان بن معاویہ نے بیان کیا، انہوں نے یحییٰ بن سعید کی سند سے اور ابوصالح کی روایت سے, حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ ذَكْوَانَ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَوْلَا أَنَّ رِجَالًا مِنْ أُمَّتِي» وَسَاقَ الْحَدِيثَ، وَقَالَ فِيهِ: «وَلَرَوْحَةٌ فِي سَبِيلِ اللهِ، أَوْ غَدْوَةٌ خَيْرٌ مِنَ الدُّنْيَا وَمَا فِيهَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12440,
                "hadithNumber": "4877",
                "englishNarrator": "It has been narrated on the authority of Abu Ayyub رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: A journey undertaken in the morning or evening (for Jihad) in the way of Allah is better than (anything) on which the sun rises or sets.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ کی راہ میں ایک بار صبح کو یا شام کو نکلنا ( یا پہرہ دینا ) ان تمام چیزوں سے بہتر ہے جن پر سورج طلوع ہوتا ہے اور غروب ہوتا ہے ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، اسحاق بن ابراہیم اور زہیر بن حرب نے بیان کیا، اور یہ قول ابوبکر اور اسحاق نے کہا: اس نے ہمیں بتایا، اور باقی دو نے بتایا, عبداللہ بن یزید مقری نے سعید بن ابی ایوب سے روایت کی ، انہوں نے کہا : مجھے شرجیل بن شریک معافری نے ابوعبدالرحمٰن حُبلی سے حدیث بیان کی ، انہوں نے کہا : میں نے حضرت ابو ایوب رضی اللہ عنہ کو کہتے ہوئے سنا",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَاللَّفْظُ لِأَبِي بَكْرٍ، وَإِسْحَاقَ، قَالَ إِسْحَاقُ: أَخْبَرَنَا، وقَالَ الْآخَرَانِ: حَدَّثَنَا الْمُقْرِئُ عَبْدُ اللهِ بْنُ يَزِيدَ، عَنْ سَعِيدِ بْنِ أَبِي أَيُّوبَ، حَدَّثَنِي شُرَحْبِيلُ بْنُ شَرِيكٍ الْمَعَافِرِيُّ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِيِّ، قَالَ: سَمِعْتُ أَبَا أَيُّوبَ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «غَدْوَةٌ فِي سَبِيلِ اللهِ، أَوْ رَوْحَةٌ، خَيْرٌ مِمَّا طَلَعَتْ عَلَيْهِ الشَّمْسُ وَغَرَبَتْ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12441,
                "hadithNumber": "4878",
                "englishNarrator": null,
                "hadithEnglish": "Abu Ayyub رضی اللہ عنہ said: \"The Messenger of Allah ﷺ said...\" A similar report (as no. 4877).",
                "hadithUrdu": "مجھ سے محمد بن عبداللہ بن قحز اد نے بیان کیا، کہا ہم سے علی بن الحسن نے بیان کیا, عبداللہ بن مبارک نے روایت کی ، کہا : ہمیں سعید بن ابی ایوب اور حیوہ بن شریح نے بتایا ، دونوں میں سے ہر ایک نے کہا : مجھے شرجیل بن شریک نے ابو عبدالرحمٰن حبلی سے حدیث بیان کی کہ انہوں نے ابو ایوب انصاری رضی اللہ عنہ کو کہتے ہوئے سنا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : بالکل پچھلی روایت کے مانند ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ قُهْزَاذَ، حَدَّثَنَا عَلِيُّ بْنُ الْحَسَنِ، عَنْ عَبْدِ اللهِ بْنِ الْمُبَارَكِ، أَخْبَرَنَا سَعِيدُ بْنُ أَبِي أَيُّوبَ، وَحَيْوَةُ بْنُ شُرَيْحٍ، قَالَ كُلُّ وَاحِدٍ مِنْهُمَا: حَدَّثَنِي شُرَحْبِيلُ بْنُ شَرِيكٍ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِيِّ، أَنَّهُ سَمِعَ أَبَا أَيُّوبَ الْأَنْصَارِيَّ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: بِمِثْلِهِ سَوَاءً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12442,
                "hadithNumber": "4879",
                "englishNarrator": "It has been narrated on the authority of Abu Sa`id al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said (to him): Abu Sa`id, whoever cheerfully accepts Allah as his Lord, Islam as his religion and Muhammad as his Apostle is necessarily entitled to enter Paradise. He (Abu Sa`id رضی اللہ عنہ ) wondered at it and said: Messenger of Allah, repeat it for me. He (the Messenger of Allah ﷺ) did that and said: There is another act which elevates the position of a man in Paradise to a grade one hundred (higher), and the elevation between one grade and the other is equal to the height of the heaven from the earth. He (Abu Sa`id رضی اللہ عنہ ) said: What is that act? He replied: Jihad in the way of Allah! Jihad in the way of Allah!",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ابوسعید! جو شخص اللہ کے رب ہونے ، اسلام کے دین ہونے اور محمد صلی اللہ علیہ وسلم کے نبی ہونے پر ( دل کی گہرائیوں ) سے راضی ہو گیا ، اس کے لیے جنت واجب ہو گئی ۔ \" حضرت ابو سعید رضی اللہ عنہ کو یہ بات اچھی لگی تو کہنے لگے : اللہ کے رسول! یہی بات میرے سامنے دوبارہ ارشاد فرمائیں ، آپ نے ایسا ہی کیا ، اس کے بعد فرمایا : \" ایک بات اور بھی ہے جس کی وجہ سے بندے کو سو درجے رفعت بخشی جاتی ہے اور ہر دو درجوں میں زمین اور آسمان جتنا فاصلہ ہے ۔ \" کہا : ( میں نے عرض کی ) اللہ کے رسول! وہ ( بات ) کیا ہے؟ آپ نے فرمایا : \" اللہ کے راستے میں جہاد کرنا ، اللہ کے راستے میں جہاد کرنا ۔ \"",
                "urduNarrator": "ہم سے سعید بن منصور نے بیان کیا، کہا کہ ہم سے عبداللہ بن وہب نے بیان کیا، کہا کہ مجھ سے ابو ہانی الخولانی نے بیان کیا، وہ ابوعبدالرحمٰن ہبلی کی سند سے، انہوں نے ابوذر کی سند سے۔ سعید الخدری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا, حضرت ابو سعید خدری رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "دَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، حَدَّثَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، حَدَّثَنِي أَبُو هَانِئٍ الْخَوْلَانِيُّ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِيِّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «يَا أَبَا سَعِيدٍ، مَنْ رَضِيَ بِاللهِ رَبًّا، وَبِالْإِسْلَامِ دِينًا، وَبِمُحَمَّدٍ نَبِيًّا، وَجَبَتْ لَهُ الْجَنَّةُ»، فَعَجِبَ لَهَا أَبُو سَعِيدٍ، فَقَالَ: أَعِدْهَا عَلَيَّ يَا رَسُولَ اللهِ، فَفَعَلَ، ثُمَّ قَالَ: «وَأُخْرَى يُرْفَعُ بِهَا الْعَبْدُ مِائَةَ دَرَجَةٍ فِي الْجَنَّةِ، مَا بَيْنَ كُلِّ دَرَجَتَيْنِ كَمَا بَيْنَ السَّمَاءِ وَالْأَرْضِ»، قَالَ: وَمَا هِيَ يَا رَسُولَ اللهِ؟ قَالَ: «الْجِهَادُ فِي سَبِيلِ اللهِ، الْجِهَادُ فِي سَبِيلِ اللهِ».",
                "headingArabic": "بَيَانِ مَا أَعَدَّهُ اللَّهُ تَعَالَى لِلْمُجَاهِدِ فِي الْجَنَّةِ مِنَ الدَّرَجَاتِ ‏‏",
                "headingUrdu": "اللہ تعالیٰ نے جنت میں مجاہد کے لیے جو اعلیٰ عہدے تیار کیے ہیں۔",
                "headingEnglish": "The High Positions that Allah has prepared for the Mujahid in Paradise",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12443,
                "hadithNumber": "4880",
                "englishNarrator": "It has been narrated on the authority of Abu Qatada رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) stood up among them (his Companions) to deliver his sermon in which he told them that Jihad in the way of Allah and belief in Allah (with all His Attributes) are the most meritorious of acts. A man stood up and said: Messenger of Allah, do you think that if I am killed in the way of Allah, my sins will be blotted out from me? The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Yes, in case you are killed in the way of Allah and you were patient and sincere and you always fought facing the enemy, never turming your back upon him. Then he added: What have you said (now)? (Wishing to have further assurance from him for his satisfaction), he asked (again): Do you think if I am killed in the way of Allah, all my sins will be obliterated from me? The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Yes, it you were patient and sincere and always fought facing the enemy and never turning your back upon him, (all your lapses would be forgiven) except debt. Gabriel has told me this.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم صحابہ کرام میں ( خطبہ دینے کے لئے ) کھڑے ہوئے اور انہیں بتایا : \" اللہ کی راہ میں جہاد کرنا اور اللہ پر ایمان لانا ( باقی ) تمام اعمال سے افضل ہے ۔ \" ایک شخص کھڑا ہوا اور کہنے لگا : اللہ کے رسول! آپ کیا فرماتے ہیں؟ اگر میں اللہ کی راہ میں شہید کر دیا جاؤں تو کیا اس سے میرے گناہ مجھ سے دور ہٹا دئیے جائیں گے؟ رسول اللہ صلی اللہ علیہ وسلم نے اس سے فرمایا : \" ہاں ، اگر تم اللہ کی راہ میں اس حالت میں شہید کر دیے جاؤ کہ تم صبر کرنے والے ( ڈٹے ہوئے ) ہو ، صرف اللہ کی رضا چاہتے ہو ، آگے بڑح رہے ہو ، پیٹھ پھیر کر نہ بھاگ رہے ہو ۔ \" اس کے بعد رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم نے کس طرح کہا تھا؟ \" اس نے عرض کی ( میں نے اس طرح کہا تھا ) : آپ کیا فرماتے ہیں؟ اگر میں اللہ کی راہ میں شہید کیا جاؤں تو کیا میرے گناہ مجھ سے دور ہٹا دئیے جائیں گے ۔ \" آپ نے فرمایا : \" ہاں ، اگر تم اس حالت میں اللہ کی راہ میں شہید کر دیے جاؤ کہ صبر کرنے والے ( ڈٹے ہوئے ) ہو ، صرف اللہ کی رضا چاہتے ہو ، آگے بڑح رہے ہو ، پیٹھ پھیر کر بھاگنے والے نہیں ، ( تو سارے گناہ مٹا دیے جائیں گے ) سوائے قرض کے ۔ جبریل علیہ السلام نے ( ابھی آ کر ) مجھ سے یہ کہا ہے ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, لیث نے سعید بن ابی سعید ( مقبری ) سے ، انہوں نے عبداللہ بن ابی قتادہ سے ، انہوں نے ابوقتادہ رضی اللہ عنہ سے روایت کی کہ انہوں نے انہیں ( ابوقتادہ رضی اللہ عنہ کو ) نبی صلی اللہ علیہ وسلم سے حدیث بیان کرتے ہوئے سنا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ عَبْدِ اللهِ بْنِ أَبِي قَتَادَةَ، عَنْ أَبِي قَتَادَةَ، أَنَّهُ سَمِعَهُ، يُحَدِّثُ عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، أَنَّهُ قَامَ فِيهِمْ فَذَكَرَ لَهُمْ أَنَّ الْجِهَادَ فِي سَبِيلِ اللهِ، وَالْإِيمَانَ بِاللهِ أَفْضَلُ الْأَعْمَالِ، فَقَامَ رَجُلٌ، فَقَالَ: يَا رَسُولَ اللهِ، أَرَأَيْتَ إِنْ قُتِلْتُ فِي سَبِيلِ اللهِ، تُكَفَّرُ عَنِّي خَطَايَايَ؟ فَقَالَ لَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «نَعَمْ، إِنْ قُتِلْتَ فِي سَبِيلِ اللهِ، وَأَنْتَ صَابِرٌ مُحْتَسِبٌ، مُقْبِلٌ غَيْرُ مُدْبِرٍ»، ثُمَّ قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «كَيْفَ قُلْتَ؟» قَالَ: أَرَأَيْتَ إِنْ قُتِلْتُ فِي سَبِيلِ اللهِ أَتُكَفَّرُ عَنِّي خَطَايَايَ؟ فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «نَعَمْ، وَأَنْتَ صَابِرٌ مُحْتَسِبٌ، مُقْبِلٌ غَيْرُ مُدْبِرٍ، إِلَّا الدَّيْنَ، فَإِنَّ جِبْرِيلَ عَلَيْهِ السَّلَامُ قَالَ لِي ذَلِكَ».",
                "headingArabic": "مَنْ قُتِلَ فِي سَبِيلِ اللَّهِ كُفِّرَتْ خَطَايَاهُ إِلاَّ الدَّيْنَ",
                "headingUrdu": "اگر کوئی شخص اللہ کی راہ میں مارا جائے تو اس کے تمام گناہوں کا کفارہ ہو جاتا ہے سوائے قرض کے",
                "headingEnglish": "If a person is killed in the cause of Allah, all his sins will be expiated except debt",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12444,
                "hadithNumber": "4881",
                "englishNarrator": "The tradition has been narrated through a different chain of transmitters on the authority of Abu Qatada رضی اللہ عنہ who said:",
                "hadithEnglish": "A man came to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) while he was on the pulpit and said: Do you think if I am killed in the way of Allah... (except this difference in its beginning, the rest of the tradition is the same as the previous one).",
                "hadithUrdu": "ایک شخص رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور کہنے لگا : آپ کیا فرماتے ہیں؟ اگر میں اللہ کی راہ میں شہید کر دیا جاؤں ۔ ( آگے ) لیث کی حدیث کے ہم معنی ( حدیث بیان کی ۔ )",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور محمد بن المثنیٰ نے بیان کیا، کہا کہ ہم سے یزید بن ہارون نے بیان کیا، یحییٰ بن سعید نے سعید بن ابی سعید مقبری سے ، انہوں نے عبداللہ بن ابی قتادہ سے ، انہوں نے اپنے والد ( حضرت ابو قتادہ رضی اللہ عنہ ) سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالَا: حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا يَحْيَى يَعْنِي ابْنَ سَعِيدٍ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ عَبْدِ اللهِ بْنِ أَبِي قَتَادَةَ، عَنْ أَبِيهِ، قَالَ: جَاءَ رَجُلٌ إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: أَرَأَيْتَ إِنْ قُتِلْتُ فِي سَبِيلِ اللهِ؟ بِمَعْنَى حَدِيثِ اللَّيْثِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12445,
                "hadithNumber": "4882",
                "englishNarrator": "It was narrated that 'Abdullah bin Abi Qatadah, from his father:",
                "hadithEnglish": "A man came to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and he was sitting on the pulpit.... He said: What do you find if I strike with the sword? (The rest of the tradition is the same as the previous one.)",
                "hadithUrdu": "ایک شخص نبی صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا ، آپ منبر پر تھے ، اس نے کہا : آپ کیا فرماتے ہیں کہ اگر میں اپنی تلوار سے وار کروں؟ ( کافر کو قتل کروں ، پھر شہید کر دیا جاؤں ، آگے ) مقبری کی حدیث کے ہم معنی ( حدیث بیان کی ۔ )",
                "urduNarrator": "ہم سے سعید بن منصور نے بیان کیا، کہا ہم سے سفیان نے بیان کیا, عمرو بن دینار اور محمد بن عجلان نے محمد بن قیس سے روایت کی ، انہوں نے عبداللہ بن ابی قتادہ سے ، انہوں نے اپنے والد حضرت ابوقتادہ رضی اللہ عنہ سے ، انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی ، ان ( عمرو اور ابن عجلان ) میں سے ایک اپنے دوسرے ساتھی سے کچھ زیادہ بیان کرتا ہے کہ",
                "hadithArabic": "وحَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ مُحَمَّدِ بْنِ قَيْسٍ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ عَجْلَانَ، عَنْ مُحَمَّدِ بْنِ قَيْسٍ، عَنْ عَبْدِ اللهِ بْنِ أَبِي قَتَادَةَ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَزِيدُ أَحَدُهُمَا عَلَى صَاحِبِهِ أَنَّ رَجُلًا أَتَى النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَهُوَ عَلَى الْمِنْبَرِ، فَقَالَ: أَرَأَيْتَ إِنْ ضَرَبْتُ بِسَيْفِي؟ بِمَعْنَى حَدِيثِ الْمَقْبُرِيِّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12446,
                "hadithNumber": "4883",
                "englishNarrator": "It has been reported on the authority of 'Amr bin al-'As رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: All the sins of a Shahid (martyr) are forgiven except debt.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" شہید کا ہر گناہ معاف کر دیا جاتا ہے ، سوائے قرض کے ۔ \"",
                "urduNarrator": "ہم سے زکریا بن یحییٰ بن صالح المصری نے بیان کیا, مفضل بن فضالہ نے عباس قِتبانی کے بیٹے عیاس سے حدیث بیان کی ، انہوں نے عبداللہ بن یزید ابو عبدالرحمٰن حبلی سے ، انہوں نے حضرت عبداللہ بن عمرو بن عاص رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا زَكَرِيَّا بْنُ يَحْيَى بْنِ صَالِحٍ الْمِصْرِيُّ، حَدَّثَنَا الْمُفَضَّلُ يَعْنِي ابْنَ فَضَالَةَ، عَنْ عَيَّاشٍ وَهُوَ ابْنُ عَبَّاسٍ الْقِتْبَانِيُّ، عَنْ عَبْدِ اللهِ بْنِ يَزِيدَ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِيِّ، عَنْ عَبْدِ اللهِ بْنِ عَمْرِو بْنِ الْعَاصِ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ «يُغْفَرُ لِلشَّهِيدِ كُلُّ ذَنْبٍ إِلَّا الدَّيْنَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12447,
                "hadithNumber": "4884",
                "englishNarrator": "It has been reported on the authority of Amr bin al-'As رضی اللہ عنہ through a different chain of transmitters:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Death in the way of Allah blots out everything except debt.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے فرمایا : \" اللہ کی راہ میں قتل کیے جانے سے قرض کے سوا باقی تمام گناہ مٹا دیے جاتے ہیں ۔ \"",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے عبداللہ بن یزید مقری نے بیان کیا, سعید بن ابی ایوب نے کہا : مجھے عیاش بن عباس قتبانی نے ابو عبدالرحمٰن حبلی سے حدیث بیان کی ، انہوں نے حضرت عبداللہ بن عمرو بن عاص رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ اللهِ بْنُ يَزِيدَ الْمُقْرِئُ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي أَيُّوبَ، حَدَّثَنِي عَيَّاشُ بْنُ عَبَّاسٍ الْقِتْبَانِيُّ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِيِّ، عَنْ عَبْدِ اللهِ بْنِ عَمْرِو بْنِ الْعَاصِ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْقَتْلُ فِي سَبِيلِ اللهِ يُكَفِّرُ كُلَّ شَيْءٍ، إِلَّا الدَّيْنَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12448,
                "hadithNumber": "4885",
                "englishNarrator": "It has been narrated on the authority of Masruq Who said:",
                "hadithEnglish": "We asked 'Abdullah رضی اللہ عنہ about the Qur'anic verse: Think not of those who are slain in Allah's way as dead. Nay, they are alive, finding their sustenance in the presence of their Lord.. (iii. 169). He said: We asked the meaning of the verse (from the Holy Prophet ﷺ) who said: The souls, of the martyrs live in the bodies of green birds who have their nests in chandeliers hung from the throne of the Almighty. They eat the fruits of Paradise from wherever they like and then nestle in these chandeliers. Once their Lord cast a glance at them and said: Do ye want anything? They said: What more shall we desire? We eat the fruit of Paradise from wherever we like. Their Lord asked them the same question thrice. When they saw that they will continue to be asked and not left (without answering the question). they said: O Lord, we wish that Thou mayest return our souls to our bodies so that we may be slain in Thy way once again. When He (Allah) saw that they had no need, they were left (to their joy in heaven).",
                "hadithUrdu": "ہم نے حضرت عبداللہ بن مسعود رضی اللہ عنہ سے اس آیت کی تفسیر دریافت کی : \" جو لوگ اللہ کی راہ میں شہید کئے گئے ان کو مرے ہوئے نہ سمجھو ، وہ اپنے رب کے ہاں زندہ ہیں ، ان کو رزق دیا جاتا ہے ۔ \" حضرت ابن مسعود رضی اللہ عنہ نے فرمایا : ہم نے بھی اس کے بارے میں رسول اللہ صلی اللہ علیہ وسلم سے دریافت کیا تھا ، آپ نے فرمایا : \" ان کی روحیں سبز پرندوں کے اندر رہتی ہیں ، ان کے لیے عرش الہیٰ کے ساتھ قبدیلیں لٹکی ہوئی ہیں ، وہ روحیں جنت میں جہاں چاہیں کھاتی پیتی ہیں ، پھر ان قندیلوں کی طرف لوٹ آتی ہیں ، ان کے رب نے اوپر سے ان کی طرف جھانک کر دیکھا اور فرمایا : \" کیا تمہیں کس چیز کی خواہش ہے؟ انہوں نے جواب دیا : ہم ( اور ) کیا خواہش کریں ، ہم جنت میں جہاں چاہتے ہیں گھومتے اور کھاتے پیتے ہیں ۔ اللہ نے تین بار ایسا کیا ( جھانک کر دیکھا اور پوچھا ۔ ) جب انہوں نے دیکھا کہ ان کو چھوڑا نہیں جائے گا ، ان سے سوال ہوتا رہے گا تو انہوں نے نے کہا : اے ہمارے رب! ہم یہ چاہتے ہیں کہ ہماری روحوں کو ہمارے جسموں میں لوٹا دیا جائے یہاں تک کہ ہم دوبارہ تیری راہ میں شہید کیے جائیں ۔ جب اللہ تعالیٰ یہ دیکھے گا کہ ان کو کوئی حاجت نہیں ہے تو ان کو چھوڑ دیا جائے گا ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ اور ابوبکر بن ابی شیبہ نے بیان کیا، ان دونوں سے ابومعاویہ نے بیان کیا، ہم سے اسحاق بن ابراہیم نے بیان کیا۔ جریر اور عیسیٰ بن یونس سب نے الاعمش کی سند سے ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا اور تلفظ ان کا ہے، ہم سے اصبط نے بیان کیا اور ابو معاویہ نے کہا: ہم سے عماش نے عبداللہ بن مرہ کی روایت سے بیان کیا, مسروق بیان کرتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، كِلَاهُمَا عَنْ أَبِي مُعَاوِيَةَ، ح وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، وَعِيسَى بْنُ يُونُسَ، جَمِيعًا، عَنِ الْأَعْمَشِ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، وَاللَّفْظُ لَهُ، حَدَّثَنَا أَسْبَاطٌ، وَأَبُو مُعَاوِيَةَ، قَالَا: حَدَّثَنَا الْأَعْمَشُ، عَنْ عَبْدِ اللهِ بْنِ مُرَّةَ، عَنْ مَسْرُوقٍ، قَالَ: سَأَلْنَا عَبْدَ اللهِ عَنْ هَذِهِ الْآيَةِ: {وَلَا تَحْسَبَنَّ الَّذِينَ قُتِلُوا فِي سَبِيلِ اللهِ أَمْوَاتًا بَلْ أَحْيَاءٌ عِنْدَ رَبِّهِمْ يُرْزَقُونَ} [آل عمران: 169] قَالَ: أَمَا إِنَّا قَدْ سَأَلْنَا عَنْ ذَلِكَ، فَقَالَ: «أَرْوَاحُهُمْ فِي جَوْفِ طَيْرٍ خُضْرٍ، لَهَا قَنَادِيلُ مُعَلَّقَةٌ بِالْعَرْشِ، تَسْرَحُ مِنَ الْجَنَّةِ حَيْثُ شَاءَتْ، ثُمَّ تَأْوِي إِلَى تِلْكَ الْقَنَادِيلِ، فَاطَّلَعَ إِلَيْهِمْ رَبُّهُمُ اطِّلَاعَةً»، فَقَالَ: هَلْ تَشْتَهُونَ شَيْئًا؟ قَالُوا: أَيَّ شَيْءٍ نَشْتَهِي وَنَحْنُ نَسْرَحُ مِنَ الْجَنَّةِ حَيْثُ شِئْنَا، فَفَعَلَ ذَلِكَ بِهِمْ ثَلَاثَ مَرَّاتٍ، فَلَمَّا رَأَوْا أَنَّهُمْ لَنْ يُتْرَكُوا مِنْ أَنْ يُسْأَلُوا، قَالُوا: يَا رَبِّ، نُرِيدُ أَنْ تَرُدَّ أَرْوَاحَنَا فِي أَجْسَادِنَا حَتَّى نُقْتَلَ فِي سَبِيلِكَ مَرَّةً أُخْرَى، فَلَمَّا رَأَى أَنْ لَيْسَ لَهُمْ حَاجَةٌ تُرِكُوا.",
                "headingArabic": "فِي بَيَانِ أَنَّ أَرْوَاحَ الشُّهَدَاءِ فِي الْجَنَّةِ وَأَنَّهُمْ أَحْيَاءٌ عِنْدَ رَبِّهِمْ يُرْزَقُونَ",
                "headingUrdu": "شہداء کی روحیں جنت میں ہیں اور وہ اپنے رب کے پاس زندہ ہیں اور ان کے لیے رزق ہے",
                "headingEnglish": "The souls of the martyrs are in Paradise, and they are alive with their Lord and they have provision",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12449,
                "hadithNumber": "4886",
                "englishNarrator": "It has been narrated on the authority of Abu Sa'id Khudri رضی اللہ عنہ :",
                "hadithEnglish": "A man came to the Prophet (ﷺ) and said: Who is the best of men? He replied: A man who fights in the way of Allah spending his wealth and staking his life. The man then asked: Who is next to him (in excellence)? He said: Next to him is a believer who lives in a mountain gorge worshipping hid Lord and sparing men from his mischief.",
                "hadithUrdu": "ایک شخص رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں آیا اور پوچھا : لوگوں میں سے کون سا شخص افضل ہے؟ آپ نے فرمایا : \" جو اپنے مال اور جان کے ساتھ اللہ کی راہ میں جہاد کرتا ہے ۔ \" اس نے پوچھا : اس کے بعد پھر کون افضل ہے؟ آپ نے فرمایا : \" وہ مومن افضل ہے جو کسی پہاڑ کی گھاٹیوں میں سے ایک گھاٹی میں رہتا ہے ، اللہ کی عبادت کرتا ہے اور لوگوں کو اپنی برائی سے محفوظ رکھتا ہے ۔ \"",
                "urduNarrator": "ہم سے منصور بن ابی مزاحم نے بیان کیا، کہا ہم سے یحییٰ بن حمزہ نے بیان کیا, محمد بن ولید زبیدی نے زہری سے ، انہوں نے عطاء بن یزید لیثی سے ، انہوں نے حضرت ابو سعید خدری رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا مَنْصُورُ بْنُ أَبِي مُزَاحِمٍ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ، عَنْ مُحَمَّدِ بْنِ الْوَلِيدِ الزُّبَيْدِيِّ، عَنِ الزُّهْرِيِّ، عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَجُلًا أَتَى النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: أَيُّ النَّاسِ أَفْضَلُ؟ فَقَالَ: «رَجُلٌ يُجَاهِدُ فِي سَبِيلِ اللهِ بِمَالِهِ وَنَفْسِهِ»، قَالَ: ثُمَّ مَنْ؟ قَالَ: «مُؤْمِنٌ فِي شِعْبٍ مِنَ الشِّعَابِ يَعْبُدُ اللهَ رَبَّهُ، وَيَدَعُ النَّاسَ مِنْ شَرِّهِ».",
                "headingArabic": "فَضْلِ الْجِهَادِ وَالرِّبَاطِ ‏‏",
                "headingUrdu": "جہاد کی فضیلت اور سرحدوں پر نظر رکھنا",
                "headingEnglish": "The virtue of Jihad and keeping watch over the frontier",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12450,
                "hadithNumber": "4887",
                "englishNarrator": "It was been narrated that Abu Sa'id Khadri رضی اللہ عنہ said:",
                "hadithEnglish": "A man asked: Messenger of Allah, which of men is the best? He said: A believer who fights staking his life and spending his wealth in the way of Allah. He asked: Who is next to him (in excellence)? He said: Next to him is a man who lives an isolated life in a mountain gorge, worshipping his Lord and sparing men from his mischief.",
                "hadithUrdu": "ایک شخص نے پوچھا : اللہ کے رسول! لوگوں میں سے افضل کون ہے؟ آپ نے فرمایا : \" ایسا مومن جو اپنی جان اور مال سے اللہ تعالیٰ کی راہ میں جہاد کرتا ہے ۔ \" اس نے پوچھا : اس کے بعد؟ آپ نے فرمایا : \" پھر وہ آدمی جو پہاڑ کی گھاٹیوں میں سے کسی گھاٹی میں تنہا رہتا ہے ، اپنے رب کی عبادت کرتا ہے اور لوگوں کو اپنے شر سے محفوظ رکھتا ہے ۔ \"",
                "urduNarrator": "ہم سے عبد بن حمید نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا, معمر نے زہری سے ، انہوں نے عطاء بن یزید لیثی سے ، انہوں نے حضرت ابوسعید خدری رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ، عَنْ أَبِي سَعِيدٍ، قَالَ: قَالَ رَجُلٌ: أَيُّ النَّاسِ أَفْضَلُ؟ يَا رَسُولَ اللهِ، قَالَ: «مُؤْمِنٌ يُجَاهِدُ بِنَفْسِهِ وَمَالِهِ فِي سَبِيلِ اللهِ»، قَالَ: ثُمَّ مَنْ؟ قَالَ: «ثُمَّ رَجُلٌ مُعْتَزِلٌ فِي شِعْبٍ مِنَ الشِّعَابِ يَعْبُدُ رَبَّهُ وَيَدَعُ النَّاسَ مِنْ شَرِّهِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12451,
                "hadithNumber": "4888",
                "englishNarrator": "It was narrated from Ibn Shihab with this chain of narration (a hadith similar to no. 4887). He said:",
                "hadithEnglish": "A man in a mountain valley. but did not mention next to him a man who....",
                "hadithUrdu": "آدمی جو کسی گھاٹی میں ہے کہا ۔ پھر وہ آدمی نہیں کہا.",
                "urduNarrator": "ہم سے عبداللہ بن عبدالرحمٰن دارمی نے بیان کیا، کہا ہم سے محمد بن یوسف نے بیان کیا, اوزاعی نے ابن شہاب سے اسی سند کے ساتھ روایت کی اور",
                "hadithArabic": "وحَدَّثَنَا عَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ، عَنِ الْأَوْزَاعِيِّ، عَنِ ابْنِ شِهَابٍ، بِهَذَا الْإِسْنَادِ، فَقَالَ: «وَرَجُلٌ فِي شِعْبٍ»، وَلَمْ يَقُلْ: ثُمَّ رَجُلٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12452,
                "hadithNumber": "4889",
                "englishNarrator": "It has been narrated on the authority of Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Of the men he lives the best life who holds the reins of his horse (ever ready to march) in the way of Allah, flies on its back whenever he hears a fearful shriek, or a call for help, flies to it seeking death at places where it can be expected. (Next to him) is a man who lives with his sheep at a hill-top or in a valley, says his prayers regularly, gives Zakat and worships his Lord until death comes to him. There is no better person among men except these two.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" لوگوں کے لیے زندگی کے بہترین طریقوں میں سے یہ ہے کہ آدمی نے اللہ کے راستے میں جہاد کے لیے گھوڑے کی لگام پکڑ رکھی ہو ، اس کی پیٹح پر اللہ کی راہ میں اڑتا ( تیزی سے حرکت کرتا ) پھرے ، جب بھی ( دشمن کی ) آہٹ یا ( کسی کے ) ڈرنے کی آواز سنے ، اڑ کر وہاں پہنچ جائے ، ہر اس جگہ قتل اور موت کو تلاش کرتا ہو جہاں اس کے ہونے کا گمان ہو یا پھر وہ آدمی جو بکریوں کے چھوٹے سے ریوڑ کے ساتھ ان چوٹیوں میں سے کسی ایک چھوٹی پر یا ان وادیوں میں سے کسی وادی میں ہو ، نماز قائم کرے ، زکاۃ دے اور یقینی انجام ( موت ) تک اپنے رب کی عبادت کرے ، اچھائی کے معاملات کے سوا لوگوں سے کوئی تعلق نہ رکھے ۔ \"",
                "urduNarrator": "یحییٰ بن یحییٰ تمیمی نے کہا : ہمیں عبدالعزیز بن ابی حازم نے اپنے والد سے حدیث بیان کی ، انہوں نے بعجہ سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے ، انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ بَعْجَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، أَنَّهُ قَالَ: «مِنْ خَيْرِ مَعَاشِ النَّاسِ لَهُمْ، رَجُلٌ مُمْسِكٌ عِنَانَ فَرَسِهِ فِي سَبِيلِ اللهِ، يَطِيرُ عَلَى مَتْنِهِ، كُلَّمَا سَمِعَ هَيْعَةً، أَوْ فَزْعَةً طَارَ عَلَيْهِ، يَبْتَغِي الْقَتْلَ وَالْمَوْتَ مَظَانَّهُ، أَوْ رَجُلٌ فِي غُنَيْمَةٍ فِي رَأْسِ شَعَفَةٍ مِنْ هَذِهِ الشَّعَفِ، أَوْ بَطْنِ وَادٍ مِنْ هَذِهِ الْأَوْدِيَةِ، يُقِيمُ الصَّلَاةَ، وَيُؤْتِي الزَّكَاةَ، وَيَعْبُدُ رَبَّهُ حَتَّى يَأْتِيَهُ الْيَقِينُ، لَيْسَ مِنَ النَّاسِ إِلَّا فِي خَيْرٍ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12453,
                "hadithNumber": "4890",
                "englishNarrator": "A similar report (as no. 4889) was narrated from Abu Hazim with this chain of narration. He said: \"From Ba'jah bin Abdullah bin Badr,\"  and he said:",
                "hadithEnglish": "\"In one of these mountain passes,\" unlike the report of Yahya.\"",
                "hadithUrdu": "\" ان گھاٹیوں میں سے ایک گھاٹی میں \" کہا ۔",
                "urduNarrator": "قتیبہ بن سعید نے عبدالعزیز بن ابی حازم سے ، انہوں نے اور یعقوب بن عبدالرحمٰن دونوں نے اسی سند کے ساتھ ابو حازم سے اسی کے مانند روایت بیان کی ( بعجہ کا مکمل نام لیتے ہوئے ) بعجہ بن عبداللہ بن بدر کہا ۔ اور یحییٰ کی روایت کے برعکس ( ان وادیوں میں سے ایک وادی کے بجائے )",
                "hadithArabic": "وَحَدَّثَنَاهُ قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ عَبْدِ الْعَزِيزِ بْنِ أَبِي حَازِمٍ، وَيَعْقُوبُ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْقَارِيَّ، كِلَاهُمَا عَنْ أَبِي حَازِمٍ، بِهَذَا الْإِسْنَادِ مِثْلَهُ، وَقَالَ: عَنْ بَعْجَةَ بْنِ عَبْدِ اللهِ بْنِ بَدْرٍ، وَقَالَ: «فِي شِعْبَةٍ مِنْ هَذِهِ الشِّعَابِ»، خِلَافَ رِوَايَةِ يَحْيَى.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12454,
                "hadithNumber": "4891",
                "englishNarrator": "A hadith like that of Abu Hazim (no.4890) was narrated from Abu Huraira رضی اللہ عنہ from the prophet ﷺ, and he said:",
                "hadithEnglish": "In one of the mountain passes.",
                "hadithUrdu": "\" گھاٹیوں میں سے ایک گھاٹی میں \" کہا ۔",
                "urduNarrator": "اسامہ بن زید نے بعجہ بن عبداللہ جہنی سے ، انہوں نے ابوہریرہ رضی اللہ عنہ سے ، انہوں نے نبی صلی اللہ علیہ وسلم سے اسی حدیث کے ہم معنی حدیث روایت کی جو ابوحازم نے بعجہ سے روایت کی ۔ اور انہوں نے",
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَأَبُو كُرَيْبٍ، قَالُوا: حَدَّثَنَا وَكِيعٌ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، عَنْ بَعْجَةَ بْنِ عَبْدِ اللهِ الْجُهَنِيِّ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَى حَدِيثِ أَبِي حَازِمٍ، عَنْ بَعْجَةَ، وَقَالَ: فِي «شِعْبٍ مِنَ الشِّعَابِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12455,
                "hadithNumber": "4892",
                "englishNarrator": "It has been narrated on the authority of Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: God laughs at the two men both of whom will enter Paradise (though) one of them kills the other. They said: Messenger of Allah, how is it? He said: One of them fights in the way of Allah, the Almighty and Exalted. and dies a martyr. Then God turns in mercy to the murderer who embraces Islam, fights in the way of Allah, the Almighty and Exalted, and dies a martyr.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ تعالیٰ دو آدمیوں کی طرف ( دیکھ کر ) ہنستا ہے ، ان دونوں میں سے ایک آدمی دوسرے کو قتل کرتا ہے اور دونوں جنت میں داخل ہو جاتے ہیں ۔ \" صحابہ کرام نے پوچھا : اللہ کے رسول! یہ کیسے ( ممکن ) ہے؟ آپ نے فرمایا : \" ایک شخص اللہ کی راہ میں جنگ کرتا ہے اور شہید ہو جاتا ، پھر اللہ اس کے قاتل کو توبہ کی توفیق عطا کرتا ہے تو وہ مسلمان ہو جاتا ہے ، پھر وہ ( بھی ) اللہ کی راہ میں جہاد کرتا ہے اور شہید ہو جاتا ہے ۔ \" ( جیسا کہ حضرت حمزہ اور وحشی بن حرب رضی اللہ عنہما ہیں ۔ )",
                "urduNarrator": "محمد بن ابی عمر مکی نے ہمیں حدیث بیان کی ، کہا : ہمیں سفیان نے ابوزناد سے ، انہوں نے اعرج سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْمَكِّيُّ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «يَضْحَكُ اللهُ إِلَى رَجُلَيْنِ، يَقْتُلُ أَحَدُهُمَا الْآخَرَ كِلَاهُمَا يَدْخُلُ الْجَنَّةَ»، فَقَالُوا: كَيْفَ يَا رَسُولَ اللهِ؟ قَالَ: «يُقَاتِلُ هَذَا فِي سَبِيلِ اللهِ عَزَّ وَجَلَّ فَيُسْتَشْهَدُ، ثُمَّ يَتُوبُ اللهُ عَلَى الْقَاتِلِ، فَيُسْلِمُ، فَيُقَاتِلُ فِي سَبِيلِ اللهِ عَزَّ وَجَلَّ فَيُسْتَشْهَدُ».",
                "headingArabic": "بَيَانِ الرَّجُلَيْنِ يَقْتُلُ أَحَدُهُمَا الآخَرَ يَدْخُلاَنِ الْجَنَّةَ ‏‏",
                "headingUrdu": "دو آدمی جن میں سے ایک دوسرے کو قتل کرے گا اور دونوں جنت میں داخل ہوں گے۔",
                "headingEnglish": "Two Men, one of whom kills the other, and both will enter Paradise",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12456,
                "hadithNumber": "4893",
                "englishNarrator": null,
                "hadithEnglish": "The same tradition has been narrated on the authority of Abu Zinad (with the same chain of transmitters).",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ، زہیر بن حرب اور ابو کریب نے بیان کیا، انہوں نے کہا: وکیع نے سفیان سے ، انہوں نے ابوزناد سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَأَبُو كُرَيْبٍ، قَالُوا: حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ أَبِي الزِّنَادِ، بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12457,
                "hadithNumber": "4894",
                "englishNarrator": "It has been reported on the authority of Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: God laughs at the two men one of whom kills the other; both of them will enter Paradise. They (the Companions) said: How, Messenger of Allah? He said: One is slain (in the way of Allah) and enters Paradise. Then God forgives the other and guides him to Islam; then he fights in the way of Allah and dies a martyr.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ تعالیٰ دو شخصوں کی طرف دیکھ کر ہنستا ہے ، ان میں سے ایک شخص دوسرے کو قتل کرتا ہے اور وہ دونوں جنت میں داخل ہو جاتے ہیں ۔ \" صحابہ کرام نے پوچھا : اللہ کے رسول! کیسے؟ آپ نے فرمایا : \" یہ شخص شہید کیا جاتا ہے اور جنت کے اندر چلا جاتا ہے ، پھر اللہ تعالیٰ دوسرے ( قاتل ) پر نظر عنایت فرماتا ہے ، اسے اسلام کی ہدایت عطا کرتا ہے ، پھر وہ اللہ کی راہ میں جہاد کرتا ہے اور شہید کر دیا جاتا ہے ۔ \"",
                "urduNarrator": "ہم سے محمد بن رافع نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، کہا ہم سے معمر نے بیان کیا, ہمام بن منبہ سے روایت ہے ، کہا : یہ احادیث ہیں جو ابوہریرہ رضی اللہ عنہ نے ہمیں رسول اللہ صلی اللہ علیہ وسلم سے بیان کیں ، انہوں نے متعدد احادیث بیان کیں ان میں سے یہ ہے",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ: هَذَا مَا: حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَذَكَرَ أَحَادِيثَ مِنْهَا، وَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «يَضْحَكُ اللهُ لِرَجُلَيْنِ يَقْتُلُ أَحَدُهُمَا الْآخَرَ كِلَاهُمَا يَدْخُلُ الْجَنَّةَ»، قَالُوا: كَيْفَ يَا رَسُولَ اللهِ؟ قَالَ: «يُقْتَلُ هَذَا فَيَلِجُ الْجَنَّةَ، ثُمَّ يَتُوبُ اللهُ عَلَى الْآخَرِ، فَيَهْدِيهِ إِلَى الْإِسْلَامِ، ثُمَّ يُجَاهِدُ فِي سَبِيلِ اللهِ، فَيُسْتَشْهَدُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12458,
                "hadithNumber": "4895",
                "englishNarrator": "It has been narrated on the authority of Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: A disbeliever and a believer who killed him will never be gathered together in Hell.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کافر اور اس کو قتل کرنے والا ( مسلمان ) جہنم میں کبھی اکٹھے نہیں ہوں گے ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن ایوب، قتیبہ اور علی بن حجر نے بیان کیا، انہوں نے کہا: ہم سے اسماعیل نے بیان کیا، یعنی ابن جعفر نے, علاء کے والد نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَعَلِيُّ بْنُ حُجْرٍ، قَالُوا: حَدَّثَنَا إِسْمَاعِيلُ يَعْنُونَ ابْنَ جَعْفَرٍ، عَنِ الْعَلَاءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «لَا يَجْتَمِعُ كَافِرٌ وَقَاتِلُهُ فِي النَّارِ أَبَدًا».",
                "headingArabic": "مَنْ قَتَلَ كَافِرًا ثُمَّ سَدَّدَ",
                "headingUrdu": "جو کافر کو مارتا ہے پھر راہ راست پر رہتا ہے۔",
                "headingEnglish": "One who kills a disbeliever then keeps to the right path",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12459,
                "hadithNumber": "4896",
                "englishNarrator": "It has been narrated on the authority of Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: No two such persons shall be together in Hell as if one of them is such that his presence hurts the other. It was asked: Messenger of Allah, who are they? He said: A believer who killed a disbeliever and (then) kept to the right path.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" دو شخص جہنم میں اس طرح اکٹھے نہیں ہوں گے کہ اکٹھے ہونے کی وجہ سے ایک شخص دوسرے کو نقصان پہنچا سکے ۔ عرض کی گئی : اللہ کے رسول! وہ کون ہیں؟ فرمایا : \" وہ مومن جس نے ( جہاد کرتے ہوئے ) کسی کافر کو قتل کیا ، پھر دین پر مضبوطی سے جما رہا ۔ \"",
                "urduNarrator": "ہم سے عبداللہ بن عون ہلالی نے بیان کیا، کہا ہم سے ابو اسحاق الفزاری ابراہیم بن محمد نے بیان کیا, سہیل کے والد ابوصالح نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللهِ بْنُ عَوْنٍ الْهِلَالِيُّ، حَدَّثَنَا أَبُو إِسْحَاقَ الْفَزَارِيُّ إِبْرَاهِيمُ بْنُ مُحَمَّدٍ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يَجْتَمِعَانِ فِي النَّارِ اجْتِمَاعًا يَضُرُّ أَحَدُهُمَا الْآخَرَ»، قِيلَ: مَنْ هُمْ يَا رَسُولَ اللهِ؟ قَالَ: «مُؤْمِنٌ قَتَلَ كَافِرًا، ثُمَّ سَدَّدَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12460,
                "hadithNumber": "4897",
                "englishNarrator": "It has been narrated on the authority of Abu Mas'ud al-Ansari رضی اللہ عنہ who said:",
                "hadithEnglish": "A man brought a muzzled she-camel and said: It is (offered) in the way of Allah. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: For this you will have seven hundred she-camels on the Day of Judgment all of which will be muzzled.",
                "hadithUrdu": "ایک شخص اونٹنی کی مہار پکڑے ہوئے آیا اور کہنے لگا : یہ اللہ کی راہ ( جہاد ) میں ہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تمہیں اس کے بدلے میں قیامت کے دن سات سو اونٹنیاں ملیں گی اور سبھی نکیل سمیت ہوں گی ۔ \"",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم الحنظَلی نے بیان کیا, جریر نے اعمش سے ، انہوں نے ابوعمرو شیبانی سے ، انہوں نے ابو مسعود انصاری رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا جَرِيرٌ، عَنِ الْأَعْمَشِ، عَنْ أَبِي عَمْرٍو الشَّيْبَانِيِّ، عَنْ أَبِي مَسْعُودٍ الْأَنْصَارِيِّ، قَالَ: جَاءَ رَجُلٌ بِنَاقَةٍ مَخْطُومَةٍ، فَقَالَ: هَذِهِ فِي سَبِيلِ اللهِ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَكَ بِهَا يَوْمَ الْقِيَامَةِ سَبْعُ مِائَةِ نَاقَةٍ كُلُّهَا مَخْطُومَةٌ».",
                "headingArabic": "فَضْلِ الصَّدَقَةِ فِي سَبِيلِ اللَّهِ وَتَضْعِيفِهَا ‏‏",
                "headingUrdu": "اللہ کی راہ میں صدقہ کی فضیلت اور اس کا کئی گنا ثواب",
                "headingEnglish": "The virtue of Charity in the Cause of Allah, and its Manifold reward",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12461,
                "hadithNumber": "4898",
                "englishNarrator": null,
                "hadithEnglish": "It was narrated from Al-A'mash with this chain of narration (a similar hadith to no. 4897).",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے ابو اسامہ نے بیان کیا, زائدہ اور شعبہ دونوں نے اعمش سے اسی سند کے ساتھ روایت کی.",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ زَائِدَةَ، ح وَحَدَّثَنِي بِشْرُ بْنُ، خَالِدٍ حَدَّثَنَا مُحَمَّدٌ، - يَعْنِي ابْنَ جَعْفَرٍ - حَدَّثَنَا شُعْبَةُ، كِلاَهُمَا عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12462,
                "hadithNumber": "4899",
                "englishNarrator": "It has been narrated on the authority of Abu Mas'ud al-Ansari رضی اللہ عنہ who said:",
                "hadithEnglish": "A man came to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: My riding beast has been killed, so give me some animal to ride upon. He (the Holy Prophet) said: I have none with me. A man said: Messenger of Allah, I can guide him to one who will provide him with a riding beast. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: One who guides to something good has a reward similar to that of its doer.",
                "hadithUrdu": "ایک شخص نبی صلی اللہ علیہ وسلم کی خدمت میں آیا اور عرض کی : اللہ کے رسول! میرا سواری کا جانور ضائع ہو گیا ہے ، آپ مجھے سواری مہیا کر دیجئے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" میرے پاس سواری نہیں ہے ۔ \" ایک شخص سے عرض کی : اللہ کے رسول! میں اس کو ایسا شخص بتاتا ہوں جو اسے سواری کا جانور مہیا کر دے گا ۔ آپ نے فرمایا : \" جس شخص نے کسی نیکی کا پتہ بتایا ، اس کے لیے ( بھی ) نیکی کرنے والے کے جیسا اجر ہے ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، ابو کریب اور ابن ابی عمر نے بیان کیا، اور لفظ ابو کریب نے کہا ,  ابومعاویہ نے ہمیں اعمش سے حدیث بیان کی ، انہوں نے ابوعمرو شیبانی سے ، انہوں نے حضرت ابومسعود انصاری رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، وَابْنُ أَبِي عُمَرَ، وَاللَّفْظُ لِأَبِي كُرَيْبٍ، قَالُوا: حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ أَبِي عَمْرٍو الشَّيْبَانِيِّ، عَنْ أَبِي مَسْعُودٍ الْأَنْصَارِيِّ، قَالَ: جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: إِنِّي أُبْدِعَ بِي فَاحْمِلْنِي، فَقَالَ: «مَا عِنْدِي»، فَقَالَ رَجُلٌ: يَا رَسُولَ اللهِ، أَنَا أَدُلُّهُ عَلَى مَنْ يَحْمِلُهُ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ دَلَّ عَلَى خَيْرٍ فَلَهُ مِثْلُ أَجْرِ فَاعِلِهِ».",
                "headingArabic": "فَضْلِ إِعَانَةِ الْغَازِي فِي سَبِيلِ اللَّهِ بِمَرْكُوبٍ وَغَيْرِهِ وَخِلاَفَتِهِ فِي أَهْلِهِ بِخَيْرٍ",
                "headingUrdu": "اللہ کی راہ میں لڑنے والے جنگجو کی مدد اور اس کی غیر موجودگی میں اس کے گھر والوں کی دیکھ بھال کی فضیلت",
                "headingEnglish": "The virtue of helping the warrior who is fighting in the cause of Allah with mounts etc., and looking after his family in his absence",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12463,
                "hadithNumber": "4900",
                "englishNarrator": null,
                "hadithEnglish": "It was narrated from Al-Amash with this chain with this chain of narration (a similar Hadith to no. 4899).",
                "hadithUrdu": "ہم سے اسحاق بن ابراہیم نے بیان کیا, عیسیٰ بن یونس ، شعبہ اور سفیان سب نے اعمش سے اسی سند کے ساتھ روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، ح وَحَدَّثَنِي بِشْرُ بْنُ خَالِدٍ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ شُعْبَةَ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا سُفْيَانُ، كُلُّهُمْ عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 12151,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=486",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=484",
                "label": "484",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=485",
                "label": "485",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=486",
                "label": "486",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=487",
                "label": "487",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=488",
                "label": "488",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=489",
                "label": "489",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=490",
                "label": "490",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=488",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=488",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=486",
        "to": 12175,
        "total": 40465
    }
}