{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 362,
        "data": [
            {
                "id": 9314,
                "hadithNumber": "1750",
                "englishNarrator": "Abdullah bin 'Umar رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "A man stood up and said. Messenger of Allah, how is the night prayer? The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: The night prayer consists of pair, but if you apprehend the rise of dawn, make it odd number by observing one rak'ah.",
                "hadithUrdu": "ایک آدمی کھڑا ہوا اور کہا : اے اللہ کے رسول صلی اللہ علیہ وسلم !رات کی نماز کیسے ہے؟رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" رات کی نماز دو دو رکعت ہے اور جب تمھیں صبح ہونے کا خطرہ ہوتو ایک ایک رکعت ( پڑھ کر انھیں ) وتر کرلو ۔ \"",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، مجھ سے عبداللہ بن وہب نے بیان کیا، انہوں نے کہاعمرو نے کہا ابن شہاب نے اس سے بیان کہ اسے سالم بن عبداللہ بن عمر اور حمید بن عبدالرحمان بن عوف دونوں نے عبداللہ بن عمر بن خطاب رضی اللہ تعالیٰ عنہ سے حدیث بیان کی کہ انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو أَنَّ ابْنَ شِهَابٍ حَدَّثَهُ أَنَّ سَالِمَ بْنَ عَبْدِ اللَّهِ بْنِ عُمَرَ وَحُمَيْدَ بْنَ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ حَدَّثَاهُ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ بْنِ الْخَطَّابِ أَنَّهُ قَالَ قَامَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ كَيْفَ صَلَاةُ اللَّيْلِ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةُ اللَّيْلِ مَثْنَى مَثْنَى فَإِذَا خِفْتَ الصُّبْحَ فَأَوْتِرْ بِوَاحِدَةٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9315,
                "hadithNumber": "1751",
                "englishNarrator": "Abdullah bin 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "A person asked the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as I stood between him (the Holy Prophet) and the inquirer and he said: Messenger of Allah, how is the night prayer? He (the Holy Prophet) said: It consists of pairs of rak'ahs, but if you apprehend morning, you should pray one rak'ah and make the end of your prayer as Witr. Then a person asked him (the Holy Prophet) at the end of the year and I was at that place near the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌); but I do not know whether he was the same person or another person, but he (the Holy Prophet) gave him the same reply.",
                "hadithUrdu": "ایک آدمی نے نبی اکرم صلی اللہ علیہ وسلم سے پوچھا ، اور میں آپ کے اور پوچھنے والے کے درمیان میں تھا ، اس نے کہا : اے اللہ کے رسول صلی اللہ علیہ وسلم !رات کی نماز کیسے ہوتی ہے؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" دو دو رکعتیں ، پھر جب تمھیں صبح ہونے کا اندیشہ ہو توا یک رکعت پڑھ لو اور وتر کو ا پنی نماز کا آخری حصہ بناؤ ۔ \" پھر سال کے بعد ایک آدمی نے آپ سے پوچھا ، میں رسول اللہ صلی اللہ علیہ وسلم کے قریب اسی جگہ ( درمیان میں ) تھا اور مجھے معلوم نہیں وہ پہلے والا آدمی تھا یا کوئی اور ، اسے بھی آپ نے اسی طرح جواب دیا ۔",
                "urduNarrator": "ابو ربیع زہرانی نے کہا : ہمیں حماد نے حدیث سنائی کہا : ہمیں ایوب اور بدیل نے عبداللہ بن شقیق سے حدیث بیان کی ، انھوں نے حضرت عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنِي أَبُو الرَّبِيعِ الزَّهْرَانِيُّ حَدَّثَنَا حَمَّادٌ حَدَّثَنَا أَيُّوبُ وَبُدَيْلٌ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ رَجُلًا سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا بَيْنَهُ وَبَيْنَ السَّائِلِ فَقَالَ يَا رَسُولَ اللَّهِ كَيْفَ صَلَاةُ اللَّيْلِ قَالَ مَثْنَى مَثْنَى فَإِذَا خَشِيتَ الصُّبْحَ فَصَلِّ رَكْعَةً وَاجْعَلْ آخِرَ صَلَاتِكَ وِتْرًا ثُمَّ سَأَلَهُ رَجُلٌ عَلَى رَأْسِ الْحَوْلِ وَأَنَا بِذَلِكَ الْمَكَانِ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَا أَدْرِي هُوَ ذَلِكَ الرَّجُلُ أَوْ رَجُلٌ آخَرُ فَقَالَ لَهُ مِثْلَ ذَلِكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9316,
                "hadithNumber": "1752",
                "englishNarrator": "This hadith his been narrated by Ibn 'Umar رضی اللہ تعالیٰ عنہ by another chain of transmitters but it does not have these words:",
                "hadithEnglish": "Then a person asked him at the end of the year, and what follows subsequently.",
                "hadithUrdu": "ایک آدمی نے نبی کریم صلی اللہ علیہ وسلم سے سوال کیا ۔ ۔ ۔ پھر دونوں ( ابو کامل اور محمد بن عبید ) نے اوپر والی ر وایت بیان کی مگر ان دونوں کی روایت میں \" ایک آدمی نے آپ سے ایک سال گزرنے کابعد پوچھا \" اور اس کے بعد کا حصہ مروی نہیں ۔",
                "urduNarrator": "ابو کامل نے کہا : ہمیں حماد نے حدیث سنائی ، کہا : ہمیں ایوب ، بدیل اور عمران بن حدیر نے عبداللہ بن شقیق سے ، انھوں نے حضرت عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت کی ، نیز ( دوسری سند سے ) محمد بن عبید غبری نے کہا : ہمیں حماد نے حدیث سنائی ، کہا : ہم سے ایوب اور زبیر بن خریت نے عبداللہ بن شقیق سے ، انھوں نے حضرت عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے حدیث بیان کی کہ",
                "hadithArabic": "و حَدَّثَنِي أَبُو كَامِلٍ حَدَّثَنَا حَمَّادٌ حَدَّثَنَا أَيُّوبُ وَبُدَيْلٌ وَعِمْرَانُ بْنُ حُدَيْرٍ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ عَنْ ابْنِ عُمَرَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الْغُبَرِيُّ حَدَّثَنَا حَمَّادٌ حَدَّثَنَا أَيُّوبُ وَالزُّبَيْرُ بْنُ الْخِرِّيتِ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ عَنْ ابْنِ عُمَرَ قَالَ سَأَلَ رَجُلٌ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَا بِمِثْلِهِ وَلَيْسَ فِي حَدِيثِهِمَا ثُمَّ سَأَلَهُ رَجُلٌ عَلَى رَأْسِ الْحَوْلِ وَمَا بَعْدَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9317,
                "hadithNumber": "1753",
                "englishNarrator": "Ibn 'Umar رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Hasten to pray Witr before morning.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا : \" وتر پڑھنے میں صبح سے سبقت کرو ۔ \" ( صبح ہونے سے پہلے پہلے وتر پڑھ لو ۔ )",
                "urduNarrator": "ہم سے ہارون بن معروف، سریج بن یونس اور ابو کریب نے ابن ابی زیدہ کی سند سے بیان کیا، ہارون نے کہا: ہم سے ابن ابی زیدہ نے عبداللہ بن شقیق کی سند سے بیان کیا, حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ",
                "hadithArabic": "و حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ وَسُرَيْجُ بْنُ يُونُسَ وَأَبُو كُرَيْبٍ جَمِيعًا عَنْ ابْنِ أَبِي زَائِدَةَ قَالَ هَارُونُ حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ أَخْبَرَنِي عَاصِمٌ الْأَحْوَلُ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ بَادِرُوا الصُّبْحَ بِالْوِتْرِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9318,
                "hadithNumber": "1754",
                "englishNarrator": "Ibn 'Umar رضی اللہ عنہ said:",
                "hadithEnglish": "He who prayed at night should make Witr the end of his prayer, for the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) ordered this.",
                "hadithUrdu": "جوشخص ر ات کو نماز پڑھے ، وہ وتر کو اپنی نماز کا آخری حصہ بنائے کیونکہ رسول اللہ صلی اللہ علیہ وسلم اسی کا حکم دیتے تھے ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ہم سے لیث نے بیان کیا اور ہم سے ابن رومہ نے بیان کیا، انہوں نے کہا ,لیث نے نافع سے روایت کی کہ حضرت ابن عمر رضی اللہ عنہ نے کہا",
                "hadithArabic": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ ح و حَدَّثَنَا ابْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ عَنْ نَافِعٍ أَنَّ ابْنَ عُمَرَ قَالَ مَنْ صَلَّى مِنْ اللَّيْلِ فَلْيَجْعَلْ آخِرَ صَلَاتِهِ وِتْرًا فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْمُرُ بِذَلِكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9319,
                "hadithNumber": "1755",
                "englishNarrator": "Ibn 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Make Witr the end of your night prayer.",
                "hadithUrdu": "آپ نے فرمایا : \" رات کے وقت وتر کو اپنی نماز کا آخری حصہ بناؤ ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے ابو اسامہ ایچ نے بیان کیا، ہم سے ابن نمیر نے بیان کیا، ہم سے ابوحنیفہ نے بیان کیا، مجھ سے زہیر بن حرب اور ابن المثنیٰ نے بیان کیا، انہوں نے کہا: ہم سے یحییٰ نے سب کچھ بیان کیا, عبیداللہ نے نافع سے ، انھوں نے حضرت ابن عمر رضی اللہ عنہ سے اور ا نھوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي ح و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ وَابْنُ الْمُثَنَّى قَالَا حَدَّثَنَا يَحْيَى كُلُّهُمْ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اجْعَلُوا آخِرَ صَلَاتِكُمْ بِاللَّيْلِ وِتْرًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9320,
                "hadithNumber": "1756",
                "englishNarrator": "Nafi' reported Ibn 'Umar رضی اللہ تعالیٰ عنہ as saying:",
                "hadithEnglish": "He who observed the night prayer should make Witr the end of his prayer before dawn. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to order them thus.",
                "hadithUrdu": "جو شخص ر ات کو نماز پڑھے وہ صبح سے پہلے نماز کا آخری حصہ وتر کوبنائے ، رسول اللہ صلی اللہ علیہ وسلم ان ( اپنے ساتھیوں ) کو یہی حکم دیاکرتے تھے ۔",
                "urduNarrator": "اور مجھ سے ہارون بن عبداللہ نے بیان کیا، کہا ہم سے حجاج بن محمد نے بیان کیا، انہوں نے کہا, ابن جریج نے کہا : مجھے نافع نے بتایا کہ حضرت ابن عمر رضی اللہ تعالیٰ عنہ کہاکرتے تھے",
                "hadithArabic": "و حَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي نَافِعٌ أَنَّ ابْنَ عُمَرَ كَانَ يَقُولُ مَنْ صَلَّى مِنْ اللَّيْلِ فَلْيَجْعَلْ آخِرَ صَلَاتِهِ وِتْرًا قَبْلَ الصُّبْحِ كَذَلِكَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُهُمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9321,
                "hadithNumber": "1757",
                "englishNarrator": "Ibn 'Umar رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Witr is a rak'ah at the end of the prayer.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" وتر رات کے آخری حصے کی ایک رکعت ہے ۔ \"",
                "urduNarrator": "ہم سے شیبان بن فرخ نے بیان کیا، کہا ہم سے عبدالوارث نے بیان کیا، ابو تیاح نے کہا : مجھے ابو مجلز نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے حدیث سنائی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ أَبِي التَّيَّاحِ قَالَ حَدَّثَنِي أَبُو مِجْلَزٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْوِتْرُ رَكْعَةٌ مِنْ آخِرِ اللَّيْلِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9322,
                "hadithNumber": "1758",
                "englishNarrator": "Ibn Umar رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Witr is a rak'ah at the end of the night prayer.",
                "hadithUrdu": "آپ نے فرمایا : \" وتر رات کے آخری حصے کی ایک رکعت ہے ۔ \"",
                "urduNarrator": "ہم سے شیبان بن فرخ نے بیان کیا، کہا ہم سے عبد الوارث نے بیان کیا، انہوں نے ابوالتیاح سے ، انھوں نے مجلز سے روایت کی ، انھوں نے کہا : میں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے سنا ، وہ نبی اکرم صلی اللہ علیہ وسلم سے حدیث بیان کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ أَبِي التَّيَّاحِ قَالَ حَدَّثَنِي أَبُو مِجْلَزٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْوِتْرُ رَكْعَةٌ مِنْ آخِرِ اللَّيْلِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9323,
                "hadithNumber": "1759",
                "englishNarrator": "Abu Mijlaz reported:",
                "hadithEnglish": "I asked Ibn 'Abbas رضی اللہ تعالیٰ عنہ about the Witr prayer. He said: I heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: It is a rak'ah at the end of the night prayer.",
                "hadithUrdu": "میں نےحضرت ابن عباس رضی اللہ تعالیٰ عنہ سے وتر کے بارے میں سوال کیا تو انھوں نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ فرما رہے تھے ۔ \" ( وتر ) رات کے آخری حصے کی ایک رکعت ہے ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے عبد الصمد نے بیان کیا، انہوں نے بیان کیا, ہمام نے کہا : ہمیں قتادہ نے ابو مجلز سے حدیث بیان کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ عَنْ أَبِي مِجْلَزٍ قَالَ سَأَلْتُ ابْنَ عَبَّاسٍ عَنْ الْوِتْرِ فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ رَكْعَةٌ مِنْ آخِرِ اللَّيْلِ وَسَأَلْتُ ابْنَ عُمَرَ فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ رَكْعَةٌ مِنْ آخِرِ اللَّيْلِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9324,
                "hadithNumber": "1760",
                "englishNarrator": "Ibn 'Umar رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "A person called (the attention) of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as he was in the mosque, and said: Messenger of Allah, how should I make the rak'ahs of the night prayer an odd number? Upon this the Messenger of Allah (may peace he upon him) said: He who prays (night prayer) he should observe it in pairs, but if he apprehends the rise of morning, he should observe one rak'ah; that would make the number odd (for the rak'ahs) observed by him. This was narrated by Abu Kuraib 'Ubaidullah bin 'Abdullah and Ibn 'Umar رضی اللہ تعالیٰ عنہ did not make mention of it.",
                "hadithUrdu": "ایک آدمی نے جب رسول اللہ صلی اللہ علیہ وسلم مسجد میں تھے آپ کو آواز دی اور کہا : اے اللہ کے رسول صلی اللہ علیہ وسلم !میں رات کی نماز کو وتر ( طاق ) کیسے بناؤں؟رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" جو ( رات ) کی نماز پڑھے وہ دو دو رکعت پڑھے ، پھر وہ اگر محسوس کرے کہ صبح ہورہی ہےتو ایک رکعت پڑھ لے ، یہ ( ایک رکعت ) اس کی ساری نماز کو وتر ( طاق ) بنا دے گی ۔ \"\" ابو کریب نے عبیداللہ بن عبداللہ کہا ، ( آگے ) ابن عمر رضی اللہ تعالیٰ عنہ نے ایسا نہیں کہا۔",
                "urduNarrator": "ابو کریب اور ہارون بن عبداللہ نے کہا : ہمیں ابو اسامہ نے ولید بن کثیر سے حدیث سنائی ، انھوں نے کہا : مجھے عبیداللہ بن عبداللہ بن عمر رضی اللہ تعالیٰ عنہ نے حدیث سنائی کہ حضرت عمر رضی اللہ تعالیٰ عنہ نے انھیں بتایا کہ",
                "hadithArabic": "و حَدَّثَنَا أَبُو كُرَيْبٍ وَهَارُونُ بْنُ عَبْدِ اللَّهِ قَالَا حَدَّثَنَا أَبُو أُسَامَةَ عَنْ الْوَلِيدِ بْنِ كَثِيرٍ قَالَ حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ ابْنَ عُمَرَ حَدَّثَهُمْ أَنَّ رَجُلًا نَادَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ فِي الْمَسْجِدِ فَقَالَ يَا رَسُولَ اللَّهِ كَيْفَ أُوتِرُ صَلَاةَ اللَّيْلِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَلَّى فَلْيُصَلِّ مَثْنَى مَثْنَى فَإِنْ أَحَسَّ أَنْ يُصْبِحَ سَجَدَ سَجْدَةً فَأَوْتَرَتْ لَهُ مَا صَلَّى قَالَ أَبُو كُرَيْبٍ عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ وَلَمْ يَقُلْ ابْنِ عُمَرَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9325,
                "hadithNumber": "1761",
                "englishNarrator": "Anas bin Sirin reported:",
                "hadithEnglish": "I asked Ibn 'Umar رضی اللہ تعالیٰ عنہ to tell me about the practice of the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) in regard to two rak'ahs before the dawn prayer: Should I make lengthy recitation in them? He said: The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to observe, the night prayer in pairs and then made the number odd by observing one rak'ah. I said: I am not asking you about it. He said: You are a bulky man, will you not show me the patience to narrate to you the hadith completely? The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to observe the night prayer in pairs and then made the number odd by observing one rak'ah, and then he observed two rak'ahs before dawn quite close to the call for prayer (Khalaf said: Did you see [yourself the Prophet observing] the two rak'ahs before the dawn? and he made no mention of prayer.)",
                "hadithUrdu": "میں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے عرض کی : صبح کی نماز سے پہلے کی دو رکعتوں کے بارے میں آپ کی کیا رائے ہے ، کیا میں ان میں طویل قراءت کرسکتا ہوں؟انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم رات کو دو دو رکعت پڑھتے تھے اور ایک رکعت سے اس کو وتر بناتے ، میں نے کہا : میں آپ سے اس کے بارے میں نہیں پوچھ رہا ۔ انھوں نے کہا : تم ایک بوجھل آدمی ہو ( اپنی سوچ کو ترجیح دیتے ہو ) کیا مجھے موقع نہ دو گے کہ میں تمہارے لئے بات کو مکمل کروں؟رسول اللہ صلی اللہ علیہ وسلم رات کو دو دو رکعت پڑھتے تھے اور ایک وتر پڑھتے اور صبح ( کی نماز ) سے پہلے ( مختصر سی ) دو رکعتیں پڑھتے ، گویا کہ اذان ( اقامت ) آ پ کے کانوں میں ( سنائی دے رہی ) ہے ۔ خلف نے اپنی حدیث میں \"\" صبح سے پہلے کی دو رکعتوں کے بارے میں آپ کی رائے کیا ہے؟کہا اور انھوں نے \"\" صلاۃ \"\" کا لفظ بیان نہیں کیا ۔",
                "urduNarrator": "خلف بن ہشام اور ابوکامل نے کہا : ہمیں حماد بن زیدنے انس بن سیرن سے حدیث سنائی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا خَلَفُ بْنُ هِشَامٍ وَأَبُو كَامِلٍ قَالَا حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَنَسِ بْنِ سِيرِينَ قَالَ سَأَلْتُ ابْنَ عُمَرَ قُلْتُ أَرَأَيْتَ الرَّكْعَتَيْنِ قَبْلَ صَلَاةِ الْغَدَاةِ أَؤُطِيلُ فِيهِمَا الْقِرَاءَةَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي مِنْ اللَّيْلِ مَثْنَى مَثْنَى وَيُوتِرُ بِرَكْعَةٍ قَالَ قُلْتُ إِنِّي لَسْتُ عَنْ هَذَا أَسْأَلُكَ قَالَ إِنَّكَ لَضَخْمٌ أَلَا تَدَعُنِي أَسْتَقْرِئُ لَكَ الْحَدِيثَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي مِنْ اللَّيْلِ مَثْنَى مَثْنَى وَيُوتِرُ بِرَكْعَةٍ وَيُصَلِّي رَكْعَتَيْنِ قَبْلَ الْغَدَاةِ كَأَنَّ الْأَذَانَ بِأُذُنَيْهِ قَالَ خَلَفٌ أَرَأَيْتَ الرَّكْعَتَيْنِ قَبْلَ الْغَدَاةِ وَلَمْ يَذْكُرْ صَلَاةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9326,
                "hadithNumber": "1762",
                "englishNarrator": "Anas bin Sirin reported:",
                "hadithEnglish": "I asked Ibn 'Umar رضی اللہ تعالیٰ عنہ like this (as recorded in the previous hadith) and he made this addition: And he (the Holy Prophet) made the end of the night prayer as odd number by one rak'ah. And there is also (this addition): Stop, stop, you are bulky.",
                "hadithUrdu": "میں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے پوچھا ۔ ۔ ۔ پھر مذکورہ بالا حدیث کی طرح حدیث بیان کی اور اس میں یہ اضافہ کیا : رات کے آخری حصے میں ایک رکعت وتر پڑھتے ۔ اس میں ہے ( اور میرے دوبارہ سوا ل پر ) کہا : بس ، بس ، تم ایک بوجھل آدمی ہو ۔",
                "urduNarrator": "ہم سے ابن المثنیٰ اور ابن بشار نے بیان کیا، کہا: ہم سے محمد بن جعفر نے بیان کیا, شعبہ نے انس بن سیرین سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا ابْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَنَسِ بْنِ سِيرِينَ قَالَ سَأَلْتُ ابْنَ عُمَرَ بِمِثْلِهِ وَزَادَ وَيُوتِرُ بِرَكْعَةٍ مِنْ آخِرِ اللَّيْلِ وَفِيهِ فَقَالَ بَهْ بَهْ إِنَّكَ لَضَخْمٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9327,
                "hadithNumber": "1763",
                "englishNarrator": "Ibn 'Umar رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The night prayer consists of pairs and when you see the approach of dawn, make this number odd by one rak'ah. It was said to Ibn 'Umar رضی اللہ تعالیٰ عنہ : What does the (word) pair imply? He said: (It means) that salutation is uttered after every two rak'ahs.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" رات کی نماز دو رکعت ہے اور جب تم دیکھو کہ صبح آیا چاہتی ہے تو ایک رکعت سے ( اپنی نماز کو ) وتر کرو ۔ \" ابن عمر رضی اللہ تعالیٰ عنہ سے عرض کی گئی : مثنیٰ ، مثنیٰ ، کا کیا مفہوم ہے؟انھوں نے کہا : یہ کہ تم ہر دو رکعتوں ( کے آخر ) میں سلام پھیرو ۔",
                "urduNarrator": "ہم سے محمد بن المثنیٰ نے بیان کیا، ہم سے محمد بن جعفر نے بیان کیا، ہم سے شعبہ نے بیان کیا، انہوں نے کہاعقبہ بن حریث نے کہا , میں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے سنا ، وہ حدیث بیان کررہے تھے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ عُقْبَةَ بْنَ حُرَيْثٍ قَالَ سَمِعْتُ ابْنَ عُمَرَ يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ صَلَاةُ اللَّيْلِ مَثْنَى مَثْنَى فَإِذَا رَأَيْتَ أَنَّ الصُّبْحَ يُدْرِكُكَ فَأَوْتِرْ بِوَاحِدَةٍ فَقِيلَ لِابْنِ عُمَرَ مَا مَثْنَى مَثْنَى قَالَ أَنْ تُسَلِّمَ فِي كُلِّ رَكْعَتَيْنِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9328,
                "hadithNumber": "1764",
                "englishNarrator": "Abu Sa'id (al Khudri) رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Observe Witr prayer before it is morning.",
                "hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم نے فرمایا : \" صبح سے پہلے پہلے وتر پڑھ لو ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے عبد الاعلٰی بن عبد الاعلٰی نے بیان کیا,معمرنے یحییٰ بن ابی کثیر سے ، انھوں نے ابو نضرہ سے اور انھوں نے حضرت ابو سعید رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الْأَعْلَى بْنُ عَبْدِ الْأَعْلَى عَنْ مَعْمَرٍ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَوْتِرُوا قَبْلَ أَنْ تُصْبِحُوا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9329,
                "hadithNumber": "1765",
                "englishNarrator": "Abu Sa'id رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "They (some of the Companions) of the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) asked the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) about Witr. He said: Observe Witr before morning.",
                "hadithUrdu": "انھوں ( صحابہ ) نے نبی اکرم صلی اللہ علیہ وسلم سے وتر کے بارے میں سوال کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" صبح ہونے سے پہلے وتر پڑھ لو ۔ \"",
                "urduNarrator": "اور مجھ سے اسحاق بن منصور نے بیان کیا، مجھ سے عبید اللہ نے بیان کیا, شیبان نے یحییٰ ( بن ابی کثیر ) سے روایت کی ، انھوں نے کہا : ابو نضرۃ عوقی نے مجھے بتایا کہ حضرت ابو سعید رضی اللہ تعالیٰ عنہ نے انھیں بتایا کہ",
                "hadithArabic": "و حَدَّثَنِي إِسْحَقُ بْنُ مَنْصُورٍ أَخْبَرَنِي عُبَيْدُ اللَّهِ عَنْ شَيْبَانَ عَنْ يَحْيَى قَالَ أَخْبَرَنِي أَبُو نَضْرَةَ الْعَوَقِيُّ أَنَّ أَبَا سَعِيدٍ أَخْبَرَهُمْ أَنَّهُمْ سَأَلُوا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْوِتْرِ فَقَالَ أَوْتِرُوا قَبْلَ الصُّبْحِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9330,
                "hadithNumber": "1766",
                "englishNarrator": "Jabir رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: If anyone is afraid that he may not get up in the latter part of the night, he should observe Witr in the first part of it; and if anyone is eager to get up in the last part of it, he should observe Witr at the end of the night, for prayer at the end of the night is witnessed (by the angels) and that is preferable.\r\n\"Abu Muaviyah (in his narration) said: \"is attended.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" جسے ڈر ہو کہ وہ رات کے آخری حصے میں نہیں اٹھ سکے گا ، وہ رات کے شروع میں وتر پڑھ لے ۔ اور جسے امید ہو کہ وہ رات کے آخر میں اٹھ جائے گا ، وہ رات کے آخر میں وتر پڑھے کیونکہ رات کے آخری حصے کی نماز کا مشاہدہ کیا جاتا ہے اور یہ افضل ہے ۔ \"\" ابومعاویہ نے ( مشهوده کی بجائے ) محضورة ( اس میں حاضری دی جاتی ہے ) کہا ۔ ( مفہوم ایک ہی ہے ) -",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, حفص اور ابو معاویہ نے اعمش سے حدیث سنائی ، انھوں نے ابو سفیان سے اور انھوں نے حضرت جابر رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا حَفْصٌ وَأَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ خَافَ أَنْ لَا يَقُومَ مِنْ آخِرِ اللَّيْلِ فَلْيُوتِرْ أَوَّلَهُ وَمَنْ طَمِعَ أَنْ يَقُومَ آخِرَهُ فَلْيُوتِرْ آخِرَ اللَّيْلِ فَإِنَّ صَلَاةَ آخِرِ اللَّيْلِ مَشْهُودَةٌ وَذَلِكَ أَفْضَلُ و قَالَ أَبُو مُعَاوِيَةَ مَحْضُورَةٌ.",
                "headingArabic": "مَنْ خَافَ أَنْ لاَ يَقُومَ مِنْ آخِرِ اللَّيْلِ فَلْيُوتِرْ أَوَّلَهُ",
                "headingUrdu": "جس کو یہ خوف ہو کہ رات کے آخری حصے میں نہ اٹھے گا تو وہ رات کے شروع میں وتر پڑھے۔",
                "headingEnglish": "One who fears that he will not get up at the end of the night, then he should pray Witr at the beginning of the night",
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9331,
                "hadithNumber": "1767",
                "englishNarrator": "Jabir رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who amongst you is afraid that he may not be able to get up at the end of the night should observe Witr (in the first part) and then sleep, and he who is confident of getting up and praying at night (i. e. Tahajjud prayer) should observe it at the end of it, for the recitation at the end of the night is witnessed*, and that is better.",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ فرمارہے تھے : \" تم میں سے جسے یہ خدشہ ہوکہ وہ رات کے آخر میں نہیں اٹھ سکے گا تو وہ وتر پڑھ لے ، پھر سوجائے اور جسے رات کو اٹھ جانے کا یقین ہو ، وہ رات کے آخرمیں وتر پڑھے کیونکہ رات کے آخری حصے میں قراءت کے وقت حاضری دی جاتی ہے اور یہ بہتر ہے ۔ \"",
                "urduNarrator": "مجھ سے سلمہ بن شبیب نے بیان کیا، ہم سے حسن بن عیان نے بیان کیا، ان سے معقل نے جو ابن عبید اللہ ہیں، انہوں نے بیان کیا, ابو زبیر نے حضرت جابر رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ حَدَّثَنَا مَعْقِلٌ وَهُوَ ابْنُ عُبَيْدِ اللَّهِ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ أَيُّكُمْ خَافَ أَنْ لَا يَقُومَ مِنْ آخِرِ اللَّيْلِ فَلْيُوتِرْ ثُمَّ لِيَرْقُدْ وَمَنْ وَثِقَ بِقِيَامٍ مِنْ اللَّيْلِ فَلْيُوتِرْ مِنْ آخِرِهِ فَإِنَّ قِرَاءَةَ آخِرِ اللَّيْلِ مَحْضُورَةٌ وَذَلِكَ أَفْضَلُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9332,
                "hadithNumber": "1768",
                "englishNarrator": "Jabir رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The most excellent prayer is that in which the duration of standing is longer.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" قیام کا لمبا ہونا بہترین نماز ہے ۔ \"",
                "urduNarrator": "ہم سے عبد بن حمید نے بیان کیا، کہا ہم سے ابو عاصم نے بیان کیا، کہا ہم سے ابن جریج نے بیان کیا، انہوں نے کہا کہ مجھ سےابو زبیر نے حضرت جابر رضی اللہ تعالیٰ عنہ سے ر وایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا أَبُو عَاصِمٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفْضَلُ الصَّلَاةِ طُولُ الْقُنُوتِ.",
                "headingArabic": "أَفْضَلُ الصَّلاَةِ طُولُ الْقُنُوتِ ‏",
                "headingUrdu": "بہترین نماز وہ ہے جس میں دیر تک کھڑا رہے (تولو قنوت)",
                "headingEnglish": "The best prayer is that in which one stands for a long time (tuwlul-qunut)",
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9333,
                "hadithNumber": "1769",
                "englishNarrator": "Jabir رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was asked about the prayer which was most excellent. He said: That in which the standing is longer. (This hadith is narrated by another chain of transmitters too.)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم سے پوچھاگیا : کون سی نمازافضل ہے؟آپ نے فرمایا : \"\" قیام کا لمبا ہونا ۔ \"\" ابو بکر بن ابی شیبہ نے کہا : ابومعاویہ نے ہمیں اعمش سے حدیث بیان کی ۔",
                "urduNarrator": "ابو بکر بن ابی شیبہ اور ابو کریب دونوں نے کہا : ہمیں ابو معاویہ نے حدیث بیان کی ، انھوں نے کہا : ہمیں اعمش نے ابو سفیان سے حدیث سنائی اور انھوں نے حضرت جابر رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ قَالَ سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّ الصَّلَاةِ أَفْضَلُ قَالَ طُولُ الْقُنُوتِ قَالَ أَبُو بَكْرٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9334,
                "hadithNumber": "1770",
                "englishNarrator": "Jabir رضی اللہ تعالیٰ عنہ said:",
                "hadithEnglish": "He heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) say: There is an hour during the night in which no Muslim individual will ask Allah for good in this world and the next without His giving it to him; and that applies to every night.",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ فرماتے تھے : \" رات میں ایک گھڑی ایسی ہے ۔ جو مسلمان بندہ بھی اس کو پالیتا ہے ۔ اس میں وہ دنیا وآخرت کی کسی بھی خیر اور بھلائی کا سوال کرتا ہےتو اللہ اسے وہ ( بھلائی ) ضرور عطا فرمادیتا ہے ۔ اور یہ گھڑی ہر رات میں ہوتی ہے ۔ \"",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ نے بیان کیا، ہم سے جریر نے بیان کیا، انہوں نے العماش کی سند سے, ابو سفیان سے روایت ہے ، انھوں نے حضرت جابر رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ فِي اللَّيْلِ لَسَاعَةً لَا يُوَافِقُهَا رَجُلٌ مُسْلِمٌ يَسْأَلُ اللَّهَ خَيْرًا مِنْ أَمْرِ الدُّنْيَا وَالْآخِرَةِ إِلَّا أَعْطَاهُ إِيَّاهُ وَذَلِكَ كُلَّ لَيْلَةٍ.",
                "headingArabic": "فِي اللَّيْلِ سَاعَةٌ مُسْتَجَابٌ فِيهَا الدُّعَاءُ ‏",
                "headingUrdu": "رات میں ایک گھڑی ایسی ہوتی ہے جب دعائیں قبول ہوتی ہیں۔",
                "headingEnglish": "In the night there is an hour when supplications are answered",
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9335,
                "hadithNumber": "1771",
                "englishNarrator": "Jabir رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "I heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: There is an hour during the night in which no Muslim bondman will ask Allah for good in this world and the next but He will grant it to him.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" رات میں ایک ایسی گھڑی ہے جو مسلمان بھی اسے پالیتا ہے اور اس میں اللہ سے کسی بھی خیر کا سوال کرتا ہے تو وہ اسے وہ ( بھلائی ) عطا فرمادیتا ہے ۔ \"",
                "urduNarrator": "مجھ سے سلمہ بن شبیب نے بیان کیا، ہم سے حسن بن عین نے بیان کیا، ہم سے معقل نے بیان کیا, ابو زبیر رضی اللہ تعالیٰ عنہ نے حضرت جابر رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ حَدَّثَنَا مَعْقِلٌ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ مِنْ اللَّيْلِ سَاعَةً لَا يُوَافِقُهَا عَبْدٌ مُسْلِمٌ يَسْأَلُ اللَّهَ خَيْرًا إِلَّا أَعْطَاهُ إِيَّاهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9336,
                "hadithNumber": "1772",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Our Lord, the Blessed and the Exalted, descends every night to the lowest heaven when one-third of the latter part of the night is left, and says: Who supplicates Me so that I may answer him? Who asks Me so that I may give to him? Who asks Me forgiveness so that I may forgive him?",
                "hadithUrdu": "ر سول اللہ صلی اللہ علیہ وسلم نے فرمایا : برکت اور رفعت کا مالک ہمارا رب ، ہر رات کو جب رات کا آخری تہائی حصہ باقی رہ جاتا ہے ، ( تو ) دنیا کے آ سمان پر نزول فرماتا ہے اور کہتا ہے : کون مجھے پکارتا ہے کہ میں اس کی پکار کو سنوں؟کون مجھ سے مانگتا ہے کہ میں اس کو دوں ، اور کون مجھ سے بخشش طلب کرتاہے کہ میں اسے بخش دوں؟ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے مالک رضی اللہ عنہ سے اس کے متعلق پڑھا, ابن شہاب نے ابو عبداللہ اغز اور ابو سلمہ بن عبدالرحمان سے ، انھوں نے حضرت ابو ہریر ہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي عَبْدِ اللَّهِ الْأَغَرِّ وَعَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَنْزِلُ رَبُّنَا تَبَارَكَ وَتَعَالَى كُلَّ لَيْلَةٍ إِلَى السَّمَاءِ الدُّنْيَا حِينَ يَبْقَى ثُلُثُ اللَّيْلِ الْآخِرُ فَيَقُولُ مَنْ يَدْعُونِي فَأَسْتَجِيبَ لَهُ وَمَنْ يَسْأَلُنِي فَأُعْطِيَهُ وَمَنْ يَسْتَغْفِرُنِي فَأَغْفِرَ لَهُ.",
                "headingArabic": "التَّرْغِيبِ فِي الدُّعَاءِ وَالذِّكْرِ فِي آخِرِ اللَّيْلِ وَالإِجَابَةِ فِيهِ ‏",
                "headingUrdu": "رات کے آخر میں ذکر و اذکار پڑھنے کی ترغیب اور اس کا جواب",
                "headingEnglish": "Encouragement to supplicate and recite statements of remembrance at the end of the night, and the response to that",
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9337,
                "hadithNumber": "1773",
                "englishNarrator": "Abu Huraira reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Allah descends every night to the lowest heaven when one-third of the first part of the night is over and says: I am the Lord; I am the Lord: who is there to supplicate Me so that I answer him? Who is there to beg of Me so that I grant him? Who is there to beg forgiveness from Me so that I forgive him? He continues like this till the day breaks.",
                "hadithUrdu": "آپ نے فرمایا : \" اللہ تعالیٰ ہر رات کو ، جب رات کا پہلا تہائی حصہ گزر جاتا ہے ، دنیا کے آسمان پر نزول فرماتا ہے اور کہتا ہے : میں بادشاہ ہوں ، صرف میں بادشاہ ہوں ، کون ہے جو مجھے پکارتا ہے ہے کہ میں اس کی پکار کو سنوں؟کو ن ہے جو مجھ سے مانگتا ہے کہ میں اسے دوں؟کون ہے جو مجھ سے مغفرت طلب کرتا ہے کہ میں اسے معاف کروں؟وہ یہی اعلان فرماتا رہتا ہے حتیٰ کہ صبح چمک اٹھتی ہے ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ہم سے یعقوب نے بیان کیا اور وہ عبد الرحمن القاری کے بیٹے ہیں,سہیل کے والد ابو صالح نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے اور انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی",
                "hadithArabic": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا يَعْقُوبُ وَهُوَ ابْنُ عَبْدِ الرَّحْمَنِ الْقَارِيُّ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَنْزِلُ اللَّهُ إِلَى السَّمَاءِ الدُّنْيَا كُلَّ لَيْلَةٍ حِينَ يَمْضِي ثُلُثُ اللَّيْلِ الْأَوَّلُ فَيَقُولُ أَنَا الْمَلِكُ أَنَا الْمَلِكُ مَنْ ذَا الَّذِي يَدْعُونِي فَأَسْتَجِيبَ لَهُ مَنْ ذَا الَّذِي يَسْأَلُنِي فَأُعْطِيَهُ مَنْ ذَا الَّذِي يَسْتَغْفِرُنِي فَأَغْفِرَ لَهُ فَلَا يَزَالُ كَذَلِكَ حَتَّى يُضِيءَ الْفَجْرُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9338,
                "hadithNumber": "1774",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When half of the night or two-third of it is over. Allah, the Blessed and the Exalted, descends to the lowest heaven and says: Is there any beggar, so that he be given? Is there any supplicator so that he be answered? Is there any beggar of forgiveness so that he be forgiven? (And Allah continues it saying) till it is daybreak.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب رات کا آدھا یا دو تہائی حصہ گزر جاتا ہے توا للہ تبارک وتعا لیٰ آسمان دنیا پر نزول فرماتا ہے اور کہتا ہے : کیا کوئی مانگنے والا ہے کہ اسے دیاجائے؟کیا کوئی د عا کرنے والا ہے کہ اس کی دعا قبول کی جائے؟کیاکوئی بخشش کا طلبگار ہے کہ اسے بخشا جائے حتیٰ کہ صبح پھوٹ پڑتی ہے ۔ \"",
                "urduNarrator": "ہم سے اسحاق بن منصور نے بیان کیا، کہا ہم سے ابو المغیرہ نے بیان کیا، کہا ہم سے اوزاعی نے بیان کیا، ہم سے یحییٰ نے بیان کیا، کہا ہم سے یحییٰ نے بیان کیا, ابو بن سلمہ عبدالرحمن نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے حدیث بیا ن کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ أَخْبَرَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا الْأَوْزَاعِيُّ حَدَّثَنَا يَحْيَى حَدَّثَنَا أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا مَضَى شَطْرُ اللَّيْلِ أَوْ ثُلُثَاهُ يَنْزِلُ اللَّهُ تَبَارَكَ وَتَعَالَى إِلَى السَّمَاءِ الدُّنْيَا فَيَقُولُ هَلْ مِنْ سَائِلٍ يُعْطَى هَلْ مِنْ دَاعٍ يُسْتَجَابُ لَهُ هَلْ مِنْ مُسْتَغْفِرٍ يُغْفَرُ لَهُ حَتَّى يَنْفَجِرَ الصُّبْحُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 9026,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=361",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=359",
                "label": "359",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=360",
                "label": "360",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=361",
                "label": "361",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=362",
                "label": "362",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=363",
                "label": "363",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=364",
                "label": "364",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=365",
                "label": "365",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=363",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=363",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=361",
        "to": 9050,
        "total": 40465
    }
}