{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 474,
        "data": [
            {
                "id": 12114,
                "hadithNumber": "4550",
                "englishNarrator": "It is narrated by Sa'b bin Jaththama رضی اللہ عنہ :",
                "hadithEnglish": "He said (to the Holy Prophet ﷺ): Messenger of Allah, we kill the children of the polytheists during the night raids. He said: They are from them.",
                "hadithUrdu": "میں نے عرض کی : اے اللہ کے رسول! شب خون میں ہم مشرکین کی عورتوں اور بچوں کو نقصان پہنچا دیتے ہیں ۔ آپ نے فرمایا : وہ انہی میں سے ہیں.",
                "urduNarrator": "ہم سے عبد بن حمید نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا, معمر نے ہمیں زہری سے خبر دی ، انہوں نے عبیداللہ بن عبداللہ بن عتبہ سے ، انہوں نے حضرت ابن عباس رضی اللہ عنہ سے اور انہوں نے حضرت صعب بن جثامہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللهِ بْنِ عَبْدِ اللهِ بْنِ عُتْبَةَ، عَنِ ابْنِ عَبَّاسٍ، عَنِ الصَّعْبِ بْنِ جَثَّامَةَ، قَالَ: قُلْتُ: يَا رَسُولَ اللهِ، إِنَّا نُصِيبُ فِي الْبَيَاتِ مِنْ ذَرَارِيِّ الْمُشْرِكِينَ، قَالَ: «هُمْ مِنْهُمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12115,
                "hadithNumber": "4551",
                "englishNarrator": "Sa'b bin Jaththama رضی اللہ عنہ has narrated:",
                "hadithEnglish": "The Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) asked: What about the children of polytheists killed by the cavalry during the night raid? He said: They are from them.",
                "hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم سے پوچھا گیا کہ اگر کچھ گھڑ سوار رات کو دھاوا بولیں اور مشرکوں کے ( ساتھ ان کے کچھ ) بیٹوں کو ( بھی ) قتل کر دیں ( تو گناہ تو نہیں ہے؟ ) آپ صلی اللہ علیہ وسلم نے فرمایا : \" وہ اپنے آباء ہی میں سے ہیں.",
                "urduNarrator": "مجھ سے محمد بن رافع نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، ہم سے ابن جریج نے بیان کیا, عمرو بن دینار نے مجھے خبر دی کہ انہیں ابن شہاب نے عبیداللہ بن عبداللہ بن عتبہ سے خبر دی ، انہوں نے حضرت ابن عباس رضی اللہ عنہ سے اور انہوں نے حضرت صعب بن جثامہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ، أَنَّ ابْنَ شِهَابٍ، أَخْبَرَهُ، عَنْ عُبَيْدِ اللهِ بْنِ عَبْدِ اللهِ بْنِ عُتْبَةَ، عَنِ ابْنِ عَبَّاسٍ، عَنِ الصَّعْبِ بْنِ جَثَّامَةَ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قِيلَ لَهُ: لَوْ أَنَّ خَيْلًا أَغَارَتْ مِنَ اللَّيْلِ، فَأَصَابَتْ مِنْ أَبْنَاءِ الْمُشْرِكِينَ؟ قَالَ: «هُمْ مِنْ آبَائِهِمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12116,
                "hadithNumber": "4552",
                "englishNarrator": "It is narrated on the authority of 'Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) ordered the date-palms of Banu Nadir to be burnt and cut. These palms were at Buwaira. Qutaibah and Ibn Rumh in their versions of the tradition have added: So Allah, the Glorious and Exalted, revealed the verse: Whatever trees you have cut down or left standing on their trunks, it was with the permission of Allah so that He may disgrace the evil-doers (lix.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے بنونضیر کے کھجور کے درخت جلائے اور کاٹ ڈالے اور یہ بویرہ کا مقام تھا ( جہاں یہ درخت واقع تھےقتیبہ اور ابن رمح نے اپنی حدیث میں یہ اضافہ کیا : اس پر اللہ عزوجل نے یہ آیت نازل فرمائی : \" تم نے کھجور کا جو درخت کاٹ ڈالا یا اسے اپنی جڑوں پر کھڑا چھوڑ دیا تو وہ اللہ کی اجازت سے تھا اور اس لیے تاکہ وہ ( اللہ ) نافرمانوں کو رسوا کرے.",
                "urduNarrator": "یحییٰ بن یحییٰ ، محمد بن رمح اور قتیبہ بن سعید نے لیث سے حدیث بیان کی ، انہوں نے نافع سے اور انہوں نے حضرت عبداللہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَمُحَمَّدُ بْنُ رُمْحٍ، قَالَا: أَخْبَرَنَا اللَّيْثُ، ح وحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللهِ، «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حَرَّقَ نَخْلَ بَنِي النَّضِيرِ، وَقَطَعَ، وَهِيَ الْبُوَيْرَةُ»، زَادَ قُتَيْبَةُ، وَابْنُ رُمْحٍ فِي حَدِيثِهِمَا: فَأَنْزَلَ اللهُ عَزَّ وَجَلَّ: {مَا قَطَعْتُمْ مِنْ لِينَةٍ أَوْ تَرَكْتُمُوهَا قَائِمَةً عَلَى أُصُولِهَا فَبِإِذْنِ اللهِ وَلِيُخْزِيَ الْفَاسِقِينَ.",
                "headingArabic": "جَوَازِ قَطْعِ أَشْجَارِ الْكُفَّارِ وَتَحْرِيقِهَا ‏‏",
                "headingUrdu": "کفار کے درختوں کو کاٹ کر جلانا جائز ہے۔",
                "headingEnglish": "Permissibility of cutting down the trees of the Kuffar and burning them",
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12117,
                "hadithNumber": "4553",
                "englishNarrator": "It is narrated on the authority of Ibn Umar رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) caused the date-palms of Banu Nadir to be cut down and burnt. It is in this connection that Hassan (the poet) said: It was easy for the nobles of Quraish to burn Buwaira whose sparks were flying in all directions, in the same connection was revealed the Qur'anic verse: Whatever trees you have cut down or left standing on their trunks.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے بنونضیر کے کھجوروں کے درخت کاٹے اور جلا دیے ۔ اسی کے بارے میں حضرت حسان رضی اللہ عنہ کہتے ہیں : \"\" بنو لؤی ( قریش ) کے سرداروں کے لیے بویرہ میں ہر طرف پھیلنے والی آگ کی کوئی حیثیت نہ تھی اور اسی کے بارے میں یہ آیت نازل ہوئی : \"\" تم نے کھجور کا جو بھی درخت کاٹا یا اسے چھوڑ دیا ۔ ۔ \"\" آیت کے آخر تک",
                "urduNarrator": "ہم سے سعید بن منصور اور ہناد بن الساری نے بیان کیا، کہا کہ ہم سے ابن المبارک نے بیان کیا، موسیٰ بن عقبہ نے نافع سے ، انہوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، وَهَنَّادُ بْنُ السَّرِيِّ، قَالَا: حَدَّثَنَا ابْنُ الْمُبَارَكِ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَطَعَ نَخْلَ بَنِي النَّضِيرِ، وَحَرَّقَ»، وَلَهَا يَقُولُ حَسَّانُ: وَهَانَ عَلَى سَرَاةِ بَنِي لُؤَيٍّ ... حَرِيقٌ بِالْبُوَيْرَةِ مُسْتَطِيرُ ، وَفِي ذَلِكَ نَزَلَتْ: {مَا قَطَعْتُمْ مِنْ لِينَةٍ أَوْ تَرَكْتُمُوهَا قَائِمَةً عَلَى أُصُولِهَا} [الحشر: 5] الْآيَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12118,
                "hadithNumber": "4554",
                "englishNarrator": "Abdullah bin Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) burnt the date-palms of Banu Nadir.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے بنونضیر کی کھجوروں کے درخت جلا دیے.",
                "urduNarrator": "ہم سے سہل بن عثمان نے بیان کیا، کہا کہ مجھ سے عقبہ بن خالد السکونی نے بیان کیا, عبیداللہ نے نافع سے اور انہوں نے حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا سَهْلُ بْنُ عُثْمَانَ، أَخْبَرَنِي عُقْبَةُ بْنُ خَالِدٍ السَّكُونِيُّ، عَنْ عُبَيْدِ اللهِ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللهِ بْنِ عُمَرَ، قَالَ: «حَرَّقَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَخْلَ بَنِي النَّضِيرِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12119,
                "hadithNumber": "4555",
                "englishNarrator": "It has been narrated by Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: One of the Prophets made a holy war. He said to his followers: One who has married a woman and wants to consummate to his marriage but has not yet done so; another who has built a house but has not yet erected its roof; and another who has bought goats and pregnantshe-camels and is waiting for their offspring-will not accommpany me. So he marched on and approached a village at or about the time of the Asr prayers. He said to the sun: Thou art subserviant (to Allah) and so am I. O Allah, stop it for me a little. It was stopped for him until Allah granted him victory. The people gathered the spoils of war (at one place). A fire approached the spoils to devour them, but it did not devour them. He (the Holy Prophet) said: Some of you have been guilty of misappropriation. So one man from each tribe should swear fealty to me. The did so (putting their hands into his). The hand of one man stuck to his hand and the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Your tribe is guilty of misappropriation. Let all the members of your tribe swear fealty to me one by one. They did so, when the hands of two or three persons got stuck with his hand. He said: You have misappropriated. So they took out gold equal in volume to the head of a cow. They-placed it among the spoils on the earth. Then the fire approached the spoils and devoured them. The spoils of war were not made lawful for any people before us, This is because Allah saw our weakness and humility and made them lawful for us.",
                "hadithUrdu": "اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" انبیاء میں سے کسی نبی نے جہاد کیا تو انہوں نے اپنی قوم سے کہا : میرے ساتھ وہ آدمی نہ آئے جس نے کسی عورت سے شادی کی ہے ، وہ اس کے ساتھ شب زفاف گزارنا چاہتا ہے اور ابھی تک نہیں گزاری ، نہ وہ جس نے گھر تعمیر کیا ہے اور ابھی تک اس کی چھتیں بلند نہیں کیں اور نہ وہ جس نے بکریاں یا حاملہ اونٹنیاں خریدی ہیں اور وہ ان کے بچہ دینے کا منتظر ہے ۔ کہا : وہ جہاد کے لیے نکلے ، نماز عصر کے وقت یا اس کے قریب ، وہ بستی کے نزدیک پہنچے تو انہوں نے سورج سے کہا : تو بھی ( اللہ کے حکم کا ) پابند ہے اور میں بھی پابند ہوں ، اے اللہ! اسے کچھ وقت کے لیے مجھ پر روک دے ۔ تو اسے روک دیا گیا ، حتی کہ اللہ نے انہیں فتح دی ۔ کہا : انہیں غنیمت میں جو ملا ، انہوں نے اس کو اکٹھا کر لیا ، آگ اسے کھانے کے لیے آئی تو اسے کھانے سے باز رہی ۔ اس پر انہوں نے کہا : تمہارے درمیان خیانت ( کا ارتکاب ہوا ) ہے ، ہر قبیلے کا ایک آدمی میری بیعت کرے ۔ انہوں نے ان کی بیعت کی تو ایک آدمی کا ہاتھ ان کے ہاتھ سے چمٹ گیا ۔ انہوں نے کہا : خیانت تم لوگوں میں ہوئی ہے ، لہذا تمہارا قبیلہ میری بیعت کرے ۔ اس قبیلے نے ان کی بیعت کی تو ( آپ کا ہاتھ ) دو یا تین آدمیوں کے ہاتھ سے چمٹ گیا ۔ اس پر انہوں نے کہا : خیانت تم میں ہے ، تم نے خیانت کی ہے ۔ کہا : تو وہ گائے کے سر کے بقدر سونا نکال کر ان کے پاس لے آئے ۔ کہا : انہوں نے اسے مالِ غنیمت میں رکھا ، وہ بلند جگہ پر رکھا ہوا تھا ، تو آگ آئی اور اسے کھا گئی ۔ اموالِ غنیمت ہم سے پہلے کسی کے لیے حلال نہ تھے ، یہ ( ہمارے لیے حلال ) اس وجہ سے ہوا کہ اللہ تبارک و تعالیٰ نے ہماری کمزوری اور عجز کو دیکھا تو اس نے ان کو ہمارے لیے حلال کر دیا ۔",
                "urduNarrator": "ہم سے ابو کریب محمد بن العلاء نے بیان کیا، ہم سے ابن المبارک نے بیان کیا، ان سے معمر نے بیان کیا، ہم سے محمد بن رافع نے بیان کیا اور ہم سے اس کا تلفظ عبد نے بیان کیا۔ الرزاق، معمر نے ہمیں بتایا، ہمام بن منبہ سے روایت ہے ، انہوں نے کہا : یہ ( احادیث ) ہیں جو ہمیں حضرت ابوہریرہ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے بیان کیں ، پھر انہوں نے چند احادیث بیان کیں ، ان میں سے ( ایک ) یہ ہے",
                "hadithArabic": "وحَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ، حَدَّثَنَا ابْنُ الْمُبَارَكِ، عَنْ مَعْمَرٍ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، وَاللَّفْظُ لَهُ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ: هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَذَكَرَ أَحَادِيثَ مِنْهَا، وَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: غَزَا نَبِيٌّ مِنَ الْأَنْبِيَاءِ، فَقَالَ لِقَوْمِهِ: لَا يَتْبَعْنِي رَجُلٌ قَدْ مَلَكَ بُضْعَ امْرَأَةٍ، وَهُوَ يُرِيدُ أَنْ يَبْنِيَ بِهَا، وَلَمَّا يَبْنِ، وَلَا آخَرُ قَدْ بَنَى بُنْيَانًا، وَلَمَّا يَرْفَعْ سُقُفَهَا، وَلَا آخَرُ قَدِ اشْتَرَى غَنَمًا - أَوْ خَلِفَاتٍ - وَهُوَ مُنْتَظِرٌ وِلَادَهَا ، قَالَ: فَغَزَا فَأَدْنَى لِلْقَرْيَةِ حِينَ صَلَاةِ الْعَصْرِ، أَوْ قَرِيبًا مِنْ ذَلِكَ، فَقَالَ لِلشَّمْسِ: أَنْتِ مَأْمُورَةٌ، وَأَنَا مَأْمُورٌ، اللهُمَّ، احْبِسْهَا عَلَيَّ شَيْئًا، فَحُبِسَتْ عَلَيْهِ حَتَّى فَتَحَ اللهُ عَلَيْهِ ، قَالَ: فَجَمَعُوا مَا غَنِمُوا، فَأَقْبَلَتِ النَّارُ لِتَأْكُلَهُ، فَأَبَتْ أَنْ تَطْعَمَهُ، فَقَالَ: فِيكُمْ غُلُولٌ، فَلْيُبَايِعْنِي مِنْ كُلِّ قَبِيلَةٍ رَجُلٌ، فَبَايَعُوهُ، فَلَصِقَتْ يَدُ رَجُلٍ بِيَدِهِ، فَقَالَ: فِيكُمُ الْغُلُولُ، فَلْتُبَايِعْنِي قَبِيلَتُكَ، فَبَايَعَتْهُ ، قَالَ: فَلَصِقَتْ بِيَدِ رَجُلَيْنِ أَوْ ثَلَاثَةٍ، فَقَالَ: فِيكُمُ الْغُلُولُ، أَنْتُمْ غَلَلْتُمْ ، قَالَ: فَأَخْرَجُوا لَهُ مِثْلَ رَأْسِ بَقَرَةٍ مِنْ ذَهَبٍ، قَالَ: فَوَضَعُوهُ فِي الْمَالِ وَهُوَ بِالصَّعِيدِ، فَأَقْبَلَتِ النَّارُ فَأَكَلَتْهُ، فَلَمْ تَحِلَّ الْغَنَائِمُ لِأَحَدٍ مِنْ قَبْلِنَا، ذَلِكَ بِأَنَّ اللهَ تَبَارَكَ وَتَعَالَى رَأَى ضَعْفَنَا وَعَجْزَنَا، فَطَيَّبَهَا لَنَا.",
                "headingArabic": "تَحْلِيلِ الْغَنَائِمِ لِهَذِهِ الأُمَّةِ خَاصَّةً ‏‏",
                "headingUrdu": "مال غنیمت صرف اس امت کے لیے مباح کیا گیا ہے۔",
                "headingEnglish": "War booty has been made permissible for this Ummah only",
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12120,
                "hadithNumber": "4556",
                "englishNarrator": "A hadith has been narrated by Mus'ab bin Sa'd who heard it from his father as saying:",
                "hadithEnglish": "My father took a sword from Khums and brought it to the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: Grant it to me. He refused. At this Allah revealed (the Qur'anic verse): They ask thee concerning the spoils of war. Say: The spoils of war are for Allah and the Apostle (viii. 1).",
                "hadithUrdu": "میرے والد نے خمس میں سے کوئی چیز لی ، اسے لے کر نبی صلی اللہ علیہ وسلم کے پاس آئے اور عرض کی : یہ مجھے ہبہ فرما دیں تو آپ نے انکار کیا ۔ کہا : اس پر اللہ عزوجل نے ( یہ حکم ) نازل فرمایا : \" لوگ آپ سے اموالِ غنیمت کے بارے میں پوچھتے ہیں ، کہہ دیجئے : اموالِ غنیمت اللہ کے لیے اور رسول کے لیے ہیں.",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, ابوعوانہ نے سماک سے ، انہوں نے مصعب بن سعد سے اور انہوں نے اپنے والد ( حضرت سعد بن ابی وقاص رضی اللہ عنہ ) سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ سِمَاكٍ، عَنْ مُصْعَبِ بْنِ سَعْدٍ، عَنْ أَبِيهِ، قَالَ: أَخَذَ أَبِي مِنَ الْخُمْسِ سَيْفًا، فَأَتَى بِهِ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «هَبْ لِي هَذَا»، فَأَبَى، فَأَنْزَلَ اللهُ عَزَّ وَجَلَّ: {يَسْأَلُونَكَ عَنِ الْأَنْفَالِ قُلِ الْأَنْفَالُ لِلَّهِ وَالرَّسُولِ} [الأنفال: 1].",
                "headingArabic": "الأَنْفَالِ ‏‏",
                "headingUrdu": "جنگ کی غنیمت",
                "headingEnglish": "Spoils of War",
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12121,
                "hadithNumber": "4557",
                "englishNarrator": "A hadith has been narrated by Mus'ab bin Sa'd who heard it from his father as saying:",
                "hadithEnglish": "Four verses of the Qur'an have been revealed about me. I found a sword (among the spoils of war). It was brought to the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). He (my father) said: Messenger of Allah, bestow it upon me. The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Place it there. Then he (my father) stood up and the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said to him: Place it from where you got it. (At this) he (my father) said again: Messenger of Allah, bestow it upon me Shall I be treated like one who has no share in (the booty)? The Apostle of Allah (may peace be upon him said: Place it from where you got it. At this was revealed the verse: They ask thee about the spoils of war.... Say: The spoils of war are for Allah and the Messenger",
                "hadithUrdu": "میرے بارے میں چار آیتیں نازل ہوئیں : مجھے ایک تلوار ملی ، ( پھر کہا : ) وہ اسے لے کر نبی صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کی : اللہ کے رسول! ( اپنے حصے کے علاوہ ) یہ تلوار مجھے مزید عطا فرما دیں ۔ تو آپ نے فرمایا : \" اسے رکھ دو ۔ \" وہ پھر اٹھے اور عرض کی : اے اللہ کے رسول! ( یہ تلوار ) مجھے مزید دے دیں ۔ تو نبی صلی اللہ علیہ وسلم نے ان سے فرمایا : \" جہاں سے لی ہے وہیں رکھ دو ۔ \" وہ پھر اٹھے اور عرض کی : اللہ کے رسول! ( اپنے حصے کے علاوہ ) یہ بھی مجھے عنایت فرما دیں ۔ تو آپ نے فرمایا : \" اسے رکھ دو ۔ \" وہ پھر اٹھے اور عرض کی : اے اللہ کے رسول! ( اپنے حصے کے علاوہ ) یہ مجھے عنایت فرما دیں ۔ کیا میں اس شخص جیسا قرار دیا جاؤں گا جس کے لیے ( جنگ میں ) کوئی فائدہ نہیں ہوا؟ تو نبی صلی اللہ علیہ وسلم نے اس سے فرمایا : \" تم نے اسے جہاں سے لیا ہے وہیں رکھ دو ۔ \" کہا : اس پر یہ آیت نازل ہوئی : \" وہ آپ سے غنیمتوں کے بارے میں پوچھتے ہیں ۔ کہہ دیجئے! غنیمتیں اللہ کے لیے اور رسول صلی اللہ علیہ وسلم کے لیے ہیں.",
                "urduNarrator": "ہم سے محمد بن المثنیٰ اور ابن بشار نے بیان کیا، اور یہ قول ابن المثنیٰ کا ہے، انہوں نے کہا: ہم سے محمد بن جعفر نے بیان کیا، شعبہ نے ہمیں سماک بن حرب سے حدیث بیان کی ، انہوں نے مصعب بن سعد سے اور انہوں نے اپنے والد سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، وَاللَّفْظُ لِابْنِ الْمُثَنَّى، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ مُصْعَبِ بْنِ سَعْدٍ، عَنْ أَبِيهِ، قَالَ: نَزَلَتْ فِيَّ أَرْبَعُ آيَاتٍ: أَصَبْتُ سَيْفًا، فَأَتَى بِهِ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: يَا رَسُولَ اللهِ، نَفِّلْنِيهِ، فَقَالَ: «ضَعْهُ»، ثُمَّ قَامَ، فَقَالَ لَهُ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «ضَعْهُ مِنْ حَيْثُ أَخَذْتَهُ»، ثُمَّ قَامَ، فَقَالَ: نَفِّلْنِيهِ يَا رَسُولَ اللهِ، فَقَالَ: «ضَعْهُ»، فَقَامَ، فَقَالَ: يَا رَسُولَ اللهِ، نَفِّلْنِيهِ، أَؤُجْعَلُ كَمَنْ لَا غَنَاءَ لَهُ؟ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «ضَعْهُ مِنْ حَيْثُ أَخَذْتَهُ»، قَالَ: فَنَزَلَتْ هَذِهِ الْآيَةُ: {يَسْأَلُونَكَ عَنِ الْأَنْفَالِ قُلِ الْأَنْفَالُ لِلَّهِ وَالرَّسُولِ} [الأنفال: 1].",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12122,
                "hadithNumber": "4558",
                "englishNarrator": "It was narrated that Ibn Umar رضی اللہ عنہ said:",
                "hadithEnglish": "The Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) sent an expedition to Najd and I was among the troops. They got a large number of camels as a booty. Eleven or twelve camels fell to the lot of every fighter and each of them also got one extra camel.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے نجد کی طرف ایک دستہ بھیجا ، میں بھی ان میں تھا ، انہوں نے بہت سے اونٹ غنیمت میں حاصل کیے تو ان کا حصہ بارہ بارہ اونٹ یا گیارہ گیارہ اونٹ تھا اور انہیں ایک ایک اونٹ زائد دیا گیا تھا.",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا , امام مالک نے نافع سے اور انہوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ: بَعَثَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ سَرِيَّةً وَأَنَا فِيهِمْ قِبَلَ نَجْدٍ، فَغَنِمُوا إِبِلًا كَثِيرَةً، فَكَانَتْ سُهْمَانُهُمُ اثْنَا عَشَرَ بَعِيرًا، أَوْ أَحَدَ عَشَرَ بَعِيرًا، وَنُفِّلُوا بَعِيرًا بَعِيرًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12123,
                "hadithNumber": "4559",
                "englishNarrator": "Ibn 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sent an expedition to Najd and Ibn Umar was also among the troops, and their share (of the spoils) came to twelve camels and they were given one camel over and above that. and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) did not make any change in it.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے نجد کی طرف ایک دستہ بھیجا ، ان میں ابن عمر رضی اللہ عنہ بھی تھے ، ان کے حصے بارہ بارہ اونٹ تک پہنچ گئے اور اس کے علاوہ انہیں ایک ایک اونٹ زائد ( بھی ) ملا تو رسول اللہ صلی اللہ علیہ وسلم نے اس ( فیصلے ) کو تبدیل نہیں کیا.",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ہم سے لیث ایچ نے بیان کیا اور ہم سے محمد بن رومح نے بیان کیا، لیث نے نافع سے ، انہوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَعَثَ سَرِيَّةً قِبَلَ نَجْدٍ، وَفِيهِمُ ابْنُ عُمَرَ، وَأَنَّ سُهْمَانَهُمْ بَلَغَتِ اثْنَيْ عَشَرَ بَعِيرًا، وَنُفِّلُوا سِوَى ذَلِكَ بَعِيرًا، فَلَمْ يُغَيِّرْهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12124,
                "hadithNumber": "4560",
                "englishNarrator": "It has been narrated by Ibn 'Umar رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sent an expedition to Najd, and I (also) went with the troops. We got camels and goats as spoils of war, and our share amounted to twelve camels per head, and the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) gave an extra camel to each of us.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے نجد کی جانب ایک دستہ بھیجا ، میں بھی اس میں گیا ۔ ہمیں اونٹ اور بکریاں ملیں تو ہمارے حصے بارہ بارہ اونٹوں تک پہنچ گئے اور رسول اللہ صلی اللہ علیہ وسلم نے ہمیں ایک ایک اونٹ زائد بھی دیا.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, علی بن مسہر اور عبدالرحیم بن سلیمان نے عبیداللہ بن عمر سے ، انہوں نے نافع سے اور انہوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، وَعَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ، عَنْ عُبَيْدِ اللهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ: «بَعَثَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ سَرِيَّةً إِلَى نَجْدٍ، فَخَرَجْتُ فِيهَا، فَأَصَبْنَا إِبِلًا وَغَنَمًا، فَبَلَغَتْ سُهْمَانُنَا اثْنَيْ عَشَرَ بَعِيرًا، اثْنَيْ عَشَرَ بَعِيرًا، وَنَفَّلَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَعِيرًا بَعِيرًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12125,
                "hadithNumber": "4561",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of 'Ubaidullah with the same chain of transmitters.",
                "hadithUrdu": "ہم سے زہیر بن حرب اور محمد بن المثنی نے بیان کیا، کہا: ہم سے یحییٰ نے بیان کیا جب کہ وہٰ قطان نے عبیداللہ سے اسی سند کے ساتھ حدیث بیان کی.",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالَا: حَدَّثَنَا يَحْيَى وَهُوَ الْقَطَّانُ، عَنْ عُبَيْدِ اللهِ، بِهَذَا الْإِسْنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12126,
                "hadithNumber": "4562",
                "englishNarrator": null,
                "hadithEnglish": "I wrote to Nafi' asking him about Nafl (spoils of war) and be wrote to me that Ibn 'Umar رضی اللہ عنہ was among that expedition. (The rest of the hadith is the same.)",
                "hadithUrdu": "ہم سے ابو الربیع اور ابو کامل نے بیان کیا، کہا کہ ہم سے حماد نے بیان کیا، ایوب نے ہمیں حدیث بیان کی ، اور ( ایک دوسری سند سے ) ابن عون نے کہا : میں نے غنیمت کے بارے میں پوچھنے کے لیے نافع کی طرف خط لکھا ، انہوں نے مجھے جواب بھی لکھا کہ حضرت ابن عمر رضی اللہ عنہ دستے میں تھے ۔ ۔ ۔ ، نیز موسیٰ اور اسامہ بن زید نے بھی حدیث بیان کی ، ان سب ( ایوب ، ابن عون ، موسیٰ اور اسامہ ) نے نافع سے اسی سند کے ساتھ انہی کی حدیث کی طرح حدیث بیان کی.",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو الرَّبِيعِ، وَأَبُو كَامِلٍ، قَالَا: حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، ح وحَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنِ ابْنِ عَوْنٍ، قَالَ: كَتَبْتُ إِلَى نَافِعٍ، أَسْأَلُهُ عَنِ النَّفَلِ، فَكَتَبَ إِلَيَّ أَنَّ ابْنَ عُمَرَ كَانَ فِي سَرِيَّةٍ، ح وحَدَّثَنَا ابْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي مُوسَى، ح وحَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي أُسَامَةُ بْنُ زَيْدٍ، كُلُّهُمْ عَنْ نَافِعٍ، بِهَذَا الْإِسْنَادِ نَحْوَ حَدِيثِهِمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12127,
                "hadithNumber": "4563",
                "englishNarrator": "A hadith has been narrated by Salim who learnt it from his father and said:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) gave us an extra (camel) besides our share of Khums; (and in this extra share) I got a Sharif (and a Sharif is a big old camel).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ہمیں خمس سے ہمارے حصے کے سوا اضافی بھی دیا تو مجھے ایک شارف ملا ۔ ۔ اور شارف سے مراد پختہ عمر کا ( مضبوط ) اونٹ ہے.",
                "urduNarrator": "ہم سے سریج بن یونس اور عمرو الناقد نے بیان کیا اور لفظ سوریج ہے، انہوں نے کہا: عبداللہ بن رجاء نے یونس سے ، انہوں نے زہری سے ، انہوں نے سالم سے اور انہوں نے اپنے والد ( حضرت ابن عمر رضی اللہ عنہ ) سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا سُرَيْجُ بْنُ يُونُسَ، وَعَمْرٌو النَّاقِدُ، وَاللَّفْظُ لِسُرَيْجٍ، قَالَا: حَدَّثَنَا عَبْدُ اللهِ بْنُ رَجَاءٍ، عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، قَالَ: نَفَّلَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَفَلًا سِوَى نَصِيبِنَا مِنَ الْخُمْسِ، فَأَصَابَنِي شَارِفٌ، وَالشَّارِفُ: الْمُسِنُّ الْكَبِيرُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12128,
                "hadithNumber": "4564",
                "englishNarrator": "Ibn Shihab reported:",
                "hadithEnglish": "It reached me through Ibn Umar رضی اللہ عنہ that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) gave a share of spoils to the troop. The rest of the hadith is the same.",
                "hadithUrdu": "مجھ حضرت ابن عمر رضی اللہ عنہ سے یہ حدیث پہنچی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے ایک دستے کو زائد دیا ۔ ۔ ابن رجاء کی حدیث کی طرح.",
                "urduNarrator": "ہم سے ہناد بن السری نے بیان کیا, ہم سے ابن المبارک نے بیان کیا، اور مجھ سے حرملہ بن یحییٰ نے بیان کیا، ہم سے ابن وہب نے بیان کیا، یہ دونوں یونس کی سند پر، ابن شہاب کی سند پر، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، حَدَّثَنَا ابْنُ الْمُبَارَكِ، ح وحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، كِلَاهُمَا عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، قَالَ: بَلَغَنِي عَنِ ابْنِ عُمَرَ، قَالَ: نَفَّلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ سَرِيَّةً بِنَحْوِ حَدِيثِ ابْنِ رَجَاءٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12129,
                "hadithNumber": "4565",
                "englishNarrator": "It has been narrated on the authority of Abdullah bin 'Umar رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to give (from the spoils of war) to small troops seat on expeditions something more than the due share of each fighter in a large force. And Khums (one-fifth of the total spoils) was to be reserved (for Allah and His Apostle) in all cases.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم بسا اوقات عام لشکر کی تقسیم سے ہٹ کر بعض دستوں کو ، جنہیں آپ روانہ فرماتے تھے ، خصوصی طور پر ان کے لیے زائد عطیات دیتے تھے ، اور خمس ان سب مہموں میں واجب تھا.",
                "urduNarrator": "ہم سے عبد الملک بن شعیب بن لیث نے بیان کیا، مجھ سے میرے والد نے بیان کیا، وہ میرے دادا کی سند سے, عقیل بن خالد نے ابن شہاب سے ، انہوں نے سالم سے اور انہوں نے حضرت عبداللہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، قَالَ: حَدَّثَنِي عُقَيْلُ بْنُ خَالِدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمٍ، عَنْ عَبْدِ اللهِ، «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَدْ كَانَ يُنَفِّلُ بَعْضَ مَنْ يَبْعَثُ مِنَ السَّرَايَا، لِأَنْفُسِهِمْ خَاصَّةً، سِوَى قَسْمِ عَامَّةِ الْجَيْشِ، وَالْخُمْسُ فِي ذَلِكَ وَاجِبٌ كُلِّهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12130,
                "hadithNumber": "4566",
                "englishNarrator": null,
                "hadithEnglish": "It was narrated that Abu Muhammad Al-Ansari, who was a companion of Abu Qatadah رضی اللہ عنہ , said: Abu Qatadah رضی اللہ عنہ said.... and he narrated the same Hadith as no. 4568).",
                "hadithUrdu": "ہم سے یحییٰ بن یحییٰ التمیمی نے بیان کیا، ہشیم نے یحییٰ بن سعید سے ، انہوں نے عمر بن کثیر بن افلح سے اور انہوں نے ابومحمد انصاری سے روایت کی اور وہ حضرت ابوقتادہ رضی اللہ عنہ کے ہم نشیں تھے ، انہوں نے کہا : حضرت ابوقتادہ رضی اللہ عنہ نے کہا ۔ ۔ اور انہوں ( ابومحمد ) نے حدیث بیان کی.",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، أَخْبَرَنَا هُشَيْمٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عُمَرَ بْنِ كَثِيرِ بْنِ أَفْلَحَ، عَنْ أَبِي مُحَمَّدٍ الْأَنْصَارِيِّ، وَكَانَ جَلِيسًا لِأَبِي قَتَادَةَ، قَالَ: قَالَ أَبُو قَتَادَةَ: وَاقْتَصَّ الْحَدِيثَ.",
                "headingArabic": "اسْتِحْقَاقِ الْقَاتِلِ سَلَبَ الْقَتِيلِ ‏‏",
                "headingUrdu": "قاتل قتل ہونے والے کے سامان کا حقدار ہے۔",
                "headingEnglish": "The killer is entitled to the belongings of the one who is killed",
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12131,
                "hadithNumber": "4567",
                "englishNarrator": null,
                "hadithEnglish": "Abu Muhammad, the freed slave of Abu Qatada رضی اللہ عنہ reported on the authority of Abu Qatda and narrated the hadith.",
                "hadithUrdu": "ہم سے قتیبہ بن سعید نے بیان کیا,  لیث نے یحییٰ بن سعید سے ، انہوں نے عمر بن کثیر بن افلح سے ، انہوں نے ابومحمد ( المعروف بہ ) مولیٰ ابوقتادہ سے روایت کی کہ حضرت ابوقتادہ رضی اللہ عنہ نے کہا ۔ ۔ اور حدیث بیان کی.",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عُمَرَ بْنِ كَثِيرٍ، عَنْ أَبِي مُحَمَّدٍ، مَوْلَى أَبِي قَتَادَةَ، أَنَّ أَبَا قَتَادَةَ، قَالَ: وَسَاقَ الْحَدِيثَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12132,
                "hadithNumber": "4568",
                "englishNarrator": "Abu Qatada رضی اللہ عنہ reported:",
                "hadithEnglish": "We accompanied the Messenger of Allah (ﷺ) on an expedition in the year of the Battle of Hunain. When we encountered the enemy, (some of the Muslims turned back (in fear). I saw that a man from the polytheists overpowered one of the Muslims. I turned round and attacked him from behind giving a blow between his neck and shoulder. He turned towards me and grappled with me in such a way that I began to see death staring me in the face. Then death overtook him and left me alone. I joined 'Umar bin al-Khattab رضی اللہ عنہ who was saying: What has happened to the people (that they are retreating)? I said: It is the Decree of Allah. Then the people returned. (The battle ended in a victory for the Muslims) and the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) sat down (to distribute the spoils of war). He said: One who has killed an enemy and can bring evidence to prove it will get his belongings. So I stood up and said: Who will give evidence for me? Then I sat down. Then he (the Holy Prophet ﷺ) said like this. I stood up (again) and said: Who will bear witness for me? He (the Holy Prophet ﷺ) made the same observation the third time, and I stood up (once again). Now the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: What has happened to you, O Abu Qatada? Then I related the (whole) story, to him. At this, one of the people said: He has told the truth. Messenger of Allah 1 The belongings of the enemy killed by him are with me. Persuade him to forgo his right (in my favour). (Objecting to this proposal) Abu Bakr رضی اللہ عنہ said: BY Allah, this will not happen. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) will not like to deprive one of the lions from among the lions of Allah who fight in the cause of Allah and His Messenger and give thee his share of the booty. So the Messenger of Allah (ﷺ) said: He (Abu Bakr رضی اللہ عنہ ) has told the truth, and so give the belongings to him (Abu Qatada). So he gave them to me. I sold the armour (which was a part of my share of the booty) and bought with the sale proceeds a garden in the street of Banu Salama. This was the first property I acquired after embracing Islam. In a version of the hadith narrated by Laith, the words uttered by Abu Bakr رضی اللہ عنہ are: No, never! He will not give it to a fox from the Quraish leaving aside a lion from the lions of Allah among.... And the hadith is closed with the words: The first property I acquired.",
                "hadithUrdu": "حنین کے سال ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نکلے ، جب ( دشمن سے ) ہمارا سامنا ہوا تو مسلمانوں میں بھگدڑ مچی ۔ کہا : میں نے مشرکوں میں سے ایک آدمی دیکھا جو مسلمانوں کے ایک آدمی پر غالب آ گیا تھا ، میں گھوم کر اس کی طرف بڑھا حتی کہ اس کے پیچھے آ گیا اور اس کی گردن کے پٹھے پر وار کیا ، وہ ( اسے چھوڑ کر ) میری طرف بڑھا اور مجھے اس زور سے دبایا کہ مجھے اس ( دبانے ) سے موت کی بو محسوس ہونے لگی ، پھر اس کو موت نے آ لیا تو اس نے مجھے چھوڑ دیا ، اس کے بعد میری حضرت عمر بن خطاب رضی اللہ عنہ سے ملاقات ہوئی ، انہوں نے پوچھا : لوگوں کو کیا ہو گیا ہے؟ میں نے کہا : اللہ کا حکم ہے ۔ پھر لوگ واپس پلٹے اور رسول اللہ صلی اللہ علیہ وسلم بیٹھ گئے تو آپ نے فرمایا : \"\" جس نے کسی کو قتل کیا ، ( اور ) اس کے پاس اس کی کوئی دلیل ( نشانی وغیرہ ) ہو تو اس ( مقتول ) سے چھینا ہوا سامان اسی کا ہو گا ۔ \"\" کہا : تو میں کھڑا ہوا اور کہا : میرے حق میں کون گواہی دے گا؟ پھر میں بیٹھ گیا ۔ پھر آپ نے اسی طرح ارشاد فرمایا ۔ کہا : تو میں کھڑا ہوا اور کہا : میرے حق میں کون گواہی دے گا؟ پھر میں بیٹھ گیا ۔ پھر آپ نے تیسری بار یہی فرمایا ۔ کہا : میں پھر کھڑا ہوا تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" ابوقتادہ! تمہارا کیا معاملہ ہے؟ \"\" تو میں نے آپ کو یہ واقعہ سنایا ۔ اس پر لوگوں میں سے ایک آدمی نے کہا : اے اللہ کے رسول! اس نے سچ کہا ہے ۔ اس مقتول کا چھینا ہوا سامان میرے پاس ہے ، آپ انہیں ان کے حق سے ( دستبردار ہونے پر ) مطمئن کر دیجیے ۔ اس پر حضرت ابوبکر صدیق رضی اللہ عنہ نے کہا : نہیں ، اللہ کی قسم! آپ صلی اللہ علیہ وسلم اللہ کے شیروں میں سے ایک شیر سے ، جو اللہ اور اس کے رسول کی طرف سے لڑائی کرتا ہے ، نہیں چاہیں گے کہ وہ اپنے مقتول کا چھینا ہوا سامان تمہیں دے دیں ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" انہوں نے سچ کہا : وہ انہی کو دے دو ۔ \"\" تو اس نے ( وہ سامان ) مجھے دے دیا ، کہا : میں نے ( اسی سامان میں سے ) زرہ فروخت کی اور اس ( کی قیمت ) سے ( اپنی ) بنو سلمہ ( کی آبادی ) میں ایک باغ خرید لیا ۔ وہ پہلا مال تھا جو میں نے اسلام ( کے زمانے ) میں بنایا ۔ لیث کی حدیث میں ہے : حضرت ابوبکر رضی اللہ عنہ نے کہا : ہرگز نہیں ، آپ صلی اللہ علیہ وسلم اللہ کے شیروں میں سے ایک شیر کو چھوڑ کر قریش کے ایک چھوٹے سے لگڑ بگھے کو عطا نہیں کریں گے ۔ لیث کی حدیث میں ہے : ( انہوں نے کہا ) وہ پہلا مال تھا جو میں نے بنایا.",
                "urduNarrator": "ہم سے ابو الطاہر اور حرملہ نے بیان کیا اور ہم سے عبداللہ بن وہب نے بیان کیا، انہوں نے کہا امام مالک بن انس کہتے ہیں : مجھے یحییٰ بن سعید نے عمر بن کثیر بن افلح سے حدیث بیان کی ، انہوں نے ابوقتادہ رضی اللہ عنہ کے مولیٰ ابومحمد سے اور انہوں نے حضرت ابوقتادہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، وَاللَّفْظُ لَهُ، أَخْبَرَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، قَالَ: سَمِعْتُ مَالِكَ بْنَ أَنَسٍ، يَقُولُ: حَدَّثَنِي يَحْيَى بْنُ سَعِيدٍ، عَنْ عُمَرَ بْنِ كَثِيرِ بْنِ أَفْلَحَ، عَنْ أَبِي مُحَمَّدٍ، مَوْلَى أَبِي قَتَادَةَ، عَنْ أَبِي قَتَادَةَ، قَالَ: خَرَجْنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَامَ حُنَيْنٍ، فَلَمَّا الْتَقَيْنَا كَانَتْ لِلْمُسْلِمِينَ جَوْلَةٌ، قَالَ: فَرَأَيْتُ رَجُلًا مِنَ الْمُشْرِكِينَ قَدْ عَلَا رَجُلًا مِنَ الْمُسْلِمِينَ، فَاسْتَدَرْتُ إِلَيْهِ حَتَّى أَتَيْتُهُ مِنْ وَرَائِهِ، فَضَرَبْتُهُ عَلَى حَبْلِ عَاتِقِهِ، وَأَقْبَلَ عَلَيَّ فَضَمَّنِي ضَمَّةً وَجَدْتُ مِنْهَا رِيحَ الْمَوْتِ، ثُمَّ أَدْرَكَهُ الْمَوْتُ، فَأَرْسَلَنِي، فَلَحِقْتُ عُمَرَ بْنَ الْخَطَّابِ، فَقَالَ: مَا لِلنَّاسِ؟ فَقُلْتُ: أَمْرُ اللهِ، ثُمَّ إِنَّ النَّاسَ رَجَعُوا وَجَلَسَ [ص:1371] رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «مَنْ قَتَلَ قَتِيلًا لَهُ عَلَيْهِ بَيِّنَةٌ، فَلَهُ سَلَبُهُ»، قَالَ: فَقُمْتُ، فَقُلْتُ: مَنْ يَشْهَدُ لِي؟ ثُمَّ جَلَسْتُ، ثُمَّ قَالَ مِثْلَ ذَلِكَ، فَقَالَ: فَقُمْتُ، فَقُلْتُ مَنْ يَشْهَدُ لِي؟ ثُمَّ جَلَسْتُ، ثُمَّ قَالَ ذَلِكَ الثَّالِثَةَ، فَقُمْتُ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَا لَكَ يَا أَبَا قَتَادَةَ؟» فَقَصَصْتُ عَلَيْهِ الْقِصَّةَ، فَقَالَ رَجُلٌ مِنَ الْقَوْمِ: صَدَقَ يَا رَسُولَ اللهِ، سَلَبُ ذَلِكَ الْقَتِيلِ عِنْدِي، فَأَرْضِهِ مِنْ حَقِّهِ، وَقَالَ أَبُو بَكْرٍ الصِّدِّيقُ: لَا هَا اللهِ، إِذًا لَا يَعْمِدُ إِلَى أَسَدٍ مِنْ أُسُدِ اللهِ، يُقَاتِلُ عَنِ اللهِ وَعَنْ رَسُولِهِ فَيُعْطِيكَ سَلَبَهُ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «صَدَقَ، فَأَعْطِهِ إِيَّاهُ»، فَأَعْطَانِي، قَالَ: فَبِعْتُ الدِّرْعَ، فَابْتَعْتُ بِهِ مَخْرَفًا فِي بَنِي سَلِمَةَ، فَإِنَّهُ لَأَوَّلُ مَالٍ تَأَثَّلْتُهُ فِي الْإِسْلَامِ، وَفِي حَدِيثِ اللَّيْثِ، فَقَالَ أَبُو بَكْرٍ: كَلَّا لَا يُعْطِيهِ، أُصَيْبِغَ مِنْ قُرَيْشٍ وَيَدَعُ أَسَدًا مِنْ أُسُدِ اللهِ، وَفِي حَدِيثِ اللَّيْثِ، لَأَوَّلُ مَالٍ تَأَثَّلْتُهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12133,
                "hadithNumber": "4569",
                "englishNarrator": "It has been narrated on the authority of 'Abdul-Rahman bin Auf رضی اللہ عنہ who said:",
                "hadithEnglish": "While I was standing in the battle array on the Day of Badr, I looked towards my right and my left, and found myself between two boys from the Ansar quite young in age. I wished I were between stronger persons. One of them made a sign to me and. said: Uncle, do you recognize Abu Jahl? 1 said: Yes. What do you want to do with him, O my nephew? He said: I have been told that he abuses the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). By Allah, in Whose Hand is my life, if I see him (I will grapple with him) and will not leave him until one of us who is destined to die earlier is killed. The narrator said: I wondered at this. Then the other made a sign to me and said similar words. Soon after I saw Abu Jahl. He was moving about among men. I said to the two boys: Don't you see? He is the man you were inquiring about. (As soon as they heard this), they dashed towards him, struck him with their swords until he was killed. Then they returned to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and informed him (to this effect). He asked: Which of you has killed him? Each one of them said: I have killed him. He said: Have you wiped your swords? They said: No. He examined their swords and said: Both of you have killed him. He then decided that the belongings of Abu Jahl he handed over to Mu'adh bin Amr bni al-Jamuh رضی اللہ عنہ . And the two boys were Mu'adh bin Amr bin Jawth and Mu'adh bin Afra رضی اللہ عنہم .",
                "hadithUrdu": "بدر کے دن جب میں صف میں کھڑا تھا ، میں نے اپنی دائیں اور بائیں طرف نظر دوڑائی تو میں انصار کے دو لڑکوں کے درمیان میں کھڑا تھا ، ان کی عمریں کم تھیں ، میں نے آرزو کی ، کاش! میں ان دونوں کی نسبت زیادہ طاقتور آدمیوں کے درمیان ہوتا ، ( اتنے میں ) ان میں سے ایک نے مجھے ہاتھ لگا کر متوجہ کیا اور کہا : چچا! کیا آپ ابوجہل کو پہچانتے ہیں؟ کہا : میں نے کہا : ہاں ، بھتیجے! تمہیں اس سے کیا کام ہے؟ اس نے کہا : مجھے بتایا گیا ہے کہ وہ رسول اللہ صلی اللہ علیہ وسلم کو برا بھلا کہتا ہے ، اس ذات کی قسم جس کے ہاتھ میں میری جان ہے! اگر میں نے اسے دیکھ لیا تو میرا وجوداس وقت تک اس کے وجود سے الگ نہیں ہو گا یہاں تک کہ ہم میں سے جلد تر مرنے والے کو موت آ جائے ۔ کہا : میں نے اس پر تعجب کیا تو دوسرے نے مجھے متوجہ کیا اور وہی بات کہی ، کہا : پھر زیادہ دیر نہ گزری کہ میری نظر ابوجہل پر پڑی ، وہ لوگوں میں گھوم رہا تھا ۔ تو میں نے ( ان دونوں سے ) کہا : تم دیکھ نہیں رہے؟ یہ ہے تمہارا ( مطلوبہ ) بندہ جس کے بارے میں تم پوچھ رہے تھے ۔ کہا : وہ دونوں یکدم اس کی طرف لپکے اور اس پر اپنی تلواریں برسا دیں حتی کہ اسے قتل کر دیا ، پھر پلٹ کر رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور آپ کو اس کی خبر دی تو آپ نے پوچھا : \" تم دونوں میں سے اسے کس نے قتل کیا ہے؟ \" ان دونوں میں سے ہر ایک نے جواب دیا : میں نے اسے قتل کیا ہے ۔ آپ نے پوچھا : \" کیا تم دونوں نے اپنی تلواریں صاف کر لی ہیں؟ \" انہوں نے کہا : نہیں ۔ آپ نے دونوں تلواریں دیکھیں اور فرمایا : \" تم دونوں نے اسے قتل کیا ہے ۔ \" اور اس کے سازوسامان کا فیصلہ آپ نے عاذ بن عمرو بن جموح رضی اللہ عنہ کے حق میں دیا ۔ اور وہ دونوں جوان معاذ بن عمرو بن جموح اور معاذ بن عفراء رضی اللہ عنہم تھے.",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ تمیمی نے بیان کیا، کہا ہم سے یوسف بن الماجشون نے، صالح بن ابراہیم کی سند سے, حضرت عبدالرحمن بن عوف رضی اللہ عنہ سے روایت ہے ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، أَخْبَرَنَا يُوسُفُ بْنُ الْمَاجِشُونِ، عَنْ صَالِحِ بْنِ إِبْرَاهِيمَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَنَّهُ قَالَ: بَيْنَا أَنَا وَاقِفٌ فِي الصَّفِّ يَوْمَ بَدْرٍ، نَظَرْتُ عَنْ يَمِينِي وَشِمَالِي، فَإِذَا أَنَا بَيْنَ غُلَامَيْنِ مِنَ الْأَنْصَارِ حَدِيثَةٍ أَسْنَانُهُمَا، تَمَنَّيْتُ لَوْ كُنْتُ بَيْنَ أَضْلَعَ مِنْهُمَا، فَغَمَزَنِي أَحَدُهُمَا، فَقَالَ: يَا عَمِّ، هَلْ تَعْرِفُ أَبَا جَهْلٍ؟ قَالَ: قُلْتُ: نَعَمْ، وَمَا حَاجَتُكَ إِلَيْهِ يَا ابْنَ أَخِي؟ قَالَ: أُخْبِرْتُ أَنَّهُ يَسُبُّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَالَّذِي نَفْسِي بِيَدِهِ، لَئِنْ رَأَيْتُهُ لَا يُفَارِقُ سَوَادِي سَوَادَهُ حَتَّى يَمُوتَ الْأَعْجَلُ مِنَّا، قَالَ: فَتَعَجَّبْتُ لِذَلِكَ، فَغَمَزَنِي الْآخَرُ، فَقَالَ: مِثْلَهَا، قَالَ: فَلَمْ أَنْشَبْ أَنْ نَظَرْتُ إِلَى أَبِي جَهْلٍ يَزُولُ فِي النَّاسِ، فَقُلْتُ: أَلَا تَرَيَانِ؟ هَذَا صَاحِبُكُمَا الَّذِي تَسْأَلَانِ عَنْهُ، قَالَ: فَابْتَدَرَاهُ فَضَرَبَاهُ بِسَيْفَيْهِمَا حَتَّى قَتَلَاهُ، ثُمَّ انْصَرَفَا إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَأَخْبَرَاهُ، فَقَالَ: «أَيُّكُمَا قَتَلَهُ؟» فَقَالَ كُلُّ وَاحِدٍ مِنْهُمَا: أَنَا قَتَلْتُ، فَقَالَ: «هَلْ مَسَحْتُمَا سَيْفَيْكُمَا؟» قَالَا: لَا، فَنَظَرَ فِي السَّيْفَيْنِ، فَقَالَ: «كِلَاكُمَا قَتَلَهُ»، وَقَضَى بِسَلَبِهِ لِمُعَاذِ بْنِ عَمْرِو بْنِ الْجَمُوحِ، وَالرَّجُلَانِ مُعَاذُ بْنُ عَمْرِو بْنِ الْجَمُوحِ، وَمُعَاذُ بْنُ عَفْرَاءَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12134,
                "hadithNumber": "4570",
                "englishNarrator": "Auf bin Malik رضی اللہ عنہ has narrated:",
                "hadithEnglish": "A man from the Himyar tribe killed an enemy and wanted to take the booty. Khalid bin Walid رضی اللہ عنہ , who was the commander over them, forbade, him. 'Auf bin Malik رضی اللہ عنہ (the narrator) came to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and informed him (to this effect). The latter asked Khalid: What prevented you from giving the booty to him? Khalid رضی اللہ عنہ said: I thought it was too much. He (the Holy Prophet) said: Hand it over to him. Now when Khalid رضی اللہ عنہ by Auf رضی اللہ عنہ , the latter pulled him by his cloak and said (by way of chafing him): Hasn't the same thing happened what I reported to you from the Messenger of Allah (may peace he upon him)? When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) heard it. he was angry (and said): Khalid, don't give him, Khalid, don't give him. Are you going to desert the commanders appointed by roe? Your similitude and theirs is like a person who took camels and sheep for grazing. He grazed them and when it was time for them to have a drink, he brought them to a pool. So they drank from it, drinking away its clear water and leaving the turbid water below So the clear water (i.e. the best reward) is for you and the turbid water (i.e. blame) is for them.",
                "hadithUrdu": "حمیر کے ایک آدمی نے دشمن کے ایک آدمی کو قتل کر دیا اور اس کا سلب ( مقتول کا سازوسامان ) لینا چاہا تو حضرت خالد بن ولید رضی اللہ عنہ نے انہیں منع کر دیا اور وہ ان پر امیر تھے ، چنانچہ عوف بن مالک رضی اللہ عنہ ( اپنے حمیری ساتھی کی حمایت کے لیے ) رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے اور آپ کو بتایا تو آپ نے خالد رضی اللہ عنہ سے پوچھا : \" تمہیں اس کے مقتول کا سامان اسے دینے سے کیا امر مانع ہے؟ \" انہوں نے جواب دیا : اللہ کے رسول! میں نے اسے زیادہ سمجھا ۔ آپ نے فرمایا : \" وہ ( سامان ) ان کے حوالے کر دو ۔ \" اس کے بعد حضرت خالد رضی اللہ عنہ حضرت عوف رضی اللہ عنہ کے پاس سے گزرے تو انہوں نے ان کی چادر کھینچی اور کہا : کیا میں نے پورا کر دیا جو میں نے آپ کے سامنے رسول اللہ صلی اللہ علیہ وسلم کے حوالے سے کہا تھا؟ رسول اللہ صلی اللہ علیہ وسلم نے ان کی بات سن لی تو آپ کو غصہ آ گیا اور فرمایا : \" خالد! اسے مت دو ، خالد! اسے مت دو ۔ کیا تم میرے ( مقرر کیے ہوئے ) امیروں کو میرے لیے چھوڑ سکتے ہو ( کہ میں اصلاح کروں ، تم طعن و تشنیع نہ کرو! ) تمہاری اور ان کی مثال اس آدمی کی طرح ہے جسے اونٹوں یا بکریوں کا چرواہا بنایا گیا ، اس نے انہیں چرایا ، پھر ان کو پانی پلانے کے وقت کا انتظار کیا اور انہیں حوض پر لے گیا ، انہوں نے اس میں سے پینا شروع کیا تو انہوں نے اس کا صاف پانی پی لیا اور گدلا چھوڑ دیا تو صاف پانی تمہارے لیے ہے اور گدلا ان کا.",
                "urduNarrator": "مجھ سے ابو الطاہر احمد بن عمرو بن سرح نے بیان کیا، کہا ہم سے عبداللہ بن وہب نے بیان کیا, معاویہ بن صالح نے عبدالرحمن بن جبیر سے ، انہوں نے اپنے والد سے اور انہوں نے حضرت عوف بن مالک رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي أَبُو الطَّاهِرِ أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ، أَخْبَرَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، أَخْبَرَنِي مُعَاوِيَةُ بْنُ صَالِحٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرٍ، عَنْ أَبِيهِ، عَنْ عَوْفِ بْنِ مَالِكٍ، قَالَ: قَتَلَ رَجُلٌ مِنْ حِمْيَرَ رَجُلًا مِنَ الْعَدُوِّ، فَأَرَادَ سَلَبَهُ، فَمَنَعَهُ خَالِدُ بْنُ الْوَلِيدِ، وَكَانَ وَالِيًا عَلَيْهِمْ، فَأَتَى رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَوْفُ بْنُ مَالِكٍ، فَأَخْبَرَهُ، فَقَالَ لِخَالِدٍ: «مَا مَنَعَكَ أَنْ تُعْطِيَهُ سَلَبَهُ؟» قَالَ: اسْتَكْثَرْتُهُ يَا رَسُولَ اللهِ، قَالَ: «ادْفَعْهُ إِلَيْهِ»، فَمَرَّ خَالِدٌ بِعَوْفٍ، فَجَرَّ بِرِدَائِهِ، ثُمَّ قَالَ: هَلْ أَنْجَزْتُ لَكَ مَا ذَكَرْتُ لَكَ مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَسَمِعَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَاسْتُغْضِبَ، فَقَالَ: «لَا تُعْطِهِ يَا خَالِدُ، لَا تُعْطِهِ يَا خَالِدُ، هَلْ أَنْتُمْ تَارِكُونَ لِي أُمَرَائِي؟ إِنَّمَا مَثَلُكُمْ وَمَثَلُهُمْ كَمَثَلِ رَجُلٍ اسْتُرْعِيَ إِبِلًا، أَوْ غَنَمًا، فَرَعَاهَا، ثُمَّ تَحَيَّنَ سَقْيَهَا، فَأَوْرَدَهَا حَوْضًا، فَشَرَعَتْ فِيهِ فَشَرِبَتْ صَفْوَهُ، وَتَرَكَتْ كَدْرَهُ، فَصَفْوُهُ لَكُمْ، وَكَدْرُهُ عَلَيْهِمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12135,
                "hadithNumber": "4571",
                "englishNarrator": "It has been narrated on the authority of Auf bin Malik al-Ashja'i رضی اللہ عنہ who said:",
                "hadithEnglish": "I joined the expedition that marched under Zaid bin Haritha رضی اللہ عنہ to Muta, and I received reinforcement from the Yemen. (After this introduction), the narrator narrated the tradition that had gone before except that in his version Auf رضی اللہ عنہ was reported to have said (to Khalid): Khalid, didn't you know that the Messenger of Allah (way peace be upon him) had decided In favour of giving the booty (sized from an enemy) to one who killed him? He (Khalid) said: Yes. but I thought it was too much.",
                "hadithUrdu": "میں غزوہ موتہ میں حضرت زید بن حارثہ رضی اللہ عنہ کے ہمراہ جانے والوں کے ساتھ روانہ ہوا ، یمن سے مدد کے لیے آنے والا ایک آدمی بھی میرا رفیق سفر ہوا ۔ ۔ ، انہوں نے نبی صلی اللہ علیہ وسلم سے اسی کی طرح حدیث بیان کی ، البتہ انہوں نے حدیث میں کہا : عوف رضی اللہ عنہ نے کہا : میں نے کہا : خالد! کیا آپ کو معلوم نہیں تھا کہ رسول اللہ صلی اللہ علیہ وسلم نے سلب ( مقتول کے سازوسامان ) کا فیصلہ قاتل کے حق میں کیا تھا؟ انہوں نے کہا : کیوں نہیں! لیکن میں نے اسے زیادہ خیال کیا.",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے ولید بن مسلم نے بیان کیا، صفوان بن عمرو نے عبدالرحمن بن جبیر بن نفیر سے ، انہوں نے اپنے والد سے اور انہوں نے حضرت عوف بن مالک اشجعی رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا صَفْوَانُ بْنُ عَمْرٍو، عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ، عَنْ أَبِيهِ، عَنْ عَوْفِ بْنِ مَالِكٍ الْأَشْجَعِيِّ، قَالَ: خَرَجْتُ مَعَ مَنْ خَرَجَ مَعَ زَيْدِ بْنِ حَارِثَةَ فِي غَزْوَةِ مُؤْتَةَ، وَرَافَقَنِي مَدَدِيٌّ مِنَ الْيَمَنِ، وَسَاقَ الْحَدِيثَ عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِهِ، غَيْرَ أَنَّهُ قَالَ فِي الْحَدِيثِ: قَالَ عَوْفٌ: فَقُلْتُ: يَا خَالِدُ، أَمَا عَلِمْتَ أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَضَى بِالسَّلَبِ لِلْقَاتِلِ، قَالَ: بَلَى، وَلَكِنِّي اسْتَكْثَرْتُهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12136,
                "hadithNumber": "4572",
                "englishNarrator": "It has been reported by Salama bin al-Akwa' رضی اللہ عنہ :",
                "hadithEnglish": "We fought the Battle of Hawazin along with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). (One day) when we were having our breakfast with the Messenger of Allah (may peace he upon him), a man came riding a red camel. He made it kneel down, extracted a strip of leather from its girth and tethered the camel with it. Then he began to take food with the people and look (curiously around). We were in a poor condition as some of us were on foot (being without any riding animals). All of a sudden, he left us hurriedy, came to his camel, untethered it, made it kneel down, mounted it and urged the beast which ran off with him. A man on a brown she-camel chased him (taking him for a spy). Salama رضی اللہ عنہ (the narrator) said: I followed on foot. I ran on until I was near the thigh of the she-camel. I advanced further until I was near the haunches of the camel. I advanced still further until I caught hold of the nose string of the camel. I made it kneel down. As soon as it placed its knee on the ground, I drew my sword and struck at the head, of the rider who fell down. I brought the camel driving it along with the man's baggage and weapons. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came forward to meet me and the people were with him. He asked: Who has killed the man? The people said: Ibn Akwa' رضی اللہ عنہ . He said: Everything of the man is for him (Ibn Akwa').",
                "hadithUrdu": "ہم نے رسول اللہ صلی اللہ علیہ وسلم کی معیت میں حنین کی جنگ لڑی ، اس دوران میں ایک بار ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ صبح کا کھانا کھا رہے تھے کہ سرخ اونٹ پر ایک آدمی آیا ، اسے بٹھایا ، پھر اس نے اپنے پٹکے سے چمڑے کی ایک رسی نکالی اور اس سے اونٹ کو باندھ دیا ، پھر وہ لوگوں کے ساتھ کھانا کھانے کے لیے آگے بڑھا اور جائزہ لینے لگا ، ہم میں کمزوری اور ہماری سواریوں میں دبلا پن موجود تھا ، ہم میں کچھ پیدل بھی تھے ، اچانک وہ دوڑتا ہوا نکلا ، اپنے اونٹ کے پاس آیا ، اس کی رسی کھولی ، پھر اسے بٹھایا ، اس پر سوار ہوا اور اسے اٹھایا تو وہ ( اونٹ ) اسے لے کر دوڑ پڑا ۔ ( یہ دیکھ کر ) خاکستری رنگ کی اونٹنی پر ایک آدمی اس کے پیچھے لگ گیا ۔ حضرت سلمہ رضی اللہ عنہ نے کہا : میں بھی دوڑتا ہوا نکلا ، میں ( پیچھا کرنے والے مسلمان کی ) اونٹنی کے پچھلے حصے کے پاس پہنچ گیا ، پھر میں آگے بڑھا یہاں تک کہ اونٹ کے پچھلے حصے کے پاس پہنچ گیا ، پھر میں آگے بڑھا حتی کہ میں نے اونٹ کی نکیل پکڑ لی اور اسے بٹھا دیا ، جب اس نے اپنا گھٹنا زمین پر رکھا تو میں نے اپنی تلوار نکالی اور اس شخص کے سر پر وار کیا تو وہ ( گردن سے ) الگ ہو گیا ، پھر میں اونٹ کو نکیل سے چلاتا ہوا لے آیا ، اس پر اس کا پالان اور ( سوار کا ) اسلحہ بھی تھا ، رسول اللہ صلی اللہ علیہ وسلم نے لوگوں سمیت میرا استقبال کیا اور پوچھا : \"\" اس آدمی کو کس نے قتل کیا؟ \"\" لوگوں نے کہا : ابن اکوع رضی اللہ عنہ نے ۔ آپ نے فرمایا : \"\" اس کا چھینا ہوا سازوسامان اسی کا ہے.",
                "urduNarrator": "ہم سے زہیر بن حرب نے بیان کیا، کہا ہم سے عمر بن یونس الحنفی نے بیان کیا، کہا ہم سے عکرمہ بن عمار نے بیان کیا, ایاس بن سلمہ نے کہا : مجھے میرے والد حضرت سلمہ بن اکوع رضی اللہ عنہ نے حدیث بیان کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عُمَرُ بْنُ يُونُسَ الْحَنَفِيُّ، حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ، حَدَّثَنِي إِيَاسُ بْنُ سَلَمَةَ، حَدَّثَنِي أَبِي سَلَمَةُ بْنُ الْأَكْوَعِ، قَالَ: غَزَوْنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ هَوَازِنَ، فَبَيْنَا نَحْنُ نَتَضَحَّى مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِذْ جَاءَ رَجُلٌ عَلَى جَمَلٍ أَحْمَرَ، فَأَنَاخَهُ، ثُمَّ انْتَزَعَ طَلَقًا مِنْ حَقَبِهِ، فَقَيَّدَ بِهِ الْجَمَلَ، ثُمَّ تَقَدَّمَ يَتَغَدَّى مَعَ الْقَوْمِ، وَجَعَلَ يَنْظُرُ وَفِينَا ضَعْفَةٌ وَرِقَّةٌ فِي الظَّهْرِ، وَبَعْضُنَا مُشَاةٌ، إِذْ خَرَجَ يَشْتَدُّ، فَأَتَى جَمَلَهُ، فَأَطْلَقَ قَيْدَهُ ثُمَّ أَنَاخَهُ، وَقَعَدَ عَلَيْهِ، فَأَثَارَهُ فَاشْتَدَّ بِهِ الْجَمَلُ، فَاتَّبَعَهُ رَجُلٌ عَلَى نَاقَةٍ وَرْقَاءَ، قَالَ سَلَمَةُ: وَخَرَجْتُ أَشْتَدُّ فَكُنْتُ عِنْدَ وَرِكِ النَّاقَةِ، ثُمَّ تَقَدَّمْتُ حَتَّى كُنْتُ عِنْدَ وَرِكِ الْجَمَلِ، ثُمَّ تَقَدَّمْتُ حَتَّى أَخَذْتُ بِخِطَامِ الْجَمَلِ فَأَنَخْتُهُ، فَلَمَّا وَضَعَ رُكْبَتَهُ فِي الْأَرْضِ اخْتَرَطْتُ سَيْفِي، فَضَرَبْتُ رَأْسَ الرَّجُلِ، فَنَدَرَ، ثُمَّ جِئْتُ بِالْجَمَلِ أَقُودُهُ عَلَيْهِ رَحْلُهُ وَسِلَاحُهُ، فَاسْتَقْبَلَنِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَالنَّاسُ مَعَهُ، فَقَالَ: «مَنْ قَتَلَ الرَّجُلَ؟» قَالُوا: ابْنُ الْأَكْوَعِ، قَالَ: «لَهُ سَلَبُهُ أَجْمَعُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12137,
                "hadithNumber": "4573",
                "englishNarrator": "It has been narrated on the authority of Salama (bin al-Akwa') رضی اللہ عنہ who said:",
                "hadithEnglish": "We fought against the Fazara, and Abu Bakr رضی اللہ عنہ was the commander over us. He had been appointed by the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). When we were only at an hour's distance from the water of the enemy, Abu Bakr رضی اللہ عنہ ordered us to attack. We made a halt during the last part of the night to rest and then we attacked from all sides and reached their watering-place where a battle was fought. Some of the enemies were killed and some were taken prisoners. I saw a group of persons that consisted of women and children. I was afraid lest they should reach the mountain before me, so I shot an arrow between them and the mountain. When they saw the arrow, they stopped. So I brought them, driving them along. Among them was a woman from Banu Fazara. She was wearing a leather coat. With her was her daughter who was one of the prettiest girls in Arabia. I drove them along until I brought them to Abu Bakr رضی اللہ عنہ who bestowed that girl upon me as a prize. So we arrived in Medina. I had not yet disrobed her when the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) met me in the street and said: Give me that girl, O Salama. I said: Messenger of Allah, she has fascinated me. I had not yet disrobed her. When on the next day the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) again met me in the street, he said: O Salama, give me that girl, may God bless your father. I said: She is for you, Messenger of Allah! By Allah. I have not yet disrobed her. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) sent her to the people of Mecca, and surrendered her as ransom for a number of Muslims who had been kept as prisoners at Mecca.",
                "hadithUrdu": "ہم نے بنوفزارہ سے جنگ لڑی ، حضرت ابوبکر رضی اللہ عنہ ہمارے سربراہ تھے ، رسول اللہ صلی اللہ علیہ وسلم نے انہیں ہمارا امیر بنایا تھا ، جب ہمارے اور چشمے کے درمیان ایک گھڑی کی مسافت رہ گئی تو حضرت ابوبکر رضی اللہ عنہ نے ہمیں حکم دیا اور رات کے آخری حصے میں ہم اتر پڑے ، پھر انہوں نے دھاوا بول دیا اور پانی پر پہنچ گئے ، میں نے ان لوگوں کی ایک قطار سی دیکھی ، اس میں عورتیں اور بچے تھے ، مجھے خدشہ محسوس ہوا کہ وہ مجھ سے پہلے پہاڑ تک پہنچ جائیں گے ، چنانچہ میں نے ان کے اور پہاڑ کے درمیان ایک تیر پھینکا ، جب انہوں نے تیر دیکھا تو ٹھہر گئے ( انہیں یقین ہو گیا کہ وہ تیر کا نشانہ بنیں گے ) ، میں انہیں ہانکتا ہوا لے آیا ، ان میں بنوفزارہ کی ایک عورت تھی ، اس ( کے جسم ) پر رنگے ہوئے چمڑے کی چادر تھی ۔ ۔ قَشع ، چمڑے کی بنی ہوئی چادر ہوتی ہے ۔ ۔ اس کے ساتھ اس کی بیٹی تھی جو عرب کی حسین ترین لڑکیوں میں سے تھی ۔ میں نے انہیں آگے لگایا حتی کہ حضرت ابوبکر رضی اللہ عنہ کے پاس لے آیا ، انہوں نے اس کی بیٹی مجھے انعام میں دے دی ۔ ہم مدینہ آئے اور میں نے ( ابھی تک ) اس کا کپڑا نہیں کھولا تھا کہ بازار میں رسول اللہ صلی اللہ علیہ وسلم سے میری ملاقات ہوئی ، آپ نے فرمایا : \" سلمہ! وہ عورت مجھے ہبہ کر دو ۔ \" میں نے عرض کی : اے اللہ کے رسول! اللہ کی قسم! وہ مجھے بہت اچھی لگی ہے اور ( ابھی تک ) میں نے اس کا کپڑا بھی نہیں کھولا ، پھر اگلے دن بازار ( ہی ) میں رسول اللہ صلی اللہ علیہ وسلم سے میری ملاقات ہوئی تو آپ نے مجھ سے فرمایا : \" سلمہ! وہ عورت مجھے ہبہ کر دو ، اللہ تمہارے باپ کو برکت دے! \" میں نے عرض کی : اللہ کے رسول! وہ آپ کے لیے ہے ۔ اللہ کی قسم! میں نے اس کا کپڑا بھی نہیں کھولا ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے اسے مکہ بھیج دیا اور اس کے بدلے مسلمانوں میں سے کچھ لوگوں کو چھڑا لیا جو مکہ میں قید کیے گئے تھے.",
                "urduNarrator": "ہم سے زہیر بن حرب نے بیان کیا، کہا ہم سے عمر بن یونس نے بیان کیا، کہا ہم سے عکرمہ بن عمار نے بیان کیا، کہا کہ مجھ سے ایاس بن  سلمہ بن اکوع رضی اللہ عنہ نے کہا",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عُمَرُ بْنُ يُونُسَ، حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ، حَدَّثَنِي إِيَاسُ بْنُ سَلَمَةَ، حَدَّثَنِي أَبِي، قَالَ: غَزَوْنَا فَزَارَةَ وَعَلَيْنَا أَبُو بَكْرٍ، أَمَّرَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَيْنَا، فَلَمَّا كَانَ بَيْنَنَا وَبَيْنَ الْمَاءِ سَاعَةٌ، أَمَرَنَا أَبُو بَكْرٍ فَعَرَّسْنَا، ثُمَّ شَنَّ الْغَارَةَ، فَوَرَدَ الْمَاءَ، فَقَتَلَ مَنْ قَتَلَ عَلَيْهِ، وَسَبَى، وَأَنْظُرُ إِلَى عُنُقٍ مِنَ النَّاسِ فِيهِمُ الذَّرَارِيُّ، فَخَشِيتُ أَنْ يَسْبِقُونِي إِلَى الْجَبَلِ، فَرَمَيْتُ بِسَهْمٍ بَيْنهُمْ وَبَيْنَ الْجَبَلِ، فَلَمَّا رَأَوُا السَّهْمَ وَقَفُوا، فَجِئْتُ بِهِمْ أَسُوقُهُمْ وَفِيهِمِ امْرَأَةٌ مِنْ بَنِي فَزَارَةَ عَلَيْهَا قَشْعٌ مِنْ أَدَمٍ - قَالَ: الْقَشْعُ: النِّطْعُ - مَعَهَا ابْنَةٌ لَهَا مِنْ أَحْسَنِ الْعَرَبِ، فَسُقْتُهُمْ حَتَّى أَتَيْتُ بِهِمْ أَبَا بَكْرٍ، فَنَفَّلَنِي أَبُو بَكْرٍ ابْنَتَهَا، فَقَدِمْنَا الْمَدِينَةَ وَمَا كَشَفْتُ لَهَا ثَوْبًا، فَلَقِيَنِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي السُّوقِ، فَقَالَ: «يَا سَلَمَةُ، هَبْ لِي الْمَرْأَةَ»، فَقُلْتُ: يَا رَسُولَ اللهِ، وَاللهِ لَقَدْ أَعْجَبَتْنِي وَمَا كَشَفْتُ لَهَا ثَوْبًا، ثُمَّ لَقِيَنِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنَ الْغَدِ فِي السُّوقِ، فَقَالَ لِي: «يَا سَلَمَةُ، هَبْ لِي الْمَرْأَةَ لِلَّهِ أَبُوكَ»، فَقُلْتُ: هِيَ لَكَ يَا رَسُولَ اللهِ، فَوَاللهِ مَا كَشَفْتُ لَهَا ثَوْبًا، فَبَعَثَ بِهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِلَى أَهْلِ مَكَّةَ، فَفَدَى بِهَا نَاسًا مِنَ الْمُسْلِمِينَ كَانُوا أُسِرُوا بِمَكَّةَ.",
                "headingArabic": "التَّنْفِيلِ وَفِدَاءِ الْمُسْلِمِينَ بِالأَسَارَى ‏‏",
                "headingUrdu": "اضافی انعامات، اور قیدیوں کے بدلے میں مسلمانوں کا تاوان",
                "headingEnglish": "Additional rewards, and ransoming muslims in return for prisoners",
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12138,
                "hadithNumber": "4574",
                "englishNarrator": "It has been narrated on the authority of Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: If you come to a township (which has surrendered without a formal war) and stay therein, you have a share (that will be in the form of an award) in (the properties obtained from) it. If a township disobeys Allah and His Messenger (and actually fights against the Muslims) one-fifth of the booty seized therefrom is for Allah and His Apostle and the rest is for you.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم لوگ جس بستی میں آؤ اور اس میں قیام کرو ( بغیر جنگ کے تمہاری تحویل میں آ جائے ) تو اس میں تمہارے لیے ( دوسرے مسلمانوں کی طرح ایک ) حصہ ہے اور جس بستی نے اللہ اور اس کے رسول کی نافرمانی کی ( اور تم نے لڑ کر اسے حاصل کیا ) تو اس کا خمس اللہ اور اس کے رسول کا حصہ ہے ، پھر وہ ( باقی سب ) تمہارا ہے.",
                "urduNarrator": "ہم سے احمد بن حنبل اور محمد بن رافع نے بیان کیا، کہا: ہم سے عبدالرزاق نے بیان کیا، ہم سے معمر نے بیان کیا, ہمام بن منبہ سے روایت ہے ، انہوں نے کہا : یہ احادیث ہیں جو حضرت ابوہریرہ رضی اللہ عنہ نے ہمیں محمد رسول اللہ صلی اللہ علیہ وسلم سے بیان کیں ، پھر انہوں نے چند احادیث ذکر کیں ، ان میں سے یہ بھی تھی اور",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، وَمُحَمَّدُ بْنُ رَافِعٍ، قَالَا: حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ: هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَذَكَرَ أَحَادِيثَ مِنْهَا، وَقَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَيُّمَا قَرْيَةٍ أَتَيْتُمُوهَا، وَأَقَمْتُمْ فِيهَا، فَسَهْمُكُمْ فِيهَا، وَأَيُّمَا قَرْيَةٍ عَصَتِ اللهَ وَرَسُولَهُ، فَإِنَّ خُمُسَهَا لِلَّهِ وَلِرَسُولِهِ، ثُمَّ هِيَ لَكُمْ».",
                "headingArabic": "حُكْمِ الْفَىْءِ ‏‏",
                "headingUrdu": "فائی کا حکم (بغیر لڑے مال غنیمت)",
                "headingEnglish": "Ruling on Fai' (Booty acquired without fighting)",
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 11826,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=473",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=471",
                "label": "471",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=472",
                "label": "472",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=473",
                "label": "473",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=474",
                "label": "474",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=475",
                "label": "475",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=476",
                "label": "476",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=477",
                "label": "477",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=475",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=475",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=473",
        "to": 11850,
        "total": 40465
    }
}