{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 384,
        "data": [
            {
                "id": 9864,
                "hadithNumber": "2300",
                "englishNarrator": "Abu Dharr رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "I went to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and he was sitting under the shade of the Ka'ba. As he saw me he said: By the Lord of the Ka'ba, they are the losers. I came there till I sat and I could not stay (longer) and (then) stood up. I said: Messenger of Allah, let my father, be ransom for you, who are they (the losers)? He said: They are those having a huge amount of wealth except so and so and (those who spend their wealth generously on them whom they find in front of them, behind them and on their right side and on their left side) and they are a few. And no owner of camels, or cattle or goat and sheep, who does not pay Zakat (would be spared punishment) but these (camels, cattle, goats and sheep) would come on the Day of Resurrection wearing more flesh and would gore him with their horns and trample them with their hooves. And when the last one would pass away, the first one would return (to trample him) till judgment would be pronounced among people.",
                "hadithUrdu": "میں رسول اللہ صلی اللہ علیہ وسلم کے پاس حاضر ہوا ، آپ صلی اللہ علیہ وسلم کعبےکےسائے میں تشریف فرما تھے جب آپ صلی اللہ علیہ وسلم نے مجھے دیکھا تو فرمایا : \" رب کعب کی قسم! وہی لوگ سب سے زیادہ خسارہ اٹھانے والے ہیں ۔ \" کہا : میں آکر آپ صلی اللہ علیہ وسلم کے پاس بیٹھا ( ہی تھا ) اور اطمینان سے بیٹھا ہی نہ تھا کہ کھڑا ہوگیا اور میں نے عرض کی : اللہ کے رسول صلی اللہ علیہ وسلم !میرے ماں باپ آپ صلی اللہ علیہ وسلم پر قربان وہ کون لوگ ہیں؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" وہ زیادہ مالدار لوگ ہیں ، سوائے اس کے جس نے ، اپنے آگے ، اپنے پیچھے ، اپنے دائیں ، اپنے بائیں ، ایسے ، ایسے اور ایسے کہا ( لے لو ، لے لو ) اور ایسے لوگ بہت کم ہیں ۔ جو بھی اونٹوں ، گایوں یابکریوں کا مالک ان کی زکاۃ ادا نہیں کرتا تو وہ قیامت کے دن اس طرح بڑی اور موٹی ہوکر آئیں گی جتنی زیادہ سےزیادہ تھیں ، اسے اپنے سینگوں سے ماریں گی اور اپنے کھروں سے روندیں گی جب بھی ان میں سے آخری گزر کر جائے گی ، پہلی اس ( کے سر ) پر واپس آجائے گی حتیٰ کہ لوگوں کے درمیان فیصلہ کردیا جائے گا ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, وکیع نے کہا : اعمش نے ہمیں معرور بن سوید کے حوالے سے حضرت ابو ذر رضی اللہ تعالیٰ عنہ سے حدیث بیان کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الْأَعْمَشُ عَنْ الْمَعْرُورِ بْنِ سُوَيْدٍ عَنْ أَبِي ذَرٍّ قَالَ انْتَهَيْتُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ جَالِسٌ فِي ظِلِّ الْكَعْبَةِ فَلَمَّا رَآنِي قَالَ هُمْ الْأَخْسَرُونَ وَرَبِّ الْكَعْبَةِ قَالَ فَجِئْتُ حَتَّى جَلَسْتُ فَلَمْ أَتَقَارَّ أَنْ قُمْتُ فَقُلْتُ يَا رَسُولَ اللَّهِ فِدَاكَ أَبِي وَأُمِّي مَنْ هُمْ قَالَ هُمْ الْأَكْثَرُونَ أَمْوَالًا إِلَّا مَنْ قَالَ هَكَذَا وَهَكَذَا وَهَكَذَا مِنْ بَيْنَ يَدَيْهِ وَمِنْ خَلْفِهِ وَعَنْ يَمِينِهِ وَعَنْ شِمَالِهِ وَقَلِيلٌ مَا هُمْ مَا مِنْ صَاحِبِ إِبِلٍ وَلَا بَقَرٍ وَلَا غَنَمٍ لَا يُؤَدِّي زَكَاتَهَا إِلَّا جَاءَتْ يَوْمَ الْقِيَامَةِ أَعْظَمَ مَا كَانَتْ وَأَسْمَنَهُ تَنْطَحُهُ بِقُرُونِهَا وَتَطَؤُهُ بِأَظْلَافِهَا كُلَّمَا نَفِدَتْ أُخْرَاهَا عَادَتْ عَلَيْهِ أُولَاهَا حَتَّى يُقْضَى بَيْنَ النَّاسِ.",
                "headingArabic": "تَغْلِيظِ عُقُوبَةِ مَنْ لاَ يُؤَدِّي الزَّكَاةَ ‏‏",
                "headingUrdu": "زکوٰۃ ادا نہ کرنے والے کے لیے سخت سزا",
                "headingEnglish": "Severe Punishment for the one who does not pay Zakat",
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9865,
                "hadithNumber": "2301",
                "englishNarrator": "Abu Dbarr رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "I went to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and he was sitting under the shade of the Ka'ba, and the rest of the hadith it the same but for this that he (the Holy Prophet) said: By Allah, in Whose hand is my life, no person on earth who dies and leaves behind camels, or cattle or goat and sheep, and does not pay Zakat (would be spared the punishment).",
                "hadithUrdu": "میں رسول اللہ صلی اللہ علیہ وسلم کے پاس پہنچا ، آپ کعبہ کے سائے میں تشریف فرما تھے ۔ ۔ ۔ آگے وکیع کی روایت کی طرح ہے ، البتہ ( اس میں ہے کہ ) آپ صلی اللہ علیہ وسلم نے فرمایا : \" اس ذات کی قسم جس کے ہاتھ میں میری جان ہے!زمین پر جو بھی آدمی فوت ہوتا ہے اور ایسے اونٹ ، گائےیا بکریاں پیچھے چھوڑ جاتا ہے جن کی اس نے زکاۃ ادا نہیں کی ۔ \"",
                "urduNarrator": "ہم سے ابو کریب محمد بن الاعلٰی نے بیان کیا جنہوں نے بیان کیا, ابو معاویہ نے اعمش سے ، انھوں نے معرور سےاور انھوں نے حضرت ابوزر رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَاه أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ الْمَعْرُورِ عَنْ أَبِي ذَرٍّ قَالَ انْتَهَيْتُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ جَالِسٌ فِي ظِلِّ الْكَعْبَةِ فَذَكَرَ نَحْوَ حَدِيثِ وَكِيعٍ غَيْرَ أَنَّهُ قَالَ وَالَّذِي نَفْسِي بِيَدِهِ مَا عَلَى الْأَرْضِ رَجُلٌ يَمُوتُ فَيَدَعُ إِبِلًا أَوْ بَقَرًا أَوْ غَنَمًا لَمْ يُؤَدِّ زَكَاتَهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9866,
                "hadithNumber": "2302",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "The Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Nothing is more delighting to me than this that Uhud should be of gold for me, and no dinar is left with me out of it before three nights pass except a dinar which I would set aside for the repayment of debt upon me.",
                "hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم نے فرمایا : \" میرے لئے یہ بات خوشی کاباعث نہیں کہ میرے پاس احد پہاڑ کے برابر سونا ہو اور تیسرا دن مجھ پر اس طرح آئے کہ میرے پاس اس میں سے کوئی دینار بچا ہوا موجود ہوسوائے اس دینار کے جس کو میں اپنا قرض چکانے کے لئے رکھ لوں ۔ \"",
                "urduNarrator": "ہم سے عبدالرحمٰن بن سلام الجمحی نے بیان کیا, ربیع بن مسلم نے محمد بن زیادسے اور انھوں نے حضرت ابوہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَلَّامٍ الْجُمَحِيُّ حَدَّثَنَا الرَّبِيعُ يَعْنِي ابْنَ مُسْلِمٍ عَنْ مُحَمَّدِ بْنِ زِيَادٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا يَسُرُّنِي أَنَّ لِي أُحُدًا ذَهَبًا تَأْتِي عَلَيَّ ثَالِثَةٌ وَعِنْدِي مِنْهُ دِينَارٌ إِلَّا دِينَارٌ أَرْصُدُهُ لِدَيْنٍ عَلَيَّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9867,
                "hadithNumber": "2303",
                "englishNarrator": null,
                "hadithEnglish": "Abu Huraira رضی اللہ تعالیٰ عنہ reported the same from the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌).",
                "hadithUrdu": "اور ہم سے محمد بن بشار نے بیان کیا، ہم سے محمد بن جعفر نے بیان کیا, شعبہ نے محمد بن زیاد سے روایت کی ، انھوں نے کہا : میں نے ابو ہریرہ رضی اللہ تعالیٰ عنہ کو نبی کریم صلی اللہ علیہ وسلم سے روایت کرتے سنا ۔ ۔ ۔ اسی کے مانند ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ مُحَمَّدِ بْنِ زِيَادٍ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9868,
                "hadithNumber": "2304",
                "englishNarrator": "Abu Dharr رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "I walked with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) on the stony ground of Medina in the afternoon and we were looking at Uhud. The Messenger of Allah (way peace by upon him) said: Abu Dharr! I said: Messenger of Allah, I am here at thy beck and call. He said: What I desire is that Uhud be gold with me and three nights should pass and there is left with me any dinar but one coin which I would keep to pay debt. (I love) to spend it among the servants of Allah like this and he pointed in front of him, and on his right side and on his left side. We then proceeded on and he said: Abu Dharr رضی اللہ تعالیٰ عنہ . I said: At thy beck and call, Messenger of Allah. He (the Holy Prophet) said: The rich would be poor on the Day of Resurrection, but he who spent like this and like this and like this, and he pointed as at the first time. We again went on when he said. Abu Dhar رضی اللہ تعالیٰ عنہ r, stay where you are till I come back to you. He (the Holy Prophet) then moved on till he disappeared from my sight He (Abu Dharr رضی اللہ تعالیٰ عنہ ) said: I heard a sound and I heard a noise. I said (to myself): The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) might have met (mishap or an enemy). I wished to follow him but I remembered his command for not departing till he would come back. So I waited for him, and when he came I made a mention of what I heard. He said: it was Gabriel, who came to me and said: He who dies among your Ummah without associating Anything with Allah would enter Paradise. I said: Even if he committed fornication or theft? He said: Even if he committed fornication or theft.",
                "hadithUrdu": "( ایک رات ) عشاء کے وقت نبی کریم صلی اللہ علیہ وسلم کے ساتھ مدینہ کی کالی پتھریلی زمین پر چل ر ہا تھا اور ہم احد پہاڑ کو دیکھ رہے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فرمایا : \" ابو زر رضی اللہ تعالیٰ عنہ !میں نے عرض کی : اللہ کے رسول صلی اللہ علیہ وسلم حاضر ہوں!فرمایا : \" مجھے یہ پسند نہیں ہے کہ یہ ( کوہ ) احد میرے پاس سونے کا ہو اور میں اس حالت میں تیسری شام کروں کہ میرے پاس اس میں سے ایک دینار بچا ہوا موجود ہو سوائے اس دینار کے جو میں نے قرض ( کی ادائیگی ) کے لئے بچایا ہو ، اور میں اسے اللہ کے بندوں میں اس طرح ( خرچ ) کروں ۔ آپ نے اپنے سامنے دونوں ہاتھوں سے بھر کر ڈالنے کا اشارہ کیا ۔ اس طرح ( خرچ ) کروں ۔ دائیں طرف سے ۔ ۔ ۔ اس طرح ۔ ۔ ۔ بائیں طرف سے ۔ ۔ ۔ \" ( ابو زر رضی اللہ تعالیٰ عنہ نے ) کہا : پھر ہم چلے تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" ابو زر! رضی اللہ تعالیٰ عنہ میں نے عرض کی : اللہ کے رسول صلی اللہ علیہ وسلم حاضر ہوں!آپ نے فرمایا : \" یقیناً زیادہ مالدار ہی قیامت کے دن کم ( مایہ ) ہوں گے ، مگر وہ جس نے اس طرح ، اس طرح اور اس طرح ( خرچ ) کیا ۔ \" جس طرح آپ نے پہلی بار کیاتھا ۔ ابوزر رضی اللہ تعالیٰ عنہ نے کہا : ہم پھر چلے ۔ آپ نے فرمایا : \" ابو زر رضی اللہ تعالیٰ عنہ ! میرے واپس آنے تک اسی حالت میں ٹھہرے رہنا ۔ \" کہا : آپ چلے یہاں تک کہ میری نظروں سے اوجھل ہوگئے ۔ میں نے شور سا سنا آواز سنی تو میں نے دل میں کہا شاید رسول اللہ صلی اللہ علیہ وسلم کو کوئی چیز پیش آگئی ہے ، چنانچہ میں نے پیچھے جانے کا ارادہ کرلیا پھر مجھے آپ کا یہ فرمان یاد آگیا : \" میرے آنے تک یہاں سے نہ ہٹنا \" تو میں نے آپ کاانتظار کیا ، جب آپ و اپس تشریف لائے تو میں نے جو ( کچھ ) سنا تھا آپ کو بتایا ۔ آ پ صلی اللہ علیہ وسلم نے فرمایا : \" وہ جبرائیل علیہ السلام تھے ، میرے پاس آئے اور بتایا کہ آپ کی امت کاجو فرد اس حال میں فوت ہوگا کہ کسی چیز کو اللہ کے ساتھ شرک نہ کرتاتھا وہ جنت میں داخل ہوگا ۔ میں نے پوچھا : چاہے اس نے زنا کیا ہو اور چوری کی ہو؟انھوں نے کہا : چاہے اس نے زنا کیا ہو اور چوری کی ہو ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ، ابوبکر بن ابی شیبہ، ابن نمیر اور ابو کریب نے ابو معاویہ کی سند سے بیان کیا، کہا: ہمیں ابو ایم نے عویہ سے بیان کیا, اعمش نے زید بن وہب سے اور انھوں نے حضرت ابوزر رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَابْنُ نُمَيْرٍ وَأَبُو كُرَيْبٍ كُلُّهُمْ عَنْ أَبِي مُعَاوِيَةَ قَالَ يَحْيَى أَخْبَرَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ زَيْدِ بْنِ وَهْبٍ عَنْ أَبِي ذَرٍّ قَالَ كُنْتُ أَمْشِي مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَرَّةِ الْمَدِينَةِ عِشَاءً وَنَحْنُ نَنْظُرُ إِلَى أُحُدٍ فَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا أَبَا ذَرٍّ قَالَ قُلْتُ لَبَّيْكَ يَا رَسُولَ اللَّهِ قَالَ مَا أُحِبُّ أَنَّ أُحُدًا ذَاكَ عِنْدِي ذَهَبٌ أَمْسَى ثَالِثَةً عِنْدِي مِنْهُ دِينَارٌ إِلَّا دِينَارًا أَرْصُدُهُ لِدَيْنٍ إِلَّا أَنْ أَقُولَ بِهِ فِي عِبَادِ اللَّهِ هَكَذَا حَثَا بَيْنَ يَدَيْهِ وَهَكَذَا عَنْ يَمِينِهِ وَهَكَذَا عَنْ شِمَالِهِ قَالَ ثُمَّ مَشَيْنَا فَقَالَ يَا أَبَا ذَرٍّ قَالَ قُلْتُ لَبَّيْكَ يَا رَسُولَ اللَّهِ قَالَ إِنَّ الْأَكْثَرِينَ هُمْ الْأَقَلُّونَ يَوْمَ الْقِيَامَةِ إِلَّا مَنْ قَالَ هَكَذَا وَهَكَذَا وَهَكَذَا مِثْلَ مَا صَنَعَ فِي الْمَرَّةِ الْأُولَى قَالَ ثُمَّ مَشَيْنَا قَالَ يَا أَبَا ذَرٍّ كَمَا أَنْتَ حَتَّى آتِيَكَ قَالَ فَانْطَلَقَ حَتَّى تَوَارَى عَنِّي قَالَ سَمِعْتُ لَغَطًا وَسَمِعْتُ صَوْتًا قَالَ فَقُلْتُ لَعَلَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عُرِضَ لَهُ قَالَ فَهَمَمْتُ أَنْ أَتَّبِعَهُ قَالَ ثُمَّ ذَكَرْتُ قَوْلَهُ لَا تَبْرَحْ حَتَّى آتِيَكَ قَالَ فَانْتَظَرْتُهُ فَلَمَّا جَاءَ ذَكَرْتُ لَهُ الَّذِي سَمِعْتُ قَالَ فَقَالَ ذَاكَ جِبْرِيلُ أَتَانِي فَقَالَ مَنْ مَاتَ مِنْ أُمَّتِكَ لَا يُشْرِكُ بِاللَّهِ شَيْئًا دَخَلَ الْجَنَّةَ قَالَ قُلْتُ وَإِنْ زَنَى وَإِنْ سَرَقَ قَالَ وَإِنْ زَنَى وَإِنْ سَرَقَ.",
                "headingArabic": "التَّرْغِيبِ فِي الصَّدَقَةِ ‏‏",
                "headingUrdu": "صدقہ دینے کی ترغیب",
                "headingEnglish": "Encouragement to give Charity",
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9869,
                "hadithNumber": "2305",
                "englishNarrator": "Abu Dharr رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "I went out one night (and found) the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) walking all alone. There was no man with him. I thought that he did not like anyone walking along with him. So I began to walk in the light of the moon. He, however turned his attention to me and saw me and said: Who is this? I said: It is Abu Dharr رضی اللہ تعالیٰ عنہ. Let Allah make me as ransom for you. He said: Abu Dharr رضی اللہ تعالیٰ عنہ , come on. He (Abu Dharr رضی اللہ تعالیٰ عنہ) said: So I walked along with him for some time and he said: The wealthy persons would have little (reward) on the Day of Resurrection, except upon whom Allah conferred goodness (wealth). He dispensed it to his right, left, in front of him and at his back (just as the wind diffuses fragrance) and did good with it (riches). I went along with him for some time when He said: Sit here. And he made me sit at a safe place and there were stones around it, and he said to me: Sit here till I come to you. He went away on the stony ground till I could not see him. He stayed away from me, and he prolonged his stay. Then I heard him as he came back and he was saying: Even if he committed theft and even if he committed fornication. When he came I could not help asking him: Apostle of Allah, let Allah make me ransom for you, whom were you speaking on the stony ground? I heard nobody responding to you. He (the Holy Prophet) said: It was Gabriel who met me by the side of the stony ground and said: Give glad tidings to your Ummah that he who died without associating ought with Allah would go into Paradise. I said: Gabriel, even if he committed theft and fornication? He said: Yes. I said: Even it he committed theft and fornication? He said: Yes, I again said: Even if he committed theft and fornication? He said: Yes, even if he drank wine.",
                "hadithUrdu": "میں ایک رات ( گھرسے ) باہر نکلا تو اچانک دیکھا کہ رسول اللہ صلی اللہ علیہ وسلم اکیلے جارہے ہیں ، آپ کے ساتھ کوئی انسان نہیں تو میں نے خیال کیا کہ آپ اس بات کو ناپسند کررہے ہیں کہ کوئی آپ کے ساتھ چلے ، چنانچہ میں چاند کے سائے میں چلنے لگا ، آپ مڑے تو مجھے دیکھ لیا اور فرمایا : \" یہ کون ہے؟ \" میں نے عرض کی : ابو زر رضی اللہ تعالیٰ عنہ ہوں ، اللہ مجھے آپ پر قربان کرے!آپ صلی اللہ علیہ وسلم نے فرمایا : \" ابو زر ( رضی اللہ تعالیٰ عنہ ) آجاؤ ۔ \" کہا : میں کچھ دیر آپ کے ساتھ چلا تو آپ نے فرمایا : \" بے شک زیادہ مال والے ہی قیامت کے دن کم ( مایہ ) ہوں گے ، سوائے ان کے جن کو اللہ نے مال عطا فرمایا : اور ا نھوں نے اسے دائیں ، بائیں اور آگے ، پیچھے اڑا ڈالا اور اس میں نیکی کے کام کئے ۔ \" میں ایک گھڑی آپ کے ساتھ چلتا رہا تو آپ صلی اللہ علیہ وسلم نے فرمایا : یہاں بیٹھ جاؤ ۔ \" آپ نے مجھے ایک ہموار زمین میں بٹھا دیا جس کے گرد پتھر تھے اور آپ صلی اللہ علیہ وسلم نے مجھے فرمایا : \" یہیں بیٹھے رہنا یہاں تک کہ میں تمھارے پاس لوٹ آؤں ۔ \" آپ پتھریلے میدان ( حرے ) میں چل پڑے حتیٰ کہ میری نظروں سے اوجھل ہوگئے ، آپ مجھ سے دور رکے رہے اور زیادہ دیرکردی ، پھر میں نے آپ کی آواز سنی جب آپ صلی اللہ علیہ وسلم میری طرف آتے ہوئے فرمارہے تھے : \" خواہ اس نے چوری کی ہو یا زنا کیا ہو ۔ \" جب آپ تشریف لئے آئے تو میں صبر نہ کرسکا میں نے عرض کی : اے اللہ کے نبی صلی اللہ علیہ وسلم !اللہ مجھے آپ پر نثار فرمائے!آپ سیاہ پتھروں کے میدان ( حرہ ) کے کنارے کس سے گفتگو فرمارہے تھے؟میں نے تو کسی کو نہیں سناجو آپ کو جواب دے رہا ہو ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" وہ جبرئیل علیہ السلام تھے جو سیاہ پتھروں کے کنارے میرے سامنے آئے اور کہا : اپنی امت کو بشارت دے دیجئے کہ جو کوئی اس حالت میں مرے گا کہ اللہ کے ساتھ کسی چیز کو شریک نہیں ٹھہراتا ہوگا وہ جنت میں داخل ہوگا ۔ میں نے کہا : اے جبرئیل علیہ السلام! چاہے اس نے چوری کی ہو یا زنا کیا ہو؟انھوں نےکہا : ہاں!فرمایا : میں نے پھر کہا : خواہ اس نے چوری کی ہو خواہ اس نے زنا کیا ہو؟انھوں نے کہا : ہاں ۔ میں نے پھر ( تیسری بار ) پوچھا : خواہ اس نے چوری کی ہو خواہ اس نے زنا کیا ہو؟انھوں نے کہا : ہاں ، خواہ اس نے شراب ( بھی ) پی ہو ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ہم سے جریر نے بیان کیا, عبدالعزیز بن رفیع نے زید بن وہب سے اور انھوں نے ابو زر رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا جَرِيرٌ عَنْ عَبْدِ الْعَزِيزِ وَهُوَ ابْنُ رُفَيْعٍ عَنْ زَيْدِ بْنِ وَهْبٍ عَنْ أَبِي ذَرٍّ قَالَ خَرَجْتُ لَيْلَةً مِنْ اللَّيَالِي فَإِذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمْشِي وَحْدَهُ لَيْسَ مَعَهُ إِنْسَانٌ قَالَ فَظَنَنْتُ أَنَّهُ يَكْرَهُ أَنْ يَمْشِيَ مَعَهُ أَحَدٌ قَالَ فَجَعَلْتُ أَمْشِي فِي ظِلِّ الْقَمَرِ فَالْتَفَتَ فَرَآنِي فَقَالَ مَنْ هَذَا فَقُلْتُ أَبُو ذَرٍّ جَعَلَنِي اللَّهُ فِدَاءَكَ قَالَ يَا أَبَا ذَرٍّ تَعَالَهْ قَالَ فَمَشَيْتُ مَعَهُ سَاعَةً فَقَالَ إِنَّ الْمُكْثِرِينَ هُمْ الْمُقِلُّونَ يَوْمَ الْقِيَامَةِ إِلَّا مَنْ أَعْطَاهُ اللَّهُ خَيْرًا فَنَفَحَ فِيهِ يَمِينَهُ وَشِمَالَهُ وَبَيْنَ يَدَيْهِ وَوَرَاءَهُ وَعَمِلَ فِيهِ خَيْرًا قَالَ فَمَشَيْتُ مَعَهُ سَاعَةً فَقَالَ اجْلِسْ هَا هُنَا قَالَ فَأَجْلَسَنِي فِي قَاعٍ حَوْلَهُ حِجَارَةٌ فَقَالَ لِي اجْلِسْ هَا هُنَا حَتَّى أَرْجِعَ إِلَيْكَ قَالَ فَانْطَلَقَ فِي الْحَرَّةِ حَتَّى لَا أَرَاهُ فَلَبِثَ عَنِّي فَأَطَالَ اللَّبْثَ ثُمَّ إِنِّي سَمِعْتُهُ وَهُوَ مُقْبِلٌ وَهُوَ يَقُولُ وَإِنْ سَرَقَ وَإِنْ زَنَى قَالَ فَلَمَّا جَاءَ لَمْ أَصْبِرْ فَقُلْتُ يَا نَبِيَّ اللَّهِ جَعَلَنِي اللَّهُ فِدَاءَكَ مَنْ تُكَلِّمُ فِي جَانِبِ الْحَرَّةِ مَا سَمِعْتُ أَحَدًا يَرْجِعُ إِلَيْكَ شَيْئًا قَالَ ذَاكَ جِبْرِيلُ عَرَضَ لِي فِي جَانِبِ الْحَرَّةِ فَقَالَ بَشِّرْ أُمَّتَكَ أَنَّهُ مَنْ مَاتَ لَا يُشْرِكُ بِاللَّهِ شَيْئًا دَخَلَ الْجَنَّةَ فَقُلْتُ يَا جِبْرِيلُ وَإِنْ سَرَقَ وَإِنْ زَنَى قَالَ نَعَمْ قَالَ قُلْتُ وَإِنْ سَرَقَ وَإِنْ زَنَى قَالَ نَعَمْ قَالَ قُلْتُ وَإِنْ سَرَقَ وَإِنْ زَنَى قَالَ نَعَمْ وَإِنْ شَرِبَ الْخَمْرَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9870,
                "hadithNumber": "2306",
                "englishNarrator": "Ahnaf bin Qais reported:",
                "hadithEnglish": "I came to Medina and when I was in the company of the grandees of Quraish a man with a crude body and an uncouth face wearing coarse clothes came there. He stood up before them and said: Give glad tidings to those whom who amass riches of the stones which would be heated in the Fire of Hell, and would be placed at the tick of the chest till it would project from the shoulder bone and would he put on the shoulder bone till it would project from the tick of his chest, and it (this stone) would continue passing and repassing (from one side to the other). He (the narrator) said: Then people hung their heads and I saw none among them giving any answer. He then returned and I followed him till he sat near a pillar. I said: I find that these (people) disliked what you said to them and they do not understand anything. My friend Abu'l-Qasim (Muhammad) (may peace he upon him) called me and I responded to him, and he said: Do you see Uhud? I saw the sun (shining) on me and I thought that he would send me on an errand for him. So I said: I see it. Upon this he said: Nothing would delight me more than this that I should have gold like it (equal to the bulk of Uhud), and I should spend it all except three dinars. (How sad it is) that they hoard worldly riches, and they know nothing. I said: What about you and your brothers Quraish? You do not go to thein for any need and do not accept anything from them. He said: By Allah, I neither beg anything from them (from worldly goods), nor do I ask them anything about religion till I meet my Allah and His Messenger.",
                "hadithUrdu": "میں مدینہ آیا تو میں قریشی سر داروں کے ایک حلقے میں بیٹھا ہوا تھا کہ اچانک کھردرے کپڑوں گٹھے ہو ئے جسم اور سخت چہرے والا ایک آدمی آیا اور ان کے سر پر کھڑا ہو گیا اور کہنے لگا ۔ مال و دولت جمع کرنے والوں کو اس تپتے ہو ئے پتھر کی بشارت سنا دو جس کو جہنم کی آگ میں گرم کیا جا ئے گا اور اسے ان کے ایک فرد کی نو ک پستان پر رکھا جائے گا حتیٰ کہ وہ اس کے دونوں کندھوں کی باریک ہڈیوں سے لہراتا ہوا نکل جا ئے گا اور اسے اس کے شانوں کی باریک ہڈیوں پر رکھا جا ئے گا حتیٰ کہ وہ اس کے پستانوں کے سروں سے حرکت کرتا ہوا نکل جا ئے گا ۔ ( احنف نے ) کہا : اس پر لو گوں نے اپنے سر جھکا لیے اور میں نے ان میں سے کسی کو نہ دیکھا کہ اسے کو ئی جواب دیا ہو کہا پھر وہ لو ٹا اور میں نے اس کا پیچھا کیا حتیٰ کہ وہ ایک ستون کے ساتھ ( ٹیک لگا کر ) بیٹھ گیا میں نے کہا : آپ نے انھیں جو کچھ کہا ہے میں نے انھیں اس کو نا پسند کرتے ہو ئے ہی دیکھا ہے انھوں نے کہا : یہ لو گ کچھ سمجھتے نہیں میرے خلیل ابو القاسم صلی اللہ علیہ وسلم نے مجھے بلا یا میں نے لبیک کہا تو آپ نے فر ما یا : \" کیا تم احد ( پہاڑ ) کو دیکھتے ہو؟ میں نے دیکھا کہ مجھ پر کتنا سورج باقی ہے میں سمجھ رہا تھا کہ آپ مجھے اپنی کسی ضرورت کے لیے بھیجنا چا ہتے ہیں چنا نچہ میں نے عرض کی میں اسے دیکھ رہا ہوں تو آپ نے فر مایا : \" میرے لیے یہ بات باعث مسرت نہ ہو گی کہ میرے پا س اس کے برا برا سونا ہو اور میں تین دیناروں کے سوا اس سارے ( سونے ) کو خرچ ( بھی ) کر ڈالوں ۔ پھر یہ لو گ ہیں دنیا جمع کرتے ہیں کچھ عقل نہیں کرتے ۔ میں نے ان سے پو چھا آپ کا اپنے ( حکمران ) قریشی بھائیوں کے ساتھ کیا معاملہ ہے آپ اپنی ضرورت کے لیے نہ ان کے پاس جا تے ہیں اور نہ ان سے کچھ لیتے ہیں ؟ انھوں نے جواب دیا نہیں تمھا رے پرودیگار کا قسم! نہ میں ان سے دنیا کی کو ئی چیز مانگوں گا نہ ہی ان سے کسی دینی مسئلے کے بارے میں پو چھوں گا یہاں تک کہ میں اللہ اور اس کے رسول اللہ صلی اللہ علیہ وسلم سے جا ملوں ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، ہم سے اسماعیل بن ابراہیم نے بیان کیا، الجریری کی سند سے, ابو علاء نے حضرت احنف بن قیس ؒسے روایت کی انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ عَنْ الْجُرَيْرِيِّ عَنْ أَبِي الْعَلَاءِ عَنْ الْأَحْنَفِ بْنِ قَيْسٍ قَالَ قَدِمْتُ الْمَدِينَةَ فَبَيْنَا أَنَا فِي حَلْقَةٍ فِيهَا مَلَأٌ مِنْ قُرَيْشٍ إِذْ جَاءَ رَجُلٌ أَخْشَنُ الثِّيَابِ أَخْشَنُ الْجَسَدِ أَخْشَنُ الْوَجْهِ فَقَامَ عَلَيْهِمْ فَقَالَ بَشِّرْ الْكَانِزِينَ بِرَضْفٍ يُحْمَى عَلَيْهِ فِي نَارِ جَهَنَّمَ فَيُوضَعُ عَلَى حَلَمَةِ ثَدْيِ أَحَدِهِمْ حَتَّى يَخْرُجَ مِنْ نُغْضِ كَتِفَيْهِ وَيُوضَعُ عَلَى نُغْضِ كَتِفَيْهِ حَتَّى يَخْرُجَ مِنْ حَلَمَةِ ثَدْيَيْهِ يَتَزَلْزَلُ قَالَ فَوَضَعَ الْقَوْمُ رُءُوسَهُمْ فَمَا رَأَيْتُ أَحَدًا مِنْهُمْ رَجَعَ إِلَيْهِ شَيْئًا قَالَ فَأَدْبَرَ وَاتَّبَعْتُهُ حَتَّى جَلَسَ إِلَى سَارِيَةٍ فَقُلْتُ مَا رَأَيْتُ هَؤُلَاءِ إِلَّا كَرِهُوا مَا قُلْتَ لَهُمْ قَالَ إِنَّ هَؤُلَاءِ لَا يَعْقِلُونَ شَيْئًا إِنَّ خَلِيلِي أَبَا الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَعَانِي فَأَجَبْتُهُ فَقَالَ أَتَرَى أُحُدًا فَنَظَرْتُ مَا عَلَيَّ مِنْ الشَّمْسِ وَأَنَا أَظُنُّ أَنَّهُ يَبْعَثُنِي فِي حَاجَةٍ لَهُ فَقُلْتُ أَرَاهُ فَقَالَ مَا يَسُرُّنِي أَنَّ لِي مِثْلَهُ ذَهَبًا أُنْفِقُهُ كُلَّهُ إِلَّا ثَلَاثَةَ دَنَانِيرَ ثُمَّ هَؤُلَاءِ يَجْمَعُونَ الدُّنْيَا لَا يَعْقِلُونَ شَيْئًا قَالَ قُلْتُ مَا لَكَ وَلِإِخْوَتِكَ مِنْ قُرَيْشٍ لَا تَعْتَرِيهِمْ وَتُصِيبُ مِنْهُمْ قَالَ لَا وَرَبِّكَ لَا أَسْأَلُهُمْ عَنْ دُنْيَا وَلَا أَسْتَفْتِيهِمْ عَنْ دِينٍ حَتَّى أَلْحَقَ بِاللَّهِ وَرَسُولِهِ.",
                "headingArabic": "فِي الْكَنَّازِينَ لِلأَمْوَالِ وَالتَّغْلِيظِ عَلَيْهِمْ ‏‏",
                "headingUrdu": "مال جمع کرنے والوں کے لیے سخت تنبیہ",
                "headingEnglish": "Stern warning concerning those who hoard wealth",
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9871,
                "hadithNumber": "2307",
                "englishNarrator": "Ahnaf bin Qais رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "While I was in the company of the (elites) of Quraiah, Abu Dharr رضی اللہ تعالیٰ عنہ came there and he was saying: Give glad tidings to the hoarders of riches that their backs would be branded (so deeply) that (the hot Iron) would come out of their sides, and when the backs of their necks would be branded, it would come out of their foreheads. He (Abu Dharr رضی اللہ تعالیٰ عنہ ) then went away and sat down. I asked who he was. They said: He is Abu Dharr رضی اللہ تعالیٰ عنہ . I went to him and said to him: What is this that I heard from you which you were saying before? He said: I said nothing but only that which I heard from their Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). I again said: What do you say about this gift? He said: Take it, for today it is a help. But when it becomes a price for your religion, then abandon it.",
                "hadithUrdu": "میں قریش کی ایک جماعت میں مو جو د تھا کہ ابو ذر رضی اللہ تعالیٰ عنہ یہ کہتے ہو ئے گزرے : مال جمع کرنے والوں کو ( آگ کے ) ان داغوں کی بشارت سنا دو جو ان کی پشتوں پر لگائے جا ئیں گے اور ان کے پہلوؤں سے نکلیں گے اور ان داغوں کی جو ان کی گدیوں کی طرف سے لگا ئے جا ئیں گے اور ان کی پیشا بیوں سے نکلیں گے کہا : پھر وہ الگ تھلگ ہو کر بیٹھ گئے میں نے پو چھا یہ صاحب کو ن ہیں ؟ لو گوں نے بتا یا یہ ابو ذر رضی اللہ تعالیٰ عنہ ہیں میں اٹھ کر ان کے پا س چلا گیا اور پو چھا کیا با ت تھی تھوڑی دیر پہلے میں نے سنی آپ کہہ رہے تھے ؟انھوں نے جواب دیا میں نے اس بات کے سوا کچھ نہیں کہا جو میں نے ان کے نبی صلی اللہ علیہ وسلم سے سنی ۔ کہا میں نے پو چھا ( حکومت سے ملنے والے ) عطیے ( وظیفے ) کے بارے میں آپ کیا کہتے ہیں ؟ انھوں نے جواب دیا اسے لے لو کیونکہ آ ج یہ معونت ( مدد ) سے اور جب یہ تمھا رے دین کی قیمت ٹھہریں تو انھیں چھوڑ دینا ۔",
                "urduNarrator": "ہم سے شیبان بن فرخ نے بیان کیا، ہم سے ابو الاشہب نے بیان کیا, خلید العصری نے حضرت احنف بن قیس رضی اللہ تعالیٰ عنہ ؒ سے روایت کی انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا أَبُو الْأَشْهَبِ حَدَّثَنَا خُلَيْدٌ الْعَصَرِيُّ عَنْ الْأَحْنَفِ بْنِ قَيْسٍ قَالَ كُنْتُ فِي نَفَرٍ مِنْ قُرَيْشٍ فَمَرَّ أَبُو ذَرٍّ وَهُوَ يَقُولُ بَشِّرْ الْكَانِزِينَ بِكَيٍّ فِي ظُهُورِهِمْ يَخْرُجُ مِنْ جُنُوبِهِمْ وَبِكَيٍّ مِنْ قِبَلِ أَقْفَائِهِمْ يَخْرُجُ مِنْ جِبَاهِهِمْ قَالَ ثُمَّ تَنَحَّى فَقَعَدَ قَالَ قُلْتُ مَنْ هَذَا قَالُوا هَذَا أَبُو ذَرٍّ قَالَ فَقُمْتُ إِلَيْهِ فَقُلْتُ مَا شَيْءٌ سَمِعْتُكَ تَقُولُ قُبَيْلُ قَالَ مَا قُلْتُ إِلَّا شَيْئًا قَدْ سَمِعْتُهُ مِنْ نَبِيِّهِمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قُلْتُ مَا تَقُولُ فِي هَذَا الْعَطَاءِ قَالَ خُذْهُ فَإِنَّ فِيهِ الْيَوْمَ مَعُونَةً فَإِذَا كَانَ ثَمَنًا لِدِينِكَ فَدَعْهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9872,
                "hadithNumber": "2308",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying that Allah, the Most Blessed and High, said: O son of Adam, spend. I will spend on you. The right hand of Allah is full and overflowing and in nothing would diminish it, by overspending day and night.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فر ما یا : \"\" اللہ تعا لیٰ نے فر ما یا ہے اے آدم کے بیٹے !تو خرچ کر میں تجھ پر خرچ کروں گا ۔ اور آپ نے فر ما یا : \"\" اللہ کا دایاں ہاتھ ( اچھی طرح ) بھرا ہوا ہے ۔ ابن نمیر نے ملاي کے بجا ئے ملان ( کا لفظ ) کہا ۔ ۔ اس کا فیض جا ری رہتا ہے دن ہو یا را ت کو ئی چیز اس میں کمی نہیں کرتی ۔",
                "urduNarrator": "زہیر بن حرب اور محمد بن عبد اللہ بن نمیر نے کہا : سفیان بن عیینہ نے ہمیں ابو زنا د سے حدیث بیان کی انھوں نے اعراج سے اور انھوں نے حضرت ابوہریرہ رضی اللہ تعالیٰ عنہ سے روا یت کی وہ اس ( سلسلہ سند ) کو نبی صلی اللہ علیہ وسلم تک لے جا تے تھے کہ",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ يَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قَالَ اللَّهُ تَبَارَكَ وَتَعَالَى يَا ابْنَ آدَمَ أَنْفِقْ أُنْفِقْ عَلَيْكَ وَقَالَ يَمِينُ اللَّهِ مَلْأَى وَقَالَ ابْنُ نُمَيْرٍ مَلْآنُ سَحَّاءُ لَا يَغِيضُهَا شَيْءٌ اللَّيْلَ وَالنَّهَارَ.",
                "headingArabic": "الْحَثِّ عَلَى النَّفَقَةِ وَتَبْشِيرِ الْمُنْفِقِ بِالْخَلَفِ ‏‏",
                "headingUrdu": "خرچ کرنے کی ترغیب اور نیک کاموں میں خرچ کرنے والے کو معاوضے کی بشارت",
                "headingEnglish": "Encouragement to spend and glad tidings of compensation for the one who spends on good deeds",
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9873,
                "hadithNumber": "2309",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying that Allah said to him: Spend, I will bestow upon you. And the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: The right hand of Allah is full and spending (the riches) liberally during day and night will not diminish (the resources of Allah). Don't you see what (an enormous amount of resources) He has spent since He created the heaven and the earth, and what is in His right hand has not decreased? His Throne is upon the water. And in His other hand is death, and He elevates and degrades (whom He likes).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" اللہ تعا لیٰ نے مجھ سے کہا ہے خرچ کرو میں تم پر خرچ کروں گا ۔ اور رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" اللہ کا دا یا ں ہاتھ بھرا ہوا دن رات عطا کی بارش برسانے والا ہے اس میں کو ئی چیز کمی نہیں کرتی ۔ کیا تم نے دیکھا آسمان و زمین کی تخلیق سے لے کر ( اب تک ) اس نے کتنا خرچ کیا ہے ؟جو کچھ اس کے دا ئیں ہا تھ میں ہے اس ( عطا ) نے اس میں کو ئی کمی نہیں کی ۔ آپ نے فر ما یا : اس کا عرش پا نی پر ہے اس کے دوسرے ہا تھ میں قبضہ ( یا واپسی کی قوت ) ) ہے وہ ( جسے چا ہتا ہے ) بلند کرتا ہے اور ( جسے چا ہتا ہے ) پست کرتا ہے ۔",
                "urduNarrator": "ہم سے محمد بن رافع نے بیان کیا، کہا ہم سے عبدالرزاق بن ہمام نے بیان کیا، کہا ہم سے معمر بن راشد نے بیان کیا، وہ میرے بھائی ہمام بن منبہ  سے, وہب بن منبہ کے بھا ئی ہمام بن منبہ سے روایت ہے کہا : یہ احادیث ہیں جو ہمیں حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے بیان کیں پھر انھوں نے چند احادیث بیان کیں ان میں سے ایک یہ بھی تھی اور ابو ہریرہ رضی اللہ تعالیٰ عنہ نے ) کہا",
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ بْنُ هَمَّامٍ حَدَّثَنَا مَعْمَرُ بْنُ رَاشِدٍ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ أَخِي وَهْبِ بْنِ مُنَبِّهٍ قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ قَالَ لِي أَنْفِقْ أُنْفِقْ عَلَيْكَ وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمِينُ اللَّهِ مَلْأَى لَا يَغِيضُهَا سَحَّاءُ اللَّيْلَ وَالنَّهَارَ أَرَأَيْتُمْ مَا أَنْفَقَ مُذْ خَلَقَ السَّمَاءَ وَالْأَرْضَ فَإِنَّهُ لَمْ يَغِضْ مَا فِي يَمِينِهِ قَالَ وَعَرْشُهُ عَلَى الْمَاءِ وَبِيَدِهِ الْأُخْرَى الْقَبْضَ يَرْفَعُ وَيَخْفِضُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9874,
                "hadithNumber": "2310",
                "englishNarrator": "Thauban رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The most excellent dinar is one that a person spends on his family, and the dinar which he spends on his animal in Allah's path, and the dinar he spends on his companions in Allah's path. Abu Qilaba (one of the narrators) said: He (the narrator) started with family, and then Abu Qilaba said: Who is the person with greater reward than a person who spends on young members of his family (and thus) preserves (saves them from want) (and by virtue of which) Allah brings profit for them and makes them rich.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" بہترین دینار جسے انسان خرچ کرتا ہے وہ دینا ر ہے جسے وہ اپنے اہل و عیال پر خرچ کرتا ہے اور وہ دینار ہے جسے انسان اللہ کی را ہ میں ( جہاد کرنے کے لیے ) اپنے جا نور ( سواری ) پر خرچ کرتا ہے اور وہ دینا ر ہے جسے وہ اللہ کے را ستے میں اپنے ساتھیوں پر خرچ کرتا ہے ۔ پھر ابو قلابہ نے کہا : آپ نے اہل و عیال سے ابتدا فر ما ئی پھر ابو قلا بہ نے کہا : اجر میں اس آدمی سے بڑھ کر کو ن ہو سکتا ہے جو چھوٹے بچوں پر خرچ کرتا ہے وہ ان کو ( سوال کی ) ذلت سے بچاتا ہے یا اللہ اس کے ذریعے سے انھیں فائدہ پہنچاتا ہے اور غنی کرتا ہے ۔",
                "urduNarrator": "ہم سے ابو الربیع الزہرانی اور قتیبہ بن سعید دونوں نے حماد بن زید کی سند سے بیان کیا، ابو الربیع نے کہا: ہم سے حماد نے بیان کیا، ہم سے ایوب نے بیان کیا, ابو قلابہ نے ابو اسماء ( رحبی ) سے اور انھوں نے حضرت ثوبان رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو الرَّبِيعِ الزَّهْرَانِيُّ وَقُتَيْبَةُ بْنُ سَعِيدٍ كِلَاهُمَا عَنْ حَمَّادِ بْنِ زَيْدٍ قَالَ أَبُو الرَّبِيعِ حَدَّثَنَا حَمَّادٌ حَدَّثَنَا أَيُّوبُ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي أَسْمَاءَ عَنْ ثَوْبَانَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفْضَلُ دِينَارٍ يُنْفِقُهُ الرَّجُلُ دِينَارٌ يُنْفِقُهُ عَلَى عِيَالِهِ وَدِينَارٌ يُنْفِقُهُ الرَّجُلُ عَلَى دَابَّتِهِ فِي سَبِيلِ اللَّهِ وَدِينَارٌ يُنْفِقُهُ عَلَى أَصْحَابِهِ فِي سَبِيلِ اللَّهِ قَالَ أَبُو قِلَابَةَ وَبَدَأَ بِالْعِيَالِ ثُمَّ قَالَ أَبُو قِلَابَةَ وَأَيُّ رَجُلٍ أَعْظَمُ أَجْرًا مِنْ رَجُلٍ يُنْفِقُ عَلَى عِيَالٍ صِغَارٍ يُعِفُّهُمْ أَوْ يَنْفَعُهُمْ اللَّهُ بِهِ وَيُغْنِيهِمْ.",
                "headingArabic": "فَضْلِ النَّفَقَةِ عَلَى الْعِيَالِ وَالْمَمْلُوكِ وَإِثْمِ مَنْ ضَيَّعَهُمْ أَوْ حَبَسَ نَفَقَتَهُمْ عَنْهُمْ",
                "headingUrdu": "اپنے اہل وعیال اور غلاموں پر خرچ کرنے کی فضیلت اور ان سے غفلت برتنے والے یا ان سے نفقہ روکنے والے کا گناہ",
                "headingEnglish": "The virtue of spending on one's family and slaves, and the sin of the one who neglects them or withholds maintenance from them",
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9875,
                "hadithNumber": "2311",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Of the dinar you spend as a contribution in Allah's path, or to set free a slave, or as a sadaqa given to a needy, or to support your family, the one yielding the greatest reward is that which you spent on your family.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا \" ( جن دیناروں پر اجر ملتا ہے ان میں سے ) ایک دینا وہ ہے جسےتو نے اللہ کی راہ میں خرچ کیا ایک دیناروہ ہے جسے تو نے کسی کی گردن ( کی آزادی ) کے لیے خرچ کیا ایک دینا ر وہ ہے جسے تو نے مسکین پر صدقہ کیا اور ایک دینار وہ ہے جسے تو نے اپنے گھر والوں پر صرف کیا ان میں سب سے عظیم اجر اس دینار کا ہے جسے تو نے اپنے اہل پر خرچ کیا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، زہیر بن حرب اور ابو کریب نے بیان کیا، اور یہ قول ابو کریب کا ہے، انہوں نے کہا: ہم سے وکیع نے، سفیان کی سند سے، مز اہم بن مجاہد کی سند سے بیان کیا, حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت ہے انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ وَأَبُو كُرَيْبٍ وَاللَّفْظُ لِأَبِي كُرَيْبٍ قَالُوا حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ مُزَاحِمِ بْنِ زُفَرَ عَنْ مُجَاهِدٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دِينَارٌ أَنْفَقْتَهُ فِي سَبِيلِ اللَّهِ وَدِينَارٌ أَنْفَقْتَهُ فِي رَقَبَةٍ وَدِينَارٌ تَصَدَّقْتَ بِهِ عَلَى مِسْكِينٍ وَدِينَارٌ أَنْفَقْتَهُ عَلَى أَهْلِكَ أَعْظَمُهَا أَجْرًا الَّذِي أَنْفَقْتَهُ عَلَى أَهْلِكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9876,
                "hadithNumber": "2312",
                "englishNarrator": "Khaithama reported:",
                "hadithEnglish": "While we were sitting in the company of 'Abdullah bin 'Umar رضی اللہ تعالیٰ عنہ there came in his steward. He (Ibn 'Umar) said: Have you supplied the provision to the slaves? He said: No. Upon this he said: Go and give (the provision) to them, for the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) has said: This sin is enough for a man that he withholds the subsistence from one whose master he is.",
                "hadithUrdu": "ہم حضرت عبد اللہ بن عمرو رضی اللہ تعالیٰ عنہ کے پاس بیٹھے ہو ئے تھے کہ اچا نک ان کا کا رندہ ( مینیجر ) ان کے پاس آیا وہ اندر داخل ہوا تو انھوں نے پو چھا : ( کیا ) تم نے غلا موں کو ان کا روزینہ دے دیا ہے؟ اس نے جواب دیا نہیں انھوں نے کہا : جا ؤ انھیں دو ۔ ( کیونکہ ) رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" انسان کے لیے اتنا گناہ ہی کا فی ہے کہ وہ جن کی خوراک کا مالک ہے انھیں نہ دے ۔",
                "urduNarrator": "ہم سے سعید بن محمد الجرمی نے بیان کیا، کہا ہم سے عبدالرحمٰن بن عبد الملک بن ابجر الکنانی نے اپنے والد سے، وہ طلحہ بن مصرف کی سند سے، انہوں نےخیثمہ سے روایت ہے کہا",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ مُحَمَّدٍ الْجَرْمِيُّ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبْجَرَ الْكِنَانِيُّ عَنْ أَبِيهِ عَنْ طَلْحَةَ بْنِ مُصَرِّفٍ عَنْ خَيْثَمَةَ قَالَ كُنَّا جُلُوسًا مَعَ عَبْدِ اللَّهِ بْنِ عَمْرٍو إِذْ جَاءَهُ قَهْرَمَانٌ لَهُ فَدَخَلَ فَقَالَ أَعْطَيْتَ الرَّقِيقَ قُوتَهُمْ قَالَ لَا قَالَ فَانْطَلِقْ فَأَعْطِهِمْ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَفَى بِالْمَرْءِ إِثْمًا أَنْ يَحْبِسَ عَمَّنْ يَمْلِكُ قُوتَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9877,
                "hadithNumber": "2313",
                "englishNarrator": "Jabir رضی اللہ تعالیٰ عنہ سreported:",
                "hadithEnglish": "A person from the Banu 'Udhra set a slave free after his death. This news reached the Messenger of Allah (ﷺ). Upon this he said: Have you any property besides it? He said: No. Upon this he said: Who would buy (this slave) from me? Naeem bin Abdullah bought it for eight hundred dirhams and (this amount was) brought to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) who returned it to him (the owner), and then said: Start with your own self and spend it on yourself, and if anything is left, it should be spent on your family, and if anything is left (after meeting the needs of the family) it should be spent on relatives, and if anything is left from the family, it should be spent like this, like this. And he was saying: In front of you, on your right and on your left.",
                "hadithUrdu": "بنو عذرہ کے ایک آدمی نے ایک غلام کو اپنے بعد آزادی دی ( کہ میرے مرنے کے بعد وہ آزاد ہو گا ) یہ بات رسول اللہ صلی اللہ علیہ وسلم تک پہنچی تو آپ نے پو چھا : کیا تمھا رے پاس اس کے علاوہ بھی کو ئی مال ہے ؟اس نے کہا : نہیں اس پر آپ نے فر ما یا : \" اس ( غلام ) کو مجھ سے کو ن خریدے گا ؟ تو اسے نعیم بن عبد اللہ عدوی نے آٹھ سو ( 800 ) درہم میں خرید لیا اور درہم لا کر رسول اللہ صلی اللہ علیہ وسلم کو پیش کر دیے ۔ اس کے بعد آپ نے فر ما یا : \" اپنے آپ سے ابتدا کرو خود پر صدقہ کرو اگر کچھ بچ جا ئے تو تمھا رے گھروالوں کے لیے ہے اگر تمھا رے گھروالوں سے کچھ بچ جا ئے تو تمھا رے قرابت داروں کے لیے ہے اور اگر تمھارے قرابت داروں سے کچھ بچ جا ئے تو اس طرف اور اس طرف خرچ کرو ۔ ( راوی نے کہا : ) آپ اشارے سے کہہ رہے تھے کہ اپنے سامنے اپنے دائیں اور اپنے بائیں ( خرچ کرو ۔ )",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, لیث نے ہمیں ابو زبیر سے خبر دی اور انھوں نے حضرت جا بر رضی اللہ تعالیٰ عنہ سے روایت کی ۔ انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ أَعْتَقَ رَجُلٌ مِنْ بَنِي عُذْرَةَ عَبْدًا لَهُ عَنْ دُبُرٍ فَبَلَغَ ذَلِكَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَلَكَ مَالٌ غَيْرُهُ فَقَالَ لَا فَقَالَ مَنْ يَشْتَرِيهِ مِنِّي فَاشْتَرَاهُ نُعَيْمُ بْنُ عَبْدِ اللَّهِ الْعَدَوِيُّ بِثَمَانِ مِائَةِ دِرْهَمٍ فَجَاءَ بِهَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَدَفَعَهَا إِلَيْهِ ثُمَّ قَالَ ابْدَأْ بِنَفْسِكَ فَتَصَدَّقْ عَلَيْهَا فَإِنْ فَضَلَ شَيْءٌ فَلِأَهْلِكَ فَإِنْ فَضَلَ عَنْ أَهْلِكَ شَيْءٌ فَلِذِي قَرَابَتِكَ فَإِنْ فَضَلَ عَنْ ذِي قَرَابَتِكَ شَيْءٌ فَهَكَذَا وَهَكَذَا يَقُولُ فَبَيْنَ يَدَيْكَ وَعَنْ يَمِينِكَ وَعَنْ شِمَالِكَ.",
                "headingArabic": "خرچ کرتے وقت اپنے آپ سے، پھر اپنے خاندان سے، پھر اپنے رشتہ داروں سے شروع کرتے ہیں۔",
                "headingUrdu": "خرچ کرتے وقت اپنے آپ سے، پھر اپنے خاندان سے، پھر اپنے رشتہ داروں سے شروع کرتے ہیں۔",
                "headingEnglish": "Starting with oneself, then one's family, then one's relatives, when spending",
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9878,
                "hadithNumber": "2314",
                "englishNarrator": "Jabir رضی اللہ تعالیٰ عنہreported:",
                "hadithEnglish": "A person among the Ansar who was called Abu Madhkur granted posthumous freedom to his slave who was called Ya'qub. The rest of the hadith is the same.",
                "hadithUrdu": "انصار میں سے ابو مذکور نامی ایک آدمی نے اپنے غلام کو جسے یعقوب کہا جا تاتھا ، اپنے مرنے پر آزاد کے بعد آزاد قرار دیا ۔ ۔ ۔ آگے انھوں نے لیث کی حدیث کے ہم معنی حدیث بیان کی ۔",
                "urduNarrator": "مجھ سے یعقوب بن ابراہیم الدورقی نے بیان کیا، اسمٰعیل یعنی ابن علیّہ نے ہم سے بیان کیا, ایوب نے ابو زبیر سے اور انھوں نے حضرت جابر رضی اللہ تعالیٰ عنہ سے روایت کہ",
                "hadithArabic": "و حَدَّثَنِي يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ حَدَّثَنَا إِسْمَعِيلُ يَعْنِي ابْنَ عُلَيَّةَ عَنْ أَيُّوبَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ أَنَّ رَجُلًا مِنْ الْأَنْصَارِ يُقَالُ لَهُ أَبُو مَذْكُورٍ أَعْتَقَ غُلَامًا لَهُ عَنْ دُبُرٍ يُقَالُ لَهُ يَعْقُوبُ وَسَاقَ الْحَدِيثَ بِمَعْنَى حَدِيثِ اللَّيْثِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9879,
                "hadithNumber": "2315",
                "englishNarrator": "Anas bin Malik رضی اللہ تعالیٰ عنہ is reported as saying:",
                "hadithEnglish": "Abu Talha was the one among the Ansar of Medina who possessed the largest property and among his property he valued most was his garden known as Bairaha' which was opposite the mosque, and the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) often visited it and he drank of its sweet water. When this verse was revealed: You will never attain righteousness till you give freely of what you love (iii. 91), Abu Talha رضی اللہ تعالیٰ عنہ got up and, going to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), said: Allah says in His Book: You will never attain righteousness till you give freely of what you love, and the dearest of my property is Bairaha' so I give it as Sadaqa to God from Whom I hope for reward for it and the treasure with Allah; so spend it, Messenger of Allah, on whatever purpose you deem it proper. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Well done! that is a profitable deal, that is a profitable deal. I have heard what you have said, but I think you should spend it on your nearest relatives. So Abu Talha رضی اللہ تعالیٰ عنہ distributed it among the nearest relatives and his cousins on his father's side.",
                "hadithUrdu": "ابو طلحہ مدینہ میں کسی بھی انصاری سے زیادہ مالدار تھے ، ان کے مال میں سے بیرحاء والا باغ انھیں سب سے زیادہ پسند تھا جو مسجد نبوی کے سامنے واقع تھا ، رسول اللہ صلی اللہ علیہ وسلم اس میں تشریف لے جاتے اور اس کا عمدہ پانی نوش فرماتے ۔ انس رضی اللہ تعالیٰ عنہ نے کہا : جب یہ آیت نازل ہوئی : \"\" تم نیکی حاصل نہیں کرسکوگے جب تک ا پنی محبوب چیز ( اللہ کی راہ میں ) خرچ نہ کرو گے ۔ \"\" ابو طلحہ رضی اللہ تعالیٰ عنہ اٹھ کر رسول اللہ صلی اللہ علیہ وسلم کے پاس گئے اور عرض کی : اللہ تعالیٰ اپنی کتاب میں فرماتے ہیں کہ : تم نیکی حاصل نہیں کرسکو گے حتیٰ کہ ا پنی پسندیدہ چیز ( اللہ کی راہ میں ) خرچ کرو ۔ \"\" مجھے اپنے اموال میں سے سب سے زیادہ بیرحاء پسند ہے اور وہ اللہ کے لئے صدقہ ہے ، مجھے اس کے اچھے بدلے اور اللہ کے ہاں ذخیرہ ( کے طور پر محفوظ ) ہوجانے کی امید ہے ۔ اے اللہ کے رسول صلی اللہ علیہ وسلم ! آپ اسے جہاں چاہیں رکھیں ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" بہت خوب ، یہ سود مند مال ہے ، یہ نفع بخش مال ہے ، جو تم نے اس کے بارے میں کہا میں نے سن لیا ہے اور میری رائے یہ ہےکہ تم اسے ( اپنے ) قرابت داروں کو دے دو ۔ \"\" توابو طلحہ رضی اللہ تعالیٰ عنہ نے اسے اپنے عزیزوں اور اپنے چچا کے بیٹوں میں تقسیم کردیا ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے مالک رضی اللہ عنہ سے اس کے متعلق پڑھا, اسحاق بن عبداللہ بن ابی طلحہ سے روایت ہے کہ انھوں نے حضرت بن مالک رضی اللہ تعالیٰ عنہ سے سنا ، وہ فرما رہے تھے",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ يَقُولُ كَانَ أَبُو طَلْحَةَ أَكْثَرَ أَنْصَارِيٍّ بِالْمَدِينَةِ مَالًا وَكَانَ أَحَبُّ أَمْوَالِهِ إِلَيْهِ بَيْرَحَى وَكَانَتْ مُسْتَقْبِلَةَ الْمَسْجِدِ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدْخُلُهَا وَيَشْرَبُ مِنْ مَاءٍ فِيهَا طَيِّبٍ قَالَ أَنَسٌ فَلَمَّا نَزَلَتْ هَذِهِ الْآيَةُ لَنْ تَنَالُوا الْبِرَّ حَتَّى تُنْفِقُوا مِمَّا تُحِبُّونَ قَامَ أَبُو طَلْحَةَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ اللَّهَ يَقُولُ فِي كِتَابِهِ لَنْ تَنَالُوا الْبِرَّ حَتَّى تُنْفِقُوا مِمَّا تُحِبُّونَ وَإِنَّ أَحَبَّ أَمْوَالِي إِلَيَّ بَيْرَحَى وَإِنَّهَا صَدَقَةٌ لِلَّهِ أَرْجُو بِرَّهَا وَذُخْرَهَا عِنْدَ اللَّهِ فَضَعْهَا يَا رَسُولَ اللَّهِ حَيْثُ شِئْتَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَخْ ذَلِكَ مَالٌ رَابِحٌ ذَلِكَ مَالٌ رَابِحٌ قَدْ سَمِعْتُ مَا قُلْتَ فِيهَا وَإِنِّي أَرَى أَنْ تَجْعَلَهَا فِي الْأَقْرَبِينَ فَقَسَمَهَا أَبُو طَلْحَةَ فِي أَقَارِبِهِ وَبَنِي عَمِّهِ.",
                "headingArabic": "رشتہ داروں، میاں بیوی، اولاد اور والدین پر خرچ کرنے اور صدقہ کرنے کی فضیلت، خواہ وہ مشرک ہی کیوں نہ ہوں۔",
                "headingUrdu": "رشتہ داروں، میاں بیوی، اولاد اور والدین پر خرچ کرنے اور صدقہ کرنے کی فضیلت، خواہ وہ مشرک ہی کیوں نہ ہوں۔",
                "headingEnglish": "The virtue of spending and giving charity to relatives, spuses, children and parents, even if they are idolaters",
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9880,
                "hadithNumber": "2316",
                "englishNarrator": "Anas رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "When this verse was tevealed: You will not attain righteousness till you give freely of what you love, Abu Talha رضی اللہ تعالیٰ عنہ said: I see that our Lord has demanded from us out of our property; so I make you a witness, Messenger of Allah. that I give my land known as Bairaha' for the sake of Allah. Upon this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Give that to your relatives. So he gave it to Hassan bin Thabit and Ubayy bin Ka'b.",
                "hadithUrdu": "جب یہ آیت نازل ہوئی؛ \" تم نیکی ( کی حقیقی لذت ) حاصل نہیں کرسکو گے حتیٰ کہ اپنی محبوب ترین چیز ( اللہ کی راہ میں ) صرف کردو ۔ \" ( تو ) ابو طلحہ رضی اللہ تعالیٰ عنہ نے کہا : میں اپنے پروردیگار کو دیکھتا ہوں کہ وہ ہم سے مال کا مطالبہ کررہا ہے ، لہذا اے اللہ کے رسول صلی اللہ علیہ وسلم ! میں آپ کو گواہ بناتا ہوں کہ میں نے اپنی زمین بیرحاء اللہ تعالیٰ کے لئے وقف کردی ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اسے ا پنے رشتہ داروں کو دے دو ۔ \" تو انھوں نے وہ حضرت حسان بن ثابت اور ابی بن کعب رضوان اللہ عنھم اجمعین کو دے دی ۔",
                "urduNarrator": "ہم سے محمد بن حاتم نے بیان کیا، کہا ہم سے بہز نے بیان کیا، کہا ہم سے حماد بن سلمہ نے بیان کیا، انہوں نے کہا, ثابت نے حضرت انس رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا بَهْزٌ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ حَدَّثَنَا ثَابِتٌ عَنْ أَنَسٍ قَالَ لَمَّا نَزَلَتْ هَذِهِ الْآيَةُ لَنْ تَنَالُوا الْبِرَّ حَتَّى تُنْفِقُوا مِمَّا تُحِبُّونَ قَالَ أَبُو طَلْحَةَ أَرَى رَبَّنَا يَسْأَلُنَا مِنْ أَمْوَالِنَا فَأُشْهِدُكَ يَا رَسُولَ اللَّهِ أَنِّي قَدْ جَعَلْتُ أَرْضِي بَرِيحَا لِلَّهِ قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اجْعَلْهَا فِي قَرَابَتِكَ قَالَ فَجَعَلَهَا فِي حَسَّانَ بْنِ ثَابِتٍ وَأُبَيِّ بْنِ كَعْبٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9881,
                "hadithNumber": "2317",
                "englishNarrator": "Maimuna bint Harith رضی اللہ تعالیٰ عنہا reported:",
                "hadithEnglish": "She set free a slave-girl during the lifetime of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and she made a mention of that to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and he said: Had you gives her to your maternal uncles, you would have a greater reward.",
                "hadithUrdu": "انھوں نے رسول اللہ صلی اللہ علیہ وسلم کے دور میں اپنی ایک لونڈی کو آزاد کیا ۔ اور رسول اللہ صلی اللہ علیہ وسلم کے پاس اس کا تذکرہ کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" اگر تم اسے اپنے ماموؤں کو دے دیتیں تو یہ ( کام ) تمھارے اجر کو بڑا کردیتا ۔ \"",
                "urduNarrator": "مجھ سے ہارون بن سعید الایلی نے بیان کیا، مجھ سے ابن وہب نے بیان کیا، مجھ سے عمرو نے، بقیر کے واسطہ سے، کریب کے واسطہ سے, ( ام المومنین ) حضرت میمونہ بنت حارث رضی اللہ تعالیٰ عنہا سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو عَنْ بُكَيْرٍ عَنْ كُرَيْبٍ عَنْ مَيْمُونَةَ بِنْتِ الْحَارِثِ أَنَّهَا أَعْتَقَتْ وَلِيدَةً فِي زَمَانِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَتْ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَوْ أَعْطَيْتِهَا أَخْوَالَكِ كَانَ أَعْظَمَ لِأَجْرِكِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9882,
                "hadithNumber": "2318",
                "englishNarrator": "Zainab رضی اللہ تعالیٰ عنہا , the wife of 'Abdullah (bin Mas'ud) رضی اللہ تعالیٰ عنہ , reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: O women, give sadaqa even though it be some of your jewellery. She returned to 'Abdullah رضی اللہ تعالیٰ عنہ and said: You are a person with empty hands, whereas the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) has commanded us to give sadaqa, so better go to him and ask and if this will suffice for me; otherwise I shall give it to someone else. 'Abdullah رضی اللہ تعالیٰ عنہ said to me (his wife): You better go yourself. So I went and there was another woman of the Ansar at the door of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) having the same porpose as I had. Now Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was invested with awe (so we did not like to knock). Then Bilal رضی اللہ تعالیٰ عنہ came out and we said to him: Go to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and inform him that there are two women at the door asking him whether it will serve them to give sadaqa to their spouses and to orphans who are under their charge, but do not inform him who we are. Bilal went to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and asked him (what these women had instructed him to ask). The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) asked him who these women were. He (Bilal رضی اللہ تعالیٰ عنہ ) said: They are women from Ansar and Zainab. Upon this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Which of the Zainabs? He said: The wife of 'Abdullah رضی اللہ تعالیٰ عنہ . The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: There are two rewards for them, the reward of kinship and the reward of Sadaqa.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اے عورتوں کی جماعت ! صدقہ کرو ، اگرچہ اپنے زیورات سے ہی کیوں نہ ہو ۔ \" کہا : تو میں ( اپنے خاوند ) عبداللہ رضی اللہ تعالیٰ عنہ کے پاس واپس آئی اور کہا : تم کم مایا آدمی ہو اور رسول اللہ صلی اللہ علیہ وسلم نے ہمیں صدقہ کرنے کا حکم دیا ہے ، لہذا تم آپ صلی اللہ علیہ وسلم کے پاس جا کر آپ سے پوچھ لو اگراس ( کو تمھیں دینے ) سے میری طرف سے ادا ہوجائےگا ( تو ٹھیک ) ورنہ میں اے تمھارے علاوہ دوسروں کی طرف بھیج دو گی ، کہا : تو عبداللہ رضی اللہ تعالیٰ عنہ نے مجھ سے کہا : بلکہ تم خود ہی آپ صلی اللہ علیہ وسلم کے پاس چلی جاؤ ۔ انھوں نے کہا : میں گئی تو اس وقت ایک اور انصاری عورت بھی رسول اللہ صلی اللہ علیہ وسلم کے دروازے پر کھڑی تھی اور ( مسئلہ دریافت کرنے کے حوالے سے ) اسکی ضرورت بھی وہی تھی جو میری تھی ، اور رسول اللہ صلی اللہ علیہ وسلم کی ہیبت عطا کی گئی تھی ۔ کہا : بلال رضی اللہ تعالیٰ عنہ نکل کر ہماری طرف آئے تو ہم نے ان سے کہا : رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں جاؤ اور آپ صلی اللہ علیہ وسلم کو بتاؤ کے درواز ے پر دو عور تیں ہیں آپ سے پوچھ رہی ہیں کہ ان کی طرف سے ان کے خاوندوں اور ان یتیم بچوں پر جوا ن کی کفالت میں ہیں ، صدقہ جائز ہے؟اورآپ صلی اللہ علیہ وسلم کویہ نہ بتاناکہ ہم کون ہیں ۔ بلال رضی اللہ تعالیٰ عنہ رسول اللہ صلی اللہ علیہ وسلم کے پاس حاضر ہوئے اور آپ صلی اللہ علیہ وسلم سے پوچھا ۔ رسول اللہ صلی اللہ علیہ وسلم نے بلال رضی اللہ تعالیٰ عنہ سے کہا : وہ دونوں کون ہیں؟ \" انھوں نے کہا : ایک انصاری عورت ہے اور ایک زینب ہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے پوچھا : \" زینبوں میں سے کون سی؟ \" انھوں نے کہا : عبداللہ رضی اللہ تعالیٰ عنہ کی بیوی ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے ان سے کہا : \" ان کے لئے دو اجر ہیں : ( ایک ) قرابت نبھانے کا اجر اور ( دوسرا ) صدقہ کرنے کا اجر ۔ \"",
                "urduNarrator": "ہم سے حسن بن ربیع نے بیان کیا, ابواحوص نے اعمش سے حدیث بیان کی ، انھوں نے ابو وائل سے ، انھوں نے عمرو بن حارث سے اور انھوں نے حضرت عبداللہ رضی اللہ تعالیٰ عنہ ( بن مسعود ) کی بیوی زینب رضی اللہ تعالیٰ عنہا ( بنت عبداللہ بن ابی معاویہ ) سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا حَسَنُ بْنُ الرَّبِيعِ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ الْأَعْمَشِ عَنْ أَبِي وَائِلٍ عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ زَيْنَبَ امْرَأَةِ عَبْدِ اللَّهِ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَصَدَّقْنَ يَا مَعْشَرَ النِّسَاءِ وَلَوْ مِنْ حُلِيِّكُنَّ قَالَتْ فَرَجَعْتُ إِلَى عَبْدِ اللَّهِ فَقُلْتُ إِنَّكَ رَجُلٌ خَفِيفُ ذَاتِ الْيَدِ وَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ أَمَرَنَا بِالصَّدَقَةِ فَأْتِهِ فَاسْأَلْهُ فَإِنْ كَانَ ذَلِكَ يَجْزِي عَنِّي وَإِلَّا صَرَفْتُهَا إِلَى غَيْرِكُمْ قَالَتْ فَقَالَ لِي عَبْدُ اللَّهِ بَلْ ائْتِيهِ أَنْتِ قَالَتْ فَانْطَلَقْتُ فَإِذَا امْرَأَةٌ مِنْ الْأَنْصَارِ بِبَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَاجَتِي حَاجَتُهَا قَالَتْ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ أُلْقِيَتْ عَلَيْهِ الْمَهَابَةُ قَالَتْ فَخَرَجَ عَلَيْنَا بِلَالٌ فَقُلْنَا لَهُ ائْتِ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبِرْهُ أَنَّ امْرَأَتَيْنِ بِالْبَابِ تَسْأَلَانِكَ أَتُجْزِئُ الصَّدَقَةُ عَنْهُمَا عَلَى أَزْوَاجِهِمَا وَعَلَى أَيْتَامٍ فِي حُجُورِهِمَا وَلَا تُخْبِرْهُ مَنْ نَحْنُ قَالَتْ فَدَخَلَ بِلَالٌ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَهُ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ هُمَا فَقَالَ امْرَأَةٌ مِنْ الْأَنْصَارِ وَزَيْنَبُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّ الزَّيَانِبِ قَالَ امْرَأَةُ عَبْدِ اللَّهِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَهُمَا أَجْرَانِ أَجْرُ الْقَرَابَةِ وَأَجْرُ الصَّدَقَة.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9883,
                "hadithNumber": "2319",
                "englishNarrator": "A hadith like this has been narrated on the authority of Zainab رضی اللہ تعالیٰ عنہا the wife of 'Abdullah رضی اللہ تعالیٰ عنہ , and she said:",
                "hadithEnglish": "I was in the mosque and the Prophet of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) saw me and said: Give Sadaqa even though it is out of your jewellery. The rest of the hadith is the same.",
                "hadithUrdu": "میں مسجد میں تھی ( اس دروازے پر جو مسجد میں تھا ) نبی اکرم صلی اللہ علیہ وسلم نے ( بلال رضی اللہ تعالیٰ عنہ کے بتانے پر ) مجھے دیکھا تو فرمایا : \" صدقہ کرو ، چاہے اپنے زیورات ہی سے کیوں نہ ہو ۔ \" اعمش نے باقی حدیث ابواحوص کی ( مذکورہ بالا ) روایت کے ہم معنی بیان کی ہے ۔",
                "urduNarrator": "مجھ سے احمد بن یوسف الازدی نے بیان کیا ,عمر بن حفص بن غیاث نے اپنے والد سے ، انھوں نے اعمش سے باقی ماندہ سابقہ سند کے ساتھ روایت کی ۔ ( اعمش نے ) کہا : میں نے ( یہ حدیث ) ابراہیم نخعی سے بیان کی تو انھوں نے مجھے ابو عبیدہ سے حدیث بیان کی ، انھوں نے عمرو بن حارث سے اور انھوں نے حضرت عبداللہ رضی اللہ تعالیٰ عنہ کی بیوی زینب رضی اللہ تعالیٰ عنہا سے روایت کی ، بالکل اسی ( مذکوہ بالا روایت ) کے مانند ، اور کہا : انھوں ( زینب رضی اللہ تعالیٰ عنہا ) نےکہا",
                "hadithArabic": "حَدَّثَنِي أَحْمَدُ بْنُ يُوسُفَ الْأَزْدِيُّ حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ حَدَّثَنَا أَبِي حَدَّثَنَا الْأَعْمَشُ حَدَّثَنِي شَقِيقٌ عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ زَيْنَبَ امْرَأَةِ عَبْدِ اللَّهِ قَالَ فَذَكَرْتُ لِإِبْرَاهِيمَ فَحَدَّثَنِي عَنْ أَبِي عُبَيْدَةَ عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ زَيْنَبَ امْرَأَةِ عَبْدِ اللَّهِ بِمِثْلِهِ سَوَاءً قَالَ قَالَتْ كُنْتُ فِي الْمَسْجِدِ فَرَآنِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ تَصَدَّقْنَ وَلَوْ مِنْ حُلِيِّكُنَّ وَسَاقَ الْحَدِيثَ بِنَحْوِ حَدِيثِ أَبِي الْأَحْوَصِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9884,
                "hadithNumber": "2320",
                "englishNarrator": "Umm Salama رضی اللہ تعالیٰ عنہا said:",
                "hadithEnglish": "I asked the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) whether there is a reward for me if I spend on Abu Salama's sons, and I am not going to abandon them in this state (of helplessness) for they are my sons. He (the Holy Prophet) said: Yes. For you is the reward for what you spend on them.",
                "hadithUrdu": "میں نے عرض کی : اے اللہ کے رسول صلی اللہ علیہ وسلم !کیا ابو سلمہ رضی اللہ تعالیٰ عنہ کی اولاد پر خرچ کرنے میں میرے لئے اجر ہے؟میں ان پر خرچ کر تی ہوں ، میں انھیں ایسے ، ایسے چھوڑنے والی نہیں ہوں ، وہ میرے بچے ہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" ہاں ، تمھارے لئے ان میں ، جو تم ان پر خرچ کروگی ، اجر ہے ۔ \"",
                "urduNarrator": "ہم سے ابو کریب محمد بن الاعلٰی نے بیان کیا, ابواسامہ نے کہا : ہمیں ہشام بن عروہ نے اپنے و الد سے حدیث بیان کی ، انھوں نے زینب بنت ابی سلمہ رضی اللہ تعالیٰ عنہا سے اور انھوں نے ام سلمہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنَا هِشَامٌ عَنْ أَبِيهِ عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ عَنْ أُمِّ سَلَمَةَ قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ هَلْ لِي أَجْرٌ فِي بَنِي أَبِي سَلَمَةَ أُنْفِقُ عَلَيْهِمْ وَلَسْتُ بِتَارِكَتِهِمْ هَكَذَا وَهَكَذَا إِنَّمَا هُمْ بَنِيَّ فَقَالَ نَعَمْ لَكِ فِيهِمْ أَجْرُ مَا أَنْفَقْتِ عَلَيْهِمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9885,
                "hadithNumber": "2321",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated by Ibn 'Urwa with the same chain of transmitters.",
                "hadithUrdu": "مجھ سے سوید بن سعید نے بیان کیا، کہا ہم سےعلی بن مسہر اور معمر ( راشد ) دونوں نے باقی ماندہ اسی سند کے ساتھ ہشام بن عروہ سے اسی کے مانند ر وایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنِي سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ ح و حَدَّثَنَاه إِسْحَقُ بْنُ إِبْرَاهِيمَ وَعَبْدُ بْنُ حُمَيْدٍ قَالَا أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ جَمِيعًا عَنْ هِشَامِ بْنِ عُرْوَةَ فِي هَذَا الْإِسْنَادِ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9886,
                "hadithNumber": "2322",
                "englishNarrator": "Abu Mas'ud رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger (ﷺ) as saying: When a Muslim spends on his family seeking reward for it from Allah, it counts for him as sadaqa.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" مسلمان جب اپنے اہل وعیال پر خرچ کرتا ہے اور اس سے اللہ کی رضا چاہتا ہے تو وہ اس کے لئے صدقہ ہے ۔ \"",
                "urduNarrator": "عبیداللہ بن معاذ عنبری کے والد نے حدیث بیان کی ، کہا : ہمیں شعبہ نے عدی بن ثابت سے حدیث بیان کی ، انھوں نے عبداللہ بن یزید سے ، انھوں نے حضرت ابو مسعود بدری رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ عَدِيٍّ وَهُوَ ابْنُ ثَابِتٍ عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ عَنْ أَبِي مَسْعُودٍ الْبَدْرِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الْمُسْلِمَ إِذَا أَنْفَقَ عَلَى أَهْلِهِ نَفَقَةً وَهُوَ يَحْتَسِبُهَا كَانَتْ لَهُ صَدَقَةً",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9887,
                "hadithNumber": "2323",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated by Shu'ba with the same chain of transmitters.",
                "hadithUrdu": "اور ہم سے محمد بن بشار اور ابوبکر بن نافع نے بیان کیا, محمد بن جعفر اور وکیع دونوں نے باقی ماندہ اسی سند کے ساتھ شعبہ سے یہی حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَاه مُحَمَّدُ بْنُ بَشَّارٍ وَأَبُو بَكْرِ بْنُ نَافِعٍ كِلَاهُمَا عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ ح و حَدَّثَنَاه أَبُو كُرَيْبٍ حَدَّثَنَا وَكِيعٌ جَمِيعًا عَنْ شُعْبَةَ فِي هَذَا الْإِسْنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9888,
                "hadithNumber": "2324",
                "englishNarrator": "Asma' رضی اللہ تعالیٰ عنہا daughter of Abu Bakr reported:",
                "hadithEnglish": "I said: Messenger of Allah, my mother, who is inclined or scared has come to me. Should I (even An her position of being opposed to Islam) treat her well? He said: Yes.",
                "hadithUrdu": "میں نے پوچھا : اے اللہ کے رسول صلی اللہ علیہ وسلم !میرے والدہ میرے پاس آئی ہیں اور ( صلہ رحمی کی ) خواہش مند ہیں ۔ یا ( خالی ہاتھ واپسی سے ) خائف ہیں ۔ کیا میں ان سے صلہ رحمی کروں؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" ہاں ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, عبداللہ بن ادریس نے ہشام بن عروہ سے ، انھوں نے اپنے والد سے ، اور انھوں نے حضرت اسماء رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ أَسْمَاءَ قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّ أُمِّي قَدِمَتْ عَلَيَّ وَهِيَ رَاغِبَةٌ أَوْ رَاهِبَةٌ أَفَأَصِلُهَا قَالَ نَعَمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "13",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 113,
                    "chapterNumber": "13",
                    "chapterEnglish": "The Book of Zakat",
                    "chapterUrdu": "زکوٰۃ کے احکام و مسائل",
                    "chapterArabic": "كتاب الزَّكَاةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 9576,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=383",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=381",
                "label": "381",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=382",
                "label": "382",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=383",
                "label": "383",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=384",
                "label": "384",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=385",
                "label": "385",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=386",
                "label": "386",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=387",
                "label": "387",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=385",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=385",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=383",
        "to": 9600,
        "total": 40465
    }
}