{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 470,
        "data": [
            {
                "id": 12014,
                "hadithNumber": "4450",
                "englishNarrator": "Abdul-Rahman reported:",
                "hadithEnglish": "'Ali, while delivering the address said: O people, impose the prescribed punishment upon your slaves, those who are married and those not married, for a slave-woman belonging to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had committed adultery, and he committed me to flog her. But she had recently given birth to a child and I was afraid that if I flogged her I might kill her. So I mentioned that to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and he said: You have done well.",
                "hadithUrdu": "حضرت علی کرم اللہ وجہہ نے خطبہ دیا اور کہا : اے لوگو! اپنے غلاموں پر حد نافذ کرو ، جو ان میں سے شادی شدہ ہوں اور جو شادی شدہ نہ ہوں ، رسول اللہ صلی اللہ علیہ وسلم ( کے خاندان ) کی ایک لونڈی نے زنا کیا تو آپ نے مجھے حکم دیا کہ اسے کوڑے لگاؤں ، تو اچانک پتہ چلا کہ اسے نفاس ( بچے کی ولادت سے خون آنے ) کی حالت میں تھوڑا ہی عرصہ گزرا تھا ۔ مجھے ڈر محسوس ہوا کہ اگر میں نے اسے کوڑے مارے تو میں اسے مار ڈالوں گا ، چنانچہ میں نے نبی صلی اللہ علیہ وسلم سے یہ بات عرض کی ، تو آپ نے فرمایا : \" تم نے اچھا کیا.",
                "urduNarrator": "ہم سے محمد بن ابی بکر المقدمی نے بیان کیا، کہا ہم سے سلیمان ابو داؤد نے بیان کیا, زائدہ نے سُدی سے ، انہوں نے سعد بن عبیدہ سے اور انہوں نے ابوعبدالرحمن سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، حَدَّثَنَا سُلَيْمَانُ أَبُو دَاوُدَ، حَدَّثَنَا زَائِدَةُ، عَنِ السُّدِّيِّ، عَنْ سَعْدِ بْنِ عُبَيْدَةَ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ، قَالَ: خَطَبَ عَلِيٌّ، فَقَالَ: يَا أَيُّهَا النَّاسُ، أَقِيمُوا عَلَى أَرِقَّائِكُمُ الْحَدَّ، مَنْ أَحْصَنَ مِنْهُمْ، وَمَنْ لَمْ يُحْصِنْ، فَإِنَّ أَمَةً لِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ زَنَتْ، فَأَمَرَنِي أَنْ أَجْلِدَهَا، فَإِذَا هِيَ حَدِيثُ عَهْدٍ بِنِفَاسٍ، فَخَشِيتُ إِنْ أَنَا جَلَدْتُهَا أَنْ أَقْتُلَهَا، فَذَكَرْتُ ذَلِكَ لِلنَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «أَحْسَنْتَ.",
                "headingArabic": "تَأْخِيرِ الْحَدِّ عَنِ النُّفَسَاءِ، ‏",
                "headingUrdu": "جن عورتوں نے ابھی بچے کو جنم دیا ہے ان کے معاملے میں حد کی سزا میں تاخیر کرنا",
                "headingEnglish": "Delaying the Hadd punishment in the case of women who have just given birth",
                "chapterId": "30",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 130,
                    "chapterNumber": "30",
                    "chapterEnglish": "The Book Of Legal Punishments",
                    "chapterUrdu": "حدود کا بیان",
                    "chapterArabic": "كتاب الْحُدُودِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12015,
                "hadithNumber": "4451",
                "englishNarrator": "This hadith has been narrated on the authority of as-Suddi with the same chain of transmitters, but he did not mention:",
                "hadithEnglish": "Those who are married and those who are not married. There is also an addition in it: I spare her until she is all right.",
                "hadithUrdu": "\" جو ان میں سے شادی شدہ ہوں اور جو شادی شدہ نہ ہوں ۔ \" اور انہوں نے حدیث میں یہ اضافہ کیا : \" اس ( کنیز ) کو چھوڑ دو یہاں تک کہ وہ صحت مند ہو جائے.",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے یحییٰ بن آدم نے بیان کیا, اسرائیل نے سُدی سے اسی سند کے ساتھ حدیث بیان کی اور انہوں نے یہ بیان کیا",
                "hadithArabic": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا إِسْرَائِيلُ، عَنِ السُّدِّيِّ، بِهَذَا الْإِسْنَادِ، وَلَمْ يَذْكُرْ مَنْ أَحْصَنَ مِنْهُمْ، وَمَنْ لَمْ يُحْصِنْ، وَزَادَ فِي الْحَدِيثِ اتْرُكْهَا حَتَّى تَمَاثَلَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "30",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 130,
                    "chapterNumber": "30",
                    "chapterEnglish": "The Book Of Legal Punishments",
                    "chapterUrdu": "حدود کا بیان",
                    "chapterArabic": "كتاب الْحُدُودِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12016,
                "hadithNumber": "4452",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "A person who had drink wine was brought to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). He gave him forty stripes with two lashes. Abu Bakr رضی اللہ عنہ also did that, but when Umar رضی اللہ عنہ (assumed the responsibilities) of the Caliphate, he consulted people and Abdul-Rahman رضی اللہ عنہ said: The mildest punishment (for drinking) is eighty (stripes) and 'Umar رضی اللہ عنہ their prescribed this punishment.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم کے پاس ایک آدمی کو لایا گیا جس نے شراب پی تھی ، تو آپ نے اسے کھجور کی دو ٹہنیوں سے تقریبا چالیس ضربیں لگائیں ۔ کہا : حضرت ابوبکر رضی اللہ عنہ نے بھی ایسا ہی کیا ، جب حضرت عمر رضی اللہ عنہ کا زمانہ آیا ، انہوں نے لوگوں سے مشورہ لیا تو حضرت عبدالرحمٰن رضی اللہ عنہ نے کہا : حدود میں سب سے ہلکی حد اسی کوڑے ہے ، چنانچہ حضرت عمر رضی اللہ عنہ نے اسی کا حکم صادر کر دیا.",
                "urduNarrator": "ہم سے محمد بن المثنیٰ اور محمد بن بشار نے بیان کیا، کہا: محمد بن جعفر نے ہمیں حدیث سنائی ، کہا : ہمیں شعبہ نے حدیث بیان کی ، انہوں نے کہا : میں نے قتادہ سے سنا ، وہ حضرت انس بن مالک رضی اللہ عنہ سے حدیث بیان کر رہے تھے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ: سَمِعْتُ قَتَادَةَ، يُحَدِّثُ عَنْ أَنَسِ بْنِ مَالِكٍ، «أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أُتِيَ بِرَجُلٍ قَدْ شَرِبَ الْخَمْرَ، فَجَلَدَهُ بِجَرِيدَتَيْنِ نَحْوَ أَرْبَعِينَ»، قَالَ: وَفَعَلَهُ أَبُو بَكْرٍ، فَلَمَّا كَانَ عُمَرُ اسْتَشَارَ النَّاسَ، فَقَالَ عَبْدُ الرَّحْمَنِ: أَخَفَّ الْحُدُودِ ثَمَانِينَ، «فَأَمَرَ بِهِ عُمَرُ.",
                "headingArabic": "حَدِّ الْخَمْرِ ‏‏",
                "headingUrdu": "شراب پینے کی سزا تھی۔",
                "headingEnglish": "Hadd punishment for drinking alcohol",
                "chapterId": "30",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 130,
                    "chapterNumber": "30",
                    "chapterEnglish": "The Book Of Legal Punishments",
                    "chapterUrdu": "حدود کا بیان",
                    "chapterArabic": "كتاب الْحُدُودِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12017,
                "hadithNumber": "4453",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Anas رضی اللہ عنہ through another chain of transmitters.",
                "hadithUrdu": "ہم سے یحییٰ بن حبیب الحارثی نے بیان کیا, خالد بن حارث نے کہا : ہمیں شعبہ نے حدیث بیان کی ، انہوں نے کہا : ہمیں قتادہ نے حدیث بیان کی ، انہوں نے کہا : میں نے حضرت انس رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے : رسول اللہ صلی اللہ علیہ وسلم کے پاس ایک آدمی لایا گیا ۔ ۔ ۔ پھر اسی طرح بیان کیا.",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا قَتَادَةُ، قَالَ: سَمِعْتُ أَنَسًا، يَقُولُ: أُتِيَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِرَجُلٍ، فَذَكَرَ نَحْوَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "30",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 130,
                    "chapterNumber": "30",
                    "chapterEnglish": "The Book Of Legal Punishments",
                    "chapterUrdu": "حدود کا بیان",
                    "chapterArabic": "كتاب الْحُدُودِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12018,
                "hadithNumber": "4454",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) gave a beating with palm branches and shoes, and that Abu Bakr رضی اللہ عنہ gave forty lashes. When Umar رضی اللہ عنہ (became the Commander of the Faithful) and the people went near to pastures and towns, he said (to the Companions of the Holy Prophet ﷺ). What is your opinion about lashing for drinking? Thereupon Abdul-Rahman bin Auf رضی اللہ عنہ said: My opinion is that you fix it as the mildest punishment. Then 'Umar رضی اللہ عنہ inflicted eighty stripes.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے شراب میں کھجور کی ٹہنی اور جوتوں سے مارا ۔ پھر حضرت ابوبکر رضی اللہ عنہ نے چالیس ( کوڑے ) مارے ، جب حضرت عمر رضی اللہ عنہ کا دور آیا اور لوگ سرسبز و شاداب مقامات اور بستیوں کے قریب جا بسے تو انہوں نے ( مشورہ کرتے ہوئے ) پوچھا : شراب کی سزا کے بارے میں تمہاری کیا رائے ہے؟ تو حضرت عبدالرحمن بن عوف رضی اللہ عنہ نے کہا : میری رائے ہے کہ آپ اسے سب سے ہلکی حد کے برابر مقرر کر دیں ۔ کہا : اس کے بعد حضرت عمر رضی اللہ عنہ نے اسی کوڑے مارے.",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا,معاذ بن ہشام نے کہا : مجھے میرے والد نے قتادہ سے حدیث بیان کی ، انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، «أَنَّ نَبِيَّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ جَلَدَ فِي الْخَمْرِ بِالْجَرِيدِ، وَالنِّعَالِ»، ثُمَّ جَلَدَ أَبُو بَكْرٍ أَرْبَعِينَ، فَلَمَّا كَانَ عُمَرُ، وَدَنَا النَّاسُ مِنَ الرِّيفِ وَالْقُرَى، قَالَ: «مَا تَرَوْنَ فِي جَلْدِ الْخَمْرِ؟» فَقَالَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ: أَرَى أَنْ تَجْعَلَهَا كَأَخَفِّ الْحُدُودِ، قَالَ: «فَجَلَدَ عُمَرُ ثَمَانِينَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "30",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 130,
                    "chapterNumber": "30",
                    "chapterEnglish": "The Book Of Legal Punishments",
                    "chapterUrdu": "حدود کا بیان",
                    "chapterArabic": "كتاب الْحُدُودِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12019,
                "hadithNumber": "4455",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Hisham with the same chain of transmitters.",
                "hadithUrdu": "ہم سے محمد بن المثنی نے بیان کیا, یحییٰ بن سعید نے ہشام سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی.",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا هِشَامٌ، بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "30",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 130,
                    "chapterNumber": "30",
                    "chapterEnglish": "The Book Of Legal Punishments",
                    "chapterUrdu": "حدود کا بیان",
                    "chapterArabic": "كتاب الْحُدُودِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12020,
                "hadithNumber": "4456",
                "englishNarrator": "Anas ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to strike forty times with shoes and palm branches (in case of drinking of) wine. The rest of the hadith is the same and there is no mention of pastures and towns.",
                "hadithUrdu": "جناب ‌رسول ‌اللہ ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌شراب ‌میں ‌چالیس ‌مار ‌مارتے ‌تھے ‌ٹہنیوں ‌سے ‌اور ‌جوتوں ‌سے ‌اخیر ‌تک.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے وکیع نے بیان کیا، انہوں نے ہشام سے اور قتادہ کی سند سے, انس ‌رضی ‌اللہ ‌عنہ ‌سے ‌روایت ‌ہے ‌",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ هِشَامٍ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ يَضْرِبُ فِي الْخَمْرِ بِالنِّعَالِ وَالْجَرِيدِ أَرْبَعِينَ، ثُمَّ ذَكَرَ نَحْوَ حَدِيثِهِمَا، وَلَمْ يَذْكُرِ الرِّيفَ وَالْقُرَى.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "30",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 130,
                    "chapterNumber": "30",
                    "chapterEnglish": "The Book Of Legal Punishments",
                    "chapterUrdu": "حدود کا بیان",
                    "chapterArabic": "كتاب الْحُدُودِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12021,
                "hadithNumber": "4457",
                "englishNarrator": "Hudain bin al-Mundhir Abu Sasan reported:",
                "hadithEnglish": "I saw that Walid was brought to Uthman bin 'Affan رضی اللہ عنہ as he had prayed two rak'ahs of the dawn prayer, and then he said: I make an increase for you. And two men bore witness against him. One of them was Humran who said that he had drunk wine. The second one gave witness that he had seen him vomiting. Uthman said: He would not have vomited (wine) unless he had drunk it. He said: 'Ali رضی اللہ عنہ , stand up and lash him. 'Ali رضی اللہ عنہ said: Hasan, stand up and lash him. Thereupon Hasan said: Let him suffer the heat (of Caliphate) who has enjoyed its coolness. ('Ali felt annoyed at this remark) and he said: 'Abdullah bin Ja'far, stand up and flog him, and he began to flog him and 'Ali رضی اللہ عنہ counted the stripes until these were forty. He (Hadrat 'Ali رضی اللہ عنہ) said: Stop now, and then said: Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) gave forty stripes, and Abu Bakr رضی اللہ عنہ also gave forty stripes, and Umar رضی اللہ عنہ gave eighty stripes, and all these fall under the category of the Sunnab, but this one (forty stripes) is dearer to me.",
                "hadithUrdu": "میں حضرت عثمان بن عفان رضی اللہ عنہ کے پاس حاضر ہوا ، ان کے پاس ولید ( بن عقبہ بن ابی معیط ) کو لایا گیا ، اس نے صبح کی دو رکعتیں پڑھائیں ، پھر کہا : کیا تمہیں اور ( نماز ) پڑھاؤں؟ تو دو آدمیوں نے اس کے خلاف گواہی دی ۔ ان میں سے ایک حمران تھا ( اس نے کہا ) کہ اس نے شراب پی ہے اور دوسرے نے گواہی دی کہ اس نے اسے ( شراب کی ) قے کرتے ہوئے دیکھا ہے ۔ اس پر حضرت عثمان رضی اللہ عنہ نے کہا : اس نے شراب پی ہے تو ( اس کی ) قے کی ہے ۔ اور کہا : علی! اٹھو اور اسے کوڑے مارو ۔ تو حضرت علی رضی اللہ عنہ نے کہا : حسن! اٹھیں اور اسے کوڑے ماریں ۔ حضرت حسن رضی اللہ عنہ نے کہا : اس ( خلافت ) کی ناگوار باتیں بھی انہی کے سپرد کیجیے جن کے سپرد اس کی خوش گوار ہیں ۔ تو ایسے لگا کہ انہیں ناگوار محسوس ہوا ہے ، تب انہوں نے کہا : عبداللہ بن جعفر! اٹھو اور اسے کوڑے مارو ۔ تو انہوں نے اسے کوڑے لگائے اور حضرت علی رضی اللہ عنہ شمار کرتے رہے حتی کہ وہ چالیس تک پہنچے تو کہا : رک جاؤ ۔ پھر کہا : نبی صلی اللہ علیہ وسلم نے چالیس کوڑے لگوائے ، ابوبکر رضی اللہ عنہ نے چالیس لگوائے اور عمر رضی اللہ عنہ نے اسی ( کوڑے ) لگوائے ، یہ سب سنت ہیں اور یہ ( چالیس کوڑے لگانا ) مجھے زیادہ پسند ہے ۔ علی بن حجر نے اپنی روایت میں اضافہ کیا : اسماعیل نے کہا : میں نے داناج کی حدیث ان سے سنی تھی لیکن اسے یاد نہ رکھ سکا.",
                "urduNarrator": "ابوبکر بن ابی شیبہ ، زہیر بن حرب اور علی بن حجر سب نے کہا : ہمیں اسماعیل بن علیہ نے ابن ابی عروبہ سے حدیث بیان کی ، انہوں نے عبداللہ داناج ( فارسی کے لفظ دانا کو عرب اسی طرح پڑھتے تھے ) سے روایت کی ، نیز اسحاق بن ابراہیم حنظلی نے ۔ ۔ الفاظ انہی کے ہیں ۔ ۔ کہا : ہمیں یحییٰ بن حماد نے خبر دی ، کہا : ہمیں عبدالعزیز بن مختار نے حدیث بیان کی ، کہا : ہمیں ان عامر داناج کے مولیٰ عبداللہ بن فیروز نے حدیث بیان کی : ہمیں ابو ساسان حُضین بن منذر نے حدیث بیان کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَعَلِيُّ بْنُ حُجْرٍ، قَالُوا: حَدَّثَنَا إِسْمَاعِيلُ وَهُوَ ابْنُ عُلَيَّةَ، عَنِ ابْنِ أَبِي عَرُوبَةَ، عَنْ عَبْدِ اللهِ الدَّانَاجِ، ح وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، وَاللَّفْظُ لَهُ، أَخْبَرَنَا يَحْيَى بْنُ حَمَّادٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْمُخْتَارِ، حَدَّثَنَا عَبْدُ اللهِ بْنُ فَيْرُوزَ، مَوْلَى ابْنِ عَامِرٍ الدَّانَاجِ، حَدَّثَنَا حُضَيْنُ بْنُ الْمُنْذِرِ أَبُو سَاسَانَ، قَالَ: شَهِدْتُ عُثْمَانَ بْنَ عَفَّانَ وَأُتِيَ بِالْوَلِيدِ قَدْ صَلَّى الصُّبْحَ رَكْعَتَيْنِ، ثُمَّ قَالَ: أَزِيدُكُمْ، فَشَهِدَ عَلَيْهِ رَجُلَانِ أَحَدُهُمَا حُمْرَانُ أَنَّهُ شَرِبَ الْخَمْرَ، وَشَهِدَ آخَرُ أَنَّهُ رَآهُ يَتَقَيَّأُ، فَقَالَ عُثْمَانُ: إِنَّهُ لَمْ يَتَقَيَّأْ حَتَّى شَرِبَهَا، فَقَالَ: يَا عَلِيُّ، قُمْ فَاجْلِدْهُ، فَقَالَ عَلِيٌّ: قُمْ يَا حَسَنُ فَاجْلِدْهُ، فَقَالَ الْحَسَنُ: وَلِّ حَارَّهَا مَنْ تَوَلَّى قَارَّهَا، فَكَأَنَّهُ وَجَدَ عَلَيْهِ، فَقَالَ: يَا عَبْدَ اللهِ بْنَ جَعْفَرٍ قُمْ فَاجْلِدْهُ، فَجَلَدَهُ وَعَلِيٌّ يَعُدُّ حَتَّى بَلَغَ أَرْبَعِينَ، فَقَالَ: أَمْسِكْ، ثُمَّ قَالَ: «جَلَدَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَرْبَعِينَ»، وَجَلَدَ أَبُو بَكْرٍ أَرْبَعِينَ، وَعُمَرُ ثَمَانِينَ، وَكُلٌّ سُنَّةٌ، وَهَذَا أَحَبُّ إِلَيَّ. زَادَ عَلِيُّ بْنُ حُجْرٍ فِي رِوَايَتِهِ، قَالَ إِسْمَاعِيلُ: وَقَدْ سَمِعْتُ حَدِيثَ الدَّانَاجِ مِنْهُ فَلَمْ أَحْفَظْهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "30",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 130,
                    "chapterNumber": "30",
                    "chapterEnglish": "The Book Of Legal Punishments",
                    "chapterUrdu": "حدود کا بیان",
                    "chapterArabic": "كتاب الْحُدُودِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12022,
                "hadithNumber": "4458",
                "englishNarrator": "Ali رضی اللہ عنہ reported:",
                "hadithEnglish": "If I impose Hadd on anyone, and he (in course of punish ment) dies, I would not mind except in case of a drunkard. If he dies. I would pay indemnity for him because the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) has laid down no rule for it.",
                "hadithUrdu": "میں کسی شخص پر حد نہیں لگاتا کہ وہ اس میں مر جائے تو میں اس سے اپنے دل میں کوئی ملال محسوس کروں ، سوائے شراب پینے والے کے ، وہ اگر مر جائے تو میں اس کی دیت ادا کروں گا کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے اس طریقے ( اسی کوڑوں کی سزا ) کو جاری نہیں کیا.",
                "urduNarrator": "محمد بن منہال الدیر نے مجھ سے کہا, یزید بن زریع نے کہا : ہمیں سفیان ثوری نے ابوحصین سے حدیث بیان کی ، انہوں نے عمیر بن سعد سے اور انہوں نے حضرت علی رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ مِنْهَالٍ الضَّرِيرُ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سُفْيَانُ الثَّوْرِيُّ، عَنْ أَبِي حَصِينٍ، عَنْ عُمَيْرِ بْنِ سَعِيدٍ، عَنْ عَلِيٍّ، قَالَ: «مَا كُنْتُ أُقِيمُ عَلَى أَحَدٍ حَدًّا، فَيَمُوتَ فِيهِ، فَأَجِدَ مِنْهُ فِي نَفْسِي، إِلَّا صَاحِبَ الْخَمْرِ، لِأَنَّهُ إِنْ مَاتَ وَدَيْتُهُ، لِأَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لَمْ يَسُنَّهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "30",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 130,
                    "chapterNumber": "30",
                    "chapterEnglish": "The Book Of Legal Punishments",
                    "chapterUrdu": "حدود کا بیان",
                    "chapterArabic": "كتاب الْحُدُودِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12023,
                "hadithNumber": "4459",
                "englishNarrator": null,
                "hadithEnglish": "This hadith is narrated on the authority of Sufyan.",
                "hadithUrdu": "ہم سے محمد بن المثنی نے بیان کیا، انہوں نے کہا عبدالرحمن نے سفیان سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی.",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "30",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 130,
                    "chapterNumber": "30",
                    "chapterEnglish": "The Book Of Legal Punishments",
                    "chapterUrdu": "حدود کا بیان",
                    "chapterArabic": "كتاب الْحُدُودِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12024,
                "hadithNumber": "4460",
                "englishNarrator": "Abu Barda Ansari رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: None should be given more than ten lashes, but in case of any Hadd out of the Huded of Allah.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \" حدوداللہ میں سے کسی حد کے علاوہ کسی کو دس سے زیادہ کوڑے نہ مارے جائیں.\"",
                "urduNarrator": "ہم سے احمد بن عیسیٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، کہا کہ مجھ سے عمرو نے بیان کیا، ان سے بکیر بن اشجع نے بیان کیا، انہوں نے کہا کہ ہم سلیمان بن یسار کے پاس تھے۔ جب عبدالرحمٰن بن جبیر ان کے پاس آئے اور ان سے بات کی تو سلیمان ہمارے پاس آئے اور کہا: مجھ سے عبدالرحمٰن بن جبیر نے بات کی, حضرت ابوبردہ انصاری رضی اللہ عنہ سے روایت ہے کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ عِيسَى، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو، عَنْ بُكَيْرِ بْنِ الْأَشَجِّ، قَالَ: بَيْنَا نَحْنُ عِنْدَ سُلَيْمَانَ بْنِ يَسَارٍ إِذْ جَاءَهُ عَبْدُ الرَّحْمَنِ بْنُ جَابِرٍ، فَحَدَّثَهُ، فَأَقْبَلَ عَلَيْنَا سُلَيْمَانُ، فَقَالَ: حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ جَابِرٍ، عَنْ أَبِيهِ، عَنْ أَبِي بُرْدَةَ الْأَنْصَارِيِّ، أَنَّهُ سَمِعَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا يُجْلَدُ أَحَدٌ فَوْقَ عَشَرَةِ أَسْوَاطٍ، إِلَّا فِي حَدٍّ مِنْ حُدُودِ اللهِ.",
                "headingArabic": "قَدْرِ أَسْوَاطِ التَّعْزِيرِ",
                "headingUrdu": "تعزیر کی صورت میں کوڑوں کی تعداد",
                "headingEnglish": "Number of lashes in the case of ta'zeer",
                "chapterId": "30",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 130,
                    "chapterNumber": "30",
                    "chapterEnglish": "The Book Of Legal Punishments",
                    "chapterUrdu": "حدود کا بیان",
                    "chapterArabic": "كتاب الْحُدُودِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12025,
                "hadithNumber": "4461",
                "englishNarrator": "Ubida bin as-Samit reported:",
                "hadithEnglish": "While we were in the company of Allah's Messenger (may peace be upoi him) he said: Swear allegiance to me that you will not associate anything with Allah, that you will not commit adultery, that you will not steal, that you will not take any life which it is forbidden by Allah to take but with (legal) justification; and whoever among you fulfils it, his reward is with Allah and he who commits any such thing and is punished for it, that will be all atonement for it And if anyone commits anything and Allah conceals (his faultfls), his matter rests with Allah. He may forgive if He likes, and He may punish him if He likes.",
                "hadithUrdu": "رسول اﷲ ﷺ کے ساتھ بیٹھے تھے آپ نے فرمایا بیعت کرو مجھ سے اس اقرار پر کہ اﷲ تعالیٰ کا شریک کسی کو نہیں کرنے کے اور زنا اور چوری اور ناحق خون جس کو اﷲ تعالیٰ نے حرام کیا نہیں کریں گے ۔ پھر جو کوئی اپنے اقرار کو پورا کرے گااس کا ثواب اﷲ تعالیٰ پر ہوگااور جو کوئی کام ان میں سے کر بیٹھے گا پھر اس کو دنیا میں اس کی سزا ملے گی ( یعنی حد لگے گی ) تو وہی اس کیگ ناہ کا کفارہ ہے اور جو دنیا میں اﷲ تعالیٰ اس کے کام کو چھپالے تو ( عاقبت میں ) اﷲ تعالیٰ کو اختیار ہے چاہے اس کو معاف کردے چاہے عذاب کرلے ۔",
                "urduNarrator": "یحییٰ بن یحییٰ التمیمی، ابوبکر بن ابی شیبہ، عمرو ناقد، اسحاق بن ابراہیم اور ابن نمیر نے ہم سے روایت کی ہے, ابن عیینہ اور یہ لفظ عمرو کے لیے ہے، سفیان بن عیینہ نے الزہری کی سند سے، ابو ادریس کی سند سے, عبادہ بن صامتؓ سے روایت ہے",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ وَابْنُ نُمَيْرٍ كُلُّهُمْ عَنِ ابْنِ عُيَيْنَةَ، - وَاللَّفْظُ لِعَمْرٍو قَالَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي إِدْرِيسَ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي مَجْلِسٍ فَقَالَ ‏ ‏ تُبَايِعُونِي عَلَى أَنْ لاَ تُشْرِكُوا بِاللَّهِ شَيْئًا وَلاَ تَزْنُوا وَلاَ تَسْرِقُوا وَلاَ تَقْتُلُوا النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلاَّ بِالْحَقِّ فَمَنْ وَفَى مِنْكُمْ فَأَجْرُهُ عَلَى اللَّهِ وَمَنْ أَصَابَ شَيْئًا مِنْ ذَلِكَ فَعُوقِبَ بِهِ فَهُوَ كَفَّارَةٌ لَهُ وَمَنْ أَصَابَ شَيْئًا مِنْ ذَلِكَ فَسَتَرَهُ اللَّهُ عَلَيْهِ فَأَمْرُهُ إِلَى اللَّهِ إِنْ شَاءَ عَفَا عَنْهُ وَإِنْ شَاءَ عَذَّبَهُ .‏",
                "headingArabic": "الْحُدُودُ كَفَّارَاتٌ لأَهْلِهَا ‏‏",
                "headingUrdu": "حد کی سزائیں ان لوگوں کے لیے کفارہ ہیں جن پر یہ عمل کیا جاتا ہے۔",
                "headingEnglish": "The Hadd punishments are an expiation for those on whom they are carried out",
                "chapterId": "30",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 130,
                    "chapterNumber": "30",
                    "chapterEnglish": "The Book Of Legal Punishments",
                    "chapterUrdu": "حدود کا بیان",
                    "chapterArabic": "كتاب الْحُدُودِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12026,
                "hadithNumber": "4462",
                "englishNarrator": "This hadith has been narrated on the authority of Zuhri with the same chain of transmitters with this addition:",
                "hadithEnglish": "He recited to us the verse pertaining to women, viz, that they will not associate anything with Allah.",
                "hadithUrdu": "اس کے بعد آپ نے ہمارے سامنے عورتوں ( کے احکام ) والی ( سورۃ الممتحنہ کی ) یہ آیت تلاوت کی : \" کہ وہ اللہ کے ساتھ کسی چیز کو شریک نہ کریں.",
                "urduNarrator": "ہم سے عبد بن حمید نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا, معمر نے زہری سے اسی سند کے ساتھ حدیث بیان کی اور حدیث میں یہ اضافہ کیا",
                "hadithArabic": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، بِهَذَا الْإِسْنَادِ، وَزَادَ فِي الْحَدِيثِ، فَتَلَا عَلَيْنَا آيَةَ النِّسَاءِ: {أَنْ لَا يُشْرِكْنَ بِاللهِ شَيْئًا} [الممتحنة: 12] الْآيَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "30",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 130,
                    "chapterNumber": "30",
                    "chapterEnglish": "The Book Of Legal Punishments",
                    "chapterUrdu": "حدود کا بیان",
                    "chapterArabic": "كتاب الْحُدُودِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12027,
                "hadithNumber": "4463",
                "englishNarrator": "Ubida bin as-Samit رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) took (a pledge) from us as he took from the women that we will not associate anything with Allah and we will not steal, and we will not commit adultery, and we will not kill our children, and we will not bring calumny upon one another. And he who amongst you fulfils (this pledge), his reward rests with Allah, and he upon whom amongst you is imposed the prescribed punishment and that is carried out, that is his expiation (for that sin), and he whose (sins) were covered by Allah, his matter rests with Allah. He may punish him if He likes or may forgive him if He so likes.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ہم سے ( اسی طرح ) عہد لیا جس طرح آپ نے عورتوں سے عہد لیا تھا : ہم اللہ کے ساتھ کسی کو شریک نہ کریں گے ، چوری نہ کریں گے ، زنا نہ کریں گے ، اپنی اولاد کو قتل نہ کریں گے اور ایک دوسرے پر تہمت نہ لگائیں گے : \" تم میں سے جس نے ایفا کیا اس کا اجر اللہ پر ہے اور جس نے ایسا کام کیا جس پر حد ہے اور اس کو حد لگا دی گئی تو وہ اس کا کفارہ ہو گی ، اور جس کا اللہ نے پردہ رکھا اس کا معاملہ اللہ کے سپرد ہے ، اگر چاہے تو اسے عذاب دے اور چاہے تو معاف کر دے.",
                "urduNarrator": "مجھ سے اسماعیل بن سالم نے بیان کیا، کہا ہم سے ہشیم نے بیان کیا، کہا ہم سے خالد نے بیان کیا، ابو قلابہ سے,ابو اشعث صنعانی نے حضرت عبادہ بن صامت رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي إِسْمَاعِيلُ بْنُ سَالِمٍ، أَخْبَرَنَا هُشَيْمٌ، أَخْبَرَنَا خَالِدٌ، عَنْ أَبِي قِلَابَةَ، عَنْ أَبِي الْأَشْعَثِ الصَّنْعَانِيِّ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، قَالَ: أَخَذَ عَلَيْنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَمَا أَخَذَ عَلَى النِّسَاءِ: أَنْ لَا نُشْرِكَ بِاللهِ شَيْئًا، وَلَا نَسْرِقَ، وَلَا نَزْنِيَ، وَلَا نَقْتُلَ أَوْلَادَنَا، وَلَا يَعْضَهَ بَعْضُنَا بَعْضًا، فَمَنْ وَفَى مِنْكُمْ فَأَجْرُهُ عَلَى اللهِ، وَمَنْ أَتَى مِنْكُمْ حَدًّا، فَأُقِيمَ عَلَيْهِ، فَهُوَ كَفَّارَتُهُ، وَمَنْ سَتَرَهُ اللهُ عَلَيْهِ، فَأَمْرُهُ إِلَى اللهِ، إِنْ شَاءَ عَذَّبَهُ، وَإِنْ شَاءَ غَفَرَ لَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "30",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 130,
                    "chapterNumber": "30",
                    "chapterEnglish": "The Book Of Legal Punishments",
                    "chapterUrdu": "حدود کا بیان",
                    "chapterArabic": "كتاب الْحُدُودِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12028,
                "hadithNumber": "4464",
                "englishNarrator": "Ubida bin as-Samit رضی اللہ عنہ reported:",
                "hadithEnglish": "I was one of those headmen who swore allegiance to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) that we will not associate anything with Allah, and will not commit adultery, and will not steal, and will not kill any soul which Allah has forbidden, but with justice nor plunder, nor disobey (Allah and His Apostle), then Paradise (will be the reward) in case we do these (acts) ; and if we commit any outrage (and that goes unpunished in the world), it is Allah Who would decide about it. Ibn Rumh said: Its judgment lies with Allah.",
                "hadithUrdu": "میں ان نقیبوں میں سے ہوں جنہوں نے رسول اللہ صلی اللہ علیہ وسلم کی بیعت کی تھی ۔ اور کہا : ہم نے اس بات پر آپ کے ساتھ بیعت کی کہ اللہ کے ساتھ کسی کو شریک نہ کریں گے ، زنا نہ کریں گے ، چوری نہ کریں گے ، کسی زندہ ( انسان ) کو ناحق قتل نہ کریں گے جسے اللہ نے حرمت عطا کی ہے ، ڈاکے نہ ڈالیں گے اور نافرمانی نہ کریں گے ۔ اگر ہم نے اس پر عمل کیا تو جنت ہے اور اگر ہم نے ان میں سے کسی چیز کا ارتکاب کیا تو اس کا فیصلہ اللہ کے سپرد ہو گا ۔ ابن رمح نے اس کا فیصلہ کے بجائے \" اس شخص کا فیصلہ اللہ عزوجل کے سپرد ہو گا \" کہا.",
                "urduNarrator": "قتیبہ بن سعید اور محمد بن رمح نے لیث سے ، انہوں نے یزید بن ابی حبیب سے ، انہوں نے ابوالخیر سے ، انہوں نے ( عبدالرحمان ) صنابحی سے اور انہوں نے حضرت عبادہ بن صامت رضی اللہ عنہ سے روایت کی کہ انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ الصُّنَابِحِيِّ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، أَنَّهُ قَالَ: إِنِّي لَمِنَ النُّقَبَاءِ الَّذِينَ بَايَعُوا رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَقَالَ: «بَايَعْنَاهُ عَلَى أَنْ لَا نُشْرِكَ بِاللهِ شَيْئًا، وَلَا نَزْنِيَ، وَلَا نَسْرِقَ، وَلَا نَقْتُلَ النَّفْسَ الَّتِي حَرَّمَ اللهُ إِلَّا بِالْحَقِّ، وَلَا نَنْتَهِبَ، وَلَا نَعْصِيَ، فَالْجَنَّةُ إِنْ فَعَلْنَا ذَلِكَ، فَإِنْ غَشِينَا مِنْ ذَلِكَ شَيْئًا كَانَ قَضَاءُ ذَلِكَ إِلَى اللهِ»، وَقَالَ ابْنُ رُمْحٍ: كَانَ قَضَاؤُهُ إِلَى اللهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "30",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 130,
                    "chapterNumber": "30",
                    "chapterEnglish": "The Book Of Legal Punishments",
                    "chapterUrdu": "حدود کا بیان",
                    "chapterArabic": "كتاب الْحُدُودِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12029,
                "hadithNumber": "4465",
                "englishNarrator": "Abu Huraira ‌رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: No requital is payable for a wound caused by an animal, for (falling into) a well and a mine, and one-fifth (is the share of the government) in the buried treasure (treasure-trove).",
                "hadithUrdu": "‌جناب ‌رسول ‌اللہ ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌نے ‌فرمایا ‌جانور ‌ کا ‌زخمی ‌ کرنا ‌لغو ‌ہے ( ‌یعنی ‌اس ‌ کا ‌تاوان ‌ کسی ‌پر ‌نہ ‌ہوگا ) ‌ ‌اور ‌ کنواں ‌لغو ‌ہے ‌. ‌اور ‌ر کاز ‌میں ‌پانچواں ‌حصہ ‌ہے ‌. ‌",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ اور محمد بن رومہ نے بیان کیا، کہا: ہم سے لیث نے بیان کیا، ہم سے قتیبہ بن نے بیان کیا، ہم سے سعید نے لیث نے بیان کیا، انہوں نے ابن عبداللہ کی سند سے۔ شہاب، سعید بن المسیب کی سند سے، اور ابی، سلمہ، کی سند سےابو ‌ہریرہ ‌رضی ‌اللہ ‌عنہ ‌سے ‌روایت ‌ہے",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَمُحَمَّدُ بْنُ رُمْحٍ، قَالاَ أَخْبَرَنَا اللَّيْثُ، ح وَحَدَّثَنَا قُتَيْبَةُ بْنُ، سَعِيدٍ حَدَّثَنَا لَيْثٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، وَأَبِي، سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ ‏ ‏ الْعَجْمَاءُ جَرْحُهَا جُبَارٌ وَالْبِئْرُ جُبَارٌ وَالْمَعْدِنُ جُبَارٌ وَفِي الرِّكَازِ الْخُمْسُ.‏",
                "headingArabic": "جَرْحُ الْعَجْمَاءِ وَالْمَعْدِنِ وَالْبِئْرِ جُبَارٌ",
                "headingUrdu": "جانوروں کی وجہ سے یا کان یا کنویں میں گرنے سے ہونے والے زخموں کی کوئی دیت نہیں ہے۔",
                "headingEnglish": "There is no Diyah for injuries caused by animals or by falling into a mine or well",
                "chapterId": "30",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 130,
                    "chapterNumber": "30",
                    "chapterEnglish": "The Book Of Legal Punishments",
                    "chapterUrdu": "حدود کا بیان",
                    "chapterArabic": "كتاب الْحُدُودِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12030,
                "hadithNumber": "4466",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been transmitted on the authority of Zuhri.",
                "hadithUrdu": "ہم سے یحییٰ بن یحییٰ، ابوبکر بن ابی شیبہ، زہیر بن حرب اور عبد العلا بن حماد نے بیان کیا, ابن عیینہ اور امام مالک دونوں نے زہری سے لیث کی سند کے ساتھ اسی کے مانند حدیث بیان کی.",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَعَبْدُ الْأَعْلَى بْنُ حَمَّادٍ، كُلُّهُمْ عَنِ ابْنِ عُيَيْنَةَ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا إِسْحَاقُ يَعْنِي ابْنَ عِيسَى، حَدَّثَنَا مَالِكٌ، كِلَاهُمَا عَنِ الزُّهْرِيِّ، بِإِسْنَادِ اللَّيْثِ مِثْلَ حَدِيثِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "30",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 130,
                    "chapterNumber": "30",
                    "chapterEnglish": "The Book Of Legal Punishments",
                    "chapterUrdu": "حدود کا بیان",
                    "chapterArabic": "كتاب الْحُدُودِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12031,
                "hadithNumber": "4467",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been transmitted on the authority of Abu Huraira رضی اللہ عنہ .",
                "hadithUrdu": "مجھ سے ابو الطاہر اور حرملہ نے بیان کیا، کہا کہ ہم سے ابن وہب نے بیان کیا, یونس نے ابن شہاب سے ، انہوں نے ابن مسیب اور عبیداللہ بن عبداللہ سے ، انہوں نے ابوہریرہ رضی اللہ عنہ سے اور انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی.",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، قَالَا: أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنِ ابْنِ الْمُسَيِّبِ، وَعُبَيْدِ اللهِ بْنِ عَبْدِ اللهِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "30",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 130,
                    "chapterNumber": "30",
                    "chapterEnglish": "The Book Of Legal Punishments",
                    "chapterUrdu": "حدود کا بیان",
                    "chapterArabic": "كتاب الْحُدُودِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12032,
                "hadithNumber": "4468",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: The wound caused (by falling) in the well, in the mine, and caused bv the animal has no requital for it; and there is one-fifth (for the government) in the buried treasure.",
                "hadithUrdu": "آپ نے فرمایا : \" کنویں کے زخم پر تاوان نہیں ، ( دھات وغیرہ کی ) کان کے زخم پر تاوان نہیں ، چوپائے کے زخم ( یا نقصان ) پا تاوان نہیں اور دفینے میں پانچواں حصہ ہے.",
                "urduNarrator": "ہم سے محمد بن روم بن المہاجر نے بیان کیا، کہا ہم سے لیث نے بیان کیا، ایوب بن موسیٰ سے, اسود بن علاء نے ابوسلمہ بن عبدالرحمان سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے اور انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ، أَخْبَرَنَا اللَّيْثُ، عَنْ أَيُّوبَ بْنِ مُوسَى، عَنِ الْأَسْوَدِ بْنِ الْعَلَاءِ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: «الْبِئْرُ جَرْحُهَا جُبَارٌ، وَالْمَعْدِنُ جَرْحُهُ جُبَارٌ، وَالْعَجْمَاءُ جَرْحُهَا جُبَارٌ، وَفِي الرِّكَازِ الْخُمْسُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "30",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 130,
                    "chapterNumber": "30",
                    "chapterEnglish": "The Book Of Legal Punishments",
                    "chapterUrdu": "حدود کا بیان",
                    "chapterArabic": "كتاب الْحُدُودِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12033,
                "hadithNumber": "4469",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been transmitted on the authority of Abu Huraira رضی اللہ عنہ .",
                "hadithUrdu": "ہم سے عبدالرحمٰن بن سلام الجمعی نے بیان کیا، ہم سے الربیع نے بیان کیا، ہم سے ابن مسلم نے بیان کیا، اور ہم سے عبید اللہ بن معاذ نے بیان کیا، ہم سے ابی نے بیان کیا، ان سے ح، اور ابن عباس نے بیان کیا۔ ہم سے بشر، محمد بن جعفر نے بیان کیا، انہوں نے کہا: ہم سے شعبہ نے بیان کیا،محمد بن زیاد نے حضرت ابوہریرہ رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی.",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَلَّامٍ الْجُمَحِيُّ، حَدَّثَنَا الرَّبِيعُ يَعْنِي ابْنَ مُسْلِمٍ، ح وحَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، ح وحَدَّثَنَا ابْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَا: حَدَّثَنَا شُعْبَةُ، كِلَاهُمَا عَنْ مُحَمَّدِ بْنِ زِيَادٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "30",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 130,
                    "chapterNumber": "30",
                    "chapterEnglish": "The Book Of Legal Punishments",
                    "chapterUrdu": "حدود کا بیان",
                    "chapterArabic": "كتاب الْحُدُودِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12034,
                "hadithNumber": "4470",
                "englishNarrator": "Ibn Abbas رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: If the people were given according to their claims, they would claim the lives of persons and their properties, but the oath must be taken by the defendant.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے فرمایا : \" اگر لوگوں کو ان کے دعووں کے مطابق دے دیا جائے تو بہت سے لوگ دوسروں کے خون اور ان کے اموال پر دعویٰ کرنے لگیں گے لیکن قسم مدعا علیہ پر ہے.",
                "urduNarrator": "مجھ سے ابو الطاہر احمد بن عمرو بن سرح نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا, ابن جریج نے ابن ابی ملیکہ سے اور انہوں نے حضرت ابن عباس رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ، أَخْبَرَنَا ابْنُ وَهْبٍ، عَنِ ابْنِ جُرَيْجٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَوْ يُعْطَى النَّاسُ بِدَعْوَاهُمْ، لَادَّعَى نَاسٌ دِمَاءَ رِجَالٍ وَأَمْوَالَهُمْ، وَلَكِنَّ الْيَمِينَ عَلَى الْمُدَّعَى عَلَيْهِ.",
                "headingArabic": "الْيَمِينُ عَلَى الْمُدَّعَى عَلَيْهِ ‏‏",
                "headingUrdu": "مدعا علیہ سے حلف لیا جائے۔",
                "headingEnglish": "Oath should be sworn by the defendant",
                "chapterId": "31",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 131,
                    "chapterNumber": "31",
                    "chapterEnglish": "The Book Of Judicial Decisions",
                    "chapterUrdu": "جھگڑوں میں فیصلے کرنے کے طریقے اور آداب",
                    "chapterArabic": "كتاب الْأَقْضِيَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12035,
                "hadithNumber": "4471",
                "englishNarrator": "Ibn 'Abbas رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) pronounced judgment on the basis of oath by the defendant.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے قسم مدعا علیہ پر ہونے کا فیصلہ کیا.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے محمد بن بشر نے نافع  بن عمر نے ابن ابی ملیکہ سے اور انہوں نے حضرت ابن عباس رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، عَنْ نَافِعِ بْنِ عُمَرَ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنِ ابْنِ عَبَّاسٍ، «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَضَى بِالْيَمِينِ عَلَى الْمُدَّعَى عَلَيْهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "31",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 131,
                    "chapterNumber": "31",
                    "chapterEnglish": "The Book Of Judicial Decisions",
                    "chapterUrdu": "جھگڑوں میں فیصلے کرنے کے طریقے اور آداب",
                    "chapterArabic": "كتاب الْأَقْضِيَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12036,
                "hadithNumber": "4472",
                "englishNarrator": "Ibn 'Abbas رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) pronounced judgment on the basis of an oath and a witness (by the plaintiff).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ایک قسم اور ایک گواہ سے فیصلہ فرمایا ۔ ( یعنی ایک گواہ کی موجودگی میں مدعی کی قسم کو دوسرے گواہ کا قائم مقام بنایا.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور محمد بن عبداللہ بن نمیر نے بیان کیا، کہا: مجھ سے زید نے جو ابن حباب ہیں، بیان کیا۔ مجھے سلیمان، قیس بن سعد نے عمرو بن دینار کی سند سے خبر دی, حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، قَالَا: حَدَّثَنَا زَيْدٌ وَهُوَ ابْنُ حُبَابٍ، حَدَّثَنِي سَيْفُ بْنُ سُلَيْمَانَ، أَخْبَرَنِي قَيْسُ بْنُ سَعْدٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنِ ابْنِ عَبَّاسٍ، «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَضَى بِيَمِينٍ وَشَاهِدٍ.",
                "headingArabic": "الْقَضَاءِ بِالْيَمِينِ وَالشَّاهِدِ ‏‏",
                "headingUrdu": "گواہ اور حلف کی بنیاد پر فیصلہ کرنے کی ذمہ داری",
                "headingEnglish": "The obligation of judging on the basis of a witness and an oath",
                "chapterId": "31",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 131,
                    "chapterNumber": "31",
                    "chapterEnglish": "The Book Of Judicial Decisions",
                    "chapterUrdu": "جھگڑوں میں فیصلے کرنے کے طریقے اور آداب",
                    "chapterArabic": "كتاب الْأَقْضِيَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12037,
                "hadithNumber": "4473",
                "englishNarrator": "Umm Salama رضی اللہ عنہا reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: You bring to me, for (judgment) your disputes, some of you perhaps being more eloquent in their plea than others, so I give judgment on their behalf according to what I hear from them. (Bear in mind, in my judgment) if I slice off anything for him from the right of his brother, he should not accept that, for I sliced off for him a portion from the Hell.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم میرے پاس جھگڑے لے کر آتے ہو، ہو سکتا ہے تم میں سے کوئی اپنی دلیل کے ہر پہلو کو بیان کرنے کے لحاظ سے دوسرے کی نسبت زیادہ ذہین و فطین ( ثابت ) ہو اور میں جس طرح اس سے سنوں اسی طرح اس کے حق میں فیصلہ کر دوں، تو جس کو میں اس کے بھائی کے حق میں سے کچھ دوں وہ اسے نہ لے، میں اس صورت میں اس کے لیے آگ کا ٹکرا کاٹ کر دے رہا ہوں گا.",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ التمیمی نے بیان کیا، ابومعاویہ نے ہمیں ہشام بن عروہ سے خبر دی، انہوں نے اپنے والد سے، انہوں نے زینب بنت ابی سلمہ رضی اللہ عنہا سے اور انہوں نے حضرت ام سلمہ رضی اللہ عنہا سے روایت کی، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّكُمْ تَخْتَصِمُونَ إِلَيَّ، وَلَعَلَّ بَعْضَكُمْ أَنْ يَكُونَ أَلْحَنَ بِحُجَّتِهِ مِنْ بَعْضٍ، فَأَقْضِيَ لَهُ عَلَى نَحْوٍ مِمَّا أَسْمَعُ مِنْهُ، فَمَنْ قَطَعْتُ لَهُ مِنْ حَقِّ أَخِيهِ شَيْئًا، فَلَا يَأْخُذْهُ، فَإِنَّمَا أَقْطَعُ لَهُ بِهِ قِطْعَةً مِنَ النَّارِ.",
                "headingArabic": "الْحُكْمِ بِالظَّاهِرِ وَاللَّحْنِ بِالْحُجَّةِ ‏‏",
                "headingUrdu": "تو جج کے فیصلے سے جو ہوا وہ نہیں بدلتا",
                "headingEnglish": "So the judgement of the judge does not change what happened",
                "chapterId": "31",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 131,
                    "chapterNumber": "31",
                    "chapterEnglish": "The Book Of Judicial Decisions",
                    "chapterUrdu": "جھگڑوں میں فیصلے کرنے کے طریقے اور آداب",
                    "chapterArabic": "كتاب الْأَقْضِيَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12038,
                "hadithNumber": "4474",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Hisham with the same chain of transmitters.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے وکیع نے بیان کیا، ہم سے ابو کریب نے بیان کیا، ان سے ابن نمیر نے بیان کیا، ان دونوں نے ہشام کی سند سے اس کے ساتھ ترسیل کا سلسلہ اسی طرح کا ہے۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا ابْنُ، نُمَيْرٍ كِلاَهُمَا عَنْ هِشَامٍ، بِهَذَا الإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "31",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 131,
                    "chapterNumber": "31",
                    "chapterEnglish": "The Book Of Judicial Decisions",
                    "chapterUrdu": "جھگڑوں میں فیصلے کرنے کے طریقے اور آداب",
                    "chapterArabic": "كتاب الْأَقْضِيَةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 11726,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=469",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=467",
                "label": "467",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=468",
                "label": "468",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=469",
                "label": "469",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=470",
                "label": "470",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=471",
                "label": "471",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=472",
                "label": "472",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=473",
                "label": "473",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=471",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=471",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=469",
        "to": 11750,
        "total": 40465
    }
}