{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 364,
        "data": [
            {
                "id": 9364,
                "hadithNumber": "1800",
                "englishNarrator": "Ibn `Abbas رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "I spent a night in the house of my mother's sister Maimuna رضی اللہ تعالیٰ عنہا . The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) got up for observing voluntary prayer (Tahajjud) at night. The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) stood by the water-skin and performed ablution and then stood up and prayed. I also got up when I saw him doing that. I also performed ablution from the water-skin and then stood at his left side. He took hold of my hand from behind his back and then turned me from his back to his right side. I (`Ata', one of the narrators) said: Did it concern the voluntary prayer (at night)? He (Ibn `Abbas رضی اللہ تعالیٰ عنہا ) said: Yes.",
                "hadithUrdu": "میں نے ایک رات اپنی خالہ میمونہ رضی اللہ تعالیٰ عنہا کے پاس بسر کی تو رسول اللہ صلی اللہ علیہ وسلم رات کی نفل نماز پڑھنے کے لئے جاگے ۔ نبی کریم صلی اللہ علیہ وسلم اٹھ کرمشک کی طرف گئے اور وضو فرمایا ، پھر کھڑے ہوکر نماز پڑھی ، جب میں یہ آپ کو یہ کرتے دیکھا تو میں بھی اٹھا اور میں نے بھی مشک سے وضوکیا ، ( جب رسول اللہ صلی اللہ علیہ وسلم وضو کرتے رہے ، ابن عباس رضی اللہ تعالیٰ عنہ جاگنے کے بعد غور سے انھیں دیکھتے رہے تاکہ آپ کی اتباع کرسکیں ) پھر میں آپ کے بائیں پہلو میں کھڑا ہوگیا تو آپ نے اپنی پشت کے پیچھے سے میراہاتھ پکڑا ، ااسی طرح پیچھے سے مجھے دائیں جانب ٹھیک کرکے کھڑا کیا ۔ ( عطا ء نے کہا : ) میں نے پوچھا : کیا یہ نفل نماز میں ہوا تھا؟انھوں نے کہا : ہاں ۔",
                "urduNarrator": "مجھ سے محمد بن حاتم نے بیان کیا، کہا ہم سے محمد بن بکر نے بیان کیا، انہوں نے کہا ابن جریج نے کہا ، مجھے عطاء نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے خبر دی ، انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عَطَاءٌ، عَنِ ابْنِ عَبَّاسٍ، قَالَ: بِتُّ ذَاتَ لَيْلَةٍ عِنْدَ خَالَتِي مَيْمُونَةَ، «فَقَامَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي مُتَطَوِّعًا مِنَ اللَّيْلِ، فَقَامَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِلَى الْقِرْبَةِ، فَتَوَضَّأَ، فَقَامَ فَصَلَّى، فَقُمْتُ لَمَّا رَأَيْتُهُ صَنَعَ ذَلِكَ فَتَوَضَّأْتُ مِنَ الْقِرْبَةِ، ثُمَّ قُمْتُ إِلَى شِقِّهِ الْأَيْسَرِ، فَأَخَذَ بِيَدِي مِنْ وَرَاءِ ظَهْرِهِ يَعْدِلُنِي كَذَلِكَ مِنْ وَرَاءِ ظَهْرِهِ إِلَى الشِّقِّ الْأَيْمَنِ». قُلْتُ: أَفِي التَّطَوُّعِ كَانَ ذَلِكَ؟ قَالَ: نَعَمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9365,
                "hadithNumber": "1801",
                "englishNarrator": "Ibn `Abbas reported:",
                "hadithEnglish": "(My father) Al-`Abbas رضی اللہ تعالیٰ عنہ sent me to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and he was in the house of my mother's sister Maimuna and I spent that night along with him. He (the Holy Prophet) got up and prayed at night, and I stood up on his left side. He caught hold of me from behind his back and made me stand on his right side.",
                "hadithUrdu": "حضرت عباس رضی اللہ تعالیٰ عنہ نے مجھے نبی کریم صلی اللہ علیہ وسلم کے پاس بھیجا آپ صلی اللہ علیہ وسلم میری خالہ میمونہ رضی اللہ تعالیٰ عنہا کے گھر میں تھے تو وہ رات میں نے آپ کے ساتھ گزاری ، آپ رات کو اٹھ کر نماز پڑھنے لگےاور میں آپ کے بائیں طرف کھڑا ہوگیا تو آپ نے مجھے اپنی پشت کے پیچھے سے پکڑا اور اپنی دائیں جانب کرلیا ( اس حدیث میں مذید یہ تفصیل سامنے آئی کہ ابن عباس رضی اللہ تعالیٰ عنہ کو ان کے والد نے بھیجاتھا ) -",
                "urduNarrator": "مجھ سے ہارون بن عبداللہ اور محمد بن رافع نے بیان کیا، کہا کہ ہم سے وہب بن جریر نے بیان کیا، مجھ سے میرے والد نے بیان کیا، انہوں نے کہا,قیس بن سعد ، عطاء سے حدیث بیان کرتے ہیں ، انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللهِ، وَمُحَمَّدُ بْنُ رَافِعٍ، قَالَا: حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، أَخْبَرَنِي أَبِي، قَالَ: سَمِعْتُ قَيْسَ بْنَ سَعْدٍ، يُحَدِّثُ عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ: بَعَثَنِي الْعَبَّاسُ إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَهُوَ فِي بَيْتِ خَالَتِي مَيْمُونَةَ، فَبِتُّ مَعَهُ تِلْكَ اللَّيْلَةَ، «فَقَامَ يُصَلِّي مِنَ اللَّيْلِ، فَقُمْتُ عَنْ يَسَارِهِ، فَتَنَاوَلَنِي مِنْ خَلْفِ ظَهْرِهِ فَجَعَلَنِي عَلَى يَمِينِهِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9366,
                "hadithNumber": "1802",
                "englishNarrator": "Ibn `Abbas رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "I spent a night in the house of my mother's sister Maimuna رضی اللہ تعالیٰ عنہا , and the rest of the hadith is the same as narrated above.",
                "hadithUrdu": "میں نے اپنی خالہ میمونہ رضی اللہ تعالیٰ عنہا کے ہاں رات گزاری ۔ ۔ ۔ آگے ابن جریج اور قیس بن سعد کی روایت کی طرح ہے ۔",
                "urduNarrator": "ہم سے ابن نمیر نے بیان کیا، کہا ہم سے میرے والد نے بیان کیا، انہوں نے کہا عبدالملک نے عطاء سے اور انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عَبْدُ الْمَلِكِ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ: بِتُّ عِنْدَ خَالَتِي مَيْمُونَةَ نَحْوَ حَدِيثِ ابْنِ جُرَيْجٍ، وَقَيْسِ بْنِ سَعْدٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9367,
                "hadithNumber": "1803",
                "englishNarrator": "I heard Ibn 'Abbas رضی اللہ تعالیٰ عنہ saying:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) observed thirteen rak'ahs at night.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم رات کوتیرہ رکعتیں پڑھاکرتے تھے ( یہی رات کی رکعتوں کی زیادہ سے زیادہ تعداد ہے جس میں دو خفیف رکعتیں شامل ہیں ۔ آپ صلی اللہ علیہ وسلم کا معمول گیارہ کاتھا جس طرح حضرت عائشہ رضی اللہ تعالیٰ عنہا نے فرمایا ۔ )",
                "urduNarrator": "ابو بکر بن ابی شیبہ ابن مثنیٰ ، اور ابن بشار نے غندر ، شعبہ اور ابوجمرہ کی سند سے حدیث بیان کی کہ حضرت ابن عباس رضی اللہ تعالیٰ عنہ فرماتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا غُنْدَرٌ عَنْ شُعْبَةَ ح و حَدَّثَنَا ابْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي جَمْرَةَ قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي مِنْ اللَّيْلِ ثَلَاثَ عَشْرَةَ رَكْعَةً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9368,
                "hadithNumber": "1804",
                "englishNarrator": "Zaid bin Khalid al-Juhani رضی اللہ تعالیٰ عنہ said:",
                "hadithEnglish": "I would definitely watch at night the prayer observed by the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). He prayed two short rak'ahs, then two long, long, long rak'ahs, then he prayed two rak'ahs which were shorter than the two preceding rak'ahs, then he prayed two rak'ahs which were shorter than the two preceding, then he prayed two rak'ahs which were shorter than the two preceding, then observed a single one (Witr), making a total of thirteen rak'ahs",
                "hadithUrdu": "میں آج رات رسول اللہ صلی اللہ علیہ وسلم کی نماز کا ( گہری نظر سے ) مشاہدہ کروں گا ، تو ( میں نے دیکھا کہ ) آپ نے دو ہلکی رکعتیں پڑھیں ، پھر دو انتہائی لمبی رکعتیں بہت ہی زیادہ لمبی رکعتیں اداکیں ، پھر دو رکعتیں پڑھیں ۔ جو ( ان طویل ترین ) رکعتوں سے ہلکی تھیں ، پھر دو رکعتیں پڑھیں جو اپنے سے پہلے کی دو رکعتوں سے ہلکی تھیں ، پھر دو رکعتیں پڑھیں جو ا پنے سے پہلے کی دو رکعتوں سے کم تر تھیں ، پھر دو رکعتیں پڑھیں جو اپنے سے پہلی والی رکعتوں سے کم تھیں ، پھر وتر پڑھا تو یہ تیرہ رکعتیں ہوئیں ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، انہوں نے مالک بن انس سے، انہوں نے عبداللہ بن ابی بکر سے، انہوں نے اپنے والد سے، کہ ان سے عبداللہ بن قیس بن مخرمہ رضی اللہ عنہ نے بیان کیا, حضرت زید بن خالد جہنی رضی اللہ تعالیٰ عنہ سے روایت ہے ۔ کہ انھوں نے ( دل میں ) کہا",
                "hadithArabic": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكِ بْنِ أَنَسٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ أَبِيهِ أَنَّ عَبْدَ اللَّهِ بْنَ قَيْسِ بْنِ مَخْرَمَةَ أَخْبَرَهُ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ أَنَّهُ قَالَ لَأَرْمُقَنَّ صَلَاةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّيْلَةَ فَصَلَّى رَكْعَتَيْنِ خَفِيفَتَيْنِ ثُمَّ صَلَّى رَكْعَتَيْنِ طَوِيلَتَيْنِ طَوِيلَتَيْنِ طَوِيلَتَيْنِ ثُمَّ صَلَّى رَكْعَتَيْنِ وَهُمَا دُونَ اللَّتَيْنِ قَبْلَهُمَا ثُمَّ صَلَّى رَكْعَتَيْنِ وَهُمَا دُونَ اللَّتَيْنِ قَبْلَهُمَا ثُمَّ صَلَّى رَكْعَتَيْنِ وَهُمَا دُونَ اللَّتَيْنِ قَبْلَهُمَا ثُمَّ صَلَّى رَكْعَتَيْنِ وَهُمَا دُونَ اللَّتَيْنِ قَبْلَهُمَا ثُمَّ أَوْتَرَ فَذَلِكَ ثَلَاثَ عَشْرَةَ رَكْعَةً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9369,
                "hadithNumber": "1805",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "I accompanied the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) in a journey and we reached a watering place. He said: Jabir, are you going to enter it? I said: Yes. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) then got down and I entered it. He (the Holy Prophet) then went away to relieve himself and I placed for him water for ablution. He then came back and performed ablution, and then stood and prayed in one garment, having its ends tied from the opposite sides. I stood behind him and he caught hold of my ear and made me stand on his right side.",
                "hadithUrdu": "میں ایک سفر میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھا ، ہم پانی کے ایک گھاٹ پر پہنچے تو آپ نے فرمایا : \" جابر!کیا تم سواری کو پلانے کے لئے گھاٹ پر نہیں اتروں گے؟ \" میں نے کہا : کیوں نہیں!رسول اللہ صلی اللہ علیہ وسلم ( بھی ) گھاٹ پر اترے اور میں بھی اترا ، پھر آپ ضرورت کے لئے تشریف لے گئے اور میں نے آپ کے لئے وضو کا پانی رکھ دیا ، آپ واپس آئے اور وضو فرمایا ، پھر آپ کھڑ ے ہوئے اور ایک کپڑے میں نماز پڑھی جس کے دونوں کنارے آپ نے مخالف سمتوں میں ڈال رکھے تھے ( دائیں کنارے کو بائیں کندھے پر اور بائیں کنارے کو دائیں کندھے پر ڈالا ) میں آپ کے پیچھے کھڑا ہوگیا تو آپ نے میرے کان سے پکڑ کر مجھے اپنی دائیں طرف کرلیا ۔",
                "urduNarrator": "مجھ سے حجاج بن الشاعر نے بیان کیا، مجھ سے محمد بن جعفر المدنی ابو جعفر نے بیان کیا، ہم سے ورقہ نے محمد بن المنکدر کی سند سے بیان کیا, حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے روایت ہے ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ حَدَّثَنِي مُحَمَّدُ بْنُ جَعْفَرٍ الْمَدَائِنِيُّ أَبُو جَعْفَرٍ حَدَّثَنَا وَرْقَاءُ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ كُنْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَانْتَهَيْنَا إِلَى مَشْرَعَةٍ فَقَالَ أَلَا تُشْرِعُ يَا جَابِرُ قُلْتُ بَلَى قَالَ فَنَزَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَشْرَعْتُ قَالَ ثُمَّ ذَهَبَ لِحَاجَتِهِ وَوَضَعْتُ لَهُ وَضُوءًا قَالَ فَجَاءَ فَتَوَضَّأَ ثُمَّ قَامَ فَصَلَّى فِي ثَوْبٍ وَاحِدٍ خَالَفَ بَيْنَ طَرَفَيْهِ فَقُمْتُ خَلْفَهُ فَأَخَذَ بِأُذُنِي فَجَعَلَنِي عَنْ يَمِينِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9370,
                "hadithNumber": "1806",
                "englishNarrator": "A'isha رضی اللہ تعالیٰ عنہا reported:",
                "hadithEnglish": "When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) stood up at night to pray, he began his prayer with two short rak'ahs.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم جب رات کو نماز پڑھنے کےلئے اٹھتے ، اپنی نماز کا آغاز دو ہلکی رکعتوں سے فرماتے ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ اور ابوبکر بن ابی شیبہ نے بیان کیا، ابو بکر نے کہا: ہم سے ہشیم نے بیان کیا، ہم سے ابوحرة نے سنن کے بارے میں بیان کیا، انہوں نے سعد بن ہشام کی سند سے, حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت ہے ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ جَمِيعًا عَنْ هُشَيْمٍ قَالَ أَبُو بَكْرٍ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا أَبُو حُرَّةَ عَنْ الْحَسَنِ عَنْ سَعْدِ بْنِ هِشَامٍ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ مِنْ اللَّيْلِ لِيُصَلِّيَ افْتَتَحَ صَلَاتَهُ بِرَكْعَتَيْنِ خَفِيفَتَيْنِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9371,
                "hadithNumber": "1807",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying When any one of you gets up at night, he should begin the prayer with two short rak'ahs.",
                "hadithUrdu": "آپ نے فرمایا : \" جب تم میں سے کوئی رات کو ( نماز کے لئے ) اٹھے تو وہ اپنی نماز کا آغاز دو ہلکی رکعتوں سے کرے ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے ابو اسامہ نے بیان کیا، انہوں نے ہشام سے، انہوں نے محمد صلی اللہ علیہ وسلم کی سند سے, حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ هِشَامٍ عَنْ مُحَمَّدٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا قَامَ أَحَدُكُمْ مِنْ اللَّيْلِ فَلْيَفْتَتِحْ صَلَاتَهُ بِرَكْعَتَيْنِ خَفِيفَتَيْنِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9372,
                "hadithNumber": "1808",
                "englishNarrator": "Ibn `Abbas رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) got up during the night to pray, he used to say: O Allah, to Thee be the praise Thou art the light of the heavens and the earth. To Thee be the praise; Thou art the Supporter of the heavens and the earth. To Thee be the praise; Thou art the Lord of the heavens and the earth and whatever is therein. Thou art the Truth; Thy promise is True, the meeting with Thee is True. Paradise is true, Hell is true, the Hour is true. O Allah, I submit to Thee; affirm my faith in Thee; repose my trust in Thee, and I return to Thee for repentance; by Thy help I have disputed; and to Thee I have come for decision, so forgive me my earlier and later sins, the sins that I committed in secret and openly. Thou art my God. There is no god but Thee.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم جب رات کی آ خری تہائی میں نماز کے لئے اٹھتے تو فرماتے : \" اے اللہ ! تمام تعریف تیرے ہی لئے ہے ، تو آسمانوں اور زمین کا نور ہے اور تیرے ہی لئے حمد ہے تو آسمانوں اور زمین کو قائم رکھنے والا ہے اور تیرے ہی لئے حمد ہےتو آسمانوں اور زمین کا اور جو کچھ ان میں ہے تو پالنے والا ہے ۔ اور توبرحق ہے اور تیرا وعدہ سچا ہے اور تیرا قول اٹل ہے اور تیرے ساتھ ملاقات قطعی ہے اور جنت حق ہے اور جہنم حق ہے اور قیامت حق ہے ۔ اے اللہ میں نے اپنے آپ کو تیرے سپرد کردیا اور میں تجھ پر ایمان لایا اور میں نے تجھ پر توکل اور بھروسہ کیا اور تیری طرف رجوع کیا اور تیر ی توفیق سے ( تیرے منکروں سے ) جھگڑا کیا اور تیرے ہی حضور فیصلہ لایا ( تجھے ہی حاکم تسلیم کیا ) تو بخش دے وہ گناہ جو میں نے پہلے کیے اور جو بعد میں کئے اور جو چھپ کرکئے اور جو ظاہرا کیے تو ہی میرا معبود ہے تیرے سوا کوئی معبود نہیں ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, امام مالک ؒ نے ابو زہیر سے ، انھوں نے طاؤس سے اور انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكِ بْنِ أَنَسٍ عَنْ أَبِي الزُّبَيْرِ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ إِذَا قَامَ إِلَى الصَّلَاةِ مِنْ جَوْفِ اللَّيْلِ اللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ نُورُ السَّمَوَاتِ وَالْأَرْضِ وَلَكَ الْحَمْدُ أَنْتَ قَيَّامُ السَّمَوَاتِ وَالْأَرْضِ وَلَكَ الْحَمْدُ أَنْتَ رَبُّ السَّمَوَاتِ وَالْأَرْضِ وَمَنْ فِيهِنَّ أَنْتَ الْحَقُّ وَوَعْدُكَ الْحَقُّ وَقَوْلُكَ الْحَقُّ وَلِقَاؤُكَ حَقٌّ وَالْجَنَّةُ حَقٌّ وَالنَّارُ حَقٌّ وَالسَّاعَةُ حَقٌّ اللَّهُمَّ لَكَ أَسْلَمْتُ وَبِكَ آمَنْتُ وَعَلَيْكَ تَوَكَّلْتُ وَإِلَيْكَ أَنَبْتُ وَبِكَ خَاصَمْتُ وَإِلَيْكَ حَاكَمْتُ فَاغْفِرْ لِي مَا قَدَّمْتُ وَأَخَّرْتُ وَأَسْرَرْتُ وَأَعْلَنْتُ أَنْتَ إِلَهِي لَا إِلَهَ إِلَّا أَنْتَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9373,
                "hadithNumber": "1809",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Ibn 'Abbas through another chain of transmitters and with slight alteration of two words. Instead of the word Qayyam (Supporter, as used in the above hadith here the word) Qayyim (the Custodian) has been used, and he (further said): What I did in secret. And in the hadith narrated by Ibn 'Uyaina there is some addition.",
                "hadithUrdu": "ہم سے عمرو نقید نے بیان کیا، کہا ہم سے ابن نمیر نے بیان کیا اور کہا کہ ہم سے ابن ابی عمر نے بیان کیا، انہوں نے کہا,سفیان اور ابن جریج دونوں نے سلیمان ا حول سے ، انھوں نے طاؤس سے ، انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ۔ ابن جریج اور امام مالک ؒ کی ( گزشتہ ) حدیث کے الفاظ ایک جیسے ہیں ، دو جملوں کے سوا کوئی اختلاف نہیں ، ابن جریج نے قيام کے بجائے قيم کہا ( معنی ایک ہیں ) اور واسررت کی جگہ وما اسررت کہا ۔ ( سفیان ) ابن عینیہ کی حدیث میں کچھ اضافہ ہے ، وہ متعدد جملوں میں امام مالکؒ اور ابن جریج سے اختلاف کرتے ہیں ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا عَمْرٌو النَّاقِدُ وَابْنُ نُمَيْرٍ وَابْنُ أَبِي عُمَرَ قَالُوا حَدَّثَنَا سُفْيَانُ ح و حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ كِلَاهُمَا عَنْ سُلَيْمَانَ الْأَحْوَلِ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَّا حَدِيثُ ابْنِ جُرَيْجٍ فَاتَّفَقَ لَفْظُهُ مَعَ حَدِيثِ مَالِكٍ لَمْ يَخْتَلِفَا إِلَّا فِي حَرْفَيْنِ قَالَ ابْنُ جُرَيْجٍ مَكَانَ قَيَّامُ قَيِّمُ وَقَالَ وَمَا أَسْرَرْتُ وَأَمَّا حَدِيثُ ابْنِ عُيَيْنَةَ فَفِيهِ بَعْضُ زِيَادَةٍ وَيُخَالِفُ مَالِكًا وَابْنَ جُرَيْجٍ فِي أَحْرُفٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9374,
                "hadithNumber": "1810",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated by Ibn 'Abbas رضی اللہ تعالیٰ عنہ by another chain of transmitters and the words are nearly the same (as recorded in the above-mentioned hadith).",
                "hadithUrdu": "ہم سے شیبان بن فرخ نے بیان کیا، کہا کہ ہم سے مہدی جو ابن میمون ہیں، انہوں نے بیان کیا، ہم سے عمران القصیر نے بیان کیا۔قیس بن سعد نے طاؤس سے ، انھوں نے ابن عباس رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے یہی حدیث روایت کی ۔ ( اس حدیث کے راوی عمران القصیر کے ) الفاظ ان ( امام مالک ، سفیان ، ابن جریج ) کے الفاظ سے ملتے جلتے ہیں ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا مَهْدِيٌّ وَهُوَ ابْنُ مَيْمُونٍ حَدَّثَنَا عِمْرَانُ الْقَصِيرُ عَنْ قَيْسِ بْنِ سَعْدٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْحَدِيثِ وَاللَّفْظُ قَرِيبٌ مِنْ أَلْفَاظِهِمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9375,
                "hadithNumber": "1811",
                "englishNarrator": "Abdul-Rahman bin 'Auf reported:",
                "hadithEnglish": "I asked 'A'isha رضی اللہ تعالیٰ عنہا , the mother of the believers, (to tell me) the words with which the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) commenced the prayer when he got up at night. She said: When he got up at night he would commence his prayer with these words: O Allah, Lord of Gabriel, and Michael, and Israfil, the Creator of the heavens and the earth, Who knowest the unseen and the seen; Thou decidest amongst Thy servants concerning their differences. Guide me with Thy permission in the divergent views (which the people) hold about Truth, for it is Thou Who guidest whom Thou wilt to the Straight Path.",
                "hadithUrdu": "میں نے ام المومنین حضرت عائشہ رضی اللہ تعالیٰ عنہا سے پوچھا : نبی اکرم صلی اللہ علیہ وسلم جب رات کو نماز کے لئے اٹھتے تھے تو کس چیز کے ساتھ نماز کا آغاز کرتے تھے؟انھوں نے جواب دیا : جب آپ رات کو اٹھتے تو نماز کا آ غاز ( اس دعا سے ) کرتے : \" اے اللہ! جبرائیل ، میکائیل اور اسرافیل کے رب!آسمانوں اور زمین کو پیدا فرمانے والے!پوشیدہ اور ظاہر کو جاننے والے!تیرے بندے جن باتوں میں اختلاف کرتے تھے تو ہی ان کے درمیان فیصلہ فرمائےگا ۔ ، جن باتوں میں اختلاف کیا گیا ہے تو ہی ا پنے حکم سے مجھے ان میں سے جو حق ہے اس پر چلا ، بے شک تو ہی جسے چاہے سیدھی راہ پر چلاتا ہے ۔ \"",
                "urduNarrator": "ہم سے محمد بن المثنی، محمد بن حاتم، عبد بن حمید اور ابو معن الرقاشی نے بیان کیا، انہوں نے کہا کہ ہم سے عمر بن یونس نے بیان کیا، کہا ہم سے عکرمہ بن عمار حدد نے بیان کیا ہم سے یحییٰ بن ابی کثیر نے بیان کیا، انہوں نے کہا ابو سلمہ بن عبدالرحمن نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ حَاتِمٍ وَعَبْدُ بْنُ حُمَيْدٍ وَأَبُو مَعْنٍ الرَّقَاشِيُّ قَالُوا حَدَّثَنَا عُمَرُ بْنُ يُونُسَ حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ قَالَ سَأَلْتُ عَائِشَةَ أُمَّ الْمُؤْمِنِينَ بِأَيِّ شَيْءٍ كَانَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَفْتَتِحُ صَلَاتَهُ إِذَا قَامَ مِنْ اللَّيْلِ قَالَتْ كَانَ إِذَا قَامَ مِنْ اللَّيْلِ افْتَتَحَ صَلَاتَهُ اللَّهُمَّ رَبَّ جَبْرَائِيلَ وَمِيكَائِيلَ وَإِسْرَافِيلَ فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ أَنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ اهْدِنِي لِمَا اخْتُلِفَ فِيهِ مِنْ الْحَقِّ بِإِذْنِكَ إِنَّكَ تَهْدِي مَنْ تَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9376,
                "hadithNumber": "1812",
                "englishNarrator": "Ali bin Abu Talib رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) got up at night for prayer he would say: I turn my face in complete devotion to One Who is the Originator of the heaven and the earth and I am not of the polytheists. Verily my prayer, my sacrifice, my living and my dying are for Allah, the Lord of the worlds; There is no partner with Him and this is what I have been commanded (to profess and believe) and I am of the believers. O Allah, Thou art the King, there is no god but Thee, Thou art my Lord, and I am Thy bondman. I wronged myself and make a confession of my Sin. Forgive all my sins, for no one forgives the sins but Thee, and guide me in the best of conduct for none but Thee guideth anyone (in) good conduct. Remove sins from me, for none else but Thou can remove sins from me. Here I am at Thy service, and Grace is to Thee and the whole of good is in Thine hand, and one cannot get nearneststo Thee through evil. My (power as well as existence) is due to Thee (Thine grace) and I turn to Thee (for supplication). Thou art blessed and Thou art exalted. I seek forgiveness from Thee and turn to Thee in repentance: and when he would bow, he would say: O Allah, it is for Thee that I bowed. I affirm my faith in Thee and I submit to Thee, and submit humbly before Thee my hearing, my eyesight, my marrow, my bone, my sinew; and when he would raise his head, he would say: O Allah, our Lord, praise is due to Thee, (the praise) with which is filled the heavens and the earth, and with which is filled that (space) which exists between them, and filled with anything that Thou desireth afterward. And when he prostrated himself, he (the Holy Prophet) would say: O Allah, it is to Thee that I prostrate myself and it is in Thee that I affirm my faith, and I submit to Thee. My face is submitted before One Who created it, and shaped it, and opened his faculties of hearing and seeing. Blessed is Allah, the best of Creators; and he would then say between Tashahhud and the pronouncing of salutation: Forgive me of the earlier and later open and secret (sins) and that where I made transgression and that Thou knowest better than I. Thou art the First and the Last. There is no god, but Thee.",
                "hadithUrdu": "جب رسول اللہ صلی اللہ علیہ وسلم نماز کے لئے کھڑ ے ہوتے تھے تو فرماتے : \"\" میں نے اپنا رخ اس ذات کی طرف کردیا ہے ۔ جس نے آسمانوں اور زمین کو پیدا فرمایا ، ہر طرف سے یکسو ہوکر ، اور میں اس کے ساتھ شریک ٹھہرانے والوں میں سے نہیں ، میری نماز اور میری ہر ( بدنی ومالی ) عبادت اور میرا جینا اور میرا مرنا اللہ کے لئے ہے جو کائنات کا رب ہے ، اس کا کوئی شریک نہیں اور اسی کا مجھے حکم ملا ہے اور میں فرمانبرداری کرونے والوں میں سے ہوں ۔ اے اللہ ! تو ہی بادشاہ ہے تیرے سوا کوئی بندگی کے لائق نہیں ، تو میرا رب ہے میں تیرا بندہ ہوں اور میں نے اپنے اوپر ظلم کیا ہے اور اپنے گناہ کا اعتراف کیا ہے ، اس لئے میرے سارے گناہ بخش دے کیونکہ گناہوں کو بخشنے والا تیرے سوا کوئی نہیں ، اور میری بہترین اخلاق کی طرف راہنمائی فرما ، تیرے سوا بہترین اخلاق کی راہ پر چلانے والا کوئی نہیں ، اور برے اخلاق مجھ سے ہٹا دے ، تیرے سوا برے اخلاق کو مجھ سے دور کرنے والا کوئی نہیں ، میں تیرے حضور حاضر ہوں اور دونوں جہانوں کی سعادتیں تجھ سے ہیں ہر طرح کی بھلائی تیر ے ہاتھ میں ہے اور برائی کا تیر ی طرف کوئی گزر نہیں ہے میں تیرے ہی سہارے ہوں ، اور تیری ہی طرف میرا رخ ہے ، تو برکت والا رفعت والا اور بلندی والا ہے میں تجھ سے بخشش مانگتا ہوں اور تیرے حضور توبہ کر تا ہوں ۔ \"\" اور جب آپ رکوع کرتے تو فرماتے : \"\" اے اللہ ! میں تیرے سامنے جھکا ہوا ہوں اور میں تجھ ہی پر ایمان لایاہوں ، اپنے آپ کو تیرے ہی سپرد کر دیا ہے ، میرے کان اور میری آنکھیں اور میرا مغز اور میری ہڈیاں اور میری رگیں اور میرے پٹھے تیرے ہی حضور جھکے ہوئے ہیں ۔ \"\" اور جب رکوع سے اٹھتے تو کہتے : \"\" اے اللہ! ہمارے رب ، تیرے ہی لئے حمد ہے جس سے آ سمانوں اور زمین کی وسعتیں بھر جائیں اور اس کے بعد جو تو چاہے اس کی وسعتیں بھر جائیں ۔ \"\" اور جب آپ سجدہ کرتے تو کہتے : \"\" اے اللہ!میں نے تیرے ہی حضور سجدہ کیااور تجھ ہی پر ایمان لایا اور ا پنے آپ کو تیرے ہی حوالے کیا ، میرا چہرہ اس ذات کے سامنے سجدہ ریز ہے جس نےاسے پیدا کیا ، اس کی صورت گری کی اور اس کے کان اور اس کی آنکھیں تراشیں ، برکت والاہے اللہ جو بہترین خالق ہے ۔ \"\" پھر تشہد اور سلام کے درمیان میں یہ دعا پڑھتے ۔ \"\" اے اللہ ! بخش دے جو خطائیں میں نے پہلے کیں یا بعد میں کیں اور چھپا کر کہیں یا علانیہ کیں اور جو بھی زیادتی میں نے کی اور جس کا مجھ سے زیادہ تمھیں علم ہے ( اطاعت اور خیر میں ) تو ہی آگے کرنے والا ہے اور تو ہی پیچھے کرنے والا ہے اور تیرے سوا کوئی عبادت کا حقدار نہیں ۔ \"\"",
                "urduNarrator": "ہم سے محمد بن ابی بکر المقدمی نے بیان کیا, یوسف ماجشون نے کہا : مجھ سے میرے والد ( یعقوب بن ابی سلمہ ماجشون ) نے عبدالرحمن اعرج سے حدیث بیان کی ، انھوں نے عبیداللہ بن ابی رافع سے ، انھوں نے حضرت علی بن ابی طالب رضی اللہ تعالیٰ عنہ سے اور انھوں نےرسول اللہ صلی اللہ علیہ وسلم سے ر وایت کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ حَدَّثَنَا يُوسُفُ الْمَاجِشُونُ حَدَّثَنِي أَبِي عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ إِذَا قَامَ إِلَى الصَّلَاةِ قَالَ وَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّمَاوَاتِ وَالْأَرْضَ حَنِيفًا وَمَا أَنَا مِنْ الْمُشْرِكِينَ إِنَّ صَلَاتِي وَنُسُكِي وَمَحْيَايَ وَمَمَاتِي لِلَّهِ رَبِّ الْعَالَمِينَ لَا شَرِيكَ لَهُ وَبِذَلِكَ أُمِرْتُ وَأَنَا مِنْ الْمُسْلِمِينَ اللَّهُمَّ أَنْتَ الْمَلِكُ لَا إِلَهَ إِلَّا أَنْتَ أَنْتَ رَبِّي وَأَنَا عَبْدُكَ ظَلَمْتُ نَفْسِي وَاعْتَرَفْتُ بِذَنْبِي فَاغْفِرْ لِي ذُنُوبِي جَمِيعًا إِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ وَاهْدِنِي لِأَحْسَنِ الْأَخْلَاقِ لَا يَهْدِي لِأَحْسَنِهَا إِلَّا أَنْتَ وَاصْرِفْ عَنِّي سَيِّئَهَا لَا يَصْرِفُ عَنِّي سَيِّئَهَا إِلَّا أَنْتَ لَبَّيْكَ وَسَعْدَيْكَ وَالْخَيْرُ كُلُّهُ فِي يَدَيْكَ وَالشَّرُّ لَيْسَ إِلَيْكَ أَنَا بِكَ وَإِلَيْكَ تَبَارَكْتَ وَتَعَالَيْتَ أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ وَإِذَا رَكَعَ قَالَ اللَّهُمَّ لَكَ رَكَعْتُ وَبِكَ آمَنْتُ وَلَكَ أَسْلَمْتُ خَشَعَ لَكَ سَمْعِي وَبَصَرِي وَمُخِّي وَعَظْمِي وَعَصَبِي وَإِذَا رَفَعَ قَالَ اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ مِلْءَ السَّمَاوَاتِ وَمِلْءَ الْأَرْضِ وَمِلْءَ مَا بَيْنَهُمَا وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ وَإِذَا سَجَدَ قَالَ اللَّهُمَّ لَكَ سَجَدْتُ وَبِكَ آمَنْتُ وَلَكَ أَسْلَمْتُ سَجَدَ وَجْهِي لِلَّذِي خَلَقَهُ وَصَوَّرَهُ وَشَقَّ سَمْعَهُ وَبَصَرَهُ تَبَارَكَ اللَّهُ أَحْسَنُ الْخَالِقِينَ ثُمَّ يَكُونُ مِنْ آخِرِ مَا يَقُولُ بَيْنَ التَّشَهُّدِ وَالتَّسْلِيمِ اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ وَمَا أَسْرَفْتُ وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ لَا إِلَهَ إِلَّا أَنْتَ .",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9377,
                "hadithNumber": "1813",
                "englishNarrator": "A'raj reported:",
                "hadithEnglish": "When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) would start the prayer, he would pronounce takbir (Allah-o-Akbar) and then say: I turn my face (up to Thee), I am the first of the believers; and when he raised his head from ruku' he said: Allah listened to him who praised Him; O our Lord, praise be to Thee; and he said: He shaped (man) and how fine is his shape? And he (the narrator) said: When he pronounced salutation he said: O Allah, forgive me my earlier (sins), to the end of the hadith; and he did not say it between the Tashahhud and salutation (as mentioned above).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم جب نماز کا آغاز فرماتے تو اللہ اکبر کہتے ، پھر د عا پڑھتے : وجهت وجهيي اس میں ( کے بجائے ) \" انا من المسلمين \" اور میں اطاعت وفرمانبرداری میں اولین ( مقام پر فائز ) ہوں \" کے الفاظ ہیں اور کہا : جب آپ رکوع سے اپنا سر اٹھاتے تو \" سمع الله لمن حمده ربنا ولك الحمد \" کہتے اورصوره ( اس کی صورت گری کی ) کے بعد \" فاحسن صوره \" ( اس کو بہترین شکل وصورت عنایت فرمائی ) کے الفاظ کہے اور کہا جب سلام پھیرتے تو کہتے : \" اللهم اغفرلي ما قدمت \" اے اللہ! بخش دے جو میں نے پہلے کیا ۔ \" حدیث کے آخر تک اور انھوں نے \" تشہد اور سلام پھیرنے کے درمیان \" کے الفاظ نہیں کہے ۔",
                "urduNarrator": "ہم سے زہیر بن حرب نے بیان کیا، کہا ہم سے عبدالرحمٰن بن مہدی نے بیان کیا، کہا ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے ابو النضر نے بیان کیا، انہوں نے کہا کہ ہم سے انہوں نے بیان کیا,عبدالعزیز بن عبداللہ بن ابی سلمہ نے اپنے چچا الماجشون ( یعقوب ) بن ابی سلمہ سے اور انھوں نے ( عبدالرحمان ) اعرج سے اسی سند کے ساتھ یہی حدیث بیان کی اور کہا",
                "hadithArabic": "و حَدَّثَنَاه زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ ح و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا أَبُو النَّضْرِ قَالَا حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي سَلَمَةَ عَنْ عَمِّهِ الْمَاجِشُونِ بْنِ أَبِي سَلَمَةَ عَنْ الْأَعْرَجِ بِهَذَا الْإِسْنَادِ وَقَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اسْتَفْتَحَ الصَّلَاةَ كَبَّرَ ثُمَّ قَالَ وَجَّهْتُ وَجْهِي وَقَالَ وَأَنَا أَوَّلُ الْمُسْلِمِينَ وَقَالَ وَإِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ رَبَّنَا وَلَكَ الْحَمْدُ وَقَالَ وَصَوَّرَهُ فَأَحْسَنَ صُوَرَهُ وَقَالَ وَإِذَا سَلَّمَ قَالَ اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ إِلَى آخِرِ الْحَدِيثِ وَلَمْ يَقُلْ بَيْنَ التَّشَهُّدِ وَالتَّسْلِيمِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9378,
                "hadithNumber": "1814",
                "englishNarrator": "Hudhaifa رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "I prayed with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) one night and he started reciting al-Baqara. I thought that he would bow at the end of one hundred verses, but he proceeded on; I then thought that he would perhaps recite the whole (surah) in a rak'ah, but he proceeded and I thought he would perhaps bow on completing (this surah). He then started al-Nisa', and recited it; he then started Al-i-'Imran and recited leisurely. And when he recited the verses which referred to the Glory of Allah, he glorified (by saying Subhan Allah-Glory to my Lord the Great), and when he recited the verses which tell (how the Lord) is to be begged, he (the Holy Prophet) would then beg (from Him), and when he recited the verses dealing with protection from the Lord, he sought (His) protection and would then bow and say: Glory be to my Mighty Lord; his bowing lasted about the same length of time as his standing (and then on returning to the standing posture after ruku') he would say: Allah listened to him who praised Him, and he would then stand about the same length of time as he had spent in bowing. He would then prostrate himself and say: Glory be to my Lord most High, and his prostration lasted nearly the same length of time as his standing. In the hadith transmitted by Jarir the words are: He (the Holy Prophet) would say: Allah listened to him who praised Him, our Lord, to Thee i the praise.",
                "hadithUrdu": "ایک رات میں نبی اکرم صلی اللہ علیہ وسلم کے ساتھ نماز پڑھی ، آپ نے سورہ بقرہ کا آغاز فرمایا ، میں نے ( دل میں ) کہا : آپ سو آیات پڑھ کر رکوع فرمائیں گے مگر آپ آگے بڑھ گئے میں نے کہا : آپ اسے ( پوری ) رکعت میں پڑھیں گے ، آپ آگے پڑھتے گئے ، میں نے سوچا ، اسے پڑھ کر رکوع کریں گے مگر آپ نے سورہ نساءشروع کردی ، آپ نے وہ پوری پڑھی ، پھر آپ نے آل عمران شروع کردی ، اس کو پورا پڑھا ، آپ ٹھر ٹھر کر قرائت فرماتے رہے جب ایسی آیت سے گزرتے جس میں تسبیح ہے توسبحان اللہ کہتے اور جب سوال ( کرنے والی آیت ) سے گزرتے ( پڑھتے ) تو سوا ل کرتے اور جب پناہ مانگنے والی آیت سے گزرتے تو ۔ ( اللہ سے ) پناہ مانگتے ، پھر آپ نے ر کوع فرمایا اور سبحان ربي العظيم کہنے لگے ، آپ کا رکوع ( تقریباً ) آپ کے قیام جتنا تھا ۔ پھر آپ نے \"\" سمع الله لمن حمده \"\" کہا : پھر آپ لمبی دیر کھڑے رہے ، تقریباً اتنی دیر جتنی دیر رکوع کیا تھا ، پھر سجدہ کیا اور \"\" سبحان ربي الاعلي \"\" کہنے لگے اور آپ کا سجدہ ( بھی ) آپ کے قیام کے قریب تھا ۔ جریر کی روایت میں یہ اضافہ ہےکہ آپ نے کہا : ( سمع الله لمن حمده ربنا لك الحمد \"\" ) یعنی ربنا لك الحمدکا اضافہ ہے ۔ )",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا ,عبداللہ بن نمیر ، ابو معاویہ اور جریر سب نے اعمش سے ، انھوں نے سعد بن عبیدہ سے ، انھوں نے مستورد بن احنف سے ، انھوں نے صلہ بن زفر سے اور انھوں نے حضرت حذیفہ رضی اللہ تعالیٰ عنہ سے روایت کی ، ۔ انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ وَأَبُو مُعَاوِيَةَ ح و حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ جَمِيعًا عَنْ جَرِيرٍ كُلُّهُمْ عَنْ الْأَعْمَشِ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ وَاللَّفْظُ لَهُ حَدَّثَنَا أَبِي حَدَّثَنَا الْأَعْمَشُ عَنْ سَعْدِ بْنِ عُبَيْدَةَ عَنْ الْمُسْتَوْرِدِ بْنِ الْأَحْنَفِ عَنْ صِلَةَ بْنِ زُفَرَ عَنْ حُذَيْفَةَ قَالَ صَلَّيْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ لَيْلَةٍ فَافْتَتَحَ الْبَقَرَةَ فَقُلْتُ يَرْكَعُ عِنْدَ الْمِائَةِ ثُمَّ مَضَى فَقُلْتُ يُصَلِّي بِهَا فِي رَكْعَةٍ فَمَضَى فَقُلْتُ يَرْكَعُ بِهَا ثُمَّ افْتَتَحَ النِّسَاءَ فَقَرَأَهَا ثُمَّ افْتَتَحَ آلَ عِمْرَانَ فَقَرَأَهَا يَقْرَأُ مُتَرَسِّلًا إِذَا مَرَّ بِآيَةٍ فِيهَا تَسْبِيحٌ سَبَّحَ وَإِذَا مَرَّ بِسُؤَالٍ سَأَلَ وَإِذَا مَرَّ بِتَعَوُّذٍ تَعَوَّذَ ثُمَّ رَكَعَ فَجَعَلَ يَقُولُ سُبْحَانَ رَبِّيَ الْعَظِيمِ فَكَانَ رُكُوعُهُ نَحْوًا مِنْ قِيَامِهِ ثُمَّ قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ ثُمَّ قَامَ طَوِيلًا قَرِيبًا مِمَّا رَكَعَ ثُمَّ سَجَدَ فَقَالَ سُبْحَانَ رَبِّيَ الْأَعْلَى فَكَانَ سُجُودُهُ قَرِيبًا مِنْ قِيَامِهِ قَالَ وَفِي حَدِيثِ جَرِيرٍ مِنْ الزِّيَادَةِ فَقَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ رَبَّنَا لَكَ الْحَمْدُ.",
                "headingArabic": "اسْتِحْبَابِ تَطْوِيلِ الْقِرَاءَةِ فِي صَلاَةِ اللَّيْلِ ‏‏",
                "headingUrdu": "رات کی نماز میں زیادہ دیر تک پڑھنا مستحب ہے۔",
                "headingEnglish": "It is recommended to recite for a long time in the night prayers",
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9379,
                "hadithNumber": "1815",
                "englishNarrator": "Abdullah رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "I prayed with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and he lengthened it till I entertained an evil thought. It was said to him what that thought was. He said: I thought that I should sit down and forsake him.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نمازپڑھی آپ نے اتنی لمبی نماز پڑھی کہ میں نے ایک ناپسندیدہ کام کا ارادہ کر لیا ۔ کہا : تو ان سے پوچھا گیا آپ نے کس بات کا ارادہ کیا تھا؟ انھوں نے کہا : میں نے ارادہ کیا کہ بیٹھ جاؤں اور آپ کو ( اکیلے ہی قیام کی حالت میں ) چھوڑدوں ۔ \"\"",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ اور اسحاق بن ابراہیم دونوں نے روایت کی ہے, جریر نے اعمش سے اور انھوں نے ابووائل سے روایت کی , انھوں نے کہا : حضرت عبد اللہ بن مسعود رضی اللہ تعالیٰ عنہ نے کہا",
                "hadithArabic": "و حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ كِلَاهُمَا عَنْ جَرِيرٍ قَالَ عُثْمَانُ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي وَائِلٍ قَالَ قَالَ عَبْدُ اللَّهِ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَطَالَ حَتَّى هَمَمْتُ بِأَمْرِ سَوْءٍ قَالَ قِيلَ وَمَا هَمَمْتَ بِهِ قَالَ هَمَمْتُ أَنْ أَجْلِسَ وَأَدَعَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9380,
                "hadithNumber": "1816",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been narrated by A'mash with the same chain of transmitters.",
                "hadithUrdu": "ہم سے اسماعیل بن الخلیل اور سوید بن سعید نے روایت کی ہے, علی بن مسہر نے اعمش سے اسی سند کے ساتھ اسی کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَاه إِسْمَعِيلُ بْنُ الْخَلِيلِ وَسُوَيْدُ بْنُ سَعِيدٍ عَنْ عَلِيِّ بْنِ مُسْهِرٍ عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9381,
                "hadithNumber": "1817",
                "englishNarrator": "Abdullah (bin Mas'ud) رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "A mention was made of a man who slept the whole night till morning. He (the Holy Prophet) remarked: That is a man in whose ears (or in whose ear) the devil urinated.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے سامنے ایک ایسے آدمی کا ذکر کیا گیا جو رات نھر سویا رہا یہاں تک کہ صبح ہو گئی آپ نے فر ما یا : وہ ( ایسا ) شخص ہے کہ شیطان نے اس کے کان میں ۔ \" یا فر ما یا : \" اس کے دونوں کا نوں میں پیشاب کر دیا ہے ۔ \"",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ اور اسحاق نے بیان کیا، کہا کہ ہم سے جریر نے منصور سے، ابی وائل کی سند سے بیان کیا, حضرت عبد اللہ بن مسعود رضی اللہ تعالیٰ عنہ سے روایت ہے انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ قَالَ عُثْمَانُ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ أَبِي وَائِلٍ عَنْ عَبْدِ اللَّهِ قَالَ ذُكِرَ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلٌ نَامَ لَيْلَةً حَتَّى أَصْبَحَ قَالَ ذَاكَ رَجُلٌ بَالَ الشَّيْطَانُ فِي أُذُنَيْهِ أَوْ قَالَ فِي أُذُنِهِ.",
                "headingArabic": "مَا رُوِيَ فِيمَنْ، نَامَ اللَّيْلَ أَجْمَعَ حَتَّى أَصْبَحَ ‏",
                "headingUrdu": "رات کو نماز پڑھنے کی ترغیب دینا چاہے تھوڑی ہی کیوں نہ ہو۔",
                "headingEnglish": "Encouragement to pray at night even if it is little",
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9382,
                "hadithNumber": "1818",
                "englishNarrator": "Husain bin 'Ali رضی اللہ تعالیٰ عنہ narrated on the authority of (his father) 'Ali bin Abu Talib رضی اللہ تعالیٰ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came one night to see him ('Ali) and Fatimah رضی اللہ تعالیٰ عنہا (the daughter of the Holy Prophet) and said: Don't you observe (Tahajjud) prayer? I ('Ali) said: Messenger of Allah, verily our souls are in the hands of Allah and when He wants to awaken us, He awakens us. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) went back when I said this to him. He was striking his hand on his thigh while returning, and I heard him say: Verily the man disputes with many things.",
                "hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم نے رات کے وقت انھیں اور فاطمہ رضی اللہ تعالیٰ عنہا کو جگایا اور فر ما یا : \" کیا تم لوگ نماز نہیں پڑھو گے؟ میں نےکہا : اے اللہ کے رسول !ہماری جانیں اللہ کے ہاتھ میں ہیں جب وہ ہمیں اٹھانا چاہتا ہے اٹھا دیتا ہے جب میں نے آپ سے یہ کہا تو آپ واپس چلے گئے پھر میں نے آپ کو سنا کہ آپ واپس پلٹتے ہو ئے اپنی ران پر ہاتھ مارتے تھے اور کہتے ( آیتکا ایک ٹکڑاپڑھتے ) تھے : \" انسان سب سے بڑھ کر جھگڑا کرنے والا ہے ( جدل ( جھگڑا ) یہ تھی کہ جگا ئے جا نے پر ممنون ہو نے اور نماز پڑھنے کی بجا ئے عذر پیش کیا گیا ۔ )",
                "urduNarrator": "اور ہم سے قتیبہ بن سعید نے بیان کیا، ہم سے لیث نے بیان کیا، ان سے عقیل نے، وہ الزہری کی سند سے، انہوں نے علی بن حسین کی سند سے، کہ ان سے حسین بن علی رضی اللہ عنہما نے بیان کیا, حضرت علی بن ابی طالب رضی اللہ تعالیٰ عنہ سے روایت ہے کہ",
                "hadithArabic": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ عَنْ عُقَيْلٍ عَنْ الزُّهْرِيِّ عَنْ عَلِيِّ بْنِ حُسَيْنٍ أَنَّ الْحُسَيْنَ بْنَ عَلِيٍّ حَدَّثَهُ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَرَقَهُ وَفَاطِمَةَ فَقَالَ أَلَا تُصَلُّونَ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّمَا أَنْفُسُنَا بِيَدِ اللَّهِ فَإِذَا شَاءَ أَنْ يَبْعَثَنَا بَعَثَنَا فَانْصَرَفَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ قُلْتُ لَهُ ذَلِكَ ثُمَّ سَمِعْتُهُ وَهُوَ مُدْبِرٌ يَضْرِبُ فَخِذَهُ وَيَقُولُ وَكَانَ الْإِنْسَانُ أَكْثَرَ شَيْءٍ جَدَلًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9383,
                "hadithNumber": "1819",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ transmitted it from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ):",
                "hadithEnglish": "When any one of you goes to sleep, the devil ties three knots at the back of his neck, sealing every knot with: You have a long night, so sleep. So if one awakes and mentions Allah, a knot will be loosened; if he performs ablution two knots are loosened; and if he prays (all) knots will be loosened, and in the morning he will be active and in good spirits; otherwise we will be in bad spirits and sluggish in the morning.",
                "hadithUrdu": "\" جب تم میں سے کو ئی سوجا تا ہے تو شیطان اس کے سر کے پچھلے حصے پر تین گرہیں لگاتا ہے ہر گرہ پر تھپکی دیتا ہے کہ تم پر ایک بہت لمبی رات ( کا سونا لا زم ) ہے جب انسان بیدار ہو کر اللہ تعا لیٰ کا ذکر کرتا ہے تو ایک گرہ کھل جا تی ہے اور جب وہ وضو کرتا ہے اس سے دو گرہ کھل جا تی ہے پھر جب نماز پڑھتا ہے ساری گرہیں کھل جاتی ہیں اور وہ چاق چوبند ہشاش بشاش پاک طبیعت ( کےساتھ ) صبح کرتا ہے ورنہ ( جاگ کر عبادت نہیں کرتا تو ) صبح کو گندے دل کے ساتھ اور سست اٹھتا ہے ۔ \"",
                "urduNarrator": "ہم سے عمرو ناقد اور زہیر بن حرب نے بیان کیا، عمرو نے کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا، وہ ابو الزناد سے، انہوں نے العرج کی سند سے, حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روا یت ہے انھوں نے یہ فرمان نبی صلی اللہ علیہ وسلم کی طرف منسوب کیا آپ نے فر ما یا",
                "hadithArabic": "حَدَّثَنَا عَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ قَالَ عَمْرٌو حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ يَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْقِدُ الشَّيْطَانُ عَلَى قَافِيَةِ رَأْسِ أَحَدِكُمْ ثَلَاثَ عُقَدٍ إِذَا نَامَ بِكُلِّ عُقْدَةٍ يَضْرِبُ عَلَيْكَ لَيْلًا طَوِيلًا فَإِذَا اسْتَيْقَظَ فَذَكَرَ اللَّهَ انْحَلَّتْ عُقْدَةٌ وَإِذَا تَوَضَّأَ انْحَلَّتْ عَنْهُ عُقْدَتَانِ فَإِذَا صَلَّى انْحَلَّتْ الْعُقَدُ فَأَصْبَحَ نَشِيطًا طَيِّبَ النَّفْسِ وَإِلَّا أَصْبَحَ خَبِيثَ النَّفْسِ كَسْلَانَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9384,
                "hadithNumber": "1820",
                "englishNarrator": "Ibn 'Umar رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Observe some of your prayers in your houses and do not make them graves.",
                "hadithUrdu": "آپ نے فر ما یا : \" کچھ نمازیں گھر میں پڑھا کرو اور ان ( گھروں ) کو قبریں نہ بناؤ ۔ \"",
                "urduNarrator": "ہم سے محمد بن المثنیٰ نے بیان کیا، کہا ہم سے یحییٰ نے بیان کیا, عبیداللہ نے کہا : مجھے نافع نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے بیان کیا انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ قَالَ أَخْبَرَنِي نَافِعٌ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اجْعَلُوا مِنْ صَلَاتِكُمْ فِي بُيُوتِكُمْ وَلَا تَتَّخِذُوهَا قُبُورًا.",
                "headingArabic": "اسْتِحْبَابِ صَلاَةِ النَّافِلَةِ فِي بَيْتِهِ وَجَوَازِهَا فِي الْمَسْجِدِ ‏‏",
                "headingUrdu": "نفلی نماز گھر میں پڑھنا مستحب ہے حالانکہ مسجد میں پڑھنا جائز ہے",
                "headingEnglish": "It is recommended to offer voluntary prayers in one’s house although it is permissible to offer them in the masjid",
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9385,
                "hadithNumber": "1821",
                "englishNarrator": "Ibn 'Umar رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Pray in your houses, and do not make them graves.",
                "hadithUrdu": "آپ نے فر ما یا : گھروں میں ( نفل ) نمازیں پڑھوں اور انھیں قبریں نہ بناؤ ۔ \"",
                "urduNarrator": "ہم سے ابن المثنیٰ نے بیان کیا، کہا ہم سے عبدالوہاب نے بیان کیا، انہوں نے بیان کیا, ایوب نے نافع سے انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی",
                "hadithArabic": "و حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْوَهَّابِ أَخْبَرَنَا أَيُّوبُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ صَلُّوا فِي بُيُوتِكُمْ وَلَا تَتَّخِذُوهَا قُبُورًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9386,
                "hadithNumber": "1822",
                "englishNarrator": "Jabir رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: When any one of you observes prayer in the mosque he should reserve a part of his prayer for his house, for Allah would make the prayer as a means of betterment in his house.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" جب تم میں سے کو ئی اپنی مسجد میں نماز ( باجماعت ) ادا کر لے تو اپنی نماز میں سے اپنے گھر کے لیے بھی کچھ حصہ رکھے کیونکہ اللہ اس کے گھر میں اس کے نماز پڑھنے کی وجہ سے خیروبھلا ئی رکھے گا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، کہا: ہم سے ابو معاویہ نے الاعمش سے اور ابو سفیان کی سند سے بیان کیا, حضرت جابر رضی اللہ تعالیٰ عنہ سے روایت ہے انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَضَى أَحَدُكُمْ الصَّلَاةَ فِي مَسْجِدِهِ فَلْيَجْعَلْ لِبَيْتِهِ نَصِيبًا مِنْ صَلَاتِهِ فَإِنَّ اللَّهَ جَاعِلٌ فِي بَيْتِهِ مِنْ صَلَاتِهِ خَيْرًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9387,
                "hadithNumber": "1823",
                "englishNarrator": "Abu Musa رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The house in which remembrance of Allah is made and the house in which Allah is not remembered are like the living and the dead.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فر ما یا : \" اس گھر کی مثال جس میں اللہ کا ذکر کیا جا تا ہے اور اس گھر کی مثال جس میں اللہ کو یاد نہیں کیا جا تا زندہ اور مردہ جیسی ہے ۔ \"",
                "urduNarrator": "ہم سے عبداللہ بن براد اشعری اور محمد بن الاعلٰی نے بیان کیا، کہا: ہم سے ابو اسامہ نے بریدد سے، ابو بردہ رضی اللہ عنہ سے، انہوں نے کہا, حضرت ابو موسیٰ رضی اللہ تعالیٰ عنہ نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَرَّادٍ الْأَشْعَرِيُّ وَمُحَمَّدُ بْنُ الْعَلَاءِ قَالَا حَدَّثَنَا أَبُو أُسَامَةَ عَنْ بُرَيْدٍ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَى عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَثَلُ الْبَيْتِ الَّذِي يُذْكَرُ اللَّهُ فِيهِ وَالْبَيْتِ الَّذِي لَا يُذْكَرُ اللَّهُ فِيهِ مَثَلُ الْحَيِّ وَالْمَيِّتِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 9388,
                "hadithNumber": "1824",
                "englishNarrator": "Abu Huraira رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Do not make your houses as graveyards. Satan runs away from the house in which Surah Baqara is recited.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" اپنے گھروں کو قبرستان نہ بنا ؤ شیطان اس گھر سے بھا گتا ہے جس میں سورہ بقرہ پڑھی جاتی ہے ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے یعقوب نے جو عبدالرحمٰن قاری کے بیٹے ہیں، انہوں نے سہیل کی سند سے، اپنے والد کی سند سے، انہوں نے بیان کیا, حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روا یت ہے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا يَعْقُوبُ وَهُوَ ابْنُ عَبْدِ الرَّحْمَنِ الْقَارِيُّ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَجْعَلُوا بُيُوتَكُمْ مَقَابِرَ إِنَّ الشَّيْطَانَ يَنْفِرُ مِنْ الْبَيْتِ الَّذِي تُقْرَأُ فِيهِ سُورَةُ الْبَقَرَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-muslim",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 106,
                    "chapterNumber": "6",
                    "chapterEnglish": "The Book of Prayer - Travellers",
                    "chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
                    "chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 9076,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=363",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=361",
                "label": "361",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=362",
                "label": "362",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=363",
                "label": "363",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=364",
                "label": "364",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=365",
                "label": "365",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=366",
                "label": "366",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=367",
                "label": "367",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=365",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=365",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=363",
        "to": 9100,
        "total": 40465
    }
}