{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 494,
        "data": [
            {
                "id": 12614,
                "hadithNumber": "5051",
                "englishNarrator": null,
                "hadithEnglish": "Uthman bin Umar narrated: \"Kahmas narrated a similar report with this chain of narrators.",
                "hadithUrdu": "ابوداؤد سلیمان بن معبد نے مجھ سے کہا, عثمان بن عمر نے کہا : ہمیں کہمس نے اسی سند کے ساتھ اسی کے مانند خبر دی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنِي أَبُو دَاوُدَ سُلَيْمَانُ بْنُ مَعْبَدٍ، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، أَخْبَرَنَا كَهْمَسٌ، بِهَذَا الْإِسْنَادِ نَحْوَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12615,
                "hadithNumber": "5052",
                "englishNarrator": "Abdullah bin Mughaffal رضی اللہ عنہ reported that",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) prohibited throwing of pebbles. Ibn Ja'far reported (in the narration transmitted by him) that he (the Holy Prophet ﷺ) said: It neither inflicts defeat to the enemy nor kills the game but breaks the tooth and puts the eye out. This hadith has been transmitted on the authority of Ibn Mahdi with a slight variation of wording.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے کنکر مارنے سے منع فرمایا ۔ ابن جعفر نے اپنی روایت میں یہ بیا ن کیا کہ آپ نے فرمایا؛ \" یہ نہ دشمن کو ہلاک کرتاہے ، نہ شکار مارتا ہے ، بس دانت توڑتا ہے اورآنکھ پھوڑتاہے ۔ \" اور ابن مہدی نے ( اپنی روایت میں ) کہا؛ \" یہ ( کنکر ، روڑا ) دشمن کو ہلاک نہیں کرتا \" ( انھو ں نے ) آنکھ پھوڑنے کا ذکر نہیں کیا ۔",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا, محمد بن جعفر اورعبدالرحمن بن مہدی نے کہا : ہمیں شعبہ نے قتادہ سے انھوں نے عقبہ بن صہیان سے ، انھوں نے حضرت عبداللہ بن مغفل رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، قَالَا: حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ عُقْبَةَ بْنِ صُهْبَانَ، عَنْ عَبْدِ اللهِ بْنِ مُغَفَّلٍ، قَالَ: «نَهَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ الْخَذْفِ»، قَالَ ابْنُ جَعْفَرٍ فِي حَدِيثِهِ: وَقَالَ: «إِنَّهُ لَا يَنْكَأُ الْعَدُوَّ، وَلَا يَقْتُلُ الصَّيْدَ، وَلَكِنَّهُ يَكْسِرُ السِّنَّ، وَيَفْقَأُ الْعَيْنَ»، وقَالَ ابْنُ مَهْدِيٍّ: «إِنَّهَا لَا تَنْكَأُ الْعَدُوَّ»، وَلَمْ يَذْكُرْ «تَفْقَأُ الْعَيْنَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12616,
                "hadithNumber": "5053",
                "englishNarrator": "Sa'id bin Jubair reported:",
                "hadithEnglish": "A near one of 'Abdullah bin Mughaffal رضی اللہ عنہ threw pebbles. He prohibited him (to do so). He said that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had prohibited the throwing of pebbles by saying: It does not catch the game, nor does it inflict defeat on the enemy, but breaks the tooth and puts the eye out. He (the near one of Abdullah bin Mughadal  رضی اللہ عنہ) again repeated it (the act of throwing of pebbles) whereupon he said: I narrate to you that Allah's Messenger (ﷺ) disliked and prohibited throwing of pebbles, but I see you again throwing pebbles; I (would therefore) not speak with you.",
                "hadithUrdu": "حضرت عبداللہ بن مغفل رضی اللہ عنہ کے کسی قریبی شخص نے کنکر سے نشانہ لگایا ۔ انھوں نے اس کو منع کیا اور کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے کنکر کے ساتھ نشانہ بنانے سے منع فرمایا ہے ۔ اور آپ صلی اللہ علیہ وسلم نے فرمایا : \" یہ نہ کسی جانور کو شکارکرتاہے ، نہ دشمن کو ہلاک کرتاہے ، البتہ یہ دانت توڑتاہے ۔ اور آنکھ پھوڑتا ہے ۔ \" ( سعیدنے ) کہا : اس شخص نے دوبارہ یہی کیا تو حضرت عبداللہ بن مغفل رضی اللہ عنہ نے فرمایا : میں نے تم کو حدیث سنائی کہ رسول اللہ صلی اللہ علیہ وسلم نے اس سے منع فرمایا ہے اور تم پھر کنکر ماررہے ہو!میں تم سے کبھی بات نہیں کروں گا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, اسماعیل بن علیہ نے ایوب سے ، انھوں نے سعید بن جبیر سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ أَيُّوبَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، أَنَّ قَرِيبًا لِعَبْدِ اللهِ بْنِ مُغَفَّلٍ خَذَفَ، قَالَ: فَنَهَاهُ، وَقَالَ: إِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنِ الْخَذْفِ، وَقَالَ: «إِنَّهَا لَا تَصِيدُ صَيْدًا، وَلَا تَنْكَأُ عَدُوًّا، وَلَكِنَّهَا تَكْسِرُ السِّنَّ، وَتَفْقَأُ الْعَيْنَ»، قَالَ: فَعَادَ، فَقَالَ: أُحَدِّثُكَ أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْهُ، ثُمَّ تَخْذِفُ، لَا أُكَلِّمُكَ أَبَدًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12617,
                "hadithNumber": "5054",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Ayyub with the same chain of transmitters.",
                "hadithUrdu": "ہم سے ابن ابی عمر نے بیان کیا, ثقفی نے ایوب سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَاهُ ابْنُ أَبِي عُمَرَ، حَدَّثَنَا الثَّقَفِيُّ، عَنْ أَيُّوبَ، بِهَذَا الْإِسْنَادِ نَحْوَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12618,
                "hadithNumber": "5055",
                "englishNarrator": "Shaddid bin Aus رضی اللہ  عنہ said:",
                "hadithEnglish": "Two are the things which I remember Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) having said: Verily Allah has enjoined goodness to everything; so when you kill, kill in a good way and when you slaughter, slaughter in a good way. So every one of you should sharpen his knife, and let the slaughtered animal die comfortably.",
                "hadithUrdu": "دو باتیں ہیں جو میں نے رسول اللہ صلی اللہ علیہ وسلم سے یاد رکھی ہیں ، آپ صلی اللہ علیہ وسلم نے فرمایا؛ \" اللہ تعالیٰ نے ہر چیز کے ساتھ سب سے اچھا طریقہ اختیار کرنے کا حکم دیا ہے ۔ اس لئے جب تم ( قصاص یاحد میں کسی کو ) قتل کرو تو اچھے طریقے سے قتل کرو ، اور جب ذبح کرو تو اچھے طریقے سے ذبح کرو ، تم میں سے ایک شخص ( جو ذبح کرنا چاہتا ہے ) وہ اپنی ( چھری کی ) دھار کو تیز کرلے اور ذبح کیے جانے والے جانور کو اذیت سے بچائے ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, اسماعیل بن علیہ نے خالد حذا ء سے ، انھوں نے ابوقلابہ سے ، انھوں نے ابو اشعث سے اور انھوں نے حضرت شداد بن اوس رضی اللہ  عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ أَبِي قِلَابَةَ، عَنْ أَبِي الْأَشْعَثِ، عَنْ شَدَّادِ بْنِ أَوْسٍ، قَالَ: ثِنْتَانِ حَفِظْتُهُمَا عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «إِنَّ اللهَ كَتَبَ الْإِحْسَانَ عَلَى كُلِّ شَيْءٍ، فَإِذَا قَتَلْتُمْ فَأَحْسِنُوا الْقِتْلَةَ، وَإِذَا ذَبَحْتُمْ فَأَحْسِنُوا الذَّبْحَ، وَلْيُحِدَّ أَحَدُكُمْ شَفْرَتَهُ، فَلْيُرِحْ ذَبِيحَتَهُ».",
                "headingArabic": "الأَمْرِ بِإِحْسَانِ الذَّبْحِ وَالْقَتْلِ وَتَحْدِيدِ الشَّفْرَةِ ‏‏",
                "headingUrdu": "ذبح کرنے اور قتل کرنے میں ماہر ہونے کا حکم اور بلیڈ تیز کرنے کا",
                "headingEnglish": "The command to be proficient in slaughtering and killing, and to sharpen the blade",
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12619,
                "hadithNumber": "5056",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Khalid al-Hadhdha' through different chains o transmitters.",
                "hadithUrdu": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا ہم سے ہشیم نے بیان کیا، کہا ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے عبد الوہاب ثقفی نے بیان کیا، کہا ہم سے ابو نے۔ ہم سے بکر بن نافع نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، اور ہم سے عبداللہ بن عبدالرحمٰن دارمی نے بیان کیا، کہا ہم سے محمد بن یوسف نے بیان کیا۔سفیان کی سند سے، اسحاق بن ابراہیم کی سند سے، جریر کی سند سے، منصور کی سند سے، یہ سب نے خالد حذا ء سے ابن علیہ کی سند سے اور اس کی حدیث کے ہم معنی حدیث روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَاهُ يَحْيَى بْنُ يَحْيَى، حَدَّثَنَا هُشَيْمٌ، ح وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، ح وحَدَّثَنَا أَبُو بَكْرِ بْنُ نَافِعٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، ح وحَدَّثَنَا عَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ، عَنْ سُفْيَانَ، ح وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، كُلُّ هَؤُلَاءِ عَنْ خَالِدٍ الْحَذَّاءِ، بِإِسْنَادِ حَدِيثِ ابْنِ عُلَيَّةَ، وَمَعْنَى حَدِيثِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12620,
                "hadithNumber": "5057",
                "englishNarrator": "Hisham bin Zaid bin Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "I visited the house of al-Hakam bin Ayyub along with my grandfather Anas bin Malik رضی اللہ عنہ , (and there) some people had made a hen a target and were shooting arrows at her. Thereupon Anas رضی اللہ عنہ said that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had forbidden tying of the animals (and making them the targets of arrows, etc.).",
                "hadithUrdu": "میں اپنے دادا انس بن مالک رضی اللہ عنہ کے ساتھ حکم بن ایوب کے ہاں آیا ، وہاں کچھ لوگ تھے ، انھوں نے ایک مرغی کو باندھ کر حدف بنایا ہوا تھا ( اور ) اس پر تیر اندازی کی مشق کررہے تھے ، کہا : حضرت انس رضی اللہ عنہ نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے اس بات سے منع فرمایا ہے کہ جانوروں کو باندھ کر مارا جائے ۔",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا,محمد بن جعفر نے کہا : ہمیں شعبہ نے حدیث بیان کی ، کہا : میں نے ہشام بن زید بن انس بن مالک رضی اللہ عنہ سے سنا ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ هِشَامَ بْنَ زَيْدِ بْنِ أَنَسِ بْنِ مَالِكٍ قَالَ دَخَلْتُ مَعَ جَدِّي أَنَسِ بْنِ مَالِكٍ دَارَ الْحَكَمِ بْنِ أَيُّوبَ فَإِذَا قَوْمٌ قَدْ نَصَبُوا دَجَاجَةً يَرْمُونَهَا قَالَ فَقَالَ أَنَسٌ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تُصْبَرَ الْبَهَائِمُ.",
                "headingArabic": "النَّهْىِ عَنْ صَبْرِ الْبَهَائِمِ، ‏‏",
                "headingUrdu": "جانوروں کو مارنے کے لیے (کھیل کے لیے) گھیرنے کی ممانعت",
                "headingEnglish": "The prohibition of cornering animals in order to kill them (for sport)",
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12621,
                "hadithNumber": "5058",
                "englishNarrator": null,
                "hadithEnglish": "It was narrated from Shu'ba with this chain of narrators (a similar Hadith as no. 5057).",
                "hadithUrdu": "مجھ سے زہیر بن حرب نے بیان کیا, یحییٰ بن سعید ، عبدالرحمن بن مہدی ، خالد بن حارث اورابو اسامہ ، سب نے شعبہ سے اسی سند کے ساتھ حدیث روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ ح و حَدَّثَنِي يَحْيَى بْنُ حَبِيبٍ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ ح و حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو أُسَامَةَ كُلُّهُمْ عَنْ شُعْبَةَ بِهَذَا الْإِسْنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12622,
                "hadithNumber": "5059",
                "englishNarrator": "Ibn 'Abbas رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) having said this: Do not make anything having life as a target.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کسی روح والی چیز کو ( نشانہ بازی کا ) ہد ف مت بناؤ ۔ \"",
                "urduNarrator": "عبیداللہ کے والد معاذ ( عنبری ) نے کہا : ہمیں شعبہ نے عدی ( بن ثابت انصاری ) سے حدیث بیان کی ، انھوں نے سعید بن جبیر سے ، انھوں نے حضرت ابن عباس رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ عَدِيٍّ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَتَّخِذُوا شَيْئًا فِيهِ الرُّوحُ غَرَضًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12623,
                "hadithNumber": "5060",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Shu'ba through a different chain of transmitters.",
                "hadithUrdu": "اور ہم سے محمد بن بشار نے بیان کیا, محمد بن جعفر اور عبدالرحمن بن مہدی نے شعبہ سے اسی سندکے ساتھ اسی کے مانند حدیث بیا ن کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَاه مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ شُعْبَةَ بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12624,
                "hadithNumber": "5061",
                "englishNarrator": "Sa'id bin Jubair reported:",
                "hadithEnglish": "Ibn 'Umar رضی اللہ عنہ happened to pass by a party of men who had tied a hen and were shooting arrows at it. As soon as they saw Ibn 'Umar رضی اللہ عنہ, they scattered from it. Thereupon Ibn Umar رضی اللہ عنہ said: Who has done this? Verily Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) has invoked curse upon him who does this.",
                "hadithUrdu": "ایک مرتبہ حضرت ابن عمر رضی اللہ عنہ کا چند لوگوں کے قریب سے گزرا سے گزرا ہوا جو ایک مرغی کو سامنے باندھ کر اس پر تیر اندازی کررہے تھے ، جب انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ کو دیکھا تو اسے چھوڑ کرمنتشر ہوگئے ، حضرت ابن عمر رضی اللہ عنہ نے کہا : یہ کام کس کا ہے؟ رسول اللہ صلی اللہ علیہ وسلم نے اس شخص پر لعنت کی ہے جو ایسا کام کرے ۔",
                "urduNarrator": "ہم سے شیبان بن فروخ اور ابو کامل نے بیان کیا، اور انہوں نے کہا کہ ہم سے ابو کامل نے بیان کیا ہے, ابو عوانہ نے ابو بشر سے ، انھوں نے سعید بن جبیر سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ وَأَبُو كَامِلٍ وَاللَّفْظُ لِأَبِي كَامِلٍ قَالَا حَدَّثَنَا أَبُو عَوَانَةَ عَنْ أَبِي بِشْرٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ قَالَ مَرَّ ابْنُ عُمَرَ بِنَفَرٍ قَدْ نَصَبُوا دَجَاجَةً يَتَرَامَوْنَهَا فَلَمَّا رَأَوْا ابْنَ عُمَرَ تَفَرَّقُوا عَنْهَا فَقَالَ ابْنُ عُمَرَ مَنْ فَعَلَ هَذَا إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَعَنَ مَنْ فَعَلَ هَذَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12625,
                "hadithNumber": "5062",
                "englishNarrator": "Sa'id bin Jubair reported:",
                "hadithEnglish": "Ibn 'Umar رضی اللہ عنہ happened to pass by some young men of the Quraish who had tied a bird (and th, is made it a target) at which they had been shooting arrows Every arrow that they missed came into the possession of the owner of the bird. So no sooner did they see Ibn 'Umar رضی اللہ عنہ they went away. Thereupon Ibn 'Umar رضی اللہ عنہ said: Who has done this? Allah has cursed him who does this. Verily Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) invoked curse upon one who made a live thing the target (of one's marksmanship).",
                "hadithUrdu": "( ایک بار ) حضرت ابن عمر رضی اللہ عنہ قریش کے چند جوان کے قریب سے گزرے جو ایک پرندے کو باندھ کر اس پرتیرا اندازی کی مشق کررہے تھے اور انھوں نے پرندے والے سے ہر چوکنے والے نشانے کے عوض کچھ دینے کا طے کیا ہواتھا ۔ جب انھوں نےحضرت ابن عمر رضی اللہ عنہ کو دیکھا تو منتشر ہوگئے ۔ حضرت ابن عمر رضی اللہ عنہ نے فرمایا : یہ کام کس کاہے؟جو شخص اس طرح کرے اللہ کی اس پر لعنت ہو ، رسول اللہ صلی اللہ علیہ وسلم نے ایسے شخص پرلعنت کی ہے جو کسی ذی روح کو تختہء مشق بنائے ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا, ہشیم نے کہا : ہمیں ابو بشر نے سعید بن جبیر سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا أَبُو بِشْرٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ قَالَ مَرَّ ابْنُ عُمَرَ بِفِتْيَانٍ مِنْ قُرَيْشٍ قَدْ نَصَبُوا طَيْرًا وَهُمْ يَرْمُونَهُ وَقَدْ جَعَلُوا لِصَاحِبِ الطَّيْرِ كُلَّ خَاطِئَةٍ مِنْ نَبْلِهِمْ فَلَمَّا رَأَوْا ابْنَ عُمَرَ تَفَرَّقُوا فَقَالَ ابْنُ عُمَرَ مَنْ فَعَلَ هَذَا لَعَنْ اللَّهُ مَنْ فَعَلَ هَذَا إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَعَنَ مَنْ اتَّخَذَ شَيْئًا فِيهِ الرُّوحُ غَرَضًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12626,
                "hadithNumber": "5063",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ  عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade that any beast should be killed after it has been tied.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے جانوروں میں سے کسی بھی چیز کو باندھ کر قتل کرنے سے منع فرمایا ہے ۔",
                "urduNarrator": "مجھ سے محمد بن حاتم نے بیان کیا، انہوں نے ہم سے بیان کیا یحییٰ بن سعید ، محمد بن بکیر اور حجاج بن محمد نے کہا : مجھے ابو زبیر نے بتایا ، انھوں نے حضرت جابر بن عبداللہ رضی اللہ  عنہ سے سنا ، کہہ رہے تھے کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ ابْنِ جُرَيْجٍ ح و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ ح و حَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُقْتَلَ شَيْءٌ مِنْ الدَّوَابِّ صَبْرًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 135,
                    "chapterNumber": "35",
                    "chapterEnglish": "The Book of Hunting , Slaughter and what may be Eaten",
                    "chapterUrdu": "شکار کرنے، ذبح کیے جانے والے اور ان جانوروں کا بیان جن کا گوشت کھایا جا سکتا ہے",
                    "chapterArabic": "كتاب الصَّيْدِ وَالذَّبَائِحِ وَمَا يُؤْكَلُ مِنْ الْحَيَوَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12627,
                "hadithNumber": "5064",
                "englishNarrator": "Jundab bin Sufyan رضی اللہ عنہ reported:",
                "hadithEnglish": "I was with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) on the day of 'Id al-Adha. While he had not returned after having offered (the Id prayer) and finished it, he saw the flesh of the sacrificial animals which had been slaughtered before he had completed the prayer. Thereupon he (the Holy Prophet) said: One who slaughtered his sacrificial animal before his prayer or our prayer ('Id), he should slaughter another one in its stead, and he who did not slaughter, he should slaughter by reciting the name of Allah.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ عید الاضحیٰ منائی ، آپ نے نماز پڑھی اور آپ اس ( نماز کے بعدخطبہ ، دعا وغیرہ ) سے فارغ ہوئے ہی تھے کہ آپ نے قربانی کے جانوروں کاگوشت دیکھا جو نماز پڑھے جانے سے پہلے ذبح کردیے گئے تھے ، اس پر آپ صلی اللہ علیہ وسلم نے فرمایا : : جس شخص نے نماز پڑھنے سے ۔ یا ( فرمایا : ) ہمارے نماز پڑھنے سے ۔ پہلے اپناقربانی کا جانور ذبح کرلیا وہ اس کی جگہ دوسرا ذبح کرے اور جس نے ذبح نہیں کیا ، وہ اللہ کا نام لے کر ذبح کرے ۔ \"",
                "urduNarrator": "ہم سے احمد بن یونس نے بیان کیا، ہم سے زہیر نے بیان کیا، ہم سے اسود بن قیس نے بیان کیا اور ہم سے یحییٰ بن یحییٰ نے بیان کیا, ابوخثیمہ زہیر ( بن معاویہ ) نے اسود بن قیس سے حدیث بیان کی ، کہا : مجھے حضرت جندب بن سفیان ( بجلی ) رضی اللہ عنہ نے بیان کیا ، کہا",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا الْأَسْوَدُ بْنُ قَيْسٍ ح و حَدَّثَنَاه يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو خَيْثَمَةَ عَنْ الْأَسْوَدِ بْنِ قَيْسٍ حَدَّثَنِي جُنْدَبُ بْنُ سُفْيَانَ قَالَ شَهِدْتُ الْأَضْحَى مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يَعْدُ أَنْ صَلَّى وَفَرَغَ مِنْ صَلَاتِهِ سَلَّمَ فَإِذَا هُوَ يَرَى لَحْمَ أَضَاحِيَّ قَدْ ذُبِحَتْ قَبْلَ أَنْ يَفْرُغَ مِنْ صَلَاتِهِ فَقَالَ مَنْ كَانَ ذَبَحَ أُضْحِيَّتَهُ قَبْلَ أَنْ يُصَلِّيَ أَوْ نُصَلِّيَ فَلْيَذْبَحْ مَكَانَهَا أُخْرَى وَمَنْ كَانَ لَمْ يَذْبَحْ فَلْيَذْبَحْ بِاسْمِ اللَّهِ.",
                "headingArabic": "يُسَلِّمُ الرَّاكِبُ عَلَى الْمَاشِي وَالْقَلِيلُ عَلَى الْكَثِيرِ ‏‏",
                "headingUrdu": "جو سوار ہو وہ پیدل چلنے والے کو سلام کرے اور چھوٹا گروہ بڑے گروہ کو سلام کرے۔",
                "headingEnglish": "The One Who Is Riding Should Greet The One Who Is Walking, And The Smaller Group Should Greet The Larger Group",
                "chapterId": "36",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 136,
                    "chapterNumber": "36",
                    "chapterEnglish": "The Book of Sacrifices",
                    "chapterUrdu": "قربانی کے احکام و مسائل",
                    "chapterArabic": "كتاب الْأَضَاحِيِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12628,
                "hadithNumber": "5065",
                "englishNarrator": "Jundab bin Sufyan رضی اللہ عنہ reported:",
                "hadithEnglish": "I was with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) (on the occasion) of 'Id al-Adha. After he had completed the prayer with people, he found that the goats had been slaughtered, whereupon he said: He who slaughtered sacrificial animal before the prayer should slaughter a goat (again) in its stead and he who has not slaughtered he should slaughter it by reciting the name of Allah.",
                "hadithUrdu": "میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ عیدالاضحی میں شریک ہوا ، آپ صلی اللہ علیہ وسلم نے ابھی کچھ بھی نہ کیا تھا سوائے اس کے کہ آپ صلی اللہ علیہ وسلم نے ( عید کی ) نماز پڑھائی ۔ نماز سے فارغ ہوئے ، سلام پھیرا کہ اچانک آپ صلی اللہ علیہ وسلم نے قربانی کی بکری دیکھی کہ وہ نماز سے پہلے ذبح کی جا چکی ہے ۔ چنانچہ آپ صلی اللہ علیہ وسلم نے فرمایا کہ جس نے قربانی نمازعید سے پہلے کر لی تو اس قربانی کی جگہ دوسری قربانی کرے اور جس نے قربانی نہیں کی تو وہ اللہ کے نام کے ساتھ قربانی ذبح کر دے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, ابو احوص سلام بن سلیم نے اسود بن قیس سے ، انھوں نے حضرت جندب بن سفیان رضی اللہ عنہ سے روایت کی ، کہا : کہ",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو الْأَحْوَصِ سَلَّامُ بْنُ سُلَيْمٍ عَنْ الْأَسْوَدِ بْنِ قَيْسٍ عَنْ جُنْدَبِ بْنِ سُفْيَانَ قَالَ شَهِدْتُ الْأَضْحَى مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا قَضَى صَلَاتَهُ بِالنَّاسِ نَظَرَ إِلَى غَنَمٍ قَدْ ذُبِحَتْ فَقَالَ مَنْ ذَبَحَ قَبْلَ الصَّلَاةِ فَلْيَذْبَحْ شَاةً مَكَانَهَا وَمَنْ لَمْ يَكُنْ ذَبَحَ فَلْيَذْبَحْ عَلَى اسْمِ اللَّهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "36",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 136,
                    "chapterNumber": "36",
                    "chapterEnglish": "The Book of Sacrifices",
                    "chapterUrdu": "قربانی کے احکام و مسائل",
                    "chapterArabic": "كتاب الْأَضَاحِيِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12629,
                "hadithNumber": "5066",
                "englishNarrator": "It was narrated from Al-Aswad bin Qais with this chain of narrator, and he said:",
                "hadithEnglish": "\"In the name of Allah, \"like the hadith of Abul Ahwas.",
                "hadithUrdu": "\" اللہ کے نام پر ( ذبح کرے ) \" جس طرح ابو احوص کی حدیث ہے ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, ابو عوانہ اور ابن عینیہ نے اسود بن قیس سے اسی سند کے ساتھ روایت کی اور دونوں نے کہا",
                "hadithArabic": "و حَدَّثَنَاه قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو عَوَانَةَ ح و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَابْنُ أَبِي عُمَرَ عَنْ ابْنِ عُيَيْنَةَ كِلَاهُمَا عَنْ الْأَسْوَدِ بْنِ قَيْسٍ بِهَذَا الْإِسْنَادِ وَقَالَا عَلَى اسْمِ اللَّهِ كَحَدِيثِ أَبِي الْأَحْوَصِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "36",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 136,
                    "chapterNumber": "36",
                    "chapterEnglish": "The Book of Sacrifices",
                    "chapterUrdu": "قربانی کے احکام و مسائل",
                    "chapterArabic": "كتاب الْأَضَاحِيِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12630,
                "hadithNumber": "5067",
                "englishNarrator": "Jundab al-Bajali رضی اللہ عنہ reported:",
                "hadithEnglish": "I saw Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) observing ('Id) prayer on the Day of Sacrifice (10th of Dhu'l-Hijja) and then delivering a sermon and he said: He who sacrificed the (animal) before offering ('Id) prayer, he should offer again in its stead, and he who did not sacrifice the animal should slaughter it by reciting the name of Allah.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو عید الاضحیٰ کے دن دیکھا ، آپ صلی اللہ علیہ وسلم نے نماز پڑھی ، پھر خطبہ د یا اور فرمایا : \" جس نے نماز پڑھنے سے پہلے ( اپنی قربانی کا جانور ) ذبح کردیا تھا ، وہ اس کی جگہ دوسرا ذبح کرے اور جس نے ذبح نہیں کیا وہ اللہ کے نام کے ساتھ ذبح کرے ۔ \"",
                "urduNarrator": "عبیداللہ کے والد معاذ نے کہا : ہمیں شعبہ نے اسود بن قیس سے حدیث بیا ن کی ، انھوں نے جندب بجلی رضی اللہ عنہ سے سنا ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ الْأَسْوَدِ سَمِعَ جُنْدَبًا الْبَجَلِيَّ قَالَ شَهِدْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى يَوْمَ أَضْحًى ثُمَّ خَطَبَ فَقَالَ مَنْ كَانَ ذَبَحَ قَبْلَ أَنْ يُصَلِّيَ فَلْيُعِدْ مَكَانَهَا وَمَنْ لَمْ يَكُنْ ذَبَحَ فَلْيَذْبَحْ بِاسْمِ اللَّهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "36",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 136,
                    "chapterNumber": "36",
                    "chapterEnglish": "The Book of Sacrifices",
                    "chapterUrdu": "قربانی کے احکام و مسائل",
                    "chapterArabic": "كتاب الْأَضَاحِيِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12631,
                "hadithNumber": "5068",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Shu'ba through another chain of transmitters.",
                "hadithUrdu": "ہم سے محمد بن مثنیٰ اور ابن بشار نے بیان کیا، کہا: محمد بن جعفر نے کہا : ہمیں شعبہ نے اسی سند کے ساتھ اسی کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "36",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 136,
                    "chapterNumber": "36",
                    "chapterEnglish": "The Book of Sacrifices",
                    "chapterUrdu": "قربانی کے احکام و مسائل",
                    "chapterArabic": "كتاب الْأَضَاحِيِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12632,
                "hadithNumber": "5069",
                "englishNarrator": "Al-Bara' رضی اللہ عنہ reported:",
                "hadithEnglish": "My maternal uncle Abu Burda رضی اللہ عنہ sacrificed his animal before ('Id) prayer. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: That is a goat (slaughtered for the sake of) flesh (and not as a sacrifice on the day of Adha). He said: I have a lamb of six months. Thereupon he said: Offer it as a sacrifice, but it will not justify for anyone except you, and then said: He who sacrificed (the animal) before ('Id) prayer, he in fact slaughtered it for his own self, and he who slaughtered after prayer, his ritual of sacrifice became complete and he in fact observed the religious practice of the Muslims.",
                "hadithUrdu": "میرے ماموں حضرت ابو بردہ رضی اللہ عنہ نے نماز سے پہلے قربانی کردی ، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" یہ گوشت کی ایک ( عام ) بکری ہے ( قربانی کی نہیں ۔ ) \" انھوں ( حضرت ابو بردہ رضی اللہ عنہ ) نے عرض کی : اللہ کے رسول صلی اللہ علیہ وسلم ! میرے پاس بکری کا ایک چھ ماہ کا بچہ ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" تم اس کی قربانی کردو اور یہ تمہارے سوا کسی اور کے لئے جائز نہیں ہے ۔ \" پھر آپ صلی اللہ علیہ وسلم نے فرمایا : \" جس شخص نے نماز سے پہلے ذبح کیا اس نے اپنے ( کھانے کے ) لئے ذبح کیا ہے اور جس نے نماز کے بعد ذبح کیا تو اس کی قر بانی مکمل ہوگئی اوراس نے مسلمانوں کے طریقے کو پا لیا ہے ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا ہم سے خالد بن عبداللہ نے بیان کیا, مطرف نے عامر ( شعبی ) سے ، انھوں نے حضرت براء رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ عَنْ مُطَرِّفٍ عَنْ عَامِرٍ عَنْ الْبَرَاءِ قَالَ ضَحَّى خَالِي أَبُو بُرْدَةَ قَبْلَ الصَّلَاةِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تِلْكَ شَاةُ لَحْمٍ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ عِنْدِي جَذَعَةً مِنْ الْمَعْزِ فَقَالَ ضَحِّ بِهَا وَلَا تَصْلُحُ لِغَيْرِكَ ثُمَّ قَالَ مَنْ ضَحَّى قَبْلَ الصَّلَاةِ فَإِنَّمَا ذَبَحَ لِنَفْسِهِ وَمَنْ ذَبَحَ بَعْدَ الصَّلَاةِ فَقَدْ تَمَّ نُسُكُهُ وَأَصَابَ سُنَّةَ الْمُسْلِمِينَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "36",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 136,
                    "chapterNumber": "36",
                    "chapterEnglish": "The Book of Sacrifices",
                    "chapterUrdu": "قربانی کے احکام و مسائل",
                    "chapterArabic": "كتاب الْأَضَاحِيِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12633,
                "hadithNumber": "5070",
                "englishNarrator": "Al-Bara' bin 'Azib رضی اللہ عنہ reported:",
                "hadithEnglish": "His maternal 'uncle Abu Burda bin Niyar رضی اللہ عنہ sacrificed his animal earlier than the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had sacrificed. Thereupon he said: Apostle of Allah, it is the day of meat and it is not desirable (to have longing for it and not to make use of it immediately), so I hastened in offering my animal as a sacrifice, so that I might feed my family and neighbours and my kith and kin. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Offer again your sacrifice. He said: Messenger of Allah, I have a small milk goat of less than one year, and that is better than two dry goats (from which only) meat (can be acquired). Thereupon he said: That is better than the two animals of sacrifice on your behalf, and the sacrifice of a goat, of less than six months shall not be accepted as a sacrifice on behalf of anyone after your (sacrifice).",
                "hadithUrdu": "ان کے ماموں حضرت ابو بردہ بن نیار رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم کے ذبح کرنے سے پہلے قربانی کا جانور ذبح کردیا اور کہنے لگے : اللہ کے رسول صلی اللہ علیہ وسلم ! یہ وہ دن ہے جس میں گوشت سے دل بھر جاتاہے ۔ ( اور اس کی چاہت باقی نہیں ر ہتی ) اور میں نے اپنے بچوں ، ہمسایوں اور گھروالوں ( کو کھلانے ) کےلیے قربانی کا جانور جلدی ذبح کردیاہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کوئی اور ( جانور ) ذبح کرو ۔ \" انھوں نےکہا : اللہ کے رسول صلی اللہ علیہ وسلم میرے پاس ایک سالہ دودھ پیتی ( کھیری ) بکری ہے ۔ وہ گوشت والی دو بکریوں سے بہتر ہے ۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا : \" یہ تمہاری بہترین قربانی ہے ( تم اسی کی قربانی کرلو ) اور تمہارے بعد کسی کی طرف سے بھی ایک سالہ بکری کی قربانی کافی نہیں ہوگی ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا, ہشیم نے داود سے ، انھوں نے ( عامر ) شعبی سے ، انھوں نے حضرت براء بن عازب رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا هُشَيْمٌ عَنْ دَاوُدَ عَنْ الشَّعْبِيِّ عَنْ الْبَرَاءِ بْنِ عَازِبٍ أَنَّ خَالَهُ أَبَا بُرْدَةَ بْنَ نِيَارٍ ذَبَحَ قَبْلَ أَنْ يَذْبَحَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ هَذَا يَوْمٌ اللَّحْمُ فِيهِ مَكْرُوهٌ وَإِنِّي عَجَّلْتُ نَسِيكَتِي لِأُطْعِمَ أَهْلِي وَجِيرَانِي وَأَهْلَ دَارِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعِدْ نُسُكًا فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ عِنْدِي عَنَاقَ لَبَنٍ هِيَ خَيْرٌ مِنْ شَاتَيْ لَحْمٍ فَقَالَ هِيَ خَيْرُ نَسِيكَتَيْكَ وَلَا تَجْزِي جَذَعَةٌ عَنْ أَحَدٍ بَعْدَكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "36",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 136,
                    "chapterNumber": "36",
                    "chapterEnglish": "The Book of Sacrifices",
                    "chapterUrdu": "قربانی کے احکام و مسائل",
                    "chapterArabic": "كتاب الْأَضَاحِيِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12634,
                "hadithNumber": "5071",
                "englishNarrator": "Al-Bara' bin 'Azib رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) delivered an address on the day (of Nahr) in which he said: None of you should offer sacrifice of animals until he has completed the ('Id) prayer. Thereupon my maternal uncle said: Messenger of Allah, it is the day of meat, so it is not desirable (to keep my family in the state of longing). The rest of the hadith is the same.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے قربانی کے دن ہمیں خطبہ دیا اور فرما یا : \" کو ئی شخص بھی نماسز سے پہلے ہر گز ( قربانی کا جا نور ) ذبح نہ کرے ۔ \" تو میرے ماموں نے کہا : اللہ کے رسول صلی اللہ علیہ وسلم !یہ ایسا دن ہے جس میں گوشت سے دل بھر جا تا ہے ۔ پھر ہشیم کی حدیث کے مانند بیان کیا ۔",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا, ابن ابی عدی داؤد سے ، انھوں نے ( عامر ) شعبی سے اور انھوں نے حضرت ابراء بن عازب رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ دَاوُدَ عَنْ الشَّعْبِيِّ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَ خَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ النَّحْرِ فَقَالَ لَا يَذْبَحَنَّ أَحَدٌ حَتَّى يُصَلِّيَ قَالَ فَقَالَ خَالِي يَا رَسُولَ اللَّهِ إِنَّ هَذَا يَوْمٌ اللَّحْمُ فِيهِ مَكْرُوهٌ ثُمَّ ذَكَرَ بِمَعْنَى حَدِيثِ هُشَيْمٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "36",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 136,
                    "chapterNumber": "36",
                    "chapterEnglish": "The Book of Sacrifices",
                    "chapterUrdu": "قربانی کے احکام و مسائل",
                    "chapterArabic": "كتاب الْأَضَاحِيِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12635,
                "hadithNumber": "5072",
                "englishNarrator": "Al-Bara' رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) having said: He who observes prayer like our prayer and turns his face towards our Qibla (in prayer) and who offers sacrifices (of animals) as we do, he must not slaughter the (animal as a sacrifice) until he has completed the prayer. Thereupon my maternal uncle said: Messenger of Allah, I have sacrificed the animal on behalf of my son. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: This is the thing in which you have made haste for your family. He said: I have a goat with me better than two goats. Thereupon he said: Sacrifice it for that is the best.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" جو ہماری طرح نماز پڑھے اور ہمارے قبلے کی طرف منہ کرے اور ہماری قربانی کرے ، وہ نماز پڑھنے سے پہلے ذبح نہ کرے ۔ \" میرے ماموں نے کہا : یا رسول اللہ صلی اللہ علیہ وسلم ! میں اپنے ایک بیٹے کی طرف سے قربانی کر چکا ہوں ۔ آپ نے فر ما یا : \" یہ وہ ذبیحہ ) ہے جسے تم نے اپنے گھر والوں ( کو کھلا نے ) کے لیے جلد ذبح کر لیا ۔ \" انھوں نے کہا : میرے پاس ایک بکری ہے جو بکریوں سے بہتر ہے آپ نے فر ما یا : \" تم اس کی قربانی کر دو وہ بہترین قربانی ہے ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے عبداللہ بن نمیر ایچ نے بیان کیا، ہم سے ابن نمیر نے بیان کیا، ہم سے ابی نے بیان کیا، ہم سے زکریا نے بیان کیا, فراس نے عامر سے ، انھوں نے حضرت براء رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا زَكَرِيَّاءُ عَنْ فِرَاسٍ عَنْ عَامِرٍ عَنْ الْبَرَاءِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَلَّى صَلَاتَنَا وَوَجَّهَ قِبْلَتَنَا وَنَسَكَ نُسُكَنَا فَلَا يَذْبَحْ حَتَّى يُصَلِّيَ فَقَالَ خَالِي يَا رَسُولَ اللَّهِ قَدْ نَسَكْتُ عَنْ ابْنٍ لِي فَقَالَ ذَاكَ شَيْءٌ عَجَّلْتَهُ لِأَهْلِكَ فَقَالَ إِنَّ عِنْدِي شَاةً خَيْرٌ مِنْ شَاتَيْنِ قَالَ ضَحِّ بِهَا فَإِنَّهَا خَيْرُ نَسِيكَةٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "36",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 136,
                    "chapterNumber": "36",
                    "chapterEnglish": "The Book of Sacrifices",
                    "chapterUrdu": "قربانی کے احکام و مسائل",
                    "chapterArabic": "كتاب الْأَضَاحِيِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12636,
                "hadithNumber": "5073",
                "englishNarrator": "Al-Bara' bin 'Azib رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) having said: The first (act) with which we started our day (the day of 'Id-ul Adha) was that we offered prayer. We then returned and sacrificed the animals and he who did that in fact adhered to our Sunnah (practice). And he who slaughtered the (animal on that day before the 'Id prayer), for him (the slaughtering of animal was directed to the acquiring of) meat for his family, and there is nothing of the sort of sacrifice in it. It was Abu Burda bin Dinar رضی اللہ عنہ who had slaughtered (the animal before the 'Id prayer). He said: I have a small lamb, of less than one year, but better than that of more than a year. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Sacrifice it, but it will not suffice (as a sacrifice) for anyone after you.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" آج کے دن ہم جس کا م سے آغاز کریں گے ( وہ یہ ہے ) کہ ہم نماز پڑھیں گے ، پھر لوٹیں گے ، اور قربانی کریں گے ۔ جس نے ایسا کیا ، اس نے ہمارا طریقہ پالیا اور جس نے ( پہلے ) ذبح کر لیا تو وہ گو شت ہے جو اس نے اپنے گھر والوں کو پیش کیا ہے ۔ وہ کسی طرح بھی قربانی نہیں ہے ۔ \" حضرت ابو بردہ بن دینار رضی اللہ عنہ ( اس سے پہلے ) ذبح کر چکے تھے انھوں نے کہا : میرے پاس بکری کا ایک سالہ بچہ ہے جو دودانتی بکری دودانتا بکرے سے بہتر ہے ۔ تو آپ صلی اللہ علیہ وسلم نے فر ما یا : تم اس کو ذبح کردو ، اور تمھا رے بعد یہ کسی کی طرف سے کا فی نہ ہو گی ۔",
                "urduNarrator": "ہم سے محمد بن المثنی اور ابن بشار نے بیان کیا اور یہ قول ابن المثنیٰ نے کہا, محمد بن جعفر نے کہا : ہمیں شعبہ نے زبید یا می سے حدیث بیان کی ، انھوں نے حضرت براء بن عازب رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ وَاللَّفْظُ لِابْنِ الْمُثَنَّى قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ زُبَيْدٍ الْإِيَامِيِّ عَنْ الشَّعْبِيِّ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَوَّلَ مَا نَبْدَأُ بِهِ فِي يَوْمِنَا هَذَا نُصَلِّي ثُمَّ نَرْجِعُ فَنَنْحَرُ فَمَنْ فَعَلَ ذَلِكَ فَقَدْ أَصَابَ سُنَّتَنَا وَمَنْ ذَبَحَ فَإِنَّمَا هُوَ لَحْمٌ قَدَّمَهُ لِأَهْلِهِ لَيْسَ مِنْ النُّسُكِ فِي شَيْءٍ وَكَانَ أَبُو بُرْدَةَ بْنُ نِيَارٍ قَدْ ذَبَحَ فَقَالَ عِنْدِي جَذَعَةٌ خَيْرٌ مِنْ مُسِنَّةٍ فَقَالَ اذْبَحْهَا وَلَنْ تَجْزِيَ عَنْ أَحَدٍ بَعْدَكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "36",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 136,
                    "chapterNumber": "36",
                    "chapterEnglish": "The Book of Sacrifices",
                    "chapterUrdu": "قربانی کے احکام و مسائل",
                    "chapterArabic": "كتاب الْأَضَاحِيِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12637,
                "hadithNumber": "5074",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been narrated on the authority of al-Bara' bin 'Azib رضی اللہ عنہ through another chain of transmitters.",
                "hadithUrdu": "عبید اللہ کے والد معاذ نے کہا : ہمیں شعبہ نے زبید سے حدیث بیان کی ، انھوں نے شعبی سے سنا ، انھوں نے حضرت براءعازب رضی اللہ عنہ سے اور انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ زُبَيْدٍ سَمِعَ الشَّعْبِيَّ عَنْ الْبَرَاءِ بْنِ عَازِبٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بمِثْلِهُ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "36",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 136,
                    "chapterNumber": "36",
                    "chapterEnglish": "The Book of Sacrifices",
                    "chapterUrdu": "قربانی کے احکام و مسائل",
                    "chapterArabic": "كتاب الْأَضَاحِيِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12638,
                "hadithNumber": "5075",
                "englishNarrator": "Al-Bara' bin 'Azib رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) addressed us on the day of Nahr after the ('Id) prayer. The rest of the hadith is the same.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے قربانی کے دن کے بعد ہمیں خطبہ دیا ، پھر ان سب کی حدیث کی طرح بیان کیا ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید اور ہناد بن الساری نے بیان کیا، کہا کہ ہم سے ابو الاحواس نے بیان کیا، اور ہم سے عثمان بن ابی شیبہ اور اسحاق بن ابراہیم نے بیان کیا۔ تمام جریر کے اختیار پر،  منصور نے شعبی سے ، انھوں نے حضرت برا ء بن عازب رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَهَنَّادُ بْنُ السَّرِيِّ قَالَا حَدَّثَنَا أَبُو الْأَحْوَصِ ح و حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ جَمِيعًا عَنْ جَرِيرٍ كِلَاهُمَا عَنْ مَنْصُورٍ عَنْ الشَّعْبِيِّ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَ خَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ النَّحْرِ بَعْدَ الصَّلَاةِ ثُمَّ ذَكَرَ نَحْوَ حَدِيثِهِمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "36",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 136,
                    "chapterNumber": "36",
                    "chapterEnglish": "The Book of Sacrifices",
                    "chapterUrdu": "قربانی کے احکام و مسائل",
                    "chapterArabic": "كتاب الْأَضَاحِيِّ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 12326,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=493",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=491",
                "label": "491",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=492",
                "label": "492",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=493",
                "label": "493",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=494",
                "label": "494",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=495",
                "label": "495",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=496",
                "label": "496",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=497",
                "label": "497",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=495",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=495",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=493",
        "to": 12350,
        "total": 40465
    }
}