{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 478,
        "data": [
            {
                "id": 12214,
                "hadithNumber": "4650",
                "englishNarrator": "It has been narrated by Abdullah (bin Mas'ud) رضی اللہ عنہ who said:",
                "hadithEnglish": "When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was lying postrate in prayer and around him were some people from the Quraish, 'Uqba bin Abu Mu'ait brought the foetus of a she-camel and threw it on the back of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). He did not raise his head until Fatima رضی اللہ عنہا arrived, removed it from his back and cured him who had done that (ugly act). He said: O Allah, it is for Thee to deal with the chiefs of the Quraish. Abu Jahl bin Hisham, 'Utba bin Rabi'a. Uqba bin Abu Mu'ait, Shaiba bin Rabi'a, Umayya bin Khalaf or Ubayy bin Khalaf (Shu'ba, one of the narrator of this tradition is in doubt about the exact person). I saw that all were slain in the Battle of Badr and their dead bodies were thrown into a well, except that of Umayya or Ubayy which was cut into pieces and was thrown into the well.",
                "hadithUrdu": "( ایک بار ) جب رسول اللہ صلی اللہ علیہ وسلم سجدے میں تھے اور آپ کے گرد قریش کے لوگ بیٹھے ہوئے تھے کہ عقبہ بن ابی معیط ایک ذبح کی ہوئی اونٹنی کی بچے والی جھلی لے کر آیا اور اس کو رسول اللہ صلی اللہ علیہ وسلم کی پشت پر پھینک دیا ، آپ صلی اللہ علیہ وسلم نے ( سجدے سے ) سر نہ اٹھایا ، پھر سیدہ فاطمہ رضی اللہ عنہا آئیں اور اس جھلی کو آپ کی پشت سے اٹھایا اور جن لوگوں نے یہ حرکت کی تھی ان کو بددعا دی ، رسول اللہ صلی اللہ علیہ وسلم نے ( ان کے بارے میں ) فرمایا : \" اے اللہ! قریش کے اس گروہ پر گرفت فرما ، ابوجہل بن ہشام ، عتبہ بن ربیعہ ، شیبہ بن ربیعہ ، عقبہ بن ابی معیط اور امیہ بن خلف یا اُبی بن خلف ۔ ۔ شعبہ کو شک ہے ۔ ۔ پر گرفت فرما! \" ( حضرت ابن مسعود رضی اللہ عنہ نے ) کہا : میں نے ان کو دیکھا ، وہ جنگ بدر کے دن قتل کیے گئے اور ان کو کنویں میں ڈال دیا گیا ، البتہ امیہ بن خلف یا اُبی بن خلف کے جوڑ جوڑ کٹ چکے تھے ، اسے ( گھسیٹ کر ) کنویں میں نہیں ڈالا جا سکا.",
                "urduNarrator": "ہم سے محمد بن مثنیٰ اور محمد بن بشار نے بیان کیا، اور یہ قول ابن المثنیٰ کا ہے، انہوں نے کہا: ہم سے محمد بن جعفر نے بیان کیا، شعبہ نے کہا : میں نے ابو اسحاق سے سنا ، وہ عمرو بن میمون سے حدیث بیان کر رہے تھے ، انہوں نے حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، وَاللَّفْظُ لِابْنِ الْمُثَنَّى، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ: سَمِعْتُ أَبَا إِسْحَاقَ، يُحَدِّثُ عَنْ عَمْرِو بْنِ مَيْمُونٍ، عَنْ عَبْدِ اللهِ، قَالَ: بَيْنَمَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ سَاجِدٌ وَحَوْلَهُ نَاسٌ مِنْ قُرَيْشٍ، إِذْ جَاءَ عُقْبَةُ بْنُ أَبِي مُعَيْطٍ بِسَلَا جَزُورٍ، فَقَذَفَهُ عَلَى ظَهْرِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَلَمْ يَرْفَعْ رَأْسَهُ، فَجَاءَتْ فَاطِمَةُ فَأَخَذَتْهُ عَنْ ظَهْرِهِ، وَدَعَتْ عَلَى مَنْ صَنَعَ ذَلِكَ، فَقَالَ: اللهُمَّ، عَلَيْكَ الْمَلَأَ مِنْ قُرَيْشٍ: أَبَا جَهْلِ بْنَ هِشَامٍ، وَعُتْبَةَ بْنَ رَبِيعَةَ، وَعُقْبَةَ بْنَ أَبِي مُعَيْطٍ، وَشَيْبَةَ بْنَ رَبِيعَةَ، وَأُمَيَّةَ بْنَ خَلَفٍ - أَوْ أُبَيَّ بْنَ خَلَفٍ شُعْبَةُ الشَّاكُّ - ، قَالَ: فَلَقَدْ رَأَيْتُهُمْ قُتِلُوا يَوْمَ بَدْرٍ، فَأُلْقُوا فِي بِئْرٍ، غَيْرَ أَنَّ أُمَيَّةَ - أَوْ أُبَيًّا - تَقَطَّعَتْ أَوْصَالُهُ فَلَمْ يُلْقَ فِي الْبِئْرِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12215,
                "hadithNumber": "4651",
                "englishNarrator": "Abu Ishaq has narrated a similar tradition through a different chain of transmitters and has added:",
                "hadithEnglish": "He (the Messenger of Allah) loved to repeat the supplication thrice. He was saying: O Allah, it is for Thee to deal with the Quraish (repeating these words thrice). And among the Quraish, he mentioned (the names of) al-Walid bin 'Utba and Umayya bin Khalaf. (The narrator says there is no doubt about the names of these persons but he has forgotten the name of the seventh man).",
                "hadithUrdu": "آپ تین بار ( دعا کرنا ) پسند فرماتے تھے ، اور آپ نے تین بار فرمایا : \" اے اللہ! قریش پر گرفت فرما ، اے اللہ! قریش پر گرف فرما ، اے اللہ! قریش پر گرفت فرمااور اس میں ولید بن عتبہ اور امیہ بن خلف کا نام لیا ( ابی بن خلف اور امیہ بن خلف کے ناموں میں ) شک نہیں کیا ، ابواسحاق نے کہا : ساتواں شخص میں بھول گیا.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے جعفر بن عون نے بیان کیا, سفیان نے ابواسحاق سے اسی سند کے ساتھ اسی طرح روایت کی اور اس میں یہ اضافہ کیا کہ",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ أَبِي إِسْحَاقَ، بِهَذَا الْإِسْنَادِ نَحْوَهُ، وَزَادَ وَكَانَ يَسْتَحِبُّ ثَلَاثًا يَقُولُ: «اللهُمَّ، عَلَيْكَ بِقُرَيْشٍ، اللهُمَّ، عَلَيْكَ بِقُرَيْشٍ، اللهُمَّ، عَلَيْكَ بِقُرَيْشٍ» ثَلَاثًا، وَذَكَرَ فِيهِمُ الْوَلِيدَ بْنَ عُتْبَةَ، وَأُمَيَّةَ بْنَ خَلَفٍ، وَلَمْ يَشُكَّ، قَالَ أَبُو إِسْحَاقَ: وَنَسِيتُ السَّابِعَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12216,
                "hadithNumber": "4652",
                "englishNarrator": "It has been narrated on the authority of 'Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) turned his face towards the Ka'ba and invoked God's imprecations upon six men of the Quraish, amorig whom were Abu Jahl. Umayya bin Khalaf, Utba bin Rabi'a, Shaiba bin Rabi'a and 'Uqba bin Abu Mu'ait I swear by God that I saw them lying slain in the battlefield of Badr. It being a hot day, their complexion had changed (showing signs of decay).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے بیت اللہ کی طرف منہ کر کے قریش کے چھ آدمیوں کے خلاف بد دعا کی ، ان میں ابوجہل ، امیہ بھی خلف ، عتبہ بن ربیعہ ، شیبہ بن ربیعہ اور عقبہ بن ابی معیط تھے ۔ میں اللہ کی قسم کھا کر کہتا ہوں : میں نے ان کو بدر ( کے میدان ) میں اوندھے پڑے ہوئے دیکھا ، دھوپ نے ان ( کے لاشوں ) کو متغیر کر دیا تھا اور وہ ایک گرم دن تھا.",
                "urduNarrator": "مجھ سے سلمہ بن شبیب نے بیان کیا، کہا ہم سے حسن بن ا عین نے بیان کیا, زہیر نے ہمیں حدیث بیان کی ، کہا : ہمیں ابواسحاق نے عمرو بن میمون سے ، انہوں نے حضرت عبداللہ بن مسعود رضی اللہ عنہ سے حدیث بیان کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو إِسْحَاقَ، عَنْ عَمْرِو بْنِ مَيْمُونٍ، عَنْ عَبْدِ اللهِ، قَالَ: «اسْتَقْبَلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الْبَيْتَ، فَدَعَا عَلَى سِتَّةِ نَفَرٍ مِنْ قُرَيْشٍ، فِيهِمْ أَبُو جَهْلٍ، وَأُمَيَّةُ بْنُ خَلَفٍ، وَعُتْبَةُ بْنُ رَبِيعَةَ، وَشَيْبَةُ بْنُ رَبِيعَةَ، وَعُقْبَةُ بْنُ أَبِي مُعَيْطٍ»، فَأُقْسِمُ بِاللهِ لَقَدْ رَأَيْتُهُمْ صَرْعَى عَلَى بَدْرٍ، قَدْ غَيَّرَتْهُمُ الشَّمْسُ وَكَانَ يَوْمًا حَارًّا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12217,
                "hadithNumber": "4653",
                "englishNarrator": "It has been narrated on the authority of `A'isha رضی اللہ عنہا, the wife of the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ):",
                "hadithEnglish": "Who said to the Messenger of Allah (ﷺ): Messenger of Allah ﷺ, has there come upon you a day more terrible than the day of Uhud. He said: I have experienced from thy people and the hardest treatment I met from them was what I received from them on the day of `Aqaba. I betook myself to Ibn `Abd Yalil b. `Abd Kulal with the purpose of inviting him to Islam, but he did not respond to me as I desired. So I departed with signs of (deep) distress on my face. I did not recover until I reached Qarn al-Tha`alib. Where I raised my head, lo! near me was a cloud which had cast its shadow on me. I looked and lo! there was in it the angel Jibril who called out to me and said: God, the Honored and Glorious, has heard what thy people have said to thee, and how they have reacted to thy call. And He has sent to thee the angel in charge of the mountains so that thou mayest order him what thou wishest (him to do) with regard to them. The angel in charge of the mountains (then) called out to me, greeted me and said: Muhammad, God has listened to what thy people have said to thee. I am the angel in charge of the mountains, and thy Lord has sent me to thee so that thou mayest order me what thou wishest. If thou wishest that I should bring together the two mountains that stand opposite to each other at the extremities of Mecca to crush them in between, (I would do that). But the Messenger of Allah (may peace he upon him) said to him: I rather hope that God will produce from their descendants such persons as will worship Allah, the One, and will not ascribe partners to Him.",
                "hadithUrdu": "انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے عرض کی : اے اللہ کے رسول! کیا آپ پر کوئی ایسا دن بھی آیا جو اُھد کے دن سے زیادہ شدید ہو؟ آپ نے فرمایا : \" مجھے تمہاری قوم سے بہت تکلیف پہنچی ، جب میں خود کو ابن عبد یالیل بن عبد کلال کے سامنے لے گیا ( یعنی اس کو دعوتِ اسلام دی ) لیکن جو میں چاہتا تھا اس نے میری بات نہ مانی ، میں غمزدہ ہو کر چل پڑا اور قرن ثعالب پر پہنچ کر ہی میری حالت بہتر ہوئی ، میں نے سر اٹھایا تو مجھے ایک بادل نظر آیا ، اس نے مجھ پر سایہ کیا ہوا تھا ، میں نے دیکھا تو اس میں جبرائیل علیہ السلام تھے ، انہوں نے مجھے آواز دے کر کہا : اللہ عزوجل نے جو کچھ آپ نے اپنی قوم سے کہا وہ اور انہوں نے جو آپ کو جواب دیا وہ سب سن لیا ، اللہ تعالیٰ نے پہاڑوں کا فرشتہ آپ کی طرف بھیجا ہے تاکہ آپ ان کفار کے متعلق اس کو جو چاہیں حکم دیں ۔ \" آپ صلی اللہ علیہ وسلم نے فرمایا : \" پھر مجھے پہاڑوں کے فرشتے نے آواز دی اور سلام کیا ، پھر کہا : اے محمد! اللہ تعالیٰ نے آپ کی قوم کی طرف سے آپ کو دیا گیا جواب سن لیا ، میں پہاڑوں کا فرشتہ ہوں اور مجھے آپ کے رب نے آپ کے پاس بھیجا ہے کہ آپ مجھے جو چاہیں حکم دیں ، اگر آپ چاہیں تو میں ان دونوں سنگلاخ پہاڑوں کو ا ( ٹھا کر ) ان کے اوپر رکھ دوں ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے اس سے فرمایا : بلکہ میں یہ امید کرتا ہوں کہ اللہ تعالیٰ ان کی پشتوں سے ایسے لوگ نکالے گا جو صرف اللہ کی عبادت کریں گے اور اس کے ساتھ کسی کو شریک نہیں ٹھہرائیں گے.",
                "urduNarrator": "مجھ سے ابو الطاہر احمد بن عمرو بن سرح، حرملہ بن یحییٰ اور عمرو بن سواد العامری نے بیان کیا اور ان کا قول بھی اسی طرح ہے۔ انہوں نے کہا: ہم سے ابن وہب نے بیان کیا، انہوں نے کہا: مجھ سے یونس نے بیان کیا، ابن شہاب کی سند سے عروہ بن زبیر نے بیان کیا, نبی صلی اللہ علیہ وسلم کی اہلیہ محترمہ حضرت عائشہ رضی اللہ عنہا نے حدیث بیان کی کہ",
                "hadithArabic": "وحَدَّثَنِي أَبُو الطَّاهِرِ أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ، وَحَرْمَلَةُ بْنُ يَحْيَى، وَعَمْرُو بْنُ سَوَّادٍ الْعَامِرِيُّ، وَأَلْفَاظُهُمْ مُتَقَارِبَةٌ، قَالُوا: حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ: أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حَدَّثَتْهُ، أَنَّهَا قَالَتْ لِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: يَا رَسُولَ اللهِ، هَلْ أَتَى عَلَيْكَ يَوْمٌ كَانَ أَشَدَّ مِنْ يَوْمِ أُحُدٍ؟ فَقَالَ: لَقَدْ لَقِيتُ مِنْ قَوْمِكِ وَكَانَ أَشَدَّ مَا لَقِيتُ مِنْهُمْ يَوْمَ الْعَقَبَةِ، إِذْ عَرَضْتُ نَفْسِي عَلَى ابْنِ عَبْدِ يَالِيلَ بْنِ عَبْدِ كُلَالٍ فَلَمْ يُجِبْنِي إِلَى مَا أَرَدْتُ، فَانْطَلَقْتُ وَأَنَا مَهْمُومٌ عَلَى وَجْهِي، فَلَمْ أَسْتَفِقْ إِلَّا بِقَرْنِ الثَّعَالِبِ، فَرَفَعْتُ رَأْسِي فَإِذَا أَنَا بِسَحَابَةٍ قَدْ أَظَلَّتْنِي فَنَظَرْتُ فَإِذَا فِيهَا جِبْرِيلُ، فَنَادَانِي، فَقَالَ: إِنَّ اللهَ عَزَّ وَجَلَّ قَدْ سَمِعَ قَوْلَ قَوْمِكَ لَكَ، وَمَا رُدُّوا عَلَيْكَ، وَقَدْ بَعَثَ إِلَيْكَ مَلَكَ الْجِبَالِ لِتَأْمُرَهُ بِمَا شِئْتَ فِيهِمْ ، قَالَ: فَنَادَانِي مَلَكُ الْجِبَالِ وَسَلَّمَ عَلَيَّ، ثُمَّ قَالَ: يَا مُحَمَّدُ، إِنَّ اللهَ قَدْ سَمِعَ قَوْلَ قَوْمِكَ لَكَ، وَأَنَا مَلَكُ الْجِبَالِ وَقَدْ بَعَثَنِي رَبُّكَ إِلَيْكَ لِتَأْمُرَنِي بِأَمْرِكَ، فَمَا شِئْتَ، إِنْ شِئْتَ أَنْ أُطْبِقَ عَلَيْهِمُ الْأَخْشَبَيْنِ ، فَقَالَ لَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «بَلْ أَرْجُو أَنْ يُخْرِجَ اللهُ مِنْ أَصْلَابِهِمْ مَنْ يَعْبُدُ اللهَ وَحْدَهُ لَا يُشْرِكُ بِهِ شَيْئًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12218,
                "hadithNumber": "4654",
                "englishNarrator": "It has been narrated on the authority of Jundub bin Sufyan رضی اللہ عنہ who said:",
                "hadithEnglish": "A finger of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was wounded in one of the encounters He said: Thou art just a little finger which has bled, and what thou hast experienced is in the cause of Allah.",
                "hadithUrdu": "ان جنگوں میں سے ایک میں رسول اللہ صلی اللہ علیہ وسلم کی انگلی خون آلود ہو گئی تو آپ نے فرمایا : \"\" تو ایک انگلی ہی ہے جو زخمی ہوئی اور تو نے جو تکلیف اٹھائی وہ اللہ کی راہ میں ہے.",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ اور قتیبہ بن سعید نے بیان کیا, ابوعوانہ نے اسود بن قیس سے ، انہوں نے حضرت جندب بن سفیان رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَقُتَيْبَةُ بْنُ سَعِيدٍ، كِلَاهُمَا، عَنْ أَبِي عَوَانَةَ، قَالَ يَحْيَى: أَخْبَرَنَا أَبُو عَوَانَةَ، عَنِ الْأَسْوَدِ بْنِ قَيْسٍ، عَنْ جُنْدُبِ بْنِ سُفْيَانَ، قَالَ: دَمِيَتْ إِصْبَعُ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي بَعْضِ تِلْكَ الْمَشَاهِدِ، فَقَالَ: «هَلْ أَنْتِ إِلَّا إِصْبَعٌ دَمِيتِ، وَفِي سَبِيلِ اللهِ مَا لَقِيتِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12219,
                "hadithNumber": "4655",
                "englishNarrator": "It has been narrated on the authority of Aswad bin Qais who said:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was in a cave (or raid) when his finger was hurt.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ایک لشکر میں تھے اور ( وہاں ) آپ کی انگلی زخمی ہو گئی.",
                "urduNarrator": "ابوبکر بن ابی شیبہ اور اسحاق بن ابراہیم نے ہم سے روایت کی ہے, ابن عیینہ نے اسود بن قیس سے اسی سند کے ساتھ روایت کی اور کہا",
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، عَنِ الْأَسْوَدِ بْنِ قَيْسٍ، بِهَذَا الْإِسْنَادِ، وَقَالَ: كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي غَارٍ فَنُكِبَتْ إِصْبَعُهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12220,
                "hadithNumber": "4656",
                "englishNarrator": "It has been narrated on the authority of Aswad bin Qais who heard Jundub رضی اللہ عنہ saying:",
                "hadithEnglish": "Gabriel delayed his visit to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) The polytheists began to say that Muhammad has been forsaken. At this Allah, the Glorious and Exalted, revealed: Wa'dd hd wa'l-laili iza saja, ma wadda'ka Rabbuka wa' ma qala [By the glorious morning light, and by the night when it is still: thy Lord has not forsaken thee, nor is He displeased].",
                "hadithUrdu": "ایک بار رسول اللہ صلی اللہ علیہ وسلم کے پاس جبرائیل علیہ السلام کی آمد میں تاخیر ہو گئی ، مشرکین کہنے لگے کہ محمد صلی اللہ علیہ وسلم کو الوداع کہہ دیا گیا ۔ تو اللہ عزوجل نے یہ نازل فرمایا : \" قسم ہے دھوپ چڑھتے وقت کی ، اور قسم ہے رات کی جب وہ چھا جائے! ( اے نبی! ) آپ نے رب نے نہ آپ کو رخصت کیا اور نہ بیزار ہوا.",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا, سفیان بن اسود بن قیس سے روایت کی کہ انہوں نے جندب رضی اللہ عنہ کو یہ کہتے ہوئے سنا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا سُفْيَانُ، عَنِ الْأَسْوَدِ بْنِ قَيْسٍ، أَنَّهُ سَمِعَ جُنْدُبًا، يَقُولُ: أَبْطَأَ جِبْرِيلُ عَلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ الْمُشْرِكُونَ: قَدْ وُدِّعَ مُحَمَّدٌ، فَأَنْزَلَ اللهُ عَزَّ وَجَلَّ: {وَالضُّحَى وَاللَّيْلِ إِذَا سَجَى مَا وَدَّعَكَ رَبُّكَ وَمَا قَلَى} [الضحى: 2].",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12221,
                "hadithNumber": "4657",
                "englishNarrator": "It has been narrated on the authority of Aswad bin Qais who said: I heard Jundub bin Sufyan رضی اللہ عنہ say:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) fell ill and did not wake up for two or three nights (for prayers) A woman came to him and said: Muhammad, I hope that your satan has left you. I haven't seen him approach you for two or three nights. The narrator says: At this, Allah, the Glorious and Exalted, revealed: By the Glorious......",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم بیمار ہو گئے اور دو یا تین راتیں اٹھ نہ سکے تو ایک عورت آپ کے پاس آئی اور کہنے لگی : اے محمد! مجھے لگتا ہے کہ آپ کے شیطان نے آپ کو چھوڑ دیا ہے ، میں نے دو یا تین راتوں سے اسے آپ کے قریب آتے نہیں دیکھا ۔ کہا : اس پر اللہ تعالیٰ نے یہ آیت نازل فرمائی : \" قسم ہے دھوپ چڑھتے وقت کی اور رات کی جب وہ چھا جائے! ( اے نبی! ) آپ کے رب نے نہ آپ کو رخصت کیا اور نہ وہ بیزار ہوا.",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم اور محمد بن رافع نے بیان کیا، اور ابن رافع نے کہا: انہوں نے ہمیں خبر دی، اور ابن رافع نے کہا: انہوں نے بیان کیا۔ یحییٰ بن آدم، زہیر نے اسود بن قیس سے حدیث بیان کی ، انہوں نے کہا : میں نے جندب بن سفیان رضی اللہ عنہ سے سنا ، کہہ رہے تھے",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ رَافِعٍ، وَاللَّفْظُ لِابْنِ رَافِعٍ، قَالَ إِسْحَاقُ: أَخْبَرَنَا، وقَالَ ابْنُ رَافِعٍ: حَدَّثَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا زُهَيْرٌ، عَنِ الْأَسْوَدِ بْنِ قَيْسٍ، قَالَ: سَمِعْتُ جُنْدُبَ بْنَ سُفْيَانَ، يَقُولُ: اشْتَكَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يَقُمْ لَيْلَتَيْنِ أَوْ ثَلَاثًا، فَجَاءَتْهُ امْرَأَةٌ، فَقَالَتْ: يَا مُحَمَّدُ، إِنِّي لَأَرْجُو أَنْ يَكُونَ شَيْطَانُكَ قَدْ تَرَكَكَ، لَمْ أَرَهُ قَرِبَكَ مُنْذُ لَيْلَتَيْنِ أَوْ ثَلَاثٍ ، قَالَ: فَأَنْزَلَ اللهُ عَزَّ وَجَلَّ: {وَالضُّحَى وَاللَّيْلِ إِذَا سَجَى مَا وَدَّعَكَ رَبُّكَ وَمَا قَلَى} [الضحى: 2].",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12222,
                "hadithNumber": "4658",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Aswad bin Qais with the same chain of transmitters.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ، محمد بن المثنیٰ اور ابن بشار نے بیان کیا، کہا: ہم سے محمد بن جعفر نے بیان کیا، شعبہ اور سفیان ( ثوری ) نے اسود بن قیس سے اسی سند کے ساتھ ان دونوں کی حدیث کی طرح بیان کی.",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنِ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالُوا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ شُعْبَةَ، ح وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا الْمُلَائِيُّ، حَدَّثَنَا سُفْيَانُ، كِلَاهُمَا عَنِ الْأَسْوَدِ بْنِ قَيْسٍ، بِهَذَا الْإِسْنَادِ نَحْوَ حَدِيثِهِمَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12223,
                "hadithNumber": "4659",
                "englishNarrator": "It has been narrated on the authority of Usama bin Zaid رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) rode a donkey. It had on it a saddle under which was a mattress made at Fadak (a place near Medina). Behind him he seated Usama. He was going to the street of Banu Harith al-Khazraj to inquire after the health of Sa'd bin Ubada  رضی اللہ عنہThis happened before the Battle of Badr. (He proceeded) until he passed by a mixed company of people in which were Muslims, polytheists, idol worshippers and the Jews and among them were 'Abdullah bin Ubayy and 'Abdullah bin Rawaha رضی اللہ عنہ. When the dust raised by the hoofs of the animal spread over the company, 'Abdullah bin Ubayy covered his nose with his mantle and said:\r\nDo not scatter the dust over us (Not minding this remark), the Prophet (ﷺ) greeted them, stopped, got down from his animal, invited them to Allah, and recited to them the Qur'an. 'Abdullah bin Ubayy said: O man, if what you say is the truth, the best thing for you would be not to bother us with it in our assemblies. Get back to your place. Whoso comes to you from us, tell him (all) this. Abdullah bin Rawaha رضی اللہ عنہ said: Come to us in our gatherings, for we love (to hear) it. The narrator says: (At this), the Muslims, the polytheists and the Jews began to rebuke one another until they were determined to come to blows. The Prophet (ﷺ) continued to pacify them. (When they were pacified), he rode his animal and came to Sa'd bin 'Ubida رضی اللہ عنہ . He said: Sa'd, haven't you heard what Abu Hubab (meaning 'Abdullah bin Ubayy) has said? He has said so and so. Sa'd رضی اللہ عنہ said: Messenger of Allah, forgive and pardon. God has granted you a sublime position, (but so far as he is concerned) the people of this settlement had-decided to make him their king by making him wear a crown and a turban (in token thereof), but God has circumvented this by the truth He has granted you. This has made him jealous and his jealousy (must have) prompted the behaviour that you have witnessed. So, the Prophet (may peace upon him) forgave him.",
                "hadithUrdu": "( ایک بار ) رسول اللہ صلی اللہ علیہ وسلم نے ایک گدھے پر سواری فرمائی ، اس پر پالان تھا اور اس کے نیچے فدک کی بنی ہوئی ایک چادر تھی ، آپ نے اسامہ ( بن زید رضی اللہ عنہ ) کو پیچھے بٹھایا ہوا تھا ، آپ قبیلہ بنو حارث بن خزرج میں حضرت سعد بن عبادہ رضی اللہ عنہ کی عیادت کرنا چاہتے تھے ۔ یہ جنگ بدر سے پہلے کا واقعہ ہے ، آپ راستے میں ایک مجلس سے گزرے جہاں مسلمان ، بت پرست اور مشرک اور یہودی ملے جلے موجود تھے ، ان میں عبداللہ بن اُبی بھی تھا اور مجلس میں عبداللہ بن رواحہ رضی اللہ عنہ بھی موجود تھے ۔ جب سواری کی گرد مجلس کی طرف اٹھی تو عبداللہ بن اُبی نے چادر سے اپنی ناک ڈھانپ لی اور کہنے لگا : ہم پر گرد نہ اڑائیں ۔ نبی صلی اللہ علیہ وسلم نے ان سب کو سلام کیا ، رگ گئے ، پھر آپ سواری سے اترے ، ان لوگوں کو اسلام کی دعوت دی اور ان پر قرآن مجید کی تلاوت کی ۔ عبداللہ بن اُبی نے کہا : اے شخص! اس سے اچھی بات اور کوئی نہیں ہو گی کہ جو کچھ آپ کہہ رہے ہیں اگر وہ سچ ہے تو بھی ہماری مجلسوں میں آ کر ہمیں تکلیف نہ پہنچائیں اور اپنے گھر لوٹ جائیں اور ہم میں سے جو شخص آپ کے پاس آئے اس کو سنائیں ۔ ۔ حضرت عبداللہ بن رواحہ رضی اللہ عنہ نے کہا : آپ ہماری مجلس میں تشریف لائیں ۔ ہم اس کو پسند کرتے ہیں ، پھر مسلمان ، یہود اور بت پرست ایک دوسرے کو برا بھلا کہنے لگے ، یہاں تک کہ ایک دوسرے پر ٹوٹ پڑنے پر تیار ہو گئے ۔ نبی صلی اللہ علیہ وسلم ان کو مسلسل دھیما کرتے رہے ، پھر آپ اپنی سواری پر بیٹھے ، حضرت سعد بن عبادہ رضی اللہ عنہ کے پاس گئے اور فرمایا : \" سعد! آپ نے نہیں سنا کہ ابوحباب نے کیا کہا ہے؟ آپ کی مراد عبداللہ بن اُبی سے تھی ، اس نے اس ، اس طرح کہا ہے ۔ ( حضرت سعد رضی اللہ عنہ نے ) کہا : یا رسول اللہ! اس کو معاف کر دیجئے اور اس سے درگزر کیجیے ۔ بےشک اللہ تعالیٰ نے آپ کو جو عطا کیا ہے سو کیا ہے ۔ اس نشیبی نخلستانی علاقے میں بسنے والوں نے مل جل کر یہ طے کر لیا تھا کہ اس کو ( بادشاہت کا ) تاج پہنائیں گے اور اس کے سر پر ( ریاست کا ) عمامہ باندھیں گے ، پھر جب اللہ تعالیٰ نے ، اس حق کے ذریعے جو آپ کو عطا فرمایا ہے ، اس ( فیصلے ) کو رد کر دیا تو اس بنا پر اس کو حلق میں پھندا لگ گیا اور آپ نے جو دیکھا ہے اس نے اسی بنا پر کیا ہے ۔ سو نبی صلی اللہ علیہ وسلم نے اسے معاف کر دیا.",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم الحنظَلی، محمد بن رافع اور عبد بن حمید نے بیان کیا، اور ابن رافع نے کہا: ہمیں بتاؤ؟ باقی دو نے کہا: ہم سے عبدالرزاق نے بیان کیا، معمر نے زہری سے ، انہوں نے عروہ ( بن زبیر ) سے خبر دی کہ اسامہ بن زید رضی اللہ عنہ نے انہیں بتایا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، وَمُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، وَاللَّفْظُ لِابْنِ رَافِعٍ، قَالَ ابْنُ رَافِعٍ: حَدَّثَنَا، وقَالَ الْآخَرَانِ: أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، أَنَّ أُسَامَةَ بْنَ زَيْدٍ، أَخْبَرَهُ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ رَكِبَ حِمَارًا عَلَيْهِ إِكَافٌ تَحْتَهُ قَطِيفَةٌ فَدَكِيَّةٌ، وَأَرْدَفَ وَرَاءَهُ أُسَامَةَ وَهُوَ يَعُودُ سَعْدَ بْنَ عُبَادَةَ فِي بَنِي الْحَارِثِ بْنِ الْخَزْرَجِ، وَذَاكَ قَبْلَ وَقْعَةِ بَدْرٍ، حَتَّى مَرَّ بِمَجْلِسٍ فِيهِ أَخْلَاطٌ مِنَ الْمُسْلِمِينَ، وَالْمُشْرِكِينَ عَبَدَةِ الْأَوْثَانِ، وَالْيَهُودِ، فِيهِمْ [ص:1423] عَبْدُ اللهِ بْنُ أُبَيٍّ، وَفِي الْمَجْلِسِ عَبْدُ اللهِ بْنُ رَوَاحَةَ، فَلَمَّا غَشِيَتِ الْمَجْلِسَ عَجَاجَةُ الدَّابَّةِ، خَمَّرَ عَبْدُ اللهِ بْنُ أُبَيٍّ أَنْفَهُ بِرِدَائِهِ، ثُمَّ قَالَ: لَا تُغَبِّرُوا عَلَيْنَا، فَسَلَّمَ عَلَيْهِمِ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، ثُمَّ وَقَفَ، فَنَزَلَ فَدَعَاهُمْ إِلَى اللهِ، وَقَرَأَ عَلَيْهِمِ الْقُرْآنَ، فَقَالَ عَبْدُ اللهِ بْنُ أُبَيٍّ: أَيُّهَا الْمَرْءُ، لَا أَحْسَنَ مِنْ هَذَا إِنْ كَانَ مَا تَقُولُ حَقًّا، فَلَا تُؤْذِنَا فِي مَجَالِسِنَا وَارْجِعْ إِلَى رَحْلِكَ، فَمَنْ جَاءَكَ مِنَّا فَاقْصُصْ عَلَيْهِ، فَقَالَ عَبْدُ اللهِ بْنُ رَوَاحَةَ: اغْشَنَا فِي مَجَالِسِنَا، فَإِنَّا نُحِبُّ ذَلِكَ، قَالَ: فَاسْتَبَّ الْمُسْلِمُونَ وَالْمُشْرِكُونَ وَالْيَهُودُ حَتَّى هَمُّوا أَنْ يَتَوَاثَبُوا، فَلَمْ يَزَلِ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُخَفِّضُهُمْ، ثُمَّ رَكِبَ دَابَّتَهُ حَتَّى دَخَلَ عَلَى سَعْدِ بْنِ عُبَادَةَ، فَقَالَ: أَيْ سَعْدُ، أَلَمْ تَسْمَعْ إِلَى مَا قَالَ أَبُو حُبَابٍ؟ - يُرِيدُ عَبْدَ اللهِ بْنَ أُبَيٍّ - قَالَ: كَذَا وَكَذَا ، قَالَ: اعْفُ عَنْهُ يَا رَسُولَ اللهِ، وَاصْفَحْ، فَوَاللهِ، لَقَدْ أَعْطَاكَ اللهُ الَّذِي أَعْطَاكَ، وَلَقَدِ اصْطَلَحَ أَهْلُ هَذِهِ الْبُحَيْرَةِ أَنْ يُتَوِّجُوهُ فَيُعَصِّبُوهُ بِالْعِصَابَةِ، فَلَمَّا رَدَّ اللهُ ذَلِكَ بِالْحَقِّ الَّذِي أَعْطَاكَهُ، شَرِقَ بِذَلِكَ، فَذَلِكَ فَعَلَ بِهِ مَا رَأَيْتَ، فَعَفَا عَنْهُ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": "ي دُعَاءِ النَّبِيِّ صلى الله عليه وسلم إِلَى اللَّهِ وَصَبْرِهِ عَلَى أَذَى الْمُنَافِقِينَ",
                "headingUrdu": "منافقین کے ظلم و ستم کے مقابلہ میں رسول اللہ صلی اللہ علیہ وسلم کی دعا اور آپ کی استقامت",
                "headingEnglish": "The supplication of the Prophet (saws) and his steadfastness in the face of the hypocrites' persecution",
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12224,
                "hadithNumber": "4660",
                "englishNarrator": "A similar tradition has been narrated through a different chain of transmitters by Ibn Shihab with the addition of the words:",
                "hadithEnglish": "Before Abdullah (bin Ubayy) became a Muslim.",
                "hadithUrdu": "یہ عبداللہ ( بن ابی ) کے ( ظاہری طور پر ) اسلام ( کا اعلان کرنے ) سے پہلے کا واقعہ ہے.",
                "urduNarrator": "مجھ سے محمد بن رافع نے بیان کیا، کہا ہم سے حجین نے بیان کیا، ہم سے ابن المثنیٰ نے بیان کیا، ہم سے لیث نے بیان کیا,عقیل نے ابن شہاب ( زہری ) سے اسی سند کے ساتھ اسی کے مانند روایت کی اور یہ اضافہ کیا",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا حُجَيْنٌ يَعْنِي ابْنَ الْمُثَنَّى، حَدَّثَنَا لَيْثٌ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، فِي هَذَا الْإِسْنَادِ بِمِثْلِهِ، وَزَادَ وَذَلِكَ قَبْلَ أَنْ يُسْلِمَ عَبْدُ اللهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12225,
                "hadithNumber": "4661",
                "englishNarrator": "It has been narrated on the authority of Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "It was said to the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌): Would that you approached Abdullah bin Ubayy (to persuade him to accept Islam). The Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) (accordingly) went to him, riding a donkey, and (a party of) Muslims also went (with him). On the way they had to walk over a piece of land affected with salinity. When the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) approached him, he said: Do not come near me. By Allah, the obnoxious smell of your donkey has offended me. (As a rejoinder to this remark), a man from the Ansar said: By God, the smell of the donkey of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) is better than your smell. (At this), a man from the tribe of 'Abdullah got furious. Then people from both sides got furious and exchanged blows with sticks, hands and shoes. (The narrator says) that (after this scuffle) we learnt that (the Qur'anic verse): It two parties of the Believers have a quarrel, make ye peace between them (xlix. 9) was revealed about these fighting parties.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم سے عرض کی گئی : ( کیا ہی اچھا ہو ) اگر آپ ( اسلام کی دعوت دینے کے لیے ) عبداللہ بن اُبی کے پاس بھی تشریف لے جائیں! نبی صلی اللہ علیہ وسلم ایک گدھے پر سواری فرما کر اس کی طرف گئے اور مسلمان بھی گئے ، وہ شوریلی زمین تھی ، جب نبی صلی اللہ علیہ وسلم اس کے پاس پہنچے تو وہ کہنے لگا : مجھ سے دور رہیں ، اللہ کی قسم! آپ کے گدھے کی بو سے مجھے اذیت ہو رہی ہے ۔ انصار میں سے ایک شخص نے کہا : اللہ کی قسم! رسول اللہ صلی اللہ علیہ وسلم کا گدھا تم سے زیادہ خوشبودار ہے ۔ اس پر عبداللہ بن اُبی کی قوم میں سے ایک شخص اس کی حمایت میں ، غصے میں آ گیا ۔ کہا : دونوں میں سے ہر ایک کے ساتھی غصے میں آ گئے ۔ کہا : تو ان میں ہاتھوں ، چھیڑیوں اور جوتوں کے ساتھ لڑائی ہونے لگی ، پھر ہمیں یہ بات پہنچی کہ انہی کے بارے میں یہ آیت نازل ہوئی : \" اگر مسلمانوں کی دو جماعتیں آپس میں لڑ پڑیں تو ان دونوں کے درمیان صلح کراؤ.",
                "urduNarrator": "ہم سے محمد بن عبد الاعلٰی القیسی نے بیان کیا، کہا کہ ہم سے معتمر نے اپنے والد سے بیان کیا, حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے ، کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى الْقَيْسِيُّ، حَدَّثَنَا الْمُعْتَمِرُ، عَنْ أَبِيهِ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ: قِيلَ لِلنَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: لَوْ أَتَيْتَ عَبْدَ اللهِ بْنَ أُبَيٍّ، قَالَ: «فَانْطَلَقَ إِلَيْهِ وَرَكِبَ حِمَارًا وَانْطَلَقَ الْمُسْلِمُونَ وَهِيَ أَرْضٌ سَبَخَةٌ»، فَلَمَّا أَتَاهُ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِلَيْكَ عَنِّي، فَوَاللهِ، لَقَدْ آذَانِي نَتْنُ حِمَارِكَ»، قَالَ: فَقَالَ رَجُلٌ مِنَ الْأَنْصَارِ: وَاللهِ، لَحِمَارُ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَطْيَبُ رِيحًا مِنْكَ، قَالَ: فَغَضِبَ لِعَبْدِ اللهِ رَجُلٌ مِنْ قَوْمِهِ، قَالَ: فَغَضِبَ لِكُلِّ وَاحِدٍ مِنْهُمَا أَصْحَابُهُ، قَالَ: فَكَانَ بَيْنَهُمْ ضَرْبٌ بِالْجَرِيدِ، وَبِالْأَيْدِي، وَبِالنِّعَالِ، قَالَ: فَبَلَغَنَا أَنَّهَا نَزَلَتْ فِيهِمْ: {وَإِنْ طَائِفَتَانِ مِنَ الْمُؤْمِنِينَ اقْتَتَلُوا فَأَصْلِحُوا بَيْنَهُمَا} [الحجرات: 9].",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12226,
                "hadithNumber": "4662",
                "englishNarrator": "It has been narrated on the authority of Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said (after the encounter at Badr): Who will ascertain for us what has happened to Abu Jahl? Ibn Mas'ud رضی اللہ عنہ went (to gather this information). He found that the two sons of 'Afra' had struck him and he lay cold at the point of death. He caught him by his beard and said: Art thou Abu Jahl? He said: is there anybody superior to the person you have killed, or (he said) his people have killed him. Ibn Mas'ud رضی اللہ عنہ says that, according to Abu Mijlaz, Abu Jahl said: Alas! a person other than a farmer would have killed me.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" ہماری خاطر کون جا کر دیکھے گا کہ ابوجہل کا کیا بنا؟ \"\" اس پر حضرت ابن مسعود رضی اللہ عنہ چلے گئے ، انہوں نے دیکھا کہ عفراء کے دوبیٹے اس کو تلواروں کا نشانہ بنا چکے ہیں اور اس کا جسم ٹھنڈا ہو رہا ہے ، حضرت ابن مسعود رضی اللہ عنہ نے اس کی داڑھی پکڑ کر کہا : تو ابوجہل ہے؟ ابوجہل نے کہا : کیا اس سے بڑے کسی شخص کو بھی تم نے قتل کیا ہے؟ ۔ ۔ یا کہا ۔ ۔ اس کی قوم نے قتل کیا ہے؟ ( سلیمان تیمی نے ) کہا : ابومجلز نے کہا : ابوجہل نے یہ بھی کہا تھا : کاش! مجھے کسانوں کے علاوہ کسی اور نے قتل کیا ہوتا.",
                "urduNarrator": "ہم سے علی بن حجر السعدی نے بیان کیا, اسماعیل ابن علیہ نے کہا : ہمیں سلیمان تیمی نے حدیث بیان کی ، کہا : ہمیں حضرت انس بن مالک رضی اللہ عنہ نے حدیث سنائی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، أَخْبَرَنَا إِسْمَاعِيلُ يَعْنِي ابْنَ عُلَيَّةَ، حَدَّثَنَا سُلَيْمَانُ التَّيْمِيُّ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ يَنْظُرُ لَنَا مَا صَنَعَ أَبُو جَهْلٍ؟» فَانْطَلَقَ ابْنُ مَسْعُودٍ، فَوَجَدَهُ قَدْ ضَرَبَهُ ابْنَا عَفْرَاءَ، حَتَّى بَرَكَ، قَالَ: فَأَخَذَ بِلِحْيَتِهِ، فَقَالَ: آنْتَ أَبُو جَهْلٍ؟ فَقَالَ: وَهَلْ فَوْقَ رَجُلٍ قَتَلْتُمُوهُ - أَو قَالَ: قَتَلَهُ قَوْمُهُ -، قَالَ: وَقَالَ أَبُو مِجْلَزٍ: قَالَ أَبُو جَهْلٍ: فَلَوْ غَيْرُ أَكَّارٍ قَتَلَنِي.",
                "headingArabic": "قَتْلِ أَبِي جَهْلٍ ‏‏",
                "headingUrdu": "ابو جہل کا قتل",
                "headingEnglish": "The slaying of Abu Jahl",
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12227,
                "hadithNumber": "4663",
                "englishNarrator": "Anas رضی اللہ عنہ said:",
                "hadithEnglish": "\"The prophet of Allah ﷺ said: 'Who will find out for me what happen to Abu Jahl?''' A Hadith like that of Ibn 'Ulayyah, (no. 4662) and the word of Abu Mijlaz as narrated by Ismail.",
                "hadithUrdu": "اللہ کے نبی صلی اللہ علیہ وسلم نے فرمایا : \" میرے لیے کون معلوم کرے گا کہ ابوجہل کا کیا ہوا؟ آگے ابن علیہ کی حدیث اور ابومجلز کے قول کے مانند ہے ، جس طرح اسماعیل نے بیان کیا ہے.",
                "urduNarrator": "ہم سے حمید بن عمر البکراوی نے بیان کیا, ہمیں معتمر نے کہا : میں نے اپنے والد ( سلیمان تیمی ) سے سنا ، وہ کہ رہے تھے : ہمیں حضرت انس رضی اللہ عنہ نے حدیث بیان کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا حَامِدُ بْنُ عُمَرَ الْبَكْرَاوِيُّ، حَدَّثَنَا مُعْتَمِرٌ، قَالَ: سَمِعْتُ أَبِي، يَقُولُ: حَدَّثَنَا أَنَسٌ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ يَعْلَمُ لِي مَا فَعَلَ أَبُو جَهْلٍ» بِمِثْلِ حَدِيثِ ابْنِ عُلَيَّةَ، وَقَوْلِ أَبِي مِجْلَزٍ كَمَا ذَكَرَهُ إِسْمَاعِيلُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12228,
                "hadithNumber": "4664",
                "englishNarrator": "It has been narrated on the authority of Jabir رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Who will kill Ka'b bin Ashraf? He has maligned Allah, the Exalted, and His Messenger. Muhammad bin Maslama رضی اللہ عنہ said: Messenger of Allah, do you wish that I should kill him? He said: Yes. He said: Permit me to talk (to him in the way I deem fit). He said: Talk (as you like). So, Muhammad bin Maslama رضی اللہ عنہ came to Ka'b and talked to him, referred to the old friendship between them and said: This man (i.e. the Holy Prophet) has made up his mind to collect charity (from us) and this has put us to a great hardship. When be heard this, Ka'b said: By God, you will be put to more trouble by him. Muhammad bin Maslama said: No doubt, now we have become his followers and we do not like to forsake him until we see what turn his affairs will take. I want that you should give me a loan. He said: What will you mortgage? He said: What do you want? He said: Pledge me your women. He said: You are the most handsome of the Arabs; should we pledge our women to you? He said: Pledge me your children. He said: The son of one of us may abuse us saying that he was pledged for two wasqs of dates, but we can pledge you (cur) weapons. He said: All right. Then Muhammad bin Maslama promised that he would come to him with Harith, Abu 'Abs bin Jabr and Abbad bin Bishr. So they came and called upon him at night. He came down to them. Sufyan says that all the narrators except 'Amr have stated that his wife said: I hear a voice which sounds like the voice of murder. He said: It is only Muhammad bin Maslama and his foster-brother, Abu Na'ila. When a gentleman is called at night even it to be pierced with a spear, he should respond to the call. Muhammad said to his companions: As he comes down, I will extend my hands towards his head and when I hold him fast, you should do your job. So when he came down and he was holding his cloak under his arm, they said to him: We sense from you a very fine smell. He said: Yes, I have with me a mistress who is the most scented of the women of Arabia. He said: Allow me to smell (the scent on your head). He said: Yes, you may smell. So he caught it and smelt. Then he said: Allow me to do so (once again). He then held his head fast and said to his companions: Do your job. And they killed him.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کعب بن اشرف کی ذمہ داری کون لے گا ، اس نے اللہ اور اس کے رسول صلی اللہ علیہ وسلم کو اذیت دی ہے ۔ \" محمد بن مسلمہ رضی اللہ عنہ نے کہا : اللہ کے رسول! کیا آپ چاہتے ہیں کہ میں اسے قتل کر دوں؟ آپ نے فرمایا : \" ہاں ۔ \" انہوں نے عرض کی : مجھے اجازت دیجئے کہ میں ( یہ کام کرتے ہوئے ) کوئی بات کہہ لوں ۔ آپ نے فرمایا : \" کہہ لینا ۔ \" چنانچہ وہ اس کے پاس آئے ، بات کی اور باہمی تعلقات کا تذکرہ کیا اور کہا : یہ آدمی صدقہ ( لینا ) چاہتا ہے اور ہمیں تکلیف میں ڈال دیا ہے ۔ جب اس نے یہ سنا تو کہنے لگا : اللہ کی قسم! تم اور بھی اکتاؤ گے ۔ انہوں نے کہا : اب تو ہم اس کے پیروکار بن چکے ہیں اور ( ابھی ) اسے چھوڑنا نہیں چاہتے یہاں تک کہ دیکھ لیں کہ اس کے معاملے کا انجام کیا ہوتا ہے ۔ کہا : میں چاہتا ہوں کہ تم مجھے کچھ ادھار دو ۔ اس نے کہا : تم میرے پاس گروی میں کیا رکھو گے؟ انہوں نے جواب دیا : تم کیا چاہتے ہو؟ اس نے کہا : اپنی عورتوں کو میرے پاس گروی رکھ دو ۔ انہوں نے کہا : تم عرب کے سب سے خوبصورت انسان ہو ، کیا ہم اپنی عورتیں تمہارے پاس گروی رکھیں؟ اس نے ان سے کہا : تم اپنے بچے میرے ہاں گروی رکھ دو ۔ انہوں نے کہا : ہم میں سے کسی کے بیٹے کو گالی دی جائے گی تو کہا جائے گا : وہ کھجور کے دو وسق کے عوض گردی رکھا گیا تھا ، البتہ ہم تمہارے پاس زرہ یعنی ہتھیار گروی رکھ دیتے ہیں ۔ اس نے کہا : ٹھیک ہے ۔ انہوں نے اس سے وعدہ کیا کہ وہ حارث ، ابوعبس بن جبر اور عباد بن بشر کو لے کر اس کے پاس آئیں گے ۔ کہا : وہ آئے اور رات کے وقت اسے آواز دی تو وہ اتر کر ان کے پاس آیا ۔ سفیان نے کہا : عمرو کے علاوہ دوسرے راوی نے کہا : اس کی بیوی اس سے کہنے لگی : میں ایسی آواز سن رہی ہوں جیسے وہ خون ( کے طلبگار ) کی آواز ہو ۔ اس نے کہا : یہ تو محمد بن مسلمہ اور اس کا دودھ شریک بھائی اور ابونائلہ ہیں اور کریم انسان کو رات کے وقت بھی کسی زخم ( کے مداوے ) کی خاطر بلایا جائے تو وہ آتا ہے ۔ محمد ( بن مسلمہ ) نے ( اپنے ساتھیوں سے ) کہا : میں ، جب وہ آئے گا ، اپنا ہاتھ اس کے سر کی طرف بڑھاؤں گا ، جب میں اسے خوب اچھی طرح جکڑ لوں تو وہ تمہارے بس میں ہو گا ( تم اپنا کام کر گزرنا ۔ ) کہا : جب وہ نیچے اترا تو اس طرح اترا کہ اس نے پیٹی ( چادر بائیں کندھے پر ڈال کر اس کا سر دائیں بغل کے نیچے سے نکال کر سینے پر دونوں سروں سے ) باندھی ہوئی تھی ۔ انہوں نے کہا : ہمیں آپ سے عطر کی خوشبو آ رہی ہے ۔ اس نے کہا : ہاں ، میرے نکاح میں فلاں عورت ہے ، وہ عرب کی سب عورتوں سے زیادہ معطر رہنے والی ہے ۔ انہوں نے کہا : کیا تم مجھے اجازت دیتے ہو کہ میں اس ( خوشبو ) کو سونگھ لوں؟ اس نے کہا : ہاں ، سونگھ لو ۔ تو انہوں نے ( سر کو ) پکڑ کر سونگھا ۔ پھر کہا : کیا تم مجھے اجازت دیتے ہو کہ میں اسے دوبارہ سونگھ لوں؟ کہا : کیا تم مجھے اجازت دیتے ہو کہ میں اسے دوبارہ سونگھ لوں؟ کہا : تو انہوں نے اس کے سر کو قابو کر لیا ، پھر کہا : تمہارے بس میں ہے ۔ کہا : تو انہوں نے اسے قتل کر دیا.",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم الحنظَلی اور عبداللہ بن محمد بن عبدالرحمٰن بن المسور الزہری نے ابن عیینہ کی سند سے بیان کیا: اور لفظ الزہری کا ہے، ہمیں سفیان نے عمرو سے حدیث بیان کی ، کہا : میں نے حضرت جابر رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، وَعَبْدُ اللهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْمِسْوَرِ الزُّهْرِيُّ، كِلَاهُمَا، عَنِ ابْنِ عُيَيْنَةَ، وَاللَّفْظُ لِلزُّهْرِيِّ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، سَمِعْتُ جَابِرًا، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ لِكَعْبِ بْنِ الْأَشْرَفِ؟ فَإِنَّهُ قَدْ آذَى اللهَ وَرَسُولَهُ»، فَقَالَ مُحَمَّدُ بْنُ مَسْلَمَةَ: يَا رَسُولَ اللهِ، أَتُحِبُّ أَنْ أَقْتُلَهُ؟ قَالَ: «نَعَمْ»، قَالَ: ائْذَنْ لِي، فَلْأَقُلْ، قَالَ: «قُلْ»، فَأَتَاهُ، فَقَالَ لَهُ: وَذَكَرَ مَا بَيْنَهُمَا، وَقَالَ: إِنَّ هَذَا الرَّجُلَ قَدْ أَرَادَ صَدَقَةً، وَقَدْ عَنَّانَا، فَلَمَّا سَمِعَهُ قَالَ: وَأَيْضًا وَاللهِ، لَتَمَلُّنَّهُ، قَالَ: إِنَّا قَدِ اتَّبَعْنَاهُ الْآنَ، وَنَكْرَهُ أَنْ نَدَعَهُ حَتَّى نَنْظُرَ إِلَى أَيِّ شَيْءٍ يَصِيرُ أَمْرُهُ، قَالَ: وَقَدْ أَرَدْتُ أَنْ تُسْلِفَنِي سَلَفًا، قَالَ: فَمَا تَرْهَنُنِي؟ قَالَ: مَا تُرِيدُ؟ قَالَ: تَرْهَنُنِي نِسَاءَكُمْ، قَالَ: أَنْتَ أَجْمَلُ الْعَرَبِ، أَنَرْهَنُكَ نِسَاءَنَا؟ قَالَ لَهُ: تَرْهَنُونِي أَوْلَادَكُمْ، قَالَ: يُسَبُّ ابْنُ أَحَدِنَا، فَيُقَالُ: رُهِنَ فِي وَسْقَيْنِ مِنْ تَمْرٍ، وَلَكِنْ نَرْهَنُكَ اللَّأْمَةَ - يَعْنِي السِّلَاحَ -، قَالَ: فَنَعَمْ، وَوَاعَدَهُ أَنْ يَأْتِيَهُ بِالْحَارِثِ، وَأَبِي عَبْسِ بْنِ جَبْرٍ، وَعَبَّادِ بْنِ بِشْرٍ، قَالَ: فَجَاءُوا فَدَعَوْهُ لَيْلًا فَنَزَلَ إِلَيْهِمْ، قَالَ سُفْيَانُ: قَالَ غَيْرُ عَمْرٍو: قَالَتْ لَهُ امْرَأَتُهُ: إِنِّي لَأَسْمَعُ صَوْتًا كَأَنَّهُ صَوْتُ دَمٍ، قَالَ: إِنَّمَا هَذَا مُحَمَّدُ بْنُ مَسْلَمَةَ، وَرَضِيعُهُ، وَأَبُو نَائِلَةَ، إِنَّ الْكَرِيمَ لَوْ دُعِيَ إِلَى طَعْنَةٍ لَيْلًا لَأَجَابَ، قَالَ مُحَمَّدٌ: إِنِّي إِذَا جَاءَ، فَسَوْفَ أَمُدُّ يَدِي إِلَى رَأْسِهِ، فَإِذَا اسْتَمْكَنْتُ مِنْهُ فَدُونَكُمْ، قَالَ: فَلَمَّا نَزَلَ نَزَلَ وَهُوَ مُتَوَشِّحٌ، فَقَالُوا: نَجِدُ مِنْكَ رِيحَ الطِّيبِ، قَالَ: نَعَمْ تَحْتِي فُلَانَةُ هِيَ أَعْطَرُ نِسَاءِ الْعَرَبِ، قَالَ: فَتَأْذَنُ لِي أَنْ أَشُمَّ مِنْهُ، قَالَ: نَعَمْ فَشُمَّ، فَتَنَاوَلَ فَشَمَّ، ثُمَّ قَالَ: أَتَأْذَنُ لِي أَنْ أَعُودَ، قَالَ: فَاسْتَمْكَنَ مِنْ رَأْسِهِ، ثُمَّ قَالَ: دُونَكُمْ، قَالَ: فَقَتَلُوهُ.",
                "headingArabic": "قَتْلِ كَعْبِ بْنِ الأَشْرَفِ طَاغُوتِ الْيَهُودِ ‏‏",
                "headingUrdu": "یہودیوں کے طاغوت کعب بن الاشرف کا قتل",
                "headingEnglish": "The slaying of Ka'b Bin Al-Ashraf, the Tagut of the Jews",
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12229,
                "hadithNumber": "4665",
                "englishNarrator": "It has been narrated on the authority of Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) raided Khaibar. One morning we offered prayers in the darkness of early dawn (near Khaibar). Then the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) mounted (his horse). Abu Talha رضی اللہ عنہ mounted his and I mounted behind Abu Talha رضی اللہ عنہ on the same horse. The Prophet of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) rode through the streets of Khaibar and (I rode so close to him) that my knee touched the thigh of the Prophet of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). The wrapper got aside from his thigh, and I could see its whiteness. When he entered the town, he said: God is Great. Khaibar shall face destruction. When we descend in the city-square of a people, it is a bad day for them who have been warned (and have not taken heed). He said these words thrice. The people of the town had just come out from (their houses) to go about their jobs. They said (in surprise): Muhammad has come. We captured Khaibar by force.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے خیبر کی جنگ لڑی ، ہم نے وہاں صبح کی نماز اندھیرے میں پڑھی ، پھر اللہ کے نبی صلی اللہ علیہ وسلم سوار ہوئے اور ابوطلحہ رضی اللہ عنہ بھی سوار ہوئے اور میں سواری پر ابوطلحہ رضی اللہ عنہ کے پیچھے تھا ، اللہ کے نبی صلی اللہ علیہ وسلم نے خیبر کے تنگ راستوں میں اپنی سواری کو دوڑایا ، میرا گھٹنا اللہ کے نبی صلی اللہ علیہ وسلم کی ران کو چھور رہا تھا ، آپ صلی اللہ علیہ وسلم کی ران سے کپڑا ہٹ گیا اور میں رسول اللہ صلی اللہ علیہ وسلم کی ران کی سفیدی دیکھ رہا تھا ، جب آپ بستی میں داخل ہوئے تو فرمایا : \" اللہ اکبر! خیبر تباہ ہوا ، ہم جب کسی قوم کے گھروں کے سامنے اترتے ہیں تو ان لوگوں کی صبح بری ہوتی ہے جنہیں ( آنے سے پہلے ) ڈرایا گیا تھا ۔ \" آپ نے تین بار یہی فرمایا ۔ کہا : لوگ اپنے کاموں کے لیے نکل چکے تھے تو انہوں نے کہا : ( یہ ) محمد صلی اللہ علیہ وسلم ہیں ، عبدالعزیز نے کہا : ہمارے بعض ساتھیوں نے کہا : اور لشکر ہے ۔ کہا : ہم نے اسے بزور شمشیر حاصل کیا.",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، کہا کہ ہم سے اسماعیل نے بیان کیا، یعنی ابن علیّہ نے, عبدالعزیز بن صہیب نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ يَعْنِي ابْنَ عُلَيَّةَ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ غَزَا خَيْبَرَ، قَالَ: فَصَلَّيْنَا عِنْدَهَا صَلَاةَ الْغَدَاةِ بِغَلَسٍ، فَرَكِبَ نَبِيُّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَرَكِبَ أَبُو طَلْحَةَ، وَأَنَا رَدِيفُ أَبِي طَلْحَةَ، فَأَجْرَى نَبِيُّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي زُقَاقِ خَيْبَرَ، وَإِنَّ رُكْبَتِي لَتَمَسُّ فَخِذَ نَبِيِّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَانْحَسَرَ الْإِزَارُ عَنْ فَخِذِ نَبِيِّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَإِنِّي لَأَرَى بَيَاضَ فَخِذَ نَبِيِّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَلَمَّا دَخَلَ الْقَرْيَةَ قَالَ: اللهُ أَكْبَرُ، خَرِبَتْ خَيْبَرُ، إِنَّا إِذَا نَزَلْنَا بِسَاحَةِ قَوْمٍ {فَسَاءَ صَبَاحُ الْمُنْذَرِينَ} [الصافات: 177] قَالَهَا ثَلَاثَ مِرَارٍ، قَالَ: وَقَدْ خَرَجَ الْقَوْمُ إِلَى أَعْمَالِهِمْ، فَقَالُوا: مُحَمَّدٌ، قَالَ عَبْدُ الْعَزِيزِ: وَقَالَ بَعْضُ أَصْحَابِنَا: وَالْخَمِيسَ، قَالَ: وَأَصَبْنَاهَا عَنْوَةً.",
                "headingArabic": "غَزْوَةِ خَيْبَرَ ‏‏",
                "headingUrdu": "خیبر کی جنگ",
                "headingEnglish": "The Battle of Khaibar",
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12230,
                "hadithNumber": "4666",
                "englishNarrator": "It was narrated that Anas رضی اللہ عنہ said:",
                "hadithEnglish": "I was riding behind Abu Talha رضی اللہ عنہ on the day of the Battle of Khaibar (and we were riding so close to the Prophet that) my foot would touch his We encountered the people at sunrise when they had come out with their axes, spades and strings driving their cattle along. They shouted (in surprise): Muhammad has come along with his force! The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Khaibar shall face destruction. Behold! when we descend in the city-square of a people, it is a bad day for those who have been warned (but have not taken heed). Allah, the Glorious and Majestic, inflicted defeat upon them.",
                "hadithUrdu": "خیبر کے دن میں سواری پر حضرت ابوطلحہ رضی اللہ عنہ کے پیچھے تھا اور میرا پاؤں رسول اللہ صلی اللہ علیہ وسلم کے پاؤں کو چھو رہا تھا ، کہا : ہم اس وقت ان کے پاس پہنچے جب سورج چمک رہا تھا ، وہ لوگ اپنے مویشی نکال چکے تھے اور کلہاڑیاں ، ٹوکریاں اور بیلچے لے کر ( خود بھی ) نکل چکے تھے ۔ تو انہوں نے کہا : محمد صلی اللہ علیہ وسلم ہیں اور لشکر ہے ۔ کہا : تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : خیبر اجڑ گیا ، جب ہم کسی قوم کے گھروں کے سامنے اترتے ہیں تو ان لوگوں کی صبح بری ہوتی ہے جنہیں ڈرایا جا چکا تھا ۔ \" کہا : تو اللہ عزوجل نے انہیں شکست دی.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے عفان نے بیان کیا، ہم سے حماد بن سلمہ نے بیان کیا, ثابت نے حضرت انس رضی اللہ عنہ سے حدیث بیان کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ، قَالَ: كُنْتُ رِدْفَ أَبِي طَلْحَةَ يَوْمَ خَيْبَرَ وَقَدَمِي تَمَسُّ قَدَمَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: فَأَتَيْنَاهُمْ حِينَ بَزَغَتِ الشَّمْسُ وَقَدْ أَخْرَجُوا مَوَاشِيَهُمْ، وَخَرَجُوا بِفُؤُوسِهِمْ، وَمَكَاتِلِهِمْ، وَمُرُورِهِمْ، فَقَالُوا: مُحَمَّدٌ وَالْخَمِيسَ، قَالَ: وَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: خَرِبَتْ خَيْبَرُ، إِنَّا إِذَا نَزَلْنَا بِسَاحَةِ قَوْمٍ {فَسَاءَ صَبَاحُ الْمُنْذَرِينَ} [الصافات: 177] ، قَالَ: فَهَزَمَهُمُ اللهُ عَزَّ وَجَلَّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12231,
                "hadithNumber": "4667",
                "englishNarrator": "It was narrated that Anas bin Malik رضی اللہ عنہ said:",
                "hadithEnglish": "When the Messenger of Allah came to Khaiber he said: 'Then, When we descend in their courtyard (i.e. near to them) evil will be the morning of those who had been warned.\"\"",
                "hadithUrdu": "جب رسول اللہ صلی اللہ علیہ وسلم خیبر آئے تو آپ نے فرمایا : \" جب ہم کسی قوم کے گھروں کے آگے اترتے ہیں تو ڈرائے گئے لوگوں کی صبح بری ہوتی ہے.",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم اور اسحاق بن منصور نے بیان کیا، کہا: ہمیں نضر بن شیل نے خبر دی، انہیں شعبہ نے خبر دی، قتادہ نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَإِسْحَاقُ بْنُ مَنْصُورٍ، قَالَا: أَخْبَرَنَا النَّضْرُ بْنُ شُمَيْلٍ، أَخْبَرَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ: لَمَّا أَتَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ خَيْبَرَ، قَالَ: إِنَّا إِذَا نَزَلْنَا بِسَاحَةِ قَوْمٍ {فَسَاءَ صَبَاحُ الْمُنْذَرِينَ} [الصافات: 177]",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12232,
                "hadithNumber": "4668",
                "englishNarrator": "It has been narrated on the authority of Salama bin al-Akwa' رضی اللہ عنہ who said:",
                "hadithEnglish": "We marched upon Khaibar with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). We journeyed during the night. One of the people said to (my brother) 'Amir bin al-Akwa' رضی اللہ عنہ : Won't you recite to us some of your verses? Amir رضی اللہ عنہ was a poet. So he began to chant his verses to urge the camels, reciting: O God, if Thou hadst not guided us We would have neither been guided rightly nor practised charity, Nor offered prayers. We wish to lay down our lives for Thee; so forgive Thou our lapses, And keep us steadfast when we encounter (our enemies). Bestow upon us peace and tranquillity. Behold, when with a cry they called upon us to help. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Who is this driver (of the camels)? They said: It is 'Amir. He said: God will show mercy to him. A man said: Martyrdom is reserved for him. Messenger of Allah, would that you had allowed us to benefit ourselves from his life. (The narrator says): We reached Khaibar and besieged them, and (we continued the siege) until extreme hunger afflicted us. Then the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Behold, God has conquered it for you. When it was evening of the day on which the city was conquered. the Muslims lit many fires. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: What are these fires? And what are they cooking? They said: They are cooking meat. He asked. Which meat? They said: That of domestic asses. He said: Let them throw it away and break the pots (in which it is being cooked). A man said: Or should they throw it away and wash the pots? He said: They may do that. When the people drew themselves up in battle array 'Amir رضی اللہ عنہ caught hold of his sword that was rather short He drove a Jew before him to strike him with it. (As he struck him), his sword recoiled and struck his own knee, and 'Amirرضی اللہ عنہ  died of the wound. When the people returned (after the conquest of Kliaibar) and he (Salama) had caught hold of my hand, and said: The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) saw that I was silent (and dejected) ; he said: What's the matter with thee? I said to him: My father and my mother be thy ransom, people presume that 'Amir's sacrifice has been in vain. He asked: Who has said that? I said: So and so and Usaid bin Hudair al-Ansari رضی اللہ عنہ . He said: Who has said that has lied. For him (for 'Amir) there is a double reward. (He indicated this by putting two of his fingers together.) He was a devotee of God and a warrior fighting for His cause. There will be hardly any Arab who can fight as bravely as he did. Qutaiba has differed in a few words.",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ خیبر کی طرف روانہ ہوئے تو ہم نے رات کے وقت سفر کیا ، لوگوں میں سے ایک آدمی نے عامر بن اکوع رضی اللہ عنہ سے کہا : کیا تم ہمیں اپنے نادر جنگی اشعار سے نہیں سناؤ گے؟ اور عامر رضی اللہ عنہ شاعر آدمی تھے ، وہ اتر کر لوگوں کے ( اونٹوں ) کے لیے حدی خوانی کرنے لگے ، وہ کہہ رہے تھے : \"\" اے اللہ! اگر تو ( فضل و کرم کرنے والا ) نہ ہوتا تو ہم ہدایت نہ پاتے ، نہ صدقہ کرتے نہ نماز پڑھتے ، ہم تیرے نام پر قربان ، ہم نے جو گناہ کیے ان کو بخش دے اور اگر ہمارا مقابلہ ہو تو ہمارے قدم جما دے اور ہم پر ضرور بالضرور سکینت اور وقار نازل فرما ۔ ہمیں جب بھی آواز دے کر بلایا گیا ہم آئے ، ہمیں آواز دے کر ان ( آواز دینے والے ) لوگوں نے ہم پر اعتماد کیا ( اور ہم اس پر پورے اترے ۔ ) \"\" تو رسول اللہ صلی اللہ علیہ وسلم نے پوچھا : \"\" یہ ( حدی خوانی کر کے ) اونٹوں کو ہانکنے والا کون ہے؟ \"\" لوگوں نے کہا : عامر ۔ آپ صلی اللہ علیہ وسلم نے ( اللہ سے اس کی محبت اور شوق کو دیکھتے ہوئے ) فرمایا : \"\" اللہ اس پر رحم کرے! \"\" لوگوں میں سے ایک آدمی ( حضرت عمر رضی اللہ عنہ ) نے کہا : ( اس کے لیے شہادت ) واجب ہو گئی ، اے اللہ کے رسول! آپ نے ( اس کے حق میں دعا مؤخر فرما کر ) ہمیں اس ( کی صحبت ) سے زیادہ مدت فائدہ کیوں نہیں اٹھانے دیا؟ ( سلمہ بن اکوع رضی اللہ عنہ نے ) کہا : ہم خیبر پہنچے تو ہم نے ان کا محاصرہ کر لیا یہاں تک کہ ہمیں ( شدید بھوک کے ) مخمصے نے آ لیا ، اس کے بعد آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" بلاشبہ اللہ نے اسے ان ( جہاد کرنے والے ) لوگوں کے لیے فتح کر دیا ہے ۔ \"\" جب لوگوں نے اس دن کی شام کی جب انہیں فتح عطا کی گئی تھی تو انہوں نے بہت سی ( جگہوں پر ) آگ جلائی ۔ رسول اللہ صلی اللہ علیہ وسلم نے پوچھا : \"\" یہ آگ کیسی ہے اور یہ لوگ کس چیز ( کو پکانے ) کے لیے اسے جلا رہے ہیں؟ \"\" انہوں نے جواب دیا : گوشت ( کو پکانے ) کے لیے ۔ آپ صلی اللہ علیہ وسلم نے پوچھا : \"\" کون سا گوشت؟ \"\" انہوں نے جواب دیا : پالتو گدھوں کا گوشت ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" اسے ( پانی سمیت ) بہا دو اور ان ( برتنوں ) کو توڑ دو ۔ \"\" اس پر ایک آدمی نے کہا : یا اسے بہا دیں اور برتن دھو لیں؟ تو آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" یا ایسے کر لو ۔ \"\" کہا : جب لوگوں نے مل کر صف بندی کی تو عامر رضی اللہ عنہ کی تلوار چھوٹی تھی ، انہوں نے مارنے کے لیے اس ( تلوار ) سے ایک یہودی کی پنڈلی کو نشانہ بنایا تو تلوار کی دھار لوٹ کر عامر رضی اللہ عنہ کے گھٹنے پر آ لگی اور وہ اسی زخم سے فوت ہو گئے ۔ جب لوگ واپس ہوئے ، سلمہ رضی اللہ عنہ نے کہا : اور اس وقت انہوں نے میرا ہاتھ پکڑا ہوا تھا ، کہا : جب رسول اللہ صلی اللہ علیہ وسلم نے مجھے خاموش دیکھا تو آپ نے پوچھا : \"\" تمہیں کیا ہوا ہے؟ \"\" میں نے آپ سے عرض کی : میرے ماں باپ آپ پر قربان! لوگوں کا خیال ہے کہ عامر رضی اللہ عنہ کا عمل ضائع ہو گیا ہے ۔ آپ نے فرمایا : \"\" کس نے کہا ہے؟ \"\" میں نے کہا : فلاں ، فلاں اور اسید بن حضیر انصاری رضی اللہ عنہ نے ۔ تو آپ نے فرمایا : \"\" جس نے بھی یہ کہا ، غلط کہا ہے ، اس کے لیے تو یقینا دو اجر ہیں ۔ \"\" آپ نے اپنی دونوں انگلیوں کو اکٹھا کیا ۔ \"\" وہ تو خود جم کر جہاد کرنے والے مجاہد تھے ، کم ہی کوئی عربی ہو گا جو اس راستے پر ان کی طرح چلا ہو گا ۔ \"\" قتیبہ نے حدیث کے دو حرفوں ( القين کے آخری دو حرفوں ی اور ن ) میں محمد ( بن عباد ) کی مخالفت کی ہے اور ( محمد ) بن عباد کی روایت میں ( القين کے بجائے ) الق ( ضرور بالضرور کی تاکید کے بغیر محض ) \"\" نازل کر \"\" کے الفاظ ہیں.",
                "urduNarrator": "قتیبہ بن سعید اور محمد بن عباد نے ۔ ۔ الفاظ ابن عباد کے ہیں ۔ ۔ ہمیں حدیث بیان کی ، ان دونوں نے کہا : ہمیں حاتم بن اسماعیل نے سلمہ بن اکوع کے آزاد کردہ غلام یزید بن ابی عبید سے حدیث بیان کی ، انہوں نے حضرت سلمہ بن اکوع رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ عَبَّادٍ، وَاللَّفْظُ لِابْنِ عَبَّادٍ، قَالَا: حَدَّثَنَا حَاتِمٌ وَهُوَ ابْنُ إِسْمَاعِيلَ، عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ، مَوْلَى سَلَمَةَ بْنِ الْأَكْوَعِ، عَنْ سَلَمَةَ بْنِ الْأَكْوَعِ، قَالَ: خَرَجْنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِلَى خَيْبَرَ، فَتَسَيَّرْنَا لَيْلًا، فَقَالَ رَجُلٌ مِنَ الْقَوْمِ لِعَامِرِ بْنِ الْأَكْوَعِ: أَلَا تُسْمِعُنَا مِنْ هُنَيْهَاتِكَ، وَكَانَ عَامِرٌ رَجُلًا شَاعِرًا، فَنَزَلَ يَحْدُو بِالْقَوْمِ، يَقُولُ [ص:1428]: اللهُمَّ لَوْلَا أَنْتَ مَا اهْتَدَيْنَا، وَلَا تَصَدَّقْنَا وَلَا صَلَّيْنَا فَاغْفِرْ فِدَاءً لَكَ مَا اقْتَفَيْنَا، وَثَبِّتِ الْأَقْدَامَ إِنْ لَاقَيْنَا، وَأَلْقِيَنْ سَكِينَةً عَلَيْنَا، إِنَّا إِذَا صِيحَ بِنَا أَتَيْنَا، وَبِالصِّيَاحِ عَوَّلُوا عَلَيْنَا، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ هَذَا السَّائِقُ؟» قَالُوا: عَامِرٌ، قَالَ: «يَرْحَمُهُ اللهُ»، فَقَالَ رَجُلٌ مِنَ الْقَوْمِ: وَجَبَتْ يَا رَسُولَ اللهِ، لَوْلَا أَمْتَعْتَنَا بِهِ، قَالَ: فَأَتَيْنَا خَيْبَرَ، فَحَاصَرْنَاهُمْ حَتَّى أَصَابَتْنَا مَخْمَصَةٌ شَدِيدَةٌ، ثُمَّ قَالَ: «إِنَّ اللهَ فَتَحَهَا عَلَيْكُمْ»، قَالَ: فَلَمَّا أَمْسَى النَّاسُ مَسَاءَ الْيَوْمِ الَّذِي فُتِحَتْ عَلَيْهِمْ، أَوْقَدُوا نِيرَانًا كَثِيرَةً، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَا هَذِهِ النِّيرَانُ؟ عَلَى أَيِّ شَيْءٍ تُوقِدُونَ؟» فَقَالُوا: عَلَى لَحْمٍ، قَالَ: «أَيُّ لَحْمٍ؟» قَالُوا: لَحْمُ حُمُرِ الْإِنْسِيَّةِ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَهْرِيقُوهَا، وَاكْسِرُوهَا»، فَقَالَ رَجُلٌ: أَوْ يُهْرِيقُوهَا وَيَغْسِلُوهَا؟ فَقَالَ: «أَوْ ذَاكَ»، قَالَ: فَلَمَّا تَصَافَّ الْقَوْمُ كَانَ سَيْفُ عَامِرٍ فِيهِ قِصَرٌ، فَتَنَاوَلَ بِهِ سَاقَ يَهُودِيٍّ لِيَضْرِبَهُ، وَيَرْجِعُ ذُبَابُ سَيْفِهِ، فَأَصَابَ رُكْبَةَ عَامِرٍ فَمَاتَ مِنْهُ، قَالَ: فَلَمَّا قَفَلُوا، قَالَ سَلَمَةُ وَهُوَ آخِذٌ بِيَدِي: قَالَ: فَلَمَّا رَآنِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ سَاكِتًا، قَالَ: «مَا لَكَ؟» قُلْتُ لَهُ: فَدَاكَ أَبِي وَأُمِّي زَعَمُوا أَنَّ عَامِرًا حَبِطَ عَمَلُهُ، قَالَ: «مَنْ قَالَهُ؟» قُلْتُ: فُلَانٌ وَفُلَانٌ وَأُسَيْدُ بْنُ حُضَيْرٍ الْأَنْصَارِيُّ، فَقَالَ: «كَذَبَ مَنْ قَالَهُ، إِنَّ لَهُ لَأَجْرَيْنِ» وَجَمَعَ بَيْنَ إِصْبَعَيْهِ، «إِنَّهُ لَجَاهِدٌ مُجَاهِدٌ قَلَّ عَرَبِيٌّ مَشَى بِهَا مِثْلَهُ»، وَخَالَفَ قُتَيْبَةُ مُحَمَّدًا فِي الْحَدِيثِ فِي حَرْفَيْنِ، وَفِي رِوَايَةِ ابْنِ عَبَّادٍ: وَأَلْقِ سَكِينَةً عَلَيْنَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12233,
                "hadithNumber": "4669",
                "englishNarrator": "It has been reported on the authority of Salama bin Akwa' رضی اللہ عنہ who said:",
                "hadithEnglish": "On the day of the Battle of Khaibar my brother fought a fierce fight by the side of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). His sword rebounded and killed him. The Companions of the Messenger of Allah (may peace be upon hill) talked about his death and doubted (whether it was martyrdom). (They said): (He is) a man killed by his own weapon, and expressed doubt about his affair. Salama said: When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) returned from Khaibar, I said: Messenger of Allah, permit me that I may recite to you some rajaz verses. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) permitted him. 'Umar bin Khattab رضی اللہ عنہ said: I know what you will recite. I recited: By God, if God had guided us not, We would hive neither been guided aright nor practiced charity, Nor offered prayers. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: What you have said is true, 'I (continued): And descend on us peace and tranquillity And keep us steadfast if we encounter (with our enemies) And the polytheists have rebelled against us. When I finished my rajaz, the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Who composed these verses? I said: They were composed by my brother. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: May God show mercy to him! I said: By God, some people are reluctant to invoke God's mercy on him (because) they say he is a man who died by his own sword. (Hearing this) the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: He died as God's devotee and warrior. Ibn Shihab has said: I asked one of the sons of Salama (bin Akwa') رضی اللہ عنہ about (the death of 'Amir). He related to me a similar tradition except that he said: When I said some people were reluctant invoke God's blessings on him, the Messenger of Allah ﷺ said: They lied. ('Amir رضی اللہ عنہ) died as God's devotee and warrior (in the cause of Allah). For him there is a double reward, and he pointed out this by putting his two fingers together.",
                "hadithUrdu": "جب خیبر کا دن تھا ، میرے بھائی نے رسول اللہ صلی اللہ علیہ وسلم کی معیت میں خوب جنگ لڑی ، ( اسی اثنا میں ) ان کی تلوار پلٹ کر انہی کو جا لگی اور انہیں شہید کر دیا تو رسول اللہ صلی اللہ علیہ وسلم کے صحابہ نے اس حوالے سے کچھ باتیں کہیں اور اس معاملے میں شک ( کا اظہار کیا ) کہ آدمی اپنے ہی اسلحہ سے فوت ہوا ہے ۔ انہوں نے ان کے معاملے کے بعض پہلوؤں میں شک کیا ۔ سلمہ رضی اللہ عنہ نے کہا : رسول اللہ صلی اللہ علیہ وسلم خیبر سے واپس ہوئے تو میں نے کہا : اے اللہ کے رسول! مجھے اجازت دیجئے کہ میں آپ کے آگے رجزیہ اشعار پڑھوں تو رسول اللہ صلی اللہ علیہ وسلم نے انہیں اجازت دے دی ۔ اس پر حضرت عمر بن خطاب رضی اللہ عنہ نے کہا : میں جانتا ہوں جو تم کہنے جا رہے ہو ۔ کہا : تو میں نے ( یہ رجزیہ اشعار ) پڑھے : \"\" اللہ کی قسم! اگر اللہ ( کا کرم ) نہ ہوتا تو ہم ہدایت نہ پاتے ، نہ صدقہ کرتے اور نہ نماز پڑھتے ۔ \"\" اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" تم نے سچ کہا ۔ \"\" \"\" ہم پر بہت سکینت نازل فرما اور اگر ہمارا مقابلہ ہو تو ہمارے قدم مضبوط کر دے ، مشرکوں نے یقینا ہم پر سخت زیادتی کی ۔ \"\" کہا : جب میں نے اپنے رجزیہ اشعار ختم کیے تو رسول اللہ صلی اللہ علیہ وسلم نے پوچھا : \"\" یہ ( اشعار ) کس نے کہے؟ \"\" میں نے جواب دیا : میرے بھائی نے کہے ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" اللہ ان پر رحم کرے! \"\" کہا : تو میں نے کہا : اللہ کی قسم! اللہ کے رسول! کچھ لوگ اس کے لیے دعا کرتے ہوئے ڈر رہے تھے ، وہ کہہ رہے تھے : وہ آدمی اپنے ہی اسلحے سے فوت ہوا ہے ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" وہ تو جہاد کرتے ہوئے مجاہد کے طور پر فوت ہوا ہے ۔ \"\" ابن شہاب نے کہا : پھر میں نے سلمہ بن اکوع رضی اللہ عنہ کے ایک بیٹے سے سوال کیا تو انہوں نے مجھے اپنے والد سے اسی کے مانند حدیث بیان کی ، مگر انہوں نے ( حضرت سلمہ رضی اللہ عنہ کے الفاظ دہراتے ہوئے ) کہا : جب میں نے کہا : کچھ لوگ اس کے لیے دعا کرنے سے ڈرتے ہیں تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" ان لوگوں نے غلط کہا ، وہ تو جہاد کرتے ہوئے مجاہد کے طور پر فوت ہوئے ، ان کے لیے دہرا اجر ہے ۔ \"\" اور آپ نے اپنی دو انگلیوں سے اشارہ فرمایا.",
                "urduNarrator": "ابوطاہر نے مجھے حدیث بیان کی ، کہا : ہمیں ابن وہب نے خبر دی ، کہا : مجھے یونس نے ابن شہاب سے خبر دی ، کہا : مجھے عبدالرحمن نے خبر دی ۔ ۔ ابن وہب کے علاوہ دوسرے راوی نے ان کا نسب بیان کیا تو ( عبدالرحمن ) بن عبداللہ بن کعب بن مالک کہا ۔ ۔ کہ حضرت سلمہ بن اکوع رضی اللہ عنہ نے کہا",
                "hadithArabic": "وحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عَبْدُ الرَّحْمَنِ - وَنَسَبَهُ غَيْرُ ابْنِ وَهْبٍ -، فَقَالَ ابْنُ عَبْدِ اللهِ بْنِ كَعْبِ بْنِ مَالِكٍ، أَنَّ سَلَمَةَ بْنَ الْأَكْوَعِ، قَالَ: لَمَّا كَانَ يَوْمُ خَيْبَرَ قَاتَلَ أَخِي قِتَالًا شَدِيدًا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَارْتَدَّ عَلَيْهِ سَيْفُهُ فَقَتَلَهُ، فَقَالَ أَصْحَابُ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي ذَلِكَ، وَشَكُّوا فِيهِ رَجُلٌ مَاتَ فِي سِلَاحِهِ، وَشَكُّوا فِي بَعْضِ أَمْرِهِ، قَالَ سَلَمَةُ: فَقَفَلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنْ خَيْبَرَ، فَقُلْتُ: يَا رَسُولَ اللهِ، ائْذَنْ لِي أَنْ أَرْجُزَ لَكَ، فَأَذِنَ لَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ عُمَرُ بْنُ الْخَطَّابِ: أَعْلَمُ مَا تَقُولُ، قَالَ: فَقُلْتُ: [البحر الرجز] وَاللهِ لَوْلَا اللهُ مَا اهْتَدَيْنَا ... وَلَا تَصَدَّقْنَا وَلَا صَلَّيْنَا ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «صَدَقْتَ»، وَأَنْزِلَنْ سَكِينَةً عَلَيْنَا ، وَثَبِّتِ الْأَقْدَامَ إِنْ لَاقَيْنَا ، وَالْمُشْرِكُونَ قَدْ بَغَوْا عَلَيْنَا، قَالَ: فَلَمَّا قَضَيْتُ رَجَزِي، قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ قَالَ هَذَا؟» قُلْتُ: قَالَهُ أَخِي، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «يَرْحَمُهُ اللهُ»، قَالَ: فَقُلْتُ: يَا رَسُولَ اللهِ، إِنَّ نَاسًا لَيَهَابُونَ الصَّلَاةَ عَلَيْهِ، يَقُولُونَ: رَجُلٌ مَاتَ بِسِلَاحِهِ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَاتَ جَاهِدًا مُجَاهِدًا»، قَالَ ابْنُ شِهَابٍ ثُمَّ سَأَلْتُ ابْنًا لِسَلَمَةَ بْنَ اْلَأكْوَعِ. فَحَدَّثَني عَنْ أَبِيهِ مِثْلَ ذَلِكَ غَيْرَ أَنَّهُ قَالَ - حِينَ قُلْتُ: إِنَّ نَاسًا يَهَابُونَ الصَّلاةَ عَلَيْهِ - فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «كَذَبُوا مَاتَ جَاهِدًا مُجَاهِدًا، فَلَهُ أَجْرُهُ مَرَّتَيْنِ» وَأَشَارَ بِإِصْبَعَيْهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12234,
                "hadithNumber": "4670",
                "englishNarrator": "It has been reported on the authority of Barra' رضی اللہ عنہ who said:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was carrying the earth with us on the Day of Ahzab and the whiteness of his belly had been covered with earth. (While engaged in this toil) he was reciting: By God, if Thou hadst not guided us We would have neither been guided aright nor practiced charity, Nor offered prayers. Descend on us peace and tranquillity. Behold I these people (the Meccans) refused to follow us. According to another version, he recited: The chieftains (of the tribes) refused to follow us When they contemplated mischief, we rejected it. And with this (verse) he would raise his voice.",
                "hadithUrdu": "احزاب کے دن رسول اللہ صلی اللہ علیہ وسلم ہمارے ساتھ مٹی اٹھا کر پھینک رہے تھے ، ( اس ) مٹی نے بطن مبارک کی سفیدی کو چھپا لیا تھا اور آپ فرما رہے تھے : \"\" اللہ کی قسم! اگر تیرا کرم نہ ہوتا تو ہم ہدایت نہ پاتے ، نہ صدقہ کرتے ، نہ نماز پڑھتے ۔ ہم پر ضرور بالضرور سکینت نازل فرما ۔ ان لوگوں نے ہم پر ظؒم کیا ہے ۔ \"\" کہا : بسا اوقات آپ فرماتے : \"\" ان سرداروں نے ہم پر ( اپنا ظلم روکنے سے ) انکار کر دیا ، جب وہ فتنے کا ارادہ کرتے ہیں ہم اس ( میں پڑنے ) سے انکار کر دیتے ہیں ۔ \"\" آپ ان ( الفاظ ) پر اپنی آواز کو بلند فرما لیتے.",
                "urduNarrator": "ہم سے محمد بن المثنیٰ اور ابن بشار نے بیان کیا، اور یہ قول ابن المثنیٰ کا ہے، انہوں نے کہا: محمد بن جعفر نے ہمیں حدیث بیان کی ، کہا : ہمیں شعبہ نے ابواسحاق سے حدیث بیان کی ، انہوں نے کہا : میں نے حضرت براء رضی اللہ عنہ سے سنا ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، وَاللَّفْظُ لِابْنِ الْمُثَنَّى، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، قَالَ: سَمِعْتُ الْبَرَاءَ، قَالَ: كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْأَحْزَابِ يَنْقُلُ مَعَنَا التُّرَابَ، وَلَقَدْ وَارَى التُّرَابُ بَيَاضَ بَطْنِهِ، وَهُوَ يَقُولُ: وَاللهِ لَوْلَا أَنْتَ مَا اهْتَدَيْنَا، وَلَا تَصَدَّقْنَا وَلَا صَلَّيْنَا، فَأَنْزِلَنْ سَكِينَةً عَلَيْنَا، إِنَّ الْأُلَى قَدْ أَبَوْا عَلَيْنَا - قَالَ: وَرُبَّمَا قَالَ: إِنَّ الْمَلَا قَدْ أَبَوْا عَلَيْنَا - إِذَا أَرَادُوا فِتْنَةً أَبَيْنَا، وَيَرْفَعُ بِهَا صَوْتَهُ.",
                "headingArabic": "غَزْوَةِ الأَحْزَابِ وَهِيَ الْخَنْدَقُ ‏‏",
                "headingUrdu": "الاحزاب کی جنگ، جسے الخندق (خندق) بھی کہا جاتا ہے",
                "headingEnglish": "The Battle of Al-Ahzab (The Confederates), also known as Al-Khandaq (The Ditch)",
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12235,
                "hadithNumber": "4671",
                "englishNarrator": "It has been narrated on the authority of Abu Ishaq who said: I heard from Bara' a رضی اللہ عنہ similar tradition except that he said:",
                "hadithEnglish": "These people (the Meccans) rebelled against us.",
                "hadithUrdu": "\" بلاشبہ ان لوگوں نے ہم پر زیادتی کی ہے.",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا, عبدالرحمن بن مہدی نے ہمیں حدیث بیان کی ، کہا : ہمیں شعبہ نے ابواسحاق سے حدیث بیان کی ، انہوں نے کہا : میں نے حضرت براء رضی اللہ عنہ سے سنا ۔ ۔ انہوں نے اسی کے مانند بیان کیا ، البتہ ( اس روایت کے مطابق ) انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، قَالَ: سَمِعْتُ الْبَرَاءَ، فَذَكَرَ مِثْلَهُ، إِلَّا أَنَّهُ قَالَ: إِنَّ الْأُلَى قَدْ بَغَوْا عَلَيْنَا",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12236,
                "hadithNumber": "4672",
                "englishNarrator": "It has been reported on the authority of Sahl bin Sa'd رضی اللہ عنہ who said:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came to us while we were digging the ditch and were carrying the earth on our shoulders. (Seeing our condition), he said: O God, there is no life but the life of the Hereafter. So forgive Thou the Muhajirs and the Ansar.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ہمارے پاس تشریف لائے جبکہ ہم خندق کھود رہے تھے اور اپنے کندھوں پر مٹی اٹھا کر پھینک رہے تھے تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اے اللہ! زندگی تو صرف آخرت کی زندگی ہے ، اس لیے مہاجرین اور انصار کی مغفرت فرما.",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ القعْنبی نے بیان کیا، کہا کہ ہم سے عبدالعزیز بن ابی حازم نے اپنے والد سے بیان کیا, حضرت سہل بن سعد رضی اللہ عنہ سے روایت ہے ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ: جَاءَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ نَحْفِرُ الْخَنْدَقَ، وَنَنْقُلُ التُّرَابَ عَلَى أَكْتَافِنَا، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «اللهُمَّ، لَا عَيْشَ إِلَّا عَيْشُ الْآخِرَةِ، فَاغْفِرْ لِلْمُهَاجِرِينَ وَالْأَنْصَارِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12237,
                "hadithNumber": "4673",
                "englishNarrator": "It has been narrated on the authority of Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: O God, there is no life, but the life of the Hereafter, So forgive Thou the Ansar and the Muhajirs.",
                "hadithUrdu": "آپ نے فرمایا : \"\" اے اللہ! آخرت کی زندگی کے سوا کوئی زندگی نہیں ، تو انصار اور مہاجرین کو معاف فرما دے.",
                "urduNarrator": "ہم سے محمد بن مثنیٰ اور ابن بشار نے بیان کیا اور ہم سے شعبہ نے بیان کیا, معاویہ بن قرہ نے حضرت انس بن مالک رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، وَاللَّفْظُ لِابْنِ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: «اللهُمَّ لَا عَيْشَ إِلَّا عَيْشُ الْآخِرَهْ، فَاغْفِرْ لِلْأَنْصَارِ وَالْمُهَاجِرَهْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12238,
                "hadithNumber": "4674",
                "englishNarrator": "It was narrated from Qatadah:",
                "hadithEnglish": "Anas bin Malik رضی اللہ عنہ told us: The Messenger of Allah (ﷺ) is reported to have said: O God, there is no life but the life of the Hereafter, So grant honor to the Ansar and the Muhajirs.",
                "hadithUrdu": "ہم سے انس بن مالک رضی اللہ عنہ نے بیان کیا۔رسول اللہ صلی اللہ علیہ وسلم فرماتے تھے : \"\" اے اللہ! بےشک زندگی آخرت کی زندگی ہے ۔ \"\" شعبہ نے کہا : یا آپ صلی اللہ علیہ وسلم نے یوں فرمایا : \"\" اے اللہ! آخرت کی زندگی کے سوا کوئی زندگی ( حقیقی ) نہیں ، تو انصار اور مہاجرین کو عزت عطا فرما.",
                "urduNarrator": "ہم سے محمد بن مثنیٰ اور ابن بشار نے بیان کیا، انہوں نے کہا: ہم سے محمد بن جعفر نے بیان کیا, شعبہ نے ہمیں قتادہ سے حدیث بیان کی ، کہا  کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَ ابْنُ الْمُثَنَّى: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، أَخْبَرَنَا شُعْبَةُ، عَنْ قَتَادَةَ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ: «اللهُمَّ إِنَّ الْعَيْشَ عَيْشُ الْآخِرَةِ» قَالَ شُعْبَةُ: أَو قَالَ:«اللهُمَّ لَا عَيْشَ إِلَّا عَيْشُ الْآخِرَهْ، فَأَكْرِمِ الْأَنْصَارَ وَالْمُهَاجِرَهْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "33",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 133,
                    "chapterNumber": "33",
                    "chapterEnglish": "The Book Of Jihad And Expeditions",
                    "chapterUrdu": "جہاد اور اس کے دوران میں رسول اللہ صلی اللہ علیہ وسلم کے اختیار کردہ طریقے",
                    "chapterArabic": "كتاب الْجِهَادِ وَالسِّيَرِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 11926,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=477",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=475",
                "label": "475",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=476",
                "label": "476",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=477",
                "label": "477",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=478",
                "label": "478",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=479",
                "label": "479",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=480",
                "label": "480",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=481",
                "label": "481",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=479",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=479",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=477",
        "to": 11950,
        "total": 40465
    }
}