{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 555,
        "data": [
            {
                "id": 14139,
                "hadithNumber": "6576",
                "englishNarrator": "Jabir bin Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Be on your guard against committing oppression, for oppression is a darkness on the Day of Resurrection, and be on your guard against stinginess for stinginess destroyed those who were before you, as it incited them to shed blood and make lawful what was unlawful for them.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ظلم سے بچو ، کیونکہ ظلم قیامت کے دن ( دلوں پر چھانے والی ) ظلمتیں ہوں گی ۔ بخل اور ہوس سے بچو ، کیونکہ تم سے پہلے لوگوں کو بخل و ہوس نے ہلاک کر دیا ، اسی نے ان کو اکسایا تو انہوں نے اپنے ( ایک دوسرے کے ) خون بہائے اور اپنی حرمت والی چیزوں کو حلال کر لیا ۔ \"",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ بن  قعنب نے بیان کیا، کہا ہم سے داؤد نے، یعنی ابن قیس نے، عبید اللہ بن مقسم کی سند سے بیان کیا, حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ حَدَّثَنَا دَاوُدُ يَعْنِي ابْنَ قَيْسٍ عَنْ عُبَيْدِ اللَّهِ بْنِ مِقْسَمٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اتَّقُوا الظُّلْمَ فَإِنَّ الظُّلْمَ ظُلُمَاتٌ يَوْمَ الْقِيَامَةِ وَاتَّقُوا الشُّحَّ فَإِنَّ الشُّحَّ أَهْلَكَ مَنْ كَانَ قَبْلَكُمْ حَمَلَهُمْ عَلَى أَنْ سَفَكُوا دِمَاءَهُمْ وَاسْتَحَلُّوا مَحَارِمَهُمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14140,
                "hadithNumber": "6577",
                "englishNarrator": "Ibu 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Oppression is the darkness on the Day of Resurrection.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ظلم قیامت کے دن کئی ظلمتیں ( تاریکیاں ) ہوں گی ۔ \"",
                "urduNarrator": "ہم سے محمد بن حاتم نے بیان کیا، کہا ہم سے شبابہ نے بیان کیا، کہا ہم سے عبدالعزیز المجشن نے بیان کیا, عبداللہ بن دینار نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا شَبَابَةُ حَدَّثَنَا عَبْدُ الْعَزِيزِ الْمَاجِشُونُ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الظُّلْمَ ظُلُمَاتٌ يَوْمَ الْقِيَامَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14141,
                "hadithNumber": "6578",
                "englishNarrator": "Salim reported on the authority of his father:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: A Muslim is the brother of a fellow-Muslim. He should neither commit oppression upon him nor ruin him, and he who meets the need of a brother, Allah would meet big needs, and he who relieved a Muslim from hardship Allah would relieve him from the hardships to which he would be put on the Day of Resurrection, and he who did not expose (the follies of a Muslim) Allah would conceal his follies on the Day of Resurrection.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" مسلمان دوسرے مسلمان کا بھائی ہے ، نہ اس پر ظلم کرتا ہے ، نہ اسے ( ظالموں کے ) سپرد کرتا ہے ۔ جو شخص اپنے بھائی کی حاجت پوری کرنے میں لگا ہوتا ہے ، اللہ تعالیٰ اس کی حاجت روائی فرماتا ہے ۔ جو کسی مسلمان سے اس کی ایک تکلیف دور کرتا ہے ، اللہ تعالیٰ اس سے قیامت کی تکلیفوں میں سے ایک تکلیف دور کرتا ہے ۔ جو شخص کسی مسلمان کی پردہ پوشی کرتا ہے ، اللہ تعالیٰ قیامت کے دن اس ( کے عیبوں ) کی پردہ پوشی فرمائے گا ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ہم سے لیث نے بیان کیا، انہوں نے عقیل کی سند سے، وہ زہری کی سند سے, سالم نے اپنے والد سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ عَنْ عُقَيْلٍ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمُسْلِمُ أَخُو الْمُسْلِمِ لَا يَظْلِمُهُ وَلَا يُسْلِمُهُ مَنْ كَانَ فِي حَاجَةِ أَخِيهِ كَانَ اللَّهُ فِي حَاجَتِهِ وَمَنْ فَرَّجَ عَنْ مُسْلِمٍ كُرْبَةً فَرَّجَ اللَّهُ عَنْهُ بِهَا كُرْبَةً مِنْ كُرَبِ يَوْمِ الْقِيَامَةِ وَمَنْ سَتَرَ مُسْلِمًا سَتَرَهُ اللَّهُ يَوْمَ الْقِيَامَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14142,
                "hadithNumber": "6579",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) as saying: Do you know who is poor? They (the Companions of the Holy Prophet) said: A poor man amongst us is one who has neither dirham with him nor wealth. He (the Holy Prophet) said: The poor of my Umma would be he who would come on the Day of Resurrection with prayers and fasts and Zakat but (he would find himself bankrupt on that day as he would have exhausted his funds of virtues) since he hurled abuses upon others, brought calumny against others and unlawfully consumed the wealth of others and shed the blood of others and beat others, and his virtues would be credited to the account of one (who suffered at his hand). And if his good deeds fall short to clear the account, then his sins would be entered in (his account) and he would be thrown in the Hell-Fire.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کیا تم جانتے ہو کہ مفلس کون ہے؟ \" صحابہ نے کہا؛ ہمارے نزدیک مفلس وہ شخص ہے جس کے پاس نہ درہم ہو ، نہ کوئی سازوسامان ۔ آپ نے فرمایا : \" میری امت کا مفلس وہ شخص ہے جو قیامت کے دن نماز ، روزہ اور زکاۃ لے کر آئے گا اور اس طرح آئے گا کہ ( دنیا میں ) اس کو گالی دی ہو گی ، اس پر بہتان لگایا ہو گا ، اس کا مال کھایا ہو گا ، اس کا خون بہایا ہو گا اور اس کو مارا ہو گا ، تو اس کی نیکیوں میں سے اس کو بھی دیا جائے گا اور اس کو بھی دیا جائے گا اور اگر اس پر جو ذمہ ہے اس کی ادائیگی سے پہلے اس کی ساری نیکیاں ختم ہو جائیں گی تو ان کے گناہوں کو لے کر اس پر ڈالا جائے گا ، پھر اس کو جہنم میں پھینک دیا جائے گا ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید اور علی بن حجر نے بیان کیا، کہا: ہم سے اسماعیل نے جو جعفر کے بیٹے ہیں، اپنے والد کی سند سے علاء کی سند سے بیان کیا, حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَعَلِيُّ بْنُ حُجْرٍ قَالَا حَدَّثَنَا إِسْمَعِيلُ وَهُوَ ابْنُ جَعْفَرٍ عَنْ الْعَلَاءِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَتَدْرُونَ مَا الْمُفْلِسُ قَالُوا الْمُفْلِسُ فِينَا مَنْ لَا دِرْهَمَ لَهُ وَلَا مَتَاعَ فَقَالَ إِنَّ الْمُفْلِسَ مِنْ أُمَّتِي يَأْتِي يَوْمَ الْقِيَامَةِ بِصَلَاةٍ وَصِيَامٍ وَزَكَاةٍ وَيَأْتِي قَدْ شَتَمَ هَذَا وَقَذَفَ هَذَا وَأَكَلَ مَالَ هَذَا وَسَفَكَ دَمَ هَذَا وَضَرَبَ هَذَا فَيُعْطَى هَذَا مِنْ حَسَنَاتِهِ وَهَذَا مِنْ حَسَنَاتِهِ فَإِنْ فَنِيَتْ حَسَنَاتُهُ قَبْلَ أَنْ يُقْضَى مَا عَلَيْهِ أُخِذَ مِنْ خَطَايَاهُمْ فَطُرِحَتْ عَلَيْهِ ثُمَّ طُرِحَ فِي النَّارِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14143,
                "hadithNumber": "6580",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The claimants would get their claims on the Day of Resurrection so much so that the hornless sheep would get its claim from the horned sheep.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" قیامت کے دن تم سب حقداروں کے حقوق ان کو ادا کرو گے ، حتی کہ اس بکری کا بدلہ بھی جس کے سینگ توڑ دیے گئے ہوں گے ، سینگوں والی بکری سے پورا پورا لیا جائے گا ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن ایوب، قتیبہ اور ابن حجر نے بیان کیا، کہا: ہم سے اسماعیل نے بیان کیا، یعنی ہم سے ابن جعفر نے اپنے والد کی سند سے علاء کی سند سے بیان کیا, حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ وَابْنُ حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَعِيلُ يَعْنُونَ ابْنَ جَعْفَرٍ عَنْ الْعَلَاءِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَتُؤَدُّنَّ الْحُقُوقَ إِلَى أَهْلِهَا يَوْمَ الْقِيَامَةِ حَتَّى يُقَادَ لِلشَّاةِ الْجَلْحَاءِ مِنْ الشَّاةِ الْقَرْنَاءِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14144,
                "hadithNumber": "6581",
                "englishNarrator": "Abu Musa رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Allah, the Exalted and Glorious, grants respite to the oppressor. But when He lays Hand upon him, He does not then let him off. Re (the Holy Prophet) then recited this verse: Such is the chastisement of thy Lord when He chastises the towns (inhabited by) wrongdoing persons. Surely, His punishment is painful, severe (xi. 103).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ تعالیٰ ظالم کو مہلت دے دیتا ہے اور جب اس کو پکڑ لیتا ہے تو پھر جانے نہیں دیتا ۔ \" پھر آپ نے ( یہ آیت ) پڑھی : \" اور جب وہ ظلم کرنے والی بستیوں کو اپنی گرفت میں لیتا ہے تو آپ کے رب کی گرفت ایسی ہی ہوتی ہے ( کہ کوئی بچ نہیں سکتا ۔ ) بےشک اس کی گرفت سخت دردناک ہے ۔ \"",
                "urduNarrator": "ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا، ہم سے ابو معاویہ نے بیان کیا، ہم سے برید بن ابی بردہ نے اپنے والد سے بیان کیا, حضرت ابوموسیٰ رضی اللہ عنہ سے روایت ہے ، کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا بُرَيْدُ بْنُ أَبِي بُرْدَةَ عَنْ أَبِيهِ عَنْ أَبِي مُوسَى قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ عَزَّ وَجَلَّ يُمْلِي لِلظَّالِمِ فَإِذَا أَخَذَهُ لَمْ يُفْلِتْهُ ثُمَّ قَرَأَ وَكَذَلِكَ أَخْذُ رَبِّكَ إِذَا أَخَذَ الْقُرَى وَهِيَ ظَالِمَةٌ إِنَّ أَخْذَهُ أَلِيمٌ شَدِيدٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14145,
                "hadithNumber": "6582",
                "englishNarrator": "Jabir bin Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Two young men, one from the Muhajirin (emigrants) and the other one from the Angr (helpers) fell into dispute and the Muhajir called his fellow Muhajirin, and the Ansari (the helper) called the Ansar (for help). In the meanwhile, Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came there and said: What is this, the proclamation of the days of jahiliya (ignorance)? They said: Allah's Messenger, there is nothing serious. The two young men fell into dispute and the one struck at the back of the other. Thereupon he (the Holy Prophet) said: Well, a person should help his brother whether he is an oppressor or an oppressed. If he is the oppressor he should prevent him from doing it, for that is his help; and if he is the oppressed he should be helped (against oppression).",
                "hadithUrdu": "دو لڑکے آپس میں لڑ پڑے ، ایک لڑکا مہاجرین میں سے تھا اور دوسرا لڑکا انصار میں سے ۔ مہاجر نے پکار کر آواز دی : اے مہاجرین! اور انصاری نے پکار کر آواز دی : اے انصار! تو ( اچانک ) رسول اللہ صلی اللہ علیہ وسلم باہر تشریف لے آئے اور فرمایا : \" یہ کیا زمانہ جاہلیت کی سی چیخ و پکار ہے؟ \" انہوں نے عرض کی : نہیں ، اللہ کے رسول! بس یہ دو لڑکے آپس میں لڑ پڑے ہیں اور ایک نے دوسرے کی سرین پر ضرب لگائی ہے ، آپ نے فرمایا : \" کوئی ( بڑی ) بات نہیں ، اور ہر انسان کو اپنے بھائی کی ، خواہ وہ ظالم ہو یا مظلوم ، مدد کرنی چاہئے ، اگر اس کا بھائی ظالم ہو تو اسے ( ظلم سے ) روکے ، یہی اس کی مدد ہے ، اور اگر مظلوم ہو تو اس کی مدد کرے ۔ \"",
                "urduNarrator": "ہم سے احمد بن عبداللہ بن یونس نے بیان کیا، کہا ہم سے زہیر نے بیان کیا, ابوزبیر نے حضرت جابر رضی اللہ عنہ سے حدیث بیان کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَ اقْتَتَلَ غُلَامَانِ غُلَامٌ مِنْ الْمُهَاجِرِينَ وَغُلَامٌ مِنْ الْأَنْصَارِ فَنَادَى الْمُهَاجِرُ أَوْ الْمُهَاجِرُونَ يَا لَلْمُهَاجِرِينَ وَنَادَى الْأَنْصَارِيُّ يَا لَلْأَنْصَارِ فَخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَا هَذَا دَعْوَى أَهْلِ الْجَاهِلِيَّةِ قَالُوا لَا يَا رَسُولَ اللَّهِ إِلَّا أَنَّ غُلَامَيْنِ اقْتَتَلَا فَكَسَعَ أَحَدُهُمَا الْآخَرَ قَالَ فَلَا بَأْسَ وَلْيَنْصُرْ الرَّجُلُ أَخَاهُ ظَالِمًا أَوْ مَظْلُومًا إِنْ كَانَ ظَالِمًا فَلْيَنْهَهُ فَإِنَّهُ لَهُ نَصْرٌ وَإِنْ كَانَ مَظْلُومًا فَلْيَنْصُرْهُ.",
                "headingArabic": "نَصْرِ الأَخِ ظَالِمًا أَوْ مَظْلُومًا ‏‏",
                "headingUrdu": "اپنے بھائی کی حمایت کرنا چاہے وہ غلط کر رہا ہو یا غلط ہو رہا ہو۔",
                "headingEnglish": "Supporting One's Brother Whether He Is Doing Wrong Or Being Wronged",
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14146,
                "hadithNumber": "6583",
                "englishNarrator": "Jabir bin Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "We were along with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) in an expedition that a person from amongst the emigrants struck at the back of a person from the Ansir. The Ansiri said: O Ansar! And the Muhijir said: O Emigrants! Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: What are these proclamations of the Days of Ignorance? They said: Allah's Messenger, a person from the emigrants struck at the back of an Ansari, whereupon he said: It is something disgusting. 'Abdullah bin Ubayy heard it and said: They have indeed done it. By Allah, when we would return to Medina the respectable amongst them (the Ansar) would turn away the mean (the emigrants). Thereupon 'Umar said: Permit me so that I should strike the neck of this hypocrite. But he (the Holy Prophet) said: Leave him, the people may not say that Muhammad kills his companions.",
                "hadithUrdu": "ہم ایک غزوے ( غزوہ مریسیع ) میں نبی صلی اللہ علیہ وسلم کے ساتھ تھے ، وہاں ایک مہاجر نے ایک انصاری کی سرین پر ضرب لگائی ، انصاری نے کہا : اے انصار! ( آؤ ، مدد کرو ) اور مہاجر نے کہا : اے مہاجرو! ( آؤ ، مدد کرو ۔ ) رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" یہ کیا زمانہ جاہلیت کی طرح کی چیخ و پکار ہے؟ \"\" انہوں نے کہا : یا رسول اللہ! ایک مہاجر شخص نے ایک انصاری کی سرین پر مارا ہے ، آپ نے فرمایا : \"\" ( جب یہ اتنا چھوٹا سا معاملہ ہے تو جاہلی دور کی سی ) اس ( چیخ و پکار ) کو چھوڑو ۔ یہ ایک کریہہ اور بدبودار بات ہے ۔ \"\" عبداللہ بن اُبی نے یہ بات سنی تو کہنے لگا : ( اچھا! ) انہوں نے ( ایسا ) کیا ہے ، اللہ کی قسم! جب ہم مدینہ پہنچیں گے تو ہم میں سے عزت والا اسے ، جو ذلت والا ہے ، وہاں سے نکال باہر کرے گا ۔ حضرت عمر رضی اللہ عنہ نے کہا : مجھے چھوڑئیے ، میں اس منافق کی گردن اڑاتا ہوں ، آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" اسے رہنے دو ، کہیں لوگ یہ نہ کہیں کہ محمد ( صلی اللہ علیہ وسلم ) اپنے ہی ساتھیوں کو قتل کر رہے ہیں ۔ \"\"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، زہیر بن حرب، احمد بن عبدہ الضہبی اور ابن ابی عمر نے بیان کیا اور یہ قول ابن ابی شیبہ سے ہے۔ ہم سے ابن عبدہ نے بیان کیا اور دوسروں نے کہا, سفیان بن عیینہ نے کہا , عمرو ( بن دینار ) نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ وَأَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ وَابْنُ أَبِي عُمَرَ وَاللَّفْظُ لِابْنِ أَبِي شَيْبَةَ قَالَ ابْنُ عَبْدَةَ أَخْبَرَنَا و قَالَ الْآخَرُونَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ قَالَ سَمِعَ عَمْرٌو جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ كُنَّا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزَاةٍ فَكَسَعَ رَجُلٌ مِنْ الْمُهَاجِرِينَ رَجُلًا مِنْ الْأَنْصَارِ فَقَالَ الْأَنْصَارِيُّ يَا لَلْأَنْصَارِ وَقَالَ الْمُهَاجِرِيُّ يَا لَلْمُهَاجِرِينَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا بَالُ دَعْوَى الْجَاهِلِيَّةِ قَالُوا يَا رَسُولَ اللَّهِ كَسَعَ رَجُلٌ مِنْ الْمُهَاجِرِينَ رَجُلًا مِنْ الْأَنْصَارِ فَقَالَ دَعُوهَا فَإِنَّهَا مُنْتِنَةٌ فَسَمِعَهَا عَبْدُ اللَّهِ بْنُ أُبَيٍّ فَقَالَ قَدْ فَعَلُوهَا وَاللَّهِ لَئِنْ رَجَعْنَا إِلَى الْمَدِينَةِ لَيُخْرِجَنَّ الْأَعَزُّ مِنْهَا الْأَذَلَّ قَالَ عُمَرُ دَعْنِي أَضْرِبُ عُنُقَ هَذَا الْمُنَافِقِ فَقَالَ دَعْهُ لَا يَتَحَدَّثُ النَّاسُ أَنَّ مُحَمَّدًا يَقْتُلُ أَصْحَابَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14147,
                "hadithNumber": "6584",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "A person from the emigrants struck the back of an Ansari. He came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and asked for compensation. Thereupon Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Leave it. for it is something disgusting. Ibn Mansur said that in the narration transmitted on the authority of Amr (these words are also found): I heard Jabir رضی اللہ عنہ.",
                "hadithUrdu": "ایک مہاجر نے ایک انصاری کی سرین پر مارا ، وہ نبی صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور آپ سے بدلہ دلوانے کی درخواست کی ، ( رسول اللہ صلی اللہ علیہ وسلم نے ضروری کاروائی کے بعد ) لوگوں سے کہا : \"\" اس ( چیخ و پکار اور فساد انگیزی ) کو چھوڑ دو ، یہ ایک کریہہ اور بدبودار ( ھرکت ) ہے ۔ \"\" ابن منصور نے اپنی روایت میں عمرو سے روایت کرتے ہوئے صراحت کی کہ عمرو نے کہا : میں نے جابر رضی اللہ عنہ سے سنا ۔",
                "urduNarrator": "اسحٰق بن ابراہیم ، اسحٰق بن منصور اور محمد بن رافع نے ہمیں حدیث بیان کی ۔ ۔ ابن رافع نے کہا : ہمیں حدیث بیان کی جبکہ دوسرے دونوں نے کہا : خبر دی ۔ ۔ عبدالرزاق نے کہا : ہمیں معمر نے ایوب سے خبر دی ، انہوں نے عمرو بن دینار سے اور انہوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَإِسْحَقُ بْنُ مَنْصُورٍ وَمُحَمَّدُ بْنُ رَافِعٍ قَالَ ابْنُ رَافِعٍ حَدَّثَنَا و قَالَ الْآخَرَانِ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ أَيُّوبَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ كَسَعَ رَجُلٌ مِنْ الْمُهَاجِرِينَ رَجُلًا مِنْ الْأَنْصَارِ فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَهُ الْقَوَدَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَعُوهَا فَإِنَّهَا مُنْتِنَةٌ قَالَ ابْنُ مَنْصُورٍ فِي رِوَايَتِهِ عَمْرٌو قَالَ سَمِعْتُ جَابِرًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14148,
                "hadithNumber": "6585",
                "englishNarrator": "Abu Musa رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: A believer is like a brick for another believer, the one supporting the other.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ایک مسلمان دوسرے مسلمان کے لیے ایک عمارت کے مانند ہے ، جس کی ایک ( اینٹ ) دوسری ( اینٹ ) کو مضبوط کرتی ہے ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابو عامر اشعری نے بیان کیا، انہوں نے کہا کہ ہم سے عبداللہ بن ادریس اور ابو اسامہ ایچ نے بیان کیا، اور محمد بن عبداللہ نے الاعلیٰ ابو کریب ابن المبارک، ابن ادریس اور ابو اسامہ سب نے بریدد کی سند سے، ابو بردہ کی سند سے، ان کی سند سے, حضرت ابوموسیٰ رضی اللہ عنہ سے روایت ہے ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو عَامِرٍ الْأَشْعَرِيُّ قَالَا حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ وَأَبُو أُسَامَةَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ أَبُو كُرَيْبٍ حَدَّثَنَا ابْنُ الْمُبَارَكِ وَابْنُ إِدْرِيسَ وَأَبُو أُسَامَةَ كُلُّهُمْ عَنْ بُرَيْدٍ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَى قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُؤْمِنُ لِلْمُؤْمِنِ كَالْبُنْيَانِ يَشُدُّ بَعْضُهُ بَعْضًا.",
                "headingArabic": "تَرَاحُمِ الْمُؤْمِنِينَ وَتَعَاطُفِهِمْ وَتَعَاضُدِهِمْ ‏‏",
                "headingUrdu": "مومنین کی باہمی رحمت، ہمدردی اور حمایت",
                "headingEnglish": "The Mutual Mercy, Compassion And Support Of The Believers",
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14149,
                "hadithNumber": "6586",
                "englishNarrator": "Nu'man bin Bashir رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: The similitude of believers in regard to mutual love, affection, fellow-feeling is that of one body; when any limb of it aches, the whole body aches, because of sleeplessness and fever.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" مسلمانوں کی ایک دوسرے سے محبت ، ایک دوسرے کے ساتھ رحم دلی اور ایک دوسرے کی طرف التفات و تعاون کی مثال ایک جسم کی طرح ہے ، جب اس کے ایک عضو کو تکلیف ہوتی ہے تو باقی سارا جسم بیداری اور بخار کے ذریعے سے ( سب اعضاء کو ایک دوسرے کے ساتھ ملا کر ) اس کا ساتھ دیتا ہے ۔ \"",
                "urduNarrator": "ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا، کہا ہم سے میرے والد نے بیان کیا, زکریا نے ہمیں شعبی سے حدیث بیان کی ، انہوں نے حضرت نعمان بن بشیر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا زَكَرِيَّاءُ عَنْ الشَّعْبِيِّ عَنْ النُّعْمَانِ بْنِ بَشِيرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَثَلُ الْمُؤْمِنِينَ فِي تَوَادِّهِمْ وَتَرَاحُمِهِمْ وَتَعَاطُفِهِمْ مَثَلُ الْجَسَدِ إِذَا اشْتَكَى مِنْهُ عُضْوٌ تَدَاعَى لَهُ سَائِرُ الْجَسَدِ بِالسَّهَرِ وَالْحُمَّى.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14150,
                "hadithNumber": "6587",
                "englishNarrator": null,
                "hadithEnglish": "Nu'man bin Bashir رضی اللہ عنہ reported a hadith like this from Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ).",
                "hadithUrdu": "ہم سے اسحاق حنظلی نے بیان کیا، کہا ہم سے جریر نے بیان کیا, مطرف نے شعبی سے ، انہوں نے نعمان بن بشیر رضی اللہ عنہ سے ، انہوں نے نبی صلی اللہ علیہ وسلم سے اسی ( گزشتہ حدیث ) کی طرح روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا إِسْحَقُ الْحَنْظَلِيُّ أَخْبَرَنَا جَرِيرٌ عَنْ مُطَرِّفٍ عَنْ الشَّعْبِيِّ عَنْ النُّعْمَانِ بْنِ بَشِيرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14151,
                "hadithNumber": "6588",
                "englishNarrator": "Nu'man bin Bashir رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The believers are like one person; if his head aches, the whole body aches with fever and sleeplessness.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" مسلمان ( باہم ) ایک ہی انسان کی طرح ہیں ، اگر اس کے سر میں تکلیف ہو تو بخار اور بے خوابی کے ذریعے سے باقی سارا جسم اس کا ساتھ دیتا ہے ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابو سعید الاشجع نے بیان کیا، کہا:  وکیع نے اعمش سے ، انہوں نے شعبی سے ، انہوں نے حضرت نعمان بن بشیر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو سَعِيدٍ الْأَشَجُّ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ الْأَعْمَشِ عَنْ الشَّعْبِيِّ عَنْ النُّعْمَانِ بْنِ بَشِيرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُؤْمِنُونَ كَرَجُلٍ وَاحِدٍ إِنْ اشْتَكَى رَأْسُهُ تَدَاعَى لَهُ سَائِرُ الْجَسَدِ بِالْحُمَّى وَالسَّهَرِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14152,
                "hadithNumber": "6589",
                "englishNarrator": "Nu'man bin Bashir رضی اللہ عنہ reported:",
                "hadithEnglish": "The Messenger of Allah (ﷺ) said: Muslims are like one body of a person; if the eye is sore, the whole body aches, and if the head aches, the whole body aches.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" مسلمان ( باہم ) ایک انسان کی طرح ہیں ، اگر اس کی آنکھ میں تکلیف ہو تو سارے جسم کو تکلیف ہوتی ہے اور اگر سر میں تکلیف ہو تو اس کے سارے جسم کو تکلیف ہوتی ہے ۔ \"",
                "urduNarrator": "مجھ سے محمد بن عبداللہ بن نمیر نے بیان کیا، ہم سے حمید بن عبدالرحمٰن نے بیان کیا، اعمش کی سند سے,خیثمہ ( بن عبدالرحمٰن ) نے حضرت نعمان بن بشیر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ الْأَعْمَشِ عَنْ خَيْثَمَةَ عَنْ النُّعْمَانِ بْنِ بَشِيرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُسْلِمُونَ كَرَجُلٍ وَاحِدٍ إِنْ اشْتَكَى عَيْنُهُ اشْتَكَى كُلُّهُ وَإِنْ اشْتَكَى رَأْسُهُ اشْتَكَى كُلُّهُ ُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14153,
                "hadithNumber": "6590",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been narrated on the authority of Nu'man bin Bashir رضی اللہ عنہ through another chain of transmitters.",
                "hadithUrdu": ") شعبی نے حضرت نعمان بن بشیر رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے اسی طرح روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ الْأَعْمَشِ عَنْ الشَّعْبِيِّ عَنْ النُّعْمَانِ بْنِ بَشِيرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَه",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14154,
                "hadithNumber": "6591",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: When two persons indulge in hurling (abuses) upon one another, it would be the first one who would be the sinner so long as the oppressed does not transgress the limits.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ایک دوسرے کو برا بھلا کہنے والے جو کچھ بھی کہتے ہیں ، اس کا وبال پہل کرنے والے پر ہے جب تک مظلوم حد سے تجاوز نہ کرے ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن ایوب، قتیبہ اور ابن حجر نے بیان کیا، کہا: ہم سے اسماعیل نے بیان کیا، یعنی ہم سے ابن جعفر نے اپنے والد کی سند سے علاء کی سند سے بیان کیا, حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ وَابْنُ حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَعِيلُ يَعْنُونَ ابْنَ جَعْفَرٍ عَنْ الْعَلَاءِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمُسْتَبَّانِ مَا قَالَا فَعَلَى الْبَادِئِ مَا لَمْ يَعْتَدِ الْمَظْلُومُ.",
                "headingArabic": "النَّهْىِ عَنِ السِّبَابِ، ‏‏",
                "headingUrdu": "گالیاں دینے کی ممانعت",
                "headingEnglish": "The Prohibition Of Reviling",
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14155,
                "hadithNumber": "6592",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Charity does not in any way decrease the wealth and the servant who forgives Allah adds to his respect, and the one who shows humility Allah elevates him in the estimation (of the people).",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" صدقے نے مال میں کبھی کوئی کمی نہیں کی اور معاف کرنے سے اللہ تعالیٰ بندے کو عزت ہی میں بڑھاتا ہے اور کوئی شخص ( صرف اور صرف ) اللہ کی خاطر تواضع ( انکسار ) اختیار نہیں کرتا مگر اللہ تعالیٰ اس کا مقام بلند کر دیتا ہے ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن ایوب، قتیبہ اور ابن حجر نے بیان کیا، کہا: ہم سے اسماعیل نے جو جعفر کے بیٹے ہیں، اپنے والد کی سند سے علاء کی سند سے بیان کیا, حضرت ابوہریرہ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ وَابْنُ حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَعِيلُ وَهُوَ ابْنُ جَعْفَرٍ عَنْ الْعَلَاءِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا نَقَصَتْ صَدَقَةٌ مِنْ مَالٍ وَمَا زَادَ اللَّهُ عَبْدًا بِعَفْوٍ إِلَّا عِزًّا وَمَا تَوَاضَعَ أَحَدٌ لِلَّهِ إِلَّا رَفَعَهُ اللَّهُ.",
                "headingArabic": "اسْتِحْبَابِ الْعَفْوِ وَالتَّوَاضُعِ ‏‏",
                "headingUrdu": "عفو و درگزر کی خواہش",
                "headingEnglish": "It Is Recommended To Forgive And Be Humble",
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14156,
                "hadithNumber": "6593",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Do you know what is backbiting? They (the Companions) said: Allah and His Messenger know best. Thereupon he (the Holy Prophet) said: Backbiting implies your talking about your brother in a manner which he does not like. It was said to him: What is your opinion about this that if I actually find (that failing) in my brother which I made a mention of? He said: If (that failing) is actually found (in him) what you assert, you in fact backbited him, and if that is not in him it is a slander.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کیا تم جانتے ہو کہ غیبت کیا ہے؟ \" انہوں ( صحابہ ) نے عرض کی : اللہ اور اس کا رسول خوب جاننے والے ہیں ۔ آپ نے فرمایا : \" اپنے بھائی کا اس طرح تذکرہ کرنا جو اسے ناپسند ہو ۔ \" عرض کی گئی : آپ یہ دیکھئے کہ اگر میرے بھائی میں وہ بات واقعی موجود ہو جو میں کہتا ہوں ( تو؟ ) آپ نے فرمایا : \" جو کچھ تم کہتے ہو ، اگر اس میں موجود ہے تو تم نے اس کی غیبت کی ، اگر اس میں وہ ( عیب ) موجود نہیں تو تم نے اس پر بہتان لگایا ہے ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن ایوب، قتیبہ اور ابن حجر نے بیان کیا، کہا: ہم سے اسماعیل نے علاء کی سند سے، اپنے والد کی سند سے، ان سے بیان کیا: حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ وَابْنُ حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَعِيلُ عَنْ الْعَلَاءِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَتَدْرُونَ مَا الْغِيبَةُ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ ذِكْرُكَ أَخَاكَ بِمَا يَكْرَهُ قِيلَ أَفَرَأَيْتَ إِنْ كَانَ فِي أَخِي مَا أَقُولُ قَالَ إِنْ كَانَ فِيهِ مَا تَقُولُ فَقَدْ اغْتَبْتَهُ وَإِنْ لَمْ يَكُنْ فِيهِ فَقَدْ بَهَتَّهُ.",
                "headingArabic": "تَحْرِيمِ الْغِيبَةِ ‏‏",
                "headingUrdu": "غیبت کی ممانعت",
                "headingEnglish": "The Prohibition Of Backbiting",
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14157,
                "hadithNumber": "6594",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The servant (whose fault) Allah conceals in this world, Allah would also conceal (his faults) on the Day of Resurrection.",
                "hadithUrdu": "آپ نے فرمایا : \" اللہ تعالیٰ دنیا میں جس شخص کی پردہ پوشی کرتا ہے ، قیامت کے دن بھی اس کا پردہ رکھے گا ۔ \"",
                "urduNarrator": "مجھ سے امیہ بن بسطم العیشی نے بیان کیا، ہم سے یزید نے بیان کیا، یعنی ابن زرعی نے, رَوح ( بن قاسم ) نے سہیل سے ، انہوں نے اپنے والد ( ابوصالح ) سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے ، انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي أُمَيَّةُ بْنُ بِسْطَامٍ الْعَيْشِيُّ حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ حَدَّثَنَا رَوْحٌ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَسْتُرُ اللَّهُ عَلَى عَبْدٍ فِي الدُّنْيَا إِلَّا سَتَرَهُ اللَّهُ يَوْمَ الْقِيَامَةِ.",
                "headingArabic": "بِشَارَةِ مَنْ سَتَرَ اللَّهُ تَعَالَى عَيْبَهُ فِي الدُّنْيَا بِأَنْ يَسْتُرَ عَلَيْهِ فِي الآخِرَةِ",
                "headingUrdu": "بشارت ہے کہ اللہ جس کو دنیا میں چھپائے گا آخرت میں چھپائے گا۔",
                "headingEnglish": "Glad Tidings That Whomever Allah Conceals In This World He Will Conceal Him In The Hereafter",
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14158,
                "hadithNumber": "6595",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: The servant (who conceals) the faults of others in this world, Allah would conceal his faults on the Day of Resurrection.",
                "hadithUrdu": "آپﷺ نے فرمایا : \" دنیا میں کوئی بندہ کسی ( دوسرے ) بندے کا عیب نہیں چھپاتا مگر قیامت کے روز اللہ تعالیٰ اس کے عیب چھپا لے گا ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے عفان نے بیان کیا, وہیب نے کہا : ہمیں سہیل نے اپنے والد سے حدیث بیان کی ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَفَّانُ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا سُهَيْلٌ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَسْتُرُ عَبْدٌ عَبْدًا فِي الدُّنْيَا إِلَّا سَتَرَهُ اللَّهُ يَوْمَ الْقِيَامَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14159,
                "hadithNumber": "6596",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "A person sought permission from Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) to see him. He said: Grant him permission. (and also added: ) He is a bad son of his tribe or he is a bad person of his tribe. When he came in he used kind words for him. 'A'isha رضی اللہ عنہا reported that she said: Allah's Messenger, you said about him what you had to say and then you treated him with kindness. He said: A'isha رضی اللہ عنہا, verily in the eye of Allah, worst amongst the person in rank on the Day of Resurrection is one whom the people abandon or desert out of the fear of indecency.",
                "hadithUrdu": "ایک شخص نے نبی صلی اللہ علیہ وسلم سے ملاقات کی اجازت طلب کی ، آپ نے فرمایا : \" اس کو اجازت دے دو ، یہ یقینا اپنے قبیلے کا بُرا فرد ہے ، یا فرمایا : قبیلے کا برا مرد ہے ۔ \" جب وہ شخص اندر آیا تو آپ نے اس کے ساتھ نرمی سے گفتگو کی ۔ حضرت عائشہ رضی اللہ عنہا نے کہا : میں نے عرض کی : اللہ کے رسول! آپ نے اس کے بارے میں وہ فرمایا جو فرمایا تھا ، پھر آپ نے اس کے ساتھ نرمی سے بات کی؟ آپ نے فرمایا : \" عائشہ! قیامت کے دن اللہ تعالیٰ رتبے کے اعتبار سے سب سے برا شخص وہ ہو گا جس سے لوگ اس کی بدزبانی سے بچنے کے لیے دور رہیں یا اس کو چھوڑ دیں ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید، ابوبکر بن ابی شیبہ، عمرو ناقد، زہیر بن حرب اور ابن نمیر نے ابن عیینہ کی سند سے بیان کیا۔ اور الفاظ زہیر سے ہیں, سفیان بن عیینہ نے ابن منکدر سے روایت کی ، انہوں نے عروہ بن زبیر کو یہ کہتے ہوئے سنا کہ مجھے حضرت عائشہ رضی اللہ عنہا نے حدیث بیان کی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ وَابْنُ نُمَيْرٍ كُلُّهُمْ عَنْ ابْنِ عُيَيْنَةَ وَاللَّفْظُ لِزُهَيْرٍ قَالَ حَدَّثَنَا سُفْيَانُ وَهُوَ ابْنُ عُيَيْنَةَ عَنْ ابْنِ الْمُنْكَدِرِ سَمِعَ عُرْوَةَ بْنَ الزُّبَيْرِ يَقُولُ حَدَّثَتْنِي عَائِشَةُ أَنَّ رَجُلًا اسْتَأْذَنَ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ ائْذَنُوا لَهُ فَلَبِئْسَ ابْنُ الْعَشِيرَةِ أَوْ بِئْسَ رَجُلُ الْعَشِيرَةِ فَلَمَّا دَخَلَ عَلَيْهِ أَلَانَ لَهُ الْقَوْلَ قَالَتْ عَائِشَةُ فَقُلْتُ يَا رَسُولَ اللَّهِ قُلْتَ لَهُ الَّذِي قُلْتَ ثُمَّ أَلَنْتَ لَهُ الْقَوْلَ قَالَ يَا عَائِشَةُ إِنَّ شَرَّ النَّاسِ مَنْزِلَةً عِنْدَ اللَّهِ يَوْمَ الْقِيَامَةِ مَنْ وَدَعَهُ أَوْ تَرَكَهُ النَّاسُ اتِّقَاءَ فُحْشِهِ.",
                "headingArabic": "مُدَارَاةِ مَنْ يُتَّقَى فُحْشُهُ ‏‏",
                "headingUrdu": "دوسرے کے برے رویے سے خود کو بچانے کے لیے مہربان ہونا",
                "headingEnglish": "Being Kind To Protect Oneself From Another's Vile Behavior",
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14160,
                "hadithNumber": "6597",
                "englishNarrator": "A similar hadith (as no. 6596) was narrated from Ibn Al-Munkadir with this chain of narrators. But he did not say:",
                "hadithEnglish": "What a bad man of his tribe, or what a bad members of the tribe he is!",
                "hadithUrdu": "\" یہ قوم کا بدترین فرد ہے اور یہ گھرانے کا ( بدترین ) فرد ہے ۔ \"",
                "urduNarrator": "مجھ سے محمد بن رافع اور عبد بن حمید دونوں نے عبد الرزاق کی سند سے بیان کیا, معمر نے ابن منکدر سے اسی سند کے ساتھ اسی کے ہم معنی روایت بیان کی ، مگر انہوں نے کہا",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ وَعَبْدُ بْنُ حُمَيْدٍ كِلَاهُمَا عَنْ عَبْدِ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ ابْنِ الْمُنْكَدِرِ فِي هَذَا الْإِسْنَادِ مِثْلَ مَعْنَاهُ غَيْرَ أَنَّهُ قَالَ بِئْسَ أَخُو الْقَوْمِ وَابْنُ الْعَشِيرَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14161,
                "hadithNumber": "6598",
                "englishNarrator": "Jarir رضی اللہ عنہ reported from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ):",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: He who is deprived of tenderly feelings is in fact deprived of good",
                "hadithUrdu": "آپ نے فرمایا : \" جس شخص کو نرم خوئی سے محروم کر دیا جائے ، وہ بھلائی سے محروم کر دیا جاتا ہے ۔ \"",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا، کہا کہ مجھ سے یحییٰ بن سعید نے، سفیان کی سند سے, منصور نے تمیم بن سلمہ سے ، انہوں نے عبدالرحمٰن بن ہلال سے ، انہوں نے حضرت جریر رضی اللہ عنہ سے روایت کی ، انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنِي يَحْيَى بْنُ سَعِيدٍ عَنْ سُفْيَانَ حَدَّثَنَا مَنْصُورٌ عَنْ تَمِيمِ بْنِ سَلَمَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ هِلَالٍ عَنْ جَرِيرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ يُحْرَمْ الرِّفْقَ يُحْرَمْ الْخَيْرَ.",
                "headingArabic": "فَضْلِ الرِّفْقِ ‏‏",
                "headingUrdu": "نرمی کی فضیلت",
                "headingEnglish": "The Virtue Of Gentleness",
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14162,
                "hadithNumber": "6599",
                "englishNarrator": "Jarir رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: He who is deprived of tenderly feelings is in fact deprived of good",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ فرما رہے تھے : \" جو شخص نرم خوئی سے محروم کر دیا جائے وہ بھلائی سے محروم کر دیا جاتا ہے ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، ابو سعید اشجع اور محمد بن عبداللہ بن نمیر نے بیان کیا، انہوں نے کہا: ہم سے وکیع نے بیان کیا، اور انہوں نے کہا: ہم سے کریب، ابو معاویہ نے بیان کیا، کہا ہم سے ابو سعید اشجع نے بیان کیا، کہا کہ ہم سے حفص یعنی ابن غیث نے بیان کیا، یہ سب اعمش کی سند سے ہیں,ہم سے زہیر بن حرب اور اسحاق بن ابراہیم نے بیان کیا، اور ان کا قول زہیر نے بیان کیا، کہا کہ ہم سے اسحاق نے بیان کیا، ہم سے جریر نے بیان کیا۔ اعمش نے تمیم بن سلمہ سے ، انہوں نے عبدالرحمٰن بن ہلال عبسی سے روایت کی ، انہوں نے کہا : میں نے حضرت جریر رضی اللہ عنہ سے سنا ، وہ کہتے ہیں",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو سَعِيدٍ الْأَشَجُّ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ قَالُوا حَدَّثَنَا وَكِيعٌ ح و حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ ح و حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ حَدَّثَنَا حَفْصٌ يَعْنِي ابْنَ غِيَاثٍ كُلُّهُمْ عَنْ الْأَعْمَشِ و حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ وَاللَّفْظُ لَهُمَا قَالَ زُهَيْرٌ حَدَّثَنَا و قَالَ إِسْحَقُ أَخْبَرَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ تَمِيمِ بْنِ سَلَمَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ هِلَالٍ الْعَبْسِيِّ قَالَ سَمِعْتُ جَرِيرًا يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ يُحْرَمْ الرِّفْقَ يُحْرَمْ الْخَيْرَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14163,
                "hadithNumber": "6600",
                "englishNarrator": "Jarir bin 'Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who is deprived of tenderly feelings is in fact deprived of good and he who is deprived of tenderly feelings is in fact deprived of good.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جو شخص نرم مزاجی سے محروم ہوا وہ بھلائی سے محروم ہوا ، یا جو شخص نرم مزاجی سے محروم کر دیا جاتا ہے وہ بھلائی سے محروم کر دیا جاتا ہے ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا ہم سے عبد الواحد بن زیاد نے بیان کیا, محمد بن اسماعیل نے عبدالرحمٰن بن ہلال سے روایت کی ، انہوں نے کہا : میں نے حضرت جریر بن عبداللہ رضی اللہ عنہ کو یہ کہتے ہوئے سنا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ عَنْ مُحَمَّدِ بْنِ أَبِي إِسْمَعِيلَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ هِلَالٍ قَالَ سَمِعْتُ جَرِيرَ بْنَ عَبْدِ اللَّهِ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ حُرِمَ الرِّفْقَ حُرِمَ الْخَيْرَ أَوْ مَنْ يُحْرَمْ الرِّفْقَ يُحْرَمْ الْخَيْرَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 146,
                    "chapterNumber": "46",
                    "chapterEnglish": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship",
                    "chapterUrdu": "حسن سلوک، صلہ رحمی اور ادب",
                    "chapterArabic": "كتاب الْبِرِّ وَالصِّلَةِ وَالْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 13851,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=554",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=552",
                "label": "552",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=553",
                "label": "553",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=554",
                "label": "554",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=555",
                "label": "555",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=556",
                "label": "556",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=557",
                "label": "557",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=558",
                "label": "558",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=556",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=556",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=554",
        "to": 13875,
        "total": 40465
    }
}