{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 515,
        "data": [
            {
                "id": 13139,
                "hadithNumber": "5576",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been transmitted on the authority of Abdullah رضی اللہ عنہ .",
                "hadithUrdu": "ہم سے شیبان بن فروخ نے بیان کیا، ان سے جریر نے، یعنی ہم سے ابن حازم نے بیان کیا, اعمش نے ابراہیم سے ، انھوں نے علقمہ سے ، انھوں نے حضرت عبداللہ بن مسعود رضی اللہ عنہ سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے ان سب کی حدیث کی طرح روایت کیا ہے ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا جَرِيرٌ يَعْنِي ابْنَ حَازِمٍ حَدَّثَنَا الْأَعْمَشُ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِ حَدِيثِهِمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13140,
                "hadithNumber": "5577",
                "englishNarrator": "Jabir bin Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) reprimanded that a woman should add anything to her head (in the form of artificial hair).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے عورت کو اپنے سر ( کے بالوں ) کے ساتھ کسی بھی چیز کو جوڑنے سے سختی کے ساتھ منع فرمایا ۔",
                "urduNarrator": "مجھ سے حسن بن علی الحلوانی اور محمد بن رافع نے بیان کیا، کہا: ہم سے عبدالرزاق نے بیان کیا، ہم سے ابن جریج نے بیان کیا، انہوں نے مجھ سے بیان کیا,  ابو زبیر نے بتایا کہ انھوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ کویہ کہتے ہوئے سنا کہ",
                "hadithArabic": "و حَدَّثَنِي الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ وَمُحَمَّدُ بْنُ رَافِعٍ قَالَا أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ زَجَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تَصِلَ الْمَرْأَةُ بِرَأْسِهَا شَيْئًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13141,
                "hadithNumber": "5578",
                "englishNarrator": "Abdul-Rahman bin 'Auf said:",
                "hadithEnglish": "He heard Mu'awiya bin Abi Sufyan رضی اللہ عنہ during the season of Hajj, (saying) as he sat upon the pulpit holding a bunch of hair in his hand which was (previously) in the hand of his sentinel: O people of Medina, where are your scholars? I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbidding this and saying: That the people of Bani Isra'il were ruined at the time when their women wore such hair.",
                "hadithUrdu": "انھوں نے حضرت معاویہ بن ابوسفیان رضی اللہ عنہ سے ، جس سال انھوں نے حج کیا ، سنا ، وہ منبر پر تھے ، انھوں نے بالوں کی کٹی ہوئی ایک لٹ پکڑی جو ایک محافظ کے ہاتھ میں تھی ( جسے عورتیں بالوں سے جوڑتی تھیں ) اور کہہ رہے تھے : مدینہ والو! تمہارے علماء کہاں ہیں؟میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے ، آپ ان ( لٹوں وغیرہ ) سے منع فرماتے تھے اورفرمارہے تھے : \" جب بنی اسرائیل کی عورتوں نے ان کو اپنا نا شروع کیا تو وہ ہلاک ہوگئے ۔ \" ( جب جھوٹ کی بنیادوں پر تعمیر عیش وتنعم کا یہ مرحلہ آگیا تو زوال بھی آگیا ۔ )",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا: میں نے پڑھا: امام مالک رحمۃ اللہ علیہ نے ابن شہاب سے ، انھوں نے حمید بن عبدالرحمن بن عوف سے روایت کی",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ أَنَّهُ سَمِعَ مُعَاوِيَةَ بْنَ أَبِي سُفْيَانَ عَامَ حَجَّ وَهُوَ عَلَى الْمِنْبَرِ وَتَنَاوَلَ قُصَّةً مِنْ شَعَرٍ كَانَتْ فِي يَدِ حَرَسِيٍّ يَقُولُ يَا أَهْلَ الْمَدِينَةِ أَيْنَ عُلَمَاؤُكُمْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَى عَنْ مِثْلِ هَذِهِ وَيَقُولُ إِنَّمَا هَلَكَتْ بَنُو إِسْرَائِيلَ حِينَ اتَّخَذَ هَذِهِ نِسَاؤُهُمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13142,
                "hadithNumber": "5579",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been transmitted on the authority of Zuhri but with a slight variation of wording.",
                "hadithUrdu": "ہم سے ابن ابی عمر نے بیان کیا, سفیان بن عینیہ ، یونس اور معمر ، ان سب نے زہری سے مالک کی حدیث کے مانند بیان کیا مگر معمر کی حدیث میں : \" بنی اسرائیل کو عذاب میں مبتلا کردیا گیا \" کے الفاظ ہیں ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ ح و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ ح و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ كُلُّهُمْ عَنْ الزُّهْرِيِّ بِمِثْلِ حَدِيثِ مَالِكٍ غَيْرَ أَنَّ فِي حَدِيثِ مَعْمَرٍ إِنَّمَا عُذِّبَ بَنُو إِسْرَائِيلَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13143,
                "hadithNumber": "5580",
                "englishNarrator": "Sa'id bin Musayyib reported:",
                "hadithEnglish": "Mu'awiya رضی اللہ عنہ came to Medina and he addressed us and he took out a bunch of hair and said: What do I see that one of you does but that what the Jews did? (I can well recall) that when this act (adding of artificial hair) reached Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), he named it as cheating.",
                "hadithUrdu": "حضرت معاویہ رضی اللہ عنہ مدینے آئے ، ہمیں خطبہ دیا اور بالوں کاایک گچھہ نکال کرفرمایا : میں نہیں سمجھتا تھا کہ یہود کے علاوہ کوئی اور بھی ایسا کرتا ہے رسول اللہ صلی اللہ علیہ وسلم کو اس کی خبر پہنچی تو آپ نے اس کو جھوٹ ( فریب کاری ) کا نام دیا تھا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے غندر نے شعبہ  کی سند سے بیان کیا اور ہم سے ابن المثنیٰ اور ابن بشر نے بیان کیا، کہا کہ محمد بن ہم سے جعفر شعبہ نے بیان کیا, عمرو بن مرہ نے سعید بن مسیب سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا غُنْدَرٌ عَنْ شُعْبَةَ و حَدَّثَنَا ابْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ قَالَ قَدِمَ مُعَاوِيَةُ الْمَدِينَةَ فَخَطَبَنَا وَأَخْرَجَ كُبَّةً مِنْ شَعَرٍ فَقَالَ مَا كُنْتُ أُرَى أَنَّ أَحَدًا يَفْعَلُهُ إِلَّا الْيَهُودَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَلَغَهُ فَسَمَّاهُ الزُّورَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13144,
                "hadithNumber": "5581",
                "englishNarrator": "Sa,id bin Musayyib reported:",
                "hadithEnglish": "Mu'awiya رضی اللہ عنہ said one day: Should I narrate to you the evil make-up. Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) forbade cheating. It was during that time that a person came with a staff and there was a cloth on its head, whereupon Muawiya رضی اللہ عنہ said: Behold, that is cheating. Qatada said: This implies how women artificially increase their hair with the help of rags.",
                "hadithUrdu": "ایک دن حضرت معاویہ رضی اللہ عنہ نے فرمایا : تم لوگوں نے ایک بری ہیت نکال لی ہے ، نبی کریم صلی اللہ علیہ وسلم نے جھوٹ سے منع فرمایا ہے ، پھر ایک شخص عصا لیے ہوئے آیا جس کے سرے پر کپڑے کی ایک دھجی ( لیر ) تھی ۔ حضرت معاویہ رضی اللہ تعالیٰ عنہ نے کہا : سنو! یہ جھوٹ ہے ۔ قتادہ نے کہا : اس سے مراد وہ دھجیاں ( لیریں ) ہیں جن کے ذریعے سے عورتیں اپنے بالوں کو زیادہ کرتی ہیں ۔",
                "urduNarrator": "مجھ سے ابو غسان المسمعی اور محمد بن المثنیٰ نے بیان کیا، کہا: ہم سے معاذ نے جو ابن ہشام ہیں، بیان کیا, قتادہ نے سعید بن مسیب سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنِي أَبُو غَسَّانَ الْمِسْمَعِيُّ وَمُحَمَّدُ بْنُ الْمُثَنَّى قَالَا أَخْبَرَنَا مُعَاذٌ وَهُوَ ابْنُ هِشَامٍ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّ مُعَاوِيَةَ قَالَ ذَاتَ يَوْمٍ إِنَّكُمْ قَدْ أَحْدَثْتُمْ زِيَّ سَوْءٍ وَإِنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الزُّورِ قَالَ وَجَاءَ رَجُلٌ بِعَصًا عَلَى رَأْسِهَا خِرْقَةٌ قَالَ مُعَاوِيَةُ أَلَا وَهَذَا الزُّورُ قَالَ قَتَادَةُ يَعْنِي مَا يُكَثِّرُ بِهِ النِّسَاءُ أَشْعَارَهُنَّ مِنْ الْخِرَقِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13145,
                "hadithNumber": "5582",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) having said this: Two are the types of the denizens of Hell whom I did not see: people having flogs like the tails of the ox with them and they would be beating people, and the women who would be dressed but appear to be naked, who would be inclined (to evil) and make their husbands incline towards it. Their heads would be like the humps of the bukht camel inclined to one side. They will not enter Paradise and they would not smell its odour whereas its odour would be smelt from such and such distance.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : دوزخیوں کی دو قسمیں ہیں جن کو میں نے نہیں دیکھا ۔ ایک تو وہ لوگ جن کے پاس بیلوں کی دموں کی طرح کے کوڑے ہیں ، وہ لوگوں کو اس سے مارتے ہیں دوسرے وہ عورتیں جو پہنتی ہیں مگر ننگی ہیں ( یعنی ستر کے لائق لباس نہیں ہیں ) ، سیدھی راہ سے بہکانے والی ، خود بہکنے والی اور ان کے سر بختی ( اونٹ کی ایک قسم ہے ) اونٹ کی کوہان کی طرح ایک طرف جھکے ہوئے وہ جنت میں نہ جائیں گی بلکہ اس کی خوشبو بھی ان کو نہ ملے گی حالانکہ جنت کی خوشبو اتنی دور سے آ رہی ہو گی ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے جریر نے سہیل سے، ان کے والد سے، ان کی سند سے, سیدنا ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صِنْفَانِ مِنْ أَهْلِ النَّارِ لَمْ أَرَهُمَا قَوْمٌ مَعَهُمْ سِيَاطٌ كَأَذْنَابِ الْبَقَرِ يَضْرِبُونَ بِهَا النَّاسَ وَنِسَاءٌ كَاسِيَاتٌ عَارِيَاتٌ مُمِيلَاتٌ مَائِلَاتٌ رُءُوسُهُنَّ كَأَسْنِمَةِ الْبُخْتِ الْمَائِلَةِ لَا يَدْخُلْنَ الْجَنَّةَ وَلَا يَجِدْنَ رِيحَهَا وَإِنَّ رِيحَهَا لَيُوجَدُ مِنْ مَسِيرَةِ كَذَا وَكَذَا.",
                "headingArabic": "النِّسَاءِ الْكَاسِيَاتِ الْعَارِيَاتِ الْمَائِلاَتِ الْمُمِيلاَتِ ‏‏",
                "headingUrdu": "وہ عورتیں جو کپڑے پہن کر بھی ننگی ہوں، نیکی سے منہ موڑتی ہوں اور دوسروں کو گمراہ کرتی ہوں",
                "headingEnglish": "Women Who Are Clothed Yet Naked, Turning Away From Righteousness And Leading Others Astray",
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13146,
                "hadithNumber": "5583",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "A woman said: Allah's Messenger, may I say to my (co-wife) that my husband has given me (such and such) a thing but which he has not in fact gives me? 'Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: The one who makes a false statement of that which one has not been given is like one who wears a garment of falsehood.",
                "hadithUrdu": "ایک عورت نے کہا : اللہ کے رسول صلی اللہ علیہ وسلم ! ( اگر ) میں یہ کہوں : مجھے ( یہ سب ) میرےخاوند نے دیا ہے جو اس نے نہیں دیا؟تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جو ( کھانا ) نہیں ملا ، خود کو اس سے سیر ظاہر کرنے والا ، جھوٹ کے دو کپڑے پہننے والے کی طرح ہے ۔ \"",
                "urduNarrator": "ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا، ان سے وکیع نے اور ہم سے عبدہ نے ہشام بن عروہ سے بیان کیا, حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا وَكِيعٌ وَعَبْدَةُ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّ امْرَأَةً قَالَتْ يَا رَسُولَ اللَّهِ أَقُولُ إِنَّ زَوْجِي أَعْطَانِي مَا لَمْ يُعْطِنِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُتَشَبِّعُ بِمَا لَمْ يُعْطَ كَلَابِسِ ثَوْبَيْ زُورٍ.",
                "headingArabic": "النَّهْىِ عَنِ التَّزْوِيرِ، فِي اللِّبَاسِ وَغَيْرِهِ وَالتَّشَبُّعِ بِمَا لَمْ يُعْطَ ‏.‏",
                "headingUrdu": "جھوٹ وغیرہ کا لباس پہننے کی ممانعت اور جو کسی کو نہ دیا گیا ہو اس کا بہانہ کرنا",
                "headingEnglish": "The Prohibition Of Wearing A Garment Of Falsehood Etc., And Pretending To Have That Which Has Not Been Given To One",
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13147,
                "hadithNumber": "5584",
                "englishNarrator": "Asma' رضی اللہ عنہا reported:",
                "hadithEnglish": "A woman came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: I have a co-wife. Is there any harm for me if I give her the false impression (of getting something from my husband which he has not in fact given me)? Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: The one who creates such a (false impression) of receiving what one has not been given is like one who wears the garment of falsehood",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کے پاس ایک عورت آئی اور اس نے کہا : میری ایک سوکن ہے ، کیا مجھے اس بات پر گناہ ہوگا کہ میں خود کو ا پنے خاوند کے ایسے مال سے سیر ہوجانے والی ظاہر کروں جو اس نے مجھے نہیں دیا؟تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جو نہیں دیا گیا اس ( مال یاکھانے ) سے خود کو سیر ظاہر کرنے والا جھوٹ کے دو کپڑے پہننے والے کی طرح ہے ۔ \"",
                "urduNarrator": "ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا, عبدہ نے کہا : ہمیں ہشام نے فاطمہ سے حدیث بیان کی ، انھوں نے حضرت اسماء رضی اللہ عنہا سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا عَبْدَةُ حَدَّثَنَا هِشَامٌ عَنْ فَاطِمَةَ عَنْ أَسْمَاءَ جَاءَتْ امْرَأَةٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ إِنَّ لِي ضَرَّةً فَهَلْ عَلَيَّ جُنَاحٌ أَنْ أَتَشَبَّعَ مِنْ مَالِ زَوْجِي بِمَا لَمْ يُعْطِنِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُتَشَبِّعُ بِمَا لَمْ يُعْطَ كَلَابِسِ ثَوْبَيْ زُورٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13148,
                "hadithNumber": "5585",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been reported on the authority of Hisham with the same chain of transmitters.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, ابو اسامہ اورابو معاویہ ، دونوں نے ہشام سے ، اس سند کے ساتھ روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ ح و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا أَبُو مُعَاوِيَةَ كِلَاهُمَا عَنْ هِشَامٍ بِهَذَا الْإِسْنَادِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 138,
                    "chapterNumber": "38",
                    "chapterEnglish": "The Book of Clothes and Adornment",
                    "chapterUrdu": "لباس اور زینت کے احکام",
                    "chapterArabic": "كتاب اللِّبَاسِ وَالزِّينَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13149,
                "hadithNumber": "5586",
                "englishNarrator": "Anas  رضی اللہ عنہ reported:",
                "hadithEnglish": "A person at Baqi' called another person as Abu'l- Qasim, and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) turned towards him. He (the person who had uttered these words) said: Messenger of Allah, I did not mean you, but I called such and such (person), whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: You may call yourself by my name, but not by my kunya.",
                "hadithUrdu": "بقیع میں ایک شخص نے دوسرے شخص کو یا ابالقاسم کہہ کر آوازدی ، رسول اللہ صلی اللہ علیہ وسلم ( اس آواز پر ) اس ( آدمی ) کی طرف متوجہ ہو ئے تو اس شخص نے کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! میرا مقصود آپ کو پکارنا نہ تھا ، میں نے تو فلاں کو آوزادی ہے تو رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" میرے نام پر نام رکھو اور میری کنیت پر ( اپنی ) کنیت نہ رکھو ۔ \"",
                "urduNarrator": "مجھ سے ابو کریب محمد بن الاعلٰی اور ابن ابی عمر نے بیان کیا کہ انہوں نے ہمیں خبر دی اور ابن ابی عمر نے کہا کہ انہوں نے ہم سے بیان کیا اور اس کا تلفظ یہ ہے کہ انہوں نے ہم سے بیان کیا۔ مروان یعنیان الفزاری حمید  , حضرت انس رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنِي أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ وَابْنُ أَبِي عُمَرَ قَالَ أَبُو كُرَيْبٍ أَخْبَرَنَا و قَالَ ابْنُ أَبِي عُمَرَ حَدَّثَنَا وَاللَّفْظُ لَهُ قَالَا حَدَّثَنَا مَرْوَانُ يَعْنِيَانِ الْفَزَارِيَّ عَنْ حُمَيْدٍ عَنْ أَنَسٍ قَالَ نَادَى رَجُلٌ رَجُلًا بِالْبَقِيعِ يَا أَبَا الْقَاسِمِ فَالْتَفَتَ إِلَيْهِ رَسُولُ اللَّهِ فَقَالَ يَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي لَمْ أَعْنِكَ إِنَّمَا دَعَوْتُ فُلَانًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَسَمَّوْا بِاسْمِي وَلَا تَكَنَّوْا بِكُنْيَتِي.",
                "headingArabic": "النَّهْىِ عَنِ التَّكَنِّي، بِأَبِي الْقَاسِمِ وَبَيَانِ مَا يُسْتَحَبُّ مِنَ الأَسْمَاءِ",
                "headingUrdu": "کنیہ ابوالقاسم لینے کی ممانعت اور وہ نام جو مستحب ہیں",
                "headingEnglish": "The Prohibition Of Taking The Kunyah Abul-Qasim, And The Names Which Are Recommended",
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13150,
                "hadithNumber": "5587",
                "englishNarrator": "Ibn Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: The names dearest to Allah are 'Abdullah and 'Abdul-Rahman.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : : \" تمھا رے ناموں میں سے اللہ تعا لیٰ کے نزدیک سب سے زیادہ پسندیدہ نام عبد اللہ اور عبدالرحمن ہیں ۔ \"",
                "urduNarrator": "مجھ سے ابراہیم بن زیاد نے جس کا نام  بسبلان ہے، ہم سے عباد بن عباد نے بیان کیا، انہوں نے عبید اللہ بن عمر سے اور ان کے بھائی عبداللہ نے ان سے سنا۔ ان میں سے ایک سو چوالیس سال ہے، نافع کی روایت سے, حضرت عبد اللہ بن عمر رضی اللہ عنہ سے روایت ہے کہا",
                "hadithArabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ زِيَادٍ وَهُوَ الْمُلَقَّبُ بِسَبَلَانَ أَخْبَرَنَا عَبَّادُ بْنُ عَبَّادٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ وَأَخِيهِ عَبْدِ اللَّهِ سَمِعَهُ مِنْهُمَا سَنَةَ أَرْبَعٍ وَأَرْبَعِينَ وَمِائَةٍ يُحَدِّثَانِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَحَبَّ أَسْمَائِكُمْ إِلَى اللَّهِ عَبْدُ اللَّهِ وَعَبْدُ الرَّحْمَنِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13151,
                "hadithNumber": "5588",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "A child was born to a person amongst us and he gave him the name of Muhammad. Thereupon his people said: We will not allow You to give the name of Muhammad (to your child) after the name of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). He set forth with his son carrying him on his back and came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), and said: Allah's Messenger a son has been born to me and I have given him the name after the name of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Give him my name but do not give him my kunya, for I am Qasim in the sense that I distribute (the spoils of war) and the dues of Zakat amongst you.",
                "hadithUrdu": "ہم ( انصار ) میں سے ایک شخص کے ہاں لڑکا پیدا ہوا ، اس نے اس کا نام محمد رکھا ، اس کی قوم نے اس سے کہا : تم نے اپنے بیٹے کا نام رسول اللہ صلی اللہ علیہ وسلم کے نام پر رکھا ہے ، ہم تمھیں رسول اللہ صلی اللہ علیہ وسلم کے نام پر نام نہیں رکھنے دیں گے ، وہ شخص اپنے بیٹے کو اپنی پیٹھ پر اٹھا کر ( کندھےپر چڑھا کر ) رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! میرے ہاں ایک لڑکا پیدا ہوا ہے میں نے اس کا نام محمد رکھا ہے ، اس پر میری قوم نے کہا ہے : ہم تمھیں رسول اللہ صلی اللہ علیہ وسلم کے نام پر نام نہیں رکھنے دیں گے ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" میرے نام پر نام رکھو اور میری کنیت پر ( اپنی ) کنیت نہ رکھو ۔ بے شک میں تقسیم کرنے والا ہوں ( جو اللہ عطاکرتا ہے ، اسے ) تمھا رے درمیان تقسیم کرتا ہوں ۔ \"",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ اور اسحاق بن ابراہیم نے بیان کیا، انہوں نے کہا کہ ہم سے اسحاق نے بیان کیا، انہیں جریر نے خبر دی, منصور نے سالم بن ابی جعد سے ، انھوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ عُثْمَانُ حَدَّثَنَا و قَالَ إِسْحَقُ أَخْبَرَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ وُلِدَ لِرَجُلٍ مِنَّا غُلَامٌ فَسَمَّاهُ مُحَمَّدًا فَقَالَ لَهُ قَوْمُهُ لَا نَدَعُكَ تُسَمِّي بِاسْمِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَانْطَلَقَ بِابْنِهِ حَامِلَهُ عَلَى ظَهْرِهِ فَأَتَى بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ وُلِدَ لِي غُلَامٌ فَسَمَّيْتُهُ مُحَمَّدًا فَقَالَ لِي قَوْمِي لَا نَدَعُكَ تُسَمِّي بِاسْمِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَسَمَّوْا بِاسْمِي وَلَا تَكْتَنُوا بِكُنْيَتِي فَإِنَّمَا أَنَا قَاسِمٌ أَقْسِمُ بَيْنَكُمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13152,
                "hadithNumber": "5589",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "A child was born to one of the persons amongst us and he decided to give him the name of Muhammad We said: We will not allow you to give the name after the name of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) until you ask him (the Holy Prophet ﷺ). So he (that person) came and said (to the Holy Prophet ﷺ): A child was born in my house and I wanted to give him the name (of Muhammad) after the name of Allah's Messenger, whereas my people did not allow me that I should name him after that (sacred) name until I have asked Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) in this connection, whereupon he said: Give him the name after my name, but do not call him by my kunya, for I have been sent as a Qasim as I distribute amongst you.",
                "hadithUrdu": "ہم ( انصار ) میں سے ایک شخص کے ہاں لڑکا پیدا ہوا اس نے اس کا نام محمد رکھا ہم نے اس سے کہا : ہم تمھیں رسول اللہ صلی اللہ علیہ وسلم کی کنیت سے نہیں پکاریں گے ۔ یہاں تک کہ تم رسول اللہ صلی اللہ علیہ وسلم سے ( اس بات کی ) اجازت لے لو ۔ سووہ شخص آپ صلی اللہ علیہ وسلم کے پاس آیا اور کہا کہ اس کے ہاں لڑکا پیدا ہوا ہے ، تو میں نے رسول اللہ صلی اللہ علیہ وسلم کے نام پر اس کا نام رکھا ہے اور میری قوم نے اس بات سے انکا ر کر دیا ہے کہ مجھے اس کے نام کی کنیت سے پکا ریں یہاں تک کہ تم رسول اللہ صلی اللہ علیہ وسلم سے اجازت لے لو ۔ تو آپ صلی اللہ علیہ وسلم نے فر ما یا : \" میرے نام پر نام رکھو لیکن میری کنیت پر کنیت نہ رکھو ، بے شک میں \" قاسم \" بنا کر بھیجا گیا ہوں ، تمھا رے درمیان ( اللہ کا دیا ہوا فضل ) تقسیم کرتا ہوں ۔",
                "urduNarrator": "ہم سے ہناد بن السری نے بیان کیا، ہم سے عبثر نے بیان کیا, حصین نے سالم بن ابی جعد سے ، انھوں نے حضرت جابر عبد اللہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ حَدَّثَنَا عَبْثَرٌ عَنْ حُصَيْنٍ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ وُلِدَ لِرَجُلٍ مِنَّا غُلَامٌ فَسَمَّاهُ مُحَمَّدًا فَقُلْنَا لَا نَكْنِكَ بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى تَسْتَأْمِرَهُ قَالَ فَأَتَاهُ فَقَالَ إِنَّهُ وُلِدَ لِي غُلَامٌ فَسَمَّيْتُهُ بِرَسُولِ اللَّهِ وَإِنَّ قَوْمِي أَبَوْا أَنْ يَكْنُونِي بِهِ حَتَّى تَسْتَأْذِنَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ سَمُّوا بِاسْمِي وَلَا تَكَنَّوْا بِكُنْيَتِي فَإِنَّمَا بُعِثْتُ قَاسِمًا أَقْسِمُ بَيْنَكُمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13153,
                "hadithNumber": "5590",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been reported on the authority of Husain With the same chain of transmitters but no mention is made of these words: (I have been sent as a distributor), so I distribute amongst you.",
                "hadithUrdu": "ہم سے رفاعہ بن الہیثم الواسطی نے بیان کیا, خالد طحان نے حصین سے اسی سند کے ساتھ حدیث بیان کی اور \" میں قاسم ( تقسیم کرنے والا ) بنا کر بھیجا گیا ہوں ، تمھا رے درمیان تقسیم کرتا ہوں \" کے الفا ظ ذکر نہیں کیے ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا رِفَاعَةُ بْنُ الْهَيْثَمِ الْوَاسِطِيُّ حَدَّثَنَا خَالِدٌ يَعْنِي الطَّحَّانَ عَنْ حُصَيْنٍ بِهَذَا الْإِسْنَادِ وَلَمْ يَذْكُرْ فَإِنَّمَا بُعِثْتُ قَاسِمًا أَقْسِمُ بَيْنَكُمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13154,
                "hadithNumber": "5591",
                "englishNarrator": "Jabir bin Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Give the name after my name, but do not give (the kunya of Abu'l-Qasim after my) kunya, for I am Abu'l-Qasim (in the sense) that I distribute amongst you (the spoils of war) and disseminate the knowledge (of revelation). This hadith has been transmitted on the authority of Abu Bakr but with a slight variation of wording.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : میرے نام پر نام رکھو اور میری کنیت پر کنیت نہ رکھو ، کیو نکہ میں ہی ابو القاسم ہوں تمھا رے درمیان تقسیم کرتا ہوں ۔ اپنی کنیت نہ رکھو ۔ \"(اس معنی میں) کہ میں تم میں (جنگ کا مال) تقسیم کرتا ہوں اور علم کو پھیلاتا ہوں۔ یہ حدیث ابوبکر رضی اللہ عنہ سے مروی ہے لیکن الفاظ کے معمولی تغیر کے ساتھ۔",
                "urduNarrator": "ابو بکر بن ابی شیبہ اور ابو سعید اشج نے کہا ,  ہمیں وکیع نے حدیث بیان کی کہا : ہمیں اعمش نے سالم بن ابی جعد سے حدیث سنائی انھوں نے حضرت جابر بن عبد اللہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ الْأَعْمَشِ ح و حَدَّثَنِي أَبُو سَعِيدٍ الْأَشَجُّ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الْأَعْمَشُ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَسَمَّوْا بِاسْمِي وَلَا تَكَنَّوْا بِكُنْيَتِي فَإِنِّي أَنَا أَبُو الْقَاسِمِ أَقْسِمُ بَيْنَكُمْ وَفِي رِوَايَةِ أَبِي بَكْرٍ وَلَا تَكْتَنُوا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13155,
                "hadithNumber": "5592",
                "englishNarrator": null,
                "hadithEnglish": "It was narrated from Al-Amash with this chain of narrators, and he said: \"I have only been appointed as a Qasim (distributor), I distribute among you.",
                "hadithUrdu": "ہم سے ابو کریب نے بیان کیا ,ابو معاویہ نے اعمش سے اسی سند کے ساتھ حدیث بیان کی اور کہا : \" قاسم بنا یا گیا ہوں تمھا رے درمیان تقسیم کرتا ہوں ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ وَقَالَ إِنَّمَا جُعِلْتُ قَاسِمًا أَقْسِمُ بَيْنَكُمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13156,
                "hadithNumber": "5593",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "A child was born to a person from the Ansar and he made up his mind to give him the name of Muhammad. He came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and, asked him (about it), whereupon he said: The Ansar have done well to give the name (to your children) after my name, but do not give them the kunya after my kunya.",
                "hadithUrdu": "انصار میں سے ایک شخص کے ہاں لڑکا پیدا ہوا اس نے اس کا نام محمد رکھنا چا ہا تو وہ نبی صلی اللہ علیہ وسلم کے پاس آیا اور آپ سے پوچھا : آپ صلی اللہ علیہ وسلم نے فر ما یا : \" انصار نے اچھا کیا ، میرے نام پر نام رکھو ، میری کنیت پر ( اپنی ) کنیت نہ رکھو ۔ \"",
                "urduNarrator": "محمد بن مثنیٰ اور محمد بن بشار نے کہا : ہمیں محمد بن جعفر نے حدیث بیان کی ، کہا : ہمیں شعبہ نے حدیث سنا ئی انھوں نے کہا : میں نے قتادہ سے سنا ، انھوں نے سالم سے ، انھوں نے حضرت جا بر بن عبد اللہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ سَمِعْتُ قَتَادَةَ عَنْ سَالِمٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ رَجُلًا مِنْ الْأَنْصَارِ وُلِدَ لَهُ غُلَامٌ فَأَرَادَ أَنْ يُسَمِّيَهُ مُحَمَّدًا فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَهُ فَقَالَ أَحْسَنَتْ الْأَنْصَارُ سَمُّوا بِاسْمِي وَلَا تَكْتَنُوا بِكُنْيَتِي.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13157,
                "hadithNumber": "5594",
                "englishNarrator": "It was narrated from Jabir bin Abdullahرضی اللہ عنہ from the prophet ﷺ... a Hadith lie that of Zikriyya. In the Hadith of An-Nadr it is narrated that Shubah said: \"And Husain and sulaiman added Husain said:",
                "hadithEnglish": "'The Messenger of Allah ﷺ said: \"I have only been sent as a Qasim (distributor), I distribute among you.\" And Sulaiman said: \"I am only a Qasim (distributor), I distribute ('Allah blessings) among you.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" مجھے قاسم بنا کر بھیجا گیا ہے ، میں تمھا رے درمیان تقسیم کرتا ہوں ۔ ۔ \" اور سلیمان نے کہا : \" میں ہی قاسم ہوں ، تمھا رے درمیان تقسیم کرتا ہوں.",
                "urduNarrator": "ابو بکر بن ابی شیبہ محمد بن مثنیٰ محمد بن عمرو بن جبلہ اور بشر بن خالد نے محمد بن جعفر سے ۔ محمد بن جعفر ابن ابی عدی اور نضر بن شمیل نے شعبہ سے ، انھوں نے قتادہ منصور سلیمان اور حصین بن عبد الرحمٰن سے روایت کی ، انھوں نے کہا : ہم نے سالم بن ابی جعد سے سنا ، انھوں نے حضرت جا بر رضی اللہ عنہ سے روایت کی ، جس طرح ان سب کی روایت ہے جن کی حدیث ہم پہلے بیان کر چکے ہیں شعبہ سے نضر کی بیان کردہ حدیث میں ہے کہا : اس میں حصین اور سلیمان نے اضا فہ کیا ، حصین نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ الْمُثَنَّى كِلَاهُمَا عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ عَنْ شُعْبَةَ عَنْ مَنْصُورٍ ح و حَدَّثَنِي مُحَمَّدُ بْنُ عَمْرِو بْنِ جَبَلَةَ حَدَّثَنَا مُحَمَّدٌ يَعْنِي ابْنَ جَعْفَرٍ ح و حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ كِلَاهُمَا عَنْ شُعْبَةَ عَنْ حُصَيْنٍ ح و حَدَّثَنِي بِشْرُ بْنُ خَالِدٍ أَخْبَرَنَا مُحَمَّدٌ يَعْنِي ابْنَ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ سُلَيْمَانَ كُلُّهُمْ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ح و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ وَإِسْحَقُ بْنُ مَنْصُورٍ قَالَا أَخْبَرَنَا النَّضْرُ بْنُ شُمَيْلٍ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ وَمَنْصُورٍ وَسُلَيْمَانَ وَحُصَيْنِ بْنِ عَبْدِ الرَّحْمَنِ قَالُوا سَمِعْنَا سَالِمَ بْنَ أَبِي الْجَعْدِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِ حَدِيثِ مَنْ ذَكَرْنَا حَدِيثَهُمْ مِنْ قَبْلُ وَفِي حَدِيثِ النَّضْرِ عَنْ شُعْبَةَ قَالَ وَزَادَ فِيهِ حُصَيْنٌ وَسُلَيْمَانُ قَالَ حُصَيْنٌ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا بُعِثْتُ قَاسِمًا أَقْسِمُ بَيْنَكُمْ و قَالَ سُلَيْمَانُ فَإِنَّمَا أَنَا قَاسِمٌ أَقْسِمُ بَيْنَكُمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13158,
                "hadithNumber": "5595",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "A child was born in the house of a person amongst us, and he gave him the name of Qasim. We said: We will not allow you (to give the name) to your child as Qasim (and thus adopt the kunya of Abu'l-Qasim) and coal your eyes. He (that person) came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and made a mention of that to him, whereupon he said: Call your son 'Abd al-Rahman.",
                "hadithUrdu": "ہم میں سے ایک شخص کے ہاں ایک لڑکا پیدا ہوا ، اس شخص نے اس کا نم قاسم رکھا ، ہم نے کہا : ہم تمھیں ابو القاسم کی کنیت سے نہیں پکا ریں گے ۔ ( تمھا ری یہ خواہش پوری کر کے ) تمھا ری آنکھیں ٹھنڈی کریں گے تو وہ شخص نبی صلی اللہ علیہ وسلم کی خدمت میں آیا اور آپ صلی اللہ علیہ وسلم کو یہ سب بات بتا ئی تو آپ صلی اللہ علیہ وسلم نے فرما یا : \" تم اپنے بیٹے کا نام عبدالرحمٰن رکھ لو ۔ \"",
                "urduNarrator": "عمرو ناقد اور محمد بن عبداللہ بن نمیر سب نے سفیان کی سند سے بیان کیا کہ ,سفیان بن عیینہ نے کہا : ہمیں ( محمد ) بن منکدر نے حدیث سنا ئی کہ انھوں نے حضرت جا بر بن عبد اللہ رضی اللہ عنہ کو یہ کہتے ہو ئے سنا",
                "hadithArabic": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، وَمُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، جَمِيعًا عَنْ سُفْيَانَ، قَالَ عَمْرٌو: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، حَدَّثَنَا ابْنُ الْمُنْكَدِرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ، يَقُولُ: وُلِدَ لِرَجُلٍ مِنَّا غُلَامٌ فَسَمَّاهُ الْقَاسِمَ فَقُلْنَا: لَا نَكْنِيكَ أَبَا الْقَاسِمِ، وَلَا نُنْعِمُكَ عَيْنًا، فَأَتَى النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَذَكَرَ ذَلِكَ لَهُ فَقَالَ: «أَسْمِ ابْنَكَ عَبْدَ الرَّحْمَنِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13159,
                "hadithNumber": "5596",
                "englishNarrator": "A hadith like that of Ibn 'Uyaynah was narrated from Jabir رضی اللہ عنہ , except that he did not mention:",
                "hadithEnglish": "We will not allow you to cool your eyes.",
                "hadithUrdu": "\" اور ہم تمہاری آنکھیں ٹھنڈی نہیں کریں گے ۔ \"",
                "urduNarrator": "مجھ سے امیہ بن بسطام نے بیان کیا، ہم سے یزید نے بیان کیا، ہم سے ابن زری نے بیان کیا، ہم سے علی بن حجر نے بیان کیا، ہم سے اسماعیل نے بیان کیا، ہم سے ابن اُلیہ نے بیان کیا، ہم سے دونوں نے بیان کیا, روح بن قاسم نے محمد بن مکدر سے ، انھوں نے حضرت جابر رضی اللہ عنہ کی حدیث کی طرح حدیث بیان کی ، مگر انھوں نے یہ الفاظ نہیں کہے",
                "hadithArabic": "وحَدَّثَنِي أُمَيَّةُ بْنُ بِسْطَامَ، حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ، وَحَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، حَدَّثَنَا إِسْمَاعِيلُ يَعْنِي ابْنَ عُلَيَّةَ، كِلَاهُمَا، عَنْ رَوْحِ بْنِ الْقَاسِمِ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ، بِمِثْلِ حَدِيثِ ابْنِ عُيَيْنَةَ غَيْرَ أَنَّهُ لَمْ يَذْكُرْ: وَلَا نُنْعِمُكَ عَيْنًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13160,
                "hadithNumber": "5597",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Abu'l-Qasim ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Give name (to your children) after my name but do not give the kunya (of Abu'l- Qasim) after my kunya. 'Amr reported from Abu Huraira  رضی اللہ  عنہ that he did not say that he had heard it directly from Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ).",
                "hadithUrdu": "ابو القاسم صلی اللہ علیہ وسلم نے فرمایا : \" میرے نام پر نام رکھو اور میری کنیت پر کنیت نہ رکھو ۔ \" عمرو نےکہا \" حضرت ابو ہریرہ رضی اللہ  عنہ سے ر وایت ہے \" کہا اور \" میں نے سنا \" نہیں کہا ۔",
                "urduNarrator": "ابو بکر بن ابی شیبہ ، عمرو ناقد ، زہیر بن حرب ، اور ابن نمیر نے کہا : ہمیں سفیان بن عینیہ نے ایوب سے حدیث بیان کی ، انھوں نے محمد بن سیرین سے روایت کی ، کہا : میں نے حضرت ابو ہریرہ رضی اللہ عنہ کو یہ کہتے ہوئے سنا",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ وَابْنُ نُمَيْرٍ قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَيُّوبَ عَنْ مُحَمَّدِ بْنِ سِيرِينَ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ قَالَ أَبُو الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَسَمَّوْا بِاسْمِي وَلَا تَكَنَّوْا بِكُنْيَتِي قَالَ عَمْرٌو عَنْ أَبِي هُرَيْرَةَ وَلَمْ يَقُلْ سَمِعْتُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13161,
                "hadithNumber": "5598",
                "englishNarrator": "Mughira bin Shu'ba رضی اللہ عنہ reported:",
                "hadithEnglish": "When I came to Najran, they (the Christians of Najran) asked me: You read O sister of Harun (i.e. Hadrat Maryam) in the Qur'an, whereas Moses was born much before Jesus. When I came back to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) I asked him about that, whereupon he said: The (people of the old age) used to give names (to their persons) after the names of Apostles and pious persons who had gone before them.",
                "hadithUrdu": "جب میں نجران میں آیا ، تو وہاں کے ( انصاری ) لوگوں نے مجھ پر اعتراض کیا کہ تم پڑھتے ہو کہ ( آیت ) ( ”اے ہارون کی بہن“ ( مریم : 28 ) ( یعنی مریم علیہا السلام کو ہارون کی بہن کہا ہے ) حالانکہ ( سیدنا ہارون موسیٰ علیہ السلام کے بھائی تھے اور ) موسیٰ علیہ السلام ، عیسیٰ علیہ السلام سے اتنی مدت پہلے تھے ( پھر مریم ہارون علیہ السلام کی بہن کیونکر ہو سکتی ہیں؟ ) ، جب میں رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا تو میں نے آپ صلی اللہ علیہ وسلم سے پوچھا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ( یہ وہ ہارون تھوڑی ہیں جو موسیٰ کے بھائی تھے ) بنی اسرائیل کی عادت تھی ( جیسے اب سب کی عادت ہے ) کہ وہ پیغمبروں اور اگلے نیکوں کے نام پر نام رکھتے تھے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، محمد بن عبداللہ بن نمیر، ابو سعید الاشجع اور محمد بن المثنیٰ العنزی نے بیان کیا، اور الفاظ ابن نمیر سے، انہوں نے کہا: ہم سے ابن ادریس نے اپنے والد سے، سماک بن حرب کی سند سے، علقمہ بن وائل کی سند سے بیان کیا, سیدنا مغیرہ بن شعبہ رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ وَأَبُو سَعِيدٍ الْأَشَجُّ وَمُحَمَّدُ بْنُ الْمُثَنَّى الْعَنَزِيُّ وَاللَّفْظُ لِابْنِ نُمَيْرٍ قَالُوا حَدَّثَنَا ابْنُ إِدْرِيسَ عَنْ أَبِيهِ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ عَلْقَمَةَ بْنِ وَائِلٍ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَ لَمَّا قَدِمْتُ نَجْرَانَ سَأَلُونِي فَقَالُوا إِنَّكُمْ تَقْرَءُونَ يَا أُخْتَ هَارُونَ وَمُوسَى قَبْلَ عِيسَى بِكَذَا وَكَذَا فَلَمَّا قَدِمْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَأَلْتُهُ عَنْ ذَلِكَ فَقَالَ إِنَّهُمْ كَانُوا يُسَمُّونَ بِأَنْبِيَائِهِمْ وَالصَّالِحِينَ قَبْلَهُمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13162,
                "hadithNumber": "5599",
                "englishNarrator": "Samura bin Jundub رضی اللہ  عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade us to give names to our servants as these four names: Aflah (Successful), Rabdh (Profit), Yasar (Wealth), and Nafi' (Beneficial).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ہمیں اپنے غلاموں کے یہ چار نام رکھنے سے منع فرمایا : افلح ( زیادہ کامیاب ) ، رباح ( منافع والا ) ، یسار ( آسانی والا ) اور نافع ( نفع پہنچانے والا ).",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ اور ابوبکر بن ابی شیبہ نے بیان کیا, معتمر بن سلیمان نے کہا : میں رُکین سے سنا ، وہ ا پنے والد سے حدیث بیان کررہے تھے ، انھوں نے حضرت سمرہ بن جندب رضی اللہ  عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ أَبُو بَكْرٍ حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ عَنْ الرُّكَيْنِ عَنْ أَبِيهِ عَنْ سَمُرَةَ و قَالَ يَحْيَى أَخْبَرَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ قَالَ سَمِعْتُ الرُّكَيْنَ يُحَدِّثُ عَنْ أَبِيهِ عَنْ سَمُرَةَ بْنِ جُنْدَبٍ قَالَ نَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نُسَمِّيَ رَقِيقَنَا بِأَرْبَعَةِ أَسْمَاءٍ أَفْلَحَ وَرَبَاحٍ وَيَسَارٍ وَنَافِعٍ.",
                "headingArabic": "كَرَاهَةِ التَّسْمِيَةِ بِالأَسْمَاءِ الْقَبِيحَةِ وَبِنَافِعٍ وَنَحْوِهِ",
                "headingUrdu": "قابل اعتراض ناموں اور ناموں جیسے نافع (فائدہ مند) وغیرہ کا استعمال ناپسندیدہ ہے۔",
                "headingEnglish": "It Is Disliked To Use Objectionable Names And Names Such As Nafi' (Beneficial) Etc",
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13163,
                "hadithNumber": "5600",
                "englishNarrator": "Samura bin Jundub رضی اللہ عنہ reported:",
                "hadithEnglish": "Auah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Don't give names to your servants as Rabdh, 'Yasar, Aflah and Nafi'.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اپنے لڑکے ( غلام ، خادم ) کا نام رباح ، یسار ، افلح ، اور نافع نہ رکھو ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, جریر نے رکین بن ربیع سے ، انھوں نے اپنے والد سے ، انھوں نے سمرہ بن جندب رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا جَرِيرٌ عَنْ الرُّكَيْنِ بْنِ الرَّبِيعِ عَنْ أَبِيهِ عَنْ سَمُرَةَ بْنِ جُنْدَبٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُسَمِّ غُلَامَكَ رَبَاحًا وَلَا يَسَارًا وَلَا أَفْلَحَ وَلَا نَافِعًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "39",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 139,
                    "chapterNumber": "39",
                    "chapterEnglish": "The Book of Manners and Etiquette",
                    "chapterUrdu": "معاشرتی آداب کا بیان",
                    "chapterArabic": "كتاب الْآدَابِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 12851,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=514",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=512",
                "label": "512",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=513",
                "label": "513",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=514",
                "label": "514",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=515",
                "label": "515",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=516",
                "label": "516",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=517",
                "label": "517",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=518",
                "label": "518",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=516",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=516",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=514",
        "to": 12875,
        "total": 40465
    }
}