{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 501,
        "data": [
            {
                "id": 12789,
                "hadithNumber": "5226",
                "englishNarrator": "Ibn 'Abbas رضی اللہ عنہ reported:",
                "hadithEnglish": "Nabidh was prepared for Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) in the beginning of the night and he would drink it in the morning and the following night and the following day and the night after that up to the afternoon. If anything was left out of that he gave it to his servant, or gave orders for it to be poured out.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے لیے رات کے ابتدا ئی حصے میں ( کھجوریں ) پانی میں ڈال دی جا تی تھیں جب آپ صبح کرتے تو اسے ( پیتے ) اور جو رات آتی ( اس میں ) پیتے اور صبح کو اور اگلی رات کو اس کے بعد کا دن عصر تک اگر کچھ بچ جا تا تو خادم کو پلا دیتے ( تا کہ ختم ہو جا ئے ) یا ( اگر کو ئی پینے والا نہ ہو تا یا بچ جا تی تو ) اس کو گرا دینے کا حکم دیتے ۔",
                "urduNarrator": "عبید اللہ بن معاذ عنبری نے کہا : ہمیں شعبہ نے یحییٰ بن عبید ابو عمر بہرا نی سے روایت بیان کی کہا : میں نے حضرت ابن عباس رضی اللہ عنہ کو یہ کہتے ہو ئے سنا",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ يَحْيَى بْنِ عُبَيْدٍ أَبِي عُمَرَ الْبَهْرَانِيِّ قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُنْتَبَذُ لَهُ أَوَّلَ اللَّيْلِ فَيَشْرَبُهُ إِذَا أَصْبَحَ يَوْمَهُ ذَلِكَ وَاللَّيْلَةَ الَّتِي تَجِيءُ وَالْغَدَ وَاللَّيْلَةَ الْأُخْرَى وَالْغَدَ إِلَى الْعَصْرِ فَإِنْ بَقِيَ شَيْءٌ سَقَاهُ الْخَادِمَ أَوْ أَمَرَ بِهِ فَصُبَّ",
                "headingArabic": "إِبَاحَةِ النَّبِيذِ الَّذِي لَمْ يَشْتَدَّ وَلَمْ يَصِرْ مُسْكِرًا ‏‏",
                "headingUrdu": "نبیذ کی اجازت اس وقت تک ہے جب تک یہ مضبوط نہ ہوا ہو اور نشہ آور نہ ہو گیا ہو۔",
                "headingEnglish": "The permissibility of Nabidh so long as it has not become strong and has not become intoxicating",
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12790,
                "hadithNumber": "5227",
                "englishNarrator": "Ibn 'Abbas رضی اللہ عنہ reported:",
                "hadithEnglish": "Nabidh was prepared for Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) in the water skin, Shu'ba said: It was the night of Monday. He drank it on Monday and on Tuesday up to the afternoon, and If anything was left out of it he gave it to his servant or poured it out.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے لیے پیر کی رات کو مشکیزے میں ( پانی کے ساتھ کھجور ڈال کر ) نبیذ بنا لی جا تی تھی تو آپ اسے پیر کو اور منگل کو عصر تک پیتے اگر اس میں سے کچھ بچ جاتا تو خادم کو پلا دیتے یا گرادیتے ۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا, محمد بن جعفر نے کہا : ہمیں شعبہ نے یحییٰ بہرا نی سے حدیث بیان کی ، کہا : لوگوں نے حضرت ابن عباس رضی اللہ عنہ کے سامنے نبیذ کا ذکر کیا تو انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ يَحْيَى الْبَهْرَانِيِّ قَالَ ذَكَرُوا النَّبِيذَ عِنْدَ ابْنِ عَبَّاسٍ فَقَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُنْتَبَذُ لَهُ فِي سِقَاءٍ قَالَ شُعْبَةُ مِنْ لَيْلَةِ الِاثْنَيْنِ فَيَشْرَبُهُ يَوْمَ الِاثْنَيْنِ وَالثُّلَاثَاءِ إِلَى الْعَصْرِ فَإِنْ فَضَلَ مِنْهُ شَيْءٌ سَقَاهُ الْخَادِمَ أَوْ صَبَّهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12791,
                "hadithNumber": "5228",
                "englishNarrator": "Ibn Abbas رضی اللہ عنہ reported:",
                "hadithEnglish": "Raisins were steeped in water for the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and he would drink it on that day and on the next day and on the following day until the evening of the third day. He would then order it to be drunk by (other people) or to be thrown away.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے لیے کشمش کو پانی میں ڈال دیا جا تا آپ اس نبیذ کو اس دن اور اس سے اگلے دن اور اس کے بعد والے تیسرے دن کی شام تک نوش فرما تے ، پھر آپ حکم دیتے تو وہ دوسروں کو پلا دی جا تی تھی یا گرا دی جا تی تھی ۔",
                "urduNarrator": "اور ہم سے ابوبکر بن ابی شیبہ، ابو کریب اور اسحاق بن ابراہیم نے بیان کیا، اور ہم سے ابوبکر اور ابو کریب نے بیان کیا، اور باقی دو نے کہا, ابو معاویہ نے اعمش سے انھوں نے ابو عمر سے ، انھوں نے حضرت عباس رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ وَاللَّفْظُ لِأَبِي بَكْرٍ وَأَبِي كُرَيْبٍ قَالَ إِسْحَقُ أَخْبَرَنَا و قَالَ الْآخَرَانِ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي عُمَرَ عَنْ ابْنِ عَبَّاسٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُنْقَعُ لَهُ الزَّبِيبُ فَيَشْرَبُهُ الْيَوْمَ وَالْغَدَ وَبَعْدَ الْغَدِ إِلَى مَسَاءِ الثَّالِثَةِ ثُمَّ يَأْمُرُ بِهِ فَيُسْقَى أَوْ يُهَرَاقُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12792,
                "hadithNumber": "5229",
                "englishNarrator": "Ibn Abbas رضی اللہ عنہ reported:",
                "hadithEnglish": "Nabidh was prepared from raisins for Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) in the waterskin and he would drink it on that day and on the next day and the day following and when It was the evening of the third day, and he would drink it and give it to (his Companions) and if something was left over, he threw that away.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے لیے مشک میں کشمش ڈال دی جا تی تھی آپ اس کو اس دن پیتے اور اس کے اگلے دن اور اس کے بعد والے دن تک پیتے اور جب تیسرے دن کی شام ہو تی تو آپ اس کو خود پیتے کسی اور کو پلا تے پھر اگر بچ جا تا تو اس کو بہا دیتے ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا, جریر نے اعمش سے انھوں نے یحییٰ ابو عمر سے ، انھوں نے حضرت عباس رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ يَحْيَى بْنِ أَبِي عُمَرَ عَنْ ابْنِ عَبَّاسٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُنْبَذُ لَهُ الزَّبِيبُ فِي السِّقَاءِ فَيَشْرَبُهُ يَوْمَهُ وَالْغَدَ وَبَعْدَ الْغَدِ فَإِذَا كَانَ مَسَاءُ الثَّالِثَةِ شَرِبَهُ وَسَقَاهُ فَإِنْ فَضَلَ شَيْءٌ أَهَرَاقَهُ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12793,
                "hadithNumber": "5230",
                "englishNarrator": "Yahya Abu 'Umar al-Nakhai reported:",
                "hadithEnglish": "Some people asked Ibn Abbas رضی اللہ عنہ about the sale and purchase of wine and its commerce. He asked (them): Are you Muslims? They said, Yes. Thereupon he said: Its sale and purchase and its trade are not permissible. They then asked him about Nabidh and he said: Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) went out on a journey and then came back and some persons amongst his Companions prepared Nabidh for him in green pitcher, hollow stump and gourd. He commanded it to be thrown away, and it was done accordingly. He then ordered them (to prepare it.) in a water skin and it was prepared in that by steeping raisins in water, and it was prepared in the night. In the morning he drank out of that and on that day and then the next night, and then on the next day until the evening. He drank and gave others to drink. When it was morning (of the third night) he commanded what was left of that to be thrown away.",
                "hadithUrdu": "کچھ لوگوں نے حضرت ابن عباس رضی اللہ عنہ سے شراب بیچنے خریدنے اور اس کی تجارت کے متعلق سوال کیا ۔ تو انھوں نے پو چھا : کیا تم لو گ مسلمان ہو؟ انھوں نے کہا : ہاں ۔ حضرت ابن عباس رضی اللہ عنہ نے فرما یا : شراب کا بیچنا خریدنا اور اس کی تجارت کرنا جا ئز نہیں ہے ۔ پھر انھوں نے نبیذ کے متعلق سوال کیا ۔ حضرت ابن عباس نے کہا : رسول اللہ صلی اللہ علیہ وسلم ایک سفر پر تشریف لے گئے پھر آپ کی واپسی ہوئی ۔ آپ کے ساتھیوں نےسبز گھڑوں ، کریدی ہوئی لکڑی اور کدو کے برتنوں میں نبیذ بنا ئی ہو ئی تھی تو آپ صلی اللہ علیہ وسلم نے اسے گرادینےکا حکم دیا ۔ پھر آپ صلی اللہ علیہ وسلم نے ایک مشکیزہ لا نے کا حکم دیا اس میں کشمش اور پانی ڈال دیے گئےیہ ( نبیذ ) رات کو بنا ئی گئی آپ صلی اللہ علیہ وسلم نے صبح کی تو اس دن اس کو پیا اگلی رات کو پیا پھر اگلے دن شام تک پیا ، پیا اور پلا یا جب اگلی صبح ہوئی تو آپ صلی اللہ علیہ وسلم نے جو بچ گیا تھا اس کے بارے میں حکم دیا تو اسے گرا دیا گیا ۔",
                "urduNarrator": "مجھ سے محمد بن احمد بن ابی خلف نے بیان کیا، ہم سے زکریا بن عدی نے بیان کیا، ہم سے عبید اللہ نے بیان کیا, زید نے ابو عمر یحییٰ نخعی سے روایت کی کہا",
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ حَدَّثَنَا زَكَرِيَّاءُ بْنُ عَدِيٍّ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ زَيْدٍ عَنْ يَحْيَى أَبِي عُمَرَ النَّخَعِيِّ قَالَ سَأَلَ قَوْمٌ ابْنَ عَبَّاسٍ عَنْ بَيْعِ الْخَمْرِ وَشِرَائِهَا وَالتِّجَارَةِ فِيهَا فَقَالَ أَمُسْلِمُونَ أَنْتُمْ قَالُوا نَعَمْ قَالَ فَإِنَّهُ لَا يَصْلُحُ بَيْعُهَا وَلَا شِرَاؤُهَا وَلَا التِّجَارَةُ فِيهَا قَالَ فَسَأَلُوهُ عَنْ النَّبِيذِ فَقَالَ خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ ثُمَّ رَجَعَ وَقَدْ نَبَذَ نَاسٌ مِنْ أَصْحَابِهِ فِي حَنَاتِمَ وَنَقِيرٍ وَدُبَّاءٍ فَأَمَرَ بِهِ فَأُهْرِيقَ ثُمَّ أَمَرَ بِسِقَاءٍ فَجُعِلَ فِيهِ زَبِيبٌ وَمَاءٌ فَجُعِلَ مِنْ اللَّيْلِ فَأَصْبَحَ فَشَرِبَ مِنْهُ يَوْمَهُ ذَلِكَ وَلَيْلَتَهُ الْمُسْتَقْبَلَةَ وَمِنْ الْغَدِ حَتَّى أَمْسَى فَشَرِبَ وَسَقَى فَلَمَّا أَصْبَحَ أَمَرَ بِمَا بَقِيَ مِنْهُ فَأُهْرِيقَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12794,
                "hadithNumber": "5231",
                "englishNarrator": "Thumama (i.e. Ibn Hazn al-Qushairi) reported:",
                "hadithEnglish": "I met 'A'isha رضی اللہ عنہا and asked her about Nabidh (that was served to the Holy Prophet ﷺ). 'A'isha رضی اللہ عنہا called an Abyssinian maid (servant) and said: Ask her (about it) for it was he, who prepared the Nabidh for the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). The Abyssinian (maid-servant) said: I prepared Nabidh for him in a water skin in the night and tied its mouth and then suspended it; and when it was morning he (the Holy Prophet) drank from it.",
                "hadithUrdu": "میں حضرت عائشہ رضی اللہ عنہا سے ملنے گیا تو میں نے ان سے نبیذ کے متعلق سوال کیا ، حضرت عائشہ رضی اللہ عنہا نے ایک حبشی کنیز کو آواز دی اور فرما یا : اس سے پوچھو یہی رسول اللہ صلی اللہ علیہ وسلم کے لیے نبیذ بنا یا کرتی تھی ۔ اس حبشی لڑکی نے کہا : میں آپ صلی اللہ علیہ وسلم کے لیے رات کو ایک مشک میں ( پھل ) ڈال دیتی تھی اور اس مشک کا منہ باندھ کر اس کو لٹکا دیتی تھی جب صبح ہو تی تو آپ صلی اللہ علیہ وسلم اس میں سے نوش فرما تے تھے ۔",
                "urduNarrator": "ہم سے شیبان بن فروخ نے بیان کیا، کہا ہم سے القاسم یعنی ابن الفضل الحدانی نے بیان کیا, ہمیں ثمامہ یعنی ابن حزن قشیری نے حدیث بیان کی ، کہا",
                "hadithArabic": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا الْقَاسِمُ يَعْنِي ابْنَ الْفَضْلِ الْحُدَّانِيَّ حَدَّثَنَا ثُمَامَةُ يَعْنِي ابْنَ حَزْنٍ الْقُشَيْرِيَّ قَالَ لَقِيتُ عَائِشَةَ فَسَأَلْتُهَا عَنْ النَّبِيذِ فَدَعَتْ عَائِشَةُ جَارِيَةً حَبَشِيَّةً فَقَالَتْ سَلْ هَذِهِ فَإِنَّهَا كَانَتْ تَنْبِذُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ الْحَبَشِيَّةُ كُنْتُ أَنْبِذُ لَهُ فِي سِقَاءٍ مِنْ اللَّيْلِ وَأُوكِيهِ وَأُعَلِّقُهُ فَإِذَا أَصْبَحَ شَرِبَ مِنْهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12795,
                "hadithNumber": "5232",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "We prepared Nabidh for Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) in a water skin, the upper part of which was tied and it (the water skin) had a hole (in its lower part). We prepared the Nabidh in the morning and he drank it in the evening and we prepared the Nabidh in the night, and he would drink it in the morning.",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے لیے ایک مشک میں نبیذ بنا تے اس کا اوپر کا حصہ باندھ دیا جا تا تھا اس میں نچلی طرف کا سوراخ بھی تھا ۔ ہم صبح کو ( کھجور یا کشمش ) ڈالتے تو آپ اسے رات کو نوش فرما تے اور رات کے وقت ڈالتے تو آپ صلی اللہ علیہ وسلم صبح کو نو ش فرما تے ۔",
                "urduNarrator": "ہم سے محمد بن المثنی العنزی نے بیان کیا، کہا ہم سے عبدالوہاب ثقفی نے یونس کی سند سے بیان کیا, حسن کی والدہ نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى الْعَنَزِيُّ حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ عَنْ يُونُسَ عَنْ الْحَسَنِ عَنْ أُمِّهِ عَنْ عَائِشَةَ قَالَتْ كُنَّا نَنْبِذُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سِقَاءٍ يُوكَى أَعْلَاهُ وَلَهُ عَزْلَاءُ نَنْبِذُهُ غُدْوَةً فَيَشْرَبُهُ عِشَاءً وَنَنْبِذُهُ عِشَاءً فَيَشْرَبُهُ غُدْوَةً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12796,
                "hadithNumber": "5233",
                "englishNarrator": "Sahl bin Sa'd رضی اللہ عنہ reported:",
                "hadithEnglish": "Abu Usaid al-Sa'idi رضی اللہ عنہ invited Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) to his wedding feast, and his wife had been serving them on that day while yet a bride. Sahl said ' Do you know what she served as a drink to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌)? She steeped the dates in water during the night in a big bowl, and when he (the Holy Prophet ﷺ) had eaten food she served him this drink.",
                "hadithUrdu": "حضرت ابو اسید ساعدی رضی اللہ عنہ نے اپنی شادی میں رسول اللہ صلی اللہ علیہ وسلم کو دعوت دی اس دن ان کی بیوی خدمت بجا لا رہی تھیں ، حالا نکہ وہ دلہن تھیں ۔ سہل نے کہا : کیا تم جا نتے ہو کہ اس نے رسول اللہ صلی اللہ علیہ وسلم کو کیا پلا یا تھا ؟ اس نے را ت کو پتھر کے ایک بڑے برتن میں پانی کے اندر کچھ کھجوریں ڈال دی تھیں جب آپ کھا نے سے فارغ ہو ئے تو اس نے آپ صلی اللہ علیہ وسلم کو وہ ( مشروب ) پلا یا ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, عبد العزیز بن ابی حازم نے ابو حازم سے انھوں نے حضرت سہل بن سعد رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ أَبِي حَازِمٍ عَنْ أَبِي حَازِمٍ عَنْ سَهْلِ بْنِ سَعْدٍ قَالَ دَعَا أَبُو أُسَيْدٍ السَّاعِدِيُّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي عُرْسِهِ فَكَانَتْ امْرَأَتُهُ يَوْمَئِذٍ خَادِمَهُمْ وَهِيَ الْعَرُوسُ قَالَ سَهْلٌ تَدْرُونَ مَا سَقَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْقَعَتْ لَهُ تَمَرَاتٍ مِنْ اللَّيْلِ فِي تَوْرٍ فَلَمَّا أَكَلَ سَقَتْهُ إِيَّاهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12797,
                "hadithNumber": "5234",
                "englishNarrator": "Sahl رضی اللہ عنہ reported:",
                "hadithEnglish": "Abu Usaid al-Sa'idi رضی اللہ عنہ came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌); the rest of the hadith is the same, but he did not mention this: when he had eaten (the food) she gave him this to drink .",
                "hadithUrdu": "حضرت ابو اسید ساعدی رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم کو دعوت دی ۔ اسی ( سابقہ حدیث ) کے مانند ۔ انھوں نے یہ نہیں کہا ۔ جب آپ نے کھا نا تناول فرما لیا اس نے وہ ( مشروب ) کو پلا یا ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا , یعقوب بن عبد الرحمٰن نے ابو حازم سے روایت کی ، کہا میں نےحضرت سہل بن سعد رضی اللہ عنہ سے سنا کہہ رہے تھے",
                "hadithArabic": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا يَعْقُوبُ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ عَنْ أَبِي حَازِمٍ قَالَ سَمِعْتُ سَهْلًا يَقُولُ أَتَى أَبُو أُسَيْدٍ السَّاعِدِيُّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَدَعَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ وَلَمْ يَقُلْ فَلَمَّا أَكَلَ سَقَتْهُ إِيَّاهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12798,
                "hadithNumber": "5235",
                "englishNarrator": "Sahl bin Sa'd رضی اللہ عنہ reported (this hadith through another chain of transmitters) and he said (these words):",
                "hadithEnglish": "In a big bowl of stone, and when Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had taken the food, she drenched the dates and served (this) especially to him.",
                "hadithUrdu": "( اس نے ) پتھر کے ایک بڑے پیا لے میں ( نبیذ بنائی ) پھر جب رسول اللہ صلی اللہ علیہ وسلم کھا نے سے فارغ ہو ئے تو اس ( ابو اسید ساعدی رضی اللہ عنہ کی دلہن ) نے اس ( پھل کو جوپانی کے ساتھ برتن میں ڈالا ہوا تھا ) پا نی میں گھلایا اور آپ کو پلا یا آپ کو خصوصی طور پر ( پلایا ).",
                "urduNarrator": "اور مجھ سے محمد بن سہل تمیمی نے بیان کیا، کہا ہم سے ابن ابی مریم نے بیان کیا، ہم سے محمد نے بیان کیا، یعنی محمد ابو غسان نے کہا : مجھے ابو حازم نے حجرت سہل بن سعد رضی اللہ عنہ سے یہی حدیث روایت کی اور کہا",
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ سَهْلٍ التَّمِيمِيُّ حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ أَخْبَرَنَا مُحَمَّدٌ يَعْنِي أَبَا غَسَّانَ حَدَّثَنِي أَبُو حَازِمٍ عَنْ سَهْلِ بْنِ سَعْدٍ بِهَذَا الْحَدِيثِ وَقَالَ فِي تَوْرٍ مِنْ حِجَارَةٍ فَلَمَّا فَرَغَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الطَّعَامِ أَمَاثَتْهُ فَسَقَتْهُ تَخُصُّهُ بِذَلِكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12799,
                "hadithNumber": "5236",
                "englishNarrator": "Sahl bin Sa'd رضی اللہ  عنہ reported:",
                "hadithEnglish": "An Arab woman was mentioned before Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). He commanded Abu Usaid رضی اللہ  عنہ to send a message to her and he (accordingly) sent a message to her. She came and stayed in the fortresses of Banu Sa'idah. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) went out until he came to her while she was (at that time) sitting with her head downcast. When Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) talked to her, she said: I seek refuge with Allah from you. Thereupon he said: I (have decided to) keep you away from me. They (the people near her) said: Do you know who he is? She said: No. They said: He is the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). He came to you in order to give you the proposal of marriage. She said: Then I am the most unfortunate woman because of this (i.e. my defiance). Sahl رضی اللہ عنہ said: Allah's. Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) then set forth on that day until he sat in the Saqifa of Banu Sa'idah along with his Companions. He then said to Sahl رضی اللہ عنہ : Serve us drink. He (Sahl رضی اللہ  عنہ) said: I brought out for them this bowl (containing drink) and served them this. Abu Hazim said: Sahl رضی اللہ  عنہ brought out this cup for us and we also drank from that. Then 'Umar bin 'Abd al-'Aziz asked him to give that (cup) as a gift to him and he gave (it to) him as a gift. In the narration of Abu Bakr bin Ishaq (the words) are: Sahl رضی اللہ  عنہ, serve us drink.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے سامنے عرب کی ایک عورت کا ذکر کیا گیا ۔ ( اس کے والد نعمان بن ابی الجون کندی نے پیش کش کی ) آپ نے ابو اسید رضی اللہ عنہ سے کہا : کہ اس ( عورت کولا نے کے لیے اس ) کی طرف سواری وغیرہ بھیجیں ۔ تو انھوں ( حضرت ابو اسید رضی اللہ عنہ ) نے بھیج دی وہ عورت آئی بنو ساعدہ کے قلعہ نما مکانات میں ٹھہری رسول اللہ صلی اللہ علیہ وسلم گھر سے روانہ ہو کر اس کے پاس تشریف لے گئے جب آپ اس کے پاس گئے تو وہ عورت سر جھکا ئے ہو ئے تھی رسول اللہ صلی اللہ علیہ وسلم نے جب اس سے بات کی تو وہ کہنے لگی : میں آپ سے اللہ کی پناہ میں آتی ہوں ۔ آپ صلی اللہ علیہ وسلم نے فرما یا : \" میں نے تمھیں خود سے پناہ دے دی ۔ \" لوگوں نے اس سے کہا : کیا تم جا نتی ہو یہ کو ن ہیں ؟ اس نے کہا : نہیں انھوں نے کہا : یہ رسول اللہ صلی اللہ علیہ وسلم تھے اور تمھیں نکا ح کا پیغا م دینے تمھا رے پاس آئے تھے ۔ اس نے کہا : میں اس سے کم تر نصیب والی تھی ۔ سہل رضی اللہ عنہ نے کہا : اس دن رسول اللہ صلی اللہ علیہ وسلم تشریف لا ئے آپ خود اور آپ کے ساتھ بنو ساعدہ کے چھت والے چبوترے پر تشریف فرما ہو ئے پھر سہل پانی پلا ؤ \" کہا : میں نے ان کے لیے وہی پیا لہ ( نما برتن ) نکا لا اور اس میں آپ کو پلا یا ۔ ابو حازم نے کہا : سہل رضی اللہ عنہ نے ہمارے لیے بھی وہی پیالہ نکالا اور ہم نے بھی اس میں سے پیا ، پھر عمر بن عبد العزیز نے حضرت سہل رضی اللہ عنہ سے وہ پیا لہ بطور ہبہ مانگ لیا ۔ حضرت سہل رضی اللہ عنہ نے وہ پیا لہ ان کو ہبہ کر دیا ۔ ابو بکر بن اسحاق کی روایت میں ہے : آپ صلی اللہ علیہ وسلم نے فرما یا : \" سہل!ہمیں ( کچھ ) پلا ؤ ۔ \"",
                "urduNarrator": "ہم سے محمد بن سہل تمیمی اور ابوبکر بن اسحاق نے بیان کیا, محمد بن سہل تیمی اور ابو بکر بن اسحٰق نے کہا : ہمیں ابن ابی مریم نے حدیث بیان کی ، کہا : ہمیں ابو غسان محمد بن مطرف نے بتا یا کہ مجھے ابو حازم نے حضرت سہل بن سعد رضی اللہ  عنہ سے روایت بیان کی ، کہا",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ سَهْلٍ التَّمِيمِيُّ وَأَبُو بَكْرِ بْنُ إِسْحَقَ قَالَ أَبُو بَكْرٍ أَخْبَرَنَا و قَالَ ابْنُ سَهْلٍ حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ أَخْبَرَنَا مُحَمَّدٌ وَهُوَ ابْنُ مُطَرِّفٍ أَبُو غَسَّانَ أَخْبَرَنِي أَبُو حَازِمٍ عَنْ سَهْلِ بْنِ سَعْدٍ قَالَ ذُكِرَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ امْرَأَةٌ مِنْ الْعَرَبِ فَأَمَرَ أَبَا أُسَيْدٍ أَنْ يُرْسِلَ إِلَيْهَا فَأَرْسَلَ إِلَيْهَا فَقَدِمَتْ فَنَزَلَتْ فِي أُجُمِ بَنِي سَاعِدَةَ فَخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى جَاءَهَا فَدَخَلَ عَلَيْهَا فَإِذَا امْرَأَةٌ مُنَكِّسَةٌ رَأْسَهَا فَلَمَّا كَلَّمَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ أَعُوذُ بِاللَّهِ مِنْكَ قَالَ قَدْ أَعَذْتُكِ مِنِّي فَقَالُوا لَهَا أَتَدْرِينَ مَنْ هَذَا فَقَالَتْ لَا فَقَالُوا هَذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَاءَكِ لِيَخْطُبَكِ قَالَتْ أَنَا كُنْتُ أَشْقَى مِنْ ذَلِكَ قَالَ سَهْلٌ فَأَقْبَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَئِذٍ حَتَّى جَلَسَ فِي سَقِيفَةِ بَنِي سَاعِدَةَ هُوَ وَأَصْحَابُهُ ثُمَّ قَالَ اسْقِنَا لِسَهْلٍ قَالَ فَأَخْرَجْتُ لَهُمْ هَذَا الْقَدَحَ فَأَسْقَيْتُهُمْ فِيهِ قَالَ أَبُو حَازِمٍ فَأَخْرَجَ لَنَا سَهْلٌ ذَلِكَ الْقَدَحَ فَشَرِبْنَا فِيهِ قَالَ ثُمَّ اسْتَوْهَبَهُ بَعْدَ ذَلِكَ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ فَوَهَبَهُ لَهُ وَفِي رِوَايَةِ أَبِي بَكْرِ بْنِ إِسْحَقَ قَالَ اسْقِنَا يَا سَهْلُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12800,
                "hadithNumber": "5237",
                "englishNarrator": "It was narrated that Ibn Abbas رضی اللہ عنہ :",
                "hadithEnglish": "I served drink to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) in this cup of mine: honey, Nabidh, water and milk.",
                "hadithUrdu": "میں نے اپنے اس پیالے سے رسول اللہ صلی اللہ علیہ وسلم کو ہر قسم کا مشروب پلا یا ہے ۔ شہد نبیذ پانی اور دودھ ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور زہیر بن حرب نے بیان کیا، کہا کہ ہم سے عفان نے بیان کیا، ان سے حماد بن سلمہ نے ثابت کی سند سے بیان کیا, حضرت انس رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ ثَابِتٍ عَنْ أَنَسٍ قَالَ لَقَدْ سَقَيْتُ رَسُولَ اللَّهِ بِقَدَحِي هَذَا الشَّرَابَ كُلَّهُ الْعَسَلَ وَالنَّبِيذَ وَالْمَاءَ وَاللَّبَنَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12801,
                "hadithNumber": "5238",
                "englishNarrator": "Abu Bakr Siddiq رضی اللہ عنہ reported:",
                "hadithEnglish": "As we went along with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) from Mecca to Medina, we passed by a shepherd and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was feeling thirsty. He (Abu Bakr Siddiq رضی اللہ عنہ ) said: I milked for him a small quantity of milk (from his goat) and brought it to him (the Holy Prophet ﷺ), and he drank it and I was very happy.",
                "hadithUrdu": "جب ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ مکہ سے مدینہ کی طرف روانہ ہوئے تو ہم ایک چرواہے کے پاس سے گزرے ، اس وقت رسول اللہ صلی اللہ علیہ وسلم کو پیاس لگی ہوئی تھی ، انھوں ( حضرت ابو بکر صدیق رضی اللہ تعالیٰ عنہ ) نے کہا : تو میں نے آپ صلی اللہ علیہ وسلم کے لئے کچھ دودھ دوہا ، پھر میں آپ کے پاس وہ دودھ لایا ، آپ نے اسے نوش فرمایا ، یہاں تک کہ میں راضی ہوگیا ۔",
                "urduNarrator": "عبید اللہ بن معاذ عنبری نے کہا : ہمیں شعبہ نے ابو اسحاق ( ہمدانی ) سے حدیث بیان کی ، انھوں نے حضرت براء رضی اللہ عنہ سے روایت کی ، کہا : حضرت ابو بکرصدیق رضی اللہ عنہ نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ عَنْ الْبَرَاءِ قَالَ قَالَ أَبُو بَكْرٍ الصِّدِّيقُ لَمَّا خَرَجْنَا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ مَكَّةَ إِلَى الْمَدِينَةِ مَرَرْنَا بِرَاعٍ وَقَدْ عَطِشَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَحَلَبْتُ لَهُ كُثْبَةً مِنْ لَبَنٍ فَأَتَيْتُهُ بِهَا فَشَرِبَ حَتَّى رَضِيتُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12802,
                "hadithNumber": "5239",
                "englishNarrator": "Al-Bara' رضی اللہ عنہ reported:",
                "hadithEnglish": "When Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) went forth from Mecca to Medina, Suraqa bin Malik bin Ju'shum pursued him. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) invoked curse upon him, and his horse sank (in the desert). He (Suraqa) said: (Allah's Messenger ﷺ), invoke blessings for me and I will do no harm to you. He (the Holy Prophet ﷺ) then supplicated Allah. (At that time) he (the Holy Prophet ﷺ) felt thirsty, and they happened to pass by a shepherd. Abu Bakr Siddiq رضی اللہ عنہ said: I took hold of a bowl and milked some milk into it for Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and gave it to him. He drank it and I was pleased.",
                "hadithUrdu": "جب رسول اللہ صلی اللہ علیہ وسلم مکہ سے مدینہ کو آئے تو سراقہ بن مالک نے ( مشرکوں کی طرف سے ) آپ صلی اللہ علیہ وسلم کا پیچھا کیا ۔ آپ صلی اللہ علیہ وسلم نے اس کے لئے بددعا کی تو اس کا گھوڑا ( زمین میں ) دھنس گیا ( یعنی زمین نے اس کو پکڑ لیا ) ۔ وہ بولا کہ آپ میرے لئے دعا کیجئے میں آپ کو نقصان نہیں پہنچاؤں گا ۔ آپ صلی اللہ علیہ وسلم نے اللہ سے دعا کی ( تو اس کو نجات ملی ) پھر آپ صلی اللہ علیہ وسلم کو پیاس لگی اور آپ صلی اللہ علیہ وسلم بکریوں کے چرواہے کے قریب سے گزرے ۔ سیدنا ابوبکر رضی اللہ عنہ نے کہا کہ میں نے پیالہ لیا اور تھوڑا سا دودھ آپ صلی اللہ علیہ وسلم کے لئے دوہا اور لے کر آپ صلی اللہ علیہ وسلم کے پاس آیا ، آپ رضی اللہ عنہ نے پیا ، یہاں تک کہ میں خوش ہو گیا ۔",
                "urduNarrator": "ہم سے محمد بن المثنیٰ اور ابن بشار نے بیان کیا اور یہ قول ابن المثنیٰ کا ہے, محمد بن جعفر نے کہا : ہمیں شعبہ نے حدیث بیان کی ، کہا : میں نے ابو اسحاق ہمدانی سے سنا ، کہہ رہے تھے : میں نے حضرت براء رضی اللہ عنہ کو یہ کہتے ہوئےسنا : کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ وَاللَّفْظُ لِابْنِ الْمُثَنَّى قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ أَبَا إِسْحَقَ الْهَمْدَانِيَّ يَقُولُ سَمِعْتُ الْبَرَاءَ يَقُولَ لَمَّا أَقْبَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ مَكَّةَ إِلَى الْمَدِينَةِ فَأَتْبَعَهُ سُراقَةُ بْنُ مَالِكِ بْنِ جُعْشُمٍ قَالَ فَدَعَا عَلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَاخَتْ فَرَسُهُ فَقَالَ ادْعُ اللَّهَ لِي وَلَا أَضُرُّكَ قَالَ فَدَعَا اللَّهَ قَالَ فَعَطِشَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَرُّوا بِرَاعِي غَنَمٍ قَالَ أَبُو بَكْرٍ الصِّدِّيقُ فَأَخَذْتُ قَدَحًا فَحَلَبْتُ فِيهِ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُثْبَةً مِنْ لَبَنٍ فَأَتَيْتُهُ بِهِ فَشَرِبَ حَتَّى رَضِيتُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12803,
                "hadithNumber": "5240",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was presented two cups at Bait al-Maqdis on the night of Heavenly Journey, one containing wine and the other containing milk. He looked at both of them, and be took the one containing milk, whereupon Gabriel (peace be upon him) said: Praise is due to Allah Who guided you to the true nature; had you taken the one containing wine, Your Umma would have gone astray.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کو جس رات بیت المقدس کی سیر کرائی گئی تو آپ صلی اللہ علیہ وسلم کے پاس دو پیالے لائے گئے ۔ ایک میں شراب تھی اور ایک میں دودھ ، آپ صلی اللہ علیہ وسلم نے دونوں کو دیکھا اور دودھ کا پیالہ لے لیا ۔ سیدنا جبرائیل علیہ السلام نے کہا کہ شکر ہے اس اللہ کا جس نے آپ کو فطرت کی ہدایت کی ( یعنی اسلام کی اور استقامت کی ) ۔ اگر آپ شراب کو لیتے تو آپ کی امت گمراہ ہو جاتی ۔",
                "urduNarrator": "ہم سے محمد بن عباد اور زہیر بن حرب نے بیان کیا اور ابن عباد نے کہا , ہم سے ابو صفوان نے بیان کیا , یونس نے زہری سے روایت کی ، کہا : ابن مسیب نے کہا , حضرت ابو ہریرہ رضی اللہ عنہ نے کہا : کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبَّادٍ وَزُهَيْرُ بْنُ حَرْبٍ وَاللَّفْظُ لِابْنِ عَبَّادٍ قَالَا حَدَّثَنَا أَبُو صَفْوَانَ أَخْبَرَنَا يُونُسُ عَنْ الزُّهْرِيِّ قَالَ قَالَ ابْنُ الْمُسَيَّبِ قَالَ أَبُو هُرَيْرَةَ إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُتِيَ لَيْلَةَ أُسْرِيَ بِهِ بِإِيلِيَاءَ بِقَدَحَيْنِ مِنْ خَمْرٍ وَلَبَنٍ فَنَظَرَ إِلَيْهِمَا فَأَخَذَ اللَّبَنَ فَقَالَ لَهُ جِبْرِيلُ عَلَيْهِ السَّلَام الْحَمْدُ لِلَّهِ الَّذِي هَدَاكَ لِلْفِطْرَةِ لَوْ أَخَذْتَ الْخَمْرَ غَوَتْ أُمَّتُكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12804,
                "hadithNumber": "5241",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ said:",
                "hadithEnglish": "\"The Messenger of Allah ﷺ was brought...\" a similar report (as no. 5240) but he did not mention in \"Iliyah\".",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے پاس ( دو پیالے ) لائے گئے ، اسی ( سابقہ حدیث ) کے مانند ۔ انھوں ( معقل ) نے \" ایلیاء \" کا ذکر نہیں کیا ۔",
                "urduNarrator": "مجھ سے سلمہ بن شبیب نے بیان کیا، کہا ہم سے حسن بن عیان نے بیان کیا, معقل نے زہری سے ، انھوں نے سعید بن مسیب سے روایت کی کہ انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ کو یہ کہتے ہوئے سنا",
                "hadithArabic": "و حَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ حَدَّثَنَا مَعْقِلٌ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ أُتِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ وَلَمْ يَذْكُرْ بِإِيلِيَاءَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12805,
                "hadithNumber": "5242",
                "englishNarrator": "Abu Humaid Sa'idi رضی اللہ عنہ reported:",
                "hadithEnglish": "I came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) with a cup of milk from Naqi' which had no cover over it, whereupon he said: Why did you not cover it? - even if you had covered it only with a stick. Abu Humaid said that he had been ordered that waterskins be tied during the night, and the doors be closed during the night.",
                "hadithUrdu": "میں رسول اللہ صلی اللہ علیہ وسلم کے پاس ایک پیالہ دودھ کا ( مقام ) نقیع سے لایا ، جو ڈھانپا ہوا نہ تھا تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ تو نے اس کو ڈھانپا کیوں نہیں؟ ( اگر ڈھانپنے کو کچھ نہ تھا تو ) ایک آڑی لکڑی ہی اس پر رکھ لیتا ۔ ابوحمید ( راوی حدیث ) کہتے ہیں کہ ہمیں رات کے وقت مشکیزوں کو باندھنے اور دروازے بند کرنے کا حکم فرمایا ۔",
                "urduNarrator": "ہم سے زہیر بن حرب، محمد بن المثنیٰ اور عبد بن حمید نے بیان کیا, ابو عاصم ضحاک نے کہا : ہمیں ابن جریج نے خبر دی ، کہا : مجھے ابو زبیر نے بتایا کہ انھوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے سنا ، کہہ رہے تھے : مجھ سے ابو حمید ساعدی رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَمُحَمَّدُ بْنُ الْمُثَنَّى وَعَبْدُ بْنُ حُمَيْدٍ كُلُّهُمْ عَنْ أَبِي عَاصِمٍ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا الضَّحَّاكُ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ أَخْبَرَنِي أَبُو حُمَيْدٍ السَّاعِدِيُّ قَالَ أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَدَحِ لَبَنٍ مِنْ النَّقِيعِ لَيْسَ مُخَمَّرًا فَقَالَ أَلَّا خَمَّرْتَهُ وَلَوْ تَعْرُضُ عَلَيْهِ عُودًا قَالَ أَبُو حُمَيْدٍ إِنَّمَا أُمِرَ بِالْأَسْقِيَةِ أَنْ تُوكَأَ لَيْلًا وَبِالْأَبْوَابِ أَنْ تُغْلَقَ لَيْلًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12806,
                "hadithNumber": "5243",
                "englishNarrator": "Abu Humaid Sa'idi رضی اللہ عنہ reported :",
                "hadithEnglish": "The Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) a cup containing milk...\" a similar report (as no. 5242). And he (one of the narrators) said: \"Zakariyyah did not mention the words of Abu Humaid رضی اللہ  عنہ .",
                "hadithUrdu": "وہ نبی کریم صلی اللہ علیہ وسلم کے پاس دودھ کا ایک پیالہ لائے ، اسی ( سابقہ حدیث ) کے مانند ۔ زکریا نے ( اپنی روایت کردہ حدیث میں ) حضرت ابو حمید رضی اللہ  عنہ کا قول : \" رات کے وقت \" بیان نہیں کیا ۔",
                "urduNarrator": "مجھ سے ابراہیم بن دینار نے بیان کیا,روح بن عبادہ نے کہا : ہمیں ابن جریج اور زکریا بن اسحاق نے حدیث بیان کی ، دونوں نے کہا : ہمیں ابو زبیر نے بتایا کہ انھوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے سنا ، کہہ رہے تھے : مجھے حضرت ابو حمید ساعدی رضی اللہ عنہ نے بتایا کہ",
                "hadithArabic": "و حَدَّثَنِي إِبْرَاهِيمُ بْنُ دِينَارٍ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ حَدَّثَنَا ابْنُ جُرَيْجٍ وَزَكَرِيَّاءُ بْنُ إِسْحَقَ قَالَا أَخْبَرَنَا أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ أَخْبَرَنِي أَبُو حُمَيْدٍ السَّاعِدِيُّ أَنَّهُ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَدَحِ لَبَنٍ بِمِثْلِهِ قَالَ وَلَمْ يَذْكُرْ زَكَرِيَّاءُ قَوْلَ أَبِي حُمَيْدٍ بِاللَّيْلِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12807,
                "hadithNumber": "5244",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "We were with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and he asked for water. A person said: Allah's Messenger, may we not give you Nabidh to drink? He (the Holy Prophet ﷺ) said: Yes (you may). He (the narrator) said: Then that person went out speedily and brought a cup containing Nabidh, whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Why did you not cover it? - even if it is with a wood. He said that then he drank it.",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے کہ آپ نے پانی مانگا ، ایک شخص نے کہا : اے اللہ کے رسول صلی اللہ علیہ وسلم !ہم آپ صلی اللہ علیہ وسلم کو نبیذ نہ پلائیں؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" کیوں نہیں! \" پھر وہ شخص دوڑتا ہوا گیا اور ایک پیالے میں نبیذ لے کر آیا ، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \" تم نے اسے ڈھانک کر کیوں نہیں دیا؟چاہے تم اس کے اوپر چوڑائی کے رخ ایک لکڑی ( ہی ) رکھ دیتے ۔ \" ( حضرت جابر رضی اللہ عنہ نے ) کہا : پھر آپ صلی اللہ علیہ وسلم نے نوش فرمایا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا اور یہ قول ابو کریب کا ہے , ابو معاویہ نے اعمش سے ، انھوں نے ابو صالح سے ، انھوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ وَاللَّفْظُ لِأَبِي كُرَيْبٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاسْتَسْقَى فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ أَلَا نَسْقِيكَ نَبِيذًا فَقَالَ بَلَى قَالَ فَخَرَجَ الرَّجُلُ يَسْعَى فَجَاءَ بِقَدَحٍ فِيهِ نَبِيذٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَّا خَمَّرْتَهُ وَلَوْ تَعْرُضُ عَلَيْهِ عُودًا قَالَ فَشَرِبَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12808,
                "hadithNumber": "5245",
                "englishNarrator": "Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "A person who was known as Abu Humaid brought for him (the Holy Prophet) a cup of milk from al-Naqi'. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said to him: Why did you not cover it even with a wood across it?",
                "hadithUrdu": "جایک شخص جو ابو حمید کہلاتاتھا ، نقیع ( مقام سے ) سے دودھ کا ایک پیالہ لایا ، جو ڈھانپا ہوا نہ تھا تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ تو نے اس کو ڈھانپا کیوں نہیں؟ ( اگر ڈھانپنے کو کچھ نہ تھا تو ) چاہے تم اس کے اوپر چوڑائی کے رخ ایک لکڑی ( ہی ) رکھ دیتے ۔",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ نے بیان کیا، انہوں نے کہا:جریر نے اعمش سے ، انھوں نے سفیان ابو صالح سے ، انھوں نے حضرت جابر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ وَأَبِي صَالِحٍ عَنْ جَابِرٍ قَالَ جَاءَ رَجُلٌ يُقَالُ لَهُ أَبُو حُمَيْدٍ بِقَدَحٍ مِنْ لَبَنٍ مِنْ النَّقِيعِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا خَمَّرْتَهُ وَلَوْ تَعْرُضُ عَلَيْهِ عُودًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12809,
                "hadithNumber": "5246",
                "englishNarrator": "Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Cover vessels, water skins, close the doors and extinguish the lamps, for the Satan does not loosen the water skin, does not open the door and does not uncover the vessels. And if one amongst you fails to find (something) to cover it well, he should cover it by placing (a piece of) wood across it. Qutaiba did not mention the closing of the doors in the hadith transmitted by him.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : برتنوں کو ڈھانک دو ، مشکوں کا منہ بند کردو ، دروازہ بند کردو ، اورچراغ بجھادو ، کیونکہ شیطان مشکیزے کامنہ نہیں کھولتا ، وہ دروازہ ( بھی ) نہیں کھولتا ، کسی برتن کو بھی نہیں کھولتاہے ۔ اگر تم میں سے کسی کو اسکے سوا اور چیز نہ ملے کہ وہ اپنے برتن پر چوڑائی کے بل لکڑی ہی رکھ دے ، یا اس پر اللہ کا نام ( بسم اللہ ) پڑ ھ دے تو ( یہی ) کرلے کیونکہ چوہیا گھروالوں کے اوپر ( یعنی جب وہ اس کی چھت تلے سوئے ہوتے ہیں ) ان کا گھر جلادیتی ہے ۔ \" قتیبہ نے اپنی حدیث میں : \" اور دروازہ بند کردو \" کے الفاظ بیان نہیں کیے ۔",
                "urduNarrator": "قتیبہ بن سعید اور محمد بن رمح نے لیث سے حدیث بیان کی ، انھوں نے ابو زبیرسے ، انھوں نے حضرت جابر رضی اللہ عنہ سے اور انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ غَطُّوا الْإِنَاءَ وَأَوْكُوا السِّقَاءَ وَأَغْلِقُوا الْبَابَ وَأَطْفِئُوا السِّرَاجَ فَإِنَّ الشَّيْطَانَ لَا يَحُلُّ سِقَاءً وَلَا يَفْتَحُ بَابًا وَلَا يَكْشِفُ إِنَاءً فَإِنْ لَمْ يَجِدْ أَحَدُكُمْ إِلَّا أَنْ يَعْرُضَ عَلَى إِنَائِهِ عُودًا وَيَذْكُرَ اسْمَ اللَّهِ فَلْيَفْعَلْ فَإِنَّ الْفُوَيْسِقَةَ تُضْرِمُ عَلَى أَهْلِ الْبَيْتِ بَيْتَهُمْ وَلَمْ يَذْكُرْ قُتَيْبَةُ فِي حَدِيثِهِ وَأَغْلِقُوا الْبَابَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12810,
                "hadithNumber": "5247",
                "englishNarrator": "It was narrated that Jabir رضی اللہ عنہ :",
                "hadithEnglish": "The prophet ﷺ, except that he said: \"Cover vessels.\" And he did not putting a sick across  vessels.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا: \" برتن الٹ کر رکھ دو یا انھیں ڈھانک دو ۔ \" اور برتن پر چوڑائی کے رُخ لکڑی رکھنے کا ذکر نہیں کیا ۔",
                "urduNarrator": "اور ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا: میں نے پڑھا۔امام مالک رحمۃ اللہ علیہ نے ابو زبیر سے ، انھوں نے حضرت جابر رضی اللہ عنہ سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے یہ حدیث روایت کی ، مگر",
                "hadithArabic": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْحَدِيثِ غَيْرَ أَنَّهُ قَالَ وَأَكْفِئُوا الْإِنَاءَ أَوْ خَمِّرُوا الْإِنَاءَ وَلَمْ يَذْكُرْ تَعْرِيضَ الْعُودِ عَلَى الْإِنَاءِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12811,
                "hadithNumber": "5248",
                "englishNarrator": "Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Shut the doors; the rest of the hadith is the same but with a slight variation of wording: Cover the utensils, and further said: It (the mouse) may set fire to the clothes of the residents of the house.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \" دروازہ بند کردو \" پھر لیث کی حدیث کے مانند بیان کیا ، البتہ انھوں نے کہا؛ \" اور برتنوں کو ڈھانک دو \" اور ی کہا : \" وہ ( چوہیا ) گھر والوں پر ان کے کیڑے جلا دیتی ہے ۔ \"",
                "urduNarrator": "ہم سے احمد بن یونس نے بیان کیا، ہم سے زہیر نے بیان کیا, زہیر نے ابو زبیر سے ، انھوں نے حضرت جابر رضی اللہ عنہ سے رویت کی ، کہا",
                "hadithArabic": "و حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَغْلِقُوا الْبَابَ فَذَكَرَ بِمِثْلِ حَدِيثِ اللَّيْثِ غَيْرَ أَنَّهُ قَالَ وَخَمِّرُوا الْآنِيَةَ وَقَالَ تُضْرِمُ عَلَى أَهْلِ الْبَيْتِ ثِيَابَهُمْ ِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12812,
                "hadithNumber": "5249",
                "englishNarrator": "A similar hadith (as no. 5245) was narrated from Jabir from the prophet ﷺ. And he said:",
                "hadithEnglish": "The mouse may set the house on fire over its inhabitants.",
                "hadithUrdu": "\" چوہیا گھر والوں کے اوپر گھر کو جلا دیتی ہے ۔ \"",
                "urduNarrator": "مجھ سے محمد بن المثنیٰ نے بیان کیا، کہا ہم سے عبدالرحمٰن نے بیان کیا, سفیان نے ابو زبیر سے ، انھوں نے حضرت جابر رضی اللہ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے ان کی حدیث کے مانند روایت کی اور فرمایا:",
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الرَّحْمَنِ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِهِمْ وَقَالَ وَالْفُوَيْسِقَةُ تُضْرِمُ الْبَيْتَ عَلَى أَهْلِه.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12813,
                "hadithNumber": "5250",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) having said: When the wings of the night (spread) or it is night, restrain your children (from going out), for the Satan is abroad at that time, and when a part of the night is passed, free them and shut the doors. making mention of God's name, for the Satan does not open a closed door; and tighten the (mouths of waterskins and mention the name of Allah, cover your utensils and mention the name of Allah even though you should just put something on them, and extinguish your lamps.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نےفرمایا : جب رات ہو جائے یا فرمایا کہ تم شام کرو تو اپنے بچوں کو ( گھروں میں ) روک لو کیونکہ اس وقت شیطان پھیل جاتے ہیں ۔ پھر جب کچھ رات گذر جائے تو بچوں کو چھوڑ دو اور اللہ کا نام لے دروازے بند کر دو کیونکہ شیطان بند دروازے نہیں کھولتا ۔ اور اللہ کا نام لے کر اپنے مشکیزوں کا بندھن باندھ دو اور اپنے برتنوں کو ڈھانک لو اللہ کا نام لے کر ۔ ( اگر برتن ڈھانکنے کے لئے اور کچھ نہ ملے سوا اس کہ ) ان برتنوں کے اوپر کوئی چیز چوڑائی میں رکھو ( تو وہی رکھ دو ) اور اپنے چراغوں کو بجھا دو ۔",
                "urduNarrator": "اسحاق بن منصور نے کہا : ہمیں روح بن عبادہ نے خبر دی کہا : ہمیں ابن جریج نے حدیث بیان کی ، کہا : مجھے عطاء نے بتایا کہ انھوں نے جابر بن عبداللہ رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے",
                "hadithArabic": "و حَدَّثَنِي إِسْحَقُ بْنُ مَنْصُورٍ أَخْبَرَنَا رَوْحُ بْنُ عُبَادَةَ حَدَّثَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي عَطَاءٌ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كَانَ جُنْحُ اللَّيْلِ أَوْ أَمْسَيْتُمْ فَكُفُّوا صِبْيَانَكُمْ فَإِنَّ الشَّيْطَانَ يَنْتَشِرُ حِينَئِذٍ فَإِذَا ذَهَبَ سَاعَةٌ مِنْ اللَّيْلِ فَخَلُّوهُمْ وَأَغْلِقُوا الْأَبْوَابَ وَاذْكُرُوا اسْمَ اللَّهِ فَإِنَّ الشَّيْطَانَ لَا يَفْتَحُ بَابًا مُغْلَقًا وَأَوْكُوا قِرَبَكُمْ وَاذْكُرُوا اسْمَ اللَّهِ وَخَمِّرُوا آنِيَتَكُمْ وَاذْكُرُوا اسْمَ اللَّهِ وَلَوْ أَنْ تَعْرُضُوا عَلَيْهَا شَيْئًا وَأَطْفِئُوا مَصَابِيحَكُمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 12501,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=500",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=498",
                "label": "498",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=499",
                "label": "499",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=500",
                "label": "500",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=501",
                "label": "501",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=502",
                "label": "502",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=503",
                "label": "503",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=504",
                "label": "504",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=502",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=502",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=500",
        "to": 12525,
        "total": 40465
    }
}