{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 577,
        "data": [
            {
                "id": 14689,
                "hadithNumber": "7128",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of 'Abdullah رضی اللہ عنہ through other chains of transmitters.",
                "hadithUrdu": "ابو سعید اشج نے ہمیں حدیث بیان کی ، کہا : ہمیں ابن ادریس نے حدیث بیان کی ، نیز ہمیں منجانب بن حارث تمیمی نے حدیث بیان کی ، کہا : ہمیں ابن مسہر نے خبر دی ، نیز ہمیں اسحٰق بن ابراہیم اور علی بن خشرم نے حدیث بیان کی ، دونوں نے کہا : ہمیں عیسیٰ بن یونس نے خبر دی ، نیز ہمیں ابن ابی عمر نے حدیث بیان کی ، انھوں نے کہا : ہمیں سفیان نے حدیث بیان کی ، ان سب نے اعمش سے اسی سند کے ساتھ اسی کے مطابق روایت کی ۔ اور منجانب نے اپنی روایت میں مزید یہ کہا : ابن مسہر سے روایت ہے اعمش نے کہا : اور مجھے عمرو بن مرہ نے شیقق سے اور انھوں نے عبد اللہ ( بن مسعود رضی اللہ عنہ ) سے اسی کے مانند حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ حَدَّثَنَا ابْنُ إِدْرِيسَ ح و حَدَّثَنَا مِنْجَابُ بْنُ الْحَارِثِ التَّمِيمِيُّ حَدَّثَنَا ابْنُ مُسْهِرٍ ح و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَعَلِيُّ بْنُ خَشْرَمٍ قَالَا أَخْبَرَنَا عِيسَى بْنُ يُونُسَ ح و حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ كُلُّهُمْ عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ نَحْوَهُ وَزَادَ مِنْجَابٌ فِي رِوَايَتِهِ عَنْ ابْنِ مُسْهِرٍ قَالَ الْأَعْمَشُ وَحَدَّثَنِي عَمْرُو بْنُ مُرَّةَ عَنْ شَقِيقٍ عَنْ عَبْدِ اللَّهِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14690,
                "hadithNumber": "7129",
                "englishNarrator": "Shaqiq bin Wa'il reported:",
                "hadithEnglish": "'Abdullah رضی اللہ عنہ used to give us sermon on every Thursday. A person said: Abu 'Abd al-Rahman, we love your talk and so we yearn (to listen to you) and earnestly desire that you should deliver us lecture every day. Thereupon he said: There is nothing to hinder me in giving you talk (every day) but the fact that you may be bored. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) did not deliver sermons on certain days (fearing that we might be bored).",
                "hadithUrdu": "حضرت عبد اللہ ( بن مسعود رضی اللہ عنہ ) ہمیں ہر جمعرات کے دن وعظ و نصیحت فرمایا کرتے تھے تو ایک شخص نے کہا : ابو عبد الرحمٰن !ہمیں آپ کی باتیں ( بہت ) پسند ہیں اور ہم ان کی طرف شدید رغبت رکھتے ہیں ۔ ہم چاہتے ہیں کہ آپ ہر روز ہمیں احادیث بیان فرمایا کریں ۔ انھوں نے کہا : مجھے اس کے علاوہ تمھیں احادیث بیان کرنے سے صرف یہ ناپسندیدگی مانع ہے کہ میں تمھیں اکتاہٹ کا شکار نہ کردوں ۔ رسول اللہ صلی اللہ علیہ وسلم اس بات کو ناپسند کرتے ہوئے کہ ہم پر اکتاہٹ طاری ہو جائے کچھ ( خاص ) دنوں میں ہی ہمیں وعظ و نصیحت سے نواازاکرتے تھے ۔",
                "urduNarrator": "اور ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے جریر نے بیان کیا, منصور نے شیقق ابو وائل سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا جَرِيرٌ عَنْ مَنْصُورٍ و حَدَّثَنَا ابْنُ أَبِي عُمَرَ وَاللَّفْظُ لَهُ حَدَّثَنَا فُضَيْلُ بْنُ عِيَاضٍ عَنْ مَنْصُورٍ عَنْ شَقِيقٍ أَبِي وَائِلٍ قَالَ كَانَ عَبْدُ اللَّهِ يُذَكِّرُنَا كُلَّ يَوْمِ خَمِيسٍ فَقَالَ لَهُ رَجُلٌ يَا أَبَا عَبْدِ الرَّحْمَنِ إِنَّا نُحِبُّ حَدِيثَكَ وَنَشْتَهِيهِ وَلَوَدِدْنَا أَنَّكَ حَدَّثْتَنَا كُلَّ يَوْمٍ فَقَالَ مَا يَمْنَعُنِي أَنْ أُحَدِّثَكُمْ إِلَّا كَرَاهِيَةُ أَنْ أُمِلَّكُمْ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَتَخَوَّلُنَا بِالْمَوْعِظَةِ فِي الْأَيَّامِ كَرَاهِيَةَ السَّآمَةِ عَلَيْنَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 151,
                    "chapterNumber": "51",
                    "chapterEnglish": "Characteristics of The Hypocrites And Rulings Concerning Them",
                    "chapterUrdu": "منافقین کی صفات اور ان کے بارے میں احکام",
                    "chapterArabic": "كتاب صِفَاتِ الْمُنَافِقِينَ وَأَحْكَامِهِمْ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14691,
                "hadithNumber": "7130",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "\"The Messenger of Allah ﷺ said: The Paradise is surrounded by hardships and the Hell-Fire is surrounded by temptations.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جنت گراں امور میں گھری ہوئی ہے اور دوزخ خواہشات نفسانی میں گھری ہوئی ہے ۔ \"",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ بن قعنب نے بیان کیا، کہا ہم سے حماد بن سلمہ نے بیان کیا، ثابت اور حمید کی سند سے, حضر ت انس بن مالک رضی اللہ عنہ سے روایت ہے ، کہا",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ ثَابِتٍ وَحُمَيْدٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حُفَّتْ الْجَنَّةُ بِالْمَكَارِهِ وَحُفَّتْ النَّارُ بِالشَّهَوَاتِ.",
                "headingArabic": "صفة الجنة",
                "headingUrdu": "جنت کی تفصیل",
                "headingEnglish": "The Description of Paradise",
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14692,
                "hadithNumber": "7131",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Abu Huraira رضی اللہ عنہ through another chain of transmitters.",
                "hadithUrdu": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے شبابہ نے بیان کیا، کہا کہ مجھ سے ورقہ نے بیان کیا، ابو الزیناد نے، العرج کی سند سے، انہوں نےحضرت ابوہریرہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے اسی کی مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا شَبَابَةُ حَدَّثَنِي وَرْقَاءُ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14693,
                "hadithNumber": "7132",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying that: Allah the Exalted and Glorious, said: I have prepared for My pious servants which no eye has ever seen, and no ear has ever heard, and no human heart has ever perceived but it is testified by the Book of Allah. He then recited: No soul knows what comfort has been concealed from them, as a reward for what they did . (xxxii. 17)",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" اللہ عزوجل نے ارشادفرمایا : میں نے اپنے نیک بندوں کےلیے وہ کچھ تیار کررکھا ہے جسے ن کسی آنکھ نے دیکھا ہے نہ کسی کان نے سنا ہے اور نہ کسی انسان کے دل میں ان کا خیال تک گزرا ہے ۔ \"\" کتاب اللہ میں اس کا مصداق ( یہ آیت ) ہے : \"\" کسی کومعلوم نہیں کہ جو نیک کام کرتے رہے ان کی جزا کے طور پر ان کی آنکھوں کو ٹھنڈا کرنے کےلیے کیا جو چھپا کررکھا گیا ہے ۔ \"\"",
                "urduNarrator": "ہم سے سعید بن عمرو اشعثی اور زہیر بن حرب نے بیان کیا۔ زہیر نے کہا: انہوں نے ہم سے بیان کیا، اور سعید نے کہا, سفیان نے ابو زناد سے ، انھوں نے اعرج سے ، انھوں نے حضرت ابوہریرۃ رضی اللہ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ عَمْرٍو الْأَشْعَثِيُّ وَزُهَيْرُ بْنُ حَرْبٍ قَالَ زُهَيْرٌ حَدَّثَنَا و قَالَ سَعِيدٌ أَخْبَرَنَا سُفْيَانُ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قَالَ اللَّهُ عَزَّ وَجَلَّ أَعْدَدْتُ لِعِبَادِيَ الصَّالِحِينَ مَا لَا عَيْنٌ رَأَتْ وَلَا أُذُنٌ سَمِعَتْ وَلَا خَطَرَ عَلَى قَلْبِ بَشَرٍ مِصْدَاقُ ذَلِكَ فِي كِتَابِ اللَّهِ فَلَا تَعْلَمُ نَفْسٌ مَا أُخْفِيَ لَهُمْ مِنْ قُرَّةِ أَعْيُنٍ جَزَاءً بِمَا كَانُوا يَعْمَلُونَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14694,
                "hadithNumber": "7133",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Allah, the Exalted and Glorious, said: I have prepared for My pious servants which no eye (has ever) seen, no ear has (ever) heard and no human heart has ever perceived those bounties leaving apart (those bounties) about which Allah has informed you.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا؛ \" اللہ عزوجل نے ارشاد فرمایا : میں نے اپنے نیک بندوں کے لئے وہ کچھ تیار کرکے جمع کررکھا ہے جو نہ کسی آنکھ نے دیکھا نہ کسی کان نے سنا اور نہ کسی انسان کے دل میں ان ( کے تصور ) کا گزر ہوا ۔ ( یہ ) ان ( نعمتوں کے ) علاوہ ہے جن کے ) علاوہ ہے ۔ جن کے بارے میں تمھیں اللہ تعالیٰ نے مطلع کردیاہے ۔ \"",
                "urduNarrator": "مجھ سے ہارون بن سعید الایلی نے بیان کیا، ہم سے ابن وہب نے بیان کیا, مالک نے ابو زناد سے ، انھوں نے اعرج سے اور انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ حَدَّثَنَا ابْنُ وَهْبٍ حَدَّثَنِي مَالِكٌ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قَالَ اللَّهُ عَزَّ وَجَلَّ أَعْدَدْتُ لِعِبَادِيَ الصَّالِحِينَ مَا لَا عَيْنٌ رَأَتْ وَلَا أُذُنٌ سَمِعَتْ وَلَا خَطَرَ عَلَى قَلْبِ بَشَرٍ ذُخْرًا بَلْهَ مَا أَطْلَعَكُمْ اللَّهُ عَلَيْهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14695,
                "hadithNumber": "7134",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said that Allah, the Exalted and Glorious, said: I have prepared for My pious servants which the eye has seen not, and the ear has heard not and no human heart has ever perceived such bounties leaving aside those about which Allah has informed you. He then recited: No soul knows what comfort has been hidden for thein .",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" اللہ عزوجل ارشاد فرماتاہے : میں نے اپنے نیک بندوں کے لئے وہ نعمتیں تیارکرکے جمع کی ہیں جن کو نہ کسی آنکھ نے دیکھا نہ کسی کان نے سنا اور نہ ان کا کسی بشر کے دل میں خیال گزرا ، ان نعمتوں کے علاوہ جن پر اللہ تعالیٰ نے تمھیں مطلع کردیا ہے ۔ \"\" پھر آپ صلی اللہ علیہ وسلم نے ( یہ آیت ) پڑھی : \"\" کسی کو معلوم نہیں کہ ان کی آنکھوں کی ٹھنڈک کےلیے کیا کچھ چھپا کررکھاگیاہے ۔ \"\"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا: ہم سے ابو معاویہ نے بیان کیا، اور ہم سے ابن نمیر نے بیان کیا، اور ان کا قول یہ ہے: ہم سے میرے والد نے بیان کیا,  ہم سے العمش نے بیان کیا, ابو صالح نے حضرت ابو ہریرۃ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ و حَدَّثَنَا ابْنُ نُمَيْرٍ وَاللَّفْظُ لَهُ حَدَّثَنَا أَبِي حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ اللَّهُ عَزَّ وَجَلَّ أَعْدَدْتُ لِعِبَادِيَ الصَّالِحِينَ مَا لَا عَيْنٌ رَأَتْ وَلَا أُذُنٌ سَمِعَتْ وَلَا خَطَرَ عَلَى قَلْبِ بَشَرٍ ذُخْرًا بَلْهَ مَا أَطْلَعَكُمْ اللَّهُ عَلَيْهِ ثُمَّ قَرَأَ فَلَا تَعْلَمُ نَفْسٌ مَا أُخْفِيَ لَهُمْ مِنْ قُرَّةِ أَعْيُنٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14696,
                "hadithNumber": "7135",
                "englishNarrator": "Sahl bin Sa'd as-Sa'idi رضی اللہ عنہ reported:",
                "hadithEnglish": "I was in the company of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) that he gave a description of Paradise and then Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) concluded with these words: There would be bounties which the eye has not seen and the ear has not heard and no human heart has ever perceived them. He then recited this verse: They forsake (their) beds, calling upon their Lord in fear and in hope, and spend out of what We have given them. So no soul knows what refreshment of the eyes is hidden for them: a reward for what they did (xxxii. 16-17)",
                "hadithUrdu": "میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک مجلس میں حاضر ہوا جس میں آپ نے جنت کی صفت بیان کی حتیٰ کہ آ پ نے بات ختم کی ۔ پھر اپنی بات کے آخر میں فرمایا : \" اس ( جنت ) میں وہ کچھ ہے جو نہ کسی آنکھ نے دیکھا نہ کسی کان نے سنا نہ کسی انسان کے دل میں اس کا خیال گزرا ۔ \" پھر آپ نے یہ آیت پڑھی : \" ان کے پہلو بستروں سے دور رہتے ہیں وہ خوف کے عالم میں اور پوری امید کے ساتھ اپنے رب کو پکارتے ہیں اور ہم نے جو رزق ان کو دیا ہے اس میں سے ( اللہ کی راہ میں ) خرچ کر تے ہیں ۔ پس کوئی ذی حیات ( انسان ) نہیں جانتا کہ جو وہ کرتے ہیں اس کے صلے میں ان کی آنکھوں کی ٹھنڈک کےلیے کیا ( کچھ ) چھپا کررکھا گیاہے ۔ \"",
                "urduNarrator": "ہم سے ہارون بن معروف اور ہارون بن سعید الایلی نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، مجھ سے ابو صخر نے بیان کیا, ابوحازم نے کہا : میں نے حضر ت سہل بن سعد ساعدی رضی اللہ عنہ کو بیان کرتے ہوئے سنا",
                "hadithArabic": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ وَهَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ قَالَا حَدَّثَنَا ابْنُ وَهْبٍ حَدَّثَنِي أَبُو صَخْرٍ أَنَّ أَبَا حَازِمٍ حَدَّثَهُ قَالَ سَمِعْتُ سَهْلَ بْنَ سَعْدٍ السَّاعِدِيَّ يَقُولُ شَهِدْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَجْلِسًا وَصَفَ فِيهِ الْجَنَّةَ حَتَّى انْتَهَى ثُمَّ قَالَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي آخِرِ حَدِيثِهِ فِيهَا مَا لَا عَيْنٌ رَأَتْ وَلَا أُذُنٌ سَمِعَتْ وَلَا خَطَرَ عَلَى قَلْبِ بَشَرٍ ثُمَّ اقْتَرَأَ هَذِهِ الْآيَةَ تَتَجَافَى جُنُوبُهُمْ عَنْ الْمَضَاجِعِ يَدْعُونَ رَبَّهُمْ خَوْفًا وَطَمَعًا وَمِمَّا رَزَقْنَاهُمْ يُنْفِقُونَ فَلَا تَعْلَمُ نَفْسٌ مَا أُخْفِيَ لَهُمْ مِنْ قُرَّةِ أَعْيُنٍ جَزَاءً بِمَا كَانُوا يَعْمَلُونَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14697,
                "hadithNumber": "7136",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: In Paradise, there is a tree under the shadow of which a rider can travel for a hundred years.",
                "hadithUrdu": "آپ نے فرمایا : \" جنت میں ایک درخت ہے جس کے سائے میں ایک اونٹ سوار سوسال تک چلتا رہے گا ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ہم سے لیث نے سعید کی سند سے بیان کیا, ابو سعید مقبری نے حضرت ابو ہریرہ رضی اللہ عنہ سے ، انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ إِنَّ فِي الْجَنَّةِ لَشَجَرَةً يَسِيرُ الرَّاكِبُ فِي ظِلِّهَا مِائَةَ سَنَةٍ.",
                "headingArabic": "إِنَّ فِي الْجَنَّةِ شَجَرَةً يَسِيرُ الرَّاكِبُ فِي ظِلِّهَا مِائَةَ عَامٍ لاَ يَقْطَعُهَا ‏‏",
                "headingUrdu": "جنت میں ایک ایسا درخت ہے جس کے سائے میں سوار سو سال تک سفر کر سکتا ہے پھر بھی اسے عبور نہیں کر سکتا",
                "headingEnglish": "In Paradise There Is A Tree In Whose Shade A Rider Could Travel For One Hundred Years And Still Not Cross It",
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14698,
                "hadithNumber": "7137",
                "englishNarrator": "This hadith has been narrated on the authority of Abu Huraira رضی اللہ عنہ through another chain of transmitters with the addition of these words:",
                "hadithEnglish": "\"He will not be able to cover this distance.\"",
                "hadithUrdu": "\" وہ اس ( کے سائے ) کو طے نہیں کرسکے گا ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا : ہم سے المغیرہ یعنی ابن عبدالرحمٰن حزامی نے ابو الزناد کی سند سے بیان کیا , اعرج نے حضرت ابوہریرہ رضی اللہ عنہ سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے اسی کی مثل روایت کی اور مزید کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا الْمُغِيرَةُ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْحِزَامِيَّ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ وَزَادَ لَا يَقْطَعُهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14699,
                "hadithNumber": "7138",
                "englishNarrator": "Sahl bin Sa'd رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: In Paradise, there is a tree under the shadow of which a rider can travel for a hundred years without covering (the distance) completely.",
                "hadithUrdu": "آپ نے فرمایا : \" جنت میں ایک درخت ہے ، ایک سوار اس کے سائے میں سوسال تک چلتا رہے تو بھی اس کو طے نہ کرسکے ۔ \"",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم الحنظَلی نے بیان کیا، کہا ہم سے المخزومی نے بیان کیا، ہم سے وہیب نے بیان کیا, ابوحازم نے حضر ت سہل بن سعد رضی اللہ عنہ سے ، انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے ر وایت کی کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ أَخْبَرَنَا الْمَخْزُومِيُّ حَدَّثَنَا وُهَيْبٌ عَنْ أَبِي حَازِمٍ عَنْ سَهْلِ بْنِ سَعْدٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ فِي الْجَنَّةِ لَشَجَرَةً يَسِيرُ الرَّاكِبُ فِي ظِلِّهَا مِائَةَ عَامٍ لَا يَقْطَعُهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14700,
                "hadithNumber": "7139",
                "englishNarrator": "This hadith has also been transmitted on the authority of Abu Sa'id al-Khudri رضی اللہ عنہ that",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: In Paradise, there is a tree under the shadow of which a rider of a fine and swift-footed horse would travel for a hundred years without covering the distance completely.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" جنت میں ایک درخت ہے ( جس کے سائے میں ) ایک تیز رفتار چھریرے کھوڑے پرسوار شخص سو سال چلے تو بھی اسے قطع نہ کرسکے ۔ \"",
                "urduNarrator": "ابو حازم نے کہا : میں نے یہ حدیث نعمان بن ابی عیاش زرقی کو سنائی تو انھوں نے کہا : مجھے ابو سعید خدری رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے روایت کرتے ہوئے بیان کیا",
                "hadithArabic": "قَالَ أَبُو حَازِمٍ فَحَدَّثْتُ بِهِ النُّعْمَانَ بْنَ أَبِي عَيَّاشٍ الزُّرَقِيَّ فَقَالَ حَدَّثَنِي أَبُو سَعِيدٍ الْخُدْرِيُّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ فِي الْجَنَّةِ شَجَرَةً يَسِيرُ الرَّاكِبُ الْجَوَادَ الْمُضَمَّرَ السَّرِيعَ مِائَةَ عَامٍ مَا يَقْطَعُهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14701,
                "hadithNumber": "7140",
                "englishNarrator": "Abu Sa'id al-Khudri رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said that Allah would say to the inmates of Paradise: O, Dwellers of Paradise, and they would say in response: At thy service and pleasure, our Lord, the good is in Thy Hand. He (the Lord) would say: Are you well pleased now? They would say: Why should we not be pleased, O Lord, when Thou hast given us what Thou hast not given to any of Thy creatures? He would, however, say: May I not give you (something) even more excellent than that? And they would say: O Lord, what thing can be more excellent than this? And He would say: I shall cause My pleasure to alight upon you and I shall never be afterwards annoyed with you.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا : \" اللہ عزوجل اہل جنت سے فرمائے گا : اے اہل جنت! وہ کہیں گے : لبیک ، اے ہمارے رب!زہے نصیب کہ تیرے سامنےحاضر ہیں اور بھلائی تیرے ہاتھوں میں ہے چنانچہ وہ فرمائے گا : کیا تم راضی ہوگئے ہو؟وہ سب کہیں گے : ہم راضی کیوں نہ ہوں؟اے ہمارے رب! جبکہ تو نے ہمیں وہ کچھ عطا کردیا ہے جو تونے اپنی ساری مخلوق میں سے کسی کو عطا نہیں فرمایا ۔ وہ فرمائے گا : کیا میں تمھیں اس سے بھی بہتر عطا نہ کروں؟تو وہ کہیں گے : اے رب! ( جوتو نے عطا کردیا ہے ) اس سے افضل کیا ہے؟وہ فرمائے گا : میں تم پر اپنی رضا نازل کرتا ہوں ، اس کے بعد میں تم سے کبھی ناراض نہ ہوں گا ۔ \"",
                "urduNarrator": "ہم سے محمد بن عبدالرحمٰن بن سہم نے بیان کیا، کہا ہم سے عبداللہ بن المبارک نے بیان کیا، کہا ہم کو ملک برق نے خبر دی، انہیں ملک ہارون بن سعید العیلی نے خبر دی اور یہ قول ان کا ہے، ہم سے عبداللہ بن وہب نے بیان کیا، مجھ سے مالک بن انس نے بیان کیا، ان سے مالک بن انس رضی اللہ عنہ نے، ان سے انس بن مالک رضی اللہ عنہ نے, حضرت ابو سعید خدری رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ سَهْمٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ أَخْبَرَنَا مَالِكُ بْنُ أَنَسٍ و حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ وَاللَّفْظُ لَهُ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ حَدَّثَنِي مَالِكُ بْنُ أَنَسٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ يَقُولُ لِأَهْلِ الْجَنَّةِ يَا أَهْلَ الْجَنَّةِ فَيَقُولُونَ لَبَّيْكَ رَبَّنَا وَسَعْدَيْكَ وَالْخَيْرُ فِي يَدَيْكَ فَيَقُولُ هَلْ رَضِيتُمْ فَيَقُولُونَ وَمَا لَنَا لَا نَرْضَى يَا رَبِّ وَقَدْ أَعْطَيْتَنَا مَا لَمْ تُعْطِ أَحَدًا مِنْ خَلْقِكَ فَيَقُولُ أَلَا أُعْطِيكُمْ أَفْضَلَ مِنْ ذَلِكَ فَيَقُولُونَ يَا رَبِّ وَأَيُّ شَيْءٍ أَفْضَلُ مِنْ ذَلِكَ فَيَقُولُ أُحِلُّ عَلَيْكُمْ رِضْوَانِي فَلَا أَسْخَطُ عَلَيْكُمْ بَعْدَهُ أَبَدًا.",
                "headingArabic": "إِحْلاَلِ الرِّضْوَانِ عَلَى أَهْلِ الْجَنَّةِ فَلاَ يَسْخَطُ عَلَيْهِمْ أَبَدًا ‏‏",
                "headingUrdu": "اہل جنت پر رضائے الٰہی کا انعام، اور اللہ ان سے کبھی ناراض نہیں ہوگا۔",
                "headingEnglish": "Bestowal Of Divine Pleasure On The People Of Paradise, And Allah Will Never Be Angry With Them",
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14702,
                "hadithNumber": "7141",
                "englishNarrator": "Sahl bin Sa'd رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The inmates of Paradise will look to the upper apartment of Paradise as you see the planets in the sky.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \" جنت والے جنت کے بالا خانے کو اس طرح دیکھیں گے جس طرح تم لوگ آسمان میں ستارے کو دیکھتے ہو ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, یعقوب بن عبدالرحمن القاری نے ہمیں ابوحازم سے حدیث بیان کی ، انھوں نے حضرت سہل بن سعد رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا يَعْقُوبُ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْقَارِيَّ عَنْ أَبِي حَازِمٍ عَنْ سَهْلِ بْنِ سَعْدٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ أَهْلَ الْجَنَّةِ لَيَتَرَاءَوْنَ الْغُرْفَةَ فِي الْجَنَّةِ كَمَا تَرَاءَوْنَ الْكَوْكَبَ فِي السَّمَاءِ.",
                "headingArabic": "تَرَائِي أَهْلِ الْجَنَّةِ أَهْلَ الْغُرَفِ كَمَا يُرَى الْكَوْكَبُ فِي السَّمَاءِ ‏‏",
                "headingUrdu": "اہل جنت لوگوں کو جنت میں سب سے اونچے مقام پر اس طرح دیکھیں گے جیسے آسمان میں سیارے نظر آتے ہیں",
                "headingEnglish": "The Inhabitants Of Paradise Will See The People In The Highest Place In Paradise As Planets Are Seen In The Sky",
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14703,
                "hadithNumber": "7142",
                "englishNarrator": "Abi 'Ayyash and he said:",
                "hadithEnglish": "I heard Abu Sa'id al-Khudri رضی اللہ عنہ as saying: As you see the shining planets in the eastern and western (sides of) horizon.",
                "hadithUrdu": "میں نے حضرت ابو سعید خدری رضی اللہ عنہ کو یہ کہتے ہوئے سنا؛ \" جس طرح تم آسمان کے مشرقی یامغربی افق میں چمکتے ہوئے ستارے کو دیکھتے ہو \"",
                "urduNarrator": "( ابوحازم نے ) کہا : میں نے یہ روایت نعمان بن ابی عیاش سے بیان کی تو انھوں نے کہا",
                "hadithArabic": "قَالَ فَحَدَّثْتُ بِذَلِكَ النُّعْمَانَ بْنَ أَبِي عَيَّاشٍ فَقَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ يَقُولُ كَمَا تَرَاءَوْنَ الْكَوْكَبَ الدُّرِّيَّ فِي الْأُفُقِ الشَّرْقِيِّ أَوْ الْغَرْبِيِّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14704,
                "hadithNumber": "7143",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Abu Hazim through another chain of transmitters.",
                "hadithUrdu": "اور ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے المخزومی نے بیان کیا, وہیب نے ابو حازم سے گزشتہ دونوں سندوں کے ساتھ یعقوب کی حدیث کے مانند بیان کیا ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَاه إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا الْمَخْزُومِيُّ حَدَّثَنَا وُهَيْبٌ عَنْ أَبِي حَازِمٍ بِالْإِسْنَادَيْنِ جَمِيعًا نَحْوَ حَدِيثِ يَعْقُوبَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14705,
                "hadithNumber": "7144",
                "englishNarrator": "Abu Sa'id al-Khudri رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: The inmates of Paradise would see the inmates of the apartment over them just as you see the shining planets which remain in the eastern and the western horizon because of the superiority some have over others. They said: Allah's Messenger, would in these abodes of Apostles others besides them not be able to reach? He said: Yes, they will, by Him, in Whose hand is my life, those who believe in God and acknowledge the Truth, will reach them.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اہل جنت فضیلت میں باہمی فرق کی بنا پر اپنے اوپر بالا خانوں میں رہنے والوں کی اس طرح دیکھیں گے جس طرح تم آسمان کے مشرقی یا مغربی کنارے میں چمکتے ہوئے تنہا ستارے کو دیکھتے ہو ۔ \" انھوں ( صحابہ رضوان اللہ عنھم اجمعین ) نے عرض کی : اللہ کے رسول صلی اللہ علیہ وسلم ! کیا وہ انبیاء علیہ السلام کے رہنے کی جگہیں ہوں گی جن تک دوسرا کوئی نہیں پہنچ سکتا؟آپ صلی اللہ علیہ وسلم نے فرمایا؛ \" کیوں نہیں ، اس ذات کی قسم جس کے ہاتھ میں میری جان ہے ! یہ ایسے مرد ہوں گے جو اللہ تعالیٰ پر ایمان لائے اور انھوں نے رسولوں کی تصدیق کی ۔ \"",
                "urduNarrator": "ہم سے عبداللہ بن جعفر بن یحییٰ بن خالد نے بیان کیا، ہم سے معن نے بیان کیا، ہم سے مالک نے بیان کیا اور ہم سے ہارون بن سعید العیلی نے بیان کیا - اور یہ قول ان کا ہے - ہم سے عبداللہ بن وہب نے بیان کیا، انہیں مالک بن انس نے صفوان کی سند سے خبر دی, عطاء بن یسار نے حضرت ابوسعید خدری رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ جَعْفَرِ بْنِ يَحْيَى بْنِ خَالِدٍ حَدَّثَنَا مَعْنٌ حَدَّثَنَا مَالِكٌ و حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ وَاللَّفْظُ لَهُ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي مَالِكُ بْنُ أَنَسٍ عَنْ صَفْوَانَ بْنِ سُلَيْمٍ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ أَهْلَ الْجَنَّةِ لَيَتَرَاءَوْنَ أَهْلَ الْغُرَفِ مِنْ فَوْقِهِمْ كَمَا تَتَرَاءَوْنَ الْكَوْكَبَ الدُّرِّيَّ الْغَابِرَ مِنْ الْأُفُقِ مِنْ الْمَشْرِقِ أَوْ الْمَغْرِبِ لِتَفَاضُلِ مَا بَيْنَهُمْ قَالُوا يَا رَسُولَ اللَّهِ تِلْكَ مَنَازِلُ الْأَنْبِيَاءِ لَا يَبْلُغُهَا غَيْرُهُمْ قَالَ بَلَى وَالَّذِي نَفْسِي بِيَدِهِ رِجَالٌ آمَنُوا بِاللَّهِ وَصَدَّقُوا الْمُرْسَلِينَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14706,
                "hadithNumber": "7145",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The people most loved by me from amongst my Ummah would be those who would come after me but everyone amongst them would have the keenest desire to catch a glimpse of me even at the cost of his family and wealth.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" میری امت میں میرے ساتھ سب سے زیادہ محبت کرنے والوں میں وہ لوگ ( بھی ) ہیں جو میرے بعد ہوں گے ، ان میں سے ( ہر ) ایک نہ چاہتا ہوگا کہ کاش! اپنے اہل وعیال اور مال کی قربانی دے کرمجھے دیکھ لے ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ان سے یعقوب نے، یعنی ابن عبدالرحمٰن نے، ہم سے سہیل کے واسطہ سے اپنے والد سے بیان کیا, حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا يَعْقُوبُ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مِنْ أَشَدِّ أُمَّتِي لِي حُبًّا نَاسٌ يَكُونُونَ بَعْدِي يَوَدُّ أَحَدُهُمْ لَوْ رَآنِي بِأَهْلِهِ وَمَالِهِ.",
                "headingArabic": "فِيمَنْ يَوَدُّ رُؤْيَةَ النَّبِيِّ صلى الله عليه وسلم بِأَهْلِهِ وَمَالِهِ ‏‏",
                "headingUrdu": "وہ شخص جو رسول اللہ صلی اللہ علیہ وسلم کا دیدار کرنا پسند کرے گا خواہ وہ اپنے اہل و عیال اور مال کی قیمت پر کیوں نہ ہو۔",
                "headingEnglish": "One Who Would Love To Have Seen The Prophet (SAW) Even If That Was At The Expense Of His Family And His Wealth",
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14707,
                "hadithNumber": "7146",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: In Paradise there is a street to which they would come every Friday. The north wind will blow and would scatter fragrance on their faces and on their clothes and would add to their beauty and loveliness, and then they would go back to their family after having an added lustre to their beauty and loveliness, and their family would say to them: By Allah, you have been increased in beauty and loveliness after leaving us, and they would say: By Allah, you have also increased in beauty and loveliness after us.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جنت میں ایک بازار ہے جس میں وہ ( اہل جنت ) ہر جمعہ کو آیا کریں گے تو ( اس روز ) شمال کی ایسی ہوا چلے گی جو ان سے چہروں پر اور ان کے کپڑوں پر پھیل جائےگی ، وہ حسن اورزینت میں اوربڑھ جائیں گے ، وہ اپنے گھروالوں کے پاس واپس آئیں گے تو وہ ( بھی ) حسن وجمال میں اور بڑھ گئے ہوں گے ، ان کےگھر والے ان سے کہیں گے : اللہ کی قسم! ہمارے ( ہاں سے جانے کے ) بعد تمہارا حسن وجمال اور بڑھ گیا ہے ۔ وہ کہیں گے اور تم بھی ، اللہ کی قسم! ہمارے پیچھے تم لوگ بھی اور زیادہ خوبصورت حسین ہوگئے ہو ۔ \"",
                "urduNarrator": "ہم سے ابو عثمان سعید بن عبدالجبار البصری نے بیان کیا، کہا ہم سے حماد بن سلمہ نے بیان کیا، ثابت البنانی کی سند سے, حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو عُثْمَانَ سَعِيدُ بْنُ عَبْدِ الْجَبَّارِ الْبَصْرِيُّ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ فِي الْجَنَّةِ لَسُوقًا يَأْتُونَهَا كُلَّ جُمُعَةٍ فَتَهُبُّ رِيحُ الشَّمَالِ فَتَحْثُو فِي وُجُوهِهِمْ وَثِيَابِهِمْ فَيَزْدَادُونَ حُسْنًا وَجَمَالًا فَيَرْجِعُونَ إِلَى أَهْلِيهِمْ وَقَدْ ازْدَادُوا حُسْنًا وَجَمَالًا فَيَقُولُ لَهُمْ أَهْلُوهُمْ وَاللَّهِ لَقَدْ ازْدَدْتُمْ بَعْدَنَا حُسْنًا وَجَمَالًا فَيَقُولُونَ وَأَنْتُمْ وَاللَّهِ لَقَدْ ازْدَدْتُمْ بَعْدَنَا حُسْنًا وَجَمَالًا.",
                "headingArabic": "فِي سُوقِ الْجَنَّةِ وَمَا يَنَالُونَ فِيهَا مِنَ النَّعِيمِ وَالْجَمَالِ ‏‏",
                "headingUrdu": "جنت کا بازار، اور وہاں انہیں لذت اور خوبصورتی کیا ملے گی۔",
                "headingEnglish": "The Market Of Paradise, And What They Will Get There Of Delight And Beauty",
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14708,
                "hadithNumber": "7147",
                "englishNarrator": "Muhammad reported:",
                "hadithEnglish": "Some (persons) stated with a sense of pride and some discussed whether there would be more men in Paradise or more women. It was upon this that Abu Huraira رضی اللہ عنہ reported that Abu'l Qasim (the Holy Prophet) ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: The (members) of the first group to get into Paradise would have their faces as bright as full moon during the night, and the next to this group would have their faces as bright as the shining stars in the sky, and every person would have two wives and the marrow of their shanks would glimmer beneath the flesh and there would be none without a wife in Paradise.",
                "hadithUrdu": "( حصول علم کے لیے جمع ہونے والے مردوں اور عورتوں نے ) باہمی اظہار ، تفاخر یا علمی مذاکرہ کرتے ہوئے ( اس موضوع پر ) بات کی کہ جنت میں مرد زیادہ ہوں گے یا عورتیں؟تو حضرت ابو ہریرہ رضی اللہ عنہ نے کہا : کیا ابو القاسم صلی اللہ علیہ وسلم نے فرمایا نہ تھا : \" پہلی جماعت جو جنت میں داخل ہوگی ان کی صورتیں چودھویں رات کے چاند جیسی ہوں گی اور جو ان کے بعد جائے گی وہ آسمان میں سب سےزیادہ چمکتے ہوئے ستارے کی طرح ہوگی ۔ ان میں سے ہر آدمی کی دو دو بیویاں ہوں گی ( ایسے شفاف اور منور جسم والیں کہ ) ان کی پنڈلیوں کا گوداگوشت کے پیچھے سے نظر آئے گا ۔ ( پوری ) جنت میں بیوی سے محروم کوئی شخص بھی نہ ہوگا ۔ \"",
                "urduNarrator": "مجھے عمرو ناقد اور یعقوب بن ابراہیم الدورقی دونوں نے ابن علیہ کی سند سے بیان کیا اور لفظ یعقوب کا ہے, اسماعیل بن علیہ نے کہا ,  ہمیں ایوب نے محمد ( بن سیرین ) سے خبر دی کہ",
                "hadithArabic": "حَدَّثَنِي عَمْرٌو النَّاقِدُ وَيَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ جَمِيعًا عَنْ ابْنِ عُلَيَّةَ وَاللَّفْظُ لِيَعْقُوبَ قَالَا حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ أَخْبَرَنَا أَيُّوبُ عَنْ مُحَمَّدٍ قَالَ إِمَّا تَفَاخَرُوا وَإِمَّا تَذَاكَرُوا الرِّجَالُ فِي الْجَنَّةِ أَكْثَرُ أَمْ النِّسَاءُ فَقَالَ أَبُو هُرَيْرَةَ أَوَ لَمْ يَقُلْ أَبُو الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَوَّلَ زُمْرَةٍ تَدْخُلُ الْجَنَّةَ عَلَى صُورَةِ الْقَمَرِ لَيْلَةَ الْبَدْرِ وَالَّتِي تَلِيهَا عَلَى أَضْوَإِ كَوْكَبٍ دُرِّيٍّ فِي السَّمَاءِ لِكُلِّ امْرِئٍ مِنْهُمْ زَوْجَتَانِ اثْنَتَانِ يُرَى مُخُّ سُوقِهِمَا مِنْ وَرَاءِ اللَّحْمِ وَمَا فِي الْجَنَّةِ أَعْزَبُ.",
                "headingArabic": "أَوَّلُ زُمْرَةٍ تَدْخُلُ الْجَنَّةَ عَلَى صُورَةِ الْقَمَرِ لَيْلَةَ الْبَدْرِ وَصِفَاتُهُمْ وَأَزْوَاجُهُمْ",
                "headingUrdu": "جنت میں داخل ہونے والا پہلا گروہ چاند جیسا نظر آئے گا جب وہ مکمل ہو جائے گا۔ ان کی صفات اور ان کی زوجیت",
                "headingEnglish": "The First Group To Enter Paradise Will Look Like The Moon When It Is Full; Their Attributes And Their Spouses",
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14709,
                "hadithNumber": "7148",
                "englishNarrator": "It was narrated that Ibn sirin said:",
                "hadithEnglish": "\"Men and women disputed as to which of them would from the majority in Paradise. They ask Abu Huraira رضی اللہ عنہ and he said:... '\" a Hadith like that of Ibn 'Ulayyah (no. 7147).",
                "hadithUrdu": "مردوں اور عورتوں میں بحث ہوگئی کہ ان میں سے جنت میں زیادہ کون ہوگا؟پھر انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے اس کے متعلق سوال کیا تو انھوں نے کہا : ابو القاسم صلی اللہ علیہ وسلم نے فرمایا ، ( آگے ) ابن علیہ کی حدیث کے مانند ۔",
                "urduNarrator": "ہم سے ابن ابی عمر نے بیان کیا, سفیان نے ایوب سے اور انھوں نے ( محمد ) ابن سیرین سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ أَيُّوبَ عَنْ ابْنِ سِيرِينَ قَالَ اخْتَصَمَ الرِّجَالُ وَالنِّسَاءُ أَيُّهُمْ فِي الْجَنَّةِ أَكْثَرُ فَسَأَلُوا أَبَا هُرَيْرَةَ فَقَالَ قَالَ أَبُو الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ ابْنِ عُلَيَّةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14710,
                "hadithNumber": "7149",
                "englishNarrator": "This hadith has been narrated on the authority of Abu Huraira رضی اللہ عنہ through another chain of transmitters:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: The (members of the) first group which would get into Paradise will have their faces as bright as stars in the sky. They would neither pass water, nor void excrement, nor will they suffer from catarrh, nor will they spit, and their combs would be made of gold, and their sweat will be musk, the fuel of their brazier will be aloes, and their wives will be large-eyed maidens and their form would be alike as one single person after the form of their father (Adam) sixty cubits tall.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \" پہلا گروہ جو جنت میں داخل ہوگا ۔ \" اسی طرح ہمیں قتیبہ بن سعید اور زہیر بن حرب نے حدیث بیان کی ۔ الفاظ قتیبہ کے ہیں ۔ دونوں نے کہا : ہمیں جریر نے عمارہ سے حدیث بیان کی ، انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : پہلی جماعت جو جنت میں داخل ہوگی وہ چودھویں کے چاند کی شکل میں ہوں گے ۔ جو ان کے ( فوراً ) بعد جائیں گے وہ آسمان میں سب سے زیادہ روشن چمکتے ہوئے ستارے کی شکل میں ہوں گے ، انھیں پیشاب کی حاجت ہوگی نہ پاخانے کی ، نہ تھوکیں گے ، نہ ناک سنکیں گے ، ان کی کنگھیاں سونے کی ہوں گی ، پسینہ کستوری کا ہوگا ، ان کی انگیختوں میں معطر عود ( سلگتا ) ہوگا ، ان کی بیویاں غزال چشم حوریں ہوں گی ، ان سب کے اخلاق وعادات ایک ہی آدمی کے خلق کے مطابق ہوں گے ۔ اپنے والد آدم علیہ السلام کی شکل پر ، ( اقامت میں ) آسمان کی طرف اٹھے ہوئے ساٹھ ہاتھ کے برابر ۔ \"",
                "urduNarrator": "قتیبہ سعید نے ہمیں حدیث بیان کی ، کہا ہمیں عبدالواحد بن زیاد نے عمارہ بن قعقاع سے حدیث بیان کی ، کہا : میں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا ، کہتے تھے کہ",
                "hadithArabic": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا عَبْدُ الْوَاحِدِ يَعْنِي ابْنَ زِيَادٍ عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ حَدَّثَنَا أَبُو زُرْعَةَ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوَّلُ مَنْ يَدْخُلُ الْجَنَّةَ ح و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَزُهَيْرُ بْنُ حَرْبٍ وَاللَّفْظُ لِقُتَيْبَةَ قَالَا حَدَّثَنَا جَرِيرٌ عَنْ عُمَارَةَ عَنْ أَبِي زُرْعَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَوَّلَ زُمْرَةٍ يَدْخُلُونَ الْجَنَّةَ عَلَى صُورَةِ الْقَمَرِ لَيْلَةَ الْبَدْرِ وَالَّذِينَ يَلُونَهُمْ عَلَى أَشَدِّ كَوْكَبٍ دُرِّيٍّ فِي السَّمَاءِ إِضَاءَةً لَا يَبُولُونَ وَلَا يَتَغَوَّطُونَ وَلَا يَمْتَخِطُونَ وَلَا يَتْفُلُونَ أَمْشَاطُهُمْ الذَّهَبُ وَرَشْحُهُمْ الْمِسْكُ وَمَجَامِرُهُمْ الْأَلُوَّةُ وَأَزْوَاجُهُمْ الْحُورُ الْعِينُ أَخْلَاقُهُمْ عَلَى خُلُقِ رَجُلٍ وَاحِدٍ عَلَى صُورَةِ أَبِيهِمْ آدَمَ سِتُّونَ ذِرَاعًا فِي السَّمَاءِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14711,
                "hadithNumber": "7150",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The first group of my Ummah to get into Paradise would be like a full moon in the night. Then those who would be next to them; they would be like the most significantly glittering stars in regard to brightness, then after them (others) in ranks. They would neither void excrement, nor pass water, nor suffer from catarrh, nor would they spit. And their combs would be made of gold, and the fuel of their braziers would be aloes and their sweat would be musk and their form would be the form of one single person according to the length of their father sixty cubits tall. This hadith has been transmitted on the authority of Ibn Abi Shaiba with a slight variation of wording.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" میری امت میں سے پہلا گروہ جو جنت میں داخل ہوگا وہ چودھویں رات کے چاند کی صورت پر ہوگا ، جو ان کے بعد ہوں گے وہ آسمان میں انتہائی چمکدار ستارے کی طرح ہوں گے ، پھر وہ تدریجاً اپنے اپنے مرتبے کے مطابق ہوں گے ، وہ پاخانہ کریں گے نہ پیشاب ، ناک سنکیں گے نہ تھوکیں گے ، ان کی کنگھیاں سونے کی ، انگیٹھیاں معطر عود کی اور پسینہ کستوری کا ہوگا ۔ ان سب کے اخلاق ایک ہی انسان کے ( خوبصورت ) اخلاق پر ( گئے ) ہوں گے ، اپنے والد حضرت آدم علیہ السلام کی قامت پر ساٹھ ہاتھ ( لمبے ) ہوں گے ۔ \"\" ابن ابی شیبہ نے کہا : ایک ہی آدمی کے اخلاق پر ، اور ابو کریب نے کہا : ایک ہی آدمی کی خلقت ( شکل وصورت قدوقامت ) پر ہوں گے ۔ اور ابن ابی شیبہ نے کہا : اپنے والد ( حضرت آدم علیہ السلام ) کی شکل پر ہوں گے ۔",
                "urduNarrator": "ابو بکر بن ابی شیبہ اور ابو کریب نے ہمیں حدیث بیان کی ، دونوں نے کہا : ہمیں ابو معاویہ نے اعمش سے ، انھوں نے ابو صالح سے اورانھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوَّلُ زُمْرَةٍ تَدْخُلُ الْجَنَّةَ مِنْ أُمَّتِي عَلَى صُورَةِ الْقَمَرِ لَيْلَةَ الْبَدْرِ ثُمَّ الَّذِينَ يَلُونَهُمْ عَلَى أَشَدِّ نَجْمٍ فِي السَّمَاءِ إِضَاءَةً ثُمَّ هُمْ بَعْدَ ذَلِكَ مَنَازِلُ لَا يَتَغَوَّطُونَ وَلَا يَبُولُونَ وَلَا يَمْتَخِطُونَ وَلَا يَبْزُقُونَ أَمْشَاطُهُمْ الذَّهَبُ وَمَجَامِرُهُمْ الْأَلُوَّةُ وَرَشْحُهُمْ الْمِسْكُ أَخْلَاقُهُمْ عَلَى خُلُقِ رَجُلٍ وَاحِدٍ عَلَى طُولِ أَبِيهِمْ آدَمَ سِتُّونَ ذِرَاعًا قَالَ ابْنُ أَبِي شَيْبَةَ عَلَى خُلُقِ رَجُلٍ و قَالَ أَبُو كُرَيْبٍ عَلَى خَلْقِ رَجُلٍ و قَالَ ابْنُ أَبِي شَيْبَةَ عَلَى صُورَةِ أَبِيهِمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14712,
                "hadithNumber": "7151",
                "englishNarrator": "Hammam bin Munabbih reported:",
                "hadithEnglish": "These are some of the ahadith which Abu Huraira رضی اللہ عنہ reported from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and one is this that he is reported to have said: The (members of the) first group that would be admitted to Paradise would have their faces as bright as full moon during the night. They would neither spit nor suffer catarrh, nor void excrement. They would have their utensils and their combs made of gold and silver and the fuel of their braziers would be aloes and their sweat would be musk and every one of them would have two spouses (so beautiful) that the marrow of their shanks would be visible through the flesh. There would be no dissension amongst them and no enmity in their hearts. Their hearts would be like one heart, glorifying Allah morning and evening.",
                "hadithUrdu": "یہ احادیث ہیں جو حضرت ابو ہریرہ رضی اللہ عنہ نے ہمیں رسول اللہ صلی اللہ علیہ وسلم سے بیان کیں ، انھوں نے بہت سی احادیث بیان کیں ، ان میں سے ایک یہ ہے ۔ اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" پہلا گروہ جوجنت کے اندر جائے گا ، ان کی صورتیں چودھویں رات کے چاند کی صورت پرہوں گی ۔ وہ اس ( جنت ) میں نہ تھوکیں گے ، نہ ناک سنکیں گے ، نہ پیشاب پاخانہ کریں گے ۔ ان کے برتن اور ان کی کنگھیاں سونے اور چاندی کی ہوں گی ، ان کی انگیٹھیوں میں عود معطر سلگےگا ، ان کا پسینہ کستوری کا ہوگا ۔ ان میں سے ہر ایک دو ، دوبیویاں ہوں گی ، فرط حسن سے ان کی پنڈلیوں کا گوداگوشت سے پیچھے سے دکھائی دے گا ۔ ان کے درمیان نہ کسی قسم کا کوئی اختلاف ہو گا ۔ نہ باہمی بغض ہوگا ۔ ان سب کے دل ایک دل ( کی طرح ) ہوں گے ۔ وہ صبح و شام اپنے اللہ کی تسبیح کرتے ہوں گے ۔ \"",
                "urduNarrator": "ہم سے محمد بن رافع نے بیان کیا، ہم سے عبدالرزاق نے بیان کیا, معمر نے ہمیں ہمام بن منبہ سے حدیث بیان کی ، کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوَّلُ زُمْرَةٍ تَلِجُ الْجَنَّةَ صُوَرُهُمْ عَلَى صُورَةِ الْقَمَرِ لَيْلَةَ الْبَدْرِ لَا يَبْصُقُونَ فِيهَا وَلَا يَمْتَخِطُونَ وَلَا يَتَغَوَّطُونَ فِيهَا آنِيَتُهُمْ وَأَمْشَاطُهُمْ مِنْ الذَّهَبِ وَالْفِضَّةِ وَمَجَامِرُهُمْ مِنْ الْأَلُوَّةِ وَرَشْحُهُمْ الْمِسْكُ وَلِكُلِّ وَاحِدٍ مِنْهُمْ زَوْجَتَانِ يُرَى مُخُّ سَاقِهِمَا مِنْ وَرَاءِ اللَّحْمِ مِنْ الْحُسْنِ لَا اخْتِلَافَ بَيْنَهُمْ وَلَا تَبَاغُضَ قُلُوبُهُمْ قَلْبٌ وَاحِدٌ يُسَبِّحُونَ اللَّهَ بُكْرَةً وَعَشِيًّا.",
                "headingArabic": "فِي صِفَاتِ الْجَنَّةِ وَأَهْلِهَا وَتَسْبِيحِهِمْ فِيهَا بُكْرَةً وَعَشِيًّا ‏‏",
                "headingUrdu": "جنت اور اس کے لوگوں کی صفات اور ان کی ہر صبح و شام اللہ کی تسبیح کرنا",
                "headingEnglish": "The Attributes Of Paradise And Its People, And Their Glorifying Allah Every Morning And Evening",
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14713,
                "hadithNumber": "7152",
                "englishNarrator": "Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "I heard Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) as saying that the inmates of Paradise would eat and drink but would neither spit, nor pass water, nor void excrement, nor suffer catarrah. It was said: Then, what would happen with food? Thereupon he said: They would belch and sweat (and it would be over with their food), and their sweat would be that of musk and they would glorify and praise Allah as easily as you breathe.",
                "hadithUrdu": "میں نے نبی صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا ، \" اہل جنت وہاں کھائیں گے پئیں گے ۔ لیکن نہ اس میں تھوکیں گے نہ پیشاب کریں گے ، نہ رفع حاجت کریں گے اور نہ ناک سنکیں گے ۔ \" انھوں ( صحابہ کرام رضوان اللہ عنھم اجمعین ) نے پوچھا : پھر ان کے کھانے کا کیا بنے گا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" ایک ذکاء ( آئےگی ) اور کستوری کے پسینے کی طرح پسینہ آئے گا ۔ ان کو تسبیح اور حمد ( کے نغمے ) اسی طرح ( فطرت کے اندر ) الہام کردیے جائیں گے ۔ جس طرح سانس کو الہام ( کر کے ان کی فطرت میں شامل ) کردیا جاتاہے ۔ \"",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ اور اسحاق بن ابراہیم نے بیان کیا اور لفظ عثمان کا ہے۔ عثمان نے کہا, اس نے ہم سے بیان کیا، اور اسحاق نے کہا, جریر نے اعمش سے ، انھوں نے ابو سفیان سے اور انھوں نے حضرت جابر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ وَاللَّفْظُ لِعُثْمَانَ قَالَ عُثْمَانُ حَدَّثَنَا و قَالَ إِسْحَقُ أَخْبَرَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ أَهْلَ الْجَنَّةِ يَأْكُلُونَ فِيهَا وَيَشْرَبُونَ وَلَا يَتْفُلُونَ وَلَا يَبُولُونَ وَلَا يَتَغَوَّطُونَ وَلَا يَمْتَخِطُونَ قَالُوا فَمَا بَالُ الطَّعَامِ قَالَ جُشَاءٌ وَرَشْحٌ كَرَشْحِ الْمِسْكِ يُلْهَمُونَ التَّسْبِيحَ وَالتَّحْمِيدَ كَمَا تُلْهَمُونَ النَّفَسَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 14401,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=576",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=574",
                "label": "574",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=575",
                "label": "575",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=576",
                "label": "576",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=577",
                "label": "577",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=578",
                "label": "578",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=579",
                "label": "579",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=580",
                "label": "580",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=578",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=578",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=576",
        "to": 14425,
        "total": 40465
    }
}