{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 298,
        "data": [
            {
                "id": 7714,
                "hadithNumber": "150",
                "englishNarrator": "It is narrated on the authority of Anas that 'Itban bin Malik رضی ‌اللہ ‌عنہ told him:",
                "hadithEnglish": "He became blind. He sent a message to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) that he should come and mark a place of worship for him. Thereupon came the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and his people and then there was a discussion among them about a man who was known as Malik b. Dukhshum, and subsequently the narrator described the hadith of Sulaiman bin Mughira as stated above.",
                "hadithUrdu": "وہ نابینا ہو گئے تھے ، اس وجہ سے انہوں نےرسول اللہ ﷺ کی طرف پیغام بھیجا کہ آپ تشریف لائیں اور میرے لیے مسجد کی اکی جگہ متعین کر دیں ( تاکہ میں اس میں نماز پڑھ سکوں ) تو رسو ل اللہ ﷺ تشریف لائے اور ان ( عتبان ) کی قوم کےلوگ بھی آگئے ، ان میں سے ایک آدمی ، جسے مالک بن دخیشم کہا جاتا تھا ، غائب رہا.... اس کے بعد حماد نے بھی ( ثابت کے دوسرے شاگرد ) سلیمان بن مغیرہ کی طرح روایت بیان کی ۔",
                "urduNarrator": "مجھ سے ابوبکر بن نافع العبدی نے بیان کیا، انہوں نے ہم سے ایک آہ بھری حماد نے کہا , ہمیں ثابت نےحضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے حدیث سنائی ، انہوں نے کہا  مجھے عتبان بن مالک نے بتایا کہ",
                "hadithArabic": "حَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ الْعَبْدِيُّ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ، قَالَ: حَدَّثَنِي عِتْبَانُ بْنُ مَالِكٍ، أَنَّهُ عَمِيَ، فَأَرْسَلَ إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: تَعَالَ فَخُطَّ لِي مَسْجِدًا، فَجَاءَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَجَاءَ قَوْمُهُ وَنُعِتَ رَجُلٌ مِنْهُمْ، يُقَالُ لَهُ: مَالِكُ بْنُ الدُّخْشُمِ، ثُمَّ ذَكَرَ نَحْوَ حَدِيثِ سُلَيْمَانَ بْنِ الْمُغِيرَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7715,
                "hadithNumber": "151",
                "englishNarrator": "It is narrated on the authority of 'Abbas bin 'Abdul-Muttalib رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "He heard the Messenger of Allah saying: He has found the taste of faith (iman) who is content with Allah as his Lord, with Islam as his religion (code of life) and with Muhammad ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as his Prophet.",
                "hadithUrdu": "انہوں نے رسول اللہ ﷺ سے سنا ، آپ فرما رہے تھے : ’’اس شخص نے ایمان کا مزہ چکھ لیا جو اللہ کے رب ، اسلام کو دین اور محمدﷺ کے رسول ہونے پر ( دل سے ) راضی ہو گیا ۔ ‘ ‘",
                "urduNarrator": "ہم سے محمد بن یحییٰ بن ابی عمر المکی اور بشر بن الحکم نے بیان کیا، کہا: عبدالعزیز نے، جو محمد الدراوردی کے بیٹے ہیں، ہم سے یزید بن الہادی کی سند سے، محمد صلی اللہ علیہ وسلم کی سند سے بیان کیا۔ بن ابراہیم، عامر بن سعد کی سند سے، حضرت عباس بن عبدالمطلب ‌رضی ‌اللہ ‌عنہ ‌ ‌ بیان کرتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ أَبِي عُمَرَ الْمَكِّيُّ، وَبِشْرُ بْنُ الْحَكَمِ، قَالَا: حَدَّثَنَا عَبْدُ الْعَزِيزِ وَهُوَ ابْنُ مُحَمَّدٍ الدَّرَاوَرْدِيُّ، عَنْ يَزِيدَ بْنِ الْهَادِ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ عَامِرِ بْنِ سَعْدٍ، عَنِ الْعَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ، أَنَّهُ سَمِعَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: «ذَاقَ طَعْمَ الْإِيمَانِ مَنْ رَضِيَ بِاللهِ رَبًّا، وَبِالْإِسْلَامِ دِينًا، وَبِمُحَمَّدٍ رَسُولًا».",
                "headingArabic": "الدَّلِيلِ عَلَى أَنَّ مَنْ رَضِيَ بِاللَّهِ رَبًّا وَبِالْإِسْلَامِ دِينًا وَبِمُحَمَّدٍ رَسُولًا فَهُوَ مُؤْمِنٌ وَإِنْ ارْتَكَبَ الْمَعَاصِيَ الْكَبَائِرَ",
                "headingUrdu": "اس بات کی دلیل ہے کہ جو شخص اللہ کو اپنا رب، اسلام کو اپنا دین اور محمد صلی اللہ علیہ وسلم کو اپنا نبی مان کر راضی ہو جائے تو وہ مومن ہے، چاہے وہ کبیرہ گناہوں کا ارتکاب کرے۔",
                "headingEnglish": "Evidence that the one who is content with Allah as his Lord, Islam as his religion and Muhammad (saws) as his prophet, then he is a believer, even if he commits major sins",
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7716,
                "hadithNumber": "152",
                "englishNarrator": "It is narrated on the authority of Abu Huraira رضی ‌اللہ ‌عنہ ‌: ‌",
                "hadithEnglish": "The Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Iman has over seventy branches, and modesty is a branch of Iman.",
                "hadithUrdu": "نبی اکرمﷺ نے فرمایا : ’’ ایمان کی ستر سے زیادہ شاخیں ہیں اور حیا بھی ایمان کی ایک شاخ ہے ۔ ‘ ‘",
                "urduNarrator": "ہم سے عبید اللہ بن سعید اور عبد بن حمید نے بیان کیا، کہا کہ ہم سے ابو عامر عقدی نے بیان کیا،سلیمان بن بلال نے عبد اللہ بن دینار سے ، انہوں ابو صالح سے اور انہوں نے حضرت ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللهِ بْنُ سَعِيدٍ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَا: حَدَّثَنَا أَبُو عَامِرٍ الْعَقَدِيُّ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ، عَنْ عَبْدِ اللهِ بْنِ دِينَارٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «الْإِيمَانُ بِضْعٌ وَسَبْعُونَ شُعْبَةً، وَالْحَيَاءُ شُعْبَةٌ مِنَ الْإِيمَانِ.",
                "headingArabic": "بَيَانِ عَدَدِ شُعَبِ الْإِيمَانِ وَأَفْضَلِهَا وَأَدْنَاهَا وَفَضِيلَةِ الْحَيَاءِ وَكَوْنِهِ مِنْ الْإِيمَانِ",
                "headingUrdu": "ایمان کی شاخوں کی تعداد، ان میں سے سب سے بہتر اور کم تر، حیا کی فضیلت (الحیا) اور اس حقیقت کو واضح کرنا کہ یہ ایمان کا حصہ ہے۔",
                "headingEnglish": "Clarifying the number of branches of faith, the best and the least of them, the virtue of modesty (Al-Haya') and the fact that it is part of faith",
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7717,
                "hadithNumber": "153",
                "englishNarrator": "It is narrated on the authority of Abu Huraira ‌رضی ‌اللہ ‌عنہ that the Messenger of Allah (ﷺ) said:",
                "hadithEnglish": "Faith has over seventy branches or over sixty branches, the most excellent of which is the declaration that there is no god but Allah, and the humblest of which is the, removal of what is injurious from the path: and modesty is the branch of faith.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’ایمان کے ستر سے اوپر ( یا ساٹھ سے اوپر ) شعبے ( اجزاء ) ہیں ۔ سب سے افضل جز لااله الا الله کا اقرار ہے اور سب سے چھوٹا کسی اذیت ( دینے والی چیز ) کو راستے سے ہٹانا ہے اور حیابھی ایمان کی شاخوں میں سے ایک ہے ۔ ‘ ‘",
                "urduNarrator": "ہم سے زہیر بن حرب نے بیان کیا، کہا ہم سے جریر نے بیان کیا,سہیل نے عبداللہ بن دینار سے ، انہوں نے ابو صالح سے اور انہوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ سُهَيْلٍ، عَنْ عَبْدِ اللهِ بْنِ دِينَارٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الْإِيمَانُ بِضْعٌ وَسَبْعُونَ - أَوْ بِضْعٌ وَسِتُّونَ - شُعْبَةً، فَأَفْضَلُهَا قَوْلُ لَا إِلَهَ إِلَّا اللهُ، وَأَدْنَاهَا إِمَاطَةُ الْأَذَى عَنِ الطَّرِيقِ، وَالْحَيَاءُ شُعْبَةٌ مِنَ الْإِيمَانِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7718,
                "hadithNumber": "154",
                "englishNarrator": "Salim reported on the authority of his father:",
                "hadithEnglish": "The Prophet (ﷺ) heard a man censuring his brother regarding modesty. Upon this the Prophet remarked: Modesty is part of Iman (faith).",
                "hadithUrdu": "نبی اکرم ﷺ نے ایک آدمی سے سنا جو اپنے بھائی کو حیا کے بارے میں نصیحت کر رہا تھا تو آپ نے فرمایا : ’’ ( حیا سے مت روکو ) حیا ایمان میں سے ہے ۔ ‘ ‘",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، عمرو نقید اور زہیر بن حرب نے بیان کیا,سفیان بن عیینہ نے زہری سے حدیث سنائی ، انہوں نے سالم سے اور انہوں نے اپنے والد حضرت عبداللہ بن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سےروایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالُوا: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، سَمِعَ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ رَجُلًا يَعِظُ أَخَاهُ فِي الْحَيَاءِ، فَقَالَ: «الْحَيَاءُ مِنَ الْإِيمَانِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7719,
                "hadithNumber": "155",
                "englishNarrator": "Zuhri has narrated this hadith with the addition of these words:",
                "hadithEnglish": "He (the Holy Prophet ﷺ) happened to pass by a mass of Ansar who was instructing his brother (about modesty).",
                "hadithUrdu": "آپ ایک انصاری کے پاس سے گزرے جو اپنے بھائی کو نصیحت کر رہا تھا ۔",
                "urduNarrator": "ہم سے عبد بن حمید نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا, معمر نے زہری سے مذکورہ بالاسند کےساتھ خبر دی اور کہا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، بِهَذَا الْإِسْنَادِ، وَقَالَ: مَرَّ بِرَجُلٍ مِنَ الْأَنْصَارِ يَعِظُ أَخَاهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7720,
                "hadithNumber": "156",
                "englishNarrator": "It is narrated on the authority of 'Imran bin Husain ‌رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said: Modesty brings forth nothing but goodness. Bushair bin Ka'b said: It is recorded in the books of wisdom, there lies sobriety in it and calmness of mind in it, Imran said: I am narrating to you the tradition of the Messenger of Allah ( ‌رضی ‌اللہ ‌عنہ) and you talk of your books.",
                "hadithUrdu": "آپ ﷺ نے فرمایا : ’’ حیا سے خیر اور بھلائی ہی حاصل ہوتی ہے ۔ ‘ ‘ اس پر بشیر بن کعب نے کہا : حکمت اور ( دانائی کی کتابوں ) میں لکھا ہوا کہ اس ( حیا ) سے وقا ر ملتا ہے او رسکون حاصل ہوتا ہے ۔ اس پر عمران ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے فرمایا : ’’میں تمہیں رسول ا للہ ﷺ سے حدیث سنا رہا ہوں اور تو مجھے اپنے صحیفوں کی باتیں سنا تا ہے !",
                "urduNarrator": "ہم سے محمد بن المثنیٰ اور محمد بن بشار نے بیان کیا، اور یہ قول ابن المثنیٰ کا ہے، انہوں نے کہا,ہم سے محمد بن جعفر نے بیان کیا، ہم سے شعبہ نے بیان کیا، انہوں نے قتادہ کی سند سے کہا,ابو سوار بیان کرتے ہیں کہ انہوں نے حضرت عمران بن حصین ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو سنا ، وہ نبی ﷺ سے حدیث بیان کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، وَاللَّفْظُ لِابْنِ الْمُثَنَّى، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، قَالَ: سَمِعْتُ أَبَا السَّوَّارِ، يُحَدِّثُ أَنَّهُ سَمِعَ عِمْرَانَ بْنَ حُصَيْنٍ، يُحَدِّثُ عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: «الْحَيَاءُ لَا يَأْتِي إِلَّا بِخَيْرٍ»، فَقَالَ بُشَيْرُ بْنُ كَعْبٍ: إِنَّهُ مَكْتُوبٌ فِي الْحِكْمَةِ: أَنَّ مِنْهُ وَقَارًا، وَمِنْهُ سَكِينَةً، فَقَالَ عِمْرَانُ: أُحَدِّثُكَ عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَتُحَدِّثُنِي عَنْ صُحُفِكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7721,
                "hadithNumber": "157",
                "englishNarrator": "It is narrated on the authority of Qatada. We were sitting with 'Imran b. Husain in a company and Bushair Ibn Ka'b was also amongst us. 'Imran narrated to us that:",
                "hadithEnglish": "On a certain occasion the Messenger of Allah (ﷺ) said: Modesty is a virtue through and through, or said: Modesty is a goodness complete. Upon this Bushair Ibn Ka'b said: Verily we find in certain books or books of (wisdom) that it is God-inspired peace of mind or sobriety for the sake of Allah and there is also a weakness in it. Imran was so much enraged that his eyes became red and he said: I am narrating to you the hadith of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) and you are contradicting it. He (the narrator) said: Imran reported the hadith, He (the narrator) said: Bushair repeated, (the same thing). Imran was enraged. He (the narrator) said: We asserted: Verily Bushair is one amongst us. Abu Nujaid! There is nothing wrong, with him (Bushair).",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’ حیا بھلائی ہے پوری کی پوری ۔ ‘ ‘ ( انہوں نے کہا : یہ الفاظ فرمائے ) : ’’حیا پوری کی پوری بھلائی ہے ۔ ‘ ‘ تو بشیر بن کعب نے کہا : ہمیں کتابون یا حکمت ( کے مجموعوں ) میں یہ بات ملتی ہے کہ حیا سے اطمینان اور اللہ کے لیے وقار ( کا اظہار ) ہوتا ہے اور اس کی ایک قسم ضعیفی ( کمزور ) ہے ۔ حضرت عمران ‌رضی ‌اللہ ‌عنہ ‌ ‌ سخت غصے میں آ گئے حتی کہ ان کی آنکھیں سرخ ہو گئیں اور فرمانے لگے : کیا میں دیکھ نہیں رہا کہ میں تمہیں رسول اللہ ﷺ سے حدیث سنا رہا ہوں اور تم اس میں مقابلہ کر رہے ہو ؟ ابوقتادہ نے کہا : عمران نےدوبارہ حدیث سنائی اور بشیر نے پھر وہی کہا : اس پر عمران ( سخت ) غصے میں آ گئے ۔ ( ابو قتادہ نے ) کہا : تو ہم نے بار بار یہ کہنا شروع کر دیا : اے ابو نجید! ( حضرت عمران کی کنیت ) یہ ہم میں سے ( مسلمان اور حدیث کا طالب علم ) ہے ۔ اس ( کے عقیدے ) میں کوئی عیب یا نقص نہیں ہے ۔",
                "urduNarrator": "ہم سے یحییٰ بن حبیب الحارثی نے بیان کیا,حماد بن زید نے اسحاق بن سوید سے روایت کی کہ ابو قتادہ ( تمیم بن نذیر ) نے حدیث بیان کی ، کہا کہ ہم انپے ساتھیوں سمیت حضرت عمران بن حصین ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے پاس حاضر تھے ، ہم میں بشیر بن کعب بھی موجود تھے ، اس روز حضرت عمران ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ہمیں ایک حدیث سنائی ، کہاکہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ إِسْحَاقَ وَهُوَ ابْنُ سُوَيْدٍ، أَنَّ أَبَا قَتَادَةَ حَدَّثَ، قَالَ: كُنَّا عِنْدَ عِمْرَانَ بْنِ حُصَيْنٍ فِي رَهْطٍ، وَفِينَا بُشَيْرُ بْنُ كَعْبٍ، فَحَدَّثَنَا عِمْرَانُ، يَوْمَئِذٍ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الْحَيَاءُ خَيْرٌ كُلُّهُ» قَالَ: أَوْ قَالَ: «الْحَيَاءُ كُلُّهُ خَيْرٌ» فَقَالَ بُشَيْرُ بْنُ كَعْبٍ: إِنَّا لَنَجِدُ فِي بَعْضِ الْكُتُبِ - أَوِ الْحِكْمَةِ - أَنَّ مِنْهُ سَكِينَةً وَوَقَارًا لِلَّهِ، وَمِنْهُ ضَعْفٌ، قَالَ: فَغَضِبَ عِمْرَانُ حَتَّى احْمَرَّتَا عَيْنَاهُ، وَقَالَ: أَلَا أَرَى أُحَدِّثُكَ عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَتُعَارِضُ فِيهِ، قَالَ: فَأَعَادَ عِمْرَانُ الْحَدِيثَ، قَالَ: فَأَعَادَ بُشَيْرٌ، فَغَضِبَ عِمْرَانُ، قَالَ: فَمَا زِلْنَا نَقُولُ فِيهِ إِنَّهُ مِنَّا يَا أَبَا نُجَيْدٍ، إِنَّهُ لَا بَأْسَ بِهِ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7722,
                "hadithNumber": "158",
                "englishNarrator": null,
                "hadithEnglish": "Ishaq bin Ibrahim narrates this hadith of the Prophet on the authority of Imran b. Husain رضی ‌اللہ ‌عنہ ‌, like the one narrated by Hammad bin Zaid.",
                "hadithUrdu": "نضر ( بن شمیل ) نے کہا : ہمیں ابو نعامہ عدوی نے حدیث بیان کی ، انہوں نے کہا : میں نےحجیر بن ریبع عدوی سےسنا ، وہ کہتے تھے : عمران بن حصین ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے رسول اللہ ﷺ سے روایت کی ۔ ( جس طرح ) حماد بن زید کی حدیث ہے ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا النَّضْرُ، حَدَّثَنَا أَبُو نَعَامَةَ الْعَدَوِيُّ، قَالَ: سَمِعْتُ حُجَيْرَ بْنَ الرَّبِيعِ الْعَدَوِيَّ، يَقُولُ عَنْ عِمْرَانَ بْنَ حُصَيْنٍ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَحْوَ حَدِيثِ حَمَّادِ بْنِ زَيْدٍ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7723,
                "hadithNumber": "159",
                "englishNarrator": "It is narrated on the authority of Sufyan bin 'Abdulla al-Thaqafi ‌رضی ‌اللہ ‌عنہ that he said:",
                "hadithEnglish": "I asked the Messenger of Allah ﷺ to tell me about Islam a thing which might dispense with the necessity of my asking anybody after you. In the hadith of Abu Usama the (words) are: other than you. He (the Holy Prophet  ﷺ) remarked: Say I affirm my faith in Allah and then remain steadfast to it.",
                "hadithUrdu": "میں نے رسو ل اللہ ﷺ سے عرض کی : اے اللہ کے رسول ! مجھے اسلام کے بارے میں ایسی پکی بات بتائیے کہ آپ کے بعد کسی سے اس کے بارے میں سوال کرنے کی ضرورت نہ رہے ( ابو اسامہ کی روایت میں ’’ آپ کےبعد ‘ ‘ کے بجائے ’’ آپ کے سوا ‘ ‘ کے الفاظ ہیں ) آپ نے ارشاد فرمایا : ’’ کہو : آمنت باللہ ( میں اللہ پر ایمان لایا ) ، پھر اس پر پکے ہو جاؤ ۔ ‘ ‘",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا,عبد اللہ بن نمیر ، جریر اور ابواسامہ نے ہشام بن عروہ سے حدیث سنائی ، انہوں نے اپنے والد ( عروہ ) سے اور انہوں نے حضرت سفیان بن عبد اللہ ثقفی ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالَا: حَدَّثَنَا ابْنُ نُمَيْرٍ، ح وحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، جَمِيعًا عَنْ جَرِيرٍ، ح وحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، كُلُّهُمْ عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ سُفْيَانَ بْنِ عَبْدِ اللهِ الثَّقَفِيِّ، قَالَ: قُلْتُ: يَا رَسُولَ اللهِ، قُلْ لِي فِي الْإِسْلَامِ قَوْلًا لَا أَسْأَلُ عَنْهُ أَحَدًا بَعْدَكَ - وَفِي حَدِيثِ أَبِي أُسَامَةَ غَيْرَكَ - قَالَ: قُلْ: آمَنْتُ بِاللهِ، فَاسْتَقِمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7724,
                "hadithNumber": "160",
                "englishNarrator": "It is narrated on the authority of 'Abdullah bin 'Amr رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "A man asked the Messenger of Allah (ﷺ ) which of the merits (is superior) in Islam. He (the Holy Prophet ﷺ) remarked: That you provide food and extend greetings to one whom you know or do not know.",
                "hadithUrdu": "ایک آدمی نے رسول اللہ ﷺ سے پوچھا : کون سا اسلام بہتر ہے ؟ آپ نے جواب دیا : ’’ تم لوگوں کو کھانا کھلاؤ اور ہر کسی کو ، خواہ تم اسے جانتے ہو یا نہیں جانتے ، سلام کہو ۔ ‘ ‘",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا,لیث نے یزید بن ابی حبیب سے ، انہوں نے ابو خیر سے اور انہوں حضرت عبد اللہ بن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ، أَخْبَرَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ عَبْدِ اللهِ بْنِ عَمْرٍو، أَنَّ رَجُلًا سَأَلَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، أَيُّ الْإِسْلَامِ خَيْرٌ؟ قَالَ: «تُطْعِمُ الطَّعَامَ، وَتَقْرَأُ السَّلَامَ عَلَى مَنْ عَرَفْتَ، وَمَنْ لَمْ تَعْرِفْ».",
                "headingArabic": "بَيَانِ تَفَاضُلِ الإِسْلاَمِ وَأَىِّ أُمُورِهِ أَفْضَلُ ‏‏",
                "headingUrdu": "اسلام کی برتری کو واضح کرنا، اور اس کا کون سا حصہ بہترین ہے۔",
                "headingEnglish": "Clarifying the superiority of Islam, and what part of it is best",
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7725,
                "hadithNumber": "161",
                "englishNarrator": "Abdullah bin Amr bin al-As ‌رضی ‌اللہ ‌عنہ is reported to have said:",
                "hadithEnglish": "Verily a person asked the Messenger of Allah (ﷺ) who amongst the Muslims was better. Upon this (the Holy Prophet ﷺ) remarked: From whose hand and tongue the Muslims are safe.",
                "hadithUrdu": "ایک آدمی نے رسول اللہﷺ سے پوچھا : مسلمانوں میں سے بہتر کون ہے ؟ آپ نے فرمایا : ’’ جس کی زبان اور ہاتھ سے دیگر مسلمان امن میں ہوں.",
                "urduNarrator": "ہم سے ابو الطاہر احمد بن عمرو بن عبداللہ بن عمرو بن سرح المصری نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا,عمرو بن حارث نے یزید بن ابی حبیب سے ، انہوں نے ابوخیر سے روایت کی اور انہوں نے حضرت عبداللہ بن عمرو بن عاص ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنا ، وہ فرما رہے تھے",
                "hadithArabic": "وَحَدَّثَنَا أَبُو الطَّاهِرِ أَحْمَدُ بْنُ عَمْرِو بْنِ عَبْدِ اللهِ بْنِ عَمْرِو بْنِ سَرْحٍ الْمِصْرِيُّ، أَخْبَرَنَا ابْنُ وَهْبٍ، عَنْ عَمْرِو بْنِ الْحَارِثِ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، ِ أَنَّهُ سَمِعَ عَبْدَ اللهِ بْنَ عَمْرِو بْنِ الْعَاصِ، يَقُولُ: إِنَّ رَجُلًا سَأَلَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَيُّ الْمُسْلِمِينَ خَيْرٌ؟ قَالَ: «مَنْ سَلِمَ الْمُسْلِمُونَ مِنْ لِسَانِهِ وَيَدِهِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7726,
                "hadithNumber": "162",
                "englishNarrator": "It is narrated on the authority of Jabir رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "He heard the (Holy Prophet ﷺ) say: A Muslim is he from whose hand and tongue the Muslims are safe.",
                "hadithUrdu": "میں نے رسول اللہ ﷺ کو یہ کہتے ہوئے سنا : ’’ مسلمان وہ ہے جس کی زبان اور ہاتھ سے دوسرے مسلمان محفوظ رہیں.",
                "urduNarrator": "ہم سب کو حسن حلوانی اور عبد بن حمید نے ابو عاصم کی سند سے بیان کیا، انہوں نے کہا, ہم کو عبد، ابو عاصم نے ابن جریج سے خبر دی کہ انہوں نے ابو الزبیر کو کہتے سنا,حضرت جابر ‌رضی ‌اللہ ‌عنہ ‌ ‌ بیان کرتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا حَسَنٌ الْحُلْوَانِيُّ، وَعَبْدُ بْنُ حُمَيْدٍ جَمِيعًا عَنْ أَبِي عَاصِمٍ، قَالَ: عَبْدٌ، أَنْبَأَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، أَنَّهُ سَمِعَ أَبَا الزُّبَيْرِ، يَقُولُ: سَمِعْتُ جَابِرًا، يَقُولُ: سَمِعْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «الْمُسْلِمُ مَنْ سَلِمَ الْمُسْلِمُونَ مِنْ لِسَانِهِ وَيَدِهِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7727,
                "hadithNumber": "163",
                "englishNarrator": "It is narrated on the authority of Abu Musa Ash'ari ‌رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "I asked the Messenger of Allah which (attribute) of Islam is more excellent. Upon this he remarked: One in which the Muslims are safe, protected from the tongue and hand of (other Muslims).",
                "hadithUrdu": "میں نے رسو ل اللہ ﷺ سے عرض کی : کون سا اسلام افضل ہے ؟ آپ نے فرمایا : ’’ ( اس کا اسلام ) جس کی زبان سے اور ہاتھ سے مسلمان محفوظ رہیں",
                "urduNarrator": "یحییٰ بن سعید اموی نے کہا : ہمیں ابو بردہ ( برید ) بن عبداللہ بن ابی بردہ بن ابی موسیٰ اشعری نے ابو بردہ سے اور انہوں نے حضرت ابو موسیٰ اشعری ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے کہا کہ",
                "hadithArabic": "وَحَدَّثَنِي سَعِيدُ بْنُ يَحْيَى بْنِ سَعِيدٍ الْأُمَوِيُّ، قَالَ: حَدَّثَنِي أَبِي، حَدَّثَنَا أَبُو بُرْدَةَ بْنُ عَبْدِ اللهِ بْنِ أَبِي بُرْدَةَ بْنِ أَبِي مُوسَى، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ: قُلْتُ: يَا رَسُولَ اللهِ أَيُّ الْإِسْلَامِ أَفْضَلُ؟ قَالَ: «مَنْ سَلِمَ الْمُسْلِمُونَ مِنْ لِسَانِهِ وَيَدِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7728,
                "hadithNumber": "164",
                "englishNarrator": "Ibrahim bin Sa'id al-Jauhari has narrated this hadith with the same words in addition to these:",
                "hadithEnglish": "The Messenger of Allah (ﷺ) was asked as to who amongst the Muslims is better, and the rest of the hadith was narrated like this.",
                "hadithUrdu": "جس میں رسول اللہ ﷺ سے پوچھا گیا کہ کونسا مسلمان افضل ہے؟تو آپﷺ نے اس طرح ذکر فرمایا-",
                "urduNarrator": "ابراہیم بن سعید جوہری ‘ ابو اسامہ ‘ برید بن عبد اللہ اس روایت میں دوسری سند کے ساتھ یہ الفاظ ہیں",
                "hadithArabic": "وَحَدَّثَنِيهِ إِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ، حَدَّثَنَا أَبُو أُسَامَةَ، قَالَ: حَدَّثَنِي بُرَيْدُ بْنُ عَبْدِ اللهِ، بِهَذَا الْإِسْنَادِ قَالَ: سُئِلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَيُّ الْمُسْلِمِينَ أَفْضَلُ؟ فَذَكَرَ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7729,
                "hadithNumber": "165",
                "englishNarrator": "It is reported on the authority of Anas ‌رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "The Prophet of Allah (ﷺ) said: There are three qualities for which anyone who is characterised by them will relish the sweetness of faith: he to whom Allah and His Messenger are dearer than all else; he who loves a man for Allah's sake alone; and he who has as great an abhorrence of returning to unbelief after Allah has rescued him from it as he has of being cast into Hell.",
                "hadithUrdu": "آپ نے فرمایا : ’’ جس شخص میں تین باتیں پائیں جائیں گی وہ ان کے ذریعے سے ایمان کی حلاوت پا لے گا : جسے اللہ اور اس کا رسول باقی ہر کسی سے بڑھ کر محبوب ہوں ، ( دوسری ) یہ کہ جس کسی سے بھی محبت کرے ، اللہ ہی کے لیے کرے اور ( تیسری ) یہ کہ اللہ نے جب اسے کفر سے بچا لیا ہے تو وہ دوبارہ کفر کی طرف پلٹنے سے وہ اس طرح نفرت کرے جیسی اس بات سے نفرت کرتا ہے کہ اسے آگ میں ڈال دیا جائے ۔ ‘ ‘",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم، محمد بن یحییٰ بن ابی عمر اور محمد بن بشار نے ثقفی کی سند سے بیان کیا، ہم سے ابن ابی عمر نے ایوب کی سند سے بیان کیا,ابو قلابہ نےحضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، وہ نبیﷺ سے روایت کرتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ يَحْيَى بْنِ أَبِي عُمَرَ، وَمُحَمَّدُ بْنُ بَشَّارٍ، جَمِيعًا عَنْ الثَّقَفِيِّ، قَالَ ابْنُ أَبِي عُمَرَ: حَدَّثَنَا عَبْدُ الْوَهَّابِ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلَابَةَ، عَنْ أَنَسٍ عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: ثَلَاثٌ مَنْ كُنَّ فِيهِ وَجَدَ بِهِنَّ حَلَاوَةَ الْإِيمَانِ: مَنْ كَانَ اللهُ وَرَسُولُهُ أَحَبَّ إِلَيْهِ مِمَّا سِوَاهُمَا، وَأَنْ يُحِبَّ الْمَرْءَ لَا يُحِبُّهُ إِلَّا لِلَّهِ، وَأَنْ يَكْرَهَ أَنْ يَعُودَ فِي الْكُفْرِ بَعْدَ أَنْ أَنْقَذَهُ اللهُ مِنْهُ، كَمَا يَكْرَهُ أَنْ يُقْذَفَ فِي النَّارِ.",
                "headingArabic": "بَيَانِ خِصَالٍ مَنِ اتَّصَفَ بِهِنَّ وَجَدَ حَلاَوَةَ الإِيمَانِ",
                "headingUrdu": "ان خصلتوں کی وضاحت جو اگر انسان کو حاصل ہو جائے تو اسے ایمان کی مٹھاس ملے گی۔",
                "headingEnglish": "Clarification of those characteristics which, if a person attains them, he will find the sweetness of faith",
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7730,
                "hadithNumber": "166",
                "englishNarrator": "It is reported on the authority of Anas ‌رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: There are three qualities for which any one who is characterised by them will relish the savour of faith: that he loves man and he does not love him but for Allah's sake alone; he is to whom Allah and His Messenger are dearer than all else; he who prefers to be thrown into fire than to return to unbelief after Allah has rescued him out of it.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’ تین باتیں جس میں بھی ہوں گی و ہ ایمان کا ذائقہ پا لے گا ( 1 ) جوشخص کسی انسان سے محبت کرتا ہے او راللہ کے سوا کسی اور کی خاطر اس سے محبت نہیں کرتا ۔ ( 2 ) جس کے لیے اللہ اور اس کے رسول ﷺ باقی ہر کسی سے زیادہ پیارے ہیں ( 3 ) اور جب اللہ نے اسے کفر سے بچا لیا ہے تو آ گ میں ڈالا جانا ، اسے کفر میں دوبارہ لوٹنے سے زیادہ پسند ہے ۔ ‘ ‘",
                "urduNarrator": "ہم سے محمد بن المثنیٰ اور ابن بشار نے بیان کیا، کہا: ہم سے محمد بن جعفر نے بیان کیا، ہم سے شعبہ نے بیان کیا، انہوں نے کہا,قتادہ حضرت انس ‌رضی ‌اللہ ‌عنہ سے حدیث بیان کرتے ہیں ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ: سَمِعْتُ قَتَادَةَ، يُحَدِّثُ عَنْ أَنَسٍ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: ثَلَاثٌ مَنْ كُنَّ فِيهِ وَجَدَ طَعْمَ الْإِيمَانِ: مَنْ كَانَ يُحِبُّ الْمَرْءَ لَا يُحِبُّهُ إِلَّا لِلَّهِ، وَمَنْ كَانَ اللهُ وَرَسُولُهُ أَحَبَّ إِلَيْهِ مِمَّا سِوَاهُمَا، وَمَنْ كَانَ أَنْ يُلْقَى فِي النَّارِ أَحَبَّ إِلَيْهِ مِنْ أَنْ يَرْجِعَ فِي الْكُفْرِ بَعْدَ أَنْ أَنْقَذَهُ اللهُ مِنْهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7731,
                "hadithNumber": "167",
                "englishNarrator": "It was narrated that Anas ‌رضی ‌اللہ ‌عنہ ‌said:",
                "hadithEnglish": "\"The messenger of Allah said...\" a similar Hadith (as no. 166), except that he said: \".... then he returning to judaism or christianity.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا...... ( پھر اسی طرح بیان کیا ) جیسے سابقہ راویوں نے بیان کیا ہے ، البتہ انہوں نے یہ ( الفاظ ) کہے : ’’اس کو پھر سے یہودی یا عیسائی ہو جانے سے ( آگ میں ڈالا جانا زیادہ پسند ہو ۔ ) ‘ ‘",
                "urduNarrator": "ہم سے اسحاق بن منصور نے بیان کیا، کہا ہم سے نضر بن شمائل نے بیان کیا، کہا ہم سے حماد نے بیان کیا,ثابت نے حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، أَنْبَأَنَا النَّضْرُ بْنُ شُمَيْلٍ، أَنْبَأَنَا حَمَّادٌ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِ حَدِيثِهِمْ غَيْرَ أَنَّهُ قَالَ: «مِنْ أَنْ يَرْجِعَ يَهُودِيًّا أَوْ نَصْرَانِيًّا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7732,
                "hadithNumber": "168",
                "englishNarrator": "It is reported on the authority of Anas ‌رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) said: No bondsman believes, and, in the hadith narrated by Abdul Warith, no person believes, till I am dearer to him than the members of his household, his wealth and the whole of mankind.",
                "hadithUrdu": "رسول اللہﷺ نے فرمایا : ’’ کوئی بندہ ( اور عبد الوارث کی حدیث میں ہے کوئی آدمی ) اس وقت تک مومن نہیں ہو سکتا جب تک میں اسے اس کے اہل و عیال ، مال اورسب لوگوں سے زیادہ محبوب نہ ہوں ۔ ‘ ‘",
                "urduNarrator": "مجھ سے زہیر بن حرب نے کہا,اسماعیل بن علیہ اور عبد الوارث دونوں نے عبد العزیز سے اور انہوں نے حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، وَحَدَّثَنَا شَيْبَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الْوَارِثِ، كِلَاهُمَا عَنْ عَبْدِ الْعَزِيزِ، عَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: لَا يُؤْمِنُ عَبْدٌ - وَفِي حَدِيثِ عَبْدِ الْوَارِثِ: الرَّجُلُ - حَتَّى أَكُونَ أَحَبَّ إِلَيْهِ مِنْ أَهْلِهِ وَمَالِهِ وَالنَّاسِ أَجْمَعِينَ.",
                "headingArabic": "وُجُوبِ مَحَبَّةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَكْثَرَ مِنَ الأَهْلِ وَالْوَلَدِ وَالْوَالِدِ وَالنَّاسِ أَجْمَعِينَ وَإِطْلاَقِ عَدَمِ الإِيمَانِ عَلَى مَنْ لَمْ يُحِبَّهُ هَذِهِ الْمَحَبَّةَ",
                "headingUrdu": "اللہ کے رسول صلی اللہ علیہ وسلم سے اپنے اہل و عیال، بیٹے، باپ اور تمام لوگوں سے زیادہ محبت کرنا واجب ہے۔ اور جو شخص اس سے اتنی محبت نہیں کرتا اس کے بارے میں ایمان کی مکمل عدم موجودگی کا ذکر ہے۔",
                "headingEnglish": "The obligation to love the messenger of Allah (saws) more than one's family, son, father, and all other people; And mentions of an absolute absence of faith regarding one who does not love him with such love",
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7733,
                "hadithNumber": "169",
                "englishNarrator": null,
                "hadithEnglish": "It is reported on the authority of Anas b. Malik that the Messenger of Allah said: None of you is a believer till I am dearer to him than his child, his father and the whole of mankind.",
                "hadithUrdu": "قتادہ نے حضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے کہا کہ رسول اللہ ﷺ نے فرمایا : ’’ تم میں سے کوئی شخص ( اس وقت تک ) مومن نہیں ہو سکتا جب تک میں اس کے لیے اس کی اولاد ، اس کے والد اور تمام انسانوں سے بڑھ کر محبوب نہ ہوں ۔ ‘ ‘",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ: سَمِعْتُ قَتَادَةَ، يُحَدِّثُ عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى أَكُونَ أَحَبَّ إِلَيْهِ مِنْ وَلَدِهِ وَوَالِدِهِ وَالنَّاسِ أَجْمَعِينَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7734,
                "hadithNumber": "170",
                "englishNarrator": "It is narrated on the authority of Anas bin Malik ‌رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) observed: None amongst you believes (truly) until he loves for his brother - or he said for his neighbour - that which he loves for himself.",
                "hadithUrdu": "آپﷺ نے فرمایا : ’’ تم میں سے کوئی شخص مومن نہیں ہو سکتا یہاں تک کہ وہ اپنے بھائی کے لیے ( یا فرمایا : اپنے پڑوسی کے لیے بھی ) وہی پسند کرے جو وہ اپنے لیے پسند کرتا ہے ۔ ‘ ‘",
                "urduNarrator": "ہم سے محمد بن المثنیٰ اور ابن بشار نے بیان کیا، کہا: ہم سے محمد بن جعفر نے بیان کیا،شعبہ نے کہا : میں نے قتادہ کو حضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے حدیث بیان کرتے ہوئے سنا ، انہوں نے نبی کریم ﷺ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ: سَمِعْتُ قَتَادَةَ، يُحَدِّثُ عَنْ أَنَسِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لِأَخِيهِ - أَوْ قَالَ: لِجَارِهِ - مَا يُحِبُّ لِنَفْسِهِ.",
                "headingArabic": "الدَّلِيلِ عَلَى أَنَّ مِنْ خِصَالِ الإِيمَانِ أَنْ يُحِبَّ لأَخِيهِ الْمُسْلِمِ مَا يُحِبُّ لِنَفْسِه مِنَ الْخَيْرِ",
                "headingUrdu": "اس بات کی دلیل ہے کہ ایمان کی صفات میں سے ایک اپنے بھائی مسلمان سے محبت کرنا ہے جو کہ انسان اپنے لیے نیکی سے محبت کرتا ہے۔",
                "headingEnglish": "The evidence that one of the attributes of faith is to love for one's brother muslim that one loves for oneself of goodness",
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7735,
                "hadithNumber": "171",
                "englishNarrator": "It is narrated on the authority of Anas ‌رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "The Prophet (may peace blessings be upon him) observed: By Him in whose Hand is my life, no, bondsman (truly) believes till he likes for his neighbour, or he (the Holy Prophet) said: for his brother, whatever he likes for himself.",
                "hadithUrdu": "آپ نے فرمایا : ’’ اس ذات کی قسم جس کے ہاتھ میں میری جان ہے ! کوئی بندہ اس وقت تک مومن نہیں ہو سکتا جب تک اپنے پڑوسی کے لیے ( یا فرمایا : اپنے بھائی کے لیے ) وہی پسند نہ کرے جو وہ اپنے لیے پسند کرتا ہے ۔ ‘ ‘",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، کہا ہم سے یحییٰ بن سعید نے بیان کیا,حسن معلم نے قتادہ سے اور انہوں ن حضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے ، انہوں نے نبی کریم ﷺ سے روایت کی ،",
                "hadithArabic": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ حُسَيْنٍ الْمُعَلِّمِ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: وَالَّذِي نَفْسِي بِيَدِهِ، لَا يُؤْمِنُ عَبْدٌ حَتَّى يُحِبَّ لِجَارِهِ - أَوْ قَالَ: لِأَخِيهِ - مَا يُحِبُّ لِنَفْسِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7736,
                "hadithNumber": "172",
                "englishNarrator": "It is narrated on the authority of Abu Huraira رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "The Messenger of Allah (ﷺ) observed: He will not enter Paradise whose neighbour is not secure from his wrongful conduct.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’ جس کی ایذا رسانی سے اس کے پڑوسی محفوظ نہ ہوں ، وہ جنت میں نہیں جائے گا ۔ ‘ ‘",
                "urduNarrator": "ہم سے یحییٰ بن ایوب، قتیبہ بن سعید اور علی بن حجر نے اسماعیل بن جعفر کی سند سے بیان کیا، کہا: ہم سے اسماعیل نے بیان کیا، انہوں نے کہا: مجھ سے علاء نے اپنے والد سے بیان کیا,حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَعَلِيُّ بْنُ حُجْرٍ، جَمِيعًا عَنْ إِسْمَاعِيلَ بْنِ جَعْفَرٍ، قَالَ ابْنُ أَيُّوبَ: حَدَّثَنَا إِسْمَاعِيلُ، قَالَ: أَخْبَرَنِي الْعَلَاءُ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صلَّى الله عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَدْخُلُ الْجَنَّةَ مَنْ لَا يَأْمَنُ جَارُهُ بَوَائِقَهُ».",
                "headingArabic": "بَيَانِ تَحْرِيمِ إِيذَاءِ الْجَارِ ‏‏",
                "headingUrdu": "پڑوسی کو تنگ کرنے کی ممانعت کو واضح کرنا",
                "headingEnglish": "Clarifying the prohibition of annoying one's neighbor",
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7737,
                "hadithNumber": "173",
                "englishNarrator": "It is reported on the authority of Abu Huraira رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) observed: He who believes in Allah and the Last Day should either utter good words or better keep silence; and he who believes in Allah and the Last Day should treat his neighbour with kindness and he who believes in Allah and the Last Day should show hospitality to his guest.",
                "hadithUrdu": "آپ نے فرمایا : ’’ جو کوئی اللہ اور آخرت کے دن پر ایمان رکھتا ہے ، وہ خیر کی بات کہے یا خاموش رہے ۔ اور جو شخص اللہ اور آخرت کے دن پر ایمان پر ایمان رکھتا ہے ، وہ اپنے پڑوسی کا احترام کرے ۔ اور جو آدمی اللہ اور آخرت کے دن پر ایمان رکھتا ہے ، وہ اپنے مہمان کی عزت کرے ۔ ‘ ‘",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، انہوں نے کہا: مجھ سے یونس نے ابن شہاب کی سند سے بیان کیا,ابو سلمہ بن عبد الرحمٰن نے ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے ، انہوں نے رسول اللہ ﷺ سے حدیث روایت کی",
                "hadithArabic": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَنْبَأَنَا ابْنُ وَهْبٍ، قَالَ: أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ كانَ يُؤْمِنُ بِاللهِ وَالْيَوْمِ الْآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيصْمُتْ، وَمَنْ كَانَ يُؤْمِنُ بِاللهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ جَارَهُ، وَمَنْ كَانَ يُؤْمِنُ بِاللهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ ضَيْفَهُ».",
                "headingArabic": "الْحَثِّ عَلَى إِكْرَامِ الْجَارِ وَالضَّيْفِ وَلُزُومِ الصَّمْتِ إِلاَّ مِنَ الْخَيْرِ وَكَوْنِ ذَلِكَ كُلِّهِ مِنَ الإِيمَانِ",
                "headingUrdu": "اپنے پڑوسی اور مہمان کی تعظیم کی ترغیب، اور خاموش رہنے کی ذمہ داری جب تک کہ کوئی اچھی بات نہ کہے، اور حقیقت یہ ہے کہ یہ سب کچھ ایمان کا حصہ ہے۔",
                "headingEnglish": "Encouragement to honor one's neighbor and guest, and the obligation to remain silent unless one has something good to say, and the fact that all of that is part of faith",
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7738,
                "hadithNumber": "174",
                "englishNarrator": "It is reported on the authority of Abu Huraira ‌رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "The Messenger of Allah (ﷺ) observed: He who believes in Allah and the Last Day does not harm is neighbour, and he who believes in Allah and the Last Day shows hospitality to his guest and he who believes in Allah and the Last Day speaks good or remains silent.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’ جو شخص اللہ اور قیامت پر ایمان رکھتا ہے ، وہ اپنے پڑوسی کو ایذا نہ پہنچائے ، اور جوشخص اللہ اور قیامت پر ایمان رکھتا ہے ، وہ اپنے مہمان کی تکریم کرے ، او رجوشخص اللہ اور قیامت پر یقین رکھتا ہے ، وہ اچھی بات کرے یا خاموش رہے ۔ ‘ ‘",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے ابو الاحواس نے بیان کیا,ابوحصین نے ابوصالح سے اور انہو ں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو الْأَحْوَصِ، عَنْ أَبِي حُصَيْنٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ كَانَ يُؤْمِنُ بِاللهِ وَالْيَوْمِ الْآخِرِ فَلَا يُؤْذِي جَارَهُ، وَمَنْ كَانَ يُؤْمِنُ بِاللهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ ضَيْفَهُ، وَمَنْ كَانَ يُؤْمِنُ بِاللهِ وَالْيَوْمِ الْآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيسْكُتْ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 7426,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=297",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=295",
                "label": "295",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=296",
                "label": "296",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=297",
                "label": "297",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=298",
                "label": "298",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=299",
                "label": "299",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=300",
                "label": "300",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=301",
                "label": "301",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=299",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=299",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=297",
        "to": 7450,
        "total": 40465
    }
}