{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 404,
        "data": [
            {
                "id": 10364,
                "hadithNumber": "2800",
                "englishNarrator": "Safwan bin Ya'la bin Umayya رضی اللہ  عنہ reported:",
                "hadithEnglish": "Ya'la رضی اللہ  عنہ used to say to 'Umar bin Khattab (رضی اللہ  عنہ): Would that I see revelation descending upon the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ). (Once) when the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) was in Ji'rana and there was a cloth which provided shade over him, and there were his Companions with him. 'Umar being one of them, there came a person with a cloak of wool on him daubed with perfume and he said: Messenger of Allah, what about the person who entered upon the state of Ihram with a cloak after daubing it with perfume? The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) looked at him for a short while, and then became quiet, and revelation began descending upon him, and 'Umar رضی اللہ عنہ gestured (with his hand) to Ya'la bin Umayya to come. Ya'la came and he entered his head (beneath the cloth and saw) the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) with his face red, and breathing heavily. Then he felt relieved (of that burden) and he said: Where is the man who was just asking me about Umra? The man was searched for and he was brought, and the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: So far as the perfume is concerned, wash it three times, and remove the cloak too (as it was sewn) and do in 'Umra as you do in Hajj.",
                "hadithUrdu": "یعلیٰ رضی اللہ  عنہ عمر بن خطاب رضی اللہ تعالیٰ عنہ سے کہاکرتے تھے : کاش!میں نبی کریم صلی اللہ علیہ وسلم کو اس وقت دیکھوں جب آپ صلی اللہ علیہ وسلم پروحی نازل ہورہی ہو ۔ ( ایک مرتبہ ) جب نبی کریم صلی اللہ علیہ وسلم جعرانہ میں تھے ۔ اور آپ صلی اللہ علیہ وسلم پر ایک کپڑے سےسایہ کیاگیا تھا ، آپ صلی اللہ علیہ وسلم کے ساتھ آپ صلی اللہ علیہ وسلم کے کچھ صحابہ رضوان اللہ عنھم اجمعین بھی تھے ۔ جن میں عمر رضی اللہ تعالیٰ عنہ بھی شامل تھے کہ آپ صلی اللہ علیہ وسلم کے پاس ایک شخص آیا ۔ اس نے خوشبوسےلت پت جبہ پہنا ہواتھا ، اس نے کہا : اے اللہ کے رسول ( صلی اللہ علیہ وسلم ) آپ صلی اللہ علیہ وسلم کا اس شخص کے بارے میں کیا خیا ل ہے ۔ جس نےاچھی طرح خوشبولگاکر جبے میں عمرے کا احرام باندھاہے ۔ ؟نبی کریم صلی اللہ علیہ وسلم نے کچھ دیر اس کی طرف دیکھا ، پھرسکوت اختیار فرمایا تو ( اس اثناء میں ) آپ صلی اللہ علیہ وسلم پر وحی نازل ہوناشروع ہوگئی ۔ حضرت عمر رضی اللہ تعالیٰ عنہ نے ہاتھ سے یعلیٰ رضی اللہ تعالیٰ عنہ کو اشارہ کیا ، ادھرآؤ یعلیٰ رضی اللہ تعالیٰ عنہ آگئے اور اپنا سر ( چادر ) میں داخل کردیا ۔ ادھر آؤ ، یعلیٰ رضی اللہ تعالیٰ عنہ آگئے اور پنا سر ( چادر ) میں داخل کردیا ، اس وقت آپ صلی اللہ علیہ وسلم کا چہرہ سرخ ہورہاتھا ، آپ صلی اللہ علیہ وسلم کچھ دیر بھاری بھاری سانس لیتے رہے پھر آپ صلی اللہ علیہ وسلم سے وہ کیفیت دور ہوگئی تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" وہ شخص کہاں ہے جس نے ابھی مجھ سے عمرے کے متعلق سوال کیا تھا؟ \" آدمی کو تلاش کرکے حاضر کیا گیا نبی کریم صلی اللہ علیہ وسلم نے فرمایا : \" وہ خوشبو جو تم نے لگا رکھی ہے ۔ اسے تین مرتبہ دھو لو اور یہ جبہ ( لباس ) ، اسے اتار دو ، پھر اپنے عمرے میں ویسے ہی کرو جیسے تم اپنے حج میں کرتے ہو ۔ \"",
                "urduNarrator": "ہم سے زہیر بن حرب نے بیان کیا، کہا ہم سے اسماعیل بن ابراہیم نے بیان کیا، اور ہم سے عبد بن حمید نے بیان کیا، کہا ہم سے محمد بن بکر نے بیان کیا، انہوں نے کہا ابن جریج نے کہا ,  مجھے عطاء نے خبر دی کہ صفوان بن یعلیٰ رضی اللہ تعالیٰ عنہ بن امیہ نے انھیں خبر دی کہ",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، ح وحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ، قَالَا: أَخْبَرَنَا ابْنُ جُرَيْجٍ، ح وحَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ - وَاللَّفْظُ لَهُ - أَخْبَرَنَا عِيسَى، عَنِ ابْنِ جُرَيْجٍ، قَالَ: أَخْبَرَنِي عَطَاءٌ، أَنَّ صَفْوَانَ بْنَ يَعْلَى بْنِ أُمَيَّةَ، أَخْبَرَهُ أَنَّ يَعْلَى كَانَ يَقُولُ لِعُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللهُ عَنْهُ: لَيْتَنِي أَرَى نَبِيَّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حِينَ يُنْزَلُ عَلَيْهِ، فَلَمَّا كَانَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِالْجِعْرَانَةِ، وَعَلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ثَوْبٌ قَدْ أُظِلَّ بِهِ عَلَيْهِ، مَعَهُ نَاسٌ مِنْ أَصْحَابِهِ، فِيهِمْ عُمَرُ، إِذْ جَاءَهُ رَجُلٌ عَلَيْهِ جُبَّةُ صُوفٍ، مُتَضَمِّخٌ بِطِيبٍ، فَقَالَ: يَا رَسُولَ اللهِ، كَيْفَ تَرَى فِي رَجُلٍ أَحْرَمَ بِعُمْرَةٍ فِي جُبَّةٍ بَعْدَمَا تَضَمَّخَ بِطِيبٍ؟ فَنَظَرَ إِلَيْهِ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ سَاعَةً، ثُمَّ سَكَتَ، فَجَاءَهُ الْوَحْيُ، فَأَشَارَ عُمَرُ بِيَدِهِ إِلَى يَعْلَى بْنِ أُمَيَّةَ: تَعَالَ، فَجَاءَ يَعْلَى، فَأَدْخَلَ رَأْسَهُ، فَإِذَا النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مُحْمَرُّ الْوَجْهِ، يَغِطُّ سَاعَةً، ثُمَّ سُرِّيَ عَنْهُ، فَقَالَ: «أَيْنَ الَّذِي سَأَلَنِي عَنِ الْعُمْرَةِ آنِفًا؟» فَالْتُمِسَ الرَّجُلُ، فَجِيءَ بِهِ، فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَمَّا الطِّيبُ الَّذِي بِكَ، فَاغْسِلْهُ ثَلَاثَ مَرَّاتٍ، وَأَمَّا الْجُبَّةُ فَانْزِعْهَا، ثُمَّ اصْنَعْ فِي عُمْرَتِكَ، مَا تَصْنَعُ فِي حَجِّكَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10365,
                "hadithNumber": "2801",
                "englishNarrator": "Ya'la bin Umayya ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "A person came to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as he was staying at Ji'rana and he had put on Ihram for 'Umra and he had dyed his beard and his head with yellow colour and there was a cloak on him. He said: I put on Ihram for 'Umra and I am in this state as you see (with dyed beard and head and a cloak over me). He (the Holy Prophet) said: Take off the cloak and wash the yellowness and do in your 'Umra what you do in Hajj.",
                "hadithUrdu": "جب نبی اکرم صلی اللہ علیہ وسلم جعرانہ میں تھے ، آپ صلی اللہ علیہ وسلم کے پاس ایک شخص آیا ، وہ عمرے کااحرام باندھ کرتلبیہ کہہ چکا تھا ، اس نے اپنا سراور اپنی داڑھی کو زردرنگ سے رنگا ہواتھا ، اور اس ( کے جسم ) پر جبہ تھا ۔ اس نے پوچھا : اے اللہ کے رسول صلی اللہ علیہ وسلم !میں نے عمرے کا احرام باندھا ہے اور میں اس حالت میں ہوں جو آپ دیکھ رہے ہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" جبہ اتار دوں ، اپنے آپ سے زرد رنگ کو دھو ڈالو اور جو تم نے اپنے حج میں کرنا تھا وہی عمرے میں کرو ۔ \"",
                "urduNarrator": "ہم سے عقبہ بن مکرم العمی اور محمد بن رافع نے بیان کیا - اور یہ قول ابن رافع کا ہے - انہوں نے کہا : ہم سے وہب بن جریر بن حازم نے بیان کیا ۔ میرے والد نے کہا: میں نے سنا قیس ، عطاء سے حدیث بیا ن کرتے ہیں ، وہ صفوان بن یعلیٰ بن امیہ سے ، وہ اپنے والد ( یعلی رضی اللہ تعالیٰ عنہ ) سے کہ",
                "hadithArabic": "وحَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ الْعَمِّيُّ، وَمُحَمَّدُ بْنُ رَافِعٍ - وَاللَّفْظُ لِابْنِ رَافِعٍ - قَالَا: حَدَّثَنَا وَهْبُ بْنُ جَرِيرِ بْنِ حَازِمٍ، حَدَّثَنَا أَبِي، قَالَ: سَمِعْتُ قَيْسًا، يُحَدِّثُ عَنْ عَطَاءٍ، عَنْ صَفْوَانَ بْنِ يَعْلَى بْنِ أُمَيَّةَ، عَنْ أَبِيهِ رَضِيَ اللهُ عَنْهُ، أَنَّ رَجُلًا أَتَى النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَهُوَ بِالْجِعْرَانَةِ، قَدْ أَهَلَّ بِالْعُمْرَةِ، وَهُوَ مُصَفِّرٌ لِحْيَتَهُ وَرَأْسَهُ، وَعَلَيْهِ جُبَّةٌ، فَقَالَ: يَا رَسُولَ اللهِ، إِنِّي أَحْرَمْتُ بِعُمْرَةٍ، وَأَنَا كَمَا تَرَى، فَقَالَ: «انْزِعْ عَنْكَ الْجُبَّةَ، وَاغْسِلْ عَنْكَ الصُّفْرَةَ، وَمَا كُنْتَ صَانِعًا فِي حَجِّكَ، فَاصْنَعْهُ فِي عُمْرَتِكَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10366,
                "hadithNumber": "2802",
                "englishNarrator": "Ya'la رضی اللہ عنہ reported:",
                "hadithEnglish": "We were with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) that a person came to him with a cloak on him having the traces of scent. He said, Messenger of Allah, I put on Ihram for 'Umra: what should I do? He (the Holy Prophet) kept quiet and did not make him any reply. And 'Umar screened him and it was (usual) with 'Umar that when the revelation descended upon him, he provided him shade (with the help of a piece of cloth). I (the person who came to the Holy Prophet) said: I said to 'Umar I wish to project my head into the cloth (to see how the Prophet receives revelation). So when the revelation began to descend upon him 'Umar wrapped him (the Holy Prophet) with cloth I came to him and projected my head with him into the cloth, and saw him (the Holy Prophet) (receiving the revelation). When he (the Holy Prophet) was relieved (of its burden), he said: Where is the inquirer who was just inquiring about 'Umra? That man came to him. Thereupon he (the Messenger of Allah) said: Take off the cloak from (your body) and wash the traces of perfume which were upon you, and do in 'Umra what you did in Hajj.",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے کہ ایک شخص آیا ، اس نے جبہ پہن رکھاتھا جس پر زعفران ملی خوشبو کے نشانات تھے ، اس نے کہا : اے اللہ کے رسول صلی اللہ علیہ وسلم !میں نے عمرے کا احرام باندھا ہے تو میں کس طر ح کروں؟آپ صلی اللہ علیہ وسلم خاموش رہےاور اسے کوئی جواب نہ دیا ، جب آپ صلی اللہ علیہ وسلم پر وحی اترتی تو حضرت عمر رضی اللہ تعالیٰ عنہ آپ کے آگے اوٹ کرتے ، آپ پر سایہ کرتے ۔ میں نے حضرت عمر سے کہا : میر ی خواہش ہے کہ جب آپ صلی اللہ علیہ وسلم پر وحی نازل ہو ، میں بھی کپڑے میں آپ صلی اللہ علیہ وسلم کےساتھ اپنا سر داخل کروں ۔ جب آپ صلی اللہ علیہ وسلم پر وحی نازل ہونے لگی ، حضرت عمر رضی اللہ تعالیٰ عنہ نے آپ کو کپڑے سے چھپا دیا ۔ میں آپ صلی اللہ علیہ وسلم کے پاس آیا اور آپ صلی اللہ علیہ وسلم کے ساتھ کپڑے میں اپنا سر داخل کردیا اور آپ کو ( وحی کے نزول کی حالت میں ) دیکھا ۔ جب آپ کی وہ کیفیت زائل کردی گئی تو فرمایا : \" ابھی عمرے کے متعلق سوال کرنے والا شخص کہاں ہے؟ \" ( اتنے میں ) وہ شخص آپ کے پاس آگیا تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" اپنا جبہ اتار دو ، اپنے جسم سے زعفران ملی خوشبو کا نشان دھوڈالو اور عمرے میں وہی کرو جو تم نے حج میں کرنا تھا ۔ \"",
                "urduNarrator": "مجھ سے اسحاق بن منصور نے بیان کیا، کہا ہم سے ابو علی عبید اللہ بن عبدالمجید نے بیان کیا، انہوں نے کہا رباح بن ابی معروف نے ہم سے حدیث بیان کی ، کہا : میں نے عطاء سے سنا ، انھوں نے کہا : مجھے صفوان بن یعلیٰ رضی اللہ عنہ نے اپنے والد یعلیٰ رضی اللہ تعالیٰ عنہ سے خبر دی ، کہا",
                "hadithArabic": "وحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا أَبُو عَلِيٍّ عُبَيْدُ اللهِ بْنُ عَبْدِ الْمَجِيدِ، حَدَّثَنَا رَبَاحُ بْنُ أَبِي مَعْرُوفٍ، قَالَ: سَمِعْتُ عَطَاءً، قَالَ: أَخْبَرَنِي صَفْوَانُ بْنُ يَعْلَى، عَنْ أَبِيهِ رَضِيَ اللهُ عَنْهُ، قَالَ: كُنَّا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَأَتَاهُ رَجُلٌ عَلَيْهِ جُبَّةٌ بِهَا أَثَرٌ مِنْ خَلُوقٍ، فَقَالَ يَا رَسُولَ اللهِ، إِنِّي أَحْرَمْتُ بِعُمْرَةٍ، فَكَيْفَ أَفْعَلُ؟ فَسَكَتَ عَنْهُ، فَلَمْ يَرْجِعْ إِلَيْهِ، وَكَانَ عُمَرُ يَسْتُرُهُ إِذَا أُنْزِلَ عَلَيْهِ الْوَحْيُ، يُظِلُّهُ، فَقُلْتُ لِعُمَرَ رَضِيَ اللهُ عَنْهُ: إِنِّي أُحِبُّ، إِذَا أُنْزِلَ عَلَيْهِ الْوَحْيُ، أَنْ أُدْخِلَ رَأْسِي مَعَهُ فِي الثَّوْبِ، فَلَمَّا أُنْزِلَ عَلَيْهِ، خَمَّرَهُ عُمَرُ رَضِيَ اللهُ عَنْهُ بِالثَّوْبِ، فَجِئْتُهُ فَأَدْخَلْتُ رَأْسِي مَعَهُ فِي الثَّوْبِ، فَنَظَرْتُ إِلَيْهِ، فَلَمَّا سُرِّيَ عَنْهُ، قَالَ: «أَيْنَ السَّائِلُ آنِفًا عَنِ الْعُمْرَةِ؟» فَقَامَ إِلَيْهِ الرَّجُلُ، فَقَالَ: «انْزِعْ عَنْكَ جُبَّتَكَ، وَاغْسِلْ أَثَرَ الْخَلُوقِ الَّذِي بِكَ، وَافْعَلْ فِي عُمْرَتِكَ، مَا كُنْتَ فَاعِلًا فِي حَجِّكَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10367,
                "hadithNumber": "2803",
                "englishNarrator": "Ibn 'Abbas (رضی اللہ تعالیٰ عنہ ) reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) specified Dhu'l-Hulaifa, for the people of Medina; Juhfa for the people of Syria; Qarn al-Manazil, for the people of Najd; Yalamlam for the people of Yemen (the Mawaqit) and those (Mawaqit) are also meant for those who live at these (places) and for those too who come from without towards them for the sake of Hajj or 'Umra. And those who live within them (within the bounds of these places) or in the suburbs of Mecca or within Mecca, they should enter upon the state of Ihram at these very places.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے مدینہ والوں کے لیے ذوالحلیفہ شام والوں کے لیے جحفہ نجد والوں کے لیے قرن المنازل اور یمن والو ں کے لیے یلملم کو میقات مقرر کیا اور فر ما یا : \" یہ ( چاروں میقات ) ان جگہوں ( پر رہنے والے ) اور وہاں نہ رہنے والے ۔ وہاں تک پہنچنے والے ایسے لوگوں کے لیے ہیں جو حج اور عمرے کا ارادہ کریں اور جوان ( مقامات ) کے اندر ہو وہ اپنے گھر ہی سے احرام باندھ لے جو اس سے زیادہ حرم کے قریب ہو وہ اسی طرح کرے حتی کہ مکہ والے مکہ ہی سے احرا م باندھیں.",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ، خلف بن ہشام، ابو الربیع اور قتیبہ نے حماد کی سند سے بیان کیا، کہا: ہم سے حماد بن زید نے بیان کیا, عمرو بن دینا ر نے طاوس سے ، انھوں نے ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَخَلَفُ بْنُ هِشَامٍ، وَأَبُو الرَّبِيعِ، وَقُتَيْبَةُ، جَمِيعًا عَنْ حَمَّادٍ، قَالَ يَحْيَى: أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا، قَالَ: وَقَّتَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِأَهْلِ الْمَدِينَةِ، ذَا الْحُلَيْفَةِ، وَلِأَهْلِ الشَّامِ الْجُحْفَةَ، وَلِأَهْلِ نَجْدٍ، قَرْنَ الْمَنَازِلِ، وَلِأَهْلِ الْيَمَنِ، يَلَمْلَمَ، قَالَ: «فَهُنَّ لَهُنَّ، وَلِمَنْ أَتَى عَلَيْهِنَّ مِنْ غَيْرِ أَهْلِهِنَّ، مِمَّنْ أَرَادَ الْحَجَّ وَالْعُمْرَةَ، فَمَنْ كَانَ دُونَهُنَّ فَمِنْ أَهْلِهِ، وَكَذَا فَكَذَلِكَ، حَتَّى أَهْلُ مَكَّةَ يُهِلُّونَ مِنْهَا».",
                "headingArabic": "مَوَاقِيتِ الْحَجِّ وَالْعُمْرَةِ ‏",
                "headingUrdu": "حج کا مواقیت",
                "headingEnglish": "The Mawaqit of Hajj",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10368,
                "hadithNumber": "2804",
                "englishNarrator": "Ibn 'Abbas ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) specified Dhu'l-Hulaifa for the people of Medina; Juhfa for the people of Syria, Qarn al-Manazil for the people of Najd, Yalamlam for the people of Yemen (as their respective Mawaqit), and he also said: These are (Mawaqit) of them too (who live there) and everyone who comes from outside (through) their (directions) for the sake of Hajj and 'Umra and for those who live within (those bounds their Miqat is that) from which they commenced (their journey), and for the people of Mecca, Mecca itself is (the Miqat).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے مدینہ والوں کے لیے ذوالحلیفہ شام والوں کے لیے جحفہ نجد والوں کے لیے قرن المنازل اور یمن والوں کے لیے یلملم کو میقات مقرر کیا اور فر ما یا : \" یہ ( مقامات ) وہاں کے باشندوں اور ہر آنے والے ایسے شخص کے لیے ( میقات ) ہیں جو دوسرے علاقوں سے وہاں پہنچے اور حج و عمرے کا ارادہ رکھتا ہو ۔ اور جو کو ئی ان ( مقامات ) سے اندر ہو وہ اسی جگہ سے ( احرا م ) باندھ لے ) جہاں سےوہ چلے حتیٰ کہ مکہ والے مکہ ہی سے ( احرام باند ھیں ۔ )",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے یحییٰ بن آدم نے بیان کیا، انہوں نے بیان کیا وہیب نے کہا : ہمیں عبد اللہ بن طاوس نے اپنے والد سے انھوں نے ابن عباس رضی اللہ تعالیٰ عنہ سے حدیث بیان کی ، کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا عَبْدُ اللهِ بْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَقَّتَ لِأَهْلِ الْمَدِينَةِ ذَا الْحُلَيْفَةِ، وَلِأَهْلِ الشَّامِ الْجُحْفَةَ، وَلِأَهْلِ نَجْدٍ قَرْنَ الْمَنَازِلِ، وَلِأَهْلِ الْيَمَنِ يَلَمْلَمَ، وَقَالَ: «هُنَّ لَهُمْ، وَلِكُلِّ آتٍ أَتَى عَلَيْهِنَّ مِنْ غَيْرِهِنَّ، مِمَّنْ أَرَادَ الْحَجَّ وَالْعُمْرَةَ، وَمَنْ كَانَ دُونَ ذَلِكَ، فَمِنْ حَيْثُ أَنْشَأَ، حَتَّى أَهْلُ مَكَّةَ، مِنْ مَكَّةَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10369,
                "hadithNumber": "2805",
                "englishNarrator": "Ibn 'Umar (رضی اللہ تعالیٰ عنہما) reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: The people of Medina should enter upon the state of Ihram at Dhu'l-Hulaifa, and people of Syria at Juhfa, and people of Najd at Qarn (al-Manazil), and 'Abdullah (further) said: It has reached me that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) also caid: The people of Yemen should enter upon the state of Ihram at Yalamlam.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \"\" مدینہ والے ذوالحلیفہ سے شام والے جحفہ سے اور نجد والے قرن المنازل سے ( احرام باند ھ کر ) تلبیہ کہیں ۔ عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ نے کہا : مجھے یہ بات بھی پہنچی کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \"\" یمن والے یلملم سے ( احرام باندھ کر ) تلبیہ کیں ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا: میں نے مالک رضی اللہ عنہ سے پڑھا, نافع نے ابن عمر رضی اللہ تعالیٰ عنہما سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ رَضِيَ اللهُ عَنْهُمَا، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «يُهِلُّ أَهْلُ الْمَدِينَةِ، مِنْ ذِي الْحُلَيْفَةِ، وَأَهْلُ الشَّامِ، مِنَ الْجُحْفَةِ، وَأَهْلُ نَجْدٍ، مِنْ قَرْنٍ» قَالَ عَبْدُ اللهِ: وَبَلَغَنِي أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «وَيُهِلُّ أَهْلُ الْيَمَنِ مِنْ يَلَمْلَمَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10370,
                "hadithNumber": "2806",
                "englishNarrator": "Salim reported on the authority of his father ('Abdullah bin 'Umar):",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: The people of Medina should enter upon the state of Ihram at Dhu'l-Hulaifa; the people of Syria at Juhfa, the people of Najd at Qarn (al-Manazil). Ibn 'Umar (Allah be pleased with them) said: It was mentioned to me but I did not myself bear it (directly) from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) having said this: The people of Yemen should enter upon the state of Ihram at Yalamlam.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم فر ما رہے تھے : \"\" اہل مدینہ کا مقام تلبیہ ( وہ جگہ جہاں سے بآواز بلند لبيك اللهم لبيك کہنے کا آغاز ہو تا ہے یعنی میقات مراد ہے ) ذوالحلیفہ ہے اہل شام کا مقام تلبیہ مهيعه وہی جحفه ہے اور اہل نجد کا قرن ( المنازل ) عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ نے کہا : ( مجھے بتا نے والے ) ان لوگوں کا خیال ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ۔ ۔ ۔ میں نے آپ سے خود نہیں سنا ۔ ۔ ۔ فر ما یا \"\" اور اہل یمن کا مقام تلبیہ یلملم ہے ۔",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، کہا کہ مجھ سے یونس نے بیان کیا، ابن شہاب کی سند سے, سالم بن عبد اللہ بن عمر بن خطا ب نے اپنے والد سے روایت کی ۔ کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا",
                "hadithArabic": "وحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللهِ بْنِ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللهُ عَنْهُ، عَنْ أَبِيهِ، قَالَ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مُهَلُّ أَهْلِ الْمَدِينَةِ ذُو الْحُلَيْفَةِ، وَمُهَلُّ أَهْلِ الشَّامِ مَهْيَعَةُ، وَهِيَ الْجُحْفَةُ، وَمُهَلُّ أَهْلِ نَجْدٍ قَرْنٌ» قَالَ عَبْدُ اللهِ بْنُ عُمَرَ رَضِيَ اللهُ عَنْهُمَا: وَزَعَمُوا أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - وَلَمْ أَسْمَعْ ذَلِكَ مِنْهُ - قَالَ: «وَمُهَلُّ أَهْلِ الْيَمَنِ يَلَمْلَمُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10371,
                "hadithNumber": "2807",
                "englishNarrator": "It was narrated from Abdullah bin Dinaar that he heard Ibn Umar رضی اللہ تعالیٰ عنہما say:",
                "hadithEnglish": "\"The Messenger of Allah commanded the people of Al-Madinah to (being the Talbiyah) from Dhul-Hulaifah, the people of Ash-Sham from Al-Juhfah and the people of Najd from Qarn.\"\r\n'Abdullah bin 'Umar (رضی اللہ تعالیٰ عنہما) said: ''And I was told that he said: 'The people of Yemen should (being the Talbiyah) from Yalamlam.'''",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے مدینہ والوں کو حکم دیا کہ وہ ذولحلیفہ سے شام والوں کو حکم دیا کہ وہ جحفہ سے اور نجد والوں کو حکم دیا کہ وہ قرن ( منا زل ) سے ( احرام باندھ کر ) تلبیہ کا آغا ز کریں ۔ عبد اللہ بن عمر  رضی اللہ تعالیٰ عنہما  نے کہا مجھے خبردی گئی کہ آپ صلی اللہ علیہ وسلم نے فر ما یا : \"\" یمن والے یلملم سے احرا م باند ھیں ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ، یحییٰ بن ایوب، قتیبہ بن سعید اور علی بن حجر نے بیان کیا - یحییٰ نے کہا: ہم سے انہوں نے بیان کیا اور دوسروں نے کہا: - ہم سے اسماعیل بن جعفر نے بیان کیا، کی سند سے عبد اللہ بن دینا ر سے روایت ہے انھوں نے ابن عمر رضی اللہ تعالیٰ عنہما سے سنا انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَيَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَعَلِيُّ بْنُ حُجْرٍ - قَالَ يَحْيَى: أَخْبَرَنَا، وَقَالَ الْآخَرُونَ: - حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ عَبْدِ اللهِ بْنِ دِينَارٍ، أَنَّهُ سَمِعَ ابْنَ عُمَرَ رَضِيَ اللهُ عَنْهُمَا، قَالَ: أَمَرَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَهْلَ الْمَدِينَةِ أَنْ يُهِلُّوا مِنْ ذِي الْحُلَيْفَةِ، وَأَهْلَ الشَّامِ مِنَ الْجُحْفَةِ، وَأَهْلَ نَجْدٍ، مِنْ قَرْنٍ. وَقَالَ عَبْدُ اللهِ بْنُ عُمَرَ رَضِيَ اللهُ عَنْهُمَا: وَأُخْبِرْتُ أَنَّهُ قَالَ: «وَيُهِلُّ أَهْلُ الْيَمَنِ مِنْ يَلَمْلَمَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10372,
                "hadithNumber": "2808",
                "englishNarrator": "Abu Az-Zubair narrated:",
                "hadithEnglish": "He heard Jabir bin Abdullah (رضی اللہ عنہما ) being asked about the Miqat. He said: \"I heard\" -then he stopped and said: \"I think he meant the prophet ﷺ.",
                "hadithUrdu": "انھوں نے جا بر بن عبد اللہ  رضی اللہ عنہما سے سنا ان سے مقام تلبیہ کے بارے میں پو چھا جا رہا تھا تو انھوں نے کہا : میں نے سنا پھر رک گئے اور ( کچھ وقفے کے بعد ) کہا : ان ( جا بر رضی اللہ تعالیٰ عنہ ) کی مراد نبی اکرم صلی اللہ علیہ وسلم سے تھی ( کہ جابر رضی اللہ تعالیٰ عنہ نے ان سے سنا ).",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سےروح بن عبادہ نے کہا ہمیں ابن جریج نے حدیث سنا ئی کہا : ہمیں ابو زبیر نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ رَضِيَ اللهُ عَنْهُمَا، يُسْأَلُ عَنِ الْمُهَلِّ، فَقَالَ: سَمِعْتُ - ثُمَّ انْتَهَى فَقَالَ: أُرَاهُ يَعْنِي - النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10373,
                "hadithNumber": "2809",
                "englishNarrator": "It was narrated from Salim, from his father ( رضی اللہ تعالیٰ عنہ):",
                "hadithEnglish": "The Messenger of Allah ﷺ said: \"The people of Al-Madinah should (being the Talbiyah) from Dhul-Hulaifah, the people of Ash-Sham should enter Ihram from Al-Juhfah and the people of Najd should (being the Talbiyah) from Qarn.\"\r\nIbn 'Umar (رضی اللہ تعالیٰ عنہ) said: \"And it was mentioned to me, although I did not hear it, that the Messenger of Allah ﷺ said: 'And the people of Yemen should (being the Talbiyah) from Yalamlam.",
                "hadithUrdu": "اللہ کے رسول صلی اللہ علیہ وسلم نے فر ما یا : \"\" مدینہ والے ذوالحلیفہ سے شام والے جحفہ سے اور نجد والے قرن منا زل سے احرا م باندھیں ۔ ابن عمر رضی اللہ تعالیٰ عنہ نے کہا مجھے بتا یا گیا ۔ ۔ ۔ میں نے خود نہیں سنا ۔ ۔ ۔ کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا یمن والے یلملم سے احرام باندھیں ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب اور ابن ابی عمر نے بیان کیا کہ انہوں نے ہم سے بیان کیاسفیا ن نے زہری سے حدیث بیان کی انھوں نے سالم سے انھوں نے اپنے والد ( ابن عمر رضی اللہ تعالیٰ عنہ ) سے حدیث بیان کی کہ",
                "hadithArabic": "وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَابْنُ أَبِي عُمَرَ، قَالَ ابْنُ أَبِي عُمَرَ: حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ رَضِيَ اللهُ عَنْهُ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «يُهِلُّ أَهْلُ الْمَدِينَةِ مِنْ ذِي الْحُلَيْفَةِ، وَيُهِلُّ أَهْلُ الشَّامِ مِنَ الْجُحْفَةِ، وَيُهِلُّ أَهْلُ نَجْدٍ مِنْ قَرْنٍ» قَالَ ابْنُ عُمَرَ رَضِيَ اللهُ عَنْهُمَا: وَذُكِرَ لِي - وَلَمْ أَسْمَعْ - أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «وَيُهِلُّ أَهْلُ الْيَمَنِ مِنْ يَلَمْلَمَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10374,
                "hadithNumber": "2810",
                "englishNarrator": "Abu Zubair narrated:",
                "hadithEnglish": "He heard Jabir bin Abdullah رضی اللہ تعالیٰ عنہ being asked about the Miqat. He said: \"I heard\" -and I think he attributed it to the prophet ﷺ and said: \"The Miqat of the people of Al Madinah is from Dhui-Hulaifah and the other way is Al-Juhfah and the Miqat for the people of Al-iraq is from Dhat irq and the Miqat for the people of Najd is from Qarn and the Miqat for the people of Yemen is Yalamlam.",
                "hadithUrdu": "انھوں نے جا بر بن عبد اللہ رضی اللہ تعالیٰ عنہ سے سنا ان سے مقام تلبیہ کے متعلق سوال کیا گیا تھا ( جا بر رضی اللہ تعالیٰ عنہ نے ) کہا میں نے سنا ۔ ۔ ۔ میرا خیا ل ہے کہ انھوں نے حدیث کی نسبت رسول اللہ صلی اللہ علیہ وسلم کی طرف کی ۔ آپ نے فر ما یا : \" مدینہ والوں کا مقام تلبیہ ( احرام باندھنے کی جگہ ) ذوالحلیفہ ہے اور دوسرے راستے ( سے آنے والوں کا مقام ) جحفہ ہے ۔ اہل عراق کا مقام تلبیہ ذات عر ق نجد والوں کا قرن ( منازل ) اور یمن والوں کا یلملم ہے ۔",
                "urduNarrator": "مجھ سے محمد بن حاتم اور عبد بن حمید دونوں نے بیان کیا, محمد بن بکر سے روایت ہے کہا مجھے ابن جریج نے خبر دی ، کہا مجھے ابو زبیر نے خبر دی کہ",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، وَعَبْدُ بْنُ حُمَيْدٍ كِلَاهُمَا، عَنْ مُحَمَّدِ بْنِ بَكْرٍ - قَالَ عَبْدٌ: أَخْبَرَنَا مُحَمَّدٌ - أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ رَضِيَ اللهُ عَنْهُمَا، يُسْأَلُ عَنِ الْمُهَلِّ فَقَالَ: سَمِعْتُ - أَحْسَبُهُ رَفَعَ إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَقَالَ: «مُهَلُّ أَهْلِ الْمَدِينَةِ مِنْ ذِي الْحُلَيْفَةِ، وَالطَّرِيقُ الْآخَرُ الْجُحْفَةُ، وَمُهَلُّ أَهْلِ الْعِرَاقِ مِنْ ذَاتِ عِرْقٍ، وَمُهَلُّ أَهْلِ نَجْدٍ مِنْ قَرْنٍ، وَمُهَلُّ أَهْلِ الْيَمَنِ مِنْ يَلَمْلَمَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10375,
                "hadithNumber": "2811",
                "englishNarrator": "Abdullah bin 'Umar ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "The Talbiya of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was this: Here I am at Thy service. O Allah, here I am at Thy service, here I am at Thy service. There is no associate with Thee; here I am at Thy service. Verily all praise and grace is due to Thee, and the sovereignty (too). There is no associate with Thee. He (the narrator) further said that 'Abdullah bin 'Umar (رضی اللہ تعالیٰ عنہ) made this addition to it: Here I am at Thy service; here I am at Thy service; ready to obey Thee, and good is in Thy Hand; here I am at Thy service; unto Thee is the petition, and deed (is also for Thee).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کا تلبیہ یہ ہوا کرتا تھا ۔ لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ ، لَبَّيْكَ لاَ شَرِيكَ لَكَ لَبَّيْكَ ، إِنَّ الْحَمْدَ ، وَالنِّعْمَةَ ، لَكَ وَالْمُلْكَ ، لاَ شَرِيكَ لَكَ میں بار بار حاضر ہوں اے اللہ ! تیرے حضور حاضر ہوں میں حاضر ہوں یقیناً تعریفیں اور ساری نعمتیں تیری ہیں اور ساری بادشاہت بھی تیری ہے ۔ ( کسی بھی چیز میں ) تیرا کو ئی شریک نہیں ۔ اور ( نافع نے ) کہا عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ اس ( مذکورہ تلبیہ ) میں یہ اضا فہ فر ما یا کرتے تھے ۔ \"\" لبيك لبيك وسعديك ، والخير بيديك ، والرغباء إليك والعمل \"\" میں تیر ے سامنے حاجر ہوں حاضر ہوں تیری اطا عت کی ایک کے بعد دوسری سعادت ( حاصل کرنے کے لیے ہر وقت تیار ہوں ) اور ہر قسم کی خیر تیرے دونوں ہاتھوں میں ہے اے اللہ ! میں تیرے حضور حاضر ہوں ۔ ( ہر دم ) تجھی سے مانگنے کی رغبت ہے اور تمام عمل ( تیری ہی رضا کے لیے ہیں )",
                "urduNarrator": "یحییٰ بن یحییٰ تمیمی نے کہا میں نے مالک کے سامنے ( اس حدیث کی ) قراءت کی انھوں نے نافع سے اور انھوں نے عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللهِ بْنِ عُمَرَ رَضِيَ اللهُ عَنْهُمَا، أَنَّ تَلْبِيَةَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَبَّيْكَ اللهُمَّ، لَبَّيْكَ، لَبَّيْكَ لَا شَرِيكَ لَكَ لَبَّيْكَ، إِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ لَا شَرِيكَ لَكَ» قَالَ: وَكَانَ عَبْدُ اللهِ بْنُ عُمَرَ رَضِيَ اللهُ عَنْهُمَا يَزِيدُ فِيهَا: لَبَّيْكَ لَبَّيْكَ، وَسَعْدَيْكَ، وَالْخَيْرُ بِيَدَيْكَ، لَبَّيْكَ وَالرَّغْبَاءُ إِلَيْكَ وَالْعَمَلُ.",
                "headingArabic": "التَّلْبِيَةِ وَصِفَتِهَا وَوَقْتِهَا ‏",
                "headingUrdu": "تلبیہ، اس کی تفصیل اور اوقات",
                "headingEnglish": "The Talbiyah, its description and timing",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10376,
                "hadithNumber": "2812",
                "englishNarrator": "Abdullah bin 'Umar (رضی اللہ تعالیٰ عنہما) reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) entered upon the state of Ihram near the mosque at Dhu'l-Hulaifa as his camel stood by it and he said: Here I am at Thy service, O Lord; here I am at Thy service: here I am at Thy service. There is no associate with Thee. Here I am at Thy service. All praise and grace is due to Thee and the sovereignty (too). There is no associate with Thee. They (the people) said that 'Abdullah bin 'Umar رضی اللہ تعالیٰ عنہ said that that was the Talbiya of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ). Nafi' said: 'Abdullah ( رضی اللہ تعالیٰ عنہ) made this addition to it: Here I am at Thy service; here I am at Thy service; ready to obey Thee. The Good is in Thy Hand. Here I am at Thy service. Unto Thee is the petition and deed (is also for Thee).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کی سواری جب آپ کو لے کر مسجد ذوالحلیفہ کے پاس سیدھی کھڑی ہو جا تی تو آپ تلبیہ پکا رتے اور کہتے : \"\" میں بار بار حاضر ہوں ۔ اے اللہ ! میں تیرے حضور حاضر ہوں میں حاضرہوں یقیناً تمام تعریفیں اور ساری نعمتیں تیری ہیں اور ساری بادشاہت بھی تیری ہے ( کسی بھی چیز میں تیرا کو ئی شریک نہیں ۔ ( سالم نا فع اور حمزہ نے ) کہا عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ کہا کرتے تھے کہ یہ اللہ کے رسول صلی اللہ علیہ وسلم کا تلبیہ ہے ۔ نافع نے کہا کہ عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ ان ( مذکورہ بالا ) کلما ت کے ساتھ ان الفاظ کاا ضافہ کرتے : \"\" میں تیرے سامنے حاضر ہوں حاضر ہوں تیری اطاعت کی ایک کے بعد دوسری سعادت ( حاصل کرنے کے لیے ہر وقت تیار ہوں ) اور ہر قسم کی خیر تیرے دو نوں ہاتھوں میں ہے اے اللہ !میں تیرے حضور حاضر ہوں ۔ ( ہر دم ) تجھی سے مانگنے کی رغبت ہے اور تمام عمل ( تیری رضا کے لیے ہیں ).",
                "urduNarrator": "ہم سے محمد بن عباد نے بیان کیا، ہم سے حاتم نے بیان کیا، یعنی ابن اسماعیل نے، ان کی سند سے, موسیٰ بن عقبہ نے سالم بن عبد اللہ بن عمر اور حضرت عبد اللہ کے مولیٰ نافع اور حمزہ بن عبد اللہ کے واسطے سے عبد اللہ بن عمر رضی اللہ تعالیٰ عنہما سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبَّادٍ، حَدَّثَنَا حَاتِمٌ يَعْنِي ابْنَ إِسْمَاعِيلَ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ سَالِمِ بْنِ عَبْدِ اللهِ بْنِ عُمَرَ، وَنَافِعٍ، مَوْلَى عَبْدِ اللهِ، وَحَمْزَةَ بْنِ عَبْدِ اللهِ، عَنْ عَبْدِ اللهِ بْنِ عُمَرَ رَضِيَ اللهُ عَنْهُمَا، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ، إِذَا اسْتَوَتْ بِهِ رَاحِلَتُهُ قَائِمَةً عِنْدَ مَسْجِدِ ذِي الْحُلَيْفَةِ، أَهَلَّ فَقَالَ: «لَبَّيْكَ اللهُمَّ، لَبَّيْكَ، لَبَّيْكَ لَا شَرِيكَ لَكَ لَبَّيْكَ، إِنَّ الْحَمْدَ، وَالنِّعْمَةَ، لَكَ وَالْمُلْكَ، لَا شَرِيكَ لَكَ» قَالُوا: وَكَانَ عَبْدُ اللهِ بْنُ عُمَرَ رَضِيَ اللهُ عَنْهُمَا، يَقُولُ: هَذِهِ تَلْبِيَةُ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ نَافِعٌ: كَانَ عَبْدُ اللهِ رَضِيَ اللهُ عَنْهُ يَزِيدُ مَعَ هَذَا: «لَبَّيْكَ لَبَّيْكَ، وَسَعْدَيْكَ، وَالْخَيْرُ بِيَدَيْكَ لَبَّيْكَ، وَالرَّغْبَاءُ إِلَيْكَ وَالْعَمَلُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10377,
                "hadithNumber": "2813",
                "englishNarrator": "Ibn 'Umar (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "I immediately learnt Talbiya from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), and he then narrated the hadith.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کے منہ سے سنتے ہی تلبیہ یا د کر لیا پھر سالم نافع اور حمزہ کی حدیث کی طرح روایت بیا ن کی ۔",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا، کہا ہم سے یحییٰ نے بیان کیا، یعنی ابن سعید نے, عبید اللہ ( بن عمربن حفص العدوی المدنی ) نے کہا مجھے نا فع نے ابن عمر رضی اللہ تعالیٰ عنہ سے خبر دی کہا",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى يَعْنِي ابْنَ سَعِيدٍ، عَنْ عُبَيْدِ اللهِ، أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ رَضِيَ اللهُ عَنْهُمَا، قَالَ: تَلَقَّفْتُ التَّلْبِيَةَ مِنْ فِي رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ بِمِثْلِ حَدِيثِهِمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10378,
                "hadithNumber": "2814",
                "englishNarrator": "Abdullah bin 'Umar ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "I heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) pronouncing Talbiya with compacted hair: Here I am at Thy service. O Allah: here I am at Thy service; here I am at Thy service. There is no associate with Thee; here I am at Thy service. Verily all praise and grace is due to Thee and the Sovereignty (too). There is no associate with Thee; and he did not make any addition to these words. 'Abdullah bin 'Umar (رضی اللہ تعالیٰ عنہ) (further) said: The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to offer two rak'ahs of prayer at Dhu'l-Hulaifa and then when his camel stood up with him on its back near the mosque at Dhu'l-Hulaifa, he pronounced these words (of Talbiya). And 'Abdullah bin 'Umar ( رضی اللہ تعالیٰ عنہ) said that 'Umar bin Khattab (رضی اللہ تعالیٰ عنہ) pronounced, the Talbiya of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) in these words of his (Prophet's words) and said: Here I am at Thy service, O Lord; here I am at Thy service, ready to obey Thee, and good is in Thy Hand, Here I am at Thy service. Unto Thee is the petition and deed (is also for Thee).",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو اس حال میں تلبیہ پکا رتے سنا کہ آپ کے بال جڑے ( گوندیا خطمی بو ٹی وغیرہ کے ذریعے سے باہم چپکے ) ہو ئے تھے آپ کہہ رہے تھے ۔ لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ ، لَبَّيْكَ لاَ شَرِيكَ لَكَ لَبَّيْكَ ، إِنَّ الْحَمْدَ ، وَالنِّعْمَةَ ، لَكَ وَالْمُلْكَ ، لاَ شَرِيكَ لَكَان کلما ت پر اضا فہ نہیں فر ما تے تھے ۔ عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ فر ما یا کرتے تھے کہ اللہ کے رسول اللہ صلی اللہ علیہ وسلم ذوالحلیفہ میں دو رکعت نماز ادا کرتے پھر جب آپ کی اونٹنی مسجد ذوالحلیفہ کے پاس آپ کو لے کر کھڑی ہو جا تی تو آپ ان کلما ت سے تلبیہ پکا رتے ۔ عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ کہا کرتے تھے کہ عمر بن خطا ب رضی اللہ تعالیٰ عنہ ان کلما ت کے ساتھ رسول اللہ صلی اللہ علیہ وسلم جیسا تلبیہ پکا رتے تھے اور ( ساتھ یہ ) کہتے : : لبيك اللهم لبيك لبيك لبيك وسعديك ، والخير بيديك ، والرغباء إليك والعمل \"\" : \"\" میں با ر بار حاضر ہوں ، اے اللہ !میں تیرے سامنے حاضر ہوں حاضر ہوں تیری طرف سے سعادتوں کا طلب گا ر ہوں ہر قسم کی بھلا ئی تیرے دو نوں ہاتھوں میں ہے اے اللہ !میں تیرے حضور حاضر ہوں ۔ ہر دم تجھی سے مانگنے کی رغبت ہے اور ہر عمل تیری رضا کے لیے ہے ۔",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، کہا کہ مجھ سے یونس نے بیان کیا, ابن شہاب نے کہا : بلا شبہ سالم بن عبد اللہ بن عمر نے مجھے اپنے والد ( ابن عمر رضی اللہ تعالیٰ عنہ ) سے خبر دی انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ: فَإِنَّ سَالِمَ بْنَ عَبْدِ اللهِ بْنِ عُمَرَ، أَخْبَرَنِي عَنْ أَبِيهِ رَضِيَ اللهُ عَنْهُ، قَالَ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُهِلُّ مُلَبِّدًا، يَقُولُ: «لَبَّيْكَ اللهُمَّ، لَبَّيْكَ، لَبَّيْكَ لَا شَرِيكَ لَكَ لَبَّيْكَ، إِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ، لَا شَرِيكَ لَكَ» لَا يَزِيدُ عَلَى هَؤُلَاءِ الْكَلِمَاتِ، وَإِنَّ عَبْدَ اللهِ بْنَ عُمَرَ رَضِيَ اللهُ عَنْهُمَا، كَانَ يَقُولُ: كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَرْكَعُ بِذِي الْحُلَيْفَةِ رَكْعَتَيْنِ، ثُمَّ إِذَا اسْتَوَتْ بِهِ النَّاقَةُ قَائِمَةً عِنْدَ مَسْجِدِ ذِي الْحُلَيْفَةِ، أَهَلَّ بِهَؤُلَاءِ الْكَلِمَاتِ، وَكَانَ عَبْدُ اللهِ بْنُ عُمَرَ رَضِيَ اللهُ عَنْهُمَا، يَقُولُ: كَانَ عُمَرُ بْنُ الْخَطَّابِ رَضِيَ اللهُ عَنْهُ، يُهِلُّ بِإِهْلَالِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنْ هَؤُلَاءِ الْكَلِمَاتِ، وَيَقُولُ: لَبَّيْكَ اللهُمَّ لَبَّيْكَ، لَبَّيْكَ وَسَعْدَيْكَ، وَالْخَيْرُ فِي يَدَيْكَ لَبَّيْكَ وَالرَّغْبَاءُ إِلَيْكَ وَالْعَمَلُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10379,
                "hadithNumber": "2815",
                "englishNarrator": "Ibn 'Abbas (رضی اللہ تعالیٰ عنہما) reported:",
                "hadithEnglish": "The polytheists also pronounced (Talbiya) as: Here I am at Thy service, there is no associate with Thee. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Woe be upon them, as they also said: But one associate with Thee, you possess mastery over him, but he does not possess mastery (over you). They used to say this and circumambulate the Ka'ba.",
                "hadithUrdu": "مشر کین کہا کرتے تھے ہم حاضر ہیں ۔ تیرا کو ئی شریک نہیں ۔ کہا رسول اللہ صلی اللہ علیہ وسلم فرماتے : \" تمھا ری بر بادی ! بس کرو بس کرو ( یہیں پر رک جا ؤ ) مگر وہ آگے کہتے : مگر ایک ہے شریک جو تمھا را ہے تم اس کے مالک ہو ، وہ مالک نہیں وہ لو گ بیت اللہ کا طواف کرتے ہو ئے یہی کہتے تھے ۔",
                "urduNarrator": "مجھ سے عباس بن عبدالعظیم العنباری نے بیان کیا، کہا ہم سے الندر بن محمد الیمامی نے بیان کیا، کہا ہم سے عکرمہ نے بیان کیا، کہا ہم سے ابن عمار نے بیان کیا، کہا ہم سے ابو زمیل نے بیان کیا, حضرت عبا س رضی اللہ تعالیٰ عنہما سے روایت ہے کہا",
                "hadithArabic": "وحَدَّثَنِي عَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ، حَدَّثَنَا النَّضْرُ بْنُ مُحَمَّدٍ الْيَمَامِيُّ، حَدَّثَنَا عِكْرِمَةُ يَعْنِي ابْنَ عَمَّارٍ، حَدَّثَنَا أَبُو زُمَيْلٍ، عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا، قَالَ: كَانَ الْمُشْرِكُونَ يَقُولُونَ: لَبَّيْكَ لَا شَرِيكَ لَكَ، قَالَ: فَيَقُولُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «وَيْلَكُمْ، قَدْ قَدْ» فَيَقُولُونَ: إِلَّا شَرِيكًا هُوَ لَكَ، تَمْلِكُهُ وَمَا مَلَكَ، يَقُولُونَ هَذَا وَهُمْ يَطُوفُونَ بِالْبَيْتِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10380,
                "hadithNumber": "2816",
                "englishNarrator": "Salim bin 'Abdullah (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "He heard his father saying: This place Baida' is for you that about which you attribute lie to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). And the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) did not enter upon the state of Ihram but near the mosque at Dhu'l- Hulaifa.",
                "hadithUrdu": "انھوں نے اپنے والد ( عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ ) سے سنا انھوں نے فر ما یا : یہ تمھا را چٹیل میدا ن بيداءوہ مقام ہے جس کے حوالے سے تم رسول اللہ صلی اللہ علیہ وسلم کے بارے میں غلط بیا نی کرتے ہو رسول اللہ صلی اللہ علیہ وسلم نے کسی اور جگہ سے نہیں مگر مسجد کے قریب ( یعنی ذوالحلیفہ ) ہی سے احرا م باندھا تھا ۔",
                "urduNarrator": "یحییٰ بن یحییٰ نے حدیث بیان کی کہا میں نے مالک کے سامنے قراءت کی انھوں نے موسیٰ بن عقبہ سے اور انھوں نے سالم بن عبد اللہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ سَالِمِ بْنِ عَبْدِ اللهِ، أَنَّهُ سَمِعَ أَبَاهُ رَضِيَ اللهُ عَنْهُ، يَقُولُ: بَيْدَاؤُكُمْ هَذِهِ الَّتِي تَكْذِبُونَ عَلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِيهَا «مَا أَهَلَّ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، إِلَّا مِنْ عِنْدِ الْمَسْجِدِ» يَعْنِي ذَا الْحُلَيْفَةِ.",
                "headingArabic": "أَمْرِ أَهْلِ الْمَدِينَةِ بِالإِحْرَامِ مِنْ عِنْدِ مَسْجِدِ ذِي الْحُلَيْفَةِ ‏",
                "headingUrdu": "اہل مدینہ کو ذوالحلیفہ میں مسجد سے احرام باندھنے کا حکم",
                "headingEnglish": "The command to the people of Al-Madinah to enter Ihram from the Masjid at Dhul-Hulaifah",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10381,
                "hadithNumber": "2817",
                "englishNarrator": "Salim reported:",
                "hadithEnglish": "When it was said to Ibn 'Umar (رضی اللہ تعالیٰ عنہ) that the state of Ihram (commences from)a al-Baida' he said: Al-Baida', you attribute lie about it to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). And the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) did not enter upon the state of Ihram but near the tree when his camel stood up with him.",
                "hadithUrdu": "جب ابن عمر رضی اللہ تعالیٰ عنہ سے یہ کہا جا تا کہ احرا م بیدا ء سے ( باند ھا جا تا ) ہے تو وہ کہتے پیداء وہ مقام ہے جس کے حوالے سے تم رسول اللہ صلی اللہ علیہ وسلم پر غلط بیا نی کرتے ہو ۔ رسول اللہ صلی اللہ علیہ وسلم نے کسی اور جگہ سے نہیں درخت کے پاس ہی سے احرا م باندھا تھا ۔ جب آپ کی اونٹنی آپ کو لے کر کھڑی ہو گئی تھی ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, حاتم یعنی ابن اسماعیل نے مو سیٰ بن عقبہ سے انھوں نے سالم سے حدیث بیان کی کہا",
                "hadithArabic": "وحَدَّثَنَاه قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَاتِمٌ يَعْنِي ابْنَ إِسْمَاعِيلَ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ سَالِمٍ، قَالَ: كَانَ ابْنُ عُمَرَ رَضِيَ اللهُ عَنْهُمَا، إِذَا قِيلَ لَهُ: الْإِحْرَامُ مِنَ الْبَيْدَاءِ، قَالَ: الْبَيْدَاءُ الَّتِي تَكْذِبُونَ فِيهَا عَلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، «مَا أَهَلَّ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِلَّا مِنْ عِنْدِ الشَّجَرَةِ، حِينَ قَامَ بِهِ بَعِيرُهُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10382,
                "hadithNumber": "2818",
                "englishNarrator": "Ubaid bin Juraij said to 'Ahdullah bin 'Umar (رضی اللہ تعالیٰ عنہ):",
                "hadithEnglish": "'Abdul-Rahman, I find you doing four things which I do not see anyone among your companions doing. He said: Son of Juraij, what are these? Thereupon he said: You (while circumambulating the Ka'ba) do not touch but the two pillars situated on the side of yaman (south), and I find you wearing the sandals of tanned leather, and I find you with dyed beard and head, and I also found that, when you were at Mecca, the people pronounced Talbiya as they saw the new moon (Dhu'l-Hijja), but you did not do it till the 8th of Dhu'l-Hijja. Upon this 'Abdullab bin 'Umar رضی اللہ تعالیٰ عنہ said: (So far as the touching of) the pillars is concerned, I did not see the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) touching them but only those situated on the side of yaman. (So far as the wearing of) the shoes of tanned leather is concerned, I saw the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) wearing shoes without hair on them, and he (wore them with wet feet) after performing ablution, and I like to wear them. So far as the yellowness is concerned, I saw the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) dyeing (head, beard and cloth) with this colour and I love to dye (my head, beard or cloth) with this colour. And so far as the pronouncing of Talbiya is concerned, I did not see the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) pronouncing it until his camel proceeded on (to Dhu'l-Hulaifa).",
                "hadithUrdu": "اے ابو عبد الرحمٰن !میں نے آپ کو چا ر ( ایسے ) کام کرتے دیکھا ہے جو آپ کے کسی اور ساتھی کو کرتے نہیں دیکھا ۔ ابن عمر نے کہا : ابن جریج !وہ کو ن سے ( چار کام ) ہیں ؟ ابن جریج نے کہا : میں نے آپ کو دیکھا ہے کہ آپ ( بیت اللہ کے ) دو یما نی رکنوں ( کونوں ) کے سوا اور کسی رکن کو ہاتھ نہیں لگا تے ، میں نے آپ کو دیکھا ہے سبتی ( رنگے ہو ئے صاف چمڑے کے ) جو تے پہنتے ہیں ۔ ( نیز آپ کو دیکھا کہ زرد رنگ سے ( کپڑوں کو ) رنگتے یں اور آپ کو دیکھا ہے کہ جب آپ مکہ میں ہو تے ہیں تو لو گ ( ذوالحجہ کی ) پہلی کا چا ند دیکھتے ہی لبیک پکار نا شروع کر دیتے ہیں لیکن آپ آٹھویں کا دن آنے تک تلبیہ نہیں پکا رتے ۔ عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ نے جواب دیا : جہا ں تک ارکان ( بیت اللہ کے کونوں ) کی بات ہے تو میں نے رسول اللہ صلی اللہ علیہ وسلم کو دو یمنی رکنوں کے سوا ( کسی اور رکن کو ) ہاتھ لگا تے نہیں دیکھا ۔ رہے سبتی جو تے تو بلا شبہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو ایسے جو تے پہنے دیکھا کہ جن پر بال نہ ہو تے تھے آپ انھیں پہن کر وضو فر ما تے ( لہٰذا ) مجھے پسند ہے کہ میں یہی ( سبتی جو تے ) پہنوں ۔ رہا زرد رنگ تو بلا شبہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا آپ یہ ( رنگ ) استعمال کرتے تھے ۔ اس لیے میں پسند کرتا ہوں کہ میں بھی اس رنگ کو استعمال کروں ۔ اور رہی بات تلبیہ ( لبیک کہتے نہیں سنا جب تک آپ کی سواری آپ کو لے کر کھڑی نہ ہو جا تی ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا: میں نے مالک رضی اللہ عنہ سے پڑھا, سعید بن ابی سعید مقبری نے عبید بن جریج سے روایت کی کہ انھوں نے عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ سے کہا",
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ عُبَيْدِ بْنِ جُرَيْجٍ، أَنَّهُ قَالَ: لِعَبْدِ اللهِ بْنِ عُمَرَ رَضِيَ اللهُ عَنْهُمَا، يَا أَبَا عَبْدِ الرَّحْمَنِ، رَأَيْتُكَ تَصْنَعُ أَرْبَعًا لَمْ أَرَ أَحَدًا مِنْ أَصْحَابِكَ يَصْنَعُهَا، قَالَ: مَا هُنَّ؟ يَا ابْنَ جُرَيْجٍ، قَالَ: رَأَيْتُكَ لَا تَمَسُّ مِنَ الْأَرْكَانِ إِلَّا الْيَمَانِيَيْنِ، وَرَأَيْتُكَ تَلْبَسُ النِّعَالَ السِّبْتِيَّةَ، وَرَأَيْتُكَ تَصْبُغُ بِالصُّفْرَةِ، وَرَأَيْتُكَ، إِذَا كُنْتَ بِمَكَّةَ، أَهَلَّ النَّاسُ إِذَا رَأَوُا الْهِلَالَ، وَلَمْ تُهْلِلْ أَنْتَ حَتَّى يَكُونَ يَوْمُ التَّرْوِيَةِ. فَقَالَ عَبْدُ اللهِ بْنُ عُمَرَ: «أَمَّا الْأَرْكَانُ، فَإِنِّي لَمْ أَرَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَمَسُّ إِلَّا الْيَمَانِيَيْنِ، وَأَمَّا النِّعَالُ السِّبْتِيَّةُ، فَإِنِّي رَأَيْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَلْبَسُ النِّعَالَ الَّتِي لَيْسَ فِيهَا شَعَرٌ، وَيَتَوَضَّأُ فِيهَا، فَأَنَا أُحِبُّ أَنْ أَلْبَسَهَا، وَأَمَّا الصُّفْرَةُ، فَإِنِّي رَأَيْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَصْبُغُ بِهَا، فَأَنَا أُحِبُّ أَنْ أَصْبُغَ بِهَا، وَأَمَّا الْإِهْلَالُ فَإِنِّي لَمْ أَرَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُهِلُّ حَتَّى تَنْبَعِثَ بِهِ رَاحِلَتُهُ».",
                "headingArabic": "بيان أن الأفضل أن يحرم حين تنبعث به راحلته متوجها إلى مكة لا عقب الركعتين",
                "headingUrdu": "صراحت کرتے ہوئے کہ احرام باندھنا بہتر ہے جب آدمی سوار ہو کر مکہ مکرمہ کی طرف روانہ ہو جائے، دو رکعتوں کے بعد سیدھے نہیں۔",
                "headingEnglish": "Clarifying that it is better to enter Ihram when a person's mount sets off with him, heading towards Makkah, not straight after the two rak'ah",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10383,
                "hadithNumber": "2819",
                "englishNarrator": "Ubaid bin Juraij reported:",
                "hadithEnglish": "I remained in the company of 'Abdullah bin 'Umar bin al-Khattab ( رضی اللہ تعالیٰ عنہ) its twelve Hajjs and 'Umras and I said to him: I saw four characteristics (peculiar in you), and the rest of the hadith is the same except the case of Talbiya. There he offered the narration given by al-Maqburi and he stated the facts excepting the one given above.",
                "hadithUrdu": "میں نے عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ کے ساتھ بارہ دفعہ حج اور عمرے کیے ۔ میں نے کہا : اے عبد الرحمٰن !میں نے آپ میں چار چیزیں دیکھی ہیں اور اسی کے ہم معنی حدیث بیان کی مگر ( تلبیہ بلند کرنے کے ) قصے میں مقبری کی روایت مخالفت کی ، ان الفاظ کے بغیر روایت بالمعنی کی ۔",
                "urduNarrator": "مجھ سے ہارون بن سعید الایلی نے بیان کیا، ہم سے ابن وہب نے بیان کیا، مجھ سے ابو صخر نے بیان کیا، ابن قسیط نے عبید بن جریج سے روایت کی کہا",
                "hadithArabic": "حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، حَدَّثَنِي أَبُو صَخْرٍ، عَنِ ابْنِ قُسَيْطٍ، عَنْ عُبَيْدِ بْنِ جُرَيْجٍ، قَالَ: حَجَجْتُ مَعَ عَبْدِ اللهِ بْنِ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللهُ عَنْهُمَا، بَيْنَ حَجٍّ وَعُمْرَةٍ، ثِنْتَيْ عَشْرَةَ مَرَّةً، فَقُلْتُ: يَا أَبَا عَبْدِ الرَّحْمَنِ، لَقَدْ رَأَيْتُ مِنْكَ أَرْبَعَ خِصَالٍ، وَسَاقَ الْحَدِيثَ، بِهَذَا الْمَعْنَى إِلَّا فِي قِصَّةِ الْإِهْلَالِ، فَإِنَّهُ خَالَفَ رِوَايَةَ الْمَقْبُرِيِّ. فَذَكَرَهُ بِمَعْنًى سِوَى ذِكْرِهِ إِيَّاهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10384,
                "hadithNumber": "2820",
                "englishNarrator": "Ibn 'Umar (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) pronounced Talbiya in Dhu'l-Hulaifa as he put his feet in the stirrup and his camel stood up and proceeded.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم جب رکا ب میں پاؤں رکھ لیتے اور آپ کی اونٹنی آپ کو لے کر کھڑی ہو جا تی تو آپ ذوالحلیفہ سے ( اس وقت ) بلند آواز میں لبیک پکا ر نا شروع فر ما تے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے علی بن مسْهر نے بیان کیا, عبید اللہ نے نافع سے انھوں نے ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی فر ما یا",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ عُبَيْدِ اللهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ رَضِيَ اللهُ عَنْهُمَا، قَالَ: «كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِذَا وَضَعَ رِجْلَهُ فِي الْغَرْزِ، وَانْبَعَثَتْ بِهِ رَاحِلَتُهُ قَائِمَةً، أَهَلَّ مِنْ ذِي الْحُلَيْفَةِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10385,
                "hadithNumber": "2821",
                "englishNarrator": "Ibn 'Umar (رضی اللہ تعالیٰ عنہما) reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) pronounced Talbiya as his camel stood up.",
                "hadithUrdu": "اللہ کے نبی صلی اللہ علیہ وسلم نے اس وقت تلبیہ پکارا جب آپ کی اونٹنی آپ کو لے کر سیدھی کھڑی ہو گئی ۔",
                "urduNarrator": "مجھ سے ہارون بن عبداللہ نے بیان کیا، کہا ہم سے حجاج بن محمد نے بیان کیا، انہوں نے کہا کہ ابن جریج نے کہا اس نے مجھ سے کہا صالح بن کیسان نے نافع سے انھوں نے ابن عمر رضی اللہ تعالیٰ عنہما سے روایت کی ، وہ بتا یا کرتے تھے کہ",
                "hadithArabic": "وحَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللهِ، حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ: قَالَ ابْنُ جُرَيْجٍ: أَخْبَرَنِي صَالِحُ بْنُ كَيْسَانَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ رَضِيَ اللهُ عَنْهُمَا، أَنَّهُ كَانَ يُخْبِرُ: «أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَهَلَّ حِينَ اسْتَوَتْ بِهِ نَاقَتُهُ قَائِمَةً».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10386,
                "hadithNumber": "2822",
                "englishNarrator": "Abdullah bin 'Umar رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "I saw the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) riding on his camel at Dhu'l-Hulaifa and pronouncing Talbiya as it stood up with him.",
                "hadithUrdu": "میں نے اللہ کے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ آل ذوالحلیفہ میں اپنی سواری پر سوار ہو ئے ۔ پھر سواری آپ کو لے کر سیدھی کھڑی ہو گئی تو آپ تلبیہ پکا ر نے لگے ۔",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، کہا کہ مجھ سے یونس نے ابن شہاب کی سند سے بیان کیا, سالم بن عبد اللہ نے خبر دی کہ عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ نے کہا",
                "hadithArabic": "وحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَنَّ سَالِمَ بْنَ عَبْدِ اللهِ، أَخْبَرَهُ أَنَّ عَبْدَ اللهِ بْنَ عُمَرَ رَضِيَ اللهُ عَنْهُمَا، قَالَ: «رَأَيْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ رَكِبَ رَاحِلَتَهُ بِذِي الْحُلَيْفَةِ ثُمَّ يُهِلُّ، حِينَ تَسْتَوِي بِهِ قَائِمَةً».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10387,
                "hadithNumber": "2823",
                "englishNarrator": "Abdullah bin 'Umar (رضی اللہ تعالیٰ عنہما) reported",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) spent the night at Dhu'l-Hulaifa while commencing (the rites of) Pilgrimage and he observed prayer in the mosque.",
                "hadithUrdu": "اللہ کے رسول صلی اللہ علیہ وسلم نے ( سفر کے ) شروع میں ذوالحلیفہ میں رات گزاری اور وہاں کی مسجد میں نماز ادا کی ۔",
                "urduNarrator": "مجھ سے ہرملہ بن یحییٰ اور احمد بن عیسیٰ نے بیان کیا، احمد نے کہا: ہم سے انہوں نے بیان کیا، اور ہرملہ نے کہا: ہم سے ابن وہب نے بیان کیا، مجھ سے یونس نے بیان کیا۔ ابن شہاب، جس کے بارے میں عبید اللہ بن عبداللہ بن عمر نے ان سے بیان کیا, حضرت عبد اللہ بن عمر رضی اللہ تعالیٰ عنہما بیان کرتے ہیں کہ",
                "hadithArabic": "وحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، وَأَحْمَدُ بْنُ عِيسَى، - قَالَ أَحْمَدُ: حَدَّثَنَا، وَقَالَ حَرْمَلَةُ: - أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَنَّ عُبَيْدَ اللهِ بْنَ عَبْدِ اللهِ بْنِ عُمَرَ، أَخْبَرَهُ عَنْ عَبْدِ اللهِ بْنِ عُمَرَ رَضِيَ اللهُ عَنْهُمَا، أَنَّهُ قَالَ: «بَاتَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِذِي الْحُلَيْفَةِ مَبْدَأَهُ، وَصَلَّى فِي مَسْجِدِهَا».",
                "headingArabic": "الصلاة في مسجد ذي الحليفه",
                "headingUrdu": "ذوالحلیفہ کی مسجد میں نماز پڑھنا",
                "headingEnglish": "Praying at the Masjod of  Dhu'l-Hulaifa",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10388,
                "hadithNumber": "2824",
                "englishNarrator": "A'isha (رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "I applied perfume to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) before he entered upon the state of lhram and (concluding) before circumambulating the (sacred) House.",
                "hadithUrdu": "جب رسول اللہ صلی اللہ علیہ وسلم نے احرا م باندھا تو میں نے احرا م کے لیے اور آپ کے طواف بیت اللہ سے پہلے اھرا م کھولنے کے لیے آپ کو خوشبو لگائی ۔",
                "urduNarrator": "ہم سے محمد بن عباد نے بیان کیا، کہا ہم سے سفیان نے بیان کیا، زہری کی سند سے, عروہ نے عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی انھوں نے فر ما یا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبَّادٍ، أَخْبَرَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ رَضِيَ اللهُ عَنْهَا، قَالَتْ: «طَيَّبْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِحُرْمِهِ حِينَ أَحْرَمَ، وَلِحِلِّهِ قَبْلَ أَنْ يَطُوفَ بِالْبَيْتِ».",
                "headingArabic": "استحباب الطيب قبيل الإحرام في البدن واستحبابه بالمسك وأنه لا بأس بيقاء وبيصه وهو بريقه ولمعانه",
                "headingUrdu": "احرام باندھنے سے پہلے عطر لگانا مستحب ہے اور مشک کا استعمال مستحب ہے اور اگر اس کی چمکتی ہوئی نشانیاں باقی رہیں تو کوئی فرق نہیں پڑتا۔",
                "headingEnglish": "It is recommended to apply perfume just before entering Ihram, and it is recommended to use Musk, and it does not matter if its glistening traces remain",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 10076,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=403",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=401",
                "label": "401",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=402",
                "label": "402",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=403",
                "label": "403",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=404",
                "label": "404",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=405",
                "label": "405",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=406",
                "label": "406",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=407",
                "label": "407",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=405",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=405",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=403",
        "to": 10100,
        "total": 40465
    }
}